{
    "0": "This is one of the best films of all time, without a doubt. I challenge anyone to watch this film and not be touched, if you can, you have no heart!James Stewart is one of my favourite actors, and in this film he acts so naturally you even forget he's an actor playing a part, you really believe his story. You're pulled on a roller coaster of emotions throughout this film, and by no means is this a light hearted look at life, as many believe. This is not a rose tinted look at the wonderful life we have, this is a dark, downtrodden start to a film where the lead character is about to commit suicide.However, it is a beautiful film, and is one of the few that you can watch again and again and walk away with the same glowing feeling as you did when you first watched it.",
    "1": "One of the best family movies I have ever seen, the storyline is amazing and puts hope in your heart. When the movie is over, when you feel useless in life, watch the movie and your thinking will change and you will know that you have a positive impact on the lives of the people you know. The events of the film were fun. The characters of the film were good. Two characters were prepared, James and Clarence. They were very interesting characters and I really enjoyed watching them. The end of the film is one of the best movie endings in history. I recommend watching it especially the black and white version. The black version is better than the color version. It's a Wonderful Movie",
    "2": "I am so glad Frank Capra had a vision to make \"It's A Wonderful Life\". I'm glad he chose Jimmy Stewart to play George Bailey. There are some little gems in life that help make life pleasant. It is not officially the Christmas season without watching this little gem. The supporting cast is perfectly matched. Donna Reed is wonderful as well as all the characters of the town. This would be a great movie, even if it were not in a Christmas setting. The holiday flavor makes it even more charming and memorable. A angel trying to get his wings is a little far-fetched, but Capra pulls it off. The impact of living a good life cannot be underestimated. What would life be like for your family if you had never been born? Our actions do speak loudly. In an age of 9-11, we need this movie more than ever. The values of \"It's A Wonderful Life\" still hold true today. Yes, I'll say it, it's a wonderful movie.",
    "3": "Review edited and therefore quite choppy due to maximum word limit.   Has there ever been a truer and more heartfelt character than George  Bailey? This is a man whose life is one of great significance, but he,  like all of us, does not always realize that this is so. He does not  recognize his impact on the world until an angel erases his existence  like chalk on a board. It is then that he is hit by the fact that one  man's failing life isn't always as inconsequential as it may seem.  We all remember when Clarence (Henry Travers) first appears on that  snowy bridge and saves George Bailey (James Stewart) from committing  suicide. He explains nonchalantly that he is an angel and George is  incredulous--until Clarence wipes away his entire past. His mother  doesn't recognize him. George tells her about his uncle as a source of  belief. She states that his uncle has been dead for some time, now.  The best scene in the entire film is that following when George is  thrown out by his mother. He runs towards the camera in an intense wide  shot, his face registering emotions of fear, horror, and ultimately the  horrid understanding of what has happened. This role is the highlight  of James Stewart's career--he never came anywhere close to the superb  performance he gives in this movie. There is a reason it was his  favorite film he ever starred in.  Stewart's portrayal of George Bailey is the grown image of all of us:  As a child he dreamed of nothing but exotic locations and adventurous  travels to foreign lands. But now he is a family man, a father and a  husband. He has left behind his silly bachelor notions, but they still  come back to haunt him. Bailey owns the town savings and loan, left to  him by his father. The cranky Mr. Potter (Lionel Barrymore) wants  complete monopoly over the town, and all that stands in his way is  Bailey and his little bank. But Bailey, an inner disgust and hatred  towards Potter brewing since his childhood days, refuses to cave in and  give it all away.  Then one day, George's absentminded and quite eccentric uncle (Thomas  Mitchell), misplaces a large sum of money, leaving George hopeless and  Potter with a serious advantage. After blowing up at his wife (Donna  Reed) and kids at home, George gets drunk at a local bar, is scorned at  by a schoolteacher's wife, and left dazed and confused, walking through  the snowy town at night during the happy Christmas season without a  hope in the world. Battered and delirious, thinking back over his  apparently pointless and wasted life, he contemplates suicide. He prays  to God and wishes that he had never existed. Which is why Clarence  comes down from heaven to sort things out and answer his prayer.  Essentially bombing at the box office when it was first released, and  then proceeding to fall into copyright problems for years, \"It's a  Wonderful Life\" resurfaced only years later when it was brought back  into the public domain circa 1970. When other channels were airing  expensive Hollywood movies during the Christmas season, PBS picked up  the film and played it as a counter attack, a weak hope prevailing in  them that the classic film buffs out there would tune in. They did. And  so did families across the nation. Every year the ratings got stronger  and stronger and now, almost sixty years following the movie's initial  release, it is considered a holiday tradition.  George considers suicide as a way of escaping his problems without  really thinking over the possible outcomes given his final choice. He  looks back upon his life as wasted potential; he wanted to become an  adventurer, break his family's small-town tradition and become  something huge. Mentally scanning his life to the point in time when he  stands on that bridge, George Bailey believes that he has simply and  truly created a waste of space. He's ready to end his (assumed)  pointless life when his entire point of view is wholly altered by the  power of God. George suddenly realizes that though he never lived out  his boyhood fantasies, he did so much more than he ever dreamed of. He  saved his brother's life, which resulted in a huge impact in later  years; he made an influence in the lives of others and brought peace  and harmony to an otherwise small town by prevailing at the requests of  Mr. Potter; he married a beautiful wife and had children, all of whom  will no doubt have some measure of significance later in the world. And  his wish on that bridge was that he had never been born.  Often I am asked to name my favorite movie, and though I ignore  requests and state that I have not seen every existing movie and  therefore my judgment carries no significance, I have the lightest  whimsy that \"It's a Wonderful Life\" may be my favorite motion picture  to date. I cherish few other films just as close, but to me, \"It's a  Wonderful Life\" is more moving than \"Casablanca,\" a better study of one  man's life than \"Citizen Kane,\" and a movie that will live on in the  hearts and memory of viewers long after we are gone. I believe that  this is the definitive Americana motion picture, regardless of how I  compare it to my other favorites, which may carry the same weight but  not the same true significance. Few films come as close to the heart as  \"It's a Wonderful Life.\" And few films come as close to \"It's a  Wonderful Life\" at all, for that matter.  5/5.",
    "4": "When I heard about this movie for the first time, I thought it was just a forgettable and funny movie. But I was wrong. I saw this movie last Christmas and I did not find it funny, but I loved it, though! Everything is so great in this movie. The story is amazing. The characters are great, and the character's development is fantastic! the cinematography is grea, and the acting is fantastic. James Stewart was mind blowing. The whole movie is amazing,touching and encouraging. You cannot describe how good this movie is. Nor can you describe how good the message is.This is the best feel-good movie ever. It's a life changing movie, actually. It makes you feel good to be alive. Do me a favor and watch this movie as soon as possible! When you're sad, think about the message this movie delivers, because you will get a smile on your face! I'm 14 years old. My English is not very good, but I hope this review was useful!",
    "5": "If there's one movie I probably haven't watched enough times, it would be \"It's a Wonderful Life\". The characters, the situations, the message all come together in a way that intrinsically defines it as a Christmas movie, but when you get right down to it, the film transcends Christmas in a way that's truly heartwarming and magical. Jimmy Stewart had that unique ability to put the Everyman into his roles, and this picture certainly qualifies as one of his finest performances. Donna Reed could not have been a better choice to play Mary, displaying a wholesome sex appeal to go along with those traditional home town American values that pictures of the era were so skillful in portraying. Had Director Frank Capra made only this one picture, it would have earned him recognition as one of the true masters of cinema. I could go on and on, but there's really no point in trying to heap further accolades on a picture that has earned it's place in American film right at the top. Watch it, and watch it again, and in taking the picture's message to heart, reach out and help an angel earn it's wings.",
    "6": "Frank Capra's 1946 drama/fantasy IT'S A WONDERFUL LIFE is one of the best-remembered films of all time, and it's no surprise; this moralistic tale of human suffering, poverty, greed, courage and determination is one that resounds through the ages, particularly so in our modern age of fat-cat bankers and a growing gap between rich and poor.James Stewart gives a dependably decent turn as George Bailey, a family man who finds himself at the mercy of Lionel Barrymore's criminal banker, Mr. Potter. What follows is lengthy and often profound, an occasionally twee but ultimately moving exploration of the human character and the effect one man can have on his world.What I particularly liked about IT'S A WONDERFUL LIFE is the way that every part of the narrative hangs together without any unnecessary extras. Even the little bits like the accident on the ice at the outset later come back to haunt our characters. It's very well written, and expertly directed by Frank Capra; an unashamedly old-fashioned, heart-warming and sentimental piece of movie-making on a grand scale. I'd even go so far as to call it the ultimate Christmas film.",
    "7": "This is basically my only Christmas tradition movie. I have to watch this every Christmas or else I would go nuts. James Stewart really steals the scene with his acting and beautiful charm. He was great in every movie I've ever watched him in. It is wonderful, it is funny, it is touching and it is human.",
    "8": "In looking at this glorious Christmas classic, it's easy to get so involved in the psychology behind it. we obviously become so caught up in our own lives that we often forget about how others around us have influenced who we become and vice versa. This film, which has been redone in many different forms, including taking popular characters from TV shows, both daytime and nighttime and putting them in the same situation as Jimmy Stewart, truly stands the test of time. Not only is it watching one man's slow destruction from things that seem to be beyond his control, it's seeing how one person can deal with the ruthless machinations of the pure evil around him and open the eyes of everybody else to see what's really going on.In a return to the Christmas theme that he earlier used in 1941 classic \"Meet John Doe\", director Frank Capra saves the seasonal Twist of the story for the film's last half-hour. An unseen angel is sent to a small town to aid a possible suicide victim when the actions of the greedy and evil Lionel Barrymore threatens to send him to prison for embezzlement. Stewart's life is seen in flashbacks for much of the film, but when the film joins the present day, it is almost like it has gone some 70 years into the future to today with Barrymore representing the truly evil Scrooge like banker who wants to control everybody's life.It is quite a shocker to see Barrymore playing such a nasty, evil man after playing the kindly Dr. Gillespie in the series of MGM medical dramas. he is basically expanding the role of Scrooge which he did on radio for many years and adds an essence of true malevolence to his characterization. Even Scrooge wasn't as crass as his character here. It seems to be a continuation of the role that Edward Arnold played so beautifully in Capra's earlier films \"Mr Smith Goes to Washington\" and \"Meet John Doe\".The lovely Donna Reed crosses over from MGM ingenue to classy leading lady, adding much depth to her role of Stewart's girlfriend, later wife, with Beulah Bondi saintly as usual his lovable mother. (Bondi played Stewart's mother in so many films and on TV that it is obvious that somehow in real life, he did call her ma.) Then there's Gloria Grahame as the town flirt, Thomas Mitchell as Stewart's rascal uncle, and of course Henry Travers as Clarence, the angel who desperately wants his wings. The smaller roles are filled out by many familiar actors, some of whom were in pretty much every Capra film, as well as Danny Mummert and Larry Simms, both from the \"Blondie\" series and Karolyn Grimes, an underrated child star who stole many movie programmers in the mid-1940s.There are so many other things to credit for this film's excellence beyond the cast and direction, namely the brilliant script, fast pacing and brilliant production design. This film holds up regardless of whether you see it in its original black-and-white form or it's decently restored colorized version. I'm not in favor of colorizing classic movies, but somehow this one actually came out all right. while I watch this one every other year rather than every year, I can say that I am continuously touched and discover new seems in its that I had not seen before. It is no wonder that this is on nearlt everybody's list of the top Christmas movies of all time.",
    "9": "Even though it is nowadays considered one of the best christmas movies ever, It's a Wonderful Life was not always seen that way. People at the time thought it was barely mediocre, and that it would probably be forgotten about in a year or two, but 70 years later it has endured. So why is this? At first, I didn't really know whether or not I should consider it a christmas movie, because it does have the aesthetic of the holiday, but a big middle portion of the film doesn't really have a holiday feel to it. In fact, it's actually pretty depressing. I think this movie is constantly remembered as one of the best because it has a very original idea. The story is about a guy named George Bailey (Jimmy Stewart), who intends to kill himself on Christmas Eve because his life is turning into a disaster. An angel is sent from heaven in order to show him how even though he might not realize it right now, his life has meaning to others. Before the angel, Clarence, decides to interfere in George's life, we are shown the events that happened throughout his life starting with his childhood. We see how as a 12 year old in 1919, George is sledding with his brother Harry but falls into a pool of ice water, costing him the use of one of his ears for the rest of his life. We also see how George is lusted after by a young girl named Mary (Donna Reed), who later comes back into his life during his time in college. Sadly, George's father dies soon after, and Mr. Potter (Lionel Barrymore), wants to dissolve George's father's former business now that he is dead. George, with the help of his uncle Billy, run the company now. Under George's direction, his company builds Bailey Park, which is a housing project designed to challenge Potter's control of the town. Potter even calls George into his office and offers to make him his assistant for almost half a million (modern) dollars, but George declines, knowing his real objective is to shut down his father's business. Later on, World War 2 is underway, and George is not drafted because of his partial deafness. His brother Harry becomes a fighter ace and shoots down a japanese plane that was about to bomb a transport ship. Billy goes to rub in Potter's face the fact that one of his relatives is a war hero, but inadvertently misplaces a huge amount of money in Potter's office. A bank examiner then calls out George's company on the missing money, and George realizes he's now in serious trouble, possibly facing jail time. He tries to figure out where in the world the missing money could be, and takes out his bad mood on his innocent family members in the meantime, since he is now married to Mary. Desperate, George heads to Potter in order to surrender his life insurance policy to him to make up for the lost cash, but Potter tells him he's calling the police anyway. George runs away and eventually comes to a bridge, where he sees someone drowning in the freezing water below. After diving in and saving him, it's revealed that the man is Clarence, George's guardian angel, but George doesn't believe him. He says he wishes he never existed, and the angel grants this wish. George's town is now called Pottersville, there's crime everywhere, and nobody (even his own family members) recognize him anymore. He learns that Bailey park is now a cemetery, and George finds that his brother Harry is dead, drowned in a lake at age 9. This means all the men on the transport ship in ww2 were killed, since Harry wasn't there to rescue them. George even sees his wife Mary, who's now a librarian, but she doesn't recognize him either. Now convinced the world is horrible without him in it, George pleads with Clarence to give him his old life back. It does come back, and George rushes home to eagerly await being arrested. Just when it looks like he is actually going to be taken into custody, the townspeople pull through and show up at George's house to make up for the missing 8000 dollars. George also receives a final thank you note from Clarence, saying that he finally has wings now because he was able to successfully help George. What a wonderful movie. It isn't everyday when I watch something that is worth seeing every holiday season, but now that I've seen this, I can completely understand its legendary reputation. Everything about this film is great. There's way too many aspects of it that are worthy of praise, so I'm not going to go over all of them. I will say though that the acting is truly worthy of a classic movie, and both Stewart and Donna Reed live up to their reputations. As George, Jimmy Stewart is an anxious, depressed person who doesn't know what his next move is going to be. He's shown to love Mary a lot, but is more frustrated the longer the film goes on by the threat of Potter blackmailing him. He takes his hate out on his family who simply don't deserve it. He knows he shouldn't, and he feels bad that he did, so he mistakenly assumes that by just literally dropping dead, he would be doing the world a favor. Clarence later shows him how wrong he is. Donna Reed as Mary is the love of George's life ever since he was a kid. It's clear to see why she hates to see him so bitter, especially around christmastime. Lionel Barrymore as Potter does his job really well. He's everything you want to see in an antagonist. He always belittles George and makes him feel unimportant, and intends to make life really difficult for him by closing down his company. Even Gloria Grahame shows up at one point. In my opinion, this is an odd holiday movie because there is a big portion of it that doesn't feel like christmas, but the second half of it makes it worthwhile. It reminds me a lot of A Christmas Carol, because Scrooge sees how horrible his world will be if he doesn't change, and so he decides to become a better person. To be clear, It's a Wonderful Life truly earns its praise as not just one of the best christmas movies, but one of the best movies, period. Capra really did know how to make films.",
    "10": "This iconic classic, made by an acclaimed director and featuring a stunning cast, is truly one of the greats.It somewhat resembles the dark classics such as Dicken's Scrooge or Körkarlen, but behind all the gloominess and darkness is an upbeat and positive note that makes it an inspiring and teardropping experience.Everything from the acting, cinematography and effects are of course great, and it's sure to be a joy every time you watch it!",
    "11": "This is what one would call a genuine feel-good movie, especially if you're looking to get into the Christmas spirit with loved ones! The humor in this film still works and the main actor James Stewart puts on a great performance. One of the best black and white movies I've seen!",
    "12": "George Bailey (James Stewart) is at the edge of financial ruin. He thinks his life has amounted to nothing and is about to jump off a bridge. An angel named Clarence is assigned to give George a second chance by showing him what if he was never born.This is an unabashed sentimental tear jerker. The movie starts with George's life as it is. His dream is to travel the world, and create great monuments. He is constantly dragged back to the unimpressive little Bedford Falls and the family Savings and Loans. He is a good guy who constantly does the right thing.This is classic Frank Capra. The nice guy struggles but always win in the end. This sentimental melodrama is especially fitting for the Christmas period, and derives its iconic status from the constant showing during those times. The failure in its original run is a long forgotten memory.",
    "13": "An absolute classic of ever there was one. A movie that, thankfully, transcends being a \"Christmas movie\". If you removed the minuscule reference to Christmas you would still have the classic as it is today. A film about caring for your neighbour and your neighbour is everyone. A film about sacrifice for those you love and even your community at large. It won't make you rich in money but it would make the world a better place. Never forget the YOU, like George Bailey, matter. You matter to more people than you know. It's a Wonderful Life if you can see that.",
    "14": "I've seen this film at least 20 times over the years and it never fails to move me. It Is so relevant more than seven decades later. Our wonderful nation could very well face the same future that Mr. Potter wanted to inflict on Bedford Falls. Amazing how its basic premise of redemption and good winning over greed resonates in 21st century America.The older I get the more emotional this film makes me. It is simply that good.",
    "15": "Many often cites the best films of 1940s as Citizien Kane, Casablanca, The Great Dictator, etc. These are great movies, but It's a Wonderful Life surpasses them all unrivalled. It's a Wonderful Life is a truly great movie and I, like many others, have a habit of watching this movie very year on Christmas Eve, so I am this year. From where to start, this is from music, acting, screenplay, camera, directing, scenery, plot to adorable little details (squirrel on Uncle Billy's shoulder) the wonderful movie. The film tells the wonderful story about everyone beign worthy of existence and that the abscence of someone would make a big hole in the existence. I can't put into words this film and all its wonderfulness, but that's why I watch it and enjoy in this.",
    "16": "'Every time you hear a bell ring, it means that some angel's just got his wings'. That is the quest for the guardian angel, Clarence Odbody (Henry Travers) when he was assign to take care of a suicidal man named George Bailey (Jimmy Stewart). Clarence must try to show George, the tremendous impact he has had on his community before it's too late. Can Clarence, change George's mind or will this Christmas, be the last for George Baily? To find out, watch the movie! Made just after World War 2, this movie was a favorite for both leading man Jimmy Stewart and director Frank Capra. It's easy to see why. There's so much things to like, about this film. The film is full of delightful moments, from music and a dance sequence, funny comedy, and heart-warming romantic scenes. While, some critics might see this film as too sentimental and syrupy. In fact, in my view, most of the movie's vision is something out of a more modern complex, dark-edged sophisticated film. Yes, there are some really dated dialogue, sayings and behavior, but for the most part, I think modern audiences can still, watch this movie and find something about it, that they can related to. No matter how often, you get to see this Christmas favorite, there is always something timeless with this film, when you do. Important message about the value of an individual life and how one person's actions affect all those around him/her is a great life moral for people to take. Themes about family and friendship are also very important. Another great message is having faith, and belief in yourself and the future. After all, director Frank Capra himself said he made the film in large part to \"combat a modern trend towards atheism and Nihilism\". While, a lot of people say, that this movie isn't really a Christmas movie, due to the fact, that 90% of the movie is a story about George's life and takes place at some point in time other than Christmas; in my view, the whole Clarence arch, wouldn't had work as good as it did, on any other day of the year. There is something about Christmas, that makes the whole magically redemption story with Clarence somewhat believable. Based on the short story \"The Greatest Gift,\" by author Philip Van Doren Stern, It's a Wonderful Life was never intended to be the Christmastime staple that it is now. In fact, when the film was first released back in 1946, it was generally considered a box-office flop. This film had a resurgence for a while in the U.S. during the 1980s when it was discovered that the copyright on the film was never renewed, which meant the film was in the Public Domain and any television station could legally show it as often as they wanted without paying for a license. Many stations across the country would run it, around Christmas time, to the point, that people label it as a Christmas movie. No matter, if it's a holiday movie, or not. A lot of critics, has point out, that the film protagonist's action are very similar to a Christ figure in all. I have to say, they're somewhat right, but there were some moments that George Bailey got really problematic to sympathize with. Some people feel that brought all his problems on himself by choosing to run an over-leveraged, illiquid bank business even though he's given many opportunities to do something else. However, I didn't find it, too abrasive to watch. What I didn't like, is how he treat Mary Hatch (Donna Reed) for most of the film. He was a little too mean-spirited to her; mostly in the beginning of the film He nearly ruin his first date with her. I really didn't like that. Thank heavens, he got more likable, as the film goes on. Still, the drunk driving scene was a bit hard to watch. Anyways, Jimmy Stewart is wonderful as George. I'm glad, he didn't quit, acting after the war. He gives the performance of a lifetime, here. Alternately affable and bitter, he is the movie's little-man hero. All of his emotional were, mostly play as for real. Seeing this, Capra had to reframe the shot in order to get it closer than was actually filmed because he wanted to catch the expression on Stewart's face. At the time, this shot was an extremely time-consuming project, each frame had to be done individually, making it only one step away from stop-motion animation. Capra spent the whole night doing it. Thank Goodness, he did! Most of the supporting cast are just as good as Stewart, but one-person stands out. Donna Reed is wonderful, despite her character being a one-dimensional manic pixie dream girl. She was really able to show the character's beautiful, supporting and caring nature. Just say the word, Mary, and I'll lasso you, the moon, indeed! I just don't buy the idea that George and Mary are somehow supposed to be soulmates. It's a bit unrealistic to think that Mary can only love George. Nor, do I believe, without spoiling it, that the ending of this film seen can be seem as \"happy\". After all, George is still in the same position he was before Clarence show up. An investigation is still looming. There are tons of others puzzling questions, still worth debating. So a rewatch, is needed. One thing, when watching it, is not to watch the color version. The black and white works well, to show the symbolic snow of the peaceful Bedford Falls, when compare to the cold and dark sleet of Potterville. It's better to watch that, since Paramount had all the grain removed in 2006. Overall: This well-known sentimental film is a masterpiece. Capra's Magnum Opus. A must-watch. So check it out.",
    "17": "\"It's a Wonderful Life\" is one of the Top Ten movies of all time. It's almost a perfect movie. I can't think right now of a reason why it's not a perfect movie. There must by a flaw in there somewhere but right now I can't think of one. It truly is a movie that gets better every time I watch it. I find new things to focus on each time I see it. Sometimes it's the dialogue. Sometimes it's religiousness. Tonight I focused on Jimmy Stewart. Wow, he gives a performance of a lifetime. As I watched him tonight, I wondered about Stewart losing the Best Actor Academy Award. Who beat him out? Fredric March in \"The Best Years of Our Lives\". March was great but I'd give the edge to Stewart. He's in almost every scene. It doesn't matter which way I approach watching \"It's a Wonderful Life\". It's one of the greatest movies ever made.",
    "18": "I just re-watched this film with my family as an annual Christmas tradition (first time on DVD though). I have to say, despite the 10-11 times i've seen this, it still holds up with magnificent strength and emotion. The scenes where Bailey has \"never been born\" with Clarence the angle and the triumphant concluding scene in Stewart's house where all his friends come to his aid are famous beyond comparison, but still are mesmerizing and emotional. What often is overlooked is the mountain of great dialogue in this film. Barrymore and Stewart have so many great lines-\"I'm and old man and most people hate me, but I don't like them either\"; \"Oh, why don't you stop annoying people!\"; \"Is it too much to ask that people can live their lives with a few nice rooms and a bath and not have to live in your slums? We need this run-down old building just so there can be somewhere people can go and not crawl to Potter.\" Jimmy Stewart gives one of THE performances of all time as the ultimate put-upon good guy George Bailey. All he wants to do is get out of Bedford Falls, travel the world and go to college. But, because of a string of coincidences and occurences where George puts others above himself, he ends up never leaving the town. Donna Reed is his loving wife Mary, who waits around for George to realize that he loves her. This situation leads to one of the most touching and romantic scenes on film, where as the plastic magnate Sam Wainwright talks to George and Mary on the same phone, they look into each other's eyes and you see the what they truly feel for eachother. George grabs Mary, saying \"I don't wanna get married to anyone anywhere at anytime\", but he is cut off in the middle of his speech by the emotion, and they embrace. Rob Reiner claims he can't watch or discuss this scene without tearing up. How Stewart and Reed didn't win Oscars for this scene alone is unthinkable. Also, Lionel Barrymore is great as the evil Mr. Potter (with his wheelchair pilot/crony, Potter is the predecessor to everyone from the Beatles \"Mean Mr. Mustard\" to Mr. Burns on \"The Simpsons\")-who you believe is just a mean old man at the beginning, but then when he gives his final major speech to Stewart you realize what a twisted and cruel monster he truly is. The director, Frank Capra, must also be given credit when praising this film. He directs the actors and frames them in such a way that the true relationships and actions between them are so much more meaningful. He really knew what he was doing when making this film. The make-up and lighting department also successfully show the wear of 18 years on the principle actors-this movie takes place with the same actors from the period of 1928-1946, and Reed's and Stewart's make-up jobs are extremely convincing. Some great moments: The close-ups of Stewarts face when 1.) He lears if he doesn't take over the Bailey Building and Loan, the board of trustees will vote with Potter and drive the institution out of business, and 2.) In the fantasy scenes, where he runs away from \"Ma Bailey's Boarding House\" and realizes that not even his own mother regognizes him. The speech Bailey gives condemning Mr. Potter after Pa Bailey's death and Potter's appeal to liquidate the Building and Loan. A young George Bailey reveals to the pharmacist Mr. Gower that because he was so grief-stricken over the death of his son that he put the wrong medicine in the wrong tablet, and the look from Gower when he realizes that if not for Bailey, he would have done a terrible, terrible thing (this moment always gives me goosebumps). The look of disgust and horror on Stewart's face after shaking Potter's hand after being offered a job, then wiping his hand on his jacket-symbolising his realization that if he had agreed to work for Potter, he would have been selling his soul to the devil. This scene is followed by the wonderfully tender moment between Stewart and Reed where he stares at her in the dark as she tells him she is pregnant. Capra's greatest gift to the common man, \"It's a Wonderful Life\" still holds up beautifully. It is a morality tale with a timeless message that no man is poor who has friends. It's the ultimate happy ending, and the ultimate Christmas story.",
    "19": "\"It's A Wonderful Life is another wonderful, beautiful, amazing, and unboring long movie, all of the perfomance is perfect, all of emotion in here is put very well, truly inspiration, highly recommended\"",
    "20": "Remains as one of the finest Christmas movies of all times. Humor, drama, hisyory, love and family; all in the spirit of Christmas. Seen it 40 times, and once more to start the season.",
    "21": "... arrived at our exit on the freeway and wondered, \"What if I just kept driving?\". That very modern - and yet timeless - feeling is at the heart of this film, before life was so complex, when the U.S. was dotted with small towns in which it was possible to be born, make a good living, and die, without ever leaving, save for military service.George Bailey is both an extraordinarily lucky and unlucky guy. He's unlucky because none of the plans he made for himself as a young man ever worked out - his loyalties to family and to his hometown always kept him pinned there. He's extraordinarily lucky because he has a wife and children that adore him. But one Christmas Eve when he is in his late 30's a crisis brought about by his uncle's stupidity is the last straw that causes him to wish that he was never born, and he gets that wish granted to him - to see the world as if he had never been born, and he does not like the view.It turns out over his life, George did a series of good deeds - some large some small - that changed the course of just about every life in his hometown. Basically, without the Bailey Savings and Loan, which without George would have collapsed in the 1920's at the death of his father, the only source of financing is Mr. Potter's bank, which makes Citibank look like a charitable institution. The town has thus been thrown into chaos, a place where alcoholism, prostitution, and broken homes abound. Now I could sympathize with George's horror at seeing the bad fate of just about everybody he knew save Mary, his wife. When George inquires about her fate he is told - \"You won't like it. She's an OLD MAID\"! Oh the horror! She in fact is the town librarian. To quote someone else on this subject - \"in a town thrown into chaos she's an educated woman with a job - what's the problem?\". Mary, before she even married George, is full of life and has a sense of style, but just subtract George from her existence and she becomes someone who dresses like a woman twenty years her senior and is deathly frightened of men? Pleeeease! Oh well, if I am going to watch the films of 1946 I'd better be prepared to deal with the values of 1946, but I digress.The fact is George probably WOULD have been better off without these ties that bind. He could have seen the world and done big things and slept like a baby without a worry. But the fact is he realized he cared about these people whose lives would be ruined without him, and that is probably why so many of us don't just keep driving when we hit our exit on the highway. We go home to the people we love and the problems that come with them.",
    "22": "one of memorable movies for profound humanistic message. one of films with the gift to be experience more than memory. charming for its simplicity and for the comfortable , protective status. a Frank Capra who could be easy his the best. because entire soft atmosphere, the joy, the crisis, the values, the humor are exposed at the right moment, in the right place and measure. a film about a man and his family. his dreams, projects. and his future. nothing original. but new each occasion to view the movie. because it is a classic in a special sense. not for the taste of old moments but as a moral lesson, very useful, for the present. a film who seems be perfect for the Christmas. in fact, it remains the perfect choice for every day.",
    "23": "I've watched this probably 6 times over the years and it's perfect at Christmas. Life affirming and relentlessly hopeful (and cynical) it portrays a world where people matter and life is worth living. Beautifully shot and acted, it's brilliantly written, even if the angel stuff can get a little clunky. Even after all this time, it still works and might even bring a tear to your eye. Watch it every year or so to feel replenished.",
    "24": "The storytelling, level of acting and pure emotion found in It's a Wonderful life is what separates it from almost any other film. Watching it, whether it is the first time or 50th time, reminds the viewer of the meaning and significance that was once ubiquitous in film. Movies in the modern day are largely filled with cheap thrills, one liners and constant stimuli. It's a Wonderful Life is the complete opposite. It tells a story that is so fundamentally important that it almost NEEDS to be told. The lessons that can potentially learned from watching this film are invaluable. The beautiful and talented Donna Reed gives one of, if not the best female acting performances I have ever seen, and James Stewart portrays George Bailey so well that it is hard to imagine separating the man from the character. Even some of the greatest films have flaws, but I am unable to find any with It's a Wonderful life, it is a bona fide masterpiece, and I believe any true cinephile would agree.",
    "25": "POSITIVES:1) James Stewart is flawless as George. He brings the perfect balance of charm, warmth and relatability to the role, whilst also being able to portray George's darker side just as convincingly. Nobody could have played it better\n2) The themes of the film are so universal that it makes it so engaging to watch. The tough choices in life and wishing you'd taken a different path is something everybody experiences, whilst it's also incredibly important to be thankful for what you have and to recognise all the positives of the life you lead\n3) The ending of this film makes me cry my eyes out. Seeing all the characters we've come to know throughout the film all coming together at the end to rescue George, a selfless man who has helped all of them in different ways, is just so heartwarming and uplifting and perfectly captures the Christmas spirit. I cry like a baby watching itNEGATIVES:1) The first half of the film unfortunately feels very slow. There is far too much buildup for me before George goes crazy and thinks about killing himself. I could've done with much less time spent on build up and much more time spent on George and Clarence going through the life where George never existed, as this element feels quite sped through. Scenes like George and Mary somehow falling into the pool, despite being nowhere near it and somehow not heading or noticing it, should've been cut out so that more time could've been spent with Clarence\n2) For a Christmas movie, it's a shame that the film doesn't even change to being set during the festive period until there's only around 45 minutes left. When watching this during the festive period, it's hard to resist the urge to just skip forward to when Christmas time actually starts in the film. As I've said in my previous point, I just feel like the film has far too much build up, even if the last act is brilliant\n3) It bothers me how George contemplating killing himself essentially starts from his Uncle's incompetence. I just feel like if this were real life there's no way the Uncle shouldn't feel shame for the rest of his life for being such a fool. I understand that part of the film is about George's selflessness and always helping others, but it also feels like he's just surrounded by fools at times and he's the only sensible one there.",
    "26": "George Bailey is a man with goals, ambitions - a man of courage, integrity and pride. But all he has ever done his whole life is assist those in need, never for a second thinking about himself. Wanting to see the world before he sets off to college for an architect degree, he finds that he can't let his town crumble against the miserable, hateful, greedy and powerful 'Potter' and so he decides to stay. His father passes away, and so he must find a way to run the 'Loans' business that his father has kept from the mad man 'Potter'. All goes well for Bailey - a beautiful wife, a few children and a lot of friends. Although still handing out loans like his father before him, he pursues his dream of building and constructs a home village with affordable houses despite Potter's mass influence on the township. Unfortunately for Bailey, things begin to point downhill following the Depression and later bankruptcy where Bailey just can't handle the weight of burden of all the people's money he cannot repay. He comes to the harrowing conclusion that he should never have been born and decides to leave his family and friends and take his own life off a bridge. But the world cannot dispose of itself such a man, so god sends an Angel on a mission to get its wings, or better yet to save George Bailey's life. The Angel shows George what life would have been like had he not been born at all and of what became of the people he took dearly. Miserable under Potter's absolute influence, the town looks like an over indulgent, over spent, money making machine. George gets a glimpse of his own powerful influence on his friends and family and realises just what a wonderful life he really had.Few films have portrayed the value (not the meaning) of life like 'It's a Wonderful Life' has. In contemporary times, we have been fed with recycled stories such as \"The Family Man\" and \"It can happen to you\", but none have captured the raw beauty of life like the original, \"It's a wonderful Life\"- its success partly due to its simplicity. And it sustains your attention from start to finish due to its simple and riveting storytelling. Sets aren't big, the story is quite small and the film is in black and white. What makes this film stand taller than others is the great dialog between the characters which consistently remains on the story throughout the film and not on irrelevant topics - this is what keeps us glued to the screen (unlike with modern films, most of the dialog is blabber about nothing). The acting is superb from the whole cast, but you have got to hand it to James Stewart for one of the best performances of his career portraying the discouraged George Bailey - arguably his best performance - and one of the best performances you will see in any film. What I really love about this film is the lack of music, which gives a sense of realism to the story, like we are there with the characters in George Bailey's world.Frank Capra creates an unforgettable atmospheric experience that remains tattooed in your memory years after viewing. The outdated effects aside, this film has stood the test of time as a timeless classic. The direction was subtle and superb - rarely equaled and I think this film is best in Black and White, even though they already had color in 1939, seven years before this masterpiece was released.I recommend this film to anybody who feels down and depressed, sad and lonely. It really makes you think about the importance and beauty of this life in which you are living. All I can say is that I will be watching this film yearly until the day that I die due to its poignancy. A real classic in cinema history. It really is a wonderful Life!",
    "27": "No other film comes anywhere near to getting people to find out what things would have been like if an event had or had not taken place - Groundhog Day comes close (my second favourite) and Sliding Doors tries.For sheer emotion this film has the lot. I have watched it over 40 times now and I still get tearful towards the end of the film. If anyone wants to find out why life is worth living, this is the one to watch.",
    "28": "Really it is about George Bailey's struggle as everything in life that keeps passing him by but his younger successful brother Harry keeps on thriving.As that he has too much of a heart of gold there. That will not give up nor say no. Even canceling his own honeymoon there. While he becomes miserable as an angel named Clarance watches George nearly kill himself there.Clarence in hearing George wishes he never was born finally \"gets his wish\" as he is going to be arrested for stealing money there that the mean old antagonist Mr. Potter in trying to ruin George.Had George not lived it would had been Pottersville with clubs and x-rated movies the kind of town that nobody would ever wanted and it was prevented due to George's big heart.You do not have to be rich in money. But rich in love and how George put others first prove that the real loser is Potter and he will have to answer to his maker there. For all the wrong he did.While George helps Clarance get his wings after second class as George wins back his life, his family, and loved ones saving him from prison.One of the best holiday films ever. For all generations to come. As it was a flop originally but later on it became such a huge Christmas hit.",
    "29": "This film is deeper than it may seem and so much more depressing and dark than generations seem to have caught on to.Jimmy Stewart does not end up with A \"wonderful life.\" He owes money, gets upset, disowns his kids, gets some \"help\" from a plot device Angel, and then is told to suck it with a smile after being shown a thinly veiled sociological interdependency argument. Otherwise, the film tells us that if you have friends and family, you're rich, and not being around has ripple effects on everyone.Capra is actually showing us that we are all owned and force fed religious and hyper optimistic ideals, so that the rich and war profiteers can own cities at a time.What a wonderful life.",
    "30": "Wonderful acting with an outstanding story, if only its possible to show this movie to everyone who is feeling down at the moment because of financial issues.People sometimes forget that small good deeds always pay off and that's always better to be known as a nice person than a bad person no matter what.",
    "31": "The premise of the story is, of course, how a man named George Bailey keeps sacrificing his money and his desires all his life to help others in various ways over the years, and when later in life he is finally overwhelmed by his latest problems which he cannot solve himself and is ready to commit suicide, an angel from Heaven whose eyes are upon promotion is sent down to tell George about how all his self-sacrificing had saved so many people from disaster.One can nitpick about various things in the movie: reading a Bible, there are references to cherubs and seraphs, angels whose status in Heaven is indicated by the number of wings they have; the fact that George, despite his frustrated ambitions, didn't do too badly-he has a nice wife and children and is not living in poverty, and not being eligible to serve in the military would not necessarily be considered by some people (including people who had) to be a bad thing.My problem, though, is this-it turns out that Bailey has lots of friends because of all the good he had done, and they're willing to pay him back to get him out of his financial hole and save him from jail. Unfortunately, in real life self-sacrifice, especially excessive self- sacrifice, does not necessarily result in gratitude from those one had sacrificed for. They might necessarily take your actions for granted and in fact might regard you as a slave, which all too often happens in real life. Once your purpose is served, the sacrificer is discarded and forgotten, or even despised. And that, alas, would have been the far more credible ending.",
    "32": "This story gets me every time. The themes of gratitude, family, and self worth are timeless and touching. It also has messages regarding materialism, and how money and \"things\" aren't really what's important in life. Despite George's failed dreams, he still touched people's lives in ways he couldn't measure until his guardian angel showed him. It's a beautiful reminder of what really matters in life, and the remastered color version looks really damn good. This movie is legendary and should be mandatory annual viewing.",
    "33": "Finally, at the age of 38, I saw \"It's A Wonderful Life\" in its entirety (after catching a few minutes here and there over the years on TV). When it was over, I found myself puzzled over why this movie is considered such a classic.I am not talking about the acting, or the film's technical proficiency. All of that seemed fine, even well-done at times. I am talking about its reason for being: Its story.I'll assume you have seen it, so prepare for spoilers. The basic message of this movie seems to be that a man who never left his home town to pursue his personal dreams nevertheless led a wonderful life due to his kindness and caring for the town and its residents. In fact, when he finally reaches a low point, the town's residents come to bail HIM out, thereby proving what a wonderful person he has been.A nice story, but the movie misses two logical points. First, was the man who never pursued his personal dreams (George Bailey) HAPPY with the life he DID lead? If he was happy with staying home, helping people afford houses and bailing out his family's business, then the point of the movie is MOOT. He evidently gave up very little for a happy life. Other than a few wistful asides, we never see that George is bothered much that he didn't travel the world. He seems perfectly content where he is. So if he is happy, then the central message of kindness and helping others while sacrificing your own dreams is weak or lost entirely.Second, if a man spends DECADES helping out residents of his little town (most of whom remain residents over the years), I don't see it as any great act of charity that when the man needs monetary help, all those people he assisted over the years are willing to give him a few dollars to fix his problem. The climactic ending, when people line up to give George 20 bucks here and 75 bucks there, is made to look like some kind of incredible holiday miracle. But think about it: If a man made it possible for YOU to buy your first home (in an era when buying a home was truly a dream), and a few years later he needs some money for his business (which is the entity that helps so many local people) to survive, wouldn't you go donate whatever you could afford to help him? It wouldn't even have to be that painful, really, in a town with several thousand residents.No, I think the town's true colors are shown earlier, when George's business almost goes under due to a run on the banks and his customers are more than happy to run to his competitor's bank to get 50 cents on a dollar. Some people end up staying ONLY after George uses his own WEDDING MONEY to pay them a fraction of what they sought to withdraw (which, when you think about it, is no real risk ... they can always go to the competitor later if things get worse). THAT seemed to me to also be normal behavior by the local residents, and it was not celebrated like the ending is.Maybe some people were impressed with the plot device of an angel showing George what life might have been like without him. Maybe that was the first time that had been done in a movie, for all I know. But I found that device not unlike the ghosts who visit Scrooge, and that tale was written long before It's A Wonderful Life was made. So I don't get that, either.There were some fun moments, and who doesn't like Jimmy Stewart. But a revered classic? I guess I don't get it. I gave it a 5.",
    "34": "Never gets old and is forever young like the Wizard of OZ. Saw it first in the 1970's. Decided not to watch it since the turn of this century, but recorded it and re watched it at the end of 2020. George Bailey is still relevant in our time.\nPottervilles run by corrupt megalomaniacs still exist. that includes Bloombergsville where I have lived all my life. Bailey stands up for the common man, oppressed by the Potters of this world.\nThe acting is top notch and this story has stood the test of time.",
    "35": "A sentimental fantasy tale is turned into a beloved masterpiece by Capra's assured directorial expertise and a perfect cast; a Christmas classic ever since.I watch it every Christmas, and it hits every time again.",
    "36": "Frank Capra's peak,this movie influenced a lot of directors and ,unlike some of his other works such as \"you can't take it with you\" ,it is as fresh today as it was 60 years ago.Capra's detractors criticize his eternal optimism but even that is questionable:What would have become of the town,had the hero taken his own life?Was there only one just man ,like in Sodom in Genesis ,to save the city from the impending fall?It brings into question the so-called trust Capra puts in the human race.It's not a rosy world.The scenes between James Stewart and his guardian angel are so powerful you cannot hold back your tears.No other artist told us that ALL human beings were important in such a wonderful way.And nobody depicted the yuletide spirit like Capra.",
    "37": "Why yes I do cry like a baby over it's a Wonderful Life: every time. That ending is such a huge release after such as a dark and depressing alternative reality. I'm always left shaken up by it and need a break before I can watch another movie as well as making me want to make amends with loved ones. I'm sure everyone who watched It's a Wonderful Life thinks to themselves what the world would be like if they were never born. The struggle of George Bailey is relatable to a wide spectrum, and I know for myself it really hits home. Being stuck in a dead-end town and feeling you will bust if you don't get away from it; having your life not going the way you intended it to while your siblings appear to be doing so much better than you. But in at the end George Bailey realises what he's got when it's all gone, above it all, God's greatest gift. It's a Wonderful Life takes placed in a world in which God exists (and can focus his time on this one person over the rest of the world, but I digress). I've never felt however for It's a Wonderful Life to have a religious agenda, it's merely just a plot device for the film's fantasy elements.Lionel Barrymore's performance as Henry F. Potter I feel is a tie between his brother John's roles in Twentieth Century as the best performance from the Barrymore clan. Potter is one of the biggest douche bags in movie history; the archetype evil business mogul and ripe for comparisons with real-life figures. Not only has he no charitable side, he directly steals money in order to destroy his competition. Unlike other screen villains, Potter does not get any comeuppance at the end of the film, although you could say he's destiny as a sick, frustrated and lonely man who hates anyone that has anything he can't have is punishment enough. Potter isn't a total caricature though, he is more three dimensional than that. He's a man who knows how to conduct and run a business and understands that high ideals without common sense could ruin a town. But George Bailey is no fool, he is a natural born leader, even if he doesn't realise it. He stands up to Potter without giving it a second thought, runs a building and loan which is a real estate empire itself; even his father states to him that he was born older than his brother.Moments like the makeshift honeymoon suite in the broken down house which they later make their own or the recurring gag with the mantle at the end of the stairway represents the kind of writing which elevates It's a Wonderful Life above the majority of other movies. Like the greatest of films, you notice something new on every viewing. Likewise, nobody can do moments of intimacy like Frank Capra, the movie is full of scenes in which it is simply two actors talking with no background music, yet creates raw human emotions like no other. Take a scene such as George and Mary walking through a neighbourhood at night while George talks about his ambitions for the future, the rest of the world ceases to exist. Many will be quick to put down Capra's work as so-called \"Capracorn\" or as Potter puts it, \"sentimental hogwash\". Get off your high horse and stop thinking you're above such emotion - cinema is about the manipulation of emotions.It's hard not to feel sentimental for the representation of small-town America on display. Bedford Falls itself is a town full of interesting and unique characters. It actually reminds me of The Simpsons. Potter himself is essentially the town's own Mr. Burns in The Simpsons - the people of Springfield hate Burns but are dependent on him for their energy needs. Likewise, the people of Bedford Falls hate Potter and would be dependent on him for their housing if it wasn't for the competition of the Bailey Building & Loan.Due to its public domain status, the film was shown on some TV networks in 24-hour marathons. I'd happily watch one of those networks as I can't stop watching It's a Wonderful Life no matter what point in the movie I begin. Could you get a more perfect marriage between actor and director than James Stewart and Frank Capra? Collaborating on a perfect trilogy of films, with each one better than the last. It's a Wonderful Life? It sure is.",
    "38": "I could never talk enough about how wonderful this movie really is. Jimmy Stewart is such a darling. I love everything about this movie. The acting, the town, the story, the ending... just goes on and on. It's a movie that makes you feel so much and ponder what your purpose is here and how you have changed history with your presence.",
    "39": "Sorry, this film just doesn't move me (and I cry a lot at movies). I find it long-winded, heavy-handed and rather preachy. It takes an awfully long time and a sledgehammer to get its message across. And I have little patience with the old conceit of an angel coming down from heaven to show us the way (\"Here Comes Mr. Jordan,\" \"Heaven Can Wait,\" \"Stairway To Heaven,\" \"The Bishop's Wife,\" \"Forever, Darling,\" the list goes on). For a more touching look at the meaning of Christmas, and certainly a more concise one, see Twentieth Century Fox's 1952 anthology film, \"O'Henry's Full House.\" Henry King's episode, \"The Gift of the Magi,\" has Jeanne Crain and Farley Granger portraying newlyweds whose well-intentioned sacrifices backfire, but teach them (and us) an important lesson.",
    "40": "This film is a impressive movie. Firstly, it happens unhappy things. But happiness comes, finally. I realize that the most important thing in our life is friendship. In addition, consideration. If people have consideration and kindness, and act of kindness, people will be rewarded someday. I think that god doesn't betray great person. God looks people. Also, people look great person, too. After experiencing pain, happiness is waiting absolutely. If we do everything whole- heartedly, result follows us. This movie makes us realize that what is important in our life and life is wonderful if we spend the valuable life.",
    "41": "...but not a great movie, and certainly not one of the greatest of all time.  I realize you can't say that without being accused of kicking kittens and other atrocities, but that's the way I feel.  Sorry.I mean, really: \"Every time a bell rings, an angel gets its wings\"??  Puh-leez.  If a Robin WIlliams movie were made today with such a line -- not to mention the cartoonish characters, the sappy plot, the false sentimentality -- it would be laughed out of the theaters.  Are we supposed to make allowances because this movie was made back in 1946 when they didn't know any better?  Believe me, they knew better.The only reason to go out of your way to see this movie is that Drew Barrymore's great-uncle Lionel is in it.  You should always show respect for Drew Barrymore.",
    "42": "Three-time Oscar-winning Hollywood filmmaker Frank Capra made one of the greatest Christmas movies of all time \"It's A Wonderful Life\" starring James Stewart, Donna Reed, Thomas Mitchell, and Lionel Barrymore. This warm-hearted Yuletide yarn about life in the small town of Bedford Falls and its protagonist George Bailey (James Stewart), who wages an eternal war with a despotic, Ebenezer Scrooge-type banker Potter (Lionel Barrymore), personifies the idealistic spirit of American enterprise. Basically, the theme Capra's movie explores is the individual does matter in our society. The ultimate value of any movie is its capacity to stand the test of time, and this memorable Capra-esque fantasy has succeeded splendidly in this respect. Initially a box office washout because it barely recouped its $3 million budget, \"It's A Wonderful Life\" (1946) didn't languish long in obscurity. Incredibly, the Capra film acquired a new lease on life when National Telefilm Associates mysteriously neglected to renew its copyright in 1974. Consequently, tv stations aired this family friendly film ad nauseam until Republic Pictures intervened in the 1990s and renewed the copyright. Now, most critics have acclaimed Capra's film as a timeless Christmas classic. Ironically, Christmas doesn't play an integral part in the plot until over half of its absorbing two-hour plus running time has elapsed. Meantime, as its altruistic hero, George Bailey epitomizes America's competitive spirit and crusades tirelessly to spare honest, industrious Americans, largely immigrants, from the autocratic few who would subjugate them without scruple. Of course, life has changed radically since this Oscar-nominated film came out. Nevertheless, its message of compassion and humility in the face of heartless cynicism and material exploitation has survived. Unlike too many Christmas movies which venerate the occasion strictly for consumerism run amok, \"It's A Wonderful Life\" tackles one tough issue most of these sugar-coated narratives shun. Suicide sullies the minds of the less fortunate during the holidays, but Capra and his screenwriters treat it in an imaginative manner.George Bailey never set out to be a savior. He has suffered his own share of setbacks. He risked his neck when he rescued his younger brother Harry from freezing to death after the latter had fallen through thin ice on a frozen lake. George and his friends were straddling shovels on the ice when this calamity occurred. Sadly, George lost the hearing in his left ear because he courageously saved Harry. Eventually, the Draft Board would exempt George from serving in uniform during World War II. Meantime, George joined his long-suffering father, Pa Bailey (Samuel S. Hinds), who managed a small potatoes Buildings & Loan Association. George's father aggravated Potter to no end because he defied the affluent patriarch. Most 'crawled' as Pa would complain to appease Potter. Rather than see citizens pay outrageous rents to occupy Potter's shoddy housing, the older Bailey secured low-interest loans for them as well as cozy homes. George had dreamed of shaking the dust of his one-horse hometown, tour the world, and attend college. Sadly, Pa succumbed to a stroke, and the Building & Loan Association looked doomed to shut its doors. Sacrificing his dreams George decides to step into the breach to persevere in his father's age-old fight against the greedy Potter. Winning is no picnic for our hometown hero. George teeters on the brink. At one point, he contemplates suicide after an outside bank examiner spots an $8000 shortfall in his books. As it turns out, one of George's clerks, Uncle Billy (Oscar winner Thomas Mitchell of \"Stagecoach\"), mislaid the eight grand with the best intentions!\nCapra and scenarists Frances Goodrich, Albert Hackett, and Jo Swerling, working from Philip Stern's original story, paint our hero into a corner. Mind you, Uncle Billy made a dreadful mistake when he tried to ridicule the despicable Potter in his own bank. Clumsily, Billy snatched Potter's newspaper from him. Little did Uncle Billy realize he had stashed the envelope with George's eight grand into the folds of the newspaper he had taken from Potter and then returned! Predictably, when Potter discovered Uncle Billy's blunder, he kept the eight grand and his mouth shut. Interestingly, as the villain, Potter never faces punishment. At this point, fearing scandal, prison, and humiliation, George boozes himself into oblivion, crashes his ancient jalopy into a tree, and staggers onto a snowy bridge where he contemplates suicide. The chilly waters roiling beneath the bridge offer an unsavory promise of peace and solitude that George entertains momentarily as a solution to his misfortune. Earlier, Potter had planted the idea in George's head when our hero sought the banker out in desperation for a loan to cover his cash shortfall. Now, we feel as woebegone as George. In a twist of fate, our hero's dreams have degenerated into a nightmare, and the river beckons to George as a refuge from his predicament.Just when our hero could sink no lower, unseen voices from Heaven dispatch Clarence (Henry Travers), an elderly angel who wants to win his wings, to save George. Suddenly, the tragedy in \"It's a Wonderful Life\" turns tragicomic when Clarence appears as a welcome source of comic relief. Clarence spoils George's plans about making the lethal plunge. Afterward, George regrets being born. Clarence cooks up a clever scheme to alter George's attitude. He reveals what Bedford Falls would have been had George not been born! Not only is George shocked to find the town renamed Pottersville, but also that his brother drowned in the ice pond! So appalled is George by everything he sees that he decides he'd rather be born, if only to thwart Potter's wicked whims. Donna Reed co-stars as George's faithful wife Mary Hatch who shares his joys and sorrows. Meantime, Lionel Barrymore chews the scenery as a despicable villain who never gives George a break. Juggling suicide with slapstick, Capra keeps us entertained from fade-in to fadeout with this unforgettable fable. In interviews about \"It's A Wonderful Life,\" Capra hailed it as a celebration of the individual.",
    "43": "This movie is brilliant in all forms - Great cinematography, outstanding performances, especially James Stewart who deliver's a timeless performance and of course the storyline is absolutely flawless with one of the greatest endings in cinema historyI rate this film so high because never ever have a movie made me so happy. I literally can't stop smiling when thinking of this movie.10/10.",
    "44": "Have seen this film many times--and never tire of it. But this is not a Christmas film!! Christmas is only in the last 20 minutes!!\nIt is a drama--often becoming like a long Twilight Zone episode. James Stewart gives\nthe best performance of his entire career.\nThe supporting cast is marvelous. This film never fails to move me deeply.",
    "45": "This movie is absolutely incredible it's a wonderful life it makes me emotional it makes me feel so happy it's just an absolute incredible film and I think Jimmy Stewart is absolutely fantastic in the movie it's an all-time Christmas classic it's great.",
    "46": "I once read that It's A Wonderful Life is the holiday gift for all time. Never a truer statement has been made about one of the most popular films to have ever been made.The Plot is a simple one that has since been regurgitated and trundled out almost yearly it feels like. James Stewart plays George Bailey, an all round swell fella, who because of a number of life's circumstances finds himself forever a resident of Bedford Falls. Here he is the principal guy in the running of the family Building & Loan business. When a substantial amount of money goes missing during the run up to Christmas, Bailey finds himself at the mercy of family nemesis, and nefarious town banker, Mr. Potter {Lionel Barrymore}. But George, tipped over the edge by an incident involving the bank funds, has an idea that taking his own life would greatly improve the fortunes of his family and the family business. But as he stands at the precipice of death by suicide, George is saved by his guardian angel Clarence {Henry Travers} and given the chance to see what Bedford Falls would be like having not had George Bailey's influence.Few, if any, directors have rivalled Frank Capra when it comes to successfully portraying the human heart on screen. It's A Wonderful Life is Capra's masterpiece. Rightly so, it is unashamedly sentimental, but also it's rich with the directors faith in community spirit and a belief in the strong bond of family love. The story is loosely worked from \"The Greatest Gift,\" a Phillip Van Doren Stern story that he had sent to his friends as a Christmas card. Aided on screen writing duties by Frances Goodrich & Albert Hackett {Dalton Trumbo is in there sometimes too}, Capra fashioned an ultimate feel good movie that is flecked by sheer darkness and disconcerting \"life is tough\" undertones. It's most likely that the more dark side of the film, and the wait for Christmas cheer, is what made It's A Wonderful Life a flop on its release. The film made a huge loss, tho not quite as gargantuan as many today believe, and was quickly consigned to the forgotten bin. But annual yuletide repeats on television over the following decades garnered it a cult following. A cult following that eventually swelled to a near universal one, to the point that now Christmas just wouldn't be the same without it. It is by definition, the ultimate comeback movie.Tho all the cast are superb {special mention to Donna Reed as George's wife, Mary} it's Stewart who leads the way in the class stakes. As he drifts from homely, lovable dreamer, a man sacrificing those dreams for others to benefit. To his descent into despair and the undertaking of a nightmarish odyssey, Stewart captivates in every frame, and more telling is that he is believable with each transformation of George's state of mind. However, when all is said and done, it's with the ending that basically the film rewards those who have trusted in Capra and Jimmy. It's an ending warm enough to melt the coldest of hearts. So see it with someone you love {always nice to have someone else to cry with} or introduce it to the poor souls who haven't seen it yet. Either way, it's here to stay forever the timeless classic that it so most certainly is. 10/10",
    "47": "I can't believe that this masterpiece is from 1946. So futuristic,so perfect!!!",
    "48": "Wow. This film was amazing. Showing how a man, George Bailey, an innately good person, go through all that troubles, all that heartache to reach out and help others really made me feel a pang in my heart.From utter sadness to sheer happiness, this film really made me feel the whole spectrum of emotions. I'm embarrassed to say that this film left me grinning from ear to ear. The acting combined with the plot, made for a really enjoyable movie. The actors perfectly captured the emotions of the characters of the movie without over exaggeration. And the thing that seals the deal was the ending. The perfect ending to an already outstanding movie, showing the true importance of friendship, how one's life touches so many others, really blows my mind how good it was.As perfect as this film was however, there were some things I do wish were changed. E.g. The ending could have been lengthened a wee bit for it felt a little rushed at the end before he transitioned from not existing to existing again. Still, this is completely overshadowed by the greatness of the movie and thus I leave it at a solid 10/10",
    "49": "Christmas Eve 1945, in Bedford Falls, New York, George Bailey feels his life has been worthless and is on the verge of suicide. When his prayer for help is heard in Heaven, an angel, Clarence Odbody, is assigned to help George by showing him how much better the lives of those around him are because of his life.Frank Capra's charming, thoughtful, Oscar nominated classic is a film loved by critics and viewers alike. James Stewart is on top form - how can an actor express so much without words? - with fine support from Henry Travers as Clarence and Donna Reed as George's wife. The greatest Christmas film and arguable the best film ever.",
    "50": "Despite the age of this movie, the story of the movie is an incredibly marvelous one. The story of how one often underestimates his/her own life especially under sickening burdens.The flow is quite a slow on the start, up to three-quarter parts of the movie. But it picks up at about the last half-hour and builds up a fast paced yet long and detailed finale.There are also things to compensate, regarding the age of the production, such as the color, the spoken accent which sounds quite stupid for the current times. But besides those, I think the story is a strong one that it helps the movie overcome those obstacles.",
    "51": "As undeniable classic in every imaginable way. It's A Wonderful Life is the feel good Christmas movie above all others, despite the fact it paints a fairly depressing picture. It tells us not to take life for granted, and that we shouldn't be so selfish as to assume our life is for our own benefit. It clearly highlights how Jimmy Stewart's life has influenced all those around him. As his life takes a nosedive and his dreams go unfulfilled he begins to lose all hope. Other than the necessary schmaltzy ending, the film is well grounded in reality and avoids insincere sentiments. Capra's wonderful handling of the material make this a surprisingly gripping film, one that may climax at Christmas, but can be watched anytime of year.",
    "52": "Any movie that you watch once a year and it still summons the same feelings as the first time you saw it, that's a classic.\nOne of the best movies of all time.",
    "53": "I didn't have high hopes for such an older movie. At first, I thought there was no way I could enjoy something so outdated; however, I was wrong. This movie was amazing, and had a storyline that I think can be applied for centuries of Christmas times to come. My favorite part of this film was when the main character George Bailey was stuck in a town where he did not exist. He kept trying to find all the people from his life that were most important to him, yet no one knew him. Feeling isolated made him crazy, and he wanted his old life back. The lesson of this movie is to not take life for granted and that even if it doesn't seem like it at the moment, you do have an effect on others. I give this movie a 10/10. I would recommend this movie to anyone who likes a classic film, a christmas movie, or a sturggling person.",
    "54": "This isn't the first time I've seen \"It's A Wonderful Life\", but it still leaves me cold. And it's primarily because the Dickensian \"what-if?\" hook that redeems George Bailey in the end isn't enough to make up for the brutal treatment of that character up until that point. I know that's a minority opinion; my family thinks I'm nuts. But look, Bailey's a dreamer, brimming with a youthful ambition that gets snuffed out time and again by his obligation to Bedford Falls. Sure, there's a message here, that he protects the town from predatory capitalism, but to see the man struck down by one cruel twist of fate after another is beyond frustrating; and the payoff feels cheap in comparison.This is a classic for a reason, and who knows, maybe I'll grow into it. But as it stands, its charms are wasted on me.6/10",
    "55": "If this is simply one of the best films ever made. It's the story that does it",
    "56": "I have seen this film several times now, and the first time it really had me suckered. George Bailey really did have a wonderful life, after all. His wonderful friends and family got together to do a wonderful thing for him in his time of trouble. And Clarence got his wings... pass the Kleenex, quick!Then I started to think: George Bailey never got to travel the world and fulfil his potential to be a great architect. All his dreams faded and died as he struggled to run a business and raise a family. And what thanks did he get? His father dropped dead and landed him with the family business. His brother sold him out by getting married to the boss's daughter and landing himself in Easy Street. His uncle makes him liable for a larceny rap by losing thousands of dollars. OK, friends make up the shortfall and even the bank examiner joins in the goodwill, but - back in the cold, real world, maybe in January - George would still have to explain where the money had gone. If he couldn't do that he would still be seen as an embezzler of company funds. And meanwhile that nasty, villainous Mr Potter has got a nice little Christmas present - no sign of him making nice and handing it back.And then there's Pottersville - wow! Bars, music and women. A dance with Gloria Grahame - preferably a horizontal Mambo - would be worth any red-blooded man's hard earned cash, surely? (Ms Grahame played at my local UK theatre in 1980. She was still as sexy as hell and, apparently, a lovely person to work with.) Of course, you could always listen to the snow fall and watch 'The Bells of St Mary's' instead.So, from snuffling into my sleeve at first viewing, I am now horrified at the crabbed, stifled, thwarted, frustrated, cramped 'life' it tells us we should consider 'Wonderful'.",
    "57": "Based on the 1945 short story \"The Greatest Gift\" by Philip Van Doren Stern, this is a quintessential Christmas classic that I never saw before today. It is not only a wonderful life but a wonderful film. Its excellent script by Frances Goodrich, Albert Hackett and Frank Capra chronicles the triumph of the human spirit over adversity. The film serves as a reminder that the most important thing in life is other people and that no one is truly a failure so long as they have friends, which is the perfect Christmas message. I had never previously seen one of Capra's films but I was very much impressed by his direction and his superb handling of the material. I was expecting to love the film as I'm a big softie who loves old, sentimental films but I loved it even more than I thought I would.The film stars Jimmy Stewart in perhaps his best performance as George Bailey, a much loved institution in the small town of Bedford Falls who is contemplating suicide on Christmas Eve 1945. We are introduced to George as a 12-year-old boy in 1919 when he saves his younger brother Harry from drowning after he falls through the ice. In the process, he loses the hearing in his left ear, something which becomes symbolic of the sacrifices that he makes for others. For many years, he entertains the dream of exploring Europe and South America in order to escape the monotony of Bedford Falls where everyone knows everyone else. Over the years, he displays his propensity for selflessness time and time again. His dream dies a death and he never leaves home. On that fateful Christmas Eve, he comes to believe that he has accomplished nothing in his life. Thankfully, however, he is proved wrong after he wishes that he had never been born. Without knowing it, he has single-handedly prevented the town and many of its inhabitants from falling into darkness and despair. George is a great character who, in spite of being a thoroughly decent man, is not perfect as he falls victim to the same depression that anyone else in his position on Christmas Eve 1945 would. He thinks of himself before others but these scenes serve to humanise him. Except for Henry Fonda and Gregory Peck if he were a few years older, I don't think that anyone other than Stewart could have played this role so well.Donna Reed is excellent as George's incredibly loyal, supportive and understanding wife Mary Hatch Bailey, who has harboured a crush on him from the time that they were children. Although George initially does not seem to be interested in her and tells her that he never wants to get married, he realises that he is in love with her. Mary is a kind, somewhat shy woman who is a perfect partner for George. They are like two peas in a pod. She tells George that she would have ended up an old maid without him and this is proved to be the case in the reality where George was never born. I think that Mary could have easily married someone else in the other reality as I am sure that she would had her fair share of suitors but George was the only man for her and she was the only woman for him. Crucially, Stewart and Reed have great chemistry. The scene in which George and Mary are listening to the phone while standing very close together is one of the best romantic scenes that I have ever seen in a film. It is so simple but it works so well. Lionel Barrymore is suitably vile as Bedford Falls' wealthiest and most immoral citizen Henry F. Potter, a \"warped, frustrated old man\" who sees the Baileys as a thorn in his side. Consistent with the film's thematic links to \"A Christmas Carol\", Mr. Potter is similar to Scrooge prior to his redemption but I found him to be even more despicable. He is a great film villain who almost succeeds in crushing George's spirit, telling him that he is worth more dead than alive. He is not seen in the other reality but he has gained control of the town and has renamed it Pottersville, turning it into a den of iniquity. Henry Travers has very little screen time but he is fantastic as George's eccentric, whimsical guardian angel Clarence Odbody. His manner serves as a very effective contrast to George's depression before he realises that he has a great deal to live for. The film also features great performances from Thomas Mitchell as the sweet but scatterbrained Uncle Billy Bailey, H.B. Warner as Mr. Gower, Frank Faylen as Ernie Bishop, Gloria Grahame as Violet Bick and Todd Karns as Harry Bailey. It also features small appearances from Charles Lane, Carl \"Alfalfa\" Switzer and the future television producer Sheldon Leonard.Overall, this is a sublime film which shows that one man can make more of a difference to the lives of others than he ever through possible. I have to admit that I cried at the end. I honestly cannot remember the last time that I cried because of a film and I have watched over 500 in less than two years. I plan to watch this every Christmas season from now on. There is talk of a sequel in which Karolyn Grimes will reprise her role as George's daughter Zasu (now a guardian angel herself) but, since it is unlicensed, it is unlikely to materialise. In any event, I would not be terribly interested. Without Jimmy Stewart, what's the point?",
    "58": "This classic film opens with the voices of various people praying for George Bailey; it is clear that their prayers will be answered when voices in the heavens discuss how to help him. Angel Clarence will be assigned to save George but first Clarence, and the audience, must see how George came to be considering suicide. As a child George Bailey dreamt of getting out of the small town of Bedford Falls; he wanted to see the world, get an education then make his mark on the world. It wasn't to be though; he constantly sacrifices his dreams to help others. This leaves him stuck in the town running the savings and loan company that his father ran. It isn't a job he wanted but he does it anyway giving loans to people nobody else will help. This makes him popular with everybody apart from the miserly Mr. Potter who doesn't like to see the people who were paying him to rent slums buying their own houses. The years pass and George gets married and has children; he isn't rich but he is content; then one day Potter gets the opportunity to ruin George; thinking the only way he can help his family is to kill himself for the insurance we get to the point the film started. As he hits the depth of despair Clarence appears in his life and showed him just what the town would have been like if George had never been born; a miserably place full of bitter people lorded over by the odious Potter. When George returns he understands what good friends he has.I'd obviously heard of this film a long time ago but had somehow never seen it until today. I knew the film was considered a classic and think James Stewart was a fine actor so I had to watch it when it was on television. Now that I have seen it I ban see why it is held in such high regard. I was a little put off by the opening but once we started seeing George's life from the time he saved his brother's life when he was twelve till the very end I was engrossed. Stewart did a great job as George; the man destined to miss out on his dream each time it looked as though it would come true... even the moment he was about to go away on his honeymoon was ruined meaning he couldn't go. It isn't all disappointment though; there are many joyful scenes as George helps various people and falls in love and then marries Mary Hatch. By the end it is likely that the viewer will have shed tears of both sorrow and joy. If you haven't seen it yet watch it the next chance you get and if you have seen it I'm sure you don't need anybody else to tell you how good it is!",
    "59": "What can you say about this film that hasn't already been said? Modern audiences are in the main averse to watching black and white films. The fact it is still an incredibly popular film decades after it's release tells you all you need to know. It's a clever idea and it's great story that actually makes you think. The acting is superb and James Stewart is at his brilliant best. There are sad and uplifting moments in equal measure and an ending that leaves you thinking whether you should laugh or cry. If you are feeling a bit down then just put this film on and I guarantee it will make you feel better. Quite simply this is one of the best films ever made and only the most cynical misery will fail to be touched by it.",
    "60": "I'm a 51 years old typical Australian knockabout male and somehow throughout all my years have never seen this Movie before.After hearing about the best Christmas movies ever made on my local radio station I was blessed with accidentally seeing it was being shown on a little local tv station on Christmas night.Well it is most definitely one of the best movies of all time I have ever watched & I can't wait to watch it again (Christmas Eve)but please if it's shown on a commercial station then wait to watch it without adverts interrupting this classic piece of cinematography.All the human emotions are in play for both the characters and the viewer so if you haven't been blessed to watch it then jump on board as \"A Wonderful Life \"awaits you.",
    "61": "This is the best Christmas film ever made from Golden Globe winning, and Oscar nominated director Frank Capra. The film begins with seeing most of the past of George Bailey (Oscar nominated James Stewart), before going to the present day, Christmas Eve, where he, as a businessman is losing the plot of life, including living with his wife Mary Bailey (Donna Reed) and his kids. Also, Mr. Potter (Lionel Barrymore) is threatening George with asking for money and trying to tempt George into buying the Baileys business. When money goes missing, Potter won't help him (for being rude) and he has a fit with his wife and kids, he soon thinks about ending his life. Until he meets Clarence (Henry Travers), who calls himself an angel without wings, he can only earn them by helping George. To prove himself, Clarence grants George the wish that he never existed. When George goes back to town everything has changed, the twon is called Pottersville instead of Bedford Fals, members of his family are no longer around, and nobody recognises him, not even his wife. When George discovers how much of a difference he makes to the city he wishes to be back again. It is heart-warming when he is so happy to be back to normal and he ends up as a millionaire, and Clarence got his wings. It was nominated the Oscars for Best Film Editing, Best Sound and Best Picture. James Stewart number 12 on The 100 Greatest Movie Stars, he was number 3 on 100 Years, 100 Stars - Men, and he was number 13 on The World's Greatest Actor, George Bailey was number 9 (Hero) and Mr. Potter was number 6 (Villain) on 100 Years, 100 Heroes & Villains, the film was number 4 on The 100 Greatest Tearjerkers for the happy ending, it was number 8 on 100 Years, 100 Passions, it was number 37 on The 100 Greatest Family Films, it was number 10 on The 100 Greatest Christmas Moments, it was number 11 on 100 Years, 100 Movies, it was number 1 on 100 Years, 100 Cheers, and it was number 7 on The 100 Greatest Films. Outstanding!",
    "62": "To be honest before I watch It's a Wonderful Life, I really don't like James Stewart. I watched him in Vertigo, Rear Window, and other Hitchcock's movie, and I don't like him at all, I think he was so typical and 1 dimensional. After I watched him in this movie, I start to like him, especially when he acted in the last part. Well I guest I just hate Hitchcock as a director, not Stewart as an actor. Back to the movie, at first I don't like it because Stewart looks so older when he was playing as teenager Bailey -.-\". After half of the movie I don't really care, I guess I am such a sucker for Christmas family movie, the golden part of this movie is the last part after Bailey met the angel, Stewart showed that he is good actor in this part. In the end this is good family movie if you like Christmas film.",
    "63": "My favourite film of all time. George Bailey reminds you of what's important and what isn't. A film that still plays in cinemas 70 years later and which has been applauded at the end a number of times when I've watched it. We would all be happier if there were more George Baileys around and less Mr Potters; fewer Pottersville's and more Bedford Falls.",
    "64": "This is one of those movies that should be watched at least once every Christmas season. Well cast and acted. Good cinematography for the time. A story of what is really important in life.Bring your family around the TV and watch this one together and enjoy this movie.",
    "65": "Of course its sentimental, but whoever doesn't like this movie is a true Mr. Potter.",
    "66": "A true classic! Nothing more needs to be said. Be sure to watch it at least once.",
    "67": "Where can I start? Jimmy Stewart,who was a great serious actor in the Anthony Mann Westerns and the Hitchcock thrillers, here is nothing else than an idiot. And then, who can really see him as a high school boy when he was almost forty years old when he made this movie? Please!! And then when he is bankrupted by Lionel Barrymore and about to do away with himself, an angel comes to stop him and to show him how much the world owes to him (\"A Chistmas Carol\" updated, how nice!) and all of a sudden the whole town flows into his house to pay his debts and save the day. How nice of them too! Of course that could only happen in America, the earthly paradise where everybody loves their neighbour and life is beautiful. And they all lived happy ever after. One of the worst much-loved classics of all time.",
    "68": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his ... I Love That Decade When I Was In Preschool.",
    "69": "I have always heard about this movie as a Xmas classic (maybe because a clip is shown in Gremlins) and having watching it now, i agree: a bit like Scrooge, it's about a salvation in the holiday but unlike him, the guy is pure good while Scrooge is evil. For a movie fan, you will be happy because the movie has the same feeling as Spielberg comedies, it begins like Stand by me and ends like BTTF2: the nightmarish small town V2 is really well done. James Stewart looks like very much David Lynch and he is a true fine actor! The story is full of good values, hope and in addition is aware in punching greedy capitalism! So today you won't find a comedy so deep, so social while the situation would need urgently so have fun and a education with this one while you can!",
    "70": "This was a slightly ignored movie when it was made but due to a copyright lapse it has become a Christmas classic. And I must watch it every year on broadcast tv on Christmas Eve, with a mug of hot chocolate. All acting performances are on point, and every time I watch this I feel so good about myself and everyone I love. It's a good hour and a half of your life, try it!",
    "71": "Though this film is associated with Christmas because it has been shown at Christmas time, it is really a dark study of the insides of the human soul. George is driven to the point of wanting to die and wanting not even to exist. Frank Capra takes us through the life of a man so that we can see why someone would be willing to choose oblivion rather than existence. Then we see that, even though life may seem meaningless, we, like George, have choices and that these choices can make a great difference in the world even though we may not realize that fact. The film helps us to realize why we are alive. That is its real enduring appeal.",
    "72": "The dialogue is beautifully woven, everything thing means something, and mainly idyllic. It's like how after an argument you think what you should have said, they say that the first time around.\nThe humour is spot on. Everything from the Charlie Chaplin inspired slapstick to God's commentary over the movie lands.\nIt's the epitome of a feel good movie, and easily the best quality Christmas movie.\nThe dance scene and the final scene at the end makes you so happy, an exhibition in feel good movies.\nThe message of goodness always prevails is easy to understand but simplistically fun,\nThe sound editing and video quality are terrible but what more could you expect from 1946.",
    "73": "The late great Jimmy Steward play his part in this movie. When he was shown how life would be in a small town that he was living in without him.He through his different scenes in how the effects of his life with people who he cared about would fair without him being around and how he should appreciate living his life.",
    "74": "I`ve just read all the other comments about this amazing and everlasting classic, and there's nothing more to add. I really, really love watching classics, especially Stewart-Classics, 'cause he's in my eyes next to Robert Mitchum, John Wayne, Rich Widmark, Sean Connery and many others like Gary Cooper, Frank Sinatra or Burt Lancaster one of the greatest actors of all time.This movie, although produced simply, is THE Christmas story, which can be watched every year, by everyone. Stewarts great and breathtaking character-performance is so brilliant, none of our modern actors would be able to act in this classic style.10/10 with no doubts!Greetings from Austria to all American movie-fans!!!!",
    "75": "Rather late in the day - I'm 60 - I finally caught up with Frank Capra's 1946 feelgood morality tale.George Bailey (James Stewart), after a lifetime of putting his own wishes on hold in order to do the best thing for everyone else, finally cracks one Christmas Eve when his uncle carelessly misplaces $8,000, leaving the family business facing ruin. Seeing suicide as the only way out, it is up to probationary angel Clarence to pull him round by showing him the difference he has made to the rest of the world.Reading rather like an updated version of Dickens' A Christmas Carol, the first three quarters of this movie leads us in detail through George's life as set-up for the eventual climax. And the story works well, with Stewart, in one of his keynote performances, oozing decency and good humour throughout (except for the high contrast moments when he snaps).Yet there are weaknesses. The 90 minutes spent on George's life story is, perhaps, a little too long, given that its dramatic purpose is mainly to set up the differences in a world without George - it rambles. Lionel Barrymore's Machiavellian Potter is a little bit one-note in his pantomime villainy - you get the feeling that he wishes he had moustachios to twirl villainously while tieing damsels to the railway line. And, worst of all, for me at least, the film ends without the issue of Potter's malicious retention of the missing $8,000 being resolved.But these are minor quibbles with a film which deserves its happy reputation.The DVD transfer I watched was beautifully crisp and sharp, with sensitive colorization (being British, I would prefer to spell that \"colourisation\", but I sacrifice technical correctness in favour of accuracy).",
    "76": "The beauty of old movies (I think the version I watched on HBO Max was colorized) is that you can see a lot more of the production effort that goes into a film. For example, it's wicked to know that this film won an award for special scientific/technical effect involving a novel method of snow production (foamite, soap, and water highly pressurized then fanned out)! I thought that was cool. Regardless, the beauty of old films is that (due to budgetary constraints I think) shots are held for a lot longer. In my humble opinion, the fewer shots per scene (I would have to take data on this, but I think the claim would stand) allow one to become more emotionally invested and focused (aka not thrown left-right-left for a talking scene...I'm listening to people talk here, they're not getting 1-2 combo'd in the ring!). Now, onto IAWL specifically.The film is reminiscent to a lot of films I've loved and cherished recently (e.g. Little Women, Three Idiots) in that the film does not strive for visual audacity, but raw, untamed character driven nuance. And a film which focuses on the little things in life. What's wonderful (I wish I could capitalize that, but imdb would flag me) about this film is the galaxy opener--3 angels appearing in galaxy form discuss the life of one George Bailey. What's humorous (trying to think of a better word...perhaps revealing?) is that the film is simple (once you get to the end), but this simplicity is contrasted with a visual that alludes to some cosmic, quantum limit (blah blah--insert generic big word stakes here) profound truth; human truth is found in the simplest things in human interactions. Some might say the galaxy opener was to foreshadow the minimalist fantasy sequence to follow in which a life without George Bailey is visualized, but I prefer to have my liberal arts education take the reigns on my interpretation.I will note, in discussing large stakes, that the film's villain was the most jarring for me to watch. Perhaps this element of the film is truly where the age of the film is seen, but this villain (Potter) is so ******* evil because he is so banal. He's not kidnapping anybody or forcing some gun-blazing pseudo-high intensity emotional scene. He's not a villain for anything particularly nefarious other than being a greedy, selfish, egotistical dirtbag. As a result, I would argue (over a couple of beers or coffees with the mates) that Potter is one of the best (worst :) ) villains of all time.I like Jimmy Stewart a lot. Some of my favorite films are Vertigo and Rear Window. Jimmy gives his all in this film, and the film (as is seen by the end) is really only about his character, George Bailey. I like Capra's closeups of Bailey when he starts freaking out. Palpable anxiety.Most of this review probably seems like I'm going for some quirky remarks, or trying to keep the tempo upbeat. So, let me be perfectly clear and calm. This film is difficult to watch in certain points. Genuinely hard to not pause and take a few deep breaths (the poison scene induced by the death of the shopkeeper's son, George's \"dreams\" getting constantly pulled out from under him without any ability to counter, the lives \"lost\" were George not to exist); I want to not put the final remarks from Clarence in parentheses: the final note 'Nobody is a failure who has friends' really hurts to read. I even have difficulty writing out the statement. But, that's the whole point of the film, right? Clearly, this messages as relevant in 1946 as today, but...throughout life (as least in my experience), it's as if I (I'll just personalize it from here on in) constantly am fighting some half formed, ill begotten, lazy (but anxiety inducing) conception of what my life should be, what it could be or could have been (akin to George's exploring the world fantasies). I'm not endorsing the naive: \"don't explore and go out and try new things!\" perspective that some may take from the film. The whole point of the film is that life gives you constraints. Stop fighting them. There's no point, rather don't view them as constraints. Don't run from them. And stop imagining what life could be or should be; focus on loving the particular moment you are in. Odds are, there are a lot of those around you who love that you're there in the present (and not in some 'nobody fantasy' world) with them.",
    "77": "The irony of the title of one of Capra's bleakest films (along with his prewar 'Meet John Doe') has obscured the fact that like 'The Wizard of Oz' it flopped on it's original appearance and has only become a timeless, much-loved classic due to repeated Christmas screenings on TV.Capra had become so unhappy with postwar America he had to resort to fantasy, and the graphic depiction of H.B.Warner as a broken-down alcoholic and Henry Travers' line \"those men all died\" reveal the pain behind the upbeat title.",
    "78": "It's A Wonderful Life (1946): Dir: Frank Capra / Cast: James Stewart, Donna Reed, Henry Travers, Lionel Barrymore, Thomas Mitchell: One of the all time great films that celebrates life to the very core of presenting one's meaning through interactions with others. James Stewart plays George Bailey whose desire is to leave town and explore the world. His dreams are hindered when his father has a stroke thus leaving him in charge of the bank. His brother becomes a war hero, and he marries his high school sweetheart, played by Donna Reed. This is all observed by God and an angel named Clarence who is given Bailey's background through flashback observation before embarking on the moment where discouragement reeks him leaving him saying, \"I wish I'd never been born!\" Director Frank Capra is famous for films such as It Happened One Night and Mr. Smith Goes to Washington. This is his masterwork. Stewart brings out the innocence of an individual driven by good, while Reed plays off the dreamy romantic who believes that Bailey can lasso the moon with his determined nature. Henry Travers brings wholesome goodness as Clarence who is out to earn his wings. Lionel Barrymore plays the villain Mr. Potter whose greed knows no end. Thomas Mitchell plays the forgetful Uncle Bailey who misplaces a large sum of cash. It shows what life would be like without our existence. It would not be wonderful. Score: 10 / 10",
    "79": "The 1946 audience quite correctly stayed away in droves, making IAWL a box office flop. Generations later, after its initial failure, after public domain, after the not even born when it came out pseudo critics have somehow brainwashed almost everyone under 40 into believing IAWL is a Christmas classic, we must face the fact that IAWL is not only not a great movie, it's not even a good movie.Treacly, sappy, overlong, exasperatingly predictable fairy tale with just two good scenes and a main character devoid of interest, empathy or sympathy, IAWL is an exercise in futility at every turn. To begin, this is closer to James Stewart's worst performance than his best; George Bailey is a dreamer with his thoughts in the stars, rather than focused on the very big problem at hand. He's a naive, crybaby whiner with just the right mix of stupid to make him truly annoying to one and all. And he takes forever to realize Clarence is an Angel; I mean, how many miracles does it take?This turkey comes to life only twice - the scene between young George and the druggist, played by the always great H.B. Warner, in which George (brilliantly portrayed throughout by the underrated child actor Bobby Anderson) stops the grieving Warner - who has learned of his son's death - from dispensing a fatal dose of the wrong medication to an elderly customer; and the ending, which, while just as sugar-sweet as the rest of the movie, is so well crafted, it works wonderfully well, giving the film a 2 on the scale of 10",
    "80": "Simply one of the finest films ever made. It never ceases to completely floor me with emotion every time I re-watch it.",
    "81": "This is one of the truly great films to have ever been released in the post war era. The themes of wondering how different the world might have been if you weren't born is still a recurring theme in many films as well as television series, but this one really does it with a even greater poignancy than most that try to imitate it. However, the film really gives a great message that no matter how unimportant you feel, your life, for better or worse, touches each person that that you come in contact with. James Stewart is perfectly cast as George really show's why he is the perfect everyman in this film. Also, Donna Reed is wonderful as Mary, the love of his life. The two of them really convey the love that George and Mary felt for one another what made the relationship between the two of them special. I also loved the fact that it pretty much pulled no punches when dealing with what probably was the touchy subject of suicide. This film is truly one of the all time greats.",
    "82": "God forbid if they ever attempt to remake this movie in any way. I know they probably already have in different versions and ways of telling the story, but this is a movie that will never die. Like everyone else, I and my family watch this movie every Christmas eve. It's like a tradition in a lot of families who celebrate Christmas. The best thing about it, is that this movie never gets old. You know the story, you know what is going to happen every Christmas you watch this. But this movie has a very deep meaning to it that a lot of movies in the history of film DON'T have. Every Christmas eve I watch this it gets me in the perfect Christmas mood, and makes me forget about all the worries, problems, and struggles I have to put up with in life. This movie teaches me that everyone in the world can make a difference, and that everyone, no matter who you are has a purpose of existing. Even when its not the holiday season, I'll just watch a couple scenes of this movie just to put me in a good mood anyway. They just can't make movies like this anymore that teach you a very meaningful lesson. Even to people who don't celebrate Christmas can still enjoy this film. I can't wait for Christmas this year, for it is my favorite time of the year, and the time to be very happy in life.",
    "83": "A Christmas classic. This really should be watched every holiday season. It's just as emotional and entertaining every time.",
    "84": "This always gets to me, because in its way it seems so plausible: not the angel part, but the fact that life has some ups and plenty of downs, yet the committed goodwill of a single individual can have a cascading, snowball effect on people near and far. I guess that's karma, unadorned, and I believe that love is the closest thing to god the universe will ever know. The fact, even the possibility, that you can increase the net amount of love in the world is really about as good as it gets. No fantasy about it. It's real. It's just hard to do it consistently, and too easy to destroy what it takes a long time to build. So, building and loaning seems like a good way to go....Of course, one could go about this in a somewhat savvier way than Jimmy Stewart's character. Still, for such an uplifting and Christmas-y film, this certainly cuts close to the bone, and fortunately in a healing way. Even if there's no snow on my desert island, I'm bringing this one along.",
    "85": "Directed by Frank Capra, \"It's a Wonderful Life\" stars Jimmy Stewart as George Bailey, a young man living in the picaresque town of Bedford Falls. George has dreams of becoming an adventurer, of seeing the world and travelling to distant lands, but the impromptu death of his father forces him to become the manager of a local Building and Loan company instead. George takes this job to protect the inhabitants of his town from Mr Potter, a greedy banker who keeps local workers poor and unable to purchase housing.\"Life's\" first act watches as George matures, finds a wife and becomes a \"responsible\" member of his community. He also saves the life of a boy who goes on to become a decorated war hero, and positively touches the lives of countless other locals. Though he doesn't realise it, George is a saviour; the world is a better place because he exists. More importantly, the Building and Loan company he operates functions as a means of staving off commercial banks. The latter operate for private profit, for their shareholders, and with the ultimate goal of accumulating everything in Bedford Falls. The former, at least in theory, to do the bidding of depositors.\"Life's\" final act finds George accidentally misplacing thousands of dollars. Fearing a scandal, he attempts suicide. A guardian angel then intervenes, at which point the film becomes a retelling of Dickens' \"A Christmas Carol\". Here George is shown how life in Bedford Falls would have unfolded had he not been around to protect its inhabitants. Shown that he positively influenced the world, and so purged of all regrets, George aborts his suicide. The town of Bedford Falls then magically rallies around George, donating thousands of dollars to help save his Building and Loan company.Aesthetically, \"Life\" is a bit of a masterpiece. Snappy, carefully lit, and ambitious in the way it navigates time, the film also boasts beautiful Norman Rockwellesque sets. And then there's Jimmy Stewart. In another actor's hands, George Bailey would grate, but Stewart keeps Bailey lovable; a chirpy dude who chooses principles over personal desires and so whose life serves as a plea for social solidarity in times when fears make people selfish.On another level, however, Capra's film is devious as hell. Prayer, Christianity and \"good\" communal banks are positioned on one side, and fat individualists, capitalists and \"bad banks\" on the other. But George Bailey, the banker-populist who altruistically exists for community and for the working poor and who \"makes loans based on character and not credit\", has always been a dangerous myth. Perhaps the best summation of this was made by director David Mamet in an issue of Sight and Sound: \"George is as close as Hollywood can get to the notion of an equitable distribution of wealth: the reliance upon a person of character in a position usually occupied by the heartless. In this praising of individual conscience, we thus indulge a peculiarly conservative ethos: enlightened or compassionate conservatism. Such may pass muster as wish-fulfilling entertainment, but as a political aim it can be adopted only by the self-deluded. For if the worker has no power to demand other than as an appeal to conscience, he or she has nothing. And so the memory of the war and of the Depression waned and America voted for Ronald Reagan. His administration, in the fulfillment of a conservative erotic dream, broke the back of labour, and the voter was induced to vote for fantasy. And it was in those Reagan years that \"Life\" replaced \"Casablanca\" as the unofficial Favourite Film of America - the fantasy of the compassionate conservative.\" And so George becomes the type of hero common in John Ford's films. Never mind that replacing all banks with mutualistic Building Societies would still lead to poverty, unemployment, debts outpacing money in circulation and all the usual contradictions of capitalism. Never mind that, at every node of the network in even an idealistic world like Bedford Falls, value would still be reaped from the ignored energies of the low-paid, unpaid and natural resources, none of which appear in the accounting of production costs, but as invisible gains to capitalists. Never mind that George is essentially in the business of sub-prime lending and that if Bedford Falls didn't bail him out he'd have taken them down with him. No, like Ford's Judge Priest, George remains a beautiful impossibility; the upstanding, god-fearing, community-saving, benign wielder of power.And yet despite being goofy, overcooked and dumb, \"Life\" remains one of Capra's smartest films. The film's visions of Pottersville - a banker's paradise in which communities are destroyed in the name of The Almighty Dollar – remain prophetic. Also smart is the way the film shows how money alters relationships (Pottersville even pushes women into prostitution), breeds monopolies and systematically devalues everything decent that cannot be monetised. Also clever are the film's narrators, angelic beings whose perspectives imply that George has no free-will. George himself feels as though he has been repeatedly forced to stay and live in Bedford Falls. What George comes to realise, however, is that he has been choosing all along; he hasn't been a victim of fate, but has been making a series of very precise moral choices. In a contemporary America in which the average net worth of someone in their 20s is negative 39,000 dollars, in which over 75 percent of the populace lives paycheck to paycheck (nevermind that over 80 percent of the planet lives, and must live, in poverty), these are all quite timely, and even philosophical, themes.8/10 – From Capra would spawn Disney and Spielberg and then a whole slew of films (Minnelli, Sirk, Lynch etc) which attempted to counter such idealized visions of 1940s/50s America.",
    "86": "\"It's a Wonderful Life\" speaks the most universal truths about the kind of values humanity should stand for to make life that wonderful. It's Frank Capra's Christmas gift to Cinema and one of the all-time greatest classics. Indeed, what we use to define as 'classics' in the Cinematic Dictionary is probably the kind of movies that look and sound familiar to movie fans BEFORE the first viewing. And for me, the great classics as those we're familiar with before watching them and without this parameter affecting the magic of the first experience. We know that Marion Crane will be murdered; that Michael Corleone will become the Don, and that George Bailey will reunite with his family but it NEVER affects the enjoyment.I've seen enough parodies from \"Simpsons\" episodes or TV Christmas specials to know the very basis of Frank Capra's immortal classic, I even remember James Stewart's final wink from the movie \"Look Who's Talking\", and I was so aware of the film's plot that the first viewing probably consisted on spotting all the references I had. Not that it ruined the whole experience though but I didn't really grasp the inner greatness of the film until the second viewing, and now I do. Yes, it's very positive, very \"good-vibrations inducing\", something that definitely justifies its top spot on AFI's 100 Most Inspirational list, but there is more to that. There is more.You see, I've always thought the film to be a Christmas story and nothing else, expecting a 'message'; an obligatory happy ending established by the Family reunion, I expected that and well, I got it. BUT it's surprising how dark it really gets for a Christmas film and even by today's standards, 2000's TV specials can't elevate themselves to this gutsy change of tone. And James Stewart carries it quite spectacularly in \"It's a Wonderful Life\", powerfully transcending the initial atmosphere of the film. I would never have expected such genuine and authentic displays of sheer anger and Stewart is really scary here. I recall one line in Ebert's review where he regretted the colorization of the film precisely because it didn't visually fit these dark undertones. I can't imagine myself watching the film in color either.And Stewart's anger is very significant, because it illustrates the overall sentiment conveyed by his character, George Bailey, toward his life. The man considers himself a failure because he didn't fulfill all his dreams of travels and explorations. Sure, all his achievements helped the community, but never did he expect to stay in his modest natal hometown, Belford Falls. Bailey exemplifies the notion of being victim of circumstances, something I could relate to who spends my whole time dreaming of what I wish to do, instead of appreciating what I already did. Seriously, could it be more frustrating than dreaming of the world and be forced to live in a dull small town? Logically, Bailey becomes a bitter man with the eyes so turned to the future that he can't turn his back and consider the extent of his achievements and his popularity. George Bailey reminded of one of my friends' sayings: \"we don't spend our lives writing the future, but writing the past\" It's even truer for Bailey whose past (understand: achievement) helped people to build their future. Following the death of his father, he took over the \"Loan and Building\" affair and played a significant role in the lives of all the people of Belford Falls by selling houses lower than the prices they would normally rent it, thus providing them the most precious thing in America: a land, a home, with prices low enough to be able to sustain to the other obligations. He naturally made himself an enemy through Lionel Barrymore as the infamous half-tyrant half-tycoon Mr. Potter, a fitting 'Capraesque' villain as the morally corrupted rich man who tyrannizes and despises little people. (Interestingly, both Bailey and Potter are in AFI's Top 10 Heroes and Villains)Frank Capra is one of the few directors whose style became instantly identifiable and \"It's a Wonderful Life\" is the opportunity to culminate his own standards but not with the usual emotional bias this time. Here it's Bailey, the very protagonist of the film who takes distance from the little people, too real, too down-to-earth while he is a man who dreams, who writes the future in big, bold letters. This time, the enemy is not just the rich, the powerful, the corrupted, but the hero's inner demons, unknowingly celebrating Capra's humanistic vision: a world of solidarity, brotherhood, goodness and compassion. It's also, cinematically-speaking, the incarnation of a lost era through these characters forever graved in our memories, Mary Bailey (Donna Reed), Uncle Billy (Thomas Mitchell), Clarence (Henry Travers) and all these unforgettable faces.\"It's a Wonderful Life\" is the coming to realization of a man that he's better than what he thinks he is, and whose achievements speak something more important about him than his dreams. The trick was to allow him to see what his life would've been hadn't he be born: a frightening alternate reality (just noticed where \"Back to the Future II\" took its inspiration from). This little spice of fantasy conducts the atmosphere of the climax. And its darkness is perfect because the scarier it'll get, the more convinced Bailey will be. And he finally learns it the 'hard way' but this is the fate of all Capra's heroes, they all struggle, they're all licked and desperate before triumphing. Why so hard? Why the harder it is, the louder the 'YAAY' will be and so will the 'Merry Christmas' shouted while George Bailey is running out of joy, probably the most communicative of Cinema's history.And we wouldn't have had one of the truly happiest happy endings of cinema's history, immortalized by the sight of James Stewart smiling, with little Zuzu, Mary and a thought for his guardian angel.",
    "87": "Honestly I am a 20 year old and I have never cried in my life watching movies and web series and I have watched lot of them. But this movie made me cry so hard that I was not able to stop them even when I wanted to. It is the best movie which tells us about the real meaning of life that you would understand only after seeing this movie otherwise you will ignore it like any other quotes you read. It's my humble request to everyone reading this please give it a try and you will certainly learn something new about life. You will certainly see a flaw in today's society thinking and I pray to god that if your mindset changes do help others as much as you can as I will.",
    "88": "I've always thought that the reason It's A Wonderful Life has had such enduring popularity is that more than in any other film it shows what can be the value of a single individual and the contribution to the greater good they can make.George Bailey as portrayed by James Stewart is the kind of every man hero we can all identify with. He's got the every day problems to be sure, raising and providing for a family, but he's got bigger problems than that. Fate has made him the rallying point of opposition in his small town of Bedford Falls to the \"richest and meanest man in town\", embodied in Lionel Barrymore.It's a real David vs. Goliath battle. Barrymore seems to have unlimited resources at his disposal. Samuel S. Hinds as Peter Bailey put it so well to him in asking what are you doing all this for? Barrymore does have more money than he could ever possibly use. A little charity wouldn't hurt him.Remember the basic plot outline. A whole lot of people in Bedford Falls one post World War II Christmas Eve see that their friend George is toting a heavy load of mysterious origins. Their prayers reach the heavens where an angel is dispatched to aid.But before Henry Travers the angel arrives, he's given the story of George Bailey's life. And we see the kind of struggles he's had, the sacrifices he's made for the good of a whole lot of others. We've also seen a greedy and grasping Potter, grabbing everything that George Bailey cannot save. Something happens that day before Christmas through no fault of his own, Bailey is in big trouble. It's driven him to the brink of despair. That's why the angel is sent down. He shows him the alternate universe that would have been had he never existed. It's something each and every one of us should try to do, step outside ourselves see just what our contributions can be.But I think what Frank Capra is trying to say in this greatest of his films is that having done that and we realize we haven't contributed to the greater good of humankind, we resolve to do so. It's a simple, but profound lesson.What if Potter got the same opportunity? In a sense Charles Dickens did just that in A Christmas Carol. Would Lionel Barrymore change? It's an interesting point of speculation.In addition to those cast members already mentioned a whole group of players who worked with Capra before grace this film. Add to that some others and you have a perfectly cast feature picture.Donna Reed has an interesting part as well. Your choice of mate is real important in life. Had she not been as loving and supportive to George Bailey, he might very well have taken a different route in life. Mary Hatch Bailey became a signature part for her, more identified than her role in From Here to Eternity which got her an Oscar. It certainly was the basis for her TV series.When Todd Karns who plays Harry Bailey toasts his brother he's saying that the riches of the world are not necessarily things that can be quantified. Your life is not measured in material things, but in how you use the material things given you. And that universal lesson will be taught into eternity as long as It's A Wonderful Life is shown every year. Wouldst we all learn it.",
    "89": "No movie ever made has influenced me more than this classic. I had the honor of doing a play version of it about 5 years ago. I had seen the film thousands of times, had loved it, but I never really knew what it meant. During the course of the production, I suddenly felt alive. I felt that I wasn't having enough fun. I felt that I wasn't doing enough in my life. Crazy things, like kissing my mother or my father. I hadn't really hugged one of them in a while. It makes you think. It's more of a thinking person's film than a mere Christmas film. If you think it's just a Christmas film, I insist you watch it again and again, until you get the message.Stewart gives the finest performance of his career, in one of the most difficult characters ever portrayed. A character all of us are familiar with...a person looking to find himself/herself. It's the great struggle for finding what it is in life you really want to do. George Bailey teaches us so lessons throughout the film and in the end he teaches us the most important lesson of all, that life, although a long and winding road, truly is (for lack of a better word) wonderful...",
    "90": "It's a Wonderful Life is something truly special, and along with Scrooge, the original Miracle on 34th Street and Home Alones 1 and 2, it is something I watch every Christmas. Why? Because I love this movie, seriously I do. Looking through my 1000 or so reviews here, I couldn't believe I hadn't reviewed this movie; I have seen movies that I have loved and cherished since childhood and I have seen movies that belong at the bottom of the garbage. It's a Wonderful Life belongs to the former, although I am 17, I appreciate a good movie when I see one. This is more than a good movie, it's a timeless masterpiece, that holds up on repeated viewings and never loses its magic.It's a Wonderful Life could have easily been overly-sentimental and clichéd, but the quality of the direction and the screenplay that others have summed up perfectly assured it was a beautiful, heart-warming and somewhat poignant film. While there are some funny parts, not bursting-your-gut funny but funny in a subtle sort of way, other parts are close to heart-rending. The direction from Frank Capra is excellent, sensitive and nuanced, and Capra shows even more talent as a screenwriter having penned one of the most honest and touching scripts ever in a film. Casablanca, All About Eve and The Shawshank Redemption all had wonderful scripts, but the script here has a lot to say about community spirit and shows that this film is much more than feel-good sentimentality. There is the element of feel good here, no doubt about it, but it doesn't overpower what the film intends.Visually, It's a Wonderful Life is a wonder. I don't think it is dated at all, the cinematography is crisp, the black and white looks beautiful and the pristine Christmas scenery really does take me back. Some of my favourite ever memories was of Christmas, whether it was watching nostalgic Christmas videos, eating Christmas dinner or singing carols under the Christmas tree. Another thing I have to mention is that the movie is richly and beautifully scored, Dmitri Tiomkin's music here is absolutely gorgeous, lyrical, whimsical, nostalgic and most importantly it never felt intrusive in the more integral parts of the film. And I have to mention the story, never in my life(and I genuinely mean this) have I seen a movie where it communicates such a strong message and so well too. The story of a suicidal man who is shown the value of his life by his guardian angel is an effective, timeless one, imitated perhaps but never equalled.Finally the acting is wonderful. James Stewart, and I seriously don't give a damn whether he was a racist or not and neither should you, is absolutely superb as George Bailey, a truly complex character who goes through such a lot to get to where he is at the end of the movie. George Bailey is like Mr Deeds, John Doe and Mr Smith rolled into one, and in my opinion only James Stewart could have given justice to a character that has self-doubt gnawed at his essential decency. Also the character change, like that of Alistair Sim's Scrooge at the end of Scrooge, was heart-breakingly believable. Donna Reed is radiant and charming as his wife, who is like a caring lover, devoted wife and dedicated mother, while Thomas Mitchell gives one of his more memorable performances as Uncle Billy. Henry Travers is a revelation as Clarence the guardian angel, but there is another performance I think is worth of mention. For a good morality tale, you need a good villain. Well in the name of Potter, you have one. Who better to portray him than the great Lionel Barrymore acting at the peak of his powers? Overall, a timeless classic with a true and heart-rendingly poignant ending. 10/10, one of the easiest perfect scores I have made recently. Bethany Cox",
    "91": "This film has become a Christmas tradition in my family.  We watch it every year and never tire of it.  Frank Capra is a master of creating films with a message that reinforce strong values.  This is probably his greatest film in that regard.  Both he and Stewart have publicly stated that this is their favorite film.The message in this film is one of courage and sacrifice for the greater good as George Bailey, a man with big ideas about seeing the world, continually forsakes his own desires to do what is right for the town.  The second message is that each life important.  No matter how insignificant we feel we are, we are all inextricably linked to each other and play an important part in the fabric of one another's lives.Capra's direction is brilliant.  His genius is bringing human stories to life in a ways that not only make a point, but that totally involve the audience in the lives of the characters.  He is always extremely optimistic about the human condition.  He is known for testing his characters with overwhelming adversity to make them struggle to triumph in a way that causes the world to change and the character to grow.  For this reason his films were always crowd pleasers and this film was the best of all in that regard.Led by Capra's understanding hand, the actors all did a magnificent job. Stewart's wide-eyed enthusiasm and boyish charm, coupled with an unbending strength of character made him the perfect folk hero.  Donna Reed was lovely and charming and attained the right balance between being supportive and inspirational.  The romantic chemistry between her and Stewart was subtle and charming.  Lionel Barrymore was towering as the greedy old skinflint who was trying to take over the town.  Thomas Mitchell plays one of my favorite characters, as the bumbling Uncle Billy in probably his most memorable role.This film is number eleven on AFI's list of best films of the century.  It was nominated for five academy awards and won none.  It was swept in 1947 by `The Best Years of Our Lives', a great film that won seven Oscars that year but in my opinion was the lesser film.  History has corrected that minor injustice by rendering `It's a Wonderful Life' an enduring classic that is viewed and loved by generation after generation.  Of course, I rated it a 10/10.  I can't wait to see it again this Christmas.",
    "92": "I am a film lover from 'way back, having even served a stint as a newspaper movie critic. Entries in my personal list of Greatest Films of All Time include \"Fantasia,\" \"To Kill A Mockingbird,\" \"Casablanca,\" \"Singin' in the Rain,\" \"North by Northwest,\" and \"The Sound of Music. But sitting atop all of them, as undisputed champ, is \"It's a Wonderful Life.\"I have seen it hundreds of times (dating back to, oh, when I was a teenager I suppose, and our local PBS station ran it as part of a pledge drive). I drive my wife and family to distraction when we watch it together because I quote all the dialogue along with the actors.I cry every time--and this is after viewing upon viewing--when Harry Bailey toasts his big brother George as \"...the richest man in town.\" The emotions in that scene are so true and pure that I can't help but be affected by them.The performances are unparalleled. Stewart is brilliant as a small-town dreamer who loses and finds his way. His superlative acting abilities cause us to identify strongly with him (how many of us have lamented--even to ourselves--that no one seems to notice the sacrifices we've made?), which is, I think, why the movie bears up under so many repeat viewings. Reed is just lovely here, the epitome of sunny girlfriend, caring lover, devoted wife, dedicated mother.Capra's talent as a screenwriter are all over this script. He knows just how hard to tug the heartstrings without becoming overblown or phony. And his technical wizardry is evident too. I've never seen--before or since--more natural-looking onscreen snow.Watching IAWL has become a tonic, a pick-me-up when I really need one--whether it's the Christmas season or not. Its message--that each one of us is important and has *something* to contribute to the greater good--is one about which the world could use some reminding from time to time.",
    "93": "Here's a new definition of cold-hearted: a man or woman who remains completely untouched by the 1946 Capra classic \"It's a Wonderful Life\". You can't not be moved by this wonderful little gem.The acting is all great. One of the film's greatest strengths for me is making George Bailey - the star of the movie played by James Stewart - a nice normal man. He's not perfect and that's pretty much essential to the film's success because Bailey could be *any* man. The lesson of the movie is fairly simple - we all have our role to play in the world and we are all important. Most movies would make this into a schmaltzy affair but Capra delivered a touching, heart warming tale. Bailey consistently denies himself to allow others to live as he sacrifices his life to make sure people can have enough money to avoid having to sell-their-soul in debt to the evil H. Potter (alas not a Harry Potter...). His complete and utter humility is great - he doesn't see how much he accomplished until his guardian angel Clarence shows him. Again Clarence isn't played in the usual clichéd manner but more as a believable character who honestly loves Bailey for his strengths.The movie is a success because you can't but want Bailey to succeed. The manner in which he does could be classified as corny but, because it's so deserved, that doesn't matter. The music, the set pieces, all the touches add to a wonderful movie and give you hope that life can indeed also be wonderful. A lovely mood-lifter. 8.8/10.",
    "94": "Honestly, I don't think I've ever seen anything quite like It's A Wonderful Life. Does it take me back to that place in my heart, that makes me long for everything that once was great and it could be again? Does it remind me of my childhood, Christmas in my home? No. Maybe it's just simply what I always wanted from life and every man I want to be. Everything about this film is well for lack of better words, perfect. No question to it any longer, the best performance by an actor I have ever seen. It's more than just beautiful, timeless or fair. All of Stewart is revealed. Everything coming together for Capra. Lionel Barrymore at his best, which seems to be his worst. Sometimes I think there is a reason why somethings happen. And I'm pretty sure there is some magical reason why this film was made. I'm 27 years old and saw it for the first time Christmas Eve of this year. I've watched it 3 times since. The only movie to ever make me cry. I probably wouldn't have all the answers for you, if you asked me why. I'm still trying to figure Stewart out and just how beautiful was Reed.What can I say? This movie is a life changing experience. Makes me feel good to be alive. What a wonderful little world it is. And if I waited my entire life, it would not be a waste of time.",
    "95": "On the Christmas Eve of Bedford Falls, the guardian angel Clarence (Henry Travers) is assigned to convince the desperate George Bailey (James Stewart) to not commit suicide. George is a good man, that sacrificed his dreams and his youth on behalf of the citizens of his small town. He inherited the loan business of his father and he gave up traveling the world and joining the university as scheduled. Later he resisted the proposals of the evil banker Mr. Potter (Lionel Barrymore) and has never sold his business to protect the poor community of Bedford Falls and offer a means to afford to buy their own house. He married his beloved Mary Hatch Bailey (Donna Reed) and had four children with her and a tough life with his family. When his uncle Billy (Thomas Mitchell) loses US$ 8,000.00, found and stolen by Mr. Potter, George decides to commit suicide, since he believes he worth more dead than alive. When Clarence sees that he is not able to persuade George to give up his intention, he decides to show the life in town if George had never existed. George concludes that life is wonderful.\"It's a Wonderful Life\" is certainly one of the most beautiful movies of the cinema history ever. This masterpiece has a touching and moralist story, showing that the famous sentence that a man can make the difference is true. Everything works perfectly in this movie. The original screenplay develops the situation and the characters accurately, using flashbacks and magnificent lines. The direction of Frank Capra is outstanding as usual. The cinematography in black & white and using shadows and lights is fantastic. James Stewart leads an amazing cast, showing a perfect chemistry with the gorgeous Donna Reed, in the role of a compassionate and enlightened good man. Lionel Barrymore is also amazing in the role of the despicable banker. I do not recall how many times I have already seen this film, but last time was 16 Dec 2000. This is the type of movie that a lover of cinema will never get tired of watching many times. My vote is ten.Title (Brazil): \"A Felicidade não se Compra\" (\"The Happiness Is not Bought\")",
    "96": "George Bailey gives his all for the people of Bedford Falls, big hearted and selfless, George puts the needs of others before himself, pushed to breaking point, he contemplates suicide.I feel almost guilty watching this grey film in November, as it's definitely one of my Christmas watchlist, but with the decorations appearing, and the mince pies in shops, I thought, why not.Nobody does it quite like Frank Capra, there is a depth to this movie that's quite something, it's a story of greed, hope, compassion and humanity.The story resonates as much today, a tale of the little guy taking on the unscrupulous, wealthy greedy big business (some things never change, right!)It's light hearted for the most part, but there are some very bleak moments thrown in, that scene where people demand their money, and that heart stoping moment where George vents his frustrations on his Uncle.So many moments tug on the heartstrings, it's no wonder it's a festive favourite, but it deserves its place as one of the greats, not just a Christmas great.9/10.",
    "97": "Lovely film.'It's a Wonderful Life' is enjoyable, hearty and well crafted. It takes longer than I would've predicted to get to 'the event', but it's very much worth seeing the journey that comes before - as we see the arc of James Stewart's George. It all crescendos with an ending that you can't help but smile at.Stewart is excellent in the lead role, you really do see every single emotion that his character goes through. He is, by far, the standout performer, but there are of course good performances from the likes of Donna Reed (Mary), Lionel Barrymore (Henry) and Henry Travers (Clarence).I did notice a few weird cuts in there, not that I hold that against it or did it affect my enjoyment - it's just noticeable. I see, via other reviewers, that there's a colour version - Channel 4 showed the black-and-white version over here in the UK. I can't say I felt the need for colour, which is always a good sign.Wholesome. Not that it, evidently given the average rating, needs to be said by someone like me, but: I'd certainly recommend this.",
    "98": "After strong performances in films such as \"Mr Smith Goes to Washington\" and \"The Philadelphia Story\", James Stewart confirmed his status as one of the greats with his performance as George Bailey in \"It's a Wonderful Life\". This movie is, without a doubt, the best of all time.\"It's a Wonderful Life\" is a movie that you can watch over and over again. It's movie that makes you think, about life in general and how each person makes a difference, and about how great life can be (hence the title \"It's a Wonderful Life). Whilst making you think, it also entertains with many light hearted moments, particularly towards the end of the film.\nThe direction, sound and casting in \"It's a Wonderful Life\" are second to none.  Yet it is the fact that almost any person can watch this movie and come away feeling inspired that makes it easily the best movie of all time!A 10/10 without a doubt!",
    "99": "If you were to ask me what Holiday-themed film I enjoy the most and never get tired watching, my answer would invariably be, Frank Capra's \"It's A Wonderful Life\" (1946).Of course, there are many other great holiday movies that are also genuine cinematic treasures, even though they're not as well known as \"It's A Wonderful Life.\" My \"must watch\" holiday list includes many of the black and white classics I have previously reviewed on IMDb such as, \"Holiday Inn (1942),\"It Happened On 5th Avenue,\" (1947), A Christmas Carol (1951),\" \"Christmas In Connecticut,\" (1945) and although it's in color, \"White Christmas\" (1954). And for good measure I still immensely enjoy watching \"Home Alone 1 & 2\" (1990-1992) and the charming trilogy, \"The Santa Clause\" (1994-2004-2006).Nevertheless, \"It's A Wonderful Life\" is the singular holiday film that continues to resonate with me on multiple levels. It is a supremely powerful story of self-worth and destiny, bolstered by superb acting, laced with unforgettable characters like George Bailey, Clarence Oddbody, and Mr. Potter, thoughtful cinematography which perfectly captures the small town ambiance of Bedford Falls, sharp editing (no surprise since Capra began his film career as an editor), a beautiful score by Russian composer Dimitri Tiomkin, and more memorable quotes than could ever be listed here.Ironically, \"It's A Wonderful Life\" may never have popped up on anyone's cinematic radar screen had the proper copyright ownership documents been registered. How this error occurred is fascinating.The original 1945 ownership of \"It's A Wonderful Life\" belonged to Liberty Films, an independent motion picture production company created by the film's brilliant director, Frank Capra. The following year, Liberty was purchased by Paramount. Ten years later, in 1955, M. & A. Alexander subsequently purchased the rights to the short story, \"The Greatest Gift,\" on which the film was based. With the purchase also came the rights to the film itself, television syndication, and the music score. Shortly thereafter, National Telefilm Associates (NTA) became the new owner. Amazingly, a clerical error meant NTA had neglected to renew its copyright. By 1974, the movie fell into the \"public domain.\"In essence, Capra's masterpiece no longer had copyright protection, and therefore, anyone could make copies of the film, package it anyway they chose, all without having to pay for it. Because of this, television studios began broadcasting \"It's A Wonderful Life\" during the Christmas holidays, while dozens of other companies packaged and sold the film in various media forms such as VHS, and later, Laser Disc and DVD. The good news- This nearly forgotten film was now being seen for the first time by millions of people. The bad news - Many of the reproductions were of poor quality, with some crudely edited down from the original 131 minute run time into a shorter length to accommodate TV scheduling. Nevertheless, these unusual series of events managed to breathe new life into Capra's stunning film for future generations.As often occurs with films destined for immortality, \"It's A Wonderful Life\" was initially a financial box office failure, although it was nominated for five Academy Awards (including Best Picture) and has been revered by the American Film Institute as one of the 100 best American films ever made.There's nothing more I can add to this review that hasn't been covered already by other astute IMDb reviewers, but I will say that if you have still not seen \"It's A Wonderful Life\" by now (2021) then stop whatever you're doing and buy the BR, DVD, or stream it. I'm confident even after your first viewing you are going to feel like you've just seen one of the greatest films ever made, and you would be absolutely right!No spoilers here as usual but I will reveal that while much of the film happens in the fictional town of Bedford Falls during a very cold, snowy, Wintery Christmas holiday, it was actually filmed in Southern California which was experiencing a sweltering record heat wave!",
    "100": "The wonderful (pun intended) thing about this Christmas classic is that you can appreciate and fall in love with it all over again as you age and reach different stages of your life. When you're a kid, you enjoy the fairy-tale elements of the story, and you laugh at Clarence the Angel's lines. As a teenager and young adult, you identify with George Bailey's famous speech: \"I know what I'm going to do today, and tomorrow, and the next day after that.\" He has so much hope, idealism, and the time to spend on righteousness. But the older and older you get, you see the tragedy in George's journey. You feel sorry that he never achieves what he wants and that he spends his life taking care of other people and holding down the fort for the reserves that never arrive. That's why, no matter how old you are, you always cry at the end of It's a Wonderful Life, and that's a wonderful thing.The sentiment of this story is truly timeless. There are no cell phones, people use trains as transportation, and the Great Depression is only mentioned in history books - but every part of it is still incredibly relatable to modern audiences. Youthful crushes, idealism before you gain experience, defending your family without understanding the consequences, and seeing \"the bad guy\" without any backstory to his life. No matter what generation you belong to, you live through all these phases when you're young. Bravery, loyalty, regret, frustration, and gratitude don't expire on a certain year. So even though the movie is in black-and-white, the appeal of wiping the slate clean on your life still hits home.Sentimentality aside, it's still a great movie. James Stewart gives the performance of his career as George Bailey. You believe him every single step of the way, and you feel that you've actually gotten to know him, rather than the character. When the camera films his vulnerable prayer scene in Martini's Bar, you're almost embarrassed to be watching such a private moment. Thomas Mitchell also gives a career-best performance as the stereotypical drunk family uncle. Despite his enormous flaws, he really does mean well. Beulah Bondi, as the long-suffering mother, Henry Travers, as the affable guardian angel, and H. B. Warner, against type as the emotional drug store owner, provide a steady supporting cast to the film. You've seen all these actors in dozens of movies before, helping to set the stage of a small town where everyone knows everyone. Ward Bond and Frank Faylen, playing Bert and Ernie, are also familiar faces. Even the smallest impact is still an impact, like the friendly local cop or the one taxi driver in town.Lionel Barrymore is a hilarious villain, and unrecognizable in his disguise. He rattles off his venomous lines with such wisdom, and even though he's supposed to be the bad guy, you know that a lot of what he says is true. In a rare occurrence, you'll be able to hear Gloria Grahame before she stuck the cotton in her mouth. This was only her third movie, and her adorable turn as Violet makes you wish she never got self-conscious about her lips. Finally, there's Donna Reed, the epitome of the American housewife. If James Stewart is the perfect everyman, Donna Reed is the perfect everywoman. It's no wonder she became the iconic television mother after being the backbone of the Bailey family in It's a Wonderful Life. She sacrifices, steps up to the plate, and gives generously, all with a smile on her face. Plus she's really pretty, and she keeps her figure after four children!I know you've seen this movie before. You've probably seen it a dozen times by now. But if you're thinking of skipping it this year, don't. Don't you want to see ZuZu's petals one more time? Hear, \"I wish for a million dollars - hot dog!\" Feel the cold, oppressive rain during the run on the bank? Don't you want to get a new lease on life just as the calendar year comes to a close? Of course you do, and millions of Americans will experience all those wonderful little moments with you this Christmas.",
    "101": "BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM HONEST ABOUT THESE FILMS\"It's a Wonderful Life\" is one of the most beloved pictures of all time. The film core idea however has been stolen several times in less worthwhile television films. In fact the film was remade in 1977 for television with Marlo Thomas. That film however not only not have Jimmy Stewart it also lacked the Capra touch.However this is the classic movie that everyone loves and for a good reason \"It's the best film ever to capture the Christmas Spirit\". In this film George Bailey is at the end of his rope is contemplating suicide. The man is played by Mr Stewart. After a life of dreaming of leaving Bedford Falls and never able to do so. He wants to see the world and be an explorer. After a rough day at work he finds himself about to jump of a bridge but at the last moment an angel does a few tricks that prevents George from suicide. When Angel tells George \"that he is there to rescue him\" George laughs. Finally the angel shows George what his presence has meant to not only his family but to the people of Bedford Falls.This film has does not have one false moment. The casting is perfect. The story moves along at a brisk pace. The child actors are just as good as the adults. If you buy the DVD or Blu-Ray Set the colorized version should be avoided. This film plays better in black and white!",
    "102": "Once again, my two cents' worth of a film that is the darling of so many people, myself included.  It has its uplifting conclusion, and the theme that every life has its purpose in the great scheme of things.  George Bailey is in trouble.  He has decided to end it all.  The thought of jail and disgrace is more than he can handle.  George's life has been a continual parade of missed opportunities.  There is a layer of pain just above the surface of nearly every scene.  George is a victim and this series of disappointments takes its toll.  He eventually becomes hardened and frustrated, but because he is honorable, he goes about the business of living.  He has gifts he doesn't realize.  He has family.  He has status, and while not often appreciated, he is.  Unfortunately, we don't always share our love and admiration with those who deserve it.  His sense of adventure from birth has been clutched from him over and over.  His bad ear makes the army an impossibility, his father's death forces him to run a business he wants to run away from, and even his honeymoon money is used to prevent a run on the bank.  George never knows his importance until Henry Travers' well meaning angel comes along.I love this movie, but I also take it seriously.  It can be painful to watch sometimes.  The best scenes are the ones where George never existed.  His despair is evident and the tension builds higher and higher.  When he comes back, such a weight that is lifted. Jimmy Stewart is at the top of his acting form; I loved him as a living human being and as an actor; he portrays the kindness I believe the world should have.And then there is Donna Reed, Lionel Barrymore, Ward Bond, and all the others.  They are superb.  It's a question all of us have wrestled with: \"What if we had never existed?\"  There is no peer in Capra's canon.  I truly believe that this is a necessary part of our heritage.  We need to see things as they should be.  I love Christmas because it at least portends to be the time we all look at our gifts.  This movie is a gift to the world and one we can learn from over and over, even if the events never took place.",
    "103": "I know this is going to sound ridicules, but seriously, I have not seen this movie since I was a child. Even though they play it every year for Christmas, I never really had an interest to see it again. I was complaining to my mom the other day how sad it is that people just look at Christmas as present time and just getting what you want, I almost cried over it because I miss how my family would get me presents, but we'd go the homeless shelter to help out people who couldn't have a better one than us, I always thanked my parents for those wonderful experiences. It taught me that there is always worse and we must help those not just on Christmas, but all year around. Well, we did it again this year, but I'm now in the retail business and when I complained about this to my mom, she lent me the movie and said to watch it.Watching this movie truly touched my heart and brought me back to the true meaning of Christmas. I mean, your heart just goes out to George and his wonderful little town of Bedford Falls. He and his wonderful wife Mary together do whatever they can to make it in life and support their 4 darling children. But when a horrible mishap goes on at the bank that George works at, loosing $8,000, he starts to wonder if his life is worth living. But there is one angel who will not give up on him and shows him what life would be like if George had never been born. In Bedford Falls without George, turned into Pottersville because of the very greedy business man Mr. Potter, no one is happy and Mary is all alone. George realizes that maybe life is worth living and comes home to this loving town that is willing to do anything to help him and his family out.\"What goes around, comes around\", I couldn't stop tearing at the end because it's just so loving. I hope future Christmas's will go back like this movie's examples, where people are just happy to have what they have and realize some are not so lucky, but we must all do our part. Cheesy, I know, but if one person can raise their hand, we all will do our parts in the end. Merry Christmas, everyone! :) 10/10",
    "104": "My apologies to all of you \"It's a Wonderful Life\"-ers out there. Please believe me when I say that I've tried multiple times to develop warm feelings for this movie. But it's just not meant to be. I've seen this film a couple of times, and I never want to see it again.I want to beat James Stewart's George Bailey about the head and shoulders every time I watch the movie. Perhaps the most passive-aggressive hero in motion picture history, George Bailey spends half of his time sacrificing his own happiness for the sake of others, and the other half whining about his hard luck. No, George, it's not hard luck...it's the result of your own decision making skills. Either be selfless and stop complaining, or be a bastard and screw everyone else. But make up your mind, and don't take two hours to do it.Ahhh, perhaps I now live in too cynical and jaded a world to tolerate George's namby-pamby indecision. But maybe that's a reason better than any other to keep this film around. Character aside, however, the one thing I can unequivocally praise about this film is the performance of Stewart. He provides a welcome bitter edge to combat Capra's sugary-sweet corn. His breakdown scene in a bar, where he desperately prays to God to help him keep himself together, is a tour-de-force.Drag it out every Christmas and enjoy...I won't begrudge you that small pleasure. Just don't expect me to join along.Grade: B-",
    "105": "It's a Wonderful Life (1946)**** (out of 4) This timeless classic has James Stewart playing George Bailey, a frustrated businessman who gets the chance to see what the world would have been like had he never been born. I've lost count of how many times I've watched this film over the years but it keeps getting better with each new viewing and I can't help but notice new things each time I watch it. There's really nothing I could add that hasn't already been said about this movie but it's certainly one of my all time favorites and I'd argue that it's one of the greatest ever made. This movie has been called timeless by many people but I really can't think of too many movies where this is more true. I can't possibly see how this movie would ever grow old fashioned or out of touch because there's always going to be people who feel like the main character here. The most amazing thing to me is that the film perfectly captures how someone might begin to feel that they're worthless and I can't help but think that anyone who watches this movie will have a better look on life or themselves after watching it. I really can't think of too many movies that contain as much power as this one but I'd say that's why new fans are gained each and every passing year. The greatness of the film is certainly its heart but Stewart also deserves a lot of credit for his marvelous performance, which is certainly one of the best of his career. There are countless scenes in this movie where Stewart just nails it and I'm sure everyone knows the praying in the bar scene but there are many other great ones as well. On this viewing the scene on the bridge when Stewart begs for his life back hit me unlike any other time. There's also the scene in the bank where George has to bargain with the people not to take all of their money. Lionel Barrymore was always great playing bad guys and I can't help but think he's one of the greatest villains in movie history. The evilness that Barrymore is able to get through this character makes it among the actors best work. Donna Reed, Thomas Mitchell and Harry Travers also add great support. Every inch of this movie works flawlessly and that includes the sequences where George gets to see things as if he were never born. I think these moments contain Capra's greatest work as a director as the darkness and atmosphere he creates is so think and depression that it perfectly puts you in the mind frame of George. Then you've got that priceless ending, which ranks right up there with City Lights and Psycho as being the greatest for any movie.",
    "106": "Frank Capra's sometimes dark post-war film, \"It's a Wonderful Life\" was released in 1946. It was intended to be released in 1947, but when a Technicolor print of \"Sinbad\" couldn't be delivered on time, this film was put into release. For that reason, \"It's a Wonderful Life\" - possibly the most wonderful film ever made - was overshadowed by \"The Best Years of Our Lives.\" But you can't keep a great film down, and as the years have passed, \"It's a Wonderful Life\" has found its place as an iconic film that means Christmas. It's survived the public domain (due to a clerical error, when the copyright was not renewed in 1974), where it was cut to ribbons and shown so often on television (and why not, networks could show it for nothing) that people were sick of it. Now that it has to be licensed again in order to be shown, the film is shown in its totality and not as often.This remarkable story of a man who sacrifices his dreams for the betterment of his community and the business his father built resonates today more than ever, when it often seems like no one cares about anything except what's in it for them. James Stewart is perfect as a caring man who swallows disappointment after disappointment and finally is ready to give up, until he is given the gift of seeing what would have happened had he never been born. No man, he learns, is poor who has friends.I can't think of a better message or anything more inspirational than can be found in this film. George Bailey is all of us, and his story is a reminder that we're all important and, no matter how tough it gets, we need to keep going. One of my favorite movies.",
    "107": "One of the films that has been on my watchlist the longest. I finally understand why this is regularly listed as peoples' favourite film, and why it has become the ultimate Christmas staple.Jimmy Stewart was fantastic in this. I can't help but feel he brought some of his own wartime experiences into this role and the way he portrays George Bailey at his most vulnerable. The rest of the cast were fantastic too. Special mention to Donna Reed as the beautiful Mary, and Henry Travers as Clarence, who definitely had me laughing more than once.This didn't actually feel like a traditional Christmas film for most of it. In some ways, that just makes it even more universal and timeless in its appeal.The plot and originality have been reproduced in countless ways ever since. It's easy to see why. You can't help but think about your own life at times, and somehow come out the other side a little more grateful, a little more optimistic. Any film that can do that is worth its weight in gold.A well-deserved classic and one I'm grateful to have finally seen.Those final scenes. Damn. Is someone cutting onions in here?",
    "108": "Criticizing It's A Wonderful Life is almost an act of treason in this country, but if ever a movie deserved a closer look, it's this one.Far from being a celebration of the importance of the individual, or of small-town life, \"It's a Wonderful Life\" depicts most citizens of Bedford Falls as timorous weaklings. Moviegoers identify with the hero, George, of course, but he's the exception in this movie, not the rule. If any general lesson is to be learned from the story, it's that a willful leader is the only thing preventing ordinary small-town folk from losing not only prosperity, but morality.The evidence is plain: Without George Bailey to hold the town together, it becomes Pottersville, which is a Hays Code version of Gomorrah. The townsfolk haven't got the courage or sense to manage their own affairs without a leader. In Bedford Falls, that's either corrupt Potter or long-suffering George. The only other characters with any backbone are Harry Bailey and Sam Wainwright, and they both left town. What remains are virtual ciphers like Mr. Gower, Uncle Billy, Ernie, and Bert. America doesn't exactly burst at the seams with self-reliant citizens, according to Frank Capra. So why does this movie merit a healthy 7 rating? Two reasons:1. Because it has undeniable power. Capra was a good director-- but a great propagandist. He made patriotic short films for the U.S. Army from 1942 until 1948-- and \"It's a Wonderful Life\" was made in 1946, smack in the middle of that period. The film is a masterpiece of manipulation. People love it, watch it over and over again every year, never noticing that its real message is deeply cynical, presenting little hope for mankind, and almost no faith in it. Indeed, it is almost fascistic in the way it champions the idea of a single leader (or worse, divine intervention) taking charge over ineffectual ordinary middle class people.2. Because Capra proves himself right with his own movie. As an influential leader/filmmaker, he is skilled enough to make generations of sheep-like Americans cry and cheer at his movies, no matter how much he insults us.",
    "109": "IT's A WONDERFUL LIFE is definitely one of the most beloved and most watched films of all time. Simply enter human warmth and kindness in the festive atmosphere. Great script and a story that follows the life of one man, his family and his fellow citizens will not leave anyone indifferent. The magical atmosphere and timeless magic simply forces us to become part of the film. Given the time period and the retrospective of life, it is hard not to find yourself in one of the situations.Director Capra went on a series of films about the little people with real human virtues. Again, one protagonist dominant. In this case, dissatisfied with their lives. Capra wants to show something that is long lost. Family, friends and hard work are actually a wonderful life.James Stewart as George Bailey hit the famous director. Not only because of its irresistible charm and manners that had a chance to hone working with the most beautiful and famous women in Hollywood, but for the link in the mode of dealing in the character George Bailey and the actor. Furthermore, his character, although at first glance may be too mean, really has a great depth, and excellent Stewart interpretation gives it weight. Stewart's acting phenomenon I personally never liked her, but his fantastic performance I will never challenged.Donna Reed as Mary Hatch Bailey is quiet and modest woman who truly loves and appreciates his wife. The character is so simple and quiet to the stunning strength has exactly the moments when it is most needed. Lionel Barrymore as Mr. Henry F. Potter essentially it is a greedy materialist, passion for money in his being destroyed any shred of humanity, but he is not satisfied and with all his strength his personal dissatisfaction wants to convey the awareness of other people. I have to be skeptical and say that today these people are incredibly much.No man is an island unto themselves! Globally, the story in this film does not have a universal character. However, we can hardly resist the impression that we are all part of a whole, and unbreakable bond. I am not a supporter of the belief that there is \"someone up there\" who maintains the world's balance. Simply have eyes and see what happens. However, I think it's Capra lukewarm fiction and mild levity created because of those feelings.This movie is full of optimism, the story is touching. The man is an unusual way realized, despite all the problems, how is life actually delightful.",
    "110": "Shortly after the end of WW2, the tastes of the American people yearned for something more real like the war, which lead to the underperformance of Frank Capra's It's a Wonderful Life as it was deemed too sentimental. After years of being played on television, it eventually got the attention it rightfully deserved. George Bailey, played by James Stewart, yearns to leave Bedford Falls, but one unfortunate event after another calls for George to make sacrifice after sacrifice, until it all culminates to one crucial moment on the night of Christmas Eve when he is at his lowest and most vulnerable. James Stewart presents a wide range and a layered character and one we can root for as his dreams go further out from his reach. How the writers brought Christianity into the story was appealing to me and is approached in a way that makes it universally digestible. We have ourselves a great cast of memorable characters that show some growth and then there is the easily detestable Mr. Potter, who seeks to take over the town and is continuously at odds with the Baileys. The tone of the movie itself I found to be perfectly balanced as we get plenty of heartfelt moments, but also some dark and intense ones as well. It's a Wonderful Life proves to be more than a holiday classic, as it excels with its story that everyone can take something away from. Final verdict: 10/10.",
    "111": "Believe me - This decidedly heavy-handed, Christianity-driven, tear-jerker (from 1947) is so loaded down with underlying religious propaganda that (depending on which side of the bible your \"daily bread\" is buttered on) it's either gonna warm your heart, or else it's sure to freeze it.This film's story-line also preached (and I quote) \"No man is a failure who has friends\" - (Yeah? - Isn't that nice to know?) - But, with that in mind - (I ask you) - What about all of those out there who have no friends? Does that render them as failures? Anyway - From my critically observant point of view - \"It's A Wonderful Life\" was so incredibly over-sentimental and highly manipulative (as it zeroed in on the idealism of small-town, American life in the late-1940s) that its storytelling repeatedly veered right off the radar into the stratosphere of pure surrealism.And, with that - This film ended up coming across like an extended (and rather creepy) 2-hour-10-minute episode of The Twilight Zone. This was especially so during the film's \"Pottersville\" sequence - As well as in its final climatic moments of total jubilation.",
    "112": "The film has what I love most about films, \"Inspiration\". The story really is built up in such a way that you'll eventually get inspired by it. Acting by James Stewart is superb. The story is about a man who wanted to do a lot of things, but circumstances changed his fate. He never lost hope, but one day things get really out of controlled and he loses faith in everything. It is very interesting to see how the story reaches to its ending.PROS:One of the best acting performances I had seen recently. The whole film rests on its beautiful story. The film is a very fine example of what we expect from life and what we actually get. The life of our hero seems to be frustrating a lot of times but than in the end, you are finally going to get convinced that IT'S A WONDERFUL LIFE.CONSI admit that the whole angel thing did not impress me much and I was hoping for more realistic kind of thing. Also the editing at some later part of the film looked bad. It was nominated for the best editing Oscars, but just my opinion. But when you have a very fine story, you have to overlook these small glitches.MESSAGE: \"It's a wonderful life.\"VERDICT: \"A must watch for all.\"",
    "113": "This is indeed a wonderful Christmas movie, where James Stewart plays George Bailey, who has dreams of moving out of his town (Bedford Walls) going to college, having an established career and seeing the world. However, after his father's demise, he reluctantly takes on the family business (a loan company), indefinitely putting his dreams on hold.This is a classic story that definitely reminds you of the more innocent times in America and reminds you things will always turn out all right at the end if you have enough hope and faith. The plot keeps you engaged from start to finish as you follow George Bailey's life, from his times as a preteen to him taking on the family business, and finally to him getting married and raising a family of his own - all the while seeing his dreams fade away. However, when things get too down in the dumps for him, an angel tries to help him out of despair and lets him see what would life be like in George's town without him being born. This reminds you to never take anything for granted and to always appreciate what you have.It's a great movie with heartwarming moments and great acting. James Stewart and leading lady Donna Reed had great chemistry together. And, the rest of the cast, from Lionel Barrymore as the villainous Mr. Potter to Henry Travers as the angel Clarence, all did a wonderful job.Even as a movie made in the 1940s, it holds up very well through the test of time and is surely one of the greatest to watch during Christmas time. Highly recommend! Grade A",
    "114": "One of the hallmarks of a truly classic film is its ability to make the viewer contemplate the genre's existence before the experience. \"It's A Wonderful Life\" is a case study in this, as perhaps no movie in the history of cinema has concocted a better mixture of acting, emotion, seasonal--holiday--relevance, and a story that will reach into the very depths of your soul.For a basic plot summary, \"It's A Wonderful Life\" tells the story of George Bailey (James Stewart), a simple man from a simple town--Bedford Falls--who desperately wants to escape his father's \"Building & Loan\" business and travel the world. Every time he is about to take that \"next step\", however, George (through both external and internal devices) remains in Bedford Falls managing the family business. Along the way, he marries childhood sweetheart Mary (Donna Reed), morally clashes with iron-clad town business baron Mr. Potter (Lionel Barrymore), and eventually ends up building a life in the very place he once so desperately wanted to escape from. On Christmas Eve, however, George is dealt a horrific blow and is on the verge of ending his own life until he discovers he has a guardian angel named Clarence (Henry Travers) looking out for him and showing him what a sad place a George Bailey-less world would be.The main reason this movie works so well is because we all have a little bit of George Bailey in us. That is why the poignant moments of this film capture our deepest emotions and promote serious life-reflection during the holiday season. Because we know how easily each one of us could be (or even are) living out the actions of Mr. Bailey on a daily basis. In this way, one could view the film as a character drama through and through.Yet, at the same time, there is more than a touch of fantasy here. The opening scenes feature angels conversing with each other, while the ending is an alt-universe trip that provides much of the emotional punch. Very much Twilight Zone-esque (and even 10+ years before that series). Far enough ahead of its time that the film was a middling success--if even that--at the box office in 1946. It truly took decades for the plot and themes to be re-examined through a more modern lens, if you will.That incredible plot is then bolstered by the perfect casting choice of \"everyman\" Jimmy Stewart to play the lead. Truly one of the greatest acting performances ever put to film both in scenes of jubilation or intense despair. The other cast members (especially Barrymore as the nefarious Potter) are brilliant as well, with each knowing just how to coax the right amount of emotion out of his/her role.In short, \"It's A Wonderful Life\" is easily one of the greatest motion pictures ever constructed. I can--and do--watch it every holiday season without fail, and each viewing I pick up something I hadn't seen or considered (i.e. the sign of an extraordinary screenplay). It is completely genre-diverse, can be enjoyed by the entire family, and will thoroughly entertain you while also prompting some deep introspection. If it isn't my favorite single movie--and it might be--at the very least I can't imagine a world in which it doesn't exist (much like George Bailey himself).",
    "115": "I had fond memories of \"It's A Wonderful Life\" but, somehow, it never made my top ten. The other night I felt the urge to see it again, from beginning to end, after that fun compilation from the AFI, 100 movies, 100 Cheers. The most surprising thing about this perennial classic is that it's not just a good movie but a sort of miracle. Age has made it more relevant, more powerful. Frank Capra is, without question, its miracle worker. His narration style was a first and in a way unsurpassed. As you may very well know, the film wasn't an instant success. A peculiarity it shares with most of the great works of art. The truth is something that needs time to be confirmed even recognized. James Stewart's performance lived from a 2006 stand point is, quite simply, extraordinary. Capra's films were known as \"capracorn\" in their day. Strange to think about it now because its sentimentality wasn't really sentimental but a need to find goodness in the darkest places. The great Capra not only found it, it unmasked it with the same relish that he unmasked evil and greed. My only regret is that on this times of technical prowess we'll never see again the likes of \"It's Wonderful Life\" But, trying to look on the bright side in the most Capraesque kind of way. \"It's A Wonderful Life\" will be around for ever.",
    "116": "Saw this again last night. There are nearly 1,000 reviews of this on IMDB, so there's no need to fully go over the plot again here. My comments are directed at some of the other reviewers' comments, specifically the ones that seem to really, really miss the point of the film by totally misinterpreting what the film's message was.One reviewer from this year says it is \"possibly the most depressing movie ever made.\" I dare say there are over 100,000,000 people who completely disagree with that notion.That review says that other people with serious financial problems will be troubled by the movie because they don't have a town full of people who will come to their rescue.He/she goes on to discuss the portrayal of the town if George had never been born, saying Capra considered bars and nightclubs to \"be the worst thing that could happen\" to a town, lamenting that in 2020 we'd \"all be lucky to have them going again NOW.\" This person points out that \"we can't all have these incredible effects on others' lives like George did; so this makes the viewer...feel like HELL.\"That reviewer finishes with the thought that the note Clarence wrote in the book he left with George, that \"No man is a failure who has friends\" is \"something to really kick you in the gut if you are down.\"There were other reviews I read that made some of the same points, saying things about the film that simply are not accurate.On the finishing point, about nobody being a failure if they have friends. It is a mistake to assume this film is also saying the opposite is true-that anyone without friends is a failure. That sort of thinking would make one think that the man who wrote the book saying \"If you play golf, you are my friend\" is saying if you don't he doesn't want anything to do with you.\" Not at all. The statement is simply saying that this alone makes you his friend, even if nothing else does. In our film, the point is that even if you feel you have failed to accomplish the goals you had (like George Bailey, who never got to build things or travel around the world), and even if you have fouled up things so that lots of people are mad at you (the school teacher's husband who punched him, and also George's wife), if you just have some (one) friends you are NOT a failure.I dare say this is a tremendously positive message (opposite of that reviewer's thoughts) that can inspire the people he's writing about, one having all sorts of troubles in the year of the China virus: Even if your personal world is full of money woes and family bickering, and you feel bothered that life hasn't turned out at all like you thought it would when you were a young adult with all sorts of plans and goals, if you have at least one friend, you haven't totally failed, you are a success in some manner.Some have actually criticized this film for its portrayal of the town had George never been born, saying what's wrong with nightclubs and saloons? Did they fail to observe that this town seemed to be loaded with nothing but such places? Do they not understand what characters said, about how without someone giving these people a loan so they could buy their own home, they'd be renting crummy houses and apartments from Potter, or people like him? You go to any town today that has neighborhoods with few businesses except bars and tell me if it's not obvious the neighborhoods around these areas are full of empty stores and abandoned homes and are definitely not areas where anyone wants to walk along the streets-day or night-because of a terribly high crime rate.Capra didn't suggest a saloon was a bad place-he had one-duhh!-featured in the good town, Bedford Falls, where tough guy Sheldon Leonard was a friendly bartender.The claim that the film is depressing because people know they have not had the tremendous influence on a whole town the way George did. He really did do important things for many, and others feel depressed because they haven't-that's what these critics are saying. I guess they think Capra cold have made an interesting movie if the best thing George ever did for someone was help them fix a flat tire or give them a dime when they couldn't quite pay for the groceries they wanted and he was right behind them in line.If anything, Capra was drawing his audience in to empathizing with George. George, like the typical viewer, felt like he hadn't done anything important in his life. He hadn't gotten to do the great things he dreamt of. He hadn't even become wealthy at all, earning barely $2000 a year in the mid-1940s. He was like these other people who feel they hadn't done much for others. He was shown how he had done far more for people than they realized, and the movie viewer may well think the same of him/her self after watching this film.That makes it the opposite of depressing, at least for most people. The idea is that all of us can be a good influence on others, even if not in such dramatic ways as literally saving lives. I think if you find this film's message depressing, you can easily find any film or TV show or novel to be depressing: \"I can't stand \"Seinfeld\" because those people find attractive new people to date almost every week and I haven't had a date with anyone in quite a few months,\" or \"I hate that King of Queens show because Doug seems to enjoy his boring package delivery job, while I absolutely hate the similar job I have!\" If you are not looking to be depressed by a movie, you will not feel that way watching Wonderful Life.A great part of what made this such a great film is the oft-criticized first half, where we saw all the events of significance in George's life. He led the other boys in saving his brother's life, then stopped the grieving druggist from accidentally killing a customer, then gave up his plans after his father died to save the family business, etc. It's not easy to portray someone as being a big influence when that someone has not risen to some manner of material success-e.g. a businessman who is fairly wealthy but gives lot of money to charity, or spends lots of time helping others in a charitable way. I thought the Building & Loan association was a great vehicle for this. Only a few employees, mostly family members, essentially portrayed as one where money comes in from customers and is used to help others get ahead. If Frank Capra had not taken the time he did to show us how much George had to keep changing his plans when tragedy struck or other things went awry, we wouldn't have had much reason to be concerned about his well being later on.Capra wanted everyone to feel as though their life had value, from whatever friends (including family) they had, and whatever other good deeds they accomplished in their lives. If you think some are depressed because they haven't saved lives or helped someone buy a home like George, then I guess those people would also be greatly saddened by the Miracle on 34th Street movie because they haven't had the good fortune to find someone to marry like Fred and Doris. Christmas Vacation would be a hugely disappointing movie to them because they don't have a joy of a big, loving family, or a job where a Christmas bonus brings enough money to put in a swimming pool and more. Heck, Home Alone could be an emotionally troubling movie for anyone who had a horrible vacation trip around Christmas, possibly made worse by discovering their homes had been ransacked while they were away.In other words, to people with serious depression, ANY movie can make them feel worse, either because their lives are not as good as the characters in a film, OR because seeing sad, unhappy people with serious problems reminds them of their own dismal lives. The criticism leveled at Wonderful Life could fit ANY movie, Christmas themed or not. If a film producer cannot make a movie about people who are troubled, or people who have good things happen, there isn't much left about which you can make a movie.I find this to be about the most uplifting movie of all time, one that points out many of the joys of life-intertwined with the saddest times of life, depicted realistically. George had a fabulous time with Mary at the high school graduation dance-and the pair were really enjoying their conversation on the walk home, when George was suddenly summoned with news about his father having a stroke. I know that almost any year of my life when I can think about something really good that happened, I can also remember something of significance not good happening too.If anyone reads my thoughts here, and reconsiders the movie and decides that it really is a good film after all...then I guess I have made a small, positive contribution today.",
    "117": "My wife and I chose this for our Christmas night viewing even though we have seen it before. It is currently available on Amazon streaming movies.WW2 ended in 1945 and this movie was made in 1946. The premise is straightforward, George Bailey ( James Stewart, 38 at the time) had been a fine boy growing up and now as an adult often gave up his own goals for the benefit of others, like his younger brother. Perhaps too generous, when his Building and Loan business was in trouble he was contemplating suicide as a way out, thinking the world would be better off if George Bailey had never existed.An angel is sent down to intervene, in the last third of the movie George gets to see exactly how his town would have been and in the process gets his head straight.Donna Reed (23 at the time) played his wife Mary who would have been the stereotypical \"old maid librarian\" if George had never existed.Filmed in glorious B&W, the film holds up very well all these years later when one pits it against other very old movies.DEC 2022 update: I am now watching the colorized version on Amazon, it is well done and adds a bit.",
    "118": "I've got my own Christmas tradition: every year on December 25th I watch an amazing and very kind movie called \"It's a wonderful life\" which always makes me burst into tears - first, the tears of hopelessness and sadness and then the tears of joy and happiness. No other movie that I've ever watched was capable of that and that says something.Every once in a while every one of us was frustrated, angry, sad or sorry about this and that in our lives that we hadn't achieved, or hadn't done or hadn't gone out somewhere we wanted to. Every one of us had thought the same thought: are we worth the life we are living? Are we good enough? Would it matter if we were gone or hadn't been born at all? This movie is the answer to all of these questions. This movie is the medicine of all the inner illnesses and aches. It's a wonderful movie!People sometimes forget what a great gift life is. We shouldn't let it go to waste, live it in full, let all the joys and sorrows count, cherish every moment, every person who has come in and gone out of our lives - they're all gifts! Just let it be known and never forget it and even if you do - go watch \"It's a wonderful life\" where one of the greatest actors ever, Mr James Stewart, does the impossible and throws the lasso around the moon and pulls it down. Nothing is impossible if you're a good man in heart.",
    "119": "Now, here is one movie where I will have to disagree with almost everybody. I do not care that this film has become a Christmas staple, and notwithstanding my love and admiration for Frank Capra and James Stewart, this movie is far from even being particularly good, let alone a masterpiece. This is a movie that somehow got hyped up with the passing of time, and now exists in a universe of its own. It is telling that at the time of its making, it did not even receive a single Oscar. Apparently, at the time, nobody thought it to be so special...Now, if you look at this picture objectively and without the typically \"small-town-America do-good pink-shaded sunglasses\", you will find a very simple, obvious and at times boring story. The characters are so simplified, that most are just caricatures of real people (just look at the local villain). Technically, there is nothing to write home about either. The sound, as a matter of fact is terrible, one can barely discern the (sometimes confusing) dialog.And then we come to (according to the masses, and not only) the most important part of the movie: the message. Here is where I have another major problem... I may be cynical or stupid, but I do not see what this all-important transcendental message is; If it is simply 'be a good person', this could have been (and has been) done much better. This movie is a mix of slapstick Hollywood 'feel good' and of political correctness '1947 style'. No wonder it fares so good in our modern times...",
    "120": "Greetings from Lithuania.\"It's a Wonderful Life\" (1946) truly deserves all the praises and kudos it got true the decades. Seeing it first time this evening in 2015, all i can say that this is an amazing movie in every term. I won't going to into plot details as you all probably know it better than me. Try not to smile after this movie - it's impossible. This is a movie making at highest level. Acting is outstanding (it was made in 1946!), especially by a lead James Stewart - he glues the whole picture. Supporting cast is also great. Script is so simple yet so rich and combined with pitch perfect directing - near every scene (litteraly) in this movie clicks and it is just marvelous to watch this story unfolding. Before watching this movie i really didn't expect it to be THIS good, thought it could be a bit overrated, but boy was i wrong - this is a must see picture for every age, for every person.Overall, \"It's a Wonderful Life\" has to be one of the finest pictures. At running time 2 h 10 min this movie never drags, and is superbly involving from start till the last frame. Every scene works here so well, because of great acting, superb direction, great script (simple, yet very involving). The ending is superbly inspiring. I do wonder however about age of some more old characters in this movie, as it seems like they never get old (and some of them should be at around 120 years old by the end of the movie), but it's not even a complain. Watch this movie if you haven't seen it yet - it is an amazing motion picture.",
    "121": "On one crisp December evening, two decades ago, my husband and I celebrated our very first Christmas together as a married couple. One of our yearly traditions, which we established that very Christmas season, has been to settle in front of the TV with a large bowl of popcorn and sodas for a quiet evening enjoying the holiday classics.That evening, my husband flipped the channels and excitedly noted the film \"It's a Wonderful Life\" had just started playing. After learning that I'd never seen it, my hubby enthusiastically said, \"You have to watch this movie - it's one of the best films EVER.\" I guess my prejudice toward black-and-white TV was rearing its ugly head. I was in no mood to watch a dated film that I thought was of no relevance to us. I encouraged my hubby to see if he could find one of the many holiday classics that we enjoyed as kids growing up in the late 1960s, early 1970s timeframe.My husband chuckled and said, \"Trust me, you'll love this story. It's about this guy, George Bailey, who...\" After relating a brief synopsis of the film, he warned me that I might find the first 45 minutes or so to be slow-moving. Still, he encouraged me to pay attention closely. \"Remember everything happening now to this guy, George,\" he advised, \"It'll pay off in the second part of the film.\" As I watched George struggle with his devoted wife to raise their kids and pay the bills, report to a job that he never really wanted, battle his devious nemesis Mr. Potter, and yearn for a life that might have been, I thought - okay, there are some universal themes here. But this was a Christmas film? I couldn't make the connection, and really wasn't in the mood to continue watching anything that wasn't about Christmas.I was getting ready to go into the other room to finish my Christmas wrapping when, suddenly, finally, it was Christmas Eve in George Bailey's little world. I remembered looking at that serene little town, decorated for Christmas and bathed in fluffy white snow, and wishing that I lived in such a place. And just as my husband had promised, over the course of the next several minutes, everything started to come together. By the end of the film, as I watched George Bailey come to the realization, with his cherished family and lifelong friends gathered around him under his Christmas tree that George Bailey, representing every man and woman, ultimately realized that he surely had had a wonderful life. I wiped away a happy tear from my eye, knowing I'd viewed something very special.Then two and then four Christmases later, as I sat in a rocking chair, at first with our newborn baby girl and then her baby brother, I watched It's a Wonderful Life with my babies. I have subsequently repeated this tradition with friends and relatives of all ages. Many of them, like me at first thought they were dealing with an out-of-touch film from the mid-1940s, only to come to realize the timeless, wonderful gift we've all been given by Frank Capra.Since Christmas 1985, I have watched \"It's a Wonderful Life\" countless times. I agree with many other viewers - it is not only hands-down, the best Christmas movie, but perhaps my most favorite movie of all. I love and cherish it for so many reasons, perhaps most of all because it really makes you stop to think about what's important in your own life.And the most special moments of all are those times when I get to share \"It's a Wonderful Life,\" as my husband did that one Christmas so long ago, with someone who is watching the film for the very first time.",
    "122": "James Maitland Stewart was one of the most inspirational and admirable actors who ever lived. Although his range of talents allowed him to effectively play whatever kind of role he wanted, he is remembered most for the roles where he stole the audiences hearts. He was nominated several times for an Academy Award, but won it only once and at that time felt that his friend Henry Fonda deserved it more. In my opinion, James Stewart should have won the Oscar at the very least three times. He deserved the one who received for \"The Philadelphia Story\" (1940). And he should have won it for his performances in \"Vertigo\" (1958) and his most beloved classic, \"It's a Wonderful Life.\" This improving-with-age classic is generally marketed as a Christmas classic, but that's very one-dimensional. Yes, the perfect season to view it is during the said holiday season, but it's about much more than that. It's about life itself and the ups and downs of life and no matter how heavy the latter may be at times, it's well, it's a wonderful life.In the film, James Stewart plays an ambitious young businessman who would rather do nothing but travel the world and build cities (perhaps a reference to Stewart's early ambitions to be an architect?) but his generous heart and the constant shortcomings of his friends continually puts him behind in his own life. When his troubles become so heavy and so depressing to the point where he ponders over suicide, he is visited by a strange man (Henry Travers) who turns out to be an angel wanting to show him how the world would have been if he'd never been born.I guarantee you that most if not all storytellers of the past sixty-some years wanting to generate a character that would win over the hearts of the audience have used this masterpiece for reference. Jimmy Stewart was just warming up at winning over your heart with another collaboration with Frank Capra, \"Mr. Smith Goes to Washington,\" here he just steals your sympathy with every scene he's in.As for Stewart's supporting cast, well, let's just say he had a great collaboration to work with. The enchanting actress Donna Reid is fantastic as his love interest, Lionel Barrymore is superb as the conniving greedy businessman Mr. Potter, the great Thomas Mitchell gives another fantastic performance as Stewart's bumbling uncle, Ward Bond is terrific in his supporting role as the kindly town sheriff, and of course, I cannot leave out Henry Travers who is absolutely lovable as the guardian angel who comes to teach Stewart about the gift of life.\"It's a Wonderful Life\" is one of those rare films. Like \"Casablanca\", it does not wear down even as decades go by. It's only gotten better with age. James Stewart said it was his personal favorite out of all of the movies that he made in his illustrious career in Hollywood. Is it my favorite Jimmy Stewart movie? No. But I will tell you this. It is so sweet and moving and enchanting and wonderful that I held back a lot of what I wanted to say in this review because I don't want to give any more away than what is necessary. There's only a handful of movies that I will do that for. Because there is so much to be seen here and every minute is absorbing and beautiful.And one more thing. You know that feeling you get—that really, really good feeling in your soul—whenever you see a really, really good movie? If you want to revisit that sensation, see \"It's a Wonderful Life\" as soon as you can. And the beauty of it is, you don't even necessarily have to wait for the Christmas season to do that.Rating: 4/4",
    "123": "It's a Wonderful Life is an epic story of the life of a man named George Bailey. George spends this life living in a small town, with his nose deep in the lives and problems of its other citizens. He dreams of seeing the world, of conquering it, but somehow always postpones that in order to battle his arch-nemesis - the ruthless local businessman Mr. Potter. Potter perpetually has his sights set on utterly dominating the town's cash flows and, effectively, its life. The idealistic and charitable Bailey family, especially George, are the one thing that persistently prevents Potter from succeeding.However, George has his share of troubles, and they eventually begin to take their toll on his good nature and optimistic outlook. It's now up to his guardian angel, Clarence Goodbody, to open George's eyes to how wonderful his life really is.IAWL promotes friendship, empathy, optimism, and love of life. You can't but admire the excellent way in which it does this. The story, the sets, the actors, the dialogue, the music are all top-notch. Highly recommended! 9/10.",
    "124": "I've only watched this revered classic film one time. It was okay but disappointing. I expected more after hearing of its great reputation. True, it was interesting but it had too many frustrating and annoying parts for my tastes. It was not the feel-good film I was expecting.I admit the ending was terrific and brings a tear to one's eye with an inspiring message but much of the film deals with tough breaks that \"George Bailey\" (Jimmy Stewart) had to face and also featured a very mean, despicable dishonest man in \"Mr. Potter\" (Lionel Barrymore). A lot of those scenes were not fun to watch; more frustrating than anything else. The movie has several scenes in which Bailey isn't the best person, either, but it could be argued that everyone has their moments, so why not him, too? Since this is so beloved a film, and such a Christmas favorite, I just expected more of a nice, lighthearted, good-natured story. Instead, I got a very dramatic movie with a number of unpleasant scenes.Interesting that this would be a Christmas favorite when Stewart's character admits he doesn't know if God answers prayer, or if He's even there. All of this coming from a guy who's attended church for years? Well, at least he found out, and it was a good message.The \"message\" was that everyone's life counts for something, that life is important and what you do with it especially important because it effects not just you but a number of other people many times in ways you could never imagine.To its credit, the story is an involving one. I will have check this out again and perhaps, with a different outlook going into it, will learn to like this film.",
    "125": "Watching this film in the wake of the banking crisis, it is apt to have a different effect on the viewer than that intended. The actions of George Bailey and his father amount to a long justification for \"sub-prime\" mortgages,\"sub prime\" being a euphemism for \"lending to people who have no chance of paying you back\" which has lead to the present day bank bailouts which means that responsible people now must pay for the actions of the irresponsible. Why does doing this make George and his dad the good guys? Why, for that matter, are we told that George's father only made enough money to send one of his kids to college? Is that meant to be good? Surely, in the real world, that would make him a poor father? He has clearly never heard the truism \"charity begins at home\" although he did have enough money to hire a black servant..perhaps he should have saved the money he spent on her to put his kids through college? Just a thought.Obviously Hollywood will never get to grips with the real life implications of the Bailey's irresponsible lending policies, ie people being lumbered with unpayable mortgages and losing their homes. No, this is the land of magic pixie dust where good intentions always lead to good outcomes. The reality is transformed into a one dimensional baddie, an evil capitalist who could come straight out of the Stalinist propaganda of the period (in fact this film could have easily be shown in the USSR without a single cut whereas it was -rightly- a box office flop in the US). Oh, if only there weren't these greedy evil people, if only banks could lend money to good people without worrying whether they could pay it back, then how much nicer the world would be! Around this childish morality, a sanctimonious and saccharine story is built. Even by Hollywood's golden age standards it is extremely sentimental. I must say in passing, I've attempted to watch this film many times, but this this is the first time I've managed to make it all the way through and only through gritted teeth.",
    "126": "Is life really wonderful? I'm certain a lot of cynics would like to disagree from the outset. Sometimes I'm one of them it seems. But back to this and a man (Stewart, always good and good looking) that has done a lot of good ... but seems to get into trouble nonetheless. He's only human after all - but who could help him? Well other humans, but not in a direct way.Especially the later part of the movie takes off, giving us a payoff that we deserve I'd say. It's fascinating how much people seem to be in love with this movie, but it makes sense. It shows that through all the struggle, there can be hope. Even at your lowest point possible, never surrender, never give up, never quit (wait is that the Cobra Kai mantra? Also did I offend you by even comparing that? It doesn't make sense I know ... right? I think ... let's get back to the movie shall we?).So while there is a simple tale here (if you think about it), it is also a morality tale. It is a tale with a social but also personal message! And it is also a message of humanity and strength and the will and the mental strength to overcome hurdles ... A Christmas Carol has similarities to this, though I have to admit, I don't know how intended they are ... I'd guess more than intended, but that's just me. So sit back and enjoy a family film that has its ups and downs and may feel dated at times, not to mention predictable and putting the viewer ahead many times when it comes to knowing stuff way before our lead character does ... but one that is as feel good as they get ...",
    "127": "So, if Jimmy Stuart had really lived I wouldn't sip a Martini now - but I would know and maybe even befriend a valuable citizen called MISTER Martini who lives because Lionel Barrymore died at the right moment? Or is it the other way round? I liked to speculate along those lines, when I was a child.Watching It's a Wonderful Life made me quite mad. The message is pretty cruel. It goes like: you are needed here and don't you dare planning to go on a world trip or anything like that. It's for other folks only. This strongly smells of Calvin's doctrine of predestination which, some say, is one of the foundations of the spirit of the USA. The main character is practically denied a free will, due to the circumstances a non too benevolent god arranged for him. I must admit, Stewart's hysterical shrieks on the bridge, as it dawns on him how valuable he is for the community, sounded to me like the first signs of full fledged madness.Ironically, the Potterville Stewart's character prevents through his sacrifice seems to be a much more thrilling place than the Bedford Falls he preserves, at least to a modern day audience. I am not against modesty, a good community spirit and loyalty, but inertia and values that are declared absolute and unchangeable will not help to solve the world's problems. I don't know how Frank Capra weathered the HUAC hearings, but the rigid categorizations of the citizenship this movie makes in order to propagate American values could well have pointed at him as a Commie sympathizer\".James Stewart's George Bailey is the exact opposite of Gary Cooper's Howard Roark in The Fountainhead, made three years after this movie. The both represent American extremes in movies that I find overbearing and simplistic.",
    "128": "`George Bailey is a pillar of his community whose life has been selflessly dedicated to the welfare of others.  Through the evil machinations of the town's business mogul, George is driven to the point of suicide.  In answer to the prayers of the townsfolk, a missing angel comes to the rescue.  He shows George what a sad and sorry place the town would have been without him.  Can this life George out of his despair?'Who hasn't seen this film?  Anyone?  It is an unashamed tribute to homely values and is hugely warming.  The story itself is not exactly rocket science, but it is does contain plenty of nice touches as we follow George through his life of missed opportunities and sacrifice through to his marriage and eventual down fall.  The world that this happens seems so distant nowadays, with our friendless society - so few people do anything for their fellow man in big cities etc.  So this is very touching to see a man who serves others in such a major way.  It is a story of how every little helps and how you cannot overdo friendly gestures.Stewart is excellent with his partner Capra.  Barrymore is also excellent in a thankless role - he represents all that is wrong in society and of course he rises to a powerful position.  Henry Travers is good as Clarence, the wingless angel and of course who can forget the excellent Donna Reed as Mary.It's pure hokum of course, the regular Christmas movie that lifts everyone's spirits.  But isn't this what we all wish the world was like really?  Why can't it be - if only for two hours.  This is what Stewart and Capra do best - enjoy and forget the real world.",
    "129": "George Bailey (Jimmy Stewart) thinks he has a dreadful life. He runs a loan association in the small town of Bedford Falls. The company is always on the verge of bankruptcy and is constantly fighting the evil Mr. Potter (Lionel Barrymore). He is married to an adoring wife (Donna Reed) and has three children. One Christmas Eve he is on the verge of suicide until his guardian angel (Henry Travers) shows up to stop him. No other word for it--it's a classic! Hard to believe this was a bomb when it first came out...it's reputation didn't even start till the early 1980s with repeated television showings. Basically, there's nothing wrong with the film. The script is well-written with realistic well-drawn characters. What really makes it work is that the movie doesn't make Stewart a goody two shoes--he's really unhappy and mean in the first section of the film. It makes his \"transformation\" at the end more believable and realistic. Also it's one of the few movies that has an ending that will have the entire audience crying--out of happiness. The acting is just great all across the board, the set design incredible (Bedford Falls was on a sound stage!) and is heart warming without getting too sentimental. I usually hate films like this but I've loved this since the first time I saw it and make it a point to see it every Christmas. A true classic. Highly recommended.",
    "130": "Count me among the proud minority who think this movie is drek.I love old movies. And I like Jimmy Stewart a whole lot. But this thing is just awful. And the fact that we are barraged incessantly with it, and that people rush to gush over it, just makes it all the more unbearable.My big problem with the whole thing is that I vociferously *reject* the movie's main premise, the moral premise that it is somehow good and right and wonderful to live only for others. George Bailey is a *doormat*; he never pursues the life he really wants, instead suppressing his desires in order to serve every other yahoo in town. He's a fool, and the only ending I would consider truly happy for him would be if he were to decide to close his pitiful, practically non-profit business, and go off and make something of his life. I'm sorry, but having a lot of people be grateful to you for being a willing doormat is just not making something of your life.I'm sorry, I just can't like a movie that takes altruism so far as to say that the only value of your life is how you helped others.",
    "131": "It's Christmas Eve in the town of Bedford Falls and George Bailey, a man who has spent his entire life sacrificing for others, is thinking of taking his life. Knowing George is in trouble, though perhaps not the extent, his family and friends pray that God help him. And that's exactly what He does -- in the form of an angel named Clarence. Throughout the bulk of the film, Clarence is brought up to date on George's life (as are the viewers). From childhood to adulthood, he sees that George has been a heroic noble soul, giving until it hurts and then giving some more. In order to save George, Clarence must show him what an impact he has had on the world and those he loves. James Stewart's performance is flawless. One of the core strengths of the film is how it covers so much emotional ground. From happy to sad to angry to loving, Stewart masters it all. He's an actor who appeared in virtually every kind of film and that helps here as he has to handle drama, romance, comedy, fantasy...even a little action thrown in for good measure. His performance in this film is my earliest recollection as a child of being in awe of an actor.Lionel Barrymore gives a career-defining performance here. For generations to come, he would be remembered as the villainous Mr. Potter. He had a storied career, full of so many different parts and very few of them were bad guys. One of his best roles was the gruff but lovable and wise Dr. Gillespie in the Dr. Kildare series for MGM. So it's kind of ironic that Barrymore is best known for portraying a thoroughly rotten man. But that's the talent of the man. He breathed life into Potter and made him so hissable.Such a great cast. The wonderful Henry Travers has his career-defining role, as well. Who doesn't love Clarence Odbody, AS2 (Angel Second Class)? The heavenly Donna Reed. She positively glows in this film. As a kid watching I thought she was the most beautiful woman in the world. I think it again every time I watch this movie. Ward Bond and Frank Faylen as the ORIGINAL Bert & Ernie. Gloria Graham as the sultry Violet Bick. Samuel S. HInds and Beulah Bondi as the Bailey parents. The amazing Thomas Mitchell as Uncle Billy. Who can forget H.B. Warner's moving performance as Mr. Gower? William Edmunds as Martini and Sheldon Leonard as Nick the bartender. Todd Karns as Harry Bailey. And all those wonderful child actors playing the Bailey kids as well as those in the flashbacks. Just a perfect cast.Frank Capra, one of my absolute favorite filmmakers, does such a brilliant job at directing here. Amazing pace. The film never slows down but never feels rushed. He worked from a script that had many authors. Normally, this would be a terrible sign for a film and would almost certainly mean it was a disjointed mess. But that couldn't be further from the truth in this case. The script is tight, flawless even. Wonderful lines, memorable scenes. So many memorable scenes. It's hard to even pinpoint which to talk about because the entire movie is one classic scene after another. But I'll try. There are brilliant scenes like \"George Lassos the Moon,\" the bank run, the childhood confrontation with a grieving Mr. Gower, or the wonderful ending. But here are two of my favorites. The phone call scene where George and Mary share a phone. Such a sensual, romantic scene as they give into their feelings. The prayer in the bar is such a moving scene. Stewart's performance is so powerful here it's criminal he didn't win an Oscar for this role. So many more unforgettable scenes I could mention.I think of it as the greatest film ever made. I know there are some who will knock that. I realize there are all kinds of technical and cultural reasons that this film or that is the greatest. Citizen Kane, for example. While I love Kane or the Godfather films or countless other contenders, most of them are purely dramatic works that don't have for me what this film has: compelling rewatchability. It's my favorite film. It's as simple as that. I have seen it countless times. It's a beautiful story with Dickensian touches. A charming, funny, dramatic, sentimental, romantic, uplifting movie that makes me happy.",
    "132": "This will be my 100th comment on this website, and, it stands to reason that I should pick an all time classic movie such as \"It's A Wonderful Life\"!! This film is Frank Capra's best film ever... A statement of this nature tells you how remarkable this movie truly is!! Jimmy Stewart was voted by one magazine as the second best performer ever in the history of Hollywood!! Only second behind Katherine Hepburn, making him rated the best actor in the history of movie making!! While some people may question this assessment of Jimmy Stewart, due to Jimmy Stewart's innocuous Huckelberry Finn disposition, I can empathize with this verdict of Stewart's acting on account of his precisely executed latent tendencies which ultimately resonated into an articulated anger!! Jimmy Stewart's acting is very itemized, and thus, it establishes emotions which are genuine, these emotions relegate Stewart to a vulnerability which was pertinent to the fact that his feelings which could no longer be bottled up inside of him, would make him obtusely erupt!! Donna Reed is in this movie, and her performance is very believable as well!! Lionel Barrymore is extremely adept at playing the role of the ogre (Mr Potter) who is metaphorically writhing in his acquisition of the Baily Building and Loan!! This movie is the classic Christmas movie of all time!!, \"Miracle on 34th Street\" and \"Fantasia\" as well as any other Christmas movie, do not capture the spiritual camaraderie related to the yuletide association with caring and benevolence that \"It's A Wonderful Life\" exemplifies so flawlessly!!What the film \"It's A Wonderful Life\" accomplishes is the ideology behind the true meaning of what Christmas signifies... This phrase in of itself sounds very rhetorical, however, with a movie like \"It's A Wonderful Life\" such an accolade is the genuine article!! \"It's A Wonderful Life\" resembles the movie \"Best Years of Our Lives\" in the manner by which a happy ending is attained the hard way!! Often times, we look at our lives and become demoralized at the uneventful banalities which perpetually plague us!! We are depressed at how money dictates virtually everything, and, as was the case with George Bailey, we become trounced by failure and despondence!! Adversities are what make us cohesive, considering that this film was made right after World War II concluded, we as Americans were thoroughly aware of such a fate!! The fatal predicament which besieges George Bailey in this movie arouses occasion for all of the good citizens of Bedford Falls to bond together and realize the importance of caring for each other!! Such a homespun philosophy was anything but an artificial panacea, and with it, Americans immersed themselves into a nationally guarded perspective of good will and compassion!! This film is outstanding!! The talent and the ideological premise to this film, has out-shined virtually every other movie made!! A socially responsible movie is entitled to the luxury of a heartfelt happy ending, especially if it has been earned!!! Films which make people feel fortunate are not breaking any rules which compromise the quality of a film!! All of these carefully devised components to this film make \"It's A Wonderful Life\" an absolutely magnificent movie!!",
    "133": "I like a lot of director Capra's films - but not this one.This is among one of the most vile floods of slush ever to be photographed. The characters are simpering when they aren't whining. James Stewart give us the worst, most over-wrought performance of his career - high-school student do better. The camera work looks expensive - and dull. The editing is perfunctory. There's no effort to use film to tell the story.The story itself is a banal rip-off from \"The Christmas Carol\" - but the worst part of it is that Stewart's character spends his every moment visiting the 'alternate universe' (that would have happened had he never been born) trying to convince everyone that he really was born, and there is no 'alternate universe' - which makes no sense whatsoever, and completely blows any chance at insightful or revelatory alternate character development, and reduces his final submission to fate to a rather cheap, histrionic \"gee, I'm sorry; let's try it again, OK?\" The raw cynicism that went into the making of this film - kept alive by generations of movie-reviewers as a kind of shared in-joke (\"hey, let's face it, most Amereicans are just dumb\" - would be frightening if it hadn't sold so well - which is the really scaring thing about it.",
    "134": "I'm very fond of Frank Capra's many films.He was of Italian American ancestry while I am of Greek, Albanian and Turkish ancestry. Like him, I see America as a land of opportunity which when it keeps its promises is at its best.Capra's films keep telling the same story, but in different ways. In this one, he uses an amazing story device; he has the main protagonist wish that he had never lived, and then God sends an Angel to show Jimmy Stewart as the main protagonist exactly how everyone's life would have been different if he had never lived.By doing this, Capra shows the importance of COMMUNITY and CARING for one another, and also demonstrates his deep faith in the Church and in the Lord.This is far and away Capra's best film, and far and away the finest Christmas film ever made.Hodie Christus Natus Est.Zuzu Bailey: Look, Daddy. Teacher says, every time a bell rings an angel gets his wings.George Bailey: That's right, that's right.George Bailey: Attaboy, Clarence.",
    "135": "The strangest thing about life is how much one person can really be a importantly link to a whole. Whether it's by free will alone, divine design/power, or even both it will never been known, what is known are the results that one person does which can be extraordinary and part of what creates the whole. This is a Christmas/fantasy film I really like that I can come back to every once in a while. It really is a film that actually is pretty dark but also does in a way make you feel good, but most importantly causes you at times to evaluate your own life.There really isn't much I can really say that hasn't already been said. What really matters is the story itself which like all great stories despite how much time has passed it is timeless. The film in a way is kinda a Christian film since there are some Christian themes as well as influence that intervenes.George Bailey is kinda a Christian hero, and like most of them you actually feel a sense of heavy pathos for the guy. The guy had to unfortunately put all his dreams on hold, all to do the right thing for others. I like that he's a bit reluctant, he doesn't really want to be selfless, nor does he even enjoy doing the right thing which I'll admit is something I can emphasize with from time to time. However all the same he does it whether he wants to or not because there is no one else that will, or is even strong enough to. Like with most of Capra's films, they have one thing in common showing that being a good person isn't always the easiest thing to be.Even though George doesn't look like he has all the breaks, personally I think he does, his life actually is pretty good, he's got lots of friends, he's not boring, is active does things with himself, sure not the biggest adventure or exactly an event a minute. To me I always believed sometimes the smallest adventures are biggest, because of what you do during your lifetime. Unlike the antagonist Mr. Potter whom really just like his riches he holds doesn't do jack squat with himself, I can understand where the guys misery originates from but it's no excuse nor give him the right to ruin anyone elses life.Other than the drama, I really like the fantasy aspect which was the first or one of the first times they ever constructed an alternate scenario. This is a common place format now done in many TV shows even comic books, but this film was one of the first and I feel still the best. The alternate scenario I felt was believable because it sort of plays out the notion that we all think of everyday, what if we were out of the picture, or we made that decision instead, or did that. Indeed it would of been a very different world, and of course we see this world without Geroge which is practically a cesspool as we see the blowhole Mr. Potter has fraked up bad. It really is disturbingly believable as George and we see how miserable most residents are, grungy and dirty Bedford falls is, the people that have been deceased because he wasn't around.The film has two really good messages, the first on the importance of exercising selflessness, it not just benefits the people around you but yourself as a person. But also about valuing your life that it really does matter whether you live or die, because of how much it is connected and affect the whole.One person does matter because one can do a whole lot in a single lifetime.Rating: 4 stars",
    "136": "So often the movies that claim the top spot on people's \"Best Movies\" lists are iconic films that are suitable to watch any time of year. \"Gone With the Wind\", \"Casablanca\", \"The Godfather\", and many more would easily fit into that category, and certainly those movies along with your favorite that I'm leaving out all should be in the discussion whenever we talk about the best movie ever made.But whenever I'm asked that question, be it now (five days before Christmas in 2014) or in mid June or July, the movie that I always come back to time and again is the iconic Christmas movie, \"It's a Wonderful Life.\" This movie is the greatest film ever made.The film features James Stewart as George Bailey, a man who dreams of seeing the world only to be a victim of fate that finds him staying in his hometown and running the family business, the Bailey Savings & Loan Company in the fictional town of Bedford Falls. James Stewart turns out the performance of his career (barring no other role, including \"Mr. Smith Goes to Washington\"). The tale sees him fall in love with Mary (Donna Reed, who offers a similarly strong performance as supporting actress). The two are wed and life goes well for a while, until a fateful day when George's world comes crashing down on him, prompting him to wish he had never been born...only to eventually realize what a wonderful life he has.The story is of course much more complex than that brief summary, but it's the story itself that is the most prevalent star in this movie. The script is a masterpiece in the art of conveying an entertaining and emotional narrative, taking the viewer on a roller coaster ride of emotions. Over the course of two hours you grow to love George Bailey for his character and his perseverance in standing up for the little guy against the tyrannical Mr. Potter, the film's antagonist. When George is elated, you feel it with him. When the frustration of life overwhelms him, you sympathize with him. When he finds himself in the midst of great despair, your heart breaks. And when his grief turns to joy, your heart swells....along with your eyes. I cannot watch this film without crying time and again in its final minutes.Along with the acting and the script, the other major contributing factor to this movie being such a wonderful film is its cinematography. I have seen this movie pop up on \"film noir\" lists from time to time, and I'm not sure that I would agree with that categorization at all, given that film noir movies tend to be more tragic in nature. That said, though, there are a few scenes in which the film uses strong shadow effect in a similar way that noir films are known to do. In at least two scenes, Stewart is shown staring prominently into the camera as he realizes the gravity of certain situations he finds himself in. Those scenes become impressed in your memory after you've seen the film a time or two, and overall the film is well produced with good scenes and settings, and good camera work.All of this makes \"It's a Wonderful Life\" my pick for the Greatest Film Ever Made. We may not always think of it immediately when we're sitting around the picnic table in the summertime thinking about great movies, but it's nevertheless a top notch movie that stands out for its artistic and cinematic value in a way that makes it much more than just a \"Christmas movie\". The wonderful story and well constructed script, the tremendous acting, and the excellent camera-work and film production all make this movie the cream of the crop.10 out of 10 stars!",
    "137": "The drama fantasy It's a Wonderful Life is directed by Frank Capra and stars James Stewart, Donna Reed, and Lionel Barrymore and it takes place in a modern day small town.The film starts off with angels talking about how a man, George Bailey (Stewart), needs help to make his life better. The angels decide to send a second class angel, Clarence, to go and help him. But before sending him they give him all the important details of his life. The first one that is shown was when George Bailey was a child and saved his brother's life and stopped the shopkeeper he worked for from selling poison tablets. Then it showed when George Bailey was older and how he dreamed of traveling the world but at any chance he got he had to do some sort of work for the loan shop he was in charge of. He fell in love with a young woman named Mary Hatch (Donna Reed) but struggled to gain her as his wife. This film is excellent and has a morale that everyone needs to hear, a timeless classic.Frank Capra directed this film brilliantly. It was truly sentimental and he made it so you could feel the emotions of George Bailey. There were quite a few classic moments that he created in this film such as when George asks Mary is she wants for him to lasso the moon for her. Capra truly created an excellent film.The writing of this film was pure bliss. There are not that many films out there that have a sense of purity such as this one and that is intended for all audiences. There were many ups and downs on this ride and it left you completely satisfied.The acting by the whole cast was remarkable. James Stewart gave a great performance as George Bailey never being able to get what he really wants and being extremely stressed by all the tasks that he has to do. Donna Reed was great as the love interest, providing much support for Stewart's character to grow off of. Lionel Barrymore was great as the big business man in town trying to buy up everything and keeping Bailey down. Excellent performances for an excellent film.Overall I give this film a strong 9/10, it is truly a timeless classic from the legendary Frank Capra. I recommend this to absolutely everyone young and old, it is a truly heartwarming story that has already gone down in film history.",
    "138": "This film is one of those that any movie lover sees at least once in their life, if only because it is so talked about and so respected among moviegoers. However, I got the feeling that the movie, despite being really good and entertaining, doesn't justify so much buzz. It's a good movie, and there's no doubt about it, but it's not exactly a work of art, as many good commentators have argued. In fact, from the filmography of those involved, it's a film that doesn't even stand out: James Stewart is much more interesting in Hitchcock's films, who knew how to get the best out of the actor, and even Frank Capra made films as or more remarkable than this one.The script is very simple: an angel is sent to help a man at the most difficult moment of his life, when everything indicates that he will be arrested after sacrificing his life and dreams to maintain the firm that his father left him, and that prevents an unscrupulous local millionaire from completely taking over the city and doing what he wants with the people who live there. We are, therefore, facing another Christmas movie, where faith and hope are the main focus. The script, well written and effective, is one of the film's strong points: in addition to bringing us a good story that appeals to the whole family, it is based largely on a main character so pleasant that it is impossible not to like her and just watch. The movie just to see how she will overcome the challenges that lie ahead.The cast is headed by James Stewart, one of the great actors of this time, in another excellent work. At his side, however, are other excellent actors such as Donna Reed, Lionel Barrymore or even Henry Travers. The cast's overall performance is good, but that's not what makes us want to see this movie. Deftly directed by Frank Capra, the film has a leisurely pace but doesn't waste a lot of time in exaggerated consideration, doing its best to keep the story going.Technically, it's a regular film that makes the most of the resources available at its time, without overshadowing the story it wants to tell, nor going to the director's head, determined to keep the film in a direct and relatively frank record. The black-and-white cinematography is very good and pleasant, and everything was excellently shot, with sharpness and clarity. The editing work was also well done, and the cuts are barely noticeable. The sets and costumes are well done, the dialogues were very well written and there are many memorable moments.",
    "139": "One of the all-time Christmas classics, this excellent piece of work from Frank Capra focuses on George Bailey (James Stewart, in one of his career-best roles) who is stopped from jumping into the river in despair by a friendly angel called Clarence (Henry Travers). We then see in flashback what has brought George to the brink of suicide and key events from his life - saving his brother from drowning when the ice breaks; alerting his chemist boss to a fatal mix of drugs; courting and marrying his childhood sweetheart (the winsome Donna Reed); and dealing with the film's token bad guy, Mr Potter (brilliantly played by the crusty Lionel Barrymore). Clarence then shows George what the sleepy town of Bedford Falls would have been like without him and proves that you're never alone if you have friends around you and if you make a difference.Interestingly, two direct influences from this film were on the poetry e-zine 'Zuzu's Petals' (George Bailey's little daughter, who leaves some flower petals in his jacket); and, so it is said, on the children's TV programme, Sesame Street (Bert and Ernie, the mad puppets, who are the names of the cop and the taxi driver in this).And let us not forget, when you hear a bell ring, it means an angel has got its wings!",
    "140": "What do we have here? Could this be the most positive film ever conceived? Was this made for children or for the whole family? Was it crafted for suicidal maniacs maybe? No, no, it can't be that; too dark for children and too childish for adults. I don't like to use the word \"dated\", but this is what I would call a dated film with a dated (now cliched) message.\nWell, it has an intensely naive positive message, but maybe necessary for that period. But why so much optimism? Could have been because of the post-war overoptimism? The Post-World War II economic boom? Could be.\nThe film is clearly flawed, objectively speaking. The main problem is the protagonist. With just a few occasionally bursts of anger towards the end, he has a flawless character. Altruistic, nice, tolerant, idealistic, etc etc. He is the perfect white boy. The antagonist is pretty much the antithesis of the main character. Stereotypical Walt Disney cartoons-like characters? Well, almost. Almost! Also, this is a fantasy film not because of the fantastic elements, but because characters act unnaturally during specific events. Some moments are too cartoon-ish and unrealistic. At least those moments are funny, so I can forgive this aspect (this is actually the case in many classic American movies).\nWell, I appreciate the subtly dark undertones of the film and even the cartoon-ish humor.\nI repeat, this film may be too dark for children, too light and naive for adults and too cliched for today; objectively, this is a dated film.",
    "141": "Touching , exciting story about an attractive man who is so busy helping others that life seems to pass him by . The Oscar-winning filmmaker Frank Capra provided a splendid movie that could justifiably lay claim to being one of the best pictures ever made . Fun and charming study of a friendly man called George Bailey (James Stewart) in charge of a modest building and loan company, and his tangles with wealthy and powerful bankers (Lionel Barrymore) . Along the way , George Bailey becomes engaged to a beautiful and good-natured woman (Donna Reed) . Wonderful news...about wonderful people!...in a wonderful picture! It's a wonderful love! It's a wonderful laugh! James Stewart and Donna Reed in Frank Capra's It's a Wonderful Life. Where wishes come true... where angels are real... The greatest gift of all... is right at home. They're making memories tonight!. Wonderful! Wonderful! Wonderful! How could it be anything else?. Frank Capra's...\"It's a Wonderful Life\". Celebrating 65 years. The most loved Christmas film of all time! Original & colour versions. Every time a bell rings, an angel gets its wings. Continues to weave a special magic. They're going steady...straight to your heart! You'll love them all for giving you the swellest time you've ever had!. Only the Magic of Frank Capra...could transform this beautiful play into the finest picture of all time! From the Master Picture Maker.. The greatest motion picture of the past decade ! The Year's Outstanding Picture!Amusing and entertaining Frank Capra film in which you go to live a glorious experience with the grandest group of human beings who ever dared to lead their own happy lives . The final is is a real tearjerker and if you don't agree with Capra that life is actually like this then you might go along with sentiments that it ought to be . James Stewart is at his best as the young asked by an angel to reflect on his life when he sadly contemplates to commit suicide . Stewart was tapped for the lead character right after he left the service at the end of World War Two . Here stands out Henry Travers who performs the good-tempered angel and Lionel Barrymore as the ambitious and snobbish banker , as he was suddenly crippled at the outset of the movie by the arthritis that had been troubling him for years. Frank Capra put a plaster cast on Barrymore's foot , highlighting a long number of prestigious secondaries. Along with the starring , the great James Stewart giving stunning performance , appearing here and there an enjoyable cast playing all kinds of outlandish characters , magnificently interpreted by Thomas Mitchell , Henry Travers , Beulah Bondi , Frank Faylen , Ward Bond, Gloria Grahame, H. B. Warner, Samuel Hinds , Frank Albertson , among others.The motion picture was stunningly and compellingly directed by Frank Capra . This classy director Capra carries out a sharp dissection of the attractive roles , of the social classes and delivering good acting from the prestigious actors . Frank Capra was an expert in manipulating emotions such as proved in his films in the 1930s and 1940s , as he influenced the lives and beliefs of people of the nation with movies as 'Mr Deeds goes to town' ,' It happened one night' , 'It's wonderful life' , 'Mr Smith goes to Washington' , ' Mr Deeds goes to town' , 'Meet John Doe' , 'State of the Union' , and 'You can't take it with you' , it gave him his third Oscar for best director and his second for best film. Rating : 8/10 . The results are certainly warm and really wonderful . The flick will appeal to James Stewart fans , as well as Frank Capra enthusiasts. Well worth watching . Essential and indispensable seeing.",
    "142": "This enduring, popular story tells of George Bailey (Jimmy Stewart), a dreamer from the small town of Bedford Falls who's itching to get *out* of town and accomplish big things. But, due to his kind and compassionate nature, he ends up sticking around for years, always attempting to *help* people. Then, at one point, all seems lost, and a deeply despondent George seriously contemplates suicide. An angel named Clarence (Henry Travers), who still yearns to earn his wings, intervenes and makes a difference by showing George what life in town would be like if he'd never been born.I can believe that movie lovers consider this one of the most inspiring films of all time. It shows us how that each of us *does* leave an impression during our time on Earth, and how much some of us really *do* make a difference in the lives of those close to us. As Clarence says at the end, \"No man is a failure who has friends\", and these are words to live by. George spent a lifetime earning his friendship with others, and provided a rock for townspeople in rebelling against tyrannical, pathologically greedy Scrooge-like cretin Mr. Potter (Lionel Barrymore), who aims to own the whole town - lock, stock, and barrel.\"It's a Wonderful Life\" is full to the brim with acting talent, with familiar faces (Thomas Mitchell, Beulah Bondi, Gloria Grahame, Frank Albertson, Samuel S. Hinds, etc.) in a great many roles. Barrymore is a completely effective villain, making you hate his character in record time. Donna Reed is absolutely enchanting as Mary, the love of Georges' life. And Jimmy himself is totally believable - a principled, amiable, dependable sort of average guy. I particularly enjoyed character actors Ward Bond as Bert the cop and Frank Faylen as Ernie the cab driver (as you may have guessed, this is where 'Sesame Street' got the idea for the names for two of their popular puppet characters).The film is fundamentally a solid story that's very well told by filmmaker Frank Capra, with moments both very funny and incredibly poignant. It's very well acted and expertly made, and would make for good viewing any time of the year, not just Christmas time.Nine out of 10.",
    "143": "Stewart plays the saintly George Bailey who, on the brink of committing suicide, gets sent an angel to sort things out in order for the angel to earn his wings. Hilariously parodied by more contemporary films and series, not excluding Married With Children, the idea and execution, let's be honest here, is trite and cloying. Stagy performances and a dragging screenplay is really all that there is for the viewer to mercilessly swallow while the lengthy running time of the film brutally tests one's patience. Had the director shaved off 30 minutes or so from the excruciatingly melodramatic and repetitive second act, the movie would have been far less exhausting, though the silly what-ifs the story puts forth wouldn't have been any less clunky and witless. Despite the technical achievement, which is impressive for its day and age, this is one of those classics the popularity of which simply lacks credibility. Perhaps Grandma and Gramps are still able to look kindly on this overblown, saccharine monstrosity, but anyone under 60 shouldn't be subjected to it.",
    "144": "The first time I am aware of seeing IAWL I managed to catch the last 5 Min's of the movie. It seemed to feature a character running around shouting 'Merry Christmas' at everybody, followed by a party where everyone handed over money To be frank, I wasn't in a hurry to see the rest of the movie. Then several years later, I started to watch IAWL from the beginning, unaware that it was the same movie. I was struck by how comprehensive the character study of George Bailey was. He was a good man, but his ambitions were frustrated at every turn. He wanted an Education, that was just outside his grasp. He wanted to travel, life conspired against him. At every step of the way, one person saw George 'rolling with the blows', that was Mary Hatch. This woman loved George and wanted to stand at his side, so they can face the slings and arrows of misfortune together. This is love of the purest kind.But even Mary's love cannot prevent George contemplating suicide. A single bad day that sees George on the top of the World at the beginning and thinking that taking his own life is the only way out by 10.45 pm.I was stunned when the ending turned into the movie I had seen some time before. But this time I understood, this wasn't just sentiment for it's own sake. To understand the ending you need to have gone on the same dark journey that George Bailey had been on.Many others have commented on the feel good aspects of the movie, so I won't. What I would like to say is that there are a number of scenes which live in the memory long after the end credits.Young George trying to persuade Mr Gower that he had prescribed poison (with young Mary Hatch Looking on).George hurrying home when he heard his father had had a stroke (with Mary Hatch looking on).George waiting at the station with Uncle Billy for Harry to come back from college (only to find Harry is already married and has a job that will keep him away from Bedford Falls).That kiss (I have to check that I am earthed, there is so much electricity in the air).Mary giving up their honeymoon money, to keep the Building and Loan out of Potters grasp.The Bridal Suit (with Ernie & Bert).Trying to talk to Mary in the alternate reality, but managing frighten her. The Ending.I don't think I have seen a better character study, or for that matter a better movie.",
    "145": "It's a Wonderful Life (1946) is a movie I recently watched on Amazon Prime. The storyline follows a bank owner who when everyone else is selling out in town to a rich investor he decides to hold onto the family business, to the investors chagrin. He finds love, marries and is about to leave for his honeymoon when the market crashes and he is needed more than ever. He will put his future at risk for the town but may destroy himself in process.This movie is directed by Frank Capra (Mr. Smith Goes to Washington) and stars James Stewart (Vertigo), Lionel Barrymore (Key Largo), Donna Reed (From Here to Eternity), Gloria Grahame (In a Lonely Place) and Henry Travers (The Invisible Man).The gym/pool dance sequence was a great opening. The characters are set-up and established well from beginning to end. The writing and acting is fantastic and the dialogue and chemistry between characters are perfect. The circumstances unfold well and the characters are easy to root for. The ending is brilliant and unfolds predictably perfect.Overall this is an entertaining Christmas classic that is an absolute must see. I would score this a 9/10 and consider this a must see.",
    "146": "No doubt about it that Frank Capra was one of the best directors of all time and James Stewart was one of the best actors of all time, so it shouldn't come as a surprise that this is also one great movie to watch.This movie always on a lot of top-lists and many well known and respected film-makers consider this to be one of their favorite movies, including director Frank Capra and actor James Stewart themselves. And really, it's not all that hard to see why. No, I won't call it one of the best movies of all time but its themes, the characters, the story and its message make sure that this is a movie to enjoy, over and over again.Basically it's being a very warm, heartfelt and honest movie, about real characters in real life situations. The James Stewart character feels very humane and realistic and James Stewart was always a great choice for playing a sort of average Joe, everybody in the audience could relate and identify themselves with. It's also part of the reason why his character is often being voted one of the best out of movie history.It's sort of funny how this movie has grown into being a sort of a Christmas classic, while about two-thirds of the movie are totally not Christmas related at all. It isn't until it last 30 minutes or so that the movie is suddenly all about Christmas and its themes and messages of giving and sharing with each other. It's definitely showing some parallels to Charles Dickens' 'A Christmas Carol'. It's what makes the movie a very warm one, even though the movie itself remains a drama and a quite heavy one as well.The story itself is just great. It's really typical for its time, with all of its drama and developments but with a great twist to it as well. The movie has a fantasy theme in it, which is not typical for its time or genre at all. It perhaps even makes this movie feel a bit like a 'modern' fairytale. Needless to say, it makes the movie a very original one within its genre and its where the movie gets most of its charm and warmth from.The movie is really a great example of some fine film-making and wonderful storytelling. It shows once more that you don't need all that much to create an unforgettable movie, that has an impact on a lot of people, even now days. The movie is about simple little things in life and perhaps that's the movie its greatest power. Everybody can relate to it, which causes them to be easily touched by the movie its themes and messages as well.Big part of the reason why it all works out so well is James Stewart but you also need to give credit to some of the other actors as well. I for instance, also really liked Lionel Barrymore in this, as the villain. I'm normally a not too big fan of Lionel Barrymore, or any of the other old Barrymore's (John and Ethel) but I must say he was perfectly cast in this movie, as the tough, old, mean Mr. Potter.Basically a wonderful made, simple, honest, heartfelt movie, with some great, effective and timeless themes in it, which all ensures that this is a perfect movie to watch over and over again.9/10 http://bobafett1138.blogspot.com/",
    "147": "No folks, I promise not to do the same thing to the Wizard of Oz or Gone with the Wind, but this has got to be the most overrated movie of all time.It took me a number of tries to watch it all the way through, because it is so incredibly boring.  All the scenarios are exaggerated without a hint of the whimsy or joy that should mark  a Christmas movie.  NOBODY in it is likeable, including the hapless and almost hopeless hero.  They even give Donna Reed an improbable scene in the alternate reality where she is a total... well, if I want this posted, I can't use the word.But the worst flaw?  THEY NEVER GET BACK THE MONEY THAT WAS STOLEN.  It is morally unacceptable that this guy doesn't get punished and the townspeople have to rush in with a bailout.I've heard this movie praised to the highest heavens as one of the ten best ever made for most of my life.  I'll give them credit for the body language between Donna Reed and James Stewart in the scene where he is on the phone, but not for much else.",
    "148": "This film more than any other is the reason we still hear Frank Capra as a famous film name. In recent years it has become a Christmas movie on NBC & the exposure at the network level has given this movie the type of fame enjoyed by The Wizard of Oz.It deserves the accolades too. Not only is this a great script with great Direction, but Jimmy Stewart is excellent & uniquely cast in the role as the hero. This film shows how good an actor he is. This film might just be the reason Stewart got the attention of Alfred Hitchcock which would lead to Rope, Rear Window, & Vertigo. It wasn't that Stewart was chopped liver before this film, but the way he carries it is a great acting job. Capra-Stewart just seemed to have the right chemistry together as they had already combined in some other roles too. It is interesting that Stewart was so good that he would work with nearly every great director of this era before he was done.Donna Reed has her best movie screen role here too. The script is just a wonder of all time. Capra seems to always get a hold of unique & powerful scripts & this one is no exception to that. Granted Mr Smith Goes To Washington & You Can't Take It With You are good scripts too, but this is the one which still invades the National stage most often today.This film rates a bravo from start to finish & may never go out of style. It is indeed a classic.",
    "149": "For many this is a Christmas classic, watched every year and much beloved. For me, I've never seen it before. Heard of it; seen short clips of it; but never have I sat down and watched it straight through from beginning to end. Having now done that I can understand why it's such a beloved movie to so many people. It isn't necessarily a Christmas/holiday movie. The basic message would work at any time of the year; it just happens to be set (in its climax anyway) on Christmas Eve. And the message it presents is an important one that everyone needs to hear from time to time, in a world where it's so easy to feel discouraged: every person's life counts. Everyone makes a difference. That's the point here, and it's well made. The movie revolves around George Bailey (James Stewart.) George starts out as a kid with big dreams of escaping his hum-drum (to him) home town of Bedfork Park and seeing the world. But it never works out. He ends up running the small savings & loan operation his father started, while his brother and his friends all seem to go on to bigger and better things - becoming heroes; becoming famous; becoming rich. George has a good life. He's married to a woman he loves (Donna Reed) and he has great kids and a lot of friends, but it just isn't what he always wanted. It's not completely satisfying for him. Eventually it all falls apart when the local ruthless banker (Lionel Barrymore) comes up with a way of bringing him down. With everything apparently out of control, George decides to kill himself, only to be rescued by the angel Clarence (Henry Travers) who shows him what Bedford Park would be like if he had never existed - and it's not pretty.The story isn't complicated. It's simple and straightforward. Everybody does a good job in it. Personally, I thought there was perhaps a little too much emphasis on George's life and what brought him to the brink of suicide, and maybe not quite enough emphasis on George being confronted by the consequences of his non-existence. (And, in the alternative timeline, Bert the cop opening fire on George in the street seemed a bit - shall we say - excessive; not to mention dangerous!) Perhaps the opening, with God and the angels talking to each other as stars and other heavenly bodies was a bit too cute, but it's all within the expected standards of 1946. It is a nice movie, and it does have a nice message. Your life does make a difference to a lot of people - probably more than you know, so be satisfied with it and rejoice in what you have. I can easily understand why so many consider it a classic. (8/10)"
}