{
    "0": "\"If you had never left Seoul, would I have still looked for you? Would we have dated? Broken up? Gotten married? Would we have had kids together?\"Such a touching film, but at the same time, never cloying, because the script and direction from Celine Song were so wonderfully restrained. I liked how it acknowledged the random little things in our lives that all have to add up in a certain way for us to end up with our partner in life, things in retrospect which are kind of mind-boggling, but at the same time, gave a certain nod to the idea of fate, the Buddhist \"in-yun\" concept of meeting someone again and again in our reincarnations until it reaches the threshold that allows for marriage. The characters were beautifully drawn and didn't devolve into cliches, an example of which was the husband who gave a master class in being understanding and supportive. Beautiful cinematography too. Definitely one to see.",
    "1": "I've always bemoaned how cinema caters now to the children and that there are no adult films. Here is one that treats the audiencem that have the opportunity to watch itm as adults. While it does play like a stage play (most likely because director/writer Celine Strong is a playwriter) it doesn't take away the fact of the ideas within it.The story is of two Korean kids, who are in love, by their kid standards. They most likely spent years since childhood walking to school and spending countless days together. In the break, it is an unceremonious goodbye. Words escape them as we would want them to express their feelings. You won't get that here. Nora and her family make it to Canada, and finds it difficult to assimilate into her school.Hae Sung, meanwhile, stays back in Korea to go through the mandatory military service.12 years past. And now Hae Sung curiously has reached out to Nora. They begin an internet relationship which never crosses over to romantic, but you can feel a deep connection. It's closeness. While Nora has now moved on to New York, Hae Sung is now in college to study engineering.They spent countless time re-living their lives through the internet, but eventually, Nora realizes this has been holding her back. She makes the difficult decision to stop talking to Hae Sung so they can grow since neither can invest real time together. Hae Sung reluctantly agrees.Another 12 years past, and we now are the point where Nora is married to another writer. He is an American and, though finds ways to express his love to Nora, there is still a little bit of distance. Since Nora has roots deep in Korea. Hae Sung is a working man now and decides to visit Nora.The rest of the story is up for you to watch. I will say, it is pretty brutally honest. For anyone who has gone through long distance relationships, loved and lost and then re-connected in some way, what follows in the film may bring up raw feelings. But director Song REALLY wants you to overlook the \"what could've been aspect\" to the idea that there are just people in life you have a connection with, but never can be with them in a tangible world that we can see now. The spiritual nature/philosophical idea is similar to a metaverse concept. But isn't done in a way like Marvel does. It's about connections and the inarticulate way we cannot understand why we have these people in our lives.If you are self-aware of your life, you tend to consider these possibilities. Though the movie lingers slowly, the poetic nature of their silence will either calm you or make you frustrated that it hasn't moved faster. This movie is VERY much for grown ups. The themes need you to live a life where many people come through your life in order for you to appreciate what the tone of it ultimately means. There are no answers here. Only solid performances by its two leads, Greta Lee and Teo Yoo. They are fantastic in playing thought processes out.It's a deep story of love that requires you invest some of your own brain power to enjoy. Feel the ache of love.",
    "2": "When I first saw the trailer of this movie, I was worried that it was going to be one of those cringe love story movie that exploits the Asian American hype in cinema. My concerns were all dispelled rather quickly. Celine Song's debut feature, \"Past Lives\" is a story of nostalgia and longing. It's less about romantic love because the movie makes it clear that Hae-sung and Na-young are never really in love with each other. There were many scenes where them being together contrasted with several couples around them. They were close but not intimate. Nobody ever crosses the line and remain as friends who long for each other.I also want to comment how well written the husband's character is. He is married into a foreign culture and he probably always worried about him not being \"Korean\"makes him somehow an inadequate partner. He worries that his relationship somehow got in the way of Nora's immigrant dreams. While he has his own insecurities about the relationship and Hae-sung (who is by all standards, a 10/10 idealistic man), he accepts Nora's longing and embraces her as she cries after sending away Hae-sung. He understands that it's not about a romantic feeling but saying goodbye to one of the few connections and nostalgia to her home country.The entire movie also had technically surprising moments, making it hard to believe that this is a feature debut. It is filled with beautiful, sensitive shots that capture New York and Seoul pretty well. The music is dreamy and I've been spamming the soundtrack. Subtlety is well preserved and that's what i look for in movies. Dialogues were expertly captured with the director often using the technique of giving the focus to the listener rather than the speaker - directing the audience's attention to the reaction of what is being said.Overall, a beautiful film with little to criticize. One comment I have is that the accent in the Koreans were a little funny. However, I think it captures the awkwardness well enough. Being bilingual in Korean and English usually makes me bothered in watching films like this but I was not this time. Translations were also done pretty well, thankfully (this is SO important for me).",
    "3": "I'm nearly emotionless staring at this screen as I try to piece together my thoughts from a deeply moving film. Past Lives is purely honest, heartfelt, and piercingly direct with the evolution of its story, let alone with the natural growth its two lead characters. The score patiently guides the emotions of the audience, heightened by steady framing and extended sequences from a gorgeous color scheme to create an overwhelmingly tense presence in its tone, but never crossing that line in doing so. You feel the most out of every moment because the film puts trust in the fact that you will. The concluding sequence is a testament to the formatting of this entire story as the writing positions you to finally see and feel exactly as these characters do, and that's the ingredient that makes this experience so special. A true romance film crafted for our understanding and psychological reflection in 2023 and one that'll remain timeless for generations to come.",
    "4": "I saw Past Lives alone on a Sunday morning with 3 other single men in the theater. We all sat in opposite corners. Every single one of us cried, shamelessly, out loud as this movie concluded. If your movie makes 4 dudes show up alone to a movie at 10:30am on a Sunday and cry, you hit it out of the park.Past Lives takes an intimate look at the people we disconnect, and reconnect with, over the course of our lives. Specifically focusing on reconnecting with a childhood crush, Past Lives features an elite performance from Greta Lee in the lead role. She displays a range of emotion from tears you can feel to the somber, dry expressions many show when they simply don't know how to express their feelings.This film moves fast even though its pace is slow. The dialog shifting languages keeps your attention and creates the beautiful cultural connection needed to make this story of an immigrant and the man who stayed behind work. The way this story builds Greta's life in NY at the moment you believe they're finally going to connect... god this movie got me.I was blown away by this movie. It's the most I've felt in a movie in a long time. Sadness, angst, loneliness, fear, human connection. Past Lives is what most slow paced dramas wish they could be.",
    "5": "Now here's a story that has something for us all, if you consider all the past events and things that went before, all the options, permutations, that could have ended in relations, outcomes, futures, roads untaken, that then fall. As Jung Hae Sung and Nora meet as kids, there's a connection but then adios she bids, moving to the USA, kimchi days are left astray, different plays shape different folks - the lives they've lived. Correspondence over time keeps thoughts reflective, then meeting up creates a kind of retrospective, what could have been, and what could be, things preordained, but choice is free, quite intriguing, but it rests on your perspective.",
    "6": "Such a beautiful picture film. It has everything you want from a good movie: a cute romance, philosophy to guide the narrative, characters that feel real even if you don't get to see what they do (in his case) or barely see anything (in her case). It's as if the scriptwriters managed to weave a touching romance out of snippets, without it feeling like you're watching something unfinished.There's this one scene where they show how time passes. I loved the cinematography behind that. Simple yet rewarding visually.From this movie I learned that you should accept love and realise that you don't have to give up what you have for what you could have. You can accept both those feelings of love inside of you and even if it hurts, it's what I believe makes the soul feel alive.",
    "7": "Out the movies that came out in my youth, \"500 Days of Summer\" was considered one of the most accurate depictions of love on the silver screen. One of its most poignant scenes was the contrast between expectations and reality -- \"Past Lives\" does you one better. Instead of showing you what the characters expect, it makes the viewer believe he or she knows what will happen, then highlights how reality doesn't match romantic ideals.Upon the film's conclusion, one is left to ponder the many people they've met in life. How many romances were unrealized, how many stories unwritten?The acting is excellent and the story is well written. Unlike many other contemporary romance films and TV shows, \"Past Lives\" recognizes that not all movies are fairytales and in so doing has a much deeper impact.",
    "8": "This is not a movie for young people. To truly understand and feel the impact of this story you must have lived long enough to have known that person who may have been \"The One\" or the \"In-yun\"if the direction of your lives did not take you to other places and people. This is a story you take home with you and feel the loss while also accepting that this was not to be in this life.The three main actors embody their roles in subtle ways. You can see who the characters they portray are by the use of skilled body language, the silent pauses, and the charming to me use of the Asian \"hmm\" of agreement.",
    "9": "This movie is basically about \"what might have been\", a question we all ask ourselves at some point(s) in our lives, quite often about romantic connections.Nora ( her adopted western name) and Hae Sung are childhood friends (aged 12) who are separated when her parents emigrate to Canada. She has grand ambitions to be a famous writer while he is content to be an ordinary person living an ordinary Korean life (his words).12 years later they reconnect on Facebook (he still misses her) and spend a while talking regularly and reconnecting, but not enough for either to change their life plans.Another 12 years pass with no contact, and now we find Nora happily married to another writer and living in New York City and Hae Sung is visiting. There is still some connection there, a longing perhaps, and a lot of confusion, especially on her part. Her husband Arthur is is not thrilled but tries to be understanding.This film has received mostly rave reviews and there is early Oscar talk. I can see why many might love it but I didn't. The acting was good, particularly Teo Yoo and John Magaro in the two male parts. But I really didn't like the direction at all. Many scenes were laborious and slow - I get that emotions can be displayed with nuanced looks but it was overdone to the point of annoyance. The cinematography did little to showcase either Soeul or NYC, nor did it add value to the emotional whirlpool the two many characters were caught in. And the bluish colour palette didn't work for me.The script had some great moments, particularly the scenes with Nora and her husband, but was patchy in many other places. In particular it made it difficult to really care that much for the Nora character.It's usual for me to reach for the tissues at the end of good rom-coms or any movie which successfully portrays an emotional conundrum. I left this movie dry-eyed and a little disappointed, not at what might have been for the characters, but for the movie this story could have been. So 6/10 from me, but it's the sort of movie that many will absolutely love, so you should see it because that might be you.",
    "10": "Wow this film was powerful! The tension and chemistry between all the leads was palpable and almost overwhelming, and the final shots were so well l-crafted.The story is simple: girl leaves childhood boy crush for a new life in Canada and America. What follows is a series of potent reconnections over the years and an attraction that never waned, but had never worked out.Largely in Korean, the film is composed of slices of life across time, vignettes of heavy nostalgia and fondness. The film is self-aware of its romanticizing, directly pointing out the context that, if lacking, would lead the audience to resent circumstances that kept our protagonists apart.But the poignant beauty of \"Past Lives\" is that we shouldn't resent it. And it leaves an indelible message to appreciate what we have and never miss a chance tell the ones we love how much we care.",
    "11": "Past Lives is a sad novel, a novel that shows us that love doesn't always work. Destiny can bring together and separate couples who truly love each other. The couple separates in childhood, each one follows their own path, separated by distance. And even after seeing each other again, they remain separated. They never really get to be together. The couple is always separated by something, be it distance, a computer, a simple handrail or a relationship. Even when they are close to each other, they remain distant. Physically or mentally distant. Was that childhood love true love? Do other passions and relationships act as a disguise for that feeling that still exists, but has never managed to unite two people? When they are together at the end, they don't say anything, they remain silent, because fate didn't want them to be together, but perhaps they had a romance in past lives.",
    "12": "I can't say it better than the Atlantic Review did. Check that out, but it does give some things away about the story, so if you're on the fence - just GO.This film delivers in every way - if you think you might be the audience for it, go right now, you will 100% be satisfied. Just a beautiful and sophisticated look at this meditation on love.The casting is fantastic and the moments are interesting and unique - but arrives at something universal. Check it out in a theatre if you can and spread the word about it as this is a filmmaker to watch for sure. Loved seeing Greta in a different role - she is so very funny in everything we're seeing her in lately, this is a nice departure too.",
    "13": "The wife and I aren't action movies and gravitate towards movies with stories but this was just ok. Lots of emotional scenes but the interaction was awkward and unrealistic. The actors didn't need to rehearse their lines as there was little dialogue. It had some emotional moments but the movie lacked character engagement. We both felt it spent too much time on the artistic side and not enough time developing the storyline. They went from Korea to Toronto to New York with basically no indication or reason how or why We both agree it was average to good but certainly not deserving of an 8.4 rating.",
    "14": "This was a cute movie about two childhood sweethearts who reunite at different points in their lives, but for me, it lacked substance. The laconic dialogue left a lot to be desired, and I found myself twiddling my thumbs half the time. While the scenery of New York and Korea were nice to look at, the on-screen chemistry was almost nonexistent-I think I shipped the two kids much more than any of the adults-and the movie barely scratched the surface of some themes, such as Nora's reluctance to go back to her home country.Past Lives doesn't deserve the acclaim it's been getting. A friend warned me this was a tearjerker, but I didn't release a single tear (and I'm a big crier!) I can see how sentimental this is, and how it calls upon on those other \"what-if\" moments, but this has been done better by many other movies and series.",
    "15": "There are so few simple but affecting movies these days. So, for people like me who enjoy that kind of thing, it's worth going. But there's not much here. The characters are not particularly interesting. The semi-philosophizing bits of the dialog are banal. I know it's a silly comparison, but I saw Graves of the Fireflies the night before, and by the end half the audience was bawling its eyes out for anime characters. I don't think anyone is crying about the fate of these people. Still, the movie has a multicultural theme, and there is some suspense in the love story, It is a reasonably pleasant way to spend an hour and a half.",
    "16": "I went to see this movie with my wife based on the stellar ratings. I imagined it might be something on the idea of \"Spring, Summer, Fall, Winter... and SpringI \"-a Korean film from 2003 that was profound and moving. However, this was not the case. I wanted to like it, but this film is mediocrity at best. Acting lacks dimension. Tries to be profound, but just isn't- although the plot contains an intriguing idea. Just enough tension and character development to keep the viewer barely engaged. This film is a solid 5 out of 10.I am starting to doubt the veracity of online reviews as this hyping of mediocre films is happening more where it didn't use to be so blatant. Are these rave reviews generated by AI? Something is not right here.",
    "17": "Just wow.. What a masterpiece. It took me through a journey of emotions and made me realize that \"life is very short.\" You don't know what could happen and you don't know at what time life will turn around and you find yourself with the person you loved a long time ago and you thought he was gone, but he is in front of you.. Days pass. Months and years, the mind forgets, but the heart doesn't not forget. Deep memories remain in our memories and we cannot forget them, and fate brings us together again. It is true that life is short. The film touched me a lot . I was very attached to the film. I fell in love with the story of the and how realistic it is. An event that could happen to anyone. A film that made me think about the past, the present, and memories. The film's message is profound and very touching. 20 years have passed, and here we are again, the same people in the same country at the same table, discussing what life has done to us and where we have reached. I cannot. Describe my feelings and attachment to this movie.. I'm just in love with it....",
    "18": "A little love affair tingles, a big love affair upsets everything. This film deserves its advance praise: if you want to experience the range of feelings of the heart, even if only indirectly, i.e. Feelings that are not your own but feel really authentic, almost like your own, then this is the film for you. Past Lives takes the viewer on the journey of the two (eventually three) outstanding main protagonists, who act discreetly but incredibly expressively throughout. Logically, this is not Hollywood cinema; a work like this would not be possible from here. For example, it is essential to remember the opening sequence in detail, which becomes such an emotional punch in the gut in the last third, a chaos of all kinds of feelings. Watch and sympathise, happiness, sadness, hope, pain.",
    "19": "A version of \"the one that got away,\" to me \"Past Lives\" suffers from its lack of depiction of the background life experiences that inform the characters. The screenplay skip over, for example, why the parents emigrate to Canada when their daughter Nora is 12, what happens to her and her family during the years in Canada, or what persuades her to seek her fortune as a playwright in New York as an adult. Similarly, there is passing reference to Nora's marriage to an American as partly to obtain a green card but no exploration of what her immigration worries might have been.Some viewers might feel context unnecessary and moved simply by the way the two childhood friends long for each other over the years even though not destined to be united. There is much talk of fate.On the plus side, the three main players do an admirable job of depicting feelings of love and regret that are intense but unexpressed.(Mainly in Korean with English subtitles.)",
    "20": "Midnight watch review: Something about this film's just struck a chord in me. A profound examination on the sprawling emotional complexity that comes with relationships. You get the sense of 'what if' throughout the entire film when observing the chemistry between Hae Sung and Nora, but I wouldn't go as far as to say it makes you feel completely regretful, but grateful about the relationships (romantic or otherwise) you've experienced in some ways. Past Lives's hard-hitting yet sensitive exploration of connection, love, and understanding, touch way too close to home. It has the magic of making you ponder on your past. It's hard to say why certain feelings exist, but if you honestly believe to yourself that you did something wrong in your past, then this film is for you. It certainly made me think about my previous connections, romantic and otherwise.By far one of A24's superior works.",
    "21": "I found this movie to be lovely to look at as far as the cinematography, but that's it. It was boring. I'm talking watching paint dry boring. The dialogue was shallow. The interactions between the two main characters was just a big fat blah.I don't need a lot of bells and whistles, but this movie just made me feel as though I was wasting my time. I kept thinking it would get better, but it didn't. I felt nothing but a desire to walk out of the theater. I don't know what Kool-Aid all of the high raters were drinking, but they definitely had a different experience than the one I had. I want my time back!!!",
    "22": "It's a relationship drama primarily set in Seoul, Korea, and New York City. It begins in the late 1990s, then has two 12-year jumps. It follows two age-12 Korean children who are separated when the girl immigrates to North America and takes up a different life there.Na/Nora Moon (Seung Ah Moon/Greta Lee) and Hae Sung (Seung Min Yim/Teo Yoo) are close friends in school. Na's parents, both professionals, want to immigrate to Canada for better opportunities. Na envisions a writing career and welcomes the move, though she misses leaving Hae Sung. They have one \"date\" before she leaves.Twelve years later, Nora strives to be a playwright in New York City, though her family stays in Canada. Hae Sung has just completed his military service and plans to study engineering in China. Nora discovers that Hae Sung has tried to find her through social media. She contacts him, and they have a Skype relationship until she ends it. She goes to a writer's workshop where she meets Arthur (John Magaro), an aspiring Jewish novelist.Twelve years later, Nora and Arthur have been married for seven years and lived together a couple of years before that. He's had a novel published, and she is in rehearsals for a play. Hae Sung plans a week's vacation in New York and intends to see Na/Nora.Much of the film deals with Nora and Hae Sung's two days together doing touristy things around New York. Arthur knows about Hae Sung and understands Nora's wish to meet him but is a bit nervous about him. Much of the film deals with these two days and the Korean concept of in-yeon in which past lives are also part of current relationships. And there are inevitable questions of what might have been.\"Past Lives\" is a coherent account of a certain kind of love triangle. Na/Nora is the strongest person in the relationship. She has ambitions that have guided her decisions. Hae Sung has lingering hopes but is very proper and respects Nora's marriage. Arthur, with whom I strongly identified, feels a bit walled off from the shared relationship between Nora and Hae Sung. But at one point, Nora clearly says to Hae Sung that the 12-year-old Na does not exist in North America, though she did exist in Korea. There is no dramatic ending.Greta Lee, Teo Yoo, and John Magaro are all good, though I wished the Arthur character had been more developed. \"Past Lives\" is a sweet but realistic story.",
    "23": "I liked the premise, full of nostalgia, musings on fate, soulmates, what ifs, paths not taken, and \"the one that got away\". I also liked the sense of realism in this film, but sadly, I didn't feel emotionally connected or invested in the characters. And this part to me is where it all depends on.I wanted to believe that there was something deep and meaningful between them, but their scenes together felt bland, boring and superficial, that by the end I didn't feel the ache or longing I was supposed to feel.The characters seemed like strangers to me. Maybe the depth of their relationship wasn't shown and just implied, but I needed to see that happening for it to have any effect on me at all.",
    "24": "Everything about this film is contrived and sentimental. From the first scenes of Korean family life and schooling where the main protagonists meet as children; not engaging . I already was bored with the pair of them then and there. One of the major issues with this film is the script and lack of it. Again those long meaningful silences only work when there is a considerable depth behind it and unfortunately this film has zero depth. As the protagonists move in to adult life and the film moves on to New York and the friends reunite with a history and a past - there would have to be drama to make it work...of some sort. Or humour or complexity. There is none. It is very two dimensional and flat. I know many people have engaged with this film as some kind of 21st century revelation of relationships that were missed or a path that could have been taken - well their lives must be pretty shallow. There was nothing in this film which conveyed what was really between these two people on a deeper level . The long meaningful looks were not enough - where was the story ?",
    "25": "I don't know why everyone seems to love this movie. It's slow and boring, even by A24 standards. I know from experience that they require a certain amount of patience when it comes to pacing, but I still found myself checking my watch and fidgeting in my seat. I almost left but I thought something might happen. It didn't, and I was left feeling \"what was the point of that movie?\" Though this movie is under two hours long, it felt like the longest movie of the year for me. I gave it a few stars because the acting is good, and the chemistry was pretty solid. And if you have a higher tolerance for the slow pace, you might like it.",
    "26": "Starts quite nicely, with two kids, a boy and a girl in Korea. The girl moves first to Canada and then, about 12 years later, appears in New York City without explanation. She seems to have become a successful playwright. Again no explanation of how she reached that point - education, family/friend support - she seems to have simply developed in isolation surrounded by a vacuum.Nora - her adopted name and her childhood friend - Hae Sung, in Korea reconnect via Skype and are able to renew, actually quite nicely. This time long-distance, friendship. Their connection ends quite abruptly. She marries a man whom she met in an artist residency. Without knowing much about his work, he appears at a book signing of his book (novel, short stories, poetry? - we never find out.) Besides some cliches-ish dialogue between the two, we never learn much about their life. (Ok, they moved from Brooklyn to East Village in Manhattan).Twelve years later, the childhood friend, after breaking up with his girlfriend (he says, because of her lack of sufficient means), Hae Sung comes to visit her in New York. Empty or superficial conversation galore follows.",
    "27": "The wife and I aren't action movies and gravitate towards movies with stories but this was just ok. Lots of emotional scenes but the interaction was awkward and unrealistic. The actors didn't need to rehearse their lines as there was little dialogue. It had some emotional moments but the movie lacked character engagement. We both felt it spent too much time on the artistic side and not enough time developing the storyline. They went from Korea to Toronto to New York with basically no indication or reason how or why We both agree it was average to good but certainly not deserving of an 8.4 rating.",
    "28": "This was a cute movie about two childhood sweethearts who reunite at different points in their lives, but for me, it lacked substance. The laconic dialogue left a lot to be desired, and I found myself twiddling my thumbs half the time. While the scenery of New York and Korea were nice to look at, the on-screen chemistry was almost nonexistent-I think I shipped the two kids much more than any of the adults-and the movie barely scratched the surface of some themes, such as Nora's reluctance to go back to her home country.Past Lives doesn't deserve the acclaim it's been getting. A friend warned me this was a tearjerker, but I didn't release a single tear (and I'm a big crier!) I can see how sentimental this is, and how it calls upon on those other \"what-if\" moments, but this has been done better by many other movies and series.",
    "29": "There are so few simple but affecting movies these days. So, for people like me who enjoy that kind of thing, it's worth going. But there's not much here. The characters are not particularly interesting. The semi-philosophizing bits of the dialog are banal. I know it's a silly comparison, but I saw Graves of the Fireflies the night before, and by the end half the audience was bawling its eyes out for anime characters. I don't think anyone is crying about the fate of these people. Still, the movie has a multicultural theme, and there is some suspense in the love story, It is a reasonably pleasant way to spend an hour and a half.",
    "30": "I went to see this movie with my wife based on the stellar ratings. I imagined it might be something on the idea of \"Spring, Summer, Fall, Winter... and SpringI \"-a Korean film from 2003 that was profound and moving. However, this was not the case. I wanted to like it, but this film is mediocrity at best. Acting lacks dimension. Tries to be profound, but just isn't- although the plot contains an intriguing idea. Just enough tension and character development to keep the viewer barely engaged. This film is a solid 5 out of 10.I am starting to doubt the veracity of online reviews as this hyping of mediocre films is happening more where it didn't use to be so blatant. Are these rave reviews generated by AI? Something is not right here.",
    "31": "Just wow.. What a masterpiece. It took me through a journey of emotions and made me realize that \"life is very short.\" You don't know what could happen and you don't know at what time life will turn around and you find yourself with the person you loved a long time ago and you thought he was gone, but he is in front of you.. Days pass. Months and years, the mind forgets, but the heart doesn't not forget. Deep memories remain in our memories and we cannot forget them, and fate brings us together again. It is true that life is short. The film touched me a lot . I was very attached to the film. I fell in love with the story of the and how realistic it is. An event that could happen to anyone. A film that made me think about the past, the present, and memories. The film's message is profound and very touching. 20 years have passed, and here we are again, the same people in the same country at the same table, discussing what life has done to us and where we have reached. I cannot. Describe my feelings and attachment to this movie.. I'm just in love with it....",
    "32": "A little love affair tingles, a big love affair upsets everything. This film deserves its advance praise: if you want to experience the range of feelings of the heart, even if only indirectly, i.e. Feelings that are not your own but feel really authentic, almost like your own, then this is the film for you. Past Lives takes the viewer on the journey of the two (eventually three) outstanding main protagonists, who act discreetly but incredibly expressively throughout. Logically, this is not Hollywood cinema; a work like this would not be possible from here. For example, it is essential to remember the opening sequence in detail, which becomes such an emotional punch in the gut in the last third, a chaos of all kinds of feelings. Watch and sympathise, happiness, sadness, hope, pain.",
    "33": "A version of \"the one that got away,\" to me \"Past Lives\" suffers from its lack of depiction of the background life experiences that inform the characters. The screenplay skip over, for example, why the parents emigrate to Canada when their daughter Nora is 12, what happens to her and her family during the years in Canada, or what persuades her to seek her fortune as a playwright in New York as an adult. Similarly, there is passing reference to Nora's marriage to an American as partly to obtain a green card but no exploration of what her immigration worries might have been.Some viewers might feel context unnecessary and moved simply by the way the two childhood friends long for each other over the years even though not destined to be united. There is much talk of fate.On the plus side, the three main players do an admirable job of depicting feelings of love and regret that are intense but unexpressed.(Mainly in Korean with English subtitles.)",
    "34": "Midnight watch review: Something about this film's just struck a chord in me. A profound examination on the sprawling emotional complexity that comes with relationships. You get the sense of 'what if' throughout the entire film when observing the chemistry between Hae Sung and Nora, but I wouldn't go as far as to say it makes you feel completely regretful, but grateful about the relationships (romantic or otherwise) you've experienced in some ways. Past Lives's hard-hitting yet sensitive exploration of connection, love, and understanding, touch way too close to home. It has the magic of making you ponder on your past. It's hard to say why certain feelings exist, but if you honestly believe to yourself that you did something wrong in your past, then this film is for you. It certainly made me think about my previous connections, romantic and otherwise.By far one of A24's superior works.",
    "35": "I found this movie to be lovely to look at as far as the cinematography, but that's it. It was boring. I'm talking watching paint dry boring. The dialogue was shallow. The interactions between the two main characters was just a big fat blah.I don't need a lot of bells and whistles, but this movie just made me feel as though I was wasting my time. I kept thinking it would get better, but it didn't. I felt nothing but a desire to walk out of the theater. I don't know what Kool-Aid all of the high raters were drinking, but they definitely had a different experience than the one I had. I want my time back!!!",
    "36": "It's a relationship drama primarily set in Seoul, Korea, and New York City. It begins in the late 1990s, then has two 12-year jumps. It follows two age-12 Korean children who are separated when the girl immigrates to North America and takes up a different life there.Na/Nora Moon (Seung Ah Moon/Greta Lee) and Hae Sung (Seung Min Yim/Teo Yoo) are close friends in school. Na's parents, both professionals, want to immigrate to Canada for better opportunities. Na envisions a writing career and welcomes the move, though she misses leaving Hae Sung. They have one \"date\" before she leaves.Twelve years later, Nora strives to be a playwright in New York City, though her family stays in Canada. Hae Sung has just completed his military service and plans to study engineering in China. Nora discovers that Hae Sung has tried to find her through social media. She contacts him, and they have a Skype relationship until she ends it. She goes to a writer's workshop where she meets Arthur (John Magaro), an aspiring Jewish novelist.Twelve years later, Nora and Arthur have been married for seven years and lived together a couple of years before that. He's had a novel published, and she is in rehearsals for a play. Hae Sung plans a week's vacation in New York and intends to see Na/Nora.Much of the film deals with Nora and Hae Sung's two days together doing touristy things around New York. Arthur knows about Hae Sung and understands Nora's wish to meet him but is a bit nervous about him. Much of the film deals with these two days and the Korean concept of in-yeon in which past lives are also part of current relationships. And there are inevitable questions of what might have been.\"Past Lives\" is a coherent account of a certain kind of love triangle. Na/Nora is the strongest person in the relationship. She has ambitions that have guided her decisions. Hae Sung has lingering hopes but is very proper and respects Nora's marriage. Arthur, with whom I strongly identified, feels a bit walled off from the shared relationship between Nora and Hae Sung. But at one point, Nora clearly says to Hae Sung that the 12-year-old Na does not exist in North America, though she did exist in Korea. There is no dramatic ending.Greta Lee, Teo Yoo, and John Magaro are all good, though I wished the Arthur character had been more developed. \"Past Lives\" is a sweet but realistic story.",
    "37": "I liked the premise, full of nostalgia, musings on fate, soulmates, what ifs, paths not taken, and \"the one that got away\". I also liked the sense of realism in this film, but sadly, I didn't feel emotionally connected or invested in the characters. And this part to me is where it all depends on.I wanted to believe that there was something deep and meaningful between them, but their scenes together felt bland, boring and superficial, that by the end I didn't feel the ache or longing I was supposed to feel.The characters seemed like strangers to me. Maybe the depth of their relationship wasn't shown and just implied, but I needed to see that happening for it to have any effect on me at all.",
    "38": "Everything about this film is contrived and sentimental. From the first scenes of Korean family life and schooling where the main protagonists meet as children; not engaging . I already was bored with the pair of them then and there. One of the major issues with this film is the script and lack of it. Again those long meaningful silences only work when there is a considerable depth behind it and unfortunately this film has zero depth. As the protagonists move in to adult life and the film moves on to New York and the friends reunite with a history and a past - there would have to be drama to make it work...of some sort. Or humour or complexity. There is none. It is very two dimensional and flat. I know many people have engaged with this film as some kind of 21st century revelation of relationships that were missed or a path that could have been taken - well their lives must be pretty shallow. There was nothing in this film which conveyed what was really between these two people on a deeper level . The long meaningful looks were not enough - where was the story ?",
    "39": "I don't know why everyone seems to love this movie. It's slow and boring, even by A24 standards. I know from experience that they require a certain amount of patience when it comes to pacing, but I still found myself checking my watch and fidgeting in my seat. I almost left but I thought something might happen. It didn't, and I was left feeling \"what was the point of that movie?\" Though this movie is under two hours long, it felt like the longest movie of the year for me. I gave it a few stars because the acting is good, and the chemistry was pretty solid. And if you have a higher tolerance for the slow pace, you might like it.",
    "40": "Starts quite nicely, with two kids, a boy and a girl in Korea. The girl moves first to Canada and then, about 12 years later, appears in New York City without explanation. She seems to have become a successful playwright. Again no explanation of how she reached that point - education, family/friend support - she seems to have simply developed in isolation surrounded by a vacuum.Nora - her adopted name and her childhood friend - Hae Sung, in Korea reconnect via Skype and are able to renew, actually quite nicely. This time long-distance, friendship. Their connection ends quite abruptly. She marries a man whom she met in an artist residency. Without knowing much about his work, he appears at a book signing of his book (novel, short stories, poetry? - we never find out.) Besides some cliches-ish dialogue between the two, we never learn much about their life. (Ok, they moved from Brooklyn to East Village in Manhattan).Twelve years later, the childhood friend, after breaking up with his girlfriend (he says, because of her lack of sufficient means), Hae Sung comes to visit her in New York. Empty or superficial conversation galore follows.",
    "41": "It might be possible that the movie is about characters suffering an early loss and becoming stunted - indeed, as children they are companions and she already loves him and they go on a chaperoned date before she leaves and he is shut down and pronounces \"good bye.\" Thus sealed, their pure love is preserved. Nice.But I found the movie rather indulgent, not really about some subtle psychological retreat, rather, the movie glosses over character development because it is not about a parallel universe and how things could've/would've been different or any sort of romance; rather, an indulgent tortured meditation positing a missed opportunity as the cause for a irrevocable fantasy of loss.As such a meditation, character development is minimal - and the acting is great - but it is only because of a gratuitous scene or because a character says so that we know she's a writer at all, that he's an engineer (who was in the military and he learned Chinese), that she loves her husband or he loves her. I don't key into soundtracks but i suspect the film was so affecting because of it, but I blame it for how manipulated I felt this movie to be.The opening scene with some stranger commenting about what the three are doing there at four in the morning is a very weak narrative contrivance, telling the viewer what to wonder about - even a conversation with the bartender would've been less gratuitous.",
    "42": "Firstly, props to the actors for their excellent performances. However, considering the immense hype surrounding the film, we anticipated a more intricate storyline. Unfortunately, the trailer already divulged most of the plot, leaving little room for surprises. As a Korean speaker, I noticed that approximately 3/4 of the movie was in Korean, and the subtitles could have been improved. Halfway through the film, I felt bad for my friends who relied on the subtitles, as they seemed to receive a literal translation rather than capturing the figurative/metaphorical elements. Really wanted to like the film...",
    "43": "PRETENTIOUS, ARTY movie. You know! Those movies that only critics like because it's slow-paced and visually artistic, but there is nothing going on inside the movie. Typical A24 taste and tone. Everything seems so unnatural and set up; frequent long shots of incredible landscapes with serene music; many long pauses between the sequences. My finger was already on the stop button without realizing it. The director would think I'm so creative, special, and artistic, but so many newbies are doing it the same way that it is unoriginal as heck.Their love is not convincing, so there is nothing for me to look at and expect for. Greta Lee cannot act. She's always doing something with her face; she cannot leave it alone, fake-smiling with her lips but not with eyes or twitching her eyebrows or lips. However, when expression and emotions are needed, she looks sooo blank.",
    "44": "Past Lives is one of the best movies I've ever seen. The cinematography is simple but beautiful, the performances are great, the music is perfect, and the third act especially was fantastic. Without spoiling too much, the movie follows two characters at three different points in their lives, at ages 12, 24, and 36. It's fascinating to watch how these characters evolve over the years, and whoever wrote this movie really nailed making their character arcs realistic. Especially between ages 24 and 36, characters will have slight changes in appearance and will have calmed down over time. I highly recommend seeing this movie if you can find it in the theater, but I'm pretty sure it has a fairly limited release. I had to drive almost an hour to get to the only theater in my state that was playing it.",
    "45": "I don't think I've ever seen a more boring and depressing movie. It would have been more fun to count all the popcorns on the floor. In the dark. In Korean. I just couldn't believe somebody made this utter garbage and called it a movie. And then we actually paid tickets to watch it. It is not even possible to spoil to. The exact nonsense at the beginning will be what you can expect all the way to the end. Then you will turn around looking for a hidden camera. It can't be this stupid? Surely they will do something to make it less boring at least in the end? But no! It is a garbage movie about two weak men-childs and one selfish woman. I'd pay NOT to watch it!",
    "46": "I am at 35 mins and counting, and I have already given this a 10. I don't know how it plays out or what will happen even. I know that it is beautifully made with emotions you can feel from just watching as much as I have. The longing of love is in itself a very hard thing. Love stories are often portrayed in a very unrealistic manner but this movie isn't really all about that. The emotion of the main character is phenomenal. The male lead actor is truly amazing. The feeling of being alone while perhaps the love of your life is so far away is an aching pain that is so hard to swallow. You cannot even pretend to be there in your daily life because your heart is somewhere else. I cannot elaborate further because honestly I would be speaking about myself. But it is really remarkable and relatable. It took a while to watch this because I heard about it before but I was waiting for the subs etc. Anyways, it should definitely be nominated for best writing in the Oscar's.",
    "47": "POSITIVES:1) The film does a brilliant job of making you invested in Nora and Hae Sung's relationship. My favourite part of the film was when the two of them are on Skype together, because it felt so real and seemed like watching a real couple building a connection together\n2) All of the performances are brilliant, but especially the actor playing Hae Sung, I thought he was exceptional and made Hae Sung a deeply empathetic character\n3) The ending completely floored me. That long continuous shot of Nora walking away from Hae Sung and back to the life she has essentially \"settled\" for was deeply moving, then when she breaks down in tears at the end I felt myself wanting to do the same\n4) All of the technical aspects of the film such as the direction, cinematography, score, etc are very well done and add to the film's brillianceNEGATIVES:1) I found Nora to be quite an unlikeable and narcissistic character. I understand that the choices she makes are choices that a lot of women will have to make in their lives, but it felt like she sabotaged her relationship with Hae Sung several times and blamed him for it despite him doing nothing wrong, then in the third act when he comes to New York she's basically trying to have her cake and eat it too by flirting with her husband and Hae Sung right in front of each other's faces\n2) I didn't think it was necessary at the start to have a fairly extended sequence of them as children. I think the drama carries more weight when you see the same actors playing these characters throughout and seeing how they change, so having them as kids at the start and played by child actors felt pointless and like a bit of a drag to be honest\n3) I know this is true of almost all films, but there were just several moments in this film where I found it hard to suspend my disbelief and go along with the way the characters were acting. For example, in the bar scene, there is absolutely no way that Nora's husband would just sit back quietly for what feels like an eternity while Nora and Hae Sung are chatting in Korean, flirting and touching each other right in front of his face.",
    "48": "This epic love drama by Celine Song, very talked about and extremely acclaimed, is indeed very much deserving of all the praise and hype it has gotten. It is often talked about as one of the best romantic films ever put together, and already anticipated for an Oscar. And I can do nothing less than agree with all of this.It is expertly paced, covering severak decades in a very clever and well cut way, and handles its beautiful script subtly and without delving into clichs.It is not a triangle drama, even though it might appear as such at first. It all feels very real, beautiful and authentic, very unique.The actors all do an incredible job, and deserve all the praise they have gotten. The cinematography, cutting and editing is also splendid.Overall, truly an incredible film that I would very much recommend for any lover of film, and one of the best in the genre!",
    "49": "I have always believed that simple movies are way harder to make than complex say a marvel movie, simple books are harder to write than complex PhDs, no makeup takes longer to do and more skill than a lot of makeup, yada yada yada. You get what I am saying. Essentially the point is that it took a lot of skill I think to make a movie that is presented so simply and yet it is so warm and lovely. For me my favourite part was the husband and how his dynamic is shown. Top 5 moments of the movie-\n1. The actress! I mean she has personality, she has a clearly defined arc! Like all of it. She is seriously impressive which is why the husbands doubts on why she loves him or the guy saying korea was too small for you makes sense\n2. The actor. Again, he probably had the hardest role having to play a simple, non strong character\n3. The husband! This for me won it. Fave scene was when she comes back in the last scene and how he is already sitting on the stairs waiting and then before she even comes he gets up and extends his arms and only then does she cry. Which speaks to how perceptive af he was. It was absolutely breathtaking.4. Just the korea culture references were so nice\n5. The NYC walking around shotsThe hype is fully worth it guys! Watch!",
    "50": "An old fashioned idea: lost friendships, what could have been, time, memory, and how humans connect love and enhance each other, is taken here and brilliantly updated using a story of childhood friends from Korea separated by immigration and time but who reconnect in a very modern way as adults, the complication being that one is now married. The plot might sound slightly corny, even an echo of Brief Encounter, and in the wrong hands it could easily have been cheesy or overly mawkish, but here we have great sensitivity and observation, with director and writer Celine Song brilliantly taking us on a very human journey without descending into sentimentality. There's incredible honesty & sensitivity here, and superb acting by the leads. One of the years best, and highly recommended.",
    "51": "\"Past Lives\" is the first movie that has drawn me back to the movie theater, after three years since COVID began. It was recommended by friends who are connected to filmmaker, so I thought we should check it out. Unexpectedly though, I sat in my seat totally absorbed as this intriguing movie unfolded and progressed with anticipation. \" What will happen to these characters? What should they do?\" was felt strongly during the entire show. (Though not totally resolved at the end, but appropriately). I am hoping the success of this film will bring more interesting \"movies for adults\" back to theaters.",
    "52": "Immigration is hard. Leaving your friends and relatives is hard. Learning languages is hard. However, most of the time, it is all worth it.However, there are people who believe that life is by definition easier/better in an other country. They go through much pain and give up a lot in order to forge their life there. However, many years later, they might end up worse off than the family members that stayed in their country of origin. Usually, these are the people who try the hardest to justify their initial decision to immigrate.When I saw the movie, it struck me as a heavy case of that.In the beginning, a neighbor asks Nora's mother why they want to immigrate despite having good jobs. There are many valid reasons why a family would want to move from SK to North America. However, the answer that she gave felt very illusionary (USA has Nobel Prizes when Korea doesn't). They were moving there to chase a dream. Definitely not the right reason to uproot your whole family.Then, the movie gives clues about the difficulties that Nora went through. We see her going from a friendly class in SK to being lonely in Canada. She says to Hae Sung that she used to cry a lot when she immigrated, but then she understood that nobody cared.Nora breaks up with Hae Sung because she doesn't want to have gone through all that pain only to end up at her point of origin (Korea).She doubles down on her investment in becoming extraordinary in her new country. She marries her husband in part to obtain a Green Card. It is established that they have a good relationship, but he does not feel that she loves him. In fact, he says that if she would've met someone else with his \"credentials\" at the right moment, she'd be married with him. In other words, Nora married her husband more out of convenience than out of love.After Nora and Hae Sung meet, she says that he feels so Korean to her and that, when she is with him, she feels so American. Basically, the fact of growing up in America had an important impact on her values and character. She would've grown up a different individual had she stayed in SK. Nora even says that that girl (from SK) is gone.However, that girl is not completely gone. Nora's husband mentions that there is a part of her (her Korean part) that he doesn't have access to.We learn that Hae Sung has an average life with an average salary. There are some difficulties that he faces because he lives in Korea, such is unpaid overtime and military service. However, overall, he seems to be doing Ok for himself.Nora, for her part, has not won a Nobel or a Pulitzer prize. She equally lives an average life in a small apartment in New York. She even jokes with her husband that it is not the \"American dream\" that her parents expected when they immigrated.Nora broke up with Hae Sung because she was afraid to have gone through a lot of pain only to end up at her point of origin (Korea). However, at the end, she settled for an average life, not much different that she would've had in Korea. Arguably, she is even worse off, as she seems to be better suited with Hae Sung than she is with her husband. However, this is her life now. There is no way back.",
    "53": "Oftentimes, the best movies leave you wanting for more. Past Lives does just that. At the end, you're left wondered what if things didn't turn out the way it did. What if they tried harder.It's a story about two childhood friends, each living at the other end of the world, connected with memories. When they meet, sparks fly, words fail and eyes speak.Featuring actors Greta Lee, Teo Yoo, and John Magaro, this poignant romantic drama will make you think hard about the choices you make in life. And how they eventually shape your destiny.Past Lives is easily one of the best movies of 2023. You don't want to miss it.",
    "54": "This movie excels at displaying South Korean culture respectfully and in a way that makes narrative sense. It establishes a nimble balance between the respective roles of the western world and the eastern in this lovely story.I figured the girl would just end up with one of the two and that would be it. Oh, how wrong I was. This makes me wanna watch another korean film. Those tailor-made for native English speakers are simply so sweet and navigable in their plots I think I understand how Parasite got an Oscar.The only thing I wish they'd cut was the scene where we're supposed to feel sad for both of them, but the payoff was somewhat insufficient.",
    "55": "It might be possible that the movie is about characters suffering an early loss and becoming stunted - indeed, as children they are companions and she already loves him and they go on a chaperoned date before she leaves and he is shut down and pronounces \"good bye.\" Thus sealed, their pure love is preserved. Nice.But I found the movie rather indulgent, not really about some subtle psychological retreat, rather, the movie glosses over character development because it is not about a parallel universe and how things could've/would've been different or any sort of romance; rather, an indulgent tortured meditation positing a missed opportunity as the cause for a irrevocable fantasy of loss.As such a meditation, character development is minimal - and the acting is great - but it is only because of a gratuitous scene or because a character says so that we know she's a writer at all, that he's an engineer (who was in the military and he learned Chinese), that she loves her husband or he loves her. I don't key into soundtracks but i suspect the film was so affecting because of it, but I blame it for how manipulated I felt this movie to be.The opening scene with some stranger commenting about what the three are doing there at four in the morning is a very weak narrative contrivance, telling the viewer what to wonder about - even a conversation with the bartender would've been less gratuitous.",
    "56": "Firstly, props to the actors for their excellent performances. However, considering the immense hype surrounding the film, we anticipated a more intricate storyline. Unfortunately, the trailer already divulged most of the plot, leaving little room for surprises. As a Korean speaker, I noticed that approximately 3/4 of the movie was in Korean, and the subtitles could have been improved. Halfway through the film, I felt bad for my friends who relied on the subtitles, as they seemed to receive a literal translation rather than capturing the figurative/metaphorical elements. Really wanted to like the film...",
    "57": "PRETENTIOUS, ARTY movie. You know! Those movies that only critics like because it's slow-paced and visually artistic, but there is nothing going on inside the movie. Typical A24 taste and tone. Everything seems so unnatural and set up; frequent long shots of incredible landscapes with serene music; many long pauses between the sequences. My finger was already on the stop button without realizing it. The director would think I'm so creative, special, and artistic, but so many newbies are doing it the same way that it is unoriginal as heck.Their love is not convincing, so there is nothing for me to look at and expect for. Greta Lee cannot act. She's always doing something with her face; she cannot leave it alone, fake-smiling with her lips but not with eyes or twitching her eyebrows or lips. However, when expression and emotions are needed, she looks sooo blank.",
    "58": "Past Lives is one of the best movies I've ever seen. The cinematography is simple but beautiful, the performances are great, the music is perfect, and the third act especially was fantastic. Without spoiling too much, the movie follows two characters at three different points in their lives, at ages 12, 24, and 36. It's fascinating to watch how these characters evolve over the years, and whoever wrote this movie really nailed making their character arcs realistic. Especially between ages 24 and 36, characters will have slight changes in appearance and will have calmed down over time. I highly recommend seeing this movie if you can find it in the theater, but I'm pretty sure it has a fairly limited release. I had to drive almost an hour to get to the only theater in my state that was playing it.",
    "59": "I don't think I've ever seen a more boring and depressing movie. It would have been more fun to count all the popcorns on the floor. In the dark. In Korean. I just couldn't believe somebody made this utter garbage and called it a movie. And then we actually paid tickets to watch it. It is not even possible to spoil to. The exact nonsense at the beginning will be what you can expect all the way to the end. Then you will turn around looking for a hidden camera. It can't be this stupid? Surely they will do something to make it less boring at least in the end? But no! It is a garbage movie about two weak men-childs and one selfish woman. I'd pay NOT to watch it!",
    "60": "I am at 35 mins and counting, and I have already given this a 10. I don't know how it plays out or what will happen even. I know that it is beautifully made with emotions you can feel from just watching as much as I have. The longing of love is in itself a very hard thing. Love stories are often portrayed in a very unrealistic manner but this movie isn't really all about that. The emotion of the main character is phenomenal. The male lead actor is truly amazing. The feeling of being alone while perhaps the love of your life is so far away is an aching pain that is so hard to swallow. You cannot even pretend to be there in your daily life because your heart is somewhere else. I cannot elaborate further because honestly I would be speaking about myself. But it is really remarkable and relatable. It took a while to watch this because I heard about it before but I was waiting for the subs etc. Anyways, it should definitely be nominated for best writing in the Oscar's.",
    "61": "POSITIVES:1) The film does a brilliant job of making you invested in Nora and Hae Sung's relationship. My favourite part of the film was when the two of them are on Skype together, because it felt so real and seemed like watching a real couple building a connection together\n2) All of the performances are brilliant, but especially the actor playing Hae Sung, I thought he was exceptional and made Hae Sung a deeply empathetic character\n3) The ending completely floored me. That long continuous shot of Nora walking away from Hae Sung and back to the life she has essentially \"settled\" for was deeply moving, then when she breaks down in tears at the end I felt myself wanting to do the same\n4) All of the technical aspects of the film such as the direction, cinematography, score, etc are very well done and add to the film's brillianceNEGATIVES:1) I found Nora to be quite an unlikeable and narcissistic character. I understand that the choices she makes are choices that a lot of women will have to make in their lives, but it felt like she sabotaged her relationship with Hae Sung several times and blamed him for it despite him doing nothing wrong, then in the third act when he comes to New York she's basically trying to have her cake and eat it too by flirting with her husband and Hae Sung right in front of each other's faces\n2) I didn't think it was necessary at the start to have a fairly extended sequence of them as children. I think the drama carries more weight when you see the same actors playing these characters throughout and seeing how they change, so having them as kids at the start and played by child actors felt pointless and like a bit of a drag to be honest\n3) I know this is true of almost all films, but there were just several moments in this film where I found it hard to suspend my disbelief and go along with the way the characters were acting. For example, in the bar scene, there is absolutely no way that Nora's husband would just sit back quietly for what feels like an eternity while Nora and Hae Sung are chatting in Korean, flirting and touching each other right in front of his face.",
    "62": "This epic love drama by Celine Song, very talked about and extremely acclaimed, is indeed very much deserving of all the praise and hype it has gotten. It is often talked about as one of the best romantic films ever put together, and already anticipated for an Oscar. And I can do nothing less than agree with all of this.It is expertly paced, covering severak decades in a very clever and well cut way, and handles its beautiful script subtly and without delving into clichs.It is not a triangle drama, even though it might appear as such at first. It all feels very real, beautiful and authentic, very unique.The actors all do an incredible job, and deserve all the praise they have gotten. The cinematography, cutting and editing is also splendid.Overall, truly an incredible film that I would very much recommend for any lover of film, and one of the best in the genre!",
    "63": "I have always believed that simple movies are way harder to make than complex say a marvel movie, simple books are harder to write than complex PhDs, no makeup takes longer to do and more skill than a lot of makeup, yada yada yada. You get what I am saying. Essentially the point is that it took a lot of skill I think to make a movie that is presented so simply and yet it is so warm and lovely. For me my favourite part was the husband and how his dynamic is shown. Top 5 moments of the movie-\n1. The actress! I mean she has personality, she has a clearly defined arc! Like all of it. She is seriously impressive which is why the husbands doubts on why she loves him or the guy saying korea was too small for you makes sense\n2. The actor. Again, he probably had the hardest role having to play a simple, non strong character\n3. The husband! This for me won it. Fave scene was when she comes back in the last scene and how he is already sitting on the stairs waiting and then before she even comes he gets up and extends his arms and only then does she cry. Which speaks to how perceptive af he was. It was absolutely breathtaking.4. Just the korea culture references were so nice\n5. The NYC walking around shotsThe hype is fully worth it guys! Watch!",
    "64": "An old fashioned idea: lost friendships, what could have been, time, memory, and how humans connect love and enhance each other, is taken here and brilliantly updated using a story of childhood friends from Korea separated by immigration and time but who reconnect in a very modern way as adults, the complication being that one is now married. The plot might sound slightly corny, even an echo of Brief Encounter, and in the wrong hands it could easily have been cheesy or overly mawkish, but here we have great sensitivity and observation, with director and writer Celine Song brilliantly taking us on a very human journey without descending into sentimentality. There's incredible honesty & sensitivity here, and superb acting by the leads. One of the years best, and highly recommended.",
    "65": "\"Past Lives\" is the first movie that has drawn me back to the movie theater, after three years since COVID began. It was recommended by friends who are connected to filmmaker, so I thought we should check it out. Unexpectedly though, I sat in my seat totally absorbed as this intriguing movie unfolded and progressed with anticipation. \" What will happen to these characters? What should they do?\" was felt strongly during the entire show. (Though not totally resolved at the end, but appropriately). I am hoping the success of this film will bring more interesting \"movies for adults\" back to theaters.",
    "66": "Immigration is hard. Leaving your friends and relatives is hard. Learning languages is hard. However, most of the time, it is all worth it.However, there are people who believe that life is by definition easier/better in an other country. They go through much pain and give up a lot in order to forge their life there. However, many years later, they might end up worse off than the family members that stayed in their country of origin. Usually, these are the people who try the hardest to justify their initial decision to immigrate.When I saw the movie, it struck me as a heavy case of that.In the beginning, a neighbor asks Nora's mother why they want to immigrate despite having good jobs. There are many valid reasons why a family would want to move from SK to North America. However, the answer that she gave felt very illusionary (USA has Nobel Prizes when Korea doesn't). They were moving there to chase a dream. Definitely not the right reason to uproot your whole family.Then, the movie gives clues about the difficulties that Nora went through. We see her going from a friendly class in SK to being lonely in Canada. She says to Hae Sung that she used to cry a lot when she immigrated, but then she understood that nobody cared.Nora breaks up with Hae Sung because she doesn't want to have gone through all that pain only to end up at her point of origin (Korea).She doubles down on her investment in becoming extraordinary in her new country. She marries her husband in part to obtain a Green Card. It is established that they have a good relationship, but he does not feel that she loves him. In fact, he says that if she would've met someone else with his \"credentials\" at the right moment, she'd be married with him. In other words, Nora married her husband more out of convenience than out of love.After Nora and Hae Sung meet, she says that he feels so Korean to her and that, when she is with him, she feels so American. Basically, the fact of growing up in America had an important impact on her values and character. She would've grown up a different individual had she stayed in SK. Nora even says that that girl (from SK) is gone.However, that girl is not completely gone. Nora's husband mentions that there is a part of her (her Korean part) that he doesn't have access to.We learn that Hae Sung has an average life with an average salary. There are some difficulties that he faces because he lives in Korea, such is unpaid overtime and military service. However, overall, he seems to be doing Ok for himself.Nora, for her part, has not won a Nobel or a Pulitzer prize. She equally lives an average life in a small apartment in New York. She even jokes with her husband that it is not the \"American dream\" that her parents expected when they immigrated.Nora broke up with Hae Sung because she was afraid to have gone through a lot of pain only to end up at her point of origin (Korea). However, at the end, she settled for an average life, not much different that she would've had in Korea. Arguably, she is even worse off, as she seems to be better suited with Hae Sung than she is with her husband. However, this is her life now. There is no way back.",
    "67": "Oftentimes, the best movies leave you wanting for more. Past Lives does just that. At the end, you're left wondered what if things didn't turn out the way it did. What if they tried harder.It's a story about two childhood friends, each living at the other end of the world, connected with memories. When they meet, sparks fly, words fail and eyes speak.Featuring actors Greta Lee, Teo Yoo, and John Magaro, this poignant romantic drama will make you think hard about the choices you make in life. And how they eventually shape your destiny.Past Lives is easily one of the best movies of 2023. You don't want to miss it.",
    "68": "This movie excels at displaying South Korean culture respectfully and in a way that makes narrative sense. It establishes a nimble balance between the respective roles of the western world and the eastern in this lovely story.I figured the girl would just end up with one of the two and that would be it. Oh, how wrong I was. This makes me wanna watch another korean film. Those tailor-made for native English speakers are simply so sweet and navigable in their plots I think I understand how Parasite got an Oscar.The only thing I wish they'd cut was the scene where we're supposed to feel sad for both of them, but the payoff was somewhat insufficient.",
    "69": "Oh my god why was this movie so devastating. This is one of those movies where it builds you up and then proceeds to rip you apart with its well written dialogue and extremely emotional and moving scenes. Like this wasn't an extremely dramatic movie yet it was able to showcase such a range of emotions, such as hope, hopelessness, despair regret, empathy, optimism and introspection all in its short 100 minute runtime. Now to be fair I felt this movie went on for quite a whole and felt a lot longer than 100 mins. That is not to say that it wasn't thoroughly enjoyable. It was like a Korean lalaland. 8.5/10.",
    "70": "The film is genuinely pure and simple. It never tires you with bizarre camera transitions; instead, it boasts beautiful cinematography. From an emotional perspective, it mostly satisfies and manages to resonate with your soul in some way.I'd like to make a special mention of the director; they truly excel in the art of filmmaking. The camera transitions, scene composition, the color harmony in consecutive scenes, and the simplicity of it all made me very happy. Even though this might be Celine Song's first directorial work, I believe she was highly successful. The screenplay, in my opinion, was definitely not boring. Of course, there were parts that could be improved, but most of it was well-balanced and it genuinely surprised me, so I wanted to give credit where it's due. It's already a strong contender for one of the cleanest films of the year. The acting performances were surprisingly good, consistently solid, and everyone did their job exceptionally well, conveying their emotions effectively.Regarding the spoiler part, there are two aspects I would have definitely elaborated on. First, there could have been a quicker passage through Hae Sung's relationship with his girlfriend; its absence left me feeling a bit incomplete. Second, in the final scene where Nora, Sung, and Arthur are sitting in the bar, I would have liked Arthur to be more involved in a deeper and more meaningful conversation about life, drawing from his own experiences and love. Just admiring Hae Sung and feeling inadequate doesn't necessarily imply a lack of dialogue; it could have been written better. But apart from these two lengthy sections, the online party introduction sequence, time jumps, and so on were well-executed, and I really liked them.In summary, it's a clean and emotional film. I usually don't enjoy emotional films when they feel artificial, but this film managed to portray even the unlikely scenarios realistically. It could have reached a whole new level with a few more detailed sections. Highly recommended.",
    "71": "Outstanding performances by the three leads, a wistful, tender and unobtrusive soundtrack all add to a solid and nice little romantic drama.Predictably Bradshaw and Kermode et al have over-rated it (? A female writer/director like the equally over-rated Celine Sciamma tend to make these middle aged male critics wet their pants!).The story itself is rather unoriginal and done much better in Richard Linklater's Before trilogy and Normal People a TV show from the BBC.Where these two works were better was they had two leads with chemistry-the Koreans here have the less chemistry, so I was never fully engaged with them and like Normal People I felt the beginning rushed and when they finally DO meet up after time away I felt rather anticlimactic. Past Lives needed, I felt, time with these two as kids ? Another couple of scenes at least showing there was a spark , even if it were a childish spark, then I would have rooted for them more as they were into there late teenage and early thirties years.The 'bar scene' at the end felt too contrived and silly for them to speak so honestly and openly in front of the husband, who can't comprehend their Korean. This went against all what 'Nora' spoke about earlier in the film to 'Arthur' . Surely, their characters could have done this on the ferry or the park. This seemed too theatrical and overwritten\nI did like it and will be thinking of it a lot, mainly the lovely soundtrack and performances.",
    "72": "With as much opportunity to delve into what makes people connect beyond a cloying notion of \"fate,\" the movie rides smugly along the loooooong, quiet shots of nothing happening, no major ideas being grappled with, and no real character development to show us anything more than a single definition. \"In-yun\" potentially could be seen as an explanation for our lives' directions, if given anything more than a single scene (the movie's end) to imagine that deeper understanding. Unfortunately, the film relies on the concept writ large instead of with the nuance that our human interactions deserve. The conversations that are meant to show us how a person's specter haunts and defines us are nothing more than the banal. Again, a lost opportunity. The attention to detail is lost, too, when a novelist (of several books) misuses \"lay\" for \"lie,\" a minor note, but a significant corrosion of authenticity. Not visually stylized enough to allow words to be as unimportant as they seem to be in this film.",
    "73": "Am I missing something here? After reading such rave reviews at what was supposed to be a beautifully crafted, emotional film I thought I'd give it my time. My initial scepticism was not misplaced.A dire drama played out over period jumps in units of 12 years. Boy/girl at school, girl's family emigrates, leap forward 12 years, leap forward another 12. Nothing of note really happens. A deep longing for each other materialises over distance but there is little in the way of drama. Bland as bland can be.Zero character development and clichs by the bucket load. Everyone has to be successful and beautiful. Ordinary lives don't make it into this film.It has good cinematography and production. Acting is poor to middling. Cinema's anchor in the doldrums is firmly stuck.",
    "74": "Schmear on schmaltz, schmear sentimentality on top of that, schmear on treacle, and you have PAST LIVES. But like ONCE, this indie gem turns an impossible situation into this deeply affective tale of romantic unfulfillment. It's completely crayon-by-numbers, but really works. It also lightly touches on issues of immigration, Green Card marriages, women's rights--though ever so lightly, taking nothing away from the basic melodrama. You even get handy, helpful intertitles like: \"24 YEARS EARLIER,\" so you always know exactly when you are in the timeline. Not a Christopher Nolan brain tease!And ...there will be tears.",
    "75": "This is more of a \"What if\" film than a romance movie which is where I think is the start of some of the issues I had. Instead of having a character that is truly in love with her husband, we have her going on dates with a childhood fling because it reminds her of her home in Korea. However, she fully embraces her Americanized self which boggles my mind why she would then go on dates with her Korean fling while married. While I appreciate the authenticity of this story by Celine Song, it was way to slow paced to keep me invested during the entire run time. There is an issue when the two leads have more chemistry over Skype than in person. You could maybe argue that is because they have changed after their time apart, however, I feel like it's more of this weird characterization Celine Song decided to go with since this is clearly based on her own personal experience. She is even married to a Jewish writer right now who wrote the script for Luca Guadagnino's new film \"Challengers\", so it would be hard to deny that this is not somewhat autobiographical. I have to admit, these performances are fairly strong by the three cast members, especially John Magaro who has the strongest characterization of the three. I'm not sure I liked how the spoken Korean was slowed down to cater to American audiences, but it wasn't the hugest flaw in the picture. I also have to admit that this is expertly shot, yet I do think there is a an overuse of establishing shots to emphasize the space between the characters. If you want to watch a better movie about lost love, I would recommend watching \"Before Sunset\" instead and save yourself one hour and forty five minutes of your time which feels more like two hours and half because of this methodically slow paced burn. And yes, that ending was effective, but it takes more than a strong beginning and end to keep my attention.",
    "76": "This film looks absolutely gorgeous from a cinematography standpoint. Shabier Kirchner crushed it shooting on film, it was a pleasure to watch, creamy colors, chef kiss. The actor performances were also incredible and authentic.From a story standpoint, however, I found it hard to believe. A super attractive / model looking guy obsessed with the same girl for most of his life? Near the end of the movie, it just became kind of creepy.They were friends when they were kids and then at 12/13 years of age they were separated. Why wouldn't this super hot guy move on, date women, get laid, start a family?Instead he'll mope around for like 20 years being sad over a girl that is now married and has a life in a different country?The end was also cringy with the two Korean characters flirting wondering \"what if?\" while the husband is just sitting there like a dope letting his wife flirt away? I felt so bad for the husband, seriously.",
    "77": "Finally, a movie where the two male love interests break free from the typical good guy/bad guy clichs and engage in a mature and inspiring manner. The characters come to life with their authenticity and depth, brilliantly portrayed by the actors who convey a whirlwind of emotions beneath those prolonged, tense silences. The anxiety, desire, and anger, though sparingly verbalized, practically leap off the screen, making the discomfort almost spine-tingling for some viewers.This movie has left me with a mix of emotions, including a poignant sense of resignation. It reminds us that no matter how strongly we desire something, it may not always be the right time, yet there's room for hope that another opportunity may arise in the future, perhaps in another lifetime.",
    "78": "If I had a penny for every time a director named Celine broke my heart with a wistful tale of a seemingly doomed romance, I'd have two pennies... which isn't a lot but it's weird that it's happened twice.I need to talk about 'Past Lives (2023)' but I'm not quite sure if I know how to. It's the sort of movie that just hits different, a poignant tale of love and life that's at once incredibly romantic and unashamedly pragmatic and, above all, deeply beautiful. It's a profoundly sad movie, but it isn't sad in the traditional sense. The sadness it provokes is the kind of sadness that sits in your bones, the kind that doesn't dampen your happiness but sits alongside it, the kind that you can't escape and don't even want to, the kind that's there even when everything in your life is just right and there isn't anything more you could ask for in the whole wide world. It's the sadness of regret, of the choices not made, the paths not taken, the loves not loved, the lives not lived. It's the acceptance that you have no part in whatever has come before and whatever will come to be, that you may have lived a million past lives and will live a million billion more but will never know of them. To truly comprehend the endless possibilities of all those lives lived and all those lives yet to be lived is almost impossible, especially when you consider the infinite possibilities of the one you're currently living and then acknowledge that you're just one of around seven billion other people also scrambling to come to terms with their place in all this. To find a connection in this sea of uncertainty is a miracle, and to let one go takes all the courage of reaching out to grasp one in the first place. This movie stirs all these thoughts and more with its gentle tale of would-be sweethearts finding their way back to each other once every twelve years. It finds beauty in letting go, in staying steady, in doing the opposite of what so many other romance movies beg you to do. Sadness never felt so... okay. No matter what might have been, there'll always be what is and what was. The grass may always be greener on the other side, but if you look down you might just find that the grass beneath your feet is plenty green enough. So alongside all the longing, there's also a remarkable kind of acceptance. The movie is joyful in its own way, life-affirming because it keeps its feet on the ground and not in spite of it. The central dynamic is as sweet as it is tragic, genuinely moving even in its inevitably doomed iteration. It's not what they might have that connects so much, it's what they do have; not the possibility of ongoing romance, but the In-Yun that links them together as they are now. Greta Lee is nothing short of a revelation, but that isn't to suggest that Teo Yoo and John Magaro aren't also utterly delightful. The calm yet confident screenplay gives all three a lot to work with, remaining restrained even when it seems counterintuitive to do so. It drops profound lines like they're nothing, and it takes a second for their weight to really catch up to you. A lot of the character work is internal, which actually increases its honesty and makes it all the more affecting. The editing only occasionally makes itself outwardly known, but when it does it's really powerful. The same is true of the direction overall, which is deceivingly simple; to be as sturdy as this is surprisingly difficult, indicative only of a highly accomplished filmmaker. This is just an incredible feature all round, and the fact that it's a directorial debut is close to one of the most impressive things I can imagine. It's hard to process exactly how it makes me feel, but that it makes me feel so much should be all the indication you need that it's truly phenomenal.",
    "79": "This engaging film uses a less trodden path and finds much to say about relationships and marriage. A childhood crush followed by 24 years apart might not sound like a promising premise for emotional insights, but it works here, because of a probing script and touching performances.Greater emotional intensity may perhaps have been delivered if the non-couple had broken through the barriers into passionate romance and the cuckholded husband had fought back. But the makers wisely eschew such excesses to deliver a story that carries truth and sincerity.The result is a gently moving tale that lingers in the memory. Well worth your time.",
    "80": "You will be pleasantly surprised by this film. The female lead and the male lead have quite different energy that goes very well together. Although not that much happens the movie moves quickly and keeps you intrigued. It's a familiar story that is told with a twist and turn that you can certainly enjoy. Parts are in Korean with English subs but that doesn't take away from the movie. Highly recommended to watch and it sure it will be in for some award noms later this year. A24 seems to be consistently popping out hit after hit with minority cast particularly of Asian descent and this is one of them so don't miss it!",
    "81": "Never understood the difference between a nine and ten rating...and since i didn't find anything wrong with this film, i opted for the latter...\nthis is one of those films that i love that are understated and yet say so much by not coming out and explaining things...they're there just the same...and tremendously evocative...poetic... bittersweet in a way that hurts so good. This is NOT a film for the young...it involves nostalgia and, potentially, regret/s. It's not some big hollywood production but it has everything it needed to tell the story oh so well...pardon the pun, but...it's a beautiful song that has no words and yet is deeply lyrical...\nkudos to writer/director celine song...someone whose future works i intend to not miss.",
    "82": "I found it to be one of the best romantic movies that I have seen till date. But this movie kept reminding me of the Indian movie 96. I don't know how but both the films looked similar, maybe it was a coincidence. I would suggest that those who haven't seen that film should definitely watch it. As far as past lives are concerned. The sincerity with which this film has shown love, wait and acceptance is praiseworthy. The film will touch your heart, it does not show anyone's feelings wrongly. Just makes you feel what the last love is. The BGM of the film is so calm and lovely that you will feel as if you are not watching the film but living with the film.",
    "83": "Truly I didn't think it could ever happen but they've done it with this movie. They finally made a love story that is worse than Twilight - Elizabeth Witts.I couldn't say it any better than that. I can add that the three main actors are rubbish and the script and direction is pish.I heard what this film was about and thought of about 20 different things in a minute that were better and more authentic than everything that happened in this turkey. Talk about lazy, this film yawns its way through, boring us with its obvious, baby steps that end up making an episode of Neighbours look like Bergman.",
    "84": "Providence. A concept around which this film revolves. We may find in it pain in the same amount that we may find solace. A problem that couldn't possibly be solved leaves us no choice. What kills us is the eternal question. How do we know we chose for the better?There is no poetry in this film. The director would rather show us the mundane crumble of words when we are before someone we love that romanticise the desire and longing of human beings. It is the main reason I loved this piece of art.I try not to give too many perfect scores but for me the very definition of it is to leave ingrained in us the seed of cinema. When we hear or see this movie mentioned someplace else we will smile and say, \"How wonderful it was!\"",
    "85": "\"Past Lives\" is like a Stephen Sondheim song come to life.You know the song \"The Road You Didn't Take\" from \"Follies?\" How it's all about the different doors that exist along the path of life, but you only get to enter one at a time, leaving you to wonder what was behind the other doors. And that one path isn't necessarily better or worse than another, just different. And that you'll never know what was behind the doors you didn't choose, and that anyway time will eventually smooth over the regret you feel at not choosing them instead. Except that it doesn't always, and you may never stop completely regretting the life you think you might have had, even if you don't really mind the life you do have.This movie is that song. It's watching a beautifully defined female character convince herself and her husband that her life is what she wants it to be, and that she doesn't wish she'd taken a chance on the childhood sweetheart who comes back into her life after years apart and with whom she has off the charts chemistry. The actors who play the sweethearts as adults, Greta Lee and Teo Yoo, are both exceptional, but it's Lee who creates the most fascinating character. A bit cold, a bit distant, not always even completely likable in a way that's hard to define, a bit casually cruel to her husband who by anything the movie shows us can't be judged as anything other than a good, solid, and super understanding guy. But then there's that last scene that took my breath away, when we see the resolve not to feel emotions that would be inconvenient to feel give way, and we realize just how much has been roiling underneath the surface of Lee's character all along. It's magnificent and earned its right to leave me a quivering mess.The movie is also a sensitive look at what it feels like to be an immigrant, torn between two cultures, and not sure whether the nostalgia you feel is what you really want or just the allure of the familiar.A really great bit of counterprogramming in a summer that seems to be dishing up nothing but Marvel movies.Grade: A.",
    "86": "Past Lives hurts. It's sort of like all the movies in the Before Trilogy rolled into one, and if the two people there had first parted ways in childhood. It also made me think about some recent films, like The Worst Person in the World, Return to Seoul, and Aftersun. It's got more in common with the first two than the last of those, but I guess they're all going to form a 2020s Quadrilogy of Sadness in my mind (much more memorable than a Triangle of the same thing).Maybe Quadrilogy of Longing or Regret is a better name. These are all films that grapple with regrets of the past and uncertainties of the future. They largely centre on young characters, and all demonstrate that cinema is not dead or bankrupt on ideas if filmmakers like the ones behind these are still finding new, interesting, and uncompromising ways to make viewers feel very moved. I do compare Past Lives to those, but I should also say it in no way feels derivative. The emotional and narrative experience it offers is still distinct and undeniably effective.When it comes to Past Lives, there were just a couple of scenes where I thought the dialogue was laying it on a little thick, but this film's otherwise hard to fault. It has great performances, and a real understated beauty to the visuals that I really loved. Part of me wonders how it would've resonated if I'd seen it at a different age, but I feel like anyone who's in their 20s or 30s and is currently feeling a little vulnerable in life will find this one hits hard - maybe even too hard, because it strikes a nerve and feels raw in the best (and most difficult) way possible.",
    "87": "And first-time director Celine Song has created one of these. It's a masterpiece of deeply genuine human emotion. And that masterpiece is Past Lives.Song's dialogue is understated to the point of risking not creating a connection with the characters. It would not have worked with sub-par actors. But the risk payed off big time-all of these actors are wonderful, allowing their body language and line delivery fill in the gaps with their characters' true psychology.A simple plot becomes a richly complex story of lost love, sought closure, and found purpose; and it's all due to Celine Song having the proper understanding of when to allow silence to speak.Yet despite the frequent bouts of silence, not a moment feels wasted. Every shot and sentence is meticulously edited to give us exactly what we need to feel each moment with its full emotional power.This very well may be the best film of 2023. It's the work of a master storyteller, and it's only her first film.",
    "88": "Past Lives is a beautifully understated and emotionally resonant film about the power of love, loss, and second chances. The film follows Nora (Greta Lee) and Hae Sung (Teo Yoo), two childhood friends who are reunited 20 years after they were separated by Nora's family's emigration from South Korea. The film explores the complex emotions that arise when these two old friends reconnect, as they grapple with the choices they've made in their lives and the possibility of what might have been.Song's direction is assured and sensitive, and she elicits outstanding performances from her two leads. Lee and Yoo are both incredibly charismatic and believable as Nora and Hae Sung, and their chemistry is undeniable.The film's cinematography is gorgeous, with Shabier Kirchner's lens capturing the beauty of both Seoul and New York City. The film's score is also superb, with a haunting and evocative soundtrack that perfectly complements the film's emotional tone.Past Lives is a beautifully made and deeply moving film that will stay with you long after you've seen it. It's a film about love, loss, and the power of second chances, and it's sure to resonate with anyone who has ever experienced the pain of separation or the joy of reunion.Rating: 4 out of 5 starsSome of the things that I particularly liked about the film include:The film's understated and realistic depiction of love and relationships.The film's sensitive and nuanced portrayal of the Asian American experience.The film's beautiful cinematography and evocative score.The film's two lead performances, which are both incredibly charismatic and believable.Overall, I thought Past Lives was a beautiful and moving film that is sure to stay with me long after I've seen it. I highly recommend it to anyone who is looking for a thoughtful and emotionally resonant film to watch.",
    "89": "The wind, the leaves, the streets, the towers; everything exists with a supple glow. There's a love for environment behind the camera, where director Celine Song stands, telling her story. Kirchner, her cinematographer, lends immense craft to the film's 35mm scenery. Nora, Hae Sung, Arthur; the three central characters are handled with wonderful grace. They easily communicate complex emotion. They're likable, and they're relatable. New York City, Seoul; I hardly know either of them practically, but now I feel like I do, in some intimate way. These two cities are dearly loved. Longing; what did you think of when you finished this film?Past Lives is an honest, delicate, and ambling movie. Nora, once a little girl from urban Korea, chooses her path as an American writer after immigrating with her family. She marries a different writer (Arthur, a Jewish New Yorker), adopts the culture of NYC, and chases her ambition. She's still Korean, but the identity ebbs. She doesn't sound like it anymore. Hae Sung, her childhood friend who never left the country, is very much Korean; his path is that of an engineer living with his parents, which he describes as ordinary. He loves Nora deeply. He loved her when she left Seoul at twelve, and loved her still at the points in which their lives intersected. Nora loves him too, in her own complicated, almost grieving way. He is her connection to a childhood she longs for, washed away in her memories, and seldom revisited because of the complicated feelings that come with being a child immigrant.The story is simple but it bursts at the seams with emotion and humor. Admittedly slow, but without wasting your time. I connected with all three of the main characters to some degree, each carried by an actor with the apparent gravity of a veteran superstar. They are emotionally intelligent, and they react to each other in interesting, startlingly realistic ways. Celine Song plays on a very specific feeling of aching; for a forgotten time in one's life, for an identity, or for a lover. It's particular, but looking around the audience as we left the theater, you could see that most people were in their own heads, thinking of something (or someone). We all long for something lost.Perhaps not all of us, but probably most, have also wrestled with the feeling of permanence in the journey we choose for ourselves. You only live once, said Drake, but that's really a terrifying thought sometimes. Carving out one lifetime - engineered across thousands of individual decisions - means foregoing an infinite number of others. People deal with this in a number of ways; providence, reincarnation, and an afterlife, to name a few. Nora and Hae Sung might be soulmates, but will they know it in this lifetime, or the next?I really can't wait for the next project Song works on, and that goes double for the cast. I sunk my teeth into this deeply romantic, deeply resonant film, which is capable of bringing immense longing to the surface. It is coated with a beautiful score and draped atop memorable settings. It's a home-run.9/10 for making me want to visit Seoul.",
    "90": "I saw the trailer to \"Past Lives\" before a showing of \"Master Gardener,\" and immediately knew I wanted to see it. I have an affinity for Asian cinema, but more than that, the concept of past lovers reconnecting after decades made for an intriguing premise, one that I had to see unfold on the big screen. And after seeing it unfold (on the big screen), I honestly can't tell how I feel about \"Past Lives,\" which, I guess, means it left me feeling kind of cold.With so many people gushing over this movie, the fact that I fail to see what others are seeing has made me somewhat uncomfortable. I'd have loved to witness the \"pitch-perfect romance\" that critics say \"Past Lives\" contains. I wish I managed to see the \"first great film of the year\"; instead, I watched a perfectly watchable film, but one that didn't leave much of an imprint on me. \"Past Lives\" is less a romance and more a dramatic exploration of what could have been. And while that seems like it could be interesting, the unlikeable character of Nora, played by Greta Lee, and the distinctly unromantic and uncomfortable story progression made for a decidedly cringy experience. So, let's start with Nora.Greta Lee is a great actress - there is no doubt about that. The thing is that her character, Nora, is extremely unlikable and unsympathetic. Throughout the course of the entire film she makes mean, borderline cruel choices that put others through the emotional ringer. This left me entirely unsympathetic to her romantic plight - however, I did enjoy Teo Yoo's portrayal as Hae Sung, and especially John Magaro's character of Arthur; both of them play entirely believable and relatable characters who become caught up in situations either of their own doing or of someone else's.As I mentioned, \"Past Lives\" is also remarkably unromantic. Instead of seeing two people fall in love against all odds, you'll witness a bizarre sort of reconnection with a third-wheel that is obviously against everything that's occurring. It's not romantic - purposefully so, I think - but it's also not very fun to watch, which might be the point, but still. The whole \"will they, won't they\" scenario begins to fall short as you'll begin to realize that you don't care whether they will or they won't because of how awkward the entire scenario is. And with an ending that feels more of a fizzle than a bang, when the credits rolled I couldn't help but feel empty. \"That's life,\" the movie seems to say, hoping you simply accept what it's showing you.The more I think about this film, the less I like it, which sucks because I really wanted to like it. Call me a romantic, but I was hoping for a more straightforward love story, and what I got was something that was awkward, uncomfortable, and un-enjoyable.",
    "91": "Having played at the Sundance and Berlin Film Festivals this year to rave reviews, A24's \"Past Lives\" is every bit as extraordinary as many are claiming it is. I've always liked many A24 films, so after the film's sterling critical acclaim, I was very interested in seeing it. There's no doubt that this film is just about as supremely impactful and thoughtful a directorial debut, that analyzes and meditates on universal themes through the lens of unique subtexts and incisive, superbly written character development. The film's title derives from the South Korean concept of \"In Yun,\" which means that the experiences with other people that we meet and spend time with in life today are derived or based on equivalences from past lives. The film follows Nora (Greta Lee,) a writer originally from South Korea who had immigrated first to Toronto and then to New York City. She's married to Arthur (john Magaro,) but has also been connecting over FaceTime with her childhood friend Hae Sung (Seung Min Yim.) He has recently finished his mandatory military service in Korea, and hasn't seen Nora in over a decade.While some of the basic themes that Celine Song's screenplay touches on may seem clichd, viewers should know that their treatment in the story and relative to the powerful character development is completely original and creative. There is a deep emotional impact on the viewer as the most basic themes of the story (love, interpersonal connection, friendship, immigration, cultural identity) affect the three main characters each in different and wholly authentic ways. The screenplay is superbly written, establishing dramatic tension in an interpersonal way while thoughtfully taking its time to further develop the storytelling. At a relatively short 106 minutes, the film is perfectly paced, never seeming too fast or too slow to allow the viewers to appropriately interpret the characters and their unique qualities and place within the story. Being able to provide such a powerful performance to complement this material is no easy feat, but all three main actors (Lee, Min Yim, and Magaro) do so with flying colors. Their emotions and chemistry are completely genuine from the first frame until the credits roll. While the film's stakes may seem relatively low (and, to some extent, they can be,) Song's formal, technical, and artistic control of the medium is no less extraordinary. The film is beautifully shot and scored, presenting an understated, airy, and gentle vibe that complements but never overbears the outstanding acting and writing on display. It's lyrical, enthralling, and fully liberated from derivativeness or tedium. Even simple location shots, such as a carousel near a waterfront, help complement the emotional connection between the characters in such shots in a soulful and deliberate way.In short, \"Past Lives\" provides a well-made and well-acted reflection on how love, longing, and culture make us learn and grow over time so powerful and rooted in original and creative storytelling. As a result, in my opinion, it is the best film released since Bong Joon-ho's \"Parasite\" in 2019. Bravo! 10/10.",
    "92": "I from time to time love and enjoy an emotional romantic drama, and international and foreign films do just fine with the theme and genre. This latest independent work from \"A24\" called \"Past Lives\" is one touching and powerful journey of how the past and the lives of people can come full circle. The films spans forward and shows flashbacks also. It is the story of two childhood friends Nora(Greta Lee) and Hae who grow up in South Korea and they seemed destined for each other only when Nora and her family move to New York City things change. Yet many years later Hae finds Nora on face book and facetime and connects with her. Only as in life and love their emotions take different paths as Nora marries another playwright. Only Hae Sung does journey to New York city to meet her and the love, memories, and connection is felt as you the viewer see the emotions of friendship, culture and it has both asking as to what might have been, yet other things must have been meant. As thru the connection and rediscovery Nora still stays married. Overall good well done film of love, and reconnection showing how fate and chance and change plays a part in life.",
    "93": "Korean/ USA Movie \" Past Lives \" is a drama about what ifs, lost relationships, and identity.The movie has impressive cinematography, with a gloomy New York as the main setting, offering the right space for the melancholic tone of the story. And true, the plot is quite blue, with the two main characters missing chance after chance to be together. At the same time, the questions of identity and home are often set out to become obstacles for them, other than bad timing and bad decisions.Other than that, the movie seems to never reach that burst that the story needed, whether that was a happy ending or a tragic ending. Also, the time jumps were plenty and messed up the pace and the cohesiveness of the story.Finally, the performances were smooth and enjoyable by every actor and actress in the cast.So, overall, five out of ten. It's an interesting movie, but it turns out to be just okay.",
    "94": "I felt that the director spent too much energy establishing the distance in time and location, that she didn't develop the characters enough to make you feel empathy for any of them.Sure many of us have had that childhood crush that we wish could be revisited in later years, or at least some curiosity of what happened in the meantime. But it feels like those gaps in time weren't filled with anything. It's as if the characters had stopped for 12 years, then started again, then stopped, then started again, which would not be realistic.I was also half expecting Nora to talk about 9/11 as they were on the boat, and how it affected her, as she would have been living in NYC at that time, but that wasn't even brought up. Not that it was crucial to the plot of the film, but it did shape a lot of people's lives who lived through it.What really got under my skin, though, was the long pauses. I get it, you want to convey emotion through watching the characters pausing and looking at each other without saying anything. But after the 3rd or 4th time, it just felt really forced.Ultimately, I didn't really feel any emotion for any of the characters, and what good is a drama if you aren't connecting with the people in it? Worth a look, but in the end, you don't really feel you learned anything at the end.",
    "95": "\"Past Lives\" is a romantic drama film written and directed by Celine Song. Starring Greta Lee and Teo Yoo, it is a sincere, touching look at two interesting people and the way that life has dictated their fates.In 2000 in Seoul, South Korea, Hae Sung (Seung Min Yim) and Na Young (Seung Ah Moon) are school friends who have a mutual attraction to one another and are later set up on a date together by their parents. Sometime after, Na Young and her family immigrate to Toronto, Canada, causing the two friends to abruptly lose contact. Twelve years later, Na Young (Greta Lee) has since taken the English name of \"Nora\" and has moved to New York City to become a playwright while Hae Sung (Teo Yoo) has recently completed his mandatory military service back in South Korea. One night, Nora looks up Hae Sung on Facebook and after finding him learns that he has been searching for her online for a very long time. The two soon catch up via Skype video chats and each express a desire to visit one another, though neither are able to do so due to matters in their personal lives, which causes the pair to stop communicating for another twelve years.Unknown to most people in the west is the Korean concept of \"in-yeon\", which means that if you were to meet somebody for even a brief moment, then you will have also met them at some point in a previous life. This can be applied to something as simple as a quick interaction with an acquaintance with whom you barely know or even a long term bond with somebody you love, the latter of which will have had multiple meetings in each of their past lives. Due to the sheer amount of interactions that take place between different people every day, it is impossible to fully gauge the myriad of the possibilities that can stem from a concept like this, but it can be fun to speculate. The film \"Past Lives\" focuses primarily on this by featuring two specific individuals who each seem fated to meet regardless of the circumstances driven between them.What I think makes this film work so well is in the honest, yet simple growth of its characters during the twelve year intervals of each of their lives. Both Nora and Hae Sung are shown to have taken different career paths that have shaped their personalities as well as their views of the world around them. For instance, Nora is shown to have exhibited creativity even at a young age and after spending so much time in her adoptive homeland, she decides to move to New York City to write plays for Broadway. Due to her living in America longer than in her birth country, Nora has become almost entirely accustomed to western culture, to the point where she only ever speaks her native Korean to relatives back home.On the other side of the globe, Hae Sung remains loyal to his Korean roots, serving his allocated time in the military and subsequently studying to become an engineer. When Hae Sung later discovers he must leave the country for the first time to learn Mandarin in China, he realises he will now be able to see the world beyond simply where he was brought up, allowing him to become a more open-minded person. Despite living in two entirely different countries for so long, we see that Nora and Hae Sung never once forgot about each other. As a result, the film allows the audience to properly understand their respective points of view and why it is destiny for them to continually cross paths no matter their location.In her directorial debut, Celine Song handles this film about two intertwining lives in a mature, workmanlike manner. Song makes great use of closeups on the main characters' faces to emphasise their longing to interact with each other. For example, in one scene Hae Sung is shown catching a train home from university where he spies a young couple across from him cuddling up to one another. Craving this experience himself, he looks down at his phone hoping in vain that Nora has sent him a message to put his mind at ease, but to no avail. Similarly, when Nora is the first to arrive at a writer's retreat, we see her search the empty location for a room to stay in, which could be interpreted as mirroring her desire for true human connection in her vacant world. Even though she has settled into the American way of life, Nora cannot escape the fact that she is still a Korean by birth and that she will always have that subconscious yearning to be with someone just like her. I was particularly impressed at how Song managed to overcome what could have been a difficult boundary between eastern and western cultures to show us that this film's message is capable of transcending a mere language barrier.Additionally, Song doesn't shy away from informing the audience of all the important tidbits and character quirks to make us care about why these two should want to stay in contact with one another. Nora is seen writing plays and pitching her ideas in front of a Broadway committee hoping to gain the required recognition to qualify for an award, something she told Hae Sung about in their youth. Likewise, Hae Sung is worried about working a job that doesn't earn enough money to provide for any potential girlfriend he may have, which alludes to him feeling insecure about Nora's sudden departure from his life just as they were starting to grow close. Vital information like this is necessary to flesh out both Hae Sung and Nora as real people with real aspirations in a way that all viewers can appreciate whether they realise it or not.The performances of both Greta Lee and Teo Yoo are what can best be described as the collective heart of this movie. Each moment these two are onscreen together, whether it is through a Skype call or a split-screen shot on the director's part, you definitely get the sense that they hold a deep, emotional connection among themselves. Lee does a fine job showing how the Americanised Nora still longs for everything she enjoyed about her childhood back in Seoul. She notably demonstrates this through her Korean side occasionally shining through whenever she interacts with her caucasian associates.On the other hand, Yoo portrays Hae Sung as a man struggling to find that special someone able to replace his childhood crush, effectively erasing her from his mind once and for all. Naturally, because of \"in-yeon\", it is apparently destiny that he will always end up encountering Nora at some point in his life, which makes this an increasingly difficult task. Yoo manages to depict Hae Sung not as a desperate loner but rather as an unfortunate soul grappling with the reality that he may never actually find true happiness no matter how hard he tries. It is a sad reality for many people out there who are unable to pair bond with someone they genuinely care about, however that is unfortunately the way things need to be.Whether you believe in the concept of \"in-yeon\" or not, it nonetheless remains an interesting theory in its own right, and a film like \"Past Lives\" helps communicate that to a wider audience. It's nice to see that there are filmmakers like Celine Song who are able to channel this sense of curiosity into an effective motion picture that definitely leaves an impression. If you're like me, you may even catch yourself from time to time thinking about all of the people you have interacted with throughout the course of your entire life and how their significance has played a part in shaping the way you view the world, either for better or worse. On that note, nobody knows what the future holds for us, but one thing's for certain - it's going to be an eventful journey either way.I rate it 8.5/10.",
    "96": "As the son of parents who were childhood sweethearts/soul mates, I tend to be a sucker for movie romances that address this subject. In this case, however, the only \"sucker\" aspect applies to the money I plunked down to watch this two-hour snoozefest. Writer-director Celine Song's debut feature has been praised as a masterful piece of filmmaking and one of the best pictures of 2023, but I heartily beg to disagree. When a pair of young, tightly knit Korean friends, Nora (Greta Lee) and Hae Sung (Teo Yoo), part ways from their native Seoul and are later reunited in New York after a 24-year separation, the reunion of these childhood pals provides them with an opportunity to reflect on what might have been. However, their time together consists mostly of a series of overly bloated pregnant pauses, inane dialogue and missed chances to discuss much of anything meaningful, the kinds of scenes that make even the most patient viewers want to yell \"Get on with it already!\" These \"conversations\" come nowhere close to matching their joy of their spirited youthful interactions or the heartfelt, substantive talks that later take place between Nora and her husband, Arthur (John Magaro). The result is, quite frankly, a big fat bore that's trying to be more than it is but never achieves that outcome. Perhaps the biggest problem with this is the film's truly sincere but decidedly paper thin narrative that doesn't have the writing support to bring it all into beautiful full bloom, despite some fine performances, exquisite cinematography and an emotive background score. From this, the director would appear to have a hefty reserve of potential stashed away, at least based on this offering's stylistic elements, but the substance could use some definite shoring up. Let's hope her next effort lives up to that.",
    "97": "An early life connection that lingers over more than a 20-year span is at the core of this brilliantly realized drama. A promising female student in Korea finds herself drawn to a boy in her class with whom she routinely competes against for the highest marks. Before anything can come of it, her family emigrates to Canada. The film follows both of them as they go from childhood into early adulthood, choosing vastly different paths but keeping their memory and connection alive along the way.The three principals are splendid in this film. Greta Lee is a joy to watch as the schoolgirl-turned-playwright whose Korean upbringing is revived when she reconnects with her old crush. Teo Yoo is wondrously subtle as the young man who cannot forget the girl he knew so briefly. And John Magaro is wonderfully sympathetic as the American husband who readily sees his wife's childhood memories rekindled.It is intriguing to follow the life story of this Korean woman making her way in a foreign country, though some of the details were kept too short and would have had the potential to be portrayed with a little more detail. Summarized, this is a story about possibilities and fate, especially when the past is visiting the present you can always wonder about the what-ifs.Highly recommended for everyone.",
    "98": "Truly, cannot understand the gushing acclaim this movie has attracted. The main character Nora, is supposedly an ambitious and gifted writer, aspiring to win a Nobel Prize or a Pulitzer, but can't seem to string more than a bland, stunted, superficial sentence together. Her sulky, cold, prepossessed, vain behaviour was grating to watch for nearly 2 hours. It was disturbing watching Nora manipulatively play an emotional cat and mouse game with the two, supposed 'loves of her life'. When she immigrates from Korea to America she cannot even summon a goodbye to her sensitive, devoted, childhood sweetheart, Jung Hae Sung. The script is excruciatingly silly at times, for example, when, after 12 years of no contact, Jun Hae Sung seeks to make contact with Nora on the internet, she replies, 'do you remember me?'....well of course he does because he has been looking for you and you were the best of buddies! The dialogue is woefully lacking in nuance and cross-cultural issues dealt with very little exploration, eg., Nora describing Jun Hae Sung to her husband, as 'masculine' and so 'Korean'.When he visits her in New York, she gazes into his eyes seductively, despite having no intention to pursue a relationship and without any regard to his obvious loneliness, fragility and vulnerability. Despite it being blatantly obvious that he is in love with her, Nora tells her husband that she realises Jun Hae Sung came to New York to see her! Really! Nora's references to 'Inyeon', the Buddhist ? , she wasn't sure :-), concept of how relationships are based on multiple encounters over thousands of lifetimes, fate and providence, attempts to weave a spiritual, deeper theme into a movie which, in my opinion, was distinctly lacking in depth or soulfulness. Go see the underrated and beautifully poignant, 'Empire of Light' for that.As a woman, I have to wonder if this 'triangle love' story would have been as well received if Nora's character was a man? I think the critics might not be as gushing if a man, possessing all the power, acted as recklessly and manipulatively towards two vulnerable women?",
    "99": "Past Lives is the sort of film that's so understatedly emotional it actually really hurts but in a good way. A personal story of connection, fate and what could've been that always makes the best narrative choices resulting in an incredibly rewarding experience.Moon Seung-a and Yim Seung-min instantly create a very genuine bond between their characters which Greta Lee and Teo Yoo carry on beautifully, often at its most palpable when they're just looking. It's particularly impressive that the initial reconnection doesn't feel creepy at all, which is down to its tender nature and the heartfelt performances from Lee and Yoo.Jonathan Magaro literally admits his character would be the villain of any other version of this story and he gives such a strong performance as the complete opposite. There's a natural unease at the scenario he's in but beneath that there's a humanity and warmth to everything he does.Celine Song crafts a masterful debut, the film looks gorgeous and she has a real talent for communicating the characters situation visually, whether that's at a crossroads or simply showing that even when they're together there's still something separating them.",
    "100": "The reviews for this movie are currently very high and I am struggling to see why. The synopsis of this movie is that a couple of kids who had crushes on each other in primary school have their hopes of a longer friendship dashed when the girls parents decide to immigrate to America. The movie then checks in on the two every 12 years after the guy decides to track her down on Facebook.So far so When Harry Met Sally.The question is are these two interesting enough people and is their story worth the time? I would say not really.This is obviously a chick flick, the female character is some high flying writer while the guy is an average Joe. He for some unknown reason seems to be \"in love\" with this woman he hasn't seen for up to 12 years at a time, seemingly based on the friendship they had as kids. And this is why its a womans' movie. They seem to be in love with the idea that some guy will be obsessively in love with them for up to 36 years....just because she is herself. Because men simply wouldn't buy into this story and it's not just because there doesn't seem to be anything remarkable about this girl. She doesn't set the screen on fire and she is actually quite boring, but has really strange ideas about reincarnation and relationships. What else marks this out as a chick flick is the womans husband who apparently doesn't see any issue with his wife spending time alone with a man who has flown halfway around the world to see her. There is a line where he says words to the effect of \"I am not going to stop you from seeing him\", ah the understanding husband of the selfish wife trope! This husband also doesn't think he is good enough for his apparently amazing wife. This is another female rom-com trope, its as if women in these movies are to be \"independent\" from their husbands who simply nod along to anything she demands. Quite frankly its as if its been written by a woman who has never asked a man his opinion on anything.This is a fairly generic romance thats being touted as some kind of high brow movie, it isn't, its just on a so called indie label. To me it looks like this movie ticks many boxes certain sections of the press like so they will over-rate it. Its a female director, its an Asian themed movie, its on A24, there is mysticism and the men are all subordinate to the female character. All currently fashionable tropes for Guardian readers.I wont spoil the ending however I will say no husband is \"that understanding\" lol. This is a female fantasy movie along the lines of other pop Hollywood movies like Pretty Woman or Sliding Doors. Only this time its not in English so you can pretend your very clever for watching a foreign movie.",
    "101": "\"past lives\" is a film that sadly falls short of originality and creative integrity. As a viewer who appreciates unique storytelling and fresh cinematic experiences, I was deeply disappointed to discover that this movie shamelessly copied the entire script from the Indian film \"96.\" From the characters to their romantic interactions, and even the entire setup, \"Copycat Romance\" fails to offer anything new or meaningful.The originality of a film is crucial in captivating and engaging an audience. Unfortunately, \"Copycat Romance\" lacks the innovation and imagination required to stand on its own. It relies heavily on the success and popularity of \"96,\" exploiting the hard work and creativity of the original filmmakers without adding any significant value or artistic interpretation.Rather than introducing fresh perspectives, \"Copycat Romance\" regurgitates the storyline, character arcs, and emotional beats of its Indian counterpart. This blatant lack of effort and creativity leaves the audience feeling cheated and unfulfilled. It is disheartening to witness such a blatant disregard for originality and a missed opportunity to bring something new to the table.Additionally, the film fails to justify its existence as a mere replica. The absence of any unique artistic vision or reinterpretation robs the audience of the possibility of experiencing a fresh take on the themes explored in \"96.\" It becomes evident that \"Copycat Romance\" is merely riding on the coattails of a successful film, hoping to cash in on its popularity instead of crafting a distinctive cinematic experience.In conclusion, \"Copycat Romance\" is an unfortunate waste of a movie. Its decision to shamelessly copy the entire script, including the characters' romantic interactions and the overall setup, showcases a lack of creativity and artistic integrity. As a viewer, I recommend seeking out the original film \"96\" for a genuinely moving and authentic experience, rather than wasting time on this uninspired replica.",
    "102": "I loved the film, it stayed with me for days.People who watch it will either find it to be super boring or will keep thinking about it for days.The cinematography, the dialogues, performance and Score are just beautiful. The silent moments between them are beautiful too.I do not recommend this to everyone, but if you love movies like Before Sunrise trilogy or the Irish movie Once or Eternal Sunshine of a Spotless mind. You will love this one too.But, for me having watched the 2018 Indian film 96 many times I could not stop comparing these two movies. ,\nI mean the subway scene with them holding the pole just staring at one n another.The What ifs. Both the movies are so similar concept wise.",
    "103": "This film tries to be deep with its idea of people knowing or loving each other in past lives but it fails. It didn't build on those ideas in any way. Perhaps they could have shown how these people have known each other in other lives in different ways that tied it up to who they are now but it doesn't.This film literally revolves around two main characters and they are written so poorly. There was only one time in the film that I felt somewhat bad for the guy but other than that this film was unable to be heartbreaking or even heartwarming. How is it possible to have two characters on screen for the entirety of a film and not give the audience something to care about. There were so many awkward scenes and I know some might have been intentional but it did not help in making the romance feel believable.I went into this film expecting it to be emotional but instead it was just a bland love story if I can even call it that. There are other movies that share this same story and do it justice.This film did not allow for the two characters to share a romance on screen before they were separated. It showed two kids playing here and there and then the female migrates. When her family migrates to America the audience should have been heart broken along with the boy but we weren't.The time jumps speed up what should have been emotional moments showing how this man has lived his life missing this woman.Overall, my biggest gripe is that this film rushed its plot and lacked emotion.",
    "104": "Greetings again from the darkness. Circumstances being what they can be, I missed a couple of chances to see this one earlier in the year and have just recently been able to catch up. And such a treat it is. The first feature film from South Korean writer-director Celine Song is certainly one of the best movies of the year ... and with a budget hundreds of millions below some of this year's blockbusters.Korean school kids Na Young (Moon Seung-ah) and Hae Sung (Leem Seung-min) are besties whose close friendship abruptly ends when Na Young emigrates to Canada with her parents. Twelve years pass with no communication between the two. Na Young, now going by Nora, moves to New York City to pursue her lifelong dream of becoming a playwright. Hae Sung remains in Korea, takes a break from his engineering education to serve a stint in the military, before finishing up his studies. On a whim, Nora tracks down Hae Sung's social media account, and it's not long before the two have a Skype call and reminisce about their once strong bond, while also discussing how time has moved on.Greta Lee (\"The Morning Show\") plays adult Nora, while Teo Yoo is the grown Hae Sung. Twelve more years pass as Nora establishes herself as a NYC playwright and marries Arthur (John Magaro), while Hae Sung takes on a job in Korea. When Hae Sung decides to visit Nora in New York, he's clearly hoping to rekindle the childhood bond. In many romantic movies, this reunion would end with the two lovers recapturing each other's hearts, yet director Song ensures these characters stay grounded in reality, even as destiny and fate (described here as In-Yun) play a role.The opening scene in a local bar bookends the film, and along the way, we are taught, \"If you leave something behind, you gain something too.\" There is a terrific pillow talk scene, and in fact, the dialogue throughout remains true to each character. This is a film about adulting, not fantasy, though the latter can have appeal at times. No matter how strong reality is, it never precludes us from wondering \"what if?\" ... even if a sure sign of maturity is making decisions that keep us committed to our cause. This is a terrific film with characters whose story is remarkably relatable to just about any moviegoer.Available on VOD.",
    "105": "Playwright Celine Song's semi-autobiographical tale makes for a thoughtful and affecting feature debut. Like Song herself, the heroine, Nora (Greta Lee), immigrates with her family from Seoul, South Korea to Canada and then later moves to New York City in order to advance her writing career.But, Song isn't only interested in biography and straight drama. Her screenplay is set during three distinct time periods: As a 12 year old at the time of her move. Ten years later when she reconnects with an old schoolgirl crush Hae Sung (Tee Yoo) while also meeting her future husband Arthur (John Magaro). The 'present' is a decade later.The Buddhist notion of Inyeon hangs over the relationships. As Nora explains, Ineyeon very roughly translates as \"Providence\" - the idea that relationships are governed by fate. Nora is connected not only to her mate, Arthur, but also, Hae Sung. It's a fascinating concept that also intersects with the main character's search for identity. A young Korean woman growing up in the west. Hae Sung isn't only an old boyfriend, but, he represents a bond with her roots. What makes PAST LIVES a universal story is that those \"roots\" could also be about coming from a different part of the country or economic class (for example, returning to a rural hometown from a metropolis such as NYC).PAST LIVES coincidentally arrives just months after Davy Chou's moving RETURN TO SEOUL, which is also about a young Korean trying to connect with her past. It's an interesting contrast as Song's movie is much more concerned with the dialogue (unsurprsing, considering her background), while Chou's is more visually lush. Indeed, PAST LIVES' one significant deficit is that some of it comes off as a bit flat. One can't help but think of what a true sylist like an Alain Resnais, Wong Kar-Wai or early Sofia Coppola could have done with the material. Song has a tendency to emphasize melodrama, rather than introspection. .The performances are all quite accomplished (including by the young actors playing Nora and Hae Sung as children). The dialogue is good, if not always quite as expressive as it could have been. The words are smart, if not fully poetic. PAST LIVES may not quite sing, but, fortunately, the talk is meaningful and moving. And, it does dance a bit.",
    "106": "-> Acting, likewise, is very contained, feelings are registered by carefully chosen words and slightly awkward gesticulations, and Song wrings the most innocuous outcome out of an eternal triangle situation, making a great play of the chasteness between Nora and Hae-sung to declare that there is a civilized, rational kind of love existing in this world, where passion and desire can be kept at bay. Both Lee and Yoo act as natural as possible and allow what is left unsaid and undone to speak volumes of what their characters really want to but fail to convey or express. It is a tricky maneuver because it risks debasing the whole affair into a navel-gazing pretense, if audience cannot empathize with the personages. However, courtesy to the two leads's incredible facility, especially Yoo, who radiates in his \"sigma male\" aureole and unfazed comportment, Nora and Hae-sung's inner thoughts, although predictably common or garden, are never lost on audience, plus with Magaro soberly enacting a discomfitted third wheel (Arthur is the husband!) in an awkward \"language barrier\" situation, the film sticks its landing alright.Read my full review on my blog: Cinema Omnivore, please google it, thanks.",
    "107": "I loved this - it felt real and authentic and terribly tragic . It focused on idealism , realism , romanticism, the complex nature of humans and love and life and regret and hope .The acting and writing were superb, the pacing was very well done , casting was fantastic and it was very enjoyable. I loved the fusion of cultures and languages .This movie is relatable - weather it's a romantic relationship , a friendship , a family member , a colleague . It's amazing how we can feel so connected and want that to never fade and for one reason or another it changes - because life changes , circumstances change , people change, this showed that in a very accurate and powerful way . It helps you feel something for those you have \"lost\" but help to acknowledge those relationships were not any less real while they were front and center in your life , while at the same time having hope we can once again , in some way , connect with those we love . Fate isn't about \"the one \" it is about taking what you choose , taking what life gives you and making the most of it - while acknowledging that nothing is simple and nothing is easy - it's only worthwhile .",
    "108": "An early life connection that lingers over more than a 20-year span is at the core of this brilliantly realized drama. A promising female student in Korea finds herself drawn to a boy in her class with whom she routinely competes against for the highest marks. Before anything can come of it, her family emigrates to Canada. The film follows both of them as they go from childhood into early adulthood, choosing vastly different paths but keeping their memory and connection alive along the way.The three principals are splendid in this film. Greta Lee is a joy to watch as the schoolgirl-turned-playwright whose Korean upbringing is revived when she reconnects with her old crush. Teo Yoo is wondrously subtle as the young man who cannot forget the girl he knew so briefly. And John Magaro is wonderfully sympathetic as the American husband who readily sees his wife's childhood memories rekindled.It is intriguing to follow the life story of this Korean woman making her way in a foreign country, though some of the details were kept too short and would have had the potential to be portrayed with a little more detail. Summarized, this is a story about possibilities and fate, especially when the past is visiting the present you can always wonder about the what-ifs.Highly recommended for everyone.",
    "109": "Truly, cannot understand the gushing acclaim this movie has attracted. The main character Nora, is supposedly an ambitious and gifted writer, aspiring to win a Nobel Prize or a Pulitzer, but can't seem to string more than a bland, stunted, superficial sentence together. Her sulky, cold, prepossessed, vain behaviour was grating to watch for nearly 2 hours. It was disturbing watching Nora manipulatively play an emotional cat and mouse game with the two, supposed 'loves of her life'. When she immigrates from Korea to America she cannot even summon a goodbye to her sensitive, devoted, childhood sweetheart, Jung Hae Sung. The script is excruciatingly silly at times, for example, when, after 12 years of no contact, Jun Hae Sung seeks to make contact with Nora on the internet, she replies, 'do you remember me?'....well of course he does because he has been looking for you and you were the best of buddies! The dialogue is woefully lacking in nuance and cross-cultural issues dealt with very little exploration, eg., Nora describing Jun Hae Sung to her husband, as 'masculine' and so 'Korean'.When he visits her in New York, she gazes into his eyes seductively, despite having no intention to pursue a relationship and without any regard to his obvious loneliness, fragility and vulnerability. Despite it being blatantly obvious that he is in love with her, Nora tells her husband that she realises Jun Hae Sung came to New York to see her! Really! Nora's references to 'Inyeon', the Buddhist ? , she wasn't sure :-), concept of how relationships are based on multiple encounters over thousands of lifetimes, fate and providence, attempts to weave a spiritual, deeper theme into a movie which, in my opinion, was distinctly lacking in depth or soulfulness. Go see the underrated and beautifully poignant, 'Empire of Light' for that.As a woman, I have to wonder if this 'triangle love' story would have been as well received if Nora's character was a man? I think the critics might not be as gushing if a man, possessing all the power, acted as recklessly and manipulatively towards two vulnerable women?",
    "110": "Past Lives is the sort of film that's so understatedly emotional it actually really hurts but in a good way. A personal story of connection, fate and what could've been that always makes the best narrative choices resulting in an incredibly rewarding experience.Moon Seung-a and Yim Seung-min instantly create a very genuine bond between their characters which Greta Lee and Teo Yoo carry on beautifully, often at its most palpable when they're just looking. It's particularly impressive that the initial reconnection doesn't feel creepy at all, which is down to its tender nature and the heartfelt performances from Lee and Yoo.Jonathan Magaro literally admits his character would be the villain of any other version of this story and he gives such a strong performance as the complete opposite. There's a natural unease at the scenario he's in but beneath that there's a humanity and warmth to everything he does.Celine Song crafts a masterful debut, the film looks gorgeous and she has a real talent for communicating the characters situation visually, whether that's at a crossroads or simply showing that even when they're together there's still something separating them.",
    "111": "The reviews for this movie are currently very high and I am struggling to see why. The synopsis of this movie is that a couple of kids who had crushes on each other in primary school have their hopes of a longer friendship dashed when the girls parents decide to immigrate to America. The movie then checks in on the two every 12 years after the guy decides to track her down on Facebook.So far so When Harry Met Sally.The question is are these two interesting enough people and is their story worth the time? I would say not really.This is obviously a chick flick, the female character is some high flying writer while the guy is an average Joe. He for some unknown reason seems to be \"in love\" with this woman he hasn't seen for up to 12 years at a time, seemingly based on the friendship they had as kids. And this is why its a womans' movie. They seem to be in love with the idea that some guy will be obsessively in love with them for up to 36 years....just because she is herself. Because men simply wouldn't buy into this story and it's not just because there doesn't seem to be anything remarkable about this girl. She doesn't set the screen on fire and she is actually quite boring, but has really strange ideas about reincarnation and relationships. What else marks this out as a chick flick is the womans husband who apparently doesn't see any issue with his wife spending time alone with a man who has flown halfway around the world to see her. There is a line where he says words to the effect of \"I am not going to stop you from seeing him\", ah the understanding husband of the selfish wife trope! This husband also doesn't think he is good enough for his apparently amazing wife. This is another female rom-com trope, its as if women in these movies are to be \"independent\" from their husbands who simply nod along to anything she demands. Quite frankly its as if its been written by a woman who has never asked a man his opinion on anything.This is a fairly generic romance thats being touted as some kind of high brow movie, it isn't, its just on a so called indie label. To me it looks like this movie ticks many boxes certain sections of the press like so they will over-rate it. Its a female director, its an Asian themed movie, its on A24, there is mysticism and the men are all subordinate to the female character. All currently fashionable tropes for Guardian readers.I wont spoil the ending however I will say no husband is \"that understanding\" lol. This is a female fantasy movie along the lines of other pop Hollywood movies like Pretty Woman or Sliding Doors. Only this time its not in English so you can pretend your very clever for watching a foreign movie.",
    "112": "\"past lives\" is a film that sadly falls short of originality and creative integrity. As a viewer who appreciates unique storytelling and fresh cinematic experiences, I was deeply disappointed to discover that this movie shamelessly copied the entire script from the Indian film \"96.\" From the characters to their romantic interactions, and even the entire setup, \"Copycat Romance\" fails to offer anything new or meaningful.The originality of a film is crucial in captivating and engaging an audience. Unfortunately, \"Copycat Romance\" lacks the innovation and imagination required to stand on its own. It relies heavily on the success and popularity of \"96,\" exploiting the hard work and creativity of the original filmmakers without adding any significant value or artistic interpretation.Rather than introducing fresh perspectives, \"Copycat Romance\" regurgitates the storyline, character arcs, and emotional beats of its Indian counterpart. This blatant lack of effort and creativity leaves the audience feeling cheated and unfulfilled. It is disheartening to witness such a blatant disregard for originality and a missed opportunity to bring something new to the table.Additionally, the film fails to justify its existence as a mere replica. The absence of any unique artistic vision or reinterpretation robs the audience of the possibility of experiencing a fresh take on the themes explored in \"96.\" It becomes evident that \"Copycat Romance\" is merely riding on the coattails of a successful film, hoping to cash in on its popularity instead of crafting a distinctive cinematic experience.In conclusion, \"Copycat Romance\" is an unfortunate waste of a movie. Its decision to shamelessly copy the entire script, including the characters' romantic interactions and the overall setup, showcases a lack of creativity and artistic integrity. As a viewer, I recommend seeking out the original film \"96\" for a genuinely moving and authentic experience, rather than wasting time on this uninspired replica.",
    "113": "I loved the film, it stayed with me for days.People who watch it will either find it to be super boring or will keep thinking about it for days.The cinematography, the dialogues, performance and Score are just beautiful. The silent moments between them are beautiful too.I do not recommend this to everyone, but if you love movies like Before Sunrise trilogy or the Irish movie Once or Eternal Sunshine of a Spotless mind. You will love this one too.But, for me having watched the 2018 Indian film 96 many times I could not stop comparing these two movies. ,\nI mean the subway scene with them holding the pole just staring at one n another.The What ifs. Both the movies are so similar concept wise.",
    "114": "This film tries to be deep with its idea of people knowing or loving each other in past lives but it fails. It didn't build on those ideas in any way. Perhaps they could have shown how these people have known each other in other lives in different ways that tied it up to who they are now but it doesn't.This film literally revolves around two main characters and they are written so poorly. There was only one time in the film that I felt somewhat bad for the guy but other than that this film was unable to be heartbreaking or even heartwarming. How is it possible to have two characters on screen for the entirety of a film and not give the audience something to care about. There were so many awkward scenes and I know some might have been intentional but it did not help in making the romance feel believable.I went into this film expecting it to be emotional but instead it was just a bland love story if I can even call it that. There are other movies that share this same story and do it justice.This film did not allow for the two characters to share a romance on screen before they were separated. It showed two kids playing here and there and then the female migrates. When her family migrates to America the audience should have been heart broken along with the boy but we weren't.The time jumps speed up what should have been emotional moments showing how this man has lived his life missing this woman.Overall, my biggest gripe is that this film rushed its plot and lacked emotion.",
    "115": "Greetings again from the darkness. Circumstances being what they can be, I missed a couple of chances to see this one earlier in the year and have just recently been able to catch up. And such a treat it is. The first feature film from South Korean writer-director Celine Song is certainly one of the best movies of the year ... and with a budget hundreds of millions below some of this year's blockbusters.Korean school kids Na Young (Moon Seung-ah) and Hae Sung (Leem Seung-min) are besties whose close friendship abruptly ends when Na Young emigrates to Canada with her parents. Twelve years pass with no communication between the two. Na Young, now going by Nora, moves to New York City to pursue her lifelong dream of becoming a playwright. Hae Sung remains in Korea, takes a break from his engineering education to serve a stint in the military, before finishing up his studies. On a whim, Nora tracks down Hae Sung's social media account, and it's not long before the two have a Skype call and reminisce about their once strong bond, while also discussing how time has moved on.Greta Lee (\"The Morning Show\") plays adult Nora, while Teo Yoo is the grown Hae Sung. Twelve more years pass as Nora establishes herself as a NYC playwright and marries Arthur (John Magaro), while Hae Sung takes on a job in Korea. When Hae Sung decides to visit Nora in New York, he's clearly hoping to rekindle the childhood bond. In many romantic movies, this reunion would end with the two lovers recapturing each other's hearts, yet director Song ensures these characters stay grounded in reality, even as destiny and fate (described here as In-Yun) play a role.The opening scene in a local bar bookends the film, and along the way, we are taught, \"If you leave something behind, you gain something too.\" There is a terrific pillow talk scene, and in fact, the dialogue throughout remains true to each character. This is a film about adulting, not fantasy, though the latter can have appeal at times. No matter how strong reality is, it never precludes us from wondering \"what if?\" ... even if a sure sign of maturity is making decisions that keep us committed to our cause. This is a terrific film with characters whose story is remarkably relatable to just about any moviegoer.Available on VOD.",
    "116": "Playwright Celine Song's semi-autobiographical tale makes for a thoughtful and affecting feature debut. Like Song herself, the heroine, Nora (Greta Lee), immigrates with her family from Seoul, South Korea to Canada and then later moves to New York City in order to advance her writing career.But, Song isn't only interested in biography and straight drama. Her screenplay is set during three distinct time periods: As a 12 year old at the time of her move. Ten years later when she reconnects with an old schoolgirl crush Hae Sung (Tee Yoo) while also meeting her future husband Arthur (John Magaro). The 'present' is a decade later.The Buddhist notion of Inyeon hangs over the relationships. As Nora explains, Ineyeon very roughly translates as \"Providence\" - the idea that relationships are governed by fate. Nora is connected not only to her mate, Arthur, but also, Hae Sung. It's a fascinating concept that also intersects with the main character's search for identity. A young Korean woman growing up in the west. Hae Sung isn't only an old boyfriend, but, he represents a bond with her roots. What makes PAST LIVES a universal story is that those \"roots\" could also be about coming from a different part of the country or economic class (for example, returning to a rural hometown from a metropolis such as NYC).PAST LIVES coincidentally arrives just months after Davy Chou's moving RETURN TO SEOUL, which is also about a young Korean trying to connect with her past. It's an interesting contrast as Song's movie is much more concerned with the dialogue (unsurprsing, considering her background), while Chou's is more visually lush. Indeed, PAST LIVES' one significant deficit is that some of it comes off as a bit flat. One can't help but think of what a true sylist like an Alain Resnais, Wong Kar-Wai or early Sofia Coppola could have done with the material. Song has a tendency to emphasize melodrama, rather than introspection. .The performances are all quite accomplished (including by the young actors playing Nora and Hae Sung as children). The dialogue is good, if not always quite as expressive as it could have been. The words are smart, if not fully poetic. PAST LIVES may not quite sing, but, fortunately, the talk is meaningful and moving. And, it does dance a bit.",
    "117": "-> Acting, likewise, is very contained, feelings are registered by carefully chosen words and slightly awkward gesticulations, and Song wrings the most innocuous outcome out of an eternal triangle situation, making a great play of the chasteness between Nora and Hae-sung to declare that there is a civilized, rational kind of love existing in this world, where passion and desire can be kept at bay. Both Lee and Yoo act as natural as possible and allow what is left unsaid and undone to speak volumes of what their characters really want to but fail to convey or express. It is a tricky maneuver because it risks debasing the whole affair into a navel-gazing pretense, if audience cannot empathize with the personages. However, courtesy to the two leads's incredible facility, especially Yoo, who radiates in his \"sigma male\" aureole and unfazed comportment, Nora and Hae-sung's inner thoughts, although predictably common or garden, are never lost on audience, plus with Magaro soberly enacting a discomfitted third wheel (Arthur is the husband!) in an awkward \"language barrier\" situation, the film sticks its landing alright.Read my full review on my blog: Cinema Omnivore, please google it, thanks.",
    "118": "I loved this - it felt real and authentic and terribly tragic . It focused on idealism , realism , romanticism, the complex nature of humans and love and life and regret and hope .The acting and writing were superb, the pacing was very well done , casting was fantastic and it was very enjoyable. I loved the fusion of cultures and languages .This movie is relatable - weather it's a romantic relationship , a friendship , a family member , a colleague . It's amazing how we can feel so connected and want that to never fade and for one reason or another it changes - because life changes , circumstances change , people change, this showed that in a very accurate and powerful way . It helps you feel something for those you have \"lost\" but help to acknowledge those relationships were not any less real while they were front and center in your life , while at the same time having hope we can once again , in some way , connect with those we love . Fate isn't about \"the one \" it is about taking what you choose , taking what life gives you and making the most of it - while acknowledging that nothing is simple and nothing is easy - it's only worthwhile .",
    "119": "No pun intended - I can't speak for others, but I have or rather had a similar situation. And like the movie, it was the girl that left - though in my case she only left to Greece (and I stayed in Germany). What could have been? It really is crazy thinking about it - losing your best friend, but maybe also the one person you may have ended up with? It can really mess with your mind, if you think too much about it.Of course those are the similarities. Since the distance is closer, I reckon I could have been more aggressive in contacting her. She lived her life, married, got kids, divorced ... not sure what she is up to now. I have given up a long time ago. I don't even know her - and she does not know me. The movie is different than ... my story. The guy is really out there looking for her - and she seems to be open to let him back into her life.Btw even without having read about the story, I was able to detect and guess what the three people were up to - or rather what relationships they had amongst each other. It is a guessing game some people have going on- we never meet them. Won't tell you if they guess it right - the movie has you guessing a lot. And it is quite straining. Not so much because of the pacing - that is slow too, but because of the feelings ... of the things not spoken (out), but also the things that are said aloud.Life is what you make it - life is choices ... sometimes it is about second chances ... sometimes it is about letting things go ... sometimes it is about the things that others expect from us ... even without them knowing they do expect them ... let it not be too late! Act now - no pun intended.",
    "120": "Past LivesWhen critiquing a foreign movie it must be undertaken with two caveats in mind, when you visit the mummies in the British Museum it is full of people interested in Egypt and so it is with Korean movies, secondly subtitles have the ability to make the dialogue seem more profound than it actually is, so beware.It was so slow, practically glacial, for example when Nora and Jung reconnected after 12 years there conversation was so full of excruciating banalities, I have more meaningful conversations with the cat.After Nora insists on a break, from what I'm not sure, because she wants to commit to her life in America, here we have a series of scenes with her looking around wandering aimlessly, the equivalent of watching goldfish.Another 12 years later Nora and Jung reconnect, it was all so overly contrived, and so the whole circus went on and on. This movie lacked passion, it was a damp firework from start to finish, the acting was so bad, everyone seemed fed up and this was meant to be meaningful.I'm giving this 3 outta 10, I enjoyed seeing New York.",
    "121": "After years abroad, a Korean immigrant relationship with her former friend is reignited by a Facebook comment. She develops a certain melancholia that culminates with him going to New York and see what's up. But the deal is, she is already married and is happy with where she is.I think it is a fine FIRST film. Let's start with that.In a way, it reminds me of another overly hyped first film, Cha Cha Real Smooth. Both of the film was made with pure intentions and able vision but both film failing to reach its potential.I think the first problem I had with the film is that it felt like it wanted to make romance film but explicitly tried to go to a more neutral dramatic route. Which made a lot of the action in the film just do not make sense: The kid wanting to leave Korea with almost with no regret or any kind of emotion, and the overall reaction in all front during the NYC Expedition. I think, in a way, I have family who went and tried it abroad (they succeeded but to mix result). IT NEVER FELT like this. Nor does the reaction of the American husband when the weirdly aromantic relationship between the two Korean leads comes full bloom. ITS just too conflict averse AND unnervingly unrealistic.In addition, I am personally unimpressed of the direction. This film lends a lot of down moments AND I think Song was not yet particularly apt in making those small silent moments to feel more. In this film, her style really lends in a long line of female art filmmakers - Very visual and very less is more in terms of dialogue. That style did not work in this film. It felt too surface level but clearly those are high expectation for someone's first film. Which in relation, I found acting to be fine BUT can definitely been much more. None of the leads are particularly noteworthy to be honest.ODD OBSERVATION, I do think the Korean in this film felt very janky. Not a native speaker, but I definitely had watched a whole lot of Korean content - the way they spook it felt like line reading sometimes. Any Koreans that can confirm that? Lol.Overall, this is a noble first film BUT not the masterpiece advertised.",
    "122": "There's a phenomenon that i've come to notice in recent years. Critics and highbrow movie-goers tend to overhype foreign language films.Mundane artsy high-concept indie films that've been rehashed for God knows how long in Hollywood, most of them often critiqued for being pretentious are now met with overwhelming critical acclaim, and the only observable catalyst is that the characters speak a foreign language.There are certainly positives in Past Lives. The Cinematography and production design is the obvious standout. Long lingering shots that are sometimes overused, captures certain scenes perfectly.The Plot and direction however is lackluster. Perhaps if Past lives was a 40 minutes Short Film, it would've been perfect, but it wasn't.It was long, full of irrelevant montages, severely underdeveloped lead characters and a surprising competent 3rd act.",
    "123": "In a flood of commercial films, this one is an honorable exception. An exception to films where we don't have to think so much, reflect. Just be entertained. A day later we hardly remember what we have seen. Not this movie. I went with a friend, he didn't like the movie. He found it boring, the dialogue stiff and the actors stiff and lacking in expression.According to many critics, this is precisely the point of the director Celine song. Her tight direction, her failure to play on a large emotional register to move us as viewers. Instead, it is left to us to interpret what we see. Live into this relationship that has so many incredible layers. After watching this film I thought back to films I have seen from Ingmar Bergman. When I sit and watch I think; what is really going on here? What is the message. Only several days later I still think about this couple in this movie. Human ties that we all have, past friends and acquaintances that shape who we are, and to which we, whether we like it or not, have a connection. And that has shaped us as people.See the film if you also want something with substance, something that can provide insight and learning. It's very good, in its own subtle way.",
    "124": "I feel like I'm being pranked. One of the dullest movies I've ever seen is being peddled as great. It's about a writer but ironically could have been written by a 9 year old. Actually, I have no doubt the same story is, hourly, in young girls rooms, across the world, in crayon.Why there are pauses between every vocal sentence? Completely unrealistic, dull, storytelling that tries to convince the audience if they don't like it it's because their not intelligent enough to truly understand romance.The soundtrack feels like it is being played at the wrong speed. My biggest regret, other than going in the first place, is that I had a nap before watching which prevented me from getting to sleep during screening.I'm insulted that this movie was made.",
    "125": "I came into this with totally wrong expectations. I just want to set that straight. So a part of my frustration was due to a feeling of disappointment. If you are going to see this movie- watch your expectations.Well I saw this movie in theaters which was great. 4 seats down from me this very large man was really loudly vacuuming down an xtra large popcorn. For 20 minutes straight he was guzzling and crunching non stop. It was really frustrating, but honestly less frustrating then this movie.This film is like a painting. It doesn't tell you what to think or feel, it doesn't give you any clues for as to who you are supposed to root for or what you are supposed to *want* happen. It simply is. Which is deeply real and emotional... and frustrating (because life is frustrating) I left this movie really unsatisfied with its open endedness, it took a 45 minute long deconstruction with my mother to create some resolution and meaning.Be prepared to reconcile a tuff hard to swallow story, prepare to construct meaning from a 2 hour long display of tumultuous relationship navigation.This film was unpleasant and gave me anxiety, but after 45 minutes of talking i realized it was actually something important and beautiful.I didn't realize what i was signing up for when i went into that movie theater...",
    "126": "Rating: 8.7\nOverall, a movie that uses subtly, writing, and direction very well to show a profound story between two lovers from distant worlds, but can only go so far given its long exposition and short runtime.Very Good Direction (Does a great job at building the tension in the scenes between the two leads as she helps convey the lost love between the two (especially during the long non-verbal moments); the English scenes were not as strong though cause they felt very bland with some lack of direction; uses subtly very well to move the story forward (this also adds to the sexual tension between the two characters)), Good Acting (Very Good from Greta Lee (During the Korean scenes, she really steals the scene and displays a wide range of emotions (with the best being during the romantic and loss scenes and she explores the relationship further); her performance does take a hit in the English scenes as she does not really have that much chemistry with her husband and her performance comes off a bit more bland), Good from Teo Yoo (More of a reserved character so he could only show off so much, but does a good job in working off of Lee and showing the relationship he has build with her character), Pretty Bad to Decent from John Magaro (Has a bland relationship with Lee's character as it felt like there is just a lot of awkwardness between the two as they cannot play off of each other (it can be argued this was intentional but I don't really see this)), Decent from the rest of the cast), Good Story (Pretty Simple Story overall as there are only a few plot points but the plot points they have are very good and help drive the story forward (the exposition is a bit long though so that does make the story feel shorter than it is)), Very Good Screenplay (The dialogue was incredibly profound and hard hitting as it really was a the vehicle in the conversations between the leads in showing their relationship (this is especially shown in bar scene and the very last scene); the symbolism was a bit surface level; the foreshadowing was a present as it shows inevitable truths for not only the relationship but most relationships), Good to Very Good Score (Used very well throughout the movie to help establish tone and tension), Very Good Cinematography (Felt very professional and high-budget despite it being an indie movie; helped with building scenes and tension between the characters), Decent Sound, Good to Very Good Editing, Plot Structure was bit a of an issue with the movie as the movie spends a bit too much time on the exposition (40 minutes) that the rising action and conflict become shorter (would have liked to have seen the exposition cut 15 minutes and add 10-15 minutes to make 2-3 more scenes with the two as adults), Pacing was consistent throughout (the pace was fine it is just there is not a lot of plot to help maintain the pace), Climax was very profound and the most emotional part of the movie (really helps bring truths to reality and show the importance of the movie), Tone was the best part of the movie as this was established very well throughout through the use of dialogue/subtly/pauses (helping make this movie a memorable Romantic Drama)",
    "127": "Even when walking back home after the movie I was crying and I can't tell if they were happy tears or sad tears. All I know is that I was touched by the beautiful story of Nora and Jung Hae Sung.The script is filled with mood, emotions and great dialogue and just left me speechless. It really proves that a good story doesn't need all the unforeseeable plot twists and turns that we are fed with nowadays. A simple story, well thought out and told that will make a grown man sob like a little kid (or like Nora when she was young).To top it off the visual storytelling is just on point, as the story is told by the camera, not by the dialogue. I was so magnetic that I felt like I was falling in love and being broken up with over the course of less than two hours.Honestly, I don't know how to describe it without using the word beautiful, it's like the word was made for this film.",
    "128": "My reviews are deeply personal, and perhaps this film exemplifies best how wildly personal opinions can differ. People have called this film a quietly powerful masterpiece, but for me, I felt only the first of these epithets. This film felt languidly slow to me, with too many moments of silence interspersing. I understand the use of silence may have powerful effects, but if it were used so frequently, like in this instance, this silence only gets infuriating. I am sure that to the filmmakers, silence was used to impart a mood of introspection and meditative quality. But to a mainstream audience, this silence can only be construed as elitist and boring. I find the story, especially in its buildup, to also be painfully slow. Indeed the best parts of the film, the most powerful, emotionally resonant and absorbing bits were near the end. The film also plays with ideas of fate and destiny, but only in the way a film like Sleepless In Seattle does. It is never fully fleshed out, and dare I say at times, this subplot to do with fate seemed tacked on, as if such an inclusion would guarantee enhanced emotional resonance with the audience. Which it really dosent. What cannot be faulted however are the performances and the cinematography. Every shot in this film is interesting- either inspiring, dull, or an expertly mixed blend of both which communicates the prevailing mood and tension well. In how it's shot, it is also a beautifully filmed love letter to the city of New York. The two lead actors are also fantastic. Their expressions have the right mix of longing and happiness- they may seem happy in their scenes together, but there is always a palpable feeling of regret beautifully communicated by their expressions and mannerisms. Overall, I think Past Lives is a well crafted attempt at capturing the tragedy of its situation, but it suffers from deficiencies in pacing that leaves audiences unengaged.",
    "129": "It's clear I am in a minority, but I didn't enjoy this very much.As a plus, the basic themes of chance influences on relationships, cultural identity, and changing character over time are all of interest to me, and I did find myself reflecting on them afterwards.I also liked to see daily life in Korea - films like this help to overcome many stereotypes that Westerners have.The principal problem was that I didn't warm to the character of Nora - she seemed ambitious, self-centred and unempathic. Having said that, ambition can be a good thing, and it was clearly something that appealed to Hae Sung and set her apart from others in Korea. But, much as I like strong female characters, I did not find Nora likeable, which made it hard to get involved in the plot, or to be sad about the ending.There was no chemistry between her and her husband - perhaps that was intentional, given the plot, but it seemed odd that he was so devoted to her.I found the dialogue a bit tedious.And some of the scenes were odd: e.g. When she turns up at a writing retreat and there's nobody there - not even a housekeeper, so she walks in and settles in to a room. Huh? And then when Arthur turns up, her first sentence, after introducing herself is to say \"You got the worst room\". I mean, who says something like that to a total stranger?It also seemed hard to believe that two people who were writers could earn enough to live in New York (even in a less fancy bit of New York) - wouldn't they have to have 2nd jobs to survive, especially when starting out? Things did seem to have rather fallen into Nora's lap.Finally, and as an indication of how weird *i* am, I could barely focus on the conversation in the fairground scene (? Coney Island) because there was a carousel in the background and the horses went round and round but did not go up and down. For a Brit this is very peculiar and against the natural order of things.",
    "130": "No pun intended - I can't speak for others, but I have or rather had a similar situation. And like the movie, it was the girl that left - though in my case she only left to Greece (and I stayed in Germany). What could have been? It really is crazy thinking about it - losing your best friend, but maybe also the one person you may have ended up with? It can really mess with your mind, if you think too much about it.Of course those are the similarities. Since the distance is closer, I reckon I could have been more aggressive in contacting her. She lived her life, married, got kids, divorced ... not sure what she is up to now. I have given up a long time ago. I don't even know her - and she does not know me. The movie is different than ... my story. The guy is really out there looking for her - and she seems to be open to let him back into her life.Btw even without having read about the story, I was able to detect and guess what the three people were up to - or rather what relationships they had amongst each other. It is a guessing game some people have going on- we never meet them. Won't tell you if they guess it right - the movie has you guessing a lot. And it is quite straining. Not so much because of the pacing - that is slow too, but because of the feelings ... of the things not spoken (out), but also the things that are said aloud.Life is what you make it - life is choices ... sometimes it is about second chances ... sometimes it is about letting things go ... sometimes it is about the things that others expect from us ... even without them knowing they do expect them ... let it not be too late! Act now - no pun intended.",
    "131": "Past LivesWhen critiquing a foreign movie it must be undertaken with two caveats in mind, when you visit the mummies in the British Museum it is full of people interested in Egypt and so it is with Korean movies, secondly subtitles have the ability to make the dialogue seem more profound than it actually is, so beware.It was so slow, practically glacial, for example when Nora and Jung reconnected after 12 years there conversation was so full of excruciating banalities, I have more meaningful conversations with the cat.After Nora insists on a break, from what I'm not sure, because she wants to commit to her life in America, here we have a series of scenes with her looking around wandering aimlessly, the equivalent of watching goldfish.Another 12 years later Nora and Jung reconnect, it was all so overly contrived, and so the whole circus went on and on. This movie lacked passion, it was a damp firework from start to finish, the acting was so bad, everyone seemed fed up and this was meant to be meaningful.I'm giving this 3 outta 10, I enjoyed seeing New York.",
    "132": "After years abroad, a Korean immigrant relationship with her former friend is reignited by a Facebook comment. She develops a certain melancholia that culminates with him going to New York and see what's up. But the deal is, she is already married and is happy with where she is.I think it is a fine FIRST film. Let's start with that.In a way, it reminds me of another overly hyped first film, Cha Cha Real Smooth. Both of the film was made with pure intentions and able vision but both film failing to reach its potential.I think the first problem I had with the film is that it felt like it wanted to make romance film but explicitly tried to go to a more neutral dramatic route. Which made a lot of the action in the film just do not make sense: The kid wanting to leave Korea with almost with no regret or any kind of emotion, and the overall reaction in all front during the NYC Expedition. I think, in a way, I have family who went and tried it abroad (they succeeded but to mix result). IT NEVER FELT like this. Nor does the reaction of the American husband when the weirdly aromantic relationship between the two Korean leads comes full bloom. ITS just too conflict averse AND unnervingly unrealistic.In addition, I am personally unimpressed of the direction. This film lends a lot of down moments AND I think Song was not yet particularly apt in making those small silent moments to feel more. In this film, her style really lends in a long line of female art filmmakers - Very visual and very less is more in terms of dialogue. That style did not work in this film. It felt too surface level but clearly those are high expectation for someone's first film. Which in relation, I found acting to be fine BUT can definitely been much more. None of the leads are particularly noteworthy to be honest.ODD OBSERVATION, I do think the Korean in this film felt very janky. Not a native speaker, but I definitely had watched a whole lot of Korean content - the way they spook it felt like line reading sometimes. Any Koreans that can confirm that? Lol.Overall, this is a noble first film BUT not the masterpiece advertised.",
    "133": "There's a phenomenon that i've come to notice in recent years. Critics and highbrow movie-goers tend to overhype foreign language films.Mundane artsy high-concept indie films that've been rehashed for God knows how long in Hollywood, most of them often critiqued for being pretentious are now met with overwhelming critical acclaim, and the only observable catalyst is that the characters speak a foreign language.There are certainly positives in Past Lives. The Cinematography and production design is the obvious standout. Long lingering shots that are sometimes overused, captures certain scenes perfectly.The Plot and direction however is lackluster. Perhaps if Past lives was a 40 minutes Short Film, it would've been perfect, but it wasn't.It was long, full of irrelevant montages, severely underdeveloped lead characters and a surprising competent 3rd act.",
    "134": "In a flood of commercial films, this one is an honorable exception. An exception to films where we don't have to think so much, reflect. Just be entertained. A day later we hardly remember what we have seen. Not this movie. I went with a friend, he didn't like the movie. He found it boring, the dialogue stiff and the actors stiff and lacking in expression.According to many critics, this is precisely the point of the director Celine song. Her tight direction, her failure to play on a large emotional register to move us as viewers. Instead, it is left to us to interpret what we see. Live into this relationship that has so many incredible layers. After watching this film I thought back to films I have seen from Ingmar Bergman. When I sit and watch I think; what is really going on here? What is the message. Only several days later I still think about this couple in this movie. Human ties that we all have, past friends and acquaintances that shape who we are, and to which we, whether we like it or not, have a connection. And that has shaped us as people.See the film if you also want something with substance, something that can provide insight and learning. It's very good, in its own subtle way.",
    "135": "I feel like I'm being pranked. One of the dullest movies I've ever seen is being peddled as great. It's about a writer but ironically could have been written by a 9 year old. Actually, I have no doubt the same story is, hourly, in young girls rooms, across the world, in crayon.Why there are pauses between every vocal sentence? Completely unrealistic, dull, storytelling that tries to convince the audience if they don't like it it's because their not intelligent enough to truly understand romance.The soundtrack feels like it is being played at the wrong speed. My biggest regret, other than going in the first place, is that I had a nap before watching which prevented me from getting to sleep during screening.I'm insulted that this movie was made.",
    "136": "I came into this with totally wrong expectations. I just want to set that straight. So a part of my frustration was due to a feeling of disappointment. If you are going to see this movie- watch your expectations.Well I saw this movie in theaters which was great. 4 seats down from me this very large man was really loudly vacuuming down an xtra large popcorn. For 20 minutes straight he was guzzling and crunching non stop. It was really frustrating, but honestly less frustrating then this movie.This film is like a painting. It doesn't tell you what to think or feel, it doesn't give you any clues for as to who you are supposed to root for or what you are supposed to *want* happen. It simply is. Which is deeply real and emotional... and frustrating (because life is frustrating) I left this movie really unsatisfied with its open endedness, it took a 45 minute long deconstruction with my mother to create some resolution and meaning.Be prepared to reconcile a tuff hard to swallow story, prepare to construct meaning from a 2 hour long display of tumultuous relationship navigation.This film was unpleasant and gave me anxiety, but after 45 minutes of talking i realized it was actually something important and beautiful.I didn't realize what i was signing up for when i went into that movie theater...",
    "137": "Rating: 8.7\nOverall, a movie that uses subtly, writing, and direction very well to show a profound story between two lovers from distant worlds, but can only go so far given its long exposition and short runtime.Very Good Direction (Does a great job at building the tension in the scenes between the two leads as she helps convey the lost love between the two (especially during the long non-verbal moments); the English scenes were not as strong though cause they felt very bland with some lack of direction; uses subtly very well to move the story forward (this also adds to the sexual tension between the two characters)), Good Acting (Very Good from Greta Lee (During the Korean scenes, she really steals the scene and displays a wide range of emotions (with the best being during the romantic and loss scenes and she explores the relationship further); her performance does take a hit in the English scenes as she does not really have that much chemistry with her husband and her performance comes off a bit more bland), Good from Teo Yoo (More of a reserved character so he could only show off so much, but does a good job in working off of Lee and showing the relationship he has build with her character), Pretty Bad to Decent from John Magaro (Has a bland relationship with Lee's character as it felt like there is just a lot of awkwardness between the two as they cannot play off of each other (it can be argued this was intentional but I don't really see this)), Decent from the rest of the cast), Good Story (Pretty Simple Story overall as there are only a few plot points but the plot points they have are very good and help drive the story forward (the exposition is a bit long though so that does make the story feel shorter than it is)), Very Good Screenplay (The dialogue was incredibly profound and hard hitting as it really was a the vehicle in the conversations between the leads in showing their relationship (this is especially shown in bar scene and the very last scene); the symbolism was a bit surface level; the foreshadowing was a present as it shows inevitable truths for not only the relationship but most relationships), Good to Very Good Score (Used very well throughout the movie to help establish tone and tension), Very Good Cinematography (Felt very professional and high-budget despite it being an indie movie; helped with building scenes and tension between the characters), Decent Sound, Good to Very Good Editing, Plot Structure was bit a of an issue with the movie as the movie spends a bit too much time on the exposition (40 minutes) that the rising action and conflict become shorter (would have liked to have seen the exposition cut 15 minutes and add 10-15 minutes to make 2-3 more scenes with the two as adults), Pacing was consistent throughout (the pace was fine it is just there is not a lot of plot to help maintain the pace), Climax was very profound and the most emotional part of the movie (really helps bring truths to reality and show the importance of the movie), Tone was the best part of the movie as this was established very well throughout through the use of dialogue/subtly/pauses (helping make this movie a memorable Romantic Drama)",
    "138": "Even when walking back home after the movie I was crying and I can't tell if they were happy tears or sad tears. All I know is that I was touched by the beautiful story of Nora and Jung Hae Sung.The script is filled with mood, emotions and great dialogue and just left me speechless. It really proves that a good story doesn't need all the unforeseeable plot twists and turns that we are fed with nowadays. A simple story, well thought out and told that will make a grown man sob like a little kid (or like Nora when she was young).To top it off the visual storytelling is just on point, as the story is told by the camera, not by the dialogue. I was so magnetic that I felt like I was falling in love and being broken up with over the course of less than two hours.Honestly, I don't know how to describe it without using the word beautiful, it's like the word was made for this film.",
    "139": "My reviews are deeply personal, and perhaps this film exemplifies best how wildly personal opinions can differ. People have called this film a quietly powerful masterpiece, but for me, I felt only the first of these epithets. This film felt languidly slow to me, with too many moments of silence interspersing. I understand the use of silence may have powerful effects, but if it were used so frequently, like in this instance, this silence only gets infuriating. I am sure that to the filmmakers, silence was used to impart a mood of introspection and meditative quality. But to a mainstream audience, this silence can only be construed as elitist and boring. I find the story, especially in its buildup, to also be painfully slow. Indeed the best parts of the film, the most powerful, emotionally resonant and absorbing bits were near the end. The film also plays with ideas of fate and destiny, but only in the way a film like Sleepless In Seattle does. It is never fully fleshed out, and dare I say at times, this subplot to do with fate seemed tacked on, as if such an inclusion would guarantee enhanced emotional resonance with the audience. Which it really dosent. What cannot be faulted however are the performances and the cinematography. Every shot in this film is interesting- either inspiring, dull, or an expertly mixed blend of both which communicates the prevailing mood and tension well. In how it's shot, it is also a beautifully filmed love letter to the city of New York. The two lead actors are also fantastic. Their expressions have the right mix of longing and happiness- they may seem happy in their scenes together, but there is always a palpable feeling of regret beautifully communicated by their expressions and mannerisms. Overall, I think Past Lives is a well crafted attempt at capturing the tragedy of its situation, but it suffers from deficiencies in pacing that leaves audiences unengaged.",
    "140": "It's clear I am in a minority, but I didn't enjoy this very much.As a plus, the basic themes of chance influences on relationships, cultural identity, and changing character over time are all of interest to me, and I did find myself reflecting on them afterwards.I also liked to see daily life in Korea - films like this help to overcome many stereotypes that Westerners have.The principal problem was that I didn't warm to the character of Nora - she seemed ambitious, self-centred and unempathic. Having said that, ambition can be a good thing, and it was clearly something that appealed to Hae Sung and set her apart from others in Korea. But, much as I like strong female characters, I did not find Nora likeable, which made it hard to get involved in the plot, or to be sad about the ending.There was no chemistry between her and her husband - perhaps that was intentional, given the plot, but it seemed odd that he was so devoted to her.I found the dialogue a bit tedious.And some of the scenes were odd: e.g. When she turns up at a writing retreat and there's nobody there - not even a housekeeper, so she walks in and settles in to a room. Huh? And then when Arthur turns up, her first sentence, after introducing herself is to say \"You got the worst room\". I mean, who says something like that to a total stranger?It also seemed hard to believe that two people who were writers could earn enough to live in New York (even in a less fancy bit of New York) - wouldn't they have to have 2nd jobs to survive, especially when starting out? Things did seem to have rather fallen into Nora's lap.Finally, and as an indication of how weird *i* am, I could barely focus on the conversation in the fairground scene (? Coney Island) because there was a carousel in the background and the horses went round and round but did not go up and down. For a Brit this is very peculiar and against the natural order of things.",
    "141": "Past LivesThis movie follows the reunion of two childhood friends two decades after one of them relocated.Celine Song in her feature directorial debut is keen and poignantly tells the bitter-sweet love story of its leads.The biggest praise of Past Lives is the cast. The chemistry between the leads is palpable, and their performances are well-nuanced.The plot is simple; it details love and loss. The female lead is poised about whether to continue with her comfortable but not exciting marriage or to walk down uncharted waters with a former childhood sweetheart. The ending shows that the decisions we make aren't always easy, and are sometimes riddled with regret that we think we may get over (even though that's not necessarily always the case). The movie also uses long bouts of silence that are as calming as they're frustrating and chilling.The cinematography is stunning and aided by an evocative score.In all, Past Lives is a brilliant and wistful romance flick.8/10.",
    "142": "Crafted with unfailing tenderness, told with heartfelt compassion and anchored by effortlessly nuanced performances, Past Lives is an intricately layered & profoundly intimate story of what was, what is & what ifs that contemplates on notions of love, life, fate & destiny with enormous care & understanding, and is rendered on screen with composure & gentleness from beginning to end.Written & directed by Celine Song in her directorial debut, the story follows the reunion between two childhood friends who meet after 24 years and reflect on their lives & relationships. There's so much emotion buried within the space between our two central characters that each gesture and moment of longing, hesitation, trepidation & unspoken feelings only bring their vulnerability to surface and it is palpable throughout.Song bestows her characters with rich depths, resonant personalities & emotional complexities and steadily develops their relationship which in turn adds considerable weight to the moments they share together. Greta Lee, Teo Yoo & John Magaro play their respective roles with delicate touch and deftly articulate everything that their character is feeling at any given time with silent expressions, subtle body language & tangible chemistry.Overall, Past Lives is a powerfully moving, endlessly captivating & beautifully poignant romance drama that captures the beauty & curse of our life choices & regrets that ultimately shape us as an individual. One of the best films of the year so far and certainly amongst the strongest debut features to surface in recent memory, the picture navigates first love, sought closure & crushing heartbreak with elegance and is as achingly personal & bittersweet as life itself.",
    "143": "This is an exquisitely poignant film. It can serve as a masterclass on expounding on a single concept - \"in-yun\" in this case (so much so that the critique perhaps could be that it sometimes feels too much like an exercise on a concept). It's also a masterclass on \"nothingness\" tension - the absence of any obvious action only heightens the tension in a room. Inaction in action.Acting is excellent across the board, especially Teo Yoo (Hae Sung) - every facial line of his tells a story.The narrative doesn't veer far from realism, but perhaps so much on the nose it feels like a textbook example. From expected New York landmarks to couples kissing in the background (more Paris than NYC?) to the \"ni hao ma\" banter to the mirror shots, it's too expectedly realistic or clich setting of a scene. I'd argue that in reality, there are often small, very unexpected exchanges and turns, even among the most \"normal\" folks. And while the script is beautifully written, I have a feeling that it feels more natural read than spoken - the flow could be smoother.",
    "144": "This movie yet another naturalization piece, describing the struggles and complexities of juggling different cultures. It can be called a love story as it describes the relationship between korean childhood friends who grow estranged after one of them is dragged along to north america due to parental motives.The movie describes their re-bonding experience throughout time.A lot of cultural clashes and details are described throughout the movie, such as lack of expression of emotions in the west, korean machismo in the east, the way romantic relationships develop in both sides of the world. The movie aims to emphasize those differences as the ultimate hindrances to reconciliation of western and eastern romances.The movie also being beautifully shot, showcases these motifs craftily. Yet I was left unsatisfied after watching all these motifs unfold, the pretty picturesque scenes were wasted on me. Reason being the characters depicted weren't really that complex, the relationship between the two childhood friends while bitter sweet lacked a lot of detail, conflict. I know the movie aimed at realism without adding too much constructed drama, it still needed it. Or at least more scenes of their individual struggles. Because as it is both of the characters were left staying blank canvases with a cultural conflict slapped in as a personality. It just is not enough to relate.",
    "145": "I was 8 years old when I first fell in love (I am not sure about that) and 9 when I had my heart broken (this part I am very sure). I was in Primary 3 and every day was bliss when I hung out with this girl in my class. In the morning she would ask if I had done my homework and my usual answer was no. She would then do them for me, I kid you not. I asked her why and she said it is so that I won't get scolded by the teacher. During recess we would play together and the same thing happened after school until our dads screamed at us to go home; me in a car and she in a van. She lived about a road away from me in the same estate. One day she asked me to go over to her place and it was the first time I understood what poor looks like. Hers was a dilapidated one bedroom flat with a long unventilated corridor that smelled like someone urinated there last night. We didn't care. Then a year later she disappeared from my life. I wasn't a boy who was brave enough to ask my form teacher what happened, but I did. She told me that her family had moved and she was probably studying in another school. That was the first time my heart broke. Those were the 70s and we didn't think to exchange phone numbers. Not having a chance to say goodbye to each other was hard. Sometimes, on grey days I would think about her and hope she is happy with her life, but last night while watching Past Lives I thought about her the whole time. Past Lives has that elusive ability to make one think about first loves, the could-have-beens and the roads-not-taken. Award season is pretty far down the road but I am very sure Past Lives will be in many Best Films of 2023 lists and deservedly so. If yearning and longing can be given definition and colours, Past Lives has all of them.Writer-director Celine Song has crafted an exquisite debut that is endearing but resounding in the way it describes yearning, without a note of artifice. At first, I could hear England Dan and John Ford Coley's \"It's Sad to Belong\" in my head and the narrative could easily go down the path of regret but it doesn't do that, opting instead to take a step back to look at the characters in a different but more compelling way. To me the story is likening to numerous doors at a foyer and one can only open one door and not know what is behind the other doors. The story is about Nora going back through the door she has chosen and landing up at the foyer again. She is thinking of a what-if.Nora is definitely the more compelling character and the narrative choices she will make will define the story. She isn't the most sympathetic character and her mien doesn't betray her innermost thoughts. However, as the story progresses her character seems to wrest me up in a wistful embrace and right at the end when she finally breaks and I landed up in a quivering mess. Hae Sung wears his heart on his sleeve and he is never forceful, preferring to love someone from a distance. He could have held Nora emotionally hostage many times but he loves her too much to do that. Arthur, Nora's husband, seems like a peripheral character and then he isn't. The honest dialogue he has with Nora in bed could only have happened if the couple is honest to a fault. The part he lays it all out that he can never compete with Hae Sung broke me and yet it also confirms the faith he has with Nora even if he does crave for assurances.The pace is exquisite, mirroring a person grappling with the weight of choices and commitments. The direction is assured and I have a strong feeling the story is a deeply personal one. The cinematography is marvellous with beautifully crafted shots that could frame the couple's tension amidst picturesque sceneries providing counterpoints. The music is gorgeous, almost a character in itself and it's never manipulative, moving in a diegetic manner in tandem to the simmering emotions. The acting is wonderful because so many times the actors' body language and long bouts of silence are saying more than words.The ending left me in a quavering mess, my heart palpitated as if it was experiencing a series of little earthquakes and it eventually exploded in a flurry of tiny explosions. My poor heart ached so much for the characters and I loved the choices each of them has made. Past Lives seems to suggests that all romantic films are fairytales and fantasy, and this is the first honest depiction of romance. It also reaffirms the notion that to have loved and be loved before in such a pure manner is a gift.",
    "146": "I really do not understand the hype and fervour surrounding Past Lives. As someone who is nominally a fan of K-drama film and television, I felt that it fell flat even in comparison to others who have tried to tell the same story in recent years, and those accomplished it in a far more interesting and memorable fashion.In a general sense, this felt like 90+ minutes of two (and then three) people standing around, whilst nothing of note happens until the end credits roll. There is a sense of anticipation that is never realised, which led to me feeling underwhelmed after it was over. Perhaps that is the point because the film is all about the importance of moving on, but it still dreary when a movie decides to plod along meaninglessly.I have seen other reviewers, both casual and professional alike, praise the feeling of love and the strong sensations it emblazons in the viewers, but I did not see one iota of this after the characters grew into adults, except for one brief scene at the very end of the film, although even this led to nothing but the end credits. It is not romantic to have one of the main characters promise to wait for the other and then immediately hook up with someone they just met, and it actually left a very bad taste in my mouth.The performances are fine, the music is pretty good and the direction itself isn't awful, so I will give some praise for those, but this is still one of the most disappointing films I have seen all year. Based on expectation and its average rating on IMDB, I have no problem saying that it is massively overrated. It is competent, not horrible, and probably deserves a 6 just for that, but I am being generous.Do yourself a favour and save your money. Watch it for free if it ever comes to streaming. Anything beyond that, I cannot recommend.",
    "147": "If you liked La La Land, go on and see this movie. At least, try to be happy. You only live once and you shouldn't waste your time worrying about your terrible taste.I have learned the hard way not to expect anything from culture anymore, but yet... I'm still disappointed.How anyone manages to enjoy such deliberate attempt to bore its audience to death baffles me. But it's been done so many times already.Casting, photography, editing and all is really neat. It's not their fault. The actors are great, they deserved a better script, one with a story to tell, a point to be made, something to be said.It was really hard to endure the whole thing while resisting the urge to leave the theatre.",
    "148": "Past Lives is a tremendously beautiful film that effortlessly delivers numerous emotional blows.It tells the story of Nora and Hae Sung, two childhood friends from Korea who have to part ways when Nora's family emigrates to Canada. The story then picks up at two points in the future when the two drift back into each other's lives.Perhaps the most enjoyable thing about this film is how refreshing it feels. It is a love story, but not one full of petty arguments and fiery affairs. Instead it translates its emotion through its simplicity and serenity. The story is told through what isn't said as much as it is through what is said, which creates a stripped back but engaging story.To deliver on this, the cast all rise to the occasion, with Greta Lee and Teo Yoo conveying so much visceral and unspoken emotion in their lead performances.Visually the film isn't particularly flashy, but it is well shot and really adds to the tone of the piece.Through Past Lives, Celine Song has created a love story for ages. It is a story that most people will be able to relate to, and will keep you engrossed in these well explored characters from start to finish.",
    "149": "This film had so many boring parts it felt much longer than 1h45.Maybe heavily edited, as a short film this would have been acceptable.The female lead is dislikable, selfish and cruel.The story is lame and predictable, no surprises.At no point did I care about any of the main characters. This film did not touch me on an emotional level - except for a disgust response for the female lead.They should have made a completely different movie out of this. Maybe tell the whole story in like 20min. And then continue the story where this film ends. Maybe her jewish boyfriend was right, and he should have kicked her out...."
}