{
    "0": "Well as a 49-year old woman(giving out my age lol!!), who is a kid at heart with these movies here. Still you have to really love the Trolls.Expect references to boy bands and in jokes from that. With Branch and Poppy as the latter realizes he used to be as a toddler but his three other brothers due to the oldest one being bossy went their separate ways.Forced to be reunited over in next to the youngest, Floyd is kidnapped by the brother-sister antagonists that wanted their own sound but stole from Floyd's.In getting the two other brothers, one married with so many kids, another into yoga, and the other the older brother who bossed everybody around in trying to unite the band to free Floyd.Poppy who thought she was an only child to her king father, realizes she may have a sibling as well. Who looks like her.New characters and old friends. Great for the holiday crowd in kids films.",
    "1": "The movies was great and the best thing about it was the music , it was so much better than the previous ones. All singers were great , I loved better place and it takes two. Really good songs. My kids also enjoyed it and they loved viva just like me. Camila did a great job voice acting here!!The plot was not as good as the previous ones but it's still really pretty and colourful and I love that. Also the introduction of new characters really did good for the movie plus the latin vibes by viva were awesome. At the end of the day I would just say that everyone here enjoyed it. Money well spent.",
    "2": "As a teenage watching this movie, it's great and absolutely wonderful! I love the different artstyles, locations and characters! There're not just giants and trolls but more to that like human giants etc : mountain Ragenous people and the people in the 'Wish you were here!' Island. The artstyle changes when they tried to hustle and the animation is smooth like butter. I love the songs a lot, especially different time with different songs, it really adds up to the atmosphere. There were times where I felt chills like the first scene of mountain ragenous. I also love the chemistry Poppy and Branch has, its lovely how they depend and listen to each other, love how Veener also has a change of heart and decided to be honest about it. Overall, it's definitely a hundred for me, recommended!!! Maybe not for little kids? Just skip the scenes where tiny 'curses' into the black box. I didnt really pay attention to the bad stuff (if there were any in the first place). I just vibe, chill with the movie, characters and the songs. Kudos to the animators and producers!Watched it when it first came out yesterday <3.",
    "3": "As a millenial boyband fan and mother, I was excited to see Trolls Band Together. I am a huge fan of the prior two movies and this one did not dissapoint. They introduced fun and dynamic characters with the introduction of boyband Brozone. The storyline was really fun and continued on the music centered theming of the trolls movie however, it still provides some lessons for the children watching. There were jokes that had both the kids and grownups laughing. And some really awesome new songs and throwback to boyband classics. I was so excited to see *NSYNC reunite with Justin/Branch that I saw the early access screening without my 7 year old child. I cannot wait to bring him to see it because I know he will be in a Better Place once he does! Great movie, must see!",
    "4": "The first and second Trolls movies, based on the popular toy range, including pencil toppers, were both great fun, terrific animation and catchy well-known songs worked into the story, so hopes were high for the third outing. The trailer featured some obvious boyband puns in the script (\"boys to men\", \"one direction\", \"backstreet\"), so I knew what the plot would roughly involve, and I decided to see it on the big screen. Basically, in an opening flashback, it is revealed that Baby Branch (Alan Kim) has brothers and was part the boyband BroZone. They had huge success but disbanded following a concert gone wrong and went their separate ways. Years later, Branch (Justin Timberlake) and Queen Poppy (Anna Kendrick) are attending the wedding of Bergen King Gristle Jr. (Christopher Mintz-Plasse) and Bridget (Zooey Deschanel). Before minister Miss Maxine (RuPaul) has gotten to the vows, the ceremony is interrupted by the arrival of Branch's older brother John Dory (Eric André). Poppy is excited to learn of Branch's long-lost brother and his popstar past, especially because BroZone are her favourite band. John informs Branch that their younger Floyd (Troye Sivan) has been kidnapped by untalented popstar twins Velvet (Amy Schumer) and Veneer (Andrew Rannells). The twins have kidnapped Floyd to steal and drain him of his singing ability using their technological costumes. Veneer sees that the troll is suffering and could be killed if the draining of his talent continues, but Velvet refuses to stop and wants their success to continue. Despite Branch's objections and grumpiness, he agrees to join John, along with Poppy, on a journey to find the other brothers to help to rescue Floyd, and maybe reform the band. Eventually, the group manage to find brothers Spruce (Daveed Diggs) and Clay (Kid Cudi) in different parts of the kingdom. During the process, it turns out that Poppy has a long-lost older sister, Viva (Camila Cabello), who was kept secret from her by their father Peppy (Walt Dohrn) for some reason. The trolls all band together and make their way to rescue Floyd, but it all goes awry. This is until Veneer has a change of heart, having been mistreated by his older sister for so long, and goes against her to help the trolls to escape. The villains get what they deserve, and it ends with BroZone reunited onstage and celebrating with the whole kingdom. Also starring Zosia Mamet as Crimp, Icona Pop as Satin and Chenille, Anderson .Paak as Prince D, Ron Funches as Cooper, Kenan & Kel's Kenan Thompson as Tiny Diamond, Kunal Nayyar as Guy Diamond, David Fynn as Biggie, and Kevin Michael Richardson as Mr. Dinkles. The animation is colourful and eye-catching, the voice cast of comic and music talents is fine, and you cannot help but song along to renditions of pop favourites, including \"Candy Girl\", \"Sweet Dreams (Are Made of This)\" and \"Stayin' Alive\". The problem is the story is the least engaging of the franchise, many of the loveable characters have become either highly irritating, especially Poppy, or they are absent, and it is not that funny, the kids probably won't complain much, it is only a sort-of watchable but almost forgettable computer-animated musical comedy. Okay!",
    "5": "I want to watch this movie. Because it is looking to be a fun times that I love to see the movie. This movie looks so fine to watch in this theater. Or how I love to emphasize the greatest movie of all time. This is fun but I want to really watch some fun things. The first thing I want to apply is some solves of the momentum on the aspects I love to see a movie .fun relax and take a breath. I wish this best actual movie look to be fantastic after the days I want to see this movie funny. This time I show my mom how I really get with her and my brother to the movies and just spin it for thrilling.",
    "6": "Hmm love this movies trolls band together wedding breger branch secret reveal now also brozone pop trolls missed pop trolls village?Known john dory say branch about floyd trapped diamond prison velete vengeer breaks diamond prison family harmony find out new land vacay lsland here branch brozone brother spruce another aboangde begern mini goft?Poppy meet long lost sister name viva\nAway to close viva missing sister?Known poppy hindi ba king preepy long lost sister viva?Resecue floyd find branch brother mini goft?There pop trolls in troll tree escape?Poppy me viva your sister poppy what?Love trolls band together?",
    "7": "I have to say that Camila did an excellent job as Viva, I saw the movie just for her, because I remember that she did an excellent job in Cinderella as well and I thought that this would not be the exception, to be new to this side of fame makes it very Well, her role as Viva is exactly like her in real life, spontaneous, fun, and sweet. I must give Camila a standing ovation for her great work. I hope to see her in more movies because I really enjoy her voice and also her charisma and simplicity. I really like that she adds little phrases in Spanish always showing her that she is Latina. It is an honor to have Camila as a representation of Latin Culture to the world. She is very beautiful and talented. In short, I recommend this movie if you want to spend time with something and it is one of the best options to go to the movies and watch it with your family, friends or partner. 10/10.",
    "8": "Absolutely brilliant movie. Great story line great family film if you are die hard troll fan as we are. Loved the story line. Everything married together really well and the reference to old boy bands was really clever. The vilans were different and unexpected looking but added a different dimension to the movie. We are debating whether it is the best of the 3 movies but it really is so good. Its easy for children to follow. Loved all the songs fronthe past and mixing was epic\nhoping for a 4th one bit this will be hard to live up to. Keep making great family movies like this as it really brings the young and old togther.",
    "9": "The movie is too good, both the colors and the new story created, it is very entertaining not only for children but also for parents or anyone who watches it. I must say that I love the role of Viva and from what I knew the one who voices her is Camila Cabello, I was impressed how she managed to give the perfect touch to her character, so spontaneous and funny, I like her voice to be honest, also the songs They were incredible, I really liked the song It Takes Two... The visuals are very good and it makes you feel in a world full of colors and sweets. Also, this new Viva character turned out very good, I don't regret going to the movies with my friends to see it. Many congratulations for the great work. I think we are finally getting the level of movies where everyone enjoys it from the youngest to the oldest. The only thing I didn't like is that the movie was short, I hope the next one makes it much longer and includes Viva much more since she has an important role which makes me more curious about her story.",
    "10": "The movie is fine. Below average story line. Good music and visuals. But for some reason the film makers decided it was ok to include a number of references to drugs and completely inappropriate sexual jokes. Sure young kids won't understand but why should this be included in a children's film? It doesn't make the film wittier, smarter or more appealing to an adult audience. It's just inappropriate. My kids enjoyed the music and visuals but big parts of the plot line were just too weird for my 5 year old to follow and to be honest it didn't make that much sense to me either. It could have been a good movie if the weird inappropriate bits were cut and they thought about the plot a bit more. The musical performances make it watchable.",
    "11": "The third entry in the series currently in theaters. Opening on a flashback where we see a young Branch, Justin Timberlake, was part of a boy band w/his brothers but due to a falling out, they broke up. Years later, on the eve attending a wedding, Timberlake is interrupted by his former bandmate, Eric Andre, to inform them his brother, Troye Sivan, has been kidnapped & put in a perfume bottom by a pair of twin pop performers, Amy Schumer & Andrew Rannells, to use his essence for their own performances. Deciding to hit the road to mount a rescue, Andre & Timberlake (along w/Anna Kendrick & Kenan Thompson's Tiny Diamond) hope to reunite the band members & use the 'perfect family harmony' to rescue Sivan (something they couldn't do in the film's prologue). On their travels, Kendrick also runs into a long lost sister, played by Camila Cabello & w/all the members reunited, past arguments/resentments resolved & more importantly all the songs sung we get a reasonably enjoyable entry which is breezy fun which won't send parents to the lobbies to check on fictitious phone calls.",
    "12": "I saw Trolls Band Together, starring the voices of Justin Timberlake-Inside Llewyn Davis, Friends With Benefits; Anna Kendrick-the Pitch Perfect movies, End of Watch; Amy Schumer-Snatched, Trainwreck and Kenan Thompson-Kenan_tv, Clifford the Big Red Dog.This is the third theatrical release in the series-not counting the tv movies-following the 2016 original Trolls and Trolls World Tour in 2020. Justin returns as Branch and Anna is his girlfriend, Poppy. Anna discovers that Justin was a member of a boy band called BroZone that broke up years ago-and there are lots of jokes using the names of real boy bands. I remember one scene in particular that I thought was funny: One of Justin's brothers says, We're out of sync. We've gone from boys to men and now, there's only one direction for us to go; the back streets. Amy voices an up and coming singer that has a secret to her success, and it involves one of Justin's brothers whom she has kidnapped. Justin gets in touch with his remaining brothers and wants to launch a rescue mission. Kenan returns as the voice of Tiny Diamond. It's a family friendly film that is entertaining and has lots of songs.It's rated PG for mild rude and suggestive humor and has a running time of 1 hour & 32 minutes.It would be a good one to stream for the little ones.",
    "13": "How many sexual innuendos need to be in a kids movie? Sure, the kids might not understand it, which I guess is the point right? Gotta keep the adults entertained too...The problem is that it is so blatantly obvious and cringe worthy that it totally threw me off of the entire film. Felt like walking out numerous times. Totally unnecessary.The plot sucked overall too. Regurgitated glitter. The only redeeming quality is perhaps the animations. Imaginative and fun.The kids enjoyed seeing it in 3-D, which I guess is all that matters right? Just didn't feel anything like the previous trolls. Where even did the pink one's sister come from? Was she even mentioned in the previous movies? Even my kids questioned that so like? Oh and like half of the main characters from the first movies get about 3 seconds on screen so RIP to them I guess.",
    "14": "Honestly, I would have never seen this movie, but I did because *NSYNC did the song Better Place which I love. The movie was really good, colorful, cheerful, good plot, I was invested in the characters. I did get spoilers before seeing the movie, so I knew JT was Branch, *NSYNC's in the movie for a few seconds at the end. I highly recommend the 3D, even though nothing comes out at you, the 3D was a cool touch to the movie going experience. I'm not going to cover myself in glitter, tease my hair the stand straight up, wear denim, but I will tell everybody about the movie. I'm hoping to get small troll figures of *Nsync: Hype, Ablaze, Trikkie, Boom, and Branch. This movie got me listening to the music on all the streaming apps. It gave me alot nostalgia, I listen and bought past albums and CDs, I bought more apparel merch.. next, I'm hoping for a tour.",
    "15": "Animation was great. Voice acting was great. It was even a good story. The actors and animators did their jobs excellently!But there were far too many inappropriate references for a kid's movie (drugs, sex, etc.) and so the script needed to be more age appropriate. Granted, some of it will go over their heads but the \"chaining me up on our wedding night\" and \"let's make out\" and \"the ring pop that gets you high\" are just not appropriate.I know this is common for kids movies (like Shrek) but this was overboard. I wasn't comfortable with my five year old seeing this so we won't be rewatching it.Also, this is just a personal preference I have as a musician, there is way too much autotune in these movies. It's like listening to a computer sing.",
    "16": "Musically it was the same, music was upbeat and catchy and whatnot for the kids. However the amount of sexual innuendos and bleeped out cuss words (tiny diamond) was so unnecessary. I honestly would not have taken my daughter to see it if I had known before had but we had the chance to see an early screening of it. She really enjoyed the first 2 and they were so much more family friendly than this one was. Highly disappointed and hope if they make more they are more family friendly like the first two. If you are considering this movie, definitely check out parent guides from other websites as this movie is vastly different.",
    "17": "After a fun second part, the third installment arrives: \"Trolls Band Together\", the weakest of the trilogy, with a simple script that tells of the family union in the form of the reunion of a pop group, the scenes fail to be dramatic or melodramatic, they are just bland, the villains are ridiculous and the musical scenes lack quality. The voice work of the actors is not outstanding, the musical themes fail to be memorable when listening to them in different scenes of the film and the design of the new characters is not innovative. The film manages to stand out thanks to its colorful animation with touches of glitter, gel objects, macrame and other materials related to crafts, achieving quality visuals. A passable film that falls below its predecessors.",
    "18": "I have always believed that animated films for children's target audience are mainly adults, since they almost always have messages that clearly reach children but not in the way they can reach an adult. This film is about family ties, about how they can be broken but later they can always heal again based on communication. It also talks about acceptance of those we see as different, how wanting power can lead to harming others. Super colorful, happy movie, perfect for these times, which maintains the essence of Trolls but with new characters, with a lot of music, makes you want to dance and sing, with many references to famous people (in the Latin American version they adapted it to regional references) and at the same time world of Hollywood and entertainment. Movie that brought NSYNS back together (despite JT's cancellation). Film that can be enjoyed by adults and children.",
    "19": "I LOVE THE VILLAINS THROUGHOUT THE MOVIE, THEY ATE THE SONGS THO! Love some of the characters backstories (Branch's brothers and poppy's sister) but they shouldve added a litte bit more a backstory of the villains. Love the songs by the way! Love how the movie just not only included trolls but also some other new other characters with different form (like the villain). The ending was good but not really so good, i think they shouldve added more fight scenes. But overall, i would actually want to watch it again if i can! To be honest, Trolls 2 is a bit better than this but i love them both! Love the writers and producers :3.",
    "20": "Even though I never watched the first two movies, I appreciate how they make this movie easy to understand with its simple storyline and those songs, and the thing that I really like is the animation that is similar to the Puss in Boots sequel, making it really fit for kids. I also like the concepts of the world although I don't really get the world, I like how they create it.Other than that, sadly this movie doesn't come up with much the storyline is unlogical or in other words, the story is too made up. I mean, if this guy has brothers that have left him for 20 years, then how can they find each other? And in the middle of their search for brothers, how can Poppy get her sister out of nowhere? And the married creature that helps them in the climax? The songs though makes the movie having fun and joy atmosphere but because the story is too unlogical make me don't feel any emotion watching this movie, therefore making the songs not really greatAfter all imo, this movie still watchable after all, you just have to not thinking about the unlogical stuff.",
    "21": "The content was clearly not designed for kids, inappropriate jokes, acting like a binki is drugs, talking about having way to many \"suitors\" and more. The songs just repeated all film, and way too many new characters preventing the kids from enjoying there favorite characters plus voices of other favorites were replaced.I hope they make a new one and fix these issues.Just leave brozone and burgena (all associated characters) in the trash and bring Viva and Nsync back to troll world with the original voices of the trollsAnd please leave out the 3 eyed demon thing. The \"trippy\" cuts are bad enough, whoever is pushing for those should just be removed from the franchise por favor.",
    "22": "This movie was adorable and fun to watch because the entire franchise has been great and because my sister was in love with these toys as a kid.The movie had some adult humor in it that I enjoyed as a 25 year old, reminds me of old Dreamwork's movies like Shrek. The movie in itself was well planned out and the music was fantastic. A few things in the movie I struggled with were the moral dilemma in Veneer and the scene where Viva and the golf ball trolls want to kill Bridgette.The cast list in the movie amazed me with how extensive it was from movie and tv stars like Zoey Deschanel to Kid Cudi to Anna Kendrick. The moral dilemma in Veneer was not well executed in my opinion, I would have either preferred a more direct positive change before the big concert or a immediate change at the end on the boat, not a progressive change. As for the scene where they want to kill Bridgette, I think the idea was great but the fact they didn't make the scene a bit longer, lessened the impact.The movies music was phenomenal and I will say that again and again. 3/3 on the Trolls franchise soundtracks.My favorite part: The final scene where NSYNC shows up and sings with Timberlake like they had use to sing together was iconic.",
    "23": "Loved this Trolls movie the most! I loved the Other two also, but this one tops them both! Love the jokes about The boy bands, the story line was perfect! If you liked the others Trolls movies I am sure you'll love this one! Love the sweet friendship that has developed between Poppy and Branch. Such sweet surprises along the journey. Tiny diamond is hilarious and he has some super funny lines. Just crazy travels on this road show that as a fan you will not want to miss one minute of it. So be prepared to glue you tush to the cush and have popcorn ready with your drink in the other hand! Enjoy, cuz I know you will.",
    "24": "It felt like I've been watching the trailer for this movie at the Regal for at least a year. That's actually not a good sign cause it tells me they met for this movie to come out earlier but kept pushing it back cause it was bad.With that said, its not that bad. Not big on musicals especially musicals too lazy to write their own songs, which tells me what a cash cow this film is met to be, but as i discovered DreamWorks seems to be the king of cartoon franchises so it was important that this was successful so they can make another one.I'll admit that it was a decent story that poked fun at boy bands worth a few laughs and they picked the right mixed of songs to get you excited to see it.It's not a masterpiece but its fun.",
    "25": "This was by far my favorite Trolls movie - nostalgia city and lots of references that only adults (at least the millennial group) will get and love. I was a HUGE NSYNC fan growing up, but still getting to hear the mashups and new single was phenomenal. The storyline may not have be as strong as some people would like, but nonetheless I had a fantastic time watching this movie. There will be some new characters that get introduced and the movie does assume that you've seen the first Trolls movie, but I don't think that's a huge hindrance to the movie. It won't win any awards, but overall it was fun and enjoyable.... I'd definitely go watch it again in the movie theater...even with all the kids there.",
    "26": "Trolls band together is the third instalment in this dreamworks children's animated musical franchise where by the trolls you used to stick on the end of your pencil in school have not only come to life but can in fact sing. This time around just as the Bergens Bridget and King Gristle (isn't that the yucky part of chicken?) are about to tie the knot, no fortunately not a noose because they appear in a film with James Corden.... They're interrupted by John Dory who it turns out is brothers with Branch que Branch backstory sequence. Long story short, Branch used to be in a famous band called Brozone (see what they did there) but they fell out (as all boy bands do once the money dries up) and now they're forced to come back together to save another member of the band Floyd who has been imprisoned by two of the tackiest cartoon character villain designs I've seen.I'm not entirely sure what to say about this film except it's more of the same from the previous two Trolls films. It's a silly adventure film with some questionable covers of musical numbers that may have adults reaching for the earplugs. I think if I was 5.6,7 years old I would love these films, my favourite film franchise as a kid was Alvin in the Chipmunks something about the wildly high pitched medleys of classic songs was music to my ears back then and I feel like these trolls films fall into that same category, the category of kids films that young children love and that adults can't wait to end so they can take some paracetamol.There's nothing offensively bad about these films they're just a bit childish which is fine for their intended target audience however on a more serious note here's where I feel there's a wider problem. Dreamworks at their peak were regularly releasing films from franchises such as Shrek, Madagascar and Kung Fu Panda as well as that partnership they had with the brilliant Aardman at one point. Now as much as I know they still have plans to add more entries to some of those beloved franchises (Kung Fu Panda for instance has a new instalment coming out early next year) the company's what I would describe as new generation of franchises just doesn't seem to be hitting the mark. I'm talking about the likes of Boss Baby and Trolls, these films are fine for kids but they have very little for adults to enjoy in as films like Shrek did and it's showing in the box office numbers (Last wish excluded). It's sad to see my personal favourite Animation studio falling but studios like Illumination are just making better animated films right now that have a wider appeal. With layoffs already having occurred at dreamworks as well as plans being drawn up to move their feature film production away from America completely it does worry me what the future may hold.",
    "27": "The only redeeming thing about this movie is that I got to sit for free because my local theater has a monthly VIP package where I get to see two movies for free every month. This movie from start to finish was just crap. The last at least had a storyline that was somewhat better to follow and actually made more sense than this one. The antagonists in this movie were absolutely laughable, and a poor attempt on the writers part. Don't even get me started on some of the cast members. Maybe they should totally just write those people off. This movie could've been something pretty awesome. It could've had something better than just a bunch of covers and silly musical numbers that just didn't really flow properly. I know it's a movie about trolls, but come on they could've tried to have a genuine story here that people could relate to and give a crap about. The only real reason I watched this movie was to see if I could recommend it to my bro and his kids or not, and no I am not going to recommend this movie to them. At least the next movie that I'll watch for free is the new Willy Wonka movie, Hopefully that one actually has a storyline that is good. Parents save yourself a headache go watch something else with your kids. This one isn't good. Save your money.",
    "28": "The movie is fine. Below average story line. Good music and visuals. But for some reason the film makers decided it was ok to include a number of references to drugs and completely inappropriate sexual jokes. Sure young kids won't understand but why should this be included in a children's film? It doesn't make the film wittier, smarter or more appealing to an adult audience. It's just inappropriate. My kids enjoyed the music and visuals but big parts of the plot line were just too weird for my 5 year old to follow and to be honest it didn't make that much sense to me either. It could have been a good movie if the weird inappropriate bits were cut and they thought about the plot a bit more. The musical performances make it watchable.",
    "29": "The third entry in the series currently in theaters. Opening on a flashback where we see a young Branch, Justin Timberlake, was part of a boy band w/his brothers but due to a falling out, they broke up. Years later, on the eve attending a wedding, Timberlake is interrupted by his former bandmate, Eric Andre, to inform them his brother, Troye Sivan, has been kidnapped & put in a perfume bottom by a pair of twin pop performers, Amy Schumer & Andrew Rannells, to use his essence for their own performances. Deciding to hit the road to mount a rescue, Andre & Timberlake (along w/Anna Kendrick & Kenan Thompson's Tiny Diamond) hope to reunite the band members & use the 'perfect family harmony' to rescue Sivan (something they couldn't do in the film's prologue). On their travels, Kendrick also runs into a long lost sister, played by Camila Cabello & w/all the members reunited, past arguments/resentments resolved & more importantly all the songs sung we get a reasonably enjoyable entry which is breezy fun which won't send parents to the lobbies to check on fictitious phone calls.",
    "30": "I saw Trolls Band Together, starring the voices of Justin Timberlake-Inside Llewyn Davis, Friends With Benefits; Anna Kendrick-the Pitch Perfect movies, End of Watch; Amy Schumer-Snatched, Trainwreck and Kenan Thompson-Kenan_tv, Clifford the Big Red Dog.This is the third theatrical release in the series-not counting the tv movies-following the 2016 original Trolls and Trolls World Tour in 2020. Justin returns as Branch and Anna is his girlfriend, Poppy. Anna discovers that Justin was a member of a boy band called BroZone that broke up years ago-and there are lots of jokes using the names of real boy bands. I remember one scene in particular that I thought was funny: One of Justin's brothers says, We're out of sync. We've gone from boys to men and now, there's only one direction for us to go; the back streets. Amy voices an up and coming singer that has a secret to her success, and it involves one of Justin's brothers whom she has kidnapped. Justin gets in touch with his remaining brothers and wants to launch a rescue mission. Kenan returns as the voice of Tiny Diamond. It's a family friendly film that is entertaining and has lots of songs.It's rated PG for mild rude and suggestive humor and has a running time of 1 hour & 32 minutes.It would be a good one to stream for the little ones.",
    "31": "How many sexual innuendos need to be in a kids movie? Sure, the kids might not understand it, which I guess is the point right? Gotta keep the adults entertained too...The problem is that it is so blatantly obvious and cringe worthy that it totally threw me off of the entire film. Felt like walking out numerous times. Totally unnecessary.The plot sucked overall too. Regurgitated glitter. The only redeeming quality is perhaps the animations. Imaginative and fun.The kids enjoyed seeing it in 3-D, which I guess is all that matters right? Just didn't feel anything like the previous trolls. Where even did the pink one's sister come from? Was she even mentioned in the previous movies? Even my kids questioned that so like? Oh and like half of the main characters from the first movies get about 3 seconds on screen so RIP to them I guess.",
    "32": "Honestly, I would have never seen this movie, but I did because *NSYNC did the song Better Place which I love. The movie was really good, colorful, cheerful, good plot, I was invested in the characters. I did get spoilers before seeing the movie, so I knew JT was Branch, *NSYNC's in the movie for a few seconds at the end. I highly recommend the 3D, even though nothing comes out at you, the 3D was a cool touch to the movie going experience. I'm not going to cover myself in glitter, tease my hair the stand straight up, wear denim, but I will tell everybody about the movie. I'm hoping to get small troll figures of *Nsync: Hype, Ablaze, Trikkie, Boom, and Branch. This movie got me listening to the music on all the streaming apps. It gave me alot nostalgia, I listen and bought past albums and CDs, I bought more apparel merch.. next, I'm hoping for a tour.",
    "33": "Animation was great. Voice acting was great. It was even a good story. The actors and animators did their jobs excellently!But there were far too many inappropriate references for a kid's movie (drugs, sex, etc.) and so the script needed to be more age appropriate. Granted, some of it will go over their heads but the \"chaining me up on our wedding night\" and \"let's make out\" and \"the ring pop that gets you high\" are just not appropriate.I know this is common for kids movies (like Shrek) but this was overboard. I wasn't comfortable with my five year old seeing this so we won't be rewatching it.Also, this is just a personal preference I have as a musician, there is way too much autotune in these movies. It's like listening to a computer sing.",
    "34": "Musically it was the same, music was upbeat and catchy and whatnot for the kids. However the amount of sexual innuendos and bleeped out cuss words (tiny diamond) was so unnecessary. I honestly would not have taken my daughter to see it if I had known before had but we had the chance to see an early screening of it. She really enjoyed the first 2 and they were so much more family friendly than this one was. Highly disappointed and hope if they make more they are more family friendly like the first two. If you are considering this movie, definitely check out parent guides from other websites as this movie is vastly different.",
    "35": "After a fun second part, the third installment arrives: \"Trolls Band Together\", the weakest of the trilogy, with a simple script that tells of the family union in the form of the reunion of a pop group, the scenes fail to be dramatic or melodramatic, they are just bland, the villains are ridiculous and the musical scenes lack quality. The voice work of the actors is not outstanding, the musical themes fail to be memorable when listening to them in different scenes of the film and the design of the new characters is not innovative. The film manages to stand out thanks to its colorful animation with touches of glitter, gel objects, macrame and other materials related to crafts, achieving quality visuals. A passable film that falls below its predecessors.",
    "36": "I have always believed that animated films for children's target audience are mainly adults, since they almost always have messages that clearly reach children but not in the way they can reach an adult. This film is about family ties, about how they can be broken but later they can always heal again based on communication. It also talks about acceptance of those we see as different, how wanting power can lead to harming others. Super colorful, happy movie, perfect for these times, which maintains the essence of Trolls but with new characters, with a lot of music, makes you want to dance and sing, with many references to famous people (in the Latin American version they adapted it to regional references) and at the same time world of Hollywood and entertainment. Movie that brought NSYNS back together (despite JT's cancellation). Film that can be enjoyed by adults and children.",
    "37": "I LOVE THE VILLAINS THROUGHOUT THE MOVIE, THEY ATE THE SONGS THO! Love some of the characters backstories (Branch's brothers and poppy's sister) but they shouldve added a litte bit more a backstory of the villains. Love the songs by the way! Love how the movie just not only included trolls but also some other new other characters with different form (like the villain). The ending was good but not really so good, i think they shouldve added more fight scenes. But overall, i would actually want to watch it again if i can! To be honest, Trolls 2 is a bit better than this but i love them both! Love the writers and producers :3.",
    "38": "Even though I never watched the first two movies, I appreciate how they make this movie easy to understand with its simple storyline and those songs, and the thing that I really like is the animation that is similar to the Puss in Boots sequel, making it really fit for kids. I also like the concepts of the world although I don't really get the world, I like how they create it.Other than that, sadly this movie doesn't come up with much the storyline is unlogical or in other words, the story is too made up. I mean, if this guy has brothers that have left him for 20 years, then how can they find each other? And in the middle of their search for brothers, how can Poppy get her sister out of nowhere? And the married creature that helps them in the climax? The songs though makes the movie having fun and joy atmosphere but because the story is too unlogical make me don't feel any emotion watching this movie, therefore making the songs not really greatAfter all imo, this movie still watchable after all, you just have to not thinking about the unlogical stuff.",
    "39": "The content was clearly not designed for kids, inappropriate jokes, acting like a binki is drugs, talking about having way to many \"suitors\" and more. The songs just repeated all film, and way too many new characters preventing the kids from enjoying there favorite characters plus voices of other favorites were replaced.I hope they make a new one and fix these issues.Just leave brozone and burgena (all associated characters) in the trash and bring Viva and Nsync back to troll world with the original voices of the trollsAnd please leave out the 3 eyed demon thing. The \"trippy\" cuts are bad enough, whoever is pushing for those should just be removed from the franchise por favor.",
    "40": "This movie was adorable and fun to watch because the entire franchise has been great and because my sister was in love with these toys as a kid.The movie had some adult humor in it that I enjoyed as a 25 year old, reminds me of old Dreamwork's movies like Shrek. The movie in itself was well planned out and the music was fantastic. A few things in the movie I struggled with were the moral dilemma in Veneer and the scene where Viva and the golf ball trolls want to kill Bridgette.The cast list in the movie amazed me with how extensive it was from movie and tv stars like Zoey Deschanel to Kid Cudi to Anna Kendrick. The moral dilemma in Veneer was not well executed in my opinion, I would have either preferred a more direct positive change before the big concert or a immediate change at the end on the boat, not a progressive change. As for the scene where they want to kill Bridgette, I think the idea was great but the fact they didn't make the scene a bit longer, lessened the impact.The movies music was phenomenal and I will say that again and again. 3/3 on the Trolls franchise soundtracks.My favorite part: The final scene where NSYNC shows up and sings with Timberlake like they had use to sing together was iconic.",
    "41": "Loved this Trolls movie the most! I loved the Other two also, but this one tops them both! Love the jokes about The boy bands, the story line was perfect! If you liked the others Trolls movies I am sure you'll love this one! Love the sweet friendship that has developed between Poppy and Branch. Such sweet surprises along the journey. Tiny diamond is hilarious and he has some super funny lines. Just crazy travels on this road show that as a fan you will not want to miss one minute of it. So be prepared to glue you tush to the cush and have popcorn ready with your drink in the other hand! Enjoy, cuz I know you will.",
    "42": "It felt like I've been watching the trailer for this movie at the Regal for at least a year. That's actually not a good sign cause it tells me they met for this movie to come out earlier but kept pushing it back cause it was bad.With that said, its not that bad. Not big on musicals especially musicals too lazy to write their own songs, which tells me what a cash cow this film is met to be, but as i discovered DreamWorks seems to be the king of cartoon franchises so it was important that this was successful so they can make another one.I'll admit that it was a decent story that poked fun at boy bands worth a few laughs and they picked the right mixed of songs to get you excited to see it.It's not a masterpiece but its fun.",
    "43": "This was by far my favorite Trolls movie - nostalgia city and lots of references that only adults (at least the millennial group) will get and love. I was a HUGE NSYNC fan growing up, but still getting to hear the mashups and new single was phenomenal. The storyline may not have be as strong as some people would like, but nonetheless I had a fantastic time watching this movie. There will be some new characters that get introduced and the movie does assume that you've seen the first Trolls movie, but I don't think that's a huge hindrance to the movie. It won't win any awards, but overall it was fun and enjoyable.... I'd definitely go watch it again in the movie theater...even with all the kids there.",
    "44": "Trolls band together is the third instalment in this dreamworks children's animated musical franchise where by the trolls you used to stick on the end of your pencil in school have not only come to life but can in fact sing. This time around just as the Bergens Bridget and King Gristle (isn't that the yucky part of chicken?) are about to tie the knot, no fortunately not a noose because they appear in a film with James Corden.... They're interrupted by John Dory who it turns out is brothers with Branch que Branch backstory sequence. Long story short, Branch used to be in a famous band called Brozone (see what they did there) but they fell out (as all boy bands do once the money dries up) and now they're forced to come back together to save another member of the band Floyd who has been imprisoned by two of the tackiest cartoon character villain designs I've seen.I'm not entirely sure what to say about this film except it's more of the same from the previous two Trolls films. It's a silly adventure film with some questionable covers of musical numbers that may have adults reaching for the earplugs. I think if I was 5.6,7 years old I would love these films, my favourite film franchise as a kid was Alvin in the Chipmunks something about the wildly high pitched medleys of classic songs was music to my ears back then and I feel like these trolls films fall into that same category, the category of kids films that young children love and that adults can't wait to end so they can take some paracetamol.There's nothing offensively bad about these films they're just a bit childish which is fine for their intended target audience however on a more serious note here's where I feel there's a wider problem. Dreamworks at their peak were regularly releasing films from franchises such as Shrek, Madagascar and Kung Fu Panda as well as that partnership they had with the brilliant Aardman at one point. Now as much as I know they still have plans to add more entries to some of those beloved franchises (Kung Fu Panda for instance has a new instalment coming out early next year) the company's what I would describe as new generation of franchises just doesn't seem to be hitting the mark. I'm talking about the likes of Boss Baby and Trolls, these films are fine for kids but they have very little for adults to enjoy in as films like Shrek did and it's showing in the box office numbers (Last wish excluded). It's sad to see my personal favourite Animation studio falling but studios like Illumination are just making better animated films right now that have a wider appeal. With layoffs already having occurred at dreamworks as well as plans being drawn up to move their feature film production away from America completely it does worry me what the future may hold.",
    "45": "The only redeeming thing about this movie is that I got to sit for free because my local theater has a monthly VIP package where I get to see two movies for free every month. This movie from start to finish was just crap. The last at least had a storyline that was somewhat better to follow and actually made more sense than this one. The antagonists in this movie were absolutely laughable, and a poor attempt on the writers part. Don't even get me started on some of the cast members. Maybe they should totally just write those people off. This movie could've been something pretty awesome. It could've had something better than just a bunch of covers and silly musical numbers that just didn't really flow properly. I know it's a movie about trolls, but come on they could've tried to have a genuine story here that people could relate to and give a crap about. The only real reason I watched this movie was to see if I could recommend it to my bro and his kids or not, and no I am not going to recommend this movie to them. At least the next movie that I'll watch for free is the new Willy Wonka movie, Hopefully that one actually has a storyline that is good. Parents save yourself a headache go watch something else with your kids. This one isn't good. Save your money.",
    "46": "I never thought I'd be saying this about a Trolls movie, but if society could take a message from this movie, we'd be in a much better place. It was so refreshing to have a family movie that shows the importance of family; that people can still have romantic love (seems to have all-but disappeared from family movies); that you can have a family movie without having to be preachy. The music was fantastic. The voice acting was top notch. The artwork was gorgeous - I absolutely loved looking at this movie. Thank you, Dreamworks, for showing what a family movie can be. Such a fun time at the theater with my wife and kids.",
    "47": "Yes... the animation is fun, especially for children, the animation is colorful and adorable, I enjoyed it especially with the music which was really fun to listen to, I even sang along\nMy kids love watching this Trolls because cute yea ofc ...I also like the Trolls characters, especially Poppy and Branch,they sing well.For animations with a music genre, this film is the best in my opinion\nAs for the story, well... it's not bad, even though there is a forced story like Poppy's sister who just appears The story is too classic\nI enjoyed this film more for the music and animation than the story.",
    "48": "I enjoyed this movie way more than I thought I was going to, from the songs to the character designs. This movie well written and the characters have may I say AMAZING voices i definitely recommend this movie this should have way more than 6/10. May I also add, the villains were amazingly written from the design to the voices this movie was also really funny with the concept of it was absolutely mind blowing. The graphics also was fantastic, my 3rd time watching this movie its actually very enjoyable and if I enjoy it you definitely will. The songs are very catchy and will get stuck in your head from my personal experience im learning the lyrics for all of them this movie is FANTASTIC please watch it and give it the credit it deserves <3.",
    "49": "I watch my kids watch movies - you can tell the ones that are well made, the references are there for them to lap-up and they're constantly laughing and full of enjoyment.This film however, carried far too much in the way of it's overall message, a mixture of extreme optimism pummelled with negativity.The effects and overall animation are impressive but let down by an ultra negative drawn out storyline.The film contains an oversaturated amount of adult references - some of which imo just go too far in exploiting the innocence of a young mind. Considering the target age for this franchise is between 5-11? It's unnecessary to fill the film with drug and sexual references every 5minutes. (One or two throughout the whole film is usually enough to keep parents enjoyment morale up) in this instance, It felt like i was watching a young teen animation show..There are two occasions where the trolls experience an acid trip, and an instance where the youngest character is bleeped out with a swearword. It felt cheap and underwhelming - I imagine the writers acting like young immature adults flying back in their chairs with uncontrollable childish laughter as they read out the script.It felt uncomfortable to watch and the battle between good and evil is heavily imposed upon you in emotional sense that I can't see why is relevant to children of this age range. I agree children should learn that there are depraved members of society but the plot is essentially poorly written and felt more like a desensitisation brain washing program rather than your traditional good vs bad plot.I guess a lot of films are like this nowadays, and that's cultural issue we have created for ourselves. Imo U rated films can be classier and cleverer than this. It's a shame because the singing is great, although it's like your 3 year old had control of the remote and keeps changing the track every 10 seconds and unfortunately you can't enjoy one song in its entirety as done in previous films.I've never tried falling asleep so hard at the cinema. Thanks Hollyweird.",
    "50": "I just love the whole storyline it had especially Viva's story and Branch's story as well. We can really get a sense of their past and why they acted the way they did. The Brozone story was great too. I loved how in this movie they focused on rekindling relationship with their siblings it was just an awesome plot for this movie. I really love Viva's and Poppy's relationship it's just too cute and wholesome. My favorite character was definitely Viva something about her was just awesome and likeable. Overall, I loved the new editions of new characters. 10/10 a must watch kid friendly movie. The songs were top tier my favorite were \"better place\" and \"it takes two\".",
    "51": "Seriously, why all the unnecessary adult content? It doesn't make it funny. It doesn't make it more appealing to children or adults. Why do we need to say hell? I don't want my 3 yr old saying that. Implying a hungover character. Let's not normalize drunkenness to our children. A straight up demonic character that transported them through a portal...twice. Character talking about being promiscuous while abroad. Very scary clown scene...twice. I don't get it. My son was so excited to go to the movies, and I left feeling like we just watched an R rated movie. We can surely do better for our kids.",
    "52": "I not use to watch these kind of films but for a family's weekend I gave it a try. Is sad how this movie tries so hard to gets children attention with popular songs. Even \"Sing\" managed to use the songs as an extension of characters behavior and personality. Nevertheless, \"Trolls 3\" uses music on random moments for no reason and is more like a YouTube Kids video than a movie.That's for the worlds building to. The villains world is the least creative thing I ever seen. Only a few city assets and 3D \"cool\" words floating by a generic city.With that in mind, it could be reasonable to want, at least, something funny, but that's another bummer. Only a few characters are likable.In sum, Trolls 3 could be passed as the first AI scripted movie and I would believe it because it is no soul in it.",
    "53": "I feel like this third Troll movie should've been the second one. Cause I see it has way more connections to the first movie than the second one. Bridget and King Gristle got their love story sequel, Poppy found her long lost sister, the big reveal of Branch's past. Compared to the second movie, which has way less connection to the first movie, this one just felt more like a continuation of the first movie. I mean, the second movie didn't even include King Gristle! But that's just my honest opinion. Anyway, moving on to the review. Just like the other Trolls movies, it's full of music. Only this time, it's all about boybands. Boyzone, N*Sync, Backstreet Boys, 98 Degrees, etc. You gotta be a music lover or a child to enjoy this movie. Otherwise, it'll felt like watching any other animated movie. To me personally, It would've been great if the members of Brozone were voiced by N*Sync members. Too bad... too bad...",
    "54": "I remember being a kid when the first one came out and really enjoying it. When the second one came out I was pleasantly surprised as it was actually quite good but this one just doesn't have the same effect as the first two. I'm not sure if it's just because I'm older or because dreamworks is trying to win back it's older viewers but I did notice a few (mostly innocent) adult Jokes around the beginning of the movie. Overall I mostly enjoyed the movie and it's entertaining story line, but for me it was the very nostalgic dream works introduction that really topped off the whole thing. Even though it has no relevance to the film I know many viewers will agree with me.",
    "55": "They are about to get brand back together to have the best family reunion ever. They will be going on a musical adventure with the Bro zone gang. There will be new songs and a characters in the movie. I wonder want the are going to sing in the movie. Will it be fun for my whole family? I liked the first movie better because they sang \"Can't stop the feeling\" and I'd really liked that song so much. I surprised that Poppy has a sister and Branch has a brother. The Bro zone gang has been held in a diamond prison and the trolls are going to try save the Bothers of Branch and get the band back together.",
    "56": "Greatest movie I have ever seen, it was simply incredible, I have glad to be born to watch this very beautiful artistic masterpiece, The main characteris popee and branch simply had the greatest chemistry I have ever seen on screen. The story was simply wonderful, the fact that every second there was a new song, the smart references to other boy bands was simply intellectual storytelling. The heart warming love between the main characters is something to strive for. I would sincerely suggest to watch this beautiful masterpiece and in my opinion the greatest movie of all time. Once again I give it 10/10.",
    "57": "I'm a father of a 10 year old and a 7 year old. We just went to the theater to see this and sat in a packed, and silent, matinee show. Neither of the earlier Trolls movies are gold, but at least we laughed. This one had two belly laughs. The original song in the first movie (\"I Will Get Back Up Again\") is made of more quality than this entire movie. The visuals were very creative here, but everything else not so much.Focusing on long lost brothers of Branch isn't a bad idea, but this movie missed every opportunity to make them funny, let alone interesting. Poppy is almost inconsequential here. I hope they course correct and make one more that ignores most of the characters in this one.",
    "58": "Loving cartoons. I want adult stuff to it. There was no adult in this one. Yes, it had humor. I walked out halfway thru the movieIt will work for kids. It had charm, humor and interesting relationships. I'd watch with little kids.Loving cartoons. I want adult stuff to it. There was no adult in this one. Yes, it had humor. I walked out halfway thru the movieIt will work for kids. It had charm, humor and interesting relationships. I'd watch with little kids.Loving cartoons. I want adult stuff to it. There was no adult in this one. Yes, it had humor. I walked out halfway thru the movieIt will work for kids. It had charm, humor and interesting relationships. I'd watch with little kids.",
    "59": "The first trolls was alright and sort of logical. The second wasn't as good as the first, but Trolls Band Together is a crazy ride. It's really just random scenes spliced together, with too many characters, too many random storylines and random songs on top. You as an adult and child just don't care about any of it, because all of it moves so quickly. All the songs, talking, animation is just over stimulating and becomes tiring. Clearly they didn't really know what they wanted to do with the movie and just pushed it out for money. It's a movie on steroids and if you've worked with people who have ADHD, then you'll understand what I mean. Also, there's too many drug references for a kids movie. I love when there's something in it for adults that kids won't understand, but the pacifier, drug influenced animation and then the main storyline of using a substance to enhance their talent is really poor form not suitable for young kids.",
    "60": "Went to see this tonight for a Family Movie Night and it was a huge hit! Both of my kids (ages 5 and 9) loved it - it kept them engaged and watching the entire time - and my husband and I found ourselves laughing at all of the jokes and puns. We weren't sure what to think because we weren't as big of fans of Trolls 2 but this one is right up there with the first movie. The soundtrack was fantastic too - we were all dancing in our seats to the new songs as well as all of the old boy band hits. Everyone left happy and when we went around and gave our post-movie ratings, we all gave it a unanimous 10/10.",
    "61": "Not suitable for children at all. Foul language, inapropriate jokes. Not fun or entertaining for children nor adults. I don't understand who this movie is aimed at and who the main demographic is. Too childish for adults and way too innapropriate for kids.Don't waste your time and money on this one.I enjoyed the previous trolls movies but this one is sooooooooo bad!!!!!Went with my two kids and husband and no one hade a good time!!!!!!And it is also very uppsetting that Amy Schumer was cast considering her racism and other horrible things she has said and done in the past!!!!!!!!!!!!!!!!!",
    "62": "Where do I start, the main character is an abusive girlfriend, who mentally abuses and manipulates her partner (baby branch). She continuosly ignores his feelings. What a great a great example.It continues with a bunch of sexual references, drug references, to the point it felt really awkward to me as an adult. The movie is packed with materialism/consumerism, and just horrible references for kids. Why does a kids animation need all of this ?? Can't we make a movie with better examples for our kids ?Besides that the animations were great, and the same quality we've come to expect fro DreamWorks. The voice acting is great too. Just wish they can make a movie with better.",
    "63": "I'm not a big fan of this franchise, but it's definitely better than Boss baby. Otherwise, the film is very entertaining and has a fast pace, but again, certain flaws are clearly visible, such as the fact that after the Branch brothers get together, they quickly separate again for a rather dull reason, or that they suddenly introduce Poppy's sister in the middle of the movie and when it seems that she should be the antagonist because she wants to prevent the main characters from leaving that location only to have them leave practically instantly and she won't have a specific role until near the end of the film. It's interesting that many old characters appear only briefly in this film, but in this case it's not really a problem because I don't like most of them, so I guess that's a plus. The antagonists are not good because first of all their design is desperate, they remind me of Spinel from Steven Universe but without any of her charm, and then and besides that they are not effective enough to perceive them as real threats and their goal is so boring. It's not that the rest of the new characters are anything special either, Branch's brothers are very forgettable characters, the only one I can remember is Floyd, who is the only character who is as likable as he is and the only one for whom I somewhat care, while I can't even care about the others because most of the time they act like jerks to each other. And don't be fooled in the trailers when they said \"Trolls met Fast and Furious\" because that scene doesn't appear until the third act. Even the covers of the songs are not that good because except for \"Sweet dreams\" all the others are forgettable. But the animation is very good, I also like the stylization of some scenes and the wide range of colors that the film has. All in all, this is pretty middle quality of a DreamWorks movie, but again when you take into account that their third films in the franchise are often the weakest part of that franchise and as it was about Trolls, this film really has no motive to be a good movie, so that in the end it turned out ok.",
    "64": "The movie wasn't the best trolls movie. The singers did a good job but it felt super inspired by K-pop bands. I expected more from the movie, I expected for a better plot, can't spoil it but i was very disappointed with it. The movie wasn't worth money but worth watching at home when it releases from theaters.Branch and Poppy did have some more cuter romance though unlike the other two.Tony Diamond was funny and I'm definitely happy they added him to the crew.The movie was pretty okay, I didn't enjoy it too much but I still did. Too much K-pop for my taste. My friend did like the movie though.Overall::: If you don't like K-pop, don't pay to watch it.",
    "65": "Let me tell you something pal -- this soundtrack is a freakin banger. I took my friends to this who have no idea what the Trolls Universe was and after the film everyone was signing the songs in the car, at the restaurant, and at home. The villains were iconic, the plot was everything we needed, and Keenan Thompson's character made my friend (Leshawn) bust out laughing in the theater. It's a kids movie so I expected not all the jokes were going to land, but all of them did. The adult jokes were so funny because it was so relatable. The best part especially about this type of movie is the meta-community behind it, where from the music, to the immersive art, make sure you check it out when you can.",
    "66": "I have waited so long to see this movie because I love music and great cinematography. Firstly the music was cute yet so serious. It was adorable. The cinematography was vibrant. The colours were enthralling. It was a feast for the eyes and ears. The jokes were witty and for adults too. What I love most about the trolls is that they band together and are super close, friendly and generally positive. It was a thrill picking out the voice actors from the trolls dialogue. My favourite one is Justin Timberlake. It was a sweet escape and I thoroughly enjoyed it. I would recommend to young at heart adults and children. I gave this movie 10 out of 10.",
    "67": "A cinema full of children (and parents who had to accompany their children *g*). Excitement. And then: enthusiasm. The cinema went with it. Laughed, could hardly sit still. As an adult, you have to get involved with the candy backdrop of the marshmallow world, like in the two previous films, as well as the boy band music, which of course isn't for everyone.If you get involved with it, you'll be really entertained. A downright psychedelic firework display that, on the one hand, has one or two surprises also for the adult filmgoers in the subtext, but also in the spoken jokes. Ironically, these were the parts where the kids laughed the loudest, which I can't really explain.There's nothing about the plot here - because, being honest, there's hardly anything you could really call a plot. Trolls on a rescue mission, but in the end it's just colorful, loud with a lot of music, singing and dancing, with music that wanders through the pop culture of the last 50 years and yet makes it its own in a completely new way.Adults will either love or hate this film. There will probably be few judgments in between. But children will be thrilled.",
    "68": "I personally really enjoyed the movie the whole way through. It's truly amazing to watch these characters grow and develop, the soundtrack is catchy, the cast is incredible, the voice acting, too!The movie captures Branch's trauma in a special way and I really love that. They manage to make it real but in a kid-friendly way.I've been a fan of the franchise since the first movie, so getting to see how these characters became who they are and getting to see their backstories was really satisfying.Branch and Poppy's relationship really stuck out to me. I love how Poppy dealt with Branch's feelings and made sure he knew his feelings were valid.Very very well done dreamworks threequel and I can't wait to see where they take this franchise next.10/10.",
    "69": "Accidentally stumbled into this movie and what a joy it was. Why did I have such a good time as an adult? Because the (terrific) dialogues are tailormade to grownups first. I am not kiddin'More good: the trolls look absolutely adorable and kids will love the happy go lucky spirit and vivid colors and fastpaced animation. This movie is a sure bet for a fun family time.Such a relief to see an animation movie that is targetted at kids, but which can be be enjoyed by old folks as well. I applaud the writers firstmost for this achievement. The dialogues arent difficult or anything, but there are tons of subtle jokes packaged inside this story, that only grownups will understand.Definitely recommended for young AND old if you are into 90 minutes of charming and witty entertainment.",
    "70": "I love the new animated musical, Trolls Band Together. The movie delivers a lot of heart, along with showing the importance of family values, friendship, and love. Trolls Band Together had me out of my seat, dancing and singing along to all the songs.In the film, Poppy (Anna Kendrick) and Branch (Justin Timberlake) are now officially, finally, a couple. As they grow closer, Poppy discovers that Branch has a secret past. He was once part of her favorite boy band \"BroZone,\" with his four brothers. BroZone disbanded when Branch was still a baby, as did the family, and Branch has not seen his brothers since. When Branch's bro Floyd is kidnapped for his musical talents by a pair of pop-star villains, Velvet (Amy Schumer) and Veneer (Andrew Rannells), Branch and Poppy embark on a harrowing and emotional journey to reunite the brothers and rescue Floyd from a fate even worse than pop-culture obscurity.Trolls Band Together embraces the boy band era with so many references to everyone's favorite bands. The movie delivers a lot of heart, along with showing the importance of family values, friendship, and love. The entire movie is filled with humor, catchy cover songs, amazing animation, and lessons about family. Directed by Walt Dohm and Tim Heitz, the animation in this DreamWorks production is stunning -- all the vibrant colors throughout the movie are amazing. I was not able to take your eyes off the screen. All the music goes so well with the storyline in every scene. It features a new original song, \"Better Place,\" from Justin Timberlake's old boy band NSYNC. It was so fun to sing and dance along. The voice actors are terrific. Timberlake and Kendrick are joined by Zooey Deschanel, Christopher Mintz-Plasse, Icona Pop, Anderson Paak, Ron Funches, Kenan Thompson, Kunal Nayyar plus a handful of newcomers. They could not have picked a better group of actors to voice these characters. The script by Elizabeth Tippet is so smart, but my favorite part is all the songs and dances throughout the movie. Trolls movies have been a hit with viewers of all ages and this one is no different. I predict that everyone will be singing and dancing and loving every minute of this movie.The film's message is about family dynamics and how all family relationships are different. It shows viewers that no two families are the same and all families have their differences with each other, but they are still family. Be aware that it contains some rude and suggestive humor and some scary creatures like the Bergens and large spiders, plus the trolls are chased and eaten.I give Trolls Band Together 5 out of 5 stars and recommend it for ages 8 to 12, plus adults. You can watch Trolls Band Together in theaters on November 17, 2023. By Kennedy P., KIDS FIRST!",
    "71": "LIKES:The World Expansion:\n-Trolls is colorful, creative, and looks like a craft game that matches Poppy's scrap book at times.-The third installment brings fantastic evolution of that world, and I quite enjoyed watching the magic unfold as new worlds were explored.-An island filled with puppet like people, a new town of what looks like alien generation that is a new twist to the mix. They are all bound together by music of course, but once more they have style to each place.-And to have these new worlds come out and not just be about the Trolls, it's a nice little addition that offered more environments for the music to flow out.Voice Acting:\n-The cast is fine at accomplishing the task of bringing our Trolls' personality to the life with their personalities and spirits that make the Trolls so engaging and fun.-Timberlake's emotional scale gets a bit more plausible and expanded in this movie, but still holds that deep, internal hurt, brought about by logic and can still sing a tune.-Deschanel's involvement is fun, quirky, and like the first one, very great for delivering the jokes to which her character is loaded with. That wispy lisp works for innocent hiding of her jokes, and the sassiness of being passive-aggressive, quite honestly like New Girl.-Kendrick is the winner for me. She annoying and quirky, but she really works to accomplish the Poppy personality of positivity, peppiness, and at times hurt that I'm used to hearing. Plus, she can sing very well and harmonize so well with the other voices.-Special shout out to Kenan Thompson for making a wonderful joke relief delivery as Tiny Diamond. Cocky and annoying? Sure, but it works int his movie to cut through the other banters and often so stalwart that I just laughed a lot.-The chemistry between the actors is edited and naturally well, and I quite enjoyed how well they played off each other's energy and flow. An excellent achievement!The Animation:\n-It's smooth. It's fun. It just really flows with the antics all being fantasy and coordinated to accomplish a lot of that energetic fun.-The hair flows with their stylish, cartoony waves, and blowing in the wind. Trolls run cutely, and make me laugh as they try to charge into the fray. And even the odder moments hold a style that all is just a major testament to the powerful of CGI animation.-And of course the dancing numbers are the ones that hold the most splendor for this reviewer. They have fantastic choreography, amazing moves that mix in, and with villains songs... awesome interactions with the environment that feel like an 80s music video.-DreamWorks knows what they do with making things move and it was beautiful.The Comedy:\n-It's funny and cute at the same time, with the same Trolls magic that you love with the series.-I've mentioned before, but Bridget is a hoot for the adult comedy. Simple lines that adults pick up, while the kids will just laugh as she acts silly with her lovable Gristle.-When that interlude is not going on, Branch and Poppy are silly, their personalities resonating with me, and the banter annoying, but again loaded with jokes that many ages can enjoy.-Comedic timing with Tiny Diamond's word had me laughing the hardest, but the new characters have plenty of moments that again have many levels and are just fun for parents to enjoy, all while the kids laugh their heads off.The Music:\n-It's some of the best songs for me in terms of the theater spectacle, that 90s/2000s soundtrack list a perfect target for audience members like me.-While other songs had more heart and soul, and there was better selection in the previous installments, this movie is all about the splendor and pizazz.-The numbers are awesome, very light heavy, and what a fantastic spread of pop energy that feels at times like a concern number. And these numbers really make the movie just easy to get lost into.-I found that most of the targeted audience will want to hit theaters to see this one for enjoying it the most as the theaters explode with the bass dropping and synthesizer goodness.Just Fun\n-It's easy to say that I had fun with this film, and all these e likes come together to illustrate that.-Trolls 3 isn't trying to reinvent the wheel, it's just having fun and getting lost in the music, good vibes, and just charm this installment is bringing. I think this is the best part about this movie, though there are still limitations.DISLIKES:Annoying:\n-We can admit, the Trolls have annoying tendencies and sometimes this movie amplifies that.-Some banter gets way out of hand, prolonged too far and loaded with forced lines that are a bit cringe worthy after about thirty minutes.-Other times, some of the comedy is a stretch and the story tries to take quirks and make them a tad more hyperbolic than they probably needed to.-And of course, much of the comedy designed for kids often involves repeating the lines a bazillion times, but hey... you know that going into the theater.The Music Isn't As Storytelling/Diverse\n-There are a few songs that help break out of my genre, but they are few and far between and not nearly as executed well for the sake of the story.-The music feels more like a CD design than the true plot, and while it does not take away from the fun, it does take away from ingenuity some of the other songs had.-So in terms of ingenuity, or really having the most amazing original songs... you aren't finding it in this movie.The Story Is Weaker:\n-The movie has those moments that hit hard and really drive home that character growth that really hit me hard and made me smile.-But... the story as a whole is crammed, packed with so much, and not having the time to marinate or develop into the amazing tune.-Banding together might be silly fun, but the story, the impasse, and the obstacles are for the most part lame outside of the main antagonists. Meaning that the storytelling is just missing some connections that the first one did so well.-True, it is still fun, but to not have the fully fleshed out tale.. well... that is something a tad disappointing when they had done it better before.Most of your Classic Characters... gone\n-The movie is loaded again with a LOT of new characters, and most of them get adequate time on screen.-Most of your favorite trolls from the previous films though are gone. Practically making little appearances on screen to make way for the new toy models to come.-Is it the worst dislike? For me, no, but for others... you might want to just prepare you or your little ones for some glum of not seeing them.Too much in One Movie?-It might be fun, but the movie doesn't have the best storytelling avenues due to the fact that there is so much that they are trying to do.-The side story with the Bergels is razor thin, and seems heavily edited to fit the run time they wanted, only coming together near the end.-The antagonists have some bite, but outside of really poking at the modern stereotypes, they don't accomplish much in terms of having that connection and interesting qualities like Barb did.-Even the world exploring seems minimized, and the fact that we don't have more time to really dive, develop, and coordinate growth was further limited by this fast pace of entertainment.-So much with such a fast pace means that the movie just has this incomplete feeling, only lost in the moment to the fun factors and silly stuff that makes this ignorable.-Yet, had there been some more planning and maybe a little less character introduction, we would have accomplished this task.The VERDICT:\nI had a lot of fun at Trolls Band Together. It's a spectacle that is more due to the glamor, the songs, and the fun, than the actual story which means a great outing with friends and family. All the things that made it fun, well most of them, are here to just distract and have fun, without getting lost in all the agenda based writing that we have had for a bit. All of this is so fun, and getting lost in the jokes and the soundtrack is top game in terms of this style of movie that I feel will really make adults and kids laugh as they watch it. However, my fellow reviewers are right in that this movie is still lacking something that made the other two movies have that kick and heart that made their magic so loveable to begin with. Is it the character usage suffering? The music's execution feeling truncated and scratched? Too much humor? Or the story misses? It's really all of these things, too much stuck into one movie that made this not as complete or fleshed out like I wanted or expected. It needs a little more planning, a little more of that impasse, and a little more of that clever execution to assist with taking the beat to an 11 like the previous installments were. Still, for most, this movie is going to be fun and enough glamor that you'll get by and again deserves a trip to the theater to really embrace the best parts of this movie. My scores for the film are:Animation/Adventure/Comedy: 7.5\nMovie Overall: 6.0.",
    "72": "Another Perfect Watch. It was So entertaining from Start to Finish.Elements -1. 🤡 The Plotline was Great and More Importantly, the Adventure Feel that this film has to it makes it all the more Better.2.🎶 The Musical Numbers, were so entertaining. Literally all of them Musical parts were Great.3. 💐 The Animation, the Vibrancy of the Colours, the Texture of the Animated Objects and Characters were Spectacular to Look at, at times. Visually, it really Popped in multiple Scenes. Even the Troll Hair looked eye-catching.4. 🔮Every Single one of the Different Settings looked Great and one Particular \"World\" if you will, looked Beautiful. Again the animators Crafted such Beauty within this Film.5. 💬 The dialogue was Neat, some of the comedy worked and like with all Comedy, some things people find funny, others won't. People will laugh at different things.6. 🎨 The Characters were Solid, each of the 5 trolls had their distinct characteristics. And the 2 Female Trolls had a Beautiful Bonding 💕. The Baby Diamond (oh sorry), man troll had his moments 💍 🍼7. 💎 The Villain characters - I really liked the Villain Characters and the dynamic they had with eachother, it really Added to the Film. One being completely Unbearable, and the other being Unbearable too but had at least somewhat of a conscience. They both played their \"up themselves, snobby type role\" perfectly.8. 🏁 The Ending, again we're in that Gorgeous Realm and the Villains hit that Musical Number and then the Trolls hit theirs and the Spectacle Concludes with another Giant Visually Spectacular Bang. I loved that Ending 👍Overall, Just such a well made Film.",
    "73": "Opinion about «Trolls Band Together» (2023):Well, I'll start with the fact that in 2016 the first part of «Trolls» was released, and the same year I went to see it, and then I really liked this cartoon, although even now I think it is quite good.Four years later, the second part was released, I didn't manage to go to the cinema because then all the cinemas began to close due to the pandemic and I had to watch them at home.But the pandemic did not prevent me from enjoying the cartoon, and I liked the second part even more than the first.The announcement of the third part appeared in 2021, the same year I began to wait for this cartoon, and finally it came out in theaters and I was able to go to see it!And the third «Trolls» - is an excellent cartoon on the level of the second part.A kind, cute, interesting family cartoon for going to the cinema and watching with the whole family.The plot was simple, but it was pretty great, light, and interesting.The 92-minute running time was a pleasure.The jokes were funny and the characters were well developed.The graphics of the cartoon were nice and bright, the animation was excellent, the cool thing is that this part combined different styles in animation.The soundtrack of the cartoon is gorgeous! Of the songs that I really liked, I want to mention «Perfect», «Mount Rageous», as well as «Better Place».Also, I was pleased to hear the song «Sweet Dreams».Overall, «Trolls Band Together» - is a great, fun, 92-minute adventure that I'll happily repeat when it comes out in good quality.I think that the digital release will take place in mid-December or early January, because the cartoon will be released in US theaters only on November 17th.My rating is 9 out of 10 and I recommend watching this cartoon, and especially going and watching it in the cinema with the whole family.",
    "74": "IN A NUTSHELL:\nI think this is a cute franchise, so I was excited to see what they would do with this new sequel. The fact that both Anna Kendrick and Justin Timberlake were up for a third Trolls movie is evidence that they love this franchise too.The story is about Poppy who discovers that Branch was once in a boy band called \"BroZone\". When one of the brothers is kidnapped, Poppy and Branch embark on another adventure together to rescue him.The film was directed by Walt Dohrn. Writing credits go to Elizabeth Tippet and Thomas Dam.THINGS I LIKED:\nWe get to see all of our favorite characters, plus some new fun ones.The incredibly talented voice talents include Anna Kendrick, Justin Timberlake, Camila Cabello, Amy Schumer, Andrew Rannells, Daveed Diggs, Zooey Deschanel, Christopher Mintz-Plasse, RuPaul, Kenan Thompson, Kunal Nayyar, and so many more!Lots and lots of boy band jokes and puns.Tons of cute visual humor.Catchy music and entertaining musical numbers.The animation is very colorful and adorable. It also showcases a few different styles of animation design. It's so great at making you feel the felt and other fabric textures with your eyes.THINGS I DIDN'T LIKE:\nThe movie assumes you have seen the previous Trolls movies and know these characters' stories and relationships. If you haven't seen the first two films, you'll miss some of the character development.If you enjoy this Trolls franchise, this sequel will be a welcome addition. If you don't, you should probably skip this movie altogether because it's a lot more of the same.We have to wait 37 minutes for a full musical number. After that, the music is almost non-stop.TIPS FOR PARENTS:\nParents will appreciate the music, clever jokes, and well-presented values.A character asks someone if she's a \"Narc\". Kids probably won't know what that means.Because the movie was designed for kids, there are a lot of scenes that feature underwear.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "75": "I loved the film. I saw it in reald 3D and I was not disappointed.I remember seeing Trolls World Tour during quarantine but I didn't much like that one so I wasn't very excited for this one.I honestly think this one is my favorite from all of the Trolls movies.I really loved the animation. So great in 3D and just worth watching. I loved the new character besides trolls. I honestly don't even know what are the two brother and sister singers Velvet and Venner were.I just didn't like is that I realized that I think that Branch doesn't even tell his brother that their grandma died.Trolls Band Together definitely a solid great animated movie.",
    "76": "I've made it to this third movie of the series Trolls , at the cinema, with my two little cousins.It made them happy to be there, and the movie felt really wholesome with fun little moments.Personally, I have watched the first and the second movies and I liked them both. What made, this one, more special than the last two, was the moment in time it was released, for me, thus have been given a special conotation.Plus, little cousins felt really well, I've made it and bought them some safe souvenirs with Trolls, and those souvenirs were about little loving sisters, and them were in really close connection to Poppy and Viva themselves.Had a good time!8/10.",
    "77": "We recently enjoyed a family trip to the theater to watch Trolls Band Together (2023). The plot delves into Branch's backstory, exploring his family history that resurfaces in front of Queen Poppy. Feeling a sense of duty, he endeavors to reunite his family to save his brother's life, aiming to restore long-lost family bonds.Codirected by Walter Dohrn (Trolls 1 & 2) and Tim Heitz (from Trolls Holiday in Harmony), the film features the voices of Anna Kendrick (Pitch Perfect), Zooey Deschanel (The Happening), Justin Timberlake (The Social Network), Christopher Mintz-Plasse (Superbad), Amy Schumer (Trainwreck), and Kid Cudi (X).This installment stands out as my favorite in the Troll movie series. The animation maintains its stellar quality, combining new animation with occasional nods to 70s psychedelic aesthetics. The soundtrack is fantastic, and all characters, both good and bad, are entertaining and well written. While the storyline is simple, it perfectly suits the content.In conclusion, Trolls Band Together is a delightful animated gem, offering a fun and feel-good experience that's well worth watching. I'd give it a 7.5/10 and highly recommend it.",
    "78": "Trolls Band Together continues with the adventures of Poppy(Anna Kendrick), Branch(Justin Timberlake) & the rest of the gang, after the events of Trolls(2016) & Trolls World Tour(2020). Poppy finds out that Branch is a former member of the famous boy band 'BroZone', with his fellow brothers, Floyd(Troye Sivan), John Dory(Eric Andre), Spruce(Daveed Diggs) & Clay(Kid Cudi). When Floyd is kidnapped, Branch & Poppy make it their personal mission to bring the band back together & save Floyd.Trolls Band Together is a brilliant film. Director Walt Dohrn has given us a movie that will be an absolute delight for children & is perfectly good fun for adults, too. The comedic set pieces do elicit a couple of chuckles, here & there. The animation is breathtaking, further enhanced in 3D. The emotional moments are heartwarming. The songs are electrifying. The vocal performances are the highlight of the film. Anna Kendrick is spectacular as Poppy. Justin Timberlake is mind-blowing as Branch. Kenan Thompson is hysterical as Tiny Diamond. Zooey Deschanel is awesome as Bridget. Christopher Mintz-Plasse is great as King Gristle. Troye Sivan, Eric Andre, Daveed Diggs, Kid Cudi & Camila Cabello are phenomenal as Floyd, John Dory, Spruce, Clay & Viva, respectively. Andrew Rannells, Amy Schumer & Zosia Mamet are excellent as Veneer, Velvet & Crimp, respectively. The supporting cast is impressive. Trolls Band Together is a must watch for Trolls(2016) & Trolls World Tour(2020) fans. Watch it on the big screen with your entire family & have a whale of a time!",
    "79": "All three were great. This one I think is the best. I'm glad all the original cast stayed and completed all three.Took all three kids and get laughed and loved it. It's a Great trilogy without all the swearing and blood and violence.Cathy tunes. Fun for the whole family. I'm forty and even I was laughing thru out the whole movie. Comedy sadness love and jealousy. This is a roller coaster action packed adventure. Not one slow boring moment. And not too hyped up and wacky. Go. Enjoy yourself. I guarantee you'll laugh at least 10x.Good morals in the story, too.I give this 10 stars just because I know I'll be watching it again.",
    "80": "Dreamworks Animation is a hit or miss for me because they have made some really fantastic movies in the past but also some pretty bad ones as well. \"Trolls\" and \"Trolls World Tour\" are definitely animated movies targeted for the younger demographic and my younger siblings enjoy the movies. Which is why I was able to see this since I brought them to the theaters. I don't mind animated movies that are aimed for younger audiences as I have enjoyed those kinds of movies quite a few times but this one just doesn't work for me.Throughout, the animation style and models are pretty good as they are colorful, beautiful and have some great textures around them to provide the essence of the fantasy and troll appearances. The story is simple but unlike the previous Troll movies, I found it to be pretty boring and unspecial as the narrative doesn't really offer much and contains uninteresting characters. Even though I wasn't very big on the first Trolls movie, I found the story to at least be interesting but this one wasn't at all. The musical soundtrack, pop songs and singing were pretty obnoxious as some of the songwriting and signing is pretty bad. Feels like more of an album promotion than a movie.Most of the voice performances are a mixture of some pretty good and some kind of bad. Some of the performances like Justin Timberlake, Anna Kendrick, and Eric André are good but the rest of the voice performances felt lacking or annoying. As mentioned, none of the characters were really memorable which made it difficult to believe a single word from them since their dialogue is pretty clunky. The uses of humor are pretty inconsistent and the tone goes all over the place.It's clear that this movie is aimed for the younger demographic and my siblings enjoyed the movie which I am glad for them. It's good for young kids to have a good time and this one will entertain them. But for me, it was really boring. Just hoping Kung Fu Panda 4 isn't a disaster.",
    "81": "Well here we are.., another Trolls movie folks... as if DreamWorks' winning streak wasn't going to last, yeah.. so I went to watch Trolls: Band Together yesterday since I saw the first two trolls movies, also apparently the Trolls franchise is much bigger in the UK than anywhere else?, so this is why you're seeing a review of the film early if you live outside of Europe, bit strange really but anyways erm... the movie was... perfectly fine..It's exactly what you're expecting from a Trolls movie, bright colours, funky characters and jukebox music to keep the little ones awake?.., yeah Trolls is not exactly Puss in Boots: The Last Wish now is it?, it's really just a colourful distraction for kids and I think it's fine it's not made for me but it is the best of the three films which isn't saying too much, I'll start with what I liked.The animation is the best in all three movies, it's visually eye catching, it's creative and there are a few sequences that do use 2D animation and it's used well, there are some good laughs and some funny lines, the villains looked quite cool design wise, there's this hairy thingy that works for the villains called Crimp who is the best character in the movie and gets the best laughs with a unique design, good voice acting the soundtrack is pretty good and I enjoyed \"Better Place\" easily much better than \"Can't Stop the Feeling\" and that's it for positives, there's more good than bad so to speak.While it plays out just as expected and I did enjoy most of it, the opening song and even the climax felt like just a generic kids film using the familiar formula, it's not bad but since it flowed rather nicely and felt like a fun movie, just had a rather meh opening and meh climax, the two Bergens from the first movie Gristle and Bridget are in this a fair bit and a kind of unnecessary except they're getting married but even so, they're just a plot device, at least they scale back the other main characters which I am thankful for but still, could've done with them since we had enough new characters that worked fine.So yeah.. I think it's passable, definitely a improvement over the first two films but not by much really, it has the energy, creativity, fun and exciting catchy songs that work with some funny moments here and there, but at the end of the day, it's just playing it safe, not like Paw Patrol safe but mostly as to be expected, so... yeah, take the kids to see it they'll enjoy it more than anyone else, it's not made for me and I wouldn't say it's Puss in Boots 2 or Bad Guys, but this and Ruby Gillman proves that DreamWorks are going back to making basic kids films which is a shame, but hopefully they'll get back to making great stuff.I'm going to give Trolls: Band Together a 6.9/10.",
    "82": "The Trolls movies, despite being technically a bit of IP-mining, have managed to inject creativity into a seemingly dead-end idea. The series, now a full trilogy, is best when working itself up into a state of tuneful delirium, sending troll queen Poppy (Anna Kendrick) through deeply weird animated landscapes and smashing decades' worth of pop hits along the way. However, the movie opens with an obligatory pathos-laden flashback focusing on Poppy's glum boyfriend Branch (Justin Timberlake). The movie defers this gag until much later, instead filling out the BroZone ranks with Eric André, Troye Sivan, Daveed Diggs, and Kid Cudi. Years after their partnership dissolved, the brothers must reunite to rescue Sivan's Floyd from sibling pop stars Velvet (Amy Schumer) and Veneer (Andrew Rannells), who are sapping his talent to keep their careers afloat. Poppy, a BroZone superfan who had no idea Branch was in the band, is more enthused about this mission than her standoffish partner. DreamWorks' animated \"Trolls\" series is a charming and irresistible movie that is sure to be a hit with millennials. The movie is designed to connect with high school and college years, featuring in-jokes about boy bands and a mix of songs. It's sweet without being sugary, colorful, and charming, with excellent voice talent and a lot of music. It's the best of the three, making it a must-watch for parents and millennials alike. The movies cleverly use popular pop songs and colorful troll designs, with the title \"band\" having a double meaning. In the opening flashback, Branch and his brothers were members of a popular boy band called BroZone, a nod to Timberlake's time with *NSYNC. When their performance went wrong, the group broke up, and Branch and his brothers decided to go back streets. The film also references New Kids on the Block, Menudo, and New Edition, highlighting the transition from boys to men. The \"Trolls\" movies are a thrilling and entertaining story about Floyd, a troll who needs to be rescued. The music, featuring old favorites and new ones, teaches lessons about sibling closeness and accountability. The supporting characters, including Zosia Mamet as Velvet's abused assistant Crimp and Kenan Thompson as Tiny Diamond, add to the happy atmosphere. The movies also feature songs that feel like home, such as \"9 to 5,\" \"Push It,\" and \"We Are Family.\" The film follows several storylines, including the nuptials of Bridget and Gristle, and the unexpected appearance of Viva, who turns out to be Poppy's sister. Some characters from previous films have been dropped or made only token appearances, while new ones include Crimp, Velvet, and Veneer's assistant. The film features an endless series of musical numbers featuring old and new tunes, with an emphasis on the former. The pop earworms, performed energetically by trolls in high voices, include hits from various bands. However, the musical novelty has somewhat worn off, and nothing on the soundtrack matches the catchiness of \"Can't Stop the Feeling\" from the first film, including the ballyhooed \"Better Place,\" for which NSYNC reunited.",
    "83": "Despite the attempt of one reviewer to put it that way, this is not a message movie about self acceptance.It's an aggregation of disjointed storylines that barely have anything to do with each other - with some obviously added because they had to fill time. I actually get the sense that nobody was working off of a single story board, but rather were each working off of his or her own storyboard, hoping that at some point a grown-up would direct them to pull it all together into something that could be considered a narrative.This is not a narrative. It is disjointed, predictable, with humdrum dialogue, and with the only adult smiles, coming from completely inappropriate references, including one to wedding night bondage and domination.The kids in my life wanted to see Elf before this one. Once we saw this one, they wanted to see Elf again. We all needed a cleanse.",
    "84": "A film suffering from the syndrome of being a sequel for the sake of it. It's made up of saccharine set-pieces and musical numbers very loosely held together by an (almost) arbitrary plot. It is a mass-produced feeling animation with no real soul or conviction.It isn't cute, original, or entertaining in the way the first film was, and even my 4 year old daughter found a lot of it quite dull. A lot of the musical references point to 90s and early 2000s boy bands that completely miss the target audience on subject matter, and are painfully \"try hard\" on offering something to parents. The \"moral\" of the story is unclear also, without wishing to lay on any spoilers it's either an extremely crude jab at animal cruelty or plagiarism, or a lazy, generic \"family\" message. I am none the wiser.The big name cast is simply inoffensive, but without any prior knowledge you'd be hard-pressed to identify anyone. Again, unsure who they're trying to sell to with that but if a 4-year-old is unimpressed and their parents don't care then who is it for?Ultimately it's harmless fun and nothing more, and younger children will enjoy the songs and dancing for the 90 minutes they last. They'll probably have forgotten it all by the time they're back home, and parents will enjoy the nap.",
    "85": "Greetings again from the darkness. For the third film in the 'Trolls' franchise, much of the creative team is back at it. This includes co-directors Walt Dohrn and Tim Heitz, as well as screenwriter Elizabeth Tippet, who penned this story based on the original characters of Thomas Dam. It seems obvious that this has been developed for kids, yet it's always interesting to see how much effort the animation films put into entertaining the adults as well. And being the third film, expectations are naturally somewhat muted.We first see BroZone and their disastrous stage performance that leads to backstage arguing and a breakup. The band consists of Troll brothers, including Baby Branch, who inexplicably gets deserted when the older brothers insist on going their own way. Time passes and we catch up with (no longer Baby) Branch (Justin Timberlake). He's attending the wedding of friends when it's interrupted by his older brother John Dory (Eric Andre), who explains that brother Floyd (Troye Sivan) has been kidnapped. Through a twist of screenwriting, the only way Floyd can be rescued is by the brothers achieving \"perfect harmony\" ... their previous failed attempt caused the band's breakup.Joining the brothers on the trip is the eternally perky Poppy (voiced by Anna Kendrick), who has long desired a sister of her own (in one of the most obvious foreshadowing moments ever). We follow along on the journey as they reunite with BroZone brothers Spruce (Daveed Diggs) and Clay (Kid Cudi), and Poppy's big surprise of Viva (Camelo Caballo). Things get crazy when the group tracks down Floyd and finds his 'essence' is being stolen by the talentless, entitled, obnoxious siblings, Velvet (Amy Schumer) and Veneer (Anthony Rannells). This prefab brother-sister duo only wants to be famous and see no issue with stealing Floyd's talent.Some of the film's funniest moments are provided by Velvet and Veneer's assistant Crimp (Zosia Mamet) and Tiny Diamond (Kenan Thompson), the latter of whom absorbs quite a bit of energy from a mysterious pacifier that he offers to share. The film is so colorful, it at times looks like a package of Skittles exploded on the screen. Cute characters, love for brothers and sisters, lots of color, and funny characters are a great way to win over kids. As for parents, there is quite a bit of nostalgic music from the 90's and 00's, and enough Boy Band puns to keep everyone on their toes ... \"we're out of sync\".In theaters beginning November 17, 2023.",
    "86": "I did enjoy this film a lot, the Trolls series overall has been surprisingly entertaining. It's not destined to be recognised as a childhood classic, as I think Puss in Boots: The Last Wish one day will be, but it's very well made and consistently fun. With one exception, I was very impressed by the attention to detail - there's something to look at enjoy in every scene, it's a dazzle of action and colour, and the characters are beautifully realised and animated. The jokes are funny. I'm not much for boyband music but the occasional interweaving of more classic pop was very effective.The one exception is the story, which barely existed; also the bergen sub-plot held no interest at all, I think they only put it in because they needed a second strand from the main story, to cut away from it occasionally. The character arcs are quite perfunctory, you can tell it's all been mechanically worked out beforehand based on screenwriting theory and they didn't put the work in to smooth it out. The final set-piece, lacking a good story build-up, was underwhelming. No matter, with this film it's the journey, not the destination. And what a journey!",
    "87": "I have liked the other DreamWorks Trolls films, being Trolls (2016) and Trolls World Tour (2020), now it is at its third film in its little franchise; after watching it, I liked and enjoyed this third film as much as the other two movies. Trolls Band Together (2023) was another colorful, creative looking, funny musical journey with likable characters, a great voice cast, and catchy but well-known songs with a new song by reunited boyband *NSYNC that is very good; these three Trolls movies are not perfect animated films, but they are entertaining to watch along with kids being entertained and adults enjoying them when watching them with their kids.The voice actors are great in the movie; Branch, once again voiced by Justin Timberlake, finding his other two brothers to save his kidnapped brother Floyd, while reminiscing to when him and his brothers were a boy band named BroZone and separated for a mishap, and I thought that was interesting to know more about Branch's life and him trying to fix his relationship with his brothers while saving one of them and being funny throughout. Poppy, once again voiced by Anna Kendrick, joining Branch, John Dory, and Tiny Diamond on the quest to find the other brothers and save Floyd; other than finding out she has a secret twin sister, she is still likable like Branch, and I still like the relationship between Poppy and Branch. We have the return of Bridget and King Gristle, once again voiced by Zooey Deschanel and Christopher Mintz-Plasse, who are on their honeymoon the whole time until they somehow help the main characters in a way; though I like the characters, they were not necessary to the main plot of movie that much.Branch's brothers/members of BroZone were Floyd, John Dory, Spruce, and Clay voiced by Troye Sivan, Eric André, Daveed Diggs, and Kid Cudi who were all great in the movie with their voice acting; you understand why they broke up and the brother relationship between them and Branch, along with them working well together in the song numbers. Poppy's twin sister Viva voiced by Camila Cabello, who is particularly good in the movie, has the same energy and happy personality as Poppy with them having similar hobbies along with Viva living in an abandoned Bergen mini golf course with other Trolls and finding out about why she has not been with Poppy or her dad King Peppy for many years.The main villains in the movie are Velvet and Veneer voiced by Amy Schumer and Andrew Rannells, they live at a location that is ran by teenagers and their plan is taking the boy band BroZone and suck all their musical life force for themselves so they can sing better and fake being famous; though their plan is interesting, I would have liked more of a backstory for them, other than the little bit they give us. The animation is colorful, unique, pretty, and cool looking with lots of details put into the many locations they go to and the song numbers; other than the animation, the song numbers are nicely animated, catchy with the choice of songs, and the choreography for the dances in the movie was well done, along with the new song by the boy band *NSYNC being great to listen to.Like I have said before, the DreamWorks Trolls movies are not perfect, but they are colorful, entertaining, and enjoyable to watch with great voice acting, great animation, catchy songs, and likable characters. I liked Trolls Band Together (2023) as much as the other two films, and if you had a fun time with the earlier two movies, then you will have fun with this one.",
    "88": "I'll be fair; the music and visuals are decent but the actual plot of the movie is just painful.Visually:\nStunning, all the trolls look 'good' and move fluidly, the backgrounds are full of colors and surprisingly very well detailed (Troll town, a beach, some concert scenarios and a big city in the night)Sound:\nVery good too, the main attraction are the musicals which i thing were decent, mixing 90's songs with some of their own originals for the movie. (No back street boys in a boy band movie??! What a crime), can't complain about the voice actors they were all decent.Writing:\nFor me this is the worst part of this movie. The plot is about some trolls reuniting after years to save another troll that was kidnapped by a famous duo that is stealing the troll's talent for their own use.But how they plan to save him, how they reunite after years it's made in the dumbest way possible - not sure how they got 2 writers and none of them came up with a decent story to tie all together.",
    "89": "The Trolls movies, despite being technically a bit of IP-mining, have managed to inject creativity into a seemingly dead-end idea. The series, now a full trilogy, is best when working itself up into a state of tuneful delirium, sending troll queen Poppy (Anna Kendrick) through deeply weird animated landscapes and smashing decades' worth of pop hits along the way. However, the movie opens with an obligatory pathos-laden flashback focusing on Poppy's glum boyfriend Branch (Justin Timberlake). The movie defers this gag until much later, instead filling out the BroZone ranks with Eric André, Troye Sivan, Daveed Diggs, and Kid Cudi. Years after their partnership dissolved, the brothers must reunite to rescue Sivan's Floyd from sibling pop stars Velvet (Amy Schumer) and Veneer (Andrew Rannells), who are sapping his talent to keep their careers afloat. Poppy, a BroZone superfan who had no idea Branch was in the band, is more enthused about this mission than her standoffish partner. DreamWorks' animated \"Trolls\" series is a charming and irresistible movie that is sure to be a hit with millennials. The movie is designed to connect with high school and college years, featuring in-jokes about boy bands and a mix of songs. It's sweet without being sugary, colorful, and charming, with excellent voice talent and a lot of music. It's the best of the three, making it a must-watch for parents and millennials alike. The movies cleverly use popular pop songs and colorful troll designs, with the title \"band\" having a double meaning. In the opening flashback, Branch and his brothers were members of a popular boy band called BroZone, a nod to Timberlake's time with *NSYNC. When their performance went wrong, the group broke up, and Branch and his brothers decided to go back streets. The film also references New Kids on the Block, Menudo, and New Edition, highlighting the transition from boys to men. The \"Trolls\" movies are a thrilling and entertaining story about Floyd, a troll who needs to be rescued. The music, featuring old favorites and new ones, teaches lessons about sibling closeness and accountability. The supporting characters, including Zosia Mamet as Velvet's abused assistant Crimp and Kenan Thompson as Tiny Diamond, add to the happy atmosphere. The movies also feature songs that feel like home, such as \"9 to 5,\" \"Push It,\" and \"We Are Family.\" The film follows several storylines, including the nuptials of Bridget and Gristle, and the unexpected appearance of Viva, who turns out to be Poppy's sister. Some characters from previous films have been dropped or made only token appearances, while new ones include Crimp, Velvet, and Veneer's assistant. The film features an endless series of musical numbers featuring old and new tunes, with an emphasis on the former. The pop earworms, performed energetically by trolls in high voices, include hits from various bands. However, the musical novelty has somewhat worn off, and nothing on the soundtrack matches the catchiness of \"Can't Stop the Feeling\" from the first film, including the ballyhooed \"Better Place,\" for which NSYNC reunited.",
    "90": "Despite the attempt of one reviewer to put it that way, this is not a message movie about self acceptance.It's an aggregation of disjointed storylines that barely have anything to do with each other - with some obviously added because they had to fill time. I actually get the sense that nobody was working off of a single story board, but rather were each working off of his or her own storyboard, hoping that at some point a grown-up would direct them to pull it all together into something that could be considered a narrative.This is not a narrative. It is disjointed, predictable, with humdrum dialogue, and with the only adult smiles, coming from completely inappropriate references, including one to wedding night bondage and domination.The kids in my life wanted to see Elf before this one. Once we saw this one, they wanted to see Elf again. We all needed a cleanse.",
    "91": "A film suffering from the syndrome of being a sequel for the sake of it. It's made up of saccharine set-pieces and musical numbers very loosely held together by an (almost) arbitrary plot. It is a mass-produced feeling animation with no real soul or conviction.It isn't cute, original, or entertaining in the way the first film was, and even my 4 year old daughter found a lot of it quite dull. A lot of the musical references point to 90s and early 2000s boy bands that completely miss the target audience on subject matter, and are painfully \"try hard\" on offering something to parents. The \"moral\" of the story is unclear also, without wishing to lay on any spoilers it's either an extremely crude jab at animal cruelty or plagiarism, or a lazy, generic \"family\" message. I am none the wiser.The big name cast is simply inoffensive, but without any prior knowledge you'd be hard-pressed to identify anyone. Again, unsure who they're trying to sell to with that but if a 4-year-old is unimpressed and their parents don't care then who is it for?Ultimately it's harmless fun and nothing more, and younger children will enjoy the songs and dancing for the 90 minutes they last. They'll probably have forgotten it all by the time they're back home, and parents will enjoy the nap.",
    "92": "Greetings again from the darkness. For the third film in the 'Trolls' franchise, much of the creative team is back at it. This includes co-directors Walt Dohrn and Tim Heitz, as well as screenwriter Elizabeth Tippet, who penned this story based on the original characters of Thomas Dam. It seems obvious that this has been developed for kids, yet it's always interesting to see how much effort the animation films put into entertaining the adults as well. And being the third film, expectations are naturally somewhat muted.We first see BroZone and their disastrous stage performance that leads to backstage arguing and a breakup. The band consists of Troll brothers, including Baby Branch, who inexplicably gets deserted when the older brothers insist on going their own way. Time passes and we catch up with (no longer Baby) Branch (Justin Timberlake). He's attending the wedding of friends when it's interrupted by his older brother John Dory (Eric Andre), who explains that brother Floyd (Troye Sivan) has been kidnapped. Through a twist of screenwriting, the only way Floyd can be rescued is by the brothers achieving \"perfect harmony\" ... their previous failed attempt caused the band's breakup.Joining the brothers on the trip is the eternally perky Poppy (voiced by Anna Kendrick), who has long desired a sister of her own (in one of the most obvious foreshadowing moments ever). We follow along on the journey as they reunite with BroZone brothers Spruce (Daveed Diggs) and Clay (Kid Cudi), and Poppy's big surprise of Viva (Camelo Caballo). Things get crazy when the group tracks down Floyd and finds his 'essence' is being stolen by the talentless, entitled, obnoxious siblings, Velvet (Amy Schumer) and Veneer (Anthony Rannells). This prefab brother-sister duo only wants to be famous and see no issue with stealing Floyd's talent.Some of the film's funniest moments are provided by Velvet and Veneer's assistant Crimp (Zosia Mamet) and Tiny Diamond (Kenan Thompson), the latter of whom absorbs quite a bit of energy from a mysterious pacifier that he offers to share. The film is so colorful, it at times looks like a package of Skittles exploded on the screen. Cute characters, love for brothers and sisters, lots of color, and funny characters are a great way to win over kids. As for parents, there is quite a bit of nostalgic music from the 90's and 00's, and enough Boy Band puns to keep everyone on their toes ... \"we're out of sync\".In theaters beginning November 17, 2023.",
    "93": "I did enjoy this film a lot, the Trolls series overall has been surprisingly entertaining. It's not destined to be recognised as a childhood classic, as I think Puss in Boots: The Last Wish one day will be, but it's very well made and consistently fun. With one exception, I was very impressed by the attention to detail - there's something to look at enjoy in every scene, it's a dazzle of action and colour, and the characters are beautifully realised and animated. The jokes are funny. I'm not much for boyband music but the occasional interweaving of more classic pop was very effective.The one exception is the story, which barely existed; also the bergen sub-plot held no interest at all, I think they only put it in because they needed a second strand from the main story, to cut away from it occasionally. The character arcs are quite perfunctory, you can tell it's all been mechanically worked out beforehand based on screenwriting theory and they didn't put the work in to smooth it out. The final set-piece, lacking a good story build-up, was underwhelming. No matter, with this film it's the journey, not the destination. And what a journey!",
    "94": "I have liked the other DreamWorks Trolls films, being Trolls (2016) and Trolls World Tour (2020), now it is at its third film in its little franchise; after watching it, I liked and enjoyed this third film as much as the other two movies. Trolls Band Together (2023) was another colorful, creative looking, funny musical journey with likable characters, a great voice cast, and catchy but well-known songs with a new song by reunited boyband *NSYNC that is very good; these three Trolls movies are not perfect animated films, but they are entertaining to watch along with kids being entertained and adults enjoying them when watching them with their kids.The voice actors are great in the movie; Branch, once again voiced by Justin Timberlake, finding his other two brothers to save his kidnapped brother Floyd, while reminiscing to when him and his brothers were a boy band named BroZone and separated for a mishap, and I thought that was interesting to know more about Branch's life and him trying to fix his relationship with his brothers while saving one of them and being funny throughout. Poppy, once again voiced by Anna Kendrick, joining Branch, John Dory, and Tiny Diamond on the quest to find the other brothers and save Floyd; other than finding out she has a secret twin sister, she is still likable like Branch, and I still like the relationship between Poppy and Branch. We have the return of Bridget and King Gristle, once again voiced by Zooey Deschanel and Christopher Mintz-Plasse, who are on their honeymoon the whole time until they somehow help the main characters in a way; though I like the characters, they were not necessary to the main plot of movie that much.Branch's brothers/members of BroZone were Floyd, John Dory, Spruce, and Clay voiced by Troye Sivan, Eric André, Daveed Diggs, and Kid Cudi who were all great in the movie with their voice acting; you understand why they broke up and the brother relationship between them and Branch, along with them working well together in the song numbers. Poppy's twin sister Viva voiced by Camila Cabello, who is particularly good in the movie, has the same energy and happy personality as Poppy with them having similar hobbies along with Viva living in an abandoned Bergen mini golf course with other Trolls and finding out about why she has not been with Poppy or her dad King Peppy for many years.The main villains in the movie are Velvet and Veneer voiced by Amy Schumer and Andrew Rannells, they live at a location that is ran by teenagers and their plan is taking the boy band BroZone and suck all their musical life force for themselves so they can sing better and fake being famous; though their plan is interesting, I would have liked more of a backstory for them, other than the little bit they give us. The animation is colorful, unique, pretty, and cool looking with lots of details put into the many locations they go to and the song numbers; other than the animation, the song numbers are nicely animated, catchy with the choice of songs, and the choreography for the dances in the movie was well done, along with the new song by the boy band *NSYNC being great to listen to.Like I have said before, the DreamWorks Trolls movies are not perfect, but they are colorful, entertaining, and enjoyable to watch with great voice acting, great animation, catchy songs, and likable characters. I liked Trolls Band Together (2023) as much as the other two films, and if you had a fun time with the earlier two movies, then you will have fun with this one.",
    "95": "I'll be fair; the music and visuals are decent but the actual plot of the movie is just painful.Visually:\nStunning, all the trolls look 'good' and move fluidly, the backgrounds are full of colors and surprisingly very well detailed (Troll town, a beach, some concert scenarios and a big city in the night)Sound:\nVery good too, the main attraction are the musicals which i thing were decent, mixing 90's songs with some of their own originals for the movie. (No back street boys in a boy band movie??! What a crime), can't complain about the voice actors they were all decent.Writing:\nFor me this is the worst part of this movie. The plot is about some trolls reuniting after years to save another troll that was kidnapped by a famous duo that is stealing the troll's talent for their own use.But how they plan to save him, how they reunite after years it's made in the dumbest way possible - not sure how they got 2 writers and none of them came up with a decent story to tie all together.",
    "96": "Trolls - Band TogetherThis was a very good sequel as they developed Branch's backstory in a boy band. We just had one fun number after another and anyone who was a fan of the first movie with love this one.All our cartoon favourites were there with several new additions. The animation was top notch and it was really very funny.Like the first movie this was written for young children and no doubt their parents will sit with dread knowing they have to sit through another 1 and a half hours of Trolls lol!I'm giving this a firm 6 outta 10, for a great movie, it would have had a better mark if it hadn't been quite so 'nice\"!",
    "97": "The second movie added some more of the worldbuilding while trying not to mess up the story told in Trolls 1. World has expanded by new regions and new troll settlements, each having their own music genre.But in Trolls 3 we go beyond just Trolls (and Bergens) and go into some crazy new races... Puppet-like and uh.. whatever the main villains are. I am sure i've seen them in the popculture somewhere, but can't recall where. Either way they are ugly and creepy.Also I just dislike how story from Trolls 1 (and even Trolls 2 to some extend) been either ignored, or forcefully bent to fit Trolls 3.Trolls 1 had great songs. Trolls 2 songs were \"Fine\"... But in Trolls 3 songs, due to being boys band related, were just... bad. Maybe if i was teenage girl i'd appreciate them more.The final scene, the climax of the movie was flat. Extremaly, painfully, weakly flat. Trolls 1 had pretty good lowest point, Trolls 2 really made it even better.. I think whatever finale Trolls 3 had just didn't fit and felt fake.I don't regret watching Trolls 3, but I also hope Drewamworks will stop milking Trolls with more movies, because the writing suffers. First was great, second was good (with bits of jarring character personality changes), but Trolls 3 is just... meh.",
    "98": "This is Bing. I can help you write a template movie review for the film Trolls Band Together. Here is an example of how you can structure your review:---# Trolls Band Together: A Musical Adventure with Heart and HumorTrolls Band Together is the third installment in the animated Trolls franchise, and it might be the best one yet. The film follows Poppy (Anna Kendrick) and Branch (Justin Timberlake), who are now officially a couple, as they embark on a quest to reunite Branch's long-lost brothers and rescue one of them from a pair of evil pop stars. Along the way, they encounter new friends, old enemies, and a lot of catchy songs.The film's plot is simple but engaging, with enough twists and surprises to keep the audience entertained. The themes of family, friendship, and music are explored with warmth and humor, and the film delivers a positive message about not letting anyone steal your talent or your joy. The character development is also well-done, as we see Poppy and Branch grow closer and learn more about each other's pasts, while also meeting new characters who have their own personalities and arcs. The film's overall impact is uplifting and fun, with a satisfying conclusion that celebrates the power of love and music.The director, Walt Dohrn, does a great job of creating a colorful and vibrant world for the trolls, with a distinctive style that blends 2D and 3D animation. The film is visually stunning, with a lot of attention to detail and creativity. The musical sequences are especially impressive, with a variety of genres and styles that showcase the talents of the voice cast and the original songs. The performances of the actors are also excellent, with Kendrick and Timberlake leading the way with their charm and chemistry. The supporting cast is also stellar, with notable roles by Troye Sivan, Eric André, Daveed Diggs, Kid Cudi, Amy Schumer, and Andrew Rannells.The film's strengths are its music, its humor, and its heart. The film has a great soundtrack, with songs that are catchy, funny, and emotional. The film also has a lot of jokes and references that will appeal to both kids and adults, especially those who grew up in the '90s and are familiar with boy bands and pop culture. The film also has a lot of heart, with scenes that are touching and sincere, and characters that are likable and relatable. The film's weaknesses are few and minor, such as some clichés and stereotypes, some predictable moments, and some scenes that might be too scary or sad for younger children.Overall, Trolls Band Together is a delightful and enjoyable film that will make you laugh, sing, and feel good. It is worth recommending to anyone who likes animated films, musicals, or trolls. It is a film that will make you want to band together with your loved ones and celebrate life.",
    "99": "I took my nine year old son, and twelve year old daughter to this movie on a Friday night. We went to the late show, and had the theater to ourselves. My kids were really excited.My nine year old son quickly realized this is not a movie in which there is a strong story. The movie is more of a musical, with a song seemingly every 30 seconds. Gone are the days of the trolls action and adventure. Disappointing.This film introduces so many \"famous\" people (I assume, however researching the actors on IMDB and I'm not sure who 98% of them are) that you quickly get lost in who is who, and what story the film is trying to tell. So many characters were introduced, but were never fully explained or developed, which made the story hard to follow and comprehend.The film has two competing stories, well, three if you count the \"everyone finds their long lost family\" aspect. Too many competing themes, for any of them to shine through, again making the movie hard to comprehend.The most ridiculous thing of all? The characters say extremely inappropriate things for a film directed at children. At one point, one character says to the other \"I thought I was the only one getting tied up.\" There is gratuitous use of male genitalia and sex innuendos. CONTINUOUSLY repeated throughout the film.I'm blown away that the actors said some of these lines. How did they deem these appropriate for children? Did they not realize this is a CHILDREN'S film? I shouldn't be explaining to my nine year old son what a female means by being tied up. Absolutely abhorrent.I've never considered Hollywood to be any type of role model, for any person on the face of planet Earth, nor will I ever, however, it is still somehow shocking to me that they continue to PROVE that their society and industry has zero morals, standards, values, or respect.I never would waste the short time I have on Earth to write such a scathing review, but have not been this disappointed in a movie like this in quite some time. So, in short, this movie is NOT worth a single second of your attention, is absolutely NOT worthy of your hard earned dollars, and it is definitely NOT worth any potential moral erosion of your children's minds."
}