{
    "0": "There's not really anything bad I could say about this film. It's a new Sandler movie for Netflix and this time going into animated territory is a fresh idea that has paid off. Sandler voices Leo. A classroom pet lizard that's watced many kids come and go throughout the years and longs to get out of there. So when a substitute takes over and makes taking home the pet mandatory he makes it his mission to help the kids his watched. Also there is squirtal. A turtle voiced by Bill Barr that also adds some good comic relief. I thought the animation was great and designed well and the hillerious way the pre schoolers with the big eyed was done to. It was fun throughout and a great animated film, maybe even one of the netflixes best movies perhaps ever.",
    "1": "Ok so we got tricked .. In case you dident know its a musical!!!!!! We was bery very confused haha.. but it all turned out well. Somthing that was really nice. It was real to a degree about the kids. It also did not add any PC STUFF not needed unless it waa somthimlng small we missed. If you have seen the show Recess you will love how they show the littles. Everyone learns a lesson in the movie. It was not a sloe movoe and we was sad It was over. There are a few like always adult jokes but thats Adam for ya! It was still very family friendly . As a adult, i cried, laughed and cheered. I will ne rewatching this one for sure.",
    "2": "I paid to see it early today in theatres, and i have no regrets. If both Adam Sandler and Bill Burr are in a movie, go watch it right away. Those 2 guys are legendary comedic heavyweights. The theatre was not packed at all, and the movie was absolutley hilarious. Its kid friendly, but of course with these 2 guys running the show, you know theyre going to throw in some jokes that only us adults can appreciate. I would say that this movie is wayy better than the last movie i watched which was the latest hunger games film. I left that movie early. But this movie Leo, i stayed in my seat and didnt even pull out my phone to check the time.. not even once. I will definitely watch Leo again when they finally release it on netflix.",
    "3": "Great movie. Fun and entertaining for the whole family. Adults and kids both laughing. Wholesome! Best kids and family movie I have seen in years. Disney please take notes. I call movies like these Disney Destroyers. It delivered wholesome positive messages, that were not forced, but delivered comically. This movie was entertaining, funny, yet emotional and projected positivity towards kids. I loved that kids in movie were taught to reflect inward, face their issues and change. I love that political controversial topics were avoided, I love that political messages are not being force fed to me and my family.",
    "4": "Randomly saw this movie on Netflix and gave it a shot. Even as a children-family oriented movie, I liked it.Adam Sandler has been on a streak of featuring in movies were mostly okay or so so. Leo turned out to be better than expected with satisfying parameters.While most of the interactions were with children, the offered wisdom and guidance to help them was insightful. This movie is a good reminder everyone is going through their own struggles in life. People are not alone in their daily problems, everyone needs some help sooner than never.It was interesting to see some adult like references which were played out very well. This is a good movie, a nice watch on a relaxing day.",
    "5": "This movie was a fun watch: great animation quality, good writing, funny, sweet. I had no idea Adam Sandler's company can do animations, so this was a nice surprise. Great job.Adam's voice is a great fit for the wise advice-giving lizard. Generally the voice acting is great.The plot is great and full of funny moments and twists. I never felt bored, so I think that's a testament to great writing. The movie doesn't take itself too seriously but still manages to deliver a heartwarming fun experience.It's definitely worth a watch and I hope Happy Madison do more titles like this one, great start.",
    "6": "It's rare these days to find any movie without tons of propaganda, virtue signaling, innuendos, political or otherwise, and all the mess that goes along with programming made by morons. Well this one is just cute, lively and funny. Nothing inappropriate hidden under the guise of a children's movie. This one had heart and some really good life lessons. There was singing and talking animals so they're off to a good start. Illustrations were great, writing was on point as well. Good music and I'd say extremely relatable to many kids. It's just as much fun for the adults to watch, with that signature Adam Sandler humor, whit and song writing abilities haha. You can sit down these holidays with the WHOLE family and enjoy this movie. I'm glad I watched it and feel sure we'll watch it again.",
    "7": "I can't stop crying. This is such an awesome show. Even it's a kid's show, everyone should watch it. I am a coach and I listen to people and help them, I guess Leo reminded me why I am doing what I am doing. Such a heart-warming story with all the awesome details. I especially like when Leo talk with the escaped pet zoo animals: they are a bunch of brats because you don't know them. That speaks so true for everyone. If you really are willing to spend time to listen, to encourage and to help, everyone has so much to show. Awesome story, writing, music. There wasn't one second I was thinking \"eh stupid kid show.\" I highly recommend everyone watch it.",
    "8": "This movie is great for the whole family. It is relatable to kids and adults. The music may not be like some Disney movies, but each song is original, entertaining, and not overly drawn out or overdone. The movie tries to incorporate current topics, trends and technology. It incorporates multicultural, ethnic and generational aspects. It also brings to light many issues that may be sensitive to kids of all ages. This includes issues like bullying, class clowns, popularity, ADHD, where do babies come from, etc. The kid actors do a nice job, including the singing. The movie is a little long compared to many animated movies, but it's okay since the movie keeps you engaged from start to finish.",
    "9": "Anytime you have Adam Sandler involved in a movie...It's \"Worth The Watch\". This is a movie I imagine, I would've loved as a kid. It's a very simplistic story line with simple, dry-humor that'll make almost any kid laugh. This is film you'll be wanting to get the family together for on movie night. As usual, Sandler came with many friends and family members from last movies such as ( Bill Burr, Sadie Sandler(Daughter), Sunny Sandler(Daughter), Jackie Sandler(Wife), Jo Koy and Jason Alexander ). All in all, the animations were clean, the script was simple but well out together. This is a movie I will definitely re watch with a niece or nephew over time. Thank you for another classic Adam Sandler!",
    "10": "Way better than expected! As someone who's not typically an Adam Sandler fan, I went in with lower expectations, but I was impressed by the animation & jokes in the trailer. I like how they blended a heartwarming connection between an aging class pet and the elementary students in a package of a musical comedy. The story was a great mix of silly, sweet, and sappy. And the animation was top notch-so many scenes with a ton of characters which isn't as common for these movies so kudos for all that work! Also, the style choice for the kindergarteners was hilarious! I think this will get a lot of replays from kids, and parents will enjoy it the first couple times too! (One star off because my only critique was the substitute teacher's character arc wasn't my favorite, but that didn't take away from my overall impression.)",
    "11": "Sandler is the goat. For so many years his haters voices were loud and almost overwhelming, but the man persevered. You can still find their empty skeletons, just look at the critics who still try and tear him down on any review site for this movie.Leo is a top notch cartoon! One of the best in years (certainly better than what Disney and Pixar have been churning out). Entire family loved it. Animation style was well done, and balance of humour and life lessons were brilliant. Every kid should watch this show.Thank you Netflix for giving Adam Sandler a home. He's really thriving there and it is a pleasure to see! Go Sandman, your fans are with you to the end!",
    "12": "What a great movie!!! I'm 32 and watched with my niece (5) and mother who is in her 60's. We all enjoyed it thoroughly. Adam sandler really is the king of playing animated characters. Even bill burr did a great job. Between Leo getting to know the students and the students coming into their own was a great lesson for my little niece. Def a good heartwarming movie the entire family can enjoy! I would recommend this to anyone 3 and up. I almost wish it was a series so he could continue to hang out with new kids and see others stories. I haven't given out a 10 rating in my life but this is as solid of a 9 as they come! WATCH IT AND ENJOY!",
    "13": "The kids hit 10 years old... the age of reason for most children.Leo does a good job exploring mental health. Shows that best friends, adults and children alike can and do suffer from anxiousness, jealousy, enviousness, self-doubt etc. Best thing to do is discover who a person is, instead of judging them or blaming them for their insecurities or anxiety. Everyone has troubles. No one is special in this regard by being free from such things.Like all animations there are adult jokes in there - however Leo didn't go out of its way to hide them, which was an unusual execution.The animation was smooth, and bright, and expressive - however it suffered from its texturing. The objects, fabrics, skin etc., were all just smooth.In terms of story, there was very little action or adventure which is unusual for an animation. It spent more time dealing with character, and understanding each other. It was only in the third act that any tension or excitement was created through action/adventure. However, this doesn't mean it was boring, the story was enough to keep you interested.For me, Bill Burr's small parts and quips were the highlight of the film, this and its willingness to delve into mental health issues for children.",
    "14": "Adam Sandler. You either like the guy or don't. Here he lends his voice after Hotel Transylvania 3 as a lizard named Leo, a jaded 74-year-old who has been stuck in the same Florida classroom for decades with his turtle terrarium-mate named Squirtle(Bill Burr). When he learns that he only has one year left to live, he plans to escape to experience life on the outside, but instead gets caught up in his anxious students' problems--such as an impossibly mean substitute teacher(Rob Schneider). Will Leo escape?.Overall its an OK movie as there is alot of songs in it which is unmemorable. If your a fan of Adam's do check it out.",
    "15": "'Leo' (voiced by Adam Sandler) is a lizard living in an terrarium habitat in a grade school class room with his friend Squirtle (voiced by Bill Burr). After substitute teacher Ms. Malkin (voiced by Cecily Strong) tells the students they are to take one of the class pets home for the night, Leo accidently lets it slip that they can communicate with humans. What ensues thereafter is some much needed therapy, jealousy, and shenanigans - all from the whimsical mind of the Happy Madison production company.Decent flow and fairly amusing plot. The script is straight forward and doesn't leave a lot to interpretation. There are some adult humor jokes in the film, but they are tame in comparison to other Sandler films, like 'Eight Crazy Nights' (2002).Worth a watch!",
    "16": "Overall, I felt that the first half of Leo was much better than the second half, which suffered from poor pacing and loses steam. The musical numbers come out of nowhere and are deeply forgettable but the fun, silly humor (minus a few dirty jokes that went over kids' heads and felt shoehorned in) with which Leo interacts with the students is delightful. Even if you hate Sandler's comedic stylings (I don't), you will likely find yourself somewhat charmed by this septuagenarian lizard imparting wisdom to 5th graders. The substitute teacher's character arc is convulated and non-sensical, contributing to a final act that feel rushed at times, too slow at others, and wholly unsatisfying. But, to be clear, it is a fine move for what it seta out to be: a cute family film that delivers thoughtful lessons packaged in Sandler's classic style of humor. 6.8/10.",
    "17": "Adam Sandler may have helped write or produce it, and that worked, but the entire movie sounded like he was doing an impression of Nick Kroll from Big Mouth, nasally whiny and terrible. The few times he switched to his regular voice it was refreshing.The story and plot were good though, some funny moments, and aside from one unnecessarily crude joke from Bill Burr, it was funny enough.Don't get me wrong, love Bill Burr, love F is for Family, but the joke just didn't fit this movie at all. Especially considering it was the only one of it's kind in the entire movie. Had there been more like it, it would've fit in, but it was a standalone one off and fell flat in this setting.",
    "18": "So many references for adults to recognize, so many visual \"funnies\" for children to laugh at. The \"anti-musical\" musical numbers are well thought. It's obvious the musical aspect is kinda like Shrek with it's music, to be different from disney musicals. I am tired of Pixar's and Disney's too emotional animations. This one is more balanced.An elderly main character is bold. We normally get cute young people or animals as protagonists. Is different from what we always get. It doesn't quite follow the formulas of recent animations.Adam Sandler deserves some praise for this one. I'm not saying it's a classic, but it is absolutely entertaining.",
    "19": "The movie was good other then them singing every 5 minutes it was so annoying. And the songs that they would sing were just plain weird and were so random. Like for instance one of the kids were singing about their parents having menopause. Or the lizard singing to one of the kids to not cry because it makes them look dumb. Or the\nkid and the lizard singing about what to write to basically break up with a drone. Other then that it was an amazing animation. And I don't get why the kindergarten kids look like bobble heads but the kids and even the baby the teacher brought in looked like normal people.",
    "20": "I guess you are either love Adam Sandler comedy or hate them. I'm usually in the later but decided to give it a go. Surprisingly the worse thing weren't the lame jokes but the God awful singing. The jokes were OK, not brilliant but chuckle worthy, but who the hell thought to ad songs, bad songs by people who can't sing. The songs are terrible and unnecessary, and such a turn off I turned it off.The story is passable and Sandler ok as the lizard centre of the story. The funniest thing was the youngest kids at school, they made me laugh every time they were on but there is nothing that makes this stand out or be worth your time. Unless you like Adam Sandler comedies and really bad singing that is. No thanks from me.",
    "21": "I laughed continuously. I have a fifth grader and for us, this movie nails it. Adam Sandler, you are hilarious and this animated movie is so original and genius....make more please! It's honestly one of the best films you've ever made and the social commentary on today's kids and their families....the don't cry song...feels like I wrote it, but I didn't, Adam Sandler wrote it and I love it. The songs are so funny and not annoying like other kids movie songs. It's educational and very entertaining wish I had a school pet to talk to who would give me useful advice. Anyway that's my 600 words of thanks!",
    "22": "My daughters watched this and wanted to immediately watch it again the next night with me. They weren't wrong; Leo is a funny movie with great lessons to think about. This is probably my favorite kids movie of 2023 due to the quips of Sandler and Burr, the lessons Leo helps the kids learn throughout, and the song in the middle about not crying. The animation looks great, the representation of the substitute teacher and the Kindergarteners is really funny, and the various types of issues keep the scenes fresh. By that I mean that there are shy kids who need help, rich kids, etc. The variety is good to see.",
    "23": "Adam Sandler had made this cartoon about an reptile and an amphibian living in an glass cage in a schoo, and this is a mix of The Emperors New Groove meeting with Equestria Girls. On the way there are bullies, a runaway bus, litterary Birthday suits, songs and Adam Sandlers running streak of under the kilt jokes, mocking movie ballads and retro references too. The animation in Adam Sandler cartoons has come a long way since Hotel Transylvania. This is no dramatic Netflix movie just some silly fun for eveyrone, and it´s a shame this underdog was not a wide cinema release. But, this movie could get some Annie and Nick Awards in few months.",
    "24": "Awesome movie , fun , super funny and exciting with a great story. This film used every little detail the best way possible and gave most of the characters a really good backstory. Probably the best kids movie I've seen in a while , showing kids in a great way how to face some of the challenges it takes when u grow up and making them laugh through it. Keep doing this Adam.Awesome movie , fun , super funny and exciting with a great story. This film used every little detail the best way possible and gave most of the characters a really good backstory. Probably the best kids movie I've seen in a while , showing kids in a great way how to face some of the challenges it takes when u grow up and making them laugh through it. Keep doing this Adam.",
    "25": "So much better than we all thought. It's a silly animated musical with a lot of deep messages and humor. Not too childish, the whole family enjoyed this one. Probably one of the best netflix originals i've seen in a while. Would love a sequel for this. I wasn't bored at any point, perfect pacing. I liked most of the characters andxreleated a lot to their struggles and to the situations in the classroom. Lovely music also, there's a lot of singing and it's very varied and fun. This movie has a very unique concept and to put it from the point of view of the class pet Leo is a really good idea, it's fresh, it's new. Loved it.",
    "26": "As a 19 yr old I absolutely enjoyed this, so funny, the animation of the kindergardeners was so hilarious. Adam Sandler makes any movie good but the story was very original and entertaining. Very good family movie. I haven't seen a movie depict children like this before, spot on, feral gremlins running around. The part with the kid and the drone was so funny man who comes up with this stuff. Yall really put together the best of the best team to make this movie, adults and kids can enjoy it. The fact that I feel like there should be more when it was already an hour 30 just shows how good the movie was.",
    "27": "This movie has great animation, a good story with a message, and some awesome dialogues and voice acting. I thoroughly enjoyed my watch and there wasn't a single dull moment.Adam Sandler has outdone himself voice-over wise. The funny moments or 'action' scenes are very well done and will have you laughing out loud quite often. It is a musical but don't let that put you off the movie, the songs blend with the scenes well, and aren't so long that they become a drag.Highly recommend Leo for kids and adults because it will keep you engaged and you'll have lots of fun watching. It tackles various issues that kids face and Leo, the school pet, has some solutions for them.",
    "28": "RATED 8/10\nLanguage: English\nSource: Netflix\nRECOMMENDEDTailer made for kids and it clicked very well. Felt lengthy as a adult. First 10 minutes was bit boring and after that it picked up and goes on all right path. The movie is more on positive side and it makes more recommended for kids.Lot of advices to kids without much of preachy tone. The emotional moments and dialogs are quite good. At the same time it was entertaining as a animation.The only negative is that there could be more funny moments... Parents will love this and kids will enjoy this.Highly recommended to watch with kids on the weekend.",
    "29": "Adorable movie with good messages and thoroughly enjoyable. Lots and lots of kids on phones though, unsupervised in bed at 10pm at night watching shows in bed or texting each other. My kid is in 5th grade and I have no plans to let them have a cell phone anytime soon. I loved the rest of it, but for our family phones are for later, not 5th grade. Great ending, genuinely funny movie for tweens. We watched this after Adam Sandlers Bat Mitzvah movie, which was about a bunch of spoiled vain teenagers, this was refreshing in comparison. Oh and it's a musical, the music number were a cute suprise. Leo is a pretty cool dude.",
    "30": "I tried watching this but couldnt get through it. The humor is so bad. I cant stand that voice Adam Sandler makes. I havent watched a movie with Adam Sandler within the last 10-15 years that ive enjoyed. Theyre all so bad and the humor is so dumb that anyone with an IQ over 70 is gonna find it hard to enjoy.I cannot believe that some people gave this 7 or 8 stars. What movie were they watching? Surely it cannot be this. It reminds me of grown ups where they tried making a thing out of a \"burp, fart, sneeze\". I mean, who is gonna find that funny other than maybe a three year old? Holy smokes...",
    "31": "I have rarely watched an Adam Sandler movie, but there are at least some I have seen. And this is one of them, and this is surprisingly pretty good. Leo is an enjoyable film that shows a bit of the actor's improvement from his past movies. The story can be generic that supplies tropes we've seen in family films before such as the way Leo would talk to humans and convince kids to keep a secret to others. But the movie can be pretty heartfelt with the end thanks to the great character development with mainly Leo being very inspiring to the kids. Along with nice animation and the songs, well, each feel too short to consider this a musical, serve a decent purpose to the movie. I know we can be bothered from Adam Sandler's past films, so you'll probably won't miss much. But maybe at least once just to see if you can have some enjoyments from this one. I won't consider this the best Netflix has created, but for an Adam Sandler movie, it is quite an enjoyable film.",
    "32": "I was having a particularly rough day... until I stumbled upon this in my Netflix recommended. I just needed something to take my mind off of things and this did the trick! I've watched it at least 5 times and I catch small details every time!Leo is just the one old, wise, and funny uncle/aunt/grandparent that you always wish you had. Really impressed with how deep the overall message of the film while still being laugh out loud funny! It's so clear that a lot of thought was put into the film and I hope to see more animated films from Adam Sandler in the future! I loved 8 crazy nights, but to see that he can pull off a mostly family friendly film impresses me even more. I'm so glad I came across this movie, it mended my soul a little bit.",
    "33": "This looked like a cute idea for a movie and the previews looked fun. But the songs!! They're so stupid and unnecessary. Every time someone would start singing, I'd have to fight a strong urge to turn the channel. It's like they were made up and put in as they were recording the voices for the film.Also, what's with the rabid 1st graders? They don't even resemble humans. Adam Sandler's voice isn't as annoying as I thought it would be, but theres just so much crammed into this film, you're worn out by the end.There are definitely funny parts throughout the movie. If there weren't, it wouldn't be watchable.",
    "34": "...the drone/robot. The makers of the movie had such fun with it and I did too. I watched it alone as a 60-something Mom with grown kids so I have no idea if young kids would catch some of the more questionable content. I wonder if the youngest kids would find the alligators scary.Many have complained about the songs. I found them forgettable but not obnoxious though I was surprised by the one about \"don't cry\" (though in the end he took it back).Overall I think it was a good mix of valuable lessons for young kids and amusements for adults. I had to do a double-take about Sandler being Leo. For some reason while watching the movie I never thought it was Sandler, I assumed it was the other guy. Not sure what to make of that.",
    "35": "This movie had me laughing my head off the entire time! This movie has a great message for both kids and adults. Im not one to rate movies, i actually never have but knew i had to for Leo. You for sure have to see it, its awesome. Adam sandler never fails!Leo really helps kids understand that it's okay to feel some of the anxieties they may be feeling at their age. Squirtel is a hilarious character as well. Adam sandler really knows how to made a good kids movie! I hope they made a second movie!You for sure need to see this movie asap! Watched it right from home on netflix. What a must see!",
    "36": "Pretty solid movie in terms of production value, animation, voice acting, etc. There were even a few moments where they switched animation styles, which I know from working at a major animation studio likely earned cheers and applause during the company screening. Aside from being more-or-less the same premise as a movie that only bad-movie buffs will have seen, the writing isn't terrible and the dialogue is decent. There is a lot of physical comedy to appeal to the kids, and they sneak in a few jokes that only adults will understand. I would have liked slightly fewer musical numbers. I did not notice any political agendas being pushed, which is a breath of fresh air in this day and age. Overall, it's a fun movie that a family can enjoy together, but nothing groundbreaking.",
    "37": "Hey guys, so as of the time of me writing this, I just got down watching Leo and I gotta say it was good. I have a couple problems with it, but it has a good message about listening to others and opening up about your problems. Allow me to go more in detailFirst off, the characters. I felt like all the characters were pretty well written and all have their own character arcs, goals, etc., which is nice and makes them stand apart from one another. My only complain is that their names are extremely forgettable. In fact, I think they only said their names 3 or 4 times. The only characters' names I remember are Leo and Squirtle and nobody else.Second off the songs, I didn't really like them all that much. All the songs are extremely forgettable and just feel like generic pop songs made to boost soundtrack sales, and they don't really serve much to the plot. In most movies, they use singing to easily convey the character's emotions to the audience, but in here they're pretty much pointless since the characters already tell Leo they're emotions, removing all the point from the songs, so they're kind of just there, and what also doesn't work is that most of the characters don't have very good singing voices, especially Leo since his voice clearly was meant to be goofy, so he just sounds bad when singing.Now let's talk about the story. I felt the story was pretty good. It's a good story about living your life to the fullest and helping other's, but there's some pretty noticeable plot holes. One major problem is that they just pick and choose when the other kids can hear Leo and when they can't. For example, at the start of the movie, when Leo and Squirtle are ranting about the other kids in the classroom, nobody can hear them because they're inside their cage, even though Leo and Squirtle can still hear the teachers and kids talking through their side of the cage, so it's not like the cage is sound proof or anything, and then later on in the movie, when the kids confront Leo about him talking to other people, the kids can clearly hear Leo even though he's still inside his cage, and this isn't just some nitpick because this is clearly crucial to the plot, so I wish they ironed that part of the story out a bit.Alright finally the jokes... they're alright. There are couple jokes that got a smile out of me or maybe a chuckle, but that's about it. The only joke that made me laugh was the scene where the teacher sees all the kids faces as Leo, and i'm not even sure if that joke was intentional or not. This movie also has a couple pop culture jokes, like when the bus driver is singing \"whip nae nae\", even though this movie was clearly in development in the 2020s whereas that song was popular all the way back in 2015, i mean it didn't ruin the movie for me or anything, it was just kind of cringy. This movie also has a couple of.gross out jokes, which even though they aren't my thing, don't ruin the movie or anything since they go by pretty quickly but I just wasn't a fan of those jokes.And that is my review of Leo, overall a pretty solid film. It has a great message and some well written characters, but the music numbers and some problems with the story brings things down a bit. Overall, i'd give it a 6/10, thanks for reading!",
    "38": "I have had both a 5th grader and a Kindergartener and this movie was so funny. My kids and I were cackling with laughter at the hilariously accurate depictions of the giant textbooks, classroom rules and personalities of 5th grade. The kindergarteners were the best part honestly, I've never seen a more perfect example. So so funny. Leo himself was okay, but the students really stole the show. Adam Sandler is of course always great but there was a lot of unnecessary toilet humor and jokes that went over my kids heads that were clearly for adults. The movie does try a little too hard and the musical parts were cringey but overall pretty funny and enjoyable.",
    "39": "I watched ten minutes of this alone and knew it was exactly right for a family get-together on Black Friday. The kids loved it and the adults too!There is enough action to keep things moving along and the jokes are never abusive, but laugh-out-loud funny. I am 71 and related to Leo's fear of the clock running out but without feeling undone by that threat. I was not put off by stereotypical male/female/otherwise roles or by racial presentations.The classroom scene early on, as Leo and his buddy assess the incoming fifth grade class was inhabited by real life characters who fit cliché \"types\" but were so spot on I could not help laughing.",
    "40": "Free of any politics parents have to look out for now to protect our kids. Such a very wholesome story with realistic kid problems children can really learn from and relate to. The movie goes out of its way to teach kids adults who keep secrets from kids means those secrets should especially be told to their parents. Everything is well written and a enjoyable story. Adam Sandler should have been making kid movies years ago. His lack of care for what Hollywood pushes really shows. I was really impressed. Every scene is gold and will make you laugh till you cry. There's not much to be said other than stop reading right now and go watch it! Go!",
    "41": "I've heard many people say that Adam Sandler movies are bad, but let me assure you that this movie is actually very good! It may look strange at first but once you give it a watch, it is very inspiring! The characters are funny, and it has a slightly realistic feel when it comes to how kids feel. And it's overall just a cute movie, this is also a good kids movie since it will help them handle their problems and know that they aren't alone, if you didn't like Adam Sandler's other movies, this one is one of his best ones, Forget Disney's Wish and just watch this, it will leave you with a warm heart.",
    "42": "'Leo' was a fun time, but it had some issues. 40% of it could have been Deleted Scenes, it felt like an Extended Version of a much tighter, better-paced film. Quite a lot of time is dedicated to each of the side characters, one-on-one, one after the other in a very similar, formulaic fashion, and this absolutely could have been condensed. While 'Leo' was packed full of funny moments, many of the gags felt unnecesary or out of place. Bill Burr's performance, as well as Jason Alexander's and a few others were great, but our main character, voiced by Adam Sandler, seemed only so-so (He does a silly voice, and that's about it). I appreciated that they decided to make this a musical, but some of the songs were difficult to listen to, though most were tolerable. Overall, 'Leo' has plenty going for it, I just think it needed more time in the oven.",
    "43": "It's a musical... yeah, a freaking musical. Nowhere it says that this is a musical. I hate musicals with all my passion. Don't try to trick me.The animation is just pure meh, the jokes are awfully bad and basic, at the level of Adam Sandler jokes of course. I couldn't watch past that penis joke - that was such a bad taste that I couldn't keep watching that, it's truly awful.I can't express enough hate towards this movie and I can't even figure out why some of the people are giving it a 10. Do something better with your time and go watch really good animation, not this garbage.Again, awful.",
    "44": "Leo is a talking lizard who ends up helping the kids with life lessons. This animation seems very cheesy from the start but does grow on you. I'm not sure on the musical side of it, I feel it is kind of unnecessary however some of the lyrics in those small songs are rather funny. It isn't enough to put you off the film.As with most good animations, the film has a deeper meaning which comes to light near the end but Leo is quite a warming main character dealing with problems himself which keeps you attached. Overall a pretty good animation film with some good entertainment from the Adam Sandler style comedy. I wasn't sure what to expect but it was better than expected.",
    "45": "Loved watching together as a family. Very nice Movie. Appropriate for family with fun quotes and good dialogue. Perfect for 5th graders finish last year of elementary and going into middle school. May get selected to watch in school curriculum someday. All char9are perfectly made and with voice. Adam schandler has outdone himself with a nice voice and nicely produced movie. Kids kept laughing all the while. Some nice good history facts parts too to learn. Everglades looked funny with small gators but got the message out with the scene. Pubic schools have so much to offer. Must watch with family.",
    "46": "As a parent who heavily filters through content my children watch, this movie is refreshing. It seems like more and more children's movies contain curse words and/or agendas that kids don't need to see or think about. This movie doesn't contain any of those things which is so appreciated. There is some humor for the parents that kids will miss and some rude (ish) jokes like \"getting hit in the jellybeans.\" For our family, this is acceptable but for others it may not be. It is also a fun movie to watch as an adult if you enjoy Adam Sandler and Bill Burr in general. It's a worth while watch that teaches some life lessons as told by a lizard.",
    "47": "Other than that's good that the turtle is actually a tortoise people need to learn the difference.,It's a really good movie lots of laughs my children have wanted it 30 times since it's release a week ago and we love it,I have adhd and autism so the goof really annoys me Adam Sandler should of known better lol but as always Sandler delivers and bill bur is the percent addition to the Sandler verseSongs are not great, the animation is really good nice that it has modern stuff in like phones and spoiled brats really worth a watch Highley recommend well thought out film the hope there is a sequil.",
    "48": "I love Adam Sandler but this movie was a complete dissatisfaction!!!!It didn't make sense , the animation was all over the place, and the kindergarteners wide eyes and big teeth, like piranhas, you lose the meaning of the movie which is the only thing that makes sense.It could have been funny, talking animals giving advise , but between the singing, with bad lyrics and the off pitch vocals it's an absolute disaster.My kids and I were very disappointed, we hoped for a fun family movie, instead we had almost 2 hours of mindless singing drama.Sorry Sandler,we hope you do better next time.",
    "49": "I have been around since the start of Adam Sandlers career, SNL, the profane talking goat, all the way through Billy Madison to the water boy, Zohan, and now right up to Leo. This is by far one of my favourite movies, and my kids love it. It's funny, lighthearted and the musical aspect of it just adds to the comedy factor for me. Teaching kids to find a safe person to talk about their problems and fears is as good a message as ever for a kids movie. The songs are fun and catchy, the banter between Leo and Squirtle is giggle inducing and the facial expressions of Leo have made me fall in love with an animated lizard.",
    "50": "If you're looking for an hommage to Disney's most annoying sing along movies, this is the film to see.Also in line with current Disney porductions, it really forces one \"you're special and unique\" message after the other down your throat, and unnecessarily also with a lot of horrible songs. I really don't understand why the absolutely brilliant character of Leo and truly funny animations have to be wasted by such an awful need to be politically correct and an immense load of totally stupid songs. The trailer promised so much, but I had to abort halfway through, the constant singing for every tiny and even no reason is so annoying, I really couldn't take it.",
    "51": "I don't know why this infernal movie even exists. It is just pure pain to watch. The film is infested with product placement. It seems every other frame they are plugging some brand or another. When they aren't plugging some brand, the movie moves along at a snail's pace. They could cut 85% of it, and get the same story across. I don't need to care about some random kiddo's dead grandparent or whatever. What I need to know is what will happen. This film's plot is lacking. Calling it a \"plot\" is generous. There barely is one, and most of it can be summed up as the lizard guy helps some children. Nothing interesting happens for most of the film. It seems like this movie was simply a vessel to place advertisement in the minds of children. Don't waste your time. Watch something good.",
    "52": "This is a great movie, not perfect but very enjoyable. I have reptiles of my own and it was wonderful to see a children's movie put them in a positive light.The animation wasn't too bad and I especially love all the animal designs. I liked it much more than I thought I would, but the musical format takes a bit to get used to.Overall, this is a film that both parents and kids can have a good time with, it also makes a good film for kids nervous about growing up. It has many trademarks of Sandler films, whether you like that or not is subjective but it isn't as present as his other films. Give it a watch, at the very least you will have fun.",
    "53": "The movie actually has nice lessons for young kids without being heavy handed or preachy. I felt like the move was written with genuine care for their target audience. I watched it with my 6 and 4 year olds and they loved it.I was afraid it might be off-color in parts, but it's fairly tame. Only a couple of \"for the parents\" jokes sprinkled in, which is just as well since things do not go over these kid's heads like they used to.The only drawback I could think of is that the movie was set in an affluent neighborhood of (I think) Southern California, so you could contend that it was mostly \"rich people problems,\" but this wasn't a big deal for me.",
    "54": "I think because I'm a teacher, I laughed a lot during this movie or it could have been because of Adam Sanders humor or the adult hidden jokes. However, I think everyone would have enjoyed this movie. It's cute and it moves. The singing that I thought would be annoying wasn't because it didn't last that long for each song. It reminded of me the way Disney used to do their movies before they ruined them with too much singing. I always liked Adam Sandlers animated stories and this is another one holds up to his standards. I think if I watch it again I will probably see jokes I didn't before. So go watch it, you won't be disappointed!",
    "55": "My kids, boys aged 8 and 6, have not laughed so hard at a movie since.... I cant even remember the last time a movie had them laughing like this. The kind of little boy belly laughs that heal your soul. This movie was so cute and funny that I created an IMDB account just to leave a positive review. Seriously, make this your next family movie night. Its great for both the kids and adults. It is so sweet and cute and funny with the most precious lessons for children and adults. The characters are great, relatable, and memorable. You wont regret investing your time in this sweet coming of age adventure.",
    "56": "At its core, this film is a celebration of the profound connections that can form between individuals. The narrative unfolds as a poignant exploration of friendship, highlighting the highs and lows of human relationships. The characters are expertly developed, their struggles and triumphs portrayed with authenticity. Viewers will find themselves emotionally invested in the journey of these characters, rooting for their successes and empathizing with their challenges. The script is a testament to the power of storytelling, seamlessly blending humor, drama, and genuine moments of vulnerability. The chemistry between the cast members is palpable, elevating the film beyond a mere narrative into a heartfelt experience that resonates with the universal themes of camaraderie and loyalty.",
    "57": "This movie really shows that what kids do are all repercussions of what they live at their houses everyday until getting to be grown ups and what a little of love can do to change their whole lives to be better on whatever they do. It shows the power of love and friendships, bonding and creating a relationship with one you can trust to help you express your emotions about things that nobody knows.In my opinion, this movie is great for a family movie night, to feel a heartwarming experience, it is sweet loving and it even gets a tear on your cheek. If I had the opportunity to go watch it to a movie theater I would take it, just because you don't see this kind of movies anywhere anymore, I just feel it was great and would definitely watch it again.",
    "58": "I did not expect to love this movie as much as I did.My husband and I sat town to watch something and I suggested Leo as we love Bull burr.It totally took me by suprise. Some genuinely side splitting moments. The comedy is on point, the animation style is amazing and it's a real heart warmer.This blows any recent pixar move out of the water with it's refreshing take on a coming of age story, wrapped in a beautiful message about enjoying life while we can. Definitely worth a watch and deserving of all the positive reviews.I really hope this movie does well when award season comes around, it would be wonderful to see.",
    "59": "A movie nobody asked for by the least like-able people annoyingly \"sang\" at an indeterminable demographic that's either too young or too old to care about this disaster and its attempts at teaching lessons in between weird negging.It's painful to endure, and there's too much else to waste your time on this aimless, charmless, and toneless mess that tries to be a musical occasionally just because Adam Sandler seems to want to tell the same \"funny voice is joke\" that sucked 30 years ago.There is nothing here to salvage any of it or justify itself at all. Imagine the worst open mic comedians attempting to do sketch comedy to the worst children's book you've ever read, then imagine they kill your puppy. You're getting close to how bad it is.",
    "60": "I've been a fan of Adam Sandler since 51 dates. Bill Burr by far my favorite stand-up comedian was great in this combo comedian film with Adam Sandler. I also loved the fact that it was humorous for adults and kids. Other comedians and actors that I love were also in this movie, for example Jason Alexander. It's been a while since I watched an animated film but I'm glad I got to see this one as I was skeptical and held off for a few weeks. Finally I gave in and I wish I would've seen this weeks ago because I would've gone through this movie at least two or three times. Great for everyone whether you want yourself or with children.",
    "61": "Great film recommend for all ages. The adventures they get up to and the fun they have Adam Sandler is a lizard named Leo in this coming-of-age musical comedy about the last year of elementary school as seen through the eyes of a class pet. Watch all you want. Leo and the turtle are pretty judgemental at first as well and the jokes are humorous for adults and potentially older children but not younger ones. There is also a scene where Leo tells one of the girls crying is for babies and she shouldn't cry.. that was not okay. Adam Sandler stars in this clever coming-of-age comedy with the voices of Bill Burr, Cecily Strong, Jason Alexander and more.",
    "62": "I have never been more outraged at a movie. It has made me shake to the bone with anger. The husbandry for any of the animals in the whole movie is appalling, the regular abuse towards the animals is disgusting and the last thing reptiles of all animals need is to be treated as this movie shows because people think it's alright. Furthermore, the depiction of both reptiles are completely wrong in their size and the lizard being able to climb walls?? I will not be showing this to any children and I hope animal cruelty bites the bum of the writers. I am absolutely disgusted.As someone who rescues reptiles, it is movies like this that lead to the horrific injuries I see.The fact that the scenes of animal abuse is meant to be \"funny\" is devastating to think about!",
    "63": "I tried to sit down and watch this movie and was shocked and disgusted by how much animal cruelty is in it. Is this what we want to teach our children? That it's ok to house 2 completely different species in one tank that's the size of a shoe box? That it's ok to dye a cat another colour? It's appalling to see animals treated this way, especially reptiles that are already mistreated enough because of the lack of information given.To see that the main lead is repeatedly put into dangerous situations that ultimately lead to his tail being cut off, when a simple google will tell you that he can't grow this back easily is absolutely horrific.I can get past the singing and Adam Sandlers grating voice, but animal abuse is not humour and movies like this are why animal rescues (especially exotics) are overrun everyday.",
    "64": "To be quite honest, my 6 years old son made me write this. He wants a sequal very much, because -\"1. It's a great movie\n2. It is interesting alsoHe mostly likes the songs, but he loved everything. The main character, the lizard is great, does a great job, gives advises to kids at school, it was fantastic, good looking, the kids studied, there was no conflict in the movie, nobody lost nobody won, the kids had no names, at the end they saved the lizard from danger, dangerous animaks, crocodiles, but nothing happened to them,\nThere was a teacher and at the end end the teacher had a baby and anither teacher replaced her because she pension.\"That is all, I didn't understand why but he really wants a sequal. Thanks.",
    "65": "This poignant drama transcends the screen, touching the very core of human emotion. The characters are portrayed with raw honesty, navigating the complexities of life in a way that feels genuine and relatable. The performances are nothing short of exceptional, with actors bringing a depth of emotion to their roles that lingers in the minds of viewers long after the credits roll. The narrative unfolds with a delicate balance of heartache and triumph, exploring the highs and lows of the human experience. The film's ability to evoke empathy and reflection is a testament to its emotional resonance, making it a standout in the realm of dramatic storytelling.",
    "66": "The movie is all about nurturing kids feelings yet makes fun of kids with tree nut allergies. Kids are not going to go into anaphylactic shock and have their throats close up if they're not socially accepted. Suck it up buttercup. I thought bashing food allergies was done after the lame peter rabbit movie thought it was funny to feed someone an allergen. We might as well encourage kids to eat Tide packs again. Full disclosure, one of my kids has a severe tree nut allergy. Also, sitting through a full length movie with Adam Sandler doing his annoying voice was an exhausting feat. To be honest, there were a couple funny parts.",
    "67": "I really enjoyed this movie! I gave this movie a rating of 7 as I rated it for myself and my own preferences, if I were to rate this for kids, I'd give it a 9! I absolutely love Adam Sandler and Bill Burr, so I didn't need to know anything else to be sold on watching Leo. The movie itself does have some laughs for the adults and some laughs for reptile owners as well! For me, the rating is a little lower because of musical numbers, I wasn't expecting that and I'm not usually a big fan of musical numbers to begin with, but that's my personal preference. A good cozy watch that all ages can enjoy!",
    "68": "Due to life lessons, this film was made for kids and adults! This is a beautiful, heartening, and emotional (shed a few tears) animated film. This was a surprise. I did not know what to expect, but it was a gem! It kept me smiling throughout the whole film!! The kids in the movie and those watching at home learn important lessons about empathy and self-forgiveness from wise lizard Leo (Sandler) and his ability to lend a supportive ear. It was one of the best family films I've seen in a long time! The film can be summed up in one of its final lines: \"Find your Leo (a representation of meaningful listening, mixed with prudent advice) to listen to you.\" The \"Leos\" we should look for can connect and offer sound advice precisely because they are lovingly listening rather than dictating. I love a film with a positive message, which is why I resonated with the story! Bravo to Adam Sandler, who is a fantastic voice actor! The humor and songs were catchy and funny! The last movie I loved from Sandler was 50 First Dates, and afterward, I couldn't connect with his films until Leo! It's been a while since I praised Sandler, but this movie deserves that adoration!",
    "69": "Giving this an 8/10 ratingSaw preview in the cinema for this absurd and wonderful animation. It really must get a proper cinema release.Adam Sandler is Leo, an aged reptile stuck in rut with his turtle friend - Squirtle, voiced by a very laid back Bill Burr. Both are stuck in glass tank at the school watching life go by in the classroom, when a big change happens that leads the both of them, on a complete turn events.Each human kid and adult are profiled and transformed in quite hilarious ways, and the songs are not to be taken seriously as you will be laughing along with the visual gags that go with the flow.It looks all brilliant and the character designs work and not look dopey, which seems to be a trend these days, bad character design. Great musical numbers that are well staged are used just right. Adam Sandler is noted down as writer and producer, it's his company, after all. More like this please, Adam.",
    "70": "I love the movie Leo -it is funny and relatable. Leo is a coming-of-age story, seen through the eyes of a school's class pet, as much as it is a coming-to-terms with aging story.The story features Leonardo (Adam Sandler) and Squirtle (Bill Burr) who are quick witted, full of jokes and the best classroom pets ever. Leonardo, Leo for short, overhears a parent saying that lizards live up to 75; at age 74, Leo decides it is time to escape and live his life to the fullest. In comes strict \"old school\" substitute teacher Ms. Malkin (Cecily Strong) who wants to teach the 5th graders responsibility by taking turns to care for the classroom pets over the weekend. Each reluctant 5th grader who takes Leo home discovers his secret, along with wisdom about who they are and how they can better fit in the world. Every student returns Leo to the classroom and Squirtle is his biggest fan, boosting Leo's spirits and outlook on his caged life. When his secret is revealed, jealousy and distrust seeps in and Ms. Malkin, who feels the most threatened, takes Leo away.Each 5th grader experiences positive change after their time with Leo and, in return, Leo experiences living like he never has before. The animation is colorful and realistic, from the background scenery to the small details like how a caterpillar is depicted. Each of the actors who play the 5th graders fits their character from their personality to their hair and body type. I especially liked Summer (Sunny Sandler) with her fast-talking, super sweet kindness, as well as the overly \"great\" and popular Jayda (Sadie Sandler). The little balls of energy that represent the kindergarteners are on point. And from the overprotected, super-safe, drone-watched home of Eli (Roey Smigel) to the over-the -top, mega-great mansion of Jayda's family, it is easy to get a sense of each character from their surroundings. The musical element of Leo propels the characters into songs that tell of their struggles, hopes and dreams while moving the story along in a beautiful way. I like the opening song that expresses how the last year of elementary school is about being on top and the melancholy song toward the end of the film each 5th grader sings about when they were younger.While facing his mortality, Leo learns the important lesson that he has a lot of life experience to share. He is transformed from a grumpy old lizard with nothing to show for his 74 years to beloved friend and confidant who discovers he has many more years ahead of him. Another theme of Leo is in the significance of not underestimating yourself and the film delivers the message to live an authentic life by sharing your talents and being true.I give Leo 5 out of 5 stars and recommend it for ages 5 to 12, plus adults. Leo releases on Netflix November 21, 2023. By Madeleine H., KIDS FIRST!",
    "71": "Adam Sandler has, in particular, made two very smart decisions in his career. One was starring in Punch-Drunk Love and proving that he is secretly one of the finest actors of our time. The other was starring in Hotel Transylvania. By branching out into animation geared towards families, Sandler found a proper vehicle for his silliest abilities and doing so without alienating people with the kind of overly juvenile humor that plagued his comedy movies in the 2000's. He's back voicing an elderly and wise lizard in Leo. Folks, I mean this without a hint of irony when I say that Leo is very nearly the funniest movie of the year. I expected to like this movie, but I didn't expect to laugh as much as I did. Credit belongs to veteran SNL writer, Robert Smigel. Leo is filled to the brim with a Shrek 2-caliber of amazing sight gags. Plus, it has the funniest interpretation of kindergarteners that I've ever seen. As for Adam Sandler, he brings a level of warmth and goofiness to his character that felt like a loving tribute, both in style and tone, to the late, great, Gilbert Gottfried. No, this isn't a lame showcase of a new Sandler voice that will drive you mental by the 10-minute mark. Leo is a lovable protagonist. The cringey and forced musical numbers hold this thing back from being a pretty solid animated movie all around.",
    "72": "'Leo' is a film with a message. It cleverly introduces us to very different characters to convey powerful messages about different members of our society. Being an animated film and aimed at a young demographic, 'Leo' can almost serve as an educational video to youngsters - and they will be thoroughly entertained at the same time. In the process, they will learn about insecurity, vanity, and various misconceptions kids might have about life.Leo is a lizard, who has been living in captivity for 74 years. Erm, correction, he's been the class pet since 1949 and lives in a glass cabinet in a classroom, with his best friend Squirtle the turtle. With their beloved teacher going on maternity leave, the class now faces a strict, elderly substitute teacher, Mrs Malkin. In order to teach them responsibility, she suggests a pupil takes home one of the class pets for a weekend to care for them.And so the kids in turn take home Leo, who turns out to be a talking lizard. To each kid, Leo tells them they are the only one able to hear him, and in the process he has a profound impact on their lives as he gives them advise on their personal dilemmas. My favourite character was Eli, a kid with over-protective parents who has a drone to look after him. The drone itself was a delightful and funny character.With many scenes being very cartoonish and a bit silly, this film is definitely more for kids. Having said that, it is still a film adults will enjoy, too, and there are indeed many very funny moments. Towards the end it also becomes an action-packed adventure.The only thing I didn't like about the movie, was all the constant singing. Ever since the huge success of 'Frozen', so many animated movies since features musical segments. It's like found footage movies that overstayed its welcome. I get it, young kids like so sing or hum to a catchy melody when they watch cartoons, but I found it a little annoying. Oh, go on, call me a grump if you must...In general, 'Leo' is an enjoyable film, and yes, I definitely enjoyed it.",
    "73": "Just like his children's movies such as 'Bedtime Stories' or any from the 'Hotel Transylvania' franchise, Adam Sandler always brings a very endearing quality. His newest animated feature, 'Leo,' portrays a class pet who shares his wisdom of the last 75 years, living through the decades in his final years. Leo brings a dignified heart to the movie. As he opens up, he can talk to students in the classroom who take him home as an assignment, helping them work through their personal problems and struggles of growing up. It's this kind of endearment that Adam Sandler brings to his children's movies that I am such a sucker for. Of course, I love his raunchy comedies and more adult flex, but every time I see Adam Sandler pursue children-related content, he always leaves a deep, profound message for children to identify with and learn from. Also, this movie is quite musical, which I found surprising at times!Long story short, this is the perfect movie for any child to help them understand life's hardships growing up. It can seriously help children develop their own confidence in facing the struggles they may encounter in this day and age. As I stated before, I wish Adam Sandler would commit to making more children's movies because he really drives meaningful messages that many other children's movies don't often tackle enough. I give Adam Sandler credit for this movie. While it's aimed at a much younger audience, there are things even adults can learn from this movie's perspective if watched with a childlike sense of heart. Definitely go check this movie out with your kids! It'll be a fun watch with a lot of important life lessons about self-esteem and being comfortable with who you are!",
    "74": "\"Leo\" is a lizard who has lived with his tortoise pal \"Squirtle\" in a school classroom watching the kids come and go over the years. They've actually become quite adept at on-the-spot evaluations of them - the spoiled ones, rich ones, lonely ones etc., and are a bit tired and cynical. A chance conversation gives \"Leo\" a bit of an headache - he may be about to die of old age! He is determined not to end his days in this glass cage, and when a disciplinarian supply teacher (\"Ms. Malkin\") decides that each child has to take a pet home for the weekend, he sees an opportunity to abscond! Needless to say, his escape attempts are the stuff of slapstick, but instead he begins to bond with each child. He can talk! They can talk! He only talks to them, though - they are special...! \"Leo\" is their secret friend who actually turns out to be quite the social worker/therapist/motivator soon becoming a firm favourite - even if he is no nearer freedom. Can he get to the Everglades before he hits the terminal 75? This actually reminded me a little of \"Ron's Gone Wrong\" (2021) in that it uses animation - and quite a sarcastically observant script - to again draw our attention to just how children are increasingly \"un-parented\". Left to their own devices - quite literally - and dependent on constant peer validation (or domination). The characterisations of the human beings here are a bit extreme, but it does serve to illustrate quite well how a broad gamut of parenting skills results in a broad gamut of increasingly flawed and vulnerable small people. The ending involves quite a fun bus chase and some menacing crocodiles - but are they are terrifying as a fed up \"Ms. Malkin\"? It's worth a watch to see...",
    "75": "This movie has some great moments and is a great watch for young and old alike.Story Summary: And biology class type lizard and turtle are well on age and when Leo the Lizard finds out he has little time to live he wants to give back to the kids.Analysis:\nThe makers really tried to do something different here. And it comes through. The movie is lovely and even has quite of bit of action in there to keep viewers engaged.Dialogue & Music:\nIt can get a bit talkshowish at times, but being as wholesome the sweetness does fit the movie.Voice acting:\nNo stand outs, everyone is doing a great job.Visuals:\nAbsolute excellence the vibrant colors and characters as well as the scenes are fantastic.",
    "76": "We watched this with one of our kids. He was entertained and engaged through the entire run time, only pausing to ask questions about why people sometimes do things that aren't nice.The songs (I'm sure written by Sandler based on the occasional potty references) were unexpectedly sweet and funny. There are several references that are geared toward adults, but fly by so quickly that young ones won't notice.The protagonist is an iguana who, getting close to the end of his life, wants to be remembered by the last fifth grade class he believes he'll experience as the classroom pet.He impacts all of the students in unique ways, endearing himself to them and befuddling the substitute teacher who doesn't understand the connection between a lizard and her students.There are moments that slide into predictable slapstick, and zingers directed at bad-parent stereotypes that don't contribute to the overall story, but provide some grownup laughs (mostly).There's also the occasional Sandler humor that threatens to cross the line, because...Sandler.But overall I recommend it. Our boy asked good questions that we were happy to address.No social justice or identity politics to confuse what is, at its center, a kids movie.Well done.",
    "77": "Adam Sandler has always had an undeniable talent for comedy and while Happy Madison has produced good and bad films, what they all have in common is that they always leave a smile on the viewer's face. Leo is an animated comedy with musical numbers that manages to fulfill its goal of being a very enjoyable children's film. There are some hidden mature jokes, but that doesn't stop it from being a film that can be enjoyed as a family. The story of this movie is not only fun, but it also leaves a couple of life lessons. The lizard who stars in this story only wants to spend the last moments of his life doing what he never did in his youth, but ends up becoming a counselor for the children with whom he forms a relationship. He is a creature who has lived a long time and becomes the equivalent of the wise old man who advises the younger ones so that they can face life. Leo finds his purpose to be to inspire others. Adam Sandler's voice gives a certain level of personality to Leo, making him reflect Sandler's humor. The animation has the collaboration of Animal Logic who had previously done excellent work with the Happy Feet saga. The result is a great film that can be enjoyed for its animation and comedy. Leo is a great animated comedy and a great children's work by Adam Sandler that takes its place alongside Hotel Transylvania. My rating for this movie is a 10/10.",
    "78": "Leo didn't need to be a musical and the songs are definitely the weakest part however, the humour and heart of it all means it remains a really good animated movie. Focusing on mortality and how life at any age can be stressful means it has a strong core, plus having 2 great comedians leading it means the gag rate is really solid.Adam Sandler is great as Leo, the high pitched voice he imbues the character with could've easily become annoying yet remains endearing instead. Bill Burr isn't really acting here, this is his usual shtick with no major changes and that works perfectly, bringing a level of grumpiness that is 100% him and very funny.Robert Smigel, Robert Marianetti and David Watchenheim craft a film with a colourful if basic animation style, thankfully still interspersed with some fantastical flourishes. The other standout aspect is the character designs themselves with Leo looking so adorable and feral preschoolers being a real highlight.",
    "79": "Last month this year, one of the biggest animated surprises came out in the form of an animated musical comedy on Netflix called Leo. Brought to us by Adam Sandler and friends, this marks the second feature length animated movie produced by Happy Madison Productions following the infamous Chanukkah related Eight Crazy Nights from 2002. Unlike that film however, this feature has garnered largely favorable reviews from critics and audiences and has also been regarded as proof that Sandler has grown better in recent years. So what makes this out of nowhere gem so charming in the first place?Set in Fort Myers, Florida, the film tells the story of a tuatara named Leo who longs for an exciting life beyond his elementary school upbringing. Upon becoming worried about possibly dying soon, his life takes a turn for the better when different students get to look after him. It should go without saying that the story is about impacting the lives of others, especially given the context of Leo realizing he has not done much in his old age. Considering that the children Leo guides are fifth graders who are worried about growing up, there is a surprising amount of endearment layered throughout this feature. While the plot does follow the typical liar revealed formula you'd expect from your average family film, the message of keeping someone close that you can trust ultimately makes the film as heartwarming as it is funny. And as far as the humor goes, the film is sprinkled with numerous gags that are aided by Leo's bonds with the kids, the animation, modern social culture and humorous voice acting. Sometimes, all you need to make an ordinary plot stand out is some engaging heart.Now given Adam Sandler voices Leo himself, he actually does a good job portraying the character's cynicism while still emphasizing his heart of gold. As the character's heart speaks louder than his words, the film succeeds in making him grow as a genuinely caring aid to the kids' insecurities. In addition, Bill Burr portrays Leo's pal Squirtle with wisecracking pessimism, and the duo's chemistry could be the highlight of the film's verbal humor. In regards to the students, they represent tropes you would expect in any classroom setting, including the popular girl, the talkative nerd, the obnoxious bully, the class clown, etc. In balancing out all of the different kids through Leo's guiding wisdom, the students all become appealing through acknowledging their flaws and growing as a result. As for the disciplinary substitute teacher Ms. Malkin, her role as the adult with real issues is both intimidating and problematic, especially when she acts like an antagonist because the film feels like it needs one. In embracing familiar archetypes, the characters all prove they have the chance to change for the better.Going into the filmmaking, the animation team at Animal Logic put in a lot of fun visuals and art direction into Leo. Although the character and background designs don't stick out much conceptually due to the cast being comprised of ordinary people and talking animals, not to mention how the film's school setting can get routine pretty fast, the execution of the animation succeeds in delivering some fun slapstick, facial expressions and over the top visual gags. In addition to the animators putting a lot of personality in Leo and Squirtle in spite of their animalistic proportions, the humans work in a pseudo realistic yet cartoony flair to help all species blend well within the film's universe. Kudos must be given to some additional moments of 2D animation to illustrate some fantasy moments and spice up some musical numbers. Maybe the film's rendering doesn't look as polished as the actual animation, but the lighting and layouts keep it from sticking out like a sore thumb. Maybe people will remember the humor and characters more than the animation, but it did its job well enough.Finally, it's time to praise the songs written by the film's co-writer and co-director, Robert Smigel. As Smigel's background in SNL and puppetry influenced the soundtrack, the musical numbers are executed in a self aware mode where they pop up without the need of a real song & dance showstopper. In a way, it's debatable if Smigel and the team behind Leo wanted to fully commit to putting on a musical and only felt like doing so to add into the comedy. That being said, the lyrics and visual gags are quite humorous on their own, especially when establishing the school setting and how the kids feel about facing the inevitability of growing up. Perhaps the best numbers come up when Leo shares his wisdom to the kids thanks to his charming anecdotes and witty singing. Along with Geogg Zanelli's complimentary upbeat score, the musical numbers in Leo might be the closest an animated family film has come to feeling like a children's show as opposed to an elaborate stage show. Maybe the film wouldn't have been quite as special without these extra contributions after all.With an undeniably heartfelt message, charming characters, witty humor and committed talent involved, Leo is one of the biggest surprises in Netflix's recent animation output and Adam Sandler's career yet. Unless you're plain sick of Happy Madison and modern animated family fare, this film is worth checking out at least once for the humor and heart alone. It really is saying something when a film about a lizard who gives good advice to children has shown to be one of the better received animated films this year compared to the competition. There is as much to feel enlightened as there is to laugh at.",
    "80": "\"Leo\" stands out as an animated gem, boasting exceptional animation that brings the story to life in a visually stunning way. The comedic elements are skillfully executed, contributing to the film's overall entertainment value and ensuring that audiences of all ages can find joy in the humor.One of the unique aspects of \"Leo\" is its departure from conventional storytelling by eschewing traditional villains. Instead, the narrative revolves around characters grappling with their insecurities and making mistakes-a refreshing departure that adds authenticity and relatability to the plot. This choice allows the audience to connect more deeply with the characters, as they navigate challenges that mirror real-life struggles.The film's recommendation stems from its ability to offer a meaningful and enjoyable experience. Whether you're drawn to the impressive animation, the well-timed humor, or the nuanced exploration of characters, \"Leo\" delivers a cinematic treat that is both entertaining and thought-provoking.",
    "81": "Leo (Adam Sandler) is a lizard. Along with Squirtle (Bill Burr) the turtle, they are the class pets in a Florida Elementary School. A new group of students is starting another year. For Leo and Squirtle, it is another year, new kids, and they get new names. Animals can speak, but they never reveal that fact to the humans. Leo comes to realize that he's at least 74 years old. His dream of escaping into the Florida glades is fading away. When a grumpy old substitute teacher takes over, she reinstates the old practice of a student taking the class pet home for the weekend. Leo accidentally reveals to a student that he can talk. He starts doing that for each different student and giving them good advice.This is animated. It's good, not great. I like the concept. I would zero in on the animals as the leads right from the start. I feel like there should be an explanation on why no animals had ever talked to a human. It's a given in the movie, but it needs something. It may even be a funny historical montage. I like Sandler in this. He's a lizard and not being Sandler. I like the kids. I find most of this very enjoyable.",
    "82": "For once a movie about 5 graders isn't a black and white story about the popular kid vs the nerd. At the center is an old lizard, not grumpy and sad, but sweet and funny. His side-kick is a turtle (aptly named Squirtle) and they've been in the same 5-grade classroom since the 1940s.Leo has a rude awakening when one of the fathers explains their child that iguanas live 75 years. Leo thinks he only has one year left and decides to start talking to the children, give them advice and listen to their deepest thoughts. He's really good at this job. So good, that this 5-grade class reaches the top of their game. But, some complications are on the way.The movie is genuinely funny. We all laughed , kids and adults. It is not an easy black and white moralistic story, but depicts actual situations that kids may experience IRL. Leo gives advice the way your grandpa would, caring, authentic and useful. Also, as opposed to every Disney movie, nobody dies.Refreshing and worth your time!",
    "83": "Adam Sandler is hit or miss for me as I have enjoyed both of his dramatic works and some of his comedic works. Even some that are pretty bad, I still enjoyed them as dumb fun entertainment for giggle. But Leo was less funny but more annoying.This is one of the most unbearable animated movies I have seen. Throughout, the animation has good models and designs but the structures and colors made it look cheap and some clunky movements. The narrative is based around the school pet and the classroom settings and this could be a fun concept if well-written, but unfortunately, the narrative doesn't do much and made the concept feel more boring and less creativity for children to fully engage with.The voice performances are really not great. There are a few good performances like from Bill Burr and Jason Alexander but the rest of the voice performances were pretty bad. Sandler's voice performance surprisingly was pretty bad and Sandler has done a good job with his voice performance in the Hotel Transylvania installments but here, his voice was awful and got on my nerves. Many of the characters were annoying as none of the characters had much charm. The musical singing moments are generally pretty bad as the sound mixing and some of the vocal effects felt off, as if it sounded like it went through an AI machine.The pacing is a bit off and the direction was fine. Clearly this movie is aimed for young children and I can see young children enjoying this movie. But as a whole, it's just another dull and lifeless animated movie that doesn't offer much.",
    "84": "'Leo (2023)' opens with a song and you think \"I bet this is one of those movies where there's one song at the start and that's it\" and then another song happens and it's really jarring and the realisation that it's an actual musical starts to set in and then another song happens and it's really jarring and you're always expecting the songs to get cut off in some sort of meta, self-aware subversion but they just don't and then another song happens and it's really jarring and you wonder how each song can still be surprising when it's been well established this is a musical musical and then another song happens and it's really jarring and you wish everyone would just stop singing because they're barely carrying a tune and then another song happens and it's really jarring and the whole thing just feels half-baked and bizarre and then another song happens and it's really jarring and you'd have thought you'd have learnt by now but your butt still clenches up each time they start to sing and then another song happens and it's really jarring and then it finally ends. It's just a really weird, undercooked experience that's a little more than nothing but a little less than something. It has a few moments of enjoyable animation and it gets better as it moves into its final third (although they may just be because it's beaten you into submission by that point), but it's totally uninspired and generic and lifeless and actually really strange. Although it has some genuinely important messaging, it's not good. It's not good at all.",
    "85": "It's the story about LEO a 74yr old lizard who has spent his entire life living in a fifth-grade classroom as the class pet when after talking with his aquarium mate Squirtle the Turtle (voiced by Bill Burr) he decides that he's had enough of just lounging around and it's time to try and escape his life and live a little.Soon after the new school year starts, the kids are each tasked with taking one of the class pets home for the weekend and it's here that LEO plans to make his escape. Accidentally, Leo reveals to his first host that he can talk and while chatting with her, he gives her a life lesson that he learned during his 74yrs of observing people. Eventually, other kids learn of Leo's ability to speak and he quickly becomes the class favorite.Each child who takes him home tells him about some of their personal struggles and he gives them advice as a sort of class therapist or life coach. Many of these lessons are told through song and dance and at first, I have to say I wasn't sure I was into it. I'm not really one who enjoys musicals but not only did I find them to be rather catchy, but they all included really funny but also great lessons that I think perhaps everyone should pay better attention to.I honestly wouldn't be terribly surprised if one of the songs garnered an Oscar nomination.The animation is really pretty and the performances from all the actors were a real treat. Of note, LEO is the second time this year that Sandler made a film that ended up being a family affair as his daughters and wife also had roles. Burr and Sandler were a great tandem as Squirtle and Leo I'd love to see these 2 comedic juggernauts together in a feature film.LEO was a really fun movie that I think stands among the best-animated features that 2023 has to offer. Kids and adults alike will surely fall in love with LEO the same way my family did.",
    "86": "I direly needed to see a good movie in these times, and boy I was not disappointed : it was not good, but great !The first third of the movie is very funny for an adult, with a lot of movie references and silly things that kids can't catch : I hadn't laughed like that for a while.Overall, the movie is well paced except for a little slowdown around the middle. The animation does the job : it's well done.It's full of funny, nice & sweet ideas, and even if it's not groundbreaking or very original, the whole thing comes as fresh enough for an old timer as myself.The main theme is that it's hard to grow up when we're kids in the last year of elementary school, right before jumping to the junior school.However, for my 4-year old son it was a bit too evolved and he just mildly enjoyed the movie.Even for my 7-year old son it was still a bit too much, but he enjoyed it. However, it made him a bit sad : he realized that life can be harder when growing up, and that he might have some of his best time right now.I'm still glad he saw this movie though, because it taught him it's very important to find someone worthy of his trust to listen to his issues and help him find solutions (hopefully, it'll be me !).All in all, it's a great movie that pack fun and have a very positive & important message for kids.",
    "87": "Surprising, refreshing writing for an animated film way above a kids head, but a musical with messages many parents need to hear, or be reminded of.Adam Sandler is processing leaving his legacy and this movie encapsulates his advice to the newly parenting millennial and genX generations.Humorous, good comedic timing, and Sandlerisms keep it well-paced and light but enough truisms and \"innocence\" from Leo make it predictable.Some lines and depictions are finger snapping others are a bit too zany.Sandler's characterized voice is usually annoying but actually fitting for a pitiable aged lizard giving advice to 10 year olds.Watch for \"tough love\" views and takes compared to the unstomachable Disney vapid and played out scripting and statements.",
    "88": "Not sure why the reviews are overwhelmingly positive on this film, it's awful.Ok so it's a cartoon for kids I know, but it's based on a lazy trope, probably dreamt up by Sandler himself who hasn't had a good idea since Happy Gilmore. A talking lizard helps kids come to terms with their weaknesses or issues, but tells each one he only talks to them so when they find out they're incredibly upset yada yada. Then an evil teacher...this is too boring to even recount. It's such an obvious storyline, has been done loads before in various ways and the lizard himself (voiced by Sandler) comes across as obnoxious as the man himself. No surprise there.This isn't the warm cuddly film it's meant to be, and comes across as trite and idiotic. Like issues children have (being a bully, being insecure) can be resolved by one evening of listening to a preachy lizard who then sings a song telling you to shut up when you cry.Sandler should stick to awful romcoms with Rachel from Friends.",
    "89": "Things got off to a very bad start in the early collaboration journey between Adam Sandler and Netflix.After the initial, at the time industry breaking news, that one of Hollywood's biggest comedic movie stars would be dealing exclusively with Netflix on most of his new projects, Sandler and the streaming service unleashed a collection of you wish they never saw the light of day films such as The Ridiculous 6, The D0-Over, Sandy Wexler and The Week Of but over recent years both Sandler and his partnership with Netflix have managed to right the wrongs of the past and deliver a collection of projects that are surprisingly good, with some even being downright great.Following up recent efforts such as Uncut Gems and Hustle, Sandler's newest outing, the animated family film Leo, may not attempt to be anything more than a passing diversion but this fun and well-intentioned offering is a highly enjoyable ride that has a lot of fun with Sandler's 74 year old school bound lizard who wants nothing more than to live his best life after coming to the realisation that he soon may shuffle off his mortal coil.Joined by fellow comedic collaborators such as Bill Burr, Rob Schneider and Jason Alexander, Sandler headlines a talented voice cast in bringing this familiar but fun tale to life and while the film suffers at times from trying to attach a musical angle to its story of finding ones place in the world and learning to find what you love to do, for the most part you can tell we have a film that had some passion behind it and far more effort put into it than many of Sandler's early Netflix ventures.It appears based on the recent output of Sandler that he has started to care more for his projects outside of where they may afford him to holiday, which friends he can bring along for the ride or what pretty actresses he may smooch and Leo shows that same amount of care with Sandler dialling things way back and while not all of the jokes work, much like the mostly forgettable song numbers, there's enough that does to suggest many will have a great time with Leo, and his pals, both human and animals.A nice piece of comfort food that neither surprises or lets you down, Leo is another solid little addition to the Netflix/Sandler story that helps right some of the wrongs that occurred in their early relationship, a period that struck fear into the hearts of cinema fans from across the globe.Final Say -Disney's recent animated output could write some notes based off Leo's simple mid-tier successes as Adam Sandler and Netflix help make this family orientated comedy a quickfire experience that never outstays its welcome and delivers entertainment of the most simply in nature.3 nervous skin shedding's out of 5Jordan and Eddie (The Movie Guys)",
    "90": "Personally, I'm not a fan of the CG- the kids have huge heads and the kindergarteners are creepy.I kind of wish they chose someone else to play Leo- Adam Sandler is mid.There a few hilarious moments and quite a few heart warming moments.The song about not crying was uncomfortable and weird for a kids movie. The songs are so awkward and could be excluded to improve the movie. Definitely unnecessary and awkward.Overall the storyline is really good and the humor is decent. I wouldn't watch it again or recommend it to other people though. It didn't need to be over an hour. It was like the editors didn't want to cut anything from the script.",
    "91": "Leo the tuatura and Squirtle the turtle are class pets at 5th grade. Leo is 74 and has just learnt that his kind only live till 75. Desperate to live it out full for the rest of his days, he tries to escape when the students are given a task to take home a pet by their substitute teacher. Instead, he realizes it is better to hear the kids out and help them with their problems, becoming an instant favorite. Sharing his knowledge, he grows closer to them which gets his turtle friend jealous. What happens when jealous takes over forms rest of the story.Leo sticks to the basics and an in-form Adam Sandler voicing Leo is an added advantage. Touching various problems that the kids go through, it is addressed through Leo to explain life still goes on to those kids. I was completely into this story right till the overdose of songs in the last hour, dragged the story a little. It's a predictable little film which tries to entertain within It's limits and for the most part it does succeed. Overall, it indeed was a decent watch.",
    "92": "Animation is just sumptuous. It's gorgeous. Audio and dialogue and script-writing is fabulous. It's got a lot of dry humour; British almost despite being very heavily American-casted.It features the jaded and eccentric and down-and-out Leo the Lizard. Leo is petrified that he's going to die soon, as after all, he is in his mid-70's! However little does Leo know that his breed of lizard live much longer!Thus beginning Leo's great quest of finding out about him once he unfortunately finds himself lost and confused.There's loads of quirky humour which is what you expect with Bill Burr. It's got Sandler's signature class and Burr's draal and sarcasm which is just a fabulous combination.I love the extremes and contrasts of different characters. The school is done incredible well. The school kids educate the viewers on diversity; ADHD; neurodiversity and different learning styles!This is just a fabulously well-written and scripted movie. I really don't get the need for them to sing every x amounts of minutes and that's the biggest downer of the movie.I particularly enjoyed the drone sequences. A great way to educate kids on what drones can do and how to respect technology. The over-zealous scientific parents who are just skeptical of anything is hilarious. Over-enthusiastic on everything from high-tech to contimiating diseases!It's up there with Pixar-level animation and quality. Really well-made. Top stuff. I don't want to give much away just watch it and have a fabulous ride!",
    "93": "Directed by Robert Marianetti, Robert Smigel, and David Wachtenheim. A runtime of one hour and forty-two minutes. Streaming on Netflix.\"Leo\" voiced by Adam Sandler is a seventy-four-year-old lizard living in a terrarium located in this Florida Elementary school classroom as a class pet with his best friend \"Squirtle\" played by Bill Burr.They are both over this life. With \"Leo\" thinking the end is near being so old, is ready for something new. That becomes a reality when the teacher goes on maternity leave.Not only does the principal bring in a substitute teacher. But she's much older and much meaner. \"Ms. Malkin\" voiced by Cecily Strong makes every student bring \"Leo\" home for a little bit. Which he's conflicted about since he wanted to escape not necessarily to these kid's houses.This experiment turned out to be what the doctor ordered. As each student by accident finds out \"Leo\" can talk. Soon \"Leo\" will find himself being a counselor and motivator to the whole classroom. Giving each student their own unique set of advice.But everything isn't sweet. His grumpy old friend \"Squritle\" feels a way about all of this new fame \"Leo\" is getting. You also have \"Ms. Malkin\" who has her agenda. Hopefully \"Leo\" secret of him being able to talk will stay hidden. I mean he's only relying on Elementary kids to not say anything. Find out will \"Leo's\" secret be kept and if he'll get the freedom he's been yearning for so badly.\"Leo\" was better than I expected. I watched it with my family and to my surprise they didn't like it that much. With random singing and odd scenes from time to time, I thought that would be their cup of tea. But surprisingly it was mine.Adam Sandler and Netflix have a great partnership. Adam has made millions from their deal. A lot of the projects are good as well. This filled the void of everything else he usually does, it was just animated.If you saw an Adam Sandler film you know he rides with his friends and always has them in his films. Nothing changed with this film. I think the casting for this film was great. Not only was Adam perfect for his role but Bill Burr was too. Bill voiced his character perfectly. That was a match made in heaven.This film was entertaining and low-key funny. With an awesome cast including Jason Alexander, Rob Schneider, Jo Koy, Stephanie Hsu, Heidi Gardner, and a handful of Sandler family members. This cast was a gold mine of talented comedic actors voicing these characters.The random musical aspect didn't bother me. It was a good animated Netflix film. I give it four mor fires 🔥🔥🔥🔥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#Leo.",
    "94": "Can we all agree to stop ruining potential good movies with signing.The fad is over. Just stop please.I enjoy cartoons and animations. I get frustrated when a show/movie looks like it could be decent and then they start signing.Leo, the worst I've seen. The movie isn't even in its first 45 seconds and they're already signing.Looked like it could be decent with bill burr and sandler and then it get ruined.You think its just a opening scene so lets fast forward a bit. Signing stops, nice. Not a minute and half later ANOTHER SONG. Fast-forward another 1.3 minutes. No song. Good, lets move on. Nah, here's more signing 2 minutes later.Thumbs down it gets and ruined list it goes on.",
    "95": "Adam Sandler's \"Leo\" defies all expectations for modern day audiences. Not only does this film offer a semblance of an original idea in comparison to other recently animated features, but it sets a precedent for films that both adults and children may enjoy. It revels in Adam Sandler's classic choice of humor with heart to go with it.In the beginning, the film uses the children's novel \"Charlotte's Web\" to foreshadow and symbolize Leo's relationship with the class, as well as progress the plot of the movie. The scenes progress from one to another quite seamlessly while focusing on the emotional needs of each character.Overall, the film is incredibly entertaining with clever humor, direction, music, and relatable antics revolving around public education in America. Audiences will appreciate the consistent satire of entitled parents, spoiled children, and the tension between traditionalim and modernism. Highly recommend this fun film.",
    "96": "Leo (2023) is a wholesome movie to watch with the family and stands as an important reminder for educators everywhere. The film is about a class pet, a lizard named Leo, who desires to escape out of the cage he lives in, which he believes is keeping him from living his life to the fullest. The class of fifth graders is facing a challenging school year with a substitute teacher who only cares for the student's academic success and neglects the social - emotional needs that the students face as a part of growing up. Leo believes he has the opportunity to escape when the teacher makes it the students' responsibility to take care of the lizard on the weekends. However when Leo takes time to notice the emotional/social challenges they are facing he finds a new purpose that leads to not just the student's academic success but to the students learning new strategies to cope with the challenges they face outside of the classroom as well.Leo represents a teacher with a servants heart who takes time to acknowledge and does what they can to meet the needs of the whole child by prioritizing creating personal relationships with each student and giving them the tools they need to problem-solve and find a motivation for learning. At the college that I have attended in the past few years I have learned the idea of having a servants heart and what that looks like in the classroom. My philosophy of education focuses on the whole child by providing students with opportunities to grow, yes intellectually but also, socially, emotionally, and physically. This can be done by acknowledging our students as made in the image of God and knowing that they are loved by Him. A teacher with a servants heart will love their students and model what it means to love others and as a result model what it means to be a virtuous citizen. I have recently been learning about what it means to have a good society. As a Christian I believe that all truth is from God's Word and true love can only be done by loving God and loving others by living out God's truth not what the world believes to be true. A goal that I have as educator is to love my students and prepare them to navigate the world outside of the classroom and learn how to contribute to society with the same love of God that I hope to reflect in my teaching career. I will believe in my students - as Leo has - to grow up to be virtuous citizens and to celebrate how they are made in the image of God and celebrate their differences that God has created them to have for the purpose He designed them to be apart of.",
    "97": "This thing felt like leaving a report to the last minute & rushing it through to deliver the bear minimum. It was box ticking fodder that just scrapes through as barely a pass at best.With 'A lister' names that I'm confident will regret their involvement in future, it was lack lustre compared to similar previous productions from Sandler; such as the Transylvania(s) that had well crafted, clever scripts & comedic timing.Even my eight year old daughter groaned at the musical numbers, they really dragged it in to an unbearable zone. Felt completely unnecessary & robbed the thing of any character.Most definitely not a repeatable watch & casting Bill Burr? I could literally feel his frustration at not swearing through some dialogue.Swing & a big miss Happy Madison.",
    "98": "Why does everyone like this movie I'm so confused. The story isn't set up correctly, the jokes don't land, and it's generic. Also they try to use teenager slang and obviously it doesn't work because it's like your grandparent heard the word and is now trying to put it in their daily conversations. I remember saying during the whole movie, \"was that a joke\".During the first day of school Adam Sandler says \"these kids sure are yapping\" before the bell rings. Then they are introduced to their new teacher who is pregnant and has morning sickness, so she can't teach for the year. The parents are invited to a back to school meeting with the principal, and he tells them \"she's sick but not because of are school lunch\" (insert rimshot). The parents get mad (for some reason) and post it to their Facebooks. Then this \"mean\" old teacher is the new substitute and actually teaches the out of control kids how to behave because they act like they're in kindergarten even though they're fifth graders. Then later the stereotypical nerd takes Leo home. They have a deep conversation but then Leo has to do a funny face because they haven't attempted a joke in 45 seconds.Anyway that's were I'll stop but they really wasted Adam and Bills talent by making them say jokes that feel like they were ripped straight from ChatGPT.",
    "99": "The first half of the movie was brilliant.I smiled, laughed and was emotionally engaging.The songs were catchy and the storyline was really well done.I found all the characters were quirky and unique.The second half was just ok. I felt it dragged a little and the story faded out.The ending didn't leave me with a whole lot of joy like the first half did.All in all this is worth a watch as it is much better than anything Disney has released in the last few years.I have to say though that Adam Sandler as a lizard was pretty spot on! His voice just suited the role perfectly and had me smiling often.7.4/10.",
    "100": "Adam Sandler as a lizard as provided a rather large introspective on what it means to be Adam Sandler.Just because you've read the Adam Sandler Wikipedia page doesn't mean you know all about him.Adam Sandler is a man that has many faces on his coin, he was in 50 first dates, hotel transilvainl 3, and in Leo.Adam Sandler as a lizard as provided a rather large introspective on what it means to be Adam Sandler.Adam Sandler as a lizard as provided a rather large introspective on what it means to be Adam Sandler.Just because you've read the Adam Sandler Wikipedia page doesn't mean you know all about him.Adam Sandler is a man that has many faces on his coin, he was in 50 first dates, hotel transilvainl 3, and in Leo.Adam Sandler as a lizard as provided a rather large introspective on what it means to be Adam Sandler.",
    "101": "I had no idea what to expect going into this film other than the knowledge of it being a Netflix film, where often times 2 out of 10 films will be worth a watch. However, Leo had me hooked from 10 minutes in.The humour landed for me, Leo's character arc sat right and the animation was wacky but stayed in the realm of sanity.But then I hit the midway point and found myself wondering why? The film didn't really have much more to say past that halfway point other than to create some half-hearted, generic drama that becomes very predictable. I feel like if it was half the runtime, the audience would be equally satisfied.I do also regret finding this film on IMDb as I do, unfortunately, have a built in prejudice against Adam Sandler. Don't get me wrong, he's shown he can be a good actor but many of his films follow the same formula, often with his character being the hero/protagonist, which often seems like a way to fuel his own ego. Despite this film following that same pattern, Adam Sandler still does a good job in this role, I just find it a shame that he hasn't broadened his own acting horizons.In short, Leo's a good film just a bit long and contains the same sort of plot from most Adam Sandler films.",
    "102": "I personally think this movie is AMAZING!Why??? Well... 👇\nThe story is heart warmingThe Charaters felt alive with their own characteristicThe Characters are well designedThe jokes are funny (the jokes kinda unusuall for an Animated Movie, but its the reason what make those jokes in this movie great and creative)and....\nThere's totally no political element in it, just an Old Reptile being a lovely Grandpa to some kids with their own problem, that slowly but surely get solved by Leo's lovely grandpa soul✨SOLIDLY 9 OUT OF 10✨ (-1 point because the Musicall element and... I'm not really into Musicall element in a Movie, sorry)"
}