{
    "0": "Jingle All the Way is far from perfect, but it is fun and worthwhile. The plot tells of an overworked businessman who wants to buy a Turbo Man, the year's hottest toy, for his neglected son. In the title role of Howard Langston, Arnold Schwarznegger acquits himself well, particularly in the action sequences. The soundtrack is awesome, the film is not too bad to look at and the climax is a lot of fun if very far fetched. Sinbad is amusing is Myron, and James Belushi is great as the Crooked Santa. Phil Hartmann(while he has been better) is hilarious as Ted, the phone conversation between him and Howard is a hoot. Rita Wilson does a good job as the mother, and Jake Lloyd is cute as Jamie. The film has some nice messages for kids. While the film is funny in places, the humour is questionable sometimes. The film is also rather short, and perhaps a tad rushed. Also Brian Levant's direction could have done with a harder edge. Still, despite the failings, it is a fun Christmas comedy, that is not really to be taken seriously. I call it a guilty pleasure. 6/10 Bethany Cox",
    "1": "JINGLE ALL THE WAY, in my opinion, is one of the best Christmas movies I've ever seen. I thought that Howard (Arnold Schwarzenegger) should have paid a little more attention to his family. The one person I really couldn't stand was Myron (Sinbad). This was because of his attitude. Plus, he tried to hurt Jamie (Jake Lloyd). I must say that Howard was very foolish to wait so long to buy Jamie's present. Even my parents have more sense than that! No offense to you, Howard. If you ask me, Liz (Rita Wilson) looked very beautiful in the nightgown she wore. The part that really made me laugh the most was when Howard broke into Ted's (Phil Hartman) house and stole the Turbo Man doll that was supposed to be for Johnny (E.J. De La Pena). This was because Ted's reindeer charged at Howard and caused him to set the living room carpet on fire. That was absolutely hilarious! In conclusion, I highly recommend this holiday smash to everyone... especially all you Arnold Schwarzenegger fans who have not seen it. When you see it, prepare to laugh and have a good time.",
    "2": "This film shows the insanity of Christmas. Two parents, who waited untill the last minute to buy a popular gift for their child, spend all of Christmas Eve trying to come up with the toy. They were vicious and violent with each other in their efforts to secure the piece of plastic junk for their little darling. This picture shows just how goofy people act at this time of year. Instead of preparing, most folks wait till it is too late; all in the name of Christmas spirit. Arnold portrayed a man who ignored his boy all year, and then tried to buy his love at Christmas with a pitiful little bauble. How true of real life. A funny movie on one hand, a tragedy on the other. Look and learn.",
    "3": "This movie is so ridiculous, but so funny at the same time. I watch it every Christmas just to hear many of the Schwarzenegger phrases like: - Who told you you could eat my cookies? - Put the cookie down...NOW! - Nobody likes you Booster (maybe Sinbad's line) - I'm not a pervert... and the many times he says \"Jamie\", I hated that darn brat...what a spoiled kid Anakin was.But this movie is funny how it shows that parents are crazy to get one toy for their spoiled little brat. Sinbad is hilarious, and I miss him in movies, and it has the good 'ol Phil Hartman.Arnold faces an army of Santas, which is funny as well as his corny lines I watch this to hear. Although this isn't the best Christmas movie, it's still enjoyable.",
    "4": "'Jingle All The Way' is a Christmas story about merchandising and family. A lot of people seemed to really hate this movie, but I did not think it was all that bad. Sure, some of the action and the story was not the best, but I thought it did provoke a lot of laughter. The scenes with Arnie at the warehouse filled with Santas and elves was funny, and it had a good ending with the father becoming the hero after all. It does represent the bad of the holiday season with all the merchandising and the over-emphasis on that one particular toy that kids must get for Christmas, and if they do not receive it, then they are outcasts. Despite its problems, I did find it a funny and worthwhile film.",
    "5": "Sometimes critics mistake.This is definitely an example.You see some movies don't need to be reviewed,you just need to watch them first,and then judge your feelings. So idea of the movie is great,and its pretty familiar to EVERY father on Christmas.And that's why people like to associate themselves with Arnie's character.There are a lot of misadventures(you wont remember every after ending i promise),but they actually work out pretty entertaining,sometimes even laughably funny (Santa's gang scene). Also contains good soundtrack,that includes Chuck Berry's \"Run Rudolf,Run\". i also like casting choice for Ted.I don't like this type of sleazy scumbags,thats why he is so realistically annoying.Not much else to say,WATCH IT NOW.",
    "6": "i truly fail to see how this movie has such a low rating(4.7/10)on this site.i mean not only is it funny,but it's action packed,and family friendly.this is one fast paced movie,that doesn't let up.it's a true comedy of errors.the acting is also great in this one Schwarzenegger is in great comedic form here,as is Sinbad.i don't usually find Sinbad funny,but he was in this movie.and Arnie has shown his comedic side in a few movies,but i never expected him to be this funny in a comedy that fires on all cylinders.the only negative thing i would say about this movie is that it strays a bit into sappy territory briefly.there are a few suggestive scenes,but these would be above the heads of most kids,so like i said,this is a family friendly movie.there are some very funny moments throughout,and the movie is always entertaining.for me,Jingle All the way is an 8/10",
    "7": "Howard Langston, a salesman for a mattress company is constantly at his job, and also constantly disappoints his son.After he misses his son's karate exposition, he tries hard to come up with a way to make it up to him. His son tells him that what he wants for Christmas is an action figure of Turbo Man.Unfortunately for Howard, it's Christmas Eve, and every store is sold out of Turbo Man.Howard must travel all over town and compete with everybody else including a mail man to find Turbo Man, and to make it to parade...Another one of those movies that was really badly received on initial release, but has gained a little following. I for one think the movie is great, and while it does have some really silly scenes, it keeps the spirit of Christmas going.Schwarzeneggar is having a ball with his movie, and really shows the comic chops he was missing from Junior. But this was released at a time when the star was faltering a little from the A-list, and apart from True Lies and Eraser, he never really recovered.But this movie is a family favourite now, and like several other Christmas movies, it gets viewed every year.It's a fun packed movie for the kids, and it has a great running time, so no one gets bored.Go on, admit you like it, it's Christmas....",
    "8": "This is by far one of the classic Christmas movies. We have it in our DVD collection and watch it every year. It is funny with a great story behind it. It takes the toy craze that seems to come every Christmas ( i.e. Cabbage Patch dolls, Tickle Me Elmo, etc.) and makes a funny story of it. Arnold, Sinbad, James Belushi and Phil Hartman makes this a really great movie. Jake Lloyd can't act to save his life, but that is well known - especially after Phantom Menace.The one thing to be aware of is the DVD versions that are out there. The original is the best with the original movie soundtrack. When it was released later on DVD again, they changed the music. They put \"I'm dreaming of a White Christmas\" in part of the movie when Arnold is running around looking for Turbo Man. It is not suited to the scene at all. It was originally Brian Setzer's \"Jingle All the Way\" which fit the scene perfectly. So, avoid the version with the modified soundtrack.",
    "9": "First of all, let me say I am way easier on Christmas movies than I am general releases. I don't know why. Maybe its that its the time of the year, and all the tinsel dust gets settled into my brain until I am in a stupor...But this movie is not that bad. If you just look at it as a lighthearted, fun with the family movie, then you will have fun. It does get real, real cheesy at times, but most of the movie is funny and entertaining. That's all you can ask for from a movie. The biggest drawback is Jake Lloyd. I have never liked him as a child actor. You could always tell he is acting, and he always sounds so damn whiney. Heck, behind Jar Jar, Jake Lloyd is the most annoying actor.Other than that, it is fun. Hey, if it comes on TV, pop some pop corn, grab the kids, and tune in!",
    "10": "Everything about this movie is great. It has a great cast (With a wonderfully sleazy Phil Hartman). A great script with loads of laughter.It's obviously created as a spoof for the Christmas buying crazes that go on in the world, where everybody must have that one very special toy.It has the look and feel of a children's movie - but I'm not sure it is, or was ever designed to be.Don't expect a Schwarzie action movie. It's more a live-action cartoon.Jingle all the way is a movie I've seen a couple of times now - and I'll watch it again and again. Good fun. 8/10.",
    "11": "''Jingle All the Way'' is a very cool movie I watched when I was 10 years old, and only watching it again so many years later, I recognize the boy who plays Jamie, to be the young Anakin Skywalker in the first movie! Anyway, I don't agree with the low rating of this movie, because it is a classic to watch in Christimas and I remember having much fun with it, even having some bizarre or impossible things happening in the story. (Let's not forget that it is a movie and the main goal is to have fun! And only now, I discover that the actor who played Ted in this movie,Phil Hartman,is dead..)In the story, Arnold is a busy father, who forgets to buy the toy his son wants for Christmas (Turbo man), and will be in the most ridiculous and funny situations to see if he have a chance to save Jamie's happiness.",
    "12": "Perhaps I was reading too much into it, but I spotted some uncommon themes, and, perhaps, hidden messages in this movie. 1. Kids are ungrateful. 2. Kids are brainwashed. 3. The grass is always greener in the neighbour's garden. 4. It's always all about money. If you work a lot to provide a good living for your family, they will complain that you don't spend enough time with them. If you spend a lot of time with them, but don't make enough money, you will be blamed for your inability to provide good quality of life. You can never win. Kids only want acceptance from their peers. They are sheep and followers. If you don't get \"the\" toy (or, in this day and age, - \"the\" gadget), you are destined to be an outcast. Why is it this way? Subtle brainwashing by merchants that's been going on since the beginning of times.\"I wish my Dad was more like yours\". Yeah, the grass is always greener in the neighbour's yard. If he really had *that* guy for a Dad, I bet he'd be saying he wished some other guy was his Dad. People rarely appreciate what they have. So, the kid is *real* p***ed at his Dad for missing his karate class, and keeps bitching that he doesn't spend enough time with him. But as soon as you promise to *BUY* him something, all is well again. Conclusion? Anything can be fixed with money. You're a good parent as long as you have money to *BUY* stuff. And... did it bother anyone else that Arnie's character used the situation he found himself in to select his own son as the winner of the special edition toy? Another observation: if given choice, people will inevitably do what is beneficial to *them* (even if it harms others), instead of what is fair or morally correct. Like I said, maybe I'm reading too much into it, or, perhaps, the movie does, indeed, have a deeper meaning. Whatever the case may be, I did like it, and if you don't try to over-analyze it (like I did), you will be able to enjoy it for what it is - a light-hearted comedy.",
    "13": "Sigh, Jingle All the Way, how this film has a rating that is above the 4.0's on IMDb boggles my mind. This is one of the scariest films of all time. First off, we have Arnold Schwarzenegger, The Terminator, he's playing this wacky almost like 80's silly comedy show type of Father Knows Best. Second, I think this is the film that just gives up on us, it goes from alright to stupid to silly to bad to just plain awful. Third there is nothing redeemable about this movie: the terrible acting, the lousy story, the crappy moral behind it's shallow message, and Arnold's accent, granted the accent has gotten him a career, but still it's disturbing the way he presents some of his lines. Not to mention that for some odd reason they put Sinbad in this movie, sorry to say but he is just not funny, actually no body, even one of the best voice actors of all time: Phil Hartmen... I can't believe he took on this movie.Howard Langston is often busy at his job, and has a hard time finding time for his wife, Liz and his young son, Jamie - especially when compared to next door superdad divorcé, Ted Maltin. After breaking his word again by missing Jamie's karate grading, Howard resolves to redeem himself and his marriage by fulfilling Jamie's ultimate Christmas wish, an action figure of Turbo-Man, a popular children TV superhero. Unfortunately, as is the habit with him, Howard has promised to buy that figure earlier that year and then promptly forgotten about it. To make things even harder, Turbo-Man toys are the must-have gifts of the season, and stocks of Turbo-Man toys are quickly drying up all over the country. Desperate not to disappoint his family again, Howard embarks on an epic city-wide quest to find the toy everyone's looking for. Along the way, Howard encounters Myron Larabee, a postal worker dad with a rival ambition, and the two quickly become bitter competitors in their race for the action figure. The chase begins to arise the ire of a police officer whom Howards keeps running into, and one of the most memorable scenes includes Howard desperately hooking up with a band of brand-spoofing crooks and ending up thrashing them. In addition, Ted attempts to hit on Liz, which she eventually turns down hard. The search climaxes with both dads masquerading as live action stuntman in a department store parade. As the \"real\" Turbo-Man, Howard uses the opportunity to present a coveted limited-edition Turbo-Man doll to his son in the crowd. But before he can recognize his dad, Jaime is chased around the parade by Myron, dressed as Turbo-Man's arch nemesis Dementor.Jingle All the Way is just one of those movies that you wonder how in the heck it got green lighted. It's just so stupid, I love how the ending, Myron tries to kill a child to get a stupid toy for his son and all is forgiven so easily. Gotta love how Turbo-Man has an Austrian accent, muscle bound, square jaw, tall... yet his own kid doesn't recognize him at all. Even the one scene that had a great joke, the bomb that was wrapped as a present, they even ruined that with a lousy slapstick joke that I know it was a family movie, but it just was stupid. But give or take, it's not that bad of a movie, there are some good jokes in it. I can't give Arnold a bad review, I just can't, it's not in my blood as a critic. There are some moments that are very funny like Arnold screaming at his neighbor for eating his wife's cookies. Also Arnold is just too likable as well as Phil Hartman. It's a light recommendation, not the worst movie of all time, but just one of the silliest.1/10",
    "14": "This film has taken a great many knocks over the years and I'll be the first to admit that it does have flaws. The conclusion, especially, is so sickly sweet that it sends your eyes rolling like slot machine spinners. Some of the things that Arnie does as he gets more and more desperate to track down a Turbo man doll for his son are cringe-worthy (I'm thinking particularly of when he stalks a little girl in the ball room at the mall) but they ultimately do function within the larger scope of the film.Arnold plays a father who was supposed to take care of getting a toy for his son. He's forgotten and has to go out on Christmas Eve to try and track one down. When he realizes that it is the hottest selling toy of all-time, High-jinx ensue.The thing with Arnie is that you're either going to take him or leave him. If you find his accent aggravating, or his acting wooden, then stay away from this film because you're just not going to like it anyway. I don't think he's that bad in this and I would go so far as to say that it is probably his second most successful comedy (\"Kindergarden Cop\" being my first choice -- \"IT'S NOT A TOOMAH!!!\" CLassic! Ha!). He's got an excellent supporting cast in this one: Jim Belushi as a seedy shopping mall Santa, Rita Wilson as Arnie's long suffering wife, Phil Hartman as the sugary sweet sleaze of a neighbour and of course the inimitable Sinbad. I would argue that the unlikely pairing of Sinbad and Arnie works extremely well and is probably the key to the film's success. Neither really has the acting chops to make the other look bad or out of place and so they are each able to hold their own when on screen at the same time.There is a tendency to take this film too seriously. It has a great satirical viewpoint. Who among the retail warriors can watch this film and not throw their hands up in the air saying \"Idiots! You've left it to the last minute and you're getting exactly what you deserve!\" Who among the legion of over-stressed and unlucky parents can't feel some sympathy for the plight of a man just trying to do right by his kid, even if it is a little too late? Jingle All The Way is a Christmas cure. It's a sharp point to puncture the over commercialism we get caught up in. This film is a chance to chuckle at ourselves and the insanity we leap into with enthusiasm annually. It is a ninety minute reality check and a chance to sit back, relax, and not take things so seriously. This isn't 'Scrooged,' or 'It's a Wonderful Life,' or 'A Christmas Carol.' It isn't the best of comedies or the best of Christmas films. But it is very honest about itself and not a bad way to spend the holiday.",
    "15": "This is a really funny family movie! There's plenty of funny, touching moments in it and it's very colourful, adventurous stuff. The basic storyline is that Howard Langston (Arnie) has forgotten his son's christmas present of a Turbo Man action figure, but the shops have all sold out! It's christmas eve and Howard has only 24 hours left! What Howard doesn't bargain for is the fact that psycho sad Mario (Sinbad) has got to get one for his son too! Throughout most of the movie there's basically Arnie and Sinbad nearly killing eachother to get their mitts on this Turbo Man doll and trying to beat eachother to it no matter what it takes! There's some very funny moments throughout the movie and some surprises too! Rent this lovely film out and sit back and get festive! Thumbs up!",
    "16": "Howard is a lousy father, who spends more time in the office then with his family. However, after letting down his son for the last time, he promises to buy his son the ultimate Christmas present, a 'Turbo Man'....But, finding it, will be the real mission.Growing up, I always watched this film at Christmas with my brothers. It's one were the entire family can sit down and laugh together as Schwarzenegger battles Sinbad to bring home his son's present. In my opinion its the perfect Christmas film.The jokes are funny, the mayhem is hilarious and the physical aspects of the film are just fantastic to watch.",
    "17": "What can one say about Arnie's films? When he's in charge, they are horrid, dumb, usually bloated. But you have to give him some credit. He is intelligent enough to have scripts written that emphasize a dual reality: a real guy and an imaginary superhero. Most of the projects he has initiated recently have this flavor, especially here and in `Last Action Hero.' So at least he aspires to do something intelligent.But the problem is that he has neither the depth to really develop a concept, nor the skill as an artist to craft the product. Too bad.As an aside, he seems to be an icon for extremists. When I said something mildly negative about him in another comment, I started getting disturbing email from skinheads.",
    "18": "I seriously am baffled by the 5.7 rating here, and I think it was even lower at some point. Clearly people can't get this movie for some reason? I didn't think it was that difficult to understand. Its message is pretty clear.The movie is one that I cherish because I saw it as a kid for the first time. I didn't really get the whole consumerism angle, but I thought the movie was hilarious (thanks to Hartman and Sinbad, and even Arnold), and I loved the Turbo Man character and it reminded me of Power Rangers.As an adult, I look back on this movie and go \"Yep, that's how my parents felt.\" It's such a relatable movie, and I think that's why I don't get the low rating. Everyone who has ever bought a toy for Christmas knows what this is like, especially if you're waiting until the last minute.Is it goofy? Yeah. Is it simple? Yeah. Is it funny? Yeah. From the creepy neighbor played by Hartman, to the postman played by Sinbad, to the cop who keeps getting hurt, to the con man Santa, it's filled with great characters, moments, it's a fun movie and I have to watch it every Christmas.Again, I really don't know why this movie has such a low rating. I guess people like Black Friday, and like violence over toys? I don't know.I think the movie does a great job of blending what kids want, with what adults find amusing. Kids love the humor and the action scenes, and the adults love the message, and the humor too. I think it's a perfect blend. Don't skip on this one. Watch it around the holidays. I think it's Arnold's best non-action movie.",
    "19": "Arnold plays a busy working father who never keeps his promises. He has one chance to redeem himself by getting his son a turbo man for Christmas. The only problem is it's Christmas Eve and turbo man is the hottest selling present ever.Inspired by the sales of tickle me Elmo, this movie shows the crazy side of Christmas shopping as Arnold battles a disgruntled mail man, a police officer, a reindeer, a room full of people dressed as Santa clauses, fellow shoppers, and even chases a little kid through a play place.His son's affection, trust, and his marriage are all on the line over him simply getting one toy. This is a great film that people of all ages will enjoy. 10/10",
    "20": "Jingle all the Way (1996): Dir: Brian Levant / Cast: Arnold Schwarzenegger, Sinbad, Rita Wilson, Phil Hartman, James Belushi: Perhaps the stupidest Christmas film imaginable. It had to be a real warped mind to conjure this garbage up. A man is stampeded by a group of immature adults seeking a Turbo Man action figure. This is obviously the Christmas version of lame action movies with violence toned down to Arnold Schwarzenegger clubbing a line of Santas with a giant candy cane. Directed by Brian Levant who was responsible for the horrible screen adaptation of The Flintstones. Well, he hits even lower notes here. Schwarzenegger and mail carrier Sinbad compete for the action figure in what can easily be described as career suicide for both. One particularly stupid scene at a radio station has Sinbad holding off police with a gift that he claims is a bomb. When it actually turns out to be a bomb, Sinbad asks, \"What is the world coming to?\" Perhaps the screenwriter can fill us in. In lame supporting roles are Rita Wilson as Schwarzenegger's wife and Phil Hartman as his womanizing neighbor who threatens to move in on Wilson. James Belushi plays a nasty mall Santa who candy cane battles Schwarzenegger and it is embarrassing to watch. The film so cheap that it should be wrapped in a trash bag in hopes that Santa will deliver it down the nearest chimney fire. Score: 0 / 10",
    "21": "Blown away by all of the negative reviews here. Might be overthinking it. Sinbad and Phil Hartman?!? Arnold actually plays the out of touch suburban dad pretty well, and then Sinbad and Hartman provide the comedy gold. That they teamed up for this and Houseguest in consecutive years is a gift to humanity. Enjoyed the simple story as a kid, but as a father trying to make Christmas special for his kids, the enjoyment is amplified. I've definitely run to store after store like Arnold. Not sure society still has \"that toy\" anymore - in the age of video game consoles and smart phones - but that and the actors harken the spirit of the 90s in a fun way. The film's closing line is brilliant, my wife has even used it on me in jest.",
    "22": "\"Jingle all the way\" is a fine Christmas movie a light-hearted comedy and family film and should be judged accordingly... Considering the category, it gets an \"A\" in my book.I love this holiday gem, Arnold Schwarzenegger fan or not! Sinbad is a beautiful comedian and a solid casting choice for this holiday charmer. Add beloved Phil Hartman to the mix and great becomes better!If you're looking for cheer during the holiday season, you'll find it here. Highly recommended, if you're in the mood for comedy, adventure and fun... regardless of the time of season.If you love to laugh, you'll love this film!",
    "23": "It may be difficult to understand but this movie to me is Christmas. It is as warm as an open fire, or a hug from a loved one. Although this movie is very cheesy and will never be considered a cinema classic, it truly holds a place in my heart. It brings me back to when I was a small boy and all the great Christmas memories I had. If you want a great family movie that will make you smile, I would highly recommend watching this. I know Christmas movies are generally bad but this one hits close to home and it is one of my favorites. I look forward to this movie every year.*disclaimer: there is some comical violence in the movie. (it was the 90's)",
    "24": "A father (Arnold Schwarzenegger) decides to dream the impossible; to get a Turbo Man action figure for his son (Jake Lloyd) just before Christmas.Is this a good Christmas film? Maybe. A great one? No. But considering it stars Arnold and Sinbad, you should not be expecting much. And then you throw in Phil Hartman as a sleazy neighbor... although we get a great cameo from Martin Mull.The concept is pretty good and something we are all familiar with. We may not all wait until the last minute to buy gifts, but we all know what Black Friday shopping is like, and that is what this film reminds me of more than anything.Turbo Man is sort of a lame character, but at least he has Booster. Everyone likes Booster.",
    "25": "I just did not find this funny. Arnold Schwarzenegger as a middle-class suburbanite did not cut it. His accent sounded way out of place. Sinbad - whoever the hell he is - was supposed to be the other funny guy, but failed as well. Nobody in here was particularly good to watch.The film begins with the typical theme of a father neglecting his kids. Have you noticed since the \"classic era\" ended how fathers are almost always portrayed in a negative light in films? The most popular stereotype is that of the father who is never there for his kid's activities. Same thing here, so Arnold at least goes out of his way to make it up to the boy to the point of lunacy as the kid makes all these demands! Summary: a very annoying and stupid movie.",
    "26": "This movie is great and the title sounds as interesting just like the movie. Arnold was good in this film as taking the main role.Sinbad was good but not as good as he was in Good Burger but i,m glad he won an award for this film because he really deserved it a lot because his acting really payed off.Jake Lloyd was good as playing the son of Arnold and Rita. I am Glad that this film won an award even though it should have won more for best actor in a leading role because this was his best movie ever.This movie is about 2 different men who are looking for the same toy for their sons but find out that it is so hard.",
    "27": "At least last film, 1983's \"A Christmas Story\", had the charm of the holiday season, and the desire for a particular Christmas present wasn't all that there was. This film has no charm whatsoever and two of the most materialistic, un-holiday celebrating parents ever. A very miscast Arnold Schwarzenegger is laughably bad, and Rita Wilson as the seemingly loving mother isn't far off as far as the unlikability is concerned. She is so self focused on keeping her kid happy that she doesn't see anything about the real meaning of Christmas, only the fact that her kid had to have this doll so he won't cry on Christmas morning.I'm jingling all the way for the second time, and I can't find anything remotely holiday spirit like in this film. In fact, it is the complete antithesis of what the holiday spirit should be, and that makes it a phony Hollywood attempt to manipulate moviegoers in a way that in reflection nearly 30 years later is absolutely disgusting. Comic actors like Phil Hartman and Sinbad fail to get laughs, and the more that the film goes on, the more obnoxious they become. Attempts to spread a Christmas message a good share through holly Jolly music and festive store displays doesn't work. This is one time when alleged holiday magic through Hollywood casts no spell and leaves its audience colder than the North Pole.",
    "28": "Let me just begin by saying that when watching ANY holiday themed movie, the viewer has to realize that no matter what happens the ending will be exceptionally predictable, if not totally unbelievable. Movies of this ilk have to have a warm, sweet, sappy ending and tend to have a \"that'll never happen\" air about them - otherwise they wouldn't be holiday movies.That being said, this film takes a pretty good, and funny, route to getting to that predictable ending. Most Christmas movies deal with, and poke fun at, the \"nostalgia\" and expectations of the season - dinner with unbearable families, rotten kids (or bad ones who learn the meaning of the season), lights, and so on and so forth. This one takes aim at the overblown commercialism of the season with hilarious results. Schwarzenegger and Sinbad play off each other with exceptional comedic timing, and improvised one-liners by Sinbad (such as his cry of \"Rodney King! Rodney King!\" while being pummelled by toy store patrons) added to the humor all the more. Arnold plays his role as an overworked father trying to make up for lost time and keeping his promise of getting his son the hottest toy of the season - a Turbo-Man action figure - all the while competing against Sinbad for all it's worth.Jim Belushi as a black market-dealing Santa was a stroke of genius, and the warehouse scene (\"I AIN'T GOING BACK TO THE JOINT!\") was inspired. Schmaltzy Phil Hartman was just that - his typical self absorbed, schmaltzy, self - and he portrayed a phony divorced dad playing on the sympathies of the neighborhood ladies with a feel of \"genuine fakeness\" that made you laugh every time he was on camera.Yes, the ending was unbelievable. Yes, the ending was predictable. But that's what holiday movies are supposed to be. The ride getting to that point, however, was well worth it.",
    "29": "The verdict: Meet Howard Langston, a salesman for a mattress company is constantly busy at his job, and he also constantly disappoints his son, after he misses his son's karate exposition, he tries hard to come up with a way to make it up to him, this is when his son tells Howard that he wants for Christmas is an action figure of his son's television hero, Turbo Man. Unfotunately for Howard, it is Christmas Eve, and every store is sold out of Turbo Man figures, now Howard must travel all over town and compete with everybody else including a mail man named Myron to find a Turbo Man action figure, and to make it to the Wintertainment parade which will feature Turbo Man.The verdict: Silly holiday fun from Arnie!",
    "30": "Don't listen to the Scrooges who tell you this film is no good.  It's good-natured, fast-paced and often very funny, like a live-action cartoon. Arnold is one of those actors that come off larger-than-life but extremely likable because he's not above poking fun at himself and his image.  He's not afraid to be totally goofy if it'll get a laugh.  He and Sinbad here have a nice, unforced comic chemistry together.Besides being a comedy, the film shows the the total insanity and crass commercialization of the holiday season in this day and age, which is both funny and thought-provoking.It may never be an enduring classic, but I laugh alot whenever I watch this movie.  Put it on a double-bill with \"A Christmas Story\" for some great family holiday fun.",
    "31": "Great watch everytime. Probably my favourite Xmas family movie if not in the top 3. Arnie hasn't really kept upto date on what his kid likes and this costs him realising a certain that was the kids only real want sold put way early because it so popular. Add in a stressed hyper psycho postman who's not had the time to get his kid the same toy and let the games begin. This really is a fun movie. Showing what a nightmare desperate shoppers are for what they want , and scrupulous back end dealers who try to profit and scam from others misery. ( we have some really great costume crooks in this movie) but it all comes to a spectacular ending with lots of action amd heartwarming moments for everyone all round.",
    "32": "I'm not sure why this movie has so many negative reviews, in my opinion it's a good family movie that has some very funny parts and a decent story, we have all been there last minute trying to find that popular toy around Christmas that seems to be sold out everywhere (well I have anyway) so I can relate to the chaos that ensues trying to find it. I like Arnie as an actor and I think he pulls of the comedy type roles as well as his tough action type roles. This is another of the movies I add to my list of Christmas movies to watch each year and I still enjoy watching it. If you watch it for what it is and don't expect any Oscar type performances you will enjoy it. It's silly, it's fun and a good Christmas movie.",
    "33": "There's a lot of laughs to behold in Jingle All the Way. There's a few flaws I should point out immediately. A few jokes go a little far, such as the pedophilia incident in the mall, the crazy black father, and the amount of laws broken by Arnie's character. Those aside, the entertainment still makes it a great satirical view of Christmas shopping in those final hours.The acting is all pretty good. Sure, not one of the performances required a great deal of depth to create or portray, but each of them are ones we can relate to, in which there is success. The music is full of typical holiday jingles, and a few quirky cues for the helter-skelter that occurs now and again. As far as comedy goes, a lot is dependent on slapstick, though there are a few running jokes, and Sinbad has some great scenes -- especially with the \"bomb\".All in all, I highly recommend this for any family to watch on Christmas. I talk mine into watching a little mini-marathon of films to fill out the rest of the morning, and it provides for a nice 90-minutes.Enjoy.",
    "34": "First, I wished I could give this movie a zero, but one is the lowest score IMDB allows.Ughh... I hated this movie! And who taught the script was worth for a movie??? This movie is a stupid and awful disaster of a Christmas comedy. I can't think of a worst family movie except KAZAAM with Shaquille O'Neal, ED with Matt Leblanc and SANTA WITH MUSCLES with Hulk Hogan!Here is the family friendly (No way in hell!) plot. A hard-working father has problems in keeping promises to his son. After a missed karate class he has to buy a Turbo man for his son but every store hasn't got them anymore. So he has to fight with everyone for obtain the damn action figure! Ending even in a parade and making a fool of himself.There are two types of bad movies. The first is the Super-cheap movies (like ''Plan 9 from Outer Space'', ''Manos the Hands of Fate'', ''Madmen of Mandoras''). Yes, this movies are made with super-low budget and they only do one thing, and do it well: Suck! The second type of bad movies, and ''Jingle All the Way'' is the king of this category, are the big-budgeted, bad and irritating movies. You feel so angry that you want to beat every single person that made it!''Jingle All the Way'' is a movie that made me feel very enraged after I watched it. The few other movies that caused me such a reaction were BABY GENIUSES, FREDDY GOT FINGERED and SANTA WITH MUSCLES. And with such a plot the director and producers only could had kidnapped relatives in order to force Arnold Schwarzenegger and Robert Conrad to star in this movie. And they must have screamed ''CRAP-FEST'' while making this movie. I'll give you three examples of how annoying all the other characters were:Sinbad: Oh, I hated him! He was so obnoxious and so unbearable that I always rooted for the ones that hurt him. Somebody should have said to Sinbad ''STOP, NO-ONE LAUGHS AT YOU''. And I hope he ended in jail at the end of the movie!Phil Hartman: the worst character put in a kids movie, he was only a buffoon that acted like some sort of a stud and nearly won Arnie's wife's attentions. Yeah, a good message kids! A mother super-floozy that is more interested in a bachelor only because keeps promises? All wrong folks!Jim Belushi: the worst Santa Clause ever, worst than Hulk Hogan! He was so obnoxious, stupid and unlikeable that you want to smash the TV with an hammer and all the other Santa Clauses ended the way they deserved: In JAIL for the rest of their lives!And, as for Mickey Rooney's pointless cameo, it really did nothing to me (much like his other cameo in BABE PIG IN THE CITY).So, if you like bachelors that steals other wives, criminals dressed as Santa Clause and a vicious reindeer, this IS the movie for you! Think of ''Ed'', ''Baby Geniuses'', ''Howard the Duck'', ''Problem Child 2'' mixed all together in a movie and written in a room full of mandrills! This is the result.That's it! Nothing funny, nothing endearing and nothing worth seeing in this movie. It's just stupid (and I felt a idiot watching it), pointless and no good for kids. STAY AWAY FROM THIS MOVIE LIKE POISON!! Don't say I didn't warn you! And don't you dare showing this movie to your children!",
    "35": "Watch it in the early '00 many times with my kids on a good old VHS. For them Jingle All the Way is now Nostalgia. Watch it again last week on tv and they still find it a funny movie.",
    "36": "Jingle All the Way is one of the most underrated Christmas comedy of all times. Yes, it has a lot of cheesy cartoony scenes, but it's one of the movies that people tend to watch every Christmas. The movie starts Arnold Schwarzenegger as Howard Langston who tends to be late for every family event and struggling really hard to keep all his promises. Trying to make right to his wrongs, he promise his son Jamie (Jake Lloyd) to get a Turbo Man action figure. Jake Lloyd comes out in the movie as little more than reading lines and yelling. The kid actor that will end up to be Anakin Skywalker in future roles, was yelling and promoting materialism in a Christmas movie. Most of his scenes were getting off, or demanding things. It felt that Jamie might have angry problem in the future. Howard Langston thinks this doll will get him in his good side. Only problem is that the Turbo Man action figure is one of the highest top selling toys that year. Inspired by real-life Christmas toy sell-outs panics such as Tickle Me Elmo, Power Rangers, Star Wars and Cabbage Patch Kids. Howard goes on a last minute shopping spree on Christmas Eve on search for this doll. He's not alone, as Myron Larabee (Sinbad) a postal worker is also trying to retrieve an action figure for his son. Sinbad gives it his own, as he brings life into Myron. Myron is less than a villain, and more as a good man going to the extreme for his son. Sinbad is a Myron and Howard bumps heads along the way, and getting terrorize by knowing that goody good shoes Ted Maltin (Phil Hartman) is spending more and more time with his wife Liz (Rita Wilson) and child. Phil Hartman is just brilligant in the annoyingly perfect family role. Superdad Ted puts Howard in a bad light. On the way, Howard repeatedly runs into Police Officer Alexander Hummell (Robert Conrad), it's a gag that kinda get old in the end of the film. I know this movie got so much criticism and yeah some of the scenes are just plain silly like a band of counterfeit toy makers lead by Santa (James Belushi) and KQRS Bomb Scare, but also fun and entertaining at the same time making it a blast to watch. This movie came out during the madness of the toy chases of the 1990's. Of course this movie is an example of how crazy black Friday can be, and every parent can related it to. Plus there are plenty of silly scenes for the children to make them laugh as well. Jingle All the Way is sooo stupid, it's brilliant! Hahaha, it's amazing how this film has been hated by so many and loved by many more.﻿It's so silly and memorable, you can't deny that. I can't even eat cookies without thinking of that famous Arnold line. If you going to watch the movie, don't get the Un-Cut version, as the scenes that was cut from the film should have stay on the cutting room floor. They don't really give anything new to the movie. Also the movie soundtrack are mixed up in older DVD and newer DVD versions. So buy a older DVD. After all, if you do like Jingle All The Way and purchase the DVD, Arnold would definitely be happy and would most definitely say \"You're my number one customer!\".",
    "37": "Truly a remarkable fun experience, been a great fan of Arnold Schwarzenegger for as long as i can remember! from start to finish this film has had me in tears. How Arnie can pull off being the average American family man on a low budget job and with a loving family who hates him working late all the time resulting to missing his sons special events.The film sums up what it's like to experience last minute shopping in American, people screaming and fighting over bargains and being called a \"pervent\" for getting their first. If you have Arnie running around for his sons Christmas present, then you best get out of his way! Instead he battles his way around stores with a untrustworthy sidekick to achieve his goal.If you haven't seen this movie, then may god have mercy on your soul.",
    "38": "One reviewer calls this movie sick, but I guess my years at the post office has twisted my mind, that nothing affects it anymore.  I can relate to the Sinban character, the job can drive you drink.  A lot of the people there behave off centre.  The movie lags in spots, but is entertaining.  It is a family movie, like the Santa Clause.",
    "39": "I make a point of trying to watch every Schwarzenegger film in existence, a journey that has taken me from many highs to the occasional low (JUNIOR, for instance). It has to be said that the thought of JINGLE ALL THE WAY - a family comedy in which Schwarzenegger plays a father hunting for a rare toy for his kid on Christmas Eve - didn't exactly fill me with festive cheer, but the good news is that it's not too bad a film, although it's certainly a chore to sit through in places.The thing that keeps this film watchable is Schwarzenegger himself. Sure, his acting is often over the top and more than a little cheesy in places, but nonetheless he appears to be giving it his all here and he gives a very physical, slapstick-orientated performance that works nicely and imparts a lot of energy into the production. The supporting cast are less successful, although Sinbad is better than expected. It comes as little surprise that Jake Lloyd (infamous for his role in THE PHANTOM MENACE) is bad and as for Phil Hartman's disturbing character, the less said the better.The plot is very lightweight and the scenes which riff on MIGHTY MORPHIN POWER RANGERS faintly embarrassing. The climax features some really bad CGI and model effects which look awful when considering than SPIDER-MAN was just around the corner. It goes to show how far superhero cinema progressed in just a few years. Still, some of the laughs are okay, and James Belushi is always a welcome presence, so it's not all bad.",
    "40": "Love this movie and I watch it every Christmas 👌🏻\nIn the top 5 classic Christmas movies of all time.If you haven't watched them give it a go...................................................",
    "41": "8/10 - I am no Arnold Schwarzenegger fan, but I genuinely enjoyed this delightful holiday flick",
    "42": "I saw it less as a Christmas film but as great occasion to Arnold Schwartzeneger to give life to a character easy to remind fathers and the true meaning of the Christmas. A very easy film about serious themes, far to be impressing, in few scenes less than amusing but seductive for the way to remind old truths in not bad way. And, sure, for...tension, rivalries, fights and a piece of plastic.",
    "43": "How the hell is the 5 rating ? This is least a 9/10 iconic movie i grew up too.",
    "44": "I watch this Christmas movie every year! It's got a great cast and a wonderful story. Arnold, Sinbad, and Phil Hartman are hilarious in this!This should be one of the top ten Christmas movies to watch. It's up there with National Lampoon's Christmas Vacation. A dad wants to give his family a great Christmas and hilariously blows it all the way! Arnold and Sinbad have great chemistry. I wish there would have been a follow up movie to this with both characters. This is one of Arnold's best movies. Phil Hartman was also great. He makes you like him and feel crappy about him at the same time.You should watch this film if you like Christmas movies.",
    "45": "Arnold at his very best, or should i say the Governor of California. Every Christmas since this masterpiece came out i've awaited it's return. When its on i put on my 'Jingle all the way clothes' complete with Cinncinati bow-tie. I wear these to fully enjoy the experience of viewing 'jingle'. At a mere 23 years of age i count myself so lucking i discovered it so soon in life. I see it as a mix between the Green mile and Around the world in 40 days. The main aspects of the film are comedy gold, a father desparetly trying to save the relationship with his son. Whilst his wife is under threat from a neighbour who'd like to have rumpy pumpy with her. Not since mowser in Police Academy have i expressed such anger at a film character. i had to take my Ritalin to calm down in the end Ha ha. Anyone who hasn't seen this film should make it a must see. Its the 90s equivalent of the Godfather. On a scale of 1 to 10, I'd give it a well deserved 16 thumbs up, Chenoble style. Holla",
    "46": "I can honestly say this is my all time favorite movie. I'm not to young either, I'm 14 and i still love this movie. Anyway this movie displays the magic that comes along with Christmas. All the hard shopping, the stressful baking and other things of that sort. This is a great movie to watch a few weeks before Christmas to get you all pumped about it, If you like Christmas of course.",
    "47": "This is my favorite family Christmas movie. It is hilarious. Just filled with laughs from start to finish. Schwarzenegger, Sinbad keeps the laughs coming as they duke it out to find the in demand sold out toy for their sons and Hartman plays the sleaze ball neighbor so brilliantly! As soon as Thanksgiving rolls around I set my DVR because I know this movie will begin to show on all channels and I watch it over and over until the holidays are over. It really a timeless movie and gives me a feeling of nostalgia, especially the parade scene at the end.The countless run-ins that Schwarzenegger has with the police officer are classic and Belushi playing a low budget Santa toy hustler was hysterical. This is just a great feel good movie about the holidays that you can enjoy with the whole family.",
    "48": "It sounds like a bad joke... Arnold Schwarzenegger, Action Hero number 1, in a Christmas movie. But it's NOT a bad idea. I think it's a great, funny movie and after you have seen it you will feel better. It's not a \"deep-thinking\" movie like Matrix but pure entertainment with some action, because it still a Arnold movie. I Like it, but I'm also a Arnold-fan, so if you want some Christmas-spirit, see it",
    "49": "This film stands the test of time\nA funny, feel good film that gives you a warm fuzzy feeling inside.",
    "50": "With Ahhnold giving lines like \"That's really Kuuuul (cool)\" and Hartman's \"Your wife's cookies are delicious\" this is a lighthearted movie. Don't take it serious. I do advise that you should watch all the way through the credits to catch the end of the movie.",
    "51": "Honestly, this was a lot of fun. Cheesier than all get out, but definitely more than just 'watchable'.The adventure to find the elusive Christmas toy is a plot I'm always down for.",
    "52": "An enthralling watch following the attempts of the Governor of California to deliver 'Turbo Man' to Anakin Skywalker. Meanwhile trying to impress his wife to stop her falling into the arms of Troy McClure. (Or as these characters are known as in other areas of life). The 'cheese' that oozes out of this film if often criticised but surely this 'cheese' is an essential element for any family Christmas movie. Arnold Schwarzenegger constantly makes you laugh with an array of lovable side characters which thoroughly entertain through their slapstick humour. What really wins you over is the feel good factor that the movie holds. Jingle All The Way has you rooting for Howard throughout as he encounters various setbacks, even during a scene where he is fighting Santas and elves in their grotto (albeit not your conventional toy making factory) While the script may not be particularly well written and the acting is admittedly more than questionable this remains the most lovable Christmas movie of all time.",
    "53": "To be blunt, Jingle All The Way is nothing more than it is intended to be: a fun, warm, Christmas-y movie with a good message about being the best father you can be (it also includes a not-so-subtle message about commercialism and fads).And I must say I was pleasantly surprised with Arnie's acting here. As Howard he is actually funny and you do root for him to find a doll. I do agree with some reviewers and posters that the wife and the kid were a bit too harsh with him, but he proves to be the best character by doing what was humanly possible to please his son.Now that the Christmas season is approaching, you can have an excuse to indulge and watch this film. You might just have a lot of fun, just as I did.",
    "54": "Harold Langston (Schwarzenegger) plays a workaholic, who has a bad habit of missing his family's events. His son Jamie (Jake Lloyd) loves a show called Turbo Man. Harold was supposed to pick Jamie's (His son) Turbo Man action figure up two weeks in advance. He is so preoccupied with his job, that it completely slips his mind. He thinks he can accomplish a dangerous mission. Acquire a Turbo Man action figure on Christmas Eve. All Turbo Man Action figures are soled out, but Harold is desperate to make good on his promise for his son. What follows is an endless string of misadventuresThis movie will never be hailed as a classic. What do you expect with a title named \"Jingle All the Way\" and Arnold in a Christmas movie? I really do feel critics and other reviewers can be too harsh on some movies, and this is one of them. The obsession with the show \"Turbo Man\" was eerily similar to the fad of Power Rangers. Even the whole set-up of Turbo Man resembles it. I couldn't help but laugh at the rush hour sequences, in search for the Turbo Man Action Figure. They are so OTT, but I found them to be hysterical at times. It has some cartoonish violence. A bomb explodes in a comical hold-up sequence with Sinbad & bunch of cops led by Robert Conrad, and Conrad gets minor injuries (!) Jingle All the Way has a very good message to it. The message in my opinion is that family comes first, and you should always keep your promises, and of course Make sure you do your shopping BEFORE Christmas Eve, to prevent potential suffering. There is a weird subplot involving Arnold's wife (Played by Rita Wilson) and Phil Hartman (Arnold's nosy neighbor)Hartman tries to steal her away from Arnold. It felt a bit out of place to me, and Hartman basically mugs his way through his performance, with all due respect. Arnold is the reason why this movie is as entertaining as it is. He is fully committed in his role. You can tell he's clearly having fun in the role, and isn't afraid to make a fool of himself in the process. It's a potentially embarrassing performance, but Arnold pulls it off with bravura. How can you not laugh when Arnold is mimicking Kung-Fu Moves, wearing a Karate belt on his head, as a headband? He was a lot of fun to watch. You gotta love Arnie! Sinbad is not a favorite of mine, and got on my nerves. He's not very funny. He does admittedly have a couple of funny scenes with Arnold. Jake Lloyd is a complete and utter nuisance as Jamie, and made me cringe, but I can't help but feel for him. He's known as the young Anakin Skywalker. That couldn't have been easy. He has my respect for enduring that, but his character of Jamie is one that I dislike. Rita Wilson is charming as the wife. WWE Wrestler The Big Show, James Belushi, Curtis Armstrong (As Booster the sidekick) all have cameo's. The ending is rather contrived, and quite unrealistic. The idea of what they were going for was solid, but the execution was nonsensical. How does nobody get apprehended, despite attempts of kidnapping, among other things? That's a minor carp, thoughFinal Thoughts: Lighten up a little It's not trying to be the greatest movie ever made, it's a family movie. For what it is, I always manage to find it fairly entertaining whenever I see it. It's cute, and innocuous, and I managed to block out irritating characters from hindering the entertainment5.7/10",
    "55": "After scrolling through the list of both positive and negative reviews, I decided to give this movie a try, and I am glad I did! Firstly, you need to keep in mind that this movie is meant for kids, so, you will have to have an open mind for all funny kids and fictional stuff here. The movie has a nice story line- a forgetful and busy father trying to buy toys for his son in the last minute. The movie portrays in several nice ways how desperate the father is to fulfill the promise he made to his son. A beautiful father-son relationship is shown here. The child is also shown as a great kid with good values. I think this movie is a good one to watch with you entire family. It is fun, enjoyable and teaches good values which every parent and child should know.",
    "56": "I was aware of this movie but never watched until this evening. What a shame.I am actually close to speechless... This masterpiece of cinema does the incredible feat of being so utterly terrible that it manages to complete the circle, breaching the wall between a rating of 1 and 10. It is so totally absurd and unbelievable that it truly deserves a 10.The hero has zero redeeming qualities and manages to save the day by total happenstance. The long list of serious crimes he commits along the way with no consequences other than speeding ticket is a phenomenal achievement. The highlight of such behaviour is hard to pick but if I had to go with one, it would be the haymaker levelled on a reindeer perpetrated during a residential burglary.Must watch movie!\"Get out of my way box!\"\n🎁",
    "57": "The critics and ratings are wrong! This is an amazing movie. I've been watching it every Christmas season since I was about 7 or 8. My brother and I used to watch it and now with my husband and son. I relate to it more as an adult now lol.I can't see how anyone can truly hate this movie unless you have completely no goofy sense of humor. It's feel-good and hilarious. You can't expect an Oscar-worthy performance, but I don't believe that's what they were going for. It gets pretty silly at points, but you just have to love it for what it is.Anyway, if you've never seen it yet, obviously I highly recommend. Do yourself a favor and enjoy.",
    "58": "Jingle all the Way is objectively speaking not a \"good\" movie. It's hokey, it's over the top, and it has an uneasy mixture of commercialism satire with TGIF style sitcom family dynamics. With that said, I love it! Arnold does a great Job playing an overwokred father just trying to get his kid a popular toy for Christmas despite everything being against him to do so. One particularly recurring obstacle is Myron, an overstressed mailman played by Sinbad who goes from sympathizing with Arnold's character at various points, to opportunistically betraying him when it suits him. With a premise like that, it probably would've been a better fit for a director like Danny Devito who would've put a darker and more twisted spin on the material similar to his film War of the Roses, but even with the broad comedy that it is, it's enjoyable simply because of how crazy it gets.",
    "59": "All those who are saying this movies bad, shut up... If you are going to criticize the make, the screenplay, then no movie will be entertaining... I bet you a 1000 bucks wen u went and saw this wen u were little u weren't saying \"OOh TERRIBLE DIRECTION, SCREENPLAY, PRODUCTION..TOO MUCH OVERACTING..\" but u must have enjoyed it....for all those people who want too watch a nice Christmas movie and relax watch this one.... I've been seeing this every year for the past 10 yrs whenever it was broadcast on TV and i still enjoy it... PS I make videos, Plz search for \"dhruv1223\" on youtube.......................... Watch NIN thats the one i made",
    "60": "I understand it's like the B movie of Christmas, and some moments are funny, but it's actually quite bad. Almost universally so, but especially when it comes to Arnold's acting. Sure, you get to see a dwarf and a reindeer (??) uppercutted, a uniquely 90s kind of humour, I feel like-but you also have to endure how stupid most of it is and the kid from Star Wars having, unsurprisingly, the exact same range as in that film. It's weird and zany and maybe if you're loaded or watched it at a certain time of your life there is some nostalgia and charm. It wasn't entirely a bad time, but I can't say this was a good movie, either.",
    "61": "Jingle All the Way. It's turbo time! This is a great Christmas and family comedy, but it also gives lessons. Make promises and spend more time with your family.",
    "62": "It's rare that my opinion diverges completely from the majority of critics and the public but here we are. I adore this film. I find it hilarious from start to finish. I love the cast, I love the silliness, I love Arnie of course. It's completely ridiculous and doesn't pretend to be anything else. Without a shadow of a doubt, my favourite Christmas film.",
    "63": "Sinbad and Arnold are perfect in their comedy roles! Arnold as the dumb dad who waits until the last second to by a extremely popular toy called Turbo Man (a obvious poke at Power Rangers) for his son (played by Jake Lloyd, yes Anakin in Episode I). Meanwhile a zany Postman (played awesomely by Sinbad) is going for the toy as well. Racing through shopping malls, wringing each others necks, and even a fight for the toy in a radio studio \"give-away\" follows. Oh, and Phil Hartman is great as the OTHER DAD who has already bought the toy for his son and is tormenting Arnold about it. Great, just great!!! Downright hilarious the whole way through. Great true-to-life story about dumb fads like Beanie-Babies. Great fun for the holiday season, pick up \"Jingle All The Way\" Today!",
    "64": "This Christmas movie for me is by far the best there is. From start to finish all of it is entertaining. Great characters all around and a couple different neat storylines all operating separately but leading to a fantastic conclusion that most should like despite it being a little cheesy at the end. But then again what Christmas movie doesn't end like that.What makes this movie really special is that the jokes are still funny to this day over 25 years later. Not only is it funny it's also family appropriate in that it doesn't rely on lewd jokes to entertain the adults but makes it so adults and children can connect with different characters in it and everyone can get a laugh.If you're looking for a family Christmas movie that's funny but not obnoxious \" it's turbo time!\"",
    "65": "'Jingle All The Way (1996)' is all about the commercialism of modern day Christmas, half satire and half sincere observation. Schwarzenegger's everyday dad runs around town on Christmas Eve and gets into all manner of bother while trying to buy his son the hottest toy on the market. Along the way, he starts up a love/hate relationship with a fellow shopping father (Sinbad) and must prevent his smarmy neighbour from trying to steal his wife. It's a ridiculous affair, especially when it gets to its high-flying finale, but it features a number of memorable set-pieces and moves at a real clip, too. It has a couple of properly funny moments and features one of its stars most iconic lines (\"put that cookie down!\"). It isn't exactly deep; although it tries to inject some true holiday spirit into proceedings later on, it doesn't really feel genuine when it does. However, it's an entertaining and silly pseudo examination of the materialism and consumerism of the holiday season. It's a decent amount of fun. 6/10",
    "66": "Completely brainless fluff with neither a sentiment nor a care in the world. All the pieces are there to revisit the Charlie Brown Christmas Special's message about materialism overpowering the true spirit of the season, but for whatever reason it never even threatens to get to the point. Arnold, in one of his cheesiest roles, (and that's really saying something) breaks laws of more than just a criminal nature in his search for an elusive limited-supply action figure on Christmas Eve. Without exception, every single character in the film is a disdainful, greedy, self-centered jerk with little, if any, redeeming value. Even the matriarch of Arnold's family, long the voice of reason in such pictures, is a judgmental, misguided wasp who graces the screen with perhaps the worst closing line I've heard in years. A pointless exercise that, astonishingly, seems to come to the conclusion that consumerism is good - so long as you buy early.",
    "67": "People complain that movies about Christmas are too much about commercialism. This one most definitely is about commercialism and NOTHING else. The little brat named Jamie(Jake \"I ruined Star Wars forever\" Lloyd) makes his father promise to buy him a Turbo man doll for Christmas and acts like a spoiled brat when he doesn't get what he wants. Attempts at jokes are lame and stupid. Sinbad is horrible in this movie, and Arnold's only funny line is \"Put dat cookhie down!\". This movie also features the late Phil Hartman who is scummy and sleazy and evil in this movie. To sum up, the movie says you can ONLY be happy by getting material things for Christmas and it's worth it for adults to try and murder children for lame pieces of plastic. This movie is awful. If Arnold took out a gun, shot Jamie, shot Sinbad, and shot Phil Hartman(Yes, I know that's in bad taste), this would have been a tolerable movie. As it is though it is horrible, horrible, horrible. Avoid like the plague.",
    "68": "I have had an up and down relationship with this Christmas movie over the years, I know that once in a poll it was voted Worst Christmas Movie Ever (with Santa Claus Conquers the Martians coming second!), but there is a small part of me that kind of likes it too, from Razzie nominated director Brian Levant (Beethoven, The Flintstones, Snow Dogs). Basically Howard Langston (Arnold Schwarzenegger) is a workaholic salesman for a mattress company, because he is constantly busy he constantly disappoints his son Jamie (Star Wars: Episode I - The Phantom Meance's Jake Lloyd), missing meaningful occasions, and the latest is his son's karate class. Howard wants to make it up to Jamie any way he can, he suggests getting him something for Christmas, his son is a huge fan of anything to do with Turbo Man, the popular children's television superhero, Jamie tells him he is desperate for the Turbo Man action figure, and Howard promises him to get it. Howard's wife Liz (Rita Wilson) asks him a few weeks later if he has bought the doll, Howard in devastation lies and says he has, so on Christmas Eve he goes to buy it, unaware that it is the most wanted toy in the nation, and with the high popularity it has already sold out in every store. Howard is now on the hunt for Turbo Man, alongside many hundreds of other last-minute shoppers, including fast-talking postal worker Myron Larabee (Sinbad), who with his ruthless nature becomes his rival, Howard also has to try and avoid Police Officer Alexander Hummell (Robert Conrad), who he consistently causes mishaps for. Over the course of the day to find Turbo Man, Howard calls every toy store in the area, tries to catch a coloured ball to get a discounted doll, and buys a counterfeit doll from con men dressed as Santa Claus for department stores, and ends getting into a fight with dozens of them. Howard attempts to enter a radio competition with a prize Turbo Man, this turns out to be a voucher for one, and he almost steals a present wrapped Turbo Man from his neighbour Ted Maltin (Phil Hartman), who is trying to make a pass at Liz, and vicious rival Myron continues to try and beat him to it. When it seems all hope is lost and he cannot find the doll, Howard decides to be with his family at the local Wintertainment Parade, where a Turbo Man float is expected, in a case of mistaken identity Howard ends up replacing the actor who is supposed to be in the Turbo Man costume. The float has a prize for a lucky winner, a limited Turbo Man action figure, Howard is elated to finally get his hands on it, and is happy to point out and choose Jamie to receive it, but Myron shows up once again, dressed as Turbo Man's arch enemy Dementor, both men battle for the doll, to steal the doll for himself, the other actors are confused, the spectators are convinced this is the act, and only Liz knows that Jamie is in trouble. With the equipment of the Turbo Man suit, Howard defeats Myron, who is arrested, and saves Jamie, his son is shocked to discover his father is Turbo Man, as are Officer Hummell and Ted, in the end Jamie decides to give Myron the doll for his son, he says that he has \"the real Turbo Man\" at home, Howard is crowd-surfed as everyone looks on happily. The final moment of the film sees Howard with his family putting the star on the tree, Liz is happy that Jamie means so much to him, she questions what he has got her for Christmas, Howard looks shocked as he realises he has forgot to get her a present! Also starring Sabrina the Teenage Witch's Martin Mull as DJ, James Belushi as Mall Santa, E.J. De la Pena as Johnny, Laraine Newman as First Lady, Justin Chapman as Billy, Harvey Korman as President, Richard Moll as Dementor, Daniel Riordan as Turbo Man and Verne Troyer as a small Santa. Schwarzenegger is relatively alright in the slapstick moments, but is not so convincing with the cuddly stuff, Sinbad as the obsessive mailman is amusing in parts, and the direction is definitely lacking a bit of energy. The story is based on the real- life Cabbage Patch Dolls and Mighty Morphin Power Rangers sell-outs, where Christmas shoppers searched desperately and became violent to get their hands on the toys, so you could argue this film is more about satirising the commercialism of Christmas, it is not all that funny, the scenes that stand out are the mass Santa fight and the parade showdown, it is only mildly entertaining, a very average Christmas family comedy. Adequate!",
    "69": "I'd say 'Jingle all the Way' would be ONLY watchable for children under 4, but even then its incredibly bad messages sent and shameless product placements means it shouldn't be viewed by anyone.And to boot, the actions portrayed mirrors life a little too closely, unfortunately, such as someone macing someone for a Christmas item. Sound familiar?What started off as a family-friendly and touching turned nasty to the core. Or bore. This fits in about when Arnold Schwarzenegger went south and fast. Much like what happened to his state, and eventual life, I suspect.Nevertheless, this should be avoided as is its messages.",
    "70": "The story is nonsense and the plot is silly and stupid.",
    "71": "Watching Jingle All The Way this year for the first time in a few years was almost painful at times. The excruciatingly bad dialogue, the ridiculous over the top stuns, the painful acting...and then there's the fact that the film is undeniably adorable and silly and completely watchable and kids will likely absolutely adore it. I felt like it has a bizarre message about material goods and yes, good old Dad learns his lesson in the end but it really focuses on the material aspect of Christmas. Then again, what doesn't. The best way to describe the movie is ridiculous. But you can't fault it for that because that is sort of what it sets out to be and it is fun, no doubt at all. The physical comedy in the film (something I am a sucker for) is hilarious even when it is downright stupid. The script is the furthest thing from brilliant and yet you can't help but smile through the whole thing. Its just meant to be one of those guilty little pleasures that I keep going back and forth in my mind trying to figure out if I had fun and enjoyed it or if it was just plain bad.If you read my reviews you know that I am a Schwarzenegger groupie. I love the guy which is why I was sort of excited to watch Jingle All The Way. This is easily one of his campiest films even out of his comedies. There is no doubt the guy is talented at comedic roles because his sheer presence in outlandish and yet real situations (like finding a TurboMan toy for his son) is funny sometimes inadvertently. He had to know this was bad though. His lines in this are just so ridiculous and his line delivery is excruciating at times. Still as other reviewers have said, he does still manage to get some classic lines in this. As if to add to the campiness you through Sinbad and Phil Hartman into the mix. Both of them are ridiculous and more annoying than anything else in their respective roles. I have to give it to Schwarzenegger because I think he really does hold the characters together. The mostly verbal battle between him and Hartman is sometimes amusing to watch and the physical battle between him and Sinbad is so silly that it works. Rita Wilson plays Schwarzenegger's wife and she is decent but underdeveloped in the role and just sort of there for the sake of a wife in the story. Jake Lloyd (remember Anakin from Phantom Menace) is the little boy and he's decent as well but also really campy and his line delivery is very stiff so fortunately for him everything else around him is campy too. And I have to mention the iconic Robert Conrad in a very amusing role as a police officer.In some ways Brian Levant is the king of cheeky and campy family movies. He has the live action Flinstones under his belt, Beethoven, Are We There Yet...he certainly has a distinctive style that works with some because those films and this one were financially very successful. The film is just trying to have fun and that is really all there is to it. It isn't brilliant and parts of it are very nearly terrible how can you dislike a movie that is just so much ridiculous fun. In some ways, it channels Home Alone in that crazy stunt sort of way and despite how ridiculous the entire TurboMan franchise is, they created something similar to Power Rangers that kids would truly be crazy for. We even get to see a little of an episode in the beginning of the movie and one of the best things they did was create this fictional superhero just for the sake of this movie. Jingle All The Way is ridiculous, silly fun so don't take it too seriously and don't look for a serious Christmas film and you'll be able to at least laugh. 6/10",
    "72": "Jingle All the Way is just a mediocre Christmas movie, nothing special or Oscar-worthy. I enjoyed the movie, but some parts just did not buy me in. The story is about a father played by Arnold Schwarzneggerand he must get a Turbo Man doll for his son. But, there is problem. The dolls are sold out and now he has to go against a crazy mail person, fake Santas, and nosy cops to get a Turbo man doll for his son in time for Christmas. As I said before, this movie is plain average. The script is OK. There are few cheesy moments and a few good moments. The music is not that good. it's just old Christmas songs that no one ever hears.I did like the action when there was any and the subplot involving Ted Maltin. I was cracking up every time Maltin came into the picture. Overall, I think kids will like this. I am not so sure about adults. I kind of liked it. I rate this movie 7/10.",
    "73": "Jingle All The Way is a 1996 festive comedy starring Arnold Schwarzenegger, Rita Wilson,Sinbad and the late Phil Hartman. The story is about a man named Harold(Arnold) who's desperate to purchase a Turbo Man action doll which is impossible to find as its sold all over the world. With just 24 hours to Christmas Eve will Harold ever get a Turbo Man doll.This film got bad reviews from the critics and honestly I thought it was a fun movie. It's no masterpiece or anything but still it's not as bad as the critics made it out to be.",
    "74": "This movie tries too hard to be a buckle in your seat laughing film, but it struggles to, because the jokes are never well-timed. When this movie tries to be heartwarming, it instead is cringeworthy. This movie also has one of Arnold's worst acting skills. The way he tried to accomplish humour made me faceslap myself. Also, there are some really mean spirited moments in this film, like how near the end (NOT A SPOILER), someone gets beaten up just because he is dressed as a character nobody likes. A show like Family Guy or South Park could of pulled this off, because they don't then make a cheesy \"heatwarming\" moment three minutes after a man was assaulted by a group of kids. I don't know, but this movie definitely isn't in Christmas spirit.I laughed once...so, I guess I give it a 2.1/10.",
    "75": "Jingle All The Way is neither the best or worst Christmas themed comedy. However, the film is totally ridiculous and over the top, it is a fairly wholesome and clean holiday fun for the whole family. It also is a comment on mass consumer Christmas frenzy, which shows the true meaning of Christmas...insanity. And Jingle All The Way is pretty insane, with Arnold going Power Ranger, fighting Sinbad and beating up bad santas with a giant candy cane. While this film is pretty corny and cheesy, it is also totally insane. My main man Arnie is up for the task and really gets into his role here. I don't think any other major action star could have pulled this off, but Arnold does and is hilarious here. Jingle All The Way is a guilty pleasure for me, but unlike a lot of crap that gets released during the holiday season, this is one film you won't forget.",
    "76": "As Arnold Schwarzenegger waited to be in Planet of the Apes - he's still waiting - director Brian Levant* (who is a secret box office goldmine between this, Beethoven, The Flintstones and Are We There Yet?), producer Chris Columbus and writer Randy Kornfield got him for this tale of a father wo just wants to get his kid the hottest toy for Christmas. Kind of like Cabbage Patch Kids or Power Rangers, except its Turbo-Man in this film.Mattress salesman Howard Langston (Schwarzenegger) has a lot of love in his heart for his wife Liz (Rita Wilson) and son Jamie (the chewed up and spit up by Hollywood future Star Wars prequels star Jake Lloyd), but he doesn't have the time to show it, what with how much work he has. His neighbor Ted Maltin (Phil Hartman in his last role; I still get angry about his death, a total waste) always shows him up in an attempt to woo away Liz. Howard misses every big family event, but on Christmas Eve, he has a mission: get a Turbo-Man no matter what.That same mission is shared by mailman and near comic book supervillain Myron Larabee (Sinbad). The two go near insane with the need for the toy by the end of the movie and the transition from real life to cartoon is complete as Howard dresses as Turbo-Man while Myron has on the costume of his enemy Dementor (Richard Moll plays the character on the TV show that opens the movie).With a cast that includes Martin Mull as a DJ, Robert Conrad as the same cop that keeps running into Howard, Jim Belushi as a mall Santa, Laraine Newman, Harvey Korman, Curtis Armstrong, The BIg Show** as a giant Santa, Chris Parnell and Verne Troyer, Jingle All the Way never stops moving, placing Arnold and SInbad in pitched combat throughout while giving some life lessons along the way.I thought I was too cool for Arnold's family films when this came out and now I can out myself and say that I was wrong. Sure, this gets wildly stupid at the end, but isn't that what these movies should be? I'm glad that I've learned to have fun with movies.*Levant is honestly critic proof. He said so himself: \"To read those reviews is an act of self-flagellation, but reviews be damned when you're at Blockbuster, and you're seeing family after family grab one of your movies off the shelf on a Friday night. I can't tell you how many times I've seen that.\"**WWE Films would make a sequel to this in 2014 with Larry the Cable Guy and Santino Marella in the lead roles. There are no other wrestlers involved, not Turbo-Man, as the toy in that film is Harrison The Talking Bear.",
    "77": "I thought this movie was not bad...a bit on the silly side but still humorous. The competition between Sinbad and Arnie was pretty funny and it's amusing to watch Arnold's performance in comedic roles. A nice Christmas flick for jokes.",
    "78": "I liked this movie, Arnold was good, Sinbad was fun, and Jake Lloyd was not bad. The story was good, and it's so memorable.\n* Put that cookie down\n* I'm not a pervert, I'm just looking for a Turbo -Man",
    "79": "Lots of laughs, physical comedy and heart. Not the most intelligent humor but will have adults and children alike chuckling aloud.\n(P.S. - watch with subtitles so you don't miss out on some very funny dialogue I'd missed in previous viewings)",
    "80": "Everyone remember when acts of domestic terrorism were hilarious? No? Yeah... Me either. You wanna talk about characters that hit with a thud of insensitivity, I have to think Sinbad's Postman needs to be on that list. This dude is trying to kill cops, murder kids and there was probably a puppy just off screen that he kicked too.Arnie making a bunch of Christmas puns and jokes though? Yup. I'm in.That's pretty much all it comes down to. This story is absurdly ridiculous but I'm down for the ride of Christmas Arnold and White Bread Sexual Assaulter Hartman. Yeah... Sexual assault here too. Forgot about that bit. There's probably too much nightmare fuel in this Christmas movie but Arnold punches out a reindeer and that's all I need! It's also like a secret Iron Man prequel? Yeah, that's... This movie is a lot. Watch it every year though.",
    "81": "I just looked at the rating and wow, a 4.6 is kind of low in my opinion.I thought this film was the perfect family film. It obviously does not measure up to the standards of Home Alone or any of those classic puppet Christmas Films, but this film is good in its own way. Howard goes to get his son the Turbo Man action figure only to realize it is the hottest selling toy of the Christmas Season.The events that Howard goes through to get his son the simple figure seem drastic and unreal, but it is a movie here, and most of all- for the kids. The scenes he is in involving him and Myron battle for the one toy are hilarious, there is definitely a Christmas feeling in this film, Phil Hartman is excellent as the bachelor Tad, and most of all: There is snow.Throughout the entire film, the father Howard (aside from trying to get the Turbo Man figure) has an inner struggle with himself concerning the promises he has made to his family- and he eventually does his best to keep his promises.",
    "82": "Arnold Swartzenegger stars in Jingle all the the way. A very cheesy Christmas film but I still find it humorous. There are a lot of cheesy lines in this film. SWartzenegger has a few cheesy lines, Rita Wilson doesn't have that many, Phil Hartman has a couple, and the little boy, well, of course he does.Swartzenegger stars as Howard, a father who can't arrive on time to his child's activities. And gets pulled over a lot. By the same cop. Anyways,one night when he's late for his son's karate class, he tries to make it up to him by buying a toy of a Superhero named Turbo man.Howard's wife asks him if he had bought it. It's obviously a no. So, the next day, Howard sets off to the city, and does everything to get this doll. He fights people, gets attacked by people, and even goes with these criminals dressed like Santa to get one. He also gets involved in a feud with a mail man named Byron(Sinbad) who is after the same toy as Howard is. And will also do whatever it takes to get the doll.Rita Wilson stars as Howard's wife. The late Phil Hartman stars as Ted, the next door neighbor who is always hitting on Howard's woman. That is obviously a mistake. He should know that the terminator is going to kick his ass.I like all of the actors in this film. Sinbad is a bit of a scene stealer but that doesn't make a difference really. Jingle all the way is a cheese fest, but it is a funny one. I should be giving it a two and a half but I am not because I sort of grew up with this movie. So I would feel weird if I did. It's not the best Chrisatmas movie. Definitely not. But it is fun.Jingle all the way:**1/2 out of ****",
    "83": "This doesn't seem like an Arnold film, but than again neither did Junior. This film should teach you a lesson though.  Don't wait til the last minute to buy the years hottest toy!  Funny characters and Arnies one liners are enough for everyone to like it.",
    "84": "Satires are hard to come by. Good satires are much more rare. Satires that fooled everyone, from the audience to the actors playing in the film are toughest to find. Jingle All The Way achieves just that. By throwing a social commentary joke over the heads of audiences instead of into their minds, and then by delivering a biting message that stands just as true today as it did when it first came out, Jingle All The Way went from disappointment to one of the most realistic holiday films ever, despite its lack of realism. The hypocritical statements are flying in this first paragraph, but the truth is almost everyone missed the joke, the main picture. What looks like pure family fun turns into commentary with an attack on commercialism and the American public buying into the scheme. Even if you don't want to look into the deeper details, why skip out on Sinbad and The Terminator going at it?Jingle All The Way follows a workaholic dad by the name of Howard who disappoints his wife and son year after year. After missing another karate practice, Howard promises to not only show up at the parade the next day, but also get his son the TurboMan doll that is based off Jamie's favorite television show, favorite cereal, and favorite hero. The catch is simple: it is impossible to find the doll since it's a massive hit. Not only that, but most shipments are not arriving on Christmas Eve (notice the setting getting a bit dangerous), therefore increasing the supply-and-demand. Howard is still determined to find the doll and not disappoint again. Christmas Eve turns into D-Day on the shores of stores across the nation.This sort of idea has always been present in television shows everywhere, but to take a simple concept and stretch it into a full-length motion picture is a challenge to the utmost level. Thankfully, we have good writing by Randy Kornfield, decent direction by Brian Levant, and the supervision of Chris Columbus (Home Alone, Harry Potter, Mrs. Doubtfire, Adventures in Babysitting). Looking past the seemingly heavy dosage of criticism against American society and Big Business, we see the cast throw our victim fathers into every possible awful and unfortunate scenario possible, and the range of ideas presented are amazing.Arnold Schwarzenegger must have a sense of humor, because he isn't afraid of embarrassing himself by getting beat up and pulverized by the holiday rush, a bitter mailman, and a Santa Claus that can scare blind children. His performance by no means is Oscar-worthy, but we see him with his determination like in his usual action films, but in a whole new arena, a totally different atmosphere, and that just adds a dosage of humor to the entire film. To see an action star have to claw his way out of a melee of people trying to get bouncy balls is priceless. Almost as rare as Schwarzenegger looking wimpy is Sinbad in a superb film. His performance as the disgruntled mailman just matches him perfectly, and his determination to get the doll is just as bad. Rounding out the cast is a bunch of underrated and/or B-list stars like the brilliant Phil Hartman, Rita Wilson, Robert Conrad, and James Belushi.Why in the world would anyone want to skip a movie in which we see a rumble involving an angry dad and a bunch of Santa Claus frauds running an illegal toy-manufacturing/distributing operation (Best scene of the movie for sure)? Why miss out on The Terminator take on a raging reindeer? Why skip out on a mailman posing as TurboMan's villain and flipping the bird to spectators during a family parade? With an endless amount of silly, over-the-top, brilliant moments in which represent Christmas at its truest, Jingle All The Way stands as the most realistic holiday movie ever, since it really shows what its all about. Forget the sappy messages you see in Christmas movies, it doesn't matter what you did, what illegal things you performed, how many assaults you have committed, as long as you get that gosh-darn toy for your child in Christmas, it will all be forgiven.Everything in this film, whether unintended or intentional, downplays the meaning of Christmas and all that goes on. There isn't a single decent Santa Claus in the film; they are all corrupt human beings with a different agenda. The stores are not trying to please anyone; they just want money for themselves and enjoy seeing people scrap for chances of earning a doll like starving dogs fighting over a hunk of meat. The main child doesn't say he wants his dad to stay home for Christmas, he says he wants a certain doll, and even recites the entire commercial, including the final words \"Batteries Not Included.\" Nobody is helping each other; everyone is fighting, pushing people towards aisles and toy displays. While the entire thing is comical, it truly does happen in the real world. There was even one pivotal scene in which Byron the mailman discusses the importance of getting that special gift; he compares himself to another child that got the hot item on a certain year. Byron is disappointed, grows up to become a loser; neighbor that gets the doll becomes a multi-millionaire.Can a Christmas without material possessions scar you and turn you into a loser? Or is it Commercial America making it seem that way? Is this film a perfect satire or did it accidentally become that way? While the clues are pointing towards lampoon, Levant looks like he really aimed for the heartfelt, emotional Christmas movie with the bittersweet ending. Instead, we get a film that predates (and apparently predicts) the Tickle Me Elmo, Pokemon, Playstation, and Furby holiday horror stories. From the campy introduction to the hysterical final showdown, it's a great movie for what it is, and after aging like fine wine, becomes something moreaccidental or not.",
    "85": "One of the most hilarious film of all time in My opinion is Jingle All The Way! It stars Arnold Schwarzenegger, Sinbad, Phil Hartman, Rita Wilson, Robert Conrad, Martin Mull, Jake Lloyd, James Belushi, Paul Wight, and Richard Moll. Arnold is very good in this film and he is funny. Sinbad is hilarious in this film. I amazed how big Sinbad is when he stands next to Arnold. Hartman is very good in this film too and he shows that he really was a quality actor. The wrestler Paul Wight who is a huge man also performed good. The action is really great and a lot of the scenes are really cool! The dialog is really smart in this movie. The music by David Newman is good. I really like this film and I think its one of the best! If you love Arnold and the other cast members and love Christmas action comedy films then I strongly recommend Jingle All The Way today!Movie Nuttball's NOTES:Here are some other Arnold recommendations: Conan the Barbarian, Conan the Destroyer, Red Sonja, The Terminator, Terminator 2: Judgment Day, Terminator 3: The Rise of the Machines, The Running Man, Raw Deal, Commando, Predator, Total Recall, Kindergarten Cop, Last Action Hero, True Lies, Junior, Eraser, Batman and Robin, End of Days, and Collateral Damage!",
    "86": "For me 'Jingle All The Way' was unfairly panned by critics and is similarly overrated by general audiences who consider it to be the Christmas classic it is not.I think it has a strong premise about consumerism and the need for guilt ridden parents to buy their children's love. It delivers a plethora of crazy shenanigans en route to a fun climax. However, so much of the humour and character moments either irritate or do not work for me. I appreciate comedy is in the eye of the beholder so others may appreciate the humour more than me.I have always found Arnold Schwarzenegger to be an enigmatic personality. When you see him out of character being interviewed he can be incredibly charismatic and funny, yet when the cameras roll on a movie set he can be wooden and with little timing. 'Kindergarten Cop' worked better as he was a straight man to the children, but as Howard he struggles to play the clown. He is better at the more heartfelt family moments, but they feel somewhat forced at times.I find the antagonist character played by Sinbad pretty annoying and does not work in combination with Howard. Their banter, feels quite forced and awkwardly timed.The positives for me include the characters played by James Belushi and Phil Hartman, who lift the quality of their material with strong performances. I also like how outlandishly it shifts in tone as the story unfolds. This might be unintended, but when you take Howard from his rock bottom Grinch moment to his action packed Turboman finale in a matter of minutes you have to enjoy the ridiculousness for what it is.I think young Jake Lloyd struggles with some of the dialogue but do not blame him at all. With child actors the onus is on the script to be suitable and the director to draw out performances.",
    "87": "If Arnold Schwarzenegger had not been the lead actor in Jingle All The Way, maybe I would've liked it more. He portrays his character in an awkward, out of place matter and sounds like he inspired Tommy Wiseau's voice in The Room. When considering the possibilities for a desperate father, hellbent on getting his kid something for the holidays, why did they have to go with such a tough guy like Schwarzenegger? Couldn't they pick someone who looks geeky and innocent like Rick Moranis? It's no fun when the desperation comes from some giant, intimidating man who, when smiles, appears to be in a permanent sarcastic state.Jingle All The Way remakes that faithful Christmas where Cabbage Patch Kids and Mighty Morphin' Power Rangers were selling like hot cakes in local toy stores. The mass sell out encouraged fights and I'm willing to bet many kids didn't get the one present they were hoping for. The story replaces the Kids and the Rangers toys with an ultra-cool TurboMan action figure equipped with the shiniest plastic around and five different phrases.Howard's (Schwarzenegger) son Jamie (Lloyd) wants nothing but a TurboMan action figure for Christmas, but Howard is such a workaholic that he completely forgets. His wife Liz (Wilson) is also getting tired of his \"work is more important than family\" attitude. Howard lies to Liz about getting the toy, and now spends his entire Christmas Eve frantically running around in search of comedic inspiration and a TurboMan action figure.The plot is very slim, and seems like it would be perfect for a twenty-two minute episode of Full House. You follow? Like Stephanie wants this gotta-have-it stuffed bear for Christmas, Jesse, Danny, and Joey try to obtain it on the twenty-third or twenty-fourth when it's out all across town. So, they return home with another similar toy, Stephanie opens it on Christmas and complains. The three men then tell her the true meaning of Christmas, and she becomes a bit happier, than by some miracle Kimmy Gibbler or someone gets her the bear and the credits roll.The same comic setup and ability could've been provided in twenty-two minutes, and didn't need to be extended into a feature length film. Jingle All The Way has the energy to make a fair attempt to carry the setup, as well as its ability to present its characters as likable people. What it doesn't do is show the true meaning of Christmas. The premise is very materialistic, and the characters always act on present emotions.This is holiday-fluff, and that's perfectly fine. Little kids will enjoy it, and parents will get the chuckle if they remember holiday shopping experiences like this one. It works both ways. Energy comes in mass amounts, the ending is cute, and colors are vibrant. But the fight scenes, like the one between Arnold and the con-Santas are tiring and relentless. Maybe next year, Arnold might try his luck with Black Friday.Starring: Arnold Schwarzenegger, Rita Wilson, Jake Lloyd, and Sinbad. Directed by: Brian Levant.",
    "88": "It doesn't always work, but surprisingly this oddball little Christmas comedy is able to not only age incredibly well- but also remain hilarious, heartfelt, and downright fun in all the right ways. I'm a huge Arnold fan, so when I discovered there was a classic christmas film with him, I knew I had to watch it. Apparently I watched it when I was little, but I have very little memory of the fact, still though, watching it today, I enjoyed it very much. The films flaws basically narrow down to two main things- typical family comedy cliches, and bad CGI. The bad CGI is a given, considering its 1996 and it wasn't like they were interested in spending that much money on something like that when they already had two huge stars. The family cliches are just annoying, because this film is so unique otherwise, and it feels they serve no other purpose than to continue the plot. I'm not at all saying the family element is overdone in this film, it is actually done quite the perfect amount, but in terms of the conflicts within that part of the story- I just think it could have been done a bit better. Besides that, I enjoyed the hell out of this movie. Its goofy, it can be quite over the top at times (in a good way), and it can also be quite satirical. Whatever humor you prefer, this film has it, and more often than not, it blends them together quite well. Arnold was a great choice in casting, his energy is great in this role. Sinbad is also pretty fun to in a fun little antagonist kind of way, but the best supporting actor throughout the film has to be Phil Hartman with his sleazy divorced husband character. In the end, Jingle all the Way deserves a better fate than what it got, and it still stands today in rights rightful place along other christmas classics.My Rating: 9.6/10.",
    "89": "This Arnold flick is so great in countless ways. Mainly because it is a kick in the nuts to our modern commercial Christmas. After seeing this movie, you have to admit that our way of celebrating Christmas is a tragic joke. It shows all these obnoxious little brats, brainwashed by commercials and selfish dreams. It shows the desperation of their parents, dying to satisfy needless means.It shows the decay of the western society, filled with egoism and evil. Arnold is extremely funny, and the rest of the cast is great for this story.A great scene is when Arnold punches a raindeer in the face. This is just what this movie is - a knockout for Santa.Every person who`s planning a materialistic Christmas (that means everybody)ought to see this brilliant movie. This is naturally no favorite among those who prefer a commercial Christmas, but I don`t think YOU want to stay in that group......not after \"Jingle all the Way\".Merry non-commercial and more religious Christmas!",
    "90": "Arnold Schwarzenegger does comedy again as he plays workaholic businessman Howard Langston, who promises his son, Jamie (Jake Lloyd), that he will get him a Turbo Man action figure for Christmas. When every store is sold out of them, he goes on a cross-city search for the toy and compete with a postal worker, Myron Larabee (Sinbad).There are lots of manic shoppers, people shoving others around, overly-excited acting and slapstick humor, making this one crazy film. The acting was overzealous at times and the script is slow in some parts. But, Arnold does play a pretty funny dad in the script and it is pretty entertaining seeing him go through so much misadventures in his quest for the toy, wondering if he will ever get to fulfill the promise.I thought Rita Wilson did a nice job playing Howard's wife, Liz, as did Jake Lloyd.It's non-stop manic entertaining, all to a very crazy and incredible climax! Grade B-",
    "91": "Despite what people may think, Arnold Schwarzenegger is a very versatile actor.  He can do sci-fi, action, and comedy quite well.  This is a very good comedic family film about a parent trying to get the perfect Christmas gift for his son.  The story is nothing terribly complicated, it's pretty much just what I said, with the usual twist and turn here and there.  Some of the humor is obviously for the children viewers while some of the humor is geared towards adults, so that they can enjoy the film as well.  There is also a fair amount of special effects in the film too, which were done pretty well.The acting in this film isn't anything to get excited about, but there area good amount of big names in this film.  Rita Wilson plays an excellent mother to Jake Lloyd and wife to Arnold Schwarzenegger.  Phil Hartman plays his usual weasel character.  Sinbad plays a great antagonist that you can't help but feel bad for, because he has nothing but good intentions.  Robert Conrad plays the cop that just seems to be everywhere.  And finally the great Jim Belushi as the crooked Mall Santa, small role, but done quite well.If it's a good family film and a happy Christmas film that you want, then this is the film for you.  Don't expect a deep, intellectual film, just expect a good children's film.  I hope you enjoy the film, thanks for reading.-Chris",
    "92": "Howard Langston (Arnold Schwarzenegger) is a true workaholic mattress salesman, who's been never been quite there for his sensitive son Jamie (Jake Lloyd). Since Howard missed his son karate class, he promises to make up for his mistakes if Jamie wanted an special gift for Christmas. Jamie wants an action figure of Turbo Man, the hottest Christmas toy of the year. Howard totally forgot to buy his gift. He is forced to go shopping on Christmas Eve, but Howard meet his match, an desperate postal worker named Myron Larabee (Sinbad). Which he turns out to be a major sicko. Now these two men are searching for this toy all over the city of Minneapolis. Howard also has to deal with his sleazy neighbour (The late Phil Hartman), who wants Howard's wife Liz (Rita Wilson).Directed by Brian Levant (Problem Child 2, Beethoven, The Flintstones) made an enjoyable, wildly crazy Holiday movie about commercialism. Schwarzenegger does his best with his role as the absent father, who tries really hard to get \"Turbo Man\" for his son for Christmas. Sinbad has some funny moment as Howard's arrival. But it is the late Hartman steals the show as the womanizer neighbour. Although \"Jingle All the Way\" did so-so business at the box office, the film did went to have an loyal cult following over the years.DVD has two versions, the original theatrical version and the extended version with five minutes of additional footage. Which both versions are fine, probably die-hard fans of the movie will stick to the theatrical version. DVD has an sharp anamorphic Widescreen (1.85:1) transfer and an good Dolby Digital 5.1 Surround Sound. DVD includes three featurettes, two games and an photo gallery. I would have love, if they added an filmmaker's commentary track. \"Jingle All the Way\", it is an fun movie to watch during the holidays, along with \"Richard Donner's Scrooged\", \"National Lampoon's Christmas Vacation\", \"The Ref\" and \"Bad Santa\". Which all these holidays movie are darkly humorous. \"Jingle All the Way\" is notable for being Schwarzenegger's last comedy. James Belushi (Schwarzenegger's co-star from \"Red Heat\") appears in a amusing supporting role as a con man, dressed an Santa Claus. Don't miss it. (****/*****).",
    "93": "Jingle All the Way is a comedy film directed by Brian Levant. The film stars Arnold Schwarzenegger, Sinbad, Late Phil Hartman, Rita Wilson and Jake Lloyd.A salesman, promises his son a Turbo Man toy for Christmas. He is forced to fight every parent and travel all over town to get the toy after he forgets to buy it.The best way to describe this film is that this is so bad that it's good. The film is indeed filled up with some of the great funny scenes and the comical and Hilarious chemistry of Arnie and Sinbad is the main highlight of the film.Plot of the film is good and the execution is superb, being a film on the relation of father and a son the director hasn't wasted time to make the film look emotional and had made the film light, comic and funny.Acting is terrific and is the main soul of the film. Screenplay is engaging and climax is probably the strongest part of the film.A must watch light hearted family film. This film surely will be a guilty pleasure for many.",
    "94": "Howard Langston (Arnold Schwarzenegger) is a workaholic mattress salesman. He constantly disappoints his kid (Jake Lloyd). For Christmas, all he wants is a Turbo Man toy. Howard promises him before he could get his hands on one. Now he must battle everybody including mailman Myron Larabee (Sinbad) for the sold out toy.This is a joyless movie. There is a lot of slapstick comedy, but there is a central problem. Schwarzenegger doesn't fit this character easily. He's literally arguing with his little kid. It's very tiring. And I'm tired of this lying unlikeable character. That's why this doesn't work.And Phil Hartman is completely ridiculous. It makes no sense that anybody would be scared of competing against him. It's an obvious character with a standard look. He needs to be a sexy hunk.Sinbad is completely schizophrenic. Sometimes he's reasonable and nice. At other times, he's a crazed maniac. I rather he just be the crazed maniac all the time.This movie could have a good message about commercialism. But all it does is ride its coattails. Not to mention that there were other options. Why not try to buy the Turbo Man life size cardboard advertising? That would be a GREAT gift. Even with better casting, this is still a bad cheesy movie. Everybody and everything is ridiculous and stupid. And the final battle just get WAY too stupid. It is a hopeless endeavor.",
    "95": "If you haven't seen Jingle All the Way yet- upon it being its tenth-year anniversary- be warned, it's not one of the better family Christmas movies made. Matter of fact it's one of the worst, certainly in the field of Arnold Schwarzenegger's non-action film work. Gone are the actually funny lines and scenes to be found in Arnold's comedy collaborations in Ivan Reitman's films, and for the most part just really goofy sequences of action and suspense, leading to an ending that is about as ludicrous as can be (it's actually funny, in an unintentional way, how all of the main characters are duped as to who is Turbo-Man until the figure takes off his helmet, heh).Arnold plays a so-so father to a boy who just wants one thing for Christmas, aside from a loving and attentive father, which is the Turbo-Man action figure, the biggest thing to hit the shelves of the season, or maybe any season. The dummy he is, he thinks he can get a Turbo-Man on the 24th of December, when everyone is outside waiting for one in the packed holiday shopping frenzy. The filmmakers mean for this to all be a comment/satirization of the whole frenzy, but it falls flat upon it having to be very 'kid-friendly'. It doesn't help matters that Sinbad is a major player in the picture, as an also out-of-touch postal-worker dad who is also vying for a Turbo-Man, at all costs. I never really found him much funny on his own show anyway, and with this script he doesn't do that much better with scenes that are forced with the comedy.Maybe a little better is Phil Hartman, who probably has the best line of the whole movie from my perspective (when he finds out Arnold's character is caught red-handed with his own Turbo-Man doll kept under his tree), \"you can't bench-press your way out of this one.\" But even he is subservient to a character who is too thin to even fit into a one-dimensional character of the 'very kind and generous but really sleazy' dad of the bunch. In the end, after a daring feat of unexpected do by Arnold in the Turbo-Man costume (wackiness, of course, brought the costume upon him, among other contrite comic conventions), the very last bit with the son is just that much more insulting. While once or twice I did feel that the comedy did work, if only on a very stupid, base level, like when Arnold has to face off against an actual reindeer, or parts of his trip into the world of Santa con-men, it's really a flat endeavor that only has gotten lesser in quality years later.When I was younger and watched it even then I thought it was just 'ok'. Today, I don't see it as being the complete bomb like Schwarzenneger's next film in 1997 would be (Batman & Robin), it comes close, as one of those studio pieces of product tripe that come through the wheel-works at the \"most wonderful time of the year.\" Maybe if nothing else is on TV it's worth several minutes to see if it might be your cup of tea. But for me, it's not something I really want to watch again anytime soon.",
    "96": "As a fan of Arnold it was hilarious seeing him run through this silly Christmas flick. One liners and all the Terminator is here to cause laughter :D This is no more no less really, just a funny Arnold flick. There were a few unnecessary bad words but overall the film contains a good message. It may come out as ridiculous at first but look at it. Some things it says are true. Most of us have done the last minute Christmas hunt for a silly plastic toy. The film just shows this in a comical matter. The extreme measures these two men show to get this toy only makes for more fun.All the actors performances were nothing outstanding but just what you would expect. Considering the content of this film you can't really go anywhere but down acting wise. The actors filled their roles well and their is no one else I would have liked to see more as the father then Schwarzenegger.The film also shows how some people go all out on Christmas but they fail to get the true meaning of what it is really all about. They fail to teach their kids what really matters, instead appeasing them with insignificant toys and games. The grand Turbo man display in the Christmas parade leaves one thinking, has Christmas got that commercial? I guess I am taking this flick to seriously though, considering how ridiculous it is.At points the over the top nature of the film, such as Arnold flying in the turbo man suit, left me shaking my head. However it left me laughing hard more then not. Its a good break from all the serious films that always get you down. Lets face it, this kind of silliness is nice sometimes. You can just laugh out load and not worry about all the hidden meanings and such.I saw the film expecting stupidity and I got a lot of laughs! For a fan of Arnold or anyone looking for a fun laugh I'd suggest you go out and rent or buy this. Appropriate for the kids too!",
    "97": "Your enjoyment of this film will more than likely come down to three things:1) Whether you think Arnie can do comedy.\n2) Whether you find Sinbad funny.\n3) Whether you think comedy violence is funny.If your answer to those three questions is yes then I'm sure you'll love this Christmas film.For me though it was a decent idea stretched to breaking point, with lots of silly scenes, almost sketches, pieced together.Arnie does his best, but the constant need to turn this seemingly nice guy into a violent one for no real reason was silly. Phil Hartman has all the best lines here, and sadly I didn't find Sinbad remotely funny, which is a shame because I've liked him elsewhere.It's an acceptable enough Christmas film, but you'd really have to be in the festive mood.",
    "98": "I want to start off by saying - I don't get super into Christmas like some people do. When I was a kid I would write out a list of toys I wanted, not be able to sleep the night before, etc. But now as an adult, I don't find it exciting anymore. In fact, I think the holiday season is quite repetitive. I don't have kids of my own, so there's really no reason for me to do Christmas activities. I currently work from home, and I'm happy I no longer have to attend workplace Christmas parties. I hated that dumb white elephant game. And of course my coworkers tried to make me feel guilty when I said I didn't want anything to eat. Just to appease them I would put food on a plate, converse for a little while, then sneak off to the kitchen/break room and use a fork to scrape the food off of my plate into the trash. I spend the holiday season relaxing, and I wouldn't have it any other way. I just mail people Christmas cards and that's it. So considering I'm not a Christmas fanatic, for me to enjoy a Christmas movie so much to the point that I watch it every year, that's really saying something. I find most Christmas films to be stupid or too childish. I watched Christmas with the Kranks one year. It was lame and forgettable. I never liked the Grinch. The Santa Clause was nothing but innuendos and flatulence jokes. On the other hand, Jingle All the Way is unique in a sense that it contains humor both adults and kids can enjoy. Arnold Schwarzeneggar plays Howard Langston, a workaholic father who promises to get his son Jamie (Jake Lloyd) a Turbo Man action figure. Unfortunately, he waits until the last minute (i.e. Christmas Eve) to go out and make the purchase. Every store he goes to is out of stock of Turbo Man, so he goes on a mad dash around the city trying to find one. He meets a nutty postal worker named Myron (Sinbad) along the way, whose rant at the beginning of the movie had me laughing so hard that tears were coming down my face. Meanwhile, Howard's next door neighbor, divorced single dad Ted (Phil Hartman), is acting flirtatious towards his wife Liz (Rita Wilson). The movie was inspired by the real life sell-out of the Cabbage Patch Kids and other toys. I know some people think it's awful because it portrays the commercialism of Christmas. I'm of the opinion that Christmas is commercialized too. But I feel like Jingle All the Way is a satire of the commercialization. I got the impression the filmmakers were trying to show the audience how ridiculous people behave during the holiday season. They're willing to sacrifice their mental health and physical safety - sitting in bumper to bumper traffic on their way to the mall, spending copious amounts of money, nearly getting trampled - just to buy their kids gifts. It's toys they're going to get bored with in less than a year anyway. If you're a person who's not a huge fan of Christmas movies, then I highly recommend this. It's not corny, eye roll inducing, or clichéd. It's also an excellent choice for people who don't have children.",
    "99": "Although I can't say \"Jingle all the way is the greatest movie ever made, it is a film that's good for what it is: A Christmas comedy! Starring Arnold Schwarzeneggar, Phil Hartman, Sinbad, Rita Wilson, and Jake Lloyd, it's a film about a father (Arnold) who, getting buried in his work and missing the important things in his, forgets to get his son the Christmas gift he wants most of all: The Turbo Man action figurine doll. Now, having to duke it out (quite literally) with other parents who waited to the last minute, including a deranged mailman (Sinbad) who are desperate to get their hands on the hottest selling Christmas toy ever. As expected, plenty of high jinks ensue, from Arnold repeatedly running into (and getting on the bad side) of a certain traffic cop, to Sinbad's crazy antics, and a certain conspiracy involving shady Santas (one of whom played by Jim Belushi) selling counter fit toys. Plus, we get to enjoy a performance of the late, great Phil Hartman as a neighborhood handy man who's trying to put the squeeze on Arnold's wife (Rita Wilson), and makes us miss the man that much more. Now the movie does get a little ridiculous near the end, and when you see it you'll know what I mean. But, at the same time, considering this is Hollywood one has to be willing to suspend disbelief a little bit here and there. And besides, what's a little ridiculousness going to harm? Just sit back and watch for the comedy and Christmas season.",
    "100": "It's easy to look at Jingle All The Way and see a mess--for many years that's how I viewed the film. But after a recent re-watch, I was struck by how well the emotion is set up and the sincerity with which Arnold Schwarzenegger throws himself into the role.For a very basic overview, this flick focuses on Howard (Schwarzenegger)--an overworked businessman who is failing his family over the holiday season. Young son Jamie (Jake Lloyd) cannot rely on him to be present for anything, while wife Liz (Rita Wilson) is spending more and more time with smarmy neighborhood bachelor Ted (Phil Hartman). When Howard ventures out in search of the hot new Christmas toy to redeem himself, he encounters a mad scramble in Minneapolis-St. Paul--and a similarly obsessed postal worker (Sinbad)--all in search of the same Turboman action figure for under the tree.Ostensibly, Jingle All The Way is a kids movie--and at times it really shows. Slapstick humor and ridiculous stunts abound. Nothing wrong with that, except...Somewhat oddly, the film has a really strong emotional setup. Who can't relate to being a child, seeing your parent as a hero, and inevitably being let down? There are some very real, emotional moments here that are only boosted by the spirit of the holiday season it all encapsulates. Only helping matters is how genuine Arnold is in everything he does on screen. He's as good in the tender moments as he is during the physical stunts.So, Jingle All The Way created a bit of a schism for me (this being before Pixar set the standard of children's flicks that can equally be enjoyed by adults): a genuinely emotional holiday movie concept with the wackadoodle antics one might expect out of a Saturday morning kiddie matinee. You'll somehow be simultaneously laughing, feeling, and rolling your eyes all the way through this one.",
    "101": "Arnie continued his quest of mixing bone crunching action films with kid friendly comedies since he made Twins.'Jingle All the Way' wants to take pot shots at the over commercialisation of Christmas when each year the must have toy is highly sought after and always in short supply.Arnie plays a busy executive who forgot to get the Turbo Man toy for his son and then rushes around at Christmas Eve trying to track this must have toy down.Hot on his tail is Sinbad, another father looking for the same toy. In fact Sinbad a postal worker is going crazy leading to several slapstick fights, even being held up by the police at one point.Phil Hartman makes one of his final film appearances as the maybe too creepy neighbour trying to entice Arnie's wife.The film ends with Arnie appearing in a parade dressed as the real Turbo man and being unrecognised by his family despite a heavy Austrian accent!It's a lightweight, easy going silly Christmas film. Not too smart or funny. There is better slapstick in the Home Alone films and the satire is mild.",
    "102": "First of all, the reason this is my second favorite film is because A Christmas Story is, in my opinion, the best X-mas movie of the last 30 years. That being said, on with my review. I went into this movie expecting a few laughs and what i got was much more. This is easily Arnolds best comedy film. He and Sinbad are a terrific combination in this film about two fathers from different walks of life trying to buy their sons the most popular X-mas toy .........ON Christmas EVE! That plot alone is funny.I was able to laugh at this film as it reminded me of the great Cabbage Patch fiasco of '82 or '83 (so long ago) and i remember seeing news footage of kids and adults being treated for injuries from being trampled on. This film takes a comedic look at what we as parents will go through to make our children happy. Great film!!!!",
    "103": "I thought that Jingle All Way was a great movie.They say that its a family film,but it has some stuff that might be offensive to some people,a dear gets punched,stuff like that.The comedy material is extremely funny,basically because Sinbad was in it.Lots of the stuff is funny,but parts like when Arnold Schwarzenegger says \"Poor baby\",or other stuff like that,was just funny because Arnold says it.Other stuff like facial expressions can be found funny,most of the facial expressions in the movie are done by Sinbad.The acting was pretty good,Arnold Schwarzenegger doesnt play the bad-ass in this movie like he usually does.Other co-stars such as Phil Hartman,Rita Wilson,and newcomer Jake Lloyd do give pretty good performances.The plot is pretty good,but it kind of maintains a Liar Liar quality to it.Like in the movie Liar Liar,Arnold Schwarzenegger's character goes along the lines of Jim Carrey's character in Liar Liar,a father tells his son that he will do some stuff with him,like be there at important events,but never shows up.Like I said,some animal groups like p.i.t.a would get offended by some of the stuff,for instance,schwarzenegger punches a deer in the jaw,and he gives it beer.The whole concept of the film was very clever.One of the funniest parts in the film was when Arnold punched the deer.Overall,Jingle All the Way is one of my favorite comedys of all time. 10 out of 10.",
    "104": "This is Arnie at his best. If you seem Arnie in \"Twins\" and/or \"Kindergarten Cop\" thing you will be prepared for this movie.Howard Langston (Arnold Schwarzenegger) and estranged father and husband must get it out with Myron Larabee (Sinbad) over the last Turboman doll. Howard's son wants this more than anything else for Christmas and Howard is out to please his son, so is Larabee. The story starts from friendly rivalry into down and out superhero knockdown drag out.Will anyone get what they want? Watch this movie and find outEvery once in a while, I thought this movie might be a little over the top but after watching it a couple of times I realized that it was well put together and I would not change a thing.Your sides will jingle all the way.",
    "105": "It is hard to say whether or not the cast and crew of this film knew what they had on their hands when they began production in late 1995. What is easy to say, however, is that their combined efforts have created the defining film of the 1990's, paving a way for thousands of films to follow. In history it is often hard to pin point and exact time in which everything changed forever, but Jingle All The Way provides an exact date, November 22, 1996. In the vain of such masterminds as Spielburg, Scorsese and Copolla, Brian Levant ignites so many powerful emotions during the coarse of the perfected time (of 85 minutes) that watching this film is like discovering yourself. It brings out so much personal history effortlessly and shows us what it means to be human. Casting Director Judy Taylor shines here with her impeccable choices of future starlet Jake Lloyd and her spot on choices of Schwarzenegger and Sinbad as the leads. It is especially masterful in the casting of Schwarzenegger who seems more vulnerable here than in any other performance either he has given or any other actors in 90's cinema. The character of Howard Langston is really a powerful metaphor to the common day workingman. He is tired, over worked and under appreciated. Schwarzenegger reminds us of all these traits without over acting, which shows his artistic genius. Speaking of sheer genius, Sinbad gives a tour de force performance as a rattled post office employee, just trying to please his son. If Schwarzenegger is ying, Sinbad is his perfect yang. The two play off each other's energy in an entirely unique way that has not since been repeated in film. Not only does this film have an unbelievable cast, but the locations are inspired and show that there are still some cinematographers who are doing their jobs. The locations are some of the most beautiful in all of film history. The locations of the film actually take it from just a masterpiece of cinema but a masterpiece of art. All in all, no other film will or can make you cry, laugh, smile and become shocked than Jingle All The Way. This film single handedly revived the drought that the movie industry was dying from.",
    "106": "I think the main reason I liked this movie is because it delivered what I asked for. It not to be dull, sort of boring, and kind of cheesy too like most Christmas movies are. And thank goodness it kept up it's end of the bargain. This is about what really happens if you wait to the last minute to get your kid a toy he's always been wanting. What happens when all Christmas Eve all you do it try to go looking for that one toy, only to find it's not so easy to please your kid as you thought it was and the true meaning between the love of a father and son. This is a wonderful movie with those classic characters we've all met in our life one time or another. It is also funny and there are points were your heart does start beating really fast just because of the suspense. It is wickedly entertaining and there is never, I repeat, NEVER a dull moment during the movie. And if you're worried about Arnold .S...don't worry. His acting is decent enough and he sure as hell won't ruin the movie for you. At least not that much if you really hate him. This is a very underrated Christmas movie, up there with Home Alone. Rent if you the holidays. I don't think you'll regret it.",
    "107": "Jingle All the Way is one of these films which is so bad that you can't help watching it. You know it's bad for you, but you can't help yourself.Howard (Arnold Schwarzenegger) is a workaholic salesman who neglects his wife and son. He promises to make up for it by getting his son's Christmas present, a Turbo Man doll. The problem is he left his Christmas shopping to last minute and ends up trying to get the most popular toy on Christmas Eve. He ends up going through hell, fighting grannys, nearly getting arrested, and ends up competing with a mad postman (Sinbad) and his next door neighbour and divorced superdad Ted (Phil Hartman (Troy McClure and Lionel Hutz from the Simpsons)). Howard tests his own moral compass to discover the true meaning of Christmas.Of course this film was never going to be very good, it's a slapstick, family comedy with one of the most wooden actors staring in it. The only modern Christmas movie I like is Elf. But as I said this film is so bad and so cheesy that you end up watching and laughing for all the wrong reasons. It's such cheap humour that it's unbelievable. I love to know what financial trouble that Arnold Schwarzenegger must have been in to do this movie? He was one of the biggest movie stars in the world at the time, staring in the Terminator Series, Conan series, Predator, True Lies and Total Recall, to this. I know he was trying to branch out of the action genre to do comedy films, but that really was a mistake. Arnie was not a comedic actor. Even the great Phil Hartman was unfunny in this film which is sad to say.The writing may as well been down by a computer, it was weak and robotic. Possibly a few words words was typed in and the writer just came up with a cheap screenplay. Empire have described the director Brian Levant as the worst directors in Hollywood. This is the man who made a career making lazy family comedies, Beethoven, The Flintstones (ruining a classic cartoon), Snow Dogs and Are We Done Yet (a sequel to a rubbish film in the first place). All his films just focus on bad slapstick. Luckily he doesn't have much of a career now.Entertaining for all the wrong reasons.",
    "108": "STAR RATING: ***** The Works **** Just Misses the Mark *** That Little Bit In Between ** Lagging Behind * The Pits After going back to what he did best for a bit in the 90s with action films like True Lies and Eraser, Arnie decided to have another pop at the family comedy genre with this 1996 Christmas offering. It turned out to be both a unanimous critical and commercial disaster and, having finally given it a pop for the first time today, I can see why.Howard Langston (Arnie) strives to provide for his family with his busy, high-profile job at a toy-store. However, without even realizing it, it's coming at the expense of spending time with his wife Liz (Rita Wilson) and young son. After letting his boy down far too many times, Howard makes him a promise he vows not to break: he will get him a toy doll of Turbo-Man, a latest craze action figure that's sweeping the nation. Unfortunately, there's another father, Myron (Sinbad) who's also determined to get the toy for his boy. It turns into a desperate battle between the two men to come out on top and get the toy for their child.Serial offender Brian Levant, the man behind obnoxious kiddie fare like Problem Child 2, is back at the helm here. And he displays the same repellent lack of values and morality he displayed in that film, with jokes here involving violence, bomb threats and even paedophilia. Arnie's cynical, wise-cracking act really doesn't work here, with one or two scenes really coming off the wrong way. Sinbad, as a loud-mouthed, obnoxious arch-nemesis is really charmless and unlikeable. In terms of performances, the only one that comes close to successful is the late Phil Hartman as Howard's obnoxiously clean-living, infallible next-door neighbour always managing to out-do him at every turn.The film could have found a more touching edge by putting in some commentary on the commercialization of Christmas, but instead just comes off as a loud, garish celebration of America's over-blowing of the festive season.Ultimately, after listening to every other critic slam Jingle all the Way for being as truly poor a film as it is, I can only be angry at myself for so foolishly throwing away an irretrievable hour and a half of my life that I could have used to do something much more constructive. *",
    "109": "At last we have a movie that celebrates the TRUE meaning of Christmas, capturing the spirit and the essence of all that is dear to so many.  What a wonderful gift, a holiday treat that can't be beat, and you can buy it at your local mall.  Actually, all sarcasm aside, `Jingle All the Way,' directed by Brian Levant and starring Arnold Schwarzenegger, is one better left on the shelf of the video store or in the bargain bin of your local Walmart.  Because a more sickening paean to commercialism has never been committed to film.  The plot (excuse me?) concerns young Jamie Langston's (Jake Lloyd) wish for the Toy of the Season, `Turboman.'  Mom Liz (Rita Wilson) leaves it up to all-too-busy-businessman dad, Howard (Schwarzenegger) to make the purchase.  But Howard procrastinates (lying to Liz that he has-- don't worry!-- the toy already in his possession), and by the time he gets to the mall on Christmas Eve, guess what?  Turboman is sold out!  And so begins the real adventure of the story, as Howard bazookas his way through mall after mall, toy store after toy store, in his desperate attempt to lay his hands on a Turboman.  And, like Tennessee Ernie Ford once sang, `If you see me comin' better step aside--'  Because no one-- man, woman, child, dog or reindeer-- had better get in Howard's way, because he's comin' through!  At any cost, Turboman will be his!\tUnfortunately, that cost is pretty high, but not necessarily for Howard, but in the price the audience must pay to sit through these uninspired and unimaginative ramblings.  Working from a screenplay (I imagine there had to be one, but by whom I have no idea, nor do I want to know), director Levant delivers, if not a mean-spirited, then at least a `spiritless' movie that is nothing less than the antithesis of the Christmas spirit.  Even after peeling away the superficial layers to get to the heart of the story, you're left with nothing but empty peelings in your hands, because deep down, there's nothing there but a black hole (which is where this whole thing belongs, except that it would cause such a tremor in the Force that the entire solar system would probably be upset).  `Ernest Saves Christmas' had much more to offer even than this.  At least `Ernest' had some heart.  And how you can make a `Christmas' movie without any at all in beyond comprehension.  Was this, perhaps, a feeble 90s attempt at being so `politically correct' that in some convoluted way greed and violence were deemed an appropriate substitute for the more traditional expressions of the season, so that those who do not keep Christmas would not be offended?  Is Howard supposed to represent a typical 90s father?  I think (and fervently hope!) not.  \tOne thing is certain, Schwarzenegger's career has nowhere to go from here but up.  As if it matters.  The Terminator himself will always `Be back!' It's just a shame that someone who is no doubt a caring father in real life would allow a travesty like this to become part of his legacy.  It would've taken an actor with some real depth to put anything like a positive spin on the character of Howard, and Arnold just isn't that guy; he just doesn't have the chops for it, try as he may.  His portrayal is cheerless and uncharismatic.  If there is anything about Howard with which anyone in the audience will be able to identify or relate, my guess is they will deny it vehemently.  it's a sad commentary to have to note that `The Terminator' had more heart than Howard.\tAs Howard's rival in the quest to score a Turboman, Sinbad gives a sinfully bad performance as a postal worker father in the same boat as Howard, going postal in his bid for the toy.  Suffice to say this is one that would be better removed from his resume.  Alas, count Sinbad as another victim of this heartless effort.\tThe supporting cast includes Phil Hartman (Ted), Robert Conrad (Officer Hummell), Martin Mull (D.J.), James Belushi (Mall Santa), Harvey Korman (President) and Laraine Newman (First Lady).  Humorless, cheerless and heartless, `Jingle All the Way' is a seasonal misfire proffered by some misguided minds apparently attempting to be all things to everyone.  In retrospect, the guy who gave the green light for this one should be run out of town on a rail.  Now, if not sooner.  When Lincoln said you can fool some of the people all of the time, he wasn't referring to this movie.  Because this one isn't fooling anyone, any of the time.  I rate this one 1/10.",
    "110": "Howard (Arnold Schwarzenegger) is a successful businessman with a lovely wife (Rita Wilson) and a darling son (Jake Lloyd). Yet, he puts in way too much overtime, neglecting his family at times. On the way to his son's karate exhibition, Howard is late and puts the pedal to the metal. Of course, he is stopped for speeding and the ticket process takes so much time that Howard misses the big event. His son is disappointed. More importantly, the only thing the young boy wants for Christmas is a \"turboman\" action doll, which Howard assured his wife he would secure. But, now its Christmas Eve, and not one store has a turboman doll anywhere. What will Howard do to gets his hands on one of these action dolls, to prevent his son from even more disappointment? Just about anything! Meanwhile, a perfectionist neighbor (Phil Hartman) is making some subtle but definite moves on Howard's wife. Will this be a happy holiday? This film is an acceptable holiday flick, yes, but it is not particularly memorable. Since the plot is mostly a mad dash for a doll, over and over again, the film can get a bit tedious from time to time. However, Arnold is one actor with genuine star power and his comic abilities truly carry this film farther than it should have gone. Sinbad is also on hand to entertain us, and Hartman, Wilson, and Lloyd hold their own, too. Then, too, the sets, costumes, and production values are fine indeed. Best of all, the ending is great, leaving the viewer with a nice, warm feeling. If you like the Govenator, you should not skip this one, as he is the primary reason the movie succeeds. Those looking for a \"new\" family film at Christmastime will find this one is not a bad choice, either.",
    "111": "Listen, I'm not going to be the one to pour opprobrium onto this Arnold Schwarzenegger seasonal feature. See, we're into December now and my wife likes to put the tree and decorations up early and watch Christmas movies throughout the month. Here was a major Yuletide movie film we'd not watched before so we were quite happy to settle down and clap our \"mince-pies\" on it.So Arnie is a high-powered, fast-talking, okay, maybe in his head he's fast-talking, sales manager still doing deals right up to Christmas. Married to the job, his relations with his young son and neglected wife are becoming frayed especially after he misses yet another of the boy's big-deal moments at a martial arts prize-giving.The only way he can rescue the situation and get into the lad's good books again is for him to somehow get his hands on this year's must-have Christmas gift, a play-model of comic hero Turbo Man. Assuring his wife he bought it weeks ago when she first told him to, of course he doesn't have it and oh yes, it's now Christmas Eve. And while you're at it, Arnie, better watch out for that naughty Neddy Flanders-type neighbour who has designs on your wife over and above a mistletoe snog. Naturally, all the shops are sold out of Turbo Man, so Arnie's mission seemingly impossible is to obtain the doll by any means necessary and get back to attend the big Christmas parade in town with his wife and son, but on his errand, he encounters a keen rival in an unscrupulous postal worker who's out to bag the same toy for his boy.It's no spoiler to say that Arnie's acting has all the emotion of a Yuletide log but the film doesn't overstay its welcome, is brightly shot with numerous Christmassy songs in the background and the situations the big guy winds up in, if not rip-roaringly funny are at least recognisably amusing. The ending does certainly take things up a notch as our hero literally becomes the hero to save the (Christmas) day.We have friends who absolutely love this movie and strongly recommended we watch it to get into the festive mood. If it was a Christmas gift, while it may not be that big one you really, really wanted, but think of it more as an accompanying selection box that you unthinkingly scoff and then forget about as you rush to unwrap the better stuff.",
    "112": "Jingle All The Way is one of the most demented holiday comedies I've ever laid eyes on. It stars a yowling, hopped up Arnold Schwarzenegger as a neglectful dad stuck in a mad dash to get ahold of a special Toy for his son on Christmas Eve, plagued by all kinds of random, inane obstacles including trying to pronounce words so he doesn't sound like he's got a mouthful of eggnog in every scene. He's an odd choice to play the role, and it's almost as if Jim Carrey or Robin Williams called in sick for a month and he picked up the slack. It's stupid, it's clunky, it's beyond ridiculous.... and somehow works perfectly. Ahnuld's amps up his awkward, oblong charm and blunders around like an Austrian bull in a china shop, but sells the movie in his own unbelievable way. He's promised his kid (Anakin Skywalker) that he'll get a him a Turbo Man doll for Christmas, which just happens to be the hottest item of the season, causing quite an ordeal for him as the days goes on. He's hampered by a sleazy mall Santa (Jim Belushi), an angry reindeer, millions of rabid shoppers, his smarmy neighbour (the late Phil Hartman) and a mailman (cringeworthy Sinbad, whose picture you'll find next to both retarded and unfunny in the dictionary) who also seeks the elusive Turbo Man. The finale reaches sparing heights of unapologetic implausibility and just a hint of touching, father son bonding between the terminator and future darth vader. I dare not touch the sequel (starring Larry The stupid Cable Guy) with a ten foot North Pole. This one was a bundle of silly fun though.",
    "113": "I don't normally enjoy formulaic silly family films, but there was something about this one that made it much more enjoyable than expected:Arnie playing a normal hapless Dad.the relatable hectic of the nonsense last-minute Xmas shopping for loved ones which many of us fellow hapless Dads fall into.the bonding between father & son.It all seemed to work, and I laughed despite the jokes being silly & obvious, and I felt moved by Arnie's clumsy attempts to be a good Dad.I bet had I seen this before becoming a Dad myself, it wouldn't have connected.",
    "114": "OK, so \"Jingle All the Way\" is really a kids film. There is a roughness to the cardboard characters and the stupidity of the decisions they make and interactions they have.That aside, I laughed out loud several times, and the film wasn't nearly as dumb as I'd feared it would be. I think you have to \"get\" Arnold Schwartzenegger to enjoy this film, though. He is such a tough guy but in this film he is constantly the butt of the joke. He must be a really good guy to let himself be portrayed like that.I would have rated this film even higher, because it truly is hilarious, but similar to Big Far Liar, another kids film that I found accessible and hilarious, the ending was dumb beyond belief, basically blowing out the film. I have to admit there were others... it was sort of like a series of little skits (The Blues Brothers) rather than a real movie at times.Who should see this film:-- parents who want a kids film they'll actually like for once-- Arnold Schwartzenegger fans, oh and see Last Action Hero, which is also highly underrated.-- comedy lovers who want a Xmas film to see, but only on a rainy day, a very rainy dayI'll give \"Jingle All the Way\" a 6 out of 10.",
    "115": "Since I have no life to speak of, I could easily list all the things that are wrong about this film, but IMDb doesn't let you type more than 10,000 words so I'll try to keep this brief. If you watch \"Jingle All the Way\" expecting a heart-warming family film for the holidays, you're bound to be more disappointed than... um... say, someone who read this sentence expecting a somewhat funny punchline. I have to be honest about this movie's flaws, you being my number one customer and all:1) This movie isn't funny. The only funny thing about this eggnog spill is that sometime back in 1996, George Lucas sat down in his Xanadu out at Lucas Ranch, popped this gem into his VCR, saw Jake Lloyd on screen and thought to himself: \"This is it. I've found the kid who could do justice to the role of Darth Vader\". Come to think of it, not even that's very funny. 2) This movie isn't heart-warming. In fact, it's more of an exercise tool for bulimia victims. They won't have to use their fingers or anything.3) What's with the rampant anti-dwarfism in this movie? Vertically challenged members of society are repeatedly tossed around as carelessly as babies with weed-smoking relatives. However, despite all of these flaws (and the 9,997 other ones that I wasn't allowed to list) \"Jingle\" is a mind-blowing experience for those with the right expectations. Like I said, if you expect a heart-warming and hilarious Christmas film, prepare to be disappointed. BUT  if you expect a film in which Schwarzenegger does some totally awesome Arnold stuff the way only he can, like:trying to play a caring father but coming off as more of a closeted paedophile fighting a huge, bare-chested Santa punching a reindeer in the snout then, my friend, you will walk away from the movie a better person, with a big, earnest smile on your face and a steady stream of drool running down your chin. Personally, I watched with the right expectations, and loved the flick, even if it did kinda make me feel like my soul had just been besmirched with bucket-loads of hot grease from hell at times. But overall, a very satisfying experience for fans of the garbage Arnold has been churning out every now and then between his good stuff. Think of it as a big-budget \"Hercules in New York\" minus the legendary bear fight. Like Arnold would say: \"Dees ees keewl!\"",
    "116": "This movie had some moments, nearly all during the beginning of the film so the movie runs out of gas fairly quickly and thankfully is Arnold's last comedy movie other than a small role here and there in a couple of movies. This movie has a fairly nice start as the movie has a guy who has forgotten to get his son the toy everyone has been looking for, some stupid looking turbo man thing that I would not have wanted in a million years as it looks less like an action figure and more like a doll. The best part in the film takes place when his wife asks him if he got the gift and the shear look of terror as he realizes he forgot. This film would have been good as maybe a thirty minute xmas special on television, as it is the concept is quickly stretched to the limits and the only thing that makes the movie watchable is the late Phil Hartman's role in this film as the near perfect dad who got his son the gift months in advance. Making the movie nearly unwatchable is Sinbad's character of the psycho mailman who is also looking for the gift. The movie plods along to the finish of Arnold flying around to pad the film even more and add action to a film that needed none.",
    "117": "Arnold Schwarzenegger made the comedy movie 'Twins.' Everybody loved it. The he made 'Kindergarten Cop.' Everyone loved that, too. Then he made the comedies 'Junior' and 'Jingle All the Way.' I guess the joke must have worn a bit thin as both were labelled as some of the worst films ever made. Now, I watched 'Junior' when it was released and admittedly the reviews were correct when they said it was a 'one-joke' movie. And, possibly because of this, I never got round to watching 'Jingle All the Way' until I found it on an online streaming service nearly twenty years after it had been released. And, as it was Christmas and I'd already watched 'National Lampoon's Xmas Vacation' I thought I'd give it a go. I guess because I'd heard so much negativity surrounding it I feared the worst, therefore I was actually pleasantly surprised.Now, don't get me wrong, 'Jingle All the Way' is no classic. If you're a fan of 'Predator' and 'Terminator' then you need to know that this isn't the 'action' Arnie on display here. This is definitely the 'comedy Arnie' who is doing his best to make fun of himself and the various clichés that have sprung up around his batch of movies and action films in general. He plays a harassed father of Darth Vader (well, that kid who played Anakin in the Star Wars prequels) who's always putting work over family. However, on Christmas Eve, he vows to get his son the one 'hot toy' of the year - a 'Turbo Man' action figure. And, as we parents who are annually forced to purchase that one mythical item for our children, we know you should never leave it till only a few hours before the big day to buy one.What follows is possibly every parent's (Christmas-related) nightmare where Arnie is driving round New York, visiting one toy shop after the next, desperate not to be shown up in his son's eyes by coming back empty-handed. I'd love to say that it's as funny as 'Twins' or 'Kindergarten Cop,' but it's not. However, that doesn't make it the worst film ever. The humour is pretty low brow and slapstick, but, if you're in the mood for something very silly (and it probably helps that you're a fan of Arnie) then this should keep you entertained over the festive period. Not all the jokes land and it's a bit corny in places and there are some gags that definitely feel dated, however that's due to bombs in New York not being a particularly funny subject of comedy in this 'Post 9/11 era,' but it does take a satirical swipe on consumerism and the shameless 'supply and demand' toy manufacturers employ when it comes to mass merchandising their products.It's also great to see James Bellushi reuniting with Schwarzenegger for an appearance as a 'bad' Santa. Ultimately, 'Jingle All the Way' was probably never worth paying full price for in the cinemas, so I can imagine audiences feeling short-changed with what they got. However, it's much more at home as being a film that's included in an online streaming service that you can put on in the background/ It's probably a film that children would enjoy more, due to the 'obvious' slapstick humour. Kids probably won't get the consumerism references, but at least adult will be able to get something out of it, too. It's probably worth saying that - as a fan of Arnie - the best I can say about this is that it's 'okay if you're in the mood.",
    "118": "I am 13 years old and a big fan of \"Saturday Night Live\", especially the reruns (which, sadly, are not on anymore). Phil Hartman has always been one of my favorite cast members and I had heard about this movie that he acted in from several people. My friend owns it, so we decided to watch it one night. I was five when it came out, and I bet a lot of five-year-olds saw it at the theater, but I just didn't.I had heard bad things about this movie. Some critic said that they just threw a few big names on the cast list and made a mediocre movie out of it (or something to that degree). I admit that I did think that a movie involving Phil, Arnold, and Sinbad would be weird since the three are nothing alike.So, as my friend and I sat down to watch it, within the first five minutes, I saw that there was some good adult humor in the flick and that it wasn't just for kids. The movie was a little cheesy in certain parts but I did cry at the end at the parade (don't ask why...I'm such a baby!)All in all, it was cute but very funny. I don't think this movie would've been very good without Sinbad. That man is hilarious. What ever happened to him? Also, it sort of reminded me of \"The Santa Clause\". The whole film was funny and enjoyable for someone of my age but it still brought me back to my childhood somewhat.If you get the chance, you should watch this.",
    "119": "Having seen so many other terrible Christmas films since first watching this one all those years ago, I was surprised that 'Jingle All The Way' seems somewhat better now.Arnold is Arnold as he is in pretty much everything else he's ever been in, but isn't that why we love him? We certainly don't watch for his Shakespearean diction or Patrick Stewart like poise and delivery. Maybe that's why I can cope with the film more now, because I have realised that I just need to watch it for what it is. He does run a bit like Harrison Ford does too - an old man with a spine injury, but they can both be excused for working so hard.The character of Ted is really distracting, because his voice is so well known as \"Hi, I'm Troy McClure, You May Remember Me From Such Films As. . .\" in 'The Simpsons' (1987-).It also doesn't help that Jake Lloyd is the same brat he was in 'Star Wars: The Phantom Menace' (1999). You can see how he would grow up to be (Spoiler Alert!) Darth Vader!It's a silly film with an action star running around on Christmas Eve trying to buy the one toy that no one can buy and being hampered by an idiot post man, who probably could have been cast better, whilst he also repeatedly gets on the wrong side of the police. But it also shows a father with a good heart who will do anything to prove to his family that he loves them despite dropping the ball numerous times before, so it has the Christmas film requirements all ticked off.It may be time to reboot and update it to show a mother who watches too much 'Sex And The City' and drinks wine with the girls all day while the Dad is working hard without the time to get anywhere, to bring it in to the 21st century, as there seems to be a lot of Dad bashing lately and especially in films and TV and even in adverts.Fun and family friendly without needing both eyes to watch it in the background or dip in and out of it while making Christmas Gingerbread or something.683.55/1000.",
    "120": "I've loved this feelgood Christmas film since first seeing it at the Cinema way back in 1996!!! Since then it's been one of my favourite Christmas movies, i grew up watching & loving Schwarzenegger so my childhood Action Hero starring in a fun,silly,feelgood Xmas film had me Hooked from the beginning.\"JUNGLE ALL THE WAY\" is so much fun, it's a Colourful cheerful xmas flick with a fun loving family man performance from the legendary Arnold Schwarzenegger as Howard Langston a desperate Dad trying to get the most popular Action figure (Turbo Man) for his son as his main xmas present, it's a fun filled Happy Comedy full of the xmas spirit & fantasy fun.\nSchwarzenegger is such fun on screen & he really is a Comic genius in this film, there's of course some nice sugary sweet scenes but mainly it's frantic xmas fun, the manic xmas shopping scenes are hilarious & crazy true, also we have a couple of comedy greats in the cast with Sinbad as a stressed out crazy mailman \"Myron\" & Phil Hartman as the sleazy next door neighbour mr.perfect \"Ted\" both are excellent fun!!!\nI adore this pure 90s beautiful Christmas fantasy comedy, it's beautifully filmed & very colourful.\nA Christmas CLASSIC",
    "121": "Most of Arnold Schwarzenegger's ventures into comedy have been at least amusing, but \"Jingle All The Way\" fails on pretty much every level; the comedy's weak and occasionally offensive (hands up everyone who really thinks jokes about bombs in the post are funny), Arnie and the equally painful Sinbad as his rival after this year's must-have Turbo Man make you lament the movie's criminal waste of the late lamented Phil Hartman, and the scene where the big guy goes whizzing all over the place as Turboman in the parade climax just seems like an excuse to fit in special effects (which aren't that special, by the way). And the emotional moments work just as well as the comic scenes - i.e. they don't. (The kid isn't a help either.)That's not to say there aren't any good moments; the end titles feature a great Brian Setzer version of \"Jingle Bells,\" a reprise of David Newman's Turbo Man theme - how many movies has this man given music better than they deserve? (a pox on the Amazon.com reviewer who described Newman's two cuts on the TVT album as \"filler.\" Critics with a clue about movie music are about as common as people who like Kelly Brook for her acting) - and a Nat King Cole song. And there is one genuinely funny moment... but that moment comes after the end credits have finished, \"Produced and Released by Twentieth Century Fox\" and all. I won't give it away, but it does prove that \"Jingle All The Way\" is a one-joke comedy in the worst sense of the term.",
    "122": "I first saw Jingle All the Way in 2018, and by that point, I had heard horror stories this being one of the worst Christmas movies ever made. Perhaps it was because I had no expectations for the movie going in, but I absolutely loved it, and now it's in my yearly cannon of holiday classics.Why? All of the actors are having a great time, and lean into the patently absurd script. Schwarzenegger steals the show, delivering quotable lines (\"PUT THAT COOKIE DOWN\"), great slapstick, and a ton of energy. Sinbad also delivers a surprisingly great comedic performance. Kids will absolutely love this movie, but there's plenty of humor that adults will enjoy too.The movie is *very* over-the-top; whether or not that's a good thing is purely up to taste. There's also a vaguely anti-consumerist message throughout the whole film, but the movie is the best when it avoids social commentary, says \"screw it\", and you end up watching a bunch of Santas fighting in a warehouse.A strong candidate for the most underrated holiday film, period. Give it another watch if you haven't already; high alcohol content egg nog will only enhance your viewing experience.",
    "123": "Not boring moments , this is for childs and adults with child minds ? I like 😊 could have more plot and film could be longer too...But this good movie which make you for good mood . Have to watch best of the 1990s comedy movies with Home Alone movie good to pair with ,this kind of movies they just dont know how to make anymore : Put away your smartphone while watching 90 s best Classics of the Hollywood Comedies ever made .Turboman is absolutely funny and exciting movie which is so underrated . World these days especially needs this kind of movies , more with warm comedy styleGenerally How many great Christmas movies there are ? This is one of them. Say hello to Santaclaus and Reindeers :DTurboman is here to blast your brains out !"
}