{
    "0": "It could've been way better but wow.I can't believe we got so many BAD ABSURD COMEDIES over a decade and this one came out of nowhere and hit so many the right buttons. Some dialog exchanges and some actings (especially the wife) are way too cheap but i ACTUALLY HAD FUN with the movie.Kudos to everyone involved. Just like the SP Pander episode, THIS should've been DONE. Not because of social message, JUST BECAUSE IT IS FUNNY.I also wanted to thank the makers for not putting unnecessary nudity and putting headphones on little girls ear when they use bad words. There were also some unseeable details like, it was something like ''The climate is about to burn you all any day''. I really hope we get more of these.",
    "1": "There's not all that much to say other that yes yes this is political comedy satire etc.... done well and doesn't pretend to be neutral or \"centrist\"\nreleased a little late perhaps political-issues-in-fashion -wise\nbut non the less hilarious.A little bit on the nose and not exaggerated per say rather exactly what you'd expect.(spoiler) some of the behaviors of characters get absurd\nsuch as for example a father just forgetting about what his daughter was exposed to like it doesn't matter\nis too absurd and unrealisticand the messaging can be a bit preachy/bland ,but overall the worst criticism i can give the movie is that it's a bit slow\nas in 2 hours long when there's no need for it to be\na hour-1.5 would've done\nit's not horribly drawn out but could've been a bit betternot the kind of movie one might like to rewatch it's just a simple funny plot executed well\nnothing more nothing less.",
    "2": "Solid B movie, makes fun of an absurd concept. FYI not family friendly at all. While I am a fan of daily wire, i did have some reservations about them doing a full length film. However, the film delivered plenty of laughs which is ultimately what you want out of a comedy. Has some cringey parts, which is to be expected from a new director attempting a comedy. Some of the cringe factor is just the fact that it's really on the nose of a terrible facet of reality right now. Most of it was the entire character of Gwen. I loved all the cameos from the DW cast, it was great. Overall would recommend if you've got 90 minutes to kill.",
    "3": "Most of the comedic scenes were in the trailer. Which why watch the movie if you can watch the trailer? Subject content is interesting. Not quite sure how much is satire or real views. Not sure to laugh or be shocked or both. This movie reminds of of \"Juwanna Man\" so we have already been there and done that. That movie was over 20 years ago and geared towards Black audiences so interesting to see it get repackaged for white conservatives and then do so well amongst viewers. (But Juwanna Man was hilarious). Now as for acting, it is mediocre at best. Feels like everyone is trying too hard. The material is there for jokes, it's just predicable with poor execution. Way too long and I wasted my time on this movie.",
    "4": "I love the DW, but this just wasn't it for us. Had huge potential and some funny moments. But this was not what I would call a \"conservative\" movie. There was talk of threesomes, scantily clad women that the camera zoomed in on, extra-marital sex, bondage, and at times it was vulgar and raunchy. Thought it was going to be clean and wholesome fun because some of their ads literally say that. It wasn't. It was oversexualized garbage. This is not for young kids at all. Had I known that going in my opinion might have changed a bit. I'm disappointed in the DW. Makes me question some of the people involved with this.",
    "5": "So this isn't my usual form of comedy. I'm not really into more vulgar jokes. But given the subject matter it's hardly surprising.Still it had some great moments. 1)The locker room convo with Winnie. 2) The final game. Adorable. 3) The twist ending. 4) The two unexpected cameos. 5) The expected cameos. 6) Matt Walsh smiling and hugging. Both awesome and unsettling.I'm mean ultimately it had its flaws but still pretty impressive for a movie that went from conception to premiere in nine months. Hmm. Was that a coincidence? Imagine how those flaws could've been polished up with a bit more time.Not exactly a family movie but it hit the real message without being cringe.I know plenty who hate DW will disagree with that last part, but I've seen far more cringy stuff the last five years from the other perspective.Everyone did well. Love it or hate it, you should see it before you judge it.",
    "6": "Not a DW subscriber so I saw it by a friend. We couldn't stop laughing! The acting is ok(especially considering the actors aren't actors),but the cinematography and editing are extremely impressive(especially considering it's a small studio). The storyline was also pretty awesome and at one point it went from hilariously funny to extremely touching and wholesome. The ending is very beautiful. I like the message this gives, while also making an enjoyable and fun experience,it's enlightening too. Could a professional studio done it better? Probably yes. But does that mean it isn't fun and enjoyable? Absolutely not! I loved every minute of it. Would suggest watching it with your boyfriend/girlfriend or spouse though,a lot of jokes you can each relate to each other. Enjoy the experience!",
    "7": "Hollywood is too chicken to release any comedy like Dailywire's Lady Ballers today. That makes this comedy one of its kind today, daring to tackle today's serious maladies in the most irreverant way. It's a movie that doesn't take itself seriously so that it can tackle the subject matters (gender ideology, child grooming, trans movement, cancel culture, etc.) seriously. While the 1st half of the movie seems rather haphazard and random, the 2nd half is when the movie really ties up all the loose ends and the heart of the story shows itself. The acting is a mixed bag - some actors are better than the others. But one who truly stands out in this movie is young Rosie Seraphine Harper - she delivered her role extremely well despite having some of the most difficult lines in the movie! This is a comedy that dares to be different, dares to tell the truth and dares to cop the flack, and for that, I give kudos to Dailywire. I'm sure their future comedies will be refined and come back even stronger. Great start for comedies in Dailywire!",
    "8": "I know that conservative media is few and far between. And when someone does manage to make a \"conservative \" movie or show usually it's lacking quality in cinematography and audio etc.. so I'm writing this review with the understanding that making a movie is hard. But that doesn't mean that any conservative movie is above criticism.First of all the trailer shows WAAAY too many of the funniest movie beats. That is automatically a no go, since you've exhausted all your cards before your audience has even hit play on the movie itself. This is a major problem in mainstream media films as well.Secondly this movie is entirely too long. This may be an editing problem as well but some jokes and scenes go on for way too long. It feels as though this movie is a series of \"bits\" strung together very awkwardly by extended scenes. Each bit is funny by itself, but it loses its momentum when dragged out.Thirdly, this movie takes too much time getting to the main plot. The opening of the movie is good and well paced but after that it drags itself out and you find yourself asking your family members \"how long is this movie?\" And then finding out you're not even halfway through. This is something that your audience should never experience. You want someone to sit down and be satisfied with the timeline of your movie. It's fine if you drag some parts out for suspense or for shock but it shouldn't ever cause your viewer to feel as if they have to \"get through\" your movie.Now another problem I had was the reporter lady and her character. She was used as a joking comment/criticism of the lack of honesty from journalists in our society. That's all fine and was definitely funny because it rang true to our current society, but her being the prime antagonist was a poor choice. Her character added nothing good to the plot. Honestly remove her and you miss out on nothing but a few bad sex jokes. She's supposed to be the driving force behind all this but the movie has already shown that the coach is willing to dress his team up in drag to win anyways, without her intervention. He signs his own kid up for the woman's race and intuitively the plot could've taken over for the reporters part and had the coach's character be the one to convince his team that they could dominate in all the categories. Clearly he was heading that way on his own, so why add another character? Unfortunately all she did was make the awkward scenes more awkward with her \"romance\" subplot with the coach.The other two characters I had a problem with was the brothers. I don't remember anyone's name (which is also saying something about the movie) and I don't care enough to look them up. I can't tell you a single joke I laughed at when the brothers showed up. Again they were there for sex jokes, like the reporter lady. I'm not saying you can't have crude jokes in your movie, but you could tell that the movie wanted more shock from the audience rather than laughter. It also muddled the message this movie was trying to portray. It's mocking a real life belief that men can become woman and that they can dominate in women's sports fairly. This movie is a comedy, but at its core it's really a commentary, and when you dumb it down so much that it feels like your brain has turned to mush after you've watched it, you lose the message in the process. Who's to say that this movie isn't mocking those who think that women can't be men? It doesn't take itself seriously enough to make a point which is what they were trying to do originally.This review is really long I know but I wanted to mention a few other critiques that I personally had1: when will producers realize that showing kids o no phones texting and adding the texting and tweeting noises en mass is not funny. Literally no teenager has their phone off of silent mode. If you do you're a weirdo. The better way to portray obsessed phone kids is to keep them silent and ignoring the coach while looking at their phones, maybe light giggling, or scowling as they harshly type a message out. Personally it would've been funny if they added a teenager clearly taking pictures of himself on snap chat because that is more realistic that your average stock text sound.2: The ok boomer thing has never been funny. Please let it die\n3: Matt Walsh's little \"bit?\" At the end of the movie entirely ruined his character. He was literally the best part of the movie. The ending with him and Candace had absolutely NO reason to be there at all. I get they wanted cameos from all the talking heads at daily wire but they should've stuck Candace IN THE MOVIE like they did with Shapiro,Cooper,Knowles,Walsh etc...\nAnd then revealing that Matt Walsh was actually not a vegan hippie high out of his mind was a stupid decision. I don't know if they were trying to tease a sequel or what but it was confusing and terrible execution.Now I didn't give this movie zero stars for a reason, there were positives.The video and sound were very good especially for a lower budget smaller studio.There were funny jokes before being ruined by continuation.Most of the actors did a good job. There was over a thing but not as much as one might think.The main basketball players facial expressions are hilarious. He did a fantastic job. Him and Felix were the best guys in this movie.The \"cameos\" by dailywire staff was for the most part funny and \"natural\"All in all it was not super fun to watch, but the concept and a few of the jokes were hilarious, and you could tell there was some passion behind this film. Producing media is hard in an industry where literally everyone is against you. Hopefully we'll see some improvement in the future.",
    "9": "Look, I'm not gonna come in and give it a 10/10. It's no Baseketball or Dodgeball, but it's got some genuinely funny jokes. More than a few times I had genuine hardy laughs. There's a few times it gets sincere and those parts are great. The ending is a little weak, but there's not a lot they could do with it and still is wrapped up pretty well. My least favorite part is a shameless ad thrown in which got a smile, but moreover a deep rolling of my eyes. They hit the audience with a lot of very true statistics, (just because you don't like what you hear doesn't make it propaganda). For their first attempt at a comedy this was pretty good, and makes me look forward to more from the DW. In a world where Hollywood is too afraid to make a decent comedy for fear of offending even one person this was refreshing. Like a glass of water in the desert. Maybe not an ice cold glass of water, but still very refreshing,",
    "10": "So I thought this was going to be one of those movies with a \"message\" that was more preachy than entertaining. Oh boy was I wrong! There definitely was a message in that art does indeed imitate life but while this is certainly true in this movie, it also brings with it pure comedy gold. From start to finish it brought both the laughs and some serious thought provoking subjects going on in the real world. The comedy style was very reminiscent of the 90's or early 2000's where I was not to over the top to get you smiling, and the acting was great and didn't feel forced which shows that the cast was totally into and have a great time making this movie. If you're looking for an old school comedy with a fresh coat of pain for the modern day then this is the movie for you!",
    "11": "This was the release that finally convinced me to try out Daily Wire+. From the trailer, I figured I might get a few laughs but the majority of the narrative would focus on getting the moral message across.Nope, I was wrong. Lady Ballers pretty much assumes you already know why the situation is messed up and, for 95% of the runtime, dedicates itself to just being entertainment. There are zero grand speeches about protecting the legitimacy of women's sports (though comments are made in passing), no moral grandstanding, no soapbox moments calling out damages done by ideology, there isn't even a magical resolution where the sanctity of the sport is upheld in this fictional alternate universe. Main character learns a lesson and improves himself, and that's it.And I think that's all it needs to be. It was genuinely funny throughout, and I laughed far more than I'd assumed I would. The comedic timing was much better than I'd anticipated and the cast was game, the pacing and the script were solid. It's not an instant classic. Just a really good comedy.",
    "12": "If you're a fan of the Daily Wire and their stable of commentators, this is a solid 10. Much like how early Kevin Smith movies were enhanced by an audience's familiarity with his \"veiwaskewniverse\", the instant recognition of the DW talent, and the issues explored in the film, strike a chord with anyone who considers the \"DW Backstage\" their Oscars ceremony.The script is also reminiscent, if not a little sharper and more mature, than early Kevin Smith films. In fact, this may be a film whose script is more entertaining to read than to see played out on screen.The biggest surprise of the film is a breakout performance by DW's god/king, Jeremy Boreing. I never would have guessed he could pull off a male lead, but his portrayal of the ne'er-do-well divorced former high school basketball coach in desperate search of one last win, is played with just the right mix of cynicism and integrity.The message of the film is timeless, even if the frame it's built on is a modern social issue;\n\"Winners are just losers that do the right thing\"",
    "13": "Considering that many of the actors are not actors, (and likely never will be actors),they did a great job. Considering that the production budget couldn't possibly have been even close to the amount of an equivalent Hollywood project, the only thing missing,(thank goodness were 21st-century edits. Considering that no one else had the guts to make this movie, any flaws are forgiven. The only things that bothered me were two or three lines that should've been re-done for clarity, and/or sync. DW was fully aware that this wasn't gonna make it to theaters; that's a wider audience's loss. Maybe TCM will play it eventually:^)",
    "14": "Hilarious movie in appropriate taste for the topic. In fact, it's perfect for the subject and absolutely brilliant! Outrageously funny, also heartwarming at times. The actors, all of whom are unknown for their acting abilities, at least by me, really pull it off well.And so many cameos by people famous for something else make it more fun, including Senator Ted Cruz, Riley Gaines, an award winning swimmer and activist for protecting women's sports, and Dr. Jordan Peterson, renowned psychologist and author.Be sure to watch to the end as there is a short bit after the credits are run. Well worth waiting for it!If you want to have a good laugh at some of the ridiculous things that are happening today and frustrating us on a daily basis, this is the movie for you. Don't miss it!",
    "15": "The function of comedy is to hold a mirror against society, to comment on it and to ridicule it where possible. This is exactly what the Daily Wire has set out to do and boy did they succeed. They created the most hilarious scenarios and the self-deprecating humour was spot on.Seeing the hosts of the Daily Wire play the roles that they did was hilarious. I understood it was created out of necessity, but the best bits are often created like that.The people that want to cancel this movie need to take a look in the mirror. Everything in life should be open for ridicule. When things are not allowed to be ridiculed then scary things will happen. We always need to be able to laugh about ourselves and the things around us.If you are king in your kingdom and there was a jester. Would you be laughing, or would you be saying \"off with the head!\"?Great movie. Very much needed for the times we are living in.",
    "16": "The best analogy is what my wife said, \"it's like Semi-pro, or Blades of Glory.\" I agree, in the sense that they are not great movies, but they will make me laugh. I gave it a 10 because Daily Wire had a lot to live up to for doing this film, and they clearly pulled it off, and well. I'm very excited to see where this film takes this studio, and how this success will drive their variety of future projects. Their kids app, Bentkey, is definitely respectable as well. Not all the way there yet, but for sure headed in the right direction. I love that the Daily Wire is providing alternatives to various forms of media, simply because it's necessary to shake things up when everything starts becoming the same.",
    "17": "I am reminded of comedies that used to go to unsafe and non politically correct places just to get you to smile and for the most part this delivers on that... granted in a tongue and cheek lower budget sort of way but even so.It was certainly pushed as a bit of a political statement and to poke fun at media, the entertainment industry, and it's multitude of sponsors but i came away from it smiling as it has a nice ending that they put some thought into. The cameo's by dailywire personalities made me chuckle as well.Definitely worth the overall watch and a good effort that pokes fun at our culture and direction in ways that average everyday people will be able to identify with.",
    "18": "I admit that I was skeptical, given who had made it, but it was actually pretty funny! I fully admit that I am a fan of most of these people in the movie in their day jobs, I just didn't have much faith in their ability (yet) to produce a good movie. Although I really liked Run, Hide, Fight! However, I was wrong. This felt like a throwback to the comedies of old that major movie companies might have actually made back in the day. I laughed out loud quite afew times, and the ending was really hearfelt.I hope a lot of people watch this movie, because it's good, and it sheds light on the ridiculousness of what is going on in our society right now, in a funny way, not in a mean way.",
    "19": "Watched this and was entertained, but it's not great movie by any means. I do not think that the Daily Wire has hit the mark with this film. They're always talking about Politics being downstream of Culture and that their hoping to get involved with the culture and change it. This film has too much over politicization to be smartly funny and effect the Culture.I enjoyed it once and will probably never watch it again. I would not say it was especially funny and I think this movie is really just for conservatives.Like Matt Walsh's \"kids\" book I think it overall is a missed opportunity of doing something that could have wider cultural weight.",
    "20": "Been looking forward to watching this movie. Haven't seen a good comedy in quite a while. If you have a. Sense of comedy. You can appreciate the subtle as well as the obvious displays of comedy here. I admit, I myself am a fan of The Daily Wire and a lot of the personalities and a lot of the content so I had a little bit of a bias for the creators of this that being said, I'm also somewhat jaded when it comes to film because I think a lot of content seems played out contrived and with an agenda or simply cheap low hanging fruit. But this movie didn't seem to have any of those issues. They had some really good writing and some very laugh out loud moments , I watched it with my whole family including people who are impartial to The Daily Wire, but found a lot of humor in this movie nonetheless. I'd recommend this to anyone and everyone. It's a good watch for sure.",
    "21": "The jokes are solid, but timing was off. There are some really good parts, but they are rare. Putting all the DW cast in, was the draw, but realistically, they aren't great actors as a whole.All the obvious, good jokes are there, but then they tried too hard for the weird stuff. Jeremy Boring does this routine where he can't kiss the other actress; I guess cause his wife wouldn't approve. It's weird. Go into acting, or don't. There is no middle ground.It has a low budget feel, probably cause it was. Still worth the watch, but nothing to get too excited about. I'll still watch the sequel.2 cars.",
    "22": "I'm going to make a few points here about the movie.Movie is like a bad comedy from the 90's-early 2000, like those stupid Ben Stiller movies, which is what makes it so good.Movie is a bit longer then it should be, editing/directing could be better.While bad comedies B movies are bad to the point they are funny, which is kind of thee point of those movies, this movie is really lacking in the acting department, which is sad, i think the idea and the general direction of the movie is solid.All in all, i wish Hollywood would make a come back for those type of movies again, so stupid it's funny, def worth the watch.",
    "23": "I can't believe that this is at all controversial! It is just straight up funny and poignant! Well done as a smaller production and released on a small platform. Jeremy Boring kills it as a coach and Matt Walsh is a very believable anti-character of himself as a chronic hugger. I can't recommend this film enough and welcome anyone to try to refute the utter truth it conveys. The fact that both of the teams become all male is the biggest punchline and point about how this would all play out if we keep ruining female spaces. Once again, this had to be made! Anyone who finds it \"hateful\" needs to make an argument that is cogent and logical. Keep it up you artful bigots!!",
    "24": "Lady Ballers is an outrageously over - the - top and hilarious response to the overly politically correct state of Hollywood today. This film is both irreverent and entertaining all at the same time. Sadly for many who want to watch it, Lady Ballers is currently only available to watch on The Daily Wire +. But hopefully some time real soon, it will become available to stream for the rest of the masses. I saw the trailer as an ad on You Tube, and I immediately began to laugh my you - know - what off! If you are one of those people who is in the fence about purchasing a subscription to The Daily Wire +, just go ahead and do it so you can watch this movie!",
    "25": "Daily Wire nailed it on the head with this one. I really enjoyed the movie, it was easy to watch and I felt entertained throughout its entirety. Which says a lot because over the past few years a lot of movies aren't about entertainment anymore. Hollywood has really gone downhill. Whereas I used to attend the theatres almost weekly, it's now been months if not a year since I've gone to the theatre to watch a movie. That's saying a lot as a huge fan of movies in general. I find it really unfortunate and hope that there will be some change in the future, but for now I'll just wait until I read reviews and be picky and choosy. This was a good find.",
    "26": "So delving into the good, bad and the ugly...\nThe acting wasn't as great as a normal and overall it doesn't have many funny moments... But that is kind of to be expected since it is a satire comedy and it often adds to the message. The comedic parts - well for me it was mostly not \"haha\" funny because it reminded me of the societal problems. But again, that was kinda the point, can't blame the movie for adhering to what it is said to be.So 80% works as satire perfectly, 15% comedy and the other 5% I'd say was the touching ending. It was so sweet, I expected some positive turn-around, but it still surprised me.I recommend it and most of all I'm glad it exists.",
    "27": "I went into this thinking it would be a cheesy, cheap B level movie. Similar to all the old Hallmark movies, it would focus on pushing an agenda over being a good quality movie. Especially considering the tiny budget this was made with, the fast production time, and the many non actors who they got to play a lot of the parts.I was very surprised to find that it was actually a great movie. I burst out laughing numerous times while watching it. Great comedy, great acting, all while talking about a serious issue.Seems you can actually have the trifecta of good, cheap, and fast.9/10. Go watch it.",
    "28": "Low budget, but entertaining. Too many talking points rather than actual dialogue, but a funny story. I'd watch again, as I loved those early 2000's sports comedies like dodgeball and the ringer. However, the acting quality could always be better. Maybe Daily Wire studios could recruit more recognizable actors in their future endeavors to further aid development of their studio. Gotta love the Ted Cruz and Ben Shapiro cameos, which are hilarious. I wish there was more to say, came in not expecting too much but left pleased by the simplicity of the comedy and easy to follow storyline. Daily wire is trending in a good direction.",
    "29": "For a first comedy from the Daily Wire, it was very well made. I really feel they should have included a cameo of Jordan Peterson, but all their cameos were great and perfectly timed.The movie was well written, and the characters were rich. Despite featuring many individuals who were not professional actors and had no prior acting experience, their performances were commendable. You would have to pay very close attention to even notice.There were two scenes where I noticed the actor looking at the camera, and the scenes with Ben Shapiro yelling at the coach could have been better, in my opinion. But perhaps I need to watch again.Other than that, I think the movie was fantastic. I laughed a lot.",
    "30": "As in the title, the main problem with this movie is that it's just not funny, regardless of your political feelings. Those who rate this highly are forcing themselves to laugh because they align with it politically and don't like trans people, not because they care to look into how the law actually works. The acting was obviously very bad, and most of the jokes were too. Those who are rating it poorly are both people who don't align with it politically, but also 100% of honest reviewers who look past the childish point of the movie and try to judge it honestly. It's just bad at the end of the day, period. I guess it does make for a good detection mechanism for a certain kind of person - just look who rates this over a 4/10 and you will know something about that person with absolute certainty.",
    "31": "This was a funny breath of fresh air. For a smaller budget than Hollywood multi-million dollar enterprise, this was an enjoyable watch.I really enjoyed watching the different personalities of the DW cast step into character. I especially liked the ending (I won't include any spoilers) but it was nice to see how they were able to bring the script around and brought it together nicely. The script was developed nicely and kept us laughing the whole time. It was particularly nice seeing the DW tip-toe into the \"I cannot believe they went there\" boundary!!!Check it out and see for yourself! Not a child's movie- funny adult content!",
    "32": "An actual funny movie. It's a miracle! Lady Ballers manages to be funny without dropping F bombs every other word. It's also not one of these lame comedies that try and be completely clean either. It really threads that needle well and is surprisingly hilarious. Daily Wire Co-Founder Jeremy Boering is great in the lead role as Coach. There are cameo's by the other Daily Wire hosts Michael Knowles, Andrew Klavin, Ben Shapiro, Candace Owen's and especially Matt Walsh who had a recurring role through the film.The message is also a very important one which this movie does a great job of conveying. Looking forward to more Daily Wire Content!",
    "33": "Finally a real movie not filled with garbage. And so accurate! Surprisingly well put together, good film quality and great guest star appearances. The surprise Ted Cruze was awesome. It was hilariously funny without being mean, accurate for our times, and heartwarming as well. All the things you'd want out of a good movie, especially in a time of overly sensitive neutered films. Thought this would be a movie you couldn't make, but daily wire figured it out! Nice to see Ben and Brett as well! Hope daily wire sticks with this and makes more films and shows. Almost want Lady Ballers to get released in theaters so everyone without a subscription can watch too.",
    "34": "The Daily Wire is definitely stepping up their game. True comedy that doesn't hold back. The editing, special effects and stunts were pretty good, I was really impressed. It was made really well. Aside from the ridiculousness of the subject matter, it poked fun at our current state. Hopefully people can enjoy it and have more open conversation about the true absurdity of It all. IT was a breath of fresh air being able to laugh and sheer tongue in cheek stupidity.Aside from the above, I loved seeing the Daily Wire commentators in most of their acting debut. I'm cheering you on Daily Wire, hope to see more from you.",
    "35": "This whole film left me feeling quite unimpressed. Only one of the jokes succeeded in getting a laugh out of me to start. Which for a comedy is certainly disappointing. The jokes were most often making fun at fictionalized left-wing views, which got old quickly. Tired bits they would repeat again and again. Even taking that aside the plot felt bizarrely cut short near the end to me. With rushed character arcs that were very sudden. Perhaps if they wanted to impart the message they clearly wanted they could've taken certain moments more seriously. Which I could forgive if it made me laugh more. I am usually a fan of comedies and thought I would come in with an open mind here and be respectful. It just seemed like they were thinking of politics first and plot or jokes second. Very disappointing and there really isn't anything redeeming to offer, I encourage anyone to look the other way.",
    "36": "This is an amateur movie that is funny. Hollywood has forgotten how to make people laugh and that is sad. The actors aren't professionals and the script won't win any awards, but if you are looking for a silly movie that will entertain you then this is worth the two hours. It reminded me of the movie Dumb and Dumber. Not a great movie, but it was so stupid that you laughed throughout the movie. I was skeptical that Lady Ballers would be funny for 2 hours, but it is. Yes, it is a politically motivated movie, but let's be real, does anybody really believe biological men should be allowed to take over women's sports.",
    "37": "Surprising quality of filmography given the rather low budget. The actors and actresses were far better then expected. The movie starts off slowly setting up the mental state of the primary characters. Modern reality then steps in and presents them with out of the box options that result in endless hilarity. I was quite surprised by the dialog quality even though the situations were so unusual. The actors stayed in character in even the hardest moments to keep a straight face. It is quite difficult to complete a project like this with so much comedy happening that the cast itself must of caused a large volume of reshoots to get it nailed down so well. I am surprised they took the time to really nail this down. This somewhat reminds me of The Interview years ago where the actors kept in character when you would believe it to be impossible.",
    "38": "Just finished watching the movie, came out of nowhere and wow was I surprised, saw it on my new home theater, really wished this one came out in a cinema, but my home cinema completed the magic, loved the pro-women msg of the film with the humor injected in it, very appropriate and the acting, no oscars here but they acted well and funny which is what is important in a movie this days, good music, good pacing, very modern, loved the cinematography, very well shot, it is a good movie to watch with friends you know a good popcorn movie, I missed this type of comedy movies, we have been on a very dry streak here, and this movie brings freshness to the options.",
    "39": "While not the funniest comedy every, I actually think they do a good job dealing with the subject matter in what could have been much more harsh and cruel. Some great laugh moments are the highlight, and of course there may be more value in actually dealing with a subject that we're all brow beaten into not being allowed to criticize, question, or laugh about. Surprisingly the acting is passable for having so many people I'd consider not to be actors (Boreing, the DW crew). There are a couple funny nods to other films. There's a really weird product placement that is over the top and eye-rolly but aside from that one scene it's more subtle.",
    "40": "It's a very funny movie, if not exactly family friendly. In my opinion, it could have been just as entertaining with half the vulgarity. Tyler Fischer is hilarious and should have had twice the screen time. My favorite moment was his sendup of a particularly obnoxious social media influencer. Matt Walsh's hippy character was endearing and very funny. Overall, I loved the deconstruction of progressive logic. Jeremy Boering is a solid comedic actor and I can't wait to see what he and Daily Wire do next. It's incredible how they're creating movies on a shoestring budget that are way better than mainstream movies with $200 million budgets.",
    "41": "Great movie. Trans people don't exist. What the f is wrong with people today. The only problem is it's not that funny because it is about the real world. Really why does this seem normal because that's what you see as soon as you turn on the tv so i'm glad they made a good movie. I can't wait for the Pendragon Cycle, Snow White, and Mr. Birchum. Anyways Lady Ballers is an incredible movie watch it if you haven't seen it. I hope Daily Wire release it on dvd too. Because I watch my basketball movies on dvd like Space Jam, Rebound, and more. So i'd love it even more on dvd. But long review short good movie.",
    "42": "You would need to have seen the movie to get the Review title.OK, here goes. To be honest I was kinda expecting a whole load of skits, with no real laughs or storyline. So, it was a great to get a good and funny storyline. I guess I also got educated on a lot of stuff as well. LOL, I now know what gender fluid means now and also learned a few other things too. This movie actually made me laugh out loud quite a few times. Now, I really can't remember the last time I watched a comedy that made me laugh out loud so much. There were some real good moments in the movie and the acting was pretty good too, didn't expect that either. Also, loved the ending. I would say give it a try if you want a good laugh.",
    "43": "Outrageous. Offensive. Absolute genius!The DailyWire cast delivered. The plot was pretty well developed for an uncomplicated satirical project. They mock every current progressive target - from Caitlyn Jenner and Dylan Mulvaney to Elizabeth Warren and others.The supporting cast dialogues were written more sharply than is often the case in comedies where the star gets all the good lines. Jeremy as coach was brilliant. The brief Shapiro, Candace, Klavan and Peterson cameos didn't make the movie better but if you like them, it ends up being a nice addition to the whole.There are lessons lurking everywhere and the ending is very sweet. Great movie in general. I see the DailyWire becoming the new Conservative Hollywood and I like it.",
    "44": "It is not a Hollywood production so you got to evaluate this movie on what it is. When you do that it's actually an enjoying experience.I'm surprised with the quality of acting from people that by no means are actors. Billie Rae Brandt and Rosie Seraphine Harper did great and Ben Shapiros small role where both very Ben Shapiro and exactly how you'd imagine a poorly paid basketball referee to act. The addition of the reporters having to undergo sensitivity training was hilarious.I said you'd have to evaluate it for what it is, but to me it actually felt like a comedy. It reminded me of a mix of Pitch Perfect, American Pie and The Longest Yard.",
    "45": "This film was built on a good comedic premise. Men playing women's sports is funny, and a great premise for a comedy that is also no doubt a cultural commentary on the Western World today. I did find most of the other jokes to fall flat. The actors were alright, although very few of them are actually professional actors. The film relies on cameos a bit too much, although it was fun to see. As much as I want to like it, as it is making an important statement, the quality is not up to par with the films Hollywood is putting out there. (By that I mean budget and quality of effects and actors, not the plot or values) Overall, I still think people should support efforts like this even if the film is flawed.",
    "46": "Non-spoiler** Lady Ballers excellently toes the line of comedy and offensiveness that Hollywood hasn't dared touch in a LONG time. The production quality was excellent and there were several points of the movie that had me laughing out loud. It does a great job of making fun of the absurdity that is happening today in women's sports, as well as the overarching acceptance of anyone can be anything just because. Of course there were some cheesy or not-so funny parts, but every comedy has those moments. I'm sure others found them funny when I may not have. My rating though is based on the overall movie which I found to be quite hilarious, yet still had genuine, thought-provoking moments and messages. I loved the message at the end between the coach and his daughter and the resolution at the end of the movie. I thought the plot had some pretty clever moments that make for great story-telling.Spoiler** I will say, the advertising of Jeremy's products in the background of scenes was fine in my opinion, but the blatant scene in the middle of the movie was out of touch, had zero to do with the movie/plot, and just comes off as annoying. Daily Wire, if you read this, stick to the subliminal advertising as opposed to the in-your-face commercial in the middle of a movie strategy. It didn't make me want to buy your products, let alone contribute positively to the movie in any way, so it's just a negative on all fronts.",
    "47": "I really enjoyed the show, genuinely hadn't laughed this much in a long time. If you're looking for something entertaining to pass your time with, look no further, this is it.The story is simple and often an exaggeration of the on-going fads in america.What i find so remarkable about this movie is that it is able to illicit laughs by illustrating how ridiculous some of those trends had been. I called them \"trends\" here because had them been \"cultures\", america would have been doomed.Advice for the young and impressionable, going with the flow is fine, it may even be fun, but forsaking all common sense and blindly following something is just stupid.",
    "48": "It was ok , had some funny moments for sure, it's kind of like an after school special from back in the 80/90's had a baby with The cannonball run movies, you'll know what I mean when you watch it.It has some moral lessons that I personally agree with, but everyone has their own opinion, I'm trying not to go there with my review.I realize this movie was done on a very small budget, so if you can get past that, and know what you're getting into you'll probably enjoy it. It's Family friendly even with the subject matter.You can tell they had fun making it and didn't take them selves serious. It's worth a watch at least once. It is what it is .",
    "49": "Bravo to Jeremy Boreing and the Daily Wire for having the guts to do this. Is this a side-splitting John Hughes quality comedy? No. The movie features a generally novice cast. So, some of the gags and jokes fell flat, particularly in the opening half of the movie. But, this isn't to say there weren't some good laughs. Andrew Klavan's epic one liner was worth the ticket-price alone, and the men vs women sports scenes delivered several laugh-out-loud moments. Jeremy Boreing shouldn't expect an Oscar, but he gets kudos for bravery. Lady Ballers shines a much-needed light on the absurdity of allowing men to dominate women's sports.",
    "50": "This comedy was a slam dunk, effortlessly dribbling between laughs and the absurdity of reality. It's like a crossover between 'Dodgeball' and 'Tropic Thunder'. Sure, there were a few monologues that went into overtime - a bit long and dark - but they added depth to the storyline. Surprisingly, the film had its share of heartwarming moments, catching me off-guard like a well-executed pump-fake. Brett Cooper's character was muy bueno. There are so many cameos from so many different walks of life. It just shows how many team-players there are out there. The Dailywire team gets the lay up and the extra point for this entertaining full-court press of a comedy!",
    "51": "Loved it , just feels like first time I started watching American movies back in 20003.Story line hits on current events makes you think critically about current and all these with full fun and no forced joke's which try to make u laugh even if it isn't funny . I would give 10/10 just cause it made me laugh so much and never bored me throughout the movie never felt it since very long. Just wished it was in theatre. Talking about about picture direction seemed exactly right characters I think they were meant to play specifically few one which i liked most. The way storyline keeps you engaged that at end of movie you think wait where was that slow boring 20 minutes we are used to have in nowadays movies and boom you ended few hours of your life happily instead of trying to feel yourself happy just so you don't feel bad about your money waste in many other movies.",
    "52": "It has the look and feel of the comedies of the mid 2000s, the movies most of us have seen 100+ times but also movies that would never get made today. To start, no way this should be a 120 minute movie, 90 minutes would have been plenty plus a shorter run time would have improved the overall flow. It's obvious the goal was just to poke fun at the notion of biological males competing in female sports but they didn't go a layer deeper and explorer some of the complexity of the subject. There were a few solid laughs, mostly from the physical comedy, some good one liners, funny visuals but fell short trying too hard attacking the social points. Worth a watch? Maybe. Is it one of those comedies you will watch 100+ times, nope. Probably a 1 and done.",
    "53": "I would say a solid 9/10! It's hilarious, well written and addresses taboo topics. This is true comedy, it makes jokes that go up to the line without crossing it. It also addresses real issues and satirizes them perfectly. I think my favorite part of this was all the cameos from various people like Riley Gains, Ted Cruz and Brett Cooper. Another interesting thing about this movie is it addresses real debates that society is having about real issues and frames it as satire so that people can see how ridiculous things actual have become. Lady Ballers is definitely my favorite comedy of 2023. Perfect valence of pop culture references with just enough controversy sprinkled in. Would recommend!",
    "54": "Having Daily Wire hosts in the roles had some novelty to it but comedy timing is a skill. Don't get me wrong, it had some genuinely funny bits but would have loved to have seen some more comedic actors.With Hollywood smelling their own farts for the foreseeable future, independent movies like this are important and especially those that aren't afraid to call out the ridiculousness of current culture.I grew up with 90's comedy and this had all the nostalgia of it, but the pacing, timing and script were not quite there. However, this studio is obviously very new and are still polishing their craft, so looking forward to the next instalment.",
    "55": "Hilarious movie! Matt Walsh as Kris was hilarious. This movie needed to be made, its great to see someone other than South Park willing to make fun of this madness. Loved the ending, Matt Walsh is always behind the scenes solving everything. A lot of great cameos, Seth Dillon, Ben Shapiro, Candace Owens, Michael Knowles, Andrew Klavan, Spencer Klavan, Ted Cruz, Riley Gaines, Brett Cooper, Jordan Peterson, and I may have missed some. Knowing who these people are makes it funnier, but even if you don't follow the Daily Wire, it's still a hilarious movie. More comedies need to be made that are actually funny. Highly recommend this movie.",
    "56": "What a breath of fresh air! This movie is utterly hysterical! Back in the day we had movies like, The Naked Gun, Austin Powers, Airplane!, Anchorman, and more. Movies have shied away from creating anything new lately. Comedies in recent years typically focus on drugs, gratuitous sex, or nonsense. Lady Ballers is witty, fast paced, and the perfect satire for 2023. There's plenty of innuendo, but it has an actual point. Best comedy I've seen in years!No matter what your politics may be, good writing, fun characters, and a movie full of heart is what you'll get delivered.Stop reading this review and just watch the movie.",
    "57": "I am a fan of some of the DW lineup. I wasn't expecting them to be able to make a truly funny movie while making social commentary as well. As another reviewer has already stated, this movie could've been mean-spirited but it wasn't. It was just funny and honest. I enjoyed it. I don't even watch comedies typically. The acting, while amateur, was pretty good as well. Production value seems great as well. I have no complaints really. They achieved their goal. I appreciate them making comparable movies to what Hollywood produces. Real movies with real language. Doesn't feel like lame christian media that doesn't discuss adult topics using adult language. No knock against Christians, as I am one, I'm just saying it's not lame.",
    "58": "Honestly wasnt sure about this at first but it reminds me of classic 90's humor and has a great flow to it. Probably an instant classic! The casting was unexpected, though with the things how they are today I guess I could have expected it. If it was in theatres I probably wouldn't mind paying the theatre experience for this movie too! The music was great, the special effects were good though a bit campy but overall I recommend this film to everyone. It really does highlight a societal problem quite well and I miss comedies that do this sort of thing. Akin to something by Monty Python, just blatant in your face humor. Masterfully done.",
    "59": "Just as funny as most comedies today just wish there was more adult imagery but then again that's just me. Video looked a little bit under budget but they was able to work with what they had while also saying what they need to say throughout the movie or even surprising me with a few good and surprisingly cleverly Witten jokes but also having actors who I haven't seen before but seem to have know what they were doing either by Talent OR by good directing from third director video talked about real world issues on a level and degree that I think a lot of people would agree with even though it was pushed to a extreme critique in order to drive its Point home.",
    "60": "With modern studios being so afraid to criticize certain groups, this movie does a great job at making you feel like you're watching a 2012 comedy movie. Not afraid to throw punches while keeping a heart touching story going at the same time.This being the studio's first movie, they did a fantastic job. I suspect they'll make a lot more movies like this going into the future, and hopefully having them also play in theaters as well, maybe. There were some funny cameos from DW that will be hard to forget, to say the least, in a good way.Overall, this movie is going to deliver a good time and laughs, while also having heart and soul throughout it.",
    "61": "While the movie makes great strides to give a middle finger to the current left wing culture in the west at every possible turn, it does so in ways that are just straight up corny more than they are funny. At no point in the movie do any of the antics generate substantial laughter; instead they are just mainstream conservative talking points set to awkward music and almost unbearably cringy acting. The entire movie feels like one big impromptu skit after another. Viewers who entered the movie expecting tons of laughs will be quickly disappointed after realizing literally everything even slightly amusing about this film is contained in the preview for it. I give the daily wire boys points for effort, and being true to themselves. But for entertainment value, this just isn't it.",
    "62": "I am a longtime DailyWire subscriber, and the advertising I have seen for the movie was more comedy. It is a funny, lighthearted movie. What I did enjoyed most was the soft addressing of the trans issue female atheletes seem to face; particularly in college and professional sports. The play on the Olympics was important. The trans issue in women's sports is an important one that gets dismissed to easily. (some spoilers) The way the movie side-handed addressed how this issue actually affects real college and professional athletes, and the clear differences in abilities is a tribute to the movie. The male basketball team addresses it as unfair and wrong at one point. These were the highlights of the movie.If you go into Ladyballers expecting a ROTFL experience like Dodeball or other such comedies, I don't think that is what you will find. I think it's a good comedy, great message and an even better vehicle of addressing a sticky subject that needs attention. I feel happy after watching the movie, and I am reminded of watching a good PG comedy from the early 2000s that the greats such as Adam Sandler and Kevin James would give us.Overall a bright star in a dull landscape of the movie scene. DailyWire only continues to improve with its releases and I see everything getting better.I do not deny the highlight for me was the Ben Shapiro cameo ;)",
    "63": "Lady Ballers is not good, unfortunately. But comedy is famously hard so it's in good company. There were some good laughs and a couple heartfelt story moments which made it overall fine.The slap stick comedy is pretty amusing but the script is desperately lacking wit and is at times is bogged down by preachiness. The movie is way too on-the-nose with the parody which ultimately makes it more tiring than amusing and undercuts the premise. There were plenty of jokes that were funny in principle but killed by bad pacing like a sit-com that pauses for the laugh track. There's no clever line that you would miss on a first watch because it goes by so quickly and naturally in the story.If you're a fan of the Daily Wire, it's fun to see the personalities joking around, but the movie can't stand on its own.",
    "64": "There are a couple of laughs and the ending was cute, but it felt short and repetitive at the same time. Nothing was particularly well done. It's messaging actually came off preachy and ununderstanding of the social issue it's commenting on, but I could live with the latter as it's an absurdist film. Some of the acting (mainly the reporter lady) was pretty awful, but not in a charming way. It's definitely not mainstream, but it doesn't have the substance to become a cult classic. It suffers from the same symptom that the other works of this company have. All of Daily Wire's movies are completely unrefined despite having solid premises. They could be great films if they were given another couple pass-overs in the writer's room. Jeremy Boering is a business man churning out products, not an artist.",
    "65": "Well done!!! This movie demonstrates that entertainment doesn't need to come from Hollywood. Besides they ruin just about everything they touch. A refreshing comedy that reminds me of a distant time when you could mock the idiots of the world. A movie where common sense rips nonsense and has fun doing so. It does a great job of portraying the absurdities of society and the media isn't spared either. I haven't seen a laugh out loud, edgy movie in a long time and i appreciate everyone who contributed. You guys are getting better and better with each production. More please!!!600 hundred characters, really? Geesh!",
    "66": "I really wanted to like this! I'm a daily wire subscriber & love what they do. However, it started out as a TV 14 movie which is great but ended as a Disney movie with kids. The 2 combined did not make sense combined. Either make it a kid movie or make it an older teen adult movie. But when you end it with Children playing basketball it literally makes no sense. It becomes very boring at the end, if it's meant for adults and older teens. It's uninteresting and cringe worthy at the end as an adult movie and inappropriate as a children's show. I'm not sure what audience they are be targeting when you end it that way.",
    "67": "There were some slow parts and the acting was just fair, but the jokes and physical humor were side splittingly funny. I imagine there MUST have been injuries on set. But if I'm honest those were some of the funniest scenes.There were weird gags and off color jokes throughout, but that speaks to me. It reminded me of the silly irreverent spoofs of the 80s and 90s. It lacked polish but given that we haven't had humor in film for some years now it's understandable that filmmakers might be rusty.It is topical so know that it does have a point of view. All in all it was refreshing to see a comedy that isn't afraid to say out loud what we all see, \" the emperor has no clothes!\" I'd watch it again.",
    "68": "It has the look and feel of the comedies of the mid 2000s, the movies most of us have seen 100+ times but also movies that would never get made today. To start, no way this should be a 120 minute movie, 90 minutes would have been plenty plus a shorter run time would have improved the overall flow. It's obvious the goal was just to poke fun at the notion of biological males competing in female sports but they didn't go a layer deeper and explorer some of the complexity of the subject. There were a few solid laughs, mostly from the physical comedy, some good one liners, funny visuals but fell short trying too hard attacking the social points. Worth a watch? Maybe. Is it one of those comedies you will watch 100+ times, nope. Probably a 1 and done.",
    "69": "I would say a solid 9/10! It's hilarious, well written and addresses taboo topics. This is true comedy, it makes jokes that go up to the line without crossing it. It also addresses real issues and satirizes them perfectly. I think my favorite part of this was all the cameos from various people like Riley Gains, Ted Cruz and Brett Cooper. Another interesting thing about this movie is it addresses real debates that society is having about real issues and frames it as satire so that people can see how ridiculous things actual have become. Lady Ballers is definitely my favorite comedy of 2023. Perfect valence of pop culture references with just enough controversy sprinkled in. Would recommend!",
    "70": "Having Daily Wire hosts in the roles had some novelty to it but comedy timing is a skill. Don't get me wrong, it had some genuinely funny bits but would have loved to have seen some more comedic actors.With Hollywood smelling their own farts for the foreseeable future, independent movies like this are important and especially those that aren't afraid to call out the ridiculousness of current culture.I grew up with 90's comedy and this had all the nostalgia of it, but the pacing, timing and script were not quite there. However, this studio is obviously very new and are still polishing their craft, so looking forward to the next instalment.",
    "71": "Hilarious movie! Matt Walsh as Kris was hilarious. This movie needed to be made, its great to see someone other than South Park willing to make fun of this madness. Loved the ending, Matt Walsh is always behind the scenes solving everything. A lot of great cameos, Seth Dillon, Ben Shapiro, Candace Owens, Michael Knowles, Andrew Klavan, Spencer Klavan, Ted Cruz, Riley Gaines, Brett Cooper, Jordan Peterson, and I may have missed some. Knowing who these people are makes it funnier, but even if you don't follow the Daily Wire, it's still a hilarious movie. More comedies need to be made that are actually funny. Highly recommend this movie.",
    "72": "What a breath of fresh air! This movie is utterly hysterical! Back in the day we had movies like, The Naked Gun, Austin Powers, Airplane!, Anchorman, and more. Movies have shied away from creating anything new lately. Comedies in recent years typically focus on drugs, gratuitous sex, or nonsense. Lady Ballers is witty, fast paced, and the perfect satire for 2023. There's plenty of innuendo, but it has an actual point. Best comedy I've seen in years!No matter what your politics may be, good writing, fun characters, and a movie full of heart is what you'll get delivered.Stop reading this review and just watch the movie.",
    "73": "I am a fan of some of the DW lineup. I wasn't expecting them to be able to make a truly funny movie while making social commentary as well. As another reviewer has already stated, this movie could've been mean-spirited but it wasn't. It was just funny and honest. I enjoyed it. I don't even watch comedies typically. The acting, while amateur, was pretty good as well. Production value seems great as well. I have no complaints really. They achieved their goal. I appreciate them making comparable movies to what Hollywood produces. Real movies with real language. Doesn't feel like lame christian media that doesn't discuss adult topics using adult language. No knock against Christians, as I am one, I'm just saying it's not lame.",
    "74": "Honestly wasnt sure about this at first but it reminds me of classic 90's humor and has a great flow to it. Probably an instant classic! The casting was unexpected, though with the things how they are today I guess I could have expected it. If it was in theatres I probably wouldn't mind paying the theatre experience for this movie too! The music was great, the special effects were good though a bit campy but overall I recommend this film to everyone. It really does highlight a societal problem quite well and I miss comedies that do this sort of thing. Akin to something by Monty Python, just blatant in your face humor. Masterfully done.",
    "75": "Just as funny as most comedies today just wish there was more adult imagery but then again that's just me. Video looked a little bit under budget but they was able to work with what they had while also saying what they need to say throughout the movie or even surprising me with a few good and surprisingly cleverly Witten jokes but also having actors who I haven't seen before but seem to have know what they were doing either by Talent OR by good directing from third director video talked about real world issues on a level and degree that I think a lot of people would agree with even though it was pushed to a extreme critique in order to drive its Point home.",
    "76": "With modern studios being so afraid to criticize certain groups, this movie does a great job at making you feel like you're watching a 2012 comedy movie. Not afraid to throw punches while keeping a heart touching story going at the same time.This being the studio's first movie, they did a fantastic job. I suspect they'll make a lot more movies like this going into the future, and hopefully having them also play in theaters as well, maybe. There were some funny cameos from DW that will be hard to forget, to say the least, in a good way.Overall, this movie is going to deliver a good time and laughs, while also having heart and soul throughout it.",
    "77": "While the movie makes great strides to give a middle finger to the current left wing culture in the west at every possible turn, it does so in ways that are just straight up corny more than they are funny. At no point in the movie do any of the antics generate substantial laughter; instead they are just mainstream conservative talking points set to awkward music and almost unbearably cringy acting. The entire movie feels like one big impromptu skit after another. Viewers who entered the movie expecting tons of laughs will be quickly disappointed after realizing literally everything even slightly amusing about this film is contained in the preview for it. I give the daily wire boys points for effort, and being true to themselves. But for entertainment value, this just isn't it.",
    "78": "I am a longtime DailyWire subscriber, and the advertising I have seen for the movie was more comedy. It is a funny, lighthearted movie. What I did enjoyed most was the soft addressing of the trans issue female atheletes seem to face; particularly in college and professional sports. The play on the Olympics was important. The trans issue in women's sports is an important one that gets dismissed to easily. (some spoilers) The way the movie side-handed addressed how this issue actually affects real college and professional athletes, and the clear differences in abilities is a tribute to the movie. The male basketball team addresses it as unfair and wrong at one point. These were the highlights of the movie.If you go into Ladyballers expecting a ROTFL experience like Dodeball or other such comedies, I don't think that is what you will find. I think it's a good comedy, great message and an even better vehicle of addressing a sticky subject that needs attention. I feel happy after watching the movie, and I am reminded of watching a good PG comedy from the early 2000s that the greats such as Adam Sandler and Kevin James would give us.Overall a bright star in a dull landscape of the movie scene. DailyWire only continues to improve with its releases and I see everything getting better.I do not deny the highlight for me was the Ben Shapiro cameo ;)",
    "79": "Lady Ballers is not good, unfortunately. But comedy is famously hard so it's in good company. There were some good laughs and a couple heartfelt story moments which made it overall fine.The slap stick comedy is pretty amusing but the script is desperately lacking wit and is at times is bogged down by preachiness. The movie is way too on-the-nose with the parody which ultimately makes it more tiring than amusing and undercuts the premise. There were plenty of jokes that were funny in principle but killed by bad pacing like a sit-com that pauses for the laugh track. There's no clever line that you would miss on a first watch because it goes by so quickly and naturally in the story.If you're a fan of the Daily Wire, it's fun to see the personalities joking around, but the movie can't stand on its own.",
    "80": "There are a couple of laughs and the ending was cute, but it felt short and repetitive at the same time. Nothing was particularly well done. It's messaging actually came off preachy and ununderstanding of the social issue it's commenting on, but I could live with the latter as it's an absurdist film. Some of the acting (mainly the reporter lady) was pretty awful, but not in a charming way. It's definitely not mainstream, but it doesn't have the substance to become a cult classic. It suffers from the same symptom that the other works of this company have. All of Daily Wire's movies are completely unrefined despite having solid premises. They could be great films if they were given another couple pass-overs in the writer's room. Jeremy Boering is a business man churning out products, not an artist.",
    "81": "Well done!!! This movie demonstrates that entertainment doesn't need to come from Hollywood. Besides they ruin just about everything they touch. A refreshing comedy that reminds me of a distant time when you could mock the idiots of the world. A movie where common sense rips nonsense and has fun doing so. It does a great job of portraying the absurdities of society and the media isn't spared either. I haven't seen a laugh out loud, edgy movie in a long time and i appreciate everyone who contributed. You guys are getting better and better with each production. More please!!!600 hundred characters, really? Geesh!",
    "82": "I really wanted to like this! I'm a daily wire subscriber & love what they do. However, it started out as a TV 14 movie which is great but ended as a Disney movie with kids. The 2 combined did not make sense combined. Either make it a kid movie or make it an older teen adult movie. But when you end it with Children playing basketball it literally makes no sense. It becomes very boring at the end, if it's meant for adults and older teens. It's uninteresting and cringe worthy at the end as an adult movie and inappropriate as a children's show. I'm not sure what audience they are be targeting when you end it that way.",
    "83": "There were some slow parts and the acting was just fair, but the jokes and physical humor were side splittingly funny. I imagine there MUST have been injuries on set. But if I'm honest those were some of the funniest scenes.There were weird gags and off color jokes throughout, but that speaks to me. It reminded me of the silly irreverent spoofs of the 80s and 90s. It lacked polish but given that we haven't had humor in film for some years now it's understandable that filmmakers might be rusty.It is topical so know that it does have a point of view. All in all it was refreshing to see a comedy that isn't afraid to say out loud what we all see, \" the emperor has no clothes!\" I'd watch it again.",
    "84": "This movie gives me the Ringer vibes from Johnny Knoxville. The story was solid but the ending could have been a little better. The jokes and humor is funny and it's sad that comedies are not made much anymore. With a 7 million dollar budget and mainly all in house talent I have to say this movie is alot better than I expected it to be. I'm happy somone is making comedies since Hollywood won't and I'm looking forward to more Daily Wire films. I didn't find it funny that they somehow managed to incorporate every voice from the daily wire in some way some better than others buts thats expected. Maybe in time the Daily Wire will be main film distribution company but only time will tell.",
    "85": "\"I never knew myself until now. And nobody knew me until now\".A perfect summary of the frauds that have managed to infiltrate and ruin women's sports. Even though audiences could never compare with men's sports it's still sad because it was about real careers.The movie mocks both the Dylan Mulvaneys and Lia Thomases of today. Absolute nobodies with zero talent that managed to rack up more attention and accolades than they ever deserved.Had this film been made 20 years ago it would barely have been noticed. Nowadays, no doubt it is enough to infuriate entire herds of libs stamping their feet and crying \"transphobia\" all the way to Washington. And that, more than the film itself, will probably be the most enjoyable thing it will offer.A beautiful opportunity for satire, but the writing is poor at times. Some of the dialog is very unnatural and essayist. Like the Munchhausen by proxy line. It's like the writer steps out of the story and inserts opinion journalism.The acting is good mostly. Jeremy Boreing is enjoyable as the frustrated coach and Billy Rae Brandt also shines as the cold and slutty journalist who will do anything or anyone for fame.But the movie is very hit or miss and just doesn't have enough jokes, while it does offer a few good ones. There's a ton of cameo's and small parts of all the Daily Wire pundits. Sadly none of them actually get to be really funny.The ending was weak and the epilogue was not convincing either at the end with Matt Walsh somehow being the mastermind behind the whole scheme.Daily Wire is able to make a film that looks technically good but they really need better scripts.",
    "86": "This movie had potential to explore some fair points, but it became too political for my taste. I expected better from the Daily Wire, but they fell into the same traps as Disney. The movie also started with some low-quality scenes that seemed like reshoots, and the story was not solid at first. It got better after the first third, when the original material kicked in. I enjoyed some parts of the movie, but I also cringed at some of the political messages. It could have been better without them. I would love to watch a director's cut without the reshoots. I'm waiting for Snow White now, let's hope for the best.",
    "87": "This movie feels a lot like a Will Ferrel comedy from a decade ago like Blades of Glory. Lady Ballers is over the top and happily takes advantage of all the comedy gold our culture lays on our laps every single day. I would say it goes beyond credulity if all these things weren't actually happening in a state near you. It feels good to laugh at the absurdity rather than being frustrated and worried for my daughter. Good for The Daily Wire having the courage to make this movie.The acting is actually pretty good considering how few professional they were able to get for this project. They needed a bigger budget to pay for more quality special effects to make Jeremy Boering look 30 again. All in all I thoroughly enjoyed watching and had quite a few good laughs.",
    "88": "I felt it was good poked fun but want mean imo its sad that this is a movie made due to how society has become overall I found it funny and fairly light hearted. They did a decent job of not punching down and keeping it very civil and just funny. I did like the ending thought it could have been done a little different by using their own daughters against them forcing them into a position of deciding self greed or give their child a chance at fame and success. Maybe one day society will move on past sex, race, and religion so we can have the height wars and we can have short vs tall wars and we can hopefully get some good funny movies about that subject.",
    "89": "South Park made this joke a couple of years ago and it was hilarious, heck, it's still as funny as ever.However, Daily Wire made a full feature movie just about it and there are jokes better told in a certain length than try to stretch it as long as possible.Furthermore, the acting wasn't very good, the comedy in itself could've worked for a 90's movie no problem, it's just that shtick has gotten tiresome, boring, and unoriginal.The Right says the Left can't meme, yet here we are where DW made a not-so funny movie and South Park did it far better in just 20mins, or even just 1m30s if you count just that one epic scene with him and Strongwoman.",
    "90": "Being that it is a the Daily Wire's first comedy, it is still a great watch. Comedy today is hard to come by, especially when it refuses to mock anything politically correct. The DW team took a swing at a new genre and while this movie not a slam dunk, it hits several times with plenty of laugh out loud moments. The dialog was a tad clunky and it was not nearly as well written as their previous projects, such as Run Hide Fight. It was as silly as the subject matter and runs with a strong satirical tone throughout. As long as you go to watch it with the intention of being entertained, you will be. While this movie isn't necessarily for everyone, it brings a lighthearted tone and a heartwarming ending that any audience can enjoy. Let's have some fun and make each other laugh and poke fun at some silliness while we are at it.",
    "91": "Hilarious movie, lampooning everything it criticizes well. There is very little comedy that I have enjoyed for the last 3-4 years, so I appreciate that very much out of it. There is nothing hateful in it, just exposing ideology and letting people laugh at the absurdity. It doesn't reserve self criticism either, Tyler Fischer basically plays an exaggerated version of Boreing making fun of himself. One star short for the final product, could use better polishing; editing, line delivery, bad de-aging CGI, ect. Also, the product pushing was more distracting than funny nods. But I also understand it's from a growing studio having to swim upstream against a lot of money and politics set against it. Overall enjoyable film.",
    "92": "The movie was funny. The acting was subpar, but what do expect when most actors (even those who would agree with the message) are unwilling to risk their careers? Daniel Considine and Lexi Contrusi (actual actors with careers) and Billie Rae Brandt are the best performances. However, Matt Walsh's over the top portrayal is just awesome. The cameos from members of the Babylon Bee and Not The Bee show just how difficult it must have been to find actors. But when you REALLY want to make a movie, I guess you use the people you have available. I won't argue it's the best comedy ever... even if it wasn't going to be shunned by Hollywood, I don't think it would be worthy of any awards (whatever those are worth.) But it is a fun watch and in the end it has a genuine message about not destroying Women's sports, which everyone should be able to get behind.",
    "93": "Lady Ballers is a much-needed breath of fresh air in the world of comedy. While some might argue that it could have been funnier with the touch of seasoned professionals, the film's essence is undeniably essential. It bravely tackles the underrepresented theme of women in sports, delivering laughs while shedding light on the challenges they face. The humor, though not reaching its full potential, is grounded in the authenticity of the narrative, making it relatable and endearing. In a cinematic landscape often saturated with formulaic plots, Lady Ballers stands out for its originality and courage to break the mold. This film signals a promising step towards the return of real comedy, where substance and social relevance take center stage. Kudos to the cast and crew for daring to bring a unique perspective to the forefront. Here's hoping that Lady Ballers sparks a trend of more films pushing boundaries and injecting depth into the comedy genre. A must-watch for those craving a blend of laughter, empowerment, and a refreshing departure from the mundane.",
    "94": "Full of juvenile bigotry. Woefully acted, terribly written, poorly executed. These people have no idea what comedy is. Not one person involved in this crapfest has any idea of sport, film making, or real life. Anyone involved in this disaster should never be allowed to set foot near a film set again. Ben Shapiro is the pied piper of talentless hate. No one else could assemble a group of worse people. Somehow they spent seven million dollars to bring their vile thoughts to the screen and I cannot work out where they spent the money. If anyone got paid then they should be charged with theft and be forced into community service.",
    "95": "The movie had me laughing throughout. This film is the way movies should have been made but haven't since the late 2000s. Catchy lines and a good message. This is the movie that everyone should watch in this day and age for some entertainment and to get back to some truly great comedic relief. A large part of the daily wire cast is featured throughout the movie and there characters play a hilarious contrast to who they are in reality. I think this is the most I've laughed during a movie since seeing Tropic Thunder in theaters. So I highly recommend this film if you're looking for an enjoyable experience.",
    "96": "I went into this wanting to love it but worrying it would be super cringey - and I'm so happy to be wrong!It feels like a comedy written in the 90s or early 2000s - edgy, biting, self-aware (but in an appropriate way) and actually FUNNY. This is genuinely the funniest new movie I've seen in years - funnier than anything produced by Hollywood since the 2000s.All the Daily Wire cameos were not lame but actually very, very funny - but the real star of the movie is Matt Walsh as the liberal, peace and love poster boy, Kris. He had me in stitches in every scene. The jokes are great, just the right amount of edginess - an all-around entertaining film. Recommend!",
    "97": "The fact that Jeremy Boering, wrote, directed, and starred in this is incredible. To my knowledge he has never done any of those things, and Lady Ballers, is pretty well written, well directed, and Jeremy himself is actually a pretty decent actor. The Daily Wire is turning into a juggernaut in the alternative entertainment sphere and Hollywood should take notice. On top of the technical bonifides of the movie, it is also hilarious. Contained within the comedy though is a very powerful message. I am sure that many people on this site are going to write one star reviews stating how much they hate this movie because of it's message, but most of them are simply upset because they don't have a good argument against it.",
    "98": "This movie is exactly what it advertised: great political comedy with hit or miss jokes. The acting will not knock your socks off, but it never disappoints either, which is considerable since much of the cast are not actors at all. The set design was a highlight, never looking underdeveloped or cheap, and a particularly creative addition of lawn signs early on was a highlight. This movie sets out to make a point and makes it well, but for such a brave march into a forbidden topic, it noticeably lacks the guts and forethought to execute comedy of similar quality. A great start for a small studio!",
    "99": "I am warm to DW and wanted to like this - and there are a few moments here and there that work - but this needed a better comic director and actors in it. Jeremy Boreing isn't charmless, but he isn't very funny. His timing was an actor and a director was off, and it weighed down every scene. Also, in an effort to appeal to right wing, they bailed out of jokes in cheap ways to keep from being raunchy with the punchlines....which is the whole trope you are attempting to re-create. You will laugh on occasion, but it just don't work.That said, I do want to praise the one good good fit from DW in this - Matt Walsh. The man was given the green light to play a pastiche of every left wing beta make stereotype and he really went for it. He mad everyone in his scenes better, and he is the diamond in the rough.",
    "100": "Shockingly well made, well acted, and FUNNY! I would have cut out about 25 minutes of much too crude humor, but overall worth watching for anyone age 14 and older. Love the cameos and the Daily Wire folks are great actors! So glad you are producing and streaming shows now, as no other company would likely let this kind of comedy, or truth, see the light of day- which is a shame!Way to go, Daily Wire! Can't wait to see the other movies you are producing. Pendragon and Snow White look like they will be excellent and where were your animated shows when my kids were little? Very thankful for all you do.",
    "101": "Pretty decent movie. Good production value from the Daily Wire crew. Blazing Saddles or Friday it's not but a solid effort. Reminds me of Not Another Teen Movie or the Benchwarmers. Slapstick no name cast with a bunch of special appearances. Good to be able to laugh at the reality of the situation. This is exactly where competitive sports are heading with out oversight. And this movie addresses it in a funny manner. Humor is always going to offend someone but in the vein of Family Guy, Chappelle or South Park its distributed equally and not intended for harm. Maybe this can spark more healthy open dialogue.",
    "102": "I expected a few chuckles but laughed my ass off to the point of tears. I had to dock it a point for forcing an. Advertisement but the slapstick and un-afraid comedy kept me thoroughly engaged. Easily Matt Walsh's best role, Brett Cooper was Tom cruise in tropic thunder -it took time to recognize it was her, the daughter is annoyingly effective in a good way, towelboy, the basement, etc. I could talk for hours about this movie. Outside of the movie, I love that married actors aren't intimate. Although it was played off for comedy, I love that coach not allowing disrespect to his baby's mother.",
    "103": "Folks, it's a low budget movie. Literally. So let's not get excited thinking we have a 'knock it out of the park' classic on our hands.It was amusing and I appreciated that it wasn't super 'Christian'. That wasn't the point. The point was to make fun of an absurd twilight zone we are in with men in women's sports.Acting was fine, script was fine. The ending was on point. Honestly it was a relief to have a chuckle at this nonsense. That's the point of a comedy, to be a little offensive and true and get a laugh. I haven't watched much comedy lately because it's just so redundant.It's worth a watch, but manage your expectations.",
    "104": "I know that I'm part of the choir they're preaching to....but I was expecting this movie to be a hokey amateurish attempt at a Hollywood early 2000s type comedy.....\nBoy was I wrong. Such a great plot - good script, editing and pace. Ending was very touching and I can possibly see people having their opinions changed by it.So strange to see a bunch of what are basically political pundits doing so well as comedic actors ...ok so the cameos were sometimes a little shoe horned in but that's par for the course in these kinds of movies. No one minded Trump appearing in Home Alone 2....oh hang on they do now :)Well done DW.",
    "105": "I wanted to like it. I get what they were going for, and it's worthy of praise coming from such a small studio with such a low budget. I hope this isn't the last in this genre from DW.That said - wow. Not up to par of the classics it was marketed as. Airplane, Dodgeball, Blazing Saddles, Topic Thunder: it's none of those things. I think it could've been with some extra elbow grease and less confirmation bias in the studio.The criticism that many Christian movies get is that they focus too much on the message and not on the core story and quality of the film. Same issue here. I get they had some quality limitations, but I wish they would've waited to really hone in the story and make sure the lines packed a punch.Best parts are all the cameos. These are genuinely good and appreciated.Not sure why we needed the subtle dominatrix thing. Just another example of something that made me cock my head sideways and ask, \"Really? Necessary?\"Overall, I know I'll make some people mad for not absolutely loving it, but it is what it is. They want quality content? I'm happy to be the critic for the next future success. I'm aware I'm not the man in the arena, but I don't care.",
    "106": "I lean conservative, I'd like to think too that I'm a realist. This movie, realistically does not deserve the high ratings.The acting, on the whole, is just a titch above high school play level. The story was low IQ level. The jokes not fresh or funny. The pace veeeery slow.Camera and cinematography was perhaps the best part of the movie.I just did not find this entertaining.The whole thing kinda reminds me of when a bunch of guys get together and laugh at farts or when one of their buddies accidently hurts themselves.Moronic. Boring. Idiotic. Slow.But then again I'm not a guy, or stuck in high school brain zone.",
    "107": "I'm not the biggest fan of the Daily Wire, but neither have I found myself agreeing with those this movie tries to satirize. The 'trans athlete' topic is a highly sensitive and ruthlessly divisive one, and it is quite possible to take this concept and satirize it at its most extreme. And bar those who take offence to literally everything, a smartly comical dig at any ideology has the capacity to be entertaining and enjoyable.Unfortunately, while the Daily Wire did have the material to poke fun at the seeming absurdity of the premise, it just ended up feeling like a lackluster presentation of every familiar talking point and anecdote routinely echoed on the network. And sometimes, it's also a 'Jeremy's Razor' commercial, the rationality behind a move as such in a feature film is one that escapes me. There wasn't a single laughable moment in the whole movie, because if you've been on social media at least once in the last five years, you could see the punchlines coming a mile away. And if you did somehow find this movie funny, then maybe some self-reflection on whether you might be a tad ensconced within an echo chamber could be helpful.Underneath all of this, there probably was a silly 'Tropic Thunder'-esque comedy hiding somewhere. Unfortunately, the film fails to tap into that potential, as it seems to lack the nuance and the creativity necessary to bring such a satire to life without appearing as partisan and preachy as it does here.",
    "108": "It's a poorly produced, poorly acted film where the jokes are basically Conservative grievances communicated in a funny voice and/or with a funny face but nobody has the talent of Jim Carey to pull something like that off.It's also tragically ironic that it targets trans people but wildly overshoots the mark and ends up being more of a denigration of women's sports in general than a film criticising the presence of trans women in sports. Perhaps that was the intention of the writers, but that would imply they had enough talent to pull off multiple intentions at the same.Did anyone who blatantly gave this 10/10 because of the subject matter notice this? Unsurprisingly no.It's also hard to only view this as a silly comedy when it was clearly made with hateful intent. It was made with the same attitude a bully has when telling jokes at the expense of their victims and if that's not a problem for you, well that says it all. Just an unpleasant experience all round.",
    "109": "It's amazing how a b movie with a 7 million dollar budget featuring non-actors i.e. People with no acting training or credentials manages to be at least as watchable as productions worth hundreds of millions coming from big studios like Disney. And unlike those movies this one could have made 100-150 million at the box office thus turning a nice profit, something that seems to elude Hollywood these days, but due to poking fun at certain people, situations and ideologies it will never see the inside of a movie theatre or the catalogues of mainstream streaming services. And this is what makes it a bold comedy with plenty of balls. Needless to say don't expect to be blown away by the best movie you've ever seen but its definitely watchable and definitely funny while making a point that is missing from the one sided mainstream narrative, even if the movie is one sided itself, that's the essence of freedom of speech: having the choice of being able to listen to different points of view, instead of just one.For what this is, it is a good all around movie.",
    "110": "\"Lady Ballers\" was a film I approached with some anticipation, given its intriguing premise. However, I found it to be disappointingly shallow and pedantic. The acting across the board was underwhelming, contributing to the film's overall lack of depth and engagement.A critical drawback of the movie was its humor, or the lack thereof. The jokes felt forced and failed to elicit the intended laughter, detracting from the viewing experience. This issue could partly be attributed to the script, which seemed to need more refinement. The potential for a successful comedy was there, but it required a sharper and more experienced comedic writer to bring it to life.The film appeared to serve more as a vehicle for promoting Jeremy Boreing's businesses than as a piece of entertainment. This focus undermined the story's authenticity and the characters' relatability.Tyler Fischer's presence in the film was a lone bright spot. His natural comedic talent shone through, despite the limitations of his role. Fischer's performance gives me hope for his future projects, as he clearly has the potential to excel with better material.In conclusion, \"Lady Ballers\" misses the mark in several key areas, making it a less than satisfying watch. The concept was promising but was let down by lackluster execution and a script in need of a few more rewrites. It's a 4 out of 10 for me, primarily saved from a lower score by Fischer's brief moments of comedic relief.",
    "111": "Watched Lady Ballers this morning. It's available only on Daily Wire+. The movie reminds me of comedies from the 80's or 90's; silly and irreverent. No nudity, but there are some racy jokes about body parts and bedroom acts.Jeremy Boreing plays the head coach of a men's basketball team who all decide to identify as female to win a women's tournament. The jokes practically write themselves. To be honest, some land and some don't. Enough land, however, to rank LB at 7/10.Matt Walsh playing against type as \"Kris\" the hippie was delightful. Couldn't stop laughing whenever he was on screen. And, the actress who plays coach's daughter is very sweet. She steals the opening scene.What I didn't expect to be so wow-ed by was the musical score and beautiful drone shots of Nashville. The opening theme song is earnest and oh-so cheesy; a la American Flyers. Love it! There were lots of musical changes of pace, too, like the switch to an old-worldy accordion tune for the scene where coach is getting roughly handled by the dominatrix reporter. \"Furnace burn!\"I've also got some quibbles. For example, the final, fade-to-black image was totally unrelated to the rest the movie. Just oddly edited. Also, the players were too often either fighting or high fiving. That got old quick; as if dudes can't just sit and chill without punching each other.Overall, it was fun.",
    "112": "We have example after example of the far left demonstrating that they can't write entertainment & that any time they attempt to, they just create cringe inducing message fiction.So it's a nice change of pace to see the far right proving that the far left are not alone in their inability to create entertainment..... That anything they try to create is just as cringe worthy as the most far left intersectional wannabe communist, with pink dyed hair.But as far as the actual product, it's nothing but cringe inducing unfunny boomer dad jokes, idiotic stereotypes, proving once again that collectivists cannot write, regardless of which side of the center they personally collectivise for.Do yourself a favour & do something productive with your time, instead of watching this movie.... Or do something unproductive, pretty much do anyhting other than watching this movie.",
    "113": "I will agree with other reviewers that it was more \"mature\" than I expected. However, look at what it's about. If we want this kind of conversation out of our schools, do we really expect a movie about it to be kid friendly?The cameos were pretty funny. There were parts that took me back to older comedies I really liked-Dodgeball and Pitch Perfect to name a couple.Two decades ago, I'd likely give this movie a solid 8. But since the quality of screenwriting has tanked since then, this movie deserves no less than a 10. Thank you for setting the bar higher than everyone else, DW.What was really interesting to me was the fact that so many of the actors in this movie are not trained actors. I must say that they were believable all the same. Yes, there were corny parts, but it was a corny comedy. It was supposed to hit like that. If you don't remember that kind of comedy, it's probably cause no one has been making them (or making any worthwhile) for a long time.I look forward to other shows and movies coming out of DW's studios in the future. This movie was a good laugh.",
    "114": "It's so current that people in 20 or 30 years won't really get the movie.Maybe that's a disservice towards it in the long run,but today,it's everything Hollywood should say out loud and doesn't.At least some people still have the balls,pun intended,to try to show the sad truth about the times we live in.The DW was on the frontlines of the Culture War since day one and it's nice to see they put their money where their mouth is.It's obvious no network,theatre or streaming service will touch this so they knew it was doomed from the beginning yet they still made it.Mad respect and kudos.The movie really had me LoL a few time,which is way more that i can say for most comedies in the past 10 years.Ending was really unexpected which is pretty hard this day and age when you seen every plot and twist possible and impossible.",
    "115": "I'm a DW supporter, and I want them to produce great content. This is only OK.Run hide fight was good, not great.Terror on the prairie was ok,\nShut in was rough\nWhat is a woman was great doc\nConvicting a murderer was great docFirst of all. 1h52m is way too long for a comedy, unless it is absolutely amazing. Should have been 80 minutes. We found ourselves struggling to get to the end. It's a comedy, get in there, make the jokes, get out on a high point, fill it with a story with a remotely plausible plot.I like them using DW folks for some of the actors, but Boreing as a lead fell pretty short. Some parts of his acting was fine, most was not. Didn't seem natural. Probably keep him to cameos only going forward.The plot was weak on the whole. The idea was great, but execution is tough I guess. Comedies are not supposed to be the most cerebral of genres, but if all you're standing on is the jokes, they better bring the heat.The writing/dialogue was fine for the most part.Jokes were okay without being excessively mean spirited.They are a new studio, so I am hopeful they will improve.",
    "116": "I am basically the target audience for this movie, but that said, a true Daily Wire fan won't pull punches.Lady Ballers' claim to fame is its comedic satire and on that front, it does very well. A common worry for me with modern comedies is that the trailer will show every good joke or point the movie has to offer, leaving the rest of the movie to be bland plot exposition. In this case, there is plenty more than the trailer shows, but none of it will necessarily exceed the trailer. What you see is what you get.There are a lot of jokes, and some of them are downright incredible, while some of them fall flat. It's definitely a weird movie, and how many and which jokes you laugh at will likely depend on personal taste. I totally agree with the take that this movie may as well have been written by Adam Sandler. On that point, it is not appropriate for kids under 13. Some mature themes are explored (obviously) and there are some dirtier jokes involved. Obviously nothing disgusting is shown, but there may certainly be some awkward questions if watching this flic with those not familiar with the existence of weird fetishes and creeps.As for the message of the movie, I'm happy to report that by the time it arrives, the audience is actually ready for it. There's no beating people over the head with politics (other than the men in women's sports thing obviously) and it winds up being genuinely heartwarming.The acting is mediocre, which is to be expected given the non-professional actors, and the cameos make it all worth it.The cinematography is honestly a bit weird at times, and there were some occasional choices that I found annoying, but pretty good quality overall. The actual production on display is completely acceptable, and quite impressive considering the low budget. It genuinely felt like any other Hollywood production in terms of quality. Clearly a lot of work was put into this movie. (It also says something that $7 million is all you need to achieve the quality of Hollywood's $100 million releases but that's a topic for another time)Best part of the movie: Matt Walsh's character didn't have a single less-than-stellar moment. From writing to casting, his character is brilliant. Most characters have both great and bad lines/acting/presence but a few absolutely knock it put of the park, with the most obvious being Matt.The worst part: there are definitely some odd side quests and stupid tangents sometimes. They aren't necessarily boring, but very weird. The good news is that they don't last too long so you won't get too annoyed as the story seems to spiral out of control. Yes they are slightly pointless, but the story will get back on track within a few minutes.Overall: not bad at all! Not a classic or mind blowing, but definitely does its job sufficiently. Not going to be my favorite movie, but will be watching again. It's probably not worth an entire DW subscription for, but if you were already in the fence, this could certainly put you over the edge, especially if this isn't the last of its kind. I hope we get more like this in the future!SBG for life!",
    "117": "With very few creatives in the world being willing or able to produce stories of this nature, I applaud the attempt and intent.However, it just isn't very good overall. Not terrible either, just... barely adequate.The premise is funny, politically and socially valid but the execution leaves a lot to be desired.The actors mostly do a good job, Matt Walsh steals every scene he's in, but the direction, cinematography and editing were just passable.Coming from an independent conservative media group seems to be a double edged sword for the production. They can have an absolute field day with thematic freedoms others just don't have, yet are simultaneously stifled by a logical foundation of understanding when it comes to creativity.The result is a premise with huge potential that comes out a bit bland. The product placement was a terrible choice but, if it was absolutely necessary, they at least got it all out of the way in one segment and moved on.The story has a moral, the outcome is relatively wholesome, there are certainly quirky characters, humourous events and some level of entertainment to be had here. Given the almost complete lack of comedies produced these days, and the fact its themes are verboten throughout almost the entire entertainment industry... you could do a lot worse for something to watch.I had similar sentiments after seeing Sound of Freedom, a film with much better production values and talent. A very important and topical film which will have nowhere near the impact or historic longevity it deserves because of uninspired artistic achievement.The ingredients are all there but they're being prepared by short order cooks and not world class chefs. Unless these types of productions can make a deal with the Devil and coax an unhinged artistic genius into their cause, this trend will likely continue.There IS a thing called movie magic, and people who don't believe in magic can't perform it. Without it you don't have art, you only have a product. Maybe that's enough these days given how little of it remains but with it, the impact would hit so much harder.Anyway, watch it, enjoy it for the bland yet rare thing it is. And maybe someday, an important film will achieve the artistic gravitas needed to perform its function well.",
    "118": "Look, I'm a daily wire fan and the message of the movie is good. But this movie is nearly impossible to get through.The acting isn't too bad, especially considering how almost none of these people are actors. But the writing and dialogue is just painful. There were some funny parts but many of the jokes are just weird and unfunny.There are also some montages that go on for much too long.The funnest part of watching this is seeing all of the cameos from Daily Wire hosts. Sorry guys, but this just hurts.If you don't already have a dailywire+ subscription, it's definitely not worth paying for just to get access to this :/",
    "119": "Ladyballers exceeded expectations. I expected a very pointed message with some weak comedy and production flaws.The Daily Wire probably can't get many Hollywood actors onto a project b/c the actors would be afraid of backlash, even if the film had no political leanings--but still, they managed to find some good talent. Jeremy Boreing and Billie Rae Brandt both have star-quality. Fischer and Cone also great, but really the whole team worked. I was looking for weak links in the cast and didn't find any.The cameos were okay, not bad. The best being B. Cooper and M. Knowles as the news anchors. Their arc was hilarious and their delivery was perfect. And quite fearless with the costumes, I love that.The humor landed pretty well, some parts better than others. Most comedies are like this. I didn't find the \"how much\" guy very funny. I loved the badger stuff, that made me laugh pretty hard. I also enjoyed all the shots they're taking at the journalist class. That's long overdue. The Jeremy's razor commercial in the middle of the movie was very funny, pulled off in just the right way.And obviously the satire's message is spot on. Everybody knows these things are true, everybody knows the emperor is naked, but everyone's afraid to speak up.Satire isn't just preaching. There are definitely some preachy moments in the movie (and I didn't mind them probably b/c I agree with the sentiments), but this still works as satire b/c the ideas are embodied well by the story on the whole.It also had better production value than I was expecting. They definitely dropped some money on all the extras in the last game. The score/soundtrack was a highlight, very good music, which is important. The tone was consistent. The cinematic elements were all competent. Lighting was good. I'm not a fan of the murky \"realistic\" lighting movies are obsessed with now. Just make it look good.And the end delivered. It was perfect to see the lady ballers get their comeuppance and get a taste of their own medicine. I loved how they worked in the coach giving \"inspirational\" speech trope and played with it in various ways.And I liked how genuinely heartwarming the ending was with the little girls team. The old comedies usually try to pull some heart-strings in the end and typically fail, but here it definitely worked. The father-daughter relationship was very lovely.I expected a movie I would be a little amused with and probably have to endure, but we ended up enjoying it thoroughly and we didn't interrupt watching it once.I'd give the humor a B+. The heart/feeling an A-.And the satire an A.",
    "120": "I strongly recommend this film. Great writing, directing, production, acting, but most importantly, it's *actually* funny, and willing to take risks potentially offend people in service of creating laughter. Such risks are so valuable when every other movie these days is lacking them.This film really doesn't pull it's punches. Not a lot of studios would produce a movie like this, with obvious \"offensive humor\". Thank god they did, all the funniest movies are \"offensive\" and as a result this film seems like the funniest live action comedy in years.I was impressed by the excellent cast, great work from with leads. Main protagonist and villain both played pretty much perfectly for me. Some side characters (like the wife, her boyfried and the kid) are played very well too.My only complaint... there's a few unnecessary scenes that drag on or are based on gags I didn't find funny. Additionally there's a couple over cliche jokes that definitely could have been done differently or somehow better.Great film still, because it's tons of laughs! The few slow, flat, or unfunny parts are worth sitting through... because the good parts are truly comedy gold.Go watch it!Misc Other Notes:I won't be specific to avoid spoilers, but here are some vague comments that although don't spoil, some people find spoiler-adjacent. If that worries you, stop reading now!There's a twist \"joke\" introduced to a comical relationship that they seem to thought would add humor but really just takes it away. Really makes that whole running gag less funny.Some good grains of wisdom in it too, has in its serious parts actual excellent life advice.Finally... This film has a great climax+ending! The resolutions and way they deal with the issues near the climax and before the end is brilliant. I wasn't sure what they'd do to get it cleverly working out it, but they picked a perfect idea for the resolution leading towards the preend and it worked.",
    "121": "It's basically a giant in-joke. If you're not the specific audience this is meant for, much of the humor comes across as random or extremely forced. If you see the trailers and that appeals to you, you might be able to get some enjoyment out of it, but otherwise it's a lost cause.Production wise, it is the epitome of mediocre. The production company actually has a history of failed actors running it, and you can REALLY tell when they just inserted themselves into roles for the movie. Direction is very basic and the biggest compliment I can give is that they could afford professional cameras.Beyond those notes, there isn't really anything more notable about it. It doesn't try to tell much more of a story than an excuse to get the cringeworthy humor out there. So decidedly there's nothing of value here unless you specifically want that,All in all, it feels like the sort of film a bunch of fraternity bros would put together for a film festival, just with a slightly higher budget.",
    "122": "Can I just say how refreshing it is to be able to a comedy in 2023 that isn't graphically, sexually explicit?The Daily Wire has been putting out some great content and this is no exception. Even if you aren't familiar with the DW team, you'll still enjoy the performances from the cast.Lady Ballers felt like late 90s/2000s comedy: think DodgeBall, Benchwarmers, Blades of Glory, Heavyweights, etc.I think this film did a great job of tackling modern social issues in a genuinely funny way. Content wise, even though its addresses aspects of* sexuality, it's still pretty tame to watch with family/young teens.If you could use a good laugh, I recommend checking it out!",
    "123": "This film tackles a very contentious topic, with a comedic and often very sympathetic lens, it doesn't wish to demean anyone, but rather point out the absurdity in some modern concepts by simply putting them to the screen. That is what good comedy does, especially when it is actually tackling a contentious topic (as so much great comedy does, like Gervais and Chappelle, just to name a few).I think the performances are really good, I like the nuance a lot of the characters are given, I won't give it away but one of the main characters is genuinely shown as a struggling young man with issues, and the film illustrates really well the inner turmoil he has (as I'm sure many trans people also experience) albeit the real solution isn't \"changing\" your gender, but simply accepting yourself for who you are, and that's what those that care about you should help you do, rather than affirming a harmful and insidious delusion that will never be fulfilled.Billie Rae Brandt was great in this as well, I was really excited to see her in a feature, and she did a spectacular job. All in all, I just hope whoever is reading this can see past all the leftist political extremism that social media pushes, and go into this (and many other films he may not agree with) with an open mind, like a true liberal would. Someone open to change, open to free speech, and discourse, and not afraid for the man on the other side to speak, but rather welcoming of it. Because if that's how he entered this film, then I'm sure he'd find a good movie and an important message within.",
    "124": "The acting gets better as the movie progresses and Brett and Michael as anchors gave me life from the moment they showed up on screen!It reads Sandler-adjacent, which is a cool throwback for a nineties kid like me and not too over-the-top.My only requirement before going in was that they not drown me in ideology, which isn't an easy task for such a pointed satire. But the silliness and moments of tenderness helped to meet that requirement, and the DW cameos were enjoyable.I loved the conversation between the coach and his daughter, praising women, which is something else I wanted to see done well and seriously. Overall, this was a good debut for DW's comedy slate and I know the next one will be even better! Just don't continue to stay on the same vibe/Sandler-adjacent type material with every entry and the fans will be satisfied! God bless y'all, keep 'em comin!",
    "125": "DW promised a goofy, early 2000s comedy with a message and I believe, overall, in landed. I enjoyed it and laughed at the slapstick goofiness and appreciated the meaningful bits. I can see and understand where it fails a little too.As a stand alone comedy, it's a popcorn movie and doesn't overstay it's welcome with it's pacing, comedy, and plot. The general movie goer (who isn't wildly liberal) would still have a good enough time if one likes movies such as the The Hot Chick, White Chicks, Scary Movie, Wayne's World, and other such on-the-nose, wacky, dumb movies that would have a difficult time being made today. It is true that a DW fan would find the movie more enjoyable due to the cameos - which were extra hysterical if you're \"in the know.\"If I could only change one thing as someone who loves the idea of this comedy shedding light on an important issue, I would have either removed the ending cameo entirely, or shifted it to after credits.The general public would also enjoy it even more if they are aware of the western nations' culture war; if the viewer is unaware, the hopeful goal of the movie would be to make people aware of conservative concerns.That said, the movie does not ride on the backs of DW and conservative cast members; it scratches the old comedy itch millennials have, makes gen x roll their eyes, and can show gen z what comedy used to be.",
    "126": "This irreverent comedy is a breath of fresh air, delivering laughs with its bold humor and fearless approach it is truly stunning and brave . The witty writing and hilarious performances make it a must-watch for anyone in need of a good dose of unapologetic humor especially as the point it is mocking needs exposure to wake folks up. That the performers are also mocking themselves or others in the movie is brilliant and important. This is Dodgeball and Ron Burgundy style of humor - irreverent satire mocking and good one liners along with great caricatures from some of the key DW influencers add to the fun. \"Kris\" is hilarious and several others of DW main talent do a good to great job in their performances. The writing dialogue and story structure do a good job in moving things along with plenty of funny moments. Those on one side of this issue will find this funny and hilarious hopefully the other side comes to their senses or can also laugh at themselves. And too bad it didn't get distributed as word of mouth of those who actually watch this should be good.",
    "127": "The highest compliment I can pay this film is that it does actually feel like a movie. It's the first movie of its kind that I've seen where I would believe the people making it had read and followed a book on screenwriting. I mean, it's a low bar, but they did clear it.This has been described often as being like a throwback to an early 2000s Sandler film, and I was actually surprised that this description wasn't just some sort of hype to get you to watch 2 hours of low effort lecturing. I didn't really find it that funny, but there is a structure to the script (to the point of being formulaic, but still). The characters each have a game. The performances are for the most part passable, with some credit to Boreing for being able to pull off the lead, down on his luck, everyman. It just looks and feels like an actual movie, and I have seen low budget fare on streaming that is made more incompetently.I think the messaging of the film is kind of muddy. Is it offensive? Well, I think the fact it exists to advance this dangerous political ideology is... but honestly almost none of the jokes or writing really is. This is really where the comparisons to Sandler hit, because I think you will find as much in both places. Which, this being more of a message/satire/conservative film that is wearing its intentions on its sleeve, than trying to pass it off as just mainstream 'this isn't political/this is how it is'... is preferable, maybe? It's really not as mean-spirited of a film as I expected (not that it isn't mean-spirited). And the climax of the film - removing all context, just taken for what it is - I do have to begrudgingly admit, was kind of cuteIt was a bit of a weird experience to sit through. It's not particularly thoughtful or original, but it also isn't My Son Hunter or Left Behind.",
    "128": "If you are the kind of person like me who likes corny comedy you'll love lady ballers.It is even more fun when you know the personalities of the cast off screen.I was impressed as well at how quickly this movie was conceived and produced in less than 9 months.The acting is not too notch but they didn't intend it to be. It reminds me of blazing saddles type humor and other mel brooks comedies. Some slapstick, some raunch but not so much that you feel it's gratuitous.I want to see more of this type of just \"have a good time\" movie and it should be an annual tradition that DW produces something silly for its audience.Thoroughly enjoyed my evening and if you watch the movie . . . You'll understand my title!",
    "129": "Daily Wire does some great podcasts and documentaries, but fictional movies are evidently not their forte. Feature length motion pictures are not memes. They cannot be written in a weekend like a razor or chocolate ad for the sole purpose of \"owning the libs\". This was a poorly executed movie all around and Ben Shapiro lacks any semblance of self-awareness when he called this \"the funniest comedy of the last 10 years.\"The premise is rich for humor: men pretending to be women and unironically competing with and dominating them in sport. What Boreing and his team fail to understand is that the setup to a joke is only halfway there: you actually have to deliver a punchline based on the funny setup. And this film just doesn't have it.At nearly two hours, the film doesn't have anything humorous or poignant to say beyond the obvious \"men and women shouldn't compete in athletics\" premise. The film itself has a production value no better than a YouTube channel or SNL sketch, and that's what it feels like this should have been instead. There's simply not enough ammunition here for a feature film. The tone is so unserious and the script so amateur, I'm amazed this is an actual movie. The trailer appears to be a parody of a conservative film, not an real movie that people put effort into.Meanwhile every Daily Wire host and friend of the show makes an appearance, and every single one of them is distracting, adds nothing, and ruins the immersion of the film, of which there's almost none to begin with. What was the point of having Clay Travis, Jordan Peterson, Ted Cruz, or Spencer Klavan in this movie if they're only going to have one line and not even attempt to be a character?The Daily Wire does some of the best conservative work out there in terms of political analysis, but their multiple attempts at films have been disasters to say the least. You can file this one in the ash heap of other disastrous conservative films like American Carol or Death of a Nation.EDIT: This film supposedly had a $7 million budget? Where did all of that money go, especially since a number of the actors probably worked for free?",
    "130": "Absolutely hilarious I was crying lathing all the way though the film. Well written and you can tell they had fun making the film.I have seen some bad press about the film but after watching it really is plain to see they did not even watch the trailer let alone the film.Great story and commentary on some some of the of the crazy rhetoric being thrown into people faces these days.Simple production and a great story just what many films are lacking these days we really need need more films like thisVery well worth watching and I can not wait to see what the team have in store for the next film.",
    "131": "I'll admit, I was intrigued by the concept and the cast. The trailer was funny and had the right kind of vibe for my sense of humor. To keep it short and sweet I found the characters enjoyable, I found I had someone to root for, and a strong majority of the humour really landed for me---it was genuinely funny overall and even extremely funny at times. Only a few jokes didn't really land for me, which were the ones that were maybe a touch too Daily Wire self-referential. The performances were surprisingly great though! All the personalities from the Daily Wire were great to see in comedic roles but I was very impressed with the lead Jeremy B in particular. It was a compelling performance, believable, and just fun. The film was more put together than most comedies these days and the production quality was on par with anything big budget coming out of Hollywood. I wouldn't rank it a 10 out of 10 but for my bar, a 9 is darn close. I thoroughly enjoyed myself and would recommend it to others.I would be remiss not to include the fact that the moral of the film may strike many as controversial, and I think that's part of the alure for me personally--I like a good comedy that goes into potentially offensive territory. But you know, I have 3 daughters and the message struck home for me too. Well worth the watch, an important comedy for our modern culture if there ever was one.",
    "132": "I'm currently three quarters of the way through the film as I write this and I literally have not laughed once; no hyperbole (edit: I managed to plod my way through it all and nothing changed). I am a conservative who wants to see The Daily Wire succeed, but I need to be objective; the writing in this film is flabbergastingly lazy and lacking any trace of wit. It's not remotely amusing or clever. With all due respect to the creators, this is an embarrassingly bad and unoriginal script.Based on the previews, I was not expecting to find this film funny, and it has more than lived up to my prediction. Even with bad comedies, one can usually experience a couple of laughs, here and there, yet, I have been staring at the screen with a blank expression since I started the film. The only other comedy that I recall watching in the last decade that didn't make me laugh once was Dumb and Dumber To, which is probably the worst comedy movie that I've ever seen, but I digress. Lady Ballers makes Good Burger look like one of the Naked Gun films.Sorry, Daily Wire, I get no enjoyment in saying this, but this movie is really and truly bad, and that's putting it lightly. No offense, but I don't think making comedy movies is your forte, despite 'What is a Woman?' being a well-made documentary with some good comic relief. Lady Ballers is hairy yeti poo balls.",
    "133": "The key to understanding this film is Daily Wire's overall production strategy that basically had a very shrewd idea of reviving not just the lost moral and political values of Hollywood cinema but also its lost aesthetic values as well. So, Daily Wire basically started making films that people like to see but the studios stopped making them and somehow big tech streamers didn't pick up on those genres either. And in case of LADY BALLERS it's the goofy sports comedy that Will Ferrell used to make for New Line. So essentially this is a lost New Line sports comedy and they actually made one like this quarter of a century ago - JUWANNA MANN, right? I mean OK, JUWANNA MANN was a Warners release of a Morgan Creek production but nevermind, you know what I am talking about. And I love that this genre aspect is kept in a work that is more overtly political.The other Will Ferrell connection is another shrewd decision of Jeremy Boreing not just directing but also starring in the film. It gives this film a bit of a Funny or Die sketch aesthetic even though it's actually not an anthology of sketch comedy, it's a pretty straight up narrative and Jeremy is quite good as the star actually.But overall this sketch element is an interesting disclaimer that basically says - Yeah, this is topical unlike our other films which are movies first and foremost. This is a social critique and we are lampooning a particular phenomenon and I like this element which sort of distances itself from the main DW body of work, especially with the PENDRAGON CYCLE on the horizon which will really add depth not just to the streaming service but also to the library.Now, when it comes to the film itself.If we bear in mind that Jeremy intentionally went for this meme-like approach where this is an all-out parody of a troubling phenomenon in contemporary sports, this actually works pretty well as a movie.It worked a lot better for me than for example Will Ferrell basketball comedy SEMI-PRO that he made for New Line around ten year back but of course it doesn't reach the emotional depth of RINGER with Johnny Knoxville which comes to mind.But given this stylized comedy approach that stems from the contemporary school of comedy videos and sketch TV shows and stuff like that, actually LADY BALLERS works quite exceptionally as a movie and even the length of 110 minutes, which is by no means gentle, and it sort of is excessive if we look at it from the side, actually works out when you watch the film.So even though I believe this was envisioned as a more a of a Christmas-special kind of thing, a bit of an internal send up of contemporary sports, what you got in the final product is a film that will be able to live on and really be a valuable part of any library, not just the DW one.Of course, the film is openly political with all the attitude and naming names and Ted Cruz cameo and so on, but in the end it's actually a quite heartfelt experience with some common sense values put in place. So, however partisan it is on the outside it's actually quite universal on the inside.And Jeremy is actually a talented performer. He really brought some kind of John Ritter humour to this character and not just edge but also warmth.I think that the film will work well outside of the US because it deals with sports that people internationally actually know and understand the rules. Outside of the US, football sort of works in films because it's simple and it became global but stuff like baseball is an enigma.Having these spoof approaches in a film is actually a tightrope act. And it's always a mess in the making but Jeremy really found his way around this. If we bear in mind that he is a guy who actually has a day job and doesn't waste his tame thinking about filmmaking techniques all day long, - I must say he proves to be a pretty solid comedy director with a pretty clear vision of what needs to be done and how the general narrative convention needs to be set up.And him as a performer is really a highlight. I mean, his role has genuine emotion and comic timing, so it's not just a famous person being surprisingly good in an acting assignment. It's actually a well-done role.So, outside of Jonathan Isaac cameo, I missed very little in this film. I got quite a lot out of it actually.",
    "134": "Overall funny movie, a couple of moments of genuine laugh out loud jokes. Especially in the middle.It is not a grade A comedy movie, like Dodgeball or Billy madison, happy Gilmore. Which means I don't think I would watch it again.It's main draw back is timing and length. Comedy movies should be 90 minutes and the great comedy movies are exactly 90 minutes. This is almost 110 minutes and it feels like it.They really should have spent some time in the editing room trimming jokes down, trimming unfunny scenes out. Shortening cameo time or using different methods for the cameos.It could have been a much funnier movie with a little more work.",
    "135": "Amazing movie, it is just what the common man has been looking for!Comedy is back!Everything was perfect, and what a feat for the daily wire hosts to get involved because no one else had the balls, pun intended.My only criticism is that if it was written by the Farley Brothers, it would have been the best comedy of our time.I respect the Daily Wire's integrity and keeping it clean.The movie is like a love letter to women and men, I teared up at the end, after laughing most of the way through.There aren't many movies that do this to me.My only critique is it could have been 'dirtier' haha.",
    "136": "Daily Wire shoots it out of the park (oops, wrong sport) with their latest comedy.I knew from the trailer it was going to be epic, and I wasn't disappointed.I couldn't stop laughing, but there was also real heart to the story. Even though I am NOT a sports fan, that didn't prevent me from loving the story.I am not going to summarize it here-others have done so already-but I will say it's worth the cost of membership to be able to watch it over and over. I am on my third watch. You see new things every time.Remember-winners are just losers...who do the right thing.This is the movie everyone needs to see, regardless of your politics. Because even though it's comedy, it's true.",
    "137": "If you are the kind of person like me who likes corny comedy you'll love lady ballers.It is even more fun when you know the personalities of the cast off screen.I was impressed as well at how quickly this movie was conceived and produced in less than 9 months.The acting is not too notch but they didn't intend it to be. It reminds me of blazing saddles type humor and other mel brooks comedies. Some slapstick, some raunch but not so much that you feel it's gratuitous.I want to see more of this type of just \"have a good time\" movie and it should be an annual tradition that DW produces something silly for its audience.Thoroughly enjoyed my evening and if you watch the movie . . . You'll understand my title!",
    "138": "Daily Wire does some great podcasts and documentaries, but fictional movies are evidently not their forte. Feature length motion pictures are not memes. They cannot be written in a weekend like a razor or chocolate ad for the sole purpose of \"owning the libs\". This was a poorly executed movie all around and Ben Shapiro lacks any semblance of self-awareness when he called this \"the funniest comedy of the last 10 years.\"The premise is rich for humor: men pretending to be women and unironically competing with and dominating them in sport. What Boreing and his team fail to understand is that the setup to a joke is only halfway there: you actually have to deliver a punchline based on the funny setup. And this film just doesn't have it.At nearly two hours, the film doesn't have anything humorous or poignant to say beyond the obvious \"men and women shouldn't compete in athletics\" premise. The film itself has a production value no better than a YouTube channel or SNL sketch, and that's what it feels like this should have been instead. There's simply not enough ammunition here for a feature film. The tone is so unserious and the script so amateur, I'm amazed this is an actual movie. The trailer appears to be a parody of a conservative film, not an real movie that people put effort into.Meanwhile every Daily Wire host and friend of the show makes an appearance, and every single one of them is distracting, adds nothing, and ruins the immersion of the film, of which there's almost none to begin with. What was the point of having Clay Travis, Jordan Peterson, Ted Cruz, or Spencer Klavan in this movie if they're only going to have one line and not even attempt to be a character?The Daily Wire does some of the best conservative work out there in terms of political analysis, but their multiple attempts at films have been disasters to say the least. You can file this one in the ash heap of other disastrous conservative films like American Carol or Death of a Nation.EDIT: This film supposedly had a $7 million budget? Where did all of that money go, especially since a number of the actors probably worked for free?",
    "139": "Absolutely hilarious I was crying lathing all the way though the film. Well written and you can tell they had fun making the film.I have seen some bad press about the film but after watching it really is plain to see they did not even watch the trailer let alone the film.Great story and commentary on some some of the of the crazy rhetoric being thrown into people faces these days.Simple production and a great story just what many films are lacking these days we really need need more films like thisVery well worth watching and I can not wait to see what the team have in store for the next film.",
    "140": "I'll admit, I was intrigued by the concept and the cast. The trailer was funny and had the right kind of vibe for my sense of humor. To keep it short and sweet I found the characters enjoyable, I found I had someone to root for, and a strong majority of the humour really landed for me---it was genuinely funny overall and even extremely funny at times. Only a few jokes didn't really land for me, which were the ones that were maybe a touch too Daily Wire self-referential. The performances were surprisingly great though! All the personalities from the Daily Wire were great to see in comedic roles but I was very impressed with the lead Jeremy B in particular. It was a compelling performance, believable, and just fun. The film was more put together than most comedies these days and the production quality was on par with anything big budget coming out of Hollywood. I wouldn't rank it a 10 out of 10 but for my bar, a 9 is darn close. I thoroughly enjoyed myself and would recommend it to others.I would be remiss not to include the fact that the moral of the film may strike many as controversial, and I think that's part of the alure for me personally--I like a good comedy that goes into potentially offensive territory. But you know, I have 3 daughters and the message struck home for me too. Well worth the watch, an important comedy for our modern culture if there ever was one.",
    "141": "I'm currently three quarters of the way through the film as I write this and I literally have not laughed once; no hyperbole (edit: I managed to plod my way through it all and nothing changed). I am a conservative who wants to see The Daily Wire succeed, but I need to be objective; the writing in this film is flabbergastingly lazy and lacking any trace of wit. It's not remotely amusing or clever. With all due respect to the creators, this is an embarrassingly bad and unoriginal script.Based on the previews, I was not expecting to find this film funny, and it has more than lived up to my prediction. Even with bad comedies, one can usually experience a couple of laughs, here and there, yet, I have been staring at the screen with a blank expression since I started the film. The only other comedy that I recall watching in the last decade that didn't make me laugh once was Dumb and Dumber To, which is probably the worst comedy movie that I've ever seen, but I digress. Lady Ballers makes Good Burger look like one of the Naked Gun films.Sorry, Daily Wire, I get no enjoyment in saying this, but this movie is really and truly bad, and that's putting it lightly. No offense, but I don't think making comedy movies is your forte, despite 'What is a Woman?' being a well-made documentary with some good comic relief. Lady Ballers is hairy yeti poo balls.",
    "142": "The key to understanding this film is Daily Wire's overall production strategy that basically had a very shrewd idea of reviving not just the lost moral and political values of Hollywood cinema but also its lost aesthetic values as well. So, Daily Wire basically started making films that people like to see but the studios stopped making them and somehow big tech streamers didn't pick up on those genres either. And in case of LADY BALLERS it's the goofy sports comedy that Will Ferrell used to make for New Line. So essentially this is a lost New Line sports comedy and they actually made one like this quarter of a century ago - JUWANNA MANN, right? I mean OK, JUWANNA MANN was a Warners release of a Morgan Creek production but nevermind, you know what I am talking about. And I love that this genre aspect is kept in a work that is more overtly political.The other Will Ferrell connection is another shrewd decision of Jeremy Boreing not just directing but also starring in the film. It gives this film a bit of a Funny or Die sketch aesthetic even though it's actually not an anthology of sketch comedy, it's a pretty straight up narrative and Jeremy is quite good as the star actually.But overall this sketch element is an interesting disclaimer that basically says - Yeah, this is topical unlike our other films which are movies first and foremost. This is a social critique and we are lampooning a particular phenomenon and I like this element which sort of distances itself from the main DW body of work, especially with the PENDRAGON CYCLE on the horizon which will really add depth not just to the streaming service but also to the library.Now, when it comes to the film itself.If we bear in mind that Jeremy intentionally went for this meme-like approach where this is an all-out parody of a troubling phenomenon in contemporary sports, this actually works pretty well as a movie.It worked a lot better for me than for example Will Ferrell basketball comedy SEMI-PRO that he made for New Line around ten year back but of course it doesn't reach the emotional depth of RINGER with Johnny Knoxville which comes to mind.But given this stylized comedy approach that stems from the contemporary school of comedy videos and sketch TV shows and stuff like that, actually LADY BALLERS works quite exceptionally as a movie and even the length of 110 minutes, which is by no means gentle, and it sort of is excessive if we look at it from the side, actually works out when you watch the film.So even though I believe this was envisioned as a more a of a Christmas-special kind of thing, a bit of an internal send up of contemporary sports, what you got in the final product is a film that will be able to live on and really be a valuable part of any library, not just the DW one.Of course, the film is openly political with all the attitude and naming names and Ted Cruz cameo and so on, but in the end it's actually a quite heartfelt experience with some common sense values put in place. So, however partisan it is on the outside it's actually quite universal on the inside.And Jeremy is actually a talented performer. He really brought some kind of John Ritter humour to this character and not just edge but also warmth.I think that the film will work well outside of the US because it deals with sports that people internationally actually know and understand the rules. Outside of the US, football sort of works in films because it's simple and it became global but stuff like baseball is an enigma.Having these spoof approaches in a film is actually a tightrope act. And it's always a mess in the making but Jeremy really found his way around this. If we bear in mind that he is a guy who actually has a day job and doesn't waste his tame thinking about filmmaking techniques all day long, - I must say he proves to be a pretty solid comedy director with a pretty clear vision of what needs to be done and how the general narrative convention needs to be set up.And him as a performer is really a highlight. I mean, his role has genuine emotion and comic timing, so it's not just a famous person being surprisingly good in an acting assignment. It's actually a well-done role.So, outside of Jonathan Isaac cameo, I missed very little in this film. I got quite a lot out of it actually.",
    "143": "Overall funny movie, a couple of moments of genuine laugh out loud jokes. Especially in the middle.It is not a grade A comedy movie, like Dodgeball or Billy madison, happy Gilmore. Which means I don't think I would watch it again.It's main draw back is timing and length. Comedy movies should be 90 minutes and the great comedy movies are exactly 90 minutes. This is almost 110 minutes and it feels like it.They really should have spent some time in the editing room trimming jokes down, trimming unfunny scenes out. Shortening cameo time or using different methods for the cameos.It could have been a much funnier movie with a little more work.",
    "144": "Amazing movie, it is just what the common man has been looking for!Comedy is back!Everything was perfect, and what a feat for the daily wire hosts to get involved because no one else had the balls, pun intended.My only criticism is that if it was written by the Farley Brothers, it would have been the best comedy of our time.I respect the Daily Wire's integrity and keeping it clean.The movie is like a love letter to women and men, I teared up at the end, after laughing most of the way through.There aren't many movies that do this to me.My only critique is it could have been 'dirtier' haha.",
    "145": "Daily Wire shoots it out of the park (oops, wrong sport) with their latest comedy.I knew from the trailer it was going to be epic, and I wasn't disappointed.I couldn't stop laughing, but there was also real heart to the story. Even though I am NOT a sports fan, that didn't prevent me from loving the story.I am not going to summarize it here-others have done so already-but I will say it's worth the cost of membership to be able to watch it over and over. I am on my third watch. You see new things every time.Remember-winners are just losers...who do the right thing.This is the movie everyone needs to see, regardless of your politics. Because even though it's comedy, it's true.",
    "146": "I really wanted this movie to be great and funny. Hollywood hasn't written a good comedy in years, and woooke comedy isn't comedy, so I really, really wanted this movie to succeed. Unfortunately, it kinda fails in the writing and acting departments.Sure, I know this is kind of a B-movie and not an overly expensive Hollywood-style production but that has nothing to do with the humor that should've been there. All the parts that should've been funny fall flat because it feels like the writers are not telling a joke, but explaining one and telling you why it's funny. Also, some jokes might be funny \"on a table\" but they can't make an audience of strangers laugh. There is a huge difference between saying funny stuff to your buddies at the table and telling standup jokes, writing a skit, or writing a movie. Acting is also kinda over-the-top and it feels like one of those bad 1998 movies that were direct-to-TV back in the day.The good part is that the movie pokes fun at a huge problem in Western society. There SHOULD be more movies doing this bravely, but seems that there are none nowadays. It also gets carried away a bit with the mask-wearing, cricket-eating, and mRNA-vaccinating which is just cheap and dumb, but at least it pokes some fun at communism.Giving it 6 for the effort, the message, and for doing so much with such a low budget. Still, wish it was funnier. Wish I could help write it, actually but hey, I'm not an American.By the way, I don't consider myself \"conservative\" (nor am I religious) but I'm definitely not a \"liberal\" in the modern sense of the word. I know some people are going to base their opinions on the movie (and on my review) based solely on this, so here you go.",
    "147": "If you miss the kind of culture-mocking humor that is almost non-existent in modern cinema, you'll appreciate Lady Ballers.Daily Wire delivered some genuine laugh out loud moments, although admittedly some of them were funny just seeing the DW hosts in their acting debuts.As you might expect, there are some genuine moments amidst the laughs - especially the ending which was surprisingly heart warming.Is there some corny not-so-funny moments? Sure. Some questionable acting in certain scenes? No surprise. But considering this kind of movie is extremely rare in modern year, and MUCH needed, it's absolutely worth a viewing.A+ DW team, I hope to watch more original comedies!",
    "148": "The movie has a decent script and decent acting. Being a production by a news commentator company, I was prepared for something really, really bad. However, the production value is surprisingly good. For instance, the cinematography, color grading, and sound is what you would expect from a Hollywood flick. This is not like a bunch of high schoolers making a movie with a Digital 8 camcorder.As for the quality of content and laughs, Lady Ballers is higher than The Pest and lower than Deuce Bigalow (how's that for a scale?).Now, the reason this film gets a 7 from me instead of a 5 is because I can clearly tell what they were doing in terms of making the movie-They were making a movie for themselves and subscribers, not the general public. The movie really could have stood on its own if it did not have overly-long beginning credits, a Jeremy's products commercial in the middle, and add cameos that added nothing to the story itself (Ted Cruz... wow... yay...?).If they would have ran a test screening of the final cut to a couple of focus groups, they could have chopped a lot out and ended up with a really funny movie.So, from a general audience score, it's about a 5-6. But, as a subscriber myself, I did enjoy all the intangibles, such as seeing Matt Walsh hug people.",
    "149": "If you've been a subscriber or follower of the Daily Wire for awhile, odds are you will thoroughly enjoy this movie. If not, a lot of the jokes and gags will likely fall flat.The movie itself tells what I'd consider a pretty good story, with the ludicrousness of the men in women sports theme on full display. While the Daily wire are the only ones who would or could make this movie, I strangely think it could have been better made with the resources of a major film company. The cinematography and sound design are fine, but just that, fine. Where this movie struggles is with the editing and writing.As previously stated, if you're not a fan or follower of the Daily Wire and its members, much of this movie just won't make sense to you and certain jokes fall flat. As a member of the Sweet Baby Gang (SBG4life) the ending had me in a fit of laughter, but anyone who doesn't listen to Matt Walsh will walk away wildly confused. Some other jokes and scenes feel like the pacing is off and it could have been tightened just a little more.Where this movie shines is with its emotional message, the second half of the film starts to actually get you emotionally invested in this father daughter relationship, with a father daughter chat that worked well. The finale hits well too, and as a father of a young girl struck me surprisingly hard in the feels.Final thoughts: give it a try, share it with people who are ideologically like minded at least and they'll still get a few good chuckles and enjoy the overall messaging of the film, whether or not they understand the subtle and not so subtle references to Daily Wire members and inside jokes. To everyone else who this movie triggers, you just don't get it and likely never will. Go listen to Jordan B Peterson and good luck."
}