{
    "0": "Well, I actually had high expectations for this. Read a lot of positive stuff, damn my English teacher. Anyway what we have here is a good idea, ruined by a bunch of characters I hated. A bunch of whiny, self centered teens, with smarts somewhere between a Mars bar and a US President. Mustn't forget some of the stoopidist suspension of logic flaws I've seen in a horror movie for some time. After the Police arrived, and left, the whole plot collapsed. For a horror movie to really work, it has to draw you in with realistic, everyday likelihoods. The cops would have shut the house down, taken all the phone footage and confiscated the hand. They did none of the above.. Now a hand that allows you to contact the dead I'm prepared to give a pass. A bunch of Aussies finest, walking away from a blood splattered crime scene without a hint of concern.. Well your taking the p**s aren't you mate! The Cinematography however was excellent. Kudos to them.",
    "1": "I'll take any bet - any good old Alice Cooper show is still more horrifying as Talk to Me. The art of horror in this film boils down to a few pictures; the rest is just a generic mess with storytelling in slow mo (I was almost asleep until something happened, and I should have given in to the powers of Morpheus...). It's filled with characters that nobody but a select few will care about. On top, on the horror-o-meter, this rates very low. Maybe if you're still not in your teens, you'll get some goosebumps. Anyway, I really don't know why, even in an exciting genre like horror, where almost anything goes, I got the impression that everyone involved in making the movie (and other \"horror\" movies too) treated it like a chore. Verdict: boring, generic, heartless. On the pro side: production is solid.",
    "2": "I had pretty high hopes for this movie. I like A24 films usually, and the first 20 minutes had a couple freaky parts that I enjoyed.Then unfortunately it was back to extremely long and extremely boring reaction shots, and completely overblown sounds. (Pillows hitting a person sounded like a concrete block being dropped onto the sidewalk, and a girl slapping her head 15 times that made my eardrums blow out.)The \"spirits\" she first saw were pretty damn scary, but then it just devolved into typical \"dead person\" makeup and cloudy eyes. Along with just gross-out gore which isn't very scary. Really ended up disappointed overall. The concept was pretty cool and they could have done a lot with it (contacting spirits as a viral trend), but they really dropped the ball.And of course you could see the ending coming a mile away.",
    "3": "The whole cast is superb. Unfortunately, the plot isn't as great and it's not ''atmospheric'' enough to pretend to not care about a plot. As much as I wanted it not to be, it remained a cliché from beginning to end. Not a terrible one and it had some innovations here and there but if it weren't for the cast carrying out the scenes so well, it would have been yet another horror movie.Spoiler : To me the plot really took a cheaper path when the mother was introduced. This is nothing more than the usual ''evil spirit passing as a loved one to trick you into letting them in'' which is 90% of possession-themed movies and nothing new seemed to have been added here.The story also feels more rushed towards the end in that the directors are trying to simultaneously commit to multiple ideas that are not fully developed and nourished.5/10 made 6/10 for the spot on acting.",
    "4": "Talk to Me (not a very scary name) is about some teenagers who promote themselves on social media by having strange seances where they use a hand that can summon the dead. But one night, one of them holds onto the hand a little too long and the demons start to chase the teenagers and cause chaos in their lives.This should have been a more rewarding premise, but about midway through the film the story begins to have too many plots that it fails to develop and loses track of what made it such an interesting premise in the first place. Also, there are some really dumb things that happen in this movie. It's not a film where the main characters try to solve a problem more than it's just the character go around in circles.",
    "5": "I'm so impressed. I haven't been stricken with genuine horror and a deep feeling of dread watching a movie in so long. I am at that point in my life where I thought horror just wasn't going to do it any more, but this movie proved me wrong. Literally reignited my childhood paranormal phobia and made a cat in someones window jump scare me on the walk home. Totally fresh and unique concept with lore that has you hooked and wanting to know more. It's simplicity with no desire to wrap things up nicely or follow a simple horror formula really worked in its favour. Sound design was amazing and so sharp, in the cinema you're gonna flinch. The soundtrack was just so cool too. Just watch this in the cinema if you can please, you're in for a treat.I am so eager to see where the promise of this director goes.",
    "6": "I feel like I am the only person that thought this movie was very average and lackluster. Being an A24 film, it's stylish, with great cinematography and overall good acting. But I thought most of the characters were unlikable and the story felt hollow. It felt like it was taking bits and pieces from other horror movies that it thought would work to formulate another good horror movie. The practical effects are excellent and I always appreciate the use of less CGI which helps ground any film in more realism. The movie also tries to have a deeper message and metaphors, but these also fall apart with the story telling. By the end it felt forgettable. I wanted to like it but sadly it's a dud for me.",
    "7": "I really hoped the trailer had left out the best bits but sadly not. You won't see anything better in the film that wasn't in the trailer. The film was intreguing at the start but led to very little and the less said about the end the better. Nothing very original and not scary at all. As is the case with many modern horror's, there's the odd irritating character I wish had met their grizzly end but once again sadly not. The acting was what You'd expect from horror but can't see any awards going it's way. My advice is to wait for whichever streaming site picks it up and if there is nothing else to watch give it a try.",
    "8": "This is one of the most unique horror films I've seen in years. The plot is relatively simple: teens get their hands on a mysterious embalmed hand that allows them to see and chat with the dead. Predictably, they do not use this ability responsibly, and they end up breaking the 'rules'. Hijinks ensue. There are a couple of gruesome scenes that aren't for the faint of heart, but they are thankfully brief. I wouldn't say the level of scares is very high, but it does a good job of delivering a few jump scares, being atmospheric, and leaning into its concept. Excellent, highly recommend to any aficionado of the genre.",
    "9": "This stands out from your jump scare or just plain poor plot horror movies. I watch as much horror as I can and this was an original idea and very well written. After the movie, you will piece together more and more of how it all ties together.Scary, yet enough twists to keep you on the edge of your seat until the end. The acting was very good and really ties in with the themes in the film.This is more of the stick with you, creepy, dread, existential type horror, but also had many scary scenes.Also love to see a movie like this create a star actor and get picked up for distribution at Sundance. We need many more horror films like this and less of these cookie cutter, one page plot horror movies.",
    "10": "Low budget gem much better than expected .. Usually the Australian made movies are pretty rubbish or just a lot bad overacting. But this was surprisingly good. A lot new concepts and plot twists. Some good jump scares...The no name actors were much better than expected... The make-up was actually very good which helped a lot. The ending plot twist is very good also... Almost like a cross of SAW x VHS x Walking Dead x Flatliners movie. Definitely worth watching. The special effects were simple but believable. Considering it's low budget, it's actually very good. A breath of fresh air and not over filled with wokism too.",
    "11": "I had someone literally barrage me in text form about this movie, telling me how it's the most perfect film, how it has kept them up late at night and that they can't shake it. I feel badly because I hate that I knew that I'd instantly judge this movie as a result and that I didn't see the version of this movie that they did.What I did see was fine - and let me make fun of myself, if it were shot on video in 1983 or was made by an Italian special effects artist in 1985 then distributed by Filmirage, I would have probably loved it a lot more, such is my madness - but at no moment did I lose a moment's rest. That said, it does have some wild eye-related destruction and no small amount of gore. But it owes so much of itself to a computer-guided camera move that will seem as quaint as morphing in a few years. Directed by Danny and Michael Philippou (Danny also wrote the script with Daley Pearson and Bill Hinzman and no, that isn't the maker of Flesheater no matter how much I want it to be), it revolves around a severed hand that allows people to see visions. The kids think it's like drugs; as you can imagine, none of them have watched as many possession and occult movies as you or I, so they open the door to something horrible, as you do.Mia (Sophie Wilde) is struggling with the death of her mother after an overdose and her father Max doesn't help because he's never been there and he's since grown more distant. One night, she and her friend Jade (Alexandra Jensen) and Jade's little brother Riley (Joe Bird) sneak out to a party hosted by Hayley (Zoe Terakes) and Joss (Chris Alosio). There, Mia holds the hand - ninety seconds only is the rule - and is shocked by the way that it makes her feel. Yeah, it's like drugs. And you want more once you taste it.The next night, they are joined by even more people and Jade refuses to allow the younger James and her brother Riley to try the hand. Mia, however, lets them use it when Jade leaves and Riley is possessed by Mia's mother, trying to apologize to her. She disregards the time limit, which causes Riley to become overtaken and repeatedly slams his face into everything around himself, becoming so suicidal that he becomes a burden on his family, only able to survive in a coma.Mia has taken the hand and keeps using it, discovering that Riley is in limbo being tortured, but she still needs to talk to her mother, even if the spirits begin to destroy her grasp on reality. Twist ending to wrap it all up and there you go.Samantha Jennings, one of the co-founders of production company Causeway Films, produced this. She also was behind The Babadook, another movie that people tell me that I'd love. They were worse than right. Oh baby, they were wrong (sorry, I tried the hand and got possessed by the demonic form of Robert Evans).There's also a sequel - Talk 2 Me - and a prequel that is all on social media and screens coming out. Like all modern horror, this feels like a way of dealing with grief and that's fine. I'm sure for some this really worked and like I said, I wish I could enjoy it without realizing everything several beats ahead. But hey, more movies like this and maybe I'll finally see something like Hereditary as a good film.",
    "12": "Honestly, I could not get the hype surrounding this trending Australian horror flick. Despite being hailed as the best horror film of the year, I could not push myself to adore this. It felt like a teen horror whose story went wrong and as deep and complicated as it became. Existential horror films like this get good reviews from film critics for being disturbing and that \"gets under your skin\" factor. For me, the excitement around this film started to wane as soon as the first half ended. That's when it became too deep and philosophical for my taste. But I must commend the original screenplay and the actors' performances.",
    "13": "Mysteries and Strong Points -1. Did the Mother Really Kill Herself? Or was there something more Nefarious at hand here? To do with the Father.2. Was that Even Her Mothers Spirit? Of an Evil Imposter! 😳 TRICKING HER ABOUT EVERYTHING, TO GET RILEYS SPIRIT?3. Did her Best Friend Push her onto the Highway? Or did Mia Jump onto the Highway Herself?4. The Hospital Ending, Did Her Father Survive? Because He Couldn't Hear Her because she was in the Spirit World Dead. So is he Alive?5. The Very Ending Sounds and Pitch Black Walk Up to the Candle was Very Good, Very Strong Score There.Problems I had -We have 2 People Mia and RileyMia - Plays the Hand Game 🤝 BUT stays too long over 90 Seconds BUT does manage to Close the Door (Candle) and is Not in the Spirit World but the Consequences are, Mia is still being Contacted by the Various Spirits.Riley - Plays the Hand Game 🤝 , Stays too Long, DOESN'T close the Door (Candle), gets Battered into a Coma and IS actually in the Spirit World👻.1. How Does Riley Get out of the Spirit World? Was it Because Both Mia and Riley Were Both now Connected to the Spirit World? Was Mia's Sacrifice Enough? And it Satisfied Mia's \"Mother\" THE FILM DOESN'T SAY 😤😠Overall, Some Very Strong Points within this Film, Though it seems like NOT ALL of it Gels Together.",
    "14": "My gawd where do I start I wanted to get out of the movie theater by the middle of the film, this Mia girl she is just so so so dumb it's unbelievable all the things that happen on this film are just so dumb, you may think is a movie that will scare you or at least make you feel uncomfortable or something, but is just this girl Mia having her mommy issues all throughout the film, if you are into hardcore horror films you should skip this one. Is just plain boring and the premise is stupid. At the end everyone was so dumb I could care less how it would end and the ending is just so predictable, if you think you are going to see gruesome murders or scary stuff trust me this film ain't any of that.What a waste of potential.",
    "15": "This was really bad. Just bad acting, no story and not scary. All the main characters are unlikable and rather stupid.I found the whole thing quite boring and there was no logic in anything that happened. Yes, I know it's a horror movie, but still, it has to involve something that keeps your interest - and that part is missing. When the main character show her stupidity when finding a wounded animal by the road - You just out of reasons to care for that person at all.So why all the good reviews? Well, I guess the hype machine worked on this one. At least something that worked, because the movie did not.",
    "16": "Once again, we have a horror film that doesn't have a single new or interesting idea and yet it's praised to the heavens. It's as if the critics haven't actually seen enough horror films to recognize that everything in this film has been done before and done much better.Once again, we have a group of sarcastic partying teens (or thereabouts) who manage, through their own stupidity, to summon evil visions followed by actual evil deeds. That they each experience horrifying results from what is passed off as a party game does not deter them in the least.Two sentences are thrown in to take a stab at explaining the evil porcelain hand and then it's off to the races. Where did it come from? What might explain its effects? What's the basis for the ritual that makes it work? Who knows? Not the filmmakers, apparently.The leads are appealing actors but their efforts are wasted in this mess.Fans of mindless brutality may find something of interest here because it's nothing if not brutal. But everyone else should wait until it streams if they feel the need to see it.",
    "17": "Movie was not scary. At all. We were excited to see this considering the high reviews and people saying they fainted in the theater. It was NOT SCARY. Started off promising but it dropped off very quick. Ending was stupid. They didn't explain anything either. Should have been a movie that went straight to Hulu. Don't waste your money.The premise behind it was interesting but characters just stopped showing up that were involved. It made no sense. The only good scene was when the teen tried the hand and started slamming himself and taking out his eye ball. That was the ONLY scene in the movie worth watching.",
    "18": "I just came back from the theaters watching talk to me and i really liked it.Cinematography: 9/10. Acting: 8,5/10. Special effects: 7,8/10. Plot: 8,7/10I honestly loved the concept of the movie, like it's not some standart possesion movie, it's different, but in a good way. I don't think this is a really scary horror movie, but it's still pretty good. What i missed in this movie: there were like almost no jumpscares, and i personally think that's one of the most important things for a horror movie. I think the performances are great. I also loved the ending, i did not see that coming.I definetly recommend this movie to others because i had a great time with this movie. I give it a 7,8/10.",
    "19": "I went into this excited. What a let down. The acting was subpar at best. A lot of it didnt make sense at all. Characters were extremely unlikeable. This could have been such a good movie. Made by someone else, with a bit more of a twisted mind. This could have easily passed as a pg13 film. Storyline made absolutely no sense. Still a million unanswered questions and the ending was just a horrible as the reat of the film. Just dont waste your time. Newer 'horror' films do not hold a candle to 70s, 80, and 90s horror. Those were absolutely the golden years of the horror genre. What a flop of a good idea that could have been awesome!",
    "20": "I'll start with positives. The film was shot really well so credit to cinematographer Aaron McLisky and his team for their efforts.Both practical and special effects were top quality throughout, I never felt anything looked fake. The makeup was actually very effective with the spirits and with the whole Riley incident. Particularly when he injures himself and the scenes subsequently where he is in the hospital are well done. He does look battered and bruised in a gruesome way. Finally, I thought the acting throughout was also good, I can't knock that at all, but there are significant issues, and it's all the writing for me.The film needed so many re-writes to get it where it needed to be. I get annoyed and disappointed worst of all, when films that try to take you somewhere, can only get you there by making the actions of the characters be the most stupid they could be.I won't go into a massively detailed full story retread, but suffice it to say that the film follows Mia (Sophie Wilde). Mia is an emotionally vulnerable teenager who is still recovering alongside her father Max (Marcus Johnson) over the suicide of Mia's mother Rhea (Alexandria Steffensen) two years prior.Mia ends up going to a party hosted by friends Hayley (Zoe Terakes) and Joss (Chris Alosio) who have an embalmed hand supposedly from a psychic. It can apparently allow any individual to be taken over by a spirit if they say 'talk to me' and then give permission to let the spirit into their bodies.Mia has a best friend called Jade (Alexandra Jensen), who has a younger brother called Riley (Joe Bird). Riley winds up using the hand against Jade's wishes and ushered on by Mia. Riley seemingly gets inhabited by the spirit of Mia's dead mother Rhea. Mia at this point has herself already used the hand several times and been over exposed to its power from the first experience, apparently if you're inhabited by a spirit for more than 90 seconds, you're in trouble.The sheer implication that anyone would be as stupid as to let the spirit inside you is mind boggling. I know they're teenagers but I can't believe it. Mia just witnessed what's quite clearly a spirit on the first attempt after touching the hand and saying 'Talk to me' and she thinks to go again and then let a spirit possess her...get right out of here with that level of crazy!Nothing about this concept looks fun, getting a buzz from letting dead people inside you is just stupid for me I'm sorry. You're literally playing devils advocate with your life and soul, I'm not religious, but in the context of this film and seeing what's in front of you, why would you be so blasé about your life?You can't play the film off as serious and scary and then let us believe anyone would do any of this, if you can't bring the audience in on the realism of the entire plot device to kick start the film, then I'm sorry, you've severely messed up.Everything was so predictable too, there's no element of suspense throughout, the story hits all the numbers you expect of to, or it did for me at least.Where does the 90 second rule come from, no explanation? I'm aware Duckett (Sunny Johnson) who stabs his brother Cole (Ari McCarthy) before killing himself at the start of the film has suffered at the cost of being over exposed to the embalmed hand or that's at least the implication?Is that where the 90 second rule came from and even if Duckett was over exposed to the hand, how would you know it's 90 seconds that did cost him, and not 87 or 88 seconds etc...you then know that when Mia experiments with it, of course she'll be exposed for more than 90 seconds and suffer the ill effects for the rest of the film.The toe sucking scene for instance was stupidly predictable with it being shown as her doing it. This is followed up by more dumb writing where Daniel (Otis Dhanji) awkwardly explains his viewpoint from that night to Jade, when I think that whole scenario could have been avoided with some outright honesty to Jade. Nothing did happen and it would have appeared less weird if they spoke truthfully about what happened straight away, but the writing needed it to create tension between Mia and Jade but I do think it could have been done without too much awkwardness.Why does the little girl later in the film let Mia in, and none of the spirits prior to this seemingly consider doing the same if they're able to? I'd have thought some benefit may be attained from the spirits being able to do this, trapping the living on the other side maybe without needing to wait 90 seconds, I think there was potential there that was wasted or they should have scrapped that idea as it was too messy to integrate.I don't like the convenient information from Cole that the spirits simply still weaken and leave the bodies after a while. There's no suspense with Riley if he'll just get better, how stupid. Also, why did Cole's brother Duckett do what he did, was that a spirit or was he so damaged from the whole incident?I guess you could make a case that Riley is in hospital and monitored and prevented from successfully killing himself. Even still, how many people has Cole seen that have been over exposed and then managed to not kill themselves so he can be aware of this information?His brother killed himself before he could be freed it seems or again so it appeared, there's a real lack of clarity here. Did someone else tell Cole that information perhaps, which in turn means he wouldn't know if that was actually true or not and with his brothers death, why would he believe that! You see my frustration with the writing here.There were several other instances of poor and predictable writing such as Mia being controlled by a spirit that's so evidently not her mother, and the inevitable stabbing of her father Max with the scissors after he barges into her room to help her.Why didn't Mia kill her dad to be safe in the state she was in and how did he not bleed out anyway, or did we just need him alive for the ending so she can run after him in the hospital for the not so shocking ending...Again, Mia will obviously tell Jade to leave the hospital and Jade will discover Max before Jade then informs her mother Sue (Miranda Otto) about Mia but oh it's too late, surprise, surprise. Mia ends up dead in the middle of the road looking like the kangaroo she left to die in the road earlier, and we randomly see the kangaroo's spirit briefly it seems foreshadowing her death.I get this is about her not moving on and taking responsibility for her actions meaning she's destined to be in limbo forever feeling this same grief, fair enough. I still don't think however the kangaroo works as a form of symbolism in this film, it feels wedged in to be more evocative than what it is because it has to have a deeper meaning than the shell of a script was giving it.Sue's instant blaming of Mia just because she did weed once and her not knowing why Riley did what he did, is over the top for me. Sue knows nothing of the hand fair enough too, and I can appreciate she's grief stricken, but she just goes to flat out blaming her daughters friend before she has any further evidence, even in grief, that's not acceptable.I'd like to add that the police appeared content with whatever happened at the house and there's no real reference to them again. Was Mia's bag searched? Surely the hand might possibly have been confiscated and investigated regardless, I find it too unlikely she'd have smuggled something as random as that out successfully but maybe I can just about accept that, one of the few times I can with this script!The second Sue knows it's not drugs, she then apologies to Mia, but what if Mia did play a part in Riley's downfall that wasn't drug related? I mean that's what did happen, Mia consented to Riley using the hand for 50 seconds and then kept him in longer out of selfishness and an inability to get over her mothers death. I'm not expecting Sue to know that but it's a strange approach to take for her to flat out blame Mia, she almost attaches less blame to her own daughter even though I do appreciate the car scene shows her disappointment with Jade, and Sue needing time to heal.This belief that her son was fine and then he's attempting to rip his eyeballs out and smash his head in, again I find Sue's reaction to simply accept it must just be a 'breakdown' as bizarre. You can mask mental health difficulties but this would be something else entirely, does Sue not question what might have caused the breakdown then if it's not drugs?There was a lot of potential here, but Michael and Danny Philippou haven't succeeded in cultivating a believable and moving story.",
    "21": "So no background on the hand? Ok. Well the rest of the hour was as fun as a tooth canal. Also when she fell did anyone else see the WHITE stunt double on the ground? What a lame attempt at a movie. I heard it was great but my partner and I couldn't wait for it to end. What a boring pos. I heard it was suppose to be scary well I was amused by when I went to pee and a character said oi. Trash. I honestly was confused who was who the dad getting stabbed was obvious. The ending was actually intriguing if they built up a world where I would care. I don't know what was worse Barbie or this movie. Evil Dead is 100%better than this trash.",
    "22": "There is a hand that can connect you with the dead, when it takes hold you will be pumped up full of dread, as you envelope round the fingers, digits conjure souls to bring yer, they pass across, and make their way into your head. It's fair to say that this is far from armless fun, if you were there I'm pretty sure you'd make a run, palm-off the grasp to others, to avoid becoming smothered, doing everything you can to snub and shun. But there are those who when encouraged can't resist, who chose to wrestle with the demons at the wrist, like a glory hole for arms, with much regret and many qualms, if nothing else, just hold on tight, and make a fist.",
    "23": "This movie was horrible. The start was interesting but the rest was confusing, borderline stupid, and just boring. Honestly i wanted to walk out the theatre in the middle of the movie. I was so excited to see this movie. I read some great reviews and it seemed original, but I was let down. The premise of the story could be great, but they missed so many opportunities. The main character annoyed me and clearly made some of the dumbest decisions ever. It was almost like the \"hand\" was an extra in this movie, when it should have been the main character. They literally tell you nothing about it - we should have known EVERYTHING about it. Not a complete waste of time, but don't get your hopes up!",
    "24": "IMDB reviews aren't really my thing, but after attending Talk to Me at the 2023 Sundance Film Festival, I had to come on here and sing it praise. Every year there are a few horror movies that are discovered that set the genre ablaze with excitement, 2023 is no exception. Talk to Me is masterfully layered with suspense, mystery, and high-octane horror, but this isn't your standard possession film, and thank god for that. Without delving into spoiler territory, this film also grapples with the loss of a loved one, the impact it can have on our psyche, and what lengths a person would go to silence their pain. In their directorial debut the Philippou brothers extend a hand to the viewer for an incredible ride.",
    "25": "Its an overall good movie especially considering it is the first feature film attempt by the directors. But is far from perfect. The biggest (& possibly the only) flaw of the movie is its protaganist. She does not miss a single chance to act stupid & selfish and keeps getting everyone else into trouble. This makes watching the movie a frustrating experience at times. If there was a proper sensible character to counter her and was given as much screen time, movie would have been better. But on technical level, its a well made movie with nice effects, cinematography, acting & direction. In the end, if I was to rank this movie in comparison to other horror movies. I would rank it above any conjuring or insedious sequels but below movies like 'It Follows'.",
    "26": "I think \"Talk to me\" could have been been great, it had potential. I think teen horror is still trendy but these kids were so disrespectful it drove me crazy. They knew what they were doing was not respectful towards the spirits/ghosts whatever, yet still kept doing it anyway for laughs AND film it. Like nah. None of the characters were likeable either. Whats with horror these days making the characters so unlikeable?? I ended up rooting for the spirits cos damn i get it. Man I would be pissed too if some dumb kids did this kind of bs lol. They had it coming and acted surprised when they got what was deserved.",
    "27": "I just got out of a pre-screening event for \"Talk to Me,\" and a lady who said she was a rep for the studios and was taking notes to send to the studios and the directors ( Danny Philippou, Michael Philippou ). I was asked my thoughts and I'll share my thoughts as I said them to her: I am happy this isn't pretentious and that the average movie-goer will like it.Needless to say, she wasn't thrilled with my response and went to another person.A24 has built a brand for themselves over the years as being snooty, know-more-than-you and movies that are either too artsy for horror fans or too horror for artsy fans. Personally, I love their brand and welcome all their movies with open arms.\"Talk to Me,\" is neither scary nor artsy. It's about as far out there as a \"Nightmare on Elm st.\" sequel and hits all the marks: Just enough blood and make up to satisfy the horror hounds and has a likeable story line so everyone can watch this movie and not feel insulted.Mia, played by a phoning-it-in Sophie Wilde, just lost her mother and she spends her time with her best friends family: Jade (Alexandra Jensen); her brother, Riley (Joe Bird) and mom, Sue (Miranda Otto).Hayley (Zoe Terakes) and their friend Joss (Chris Alosio) throw parties where guests shake hands with a supposed real hand of a medium or satanist (both ideas are pitched, but who cares) say \"Talk to Me\" and viola! You got spirits!Do we really care about the rest of the plot? Not really. And, that's the problem: There really isn't much more of a plot. There is a side story about Mia's dead mother using the hand in order to speak with Mia and Riley, becoming severely injured, but, none of it's really entertaining.Are the spirits lying to Mia in order to get a sacrifice to come to our world? Are the spirits using Mia to do their evil bidding? Yes and no, but: you don't care.A24 served up a bland, no brains horror flick with nice blood and was a step outside their realm. There's no cool shots, there's not a lot to think about but there is a lot of music and score, which was different.Go into \"Talk to Me\" expecting nothing and you'll walk out happy.",
    "28": "Mysteries and Strong Points -1. Did the Mother Really Kill Herself? Or was there something more Nefarious at hand here? To do with the Father.2. Was that Even Her Mothers Spirit? Of an Evil Imposter! 😳 TRICKING HER ABOUT EVERYTHING, TO GET RILEYS SPIRIT?3. Did her Best Friend Push her onto the Highway? Or did Mia Jump onto the Highway Herself?4. The Hospital Ending, Did Her Father Survive? Because He Couldn't Hear Her because she was in the Spirit World Dead. So is he Alive?5. The Very Ending Sounds and Pitch Black Walk Up to the Candle was Very Good, Very Strong Score There.Problems I had -We have 2 People Mia and RileyMia - Plays the Hand Game 🤝 BUT stays too long over 90 Seconds BUT does manage to Close the Door (Candle) and is Not in the Spirit World but the Consequences are, Mia is still being Contacted by the Various Spirits.Riley - Plays the Hand Game 🤝 , Stays too Long, DOESN'T close the Door (Candle), gets Battered into a Coma and IS actually in the Spirit World👻.1. How Does Riley Get out of the Spirit World? Was it Because Both Mia and Riley Were Both now Connected to the Spirit World? Was Mia's Sacrifice Enough? And it Satisfied Mia's \"Mother\" THE FILM DOESN'T SAY 😤😠Overall, Some Very Strong Points within this Film, Though it seems like NOT ALL of it Gels Together.",
    "29": "My gawd where do I start I wanted to get out of the movie theater by the middle of the film, this Mia girl she is just so so so dumb it's unbelievable all the things that happen on this film are just so dumb, you may think is a movie that will scare you or at least make you feel uncomfortable or something, but is just this girl Mia having her mommy issues all throughout the film, if you are into hardcore horror films you should skip this one. Is just plain boring and the premise is stupid. At the end everyone was so dumb I could care less how it would end and the ending is just so predictable, if you think you are going to see gruesome murders or scary stuff trust me this film ain't any of that.What a waste of potential.",
    "30": "This was really bad. Just bad acting, no story and not scary. All the main characters are unlikable and rather stupid.I found the whole thing quite boring and there was no logic in anything that happened. Yes, I know it's a horror movie, but still, it has to involve something that keeps your interest - and that part is missing. When the main character show her stupidity when finding a wounded animal by the road - You just out of reasons to care for that person at all.So why all the good reviews? Well, I guess the hype machine worked on this one. At least something that worked, because the movie did not.",
    "31": "Once again, we have a horror film that doesn't have a single new or interesting idea and yet it's praised to the heavens. It's as if the critics haven't actually seen enough horror films to recognize that everything in this film has been done before and done much better.Once again, we have a group of sarcastic partying teens (or thereabouts) who manage, through their own stupidity, to summon evil visions followed by actual evil deeds. That they each experience horrifying results from what is passed off as a party game does not deter them in the least.Two sentences are thrown in to take a stab at explaining the evil porcelain hand and then it's off to the races. Where did it come from? What might explain its effects? What's the basis for the ritual that makes it work? Who knows? Not the filmmakers, apparently.The leads are appealing actors but their efforts are wasted in this mess.Fans of mindless brutality may find something of interest here because it's nothing if not brutal. But everyone else should wait until it streams if they feel the need to see it.",
    "32": "Movie was not scary. At all. We were excited to see this considering the high reviews and people saying they fainted in the theater. It was NOT SCARY. Started off promising but it dropped off very quick. Ending was stupid. They didn't explain anything either. Should have been a movie that went straight to Hulu. Don't waste your money.The premise behind it was interesting but characters just stopped showing up that were involved. It made no sense. The only good scene was when the teen tried the hand and started slamming himself and taking out his eye ball. That was the ONLY scene in the movie worth watching.",
    "33": "I just came back from the theaters watching talk to me and i really liked it.Cinematography: 9/10. Acting: 8,5/10. Special effects: 7,8/10. Plot: 8,7/10I honestly loved the concept of the movie, like it's not some standart possesion movie, it's different, but in a good way. I don't think this is a really scary horror movie, but it's still pretty good. What i missed in this movie: there were like almost no jumpscares, and i personally think that's one of the most important things for a horror movie. I think the performances are great. I also loved the ending, i did not see that coming.I definetly recommend this movie to others because i had a great time with this movie. I give it a 7,8/10.",
    "34": "I went into this excited. What a let down. The acting was subpar at best. A lot of it didnt make sense at all. Characters were extremely unlikeable. This could have been such a good movie. Made by someone else, with a bit more of a twisted mind. This could have easily passed as a pg13 film. Storyline made absolutely no sense. Still a million unanswered questions and the ending was just a horrible as the reat of the film. Just dont waste your time. Newer 'horror' films do not hold a candle to 70s, 80, and 90s horror. Those were absolutely the golden years of the horror genre. What a flop of a good idea that could have been awesome!",
    "35": "I'll start with positives. The film was shot really well so credit to cinematographer Aaron McLisky and his team for their efforts.Both practical and special effects were top quality throughout, I never felt anything looked fake. The makeup was actually very effective with the spirits and with the whole Riley incident. Particularly when he injures himself and the scenes subsequently where he is in the hospital are well done. He does look battered and bruised in a gruesome way. Finally, I thought the acting throughout was also good, I can't knock that at all, but there are significant issues, and it's all the writing for me.The film needed so many re-writes to get it where it needed to be. I get annoyed and disappointed worst of all, when films that try to take you somewhere, can only get you there by making the actions of the characters be the most stupid they could be.I won't go into a massively detailed full story retread, but suffice it to say that the film follows Mia (Sophie Wilde). Mia is an emotionally vulnerable teenager who is still recovering alongside her father Max (Marcus Johnson) over the suicide of Mia's mother Rhea (Alexandria Steffensen) two years prior.Mia ends up going to a party hosted by friends Hayley (Zoe Terakes) and Joss (Chris Alosio) who have an embalmed hand supposedly from a psychic. It can apparently allow any individual to be taken over by a spirit if they say 'talk to me' and then give permission to let the spirit into their bodies.Mia has a best friend called Jade (Alexandra Jensen), who has a younger brother called Riley (Joe Bird). Riley winds up using the hand against Jade's wishes and ushered on by Mia. Riley seemingly gets inhabited by the spirit of Mia's dead mother Rhea. Mia at this point has herself already used the hand several times and been over exposed to its power from the first experience, apparently if you're inhabited by a spirit for more than 90 seconds, you're in trouble.The sheer implication that anyone would be as stupid as to let the spirit inside you is mind boggling. I know they're teenagers but I can't believe it. Mia just witnessed what's quite clearly a spirit on the first attempt after touching the hand and saying 'Talk to me' and she thinks to go again and then let a spirit possess her...get right out of here with that level of crazy!Nothing about this concept looks fun, getting a buzz from letting dead people inside you is just stupid for me I'm sorry. You're literally playing devils advocate with your life and soul, I'm not religious, but in the context of this film and seeing what's in front of you, why would you be so blasé about your life?You can't play the film off as serious and scary and then let us believe anyone would do any of this, if you can't bring the audience in on the realism of the entire plot device to kick start the film, then I'm sorry, you've severely messed up.Everything was so predictable too, there's no element of suspense throughout, the story hits all the numbers you expect of to, or it did for me at least.Where does the 90 second rule come from, no explanation? I'm aware Duckett (Sunny Johnson) who stabs his brother Cole (Ari McCarthy) before killing himself at the start of the film has suffered at the cost of being over exposed to the embalmed hand or that's at least the implication?Is that where the 90 second rule came from and even if Duckett was over exposed to the hand, how would you know it's 90 seconds that did cost him, and not 87 or 88 seconds etc...you then know that when Mia experiments with it, of course she'll be exposed for more than 90 seconds and suffer the ill effects for the rest of the film.The toe sucking scene for instance was stupidly predictable with it being shown as her doing it. This is followed up by more dumb writing where Daniel (Otis Dhanji) awkwardly explains his viewpoint from that night to Jade, when I think that whole scenario could have been avoided with some outright honesty to Jade. Nothing did happen and it would have appeared less weird if they spoke truthfully about what happened straight away, but the writing needed it to create tension between Mia and Jade but I do think it could have been done without too much awkwardness.Why does the little girl later in the film let Mia in, and none of the spirits prior to this seemingly consider doing the same if they're able to? I'd have thought some benefit may be attained from the spirits being able to do this, trapping the living on the other side maybe without needing to wait 90 seconds, I think there was potential there that was wasted or they should have scrapped that idea as it was too messy to integrate.I don't like the convenient information from Cole that the spirits simply still weaken and leave the bodies after a while. There's no suspense with Riley if he'll just get better, how stupid. Also, why did Cole's brother Duckett do what he did, was that a spirit or was he so damaged from the whole incident?I guess you could make a case that Riley is in hospital and monitored and prevented from successfully killing himself. Even still, how many people has Cole seen that have been over exposed and then managed to not kill themselves so he can be aware of this information?His brother killed himself before he could be freed it seems or again so it appeared, there's a real lack of clarity here. Did someone else tell Cole that information perhaps, which in turn means he wouldn't know if that was actually true or not and with his brothers death, why would he believe that! You see my frustration with the writing here.There were several other instances of poor and predictable writing such as Mia being controlled by a spirit that's so evidently not her mother, and the inevitable stabbing of her father Max with the scissors after he barges into her room to help her.Why didn't Mia kill her dad to be safe in the state she was in and how did he not bleed out anyway, or did we just need him alive for the ending so she can run after him in the hospital for the not so shocking ending...Again, Mia will obviously tell Jade to leave the hospital and Jade will discover Max before Jade then informs her mother Sue (Miranda Otto) about Mia but oh it's too late, surprise, surprise. Mia ends up dead in the middle of the road looking like the kangaroo she left to die in the road earlier, and we randomly see the kangaroo's spirit briefly it seems foreshadowing her death.I get this is about her not moving on and taking responsibility for her actions meaning she's destined to be in limbo forever feeling this same grief, fair enough. I still don't think however the kangaroo works as a form of symbolism in this film, it feels wedged in to be more evocative than what it is because it has to have a deeper meaning than the shell of a script was giving it.Sue's instant blaming of Mia just because she did weed once and her not knowing why Riley did what he did, is over the top for me. Sue knows nothing of the hand fair enough too, and I can appreciate she's grief stricken, but she just goes to flat out blaming her daughters friend before she has any further evidence, even in grief, that's not acceptable.I'd like to add that the police appeared content with whatever happened at the house and there's no real reference to them again. Was Mia's bag searched? Surely the hand might possibly have been confiscated and investigated regardless, I find it too unlikely she'd have smuggled something as random as that out successfully but maybe I can just about accept that, one of the few times I can with this script!The second Sue knows it's not drugs, she then apologies to Mia, but what if Mia did play a part in Riley's downfall that wasn't drug related? I mean that's what did happen, Mia consented to Riley using the hand for 50 seconds and then kept him in longer out of selfishness and an inability to get over her mothers death. I'm not expecting Sue to know that but it's a strange approach to take for her to flat out blame Mia, she almost attaches less blame to her own daughter even though I do appreciate the car scene shows her disappointment with Jade, and Sue needing time to heal.This belief that her son was fine and then he's attempting to rip his eyeballs out and smash his head in, again I find Sue's reaction to simply accept it must just be a 'breakdown' as bizarre. You can mask mental health difficulties but this would be something else entirely, does Sue not question what might have caused the breakdown then if it's not drugs?There was a lot of potential here, but Michael and Danny Philippou haven't succeeded in cultivating a believable and moving story.",
    "36": "So no background on the hand? Ok. Well the rest of the hour was as fun as a tooth canal. Also when she fell did anyone else see the WHITE stunt double on the ground? What a lame attempt at a movie. I heard it was great but my partner and I couldn't wait for it to end. What a boring pos. I heard it was suppose to be scary well I was amused by when I went to pee and a character said oi. Trash. I honestly was confused who was who the dad getting stabbed was obvious. The ending was actually intriguing if they built up a world where I would care. I don't know what was worse Barbie or this movie. Evil Dead is 100%better than this trash.",
    "37": "There is a hand that can connect you with the dead, when it takes hold you will be pumped up full of dread, as you envelope round the fingers, digits conjure souls to bring yer, they pass across, and make their way into your head. It's fair to say that this is far from armless fun, if you were there I'm pretty sure you'd make a run, palm-off the grasp to others, to avoid becoming smothered, doing everything you can to snub and shun. But there are those who when encouraged can't resist, who chose to wrestle with the demons at the wrist, like a glory hole for arms, with much regret and many qualms, if nothing else, just hold on tight, and make a fist.",
    "38": "This movie was horrible. The start was interesting but the rest was confusing, borderline stupid, and just boring. Honestly i wanted to walk out the theatre in the middle of the movie. I was so excited to see this movie. I read some great reviews and it seemed original, but I was let down. The premise of the story could be great, but they missed so many opportunities. The main character annoyed me and clearly made some of the dumbest decisions ever. It was almost like the \"hand\" was an extra in this movie, when it should have been the main character. They literally tell you nothing about it - we should have known EVERYTHING about it. Not a complete waste of time, but don't get your hopes up!",
    "39": "IMDB reviews aren't really my thing, but after attending Talk to Me at the 2023 Sundance Film Festival, I had to come on here and sing it praise. Every year there are a few horror movies that are discovered that set the genre ablaze with excitement, 2023 is no exception. Talk to Me is masterfully layered with suspense, mystery, and high-octane horror, but this isn't your standard possession film, and thank god for that. Without delving into spoiler territory, this film also grapples with the loss of a loved one, the impact it can have on our psyche, and what lengths a person would go to silence their pain. In their directorial debut the Philippou brothers extend a hand to the viewer for an incredible ride.",
    "40": "Its an overall good movie especially considering it is the first feature film attempt by the directors. But is far from perfect. The biggest (& possibly the only) flaw of the movie is its protaganist. She does not miss a single chance to act stupid & selfish and keeps getting everyone else into trouble. This makes watching the movie a frustrating experience at times. If there was a proper sensible character to counter her and was given as much screen time, movie would have been better. But on technical level, its a well made movie with nice effects, cinematography, acting & direction. In the end, if I was to rank this movie in comparison to other horror movies. I would rank it above any conjuring or insedious sequels but below movies like 'It Follows'.",
    "41": "I think \"Talk to me\" could have been been great, it had potential. I think teen horror is still trendy but these kids were so disrespectful it drove me crazy. They knew what they were doing was not respectful towards the spirits/ghosts whatever, yet still kept doing it anyway for laughs AND film it. Like nah. None of the characters were likeable either. Whats with horror these days making the characters so unlikeable?? I ended up rooting for the spirits cos damn i get it. Man I would be pissed too if some dumb kids did this kind of bs lol. They had it coming and acted surprised when they got what was deserved.",
    "42": "I just got out of a pre-screening event for \"Talk to Me,\" and a lady who said she was a rep for the studios and was taking notes to send to the studios and the directors ( Danny Philippou, Michael Philippou ). I was asked my thoughts and I'll share my thoughts as I said them to her: I am happy this isn't pretentious and that the average movie-goer will like it.Needless to say, she wasn't thrilled with my response and went to another person.A24 has built a brand for themselves over the years as being snooty, know-more-than-you and movies that are either too artsy for horror fans or too horror for artsy fans. Personally, I love their brand and welcome all their movies with open arms.\"Talk to Me,\" is neither scary nor artsy. It's about as far out there as a \"Nightmare on Elm st.\" sequel and hits all the marks: Just enough blood and make up to satisfy the horror hounds and has a likeable story line so everyone can watch this movie and not feel insulted.Mia, played by a phoning-it-in Sophie Wilde, just lost her mother and she spends her time with her best friends family: Jade (Alexandra Jensen); her brother, Riley (Joe Bird) and mom, Sue (Miranda Otto).Hayley (Zoe Terakes) and their friend Joss (Chris Alosio) throw parties where guests shake hands with a supposed real hand of a medium or satanist (both ideas are pitched, but who cares) say \"Talk to Me\" and viola! You got spirits!Do we really care about the rest of the plot? Not really. And, that's the problem: There really isn't much more of a plot. There is a side story about Mia's dead mother using the hand in order to speak with Mia and Riley, becoming severely injured, but, none of it's really entertaining.Are the spirits lying to Mia in order to get a sacrifice to come to our world? Are the spirits using Mia to do their evil bidding? Yes and no, but: you don't care.A24 served up a bland, no brains horror flick with nice blood and was a step outside their realm. There's no cool shots, there's not a lot to think about but there is a lot of music and score, which was different.Go into \"Talk to Me\" expecting nothing and you'll walk out happy.",
    "43": "I admit that this is slightly above average when it comes to standard supernatural teenage horror movies. The vibe in the beginning is pretty creepy and morbidly fun.. but at the end the movie doesn't serve us with anything we haven't seen a thousand times before.It's not a bad teenage horror flick per se, but when considering all the hype this movie has gotten.. it's very STANDARD.The story is predictable af, the plot choices are very clichéd, we don't learn ANYTHING about the creepy hand or it's mythos (which is the most interesting thing here)... it's just a run of the mill chick-going-crazy-or-is-she teenage horror movie.Not that bad if you're not excepting anything, but far from a modern horror classic that it's dubbed to be.",
    "44": "So, I've must've missed the \"brutal, gory, shocking, scary\" parts. Really, where are those parts?Take away a little blood here and there and this could've been a Disney Halloween movie, at least back in the 90s.What am I missing? This flick I rated 16 over here. Seriously.There's only one scene which is nice and it's with the little boy.. after that everything is boring, not scary at all. It's a good concept but the movie is just boring.Random words, because there's nothing more to say. Random words, because there's nothing more to say. Random words, because there's nothing more to say.",
    "45": "This movie really delivered. It has a certain Hereditary Vibe and at the same time came across with some fresh ideas and, for me, the most important aspect: a coherent atmosphere. Dang this movie triggered so many emotions and had great acting, great characters and so many good ideas. And I dont know how high the budget was, but it felt very big and i am sure it wasnt. There are so many creative ideas to raise the feeling of seeing a big budget movie but there was no time thinking about that while watching it. Can not wait to see how it does when it goes public. Thank you for this great experience!",
    "46": "Terrible, one of the worst films I ever saw, I was mistaken by the grade 7,5 and thought may be it's a good one, imagine the others horror stories with 6 or below. And I can't believe this freak movie won something wich is showed on the beggining, my God WTF people are watching today?Terrible story, many things ignored and untold, horrible and ugly casting, terrible actuations, adults acting like teenagers, the only who saves is the little boy but got cut out the movie. And a terrible ending too, come on, HOW does this horrible movie has a 7,5 I do not know.DON'T SPEND YOUR MONEY, YOU'VE BEEN WARNED.",
    "47": "I was really looking forward to see Talk To Me, as people were calling it the scariest and most unique horror film of the year. Did I see a different movie?I'm really surprised by the other reviews. This movie was so generic. There's nothing unique about it and it's full of plot holes. It has some of the most unlikeable characters I have ever seen in a film. The ending is also really dumb. And oh god, that cringey montage with the rap song and the KSI cameo. This movie was clearly designed to cater to teenagers.The gore is quite impressive, I admit that. The opening is also really strong. Too bad the whole movie goes downhill after that. 5/10.",
    "48": "The film opens with a gruesome murder-suicide at a large teen party with it being caught on many cell phones. Mia (Sophie Wilde) is a student whose mother committed suicide two years ago. She is being raised by her father (Marcus Johnson). Her best friend is Jade (Alexandra Jensen). They are very close as she sleeps over there and is friends with Riley (Joe Bird) Jade's 15 year-old brother. Miranda Otto plays Jade and Riley's mother. The girls go out to a party where they play a game of communicating with the dead. Instead of the overused OUIJA board they use a ceramic cover embalmed hand of a medium. One person grasps the hand and says \"Talk to me.\" An ugly spirit appears. The person then says, \"I let you in\" and the spirit possess the person. They have a 90 second timer on it or else the person may get possessed. Like tracing a call. Riley insists on playing. He ends up contacting Mia's mother who lets it run for two minutes and then the fun happens.The plot is similar to other horrors but the prop is different. The film was well done. Australian made.Guide: F-word. No sex or nudity.",
    "49": "Talk to Me fits right along with the recent trend of moralizing horror like Hereditary, The Babadook, and Relic. The issue I had with this film (and Hereditary) is the inability of the storytellers to choose whether they want to talk about grief or scare you. The film looks good is pretty much all I can give it and the preformers are certainly committed. The film fails to emotionally mine the grief of Riley in any meaningful way. It also didnt scare me. The more I think about it this just feels like a padded out evil dead with none of the scares and humor. What makes The Evil Dead so perfect is that it knows what it wants to be. The characters aren't fleshed out, and they don't have to be. The effect ends up being you put yourself in Ash's shoes and then begin to realize how horrible the situation truly is. It wasn't trying to explore trauma and tie it up with a neat bow.",
    "50": "I'm assuming all the good reviews are from kids, or adults so starved for fresh horror they'll give anything \"different\" high marks, since the film is definitely marketed for teens.I only watched it due to all the hype. I should've listened to my instinct. This movie is pretty damn awful on every level -- poor acting (bad direction), lame story, nonsensical hip-hop score. I WAS BORED. The only thing 'new' is the conducting of seances with an arm instead of a Ouija board. And the kids are so stupid and obnoxious, I can't tell if it's meant to be serious or satire.I've read the film is supposedly a metaphor for drug addiction, and if it is, that's not even done particularly well. The only interesting scene is the last 5 second ending.",
    "51": "I have been anxiously awaiting this film's release since originally seeing the trailer, so when offered a free pre-screener, I jumped at the opportunity! The theater was packed with horror fans and you could feel the excitement in the air. However, after a strong opening sequence, that excitement soon dissipated.Let's keep this short and sweet. While the scares were great, they were few and far between. For the most part, I liked the cast and their performances but I wanted more from the story. I got bored. With a total running time of 1 hour and 34 minutes, there's truly only about 10-15 minutes that are actually scary and/or exciting. I'm a huge A24 fan, but this was NOT it, y'all!",
    "52": "It had an original idea that I had never seen before and thought was intriguing. The hand thing was very cool and unique. And for a small budget movie they did well on there special affects. It was decent. Once possessed it was convincing but I'll give that credit to the actors for doing there jobs.As a one time watch it's OK, but I won't be able to watch it again. For me, it's the decisions. I could not truly enjoy once we got to attempts at resolving the possession issue. Perhaps it was using youths and attempting to predict actual decisions but when a family member or a good friend is in danger you do what you can. And that wasn't done here. And the how Riley made it out alive it confuses me even more.I knew Mia's end at the beginning. So perhaps that affected my perception. However, I felt it was one bad decision after another.",
    "53": "Read so much good stuff about this , got a wine , headphones , dark room , all you could want apart from a decent scary film , ok I'm an exorcist freak and I know it will never be beaten but I'm still hoping for a close second but nothing yet unfortunately l nothing has scared me since that epic film and I doubt it will Read so much good stuff about this , got a wine , headphones , dark room , all you could want apart from a decent scary film , ok I'm an exorcist freak and I know it will never be beaten but I'm still hoping for a close second but nothing yet unfortunately l nothing has scared me since that epic film and I doubt it will.",
    "54": "I don't understand how anyone enjoyed this or thought it was scary. It was such a dumb movie with horrible characters. Absolute garbage. Utter drivel. Completely ridiculous premise, characters willingly doing something that no one in their right minds would do, dreadful characters. The list could go on. Really, do not bother. It seems to be aimed at. Well,I don't really know who it's aimed at. It had is creepy parts but it didn't come off to me as a terrifying film. It must be from being a big time horror fan, not much can scare me. I guess it would scare someone who hasn't seen horror films regularly. Doesn't mean it wasn't a good film. It just wasn't a big hype to me and there were several plot holes.",
    "55": "Take the basis of any Ouija movie, add in a little body swap de jour, like Freaky, Evil Dead or even Suitable Flesh with a hint of Insidious and Flatliners and you have Talk To Me. An excellent Australian horror that I caught on Netflix.Direction, lighting and editing are all good. The plot and storyline is excellent. The characters are largely unlikeable due to their stupidity but then we wouldn't have a storylines if stupid people didn't do stupid things to get movies started.The acting is largely good enough with Sophie Wilde being the best of the bunch.A sequel has already been commissioned and I will be ready and waiting.",
    "56": "I admit that this is slightly above average when it comes to standard supernatural teenage horror movies. The vibe in the beginning is pretty creepy and morbidly fun.. but at the end the movie doesn't serve us with anything we haven't seen a thousand times before.It's not a bad teenage horror flick per se, but when considering all the hype this movie has gotten.. it's very STANDARD.The story is predictable af, the plot choices are very clichéd, we don't learn ANYTHING about the creepy hand or it's mythos (which is the most interesting thing here)... it's just a run of the mill chick-going-crazy-or-is-she teenage horror movie.Not that bad if you're not excepting anything, but far from a modern horror classic that it's dubbed to be.",
    "57": "So, I've must've missed the \"brutal, gory, shocking, scary\" parts. Really, where are those parts?Take away a little blood here and there and this could've been a Disney Halloween movie, at least back in the 90s.What am I missing? This flick I rated 16 over here. Seriously.There's only one scene which is nice and it's with the little boy.. after that everything is boring, not scary at all. It's a good concept but the movie is just boring.Random words, because there's nothing more to say. Random words, because there's nothing more to say. Random words, because there's nothing more to say.",
    "58": "This movie really delivered. It has a certain Hereditary Vibe and at the same time came across with some fresh ideas and, for me, the most important aspect: a coherent atmosphere. Dang this movie triggered so many emotions and had great acting, great characters and so many good ideas. And I dont know how high the budget was, but it felt very big and i am sure it wasnt. There are so many creative ideas to raise the feeling of seeing a big budget movie but there was no time thinking about that while watching it. Can not wait to see how it does when it goes public. Thank you for this great experience!",
    "59": "Terrible, one of the worst films I ever saw, I was mistaken by the grade 7,5 and thought may be it's a good one, imagine the others horror stories with 6 or below. And I can't believe this freak movie won something wich is showed on the beggining, my God WTF people are watching today?Terrible story, many things ignored and untold, horrible and ugly casting, terrible actuations, adults acting like teenagers, the only who saves is the little boy but got cut out the movie. And a terrible ending too, come on, HOW does this horrible movie has a 7,5 I do not know.DON'T SPEND YOUR MONEY, YOU'VE BEEN WARNED.",
    "60": "I was really looking forward to see Talk To Me, as people were calling it the scariest and most unique horror film of the year. Did I see a different movie?I'm really surprised by the other reviews. This movie was so generic. There's nothing unique about it and it's full of plot holes. It has some of the most unlikeable characters I have ever seen in a film. The ending is also really dumb. And oh god, that cringey montage with the rap song and the KSI cameo. This movie was clearly designed to cater to teenagers.The gore is quite impressive, I admit that. The opening is also really strong. Too bad the whole movie goes downhill after that. 5/10.",
    "61": "The film opens with a gruesome murder-suicide at a large teen party with it being caught on many cell phones. Mia (Sophie Wilde) is a student whose mother committed suicide two years ago. She is being raised by her father (Marcus Johnson). Her best friend is Jade (Alexandra Jensen). They are very close as she sleeps over there and is friends with Riley (Joe Bird) Jade's 15 year-old brother. Miranda Otto plays Jade and Riley's mother. The girls go out to a party where they play a game of communicating with the dead. Instead of the overused OUIJA board they use a ceramic cover embalmed hand of a medium. One person grasps the hand and says \"Talk to me.\" An ugly spirit appears. The person then says, \"I let you in\" and the spirit possess the person. They have a 90 second timer on it or else the person may get possessed. Like tracing a call. Riley insists on playing. He ends up contacting Mia's mother who lets it run for two minutes and then the fun happens.The plot is similar to other horrors but the prop is different. The film was well done. Australian made.Guide: F-word. No sex or nudity.",
    "62": "Talk to Me fits right along with the recent trend of moralizing horror like Hereditary, The Babadook, and Relic. The issue I had with this film (and Hereditary) is the inability of the storytellers to choose whether they want to talk about grief or scare you. The film looks good is pretty much all I can give it and the preformers are certainly committed. The film fails to emotionally mine the grief of Riley in any meaningful way. It also didnt scare me. The more I think about it this just feels like a padded out evil dead with none of the scares and humor. What makes The Evil Dead so perfect is that it knows what it wants to be. The characters aren't fleshed out, and they don't have to be. The effect ends up being you put yourself in Ash's shoes and then begin to realize how horrible the situation truly is. It wasn't trying to explore trauma and tie it up with a neat bow.",
    "63": "I'm assuming all the good reviews are from kids, or adults so starved for fresh horror they'll give anything \"different\" high marks, since the film is definitely marketed for teens.I only watched it due to all the hype. I should've listened to my instinct. This movie is pretty damn awful on every level -- poor acting (bad direction), lame story, nonsensical hip-hop score. I WAS BORED. The only thing 'new' is the conducting of seances with an arm instead of a Ouija board. And the kids are so stupid and obnoxious, I can't tell if it's meant to be serious or satire.I've read the film is supposedly a metaphor for drug addiction, and if it is, that's not even done particularly well. The only interesting scene is the last 5 second ending.",
    "64": "I have been anxiously awaiting this film's release since originally seeing the trailer, so when offered a free pre-screener, I jumped at the opportunity! The theater was packed with horror fans and you could feel the excitement in the air. However, after a strong opening sequence, that excitement soon dissipated.Let's keep this short and sweet. While the scares were great, they were few and far between. For the most part, I liked the cast and their performances but I wanted more from the story. I got bored. With a total running time of 1 hour and 34 minutes, there's truly only about 10-15 minutes that are actually scary and/or exciting. I'm a huge A24 fan, but this was NOT it, y'all!",
    "65": "It had an original idea that I had never seen before and thought was intriguing. The hand thing was very cool and unique. And for a small budget movie they did well on there special affects. It was decent. Once possessed it was convincing but I'll give that credit to the actors for doing there jobs.As a one time watch it's OK, but I won't be able to watch it again. For me, it's the decisions. I could not truly enjoy once we got to attempts at resolving the possession issue. Perhaps it was using youths and attempting to predict actual decisions but when a family member or a good friend is in danger you do what you can. And that wasn't done here. And the how Riley made it out alive it confuses me even more.I knew Mia's end at the beginning. So perhaps that affected my perception. However, I felt it was one bad decision after another.",
    "66": "Read so much good stuff about this , got a wine , headphones , dark room , all you could want apart from a decent scary film , ok I'm an exorcist freak and I know it will never be beaten but I'm still hoping for a close second but nothing yet unfortunately l nothing has scared me since that epic film and I doubt it will Read so much good stuff about this , got a wine , headphones , dark room , all you could want apart from a decent scary film , ok I'm an exorcist freak and I know it will never be beaten but I'm still hoping for a close second but nothing yet unfortunately l nothing has scared me since that epic film and I doubt it will.",
    "67": "I don't understand how anyone enjoyed this or thought it was scary. It was such a dumb movie with horrible characters. Absolute garbage. Utter drivel. Completely ridiculous premise, characters willingly doing something that no one in their right minds would do, dreadful characters. The list could go on. Really, do not bother. It seems to be aimed at. Well,I don't really know who it's aimed at. It had is creepy parts but it didn't come off to me as a terrifying film. It must be from being a big time horror fan, not much can scare me. I guess it would scare someone who hasn't seen horror films regularly. Doesn't mean it wasn't a good film. It just wasn't a big hype to me and there were several plot holes.",
    "68": "Take the basis of any Ouija movie, add in a little body swap de jour, like Freaky, Evil Dead or even Suitable Flesh with a hint of Insidious and Flatliners and you have Talk To Me. An excellent Australian horror that I caught on Netflix.Direction, lighting and editing are all good. The plot and storyline is excellent. The characters are largely unlikeable due to their stupidity but then we wouldn't have a storylines if stupid people didn't do stupid things to get movies started.The acting is largely good enough with Sophie Wilde being the best of the bunch.A sequel has already been commissioned and I will be ready and waiting.",
    "69": "Greeting from the other side. This has been done before, and done better, such as Ouija. Not that Ouija was a great film, but it was done better than this mess.The ceramic, cursed hand puts a unique spin on this type of horror movie, but they don't do much with it. It's like they had the hand idea, but didn't know what to do beyond that. There was WAY too much filler in this movie. The movie is 1 hour and 35 minutes long, and they could have cut an hour from it.Another big problem with this movie is the annoying teenage cast. They aren't likeable, in fact, I hated all of them. I just didn't believe that they would sit around partying, laughing, and filming their friends as they play with a cursed hand. I don't care how many times or how many people played with that thing and survived, this item would NEVER become a joke like they were treating it. Yeah, it's totally funny when your friend becomes possessed by Lord knows what, and it causes them to choke or do nasty things against their will. They film it and laugh as their friend flirts with death. Not likely.They wasted an interesting idea. They should have kept showing the various ghosts, demons, or whatever was summoned. They were creepy, and it would have helped the movie.They also should have used adults instead of bratty, annoying teens. This would have given the film a more serious vibe, and thus creepier.There was WAY to much filler in this movie. More time with the script was needed. It was never really explained what these creatures were, or how they were tied to the ceramic hand. Also, the hand itself wasn't explained either. The writers could have explored these things to lengthen the film, rather than the useless filler scenes used.Anyway, this movie is worth watching once, but have your finger on the \"skip ahead 1 minute\" button, or whatever you have on your remote. You will be using it quite often because of the filler scenes I mentioned earlier.",
    "70": "Very cool premise. Original. That's rare. I appreciate that. But the movie itself was painful to get through. Hated every single character. Not one of them was reasonable for one second. Not one of them was anything but cruel to anyone else, eliminating any possible reason to care about what happened to any of them. After barely making it far enough to get to the point where things pick up, it was unfortunately very easy to tell how literally every scene would play out from then on. Just pulling teeth and waiting for the foregone conclusion. The personal loss being the motivation for doing all that bad stuff was tired and expected. I was skipping ten seconds ahead at a time towards the end because I needed it to be over. Nice premise obliterated by below average writing, bargain bin characterization, and zero reason to get invested in anyone's fate. Stick to directing, boys. Leave the writing to the writers.",
    "71": "A group of teens get too involved with the boogeyman again. Good photography and some telegraphed scenes of self mutilation get this to stand out a little more then a movie made on a beer budget about a group of teens being chased by a demon through the woods. There is the premise: By clutching the plastered hand of some long dead spiritualist, you will be greeted to some of those special visions usually only privy to back-ward habitués. It's fun and games for the teens, in much the same way that the marketing of Salvia Divinorum, before its demonization into illegality, became a YouTube fad: make your unsuspecting friend insanely crazy for a few minutes. Now, that drug really was some nasty evil stuff, a lot nastier then this flick. And of course this severed hand thing (Monkey's paw, Angel Heart, The Hand, The Adam's family) party amusement gets out of hand when the summoned spirits reveal their agenda. Does this sound a little familiar? Have we seen this countless times? Still, who even looks for originality anymore? Like gasoline or dope or whatever, if it does the job that's good enough I guess. This one doesn't do the job. A few jump scares, a few heavily milked body-horror, self mutilation shots, and a clump of thrill seeking kiddies getting their comeuppance, a sort or right of passage into adulthood, the awful place where you realize irresponsible stunts can have ugly consequences. And yes there is an angry mother trying to keep a lid on her wayward daughter's enthusiasms. We are supposed to root for the children though, which means that's the target audience. This is rated Sigh, Oh Well.........",
    "72": "Intelligent horror. For once there's a horror movie with character development and a scenario they're out in that gets the audience invested in. Not since the first Elm Street movie was there ever an intelligent story about fear and loss. The movie examines the curiosity of what's on the other side of this life. Yes, it's also creepy, haunting, and with enough jump scares for the feeble folks.The movie opens dark and ends in a way that may stay with you for a while. I found it to be an intelligent movie that examines life and death. The monster is the fear itself of what lies in the other side. While it's difficult to delve into details and no spoilers here, let's just say horror movie fans will get their fill. It's scary but also a story about loss.",
    "73": "Finally, an excellent and fresh horror flick. And it comes from Australia, like one of the best shows ever: Mr Inbetween. It looks like that Australian people know how to scare people creating a simple story, but original, full of real horror, and a great conclusion.First, acting here is great. I didn't know anything about any of the cast but they do a great job. Not the usual for horror.Second, I love the original idea and the execution. Not the usual and not necessary abuse of CGI. The whole think is great, including a surprising ending.Last, I really enjoyed the whole experience. I am a big horror fan, and finally I can recommend this movie to everyone who loves real horror. Enjoy.",
    "74": "This Australian horror offering centers on Mia (Sophie Wilde), a grieving teen hungry for connection in the wake of her mother's death. A wall of silence has grown between her and her father. Her best friend, Jade (Alexandra Jensen), while loyal, has been distracted by a new boyfriend (Otis Dhanji). So, when possession parties pop up promising the thrall of escape, Mia's perhaps overeager to bound into the unknown. At first, it's all fun and twisted games. But when the game goes on too long, Jade's sweet little brother Riley (Joe Bird) pays a gruesome price. While his fearsome mother (Miranda Otto) searches for easy answers, Mia and her friend must look into the abyss of limbo to pull Riley back from it.",
    "75": "Psychological horror is one of the toughest to pull off, you can easily be doing stupidity in the name of attemting this genre. But the writing and screenplay of this film never lets it backfire. The plot is interesting, the occassional disturbing scenes work towards establishing the horror. Its not a jumpscare film, mind you, its a lot mature than that. The performances by the cast, especially by sophie wilde is one of the strongest points of this film. The screenplay is able to cinfuse us thriugh the intercut of reality and illusion and hallucinatuons. The use of dream imagery is wonderful in this film. The cinematography, specially the two long shot scenes at the terminal ends is too good a piece. My only gripe being the lack of emotional connect to and for the characters.",
    "76": "The director insults the intelligence of the viewer. We know that this movie is scary, but the element of imagination is very basic. It seemed that more noise was used to make it look scary than scary elements. You notice that the actors forget their mistakes in a very childish way and repeat them again. The script was very lame. Throughout the movie, you are looking for something special to surprise you, but it doesn't happen, and you are faced with repetitive and very weak scenes. The movie was not only not entertaining but also very boring and basic. I was not expecting a very special movie, but this movie was very boring.",
    "77": "I went to see this film with great anticipation, and I'm glad I stayed until the end because I believe the horror genre, which often produces mediocre examples, needs more films like this one. It truly satisfied me.First of all, the Philippou brothers did an incredibly good job in their first feature-length film. There were a few scene transitions that left my girlfriend and me in awe, and there were moments when we couldn't help but exclaim, 'Wow, that scene was amazing.' Two of those standout scenes were the one showing Riley being possessed by spirits and the one where Mia first goes mad in the room. These scenes are worth watching multiple times. Sophie Wilde delivers a commendable performance that completely immersed me in the film.The film's biggest strength, in my opinion, was how it concluded. They managed to avoid unnecessary details at the end and delivered the best possible ending. This made me extremely happy. The characters' behaviors were also proportionate to their ages, which surprised and pleased me. I shouldn't forget to mention that the scene transitions were well-executed.A couple of things I didn't like include the character Sue, who is portrayed as a conscious mother but leaves her child alone in the hospital. That was the most significant disconnect for me, and I wish it had been more convincing. Another thing that seemed a bit forced to me was when Riley made direct contact with Mia, and she immediately became possessed by Mia's mother's spirit. However, I got used to it as the story progressed.Overall, the use of time, the cinematography, and the performances (including the directors) were all quite good. It's quite an achievement that they were able to make this film on a modest budget of only 4.5 million when even mediocre films often have budgets exceeding 80, 90, or 100 million. This film is modestly the best horror work of the year so far.",
    "78": "I expected an engaging story, a movie with a congruent plot and at least a thriller looking at such high ratings but I was met with a horror trailer, you tube short storyesque thingie with an incoherent plot, random horror scenes, good camera work but confused attempt at film making. Its alright to watch this at home I guess but spending money on it and actually watching it in a theatre is not the best idea. This lacks a story. I mean there is something akin to a story here but it goes nowhere. It starts with wasting 15 minutes in the beginning where you expect to be introduced to the characters but instead of that there's random snippets of interaction from people's lives and ends the same way. I would say skip it.",
    "79": "Australian horror \"Talk to me\" could have been the same old thing with possession and spooky ghosts only the main characters can see. But its proper gruesome enough to keep old school fans happy, and manages to feel modern without being cringey and avoiding lame jump scares.There's a spooky hand doing the rounds at teenage parties. One that people hold to see ghosts before allowing the spooks to briefly possess them. Off course this is all going to go wrong. But it can be a brutal shocker so you'll not be disappointed in the direction it does go. Much like the latest \"evil dead\" its truly horrific, but also has the occasional awkward laugh. But this one also knows not to stick around for too long. As there's only so much horror the audience can take.",
    "80": "Talk to Me is a stone cold classic of the horror genre. It feels fresh, thrilling, absorbing, and has a brilliant concept at its core.The story follows a group of friends who play around with the occult, contacting the spirit world through a mysterious ceramic hand. As you might expect, things go off the rails quickly and insidious activity ensues.The way the story is set up is superb, giving a fresh spin on a somewhat tired horror trope and bringing it into the 21st century with style.It contains a strong collection of characters with great performances behind them all and solid writing that doesn't feel cliche or tired.Stylistically I think the film is superb, with the direction on point. There are some neat creative flourishes and a brilliant use of sound, both of which really contribute to the overall atmosphere, which is one of constant suspense and unease.I don't think the film is particularly scary, relying more on body horror and disturbing imagery, but it is very unnerving and tense nonetheless.The only reason I'm not scoring this higher is that I think some of the concepts could have been taken a little further, and some of the horror dialled up a notch, but these are minor criticisms really.Talk to Me is one of the most refreshing and engaging horror films I've seen in a while, and will be sure to be a treat for any horror fans out there.",
    "81": "A group of youngsters discover that by taking part in a small ritual involving an embalmed, ceramic hand, that they're able to contact spirits from the other side.One of the better horror films I've seen for some time, when I compare to the other horrors I've seen in 2023, this rates as the best so far.Talk to me has a degree of originality, it's loaded with jump scares, and has some genuinely memorable moments. The writing was rather good, everything pieced together nicely, including that pretty shocking opening sequence.Quite graphic at times, it wasn't afraid to show a bit of gore, eyeball, that's all I'm saying, I had to look away. I loved that deliciously dark closing scene, it was such a strong, cohesive end to the film, it really worked.There were a couple of clichés, and there were a couple of moments where you're left scratching your head, puzzling whether people would actually do the things that happened here, but those are minor faults, the only major gripe I had, was the rebirth of The Crazy Frog music (I thought our ears had been spared that years ago.)They trailered Cobweb and Nun 2, will either of them surpass this one? Will have to wait and see.A big thumbs up.8/10.",
    "82": "Danny and Michael Philippou have truly made something special here and hope it gets the attention it deserves. Known by their YouTube channel \"RackaRacka\" They were able to pull off a great low budget horror film on the budget of $4.5 million Australian dollars that feels at least 20 million.The cinematography and direction were all incredible with some expertly crafted scenes and a very dark and foreboding story that does have some originality to it despite being another supernatural, hell-demon, \"other side\" story. The scenes with the hand were legitimately scary and tense with a very unpredictable nature to it, the rest of the story was surprisingly unpredictable and unconventional, that also captures the modern Australian generation very well.The acting in this movie was off the charts and really delivered every emotion these characters were feeling at any given time and their reaction to exactly what was happening, internally and externally. The movie does depict Australian Gen Zérs pretty well, me being one of them. They did use it to their advantage in this movie, with RackaRacka being Gen Z as well, they were able to nail their modern Australian characters to perfection.The movie really did have an impactful effect on me, with me starting to feel a little ill by the end of the movie and me processing what all had just happened that I won't spoil in this review. Overall, the tone didn't just feel like shallow horror, but a legitimate one that actually has a foothold in Australian society that did feel somewhat believable in certain areas. The tension was soaring and ever present, the music was great too, there weren't many jump scares in this but the scary scenes themselves were clever and hard hitting.The movie didn't just fly by either, it did feel like it did run a bit longer than just 90 minutes and I did appreciate how it held my attention the way it did. I did feel genuine dread from it, that I haven't felt from a horror movie like this in a VERY long time. If not ever. The only problem I had with it is that I wished the story was a bit more revelatory and not so secretive in a lot of areas.Go see it if you're a fan of Horror and Modern Australian Cinema. I hope this brings nothing but success for The Philippou Brothers and the film has already gotten recognition by several popular horror directors including Jordan Peele.",
    "83": "I watched Talk to Me early as part of Regal's Mystery Movie Monday. It's a movie I'd already planned on seeing, so I was happy with the choice while also having no idea what to expect. I came out of the movie very mixed.There are lots of positives, the biggest being some truly awesome horror moments. My jaw dropped multiple times at some of these brutal moments. And with an R-rating, it didn't have to hold back. I wish more movies had the courage to do this instead of opting for a milder PG-13 movie, pandering to the casuals and teens.The movie is mostly well-made. I love how loud the sound effects are. Sophie Wilde gives a great performance and Joe Bird has some amazing moments. It also uses the horror premise in a few unique ways, making it more like a game or a drug.Unfortunately not everything works. It doesn't seem like it knows where to go and doesn't come together all that well. A few of the scares involve grossing out the audience. I don't find gross to be scary. It's just nasty.But the worst thing, for me at least, is I was not nearly as engaged as I should have been during the climax. I wasn't on the edge of my seat. I was sort of just... there.I heard someone call this the Smile of 2023, a surprise horror flick that comes out of nowhere and blows everyone away. I don't think it comes close to Smile, my favorite movie of last year.I can see some people loving this, but I can't personally recommend it.(1 viewing, Mystery Movie Monday 7/10/2023)",
    "84": "The premise was what initially drew me to this film, although it's not that different from similar movies in the genre. Replacing the Ouija board with a ceramic hand was a creative and unique touch that the horror genre needs more of, and for that alone this movie deserves some recognition. Creativity and ingenuity are the two elements that the horror genre is sorely lacking, and it's great to see how the new generation is utilizing premises that have been done countless times before and giving them an unexpected spin. That being said, that's about the only thing about this movie that is worth praising.If you've ever seen a movie about demonic possession, spirit conjuring, or communicating with the dead via an Ouija board, you've already seen this film. Aside from the method being used, this has been done plenty of times before, and at times I found myself wondering if the people who made this have ever seen a movie in the genre before, because almost every idea was ripped form some other movie. There were so many ways you could have made this movie truly ingenious, but they kept it safe and did the basic \"let's gather a bunch of teens together to communicate with the dead\" that has already been done TO DEATH so many times. I wish they would have pushed the envelope, going for stuff that was more shocking instead of treading familiar ground. It's what made me ultimately not care much about what transpired in the film.The nail on the coffin was the cast, though. Filling a movie with insufferable and unlikable teenagers and young adults completely removed me from the experience. Similar to \"Bodies Bodies Bodies', the cast was a bunch of try-hard teenagers with nasty attitudes, poor behavior and partaking in degenerate behavior that always sits very poorly with me. I'm so glad I neither had friends like any of these people, and that I never had the misfortune of interacting with anyone who behaved this badly in my youth. I believe the movie would have been more effective with an adult cast, but that's just my personal taste.Overall, a novel concept with mediocre execution makes for a somewhat entertaining film that I didn't regret watching but that I really can't be bothered to recommend. Aside from one scene that was really effective in instilling fear and dread, the rest of the movie is a retread of every Ouija board film you've ever seen. Where a movie like SMILE brings something new and original to the genre, Talk To Me just brings the same old concepts in the palm of a new hand.",
    "85": "Quite literally - and no pun intended of course. Also you have to suspend your disbelief ... like really really suspend it. If you'd ask any of the characters how ... well not intelligent they are, they would answer ... yes. Now if that sounds like it doesn't make sense ... it is because it doesn't make sense ... which I hope makes sense to say/write. It does to me of course.If you are able to handle those things that I would call flaws and not be annoyed by them ... well the movie is every bit as good as you may have heard it is. The horror is quite frightening - the story is tight and the ending ... well that has quite the impact to it. And even if you may see it coming ... it is so well shot and done, it won't matter.A24 knows their stuff and their movies are being hailed for the right reasons most of the time. They are also not easy movies to watch. Violence (peak) and horror of every kind ... you've been warned. Be different than the characters here and heed those warnings ... and act accordingly.",
    "86": "I've spoken in the past about being a big fan of Australian horror movies. Some of my all time favourites have come from this country. So it's a little disappointing that the last two Australian horror movies I've watched ('Run Rabbit Run' and 'Talk to Me') have been a bit of a let down. The latter was nowhere near as big of a let down as the former to be fair. There were parts of this film I liked, but overall it didn't quite hit the right spots.I'm finding possession films less and less scary with every year that goes by. I find that as soon as you see the ghosts/demons it's just too hard to believe (even though the make-up work in 'Talk to Me' was very well done). The only time it really works for me any more is in films like 'Paranormal Activity' where you rarely actually see anything. Seeing less will always be more in this circumstance.So I didn't find the film overly scary, and then all I really have to fall back on is the characters. Sadly we've reached a point where the only way to write realistic teenage characters any more is to make them extremely unpleasant. If they were all overly nice it wouldn't feel like they were properly written, yet if they are particularly unpleasant then it isn't much fun to watch them. It's a real predicament that the horror genre has and I don't know the way around it.I will say that the ghosts/demons were done in such a way that if that is the kind of thing that scares you I could see this movie being very effective and creepy. Otherwise though, you might be fresh out of luck with this one. 6/10.",
    "87": "Another week, another jumpscare demon summoning movie. This time from Australia, but aside from the accents it looks and feels entirely American. The usual ingredients are all there. A cast of annoying, loudmoth, diverse, phone addicted teenagers come across cursed artifact that allows them to contact the spirit realm and become briefly possessed. In this film it's an embalmed hand.Naturally the main characters have a traumatic backstory, with their mother having passed in an untimely manner. They end up talking to her, but stay connected to the other side for too long. Bad things happen.If you've suffered through bad music, bad acting and bad party scenes until that point in the film, you can be relieved. Things do get better, which is a rarity for the horror genre. Usually they start strong and run out of steam. This one is the opposite. It significantly improves as it goes along.There are some good ideas here, but sadly they're never fully developed or fully explained. The ending is by far the strongest part of the film, but the buildup to it remains virtually unexplained. It's a pity, because there would have been room for a good moral dilemma. Still, the last scene is great and redeems the second half of the film.On a technical level, the film is competently made. The color grading looks really nice, which is almost a rarity in films these days. The scary scenes are very well filmed and the audio editing is top notch. Audio is the most important aspect of a horror film, and they nail it here. The rotating camera gimmick is fun, but gets overused.If you can get through the horrible first half, you might get some enjoyment out of this. Overall, I couldn't enjoy it. The teens were just too annoying, and the conflict and plot too trite.",
    "88": "What drew my interest in this film was the high IMDb reviews, especially for the horror genre which is the most scrutinized. The plot is pretty basic.... evil and supernatural forces begin to manifest by touching an embalmed hand. I love horror films but I've always treated them like an amusement park ride. They don't need a sophisticated plot but certainly a good screenplay, creepy atmosphere, pacing, uncomfortable tension, and just plain scary. I'll get straight to the pros and cons:Pros:1. Good cinematography and quality of acting.2. Because of the lower budget, the film wasn't flooded with CGI. Some of the scenes were pretty creepy. One scene had a dark atmosphere about it that reminded me of a scene from Hereditary.Cons:1. Way too much filler. I understand and appreciate setting things up for character attachment/development but the first 25-30 min was a snooze fest.2. Screenplay was too disjointed and had a pacing problem. The scenes involving the hand were good but all the in-between segments with the characters were uninteresting for the most part. At times I was wondering with a particular character if this was horror or a drama.3. Weak final act. When it's all said and done this movie is about a few entertaining and even scary scenes and a lot of messy writing all over the place. Are they trying too hard? Should they have focused on a different angle if the goal was to make this story deeper? You be the judge. Honestly I think this would have made a really good 12-13 minute short film.Is this movie on the level of 2018's Hereditary? Heck no. Is it worth watching? Honesty yes. With great horror movies few and far between, you can get a few thrills out of it and appreciate the potential that could have been. Decent but could have been so much more...",
    "89": "A24 has a way of putting out these supposedly great arthouse horror films, but they almost all feel like the story is an afterthought once the filmmakers have come up with their premise. This film is a perfect example of that.Midway through the film, the characters actions and their motivations seem more and more unbelievable until the end when you can't help but think that the main character is either the most naive individual to walk the planet or just willfully ignorant to what is happening to her. The story gets pretty convoluted and the rules of how the hand is supposed to work is never clearly outlined, nor do we find out anything about the hand or it's origin or how these random kids in Australia have it or how the kids all way across the world at the end have it. One of the rare films where I would've like some elaboration on what was going on.Also, this film forgets the most important part of being a horror film. It's just not scary. Jumpscares only take you so far. Everybody talking about this film being brutal and shocking must be lying as well. If seeing someone hit their head on a table or a wall is gruesome to you just because blood is present, I'd have to say you're very weak stomached.Overall, a disappointing film. It is well made and the premise is a solid one. It's just a shame the filmmakers didn't do more with it.2.5 psychic hands out of 5.",
    "90": "A really enjoyable horror movie.It is well paced and atmospheric.The whole cast are impressive.Effects are good, especially considering the budget.Genuinely creepy and jump scares abound.Reminds me of how good horror films used to be whilst remaining modern and relevant.It's an interesting premise, not seen anything quite like it before.Got a few twists. Keeps you on the edge of your seat.I will eagerly await what the directors do next, and will watch out for the cast in other things.If you like it creepy give it a go. There have been some very average horrors out in the last 12 months, this one is a cut above.",
    "91": "Many American movies have tried very hard to show teens and children are being dumb, mean and dangerous, but none hold a candle to this Aussie flick.The main character is the most disgusting creature I've seen in a while: one of those people who consider themselves good and even righteous, cool and positive, while destroying everything around them. People like these are one of the most terrifying things in the world and that is why Talk to Me was extremely disturbing. And it's not just Mia. Almost all of the teen characters in the film show a level of selfishness and lack of awareness that is more scary than any ghost.Speaking of the ghosts... it's not very clear what they wanted. You get the standard dead corpse evil demon possession, but like so many other movies, they don't explain why they would be like that or what drives them. As mere McGuffins, therefore, they are uninteresting.Bottom line: after watching this film, talking to dead people was the thing least on my mind. Instead I was quickly cataloguing everybody I know, including myself, for signs of Mia-ness. This film was scary for all the wrong reasons.",
    "92": "When we think of Australia, we think of kangaroos, koalas, the Outback, the Sydney Opera House, and English rednecks (as Robin Williams defined the Aussies). But most people probably don't know that there's an entire genre of Australian cinema depicting disturbing things. About ten or so years ago I saw an Aussie neo-noir thriller called \"The Square\", about a tryst that spins out of control. More recently, the land down under gave us \"The Babadook\", about a horrific being that escapes from a child's book.Well, now we have an Aussie movie about demonic possession. This one features some teens who discover that an embalmed hand can enable them to communicate with spirits. Sure enough, the game goes too far, and the terror isn't going away for one girl. \"Talk to Me\" isn't simply a slasher movie; there are graphic scenes of self-harm. Quite the opposite of the pristine image that we have of Australia.This is the sort of movie that the fainthearted should avoid at all costs. But if you're into movies that go all out on the grotesque stuff, then this is the movie for you. I'll be eager to see the next movie from Danny and Michael Philippou.",
    "93": "A friend and I went to watch this with great anticipation after watching several stellar reviews on YouTube from folks I typically share movie taste with. We left feeling pretty letdown and confused, I must say.Thing is: this movie had lots going for it-a great concept, plenty of opportunity for character-building, brilliant performances, and it looked great. Was it \"the scariest movie in the last year or so\"? Hardly. But whatever-horror fans are easily desensitized to thrills and chills.What this movie lacked was intelligent, fleshed out and compelling storytelling and characterization (a depressing trend in today's cinema). Frustratingly, the subplots and characters were all there to exploit but wound up going nowhere-totally underdeveloped. There were also lots of interesting details dropped in the first act or so of the film that were never followed up on, to the point that you left, wondering why these things were even introduced in the first place because they served no real story purpose.I can't emphasize enough the acting talent of the leads because it would have taken very little to create fully developed character arcs here and a narrative that your audience is really invested in.There's no amount of technical skill that can make up for sloppy or rushed writing. If these newcomers spent more time analyzing what makes a good story and the craft of characterization, and slightly less time on the technical aspects of filmmaking, they ultimately wind up with better films. I hope they develop their craft further and take such feedback to heart because writing as an art form is being sorely underemphasized in filmmaking, to its great detriment.",
    "94": "I have 3 very big problems with this movie.First of all this is a well tried trope and very common story. We have seen this in movies before, seen it in TV shows, and read it in books. This is immensely cliche. And as such you need to do something special with it, and you need to find some angle or extra to make it stand out, but no. This is just a cliche as you might think. No thought process whatsoever.Secondly this is amateurish. Everything is. This looks like, feels like and is acted like a middle-school project made by failing drama students. I could get behind some of that, horror does not need to have a huge cgi budget, but it cannot be amateurish on all levels, on all things.Thirdly, is this actually a horror movie? The premiss is boring and cliche, and there is nothing really scary or weird or thought-provoking about this. And the ending? Omg... so predictable that if you did not see that coming, I am sorry, but if so you need a doctor.I cannot find any redeeming traits or positives about this. I will still give it a 2/10 because however strange it may sound this is not the worst movie of the year. I do not think this movie will even make it into top 10 worse of the year... isn't that sad?",
    "95": "Talk To Me, the debut movie from Aussie directors Danny and Michael Philippou (the men behind popular YouTube channel RackaRacka), feels more Blumhouse than it does A24, and as far as I am concerned that's a good thing. It's far less pretentious and arthouse than I had expected, and a lot less boring.Sophie Wilde plays Mia, who attends a party where her friends dabble with the occult, using a porcelain hand that has the power to connect the living with the dead: all a person has to do is hold the hand and say 'Talk to me'. The important thing to remember is not to hold on for longer than 90 seconds. Of course, Mia does just that, leaving the door wide open for unwelcome spirits to come a-visiting.A likeable cast, plenty of creepiness, a smidge of uncomfortable brutality (the standout scenes involving some nasty self harm), and a neat ending ensure that Talk To Me is a thoroughly entertaining ride from start to finish. Sure, some characters make questionable choices in the film, but that is par for the course for a teen horror, and it doesn't detract too much from the fun. Was I scared? Not really, but then it takes a lot to scare me these days. Was I entertained? You betcha!",
    "96": "Just returned from the cinema, what a waste of time.This movie was very much under my expectations.Poor acting, boring plot, or perhaps was not even a plot...I really had expectations from this movie but was a boring, short story with just two creepy scenes.Not worth the time...It looks like this was a movie made by some amateurs from Australia.I am a real fan of horror movies of any kind, but this was \"dust in your eyes\", a movie made in a hurry just to be there and to take the money of fools...\nSomehow the high rating from imdb for this movie is misleading.In conclusion one of the most boring \"horror\"movie that I saw in 2023.",
    "97": "The opening scene was the strongest part of the movie, it is shocking and instantly grabs your attention. However, that energy doesn't carry over to the rest of the film.This is an example of an idea outweighing its execution. The concept of the embalmed hand used to conjure spirits was unique but aside from that this film doesn't do anything special. The main character grieves the loss of her mother and wishes to connect with her so she uses the hand to do so. This film reminded me a bit of \"Insidious Chapter 3\" but it wasn't as good. There is only one other scene besides the opening scene that has any kind of tension or suspense. This film lacked atmospheric horror as well as jump scares. There wasn't even anything creepy about the spirits that were conjured.The origin of the embalmed hand wasn't concrete as some characters had different stories as to where the hand came from. It would have been nice if they just picked an idea and stuck with it.The development of every single character in this movie was bare bones. The main character was grieving her mother and didn't have a good relationship with her father. Her father was made to seem like he had an important role in the film but he didn't. She had a best friend who had a little brother and a boyfriend. The dynamics between all of those characters are very cliché and corny.This film was a waste of time and a complete let down. The only good thing about it was that it was over rather quickly.",
    "98": "TALK TO ME (2023) *** Sophie Wilde, Alexandra Jensen, Joe Bird, Otis Dhanji, Miranda Otto, Marcus Johnson, Zoe Terakes, Chris Alosio, Alexandria Steffensen, Ari McCarthy. \"Don't hassle the dead boy; they have eerie powers...\" - Homer Simpson to Bart. Compelling and well-acted supernatural chiller about a grieving teen (an excellent Wilde) who finds herself drawn into a parlor game with her friends involving a ceramic (and cursed) hand which draws its participant into an unearthly bond with its other-worldly hosts which lead to deadly repercussions. Written and directed by Australian sibling team Danny and Michael Philippou mixes pure dread with teen angst in a cocktail blend of THE SIXTH SENSE by way of STIR OF ECHOES with a dash of \"The Twilight Zone\"'s Be Careful-What-You-Wish-For ethos masked in the trappings of 'The Monkey's Paw', yet highly original and occasionally hits the right marks of shock and awe. Wilde, who suggest the love-child of Susan Sarandon and Taraji P. Henson, with her saucer-eyes, cowed disposition, and the weight-of-the-world on her shoulders body English is a revelation conveying true poignancy and utter despair in her sudden thrust into an occult-tinged nightmare and familial closure with her departed mother. Crafty practical effects and fantastic make-up designs thanks to Josh Head and Rebecca Buratto (and her team of artists) and Aaron McLisky's spooky cinematography raise the level of expectations tenfold.",
    "99": "\"Talk to Me\" is a debut from the Phillipou brothers under A24 that takes the oft-visited possession horror subgenre into some new territory whilst setting and consistently maintaining an eerie and disturbing tone. The depiction of modern Australian teenage culture felt a bit too \"down with the kids\" and drawn out at times, but generally came across well with its application of slang and contemporary cultural references that very much brought the setting into the present day. There is a blend of psychological horror, jump scares, shock horror, and gore. Meaning most dimensions of human fear are attended to, creating a robust horror ensemble. The only problem is it doesn't entirely sustain these strengths into its second half. You could say it had me in the first half.Subtle use of sound and camera work felt very much borrowed from the same vein as \"Hereditary\" which is never a bad thing. Downright bizarre and inconceivable scenes regularly caught the audience off-guard and an unforgiving atmosphere of the unexpected and uneasy meant nothing felt \"off the table\". Characters setting a sense of control and predictability were soon overturned in horrifying fashion.As said before, about halfway through the film the novelty of the \"hand\" concept wore thin, and the film ran out of momentum. This was later redeemed with a great, thought-provoking ending that leads the viewer's imagination beyond the film. You could call this, in some sense, the \"Inception\" of horror films; once you watch it you'll understand why it could be described as such.7.5/10.",
    "100": "Trust me. I've watched more than four decades of diverse horror films. The genre is nothing new to me. This is a supernatural horror film about an embalmed hand that is further preserved by encasing it in a ceramic material.Rumor has it that the hand belonged to a psychic and if you held on to the hand and uttered some key words it would make contact with you while you drifted into a trance. While in the trance like state, you would lose total control of your body.This then is the horror element of the film. You try watching films like The Legend Of Hell House(1973), The Changeling(1980), Fear No Evil(1981), Poltergeist(1982) and you see how mediocre this genre has turned over the years...Absolutely the worst casting I have ever seen. The film seems to me catered for a select audience and will not appeal to veteran horror buffs who grew up watching 70's, 80's and 90's horror classics.Nothing to recommend here and also don't expect a gritty climax to a movie made on a shoe-string budget I hear.",
    "101": "PlotWhen a group of friends discover how to conjure spirits using an embalmed hand, they become hooked on the new thrill, until one of them goes too far and unleashes terrifying supernatural forces.CastI was only familiar with Miranda Otto but to their credit everyone involved was great especially Zoe Terakes.VerdictI criticize Hollywood a lot about the quality of their horror films, apparently it's not just them as this is a Australia/UK collaboration.You see when the movie started I thought it was stylish, I thought it was well acted and when the premise presented itself I thought it was actually really quite interesting but feared it would become non-sensical foolishness like most modern horror. I was right.It all looks shiny, it feels well made but as with most modern supernatural horrors these days it's like a writer came up with a solid concept but that's it, the rest was just made up as they went along, the rules change, it goes on random tangents, and it's just messy.I wanted to like Talk to Me, but by half way through I'd predicted the whole thing correctly and it had revealed itself to be something comparable with your Conjuring, Insidious and all the other uninspired mega budget snoozefests.RantsThe sad thing about this is a recurring theme I've been seeing with horror lately. Namely something becomes \"Trendy\" with kids, they record themselves doing it despite the ridiculous dangers and do it for the purpose of \"Likes\", \"Subscriptions\" and whatever passes for fame these days since the bar has never been lower. It's sad, it's pathetic, what's wrong with you?BreakdownLooks the part\nGreat concept\nGreat concept doesn't deliver\nFalls into the same slump as most modern horror.",
    "102": "When we think of Australia, we think of kangaroos, koalas, the Outback, the Sydney Opera House, and English rednecks (as Robin Williams defined the Aussies). But most people probably don't know that there's an entire genre of Australian cinema depicting disturbing things. About ten or so years ago I saw an Aussie neo-noir thriller called \"The Square\", about a tryst that spins out of control. More recently, the land down under gave us \"The Babadook\", about a horrific being that escapes from a child's book.Well, now we have an Aussie movie about demonic possession. This one features some teens who discover that an embalmed hand can enable them to communicate with spirits. Sure enough, the game goes too far, and the terror isn't going away for one girl. \"Talk to Me\" isn't simply a slasher movie; there are graphic scenes of self-harm. Quite the opposite of the pristine image that we have of Australia.This is the sort of movie that the fainthearted should avoid at all costs. But if you're into movies that go all out on the grotesque stuff, then this is the movie for you. I'll be eager to see the next movie from Danny and Michael Philippou.",
    "103": "A friend and I went to watch this with great anticipation after watching several stellar reviews on YouTube from folks I typically share movie taste with. We left feeling pretty letdown and confused, I must say.Thing is: this movie had lots going for it-a great concept, plenty of opportunity for character-building, brilliant performances, and it looked great. Was it \"the scariest movie in the last year or so\"? Hardly. But whatever-horror fans are easily desensitized to thrills and chills.What this movie lacked was intelligent, fleshed out and compelling storytelling and characterization (a depressing trend in today's cinema). Frustratingly, the subplots and characters were all there to exploit but wound up going nowhere-totally underdeveloped. There were also lots of interesting details dropped in the first act or so of the film that were never followed up on, to the point that you left, wondering why these things were even introduced in the first place because they served no real story purpose.I can't emphasize enough the acting talent of the leads because it would have taken very little to create fully developed character arcs here and a narrative that your audience is really invested in.There's no amount of technical skill that can make up for sloppy or rushed writing. If these newcomers spent more time analyzing what makes a good story and the craft of characterization, and slightly less time on the technical aspects of filmmaking, they ultimately wind up with better films. I hope they develop their craft further and take such feedback to heart because writing as an art form is being sorely underemphasized in filmmaking, to its great detriment.",
    "104": "I have 3 very big problems with this movie.First of all this is a well tried trope and very common story. We have seen this in movies before, seen it in TV shows, and read it in books. This is immensely cliche. And as such you need to do something special with it, and you need to find some angle or extra to make it stand out, but no. This is just a cliche as you might think. No thought process whatsoever.Secondly this is amateurish. Everything is. This looks like, feels like and is acted like a middle-school project made by failing drama students. I could get behind some of that, horror does not need to have a huge cgi budget, but it cannot be amateurish on all levels, on all things.Thirdly, is this actually a horror movie? The premiss is boring and cliche, and there is nothing really scary or weird or thought-provoking about this. And the ending? Omg... so predictable that if you did not see that coming, I am sorry, but if so you need a doctor.I cannot find any redeeming traits or positives about this. I will still give it a 2/10 because however strange it may sound this is not the worst movie of the year. I do not think this movie will even make it into top 10 worse of the year... isn't that sad?",
    "105": "Talk To Me, the debut movie from Aussie directors Danny and Michael Philippou (the men behind popular YouTube channel RackaRacka), feels more Blumhouse than it does A24, and as far as I am concerned that's a good thing. It's far less pretentious and arthouse than I had expected, and a lot less boring.Sophie Wilde plays Mia, who attends a party where her friends dabble with the occult, using a porcelain hand that has the power to connect the living with the dead: all a person has to do is hold the hand and say 'Talk to me'. The important thing to remember is not to hold on for longer than 90 seconds. Of course, Mia does just that, leaving the door wide open for unwelcome spirits to come a-visiting.A likeable cast, plenty of creepiness, a smidge of uncomfortable brutality (the standout scenes involving some nasty self harm), and a neat ending ensure that Talk To Me is a thoroughly entertaining ride from start to finish. Sure, some characters make questionable choices in the film, but that is par for the course for a teen horror, and it doesn't detract too much from the fun. Was I scared? Not really, but then it takes a lot to scare me these days. Was I entertained? You betcha!",
    "106": "Just returned from the cinema, what a waste of time.This movie was very much under my expectations.Poor acting, boring plot, or perhaps was not even a plot...I really had expectations from this movie but was a boring, short story with just two creepy scenes.Not worth the time...It looks like this was a movie made by some amateurs from Australia.I am a real fan of horror movies of any kind, but this was \"dust in your eyes\", a movie made in a hurry just to be there and to take the money of fools...\nSomehow the high rating from imdb for this movie is misleading.In conclusion one of the most boring \"horror\"movie that I saw in 2023.",
    "107": "The opening scene was the strongest part of the movie, it is shocking and instantly grabs your attention. However, that energy doesn't carry over to the rest of the film.This is an example of an idea outweighing its execution. The concept of the embalmed hand used to conjure spirits was unique but aside from that this film doesn't do anything special. The main character grieves the loss of her mother and wishes to connect with her so she uses the hand to do so. This film reminded me a bit of \"Insidious Chapter 3\" but it wasn't as good. There is only one other scene besides the opening scene that has any kind of tension or suspense. This film lacked atmospheric horror as well as jump scares. There wasn't even anything creepy about the spirits that were conjured.The origin of the embalmed hand wasn't concrete as some characters had different stories as to where the hand came from. It would have been nice if they just picked an idea and stuck with it.The development of every single character in this movie was bare bones. The main character was grieving her mother and didn't have a good relationship with her father. Her father was made to seem like he had an important role in the film but he didn't. She had a best friend who had a little brother and a boyfriend. The dynamics between all of those characters are very cliché and corny.This film was a waste of time and a complete let down. The only good thing about it was that it was over rather quickly.",
    "108": "TALK TO ME (2023) *** Sophie Wilde, Alexandra Jensen, Joe Bird, Otis Dhanji, Miranda Otto, Marcus Johnson, Zoe Terakes, Chris Alosio, Alexandria Steffensen, Ari McCarthy. \"Don't hassle the dead boy; they have eerie powers...\" - Homer Simpson to Bart. Compelling and well-acted supernatural chiller about a grieving teen (an excellent Wilde) who finds herself drawn into a parlor game with her friends involving a ceramic (and cursed) hand which draws its participant into an unearthly bond with its other-worldly hosts which lead to deadly repercussions. Written and directed by Australian sibling team Danny and Michael Philippou mixes pure dread with teen angst in a cocktail blend of THE SIXTH SENSE by way of STIR OF ECHOES with a dash of \"The Twilight Zone\"'s Be Careful-What-You-Wish-For ethos masked in the trappings of 'The Monkey's Paw', yet highly original and occasionally hits the right marks of shock and awe. Wilde, who suggest the love-child of Susan Sarandon and Taraji P. Henson, with her saucer-eyes, cowed disposition, and the weight-of-the-world on her shoulders body English is a revelation conveying true poignancy and utter despair in her sudden thrust into an occult-tinged nightmare and familial closure with her departed mother. Crafty practical effects and fantastic make-up designs thanks to Josh Head and Rebecca Buratto (and her team of artists) and Aaron McLisky's spooky cinematography raise the level of expectations tenfold.",
    "109": "\"Talk to Me\" is a debut from the Phillipou brothers under A24 that takes the oft-visited possession horror subgenre into some new territory whilst setting and consistently maintaining an eerie and disturbing tone. The depiction of modern Australian teenage culture felt a bit too \"down with the kids\" and drawn out at times, but generally came across well with its application of slang and contemporary cultural references that very much brought the setting into the present day. There is a blend of psychological horror, jump scares, shock horror, and gore. Meaning most dimensions of human fear are attended to, creating a robust horror ensemble. The only problem is it doesn't entirely sustain these strengths into its second half. You could say it had me in the first half.Subtle use of sound and camera work felt very much borrowed from the same vein as \"Hereditary\" which is never a bad thing. Downright bizarre and inconceivable scenes regularly caught the audience off-guard and an unforgiving atmosphere of the unexpected and uneasy meant nothing felt \"off the table\". Characters setting a sense of control and predictability were soon overturned in horrifying fashion.As said before, about halfway through the film the novelty of the \"hand\" concept wore thin, and the film ran out of momentum. This was later redeemed with a great, thought-provoking ending that leads the viewer's imagination beyond the film. You could call this, in some sense, the \"Inception\" of horror films; once you watch it you'll understand why it could be described as such.7.5/10.",
    "110": "Trust me. I've watched more than four decades of diverse horror films. The genre is nothing new to me. This is a supernatural horror film about an embalmed hand that is further preserved by encasing it in a ceramic material.Rumor has it that the hand belonged to a psychic and if you held on to the hand and uttered some key words it would make contact with you while you drifted into a trance. While in the trance like state, you would lose total control of your body.This then is the horror element of the film. You try watching films like The Legend Of Hell House(1973), The Changeling(1980), Fear No Evil(1981), Poltergeist(1982) and you see how mediocre this genre has turned over the years...Absolutely the worst casting I have ever seen. The film seems to me catered for a select audience and will not appeal to veteran horror buffs who grew up watching 70's, 80's and 90's horror classics.Nothing to recommend here and also don't expect a gritty climax to a movie made on a shoe-string budget I hear.",
    "111": "PlotWhen a group of friends discover how to conjure spirits using an embalmed hand, they become hooked on the new thrill, until one of them goes too far and unleashes terrifying supernatural forces.CastI was only familiar with Miranda Otto but to their credit everyone involved was great especially Zoe Terakes.VerdictI criticize Hollywood a lot about the quality of their horror films, apparently it's not just them as this is a Australia/UK collaboration.You see when the movie started I thought it was stylish, I thought it was well acted and when the premise presented itself I thought it was actually really quite interesting but feared it would become non-sensical foolishness like most modern horror. I was right.It all looks shiny, it feels well made but as with most modern supernatural horrors these days it's like a writer came up with a solid concept but that's it, the rest was just made up as they went along, the rules change, it goes on random tangents, and it's just messy.I wanted to like Talk to Me, but by half way through I'd predicted the whole thing correctly and it had revealed itself to be something comparable with your Conjuring, Insidious and all the other uninspired mega budget snoozefests.RantsThe sad thing about this is a recurring theme I've been seeing with horror lately. Namely something becomes \"Trendy\" with kids, they record themselves doing it despite the ridiculous dangers and do it for the purpose of \"Likes\", \"Subscriptions\" and whatever passes for fame these days since the bar has never been lower. It's sad, it's pathetic, what's wrong with you?BreakdownLooks the part\nGreat concept\nGreat concept doesn't deliver\nFalls into the same slump as most modern horror.",
    "112": "Still mourning the loss of her mother, Mia (Sophie Wilde) has grown emotionally distant from her father, Max (Marcus Johnson), and begun spending more time with her best friend Jade (Alexandra Jensen) and her younger brother Riley (Joe Bird). After attending a party with Jade and Daniel (Otis Dhanji), Mia's former boyfriend who's now dating Jade, the two are introduced to an embalmed hand relic by Hayley (Zoe Terakes) and Joss (Chris Alosio) that allows the holder to talk to the dead and allow them to be \"allegedly\" safely possessed by up to 90 seconds. What initially starts as a party gimmick soon turns serious when Mia thinks the hand is a bridge to her dead mother and sends her on a slow descent.Talk to Me is the feature debut of twin Aussie Youtubers Danny and Michael Philippou who came to prominence with their channel RackaRacka which is known for horror comedy videos. The film is a fully Australian production which the brothers worked on with noted producer Samnatha Jennings who previously produced the breakout and influential horror film The Babadook. The movie has become a sleeper hit earning $88 million worldwide at the time of this writing against its $4.5 million budget as well as scoring substantial acclaim. Talk to Me is a promising debut from the Philippou's and shows them to be talent to keep an eye on.While on a surface level the film would seem to be your average teen oriented horror film centered around a \"cursed object\" (Well-traveled ground seen in the likes of Polaroid, Wish Upon, and even this year's All Fun and Games) but despite sporting a familiar horror template, what it does with that template is anything but ordinary. At its core, Talk to Me is a character piece about addictive tendencies and unprocessed grief with Sophie Wilde's well-played as someone who's very much withdrawn from her family and extended social life and retreated to a state where she's in a state of limbo using her friend Jade and her family as a surrogate family while doing what she can to avoid the broken remains of her own. Despite Mia not being the most likable or sympathetic of characters, the movie doesn't ask us to like Mia and instead wants us to understand what motivates her and there is underlying humanity to her such as the \"cool older sister\" dynamic she has with Riley that shows a more tender side if not one to necessarily be approved of. I really like how the filmmakers handle the plot point of the embalmed hand because while they do establish a set of rules in how it works, they purposefully leave its origins vague which is really to its benefit as that makes its presence more unnerving. The Philippou do an interesting job of showcasing the hand's effects as we not only see them from the point of view of the user, but also from the point of view of outside observers. Despite being a horror film, there are also some points of comedy and satire that do work such as Jade's mother Sue always inquiring about whether drugs or parties are happening under her nose as well as the glib way the primarily teenaged characters are treating the notion of possession and contact with the afterlife as something to post on social media for bravado or bragging rights.I really enjoyed Talk to Me and it's one of the better cursed object horror I've seen in quite some time. The Philippou Brothers do a solid job of bringing this premise to life and Sophie Wilde is fantastic as Mia and I really look forward to seeing what the Philippous do next.",
    "113": "Ozzie horror gave us the \"Saw\" series. It's appropriate that A24 goes mining for the next Down Under scary guys.Here, it's the Phillipou Brothers.A little like \"Candyman\" this flick is about subtextual trauma. Mia (Sophie Wilde) and her successful father live alone in a house in which Mom had killed herself. This makes Mia hang with her bestie Jade (Alexandra Jensen) along with a tagalong brother Riley.These kids go over to a friends' house to mess with a severed hand which legend had it belong to a person who could speak with the dead (an origin story here would be fun). Things obviously go wrong as Mia starts to see her Mother, who is in the otherworld but yet has some malevolent tendencies towards her and her father.The story takes a melancholic turn about life after death and also touches on death in something like \"Flatliners\" The levels go to absurd when these kids continue to mess with seeing dead people so they can get social media clout.That said, a SOLID creepy flick. The resolution is how you would expect things to go. And, regardless of the violence and the swearing, it's rather odd when it still feels like a Canadian movie though it was made in Australia. Like, everything seems so...kind. Not sure how to explain that. I think the term is \"generic\" This is a better than average horror flick but still, it goes by the numbers which is fine. This is not a slasher film. It is released by A24, let that be your guide.",
    "114": "What a waste of time. I really was expecting something big from this movie, but then I remember it's an A24 production.The movie has no plot, only random events, there's no characters development, and speaking of it, the main character was so annoying.Like, where did come from the object? Why the chant is \"I let you in\"? If you wanna know, you need to talk to the director or writers, cause unfortunatelly you can't obtain these informartions from the movie.There's no use, this movie is corny, sucks for real. Thank God I didn't need to pay tô watch this terrible thing.Don't believe da hype.",
    "115": "I'm gonna struggle to come up with a single positive thing to say about this movie so I'll akip that and just say what is easy to say about it.1. There isn't a single decent actor in this movie. It is just a bunch of kids that are pretending to be something they are not and making a very bad job of it.2. It is not scary. It's boring.3. Not a single likeable character so I couldn't care less what happens to any of them.This movie has had a massive build up and clearly lots of fake reviews.How Miranda Otto decided to be in this I will never understand because she is the only actually talented person in this disaster and in this she also was terrible.Dismissed.",
    "116": "Some teenagers/young adults are partying and bring out a supernatural hand to play with. The hand puts them in touch with something supernatural, possible evil. As long as they don't stay too long with it everything is fine and it's a teenage thrill. They enjoy the daring and wild ride. However then things go too far.This is the best horror I have seen this year. Compared to. Evil Dead Rise and The Boogeyman this is much better. Sure they have jump scares and nasty things happen but you're not a invested in as much as you are in Talk To Me. It revolves around Sophie Wilde and she keeps your attention all the way through. You really want to know what happens, is anyone going to die? And can they get rid of the evil?The loud music as times also helps. I did think it was a bit slow getting going but it is worth the wait. I was tempted to give it an 8 but shied away from that. I would give it a 7.5 if I could.",
    "117": "It is a film without depth, without development, where almost everything is resolved without meaning.3The protagonists make the most absurd decisions, they contradict each other every 5 minutes. And the ghosts don't fit too much into the main story.The ending is too abrupt. Such a flat script that focuses on 2 characters.The rest of the characters follow such a flat script that they become a nuisance.I think a sequel in this same incoherent style will be a big mistake.The plaster hand fails to capture attention: since the drama and inconsistencies of the film do not allow a good development.",
    "118": "When a group of kids get together under the thumb of the rather odious \"Hayley\" (Zoe Terakes) they are presented with a ceramic hand - that apparently encases a real one - that acts as a portal to a dimension in which live the dead. They have discovered that no harm can be done if they stick to a time limit, exceed that - and well they are in virgin and potentially perilous territory. Following on from her best friend \"Jade\" (Alexandra Jensen) who has a go, it falls to \"Mia\" (Sophie Wilde) and after the most bizarre of personally traumatic connections, she is soon addicted to the experience and is also soon providing a conduit that is causing havoc within their group - not least for poor young \"Riley\" (Joe Bird) who ends up needing danger money - and a soft play area! Wilde does quite well here and though the rest of the acting isn't really up to much, the story has an originality to it that genuinely creates a new avenue for a genre that has been really suffering from same old, same old storytelling of late. Bird is by far the star here - even if he is incapacitated for much of it, and the aforementioned Terakes creates a character I'd cheerfully throttle. There's too much dialogue and it's very very score-heavy which did annoy after a while, but it's at times quite scary and definitely worth a watch around Halloween on the telly.",
    "119": "There is no time wasted with this one. Right out of the gate it hurls you into the action, engaging and shocking you right off the bat. It holds fast to that engagement throughout the experience and every time it felt like the pacing was starting to slow down they picked it right back up with a bang.It is few and far between now a days to come across something that feels original and fresh, especially in the vein of possession. Talk to Me managed to do just that. The concept was truly intriguing and the execution was captivating. Something about the way they manifested the possession in this was so gnarly and frightening... it was very effective and well done.What was also well done was the makeup and sfx. With the visceral nature of what was represented, the film would not have been as successful if it wasn't for the artists so masterfully exemplifying their craft in this (talk about gnarly...).The spook factor is real in this one and did not come to play. The way they made this so relatable and accessible to their audience in this down to earth way makes it even creepier. There is a fun and creepy montage I enjoyed with a very intense, awesome scene following it that is still taking up space in my mind.The acting was also excellent across the board and a big attribute of this movie's success. The main girl did and excellent job and I hope to see more from her. The dad wasn't great for me and the moms character was a little jarring and odd to me in vernacular and behavior but I'm going to chalk it up to a cultural disconnect.I do feel like the story was missing a little background and eventually a bit of closure. I wish we had gotten more on the hand, where it came from and its purpose. More about the other realm, the spirits it holds and whatever entity they so casually mentioned can essentially impersonate other people? It wasn't terribly lacking, I would've just enjoyed more. I also would have liked just a little more closure as far as the storyline went. I certainly don't need everything wrapped up in a pretty black bow, but it almost gave that feeling of setting itself up for a sequel. Which I would love to see but it should also be solid as a stand alone. Regardless, I still enjoyed the ending which is where so many horror movies fall short. It was foreseeable yet I was not expecting it and appreciated that.All in all Talk to Me is a classic possession/communing with spirits story with a fresh, innovative twist to it and a masterful execution from all involved that will satiate the deep dark thralls of horror and thrills we so enjoy. Would recommend.IG- Howlingatthemoonreviews.",
    "120": "Next time, a fist bump will do.Whomever denies we're living in the greatest period of Horror Movies has simply been in a coma for the past decade. This year alone, we've had some incredible horrors such as No One Will Save You, Totally Killer, Saw X and probably the #1 of 2023, Talk to Me. Just to name a few and I haven't even seen them all yet.This is a GREAT throwback to the 80s horror without at all being an homage. THAT was refreshing as homages have become too overused lately. Especially just for the sake of being an homage. Plus, it's rare to see something THIS modern. And this RAW.Talk to Me involves some delinquent to disturbed to disgusting teens/kids who stumbled upon this Ouija-Type device to connect to the other side. Oh, but they're \"smart\" about it and only allowing the connection to last for a small amount of time. Whelp, their dance with the devil is going to be killer and they may never come back.I don't personally believe in the supernatural and yet, this felt completely real. Meaning, IF this were to happen, I truly believe these actions, reactions and disconnected/ deteriorating relationships probably would play out like this. And while I normally desire my horror movies to be right at 90 minutes, as this one was, I could've seen a little more here. There was so much emotion and threads to unravel and explore. Helps I DO love Australian horror films, so they can be as long as they need to be.And as highly as I recommend this film and it may be my favorite horror of 2023, I will say, the third act is exactly how I expected it'd play out. A lot of the great horror of the past decade have endings that truly shocked me and as extremely grim and bleak as they are, they impressed me for going there. Sadly, there weren't too many surprises here.Still, I did like the ending, and especially the very ending. Just, please. No sequel.***Final Thoughts: It's a great time to not be a kid. I know, I just \"Get Off My Yard\" the next gen, but wow if these characters were as authentic as they appeared, I do fear for the future.",
    "121": "I just watched a low budget Aussie movie that made it all the way to the US Sundance Film Festival in the Egyptian Theatre...not a bad feat for twins from OZ.This 94 minute Horror, Thriller, Supernatural First Feature Film for the RackaRacka brothers, Danny & Michael Phillipou was a true family affair, even roping in their sister Helene as a possessed person in the online videos.Before making this debut movie they already had over 1.5 billion views and 6.5 million subscribers on YouTube and other social media channels for their crazy \"Jackass\" style videos they've been making since they were children...sometime featuring a facsimile of Ronald McDonald.The young acting talent in front of the camera includes Sophie Wilde.She has proven herself as a leading actress (\"The Portable Door\") to carry this movie on her tiny shoulders as \"Mia\" because she is in nearly every scene and makes a brilliant transition from beginning to ending.Zoe Terakes (\"Wentworth\", \"Nine Perfect Strangers\") as \"Hayley\" starts the whole ball rolling by gathering all her friends to a seance with a difference.Her friend (Chris Alosio) as \"Joss\" constantly carries with him the creepy hand in his back pack...no snacks or drinks just a mummified hand and candle kit.In this supernatural experience each person must hold the embalmed and plastered hand of a dead spiritualist and literally talk to the hand as they utter the words \"Talk To Me\" then invite the spirit they raise into them to be possessed for no more than 90 seconds.A candle is lit at the beginning of the deadly ceremony and blown out at the end to conclude the session, if not the dead remain on our side.It's a spooky premise that's not entirely original, but it works surprisingly well.The horror and jump scares will keep you awake and maybe even give you nightmares.The on screen violence will force you to navel gaze momentarily to avoid the ugliness on more than one occasion.Youngest actor on set Joe Bird as \"Riley\" plays in a coma for most of the movie.Alexandra Jensen as \"Jade\" plays his big sister.Miranda Otto, from an Aussie acting dynasty, is their mother, \"Sue\".The director's produced \"Talk To Me\" themselves by securing investors who believed in them and the project rather than letting the story get lost in the Hollywood grist mill.This meant fighting to keep Aussie actors, accents, shooting in Adelaide, South Australia and more without diluting the product and something getting lost in translation as so often happens.It was a gamble that cost them dearly, but paid off in the end after Sundance, because big production companies were crawling over themselves to get the brothers to sign on the dotted line for distribution deals.A24 won out in the end over other major players to wet the ink and put \"Talk To Me\" into 2000 screens in the US alone!\"Talk To Me\" is one of the most successful debut feature horror films since \"Saw\" for our other famous Aussie horror exports James Wan & Leigh Wanell.It's also way better than anything they've created lately.It's got a distinctly Jordan Peele (\"Get Out\", \"Nope\")vibe in its cinematography and I say that in a good way.This movie even caught his attention.The opening scene will shock you to your core.There is no turning back once you've seen \"Talk To Me\".It reminded me of \"The Babadook\" with good reason...Causeway Films' producers also collaborated on \"Talk To Me\".Warning: Do not try this at home kids.I\"Talk To Me\" has got a fight on its hands (pardon the pun) during this period known jokingly as Barbenheimer.Thanks to the success of both \"Barbie\" and \"Oppenheimer\" putting up the full house signs, but if you wanna see something scary this should satisfy that hunger.Content creators are now making feature movies...enjoy this unsettling, urban legend with a cautionary tale & allegory to drug abuse.",
    "122": "I am a huge horror fan and have no problem watching even a subpar horror film, especially in October.Very rarely does a film come out that I'm legitimately excited for though.With its strong rating, I thought Talk to Me would really give me an experience to remember.As a horror fan I love the thrill of adrenaline from something truly terrifying... or it could be interesting if it has great comedic energy mixed with some sharp jump scares. I don't need to be left with nightmares for it to be enjoyable. Just give me that rush of being caught off guard. This is a subjective point of view, but, to me a scary movie should entertain through thrills over drama... and when they do I am delighted!So maybe if I expected a new experience that would make me giddy with fright I have only myself to blame. Not everyone has my taste.Sometimes a film comes that doesn't meet my standards but is otherwise not technically \"bad\" in the way that really bad horror movies are. This movie isn't cheesy, badly acted, exploitative or any other tired trope of a bad film that takes its self seriously. No glaringly offensive faults but after the first act it does become pretty predictable and poorly paced.Oh, and it's also not very scary. Or fun\nIt gets bogged down in drama without being engaging. It has lots of disturbing imagery, but doesn't use it to the full effect to shock the audience out of there seats.It begins with so much promise. But just when it's heating up to a climax it loses its vision and relies on a very flimsy and melodramatic plot line to carry it, rather than what it promised: horror.A lot of people enjoyed this film, and good for them.I offer this review to give a counter point to those who expect a real jolt of adrenaline from a good horror film.",
    "123": "The 2022 horror movie \"Talk to Me\" from writers Danny Philippou, Bill Hinzman and Daley Pearson was one that I hadn't heard about, as I stumbled upon it here in 2023. But I have to admit that I was intrigued by the movie's cover and the synopsis for the movie sounded interesting enough. And the fact that it was a horror movie that I hadn't already seen definitely helped to make me decide to sit down and watch it.The storyline in \"Talk to Me\" was interesting and definitely had a lot of potential to it. And sure, the movie did make for an adequate enough viewing experience, though I feel that the movie was somewhat toned down. It felt like more could have been put into the narrative to make the movie stand out more. It wasn't a scary movie, but I have to say that the storyline and plot proved to be interesting.The acting performances in \"Talk to Me\" were good. I wasn't familiar with the cast ensemble in the movie, but the actors and actresses put on good performances and helped carry the movie nicely. And thus made it all the more watchable and enjoyable.Visually then I will say that \"Talk to Me\" was good. The special effects and make-up was good, and that certainly added something enjoyable to the overall impression of the movie.All in all, a watchable horror movie. But it just wasn't outstanding or overly memorable. But suitable for a single viewing if you enjoy horror movies. The ending of the movie, however, was rather cliché and you saw it coming a mile away. A shame, because that ending sort of felt like a slap in the face after having sat through 95 minutes.My rating of directors Danny Philippou and Michael Philippou's 2022 movie \"Talk to Me\" lands on a five out of ten stars.",
    "124": "Still mourning the loss of her mother, Mia (Sophie Wilde) has grown emotionally distant from her father, Max (Marcus Johnson), and begun spending more time with her best friend Jade (Alexandra Jensen) and her younger brother Riley (Joe Bird). After attending a party with Jade and Daniel (Otis Dhanji), Mia's former boyfriend who's now dating Jade, the two are introduced to an embalmed hand relic by Hayley (Zoe Terakes) and Joss (Chris Alosio) that allows the holder to talk to the dead and allow them to be \"allegedly\" safely possessed by up to 90 seconds. What initially starts as a party gimmick soon turns serious when Mia thinks the hand is a bridge to her dead mother and sends her on a slow descent.Talk to Me is the feature debut of twin Aussie Youtubers Danny and Michael Philippou who came to prominence with their channel RackaRacka which is known for horror comedy videos. The film is a fully Australian production which the brothers worked on with noted producer Samnatha Jennings who previously produced the breakout and influential horror film The Babadook. The movie has become a sleeper hit earning $88 million worldwide at the time of this writing against its $4.5 million budget as well as scoring substantial acclaim. Talk to Me is a promising debut from the Philippou's and shows them to be talent to keep an eye on.While on a surface level the film would seem to be your average teen oriented horror film centered around a \"cursed object\" (Well-traveled ground seen in the likes of Polaroid, Wish Upon, and even this year's All Fun and Games) but despite sporting a familiar horror template, what it does with that template is anything but ordinary. At its core, Talk to Me is a character piece about addictive tendencies and unprocessed grief with Sophie Wilde's well-played as someone who's very much withdrawn from her family and extended social life and retreated to a state where she's in a state of limbo using her friend Jade and her family as a surrogate family while doing what she can to avoid the broken remains of her own. Despite Mia not being the most likable or sympathetic of characters, the movie doesn't ask us to like Mia and instead wants us to understand what motivates her and there is underlying humanity to her such as the \"cool older sister\" dynamic she has with Riley that shows a more tender side if not one to necessarily be approved of. I really like how the filmmakers handle the plot point of the embalmed hand because while they do establish a set of rules in how it works, they purposefully leave its origins vague which is really to its benefit as that makes its presence more unnerving. The Philippou do an interesting job of showcasing the hand's effects as we not only see them from the point of view of the user, but also from the point of view of outside observers. Despite being a horror film, there are also some points of comedy and satire that do work such as Jade's mother Sue always inquiring about whether drugs or parties are happening under her nose as well as the glib way the primarily teenaged characters are treating the notion of possession and contact with the afterlife as something to post on social media for bravado or bragging rights.I really enjoyed Talk to Me and it's one of the better cursed object horror I've seen in quite some time. The Philippou Brothers do a solid job of bringing this premise to life and Sophie Wilde is fantastic as Mia and I really look forward to seeing what the Philippous do next.",
    "125": "Ozzie horror gave us the \"Saw\" series. It's appropriate that A24 goes mining for the next Down Under scary guys.Here, it's the Phillipou Brothers.A little like \"Candyman\" this flick is about subtextual trauma. Mia (Sophie Wilde) and her successful father live alone in a house in which Mom had killed herself. This makes Mia hang with her bestie Jade (Alexandra Jensen) along with a tagalong brother Riley.These kids go over to a friends' house to mess with a severed hand which legend had it belong to a person who could speak with the dead (an origin story here would be fun). Things obviously go wrong as Mia starts to see her Mother, who is in the otherworld but yet has some malevolent tendencies towards her and her father.The story takes a melancholic turn about life after death and also touches on death in something like \"Flatliners\" The levels go to absurd when these kids continue to mess with seeing dead people so they can get social media clout.That said, a SOLID creepy flick. The resolution is how you would expect things to go. And, regardless of the violence and the swearing, it's rather odd when it still feels like a Canadian movie though it was made in Australia. Like, everything seems so...kind. Not sure how to explain that. I think the term is \"generic\" This is a better than average horror flick but still, it goes by the numbers which is fine. This is not a slasher film. It is released by A24, let that be your guide.",
    "126": "What a waste of time. I really was expecting something big from this movie, but then I remember it's an A24 production.The movie has no plot, only random events, there's no characters development, and speaking of it, the main character was so annoying.Like, where did come from the object? Why the chant is \"I let you in\"? If you wanna know, you need to talk to the director or writers, cause unfortunatelly you can't obtain these informartions from the movie.There's no use, this movie is corny, sucks for real. Thank God I didn't need to pay tô watch this terrible thing.Don't believe da hype.",
    "127": "I'm gonna struggle to come up with a single positive thing to say about this movie so I'll akip that and just say what is easy to say about it.1. There isn't a single decent actor in this movie. It is just a bunch of kids that are pretending to be something they are not and making a very bad job of it.2. It is not scary. It's boring.3. Not a single likeable character so I couldn't care less what happens to any of them.This movie has had a massive build up and clearly lots of fake reviews.How Miranda Otto decided to be in this I will never understand because she is the only actually talented person in this disaster and in this she also was terrible.Dismissed.",
    "128": "Some teenagers/young adults are partying and bring out a supernatural hand to play with. The hand puts them in touch with something supernatural, possible evil. As long as they don't stay too long with it everything is fine and it's a teenage thrill. They enjoy the daring and wild ride. However then things go too far.This is the best horror I have seen this year. Compared to. Evil Dead Rise and The Boogeyman this is much better. Sure they have jump scares and nasty things happen but you're not a invested in as much as you are in Talk To Me. It revolves around Sophie Wilde and she keeps your attention all the way through. You really want to know what happens, is anyone going to die? And can they get rid of the evil?The loud music as times also helps. I did think it was a bit slow getting going but it is worth the wait. I was tempted to give it an 8 but shied away from that. I would give it a 7.5 if I could.",
    "129": "It is a film without depth, without development, where almost everything is resolved without meaning.3The protagonists make the most absurd decisions, they contradict each other every 5 minutes. And the ghosts don't fit too much into the main story.The ending is too abrupt. Such a flat script that focuses on 2 characters.The rest of the characters follow such a flat script that they become a nuisance.I think a sequel in this same incoherent style will be a big mistake.The plaster hand fails to capture attention: since the drama and inconsistencies of the film do not allow a good development.",
    "130": "When a group of kids get together under the thumb of the rather odious \"Hayley\" (Zoe Terakes) they are presented with a ceramic hand - that apparently encases a real one - that acts as a portal to a dimension in which live the dead. They have discovered that no harm can be done if they stick to a time limit, exceed that - and well they are in virgin and potentially perilous territory. Following on from her best friend \"Jade\" (Alexandra Jensen) who has a go, it falls to \"Mia\" (Sophie Wilde) and after the most bizarre of personally traumatic connections, she is soon addicted to the experience and is also soon providing a conduit that is causing havoc within their group - not least for poor young \"Riley\" (Joe Bird) who ends up needing danger money - and a soft play area! Wilde does quite well here and though the rest of the acting isn't really up to much, the story has an originality to it that genuinely creates a new avenue for a genre that has been really suffering from same old, same old storytelling of late. Bird is by far the star here - even if he is incapacitated for much of it, and the aforementioned Terakes creates a character I'd cheerfully throttle. There's too much dialogue and it's very very score-heavy which did annoy after a while, but it's at times quite scary and definitely worth a watch around Halloween on the telly.",
    "131": "There is no time wasted with this one. Right out of the gate it hurls you into the action, engaging and shocking you right off the bat. It holds fast to that engagement throughout the experience and every time it felt like the pacing was starting to slow down they picked it right back up with a bang.It is few and far between now a days to come across something that feels original and fresh, especially in the vein of possession. Talk to Me managed to do just that. The concept was truly intriguing and the execution was captivating. Something about the way they manifested the possession in this was so gnarly and frightening... it was very effective and well done.What was also well done was the makeup and sfx. With the visceral nature of what was represented, the film would not have been as successful if it wasn't for the artists so masterfully exemplifying their craft in this (talk about gnarly...).The spook factor is real in this one and did not come to play. The way they made this so relatable and accessible to their audience in this down to earth way makes it even creepier. There is a fun and creepy montage I enjoyed with a very intense, awesome scene following it that is still taking up space in my mind.The acting was also excellent across the board and a big attribute of this movie's success. The main girl did and excellent job and I hope to see more from her. The dad wasn't great for me and the moms character was a little jarring and odd to me in vernacular and behavior but I'm going to chalk it up to a cultural disconnect.I do feel like the story was missing a little background and eventually a bit of closure. I wish we had gotten more on the hand, where it came from and its purpose. More about the other realm, the spirits it holds and whatever entity they so casually mentioned can essentially impersonate other people? It wasn't terribly lacking, I would've just enjoyed more. I also would have liked just a little more closure as far as the storyline went. I certainly don't need everything wrapped up in a pretty black bow, but it almost gave that feeling of setting itself up for a sequel. Which I would love to see but it should also be solid as a stand alone. Regardless, I still enjoyed the ending which is where so many horror movies fall short. It was foreseeable yet I was not expecting it and appreciated that.All in all Talk to Me is a classic possession/communing with spirits story with a fresh, innovative twist to it and a masterful execution from all involved that will satiate the deep dark thralls of horror and thrills we so enjoy. Would recommend.IG- Howlingatthemoonreviews.",
    "132": "Next time, a fist bump will do.Whomever denies we're living in the greatest period of Horror Movies has simply been in a coma for the past decade. This year alone, we've had some incredible horrors such as No One Will Save You, Totally Killer, Saw X and probably the #1 of 2023, Talk to Me. Just to name a few and I haven't even seen them all yet.This is a GREAT throwback to the 80s horror without at all being an homage. THAT was refreshing as homages have become too overused lately. Especially just for the sake of being an homage. Plus, it's rare to see something THIS modern. And this RAW.Talk to Me involves some delinquent to disturbed to disgusting teens/kids who stumbled upon this Ouija-Type device to connect to the other side. Oh, but they're \"smart\" about it and only allowing the connection to last for a small amount of time. Whelp, their dance with the devil is going to be killer and they may never come back.I don't personally believe in the supernatural and yet, this felt completely real. Meaning, IF this were to happen, I truly believe these actions, reactions and disconnected/ deteriorating relationships probably would play out like this. And while I normally desire my horror movies to be right at 90 minutes, as this one was, I could've seen a little more here. There was so much emotion and threads to unravel and explore. Helps I DO love Australian horror films, so they can be as long as they need to be.And as highly as I recommend this film and it may be my favorite horror of 2023, I will say, the third act is exactly how I expected it'd play out. A lot of the great horror of the past decade have endings that truly shocked me and as extremely grim and bleak as they are, they impressed me for going there. Sadly, there weren't too many surprises here.Still, I did like the ending, and especially the very ending. Just, please. No sequel.***Final Thoughts: It's a great time to not be a kid. I know, I just \"Get Off My Yard\" the next gen, but wow if these characters were as authentic as they appeared, I do fear for the future.",
    "133": "I just watched a low budget Aussie movie that made it all the way to the US Sundance Film Festival in the Egyptian Theatre...not a bad feat for twins from OZ.This 94 minute Horror, Thriller, Supernatural First Feature Film for the RackaRacka brothers, Danny & Michael Phillipou was a true family affair, even roping in their sister Helene as a possessed person in the online videos.Before making this debut movie they already had over 1.5 billion views and 6.5 million subscribers on YouTube and other social media channels for their crazy \"Jackass\" style videos they've been making since they were children...sometime featuring a facsimile of Ronald McDonald.The young acting talent in front of the camera includes Sophie Wilde.She has proven herself as a leading actress (\"The Portable Door\") to carry this movie on her tiny shoulders as \"Mia\" because she is in nearly every scene and makes a brilliant transition from beginning to ending.Zoe Terakes (\"Wentworth\", \"Nine Perfect Strangers\") as \"Hayley\" starts the whole ball rolling by gathering all her friends to a seance with a difference.Her friend (Chris Alosio) as \"Joss\" constantly carries with him the creepy hand in his back pack...no snacks or drinks just a mummified hand and candle kit.In this supernatural experience each person must hold the embalmed and plastered hand of a dead spiritualist and literally talk to the hand as they utter the words \"Talk To Me\" then invite the spirit they raise into them to be possessed for no more than 90 seconds.A candle is lit at the beginning of the deadly ceremony and blown out at the end to conclude the session, if not the dead remain on our side.It's a spooky premise that's not entirely original, but it works surprisingly well.The horror and jump scares will keep you awake and maybe even give you nightmares.The on screen violence will force you to navel gaze momentarily to avoid the ugliness on more than one occasion.Youngest actor on set Joe Bird as \"Riley\" plays in a coma for most of the movie.Alexandra Jensen as \"Jade\" plays his big sister.Miranda Otto, from an Aussie acting dynasty, is their mother, \"Sue\".The director's produced \"Talk To Me\" themselves by securing investors who believed in them and the project rather than letting the story get lost in the Hollywood grist mill.This meant fighting to keep Aussie actors, accents, shooting in Adelaide, South Australia and more without diluting the product and something getting lost in translation as so often happens.It was a gamble that cost them dearly, but paid off in the end after Sundance, because big production companies were crawling over themselves to get the brothers to sign on the dotted line for distribution deals.A24 won out in the end over other major players to wet the ink and put \"Talk To Me\" into 2000 screens in the US alone!\"Talk To Me\" is one of the most successful debut feature horror films since \"Saw\" for our other famous Aussie horror exports James Wan & Leigh Wanell.It's also way better than anything they've created lately.It's got a distinctly Jordan Peele (\"Get Out\", \"Nope\")vibe in its cinematography and I say that in a good way.This movie even caught his attention.The opening scene will shock you to your core.There is no turning back once you've seen \"Talk To Me\".It reminded me of \"The Babadook\" with good reason...Causeway Films' producers also collaborated on \"Talk To Me\".Warning: Do not try this at home kids.I\"Talk To Me\" has got a fight on its hands (pardon the pun) during this period known jokingly as Barbenheimer.Thanks to the success of both \"Barbie\" and \"Oppenheimer\" putting up the full house signs, but if you wanna see something scary this should satisfy that hunger.Content creators are now making feature movies...enjoy this unsettling, urban legend with a cautionary tale & allegory to drug abuse.",
    "134": "I am a huge horror fan and have no problem watching even a subpar horror film, especially in October.Very rarely does a film come out that I'm legitimately excited for though.With its strong rating, I thought Talk to Me would really give me an experience to remember.As a horror fan I love the thrill of adrenaline from something truly terrifying... or it could be interesting if it has great comedic energy mixed with some sharp jump scares. I don't need to be left with nightmares for it to be enjoyable. Just give me that rush of being caught off guard. This is a subjective point of view, but, to me a scary movie should entertain through thrills over drama... and when they do I am delighted!So maybe if I expected a new experience that would make me giddy with fright I have only myself to blame. Not everyone has my taste.Sometimes a film comes that doesn't meet my standards but is otherwise not technically \"bad\" in the way that really bad horror movies are. This movie isn't cheesy, badly acted, exploitative or any other tired trope of a bad film that takes its self seriously. No glaringly offensive faults but after the first act it does become pretty predictable and poorly paced.Oh, and it's also not very scary. Or fun\nIt gets bogged down in drama without being engaging. It has lots of disturbing imagery, but doesn't use it to the full effect to shock the audience out of there seats.It begins with so much promise. But just when it's heating up to a climax it loses its vision and relies on a very flimsy and melodramatic plot line to carry it, rather than what it promised: horror.A lot of people enjoyed this film, and good for them.I offer this review to give a counter point to those who expect a real jolt of adrenaline from a good horror film.",
    "135": "The 2022 horror movie \"Talk to Me\" from writers Danny Philippou, Bill Hinzman and Daley Pearson was one that I hadn't heard about, as I stumbled upon it here in 2023. But I have to admit that I was intrigued by the movie's cover and the synopsis for the movie sounded interesting enough. And the fact that it was a horror movie that I hadn't already seen definitely helped to make me decide to sit down and watch it.The storyline in \"Talk to Me\" was interesting and definitely had a lot of potential to it. And sure, the movie did make for an adequate enough viewing experience, though I feel that the movie was somewhat toned down. It felt like more could have been put into the narrative to make the movie stand out more. It wasn't a scary movie, but I have to say that the storyline and plot proved to be interesting.The acting performances in \"Talk to Me\" were good. I wasn't familiar with the cast ensemble in the movie, but the actors and actresses put on good performances and helped carry the movie nicely. And thus made it all the more watchable and enjoyable.Visually then I will say that \"Talk to Me\" was good. The special effects and make-up was good, and that certainly added something enjoyable to the overall impression of the movie.All in all, a watchable horror movie. But it just wasn't outstanding or overly memorable. But suitable for a single viewing if you enjoy horror movies. The ending of the movie, however, was rather cliché and you saw it coming a mile away. A shame, because that ending sort of felt like a slap in the face after having sat through 95 minutes.My rating of directors Danny Philippou and Michael Philippou's 2022 movie \"Talk to Me\" lands on a five out of ten stars.",
    "136": "Talk to me is an original horror with a concept so perfectly set for the current climate that it makes it very believable. As a child of North Adelaide I can definitely feel the characters as genuine people I'd meet at High School, Absolute props to the Hayley and Joss characters who in a horror/ thriller film still have some one-liners that'll make you laugh with just the perfect delivery.The storyline is well thought-out, and you very quickly feel for all characters involved. I loved the way we flip back and fourth in the beginning seeing the possession process from both sides when Daniel has a turn and he sees the spirits for the first time. The lighter scenes give you a chance to get comfy with the possession idea and how it's all fun and games ... until it's not.The gore and the make up - Holy hell this is done well - for the amount of close ups, and in-camera action you can tell the teams behind this put in a hell of an effort to make sure everything looked as good as it possibly could. The scenes in the bathroom at the hospital defiantly got my stomach turning. And the blood rigs paired with the sound effects and quick pace action make you want to hide behind your blanket.This film is 100% one to watch and is so far above the current horrors coming out today, its original, it's clever and its down-right scary without relying on jump-scares or gimmicks . I cannot wait to see what the boys do next !",
    "137": "\"Talk to Me\" is a truly terrifying and remarkable debut from the RackaRacka twins. A twisted story told with amazing skill.The good in this movie by far is the practical effects. They are absolutely terrifying to look at and immensely detailed. It's very disturbing and quite disgusting. Along with that is amazing gore. Again it's very disturbing and isn't fun. The performances are also very good. Sophie Wilde in particular is an absolute powerhouse here along with all the other cast members. The writing too is very good. Some of the best writing I've seen in a horror film in years. That immensely helps with making nearly every character here either likable or interesting. The idea of grief in this film is not only perfectly written, but is written in such a way that truly brings everything in the story to full circle. I love the subtle idea that this film in a way is an allegory for substance abuse for young teens. It gives the audience something to think about admits the bloodshed. Along with that we get some great directing with some amazing cinematography. The scares aren't jump scares, they're tense shots that linger for far too long to leave the audience in absolute shock. And finally the ending is just...it's an absolutely amazing ending that really sticks the landing along with everything else this movie achieved so well.All in all, \"Talk to Me\" is one of the rare horror movies that truly disturbed me and really showcases a great directing talent with these two twins.",
    "138": "LIKES:The Pace/time of the movie\n-It's dark material and it has a lot of thought, so a compact time limit helps weather the dark storm for this reviewer.-Talk to me takes the gas and give it all with the right momentum to keep things interesting, but never dipping into the too heavy a territory to get boring or typical.-And keeping that pace helps to blunt some of the elevated thoughts that A24 sometimes gets stuck with.The Film Filters:\n-A horror movie is only as good as the feeling it establishes, and in this case Talk To Me is a winner.-The film is shot in this grey filter, dreary, depressing, and haunting that works perfectly with the material they are presenting.-It helps add this ambience of the looming horror, but also contributes to the psych issues that come with it as well, really amplifying the true scare facto of this movie.-And then taking into account the cinematography, the movie just hits all the right shots to sell the story and leave you with a sense of unease when it is all done.The Makeup/Visuals:\n-A good movie requires good support of costumes and makeup to make the creatures come out and memorable.-The spirits of this world are horrifying. Maybe not to the traditional Insidious like demons and maladies, but this one takes the realism and really conveys the gross state of decay that these beings are in.-Certain moments really convey that horrible mode, and I can't help but appreciate the nightmare inducing images that these ghosts are. A true A24 vision brought to life.-But even the injuries that occur have this authenticity to it, and the seizure modes are animalistic and unnatural that are realistic to a level beyond our understanding.Acting:\n-It's not the best performance or most unique, but damn can these young actors act.-Talk to me takes the teenager spirit and takes it to a level that was relevant, deeper, and yet the typical fodder you find in these movies.-I won't mention most of the first billed, because their part in this movie is limited, but they play the parts well and convey the message of this story.-Sophie Wilde is the lead I'll talk about. The Australian actress has her niche in the horror world, and does it so good. She's got a vulnerability that works well, but this attitude that helps balance it, leading to an impressive character to follow.Alexandra Jensen as the best friend is that role that I thought was going to annoy me, but really meshes well with the drama aspect and handles the stupidity of the others quite well.Joe Bird is talented if not a bit quite, but once the movie gets started, the potential for some very powerful roles come out, alongside a manner that gives him range for potential roles.-The cast works together so well, and this frightened band of teenagers gives you some hopes, but some concern as they continue to solve the mystery at hand.The Story:\n-It's predictable at times, but the unique aspect of the Monkey's paw so to speak works as a medium that really helps ground, but mesh the two well.-Talk to Me uses this simplistic device to elevate, and by having such a closed portal keeps the film's antagonist delivering, while also helping hit other parts of the movie quite well.-Outside of the usual specters of ghost stories, this movie does the internal antagonism well, a constant battle of struggling to determine what is going on with them.-Add some touching moments, a little character struggle, and some actual realistic approaches and mix it with the haunting element, and again you have a victory for me in this department.-The movie really makes this ghost story feel terrifying to that degree, not so much in the jumping and scaring tactics, but more so in the unsettling ease that that goes with it.The Ending:\n-I won't spoil anything, but Talk to Me is one of those that does an elevated horror ending quite well at least in terms of some balance.-One level it's a metaphor with great use of theatrical elements. A piece that holds so many levels of moral battling that it leave it a bit ambiguous as to what will happen up until the decision.-Then you get the story elements and the symbology that it serves, not so lost in the art to be open ended and super vague to give you closure, and a closure that leave an imprint in your mind.-It all comes down to being a fitting ending and I like that in a movie that can handle art and storytelling and find middle ground, which I felt it did.Dislikes:Predictable:\n-I had most of the movie down pretty quickly, so I anticipate others might be able to figure out where the movie is going.-A few twists help try to throw you aside, but I found that most of the foreshadowing in the first thirty minutes should give you enough to determine the ending.Perhaps a Bit Too Dark?-A24 should have a warning for most of its films in that the darkness may be too much for many people, including parts of myself.-One part is the sheer horror and realism, with vibes that go down perhaps too personal of levels, so caution if you are prone to PTSD with realistic events.-Second, A24's desire to put people in the nude that aren't the most stunning is still prevalent and that did little for me other than stir my nausea.-Third the movie has one moment that makes no sense until the end, but there was so much better use than once more sowing me an animal needlessly suffering. Dragging it out, adding little use, there were better ways to accomplish it.-And crossing my rules of boundaries, I don't enjoy that, so it loses points for me.More character development:\n-Simply put, the movie starts off well, but the other characters could have worked better to help the others. Maybe add a little more attempts to discern the mental quality and finish polishing things up.-Great characters could have been more, but then that would have taken more time and more time dwelling in the dark might not have been good given how this movie might leave people feeling.The VERDICT:\nTalk to me is a weird movie, but it lives to the usual caliber of A24 in elevating a movie series to a new level to help add freshness to the movie. Or something like that. The movie works in establishing creepy feelings, horror that sticks with you and a story that will certainly remain ingrained in the mind. It takes the familiar genre and helps condense the horrors to a logical plot, while exploring character traits that help mix up things while still feeling familiar. With a talented cast, characters who are a tad more developed, and elements that blend together to be a real horror movie, it certainly does stick out as one of the more unique and disturbing horror movies of the bunch. However, more time with the characters, a little more mystery and involvement to help mix things up, ad toning back some of the more disturbing elements could have helped this movie more to really be the wow factor they were shooting with this movie. Thus, my review leaves a score of:Horror/Thriller: 8.0\nMovie Overall: 7.0.",
    "139": "I saw this film twice at the Adelaide Her Majesty's Theatre screening and the following day at the Palace Nova.Danny and Michael are some of the most talented and driven filmmakers on the planet. What they managed to achieve with Covid restraints and smaller end budget was incredible.The young Australian cast gave incredible performances and DOP Aaron Mclisky created an incredible visual experience.The YouTubers turned filmmakers have made a huge impact online and have proven they can take that talent to the big screen. The twins have a huge future ahead and will take the film world by storm.10/10.",
    "140": "The brothers have produced their first ever film debut; I have to admit it is a really solid horror film, and at the peak: one of the best paranormal/supernatural horror films in 2023. It's hard to believe that these guys came from humble beginnings (YouTube) and managed to secure a place where they could explore their talents to the fullest reach without being held back by budget constraints and censorship.Anyone who knows RackaRacka on YouTube can expect a return-to-form here on this movie with an amazingly ridiculous amount of violence, terror, and straight up bleak comedy infused into its characters and plot. It's simple and effective- it doesn't need the audience to indulge themselves on premise but rather to just sit back and enjoy the ride- and it's a beast of its own rite.I think for what it's worth, this is going to be a really fun movie to watch over and over. It's got a stellar cast that seems to understand the material really well and has fun with it altogether, and the direction is promising for a debut from two brothers.If you enjoy supernatural horror films, or any horror film for that matter, I could definitely name Talk to Me as a strong contender for your preference. It isn't perfect by any means, but it's too unique and self-identified to be passed up as a standard cliche horror movie; it's different and it enjoys being different. There's a lot to dig in to here, and I think if you give it a shot, you'd be more than pleasantly surprised by the work performed on all fronts of this production. It's a solid horror movie and will be on my shelf soon!",
    "141": "YouTube comic horror sensations, twin brothers Danny and Michael Philippou, crash into mainstream films by way of progressive film company A24, with a half-dead kangaroo and a haunted hand opening that gains immediate attention in Talk to Me. From there the film titillates by a series of shocks as good as it gets with seasoned filmmakers like Sam Raimi.Not yet done with this tour de force opening, the camera tracks a young man to a locked door at a party that should have stopped hours ago as he breaks down the door and extricates his younger brother, who was long ago freaked out in a probable encounter with the haunted hand, which will be introduced at said party shortly.The hand at the party is a connection to the macabre past, and it won't leave if someone holds it longer than 90 seconds. Of course, a callow teen will do that, ensuring that the hand can do its dirty work for the rest of the party and beyond. As metaphor, the hand serves as a reminder that evil doings can grab hold and never let go until said dumb teen gets taken away into a spiritual realm where former corpses act like zombies only a bit uglier.For those not making the final journey but experiencing the hand, their faces transform briefly into ghouls while their dilated eyes promise hell behind. Of course, the spectators howl with delight while filming for social media. That's what bored teen do in ultra-cool horror films, especially helped by Emma Bortignon's classic horror sound designGradually Mia (Sophie Wilde) takes over the struggle against the spirits, grappling with such phantasms as her deceased mother, or is it really she? Relentlessly Mia tries to defeat the micro possessions that come for her because she has stayed overtime, and repeatedly, dealing with her mother's alleged suicide.While the mayhem winds down, the film succeeds in showing grief can terrorize lives as it gets hold of inner fears and regrets. Not bad for new filmmakers.",
    "142": "Don't normally watch horror but this came up in a secret screening. I'm glad I watched it.Partying teens have a new party trick, being briefly possessed by saying to talk to me whilst holding a hand status. What could go wrong?Whilst I don't think it's an original idea it definitely was very well executed and probably one of the best possession films.The acting is very well done by all characters and the story arc of the main character is done incredibly well due to Sophie Wilde's performance but also the cinematography of her story throughout the film (don't want to give spoilers as to what I mean by this)\nWhat I also like is it doesn't do cheap jumpscares (in fact there ain't many) but more goes for the shock effect (my cinema gasped at a couple of scenes) which really works for this film. It makes it alot more impactful.I think my only criticism is some parts of the story aren't as original as the directors think and could have gone a different route for those parts.Overall I enjoyed Talk to Me and a great effort for first time directors.",
    "143": "Hello again please read this review and save yourself the HUGE let down I experienced in watching this LAME film. Once again I am totally dumbstruck by what people today call 'scary'. This film didn't even give me chills ONCE! I love all great horror from the original night of the living dead to the conjuring movies(1 & 2 at least). This film doesn't just fail at being a decent horror movie but it completely fails outright as a basic film! Firstly the characters are TERRIBLE! They all have ZERO likability and just keep on making DUMB choices throughout! The script itself seems like it was written by a 10 year old with cringey humour and just outright bad dialogue with zero logic! The story is all over the place trying to find an actual point to justify its existence. The film is so dull I actually started writing this review an hour into it and just let it continue to give me ammo to hate it! If I'm coming across a bit angry it's because I LOVE HORROR movies and I HATE keep getting my hopes up about the new films everyone raves are the \"best new horror film\" and then I am left scratching my head wondering what the heck was supposed to be good about them! Seriously there is literally nothing to like about this film, the complete lack of story, the complete lack of likeable characters, the COMPLETE LACK of scares??!! I just wish people who knew nothing about decent horror would STOP making these lame films! Seriously are we supposed to be scared about rotting dead people? Is that what the point is and that's why I don't get it? Even when the film starts to make you think it has a point(saving a child who's been possessed) it then completely forgets this and ends in a really stupid illogical way! Ok I'm gunna stop now and hope my high blood pressure has proven to you TRUE horror fans out there to pass this one by, honestly any TRUE horror fan will only enjoy how easy this film is to scoff at. A friend once said to me, \"usually when all the critics and mainstream fans rave about a new film stating \"the best new 'genre' film yet!\" it is usually a BAD sign, and oh boy is this lame film \"the worst new horror film yet!\". I SO WANTED TO LOVE THIS FILM but honestly, there is nothing to love or even remotely like about any of it. The only thing I am actually HAPPY about......I didnt have to pay to watch it thankfully and now will also be cancelling my preordered steelbook because once again I fell for the clearly bought for hype for this boring snooze fest. I will say I can't wait to hear what my mate thinks of it as he like myself is proper horror fan and again like myself he is stupidly excited to see \"the new best horror movie!\" Lol! Thanks for listening to me rant and I pray it saves you all an hour and a half of your life you will never get back! So until the next time Stay safe and may the force be with you.",
    "144": "I really liked it.It's a really fun creepy and mean possession/supernatural movie with good uses of effects, performances, tone, and writing. The directors Danny and Michael Philippou are the RackaRacka Bros whom I grew up watching their videos on Youtube as they made ridiculous but fun gory stunt work videos that were hilarious to watch. In the past, Youtubers have gotten the chance to make movies and most of them have honestly been really bad. But here, this movie is a wild ride and I really had a fun time watching it.Most of the production, settings and sound designs were pretty good and the uses of the effects regarding stunts or practical were well-done as it helped enhance the supernatural horror and creepy elements together. The camerawork is solid as there are some pretty cool camerawork shots anytime some of the horrific moments appear on screen. Many of the performances from the cast members are pretty good, especially Sophie Wilde and Joe Bird as each performance was strong and made the characters interesting to observe. Teenage characters can be really unlikable in horror movies and it was refreshing to see teenage characters feel real without making them over exaggerated and terribly written.The narrative is the typical horror possession concept with familiar tropes but the narrative works because it explores some new territories that surprised me and ideas that were refreshing and and I appreciate them not using the typical unnecessary jump scares and cliched tropes in generic horror movies. The dialogue is pretty good although there were a few dialogue moments that could use some work. Including some writing elements and tone that felt a little too similar to Sam Raimi. However, despite some small flaws, the film still succeeds with a great pacing, direction and writing that felt creepy, mean, and entertaining.Overall, this was a really great horror movie and probably the best movie made from Youtubers so far. If the Rackaracka Bros ever make another movie, I will love to see what they can make next.",
    "145": "8.5/10\nTalk To Me was more of like terrifyingly brutal than terrifyingly scary, the brutality from the demon that makes it unsettling and disturbing, while Talk To Me concept wasn't the most original, the duo Danny and Michael Philippou surely just created their own original style of directing in their very impressive debut in this possibly best directorial movie debut by a Youtube Content Creator, the very unique and impressive style of filmmaking, the story, the performances were all amazingly well done, it's very well crafted, and undoubtedly intense, i almost closed my eyes not because the scare of the demon or the jumpscare but because of the very excellent yet very disturbing gore that they have in the movie, i wasn't crazy and really that satisfying about the ending unfortunately, some slow part, and to be honest i wish there is more of the brutal hardcore scary stuff in the movie because that will make the movie even more crazier, they really do pretty lacking on that even though everytime they did it it's freakin incredible, and again not so original in the story but was i still invested to the story and to the characters for like 85% of the film?, Absolutely yes, despite the flaws the rest of the movie was awesome, and i have a fun intense good time watching it in the theaters, still overall Talk To Me is a very impressive directorial debut by the Philippou brothers, it's disturbingly intense fun movie.",
    "146": "I'll probably say this a thousand more times, but any chance that I have to see a new film released by A24, I'll be there. Talk to Me is their latest theatrical release and while it's not one of their best, it's a very solid horror/thriller. Horror isn't my favourite genre, but I'll admit when one impresses me. This film plays it safe in terms of the story, but definitely not when it comes to the surprises/kills. Here are my thoughts on Talk to Me.This is a premise many filmgoers have experiences hundreds of times. A Group of teenagers have a party and the popular new trend sets a series of events in motion that will have some of the characters possessed, if not killed. This time around, it's a sculpture of a hand that reacts when you say the words \"Talk to Me.\" Once a character grabs the hand and utters those words, they are shown a creepy image of a human who has passed on. Without ruining anything, this film gets a little deeper than I was expecting. The main character in Mia (Sophie Wilde) was easily the best part of this film.Mia's backstory and constant involvement in the game itself is what made this film sing for me. The loneliness and grief her character feels added a layer to this film that I wasn't expecting. Although certain storylines play out as you would expect them to and the final scene is just like many other films, the overall story and uniqueness of the object itself is what had me liking it so much. It also didn't hurt that Sophie Wilde is a great actress. I haven't seen her in anything aside from this simply due to the fact that she is a newer actress with only a couple of credits so far. I can't wait to see what she does next.On top of her incredible talent showcased in this film, she also had a hand in writing the story and directors Danny Philippou and Michael Philippou have also never directed a feature film before this. For newcomers being found online, this is a pretty terrific first little film. At just over 90 minutes, Talk to Me never overstays its welcome. It can feel predictable, but the shock value throughout the movie and genuinely creepy imagery kept me engaged. A Very solid flick that I can recommend to horror/thriller fans.",
    "147": "Listen up, horror fiends! If you're a fan of Drag Me to Hell, Flatliners or Idle Hands, you're gonna love this gritty and gruesome Australian gem.Supernatural horror film Talk To Me is the theatrical debut of directing brothers Danny Philippou and Michael Philippou, known for their YouTube channel, Racka Racka.Talk To Me's story revolves around a group of friends who stumble upon a peculiar discovery-the ability to conjure spirits using an embalmed hand. What starts as a thrill-seeking experiment (filmed and shared online, naturally) quickly spirals into a terrifying ordeal when one of them takes their curiosity too far, unleashing sinister and supernatural forces upon themselves.With its tightly woven narrative and dry wit, Talk To Me keeps us both engaged and entertained throughout its entire 94 minutes. With this tight and tidy runtime, the story holds a good pace, builds suspense and provides levity in all the right moments-refreshing in an era where unnecessarily long features have become the norm!Talk To Me's raw and gritty cinematography captures everything we've come to love about Australian film. If you enjoyed Animal Kingdom, Snowtown and The Babadook, you'll love the authentic look and feel of this film.But, be warned! Talk To Me contains some brutal, head-smashing scenes that will avert even the biggest gorehound's gaze. I personally haven't seen special effects this realistic and visceral since the Argentinian horror film Terrified.Looking around me at the youngsters in the theatre, and considering the average age of the cast (basically foetal), I wondered if Talk To Me was going to be the average, run of the mill, soft teen horror flick. But, I'm thrilled to say it got under my skin with its interesting story, relatable characters and some pretty convincing performances from lead Sophie Wilde (Mia), newcomer Joe Bird (Riley), and Miranda Otto (Sue).Overall, Talk To Me is one of the most exciting horror movies to emerge from Australia in recent years. So, go watch. Let it in. Possession has never been so much fun!",
    "148": "Talk to Me (2023) is an Australian movie that I caught in theaters this evening. The storyline follows a group of teenagers who discover a statue with a real hand inside. When you touch the hand it releases spirits into the body of the hand holder. A group of teens push the connection to too far and pull something into our world that will ruin their lives forever.This picture is directed by Michael and Danny Philippou, in their directorial debut, and stars Ari McCarthy (Heartbreak High), Sarah Brokensha (Wolf Creek), Miranda Otto (The Lord of the Rings) and Marcus Johnson (The Spartacus series).This has a unique concept that reminded me of \"It Follows\" when it came out where it was like nothing we had ever seen. It's always fun when something different is entered into the horror genre. The acting was pretty good and Mia was appropriately annoying. Miranda Otto delivers a strong supporting performance. The horror elements were amazing. This has my favorite all time possession scene, but all of the possession scenes are very good. The makeup, masks and special effects were elite. Riley is a trooper in this. The violence is sudden, intense, brutal and gory...all boxes checked. The ending was solid and a perfect way to conclude the movie.Overall, this was an entertaining addition to the horror genre that I would score a 7.5-8/10 and strongly recommend.",
    "149": "It's a well done movie, considering it's budget. Well shot, good audio, acting is good. Not scary at all though.It's an interesting concept and story, but underdeveloped by a large margin. The initial premise that random kids have such an object is ridiculous by itself.My main problem with this movie that it's first half is just boring. Most of the characters are also quite annoying, which doesn't help feel you invested in them. There was almost no feeling of tension and there were little significant scares. I don't want to spoil anything, so I can only say that there are some quite shocking scenes due to violence, but that's it.I don't get the fuss about this movie. It's watchable and very forgettable.I hope that the authors will have an opportunity to make something bigger are more ambitious. There's a lot of promise in their work but the road ahead will be long.Mediocre, 6/10."
}