{
    "0": "This film came out of nowhere. I hadn't heard anything about it, but I took a chance on it and I loved it! Love and Monsters was a really fun entertaining film. I really enjoyed the combination of romantic comedy and sci-fi/horror. It was well written, the acting was on point, and the film direction was very good. I really enjoyed the world-building in this film. The atmosphere and monsters were done very well. The post-apocalyptic world in this film is much different than in others where it's dark and murky. This film was bright and colorful and really showed that after 95% of humanity was gone, the environment took over un-restricted. Planes buried in mountains covered in vines, buildings overgrown with plants and trees, etc....It just looked really really good. Also....bonus points for having the cutest dog I have ever seen in my entire life! I think everyone who watches this is going to fall in love with that adorable brown puppy...and how could they not??? Great movie! Very well executed and definitely leaves you wanting more. I hope this is the start of something new!",
    "1": "Had pretty low expectations but I enjoyed this. I'd happily watch a sequel",
    "2": "Solid well made movie - very good casting to put Dylan Obrien in this role - he works it perfectly. The rest of the cast is good and the special effects are well done. Solid plot and good action fun film. Worth watching.",
    "3": "Of all the films that I've watched over quarantine, Love and Monsters is the one that deserved to play in a theater.Directed by Michael Matthews from a script by Brian Duffield (who wrote The Babysitter and wrote and directed Spontaneous) and Matthew Robinson (Monster Trucks), this movie creates an interesting world from the first frame, a place where an asteroid almost hits the Earth, but nuclear weapons destroy it. However, the fallout transforms any cold-blooded animal into a mutated monster and within days, most of the human race is dead.This all takes place seven years before this movie, on the night that Joel Dawson (Dylan O'Brien) is separated from his girlfriend Aimee (Jessica Henwick). After reconnecting with her via the radio, he decides to leave behind the bunker where he's spent his life and cross the dangerous world left behind to find her.Joel has no survival skills at all, mostly acting as the cook for his group. Once he gets to the outside, he's quickly saved and taught what he needs to know by Clyde Dutton (Michael Rooker) and Minnow (Ariana Greenblatt). Then, he's on his way, seeking true love, which he learns the meaning of once he gets to Aimee's settlement.If you have older kids who aren't frightened by big monsters, this is a great movie. I'll give you a small spoiler and let you know that Boy the dog survives, if you worry about that like I do.Originally titled Monster Problems, this has moments of true beauty amongst the monster mayhem, such as when the Mav1s robot plays music for our hero and luminescent jellyfish float through the air.I would more than recommend this movie and hope for a sequel. It was an absolute blast and a real escape from the issues of the world, as all good movies are.",
    "4": "This is one of the best recent adventure films. It avoids many clichés that inhabit the genre, with small twists which made watching it a pleasure.Even though the action scenes were sort of predictable, it didn't deter away from getting absorbed into Joel's story and caring what happened to him and the other characters. It had some small lessons in it too, which added to the story.Its a little too adult for young children in my opinion. Young teens though would enjoy it.",
    "5": "Great mocumentary depicting every day life in Australia.",
    "6": "It's a lot like zombieland which is probebly one of my favourite films. The main character is not will smith or the rock, it's a skinny nobody. Dylan Obrien is amazing. The film is funny and the action is great. The monsters are also really cool. The dog is a badass. I'd love a sequel. more characters more worldbuilding stuff like that.",
    "7": "It's not the most expensive movie, or the best plot but honestly this movie gave me flashbacks to the good old days of family adventure movies.\nIt has adventure, it has love, it has companionship, it has humour and it keeps you wanting to learn more about the world. It makes you feel good.I only wish it were longer and I hope they make a sequel.",
    "8": "Finally, a fresh new plot with some good quality VFX applied in it.",
    "9": "This movie was fun to watch, the acting wasn't bad at all, CGI was decent.\nCompared to Jumanji for example, which I found was a bit too much and overacted, this one is exactly what you would expect, but not too intense and forced.\nLooking forward to a sequel.",
    "10": "I enjoyed this way more than I expected. It has love, adventures and humanity in it.",
    "11": "Love and Monsters was a fun film to see and it is actually after a some time a very fun new realease that surved its purpose and goals that it was trying to reach.Story was very inspiring and sweet at same time,it had some emotional moments and some romantic ones that were justified and that didnt felt rushed at any moment.Characters are also very likeable and i was able to root for them during entire runtime expecely towards the Dylan O Brien one,cause he was highlight of a entire film,special effects were also pretty solid and they done a good job to.Love and Monsters was a fun film to see for all families",
    "12": "Really enjoyable movie and not as predictable as you'd think. I was surprised how funny and original 'Love and Monsters' was considering the overdone genre but it is an adventure worth taking. If you're looking for a decent weekend flick then I strongly recommend you give it a go.",
    "13": "An apocalyptic film without zombies is worth its weight in gold these days.\nThe monster were kinda silly, but the story, the pace and the character were pretty good.\nFilming locations were also great and different from the usual Hollywoodian sameness.\nAnd, Thanks God, there were no \"in your face\" PC proselytism, which was refreshing.\nLove and Monsters is the type of a film that a father can watch with his daughter or a mother with her and son and without feeling embarrassed most of the time.",
    "14": "These hi-concept voice-over end of the world affairs do not always work, but the script here is smart enough to consistently play to basic human emotions and Obrien seems to have enough charm in the tank to power a battleship.",
    "15": "I was prepared for another boring to death movie flick, making questioning my taste on movies. I was surprised in a good way.\nThe movie had it all, great FX, good acting, Monsters, unseen twists, everything i needed for a Saturday night.And most of all, for bad or good, an open ending that leaves room a return (which traditionally will suck).Highly recommended.",
    "16": "6/10 - unexpected sci-fi hit has good special effects but an unfulfilling story",
    "17": "This is your typical family friendly adventure movie. It has a plain, simple plot (and don't try to put it through the \"credibility test\", because it will fail miserably), predictable and cliched. There's not a lot of character development either. It has some humor (not very good), and some heartwarming moments (kinda...). Overall it's entertaining (considering it's intended for kids and teens), but forgettable.",
    "18": "Yes, this is a very entertaining movie. A teenage boy survives a global disaster and is in hiding with other survivors in underground bunkers. Yet, he cannot get his girlfriend out of his head, luckily his girlfriend also survived, but is at a camp 126km from his camp. He takes the journey to go to his girlfriend fighting mutated cold blooded animals and insects. The mutants are great, very well done. What this movie almost brings down is the childish script and jokes, the main character, the teenage boy, is constantly denigrated for no reason, even a little girl he meets on his journey insults him only for a couple of poor executed jokes. But, all in all, this movie is worth your while.",
    "19": "Bad news: Asteroid Agatha 616 is headed at Earth. Good News: Rockets are deployed to destroy the asteroid and succeed. Bad news: The fallout causes mutation in insects and cold blooded animals. Humans live underground in colonies. Our story focuses on Joel (Dylan O'Brien ) who freezes at the sight of a monster, even after seven years. He has been separated from his only teen love Aimee (Jessica Henwick) who is at another colony 85 dangerous surface miles away. Joel decides he wants to see her and starts out on a trek.The story is mostly comedy. Joel meets Michael Rooker and young Ariana Greenblatt on the surface who are seasoned surface survivors who teach him the ropes. I enjoyed the film and the goofy creatures.Guide: No F-words, sex, or nudity.",
    "20": "An amazing entertaining adventure with scary monsters, intelligent writing, and an inspiring story about the value of friendship and family. All coated with a good sense of humor. Defiantly one of the best movies of 2020. I saw it twice in a row. Highly recommended. And kudos to the dog Boy. He is a protagonist as much as everyone else.",
    "21": "This movie was actually way better than I expected. I found it very inspiring (in a way) that being the weakest kid from his colony, a love that lingered for seven years had driven him to brave the surface world.The friends that he encounters a long the way develope him into a person that he never thought he could be. They taught him how to survive. It was heartbreaking when they separated.Throughout the whole movie I found the most heartbreaking moment was when Joel encountered the Mavis bot. It made me so sad listening to the dialog. I shed a tear.Later in the movie new friendships and enemies are made. It is a great adventure that tugs at the heart.The movie isn't just sad, it is also fun. There are a lot of monster encountersI think anyone who enjoys adventure would appreciate this movie.7/10.",
    "22": "Ignore the bad reviews, it's actually a pretty decent movie. Nothing original, however much better than most movies they make nowadays.Dylan O'Brien is very talented and carries the whole film well. This is not Shakespeare, still it's fun and good for a movie night with friends and family.",
    "23": "This was a good watchable movie. It has it's problems but the movie overcomes the problems with the emotional depth of the story and a great Dylan O'Brien performance.",
    "24": "The after-effects of blasting to bits an otherwise Earth-destroying asteroid have, unfortunately, turned creepy-crawlies into giant carniverous monsters, leaving small groups of surviving humans hiding away in fear. Seven years later, scaredycat Joel is the only singleton in his colony, so he decides to defy his group's (accurate) assessment of his cowardice, and go looking for girlfriend Aimee, last seen 7 years ago but known to have survived in a colony some distance away.This is a straightforward monster movie with humour. It's fairly family friendly - no explicit violence to humans, minimal bad language, and a great deal of fun. It's exciting, the monsters are good, and Joel (played well by Dylan O'Brien) is a likeable protagonist.It's not much of a stretch to see the seeds of this film in Zombieland, but it is noticeably gentler. I really liked it.",
    "25": "This movie is a solid piece of entertainment. Good acting, some funny jokes, good CGI & it's got a nice pace. Also quite a few likeable characters in it. Definitely worth the watch.",
    "26": "Surprisingly really good...I'm sad it didn't get to make a huge box office",
    "27": "I enjoy searching the Internet to find a good movie to watch. The other day I saw it on Netflix and watched it without reading the IMDb comments, which I never do. This is a great movie like Zombieland with great monsters. It will make you feel good and spend great time. The lead actor is likeable and gullible, which is a common feature of these movies. Watch it.",
    "28": "This isn't a bad movie, it just didn't do much for me. I barely laughed at any of the comedic parts. The tone was a little too happy. The protagonist was not the awkward but charming character he was trying to be, something justin long does well. And there are a bunch of high school drama cliches that i predicted a mile ahead. The monsters looked cool but were barely on screen. And the action wasn't good enough to add value (1 viewing, 5/16/2021)",
    "29": "Fun, fun, fun! Good for adults, but older kids would love this one too. A fresh, fun, adventure in a post-apocalyptic world that's scary but not dark and gritty the way movies like that typically are. It not for the pandemic, this would have likely been a huge theater release. Watch it at home with the lights out and your own popcorn.",
    "30": "It's a very entertaining movie. The opening was very funny and it perfectly explained what we are dealing with here. There is some very emotional scenes. The acting in very good. You will love the little girl. It's got adventure, comedy, action and mainly monster so what are you waiting for.",
    "31": "Too wide range of events crammed in a very short time. Excellent graphics, neat acting, cool sound effect, the beginning is very bad but later improves, relatively neat impression!",
    "32": "We had alot of this type of movies in the 80's.Simple and fun. But, last decades it's full of nonsens and bad execution. This movie nows what it is and I like it. Good protagonist, dog is amazing, side characters and phasing.",
    "33": "Wasn't really sure what to expect from this movie because from the trailer it more of looked like a movie for teenagers. So I figured it might be bit corny or just not enjoyable for my age range. But upon conclusion I was begging for sequel because I liked it honestly so much.First the acting from all parties was good and especially from the lead actor Dylan O'brien. The movie also contained great mix of emotion, action, humor, and romance. On top of all that the visuals were amazing and sound effects as well. The only reason why I diddn't give it a 10 out of 10 was due to the slow beginning. But once this movie gets going from there its non-stop thrill ride.Would definitely recommend this movie to everyone and it definitely has alot of rewatchability.",
    "34": "Nice and inexperienced guy in a world of insectoid monsters decides to go look for his girlfriend who he hasn't seen for seven years. Everybody tells him it's an insane idea, but he does it anyway. And instead of dying in the first 5 minutes and the movie ending, he actually gets to the girl and in the process discovers himself and the strength within. Who would have expected that?It's a typical hero journey, the effects are not overused, but good quality when they are. It doesn't do much in terms of story, just a guy lucky to survive in a world that is not as monstrous as everybody thought. Perhaps if it were more monstrous then the movie would have been rated R or labeled \"horror\" and people like my wife would had automatically dismissed it, so win win, I guess.It's not a great movie, but it's good fun, so if you need something light, give it a try.",
    "35": "In a world rampant with covid-19 pandemic, entertainment has suffered badly. Even third-rated movies become favorites with high ratings given by ordinary entertainment-starved people. This flick is one of them.The first 20 minutes are a total waste of time, with terrible dialogue. it livens up a bit when a journey is made and we meet some monsters and a dog. These creatures and the dog become the highlights in the movie, far outstripping the actors in a weak plot.You must make up your own mind. It is not an adventure nor love, but a feeble comedy. Some people may actually like it.",
    "36": "On the face of it, Love And Monsters is a tough sell. A movie about the end of the world dropping on Netflix during a global pandemic? Yikes. Luckily, its decision to not go down a gloom-and-doom route works in its favour, and its endless charm offsets any real-world anxieties. Its protagonist, Joel Dawson (Dylan O'Brien), is an apocalypse survivor who, by the standards of any mainstream Hollywood disaster movie, should not still be alive. Holed up in a bunker with a group of fiercely brave weapons-wielding survivalists, his most useful quality is his ability to make a tasty minestrone soup. Too skittish to fight and woefully inept when he does try, the lovelorn Joel spends his days composing letters to his long-distance girlfriend, Aimee (Jessica Henwick), and trying to get in touch with her over a makeshift radio.",
    "37": "... or hunter gatherers reunited. A very easy film to dissect and ridicule but its heart is in the right place and there is an ecological message amongst the mucous, membranes and slime. If you're happy to paddle in the shallows, toss a very endearing dog a crab stick and be reminded there's no courage without fear you wont be too disappointed unless, that is, you suffer from entomophobia, in which case you may have a few problems with these monsters from the off.",
    "38": "Fairly good CGI of monster insects turning the tables on humans to make them the munchies. Not very believable that only insects & invertebrates get to supersize (also not structurally possible per even high school science).\nCause: The usual asteroid episode encounter w/Earth. Teen hook of teen goes on perilous journey (accompanied by dog of course) to see girlfriend. Left open a sequel monster mash. High school drama class level acting & dialogue.\nI'm rooting for the insects to clean up Earth.",
    "39": "Great lead, good monsters, genuine sense of peril throughout. Really unexpected given the lack of hype surrounding it.",
    "40": "I didn't have or keep high expectations but It was really enjoyable. Watching this during quarantine, somehow makes me feel better. Most surprising thing about this movie is an apocalypse movie without zombies. It didn't bore me at all, I was my edge of my seat whole time to see if Joel can ever be able to find his love Aimee. This is something new, something interesting. While all apocalypse movie focuses on survival techniques, killing zombies or monsters but main focus is to find his lost love whom he lost seven years ago. It is beyond expectations. However, quest for Aimee didn't go well.",
    "41": "Cutie Dylan O'Brien of MTV'S Teen Wolf and the Maze Runner franchise stars in this dystopian Horror fantasy. Some time in the future an asteroid heads towards the earth and is blown up but the nuclear fallout ends up mutating all bug and animal life which puts humans at the bottom of the food chain. Joel (O'Brien) discovers that his girlfriend is alive and 85 miles away. So he leaves his colony and makes the trek there fighting monsters and befriending a dog along the way. The movie feels very refreshing in its subject matter and execution. It's got charm, style and a charasmatic, engaging leading man. Although I never fully bought into the romance I loved the live action \"Manga\" feel of the material. It's fun, energetic and feels very much like something new.****/5\nEric: ***.75/5",
    "42": "I loved this movie, and if you like cool monsters designs and comedy Zombieland style you will love this movie too, the main character is funny and rest of the cast played their roles really well, the movie takes turns that you don't expect and is overrall awesome.",
    "43": "For a streaming movie standard, its actually amazing. Amazing cgi with amazing casts and outstanding sound effects. Im so into this world building aspects. Big fan of the adventure and action aspect of this movie. Hate the comedy aspect of it, made the movie felt corny sometimes. Highly recommended.",
    "44": "A great movie with heart and clean humor. Something that's been missing from current day movies. I hope the people involved keep getting to make great things.",
    "45": "Another boring Hollywood young adult movie, this time with an Australian feel to it. Once again there's an apocalypse with future humanity hiding out in underground bunkers while giant insects and creatures rampage above ground. Our good looking but ultimately hollow hero goes above ground for a week and has to survive. Seasoned actors like Michael Rooker and Jessica Henwick can bring nothing to two-dimensional roles, while the monsters only occasionally recall the charm of a vintage Harryhausen. A cute dog is present here but that's about all it has going for it.",
    "46": "Honestly! What more could you want from a good old fashioned, mildly scary, family adventure movie?! It certainly ticked all my boxes: comedy, romance, sci-fi, post-apocalyptic fantasy, and there's an amazing dog! It left me really looking forward to seeing more of the characters' adventures!",
    "47": "Kind of almost familyfriendly scifi action, postapocalyptic story about the superbugs overtaking planet earth, dividing two lifes appart, leaving them seperated for 7 years, till the hamradio starts queking and our main hears that beloved voice of hers, and then the journey towards love and sunsets by the beach start, having to conquer super maggots, crabs and leaches from fairfield to point reyes, though vaccaville wouldve been easier..its an adventure, its not badly made technically but the story and some of acting are cringeworthy, and the plotspeed slow, but if you can endure one presidents 2 hours massmeetings, than you may be able to stand this out too.its full of colour, visual and sound effects, it has some superman riddles over it but its an okay enough watch to start your weekend with. a 7 from the grumpy old man.",
    "48": "I'm so confused as to how this film is getting 9/10 and 10/10 ratings? Surely a true masterpiece like Shawshank Redemption or Inception should be getting that kind of rating.. not a film that's mediocre like this. I feel like they were trying to go for a Zombieland vibe, but Zombieland is on a completely other level with great humour and character development, this film has awful humour and doesn't make you feel any emotion towards the characters, the only character I was rooting for was the dog! Basically it's just an easy watch, ok for a Sunday afternoon or just as something to sling on when you can't find anything decent to put on. I'm not saying it's awful, I'm just saying it's not great, it's nothing special, it's just... ok.",
    "49": "Its a great movie. So fun and entertaining. Joel is not your typical action hero, He's more like us (and everyday man). But his development throughout the movie is great. One of Dylan's most enjoyable and fun movies. I loved it",
    "50": "Yeah it's all been done before, the unexpected hero, the unexpected tutors. But it just works. It doesn't take itself too serious but the message is. Your life stops when you let fear take over. There will always be monsters out there. Just go out, suffer, learn and be a better person.",
    "51": "Love and Monsters is a strangely lighthearted post-apocalyptic story. And while the premise makes it sound like a low-budget TV movie, I was quite impressed with the visual effects and the overall production quality. Dylan O'Brien is a highly relatable protagonist, and this quirky creature flick had more heart than I expected. I think more people should know about this film.",
    "52": "I have no idea what I just saw.\nIs this supposed to be funny ? A bit scary maybe ?\nI guess it's a movie for kids but it's absurd and vague. I didn't care for any of these characters.",
    "53": "An annoying lead character shares a bunker with a load of unlikeable people. I couldn't wait for the so called monsters to eat the lot of them.",
    "54": "I've always loved a good monster movie. Be it a huge Godzilla or Tremors from underground or underwater horrors like jaws or crawl. It's should pass these thresholds, decent acting, must have heart, decent CGI and sound design and likeable characters. This movie qualifies all.It was a surprise to see Dylan and Jessica pair up, although they have less screen time, they both are good. Michael Rooker and young Ariana are a delightful pair to watch. Although I wish they tagged along longer. But probably the highlight of this whole movie is Boy, the dog. He shines in every frame he is in. It was wise choice on writers part to have the protagonist and dog tag along. We don't see much of that these days.The action is cool. Sometimes the story comes to a halt but it's okay. All in all a great entertainer worth watching couple of times. Go for it.",
    "55": "A well made movie with a clever take on the post apocalyptic world where all creatures on Earth grow incredibly large (except humans and a dog!). A fun movie with a good plot and fine acting. Definite thumbs up.",
    "56": "What an awesome movie I loved every minute of it.\nI don't want to spoil anything but if you like the journey movies you will love this.",
    "57": "The beginning was kinda boring for me, but all changed with the appearance of the dog!)After that the film became so much more dynamic ,kind and funny! Overall ,decent one time watch.",
    "58": "This is wonderful to watch.\nLove and Monsters is a feel good movie in the most absurd of circumstances. You wouldn't necessarily expect to find your heart swell and a multitude of laughs from a wasteland world full of giant monsters but hot damn, Matthews makes it happen. James Welch Henderson, Arkansas 01/02/2021",
    "59": "I get the high ratings this movie received as it's a well made and it's an entertaining movie. It's a light apocalyptic adventure movie, nothing to take too serious but certainly interesting to watch. The CGI's are well done and are the best part of the movie, it keeps your attention. To me it would have been even better with more different monsters. The plot is simple but effective. The cast is unknown to me but they all did a good job. It's a movie for everybody, that is if you're not too picky when it comes to realistic stories because this is all fantasy and will never happen, at least not in our lifetime. Good movie for this genre.",
    "60": "Looks great, with lovely effects. But not scary or particularly thrilling, it all felt too safe, no threat, and overly long. If you are 8/11, enjoy. Having said that, if you want a film to watch with your young niece or nephew, it will work well. I like many children's movies with an element for the adults, but I did not find it here. Not sure what was missing.",
    "61": "Haven't reviewed a movie in a long time (from what I remember), but I am here to thank the people behind this for a wonderful time my family and I had. I kept putting off watching this movie since we already missed it last Halloween and I wasn't in a hurry to check out a mildly interesting title. But I'm glad we finally watched it last weekend and all throughout we just kept saying \"this seems like a good movie.\" And it is! Only somewhat negative comment would be the appearance of creatures that are a bit out of place, but considering the premise (and the ride that this movie is!), it's easy to forgive.Highly enjoyable family movie. My youngest kid even said he liked the characters for not being stupid (as far as \"horror\" movies go). It's really refreshing, and the lesson in the end isn't something you've heard a thousand times. (Maybe less than a hundred at most!) ;) I can't compare this with any other film, but at least for the flavor, I'd put this up there with the MIB movies and maybe Ghostbusters. Great film!",
    "62": "It's just not a very good movie. The storyline is boring. You barely see any of the so called monsters. And when you do the SFX are horrible.And the bottom line is this: you just never really care about the kid looking for his girlfriend. He's not a sympathetic or likeable actor. In truth he's no even a good actor.",
    "63": "I was not expecting much from this film, though the plot is nothing ground breaking its all about the journey, with some good monster scenes, a decent leading character that is Joel. But yeah I was surprised that it did a good job of keeping me entertained.Just a really fun watch and a feel good film. Glad I gave it a chance I think others should too.",
    "64": "Don't believe the 7,8,9* reviews. This is a predictable, below average children's film, great if that's what your looking for but I was definately let down after seeing all the high scores.",
    "65": "I went in knowing very little about the premise and I was hooked from the first few minutes. I thought it would just be some fun, mildly entertaining comedy but it turned out a whole lot better than this; every 15 minutes of the movie it would add one more star to my rating! Most movies in that genre I like will end up being a 7/10 but everything is so well done to make you feel all the feels here that it easily earned an extra star. I find it very similar to Zombieland in all the right ways and I don't know why Love and Monsters is lesser known. If you're in the mood for some post apocalyptic action rom com with a cute puppy, I highly recommend it!",
    "66": "I wish I got to see this in the theaters. Let's hope they make a part 2 it was so good!",
    "67": "I need a sequel where they find Boy's missing red dress. That's all I care about. The dog needs to be reunited with his comfort blanket. In fact the dog needed more screen time so we could see his development & potentially witness him choosing his new companion over the memory of his old one, abandoning it & leaving the past behind so he could reconnect with his friend again in the future... I'm assuming that development happened off screen.However, at the same time, considering how much the piece of clothing meant to him (it's his last way of staying connected with his previous owner), I wish he'd still had it - as reassurance...Basically, we needed more dog. I loved the dog. Give me sequels with dogs. Just don't kill or harm ANY of them.",
    "68": "Following our protagonist through the dangerous wilderness was really good, I enjoyed it a lot, The movie disappoints you with not showing more of the protagonist's clan, whole Aimee plot was a good excuse to kick start the journey, but it really lacks the weight and depth, I felt nothing for this girl,\nI feel more happy to see Boy coming back but this was disappointing too, Because i was really hoping for our main protagonist to go look for him instead of Boy coming to him,\nI mean Boy was the reason why he learned to stood up and have confidence, but then he just left him in the jungle, for this boring subplot of Aimee,\ni am looking for a sequel but more monsters and adventures, and Love doesn't only mean to find a Girlfriend or boyfriend,",
    "69": "I went to this movie, sort of expecting another one of those typical \"post-apocalyptic teenage movies\", and sure, there is some of that here, mainly with the \"Love\" side of the title, but even with that, the movie surprised me a lot.The concept might be the best thing, even tho the \"reason\" for the animals to become giants is a bit... lazy, that aside, I found the concept fascinating, and I honestly, hadn't seen anything like it anywhere else. It's pretty scary, and from the jump, in an oddly fun way, we are set up in a pretty frightening but intriguing world, that afterwards, becomes a lot sadder when you realize what most of those characters had gone through. So, yeah, I found the world, and the story fascinating, and I thought they actually did a pretty good job on setting up stuff, and that paying off afterwards. Of course, there are a lot of mysteries still hanging in the air, like, what's up with the previous owner of Boy? Is she dead? Is there really a huge colony on the mountains? What's up in the rest of the world? I think you got the point, but still, the script is well written and I think it explores a bunch of the world and it's a nice and round tour to this world.After seen the movie I keep remembering and sort of comparing it to \"Chaos Walking\", I've seen it recently, and I also thought it had a great concept, but instead, they don't exactly explore the world around it that much, and at the end you feel like you could have gotten more, and maybe even should have, but here they have a great mix of having a focal point and exploring \"the\" journey (to a certain extend), but alongside it you are able to learn a lot about the world, and you feel as if you are really having a big picture view everywhere you go with Joel, the same probably can't be said for Chaos Walking, even tho I liked the movie overall, this one is much better imo and it reaches way more of its potential than the other.Dylan O'Brien is pretty good, he's really charismatic, and I liked him since Maze Runner, so it's awesome to see him again in another good lead of an apocalyptic story. You feel for him, you feel his evolution through the story, and his development is, kind of awesome and super well-crafted imo. The journey of realizing that he had the right people around him all the time, but also finding the courage he needed through this journey to save and probably give a better life to the ones he loves is pretty cool. His relationship with Boy is great as well.My biggest issue with the movie tho, might be the romantical part, like, from the jump I knew this thing wouldn't end well, and like, sure, I get it, and it was obvious that she would have had found someone during this 7 year, buuut, why the hell the kiss at the end tho? That was sort of a detriment to the whole point made earlier, and I get it, post-apocalyptic world, people are horny af probably, but idk, it felt sort of pointless to make a huge thing out of \"oh Joel, I found someone else and he died\" just to kiss him 15 minutes afterwards. That's probably the only part I felt could have been handled way better.Besides that, I loved his relationship with Clyde and Minnow, it's super cute, I liked that he discovers that, some of the animals are just... not a threat at all and there is probably a possibility of co-existing with them, and overall I just liked the little things they set up through the film, and brought back afterwards, like the poisoned fruit, the eyes stuff. Oh, well, I just hopped they trusted the audience a bit more and stopped, cutting back to a voice over or an actual flashback of something we... just heard or saw, we know guys, we are actually smart enough. Still the set ups are pretty good, even with that.Also, give me a sequel with more Michael Rooker in it, please. And also the girl, Arian Greenblatt is actually pretty awesome in this, I thought she was really good, did a great job for a young actor, and had great chemistry with Michael Rooker, you really bought that they were probably on that journey for a while already.So, to sum up, Love and Monsters is a really good movie, with an awesome, exciting and new concept, that keeps you engaged from the jump, with a good and charismatic lead you care for and roots for the entire time, with a lot of complex characters along the way, and a light of hope at the end of the tunnel, and well, a good learning experience about appreciating what you haver around you (oddly enough). The romance doesn't land as well as they probably hoped for, but still, I get why is there. All in all, it's a really good movie, worth checking out.",
    "70": "A light hearted take on the apocalypse with giant insects where a loveable loser goes on a journey for love. Quirky and silly with a few weird moments but it's mostly run of the mill with its plot and characters. Good special effects and acting, the emotional scenes make it drag a bit in the middle and the ending feels a bit rushed, but other than that, it's good harmless fun.",
    "71": "This movie isn't going to win any Oscars but it does it's thing well. It's about a likable guy trying to get through basically a monster apocalypse and re-unite with his girlfriend after being separated for 7 years when the disaster hit. It has good special effects and a dog, old man, and 13 year old girl that help him reach his goal. The love doesn't work out but overall it's a pretty enjoyable, quick watch.",
    "72": "This movies is actually really good and didn't get enough recognition or attention because of covid release. It of course has a silly over the top fictional premise but has really likable characters sweet moments comedy and of course the amazing performance of Dylan O'Brien! Especially if you like him as stiles in teen wolf, it's pure Dylan goodness and just a well executed story! Fun sweet funny and heartfelt.",
    "73": "Dylan did his part the best without any exaggeration and a scene with robot is emotionally well taken which reminds me of fallout game.rooker and ariana on the other hand nailed their roles.doggo named boy is lit with love and cuteness. its a pg13 movie so literally you can't expect kill cam it's a sure entertainer for kids and adults.\nThe only part which i felt odd is during the end how they kinda mushed just to get it done and gave it a ending which ain't deserved which questions arises love or leave..\nAll together it's a good movie and expecting a sequel.",
    "74": "And keeps watching it everyday. Am I being a bad parent? 🤔😂",
    "75": "Too many fake reviews. This movie is not that good (maybe for a 10 year old). The script is weak and predictable. It's funny sometimes, but feels too much like a copy of Zombieland. The characters are disposable, you don't stick to them (or don't have time to).",
    "76": "It's a rare event when a movie combines a great story with great special effects it seems that 1 is always lacking especially when monsters and special effects are included. This movie nails it and I mean on every aspect, acting, story, effects, direction, cinematography, and of course a great ending!! Its enjoyable for the whole family and it's a story that is great from the start to excellent ending. A sequel is definitely in order here not sure if this will be another casualty of this virus .I hope not cause its exactly what we need right now....HOPE!!!!!!! A HUGE thank you and BRAVO to the whole cast and crew it made our families day we are all smiling a lot more. A phenomenal movie can do that and did I mention its extremely entertaining!!!",
    "77": "The Good: Fun monsters + cute writing + an amazing dog + a generally likable protagonist + low stakes, doesn't take itself too seriously = good movie. Pokemon meets Zombieland meets Warm Bodies.The Bad: the writing can be a bit on the nose, and the movie is at its worst when it's at its most YA. O'Brien is fine, but he doesn't put much character into this, which might be intentional...but I feel like he's a mostly interchangeable protagonist.The Ugly: why couldn't he just stay with her? It's e the me like a very odd decision, given that she still needs his help and they were clearly rekindling?",
    "78": "There is a lot wrong with the dialogue. It makes me wish I had set up a web site called \"Things they SHOULD have said\".\nBut all in all, it's pretty good, and it ends well, without any major mistakes.\nMaybe except the huge things that moves faster underground than most things do under water. I mean, laws of nature? The hunt would be so energy consuming it would burn more calories than it would catch. If it was even possible to do for any thinkable creature, (that's why I don't like Dune).\nBut that's normal Hollywood (etc...) errors. Just make us scared, a stressed people is a good people... really?\nBut it's very entertaining and the actors do a great job. Graphix are awesome, not perfect, but awesome.\nSome good giggles. Some emotional moments.\nWell worth it for a 55 year old fantasy nerd :-)\nI feel it could have been more like a Disney movie, less fright and more love, but that's me.\nNot recommended for kids under 16 (I really mean under 30 hehe)\nEnjoy",
    "79": "How fun , entertaining, atypical ,and visual\nIt's delightful. I really like the main character and felt that overall he and the dog made this better than I found it to be . Was it groundbreaking? No . Was it cheesy ? Actually no it wasn't . It felt like I was reading a children's book in the best possible way.",
    "80": "The film is nothing special and we've seen this storyline done before but it still feels fresh and it's done well. It's a fun feel good kinda family film aimed more for teens and young adults but the older adults can still enjoy it.",
    "81": "It's about as sophisticated as a Twinkie. Oh look another glib protagonist guy who's nothing special but yet still saves the day.... zzz. It's well made but completely lacking in substance.The little girl who tags along with the generic dude and the guy from The Walking dead is quite amusing and steals every scene she's in but besides that and some of the cool creature effects this movie has nothing going for it.Again: all lot of \"smart\" voice over narration that lets you know how clever the lead character is and not much else. It's not a bad movie but really nothing special at all. Not worth paying any amount of money to see in theaters or rent. But if you're looking for a nice bland sci-fi movie thats free... you could do a lot worse than this. It's perfectly down the middle average.",
    "82": "I scored this movie on the high side considering it was a sleeper. Special effects were top notch even if the story was a bit predictable. There was never a dull moment and I found myself emotionally invested, literally standing up and yelling at the screen. That's a good thing in my book and so is this movie.",
    "83": "Having a main character tell the story with voiceover narration is the laziest filmmaking imaginable. Don't tell me the story, show it to me. If you're a screenwriter and you find yourself doing this, stop and remind yourself that I'm intelligent enough to infer the story without a main character explicitly telling it to me. Voiceover narration is the film equivalent of an information dump.",
    "84": "The main goals of story that doubt me. Turns out the journey were incredible. Character development went really smooth, not too much, still seeable. Side character are doing great for their role.Love to see the next movie. And much variety of monster will be a nice touch.",
    "85": "And this is it. Not expected in the least but very nice and a great surprise from the genre. The special effects are amazing quality.Ok to watch with the family too, what more could you ask?",
    "86": "A pretty fun movie start to end, I'd recommend it if your up for a few laughs and some good characters to follow along.",
    "87": "I can't hate him enoughPathetic characters like this are like deaf people in The Walking Dead. .......THEY DONT EXIST.Passive cowards do not live long in the fantasy, hypothetical world of post-apocalyptical existential threats. They only exist in the minds of writers, who lack sufficient imagination to stick with the core narrative.Screw him, I hope they all die",
    "88": "One of the most thoroughly enjoyable films of 2020, spectacularly well made, for dialog, performances, monster effects, scenery, audio, lighting, all are amazingly well done, leaving the viewer to be engrossed in the story.\nThe difference between this and major blockbuster monster films of the Kong and Godzilla style, is these characters are more real, and you feel the need for a sequel the moment the finale plays out.",
    "89": "In an apocalyptic near future a nebbish young man reluctantly faces sci-fi antagonists when he goes on a light comedic quest in which he learns about love and heroism. If this sounds a lot like the setup for Zombieland and similar movies that's because it is, although Love and Monsters has a more earnest and less overtly comedic tone. There's nothing particularly original here but it's well done, with likeable characters, a good pace and enough danger to keep things interesting. There are also some earnest heartfelt moments that are surprisingly effective. The monsters themselves look a bit cheap but this movie is a fun, rewarding adventure anyway. It's proof that script, direction and performances are way more important than an effects budget.",
    "90": "I actually thoroughly enjoyed this movie. I stumbled upon it accidentally and it turned out to be a good watch. Great performance all around and I love that it's not about a sappy romance but rather the bond of the family you create. It's weird before he goes on his journey he feels alone and left out but that map showed that his colony loved him no matter how useless he felt he was to them. He was everything to them. I do wonder if Aimee colony will make it though. I also don't blame her for moving on. Life is like that, people move on and realistically the chances that Joel was alive were slim to none. I also don't think she led him on. Through their radio conversations you could tell she was just going through the motions as she was stressed out as hell with the life she was living that she just wanted a reprieve from it all. A little glimpse of the past when all was a well. The little girl was cute though and with her little raspy voice she was funny as hell. All around a good movie.",
    "91": "This is a great post apocalyptic adventure comedy, similar to Zombieland mixed with Tremors and maybe a dash of April Apocalypse. It's nothing really new in that sense, but it's well made, the monsters are creative and the cast is strong.\nAfter the end of the world as we know it most survivors live underground in bunkers as the surface is overrun by giant bugs. Hunting parties go on scavengers missions for supplies while the weaket members stay home. But when a geek with no survival skills decides to go on a quest to find his true love",
    "92": "Best movie I've seen in awhile! It was super fun and entertaining. And funny. Similar to Zombie Land but even better! Great characters too. Especially Minnow and Boy! I hope they make more!",
    "93": "Great movie that was funny and moving and generally just a bloody good ride. Immensely enjoyed the great Australian landscapes.",
    "94": "Good movie to watch on a weekend night when it's cold or rainy outside or you're just stuck in quarantine. Interesting premise, pretty good creature cgi, a main character that becomes much more fleshed out as the movie progresses than he was at the beginning of the movie, lovely side characters and some pretty cool scenery. Straightforward plot with a few surprises and twists along the way, some cliches too. The acting and the screenplay were decent, nothing groundbreaking, but the movie is definitely worth a watch if you're bored!",
    "95": "Solid 7 movie. I cringed the entire time worried for \"Boy\". Format reminds me of Zombieland with the first person narrative and the quirky but cute main character. I enjoyed it.",
    "96": "I managed to suffer 15 minutes of this garbage. It's just nonsense, and boring.To compare this to \"Zombieland\" is like comparing \"The Godfather\" to \"Waterworld\".Netflix is again going for the pre-teen squad. If you're above 12, just skip this sh$t.",
    "97": "A light hearted and entertaining tale of a post apocalyptic world full of giant insects. Inventive and funny story of love, fear and humanity. Some great characters and special effects. Well worth a watch and a cut above your average monster movie.",
    "98": "What Can I say sbout the quality of todays childish immature CGI infested trash that's taken over the world? Well..\nThe movie Is dumb, It has no realism or sense of excitment or urgency. Action scenes are as all the rest. 'Childish, bad acting, boring to watch, empty and hollow In its way to tell a story. We have these huge bugs that dies with sn arrogant to the head or a bullet. In real life bugs still live after heads gets chopped off. Its so common In todays monster movies that all it takes is one arrow. The movie is not funny or comedic either, the childish love obsession story Is just so badly written. You dont care about If they live or die. So the movie fails with the funny part, snd the drama part? The monsters then? Is it worth your time? No.They could have had these huge bugs and made them way scarier and relentless. A much darker movie like the road, then having these mutant bugs as something to truly fear. The concept of such monster movie Is great. Instead we get to watch this cartoonish Cgi movie where centipedes die just breathing on them. I would give love and monsters a zero If it was possible. Because I turned it off towards the ending, I think. I dont care. Completely Lost interest. Why Is it so hard to make monster movies like they did In the 80s? Are directors that lazy today. If it isnt boring godzilla or kingkong for the 700th time. We get these type of movies.",
    "99": "This is a unique movie, it totally took common story lines and made them better, with great special effects to boot... but that is just surface treatment. The acting is very good, the story deeper than the obvious, and the dog needs extra treats.Movies are meant to entertain, as this does; they are meant to seem real, as this does; and in the end, you are supposed to feel like you have had an experience, which this does.",
    "100": "This feels like babies first apocalypse movie.\nEVERYTHING is a trope in this, but not in any kind of fun \"lets play with this trope\" way.If you're a YA, this movie might be passable, but only one where this is their first introduction to 'media'. NOTHING PRIOR!!! Including anything as technologically advanced as cave paintings. Might be too many tropes in those cave paintings.The plot is essentially: Young guy runs away from 'home' for 'love', and once he gets there, he realizes that young love was not what was important, but the journey here, the friends he's made along the way, and the 'family' back home that still love him.This movie feels like they copied Zombieland, removed the jokes, removed any clever bits, realized they had only 32% of a script left, photocopied a few pages to fill in the blanks and kind of slapped this together.The effects are fine. They dont look straight from a TV show, or from a DC movie.\nThats really the only positive I can add.Acting was weak. Story was bad. Love interest part was pointless. Main character should have been killed LONG ago in this world, as should the other colony.Re-watch Zombieland. Your night will be better for it.",
    "101": "This is a hidden gem hiding on Epix. This came out in the shambles that was 2020 and got completely overlooked much like every other piece of media that year. But don't sleep on it.It takes inspiration from some great films from the post-apocalyptic genre. From Zombieland to Monsters, it never feels like a ripoff of them but rather a loving homage to the films that inspired it. It never takes itself too seriously but it never takes that turn into cheese or becomes overly predictable.This is a good time. Highly recommended.",
    "102": "Wait for it to be $10 or less if you must...it will wait for you and still deliver its full measure of movie magic; but if you can safely swing the $20 purchase price currently being asked, I'd say pony up, because the makers of such a special presentation certainly have earned the right to earn their money back on this one, and in these weird days a risk deserves a reward, yes? This is a fun movie that will withstand many watchings, and will be a treasured part of your collection for many years to come...consider it an investment in joy that will pay dividends for as long as you remain able to find the Play button.\nRemember: the secret is in the eyes! (That will be explained once you've seen the movie...otherwise it probably just sounds very much like a non sequitur!)\nMFF/Honolulu 11-24-20",
    "103": "Bit of a surprise this one, I was expecting it to be pretty crap to be honest but as it turns out its not bad at all, well paced, well acted and better than your average end of the world rubbish that's out there. Don't get me wrong, it's no classic but there is enough going on, it has moments of humour and the characters are likeable enough - well worth a watch.",
    "104": "This is the story of a boy who is living among giant monsters. These monsters are ordinary insects and animals which are bigger because of chemicals. These chemicals are released by the human to prevent an asteroid from hitting planet earth. The boy loves a girl and after 7 years decides to leave his colony to find his love. He takes a dangerous adventure to meet his love again. The story is a genuinely nice one full of adventure genre elements. There is a wide variety of natural scenes in the movie. Special effects are awesome. I liked the background music and sound effects. The main actor Dylan O'Brian was awesome. In general, I recommend this movie to adventure genre fans.",
    "105": "Wasn't expecting much. Haven't seen too many good movies this year. But this is quite good. Good action and effects . Recommended",
    "106": "What a pleasant surprise! A fun and extremely well crafted monster movie with great (sometimes spectacular) CGI, great acting, and a stellar script. Perhaps the single best decision the creative minds behind this movie made was not making \"Boy\" the dog a CGI character.\nEvery single detail has been carefully considered from the storyline, character relationships, to the gorgeous Australian landscapes.\nSimply put, this movie is about Love and Monsters, but taking the journey with Joel and Boy offers the viewer so much more.\nYou'll watch it more than once.",
    "107": "What a wonderfully entertaining and fun film this is. Great writing, likeable characters, solid world building and no agenda apart from that of hope and a spirit of adventure.How refreshing to come across a well crafted gem like this. Reminds me a lot of How to Train Your Dragon in the mannerisms of the lead and the overall messaging.Light hearted and very enjoyable.",
    "108": "This movie seemed to be written with fun in mind. Great special effects, not overdone, tongue-in-cheek. Light hearted, yet with heart. And the dog. That really adds to the movie. The twist at the end is a good way to close-out.",
    "109": "The movie starts off a little slow, but the action quickly picks up. It will remind you a bit of Zombieland. The story does a good job of making you care about the characters and you see the progress the main protagonist makes through his journey. It's a great watch for a lazy evening.",
    "110": "The protagonist just won't shut up. Cringeworthy dialogue delivery. All attempts at humor fail, unoriginal story, boring. You can tell you've seen characters like that in other movies, except the dog.CGI was just good enough but the monsters were terribly underused. The events build up the tension, but they are quickly resolved without any effort, so no real moment of rejoice throughout the movie. They even tried to spice up the story by introducing a villain in the last half hour. Nothing special happens though.Better see something else, unless you are easily amused by generic teen-ish acting, bland characters and a plain story with couple of nice moments here and there. The dog was the only likeable character.",
    "111": "This was very enjoyable to watch. It was funny at times, sentimental at times, and fun. The CGI was actually pretty good. I actually enjoyed this movie and would say it's great for all ages.",
    "112": "So the bugs mutate but humans don't.\nNot one famous person in this movie.",
    "113": "Love and Monsters tries really hard to be Zombieland. But, it's Zombieland shoe-horned into a PG-13 rating, and custom-tailored for tweens. There are some decent chuckles to be had among the films overt attempts at building up inside jokes for call-backs, and there was a core to the plot that could have held up a much more substantial script than this flimsy one, even though it itself is a pretty old trope at this point. Among the other redeeming qualities is a pretty enjoyable performance by Michael Rooker, who manages to convey more depth of character with less screen time than any of the other cast members who had far more opportunity. I'm truly mind-boggled at the glowing reviews and ratings this film has gotten, because it's flaws seem quite obvious. Perhaps I'm just not the intended audience for this one...",
    "114": "The people who have this less than 8 are sad individuals. Sorry but this was really good. Well acted. The actors are well-known from other movies and TV shows so you know the acting is good people can't say it's not. The story is good friendly heartwarming. It's not a gory horror movie it's a family friendly movie. And very well worth the watch.",
    "115": "Went in to this not knowing what to expect and half asleep so I need to rewatch the first 20 minutes again, but this was a roller-coaster of a movie, I couldn't pin down what it was going for in terms of genre, was it a kids movie, was it a comedy, was it drama. Turns out it was just a little adventure down a line of \"what if\" and exceptionally well done and just peeking in to someone's life for a little while well they go on a life changing adventure.When it was over all I wanted to do was watch more, so great job, can't wait for a sequel or series spin off.",
    "116": "Love and Monsters is a flimsy lighter version of \"The Mist,\" done the right way.Over a longer period and through one perspective. It's well written, with realistic characterization and heart within the CGI surroundings. Well acted as well, Dylan O'Brien worthy of any leading role. Being family friendly perhaps holds it back a little, but the best film I've seen of 2020 thus far.",
    "117": "Love and Monsters is a fun, entertaining film with great effects and good character development from the main character in the film. The plot is engaging and was perfectly executed.",
    "118": "This is a light-hearted movie and it gives off really good vibes. Don't compare it to other apocalypse and zombie or monster movies because it is kinda different. It is also not predictable as you think, you are gonna be surprised especially in the last half hour ,it will go in a different direction in a very good way. Also it does carry a message and it is not just a pointless fun movie. It is suitable for kids and for family watch, it will be really good if you watch with your family in this quarantine, it will cheer you up and it is really suitable for this time in a good way. I really hope you give it a shot because you won't regret it. And of course who doesn't enjoy watching a movie with Dylan O'Brien in it.",
    "119": "Such a refreshing cinematic experience given the turmoil each of us has faced this past year. Dylan O'Brian is a vastly underrated actor at this point and the man may have a franchise on his hands. Michael Rooker has recently taken up the most infectiously interesting roles and really appears to have great things in store for the sci-fi genre.Joel Dawson starts his day like any other day ending with his girl friend, but this night they witness a gigantic asteroid careen to Earth causing catastrophic chemical fallout. The fallout quickly spreads resulting in every cold-blooded animal mutating into larger more dangerous creatures immediately making human survival above ground unfeasible and nearly impossible. Joel and his girlfriend Aimee are separated when the evacuations are in progress, in the escape both Joel and Aimee lose both of their parents forcing the two into separate factions underground or elsewhere to survive this monsterpocalypse. Seven years pass and the two still separated, the thought that Aimee may still be out there and alive is really what keeps Joel going and the pure driving force of his being. Joel is lonely and this feeling only compounds by the day as his fellow colony members are survived by each significant other. Messing around with the radio as Joel is known to do he finally gets in touch with Aimee only to learn she is doing fine and residing in a coastal colony of her own creation some 80 miles away. Falling for her again as if it was pre destined, Joel rides these emotions when he decides to set out on land to reach his lost love, monster-infested world be damned. If the very beginning of his journey he meets a enigmatic middle-aged man and a very young girl, the two save Joel on more than one occasion while showing Joel more love and comradely than he's ever experienced since the incident. Also providing Joel with vital knowledge and know-how on surviving in this new apocalyptic world and also helping him develop a sort of survival guide. With this vital new awareness, Joel very may well now have the juice to reach his goals.",
    "120": "Its been a long time since i saw a movie where the scriptwriter cared so much about his script. It remind me films from the 90's. clever plot twists, sentimental but not cheesy moments, metaphorical meanings and all this on a teenager monster movie!!!! well done.",
    "121": "\"Monster Problems\" has action, fantasy, comedy, survival and even love. It is a film for the whole family, but it manages to be quite tense, especially in action scenes involving monsters.The characters are excellent. Dylan O'Brien proves once again that he can be a one-man show, Michael Rooker is great as \"Michael Rooker survival samurai\"; and the dog is just fantastic. Other secondary characters also do not fail.The design of the creatures is perfect; and adorably scary. And the main theme of the film, which basically tells the story of a person leaving the suffocating comfort of his hiding place to find something that makes him happy, in the midst of a pandemic of monsters, I think it is something that will touch the sensitivity of many people that now live the dramas of self-isolation.It's the best post-apocalyptic film I've seen in a long time, a pleasant surprise that came out of nowhere, and I recommend it to everyone, even the cynics.I give this movie 8 stars out of 10.",
    "122": "Everyone involved in the making of this movie should be proud. Yes the plot is simple and it's been done many times in this genre and several others, like for instance The road, or The book of Eli or 28 days later... But in this case more like Zombieland if it was rated PG-13.\nDylan O'Brien plays Joel, a character much akin to Jesse Eisenberg's \"Columbus\", a kind of neurotic and unwilling protagonist out of his depth, who is rescued by Michael Rooker (playing Woody Harrelson's \"Tallahassee\") the grizzled survivalist with the adorable Minnow (Arianna Greenblatt playing Abigail Breslin's \"Little Rock\") in tow, whilst on a quest to find his love interest Aimee (the lovely Jessica Henwick playing Emma Stone's \"Wichita\")... Confusing?\nNot really. It's a post-apocalyptic road trip monster filled action love story movie that is a romp and a riot.\nIt's not often you get to see a movie where even it's weakest link is still holding strong... The dialogue is witty, the scenery is beautiful but appropriate, CGI game is strong most of the time, and cinematography crisp & clear, no lightening cuts and shaky camera. All the cast brought their A-game.\nHero and Dodge lent so much emotion to their joint portrayal of \"Boy\" the dog, they both must be very good boys... and Mavis the robot could almost pass the Turing test.\nYou may have to suspend belief a bit in a couple scenes... But just remember you are watching a movie with giant frogs and snails and it shouldn't be too difficult. For me it's a 7 but a strong one.",
    "123": "Right, well I had virtually no idea what I was getting into when I sat down to watch the 2020 movie \"Monster Problems\" (aka \"Love and Monsters\"). But I must admit that I was genuinely interested in the movie given the presentation of the poster.And now that I have seen the movie, I must just say: wow!\"Monster Problems\" was definitely a wonderful surprise of an entertaining and enjoyable movie. It turned out to be one of the more memorable and entertaining of movies that I have seen in 2020 - and I watch a lot of movies.The storyline told in \"Monster Problems\" was pretty straight forward, but it was at the same time a very interesting storyline that definitely appealed to me in many ways, especially since I have always enjoyed a good creature feature. And with the sheer size of the creatures in \"Monster Problems\", then I was in for quite the treat.Sure, you can say that the main plot was somewhat sappy and a bit on the simplistic side, perhaps appealing more to a younger romantically hazed audience. But the combination of the sappy romance, mixed with the action, suspense and monstrous creatures actually made for quite an enjoyable cocktail.Visually then I was without a doubt impressed with how \"Monster Problems\" turned out. The creature designs were just spectacular and they looked very realistic in the way they moved, behaved and appeared. So the CGI team definitely delivered some nice eye candy with this movie.The acting in the movie was good, and was definitely impressed with the performance of lead actor Dylan O'Brien. I was not familiar with him, but he was really great in this movie. I think it was a shame that Jessica Henwick and Michael Rooker weren't given more screen time, because they brought a lot of good things to the movie with their performances and their characters. And the dog Dodge (playing Boy), well he was just spectacular, what a well-trained dog, and it had such great on-camera presence.I can warmly recommend that you take the time and effort to sit down and watch \"Monster Problems\", because this movie was great. I was genuinely surprised and entertained with what writers Brian Duffield and Matthew Robinson managed to deliver.My rating of \"Monster Problems\" is a sure eight out of ten stars. This movie deserves a sequel, no question about it.",
    "124": "I didn't expect much going into this film. It seemed like a generic and cheesy film, which at times it was, but there is a surprising amount of fun to be had with Love and Monsters.Love and Monsters follows Joel Dawson, a man living in a monster apocalypse, who leaves his underground bunker to reunite with the girl he loves.The film has a great premise and I liked the overall self-aware tone the film had going for it. It went for a Zombieland type of humour which did create some funny moments even though there were times where the jokes weren't all that funny. There is a great sense of adventure with this film and the different people and creatures Joel encounters over his journey was fun and added to his eventual arc by the end. The CGI for the monsters themselves was actually very good. The design of the monsters were interesting and director Michael Matthews did a good job building tension during those scenes with the monsters. The third act does get messy. There had to something to make the finale exciting and complete Joel's character arc and the film introduces a few villainous characters that I found very underdeveloped and quickly thrown together. For a film that has a great idea for its world like this, I just wish there was more Love and Monsters did with its concept. It had neat ideas for its apocalyptic world but I wish it expanded on those ideas further.The performances are great. Dylan O'Brien suits the role very well and does a pretty good job with it. He's made to seem like a very likeable person and you want to root for him during his quest. Michael Rooker and Ariana Greenblatt were great and fun to watch. Jessica Henwick was also good.Love and Monsters is not an exceptional film but it's a fun and relaxing way to spend 1 hour 40 minutes.",
    "125": "I am not sure if anyone is enjoying my riffs or how much sense some of the funny things I come up with as summary lines are making - or even if some consider them funny at all. Having said all that, the movie is funny. But even that can be judged differently by differnt individuals. The CGI work is really well done and the story is well thought of.Of course every fun moment or any moment in general happening here can be taken and dissected. Even if it has so many wink wink moments - as in knowing what we expect and try to surprise us while also delivering on what we want to see. The story is predictable - but that does not stop this from being really entertaining from start to finish. Great actors round the whole thing up - actaully my first thought concerning a summary line was \"Maze Runner meets Iron Fist\" - ok so it may have been a stretch, especially because there is not really so much hand to hand combat here ... but would be relying more on the actors involved. Enjoyable to say the least! I wouldn't mind a sequel as well.",
    "126": "Cold-blooded creatures and insects have mutated and grown to monstrous sizes wiping out most of humanity. Joel Dawson (Dylan O'Brien) has been living in an underground bunker community for the last seven years. He's lonely after getting separated from his girlfriend Aimee (Jessica Henwick). He freezes in stressful situations and is not wanted in any confrontations with the monsters. He decides to head off on his own to Aimee's seaside community. Along the way, he befriended a dog named Boy, and two survivalists Clyde Dutton (Michael Rooker) and Minnow (Ariana Greenblatt).Dylan O'Brien is a charismatic enjoyable lead. The section with Rooker and Greenblatt is a fun winning adventure. That is the best of the movie. The rest is somewhat average at best. It starts with a questionable premise. There is a convoluted info dump leading to a questionable premise in the bunker. There are a few undercooked ingredients in the stew. Once he gets outside and joins others, it can literally breath fresh air. It leads to another problem in the movie. The middle works so well that the last act falls a bit flat. It's a letdown to finish the movie and then there is a ham-fisted suggestion for a sequel. It's a sour note to end on. Overall, Dylan is great, the middle is great, and the rest needs work.",
    "127": "First of all, when I first watched the official trailer of the movie, I really liked it and I was so hyped about that movie, because it was something \"new\". Eventually, it was as good as I had imagined! The plot of the movie was very interesting and kinda innovative, because there aren't many movies similar to this one (I think so...). The storyline was well-written and well-explained, even though it was kinda simple and easy to understand. The characters were very interesting, well-developed and kinda likeable. The filming location of the movie was nice, just a post apocalyptic world full of monsters and destroyed buildings. The casting was really good and their acting was descent. In my opinion, it wasn't a very funny movie, however it was very intense and action-filled. The monster's appearance was very well edited and they were kinda terrifying. The opening scene was definitely promising and I really enjoyed it. The 2nd and 3rd act were both adventurous and I really liked them. The ending scene was definitely predictable and there weren't any twists, but it's fine. Overall, \"Love and Monsters\" was an enjoyable adventure film that I would probably recommend it to my friends.",
    "128": "You would have been hard pressed to find many people early in 2020 saying how much they were looking forward to the sophomore feature from director Michael Matthews Love and Monsters, a mid-budget offering that was filmed in the picturesque surrounds of Australian's sunshine state Queensland, but in a year that has seen many high-profile offerings depart the release schedule in hope of clearer climates of late 2021, this unassuming and fun offering is easily one of the nicest little surprises of the year film wise.Starring one time next big thing Dylan O'Brien, who is still working his way back from a potentially life threatening injury he sustained whilst filming the last Maze Runner film, Monsters is a film that is familiar in many ways but inventive enough to keep things fresh and exciting, as O'Brien's softly spoken Joel sets out to reconnect with the love of his life Aimee in the dangerous surrounds of a threat filled apocalypse where giant snails or flesh hungry frogs await your every move.Always a naturally charismatic and likable on screen presence, O'Brien is perfectly suited to make us care for Joel with his character and the film itself feeling like a family friendly version of hit zombie comedy Zombieland as Joel's neurotic tendencies and awkward nature feeling very Jesse Eisenberg like and the film's voice over filled and colourfully over the top antics not dissimilar to the stylings and energy of the two walking dead filled hits.It's hugely impressive what Matthews manages to do with his creative world off what is no doubt a low-end budget for such a production and he and his creative team work some visual wonders into the final product that moulds together some scenic Australian surrounds with some great CGI/practical effects that are on par with much higher budgeted offerings that could learn a thing or too by Monsters innovative creativity.There's no doubt that Monsters won't leave anything of a lasting nature for viewers to remember too much more of once the credits roll and the films supporting cast that includes the always fun to be around Michael Rooker and rising stars Jessica Henwick and Ariana Greenblatt don't get much to do with limited screen time but that's not enough to stop this colorful adventure from being a fun and enjoyable ride.Final Say -A surprisingly pleasant cinematic treat, Love and Monsters may not appear on paper to be anything special but its creativity, craftsmanship and sense of fun will quickly win you over with hopes this may not be the last time we see Joel, his trusty pooch Boy and fellow offsiders on the big stage.3 1/2 underground cows out of 5.",
    "129": "5 out of 5 stars.Love and Monster is a fantasy post apocalyptic adventure film about Joel (Dylan O'Brien) who is surviving with a colony underground from a monster apocalypse. Which the film does give a brief introduction about how the monsters originated and mutated. Without giving away details. His girlfriend Aimee (Jessica Henwick) is in another colony 40 miles away. Which Joel plans to get up from underground to go on a journey to reunite with her. He comes across a dog. And two others Clyde (Michael Rooker) and Minnow (Ariana Greenblatt). Learning survival tips. And how to face his fears.It is an adventure coming of age kind of story. Its a bit fantasy. Action. Sci fi. And a little bit of a love story without getting too sappy into that genre. It is sure as a lot of fun. The script delivered making Joel as a lovable character who is a bit of a runt in his colony. Where he sticks out as the least productive person. While everyone is mastered in surviving and fighting monsters. Seeing him come up from underneath and clueless on where to go is a lot of fun. The direction plays a little like zombieland mixed with a little bit of a road apocalypse film like Mad max but in a family friendly version of it.The film does have some exciting action sequences with them escaping from monsters and fighting back. The visual effects are great. The music score was good. The film does have a climatic battle on the beach with a giant like crab of a monster.Dylan O'Brien did great playing the character. Adding emotional depth to his journey in reuniting with his love. After feeling isolated from losing his family. And being separated from Aimee. Michael Rooker and Ariana Greenblatt did good too. Jessica Henwick was also great playing in a brief role.It is a fun family adventure apocalypse film that delivers heart. Action. Adventure and a bit of humor.",
    "130": "Love and Monsters hits a few tropes along the way, but an endearing lead paired with a lovable canine sidekick and well-developed secondary characters makes this trek across a terror-filled terrain a really fun watch.Joel, a well-intentioned but poor survivalist, ventures out of his bunker-home of 7 years, to find his teenage love. Scraping through near-death experiences and connecting with generous survivors, along his journey he discovers and documents all the lessons of the surface and of himself.There is a lot of heart in Love and Monsters, helped immensely by the friendship to a good dog, but also by well-rounded characters able to establish themselves well in limited screen time. This applies especially to an excellent Rooker.The design of the monsters are great, leaving little to the imagination as quickly they are brought into the open, bright surroundings, rather than hiding them in the shadows. This sets the tone of the film, not one for creeping tension or terror, but sudden excitement in bouts of action.Fun plot, great cast and characters, and decent special effects to match.",
    "131": "This movie has managed to accomplish a mix of humour, romance, and adventure in a sci-fi plot, all in a great balance!This is a film that communicates a positive way of thinking under very bad circumstances, and uses the vehicle of humour for that, which is great.The monsters designs, the funny circumstances, and the acting is all top-notch (as well as the great VFX). The story is also very unique, with many clever and unexpected situations.Its annoying to see that people always rate low movies that include humour. This seriously needs to stop, movies like this are a fun to watch with family, they bring joy.The creators/writers of this movie knew exactly what they wanted, and the outcome is marvelous. I can't wait to see more from them.Once again, a sci-fi movie is underrated just because it does not fit the status-quo of science fiction stories of the time.",
    "132": "At this writing the movie is averaging a 6.9 rating. That feels almost right.I liked it. The tongue in cheek narrative, the dog, ALL of the key supporting cast make this a lot of fun. Some of the effects are borderline, but honestly, that isn't what this movie is about. O' Brien is very good in this, and makes the most of the script, playing it with just enough heart but not taking himself too seriously.The supporting cast is strong: Michael Rooker as an apocalyptic nomadic expert, Ariana Greenblatt as Rooker's young charge, and Jessica Henwick (Iron Fist) as Joel's lost love.Bummer that this came out in the pandemic and not many people found it. Because of that we'll never see a sequel, that I would totally watch.Small plot issues aside, there's really only one big \"AYKM\". It's very hard to believe Joel (our plucky hero) wouldn't ask his romantic muse if she still felt anything for him over the course of several radio conversations. Without that HUGE leap of faith on his part there's no story, no tension and no movie.But fortunately, following in the steps of the original Die Hard, Joel's a regular guy dumped into very unusual circumstances and through luck, improving skills, and the kindness of others, manages not to die. And find the girl, while also discovering himself and his place in the world.Give it a shot.",
    "133": "IN A NUTSHELL:\nDirected by Michael Matthews, this fun comedy Paramount Pictures is a non-stop adventure that is actually playing in theaters now, as well as on Amazon. It's super funny and family-friendly for all ages. Surprisingly, 2020 has given us several new movies for the Halloween season, but this one is the best by far, in my opinion. It's not really a Halloween movie, but there are some monsters.I was thoroughly entertained by this hero's journey movie. Plus, it offers tips that might actually be helpful if things continue to go wrong in 2021. ha ha\nI know a movie is good when I can't wait to watch it again and that's how I felt after watching this movie!TIPS FOR PARENTS:\nLots of kissing and couples cuddling.\nSome profanity, sometimes by a little girl.\nPeople in perilous situations.\nThere are lots of dangerous creatures, but young kids probably won't be too scared. They're mostly giant, mutated insects.\nSome violence.\nPeople get drunk.THEMES:\nCouples, relationships, love\nCourage\nFriendship, unity\nHope\nApocalypseTHINGS I LIKED:\nDylan O'Brien does a great job as the protagonist in the story who is a \"noble warrior floating on the wings of love\" as Michael Rooker's character describes him. He has perfect comedic timing, can do action, and brings on the feels. He's charming and inspiring and extremely effective in this role. Throw in a dog for his companion and you really want to root for him. There is satisfying character growth. He got his start in Teen Wolf but I didn't see him until The Internship and then his breakaway role in The Maze Runner.\nThe exposition at the beginning of the movie is pithy and helpful to understand the conditions of the new, dystopian world. There's a lot of exposition, but it didn't bother me too much since we need the information to better understand certain scenes.\nYou get to see a lot of fun and creative monsters.\nThe protagonist/narrator says a lot of amusing things.\nThe conversation with Mav1s was entertaining and touching. Melanie Zanetti voiced Mav1s and Kala. Cool magical sky jellies.\nIf you love Guardians of the Galaxy (Theatrical) as I do, you'll get a kick out of seeing Michael Rooker, who played Yondu. He's perfect in his role and is so likeable.\nAriana Greenblatt was pretty doggone adorable.\nGreat musical score by Marco Beltrami and Marcus Trumpp.\nThere is a little bit of back and forth in time, but viewers won't be confused.\nI laughed at Joel's reaction when he first saw the Australian stud-muffin.\nSome beautiful cinematography by Lachlan Milne.\nThe adventure is non-stop and super entertaining.\nGreat CGI and practical effects.\nFor a minute or so, I thought one of the Hemsworth brothers was in the movie. ha haTHINGS I DIDN'T LIKE:\nThere was a part of the story that was completely left as a missed opportunity. The dog named \"Boy\" always held on to a red dress. I thought for sure Joel would find the owner of the dress and that she would be his true love, like Tom Hanks in the movie Cast Away That would have been sweet, right? Instead, we never learn anything about the owner of that red dress, so it's just assumed she was eaten by monsters.\nThere are some missing details, but none of them are super important.You can see the rest of my review on my Movie Review Mom YouTube channel!",
    "134": "In this version of Earth, everyday animals have mutated into giant beasts. Monsters have been done time and time again so poor design or bad CGI could have easily tripped up Love and Monsters but I think the creature work is solid and the action with them is capably done. None of the effects ever seemed shoddy or below par and despite the environment being very much your average post-apocalypse dystopia, these designs added some flavour and the action suitably raised the stakes and got you to care for our main character Joel.Speaking of our protagonist, in the lead, we have Dylan O'Brien who's most remembered work is his inclusion in the Maze Runner trilogy. He's always been likeable, I never though he'd be the next big thing but he gets the job done in whatever he's in. This was something completely different, he showcases some great comedic timing and his performance wasn't just workmanlike, it was pitch perfect. He still looks enough like a normal guy that you can appreciate him being a wimp and parodying the action star persona. He's the only person on screen a lot of the time but the movie does feature solid work from Michael Rooker, Jessica Henwick and Ariana Greenblatt. They all have funny moments and add to Joel's journey whether he's fighting a giant frog or reconnecting with his long lost girlfriend.The main attraction for me in this movie was the finely tuned comedic narration coming from Joel and the jokes that pepper the movie throughout. Joel is aware of how pathetic he is and despite him being a hopeless romantic, he otherwise has a good grasp on the situation. He pokes fun at himself and how bleak things are continuously but these self-depreciating moments help humanize him. Joel is that secretly snarky friend we all have who has some wise crack to cover up his own inadequacy even though its obvious how helpless he really is. I was cackling throughout Love and Monsters and I have to congratulate the writers for doing such a stand-up job.I don't have a lot of notes for Love and Monsters or much to complain about. I don't like to nitpick but I make an effort to take the bad with the good, even with movies I adore. While the ending is still satisfying and has enough of a punch to justify the time you've invested, there are moments where it borders on being corny or too conventional. The rest of the movie has such a wild creative spark (I echo the comparisons that critics made to Zombieland) and while I was hoping it would keep it up, I can forgive a couple of off notes when the rest feels like a finely constructed symphony.When Love and Monsters wrapped up, I realized that I didn't just like it, I loved it. I haven't laughed this much or this hard in a movie for at least a couple of years, I thought it was an adaptation of a book instead of an original script. If it were a YA adaptation, it would have been the best one I've seen since Harry Potter franchise. But other than the ending being really good instead of great, every part of Love and Monsters is fun, charming and fantastic overall. I wholeheartedly recommend Love and Monsters, its surprisingly family friendly for a post apocalyptic adventure and other than little kids (who may be scared), I think everyone else at least has the potential to get something out of it. If there's a possibility for a sequel (on a side note, who knows about profitability anymore? With how the theatre distribution model has been affected is any movie making money?) I would love to see it. If you get a chance, check this movie out!",
    "135": "Narration is pretty good, people usually still complain. Pretty good apocalypse origin story, not the most original but felt decently thought out and sensible. Despite being dystopian it's still pretty upbeat and colorful especially since we see it from a blissfully optimistic guy's point of view, so not bleak. The story of the movie itself, and the main character are more unique for a movie like this.I think the best part is that the lead is a lovable character, so through all the danger you root for him. And why wouldn't you root for someone searching their lost love in an apocalyptic world, willing to die for it. Love, adventure and danger in a post apocalyptic world, I was definitely the target audience for this. Might not be for everyone, but the movie achieves what it was trying to.World building and it's creatures are great, pretty feasible since they're already based on animals already known and graphics were good. Desolate environment but everything's colorfully shot. The supporting characters were also really great, especially the ones met on the journey, felt like video game characters who all served purpose and each had a story of their own for you to emphasize with, something to learn from. They aren't just extra characters plot additions and have wonderful chemistry.I'd say the story is predictable at the end, the twist and how the encounter is gonna go, but the journey there was fun, and by the time you get there you're invested in the main character's arc, at least I was, so it was moving. The story of the movie is pretty simple and easy to follow; less complex more heartfelt.Not the best thing you'll ever see but the movie's pretty good, I'm surprised the ratings not higher and I didn't hear about it more. I think the title is a deterrent to some. Definitely want to see more. It might be a monster adventure dystopic, but it was a love story to me and I loved it. It feels like a James Gunn project, someone said it's the best romantic apocalypse movie, I want to disagree just because \"Seeking a friend for the end of the world\" is my favorite movie, still is but I can love both. Could've been darker, or more chaotic, more comedic or more drama driven, but I think it found a sweet spot right in the middle and I love it.I know I gave it 3½ stars but in my heart I love it like a 5/5.",
    "136": "There are elements of Tremors, A Quiet Place and Zombieland in Love and Monsters.After some missiles were launched in an attempt to shoot down an asteroid. Insects mutated to giant size creatures and started to attack humans. Cities were destroyed and humans moved into various colonies to survive.Joel Dawson (Dylan O'Brien) is the good natured but geeky cook living in an underground bunker for the last seven years. Where others have paired up, he his on his own. His parents died when the creatures attacked and he also got separated from his girlfriend Aimee (Jessica Henwick.)When Joel reconnects with Aimee by radio he decides to seek her out but she lives in a seaside community 80 miles away and it is a treacherous journey to get there as the creatures still roam. The problem for Joel is that he freezes in the face of danger and he also seems not to have considered whether pretty Aimee had someone else in the intervening years.The chances are low that Joel will be successful in his quest. The people in his bunker advise against him leaving. On his journey Joel befriends a dog and meets two survivalists Clyde Dutton (Michael Rooker) and a young girl Minnow (Ariana Greenblatt.) Clyde gives Joel some survival tips which gains him some confidence.The movie is a humorous underdog story told with some charm. O'Brien is likeable as the flawed hero. The third act involving an Australian sea captain with plans to rescue Aimee's community was a tacked on misfire.",
    "137": "Love and Monsters is a real charmer, surprisingly really capable of balancing it's multiple tones, switching between being funny, heartfelt and genuinely tense. It's also light on its feet and actually manages to put a fresh spin on the post apocalypse with a world that feels modest in scale.Dylan O'Brien is terrific here, this a really strong example of what he's capable off when given the leading role. He's charming and vulnerable with boundless energy and he's also pretty incredible at looking terrified when coming face with these giant insects which really helps the tension feel palpable.Michael Matthews does a fantastic job blending the already impressive CG and practical to make everything feel tangible but not excessively grand or weightless in a way that undoubtedly looks a lot more expensive than it was. The music by Marco Beltrami is equally strong at being tense and triumphant.",
    "138": "In a world where monsters rule and humans go into hiding, a guy named Joel(Dylan O' Brien) is tired of feeling like odd man out of his group, decides to venture out to find a long lost love(Jessica Henwick, Iron fist), the problem is that Joel does not have any skills to survive, but the question is will he?A funny entertaining satire on such films like Reign of Fire(2002) and A Boy and His Dog(1975). But the humor never goes to deep in like parody mode. Dylan O' Brien is amusing and quite humorous has Joel, kind of spoofing his Maze Runner character. Jessica Henwick is also good. And the monster effects are also pretty good also. Lets not forget Michael Rooker in a cameo.",
    "139": "What a surprise! This is one of the best new movies that I have seen in recent memory. Dylan O'Brien is quickly becoming one of my favorite actors to watch. His performance is incredibly charismatic and the growth of his character is inspiring.At its core, the story is straightforward and realistic, even though it's a post-apocalyptic journey. Every relationship in this film has substance and charm. Unlike another film in the same genre (\"Cloverfield\"), I actually cared about what happened to each character. I wanted Joel to succeed, I wanted him to find love and confidence along the way. Though it's quirky and unconventional at times, there is true emotion felt throughout.\"Love and Monsters\" is a comfort film. I never thought that I would say that about a movie where 95% of the population is dead, but it's true. This film has so much heart and was truly a joy to watch. I will recommend this movie to anyone and everyone.Additional note: The scene with MAV1S made me cry. Pixar level heartstring pulling.Favorite Quote: \"Good instincts are earned by making mistakes. If you're lucky enough to survive a few mistakes, you're gonna do all right out here.\"",
    "140": "Here's The Lowedown on \"Love and Monsters\" (PG-13 - 2020 - Blu)Genre: Comedy/Monster\nMy Score: 7.6Cast=5 Acting=7 Plot=8 Ending=9 Story=8\nFunny=8 Chemistry=8 Script=7 Monster=10 Gore=6In a monster-infested world, Joel learns his girlfriend is just 85 miles away. To make the dangerous journey, Joel discovers his inner hero to be with the girl of his dreams.\"Good instincts are earned by making mistakes.\" I really enjoyed this...definite Zombieland vibes in this film with Dylan O'Brian and the nerdy lead and Michael Rooker as the jerk that becomes the friend. The detail on the monsters is what sets it apart from other movies...Guillermo Del Toro would be pleased I think. This is definitely worth a watch for fans of the genre.",
    "141": "I really wanted to give this a 7/10, but it wasn't quite there.It had all the pieces of the puzzle but it didn't quite flesh things out.The relationships between the dog and the survivors felt rushed, but only needed an extra scene or a couple of lines of dialogue to help it along.The world didn't seem dangerous enough for a rookie like him. Compare it to skull Island where you can understand that everything is out to get you. Don't forget in this world 95% of the world's population has been wiped out by 'the event'...that puts it up there with the world of I Am Legend, which was clearly very dangerous.It lost some of the energy of the opening act quite quickly.Although there was some really touching moments (the dog dress and robot) it never really lit the fuse for me.I would still recommend a watch, but I couldn't rate it a 7, which in my book earns a Blue Ray purchase and rewatch.Thank you kindly.",
    "142": "There is much to like in this movie: the premise is original, there's lots of action with spectacular and creative monsters thanks to top notch CGI, and there is of course Dylan O'Brien, more or less reprising his Teen Wolf characterization of an endearing, clumsy hero-in-spite-of himself. O'Brien keeps amazing me with the different personalities that he very convincingly can produce, like in American Assassin or in the episode of Amazing Stories, where I almost had to look twice to even recognize the Stiles Stilinski that I've come to love.On the other hand, the story that was made out of the premise is pretty one-dimensional: for three-quarter of the movie we just watch O'Brien running through meadows, swamps and forests, avoiding or fighting all kind of monsters. It's only when he reaches the other colony, that something of a real intrigue evolves. And I didn't care much for the voice-over, it's functional in the first 10 minutes to explain how we got to where the movie starts from, but during the rest of the movie I found it mostly annoying, thanks to all the wise-cracking and supposed jokes. Unnecessary, since the movie and O'Brien in itself were funny enough.I would say: not really leaving any lasting impression, but great entertainment for a rainy afternoon.",
    "143": "Love and Monsters (2020) is a movie my daughter and I recently watched together on our flight to Florida (it was playing on the plane). The storyline takes place in a world that has been taken over by monsters and pockets of survivors exist. Everyone has a role within each group of survivors. The cook at one camp discovers his girlfriend from when the world was normal is still alive and sets out in a adventure to join her against the advice of group. Can he make it across the land of monsters to his girlfriend? This movie is directed by Michael Matthews (Five Fingers for Marseilles) and stars Dylan OBrien (Teen Wolf), Michael Rooker (Henry: Portrait of a Serial Killer), Jessica Henwick (Game of Thrones) and Dan Ewing (Chasing Coments). This storyline was pretty entertaining and did a great job of not taking itself too seriously. The script is very well written and there's some great lines and conversations. Michael Rooker and the little girl were easily my favorite two characters. The monsters were very well done and I enjoyed the special effects. The ending was also realistic instead of the natural happy ending. Loved the setup for more films, which my daughter and I will surely catch. Overall I'd strongly recommend seeing this as the production value is very good. I'd score this a solid 7.5/10.",
    "144": "This is easily one of the most apt films to watch these days. Although Love and Monsters is set in a post-apocalyptic world, relating to it and the characters' emotions becomes much easier given the ongoing global crisis. And that is why I believe this is just the right time to watch it, along with some beverages and a tub of popcorn.Dylan O'Brien: what a talented actor he is! He might not have the looks of a battle-hardened action hero but surely captures the heart of one with his fantastic performance and dialogue delivery. His expressions in a scene where he hides from a particular monster were just so spot-on that I forgot I was watching a movie! Jessica Henwick, Ariana Greenblatt and Michael Rooker have comparatively shorter screen presence than O'Brien, but are impressive whenever seen.The film is an exciting action-adventure with lots of heart and humor to make it a fun watch with the family, despite the PG-13 rating due to its violent action and occasional but not excessive profanity. The special effects, for which it has even earned an Oscar nomination, are splendid and feel nothing like computer generated, to start with. That's some fantastic work for a film like this. The action sequences are a big draw, and are executed with finesse. The story has a lot of important life lessons to offer, and while the humor is served in plenty, the drama is also present in just a good amount to balance the overall tone.Love and Monsters ends up feeling pretty realistic due to the human themes resonating and moving viewers from time to time. It's overall a pretty inspiring story of a man on a mission. I could identify with the protagonist Joel and wondered if I too could go that far for a loved one in reality, but the film answered that and many other questions so well that I don't even have to doubt I would. This was a really fun film, and by the time the credits started rolling, I was already wanting a sequel. If that alone doesn't prove how much I liked it, I don't know what else would.",
    "145": "After a much delayed release the film Love and Monsters made its way to Netflix yesterday and I watched it today and here is my review for it. The premise of the film sees a young man in the apocalypse as he tries to travel for 7 days to find his Girlfriend, in a world that has become infested with monsters.Main Character\nDylan O'Brien plays the lead here and he does a really good job. He is just such a likeable character and one that is easy to root for, it makes the audience really want to see him succeed in his quest. He is funny and charming and just a really good lead character for this film.Supporting Characters\nJessica Henwick plays his girlfriend and when she is on screen she gives a good performance. Obviously, due to the narrative we don't spend too much time with her but when we do you really see the chemistry that her and O'Brien have and it raises up this pretty simple quest for love story. Michael Rooker is here as a survivor and he is great, he is just the perfect person to play his role and the scenes with him are some of the best of the film, it's just a bit of shame they didn't do more with him and Ariana Greenblatt's characters as they were highlights of the film for sure. I mean there is even a cool dog called Boy that joins them on their journey and plenty of time is given to show the bond between him and O'Brien and it is done really well.Story\nThe story is interesting, I like the lore and backstory as to how the world went to hell and led to monsters being everywhere. There is also no denying that it is fun seeing O'Brien having to travel outside for the first time where he is pretty useless at just about everything. But, I would say this works for the first two acts and then falls flat in its last act. It's like the writers wrote the film chronologically and weren't exactly sure how the film should end so they ended up with this strange last act of the film that doesn't quite mesh with the other elements put on screen.Script\nThe script is actually pretty good, this film is pretty funny and had me laughing quite a lot which considering it isn't a straight up comedy deserves some big credit. Also the film has some nice amount of heart, not all of it works but it is handled well enough. But as I said above I just can't get over the writing for the last act and how it feels very different to the other parts of the film and not in a particularly positive way.Style\nThe style of the film looks great, the visuals are really good with the world being shown to be very luscious and beautiful despite all the bad that has happened. Also the creature designs all hold up and the CGI for them is all of a good quality. But the pacing for the film at times is a little off and yes I am mostly talking about the last 20/30 mins. Which makes the film drag and maybe something more creative and keeping with the first two acts would have been better received by me.Overall\nOverall, Love and Monsters was a big surprise for me and I ended up thinking that this is a good film. If you have 2 hours then I would say give this film a chance and with a pretty open ended ending there is chance for a new franchise to be made here.Rating - 7/10.",
    "146": "There is something old school with this one despite the young cast. Something that has been filtered through time with wisdom. Much, much better than those recent zombie survival franchises and hyped-up coming of age legends.There is modesty to the characters, love and compassion embedded genuinely into the sci-fi story that plays into the tunes of natural chaos rather than leaning on calculated efforts of some cliché mastermind villain.A young man on a quest for love and self-respect who finds a dog on the road. Simply great!Could it have been better? Probably yes, as anything can be overstudied to perfection.But the magical quality I find with this film is that it delivers all of which it intends to, without forcing and exploiting its power points.This is the great '80s movie that was never made. The one you will be watching for the very first time, with successful CGI of the 2020s.It's decent, virtuous, likable, creative and heartwarming.",
    "147": "Well maybe not everyone... i think many people will find this film a bit to cutesie and adorable but if thats your thing then you came to the right place.Its a monster flick with heart, the end of the world is bad but people have managed to keep their humanity.The hapless hero goes from one colony to another to get to the.girl he left behind. A 7 day trip where he meets new friends and Allies all the while in danger from monsters.Overall its a nice film and good for familys and a younger audience without being overly violent or gory.The CGI is average it does the job but barely. The lead actor was likeable and nice to watch. All the secondary characters were decent.There is a dog companion as well which adds a really nice dynamic.Worth a watch but don't go expecting a hardened monster film nor a film that is steeped within reality.Its a family B movie but done well.7/10.",
    "148": "This is a really sweet, funny, and charming movie. A young man, Joel, survives an apocalyptic event that turns insects and certain other creatures (ants, frogs, crabs, etc) into gigantic monsters. Survivors live in colonies underground. In his colony, Joel is designated as the cook, as he freezes up in tense situations and is useless on hunting parties. When Joel finds out his former girlfriend, Aimee, is alive in another colony 85 miles away, he decides to trek across open country to reunite with her. Along the way, he picks up a canine friend, Boy, and meets an older man (the always reliable Michael Rooker) and a young girl, who teach him how to survive.The budget is small, the special effects are bargain basement, but the movie has a heart that is missing from most movies. It is well written and directed and a cast of basic unknowns do a great job.Every character is imbued with humanity and Joel's physical and emotional journey are well acted by Dylan O'Brien. His girlfriend, portrayed by Jessica Henwick, is resourceful, determined and compassionate.This is how movies should be made. They made it for $30m and you can see where they cut corners with the effects. Still, you don't need to spend $300m to make an entertaining movie. While it only made back $1.1m, COVID had a lot to do with that. I hope they make a sequel, preferably on a streaming platform. I'd like to see how Joel and Aimee fare in the future.",
    "149": "Pros:The Visuals - The standout from the film for me, apart from the dog, was the amazing VFX work. The world is simple but beautiful, the monsters are formed from everyday creatures but look very menacing and well thought through. There's no wonder it got nominated for an Oscar for the Visual Effects category.The Characters - Dylan O'Brien was a pleasant surprise as lead character, Joel. He brought good humour and tension. And the dog, boy, who is his companion is amazing. Very likeable.Mix of Genre's - I thought the film balanced well a variety of different genres including Horror/Thriller, Action/Adventure and Romance. Nicely doneCons:Predictable and Overacted - Various scenes were extremely cliche and exaggerated from the writing. And like most of these films, you can just tell where it's going. Which for me is a little annoying.Nothing Special - It's a film that, although it's well done, has been done before many times. Nothing truly groundbreaking.Overall, Love and Monsters was a decent film that had its good and bad moments. The visuals were superb but poor writing and cliche plot points meant it was nothing out of the blue. But an enjoyable adventure film.Quote - 'We're Monster killers' - JoelRating - 2.5/5."
}