{
    "0": "Having read the first few Harry Potter books before 2001 and hearing about the hype for the first movie, I was excited. I heard there was going to be an all-British cast (which makes sense, right?) and we'd get to see a live version of one of the defining novels of our generation. From what I remember I went with my family and a family friend to see the movie the day after Christmas and was pleasantly amazed. After the movie was over, I watched the credits and discovered some familiar names (the late Alan Rickman, Sister Act's Maggie Smith, James Bond 007's Robbie Coltrane, and Star Wars' Warwick Davis); others not so familiar (the kids, some of whom had their debut). But it was a good movie and was a party of colors and sights for all to see. This is easily my favorite of all the Harry Potter films. The catalyst of the movie series!",
    "1": "Like a lot of others, I refused to watch this film when it was originally released, thinking it was going to be another movie for kids, loosely taken from the source. Was I ever wrong? J.K. Rowling's novel was brilliantly taken from book to screen. The acting, directing and especially the special effects were tremendously awesome. Director Chris Columbus did a superb job with the direction, I was surprised he didn't get an Academy Award nomination. The acting was too, excellent, especially from the experienced actors like Alan Rickman playing Severus Snape. Truly one of his best performances.A great adaptation of a very popular book, a fine example of cinema.",
    "2": "in 2001, in the film Harry Potter and the Sorcerer's Stone, began one of the best sagas of all time, based on the book of the same name by JK Rowling, the film hit full in the cast, all actors are great in their characters, Daniel Radcliffe this impeccable as Harry Potter, the resemblance is too large, Rupert Grint this great as Ron Weasley, Emma excellent Watson as Hermione Granger, Robbie Coltrane as Hagrid, Richard Harris as Dumbledore (which unfortunately from the third movie substituted series, having deceased), Maggie Smith, Alan Rickman great as Snape, Ian Hart, Tom Felton, and etc, all goods, the special effects are great, the picture is great, especially the castles, the soundtrack is very good, and full of great moments, as the final, obvious that the movie has errors, the script has some problems, and the film is very long, I think it was longer than it should, and the film is faithful to the book, even with some missing characters, Harry Potter and the Sorcerer's Stone is a very good film, and marks the beginning of the saga of the Wizard in the movies. Note 8.2",
    "3": "When I first saw this movie I was ten years old, the same age the characters where supposed to be. My older cousin and her boyfriend took me to the Mall to watch a movie. Back then I wasn't going very often to the cinema, due to the fact that my parents didn't have time and I wasn't old enough to go alone to any theater. The movie captivated my attention like nothing before and I became so interested in anything that had to do with this movie, and I heard that it was made after a book. I didn't had Internet back then, but I found the first book at a library and convinced my mother to buy it. That's how I became obsessed with reading and writing.I may say, \"Harry Potter\" affected me in a positive way, because after I finished reading all the published books back then, I wanted to read more books and I must thank J.K.Rowling for her genius, if it wasn't for her books, I might have been right now an average seventeen year old, at some party, drinking my brains out. This movie got me to the right path in life.I know, you probably don't care about my story, you readers only want to hear about what I thought of the movie, but I believe my story can influence you if you are a parent and thinking whether or not you should let your children watch this film. My advice is yes and I have presented my reason above.The story is simply magical and \"Hogwarts\" is a genius invention. The movie is done well, almost perfect. It's the closest to the book they can get and it's an amazing experience for any kid.",
    "4": "Over-hyped but still enjoyable \"event\" movie, one of the biggest of 2001 until LORD OF THE RINGS comes out, and a film in which every million of the budget is put up on screen in the special effects. What I found most refreshing about this blockbuster is that the entire cast is made up of British actors and actresses! It makes a change for an expensive blockbuster movie to be thus but there you go, HARRY POTTER is indeed a unique movie. Now I'm not one of those people with lots of time on their hands to read the never-ending Harry Potter books (too busy watching cult movies I'm afraid), but the film has turned out pretty much as I would have expected from the adverts. Although it's overly sentimental (blame it on director Chris Columbus) and aimed at children, adults can still enjoy it for the excellent pacing (rarely does the two-and-a-half hour running time drag) and the plethora of special - and some not so special - effects on view throughout.Highlights include an attack in the school's toilets by a huge, lumbering troll, a life size game of chess in which the pieces come to life to destroy each other, a cloak of invisibility, a man with two faces on opposite sides of his head, and the finale which includes a scene of a man disintegrating into dust as a homage to Hammer's Dracula and is just as impressive. The CGI effects are elaborate and generally flawless, and the only ones I didn't care for were the \"broomstick flying\" shots in the quidditch game which still ended up looking a little too fake for my liking, which is a shame as they're used excessively. Otherwise the effects work is phenomenal and something to be seen.Daniel Radcliffe takes on the rather subdued role of Potter, and is overshadowed by two excellent performances from Rupert Grint as the lovably cheeky Ron and Emma Watson as the bossy Hermione. The supporting cast are generally excellent, with fine turns from Richard Harris as Headmaster Dumbledore, Robbie Coltrane as the giant Hagrid (whose weight bizarrely fluctuates throughout the movie), John Cleese - briefly - as an unsuccessful ghost, Nearly Headless Nick, John Hurt as a wand dealer, Richard Griffiths as Harry's unpleasant uncle, and most of all Alan Rickman with a sinisterly villainous performance of Gothic dread - nobody can be a bad guy like Rickman can. Cameos from the likes of Julie Walters, Fiona Shaw, Zoe Wanamaker, and even Warwick Davis (which surely had to be a step up from LEPRECHAUN 5 or whatever his last film was) as a goblin are endless and a delight.HARRY POTTER AND THE PHILOSOPHER'S STONE may be a kid's film, but there's enough going on here to make it an enjoyable viewing experience for adults who plan to watch the film with their kids as well. Lots of plot, interesting and original characters, refreshingly old-fashioned moral codes, some fine sets which skilfully mix old and new-style worlds, an effective score, special effects which seamlessly blend in with the story and above average acting help to make this a gem of a movie and a cut above the rest.",
    "5": "No, I'm not a big Harry Potter fan and probably never will be but I can appreciate the qualities of the movies. Definitely for a children movie this movie is of course of very high class, with fabulous looking sets, a whole load of well known British actors and an highly experienced crew involved.The movie forms a nice first set up for the future series of Harry Potter movies. Still I'm glad the movies and its characters have matured a lot since this movie. Probably also has to do with the fact that this movie and the second were directed by Chris Columbus who is an experienced children movie director, while the other Harry Potter movies were directed by more 'serious' directors. Yes, it makes this movie a good children's movie to watch but also sort of makes this movie look and feel more outdated than any of the other Harry Potter movies, which also goes at the expense of its re-watchable value.Nevertheless, \"Harry Potter and the Sorcerer's Stone\" remains good quality- and fun film. It knows to create an entire new world of its own with lots of often strange characters in it.The movie is of course a set up and the first establishment of a long running series of movies. This means that the movie consists for a big part out of character introductions. Yes, this results in the fact that there are a bit too many characters in the movie, also since some of them don't even seem to serve a purpose at all for the story but this got resolved in the later movies, by simply leaving out some characters but by introducing many new ones as well. So its sort of problem solving with another problem. Also a bit of a shame that the movie is lacking a real central villain. Professor Snape is treated as a villain, even though we learn by the end of the movie that he's not such a bad guy after all. The real main villain if the movie is of course Voldemort but he gets mostly only mentioned by name and basically doesn't do an awful lot in the movie and only sort of shows up in the very end of the movie. Not the way to treat a villain in my opinion, even though its of course clear from this movie on that he is going to play a much bigger and more important role in the future Harry Potter movies. I however in a case like this feel that they should had putted in a new and different villain besides Voldemort, since this movie is definitely lacking a sense of danger, excitement and action, even though the movie never bores, despite its quite long running time (for a children's movie anyway.).The movie its quality is also surely being uplifted by its presence of well known and respected actors, such as Richard Harris, Maggie Smith, Robbie Coltrane and Alan Rickman among many others. Each of them are giving fine performances but it are mostly Harris and Rickman that catch the eye with their performances. The child actors are also managing fine, although its definitely and luckily true that their acting improved throughout during the later movies.The movie is great looking and knows to create a magic new world, with its set, costumes and make-up. It's not hard to see that this was a costly movie to make. The special effects are also mostly fine, though not really during the game of quidditch, or any other 'flying' sequence for that matter. The movie gets also greatly supported by the musical score from John Williams. Sort of a waste for the series that Williams only scored the music for the first 3 movies.A good and fun enough start of the series, though luckily the movies improved more over the years.7/10http://bobafett1138.blogspot.com/",
    "6": "Not a perfect story, but a lovely introduction into these characters and J. K. Rowling's magical world of wizards. Lots of great bits here, like the sorting hat, invisibility cloak, troll encounter, and quidditch match (even if the rules for this game are absurd). The casting is excellent, including the principal three (Daniel Radcliffe, Emma Watson, and Rupert Grint) and the teachers at Hogwarts (Alan Rickman, Maggie Smith, and Richard Harris). The film was a little too long and had scenes that seemed a little disconnected, leading to a rather brief, anticlimactic ending, but overall there's a reason the franchise was so popular, and this got it off the ground in good form.",
    "7": "It's seem like just yesterday, when the movie about the boy whom lived, was about to come out. People were wondering if the Harry Potter's books by J.K Rowling could easily be translated into the big screen. Harry Potter and the Philosopher's Stone AKA Sorcerer's Stone directed by Chris Columbus, indeed show that it was somewhat possible. The story follows Harry Potter (Daniel Radcliffe)'s first year at Hogwarts School of Wizardry as he discovers his gift and destiny against the dark forces of magic. The movie like the other films are cut into two plots directions. One is about student life at Hogwarts during the school-year, while the other half is about the mystery that Harry Potter must uncovered that year. It works well as a long read novel, but in movie form: its means a long sit through. The movie pacing is so long. It takes forever to get to the main plot of Harry Potter finding the Philosopher Stone. There are is a lot of filler scenes that could be cut away. I dislike how the Philosopher Stone is one-time movie McGuffin. For the best of my knowledge, the Philosopher stone plays no factor after this movie, and never mention again after this film. The third act, mostly comes out of nowhere. The twist toward the end, was pretty predictable, if you readt the books, but pretty interesting. Another thing about the movie is how non-logical the movie is. It really baffled me, how much exposition, it needed. Even an hour in the film, there were a lot of random odd things happening without much explaining. It gets more confusing as long bits of the book, like the Centaur showing in the woods, were shorten in the film. It gets worst for the centaur, as he wouldn't play a factor, in any of the later films, despite, saving Harry Potter from Voldermort. Hermione Granger (Emma Watson) was also cut short. Her riddle solving in the book was cut from the film. Several minor characters have been removed from the film version, as well. Despite those, the movie is really close to the novel. In my opinion, don't bother, trying to understand the logic of all the wizard terms, because it will take you out of the fantasy movie, and give you a headache. Still, there were some really dumb things to nitpick here like why would Professor Dumbledore (Richard Harris), even allow Harry Potter to stay with the Dursley's family when he knows that they're horrible people. Honestly, the Dursleys could had killed Harry Potter with the childhood neglect! What was he thinking? Harry Potter could had commit suicide, or gone crazy like Lord Voldermort! What an idiot! The whole movie is about children being danger all the time. I don't care if they're wizards in training, I'm surprise that the death tolls of students dying isn't as high as it should be. The school staff is questionable at times. A good example of this stupidity, is punishing students whom went out at nights, by sending them out at nights in the dark forest, where they can get attacked by creatures. The most insulting thing in logic is the black/white one-dimensional view of good Vs evil. Honestly, how on earth is the members of Slytherin never got expulsion for all the bullies that it has? You would think, that at less, there would be one good person in Slytherin. Another thing that bugs me is the whole the power of love conquer all. I think, children are a lot smarter than the childish message, the film is trying to pull. The acting in the movie is pretty bland, for the most part. After all, most of the child actors had this film as their first roles. I wouldn't say that Harry Potter's film series, have the most entertaining of dialogues, anyways. The wooden delivery, felt like a read-through. Most of what they're saying are stating the obvious or repeating what happening on screen. It's so annoying. The other actors were master British thespians, who seem to over-act at times. A good example of this is John Hurt & Alan Rickman. It was too hammy for already over the top world. The action scenes were pretty well-done. My favorite had to be the Quidditch match and the whole chess game. I can do, without the whole troll scene. The CGI troll hasn't aged well. Visually, the movie is beautiful to look at. I love the special effects, locations & set, and costume, they did. It really made the Harry Potter world, stand out. The music by John Williams is amazing to listen to. I think director Chris Columbus was indeed the best choice for this first movie, as he got the magically part, right and how to make a family picture. You even see, how much things, he establish that other directors would reused time after time. Still, I really hope for Terry Gilliam like J.K Rowling's first choice to be the direction. The movie has great social commentary themes like the metaphor of racism, ethnic cleansing and why Nazism is bad. You can also see possible influences from other words, that made Harry Potter work. There was a few controversial moments leading up to the film, like religious debates. A few religious groups claim that Harry Potter contain occult or Satanic subtexts that isn't good for children. Another one is the use of the word, sorcerer over the word philosopher in the title. US & British have different meanings to the words, plus marketing though, it would better to call it sorcerer as that word get more appeal. Due to this different, all scenes that mention the philosopher's stone by name had to be reshot, once with the actors saying \"philosopher's\" and once with \"sorcerer's\". Overall: The movie might has its flaws, but majority, a great first watch for any fantasy fan.",
    "8": "To be faced with the challenge of adapting Harry Potter for the Silver screen must have been any director's nightmare- the chance of directing possibly the biggest film of this decade, but also the hardest audience-the millions of fans of the book who know every line and will pick up on every mistake. Being one of the above, I can only say that Christopher Columbus and all of the team working on HP did marvelously. The cast was brilliant (particularly notable are Alan Rickman as Snape, Maggie Smith as McGonagall, and the eerily creepy David Bradley as Argus Filch), the directing wonderful, and the scenery perfect. The only qualm is that it does not track perfectly with the book, but squeezed into 2.5 hours, this can only be expected. Well done all involved!",
    "9": "The right way to start a saga like this one, introducing the characters in a very positive and unique way, telling and showcasing all the riches that the wizard's world is a home of. In only one movie, we've seen amazing creatures, friendly and foes, teachers that are heroes and villains, we've witnessed the wisdom of the legendary professor Dumbldor, the movie made us guess who will be who and on who's side in the chapters to come and above all, we had fun. I will never forget the part where Harry buys all the things he needs to start his wizard journey, the authentic look of the streets, the shops and the bank will be part of the Harry Potter legacy forever.",
    "10": "I watched all Harry Potter movies when I was 7 years old. After five years I watched the movies again at 12 years old and I feel this saga a classic, well, it is a classic. I started reading the first book like one day ago. Which my mom gave to me when I was a little kid. I like Harry Potter a lot and I would watch all the saga again",
    "11": "Harry Potter movies are one of my favorite ones, and I can watch them several times. I watch it every time it's on TV, and there is one channel that shows all the series of this incredible movie every time after the new year. I also want to mention that even my family members like to watch it with me. My grandmother especially likes it. This fact indicates that this movie is interesting not only for children but also for elderly people and it's not weird for me. There are so many things going on in this movie, so many secrets and beautiful scenes. Plus a big thanks for the graphics of the movie, everything is very realistic. For example, the mermaids or the dinosaurs. Moreover, there is a massive animatronic creature in this movie- spider and after watching the movie google about it and found out that Rupert Grint, the actor who plays Ron Weasley, one of the main characters, is afraid of spiders just s much as his character is, and said it was easily the scariest scenes to film. I'm scared of spiders too, and I know how it feels when you see them. Thus, I really appreciate the job that this actor did. In my opinion, despite the fact that he had to play again a guy, who was scaring from spiders, it is again hard to play the role by looking at the creature that gives you goosebumps. Thus, this movie not only good in graphics, but also the cast.",
    "12": "Not being a reader of the Harry Potter books, I came to the first Harry Potter movie with a totally open mind. There seems to be those who love the book but hate the film; those that love both; and even a few who hate both! Having watched Harry Potter And The Sorcerer's Stone, I must confess that I'm not entirely sure what all the fuss is about. This strikes me as solid but unremarkable, totally overlong but fairly diverting fare.Harry Potter (Daniel Radcliffe) is left as a baby at the house of his relatives, the Dursleys. Later we learn that his parents were magicians killed by a dark sorcerer, and he has been hidden away for his own protection until he is older. Eventually the time comes for Harry to discover his destiny. He is tracked down by the friendly giant Hagrid (Robbie Coltrane) and sent to Hogwarts, a special school of Witchcraft and Wizardry for youngsters with magical prowess. Everyone at Hogwarts, the fellow pupils and the teachers – seems to know about Harry's past, even though he himself knows barely any of it. Harry befriends two other first year students – Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson) – and begins to learn the art of wizardry from various eccentric teachers. Things take a darker turn when the three young magicians begin to suspect that Voldemort, an evil figure from Harry's past, is trying to regain his once-great power and strength by obtaining the Philosopher's Stone, a powerful object hidden somewhere at the school.The film is not particularly well-acted, with the child stars coming across as if they are carrying out a reading rehearsal, and too many star names (Julie Walters, John Hurt, John Cleese, Zoe Wanamaker) hamming it up like mad in cameo roles. At least the main adult roles – taken by the likes of Maggie Smith, Alan Rickman and Richard Harris – are played with a degree of experience and finesse. There are some splendid visuals in parts, though the effects are not so impressive during the much-hyped Quidditch sequence. The most disappointing thing for me is the long and laborious build-up, which leads to a somewhat flat final confrontation (I am reliably informed by those in the know that this film's climax is intentionally brief and aborted, and links to developments in the later films). Overall, Harry Potter and the Sorcerer's Stone is a reasonable watch, but I'm hoping for something more as the series progresses.",
    "13": "When I knew the film was being made, I thought how could they make a film that would be up to the standard of such a perfect book. But they did! Sure they missed bits out but they captured the essence of the book brilliantly. One member of the cast was mis-cast for me but my children disagreed.I even found myself believing they were flying and not wondering \"how are they doing that?\" So 10 out 10 Warner Brothers. Bring on the next one!",
    "14": "This movie captures most aspects of the book perfectly. Being the first in the franchise, it has to do a lot of world building. But the writers and the director of this movie managed to keep things simple and to the point.The cast is also perfect. All the younger actors were good enough and they keep improving with each movie. The older cast was amazing in their roles and help the movie feel more real. The music of John Williams was a masterpiece and added to the magical nature of the story.Even after 2 decades, this movie still feels magical and captures the attention of many young and old audience.",
    "15": "Cool! I'm so sorry because in 21 years of my life, I've only seen a movie as cool as this. Harry potter, in my first impression, I was amazed and curious about how the next series of this film will be. Watching this film evokes a feeling of dark academia that was buried in the past. Even though this film was produced in 2001, but the quality is quite good and even not inferior to films produced now.",
    "16": "I watch this movie again in 2019, because i think it was an amazing movie n i miss the point of the movie when i watch it as a child. I only focusing on the magic thing.\nIts good for a children to watch this movie i think, it tells not only about friendship, but also family, bravery and sincerity.\nWatching this also makes me remember my childhood days, it bring back all memories i cherish the most.\nreally love it",
    "17": "10/10 - an unforgettable start to a fantastic film series and the career of the impeccable Emma Watson (and the other kids)",
    "18": "All the Harry Potter films in this series are pretty good. Some are better than others, but over-all, the seven together is quite a motion picture experience. This one is the first one in the series and is the best one to get started with. This first film is so well produced, that it should satisfy you enough to watch even more of them. This film also works on its own. That is good, in case, you never get a chance to see another one again in your life. Start with the first one I always say. Being the first film also means, I have seen it the most. I saw this film as soon as it landed on DVD, then when I realized there would be a seven or eight film run on the Harry Potter series, i stopped watching them and waited for all of them to be released in a DVD package, which I finally finished in 2017. This film still works great today as it did 20 years ago.8.7 (B+ MyGrade) = 8 IMDB.",
    "19": "A legendary beginning to a legendary franchise. The story of the film is great. Each role fits perfectly with the actor. Has great CGI and visuals. Can't stress this enough... go watch it.",
    "20": "I love the Harry Potter books because of their brilliant writing, exciting and funny moments, compelling characters and the way that I'm hooked as soon as I pick one up. They deserved to be such a phenomenon. The films? Not so much. This starts off the adaptations in OK style, and follows Harry Potter's attempts to stop the evil sorcerer who killed his parents getting a stone which will help him return to power.This, along with the second is directed by Christopher Columbus and the first 2 often seem to be seen as the weakest. In my opinion these 2 aren't the worst, but they're certainly not that great. For some reason, Columbus decides to copy the book page for page but leave out most of its depth, wit and bite. For a Harry Potter fan this may be satisfying, but since the film is also overly syrupy and kid friendly, adults may be irritated by it. This adaptation is a mixed bag overall.The adult cast has more talented British actors than you can shake a stick at and while most of them have relatively small roles, they certainly leave an impression. John Williams' as usual provides a great soundtrack which sadly was used less in later films and while I'm not desperately keen on Chris Columbus' style, he does do a perfectly OK job at directing the film. To a newcomer and someone who hasn't read the book the film would likely seem magical and fascinating as it thankfully includes many details about the HP universe, which is one of the best fictional universes ever created.There are some genuinely frightening moments and it provides good escapism. But there are many problems. It's nowhere near as funny or fascinating as the book, which is odd as it's pretty much as carbon copy of the book although to be fair it omits the right parts of the book. It's also overlong and frequently dull, and things such as the troll, the dragon and the mirror are conveyed poorly to the big screen, although the finale is still good. The child actors are excruciating to watch at times, although they would improve in later films.Overall a wooden and unimaginative adaptation which is cinematically uninteresting and, on my last viewing, a bore to watch. This is the 6th best, and while I used to like it, now I can see it's routine, though competently executed and visually decent, adaptation with little personality. When having to deal with the wooden child actors it's even more irritating.",
    "21": "It was amazing to watch how a huge movie franchise started with this one. It showed a basis for the entire Harry Potter timeline. The visual effects were very great for this film. It was on-point and did not feel amateurish. Unfortunately for me, everything else was a bit stale and unexciting. I was in doubt of whether it really maximized its runtime. There were, in some parts, too many scenes which the characters were doing a lot of dialogues. The production design and costumes were excellent aspects of the film, too. But for me a lot of dark cinematography was utilized, instead of a more lively kind of production.",
    "22": "I have seen this movie numerous times on TV, but I was never able to watch it in it's entirety some reason until today where I managed to watch it all and it did not disappoint. The story is just really intriguing right from the start where you introduced to the character Harry Potter who is just very likeable which makes you root for him against his so called family. The world of Hogwarts is amazing and makes you want to wish it was a real place. The story is easy to follow and it's not predictable which I liked as there are a few twists which just make the movie even more thrilling. I have seen bits of the other movies on TV as well and I hope they are as good if not better as this.",
    "23": "\"Harry Potter and the Sorcerer's Stone\" or sometimes also \"Harry Potter and the Philosopher's Stone\" is the first film from one of the most successful movie franchises in cinema history. The books were written by Joanne K. Rowling and adapted by Steve Kloves (not a name to many), who also directed \"The Fabulous Baker Boys\" earlier in his career. It is about a small boy with hidden powers, who is not particularly liked by his uncle, aunt and cousin. They took care of him after his parents died when he was a baby. So he gets picked up by an unusually looking, rather gruff magician and taken to Hogwarts. Hogwarts is not a normal school. While the bonding with fellow students, the fraternities and sports activities are there as well, everything is just a little bit more magical and different.One thing I really liked about the film was the playful comedy. A lot of it involved Ron Weasley. It is very subtle often, but it is pretty great. Let me use one example. When Potter finds a collection card in one of his sweets, he says he has Albus Dumbledore, the headmaster from Hogwarts. Now I expected something like Weasley saying oh my God he only appears once in a 1,000 times, but he said something like he has him six times already too. And when Dumbledore's card comes alive and quickly vanishes, Weasley says that Albus cannot hang around there all day as he is busy. I found that pretty funny and there is a whole bunch of cute scenes like that, also Weasley's interactions with Hermione for example.Other than that the film really succeeds with his love to detail and all the fantastic ideas in the script, such as the hat picking the group they belong to, the hidden station idea, the scar, the troll (like a fire alarm in a real school), Fluffy, the mirror, the chess game and many more. To me, the first movie was much more about experiencing the wonderful world of Hogwarts than really enjoying the adventure action about the stone. Another highlight are all the very unique characters from the teaching staff. I won't go into further detail here. You know who I mean. There's some minor criticisms, like the ending with the extra points was a bit cheesy, feel-good forced (also with Smith's character looking so uncomfortable, they have to be neutral I thought), the connection between Snape's wound and Fluffy was a bit genius, don't know if kids would make it really so quickly, but they have bright minds so maybe or also Ron's whole self-sacrificing approach during the chess game. I can't really see a little boy act like that. These are only minor flaws though from an otherwise excellent film. This is one to watch for the whole family and I can't say I am surprised this was the most successful box office movie in the United States from 2001, even ahead of the first Lord-of-the-Rings movie. The three child actors here had little (Radcliffe) to none (Watson, Grint) acting-experience in movies when they were were cast here. A decision that changed their lives.The movie scored 3 Oscar nominations for the art direction, costumes and the soundtrack and it is surely deserving. Especially the visual side is incredibly strong and over 13 years later, most films can only dream of coming close to that. All the creatures look so fantastic it is a joy to watch. That one forest creature that saves Harry reminded me during one shot especially of the later film \"Pan's Labyrinth\". Just a random notion. There is some animal included like a majestic and, at the same time, cute cuddly owl and a droll huge dog. The cast includes quite a few known actors: Richard Harris, Maggie Smith, Alan Rickman, John Hurt and many more shall follow in the next films. This movie may be director Chris Columbus' best work so far and that's not taken for granted as he directed 2 \"Home Alone\"-films, Mrs. Doubtfire and also another Harry Potter movie during his long career. I believe this is my favorite Potter film together with the \"Prisoner of Azkaban\". Too close to call. We are just introduced to such a wonderfully creative world here. Highly recommended.",
    "24": "Sorcerer stone is a pretty good film which introduces us with harry potter and his friends. Just like the kids in Hogwarts, audience are also in awe with the magic. But I felt that this lacked a story which is only revealed towards end. But still this is my second most favorite harry potter film after chamber of secrets.",
    "25": "Directed By: Chris ColumbusStarring: Daniel Radcliffe, Emma Watson and Rupert Grint.Overview: A great start to a franchise. Definitely worth a watch.Good: 1. Daniel Radcliffe, Emma Watson and Rupert Grint are great, especially for such a young age. 2. Robbie Coltrane, Richard Harris and Alan Rickman are, of course, great as Hagrid, Dumbledore and Snape respectively. 3. All characters are great. 4.The cinematography was great and had some pretty fine shots. 5. The music is brilliant. 6. The entire universe is so great and brilliantly done. 7. The lighter tone until the later conflict is great.Bad: 1. Professor Quirell is an uninteresting villain and him as an introduction to Voldermort was stupid. 2. It has to spend a lot of time setting up the universe which is understandable but annoying nonetheless. 3. The way some plot points are revealed is stupid. ------- Best Part: The pursuit for the Philosopher's StoneMVP: Richard Harris as Albus Dumbledore8/10",
    "26": "I watched all Harry Potter movies when I was 7 years old. After five years I watched the movies again at 12 years old and I feel this saga a classic, well, it is a classic. I started reading the first book like one day ago. Which my mom gave to me when I was a little kid. I like Harry Potter a lot and I would watch all the saga again",
    "27": "Harry Potter movies are one of my favorite ones, and I can watch them several times. I watch it every time it's on TV, and there is one channel that shows all the series of this incredible movie every time after the new year. I also want to mention that even my family members like to watch it with me. My grandmother especially likes it. This fact indicates that this movie is interesting not only for children but also for elderly people and it's not weird for me. There are so many things going on in this movie, so many secrets and beautiful scenes. Plus a big thanks for the graphics of the movie, everything is very realistic. For example, the mermaids or the dinosaurs. Moreover, there is a massive animatronic creature in this movie- spider and after watching the movie google about it and found out that Rupert Grint, the actor who plays Ron Weasley, one of the main characters, is afraid of spiders just s much as his character is, and said it was easily the scariest scenes to film. I'm scared of spiders too, and I know how it feels when you see them. Thus, I really appreciate the job that this actor did. In my opinion, despite the fact that he had to play again a guy, who was scaring from spiders, it is again hard to play the role by looking at the creature that gives you goosebumps. Thus, this movie not only good in graphics, but also the cast.",
    "28": "Not being a reader of the Harry Potter books, I came to the first Harry Potter movie with a totally open mind. There seems to be those who love the book but hate the film; those that love both; and even a few who hate both! Having watched Harry Potter And The Sorcerer's Stone, I must confess that I'm not entirely sure what all the fuss is about. This strikes me as solid but unremarkable, totally overlong but fairly diverting fare.Harry Potter (Daniel Radcliffe) is left as a baby at the house of his relatives, the Dursleys. Later we learn that his parents were magicians killed by a dark sorcerer, and he has been hidden away for his own protection until he is older. Eventually the time comes for Harry to discover his destiny. He is tracked down by the friendly giant Hagrid (Robbie Coltrane) and sent to Hogwarts, a special school of Witchcraft and Wizardry for youngsters with magical prowess. Everyone at Hogwarts, the fellow pupils and the teachers – seems to know about Harry's past, even though he himself knows barely any of it. Harry befriends two other first year students – Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson) – and begins to learn the art of wizardry from various eccentric teachers. Things take a darker turn when the three young magicians begin to suspect that Voldemort, an evil figure from Harry's past, is trying to regain his once-great power and strength by obtaining the Philosopher's Stone, a powerful object hidden somewhere at the school.The film is not particularly well-acted, with the child stars coming across as if they are carrying out a reading rehearsal, and too many star names (Julie Walters, John Hurt, John Cleese, Zoe Wanamaker) hamming it up like mad in cameo roles. At least the main adult roles – taken by the likes of Maggie Smith, Alan Rickman and Richard Harris – are played with a degree of experience and finesse. There are some splendid visuals in parts, though the effects are not so impressive during the much-hyped Quidditch sequence. The most disappointing thing for me is the long and laborious build-up, which leads to a somewhat flat final confrontation (I am reliably informed by those in the know that this film's climax is intentionally brief and aborted, and links to developments in the later films). Overall, Harry Potter and the Sorcerer's Stone is a reasonable watch, but I'm hoping for something more as the series progresses.",
    "29": "When I knew the film was being made, I thought how could they make a film that would be up to the standard of such a perfect book. But they did! Sure they missed bits out but they captured the essence of the book brilliantly. One member of the cast was mis-cast for me but my children disagreed.I even found myself believing they were flying and not wondering \"how are they doing that?\" So 10 out 10 Warner Brothers. Bring on the next one!",
    "30": "This movie captures most aspects of the book perfectly. Being the first in the franchise, it has to do a lot of world building. But the writers and the director of this movie managed to keep things simple and to the point.The cast is also perfect. All the younger actors were good enough and they keep improving with each movie. The older cast was amazing in their roles and help the movie feel more real. The music of John Williams was a masterpiece and added to the magical nature of the story.Even after 2 decades, this movie still feels magical and captures the attention of many young and old audience.",
    "31": "Cool! I'm so sorry because in 21 years of my life, I've only seen a movie as cool as this. Harry potter, in my first impression, I was amazed and curious about how the next series of this film will be. Watching this film evokes a feeling of dark academia that was buried in the past. Even though this film was produced in 2001, but the quality is quite good and even not inferior to films produced now.",
    "32": "I watch this movie again in 2019, because i think it was an amazing movie n i miss the point of the movie when i watch it as a child. I only focusing on the magic thing.\nIts good for a children to watch this movie i think, it tells not only about friendship, but also family, bravery and sincerity.\nWatching this also makes me remember my childhood days, it bring back all memories i cherish the most.\nreally love it",
    "33": "10/10 - an unforgettable start to a fantastic film series and the career of the impeccable Emma Watson (and the other kids)",
    "34": "All the Harry Potter films in this series are pretty good. Some are better than others, but over-all, the seven together is quite a motion picture experience. This one is the first one in the series and is the best one to get started with. This first film is so well produced, that it should satisfy you enough to watch even more of them. This film also works on its own. That is good, in case, you never get a chance to see another one again in your life. Start with the first one I always say. Being the first film also means, I have seen it the most. I saw this film as soon as it landed on DVD, then when I realized there would be a seven or eight film run on the Harry Potter series, i stopped watching them and waited for all of them to be released in a DVD package, which I finally finished in 2017. This film still works great today as it did 20 years ago.8.7 (B+ MyGrade) = 8 IMDB.",
    "35": "A legendary beginning to a legendary franchise. The story of the film is great. Each role fits perfectly with the actor. Has great CGI and visuals. Can't stress this enough... go watch it.",
    "36": "I love the Harry Potter books because of their brilliant writing, exciting and funny moments, compelling characters and the way that I'm hooked as soon as I pick one up. They deserved to be such a phenomenon. The films? Not so much. This starts off the adaptations in OK style, and follows Harry Potter's attempts to stop the evil sorcerer who killed his parents getting a stone which will help him return to power.This, along with the second is directed by Christopher Columbus and the first 2 often seem to be seen as the weakest. In my opinion these 2 aren't the worst, but they're certainly not that great. For some reason, Columbus decides to copy the book page for page but leave out most of its depth, wit and bite. For a Harry Potter fan this may be satisfying, but since the film is also overly syrupy and kid friendly, adults may be irritated by it. This adaptation is a mixed bag overall.The adult cast has more talented British actors than you can shake a stick at and while most of them have relatively small roles, they certainly leave an impression. John Williams' as usual provides a great soundtrack which sadly was used less in later films and while I'm not desperately keen on Chris Columbus' style, he does do a perfectly OK job at directing the film. To a newcomer and someone who hasn't read the book the film would likely seem magical and fascinating as it thankfully includes many details about the HP universe, which is one of the best fictional universes ever created.There are some genuinely frightening moments and it provides good escapism. But there are many problems. It's nowhere near as funny or fascinating as the book, which is odd as it's pretty much as carbon copy of the book although to be fair it omits the right parts of the book. It's also overlong and frequently dull, and things such as the troll, the dragon and the mirror are conveyed poorly to the big screen, although the finale is still good. The child actors are excruciating to watch at times, although they would improve in later films.Overall a wooden and unimaginative adaptation which is cinematically uninteresting and, on my last viewing, a bore to watch. This is the 6th best, and while I used to like it, now I can see it's routine, though competently executed and visually decent, adaptation with little personality. When having to deal with the wooden child actors it's even more irritating.",
    "37": "It was amazing to watch how a huge movie franchise started with this one. It showed a basis for the entire Harry Potter timeline. The visual effects were very great for this film. It was on-point and did not feel amateurish. Unfortunately for me, everything else was a bit stale and unexciting. I was in doubt of whether it really maximized its runtime. There were, in some parts, too many scenes which the characters were doing a lot of dialogues. The production design and costumes were excellent aspects of the film, too. But for me a lot of dark cinematography was utilized, instead of a more lively kind of production.",
    "38": "I have seen this movie numerous times on TV, but I was never able to watch it in it's entirety some reason until today where I managed to watch it all and it did not disappoint. The story is just really intriguing right from the start where you introduced to the character Harry Potter who is just very likeable which makes you root for him against his so called family. The world of Hogwarts is amazing and makes you want to wish it was a real place. The story is easy to follow and it's not predictable which I liked as there are a few twists which just make the movie even more thrilling. I have seen bits of the other movies on TV as well and I hope they are as good if not better as this.",
    "39": "\"Harry Potter and the Sorcerer's Stone\" or sometimes also \"Harry Potter and the Philosopher's Stone\" is the first film from one of the most successful movie franchises in cinema history. The books were written by Joanne K. Rowling and adapted by Steve Kloves (not a name to many), who also directed \"The Fabulous Baker Boys\" earlier in his career. It is about a small boy with hidden powers, who is not particularly liked by his uncle, aunt and cousin. They took care of him after his parents died when he was a baby. So he gets picked up by an unusually looking, rather gruff magician and taken to Hogwarts. Hogwarts is not a normal school. While the bonding with fellow students, the fraternities and sports activities are there as well, everything is just a little bit more magical and different.One thing I really liked about the film was the playful comedy. A lot of it involved Ron Weasley. It is very subtle often, but it is pretty great. Let me use one example. When Potter finds a collection card in one of his sweets, he says he has Albus Dumbledore, the headmaster from Hogwarts. Now I expected something like Weasley saying oh my God he only appears once in a 1,000 times, but he said something like he has him six times already too. And when Dumbledore's card comes alive and quickly vanishes, Weasley says that Albus cannot hang around there all day as he is busy. I found that pretty funny and there is a whole bunch of cute scenes like that, also Weasley's interactions with Hermione for example.Other than that the film really succeeds with his love to detail and all the fantastic ideas in the script, such as the hat picking the group they belong to, the hidden station idea, the scar, the troll (like a fire alarm in a real school), Fluffy, the mirror, the chess game and many more. To me, the first movie was much more about experiencing the wonderful world of Hogwarts than really enjoying the adventure action about the stone. Another highlight are all the very unique characters from the teaching staff. I won't go into further detail here. You know who I mean. There's some minor criticisms, like the ending with the extra points was a bit cheesy, feel-good forced (also with Smith's character looking so uncomfortable, they have to be neutral I thought), the connection between Snape's wound and Fluffy was a bit genius, don't know if kids would make it really so quickly, but they have bright minds so maybe or also Ron's whole self-sacrificing approach during the chess game. I can't really see a little boy act like that. These are only minor flaws though from an otherwise excellent film. This is one to watch for the whole family and I can't say I am surprised this was the most successful box office movie in the United States from 2001, even ahead of the first Lord-of-the-Rings movie. The three child actors here had little (Radcliffe) to none (Watson, Grint) acting-experience in movies when they were were cast here. A decision that changed their lives.The movie scored 3 Oscar nominations for the art direction, costumes and the soundtrack and it is surely deserving. Especially the visual side is incredibly strong and over 13 years later, most films can only dream of coming close to that. All the creatures look so fantastic it is a joy to watch. That one forest creature that saves Harry reminded me during one shot especially of the later film \"Pan's Labyrinth\". Just a random notion. There is some animal included like a majestic and, at the same time, cute cuddly owl and a droll huge dog. The cast includes quite a few known actors: Richard Harris, Maggie Smith, Alan Rickman, John Hurt and many more shall follow in the next films. This movie may be director Chris Columbus' best work so far and that's not taken for granted as he directed 2 \"Home Alone\"-films, Mrs. Doubtfire and also another Harry Potter movie during his long career. I believe this is my favorite Potter film together with the \"Prisoner of Azkaban\". Too close to call. We are just introduced to such a wonderfully creative world here. Highly recommended.",
    "40": "Sorcerer stone is a pretty good film which introduces us with harry potter and his friends. Just like the kids in Hogwarts, audience are also in awe with the magic. But I felt that this lacked a story which is only revealed towards end. But still this is my second most favorite harry potter film after chamber of secrets.",
    "41": "Directed By: Chris ColumbusStarring: Daniel Radcliffe, Emma Watson and Rupert Grint.Overview: A great start to a franchise. Definitely worth a watch.Good: 1. Daniel Radcliffe, Emma Watson and Rupert Grint are great, especially for such a young age. 2. Robbie Coltrane, Richard Harris and Alan Rickman are, of course, great as Hagrid, Dumbledore and Snape respectively. 3. All characters are great. 4.The cinematography was great and had some pretty fine shots. 5. The music is brilliant. 6. The entire universe is so great and brilliantly done. 7. The lighter tone until the later conflict is great.Bad: 1. Professor Quirell is an uninteresting villain and him as an introduction to Voldermort was stupid. 2. It has to spend a lot of time setting up the universe which is understandable but annoying nonetheless. 3. The way some plot points are revealed is stupid. ------- Best Part: The pursuit for the Philosopher's StoneMVP: Richard Harris as Albus Dumbledore8/10",
    "42": "Having just watched HP7A aka Harry Potter and the Deathly Hallows Part 1, my mind flies back - almost magically, one might say - to the film which started it all.My opinion now is not a lot different to what it was then. The book is a delightful experience - it captured my middle-aged imagination on page 1 and never let go for an instance, telling a cracking story well, and having me believe that Harry and his friends were in real jeopardy throughout. The film's main strength is that it captures much of the book very well.It has two weaknesses, however. The first is that it is, perhaps, a little too respectful towards its source material. This slavish desire to reflect on screen every tiny detail from the novel causes two problems. One, the film becomes somewhat clinically overstuffed with so much tiny detail that it almost suffocates the life out of it and, two, it sets a standard for detail so impossibly high that future films fall short (the portraits and staircases in Hogwarts no longer move, ghosts no longer charge around etc.).The second weakness is the three principals. I'm sorry, but I find Daniel Radcliffe pretty wooden throughout the series (subject to some comedy bits in a couple of the later films) and, if he was the best casting choice available, the others couldn't have been very good. Rupert Grint is saddled with a Ron Weasley who does him no favours at all. Not until very late in the series is Ron called upon to be anything than a gormless foil for Harry, a task which Grint accomplishes with ease (and I'm not sure whether this is a good thing or a bad thing). And Emma Watson is just awful. So desperate is she to provide a dynamic performance that her mouth takes on an appallingly hypnotic life of its own. I don't ever recall seeing someone talk with such over-emphatic mouth movements. How curious, then, that future films in the series see Watson develop into being one of the very best things Harry Potter offers the viewer.",
    "43": "Harry Potter and the Sorcerer's Stone is what a book adaptation should be. The only things left out of the movie were very minor. This tells the story of a boy whose parents were killed when he was young and been mistreated by his aunt and uncle. He receives a letter about a school named Hogwarts. There, in his first year with his friends Ron and Hermione, he must stop wrongdoing of a couple teachers. The cast was wonderfully casted. Daniel Radcliffe is fantastic and looks the part of Harry. Everyone else is perfect. As I mentioned above, the adaptation is great. The movie even used the same quotations as the books. The music is memorable. I liked John William's Hedwig Theme. The costumes are good-looking and so is everything else. This movie will leave a magical imprint on your minds and this is only the first film. I rate this magical adventure 10/10.",
    "44": "wow, wow, wow! The Harry Potter movies and books will always have a special place in my heart!! I love them so much and this is the one that started it all! It is so fun, great, and energetic and Daniel Radcliffe is perfect for Harry. Emma Watson and Rupert Grint are great and there is such amazing chemistry between all of them! I love all the movies and books.",
    "45": "Harry Potter is an orphan living with his ignorant uncle and aunt under their stairs. He finds out that he is actually a wizard and there is a secret world out there.This is the first of a series, and it introduces the franchise very well. Some of the style is still a little rough. The CGI isn't top notch, and the sets have some work to do. But those are minor drawbacks in an otherwise superb film.The best part of it must be the great chemistry between the three young leads (Daniel Radcliffe, Emma Watson, Rupert Grint). That is objective number one. With that accomplished, the rest is just icing on the cake. Director Christopher Columbus must be commended for weaving a coherent and compelling story while setting the groundwork for the rest of the franchise. It is tough work, and could easily flounder in less experienced hands.",
    "46": "I know I'm probably the only one that didn't care for this film, but I thought it was plain boring. The adaptation of the book is just OK and the acting is average. Frankly it's a pity to see all the great English actors in this film totally wasted and relegated to play second fiddle. The effects are very well done, but it's such a conventional treatment of the books that I kept checking my watch a few times to see when was it going to be over. It's very curious that hardly any of the young people in the audience didn't laugh at all. This Harry Potter is very heavy handed and it should have emphasized the fun and could have used a few lighter moments.I was greatly disappointed given the hype in the media, which I'm sure has Ms. Rowling, Mr. Columbus and the rest of the people responsible for this mess laughing all the way to the bank!",
    "47": "Of all the Harry Potter's movies, I guess the ''Harry Potter and the Sorcerer's Stone'' was the more more expected of all. I was one of the thousands of teenagers who wanted to watch this movie so badly and I watched it in the first week it came here in Brazil. After 4 Harry Potter's movies, now I feel comfortable to say that the first movie is the one I liked the least. Maybe because it is the one who has less adventure or danger of all, but I cannot say exactly why. I think it will be very difficult for me, being crazy for Harry Potter's books, to give 10 in any of the H.P.'s movies, since the book is SO MUCH better than any of the films. I mean, MANY great parts are never showed in the movies. But if you are one of those people who never read any Harry Potter book, this film will be of vital importance to watch since it is the first of the series.",
    "48": "First off, I am going to give my modern day thoughts on Harry Potter and the Philosopher's/Sorcerer's Stone since I just now watched it for the first time in about 10½ years. And then, I will tell my story. I will begin with the positives to be nice. To be generous.80% of the special effects and sets worked extremely well with the exception of showing both The Man With No Nose – oops, I'm jumping ahead, I mean: The Man's Name They Only Speak Of Seldomly and ANY flying sequence including that Rubbish, er, I mean Quidditch game. Also, the film was a perfect fantasy for youngVERY YOUNG, that is, kids. Oh, and the score was unbelievably great.Whew. Got that out of the way. Okay, here goes: the movie was too damn long. The movie contained a minuscule amount of plot – or direction and the bulk was just spliced together scenes of a freshman year at a unique school. Quite frankly, it felt like 1,001 ideas and made up names (for useless characters, random spells, odd or clichéd wizardry creatures and places) were basically thrown at us while hero Wesley Crusher, a.k.a. Harry Potter, attempts to figure out what the whole point to this mess is.What started off very nicely in a fantasy and magic-filled-world slowly grinded to a halt so they could show off more fantastic sets and a zillion characters and objects in a school bent on kidnapping kids to learn sorcery. Eventually, it takes about an hour and forty-five minutes or roughly fifteen minutes past what this movie should've been clocked at, to learn what our \"hero\" (??) Harry Potter should accomplish before the credits roll.By that point, I kept repeating two phrases over and over: \"I don't like this movie\" (despite the graphics and the wonder it's showing me) and that this is really made for the five and under crowds. Further, when the movie finally did get past the climax of what Harry & Pals (including his poor idiot ginger chap and know-it-all-bitch with terrible hair) need to accomplishthere are FIVE endings. This movie would never, ever, ever, ever end.Oh, and before the judgments roll in, I *have* read the book. Book one, that is. I found it's all-but exactly, word-for-word as the adaption. And that's not necessarily a good thing. Despite its approximately 300 pages, enormously large print, wide margins and drawings – all of which would make it approximately 3 chapters of any normal Stephen King fare – it's just as plot less as the movie until the end. All the way through both the book and movie, I kept fantasying about other movies/books I could be entertained by that contained a point to the story from beginning to end.Now, that all said, it's not a terrible movie. It's a good intro to what's to come and again, it's PERFECT for very young kids. Is it a movie I will ever revisit, or as now, re-watch in another 11 years? Hell no. Now, that I can finally write a review, I never have to experience Harry's seemingly never-ending freshman year at Hogwart's school.And now here's my take on my original screeningA Long Time Agoin our own galaxy, sort of, I watched Harry Potter Part One – since it's known by two different names, for asinine reasons, I will refer this as \"Part One\" – only due to a babysitting gig I was coaxed into. I had already made up my mind not to see this film, since swords/wizards/fantasy isn't my cup of British TeaBut, since I had seven hours of babysitting two young boys, I thought: why not take up an hour and a half on a movie they'll probably want to see?That was mistake one and two: forgoing my vow and that I mistakenly thought it would be an hour and a half. Mistake number three was that we went on weekend one or two – I can't recall, or I choose not to – so, the theatres and parking lot were still jammed. We barely made our show time after parking and getting snacks.Despite being tortured (SEE ABOVE REVIEW) for the movie's duration, I was pleased I had just used up 5 of the 7 babysitting hours with the journey there, movie and back. As for the boysboy, they LOVED the movie. They LITERALLY sat on the edge of their seats the entire time. (No joke.) Good for them. I'm glad the money I spent on their entertainment and their snacks was well worth it.I, on the other hand, was squirming in my seat the entire time or at least after the first pointless hour. I had NO IDEA that this was over an hour and a half, let alone 2½+ hours – I was so disinterested in seeing this, I had completed no research. NO KID MOVIE SHOULD EVER BE THAT LONG – I originally thought. Not to mention, no kids movie should contain FIVE ENDINGSas stated above: the movie would never, ever end.Again, I remember the boys, one of which is my (now 15-year-old) nephew, loved every single minute and as uncomfortable as I was, I'm sincerely glad they had a good time. In fact, I need to make a point of asking him if he remembers me taking him. He had to be between 4-5 at the timeA year later, I would be dragged into seeing the remake/sequel with my partner and suffice to sayI could write the same damn review all over again.(Editor's Note: I decided to listen to the masses for this Harry POTter phenomena and revisit the series. I've only seen the first two, both once and in first run theatres. Since it's been around a decade since the initial releases, I've started over with #1 and will get to what everyone calls: the better years.)",
    "49": "Literally anyone could write this story. Nothing is original, the effects are mostly bad, the acting is bad, the direction is bad and the music score was written by John Williams 25 years ago (if you get my meaning).This movie isn't funny enough, dark enough or smart enough to be considered interesting. It's very simple and too boring.The studio executives have gone really stupid nowadays; the original and interesting ideas are never promoted, they always seem to go for the safe (meaning stupid) bet.1/10",
    "50": "My sister and I, back when I was ten, wouldn't even go near anything Harry Potter-related, despite its immense popularity at the time; we'd call Harry Potter \"Hairy Pothead\" and laugh at the nerdy glasses he wore on the book and DVD covers. Anyway, recently we decided it was time to see what made Harry Potter fans so raving mad over a little boy with superpowers and a geeky school uniform, and it was a nerdy children's movie but not nearly as bad as we thought! The main character, Harry, is a seemingly average boy living in the U.K. with his aunt, uncle, and spoiled overweight cousin, Dudley (great name choice). When Harry begins discovering strange powers in himself, his aunt and uncle do everything in THEIR power to keep the truth a secret from him, but when Harry finds out he's a wizard and is given an invite to a secluded boarding school for wizards and witches, he eagerly accepts, wanting to be with kids like himself. From there he picks up two misfit friends, meets a snotty rival with way too much gel in his bleached hair, and meets a variety of teachers, including a perverse, hawk-like old guy with emo hair and a hooked nose.So, one thing I noticed is that throughout the eight HP movies, the series quickly changes from a children's movie to a series with a more adult theme, and characters become far more complex than they were likely ever intended to be by the book author. I did enjoy the Harry Potter movies, though the acting wasn't the best, the soundtrack was pretty good, the scenery was fantastic and I liked seeing some of the strange and wonderful creatures made up by the author, man, that lady has serious imagination! Still, Harry Potter certainly doesn't beat The X-Files or Cold Case.",
    "51": "Having just watched HP7A aka Harry Potter and the Deathly Hallows Part 1, my mind flies back - almost magically, one might say - to the film which started it all.My opinion now is not a lot different to what it was then. The book is a delightful experience - it captured my middle-aged imagination on page 1 and never let go for an instance, telling a cracking story well, and having me believe that Harry and his friends were in real jeopardy throughout. The film's main strength is that it captures much of the book very well.It has two weaknesses, however. The first is that it is, perhaps, a little too respectful towards its source material. This slavish desire to reflect on screen every tiny detail from the novel causes two problems. One, the film becomes somewhat clinically overstuffed with so much tiny detail that it almost suffocates the life out of it and, two, it sets a standard for detail so impossibly high that future films fall short (the portraits and staircases in Hogwarts no longer move, ghosts no longer charge around etc.).The second weakness is the three principals. I'm sorry, but I find Daniel Radcliffe pretty wooden throughout the series (subject to some comedy bits in a couple of the later films) and, if he was the best casting choice available, the others couldn't have been very good. Rupert Grint is saddled with a Ron Weasley who does him no favours at all. Not until very late in the series is Ron called upon to be anything than a gormless foil for Harry, a task which Grint accomplishes with ease (and I'm not sure whether this is a good thing or a bad thing). And Emma Watson is just awful. So desperate is she to provide a dynamic performance that her mouth takes on an appallingly hypnotic life of its own. I don't ever recall seeing someone talk with such over-emphatic mouth movements. How curious, then, that future films in the series see Watson develop into being one of the very best things Harry Potter offers the viewer.",
    "52": "Harry Potter and the Sorcerer's Stone is what a book adaptation should be. The only things left out of the movie were very minor. This tells the story of a boy whose parents were killed when he was young and been mistreated by his aunt and uncle. He receives a letter about a school named Hogwarts. There, in his first year with his friends Ron and Hermione, he must stop wrongdoing of a couple teachers. The cast was wonderfully casted. Daniel Radcliffe is fantastic and looks the part of Harry. Everyone else is perfect. As I mentioned above, the adaptation is great. The movie even used the same quotations as the books. The music is memorable. I liked John William's Hedwig Theme. The costumes are good-looking and so is everything else. This movie will leave a magical imprint on your minds and this is only the first film. I rate this magical adventure 10/10.",
    "53": "wow, wow, wow! The Harry Potter movies and books will always have a special place in my heart!! I love them so much and this is the one that started it all! It is so fun, great, and energetic and Daniel Radcliffe is perfect for Harry. Emma Watson and Rupert Grint are great and there is such amazing chemistry between all of them! I love all the movies and books.",
    "54": "Harry Potter is an orphan living with his ignorant uncle and aunt under their stairs. He finds out that he is actually a wizard and there is a secret world out there.This is the first of a series, and it introduces the franchise very well. Some of the style is still a little rough. The CGI isn't top notch, and the sets have some work to do. But those are minor drawbacks in an otherwise superb film.The best part of it must be the great chemistry between the three young leads (Daniel Radcliffe, Emma Watson, Rupert Grint). That is objective number one. With that accomplished, the rest is just icing on the cake. Director Christopher Columbus must be commended for weaving a coherent and compelling story while setting the groundwork for the rest of the franchise. It is tough work, and could easily flounder in less experienced hands.",
    "55": "I know I'm probably the only one that didn't care for this film, but I thought it was plain boring. The adaptation of the book is just OK and the acting is average. Frankly it's a pity to see all the great English actors in this film totally wasted and relegated to play second fiddle. The effects are very well done, but it's such a conventional treatment of the books that I kept checking my watch a few times to see when was it going to be over. It's very curious that hardly any of the young people in the audience didn't laugh at all. This Harry Potter is very heavy handed and it should have emphasized the fun and could have used a few lighter moments.I was greatly disappointed given the hype in the media, which I'm sure has Ms. Rowling, Mr. Columbus and the rest of the people responsible for this mess laughing all the way to the bank!",
    "56": "Of all the Harry Potter's movies, I guess the ''Harry Potter and the Sorcerer's Stone'' was the more more expected of all. I was one of the thousands of teenagers who wanted to watch this movie so badly and I watched it in the first week it came here in Brazil. After 4 Harry Potter's movies, now I feel comfortable to say that the first movie is the one I liked the least. Maybe because it is the one who has less adventure or danger of all, but I cannot say exactly why. I think it will be very difficult for me, being crazy for Harry Potter's books, to give 10 in any of the H.P.'s movies, since the book is SO MUCH better than any of the films. I mean, MANY great parts are never showed in the movies. But if you are one of those people who never read any Harry Potter book, this film will be of vital importance to watch since it is the first of the series.",
    "57": "First off, I am going to give my modern day thoughts on Harry Potter and the Philosopher's/Sorcerer's Stone since I just now watched it for the first time in about 10½ years. And then, I will tell my story. I will begin with the positives to be nice. To be generous.80% of the special effects and sets worked extremely well with the exception of showing both The Man With No Nose – oops, I'm jumping ahead, I mean: The Man's Name They Only Speak Of Seldomly and ANY flying sequence including that Rubbish, er, I mean Quidditch game. Also, the film was a perfect fantasy for youngVERY YOUNG, that is, kids. Oh, and the score was unbelievably great.Whew. Got that out of the way. Okay, here goes: the movie was too damn long. The movie contained a minuscule amount of plot – or direction and the bulk was just spliced together scenes of a freshman year at a unique school. Quite frankly, it felt like 1,001 ideas and made up names (for useless characters, random spells, odd or clichéd wizardry creatures and places) were basically thrown at us while hero Wesley Crusher, a.k.a. Harry Potter, attempts to figure out what the whole point to this mess is.What started off very nicely in a fantasy and magic-filled-world slowly grinded to a halt so they could show off more fantastic sets and a zillion characters and objects in a school bent on kidnapping kids to learn sorcery. Eventually, it takes about an hour and forty-five minutes or roughly fifteen minutes past what this movie should've been clocked at, to learn what our \"hero\" (??) Harry Potter should accomplish before the credits roll.By that point, I kept repeating two phrases over and over: \"I don't like this movie\" (despite the graphics and the wonder it's showing me) and that this is really made for the five and under crowds. Further, when the movie finally did get past the climax of what Harry & Pals (including his poor idiot ginger chap and know-it-all-bitch with terrible hair) need to accomplishthere are FIVE endings. This movie would never, ever, ever, ever end.Oh, and before the judgments roll in, I *have* read the book. Book one, that is. I found it's all-but exactly, word-for-word as the adaption. And that's not necessarily a good thing. Despite its approximately 300 pages, enormously large print, wide margins and drawings – all of which would make it approximately 3 chapters of any normal Stephen King fare – it's just as plot less as the movie until the end. All the way through both the book and movie, I kept fantasying about other movies/books I could be entertained by that contained a point to the story from beginning to end.Now, that all said, it's not a terrible movie. It's a good intro to what's to come and again, it's PERFECT for very young kids. Is it a movie I will ever revisit, or as now, re-watch in another 11 years? Hell no. Now, that I can finally write a review, I never have to experience Harry's seemingly never-ending freshman year at Hogwart's school.And now here's my take on my original screeningA Long Time Agoin our own galaxy, sort of, I watched Harry Potter Part One – since it's known by two different names, for asinine reasons, I will refer this as \"Part One\" – only due to a babysitting gig I was coaxed into. I had already made up my mind not to see this film, since swords/wizards/fantasy isn't my cup of British TeaBut, since I had seven hours of babysitting two young boys, I thought: why not take up an hour and a half on a movie they'll probably want to see?That was mistake one and two: forgoing my vow and that I mistakenly thought it would be an hour and a half. Mistake number three was that we went on weekend one or two – I can't recall, or I choose not to – so, the theatres and parking lot were still jammed. We barely made our show time after parking and getting snacks.Despite being tortured (SEE ABOVE REVIEW) for the movie's duration, I was pleased I had just used up 5 of the 7 babysitting hours with the journey there, movie and back. As for the boysboy, they LOVED the movie. They LITERALLY sat on the edge of their seats the entire time. (No joke.) Good for them. I'm glad the money I spent on their entertainment and their snacks was well worth it.I, on the other hand, was squirming in my seat the entire time or at least after the first pointless hour. I had NO IDEA that this was over an hour and a half, let alone 2½+ hours – I was so disinterested in seeing this, I had completed no research. NO KID MOVIE SHOULD EVER BE THAT LONG – I originally thought. Not to mention, no kids movie should contain FIVE ENDINGSas stated above: the movie would never, ever end.Again, I remember the boys, one of which is my (now 15-year-old) nephew, loved every single minute and as uncomfortable as I was, I'm sincerely glad they had a good time. In fact, I need to make a point of asking him if he remembers me taking him. He had to be between 4-5 at the timeA year later, I would be dragged into seeing the remake/sequel with my partner and suffice to sayI could write the same damn review all over again.(Editor's Note: I decided to listen to the masses for this Harry POTter phenomena and revisit the series. I've only seen the first two, both once and in first run theatres. Since it's been around a decade since the initial releases, I've started over with #1 and will get to what everyone calls: the better years.)",
    "58": "Literally anyone could write this story. Nothing is original, the effects are mostly bad, the acting is bad, the direction is bad and the music score was written by John Williams 25 years ago (if you get my meaning).This movie isn't funny enough, dark enough or smart enough to be considered interesting. It's very simple and too boring.The studio executives have gone really stupid nowadays; the original and interesting ideas are never promoted, they always seem to go for the safe (meaning stupid) bet.1/10",
    "59": "My sister and I, back when I was ten, wouldn't even go near anything Harry Potter-related, despite its immense popularity at the time; we'd call Harry Potter \"Hairy Pothead\" and laugh at the nerdy glasses he wore on the book and DVD covers. Anyway, recently we decided it was time to see what made Harry Potter fans so raving mad over a little boy with superpowers and a geeky school uniform, and it was a nerdy children's movie but not nearly as bad as we thought! The main character, Harry, is a seemingly average boy living in the U.K. with his aunt, uncle, and spoiled overweight cousin, Dudley (great name choice). When Harry begins discovering strange powers in himself, his aunt and uncle do everything in THEIR power to keep the truth a secret from him, but when Harry finds out he's a wizard and is given an invite to a secluded boarding school for wizards and witches, he eagerly accepts, wanting to be with kids like himself. From there he picks up two misfit friends, meets a snotty rival with way too much gel in his bleached hair, and meets a variety of teachers, including a perverse, hawk-like old guy with emo hair and a hooked nose.So, one thing I noticed is that throughout the eight HP movies, the series quickly changes from a children's movie to a series with a more adult theme, and characters become far more complex than they were likely ever intended to be by the book author. I did enjoy the Harry Potter movies, though the acting wasn't the best, the soundtrack was pretty good, the scenery was fantastic and I liked seeing some of the strange and wonderful creatures made up by the author, man, that lady has serious imagination! Still, Harry Potter certainly doesn't beat The X-Files or Cold Case.",
    "60": "Having just watched HP7A aka Harry Potter and the Deathly Hallows Part 1, my mind flies back - almost magically, one might say - to the film which started it all.My opinion now is not a lot different to what it was then. The book is a delightful experience - it captured my middle-aged imagination on page 1 and never let go for an instance, telling a cracking story well, and having me believe that Harry and his friends were in real jeopardy throughout. The film's main strength is that it captures much of the book very well.It has two weaknesses, however. The first is that it is, perhaps, a little too respectful towards its source material. This slavish desire to reflect on screen every tiny detail from the novel causes two problems. One, the film becomes somewhat clinically overstuffed with so much tiny detail that it almost suffocates the life out of it and, two, it sets a standard for detail so impossibly high that future films fall short (the portraits and staircases in Hogwarts no longer move, ghosts no longer charge around etc.).The second weakness is the three principals. I'm sorry, but I find Daniel Radcliffe pretty wooden throughout the series (subject to some comedy bits in a couple of the later films) and, if he was the best casting choice available, the others couldn't have been very good. Rupert Grint is saddled with a Ron Weasley who does him no favours at all. Not until very late in the series is Ron called upon to be anything than a gormless foil for Harry, a task which Grint accomplishes with ease (and I'm not sure whether this is a good thing or a bad thing). And Emma Watson is just awful. So desperate is she to provide a dynamic performance that her mouth takes on an appallingly hypnotic life of its own. I don't ever recall seeing someone talk with such over-emphatic mouth movements. How curious, then, that future films in the series see Watson develop into being one of the very best things Harry Potter offers the viewer.",
    "61": "Harry Potter and the Sorcerer's Stone is what a book adaptation should be. The only things left out of the movie were very minor. This tells the story of a boy whose parents were killed when he was young and been mistreated by his aunt and uncle. He receives a letter about a school named Hogwarts. There, in his first year with his friends Ron and Hermione, he must stop wrongdoing of a couple teachers. The cast was wonderfully casted. Daniel Radcliffe is fantastic and looks the part of Harry. Everyone else is perfect. As I mentioned above, the adaptation is great. The movie even used the same quotations as the books. The music is memorable. I liked John William's Hedwig Theme. The costumes are good-looking and so is everything else. This movie will leave a magical imprint on your minds and this is only the first film. I rate this magical adventure 10/10.",
    "62": "wow, wow, wow! The Harry Potter movies and books will always have a special place in my heart!! I love them so much and this is the one that started it all! It is so fun, great, and energetic and Daniel Radcliffe is perfect for Harry. Emma Watson and Rupert Grint are great and there is such amazing chemistry between all of them! I love all the movies and books.",
    "63": "Harry Potter is an orphan living with his ignorant uncle and aunt under their stairs. He finds out that he is actually a wizard and there is a secret world out there.This is the first of a series, and it introduces the franchise very well. Some of the style is still a little rough. The CGI isn't top notch, and the sets have some work to do. But those are minor drawbacks in an otherwise superb film.The best part of it must be the great chemistry between the three young leads (Daniel Radcliffe, Emma Watson, Rupert Grint). That is objective number one. With that accomplished, the rest is just icing on the cake. Director Christopher Columbus must be commended for weaving a coherent and compelling story while setting the groundwork for the rest of the franchise. It is tough work, and could easily flounder in less experienced hands.",
    "64": "I know I'm probably the only one that didn't care for this film, but I thought it was plain boring. The adaptation of the book is just OK and the acting is average. Frankly it's a pity to see all the great English actors in this film totally wasted and relegated to play second fiddle. The effects are very well done, but it's such a conventional treatment of the books that I kept checking my watch a few times to see when was it going to be over. It's very curious that hardly any of the young people in the audience didn't laugh at all. This Harry Potter is very heavy handed and it should have emphasized the fun and could have used a few lighter moments.I was greatly disappointed given the hype in the media, which I'm sure has Ms. Rowling, Mr. Columbus and the rest of the people responsible for this mess laughing all the way to the bank!",
    "65": "Of all the Harry Potter's movies, I guess the ''Harry Potter and the Sorcerer's Stone'' was the more more expected of all. I was one of the thousands of teenagers who wanted to watch this movie so badly and I watched it in the first week it came here in Brazil. After 4 Harry Potter's movies, now I feel comfortable to say that the first movie is the one I liked the least. Maybe because it is the one who has less adventure or danger of all, but I cannot say exactly why. I think it will be very difficult for me, being crazy for Harry Potter's books, to give 10 in any of the H.P.'s movies, since the book is SO MUCH better than any of the films. I mean, MANY great parts are never showed in the movies. But if you are one of those people who never read any Harry Potter book, this film will be of vital importance to watch since it is the first of the series.",
    "66": "First off, I am going to give my modern day thoughts on Harry Potter and the Philosopher's/Sorcerer's Stone since I just now watched it for the first time in about 10½ years. And then, I will tell my story. I will begin with the positives to be nice. To be generous.80% of the special effects and sets worked extremely well with the exception of showing both The Man With No Nose – oops, I'm jumping ahead, I mean: The Man's Name They Only Speak Of Seldomly and ANY flying sequence including that Rubbish, er, I mean Quidditch game. Also, the film was a perfect fantasy for youngVERY YOUNG, that is, kids. Oh, and the score was unbelievably great.Whew. Got that out of the way. Okay, here goes: the movie was too damn long. The movie contained a minuscule amount of plot – or direction and the bulk was just spliced together scenes of a freshman year at a unique school. Quite frankly, it felt like 1,001 ideas and made up names (for useless characters, random spells, odd or clichéd wizardry creatures and places) were basically thrown at us while hero Wesley Crusher, a.k.a. Harry Potter, attempts to figure out what the whole point to this mess is.What started off very nicely in a fantasy and magic-filled-world slowly grinded to a halt so they could show off more fantastic sets and a zillion characters and objects in a school bent on kidnapping kids to learn sorcery. Eventually, it takes about an hour and forty-five minutes or roughly fifteen minutes past what this movie should've been clocked at, to learn what our \"hero\" (??) Harry Potter should accomplish before the credits roll.By that point, I kept repeating two phrases over and over: \"I don't like this movie\" (despite the graphics and the wonder it's showing me) and that this is really made for the five and under crowds. Further, when the movie finally did get past the climax of what Harry & Pals (including his poor idiot ginger chap and know-it-all-bitch with terrible hair) need to accomplishthere are FIVE endings. This movie would never, ever, ever, ever end.Oh, and before the judgments roll in, I *have* read the book. Book one, that is. I found it's all-but exactly, word-for-word as the adaption. And that's not necessarily a good thing. Despite its approximately 300 pages, enormously large print, wide margins and drawings – all of which would make it approximately 3 chapters of any normal Stephen King fare – it's just as plot less as the movie until the end. All the way through both the book and movie, I kept fantasying about other movies/books I could be entertained by that contained a point to the story from beginning to end.Now, that all said, it's not a terrible movie. It's a good intro to what's to come and again, it's PERFECT for very young kids. Is it a movie I will ever revisit, or as now, re-watch in another 11 years? Hell no. Now, that I can finally write a review, I never have to experience Harry's seemingly never-ending freshman year at Hogwart's school.And now here's my take on my original screeningA Long Time Agoin our own galaxy, sort of, I watched Harry Potter Part One – since it's known by two different names, for asinine reasons, I will refer this as \"Part One\" – only due to a babysitting gig I was coaxed into. I had already made up my mind not to see this film, since swords/wizards/fantasy isn't my cup of British TeaBut, since I had seven hours of babysitting two young boys, I thought: why not take up an hour and a half on a movie they'll probably want to see?That was mistake one and two: forgoing my vow and that I mistakenly thought it would be an hour and a half. Mistake number three was that we went on weekend one or two – I can't recall, or I choose not to – so, the theatres and parking lot were still jammed. We barely made our show time after parking and getting snacks.Despite being tortured (SEE ABOVE REVIEW) for the movie's duration, I was pleased I had just used up 5 of the 7 babysitting hours with the journey there, movie and back. As for the boysboy, they LOVED the movie. They LITERALLY sat on the edge of their seats the entire time. (No joke.) Good for them. I'm glad the money I spent on their entertainment and their snacks was well worth it.I, on the other hand, was squirming in my seat the entire time or at least after the first pointless hour. I had NO IDEA that this was over an hour and a half, let alone 2½+ hours – I was so disinterested in seeing this, I had completed no research. NO KID MOVIE SHOULD EVER BE THAT LONG – I originally thought. Not to mention, no kids movie should contain FIVE ENDINGSas stated above: the movie would never, ever end.Again, I remember the boys, one of which is my (now 15-year-old) nephew, loved every single minute and as uncomfortable as I was, I'm sincerely glad they had a good time. In fact, I need to make a point of asking him if he remembers me taking him. He had to be between 4-5 at the timeA year later, I would be dragged into seeing the remake/sequel with my partner and suffice to sayI could write the same damn review all over again.(Editor's Note: I decided to listen to the masses for this Harry POTter phenomena and revisit the series. I've only seen the first two, both once and in first run theatres. Since it's been around a decade since the initial releases, I've started over with #1 and will get to what everyone calls: the better years.)",
    "67": "Literally anyone could write this story. Nothing is original, the effects are mostly bad, the acting is bad, the direction is bad and the music score was written by John Williams 25 years ago (if you get my meaning).This movie isn't funny enough, dark enough or smart enough to be considered interesting. It's very simple and too boring.The studio executives have gone really stupid nowadays; the original and interesting ideas are never promoted, they always seem to go for the safe (meaning stupid) bet.1/10",
    "68": "My sister and I, back when I was ten, wouldn't even go near anything Harry Potter-related, despite its immense popularity at the time; we'd call Harry Potter \"Hairy Pothead\" and laugh at the nerdy glasses he wore on the book and DVD covers. Anyway, recently we decided it was time to see what made Harry Potter fans so raving mad over a little boy with superpowers and a geeky school uniform, and it was a nerdy children's movie but not nearly as bad as we thought! The main character, Harry, is a seemingly average boy living in the U.K. with his aunt, uncle, and spoiled overweight cousin, Dudley (great name choice). When Harry begins discovering strange powers in himself, his aunt and uncle do everything in THEIR power to keep the truth a secret from him, but when Harry finds out he's a wizard and is given an invite to a secluded boarding school for wizards and witches, he eagerly accepts, wanting to be with kids like himself. From there he picks up two misfit friends, meets a snotty rival with way too much gel in his bleached hair, and meets a variety of teachers, including a perverse, hawk-like old guy with emo hair and a hooked nose.So, one thing I noticed is that throughout the eight HP movies, the series quickly changes from a children's movie to a series with a more adult theme, and characters become far more complex than they were likely ever intended to be by the book author. I did enjoy the Harry Potter movies, though the acting wasn't the best, the soundtrack was pretty good, the scenery was fantastic and I liked seeing some of the strange and wonderful creatures made up by the author, man, that lady has serious imagination! Still, Harry Potter certainly doesn't beat The X-Files or Cold Case.",
    "69": "There's nothing like the first in a series, is there? The introduction to the characters, the immersion into the fictional world, the first time you laugh, cry, care, and fear for someone's safety can never be repeated. No matter how many Harry Potter movies they crank out, or if they ever remake them in the future, none will come close to the wonderful first film, Harry Potter and the Sorcerer's Stone.I'm sure everyone has their own childhood memories of reading the Harry Potter books that they'll tell their grandkids about, but I'll never forget going to see the first movie in the theaters. The lights dimmed, John Williams's perfect theme played its first notes as Richard Harris walked down Privet Drive, and everyone in the theater was transported to another world. John Williams's numerous themes, all wonderful and a personification of the wizarding world, took the early movies to another level. As other composers tried their hands at the later films, that quality was missing. There's something truly special about going to see this movie on the big screen, and while the \"magical\" qualities might not all be credited to the music, it's certainly one of them.Welcome to the world of Harry Potter, where if you're a ten-year-old kid who doesn't fit in, you might get a letter delivered by an owl telling you you have magical powers and should go to a special school to hone them. Believe it or not, there are people who watch this movie without reading the books, so a bit of description is necessary. Obviously the stars of the show are the children, who were selected out of millions of other kids to be able to memorize lines, not look in the camera, endear themselves to worldwide audiences, and hopefully act. Daniel Radcliffe, Emma Watson, Rupert Grint, and Tom Felton are so cute and tiny in this first movie, you'll undoubtedly find yourself re-watching it as the years pass just to see them as kids again. I always marvel that child actors train themselves not to look in the camera, so even if their performances aren't perfect, I cut them slack, knowing firsthand how hard it is. And these kids had to dress in funny costumes, recite incantations without laughing, and pretend they're looking at things that were added in post production!Usually, in kids' movies, there's a grown-up or two who add to the cast and make the adult audience members feel less silly that they're watching it. In the Harry Potter movies, everyone wanted to be in them! Throughout the series you'll see a host of familiar faces as \"guest stars\" but the regulars will make special places in your heart. Richard Harris, Maggie Smith, Alan Rickman, and Robbie Coltrane are household names for little kids, because they're so convincing as the kindhearted Dumbledore, the wizened but sentimental McGonagall, the endlessly mimicable Snape, and the jolly Hagrid, kids today can't imagine they've had any other career prior to these movies! Is there any kid who doesn't immediately attribute the word \"earwax\" to Richard Harris, point out striped cats as \"Maggie Smith cats\", mumble \"Shouldn't have said that,\" when they make a mistake, or practice putting pauses in their sentences like Alan Rickman?First movies are so special, since they introduce audiences to a world that will hopefully capture their attention for however many more movies will be made. In J.K. Rowling's fantasy world, there's so much to fall in love with; and in the film adaptation you can really believe it exists. Seeing the Hogwarts structure for the first time creates a special feeling in your heart that can only be recaptured by watching the movie again or going to see the next in the series. The Great Hall, Quidditch, the Sorting Hat, talking portraits, flying lessons, selecting the perfect wand-all these Harry Potter moments are perfectly recreated in the first of a series that saw an entire generation grow up buying toy wands and trying Bertie Bott's Every Flavor Beans.Each installment has its special moments, and this first one has quite a few, even outside of the exposition. If a three-headed dog doesn't immediately conjure the name \"Fluffy,\" chess pieces have never come to life in your imagination, you don't laugh at the idea of counting your birthday presents, and you don't know what Richard Harris wants most in the world, you're missing out on one of the great joys in life. If somehow 2001 passed you by without a trip to the movie theaters Thanksgiving weekend, go find yourself a copy of this iconic, lovely movie.",
    "70": "Once upon a time (and not that long ago), in the vivid, fertile imagination of author J.K. Rowling, a character was born:  A boy.  A young boy named Harry, who was destined to become one of the most beloved characters to emerge from a work of fiction in a long, long time, and was quickly embraced by young and old alike in all corners of the world.  And now, thanks to the magic of the cinema, Harry and his companions fairly leap from the pages of the novel to the silver screen in the phenomenal motion picture, `Harry Potter and the Sorcerer's Stone,' directed by Chris Columbus and written for the screen by Steve Kloves.  Indeed, Harry Potter is a boy, but not just any boy; because Harry (Daniel Radcliffe) just happens to be a wizard.  But, orphaned as a baby, Harry has been raised by his Aunt Petunia (Fiona Shaw) and Uncle Vernon Dursley (Richard Griffiths), who never let him in on the fact that he was, well-- what he was.  It seems that Petunia didn't approve of her own sister-- Harry's mother-- because she was a witch; nor of Harry's father because he, too, was a wizard.  When Harry turns eleven, however, the secret is out of the bag when-- after some strange goings-on-- a giant of a man named Rubeus Hagrid (Robbie Coltrane) shows up at the Dursley's door to collect Harry and take him off to `Hogwarts,' a school for wizards and witches and all who would perfect the gift with which they were born:  The gift of magic!  And from the moment Harry boards the train (from station platform nine-and-three-quarters) that will take him to his destiny, the magic is alive-- for Harry, and for the audience, as well; and it's a journey you will never forget.\tWhat a monumental undertaking to even think of attempting-- translating and transferring this passionately beloved work from novel to the screen. Because to millions of people, Harry and his companions are so much more than merely characters in a book; these are characters for whom people have made a special place in their hearts, which puts a great burden of trust upon the man who would attempt to bring them to life.  And Chris Columbus, it turns out, was the right man for the job.  More than rising to the occasion and with some magic of his own-- and a lot of help from an extraordinarily talented cast and crew-- Columbus has delivered a film that is not only true to the story, but true to the very spirit that makes Harry Potter so special.  The special effects are absolutely beyond astounding, and Columbus, with a keen eye for detail and without missing a beat, keeps it all on track and moving right along at a pace and with a sense of timing that makes this an absorbing, thoroughly entertaining and enjoyable experience from beginning to end.  From the opening frame you get the feeling that you're about to have a singular experience; and you're right. Because you've just entered the world of Harry Potter.  And it's magic.\tEven having the best special effects do not a great movie make, however, and this film is no exception; what catapults this one to the top are the performances, beginning with Radcliffe, whom you quickly forget is an actor playing a part.  And that about sums up what kind of a job this young man does here.  Without question, he IS Harry Potter, physically and emotionally, and when he waves his wand and does what he does, you believe it.  A wonderful performance by a gifted actor who has a great career ahead of him; without question the perfect choice for the role of Harry.\tAlso turning in excellent performances are Rupert Grint as Ron Weasley, and Emma Watson as Hermione.  As with Radcliffe, the casting here could not have been more perfect.  Grint is `Everyboy,' with that special glint in his eye and a manner that makes him especially endearing.  And the spunky Watson adds some real sparkle to the film as Hermione, the one with the sense of urgency and the wherewithal to get things done; a real role model for young girls everywhere.\tIt's obvious that a lot of care went into the casting of this film, and it's a big part of why it is so successful.  Richard Harris, as Headmaster Albus Dumbledore; Maggie Smith as Professor McGonagall; John Hurt as Mr. Ollivander; Ian Hart as Professor Quirrell.  Exceptional performances from one and all, with two that stand out as especially memorable:  Robbie Coltrane, who readily conveys the fact that Hagrid's heart is of a size that matches that of the man; and Alan Rickman, as Professor Severus Snape, deliciously droll while demonstrating menace through the fine art of articulation.  \tThe additional supporting cast includes John Cleese (Nearly Headless Nick), Warwick Davis (Professor Flitwick), Julie Walters (Mrs. Weasley), Zoe Wanamaker (Madame Hooch), Tom Felton (Draco Malfoy), Harry Melling (Dudley) and David Bradley (Filch).  From Rowling's imagination to the written page to real life (albeit via the movie screen), `Harry Potter and the Sorcerer's Stone' is a triumph many times over; a unique film of truly universal appeal, the likes of which is as rare as, well-- a sorcerer's stone.  A film in which adults and children alike will rejoice, because it speaks to the heart in a universal language of life, love, experience and imagination; a film that states unequivocally that magic exists-- as long as there's a single child with a single dream somewhere in the world, and real wizards like J.K. Rowling, Chris Columbus, Steve Kloves and every member of this wonderful cast and crew around to bring it to life as they have here.  An instant classic in every sense of the word, this is truly a film for the ages.  A remarkable achievement, this IS the magic of the movies.  I rate this one 10/10.",
    "71": "Ah, the first film adaptation of the beloved Harry Potter series. Harry Potter is an 11-year-old boy who comes to find out that he is a wizard. He lives with his uncaring Muggle (non magic) aunt, uncle, and cousin since his parents died when he was a baby. They were murdered by a dark and powerful evil wizard named Lord Voldemort. Harry would be dead too, but was miraculously saved, making him something of a legend. Upon learning of his guarded magic roots, Harry gets enrolled in Hogwarts- a British school for witches and wizards. While there he learns to come into his own, meet people that are actually good to him, and learn more of his dark past. Looking back, I don't know if it was a good idea to have Chris Columbus direct this, as he does have a reputation for being something of a hack, albeit a decent one. I think his direction is okay here. Yeah, retrospectively it could have been better, but it could also have been much worse. At least with him at the helm we get a good amount of whimsy to go along with a bit of menace, and that's a good thing, as the book was likewise not too heavy on the darker stuff (though that sure changed as time went on). Many liberties are taken, which is weird since the book is quite short, and the film is two and a half hours. It does get the point across decently enough though, and also works as a piece for those unfamiliar with the source material. John Williams provides great music, there's wonderful art direction and set design, and there's some nifty set pieces too. Featuring an all-British cast, this film is impeccably cast, and the performances are good too. Finding decent child actors is hard, but they really scored here. My enjoyment of this movie has waned over time, but it's still not a terrible piece of work by any means, so check it out.",
    "72": "I watched this movie first time when I was left with no choice. My expectations were extremely low as I always wondered if Harry Potter books were over-hyped. How-ever after watching the movie it did make me a Harry Potter movie fan. And needless to say - this continues to remain my favourite of HP series. That brings to a point here.... the effect of expectations over a movie. True, expectations reduce joy.Without going into the story I would certainly say Chris Columbus churns out a perfect pot-pourri of emotions, suspense and magic, delivering something appealing to all ages.Every character brought to life on screen has done justice and leave an impression on you. Particularly notable performances by Emma Watson and Alan Rickman.CGI are in plenty and made good of. The Quedditch game is picturised amazingly. The wizard's chess is treat to eyes.Let's hope that the forthcoming HP series carries the similar magical touch.",
    "73": "I really liked this film, but I much prefer the book, which has a lot more magic and wonder. Daniel Radcliffe is very likable as Harry, and he is given solid support by a funny Rupert Grint and a good Emma Watson, though she was annoying at times. The scene stealer was definitely Robbie Coltrane; I actually can't imagine anyone else playing Hagrid, Coltrane was just hilarious. Alan Rickman and Maggie Smith were also great, but for me the standout was the late Richard Harris. Now I much prefer Harris's interpretation of Dumbledore. He was soft-spoken, and actually fitted the part better. Both of these qualities were lost in the interpretation that Michael Gambon gave. I am not saying that Michael Gambon was bad, he just wasn't my ideal choice for Harris's replacement. The film is fairly faithful to its source material, and looks very beautiful. However, it is a bit long, and very young children may find Voldemort too frightening. I know because I have triplet brother and sisters who saw it, and couldn't sleep for about a month after viewing. In conclusion, a very good film, well performed and quite dark. 8/10 Bethany Cox",
    "74": "I enjoyed this movie immensely. But, like \"The Phantom Menace,\" I've had a very hard time viewing it objectively. There was so much anticipation leading up to its release, I simply enjoyed the experience of being there. Having read all four books in the series a few times each, I am overly familiar with the events in the story. As I watched the movie, my continuing thought was \"How well will the next part of the story be translated to the screen?\" rather than \"How entertaining is this film overall?\" I have trouble answering the latter question because I was already entertained by watching a wonderful story dramatized, so I'll never know how I'd have reacted had I seen this movie without having read the books.Critics talk about how incredibly faithful the movie is to the book, and perhaps I'd have had an easier time detaching the two in my mind had the movie set off on its own course. Indeed, many classic children's movies, like \"The Wizard of Oz\" and \"Mary Poppins,\" are so successful partly because they're so different from the books that inspired them. But these are exceptions; in my experience, most children's movies reveal their weaknesses in how they diverge from the books upon which they're based. And much of what makes the Harry Potter phenomenon unique is that it is the first time in ages that a children's book, without a movie accompanying it, has generated this much popularity. According to an article I read a year ago, the universe of Harry Potter has become as real in the minds of youngsters and adults as that of a popular movie series like Star Wars. Therefore, it will be very hard for any film based upon it to compete with it. In the minds of die-hard fans, any changes made to the story will be seen as desecrating the fantasy world that Rowling created. That's why it's easy to understand why the filmmakers were so reluctant to change anything.As a faithful rendering of the book squeezed into a two-and-a-half hour period, the movie is beautifully done. I don't have a single complaint about any of the actors, who successfully bring to life, with the aid of costume design and special effects, the many colorful characters from the book. My favorite character, the giant Hagrid, is played by Robbie Coltrane, and I say with no exaggeration that he is exactly how I imagined him while reading the book. It's as if they took the image in my mind and transferred it to the screen. While I had my own personal image of Snape (for some reason, I always imagined him as the head villain from another Chris Columbus film, \"Adventures in Babysitting\"), Alan Rickman is perfect in the role. I usually expect to have words of criticism for some performances, but I just don't. The remaining adult actors, including Maggie Smith as Professor McGonagall and Richard Harris as Albus Dumbledore, are as good as they possibly could be, and the kids do an excellent job of holding their own against these veterans. Some have criticized Daniel Radcliffe for appearing too subdued in the title role, but that's exactly how the character is portrayed in the book: modest, unassuming, and laid-back. The kids who play Harry's two best friends are flawless.I had a lot of worries about the fact that it was being directed by Chris Columbus, whose entire directorial career so far has consisted of over-the-top slapstick films. I was pleasantly surprised that he did not direct the Harry Potter film in this way. Except for brief moments like the children's delayed reaction to a giant three-headed dog they encounter and Harry's swallowing the quaffle ball, there is nothing here to remind us that this film is directed by the same person who gave us films like \"Home Alone\" and \"Mrs. Doubtfire.\" Indeed, I think Columbus may have gone just a tad bit too far in trying not to make the film seem cartoony. I would have liked to see a little more emotion on the actors' faces at certain times. Overall, however, his restraint works nicely in giving the film the kind of believability the book possesses.But much is left out. Harry's caretaker Uncle Vernon, a prominent character in the book, is given less attention in the movie than some of the bit characters. The gently satirical aspects of Hogwarts School aren't in the movie at all. We never see the ghostly history teacher who died several years back but kept on teaching. Lines like the following--\"Professor McGonagall watched [her students] turn a mouse into a snuffbox--points were given for how pretty the snuffbox was, but taken away if it had whiskers\"--find no equivalent in the movie. The movie does include platform nine-and-three-quarters, though the way the kids disappear into the wall isn't as mysterious as I had visualized, and the sorting hat is there, minus the great poem explaining the differences between the four schools.Not that I'm blaming the movie for omitting some details. Some things from the book would not have translated easily to the screen, and it would have been very difficult to stick everything in. Had Columbus done so and allowed the film to be as long as necessary (eight hours, maybe?), like a BBC miniseries, the film might have been a masterpiece, but few kids would ever have had the patience or attention span to sit through it.The problem is that the amusing details are much of what make Harry Potter such a special story. A whole universe is created in Rowling's series, in which a magical society exists within our own ordinary \"muggle\" world and is kept secret by a bureaucracy with its own rules, history and politics. The way magic is treated in her books, not as something medieval but as very similar to the way our own contemporary world works, is a large part of their charm. Take away these details, and you're left with a fairly conventional tale of a young wizard fighting an evil sorcerer.Although the audience I was with broke into applause as soon as the movie ended (something I've never seen happen before, though I don't go to the theater that often), some people have complained about the movie dragging at certain points. I didn't have that problem, but, as I said, I wasn't really trying to get involved in the movie's story. After thinking about it, it does seem like parts of the movie fail to convey a sense of urgency. Why should this be? I never felt that way when reading the books, and this is without a doubt the very same story.The answer, I think, is that the books portray much of Harry's anxiety in trying to succeed in school (for if he's kicked out, he'll go straight back to his horrible uncle) and fit in with the kids there. The movie doesn't tap into these anxieties enough, so why should we care whether he wins the Quidditch match (other than that he survives in one piece) and gets through the school year? The only real suspense in the movie after he arrives at Hogwarts comes from the story of Lord Voldemort returning, which in the book is almost secondary. Harry's adventures getting along in the school are fun and interesting, but as they are presented to us in the film, there isn't enough tying them all together.What we have here is a serviceable dramatization of a wonderful children's series, but it doesn't entirely succeed in standing on its own. Perhaps it should have diverged from the book just a little, to compensate for the difficulties in translating some of the book's delights to the screen. In its current form, it's almost like a preview of the book. Its lack of fullness, and its dependence on the book, might actually increase the popularity and endurance of Rowling's series by making those who see the film yearn for more, which they can get from the real thing.",
    "75": "Harry Potter and the Philosopher's Stone is a film directed by Chris Columbus. For many years, I hadn't given a damn about the Harry Potter series. But seeing the fanfare surrounded by the series, I decided to give it a try. After watching this one, I can definitely say that I am on the verge of being a fan.Plot: Harry Potter, an orphan living with his uncle and his family is invited to Hogwarts School of Magic to become a wizard.Story and direction: I had watched this part around the time it released but never just kept in touch since I didn't understand a word. Seeing it now as an adult and a movie lover, I just fell in love with this fictional world created. The characters, settings, story, etc.. all just feel seamless. Thanks to J K Rowling, Steve Kloves and Chris Columbus who have done justice to the source material provided to them. I feel the themes are so very relevant in this film. The intricacies of those themes are valid in the current world we do live in. This is what I just exactly want from any story presented to me. Although the film is very long, I never felt bored for a single moment. And to adapt quite a huge novel comes with responsibility and precaution, which the makers completely justified. The sets are huge and awesome. You just feel you are in Hogwarts actually. Also each characters costume is just to marvel at. John Williams once again just proves why he is the composer of the century. But I did feel some flaws to the film. Being a first film, the main plot of the film comes at around the 90th minute of the film. Also the VFX of the film felt very amateur considering some great VFX was done in the years preceding this film.Performances: I would say that the casting of the film is just perfect. Applause for the casting team is deserved. Never do you feel that another actor should play the role. The kids, Daniel Radcliffe, Rupert Grint, Emma Watson, Tom Felon just to name a few are fantastic. These 10-11 year old just steal your heart. Also the other cast like Richard Harris, Maggie Smith, Alan Rickman, Robbie Coltrane make themselves likable.Favorite Scene: There were many favourite scenes in this film for me. But one scene in particular was the troll scene where Harry and Ron decide to save Hermione and after the saving Hermione vouches for the boys. This is the scene where you actually happen to see the bond solidified between the 3 as friends.Verdict: For anyone who just loves fantasy film and worlds with great visuals, this film is just for you. I assure you won't be disappointed. I plan on seeing the entire series now because I am fascinated by this world and want to see what else has it got to offer.I am going with an 8/10.",
    "76": "During my childhood, the earlier Harry Potter books got me into the franchise and especially Fantasy Literature in general. They had thought provoking writing, likeable characters, and compelling world building. Then I saw this movie adaptation of The Sorcerer's Stone (The Philosopher's Stone in the UK) back in theaters and loved it. It's not a perfect film I'll admit, but it's a very good start to a successful fantasy movie franchise.Sure, it's a bit overlong and the child performances from Daniel Radcliffe, Rupert Grint and Emma Watson, while not terrible by any means, could have used some fixing though they did get better as the later movies progressed.Everything else still holds up. The visual effects/cinematography are beautiful to look at, the directing from Chris Columbus is great, the make up designs are well built, and the music score from John Williams is enchanting and haunting especially Hedwig's Theme. Not to mention the supporting actors are great with Robbie Coltrane as Harris and the late actors Alan Rickman and Richard Harris as Severus Snape and Professor Dumbledore.Overall, Harry Potter and the Sorcerer's Stone isn't perfect but it's a very good start to the successful fantasy movie franchise after 20 years. Recommended! :)",
    "77": "To millions of children of all ages, November 16 has been more eagerly anticipated than Christmas, as the long-awaited film version of J. K. Rowling's beloved novel \"Harry Potter and the Sorceror's Stone\" hits the screen.Each of Rowling's four Harry Potter books have been critically acclaimed worldwide best-sellers, turning a generation of video-game playing children into avid readers.In translating Rowling's world of wizards and magic to the screen, the film makers claimed to be intensely aware of the fans' high expectations and had sworn to be faithful to the book.\"Harry Potter and the Sorceror's Stone\" is indeed the most loyal film adaptation of a book that this fan has ever seen.It's the story of an orphaned boy who discovers on his eleventh birthday that his parents were wizards and that he is in fact a famous and powerful wizard himself.Released from the clutches of his desperately ordinary (and non-magical) Uncle Vernon and Aunt Petunia - and their deliciously obnoxious son Dudley - Harry takes his place in the wizarding world as a first year student at the venerated Hogwarts School of Witchcraft and Wizardry.A great deal of \"Harry Potter and the Sorceror's Stone\" is an introduction to this fantastic and dangerous world and its richly drawn characters. There's not only a lot of plot to cover in this film, but an entire world to create.At two and a half hours long (hit the restroom before it starts), the film includes the book's most memorable scenes, bringing many of them to life with pure cinematic wizardry.The Quidditch match (a soccer/hockey/rugby thing played on broomsticks) is much more exciting on the screen than on the page, as is the bathroom battle with an enormous mountain troll and the larger-than-life game of wizard's chess.The frightening aspects of the book are in full force in the film, and its PG rating (for some scary moments) should be taken seriously.\nScreenwriter Steven Kloves (\"Wonder Boys\") has done a fine job of streamlining Rowling's tale while maintaining its spirit. Director Chris Columbus (\"Home Alone\") makes good on his promise to be faithful to the book. But at times the film is a bit too reverent; you want the actors to cut loose and have a bit more fun.Columbus clearly understands that fantasy works best when it's played most real. Across the board, his fine ensemble of actors are so perfectly cast that they appear to have literally stepped out of Rowling's book.\nIn the title role, Daniel Radcliffe pulls off the very difficult task of playing an introverted hero who spends most of the movie reacting to the amazing sights and events around him. He beautifully captures the deep soul and untapped potential of Harry Potter. And when this kid smiles the screen lights up.Rupert Grint is delightful as Harry's sardonic buddy Ron Weasley and Emma Watson nearly steals the film as their overachieving friend Hermione Granger. Three cheers to the film makers for giving three unknown child actors the top billing they deserve.The strong cast of veteran actors includes Richard Harris as the wise Headmaster Dumbledore and Robbie Coltrane as the lovable giant Hagrid. Alan Rickman is wonderfully villainous as Professor Snape and Zoe Wanamaker has just the right touch of girls gym teacher as flying instructor Madame Hooch.\nAs the strict but just Professor McGonagall, Oscar winner Maggie Smith seems born to play the role - and is ready for another Oscar.John Cleese (as Nearly Headless Nick) and Julie Walters (as Mrs. Weasley) have all-too-brief cameo roles, but if the next film \"Harry Potter and the Chamber of Secrets\" remains true to the book, we'll be seeing more of them.In addition to being highly engaging, the film is a marvelous thing to look at. From the bustling wizard street Diagon Alley to the magnificently gothic Hogwarts School to the dark and misty Forbidden Forest, the film breaks new ground in imaginative production design.To paraphrase the film's tagline, let the magic (and box office records) begin.",
    "78": "HARRY POTTER / (2001) *** (out of four)Here's a method of evaluating a movie based on previously published material: ask yourself if the film makes you want to read the material from which it is based?  Before the release of \"Harry Potter and the Sorcerer's Stone,\" I was one of the few remaining souls who had not read J.K. Rowling's fantasy book series. After screening the first film installment, I did want to read the book. Borrowing the novel from a family member, I briefly skimmed over the chapters. The book's intelligence and similarities with the film really surprised me.  With over 100 million copies sold in over 46 different languages, J.K. Rowling's best-selling series of books has become a worldwide phenomenon. Naturally, with soaring expectations abound, the filmmakers felt great pressure to create a faithful adaptation. They have. This film is essentially a visualization of the words in the novel, with very few differences. That said, the film does run into a few conflicts with the book's story. The middle of the movie has nowhere to go. It's like a false second act; almost nothing of major significance occurs in this period of the film. The young characters wander from scene to scene with nothing much to do and nothing much to say. We're left with a grand display of eye-popping special effects.\n\"Harry Potter\" certainly dazzles us with a solid beginning and an engaging final act, however. We first meet a young wizard boy named Harry Potter (Daniel Radcliffe). Soon after the film opens, the boy discovers he has magical powers. He's then thrust into an enchanting world of sorcery, magic, and witchcraft. He's sent to a school for young wizard children, where he meets new friends, learns about magic, and participates in fun competitions. But someone at the school doesn't like Harry, as mysterious events begin to occur. Harry soon finds himself in the middle of a diabolical scheme of revenge. Who is the culprit and what do they want with Harry?\nThe film asks some involving questions. Too bad it doesn't give enough depth to the side characters or subplots. We don't really care about the mystery because we don't know enough about the suspects. The movie does conclude with a twist, but it doesn't encourage another examination of the movie. It lacks a foundation altogether. The story spends so much time foreshadowing the villain's identity, it is pointless for the story to abandon its proceeding plot points and develop a new villain at the end. The book gets away with this; the movie does not. After his gentle \"Home Alone\" and sweet-natured \"Stepmom,\" many questioned the ability of director Chris Columbus to bring a sense of darkness to the story-and for good reason. \"Harry Potter\" contains charming, likable characters and a rich pallet of lush, inventive images. Unfortunately, the film lacks an edge. It's missing the dark atmosphere Rowling's novel so vividly brought to life. Columbus does construct some memorable sequences, but the individual scenes themselves are much better than the movie as a whole.Despite it's childish story and pre-teen characters, many define \"Harry Potter\" as a film for all ages. While that's debatable, during my screening, adults were plowing through the isles every five minutes. Going to the bathroom? Getting drink refills? Buying concessions? Who knows? But not a single child budged from their seat. Their eyes were glued to the big screen. Conclusion: It's a sure-fire experience for children, especially if they've read the books. But adults may not encounter the same enticement as kids. Then again, if I had nothing better to do than to count the people leaving the theater, why am I recommending the film?",
    "79": "Harry Potter is a magical and fun movie.Great movie for the whole family, kids will love it and adults will probably also like it.The Harry Potter franchise is the reason i love movies and i love all of them because of that.The characters are great and memorable, i can name every character in the whole franchise and most of the people who is playing them.The story is great and i think JK Rowling did a great job writing it.The acting is good and i think Daniel Radcliffe did a great job as Harry. The rest of the cast was great too.It's long so the middle part of the movie was a bit slow, but it's okay.Overall Harry Potter and the sorcerer's Stine is a great movie for all ages.",
    "80": "That's it! I give up! I surrender! White flag! My friends want to see the new Harry Potter that is about to be released this summer, The Order of Phoenix, but they looked at my like I just lost my head when I told them I never saw the Harry Potter films. They just said I've seen every movie yet I never saw Harry Potter? Well, I never saw the point since I don't read the books or wasn't interested in the films, it looked like typical kid's stuff to me. But my friends said they would not take me to see the movie until I've seen the films, it's now that I realize I got myself into trouble since these movies are all 2+ hours each. I just finished the first one a couple days ago.Harry Potter lives with an extremely cruel family, but there is something different about him, he can talk to snakes and make things appear and disappear. Well, he receives a letter, he's a wizard! Not just any wizard, he is the only wizard ever to survive the wrath of Voldemort, the most wicked wizard. Harry goes to a magical school, Hogwarts, where he learns the truth of his heroic parents and meets two other wizards, Ron and Hermione who soon become his best friends and they discover the power of the sorcerer's stone and what might happen if it's put into the wrong hands.Harry Potter I have to admit is off to a good start with me, it had wonderful and magical effects that anyone could enjoy. The actors were just so perfectly cast, Maggie Smith, Alan Rickman, John Cleese, we have some of England's most brilliant actors. It's a well made film, now I still haven't read the books, so I can't base this film on a comparison. Even if I did, this is the movie and the movie itself is a magical and enchanting experience. Well, I'm onto The Chamber of Secrets, wish me luck.7/10",
    "81": "Harry Potter and the Sorcerer's Stone (2001) *** (out of 4)Harry Potter (Daniel Radcliffe) is taken away from his obnoxious and abusive aunt and uncle and taken to the Hogwarts Academy where he's going to learn to become a wizard. He becomes friends with Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson). It doesn't take long for Potter to learn about his past as well as what's expected of him in the future.I'm going to be really honest and admit that I've never read a single line of any of the novels and in all honesty I never really paid too much attention to what they were even about. I'm watching this first film on March 15, 2016 so that's nearly fifteen years since this was released so obviously you can't say I'm a fan of anything involving the characters. I really wasn't sure what to expect going into the movie but by the time the end credits started there's no doubt that I was left entertained.I thought for the most part this was a pretty entertaining film and I think everyone got it right in regards to the casting. I mean the three leads are all extremely good for their roles and I thought all of them managed to help carry the film. Radcliffe was certainly believable in the role of this master wizard and I thought both Grint and Watson added a lot of charm. Then you've got the likes of John Cleese, Alan Rickman, John Hurt, Maggie Smith and Richard Harris.I'm not normally a fan of CGI heavy movies but I thought it was perfectly used here and never really took away from the story. Instead of taking away from the story it actually did a very good job at adding to this alternative universe and the various magic that is to be found in it. Technically speaking the film was certainly well made with a ripping score, great effects as well as fine editing and cinematography. If I had to say anything negative about the picture it would be the incredibly long running time.",
    "82": "We live in a world where economics is hard. This forces practical limitations when making a movie. Time and money are sadly finite, cinema owners need to be pleased as well as fans and computer animation ain't perfect. Given these limitations, this film is about as close to human perfection as it is possible to achieve. However, it's extremely clear what an immense challenge it is to turn Philosopher's Stone from book to film.Two and a half hours is not long to explore a wonderful, magical world. Furthermore, the directors have bowed to the inevitable temptation to show us things that cannot be communicated so effectively in a book. The consequence is the feeling of a slightly breathless sprint in places.It also means that the movie has to stay true to the spirit of the book rather than to the letter of it. There are omissions and there are changes. The changes that were made capture and maintain the spirit of the story really well; indeed, there are places where the story is more clearly and straightforwardly told in the movie than in the book. Some aspects of the story are fleshed out on screen and the additions are delightful, completely in keeping with the flavour of the world.The humour of the movie is inevitably more visual than that of the book; no belly laughs, but a lot of smiles. Some punchlines have changed, but the reasons why the jokes are funny remain the same. Not knowing exactly what's coming next is a good thing! It's all kept tasteful, classy and above the belt; there's nothing to cringe about.The voice acting is almost uniformly brilliant. However, there are occasions where some of the actors are required to convey high emotions and are only given a second or two of face shot, or head-and-shoulders shot, to do so. This isn't as much freedom as they need and they fall a little short. The blame here must fall on the decision to give the actors too much to do too quickly, not on the actors themselves.Other than these rare jarring instances, the physical acting is frequently excellent and seldom less than completely adequate, judged against the highest of targets set by the book's clear emotion descriptions.Dan Radcliffe has the look, the mannerisms and the charm of Harry down pat. His strongest expressions are the bemusement that must be inherent at entering a world where science does not rule alone and the bravery that Harry shows in his achievements. Emma Watson possibly slightly overplays Hermione, but does so in a fully endearing fashion. There's one scene which gives her too little chance to truly express panic; otherwise her performance needs no changes.Rupert Grint has comic timing way beyond his years, hitting Ron's lines perfectly. Tom Felton makes a stylish Draco; Matt Lewis' Neville character suffers from the acceleration, so the finale does come as a slight characterisation shock.The Phelps brothers' Fred and George are distinctively cheeky rather than proactive pranksters; Chris Rankin imbues Percy with genuine authority. Sean Biggerstaff shines; his Oliver Wood is likeable and an ideal Quidditch team captain.Robbie Coltrane's Hagrid is the single dominant adult character, with maximum laughs extracted at every step. The movie changes strongly exaggerate one side of Hagrid's nature, though; probably inevitable considering how much plot exposition his character has.David Bradley has a vicious Argus Filch; John Hurt's Ollivander is an eccentric treat, giving a wonderful introduction to the Wizarding World. The professors are uniformly excellent, though Richard Harris' Dumbledore comes off as disappointingly flat until the end.The most ambitious point of the movie is the computer generated imagery. The stills are wonderful, but the fastest animation is restricted by the limitations of real-world technology. The book makes extremely stringent demands of the CGI; sometimes their overall effect in the movie is merely good rather than insanely great. Some of the magic spells and effects look awesome; others don't capture the imagination nearly so much.The world cannot yet completely convincingly animate human beings doing inhuman things, which serves as a clear reminder that you need fictional magic to make the impossible possible. The Quidditch scene is the most demanding of them all; while the sequence is action-packed and good-looking, disappointingly, it's not a total success. Perhaps some of the scenes would have been better with more conventional special effects? (For instance, the lower-tech-looking Sorting Hat scene is one of the most delightful of them all.)The set looks gorgeous. However, it may not stand up to detailed analysis. It's fairly obvious that things are shot in many disparate locations, rather than one big Hogwarts School near Hogsmeade.The score is absolutely wonderful. The soundtrack may rely too heavily on The Famous Bit, but it's clear that the balance and mixture of things in the finished movie are exactly right.The feel of the whole movie is everything fans could have hoped for. The dialogue is intensely measured, the colouring is suitably epic, the selection of what to leave in is really tightly considered. You get chills in your spine at the right places; you feel the triumphs as all-encompassing endorphin highs. It's clear that the production have thought long, hard and lovingly. They are true fans of the story, they are the right people for the job, it all bodes very well for the second film.So it could never have been the film that the hyper-literalists were hoping for, then, but it is as good as the practicalities of the real world could possibly permit. Don't expect miracles and you'll love it. I look forward to watching it again and again.8/10 at the very least. A really satisfactory film!",
    "83": "First episode also known as ¨Harry Potter and the philosopher's stone¨ deal with Harry Potter (Daniel Radcliffe)and friends fighting dark forces in an amazing adventure . In this early installment of JK Rowling saga, our protagonist is freed by Rubeus from the custody of his selfish uncle (Richard Griffiths) and miserable aunt (Fiona Lewis). Harry goes his destiny at Hogwart's school , there meets our friends Ron(Rupert Grint) ,Hermione(Emma Watson) and his enemies Braco Malfoy(Tom Felton), along the dark forces which threatens Hogwart, and finally Lord Voldemor . Besides the professors as Minerva(Maggie Smith), Severus Snape(Alan Rickman), Dumbledore ( Richard Harris), Madame Hooch (Zoe Wanamaker), Quirinus (Ian Hart)and of course Rubeus(Robbie Coltrane). Here some legendary events take place , including a Quiddich match, and Harry Potter competes in confronting in series of dangerous happenings , challenging monsters as unicorn, centaur and horrible creatures and an ending spooky climatic battle .This episode contains loads of adventures and action and is such deeply riveting and emotional as its followings , furthermore gets lots of bombastic special effects and several images have you on the edge of your seat including an amazing array of technical bizarre creatures, a breathtaking ogre ,a three-head animal , and Potter fighting creepy , scary monsters and an exciting final taking on between Harry and the Dark Lord and his henchmen . The picture displays stimulating action set pieces illuminating the full-blown adventures , blending wizardry, witchcraft, horror, humor and is extremely amusing and pretty enjoyable. Darkest even that subsequent chapters is thrilling, dramatic, touching and very exciting. Provide enough amusement to keep the chat rooms humming until the epic ending comes out . In spite of overlong runtime, it suffers from over-length, and the difficult of adapting, the film still managing to keep a quick enough pace for those unfamiliar with the literary and highly detailed work by J. K. Rowling. The motion picture is splendidly filmed with sensational production design and colorful cinematography by John Seale . Phenomenal and spectacular music by master John Williams. The movie is magnificently directed by Chris Colombus . The film is for Harry Potter saga lovers as well as neophyte who have never read J. K. Rowling novels. The follow-up titled ¨Harry Potter and the goblet of fire¨ verse pretty much the same at the first one .",
    "84": "Based on the book Harry Potter and the Sorcerer's Stone, this is the first film in the Harry Potter film trilogy, a story about a young boy (Harry Potter) who is rescued from the clutches of a neglectful aunt and uncle and a bratty cousin, and taken to study witchcraft at the Hogwarts School of Witchcraft and Wizardry. There he meets his future lifelong friends Ron Weasley and Hermoine Granger, witches Professor Snape and Professor McGonagall and the school's all-powerful headmaster, Albus Dumbledore. Harry also learns about his connection with the evil dark lord, Lord Voldemort.I think this movie followed the J.K. Rowling's novel very well, including in it most details that capture the imagination, magic, adventure and drama of the story. Director Christopher Columbus and the team of writers and special effects people gave a pretty entertaining and believable movie. And, the acting was spot-on, most notably the brilliance of Alan Rickman, Maggie Smith, Robbie Coltrane and Richard Harris. The rivalry between the school houses Gryffindor and Slytherin were tastefully depicted; I just wished the other two houses, Ravenclaw and Hufflepuff were emphasized a little more. I didn't care too much for the Quidditch match, as I thought it was a long-drawn out ballgame.Overall, it's a good introduction for the film series and I think is one of the best in the series as well.Grade B+",
    "85": "If for nothing else, the Harry Potter films always find a way to give me a great sense of nostalgia. I, like many others, grew up with this franchise. In many ways, this was our generation's Star Wars. It was the 2000's pop culture phenomena. I'm happy to say that the first film, The Sorcerer's Stone, still undoubtedly holds up.I feel like I should first mention just how impressive it is that Warner Bros and their casting directors found the perfect Harry, Ron, and Hermione. Yes, the rest of the film is also impeccably casted with Maggie Smith, Richard Harris, Robbie Coltrane, and Tom Felton just to mention a few, but it's the core three characters that carry this franchise. Watching the three of them play off each other so effectively at such a young age is truly awe-inspiring.Granted, heroes are only as good as their villains, and luckily they have a great one in Lord Voldemort. Even though in Sorcerer's Stone it's hard to really call him in the big-bad, considering he's not resurrected yet, but his presence is definitely felt. With that said, I wish they would have involved Professor Quirrell more in the main plot. He's a sketchy guy, but you never get a real sense that he's working to resurrect Voldemort. In fact, he's barely in the movie, so his presence towards the end is unexpected, but I didn't feel like it was earned.But the mishandling of the villain doesn't diminish the tremendous amount of fun The Sorcerer's Stone brings to the young franchise. Chris Columbus does a nice job of setting up all the relationships and characters we will come to love later like Hagrid, Dumbledore, and even Snape. This is clearly focused on the trio, but they each get a chance to chew up some scenery with the young wizards. Everything from a clumsy giant, the dark forest, a game of quidditch, to an important game of chess make The Sorcerer's Stone one of the most memorable entries into the Potter franchise. +The trio are effortlessly cute and entertaining+Pacing+All the beloved characters sprinkled in+Balances a bunch of genres in one-Villain reveal is iffy8.4/10",
    "86": "Harry Potter and the Philosopher's Stone is a terrific movie with a very well developed storyline and a talented cast. It's a delight to watch, I've seen this movie numerous times and it never fails to make me smile, to cheer me up when I'm feeling down, the Harry Potter franchise is magical both inside and out, and it's simple fun to watch Harry go in to his first year at Hogwarts, the story's quite simple as the series kicks off with a light start, but it will still leave you wanting more. The films biggest flaw is, at times, it is too faithful to the book that it is based off, I'm sure this is pleasing for anyone who's read the book, but for those who haven't it tends to drag out at times, more than an hour passes before Potter even goes to Hogwarts and the main adventure dosen't unfold properly until at least one hundred minutes in, it can get a little tedious at times and that's why I'm giving it an eight instead of a nine that it easily could have received. The cast is outstanding, the young cast members are ridiculously talented for their age, Daniel Radcliffe seems to have no trouble playing a lead role, and both Rupert Grint and Emma Watson shine as his closest friends, they never lose a single bit of likability. They are joined by a terrific adult cast, including the likes of Alan Rickman, Maggie Smith, Robbie Coltrane and, the highlight of the movie for me, Richard Harris, he shines as Professor Dumbledore (sadly only for two movies), his characterization is perfect, he is wise, heartwarming and simply a lovable character. It may be a bit slow at times, but Harry Potter and the Philiosopher's Stone never loses its sense of fun and magic, and because of this it is a perfect film for the whole family to watch and enjoy. A young boy learns the truth about his special powers, that he is a wizard and must prove his worth at Hogwarts School of Witchcraft and Wizardry. Best Performance: Richard Harris Worst Performance: James Phelps",
    "87": "I feel, next to Willy Wonka and the Chocolate Factory, Harry Potter and the Sorcerer's Stone is the best book-to-movie adaptation that I've ever seen. The sets were stunning - the actors were first rate - the effects were breathtaking.  The film flowed quite smoothly in it's transition from page to screen, never tripping on the awkward conventions that other books on film have struggled with.   The screenplay, by Steven Kloves, stripped away all unnecessary elements to get to the root of the story.  Though many events from the book were excluded, the essential ones made it to the film. And it makes for one smooth story and very enjoyable movie-going experience.Many kudos to Chris Columbus and the rest of the Harry Potter cast/crew for not turning this movie into what it easily could have become:  a 2 and a half hour commercial advertisement for action figures and collectibles, kid's meals and fast food tie-ins, soft drinks and snack products, etc. and instead focused on bringing J.K. Rowling's story to life as accurately and as lovingly as it deserves.  There has been much speculation on whether Columbus was the correct choice for the first two installments of the series and I say to that, Yes.  I feel that he accomplished what most would have failed.  He has proven, at least to me, that Diagon Alley truly exists - if only I could find the right brick to tap on.  The world of Harry Potter is no longer fantasy to me, but instead a place where any of us mere Muggles could hope to visit, one day.One of my favorite moments, is what I'm going to refer to as the Adrenaline Sequence.  By Adrenaline Sequence, I mean the sequence in a movie that for all intents and purposes, doesn't necessarily propel the story, but gives the audience a huge theatrical payoff, ala the Pod Race sequence in The Phantom Menace.  The Adrenaline Sequence for this particular movie is the Quidditch sequence.  I was very happy to finally see the 'hockey/soccer hybrid on a broomstick' come to life.  The Quidditch Sequence is, by far, my favorite sequence in the whole film.  The scene is dizzying in it's violence and it's one breathless moment after another.  My hat goes off to Columbus and his team for succeeding in making this scene as memorable as it should be.Harry Potter and the Sorcerer's Stone is a fantastic movie for children of all ages.  Fans and non-fans alike will enjoy this colorful story of good versus evil and the friendships that endure.",
    "88": "Okay, I never read the Harry Potter Books. I couldn't have cared less, but I have nieces and nephews and other children in my life who are from ages 7 to 12 who have. What I had to do was remember what it was like when I was that age, so long ago, and what \"new\" movies I had to entertain myself with.\nSo...I had \"Oliver!\", \"Willie Wonka and the Chocolate Factory\" and \"Chitty, Chitty, Bang! Bang!\". Other than those, it was \"R\" rated films that I was more interested in.  Why? For that is what interested me via what Hollywood made available. I was \"too old\" for those cutie Disney Animated cartoons of that time, and too young for the adult theme films that were being advertised which I DID want to see. This is why I like this film, it brings back the genre for children, the wonder, the fantasy in film just for them.A nice effort production wise, with the casting, with the story. Children love fantasy, wonder, adventure, a character THEIR age doing and thinking like THEY would and...watching kids eat lots of \"sweets\". This Harry Potter film fit the bill. For me as an adult, it was...nice. For children between 7 and 12, its fantastic. The special effects were neat, the story was engaging for them, but what I liked the best was the school itself. I thought that the classes and interactions of the children with each other were on their level. So it was at a Wizards school. Point is, it could be at ANY school. (or boarding school!)In my surroundings, there have been a few adults/parents screaming about how this film and the school \"Hogwarts\" promotes kids to get into the black arts. I think that is so awful to think that, and I think it does not give children the benefit of the doubt. \"Harry Potter and the Sorcerer's Stone\" is a nice little film about something a child/pre-teen has fun with. I actually compared it to the Disney film \"Fantasia\" and the scene of Mickey being the \"Sorcerer's Apprentice\". I watched that over and over as a 6 year old and trust me, I had no desire to get into \"the black arts\".To me, this film is geared towards that audience that has been forgotten AND portrayed in the last 15 years, the 7 to 12 year olds. Yes, Disney had alot of animation that was marketed to that group of children, but its been quite sometime to make a long full length feature film of fantasy where children are the focus, and they are just...children. Reminds me of \"Willie Wonka and the Chocolate Factory\" and \"Chitty, Chitty, Bang, Bang\"...fantasy films for the 7 to 12 year old to enjoy the movie going experience on their level, but NOT talking DOWN to them.Children under 7 may be a bit scared at some parts and teens over 13 may not get into this film at all. But for the 7 to 12 year olds, this film is a nice one for them in the same vein as \"Oliver!\" and \"Willie Wonka and the Chocolate Factory\" was for me.",
    "89": "Platform number 9(3/4) would have been discovered easily by muggle world as train platform are not that empty.At the place where harry where harry acquires remembrall (bhul na jana). He wins seekers position instead of any punishment. It was awesome.Harry potter as Seeker or khoji wins my opinion. The reason is in spite of wearing spectacles he is assigned such a position. I simply like that.Home is another point where my opinion is that harry could have been located at a better place. A place where he is respected may be with Hagrid. The life could have been made less troublesome.There is a scene where Hermione is in toilet and lies regarding entire situation. I feel if she would have just mention the truth, they would have ended up in even better points.The message boards are gone, so sharing opinion this way.",
    "90": "This movie is a delight for those of all ages.I have seen it several times and each time I am enchanted by the characters and magic.The cast is outstanding, the special effects delightful, everything most believable.You have young Harry, a mistreated youth who is \"Just Harry\" to himself. And then, he embarks on a most beautiful adventure to the Hogwarts school.He meets Ron and Hermione, one an adorable mischief maker, the other a very tense and studious young lady.Together, the trio try to set things right in the school.It's the ultimate fantasy for young and old.",
    "91": "Dropped with his aunt and uncle as a baby, Harry grows up in a loveless home and is made to sleep under the stairs.  On his 11th birthday Harry learns the truth of his past when he is visited by Rubeus Hagrid and invited to attend Hogwart's school for wizards and witches.  Whilst learning his craft Harry and his friends notice some strange things and begin to investigate, leading them deeper into a mystery that involves a dark wizard who killed Harry's parents and a quest for a powerful stone that brings immortality.I had no strong desires to see this film.  I have not read any of the books, nor do I have any plans to as they just don't interest me.  Back in my family home one week I noticed they had bought a copy of this film on VHS and I decided to give it a watch.  I knew little of the plot but it carried me along well enough.  It did seem a little long and that the film was trying to cram as many effects scenes as possible where it should really have been developing characters instead.  Don't get me wrong the effects are all good and hold the interest well, but without the characters I felt like I didn't care very much about the plot.I know this is a children's film so characters aren't that important but that leads me to another point  the running time.  At over two hours I struggled to care enough to sustain my interest.  I don't have kids but I did wonder how many would be able to focus for that long  but I suppose that the reason for throwing in an effects scene every five minutes just to wake them up!The cast is crammed with talent  most of which it fails to make good use of.  In the lead Radcliffe is quite bland and didn't do too much with his role.  Happily Grint and Watson who both are funny and have good characters  even if they are only sidekicks in the film, supported him.  It is telling that recent publicity for the second film has put these two on a par with Harry  even giving them their own posters.  Of the support cast only Coltrane is well used, everyone else just has cameos of one sort or another. Hart, Cleese, Harris, Rickman, Smith etc all have only a few scenes at most and (in the case of Rickman and Cleese) a few lines at most.  This is annoying on two levels.  Firstly, the fact that such talent is wasted and secondly the fact that none of them are allowed characters  only a chance to show their face briefly once or twice.Overall it was enjoyable and will please kids even if only for the regular effects scenes.  It has flaws and it is clearly aimed at those who have Potter fever already.  N the strength of this I will not be going to see the second film until someone gives it to me to watch.  It's a good film but it feels like it is made to see Happy Meals and start a franchise than to be a good film in it's own right. (as a side note  I find it hilarious that it had to be renamed for the USA as the studio felt that the word `philosopher' would confuse American audiences who didn't know what it meant!)",
    "92": "This masterpiece must be preserved perfectly to all the generations to come. This is a genius simple story that everyone can relete to sometime in their life. Every humans desire to escape from reality for a while, this excellent film series is one of the greatest series, if not the greatest and never gets old.It is perfect in every detail and must be remembered as one of the best in movie cinematic history and really should be seen by everyone at least one time in their life.The series gets even deeper and deeper as the story develops.The first time i watched this and still to this day im still as enchanted by the universe of Harry Potter, as when i was a kid. Its just one of the most perfect stories that mankind ever told.If you havent seen this fantastic movie, you really have too see it. Theres no excuse. Its a classic!",
    "93": "Based on the book Harry Potter and the Sorcerer's Stone, this is the first film in the Harry Potter film trilogy, a story about a young boy (Harry Potter) who is rescued from the clutches of a neglectful aunt and uncle and a bratty cousin, and taken to study witchcraft at the Hogwarts School of Witchcraft and Wizardry. There he meets his future lifelong friends Ron Weasley and Hermoine Granger, witches Professor Snape and Professor McGonagall and the school's all-powerful headmaster, Albus Dumbledore. Harry also learns about his connection with the evil dark lord, Lord Voldemort.I think this movie followed the J.K. Rowling's novel very well, including in it most details that capture the imagination, magic, adventure and drama of the story. Director Christopher Columbus and the team of writers and special effects people gave a pretty entertaining and believable movie. And, the acting was spot-on, most notably the brilliance of Alan Rickman, Maggie Smith, Robbie Coltrane and Richard Harris. The rivalry between the school houses Gryffindor and Slytherin were tastefully depicted; I just wished the other two houses, Ravenclaw and Hufflepuff were emphasized a little more. I didn't care too much for the Quidditch match, as I thought it was a long-drawn out ballgame.Overall, it's a good introduction for the film series and I think is one of the best in the series as well.Grade B+",
    "94": "If for nothing else, the Harry Potter films always find a way to give me a great sense of nostalgia. I, like many others, grew up with this franchise. In many ways, this was our generation's Star Wars. It was the 2000's pop culture phenomena. I'm happy to say that the first film, The Sorcerer's Stone, still undoubtedly holds up.I feel like I should first mention just how impressive it is that Warner Bros and their casting directors found the perfect Harry, Ron, and Hermione. Yes, the rest of the film is also impeccably casted with Maggie Smith, Richard Harris, Robbie Coltrane, and Tom Felton just to mention a few, but it's the core three characters that carry this franchise. Watching the three of them play off each other so effectively at such a young age is truly awe-inspiring.Granted, heroes are only as good as their villains, and luckily they have a great one in Lord Voldemort. Even though in Sorcerer's Stone it's hard to really call him in the big-bad, considering he's not resurrected yet, but his presence is definitely felt. With that said, I wish they would have involved Professor Quirrell more in the main plot. He's a sketchy guy, but you never get a real sense that he's working to resurrect Voldemort. In fact, he's barely in the movie, so his presence towards the end is unexpected, but I didn't feel like it was earned.But the mishandling of the villain doesn't diminish the tremendous amount of fun The Sorcerer's Stone brings to the young franchise. Chris Columbus does a nice job of setting up all the relationships and characters we will come to love later like Hagrid, Dumbledore, and even Snape. This is clearly focused on the trio, but they each get a chance to chew up some scenery with the young wizards. Everything from a clumsy giant, the dark forest, a game of quidditch, to an important game of chess make The Sorcerer's Stone one of the most memorable entries into the Potter franchise. +The trio are effortlessly cute and entertaining+Pacing+All the beloved characters sprinkled in+Balances a bunch of genres in one-Villain reveal is iffy8.4/10",
    "95": "Harry Potter and the Philosopher's Stone is a terrific movie with a very well developed storyline and a talented cast. It's a delight to watch, I've seen this movie numerous times and it never fails to make me smile, to cheer me up when I'm feeling down, the Harry Potter franchise is magical both inside and out, and it's simple fun to watch Harry go in to his first year at Hogwarts, the story's quite simple as the series kicks off with a light start, but it will still leave you wanting more. The films biggest flaw is, at times, it is too faithful to the book that it is based off, I'm sure this is pleasing for anyone who's read the book, but for those who haven't it tends to drag out at times, more than an hour passes before Potter even goes to Hogwarts and the main adventure dosen't unfold properly until at least one hundred minutes in, it can get a little tedious at times and that's why I'm giving it an eight instead of a nine that it easily could have received. The cast is outstanding, the young cast members are ridiculously talented for their age, Daniel Radcliffe seems to have no trouble playing a lead role, and both Rupert Grint and Emma Watson shine as his closest friends, they never lose a single bit of likability. They are joined by a terrific adult cast, including the likes of Alan Rickman, Maggie Smith, Robbie Coltrane and, the highlight of the movie for me, Richard Harris, he shines as Professor Dumbledore (sadly only for two movies), his characterization is perfect, he is wise, heartwarming and simply a lovable character. It may be a bit slow at times, but Harry Potter and the Philiosopher's Stone never loses its sense of fun and magic, and because of this it is a perfect film for the whole family to watch and enjoy. A young boy learns the truth about his special powers, that he is a wizard and must prove his worth at Hogwarts School of Witchcraft and Wizardry. Best Performance: Richard Harris Worst Performance: James Phelps",
    "96": "I feel, next to Willy Wonka and the Chocolate Factory, Harry Potter and the Sorcerer's Stone is the best book-to-movie adaptation that I've ever seen. The sets were stunning - the actors were first rate - the effects were breathtaking.  The film flowed quite smoothly in it's transition from page to screen, never tripping on the awkward conventions that other books on film have struggled with.   The screenplay, by Steven Kloves, stripped away all unnecessary elements to get to the root of the story.  Though many events from the book were excluded, the essential ones made it to the film. And it makes for one smooth story and very enjoyable movie-going experience.Many kudos to Chris Columbus and the rest of the Harry Potter cast/crew for not turning this movie into what it easily could have become:  a 2 and a half hour commercial advertisement for action figures and collectibles, kid's meals and fast food tie-ins, soft drinks and snack products, etc. and instead focused on bringing J.K. Rowling's story to life as accurately and as lovingly as it deserves.  There has been much speculation on whether Columbus was the correct choice for the first two installments of the series and I say to that, Yes.  I feel that he accomplished what most would have failed.  He has proven, at least to me, that Diagon Alley truly exists - if only I could find the right brick to tap on.  The world of Harry Potter is no longer fantasy to me, but instead a place where any of us mere Muggles could hope to visit, one day.One of my favorite moments, is what I'm going to refer to as the Adrenaline Sequence.  By Adrenaline Sequence, I mean the sequence in a movie that for all intents and purposes, doesn't necessarily propel the story, but gives the audience a huge theatrical payoff, ala the Pod Race sequence in The Phantom Menace.  The Adrenaline Sequence for this particular movie is the Quidditch sequence.  I was very happy to finally see the 'hockey/soccer hybrid on a broomstick' come to life.  The Quidditch Sequence is, by far, my favorite sequence in the whole film.  The scene is dizzying in it's violence and it's one breathless moment after another.  My hat goes off to Columbus and his team for succeeding in making this scene as memorable as it should be.Harry Potter and the Sorcerer's Stone is a fantastic movie for children of all ages.  Fans and non-fans alike will enjoy this colorful story of good versus evil and the friendships that endure.",
    "97": "Okay, I never read the Harry Potter Books. I couldn't have cared less, but I have nieces and nephews and other children in my life who are from ages 7 to 12 who have. What I had to do was remember what it was like when I was that age, so long ago, and what \"new\" movies I had to entertain myself with.\nSo...I had \"Oliver!\", \"Willie Wonka and the Chocolate Factory\" and \"Chitty, Chitty, Bang! Bang!\". Other than those, it was \"R\" rated films that I was more interested in.  Why? For that is what interested me via what Hollywood made available. I was \"too old\" for those cutie Disney Animated cartoons of that time, and too young for the adult theme films that were being advertised which I DID want to see. This is why I like this film, it brings back the genre for children, the wonder, the fantasy in film just for them.A nice effort production wise, with the casting, with the story. Children love fantasy, wonder, adventure, a character THEIR age doing and thinking like THEY would and...watching kids eat lots of \"sweets\". This Harry Potter film fit the bill. For me as an adult, it was...nice. For children between 7 and 12, its fantastic. The special effects were neat, the story was engaging for them, but what I liked the best was the school itself. I thought that the classes and interactions of the children with each other were on their level. So it was at a Wizards school. Point is, it could be at ANY school. (or boarding school!)In my surroundings, there have been a few adults/parents screaming about how this film and the school \"Hogwarts\" promotes kids to get into the black arts. I think that is so awful to think that, and I think it does not give children the benefit of the doubt. \"Harry Potter and the Sorcerer's Stone\" is a nice little film about something a child/pre-teen has fun with. I actually compared it to the Disney film \"Fantasia\" and the scene of Mickey being the \"Sorcerer's Apprentice\". I watched that over and over as a 6 year old and trust me, I had no desire to get into \"the black arts\".To me, this film is geared towards that audience that has been forgotten AND portrayed in the last 15 years, the 7 to 12 year olds. Yes, Disney had alot of animation that was marketed to that group of children, but its been quite sometime to make a long full length feature film of fantasy where children are the focus, and they are just...children. Reminds me of \"Willie Wonka and the Chocolate Factory\" and \"Chitty, Chitty, Bang, Bang\"...fantasy films for the 7 to 12 year old to enjoy the movie going experience on their level, but NOT talking DOWN to them.Children under 7 may be a bit scared at some parts and teens over 13 may not get into this film at all. But for the 7 to 12 year olds, this film is a nice one for them in the same vein as \"Oliver!\" and \"Willie Wonka and the Chocolate Factory\" was for me.",
    "98": "Platform number 9(3/4) would have been discovered easily by muggle world as train platform are not that empty.At the place where harry where harry acquires remembrall (bhul na jana). He wins seekers position instead of any punishment. It was awesome.Harry potter as Seeker or khoji wins my opinion. The reason is in spite of wearing spectacles he is assigned such a position. I simply like that.Home is another point where my opinion is that harry could have been located at a better place. A place where he is respected may be with Hagrid. The life could have been made less troublesome.There is a scene where Hermione is in toilet and lies regarding entire situation. I feel if she would have just mention the truth, they would have ended up in even better points.The message boards are gone, so sharing opinion this way.",
    "99": "This movie is a delight for those of all ages.I have seen it several times and each time I am enchanted by the characters and magic.The cast is outstanding, the special effects delightful, everything most believable.You have young Harry, a mistreated youth who is \"Just Harry\" to himself. And then, he embarks on a most beautiful adventure to the Hogwarts school.He meets Ron and Hermione, one an adorable mischief maker, the other a very tense and studious young lady.Together, the trio try to set things right in the school.It's the ultimate fantasy for young and old.",
    "100": "Dropped with his aunt and uncle as a baby, Harry grows up in a loveless home and is made to sleep under the stairs.  On his 11th birthday Harry learns the truth of his past when he is visited by Rubeus Hagrid and invited to attend Hogwart's school for wizards and witches.  Whilst learning his craft Harry and his friends notice some strange things and begin to investigate, leading them deeper into a mystery that involves a dark wizard who killed Harry's parents and a quest for a powerful stone that brings immortality.I had no strong desires to see this film.  I have not read any of the books, nor do I have any plans to as they just don't interest me.  Back in my family home one week I noticed they had bought a copy of this film on VHS and I decided to give it a watch.  I knew little of the plot but it carried me along well enough.  It did seem a little long and that the film was trying to cram as many effects scenes as possible where it should really have been developing characters instead.  Don't get me wrong the effects are all good and hold the interest well, but without the characters I felt like I didn't care very much about the plot.I know this is a children's film so characters aren't that important but that leads me to another point  the running time.  At over two hours I struggled to care enough to sustain my interest.  I don't have kids but I did wonder how many would be able to focus for that long  but I suppose that the reason for throwing in an effects scene every five minutes just to wake them up!The cast is crammed with talent  most of which it fails to make good use of.  In the lead Radcliffe is quite bland and didn't do too much with his role.  Happily Grint and Watson who both are funny and have good characters  even if they are only sidekicks in the film, supported him.  It is telling that recent publicity for the second film has put these two on a par with Harry  even giving them their own posters.  Of the support cast only Coltrane is well used, everyone else just has cameos of one sort or another. Hart, Cleese, Harris, Rickman, Smith etc all have only a few scenes at most and (in the case of Rickman and Cleese) a few lines at most.  This is annoying on two levels.  Firstly, the fact that such talent is wasted and secondly the fact that none of them are allowed characters  only a chance to show their face briefly once or twice.Overall it was enjoyable and will please kids even if only for the regular effects scenes.  It has flaws and it is clearly aimed at those who have Potter fever already.  N the strength of this I will not be going to see the second film until someone gives it to me to watch.  It's a good film but it feels like it is made to see Happy Meals and start a franchise than to be a good film in it's own right. (as a side note  I find it hilarious that it had to be renamed for the USA as the studio felt that the word `philosopher' would confuse American audiences who didn't know what it meant!)",
    "101": "This masterpiece must be preserved perfectly to all the generations to come. This is a genius simple story that everyone can relete to sometime in their life. Every humans desire to escape from reality for a while, this excellent film series is one of the greatest series, if not the greatest and never gets old.It is perfect in every detail and must be remembered as one of the best in movie cinematic history and really should be seen by everyone at least one time in their life.The series gets even deeper and deeper as the story develops.The first time i watched this and still to this day im still as enchanted by the universe of Harry Potter, as when i was a kid. Its just one of the most perfect stories that mankind ever told.If you havent seen this fantastic movie, you really have too see it. Theres no excuse. Its a classic!",
    "102": "I have recently been revisiting the Harry Potter franchise during the ongoing pandemic and I have been wondering whether these movie that I hadn't seen in a decade would have aged well or not. My conclusion is that most of them have aged particularly well and this is especially the case for the first two movies that I consider the best of the franchise. The producers' idea to hire veteran director Chris Columbus was certainly a decisive one in hindsight since he managed to transform a first novel with numerous lengths into an extremely entertaining film for the entire family.The movie has numerous other strengths that need to be pointed out. Even two decades later, the special effects still look stunning and do the great novel series justice. The visual effects are magical, the sound effects are epic and the lighting techniques increase the movie's multiple shifts in atmosphere.The locations have been chosen with care as well. Harry Potter's home looks as boring, desolate and exchangeable as it's described in the novel. The scene at the lighthouse oozes with atmosphere. King's Cross busy Platform 9 3/4 looks very colourful, detailed and imaginative. The extraordinary train ride to Hogwarts invites to dream yourself far away. The highlight is obviously Hogwarts and its surroundings as nearly every section in this gigantic castle comes around with creative details and imaginative surprises.The film certainly convinces with its detailed storytelling and diversified subplots. It takes all the time it needs to introduce us to numerous most entertaining classes at Hogwarts. The sections that show and explain Harry Potter's Quidditch career are so detailed that even someone who hasn't read the novel will understand how this fascinating wizarding sport works. The film carefully and credibly develops the friendship between lead characters Harry Potter, Ron Weasley and Hermione Granger. Everything is however wrapped up perfectly in an adventurous, entertaining and epic finale where the three protagonists have to face numerous challenges related to the main plot as an impostor is aiming to steal the mysterious Sorcerer's Stone for a most sinister purpose.The young actresses and actors are doing excellent jobs and are truly convincing in their roles. Daniel Radcliffe shines as confused and isolated but soon enough adventurous and imaginative young wizard going through dynamic changes. Rupert Grint excels as friendly but clumsy young wizard who you are going to appreciate right from the start. Emma Watson shines as self-confident, intellectual and slightly arrogant young wizard whose academic performances are incredibly inspiring. The adult actors have also been chosen with care. Richard Harris's performance as principal Albus Dumbledore is the best ever for this role as he convinces as wise, patient and kind mentor that you will like right from the start. My personal highlight is Alan Rickman as cold, gloomy and unpredictable professor who seems to be antagonist and protagonist all at once.In the end, Harry Potter and the Sorcerer's Stone is not only the only movie that I prefer over its novel version in the franchise but also one of the two best movies in the inspiring fantasy film franchise that has left a significant mark on an entire generation of children and teenagers two decades ago. The film has aged quite well and should still impress children and teenagers as well as their parents all around the world nowadays. The movie has been executed with care in every single department and has lost nothing of its unique charm. It would go as far to state that it stands as one of the very best fantasy movies of the twenty-first century.",
    "103": "I have, in all my life as a lover of both literature and the cinema, hardly ever come upon a piece of work more unimaginative, more ugly, more uninteresting, more lacking in suspense, more lacking in charm, more greedy, more incoherent... Okay, okay. I'll stop with the superlative negatives. Surely there have been worse, and, yes, off the top of my head, I can think of many that are worse. However, for a book that over 125 million people have read, and for a movie that cemented the record for the biggest opening weekend in history, and also for a book that has had not only kids but critics singing its praises, and also for a movie which one particularly fat-headed critic called the Wizard of Oz of its generation, I am more than severely disappointed. I know that, had it not been so overhyped, it would have been just as bad. Now, however, my anger for it is completely hardened and it's going to be a passionate battle for me for years to come.I go into an in depth criticism, but it would be impossible for me to keep to 1000 words. There is hardly a piece of it that I liked. As a film, it was poorly edited, poorly acted (by most), poorly filmed. The only really memorable scene is the troll in the bathroom, although the payoff to it makes no sense whatsoever. The Quidditch game, which has been hyped to all heaven, is completely boring and poorly created. It looks like the FX guys created it with photoshop. When the chess game looked like it was about to be the most exciting sequence in the film, Christopher Columbus, who, I must say, lives up to his reputation completely, begins to edit furiously. I heard afterwards that this was done to avoid a PG-13. My immediate thought is that the filmmakers didn't trust their young audience to enjoy watching a chess game, no matter how exciting it might have been. I'm still not sure which story to buy.But the person I really want to tear into is J.K. Rowling. What a hack. Never has the word \"hack\" been more fitting. A former waitress, her idea of imagination is to call things by weird names. Only in the mind of a psychopath (or idiot) could the name Draco Malfoy or a Cerberus clone named Fluffy be considered clever. Writing children's literature is not difficult, but this is simply awful. She's clearly ripping off Raoul Dahl like there's no tomorrow, especially in the exposition. The game of Quidditch, which seems to be a drawing point of some sort, is absolutely nonsensical. As a preteen, I invented much more interesting games with much less interesting playing pieces. Quidditch is a game where people score ten points at a time, unless someone catches a special type of ball, which ends the game immediately. So theoretically, the game could end in thirty seconds. And all the other forms of scoring matter not at all. And let's talk about the surprise climax. Really, anyone could have been standing in front of that mirror at the end. It is tremendously unclever. And the penultimate sequence, where the crown is awarded to the best dorm, is anticlimactic and just rude to the children of Slytherin, We only hate one of them, so why should we be happy that the award at first goes to them, and then is cruelly snatched away. And what about Hogwart, anyways? If you're not supposed to use magic when you're away from Hogwart, why the heck would you want to be a wizard anyways?Friends, you're well on the path to making your children drooling morons. If they want a great series of books about sorcery and magic creatures, make them read the Chronicles of Narnia by C.S. Lewis. This is the most soulless garbage imaginable. And I thought Shrek had taken that title. 3/10",
    "104": "It's hard to imagine just how influential the Harry Potter series has been on my life. It was released around the time I was born, and I can't really ever remember a time when it wasn't my favorite world to escape into. Harry Potter and the Philosopher's Stone is the first book I can remember becoming a fan of, and wanting to read it again straight away. I'm not even going to pretend that I can judge this without bringing over my fondness for the books.For all the fault this first movie has, it feels like a soon-to-be classic, with many aspects featured here becoming ubiquitous in popular culture. The score by John Williams is recognized worldwide as a magical and wondrous piece of music, conjuring up images of broomsticks, wands, and giant castles hidden in the mountains. Hogwarts Castle itself is now an enormously successful theme park in Florida, Osaka, and more on the way. King's Cross has become a tourist attraction, with hundreds of fans waiting in line to take a picture with the trolley at Platform 9 3/4 every day.The cast from the very beginning is stock full of British acting royalty, great actors sinking their teeth and relishing every bit of dialogue. The young actors do their best and it's fun to see them start off, knowing what lies ahead for them, both in the course of the series and afterwards as well.The opening sequences have a real sense of mystery and wonder, possibly enhanced by the knowledge of the truth about Harry's real identity. The introductions to characters and places are perfect, most notably: Diagon Alley, Alan Rickman as Snape, and our first glimpse of Hogwarts.The story is simple and mostly an excuse for world-building, but what a world to get lost in. In my head, Hogwarts wasn't so...practical, but it looks like a place a child of 11 would consider the most amazing place in the world. The creatures and rules and spells add to the fun.The film does feature shoddy CGI (the quidditch match is particularly bad) and at 2 and a half hours it is overlong. It's hard to ignore, though, the place in popular culture it has attained and the earnest sense of wonder and fun that it offers to everyone who gives it a chance.",
    "105": "This first Harry Potter surprised me. Not a reader of the books nor a proponent of occult beliefs, I still went into this with an open mind and found I enjoyed the movie. I watched the first three films and own the third (\"Harry Potter and Prisoner Of Azkaban\").This film offered good escapist fare with lots of interesting sets and special- effects, as all the films have done. There is very good color and sound in here, making it even more attractive with a good TV and sound system.Daniel Radcliff was a likable hero, with his round glasses and winsome smile. You can't help but root for him. His friends, played by Rupert Gint and Emma Watson, are okay but Watson gets annoying as the know-it-all school girl. She became more likable in the subsequent Potter films. For me, the British accents in here were not always easy to understand.The story, despite its length of two-and-a-half hours, movies pretty well as there is always something interesting to view. Once again, this movie and the sequels all excelled in this department with great visuals.",
    "106": "With the sixth book now out (and one more to go), I feel that I should review \"Harry Potter and the Sorcerer's Stone\". By now, the Harry Potter books have become so well entrenched in our culture that I don't even need to explain the story. But I can say that director Chris Columbus did a great job adapting the book to the silver screen.The cast does very well with the roles: newcomer Daniel Radcliffe plays Harry Potter, making him strong-willed but vulnerable. Rupert Grint and Emma Watson play his friends, the uptight Ron Weasley and the no-nonsense Hermione Granger. The Hogwarts staff is played by a who's-who of British actors: Richard Harris as headmaster Albus Dumbledore, Maggie Smith as anthropomorphic Prof. Minerva McGonagall (and one can detect a hint of Miss Jean Brodie there), Alan Rickman as unctuous Prof. Severus Snape, and Robbie Coltrane as gamekeeper Rubeus Hagrid. Others include Zoe Wanamaker as Quidditch teacher Madame Hooch, Julie Walters as Molly Weasley (Ron's mum), Richard Griffiths as Vernon Dursley (Harry's mean uncle) and even John Cleese as Nearly-Headless-Nick, one of the school ghosts.All in all, this is a movie for the ages. I know that religious fundamentalists will claim that the Harry Potter books are promoting witchcraft, but are we really going to believe those kinds of people, considering that they claimed the same things about \"Bewitched\"? Harry Potter will live forever - something that no Muggle can do.",
    "107": "Well, for starters, the older cast, almost all of whom are instantly recognizable if you've seen much of British television or film, are simply delightful in their roles, with special honors going to Alan Rickman as Professor Snape, Richard Harris as Albus Dumbledore, and Robbie Coltrane as Rubeus Hagrid. Some other positive aspects to the film is that it is a faithful adaptation for the most part, and the child actors certainly aren't the worst I've ever seen. Moreover, John Williams' brilliant score was at the time one of the best in years.With all this talent at his disposal, Chris Columbus seems almost determined to make the movie as childish and as non-magical as possible. One of the main reasons the Harry Potter books were so successful in the first place was because they really weren't just books for kids, they were books for kids that adults could enjoy. J.K. Rowling created a beautiful, magical world and a bunch of very interesting characters that could keep you interested in reading a book for days, if not weeks. Chris Columbus, however, dumbs it all down to the level that it's not even interesting for two and a half hours. On a superficial level, Columbus might have seemed a good choice to direct; he had been commercially successful in the past, had made some funny comedies (\"Home Alone\", \"Mrs. Doubtfire\") and even handle a drama reasonably well (\"Bicentennial Man\"). However, Columbus has also failed at both those styles before; \"Stepmom\" was manipulative, overly sentimental dreck and \"Nine Months\" simply wasn't funny.Columbus decides to direct this as a kids' movie, and effectively ruins the film in the process. Steve Kloves' script doesn't help either, as it simply plays into Columbus' childish perception with some unbearable slapstick 'humor', which completely destroys most of the novel's charm.There are a couple of solid sequences in this mess of a film, particularly the final scenes, but considering the solid source material and the talent involved, the film is ultimately a failure. It is technically competent and the visual effects are definitely good but unfortunately, in concentrating on the technical aspects, Columbus has wasted a lot of talent and forsaken most of what makes a movie good (acting and writing) for the sake of making the movie merely look good. This may work the first time but the film is a bore on repeated viewings and just doesn't hold up well at all.4/10",
    "108": "Harry Potter is an Orphan who on his eleventh birthday discovers he's a wizard and is called to term at Hogwarts School. But Harry is soon to find out that his past, and his destiny, is a truly remarkable, magical, and terrifying thing.Harry Potter And The Philosopher's Stone arrived in a blaze of publicity, one of the most hyped and talked about motion pictures of the decade had finally arrived. The box office was guaranteed to bulge based on fandom book base alone, regardless of if the film got bad word of mouth or not, it was destined to be a monster smash hit. To someone like me who to this day has never read any of the Harry Potter books, it was easy for me to view objectively without comparison to the source - I enjoyed it immensely upon theatre release, and I still enjoy it equally as much now.Director Christopher Columbus, I believe has wisely stayed loyal to the source material, and thus pleased the literature masses. Yet not all newcomers to the party were that taken by the magic on show, that's a little baffling to me because the budget explodes from the screen at every turn. Oliver Twist like sets form the marvellous Diagon Alley, dream like smoke cloaks the splendid Hogwarts Express, the school itself is a monolithic delight nestling in among eerie mountains - and what about the exhilarating introduction of Quidditch? Pulsating and frantic with no amount of devilment to keep us intrigued throughout.The characters are all perfectly formed in the first two thirds of the film, here Columbus pulls off a masterstroke by interjecting the character arcs with dashes of wonder so that we the audience never gets bored. The final reel plays out solidly as per the mysterious \"who done it\" core of the piece, but it's down to the previous work in the film that we actually care come the finale. Some great casting of the adults really helps to make the film triumph, with Maggie Smith, Robbie Coltrane (one of the best casting jobs of the decade I would say), Richard Harris, Alan Rickman and Zoe Wanamaker all doing excellent work here. The kids are all newcomers that overnight were to become household names, all fresh faced and wet behind the ears, Daniel Radcliffe, Emma Watson, Rupert Grint & Tom Felton are a delight to watch, and they all help to keep the feeling of charm constantly glowing up on the screen.Owls here, witches there, what's that strange three headed dog doing over there? The Harry Potter franchise begins with a bang and a whip of the wand, and I and gazillions of others personally love it. 8/10",
    "109": "\"Harry Potter learns, on his 11th birthday, that he is the orphaned son of two powerful wizards, and possesses magical powers of his own. (Sent to) 'Hogwarts School of Witchcraft and Wizardry', Harry embarks on the adventure of a lifetime, discovering a world of magic and fantasy, where he is destined to live,\" according to the film's official synopsis. This was the first of the films bringing J.K. Rowling's beloved \"Harry Potter\" characters to motion picture life; and, it must be considered a rousing success.Importantly, Ms. Rowling insisted on retaining much creative control, so a higher than usual amount of integrity to the material is maintained. This doesn't benefit the film in every respect; but, it certainly was, in hindsight, the only sure-fire way to introduce these adventures to cinema. One change, done for the book, was that the title would be altered from \"Harry Potter and the Philosopher's Stone\" to \"Harry Potter and the Sorcerer's Stone\" for U.S. consumption; it goes against the grain, and works perfectly. \"Sorcerer's Stone\" is shorter, provides alliteration, and better illustrates the conflict present in the story.Initially, it wasn't obvious that the young trio playing \"Harry\", \"Ron\", and \"Hermione\" had the acting ability to go along with looking right for the leading roles; fortunately, Daniel Radcliffe, Rupert Grint, and Emma Watson would turn out to be just perfect. Richard Harris (as Albus Dumbledore) and Maggie Smith (as Minerva McGonagall) herald a stellar parade of Brits playing throughout the \"Potter\" films, with Robbie Coltrane (as Rubeus Hagrid) going to the head of this, the first class.******** Harry Potter and the Sorcerer's Stone (11/4/01) Chris Columbus ~ Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane",
    "110": "The Debut Movie that Flag-Shipped the Film-Series, that became a Phenom in Itself.It was Hardly a Chance-Effort.The Popular Books by Rowland had a Built-In Audience Salivating at the Prospect.CGI had Evolved into a \"We Can Do Anything\" in SFX for the Asking and the Budget was Magical to say the Least.Top-Notch Acting Talent Among the Adults, Coupled with Energetic and Charming Tweens Added the Finishing Touches on a Guaranteed Block-Buster.Most Fans Reacted, Admitting it is Slavishly Faithful to the Books and the Scope of the Story is Made for an Audience from 6 to 60,By most Accounts the Initial Movie was a Bona-Fide Success, Artistically and Commercially.Outsiders, Newbies, and the Uniformed also seem to Warm Up to the Charming and sometimes Edgy Youth Material.There were Rumblings from Evangelicals about \"Satan Worship\", Witchcraft Corrupting the Minds of the Impressionable.But that is Expected and an Argument as Old as the Printed Word.Kids Love it and most Adults went along for the Magical, Fantastic Ride that was On-Screen Fresh in 2001 and quite the Treat for Movie-Goers.It's about as Inoffensive as this Type of Thing could be, and maybe went Too Far with its \"Play it Safe\" Attitude.The Movie Leans Away from the Cutting-Edge and can be a bit Dull for those Expecting more Horrifying Elements.It's a Wonderful Movie for the Whole Family and when its Initial Release Date Finally Arrived,Everybody seemed to get in On the Fun.Colorful, Fanciful, Mysterious, and Adventurous.Some Scary Stuff, but Most of All a Celebration of Youthful Imagination and Wonder.Note...Why did they change it to Sorcerer's Stone for Americans?\" ... It was changed by the American publisher, Scholastic, because it thought American children wouldn't want to read a book with \"philosopher\" in the title.",
    "111": "I was drawn into the story the moment the letters started whirling through the air to \"the boy under the cupboard\" and to the amusing trio (Aunt, Uncle, brother) that give interest to the early scenes and make you anxious for Harry to escape life in this demented household. And from the opening scene on, the special effects are nothing short of marvelous despite what some \"critics\" here are calling \"cheesy\" -- I'm sure the film is a strong contender in that category for a Best Special Effects Oscar.Having said that--and not being a fan of Dragons and Dungeons, etc. kind of games--my only disappointment was that most of the \"magic\" was too much on the dark side--without enough humor to keep things in a lighter vein for the most part. If this is what kids like, they'll love being scared time and time again by some of the creatures and situations.I have only praise for the performances, although I agree that Daniel Radcliffe seems to only have two expressions and is indeed bland, but appealing enough, as Harry. Everyone else does their best to bring the characters to life--especially Maggie Smith as head witch and Alan Rickman as Snapes. I think his is the film's outstanding performance.I was aware of too much exposition in the film (to explain to those of us who haven't read the book what Muggles are, etc.) but I'm sure this sort of thing will diminish when the series continues. I was disappointed by the John Williams score, relentless throughout with only one jaunty theme worth remembering.  This was made even more obvious by the fact that a trailer for the upcoming re-release of \"ET\" emphasized the difference between his \"ET\" score and the one he wrote for \"Harry Potter\". Obviously, he had much more of an emotional connection to the characters in \"ET\" than was possible for him to have with the characters here. There is no such connection to the characters in this relentlessly busy score.Even Potter's farewell scene before boarding the train for home, lacks the emotional warmth so strongly suggested in \"ET\" -- a factor that makes the entire movie seem a one-dimensional but highly competent version of a beloved book. All of the set pieces are extraordinarily detailed and well executed, including the Chess Game--and there's a nice plot twist toward the end that I won't reveal here. All in all, a good film version of the book which I understand is remarkably faithful to the novel--and don't let anyone tell you the special effects are anything less than superb!Nevertheless, a John Williams letdown. I'm sure Daniel Radcliffe--who is physically perfect for the role--will improve in his bystander reactions. After all, he made a wonderful 'David Copperfield' on PBS not long ago. Despite some drawbacks, looking forward to the next visualization of Potter's adventures.The film is known in England and many other countries abroad as \"...and the Philosopher's Stone\".  Frankly, I think the American title is more suitable as it implies \"witchcraft\" which is the very essence of the story. With the U.K. constantly changing American film titles, it's not surprising at all that we sometimes do the same thing. Apparently, we don't really speak the same language!",
    "112": "Orphaned not long after his birth, \"Harry Potter\" (Daniel Radcliffe) is forced to live in the home of his only living relatives who treat him rather badly. That all changes one day when he is informed by a man named \"Rebeus Hagrid\" (Robbie Coltrane) that his parents were famous magicians and because of that he is invited to attend the Hogwarts School of Witchcraft and Wizardry. Needless to say, Harry accepts almost immediately and after Hagrid and he buy the necessary school equipment he begins his journey to the mystical academy. It's then that he meets two fellow students named \"Ron Weasley\" (Rupert Grint) and \"Hermione Granger\" (Emma Watson) who become his good friends and share in his triumphs and travails. Now rather than reveal any more I will just say that this film was based on the very successful book \"Harry Potter and the Philosopher's Stone\" by J.K. Rowling and from what I understand remains quite faithful to the book. At least for the most part. In any case, I found it to be a fine fantasy film with the interaction between Harry and his two friends especially entertaining. Admittedly, there are some slow parts here and there and it does run a bit long (152 minutes). Even so, despite the faults just mentioned, I believe this to be one of those rare movies which can be enjoyed by the entire family and I have rated it accordingly. Above average.",
    "113": "I'm finally in a position to re-watch and review the Harry Potter film series - I'm way past over due for reviewing them.First of all, I don't know of anyone that has not seen at least one Harry Potter flick. Everyone seems to agree that these are great films - I am no exception.Secondly, the entire series is highly entertaining! If you haven't seen this series then I highly recommend you should. Comical, magical and all around fun to watch.This first film starts out with a bang as when Hagrid, Dumbledore and Minerva McGonagall show up with baby Harry Potter on the doorstep of Harry's relatives home. The film ends on a good note with the house cup being awarded. In between the beginning and ending is non-stop entertainment.Great to watch this film again9.5/10",
    "114": "If you watch \"Sorcerer's Stone\" without reading the book first, there are certain narrative points that you will miss or not quite be as clear on (as usual). However, watching the movie closely following the reading experience will actually expand upon the Potter myth (I gave the first book four stars) due to this film's ability to lay the groundwork of the series in such stunning visuals and characters.For a basic plot summary, \"Sorcerer's Stone\" sees young Harry Potter (Daniel Radcliffe) living with his aunt and uncle and being mistreated horribly (sleeping in a closet under the stairs, told how rotten he is all the time, etc.). Right before his 11th birthday, however, Harry begins receiving letters from a mysterious owl (as well as a visit from a rather large gentleman riding a flying motorcycle) informing him that he is in fact from wizard lineage. Thus, Harry is whisked away to Hogwarts, a \"Wizard Academy\" of sorts, to begin his training. While at Hogwarts, Harry meets new friends Ron (Rupert Grint) & Hermoine (Emma Watson) as well as discovers the mystery behind the death of his parents regarding a shadowy character called Voldemort.In terms of following the novel, this film does a pretty good job of keeping in lock-step. There are certain scenes that are excised for time/continuity and a few \"facts\" from the book that are blatantly different from the movie, but other than that it is a great representation.In fact, in a departure from the norm, I actually enjoyed the movie experience better than the book. Why? Because of the way it was able to so wonderfully put a visual to all the great characters. For some, the \"mystery is gone\" when they see their literary characters up on the big screen, but in this case I was very pleased to put a face to all these great characters.The movie also has (just like the book) a sense of \"epic-ness\" to it. It is very clear that this is only the beginning of an epic series, with more and more mysteries and character development to come.Thus, \"Sorcerer's Stone\" is a great cinematic experience that will leave you wanting more as soon as it concludes. The mysteries and characters are paced perfectly, and the story (as it is geared for young adults in the first place) is easy enough to latch onto while nuanced enough to get sucked into.",
    "115": "With billions upon billions of pounds in revenue generated from book sales, film adaptations and all other mediums, and with the hysteria surrounding the series now all but gone, it seemed the perfect time to re-visit the Harry Potter film franchise. I'll state outright that I'm a fan of the books: they are hardly ground-breaking pieces of literature, but they are a meticulously crafted and widely imaginative set of novels, maturing with it's progression and with the age of it's characters and readers. The movie adaptations were consistently average, fiercely loyal to J.K. Rowling's prose but always somewhat lacking in substance.Shut away in the cupboard under the stairs by his adoptive parents (Richard Griffiths and Fiona Shaw), 11 year-old Harry Potter (Daniel Radcliffe) lives an unhappy life. But there's something different about him, as he learns when he talks to a snake at a zoo and makes the protective glass disappear, causing his vile cousin Dudley Dursley (Harry Melling) to fall into the tank. His life changes when he is invited to enroll at Hogwarts School of Witchcraft and Wizardry. The invitations are burned by the Dursleys, and they go to great lengths to stop him going to a place that will teach him magic, until he is rescued by a hairy giant named Reubus Hagrid (Robbie Coltrane).When introduced into the magical world with Hagrid, Harry learns that he is famous. His parents were killed by an evil wizard named Lord Voldemort (generally referred to as You-Know-Who), but Harry survived the attack, seemingly killing Voldemort and inflicting Harry with a lightning bolt scar on his forehead. When he gets to Hogwarts, he is befriended by the bumbling Ron Weasley (Rupert Grint) and the precocious Hermione Granger (Emma Watson), and the three are quickly embroiled in a plot involving murdered unicorns, a mysterious artefact known as the philosopher's stone, and a giant three-headed dog.Philosopher's Stone is almost defiantly faithful to the books. Sure, lines are altered here, and minor characters are snipped out there, but this is as close as literally 'bringing a book to life' gets. Yet while this works in it's favour in terms of visualising Rowling's creations, it doesn't even try to develop any ideas of it's own that would have only worked in a visual medium. Much of Rowling's silly and charming sense of humour is lost in simply filming whatever happens on the pages. One of the main criticism's I have for the books is that a lot of the major characters are little more than archetypes, so a lot rested on the three young leads' shoulders in making us interested enough to stick with them.Sadly, two of the three fall rather flat, with only the gurning and hang-dog Rupert Grint showing a natural gift for appearing on the big screen. Potter is a simple enough character anyway, at least he is at this point of the story, shy, naive but brave, but Radcliffe gives an incredibly one-note performance, encapsulated in the scene in which he discovers he can perform magic. \"I'm a... wizard?\" he says, lacking anything resembling a facial expression. Watson also struggles to bring much likability to her self-satisfied bookworm, her eyebrows constantly rising and falling as she struggles to perform her lines with any conviction.For the rest of the cast, director Chris Columbus has rounded up a smorgasbord of British and Irish talent, a collection of well-trained thespians who steal the entire film from it's leads. Richard Harris plays Professor Dumbledore, Hogwarts' headmaster, Maggie Smith is Professor McGonagall, head of Gryffindor, the house Harry is chosen for, Alan Rickman is Professor Snape, Harry's greasy-haired Potions teacher, and John Hurt makes a small appearance as a wand-maker. Coltrane probably steals the film as the beast-loving grounds-keeper Hagrid. It's an amazing line-up that would consistently grow both in talent and in numbers as the films progressed.Ultimately, Harry Potter and the Philosopher's Stone is a success, weaving an interesting enough story about the possible return of the dark lord Voldemort, with Harry's wide-eyed introduction to the world of hocus pocus. John Williams' Oscar-nominated and now widely recognisable score captures some of the giddy movie magic of early Spielberg, and the attention to detail is often remarkable. But like the book, it ultimately suffers from being too kid-friendly, spoon-feeding lessons in morality without giving much for adults to chew on. It's little more than a well-told children's story, something that would change as the novels became darker and more complex, but at this point, it's a gentle introduction to a captivating world.",
    "116": "In the first outing for Harry Potter, he learns of his descent from a magical background and enrols at the school of witchcraft and wizardry 'Hogwarts'Largely character building this magical adventure takes Harry and his new friends, Hermione (a very talented young Witch) and Ron (Harry's best friend) on a quest for the Philosopher's stone, a powerful stone wanted by the murderer of Harry's parents (Voldomort)Not having read the books, i can't make any comparisons, but even as a stand alone movie, this makes a fine fantasy adventure, fun for all ages. The characters are great, the scenery is wonderful and there is enough magical enchantment to charm and entertain all of us.8/10",
    "117": "Harry Potter and the Sorcerer's Stone is not a perfect film, but it is a magical film. The franchise has been a large part of my life for most of my life. With the first book coming out when I was three years old and the first movie when I was seven, there is a special place in my heart for the Wizarding World of Harry Potter.I know that it is not the most remarkable piece of art when looking at it from a filmmaking perspective. However, let us remember that this movie was made for children. When it comes to world-building and enveloping the audience, I would argue that this movie goes toe to toe with Lord of the Rings and some of the other greats.What Chris Columbus and company did is nothing short of game-changing. They took excellent source material, stayed true to the book and built upon it. The visuals, specifically involving Hogwarts, are gorgeous. The score by John Williams is one of the most recognizable of all time. The characters are instantly likeable (or despicable). There is honestly so much to praise and love about this movie.While not every scene is necessary to the plot, those \"pointless\" scenes further add to the feeling of magic. From sitting in Flitwick's classroom to ruminating on a windowsill with an owl, I could watch footage of Hogwarts on repeat. This is a movie that I could turn on at any time and jump right into the story. Simply put, I instantly have a warm feeling which stays with me the whole way through.While the acting and dialogue have some rough moments, particularly with the younger actors, the casting is excellent. From Alan Rickman and Robbie Coltrane to Richard Harris and Maggie Smith, there is not a single dud when it comes to the adult cast. The students are also perfectly cast, with the main trio's chemistry on full display.At the end of the day I'll say it again, I know that this is not a perfect film, but it is a magical film. The movie is highly rewatchable, endlessly quotable and enchantingly enjoyable. When defining \"comfort film\", this movie is at the top of the list. Simply put, Harry Potter and the Sorcerer's Stone set the stage for one of the most popular movie franchises of all time and one of the most impactful parts of my childhood.Best Character: Rubeus HagridBest Moment: Arriving to Hogwarts on the boats.Best Quote: \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.\" - Albus DumbledoreAdditional Note: Having the house cup ripped from Slytherin is why I have issues with premature celebration. That being said, the whole sequence is still chill-inducing.",
    "118": "I have recently been revisiting the Harry Potter franchise during the ongoing pandemic and I have been wondering whether these movie that I hadn't seen in a decade would have aged well or not. My conclusion is that most of them have aged particularly well and this is especially the case for the first two movies that I consider the best of the franchise. The producers' idea to hire veteran director Chris Columbus was certainly a decisive one in hindsight since he managed to transform a first novel with numerous lengths into an extremely entertaining film for the entire family.The movie has numerous other strengths that need to be pointed out. Even two decades later, the special effects still look stunning and do the great novel series justice. The visual effects are magical, the sound effects are epic and the lighting techniques increase the movie's multiple shifts in atmosphere.The locations have been chosen with care as well. Harry Potter's home looks as boring, desolate and exchangeable as it's described in the novel. The scene at the lighthouse oozes with atmosphere. King's Cross busy Platform 9 3/4 looks very colourful, detailed and imaginative. The extraordinary train ride to Hogwarts invites to dream yourself far away. The highlight is obviously Hogwarts and its surroundings as nearly every section in this gigantic castle comes around with creative details and imaginative surprises.The film certainly convinces with its detailed storytelling and diversified subplots. It takes all the time it needs to introduce us to numerous most entertaining classes at Hogwarts. The sections that show and explain Harry Potter's Quidditch career are so detailed that even someone who hasn't read the novel will understand how this fascinating wizarding sport works. The film carefully and credibly develops the friendship between lead characters Harry Potter, Ron Weasley and Hermione Granger. Everything is however wrapped up perfectly in an adventurous, entertaining and epic finale where the three protagonists have to face numerous challenges related to the main plot as an impostor is aiming to steal the mysterious Sorcerer's Stone for a most sinister purpose.The young actresses and actors are doing excellent jobs and are truly convincing in their roles. Daniel Radcliffe shines as confused and isolated but soon enough adventurous and imaginative young wizard going through dynamic changes. Rupert Grint excels as friendly but clumsy young wizard who you are going to appreciate right from the start. Emma Watson shines as self-confident, intellectual and slightly arrogant young wizard whose academic performances are incredibly inspiring. The adult actors have also been chosen with care. Richard Harris's performance as principal Albus Dumbledore is the best ever for this role as he convinces as wise, patient and kind mentor that you will like right from the start. My personal highlight is Alan Rickman as cold, gloomy and unpredictable professor who seems to be antagonist and protagonist all at once.In the end, Harry Potter and the Sorcerer's Stone is not only the only movie that I prefer over its novel version in the franchise but also one of the two best movies in the inspiring fantasy film franchise that has left a significant mark on an entire generation of children and teenagers two decades ago. The film has aged quite well and should still impress children and teenagers as well as their parents all around the world nowadays. The movie has been executed with care in every single department and has lost nothing of its unique charm. It would go as far to state that it stands as one of the very best fantasy movies of the twenty-first century.",
    "119": "I have, in all my life as a lover of both literature and the cinema, hardly ever come upon a piece of work more unimaginative, more ugly, more uninteresting, more lacking in suspense, more lacking in charm, more greedy, more incoherent... Okay, okay. I'll stop with the superlative negatives. Surely there have been worse, and, yes, off the top of my head, I can think of many that are worse. However, for a book that over 125 million people have read, and for a movie that cemented the record for the biggest opening weekend in history, and also for a book that has had not only kids but critics singing its praises, and also for a movie which one particularly fat-headed critic called the Wizard of Oz of its generation, I am more than severely disappointed. I know that, had it not been so overhyped, it would have been just as bad. Now, however, my anger for it is completely hardened and it's going to be a passionate battle for me for years to come.I go into an in depth criticism, but it would be impossible for me to keep to 1000 words. There is hardly a piece of it that I liked. As a film, it was poorly edited, poorly acted (by most), poorly filmed. The only really memorable scene is the troll in the bathroom, although the payoff to it makes no sense whatsoever. The Quidditch game, which has been hyped to all heaven, is completely boring and poorly created. It looks like the FX guys created it with photoshop. When the chess game looked like it was about to be the most exciting sequence in the film, Christopher Columbus, who, I must say, lives up to his reputation completely, begins to edit furiously. I heard afterwards that this was done to avoid a PG-13. My immediate thought is that the filmmakers didn't trust their young audience to enjoy watching a chess game, no matter how exciting it might have been. I'm still not sure which story to buy.But the person I really want to tear into is J.K. Rowling. What a hack. Never has the word \"hack\" been more fitting. A former waitress, her idea of imagination is to call things by weird names. Only in the mind of a psychopath (or idiot) could the name Draco Malfoy or a Cerberus clone named Fluffy be considered clever. Writing children's literature is not difficult, but this is simply awful. She's clearly ripping off Raoul Dahl like there's no tomorrow, especially in the exposition. The game of Quidditch, which seems to be a drawing point of some sort, is absolutely nonsensical. As a preteen, I invented much more interesting games with much less interesting playing pieces. Quidditch is a game where people score ten points at a time, unless someone catches a special type of ball, which ends the game immediately. So theoretically, the game could end in thirty seconds. And all the other forms of scoring matter not at all. And let's talk about the surprise climax. Really, anyone could have been standing in front of that mirror at the end. It is tremendously unclever. And the penultimate sequence, where the crown is awarded to the best dorm, is anticlimactic and just rude to the children of Slytherin, We only hate one of them, so why should we be happy that the award at first goes to them, and then is cruelly snatched away. And what about Hogwart, anyways? If you're not supposed to use magic when you're away from Hogwart, why the heck would you want to be a wizard anyways?Friends, you're well on the path to making your children drooling morons. If they want a great series of books about sorcery and magic creatures, make them read the Chronicles of Narnia by C.S. Lewis. This is the most soulless garbage imaginable. And I thought Shrek had taken that title. 3/10",
    "120": "It's hard to imagine just how influential the Harry Potter series has been on my life. It was released around the time I was born, and I can't really ever remember a time when it wasn't my favorite world to escape into. Harry Potter and the Philosopher's Stone is the first book I can remember becoming a fan of, and wanting to read it again straight away. I'm not even going to pretend that I can judge this without bringing over my fondness for the books.For all the fault this first movie has, it feels like a soon-to-be classic, with many aspects featured here becoming ubiquitous in popular culture. The score by John Williams is recognized worldwide as a magical and wondrous piece of music, conjuring up images of broomsticks, wands, and giant castles hidden in the mountains. Hogwarts Castle itself is now an enormously successful theme park in Florida, Osaka, and more on the way. King's Cross has become a tourist attraction, with hundreds of fans waiting in line to take a picture with the trolley at Platform 9 3/4 every day.The cast from the very beginning is stock full of British acting royalty, great actors sinking their teeth and relishing every bit of dialogue. The young actors do their best and it's fun to see them start off, knowing what lies ahead for them, both in the course of the series and afterwards as well.The opening sequences have a real sense of mystery and wonder, possibly enhanced by the knowledge of the truth about Harry's real identity. The introductions to characters and places are perfect, most notably: Diagon Alley, Alan Rickman as Snape, and our first glimpse of Hogwarts.The story is simple and mostly an excuse for world-building, but what a world to get lost in. In my head, Hogwarts wasn't so...practical, but it looks like a place a child of 11 would consider the most amazing place in the world. The creatures and rules and spells add to the fun.The film does feature shoddy CGI (the quidditch match is particularly bad) and at 2 and a half hours it is overlong. It's hard to ignore, though, the place in popular culture it has attained and the earnest sense of wonder and fun that it offers to everyone who gives it a chance.",
    "121": "This first Harry Potter surprised me. Not a reader of the books nor a proponent of occult beliefs, I still went into this with an open mind and found I enjoyed the movie. I watched the first three films and own the third (\"Harry Potter and Prisoner Of Azkaban\").This film offered good escapist fare with lots of interesting sets and special- effects, as all the films have done. There is very good color and sound in here, making it even more attractive with a good TV and sound system.Daniel Radcliff was a likable hero, with his round glasses and winsome smile. You can't help but root for him. His friends, played by Rupert Gint and Emma Watson, are okay but Watson gets annoying as the know-it-all school girl. She became more likable in the subsequent Potter films. For me, the British accents in here were not always easy to understand.The story, despite its length of two-and-a-half hours, movies pretty well as there is always something interesting to view. Once again, this movie and the sequels all excelled in this department with great visuals.",
    "122": "With the sixth book now out (and one more to go), I feel that I should review \"Harry Potter and the Sorcerer's Stone\". By now, the Harry Potter books have become so well entrenched in our culture that I don't even need to explain the story. But I can say that director Chris Columbus did a great job adapting the book to the silver screen.The cast does very well with the roles: newcomer Daniel Radcliffe plays Harry Potter, making him strong-willed but vulnerable. Rupert Grint and Emma Watson play his friends, the uptight Ron Weasley and the no-nonsense Hermione Granger. The Hogwarts staff is played by a who's-who of British actors: Richard Harris as headmaster Albus Dumbledore, Maggie Smith as anthropomorphic Prof. Minerva McGonagall (and one can detect a hint of Miss Jean Brodie there), Alan Rickman as unctuous Prof. Severus Snape, and Robbie Coltrane as gamekeeper Rubeus Hagrid. Others include Zoe Wanamaker as Quidditch teacher Madame Hooch, Julie Walters as Molly Weasley (Ron's mum), Richard Griffiths as Vernon Dursley (Harry's mean uncle) and even John Cleese as Nearly-Headless-Nick, one of the school ghosts.All in all, this is a movie for the ages. I know that religious fundamentalists will claim that the Harry Potter books are promoting witchcraft, but are we really going to believe those kinds of people, considering that they claimed the same things about \"Bewitched\"? Harry Potter will live forever - something that no Muggle can do.",
    "123": "Well, for starters, the older cast, almost all of whom are instantly recognizable if you've seen much of British television or film, are simply delightful in their roles, with special honors going to Alan Rickman as Professor Snape, Richard Harris as Albus Dumbledore, and Robbie Coltrane as Rubeus Hagrid. Some other positive aspects to the film is that it is a faithful adaptation for the most part, and the child actors certainly aren't the worst I've ever seen. Moreover, John Williams' brilliant score was at the time one of the best in years.With all this talent at his disposal, Chris Columbus seems almost determined to make the movie as childish and as non-magical as possible. One of the main reasons the Harry Potter books were so successful in the first place was because they really weren't just books for kids, they were books for kids that adults could enjoy. J.K. Rowling created a beautiful, magical world and a bunch of very interesting characters that could keep you interested in reading a book for days, if not weeks. Chris Columbus, however, dumbs it all down to the level that it's not even interesting for two and a half hours. On a superficial level, Columbus might have seemed a good choice to direct; he had been commercially successful in the past, had made some funny comedies (\"Home Alone\", \"Mrs. Doubtfire\") and even handle a drama reasonably well (\"Bicentennial Man\"). However, Columbus has also failed at both those styles before; \"Stepmom\" was manipulative, overly sentimental dreck and \"Nine Months\" simply wasn't funny.Columbus decides to direct this as a kids' movie, and effectively ruins the film in the process. Steve Kloves' script doesn't help either, as it simply plays into Columbus' childish perception with some unbearable slapstick 'humor', which completely destroys most of the novel's charm.There are a couple of solid sequences in this mess of a film, particularly the final scenes, but considering the solid source material and the talent involved, the film is ultimately a failure. It is technically competent and the visual effects are definitely good but unfortunately, in concentrating on the technical aspects, Columbus has wasted a lot of talent and forsaken most of what makes a movie good (acting and writing) for the sake of making the movie merely look good. This may work the first time but the film is a bore on repeated viewings and just doesn't hold up well at all.4/10",
    "124": "Harry Potter is an Orphan who on his eleventh birthday discovers he's a wizard and is called to term at Hogwarts School. But Harry is soon to find out that his past, and his destiny, is a truly remarkable, magical, and terrifying thing.Harry Potter And The Philosopher's Stone arrived in a blaze of publicity, one of the most hyped and talked about motion pictures of the decade had finally arrived. The box office was guaranteed to bulge based on fandom book base alone, regardless of if the film got bad word of mouth or not, it was destined to be a monster smash hit. To someone like me who to this day has never read any of the Harry Potter books, it was easy for me to view objectively without comparison to the source - I enjoyed it immensely upon theatre release, and I still enjoy it equally as much now.Director Christopher Columbus, I believe has wisely stayed loyal to the source material, and thus pleased the literature masses. Yet not all newcomers to the party were that taken by the magic on show, that's a little baffling to me because the budget explodes from the screen at every turn. Oliver Twist like sets form the marvellous Diagon Alley, dream like smoke cloaks the splendid Hogwarts Express, the school itself is a monolithic delight nestling in among eerie mountains - and what about the exhilarating introduction of Quidditch? Pulsating and frantic with no amount of devilment to keep us intrigued throughout.The characters are all perfectly formed in the first two thirds of the film, here Columbus pulls off a masterstroke by interjecting the character arcs with dashes of wonder so that we the audience never gets bored. The final reel plays out solidly as per the mysterious \"who done it\" core of the piece, but it's down to the previous work in the film that we actually care come the finale. Some great casting of the adults really helps to make the film triumph, with Maggie Smith, Robbie Coltrane (one of the best casting jobs of the decade I would say), Richard Harris, Alan Rickman and Zoe Wanamaker all doing excellent work here. The kids are all newcomers that overnight were to become household names, all fresh faced and wet behind the ears, Daniel Radcliffe, Emma Watson, Rupert Grint & Tom Felton are a delight to watch, and they all help to keep the feeling of charm constantly glowing up on the screen.Owls here, witches there, what's that strange three headed dog doing over there? The Harry Potter franchise begins with a bang and a whip of the wand, and I and gazillions of others personally love it. 8/10",
    "125": "\"Harry Potter learns, on his 11th birthday, that he is the orphaned son of two powerful wizards, and possesses magical powers of his own. (Sent to) 'Hogwarts School of Witchcraft and Wizardry', Harry embarks on the adventure of a lifetime, discovering a world of magic and fantasy, where he is destined to live,\" according to the film's official synopsis. This was the first of the films bringing J.K. Rowling's beloved \"Harry Potter\" characters to motion picture life; and, it must be considered a rousing success.Importantly, Ms. Rowling insisted on retaining much creative control, so a higher than usual amount of integrity to the material is maintained. This doesn't benefit the film in every respect; but, it certainly was, in hindsight, the only sure-fire way to introduce these adventures to cinema. One change, done for the book, was that the title would be altered from \"Harry Potter and the Philosopher's Stone\" to \"Harry Potter and the Sorcerer's Stone\" for U.S. consumption; it goes against the grain, and works perfectly. \"Sorcerer's Stone\" is shorter, provides alliteration, and better illustrates the conflict present in the story.Initially, it wasn't obvious that the young trio playing \"Harry\", \"Ron\", and \"Hermione\" had the acting ability to go along with looking right for the leading roles; fortunately, Daniel Radcliffe, Rupert Grint, and Emma Watson would turn out to be just perfect. Richard Harris (as Albus Dumbledore) and Maggie Smith (as Minerva McGonagall) herald a stellar parade of Brits playing throughout the \"Potter\" films, with Robbie Coltrane (as Rubeus Hagrid) going to the head of this, the first class.******** Harry Potter and the Sorcerer's Stone (11/4/01) Chris Columbus ~ Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane",
    "126": "The Debut Movie that Flag-Shipped the Film-Series, that became a Phenom in Itself.It was Hardly a Chance-Effort.The Popular Books by Rowland had a Built-In Audience Salivating at the Prospect.CGI had Evolved into a \"We Can Do Anything\" in SFX for the Asking and the Budget was Magical to say the Least.Top-Notch Acting Talent Among the Adults, Coupled with Energetic and Charming Tweens Added the Finishing Touches on a Guaranteed Block-Buster.Most Fans Reacted, Admitting it is Slavishly Faithful to the Books and the Scope of the Story is Made for an Audience from 6 to 60,By most Accounts the Initial Movie was a Bona-Fide Success, Artistically and Commercially.Outsiders, Newbies, and the Uniformed also seem to Warm Up to the Charming and sometimes Edgy Youth Material.There were Rumblings from Evangelicals about \"Satan Worship\", Witchcraft Corrupting the Minds of the Impressionable.But that is Expected and an Argument as Old as the Printed Word.Kids Love it and most Adults went along for the Magical, Fantastic Ride that was On-Screen Fresh in 2001 and quite the Treat for Movie-Goers.It's about as Inoffensive as this Type of Thing could be, and maybe went Too Far with its \"Play it Safe\" Attitude.The Movie Leans Away from the Cutting-Edge and can be a bit Dull for those Expecting more Horrifying Elements.It's a Wonderful Movie for the Whole Family and when its Initial Release Date Finally Arrived,Everybody seemed to get in On the Fun.Colorful, Fanciful, Mysterious, and Adventurous.Some Scary Stuff, but Most of All a Celebration of Youthful Imagination and Wonder.Note...Why did they change it to Sorcerer's Stone for Americans?\" ... It was changed by the American publisher, Scholastic, because it thought American children wouldn't want to read a book with \"philosopher\" in the title.",
    "127": "I was drawn into the story the moment the letters started whirling through the air to \"the boy under the cupboard\" and to the amusing trio (Aunt, Uncle, brother) that give interest to the early scenes and make you anxious for Harry to escape life in this demented household. And from the opening scene on, the special effects are nothing short of marvelous despite what some \"critics\" here are calling \"cheesy\" -- I'm sure the film is a strong contender in that category for a Best Special Effects Oscar.Having said that--and not being a fan of Dragons and Dungeons, etc. kind of games--my only disappointment was that most of the \"magic\" was too much on the dark side--without enough humor to keep things in a lighter vein for the most part. If this is what kids like, they'll love being scared time and time again by some of the creatures and situations.I have only praise for the performances, although I agree that Daniel Radcliffe seems to only have two expressions and is indeed bland, but appealing enough, as Harry. Everyone else does their best to bring the characters to life--especially Maggie Smith as head witch and Alan Rickman as Snapes. I think his is the film's outstanding performance.I was aware of too much exposition in the film (to explain to those of us who haven't read the book what Muggles are, etc.) but I'm sure this sort of thing will diminish when the series continues. I was disappointed by the John Williams score, relentless throughout with only one jaunty theme worth remembering.  This was made even more obvious by the fact that a trailer for the upcoming re-release of \"ET\" emphasized the difference between his \"ET\" score and the one he wrote for \"Harry Potter\". Obviously, he had much more of an emotional connection to the characters in \"ET\" than was possible for him to have with the characters here. There is no such connection to the characters in this relentlessly busy score.Even Potter's farewell scene before boarding the train for home, lacks the emotional warmth so strongly suggested in \"ET\" -- a factor that makes the entire movie seem a one-dimensional but highly competent version of a beloved book. All of the set pieces are extraordinarily detailed and well executed, including the Chess Game--and there's a nice plot twist toward the end that I won't reveal here. All in all, a good film version of the book which I understand is remarkably faithful to the novel--and don't let anyone tell you the special effects are anything less than superb!Nevertheless, a John Williams letdown. I'm sure Daniel Radcliffe--who is physically perfect for the role--will improve in his bystander reactions. After all, he made a wonderful 'David Copperfield' on PBS not long ago. Despite some drawbacks, looking forward to the next visualization of Potter's adventures.The film is known in England and many other countries abroad as \"...and the Philosopher's Stone\".  Frankly, I think the American title is more suitable as it implies \"witchcraft\" which is the very essence of the story. With the U.K. constantly changing American film titles, it's not surprising at all that we sometimes do the same thing. Apparently, we don't really speak the same language!",
    "128": "Orphaned not long after his birth, \"Harry Potter\" (Daniel Radcliffe) is forced to live in the home of his only living relatives who treat him rather badly. That all changes one day when he is informed by a man named \"Rebeus Hagrid\" (Robbie Coltrane) that his parents were famous magicians and because of that he is invited to attend the Hogwarts School of Witchcraft and Wizardry. Needless to say, Harry accepts almost immediately and after Hagrid and he buy the necessary school equipment he begins his journey to the mystical academy. It's then that he meets two fellow students named \"Ron Weasley\" (Rupert Grint) and \"Hermione Granger\" (Emma Watson) who become his good friends and share in his triumphs and travails. Now rather than reveal any more I will just say that this film was based on the very successful book \"Harry Potter and the Philosopher's Stone\" by J.K. Rowling and from what I understand remains quite faithful to the book. At least for the most part. In any case, I found it to be a fine fantasy film with the interaction between Harry and his two friends especially entertaining. Admittedly, there are some slow parts here and there and it does run a bit long (152 minutes). Even so, despite the faults just mentioned, I believe this to be one of those rare movies which can be enjoyed by the entire family and I have rated it accordingly. Above average.",
    "129": "I'm finally in a position to re-watch and review the Harry Potter film series - I'm way past over due for reviewing them.First of all, I don't know of anyone that has not seen at least one Harry Potter flick. Everyone seems to agree that these are great films - I am no exception.Secondly, the entire series is highly entertaining! If you haven't seen this series then I highly recommend you should. Comical, magical and all around fun to watch.This first film starts out with a bang as when Hagrid, Dumbledore and Minerva McGonagall show up with baby Harry Potter on the doorstep of Harry's relatives home. The film ends on a good note with the house cup being awarded. In between the beginning and ending is non-stop entertainment.Great to watch this film again9.5/10",
    "130": "If you watch \"Sorcerer's Stone\" without reading the book first, there are certain narrative points that you will miss or not quite be as clear on (as usual). However, watching the movie closely following the reading experience will actually expand upon the Potter myth (I gave the first book four stars) due to this film's ability to lay the groundwork of the series in such stunning visuals and characters.For a basic plot summary, \"Sorcerer's Stone\" sees young Harry Potter (Daniel Radcliffe) living with his aunt and uncle and being mistreated horribly (sleeping in a closet under the stairs, told how rotten he is all the time, etc.). Right before his 11th birthday, however, Harry begins receiving letters from a mysterious owl (as well as a visit from a rather large gentleman riding a flying motorcycle) informing him that he is in fact from wizard lineage. Thus, Harry is whisked away to Hogwarts, a \"Wizard Academy\" of sorts, to begin his training. While at Hogwarts, Harry meets new friends Ron (Rupert Grint) & Hermoine (Emma Watson) as well as discovers the mystery behind the death of his parents regarding a shadowy character called Voldemort.In terms of following the novel, this film does a pretty good job of keeping in lock-step. There are certain scenes that are excised for time/continuity and a few \"facts\" from the book that are blatantly different from the movie, but other than that it is a great representation.In fact, in a departure from the norm, I actually enjoyed the movie experience better than the book. Why? Because of the way it was able to so wonderfully put a visual to all the great characters. For some, the \"mystery is gone\" when they see their literary characters up on the big screen, but in this case I was very pleased to put a face to all these great characters.The movie also has (just like the book) a sense of \"epic-ness\" to it. It is very clear that this is only the beginning of an epic series, with more and more mysteries and character development to come.Thus, \"Sorcerer's Stone\" is a great cinematic experience that will leave you wanting more as soon as it concludes. The mysteries and characters are paced perfectly, and the story (as it is geared for young adults in the first place) is easy enough to latch onto while nuanced enough to get sucked into.",
    "131": "With billions upon billions of pounds in revenue generated from book sales, film adaptations and all other mediums, and with the hysteria surrounding the series now all but gone, it seemed the perfect time to re-visit the Harry Potter film franchise. I'll state outright that I'm a fan of the books: they are hardly ground-breaking pieces of literature, but they are a meticulously crafted and widely imaginative set of novels, maturing with it's progression and with the age of it's characters and readers. The movie adaptations were consistently average, fiercely loyal to J.K. Rowling's prose but always somewhat lacking in substance.Shut away in the cupboard under the stairs by his adoptive parents (Richard Griffiths and Fiona Shaw), 11 year-old Harry Potter (Daniel Radcliffe) lives an unhappy life. But there's something different about him, as he learns when he talks to a snake at a zoo and makes the protective glass disappear, causing his vile cousin Dudley Dursley (Harry Melling) to fall into the tank. His life changes when he is invited to enroll at Hogwarts School of Witchcraft and Wizardry. The invitations are burned by the Dursleys, and they go to great lengths to stop him going to a place that will teach him magic, until he is rescued by a hairy giant named Reubus Hagrid (Robbie Coltrane).When introduced into the magical world with Hagrid, Harry learns that he is famous. His parents were killed by an evil wizard named Lord Voldemort (generally referred to as You-Know-Who), but Harry survived the attack, seemingly killing Voldemort and inflicting Harry with a lightning bolt scar on his forehead. When he gets to Hogwarts, he is befriended by the bumbling Ron Weasley (Rupert Grint) and the precocious Hermione Granger (Emma Watson), and the three are quickly embroiled in a plot involving murdered unicorns, a mysterious artefact known as the philosopher's stone, and a giant three-headed dog.Philosopher's Stone is almost defiantly faithful to the books. Sure, lines are altered here, and minor characters are snipped out there, but this is as close as literally 'bringing a book to life' gets. Yet while this works in it's favour in terms of visualising Rowling's creations, it doesn't even try to develop any ideas of it's own that would have only worked in a visual medium. Much of Rowling's silly and charming sense of humour is lost in simply filming whatever happens on the pages. One of the main criticism's I have for the books is that a lot of the major characters are little more than archetypes, so a lot rested on the three young leads' shoulders in making us interested enough to stick with them.Sadly, two of the three fall rather flat, with only the gurning and hang-dog Rupert Grint showing a natural gift for appearing on the big screen. Potter is a simple enough character anyway, at least he is at this point of the story, shy, naive but brave, but Radcliffe gives an incredibly one-note performance, encapsulated in the scene in which he discovers he can perform magic. \"I'm a... wizard?\" he says, lacking anything resembling a facial expression. Watson also struggles to bring much likability to her self-satisfied bookworm, her eyebrows constantly rising and falling as she struggles to perform her lines with any conviction.For the rest of the cast, director Chris Columbus has rounded up a smorgasbord of British and Irish talent, a collection of well-trained thespians who steal the entire film from it's leads. Richard Harris plays Professor Dumbledore, Hogwarts' headmaster, Maggie Smith is Professor McGonagall, head of Gryffindor, the house Harry is chosen for, Alan Rickman is Professor Snape, Harry's greasy-haired Potions teacher, and John Hurt makes a small appearance as a wand-maker. Coltrane probably steals the film as the beast-loving grounds-keeper Hagrid. It's an amazing line-up that would consistently grow both in talent and in numbers as the films progressed.Ultimately, Harry Potter and the Philosopher's Stone is a success, weaving an interesting enough story about the possible return of the dark lord Voldemort, with Harry's wide-eyed introduction to the world of hocus pocus. John Williams' Oscar-nominated and now widely recognisable score captures some of the giddy movie magic of early Spielberg, and the attention to detail is often remarkable. But like the book, it ultimately suffers from being too kid-friendly, spoon-feeding lessons in morality without giving much for adults to chew on. It's little more than a well-told children's story, something that would change as the novels became darker and more complex, but at this point, it's a gentle introduction to a captivating world.",
    "132": "In the first outing for Harry Potter, he learns of his descent from a magical background and enrols at the school of witchcraft and wizardry 'Hogwarts'Largely character building this magical adventure takes Harry and his new friends, Hermione (a very talented young Witch) and Ron (Harry's best friend) on a quest for the Philosopher's stone, a powerful stone wanted by the murderer of Harry's parents (Voldomort)Not having read the books, i can't make any comparisons, but even as a stand alone movie, this makes a fine fantasy adventure, fun for all ages. The characters are great, the scenery is wonderful and there is enough magical enchantment to charm and entertain all of us.8/10",
    "133": "Harry Potter and the Sorcerer's Stone is not a perfect film, but it is a magical film. The franchise has been a large part of my life for most of my life. With the first book coming out when I was three years old and the first movie when I was seven, there is a special place in my heart for the Wizarding World of Harry Potter.I know that it is not the most remarkable piece of art when looking at it from a filmmaking perspective. However, let us remember that this movie was made for children. When it comes to world-building and enveloping the audience, I would argue that this movie goes toe to toe with Lord of the Rings and some of the other greats.What Chris Columbus and company did is nothing short of game-changing. They took excellent source material, stayed true to the book and built upon it. The visuals, specifically involving Hogwarts, are gorgeous. The score by John Williams is one of the most recognizable of all time. The characters are instantly likeable (or despicable). There is honestly so much to praise and love about this movie.While not every scene is necessary to the plot, those \"pointless\" scenes further add to the feeling of magic. From sitting in Flitwick's classroom to ruminating on a windowsill with an owl, I could watch footage of Hogwarts on repeat. This is a movie that I could turn on at any time and jump right into the story. Simply put, I instantly have a warm feeling which stays with me the whole way through.While the acting and dialogue have some rough moments, particularly with the younger actors, the casting is excellent. From Alan Rickman and Robbie Coltrane to Richard Harris and Maggie Smith, there is not a single dud when it comes to the adult cast. The students are also perfectly cast, with the main trio's chemistry on full display.At the end of the day I'll say it again, I know that this is not a perfect film, but it is a magical film. The movie is highly rewatchable, endlessly quotable and enchantingly enjoyable. When defining \"comfort film\", this movie is at the top of the list. Simply put, Harry Potter and the Sorcerer's Stone set the stage for one of the most popular movie franchises of all time and one of the most impactful parts of my childhood.Best Character: Rubeus HagridBest Moment: Arriving to Hogwarts on the boats.Best Quote: \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.\" - Albus DumbledoreAdditional Note: Having the house cup ripped from Slytherin is why I have issues with premature celebration. That being said, the whole sequence is still chill-inducing.",
    "134": "I have recently been revisiting the Harry Potter franchise during the ongoing pandemic and I have been wondering whether these movie that I hadn't seen in a decade would have aged well or not. My conclusion is that most of them have aged particularly well and this is especially the case for the first two movies that I consider the best of the franchise. The producers' idea to hire veteran director Chris Columbus was certainly a decisive one in hindsight since he managed to transform a first novel with numerous lengths into an extremely entertaining film for the entire family.The movie has numerous other strengths that need to be pointed out. Even two decades later, the special effects still look stunning and do the great novel series justice. The visual effects are magical, the sound effects are epic and the lighting techniques increase the movie's multiple shifts in atmosphere.The locations have been chosen with care as well. Harry Potter's home looks as boring, desolate and exchangeable as it's described in the novel. The scene at the lighthouse oozes with atmosphere. King's Cross busy Platform 9 3/4 looks very colourful, detailed and imaginative. The extraordinary train ride to Hogwarts invites to dream yourself far away. The highlight is obviously Hogwarts and its surroundings as nearly every section in this gigantic castle comes around with creative details and imaginative surprises.The film certainly convinces with its detailed storytelling and diversified subplots. It takes all the time it needs to introduce us to numerous most entertaining classes at Hogwarts. The sections that show and explain Harry Potter's Quidditch career are so detailed that even someone who hasn't read the novel will understand how this fascinating wizarding sport works. The film carefully and credibly develops the friendship between lead characters Harry Potter, Ron Weasley and Hermione Granger. Everything is however wrapped up perfectly in an adventurous, entertaining and epic finale where the three protagonists have to face numerous challenges related to the main plot as an impostor is aiming to steal the mysterious Sorcerer's Stone for a most sinister purpose.The young actresses and actors are doing excellent jobs and are truly convincing in their roles. Daniel Radcliffe shines as confused and isolated but soon enough adventurous and imaginative young wizard going through dynamic changes. Rupert Grint excels as friendly but clumsy young wizard who you are going to appreciate right from the start. Emma Watson shines as self-confident, intellectual and slightly arrogant young wizard whose academic performances are incredibly inspiring. The adult actors have also been chosen with care. Richard Harris's performance as principal Albus Dumbledore is the best ever for this role as he convinces as wise, patient and kind mentor that you will like right from the start. My personal highlight is Alan Rickman as cold, gloomy and unpredictable professor who seems to be antagonist and protagonist all at once.In the end, Harry Potter and the Sorcerer's Stone is not only the only movie that I prefer over its novel version in the franchise but also one of the two best movies in the inspiring fantasy film franchise that has left a significant mark on an entire generation of children and teenagers two decades ago. The film has aged quite well and should still impress children and teenagers as well as their parents all around the world nowadays. The movie has been executed with care in every single department and has lost nothing of its unique charm. It would go as far to state that it stands as one of the very best fantasy movies of the twenty-first century.",
    "135": "I have, in all my life as a lover of both literature and the cinema, hardly ever come upon a piece of work more unimaginative, more ugly, more uninteresting, more lacking in suspense, more lacking in charm, more greedy, more incoherent... Okay, okay. I'll stop with the superlative negatives. Surely there have been worse, and, yes, off the top of my head, I can think of many that are worse. However, for a book that over 125 million people have read, and for a movie that cemented the record for the biggest opening weekend in history, and also for a book that has had not only kids but critics singing its praises, and also for a movie which one particularly fat-headed critic called the Wizard of Oz of its generation, I am more than severely disappointed. I know that, had it not been so overhyped, it would have been just as bad. Now, however, my anger for it is completely hardened and it's going to be a passionate battle for me for years to come.I go into an in depth criticism, but it would be impossible for me to keep to 1000 words. There is hardly a piece of it that I liked. As a film, it was poorly edited, poorly acted (by most), poorly filmed. The only really memorable scene is the troll in the bathroom, although the payoff to it makes no sense whatsoever. The Quidditch game, which has been hyped to all heaven, is completely boring and poorly created. It looks like the FX guys created it with photoshop. When the chess game looked like it was about to be the most exciting sequence in the film, Christopher Columbus, who, I must say, lives up to his reputation completely, begins to edit furiously. I heard afterwards that this was done to avoid a PG-13. My immediate thought is that the filmmakers didn't trust their young audience to enjoy watching a chess game, no matter how exciting it might have been. I'm still not sure which story to buy.But the person I really want to tear into is J.K. Rowling. What a hack. Never has the word \"hack\" been more fitting. A former waitress, her idea of imagination is to call things by weird names. Only in the mind of a psychopath (or idiot) could the name Draco Malfoy or a Cerberus clone named Fluffy be considered clever. Writing children's literature is not difficult, but this is simply awful. She's clearly ripping off Raoul Dahl like there's no tomorrow, especially in the exposition. The game of Quidditch, which seems to be a drawing point of some sort, is absolutely nonsensical. As a preteen, I invented much more interesting games with much less interesting playing pieces. Quidditch is a game where people score ten points at a time, unless someone catches a special type of ball, which ends the game immediately. So theoretically, the game could end in thirty seconds. And all the other forms of scoring matter not at all. And let's talk about the surprise climax. Really, anyone could have been standing in front of that mirror at the end. It is tremendously unclever. And the penultimate sequence, where the crown is awarded to the best dorm, is anticlimactic and just rude to the children of Slytherin, We only hate one of them, so why should we be happy that the award at first goes to them, and then is cruelly snatched away. And what about Hogwart, anyways? If you're not supposed to use magic when you're away from Hogwart, why the heck would you want to be a wizard anyways?Friends, you're well on the path to making your children drooling morons. If they want a great series of books about sorcery and magic creatures, make them read the Chronicles of Narnia by C.S. Lewis. This is the most soulless garbage imaginable. And I thought Shrek had taken that title. 3/10",
    "136": "It's hard to imagine just how influential the Harry Potter series has been on my life. It was released around the time I was born, and I can't really ever remember a time when it wasn't my favorite world to escape into. Harry Potter and the Philosopher's Stone is the first book I can remember becoming a fan of, and wanting to read it again straight away. I'm not even going to pretend that I can judge this without bringing over my fondness for the books.For all the fault this first movie has, it feels like a soon-to-be classic, with many aspects featured here becoming ubiquitous in popular culture. The score by John Williams is recognized worldwide as a magical and wondrous piece of music, conjuring up images of broomsticks, wands, and giant castles hidden in the mountains. Hogwarts Castle itself is now an enormously successful theme park in Florida, Osaka, and more on the way. King's Cross has become a tourist attraction, with hundreds of fans waiting in line to take a picture with the trolley at Platform 9 3/4 every day.The cast from the very beginning is stock full of British acting royalty, great actors sinking their teeth and relishing every bit of dialogue. The young actors do their best and it's fun to see them start off, knowing what lies ahead for them, both in the course of the series and afterwards as well.The opening sequences have a real sense of mystery and wonder, possibly enhanced by the knowledge of the truth about Harry's real identity. The introductions to characters and places are perfect, most notably: Diagon Alley, Alan Rickman as Snape, and our first glimpse of Hogwarts.The story is simple and mostly an excuse for world-building, but what a world to get lost in. In my head, Hogwarts wasn't so...practical, but it looks like a place a child of 11 would consider the most amazing place in the world. The creatures and rules and spells add to the fun.The film does feature shoddy CGI (the quidditch match is particularly bad) and at 2 and a half hours it is overlong. It's hard to ignore, though, the place in popular culture it has attained and the earnest sense of wonder and fun that it offers to everyone who gives it a chance.",
    "137": "This first Harry Potter surprised me. Not a reader of the books nor a proponent of occult beliefs, I still went into this with an open mind and found I enjoyed the movie. I watched the first three films and own the third (\"Harry Potter and Prisoner Of Azkaban\").This film offered good escapist fare with lots of interesting sets and special- effects, as all the films have done. There is very good color and sound in here, making it even more attractive with a good TV and sound system.Daniel Radcliff was a likable hero, with his round glasses and winsome smile. You can't help but root for him. His friends, played by Rupert Gint and Emma Watson, are okay but Watson gets annoying as the know-it-all school girl. She became more likable in the subsequent Potter films. For me, the British accents in here were not always easy to understand.The story, despite its length of two-and-a-half hours, movies pretty well as there is always something interesting to view. Once again, this movie and the sequels all excelled in this department with great visuals.",
    "138": "With the sixth book now out (and one more to go), I feel that I should review \"Harry Potter and the Sorcerer's Stone\". By now, the Harry Potter books have become so well entrenched in our culture that I don't even need to explain the story. But I can say that director Chris Columbus did a great job adapting the book to the silver screen.The cast does very well with the roles: newcomer Daniel Radcliffe plays Harry Potter, making him strong-willed but vulnerable. Rupert Grint and Emma Watson play his friends, the uptight Ron Weasley and the no-nonsense Hermione Granger. The Hogwarts staff is played by a who's-who of British actors: Richard Harris as headmaster Albus Dumbledore, Maggie Smith as anthropomorphic Prof. Minerva McGonagall (and one can detect a hint of Miss Jean Brodie there), Alan Rickman as unctuous Prof. Severus Snape, and Robbie Coltrane as gamekeeper Rubeus Hagrid. Others include Zoe Wanamaker as Quidditch teacher Madame Hooch, Julie Walters as Molly Weasley (Ron's mum), Richard Griffiths as Vernon Dursley (Harry's mean uncle) and even John Cleese as Nearly-Headless-Nick, one of the school ghosts.All in all, this is a movie for the ages. I know that religious fundamentalists will claim that the Harry Potter books are promoting witchcraft, but are we really going to believe those kinds of people, considering that they claimed the same things about \"Bewitched\"? Harry Potter will live forever - something that no Muggle can do.",
    "139": "Well, for starters, the older cast, almost all of whom are instantly recognizable if you've seen much of British television or film, are simply delightful in their roles, with special honors going to Alan Rickman as Professor Snape, Richard Harris as Albus Dumbledore, and Robbie Coltrane as Rubeus Hagrid. Some other positive aspects to the film is that it is a faithful adaptation for the most part, and the child actors certainly aren't the worst I've ever seen. Moreover, John Williams' brilliant score was at the time one of the best in years.With all this talent at his disposal, Chris Columbus seems almost determined to make the movie as childish and as non-magical as possible. One of the main reasons the Harry Potter books were so successful in the first place was because they really weren't just books for kids, they were books for kids that adults could enjoy. J.K. Rowling created a beautiful, magical world and a bunch of very interesting characters that could keep you interested in reading a book for days, if not weeks. Chris Columbus, however, dumbs it all down to the level that it's not even interesting for two and a half hours. On a superficial level, Columbus might have seemed a good choice to direct; he had been commercially successful in the past, had made some funny comedies (\"Home Alone\", \"Mrs. Doubtfire\") and even handle a drama reasonably well (\"Bicentennial Man\"). However, Columbus has also failed at both those styles before; \"Stepmom\" was manipulative, overly sentimental dreck and \"Nine Months\" simply wasn't funny.Columbus decides to direct this as a kids' movie, and effectively ruins the film in the process. Steve Kloves' script doesn't help either, as it simply plays into Columbus' childish perception with some unbearable slapstick 'humor', which completely destroys most of the novel's charm.There are a couple of solid sequences in this mess of a film, particularly the final scenes, but considering the solid source material and the talent involved, the film is ultimately a failure. It is technically competent and the visual effects are definitely good but unfortunately, in concentrating on the technical aspects, Columbus has wasted a lot of talent and forsaken most of what makes a movie good (acting and writing) for the sake of making the movie merely look good. This may work the first time but the film is a bore on repeated viewings and just doesn't hold up well at all.4/10",
    "140": "Harry Potter is an Orphan who on his eleventh birthday discovers he's a wizard and is called to term at Hogwarts School. But Harry is soon to find out that his past, and his destiny, is a truly remarkable, magical, and terrifying thing.Harry Potter And The Philosopher's Stone arrived in a blaze of publicity, one of the most hyped and talked about motion pictures of the decade had finally arrived. The box office was guaranteed to bulge based on fandom book base alone, regardless of if the film got bad word of mouth or not, it was destined to be a monster smash hit. To someone like me who to this day has never read any of the Harry Potter books, it was easy for me to view objectively without comparison to the source - I enjoyed it immensely upon theatre release, and I still enjoy it equally as much now.Director Christopher Columbus, I believe has wisely stayed loyal to the source material, and thus pleased the literature masses. Yet not all newcomers to the party were that taken by the magic on show, that's a little baffling to me because the budget explodes from the screen at every turn. Oliver Twist like sets form the marvellous Diagon Alley, dream like smoke cloaks the splendid Hogwarts Express, the school itself is a monolithic delight nestling in among eerie mountains - and what about the exhilarating introduction of Quidditch? Pulsating and frantic with no amount of devilment to keep us intrigued throughout.The characters are all perfectly formed in the first two thirds of the film, here Columbus pulls off a masterstroke by interjecting the character arcs with dashes of wonder so that we the audience never gets bored. The final reel plays out solidly as per the mysterious \"who done it\" core of the piece, but it's down to the previous work in the film that we actually care come the finale. Some great casting of the adults really helps to make the film triumph, with Maggie Smith, Robbie Coltrane (one of the best casting jobs of the decade I would say), Richard Harris, Alan Rickman and Zoe Wanamaker all doing excellent work here. The kids are all newcomers that overnight were to become household names, all fresh faced and wet behind the ears, Daniel Radcliffe, Emma Watson, Rupert Grint & Tom Felton are a delight to watch, and they all help to keep the feeling of charm constantly glowing up on the screen.Owls here, witches there, what's that strange three headed dog doing over there? The Harry Potter franchise begins with a bang and a whip of the wand, and I and gazillions of others personally love it. 8/10",
    "141": "\"Harry Potter learns, on his 11th birthday, that he is the orphaned son of two powerful wizards, and possesses magical powers of his own. (Sent to) 'Hogwarts School of Witchcraft and Wizardry', Harry embarks on the adventure of a lifetime, discovering a world of magic and fantasy, where he is destined to live,\" according to the film's official synopsis. This was the first of the films bringing J.K. Rowling's beloved \"Harry Potter\" characters to motion picture life; and, it must be considered a rousing success.Importantly, Ms. Rowling insisted on retaining much creative control, so a higher than usual amount of integrity to the material is maintained. This doesn't benefit the film in every respect; but, it certainly was, in hindsight, the only sure-fire way to introduce these adventures to cinema. One change, done for the book, was that the title would be altered from \"Harry Potter and the Philosopher's Stone\" to \"Harry Potter and the Sorcerer's Stone\" for U.S. consumption; it goes against the grain, and works perfectly. \"Sorcerer's Stone\" is shorter, provides alliteration, and better illustrates the conflict present in the story.Initially, it wasn't obvious that the young trio playing \"Harry\", \"Ron\", and \"Hermione\" had the acting ability to go along with looking right for the leading roles; fortunately, Daniel Radcliffe, Rupert Grint, and Emma Watson would turn out to be just perfect. Richard Harris (as Albus Dumbledore) and Maggie Smith (as Minerva McGonagall) herald a stellar parade of Brits playing throughout the \"Potter\" films, with Robbie Coltrane (as Rubeus Hagrid) going to the head of this, the first class.******** Harry Potter and the Sorcerer's Stone (11/4/01) Chris Columbus ~ Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane",
    "142": "The Debut Movie that Flag-Shipped the Film-Series, that became a Phenom in Itself.It was Hardly a Chance-Effort.The Popular Books by Rowland had a Built-In Audience Salivating at the Prospect.CGI had Evolved into a \"We Can Do Anything\" in SFX for the Asking and the Budget was Magical to say the Least.Top-Notch Acting Talent Among the Adults, Coupled with Energetic and Charming Tweens Added the Finishing Touches on a Guaranteed Block-Buster.Most Fans Reacted, Admitting it is Slavishly Faithful to the Books and the Scope of the Story is Made for an Audience from 6 to 60,By most Accounts the Initial Movie was a Bona-Fide Success, Artistically and Commercially.Outsiders, Newbies, and the Uniformed also seem to Warm Up to the Charming and sometimes Edgy Youth Material.There were Rumblings from Evangelicals about \"Satan Worship\", Witchcraft Corrupting the Minds of the Impressionable.But that is Expected and an Argument as Old as the Printed Word.Kids Love it and most Adults went along for the Magical, Fantastic Ride that was On-Screen Fresh in 2001 and quite the Treat for Movie-Goers.It's about as Inoffensive as this Type of Thing could be, and maybe went Too Far with its \"Play it Safe\" Attitude.The Movie Leans Away from the Cutting-Edge and can be a bit Dull for those Expecting more Horrifying Elements.It's a Wonderful Movie for the Whole Family and when its Initial Release Date Finally Arrived,Everybody seemed to get in On the Fun.Colorful, Fanciful, Mysterious, and Adventurous.Some Scary Stuff, but Most of All a Celebration of Youthful Imagination and Wonder.Note...Why did they change it to Sorcerer's Stone for Americans?\" ... It was changed by the American publisher, Scholastic, because it thought American children wouldn't want to read a book with \"philosopher\" in the title.",
    "143": "I was drawn into the story the moment the letters started whirling through the air to \"the boy under the cupboard\" and to the amusing trio (Aunt, Uncle, brother) that give interest to the early scenes and make you anxious for Harry to escape life in this demented household. And from the opening scene on, the special effects are nothing short of marvelous despite what some \"critics\" here are calling \"cheesy\" -- I'm sure the film is a strong contender in that category for a Best Special Effects Oscar.Having said that--and not being a fan of Dragons and Dungeons, etc. kind of games--my only disappointment was that most of the \"magic\" was too much on the dark side--without enough humor to keep things in a lighter vein for the most part. If this is what kids like, they'll love being scared time and time again by some of the creatures and situations.I have only praise for the performances, although I agree that Daniel Radcliffe seems to only have two expressions and is indeed bland, but appealing enough, as Harry. Everyone else does their best to bring the characters to life--especially Maggie Smith as head witch and Alan Rickman as Snapes. I think his is the film's outstanding performance.I was aware of too much exposition in the film (to explain to those of us who haven't read the book what Muggles are, etc.) but I'm sure this sort of thing will diminish when the series continues. I was disappointed by the John Williams score, relentless throughout with only one jaunty theme worth remembering.  This was made even more obvious by the fact that a trailer for the upcoming re-release of \"ET\" emphasized the difference between his \"ET\" score and the one he wrote for \"Harry Potter\". Obviously, he had much more of an emotional connection to the characters in \"ET\" than was possible for him to have with the characters here. There is no such connection to the characters in this relentlessly busy score.Even Potter's farewell scene before boarding the train for home, lacks the emotional warmth so strongly suggested in \"ET\" -- a factor that makes the entire movie seem a one-dimensional but highly competent version of a beloved book. All of the set pieces are extraordinarily detailed and well executed, including the Chess Game--and there's a nice plot twist toward the end that I won't reveal here. All in all, a good film version of the book which I understand is remarkably faithful to the novel--and don't let anyone tell you the special effects are anything less than superb!Nevertheless, a John Williams letdown. I'm sure Daniel Radcliffe--who is physically perfect for the role--will improve in his bystander reactions. After all, he made a wonderful 'David Copperfield' on PBS not long ago. Despite some drawbacks, looking forward to the next visualization of Potter's adventures.The film is known in England and many other countries abroad as \"...and the Philosopher's Stone\".  Frankly, I think the American title is more suitable as it implies \"witchcraft\" which is the very essence of the story. With the U.K. constantly changing American film titles, it's not surprising at all that we sometimes do the same thing. Apparently, we don't really speak the same language!",
    "144": "Orphaned not long after his birth, \"Harry Potter\" (Daniel Radcliffe) is forced to live in the home of his only living relatives who treat him rather badly. That all changes one day when he is informed by a man named \"Rebeus Hagrid\" (Robbie Coltrane) that his parents were famous magicians and because of that he is invited to attend the Hogwarts School of Witchcraft and Wizardry. Needless to say, Harry accepts almost immediately and after Hagrid and he buy the necessary school equipment he begins his journey to the mystical academy. It's then that he meets two fellow students named \"Ron Weasley\" (Rupert Grint) and \"Hermione Granger\" (Emma Watson) who become his good friends and share in his triumphs and travails. Now rather than reveal any more I will just say that this film was based on the very successful book \"Harry Potter and the Philosopher's Stone\" by J.K. Rowling and from what I understand remains quite faithful to the book. At least for the most part. In any case, I found it to be a fine fantasy film with the interaction between Harry and his two friends especially entertaining. Admittedly, there are some slow parts here and there and it does run a bit long (152 minutes). Even so, despite the faults just mentioned, I believe this to be one of those rare movies which can be enjoyed by the entire family and I have rated it accordingly. Above average.",
    "145": "I'm finally in a position to re-watch and review the Harry Potter film series - I'm way past over due for reviewing them.First of all, I don't know of anyone that has not seen at least one Harry Potter flick. Everyone seems to agree that these are great films - I am no exception.Secondly, the entire series is highly entertaining! If you haven't seen this series then I highly recommend you should. Comical, magical and all around fun to watch.This first film starts out with a bang as when Hagrid, Dumbledore and Minerva McGonagall show up with baby Harry Potter on the doorstep of Harry's relatives home. The film ends on a good note with the house cup being awarded. In between the beginning and ending is non-stop entertainment.Great to watch this film again9.5/10",
    "146": "If you watch \"Sorcerer's Stone\" without reading the book first, there are certain narrative points that you will miss or not quite be as clear on (as usual). However, watching the movie closely following the reading experience will actually expand upon the Potter myth (I gave the first book four stars) due to this film's ability to lay the groundwork of the series in such stunning visuals and characters.For a basic plot summary, \"Sorcerer's Stone\" sees young Harry Potter (Daniel Radcliffe) living with his aunt and uncle and being mistreated horribly (sleeping in a closet under the stairs, told how rotten he is all the time, etc.). Right before his 11th birthday, however, Harry begins receiving letters from a mysterious owl (as well as a visit from a rather large gentleman riding a flying motorcycle) informing him that he is in fact from wizard lineage. Thus, Harry is whisked away to Hogwarts, a \"Wizard Academy\" of sorts, to begin his training. While at Hogwarts, Harry meets new friends Ron (Rupert Grint) & Hermoine (Emma Watson) as well as discovers the mystery behind the death of his parents regarding a shadowy character called Voldemort.In terms of following the novel, this film does a pretty good job of keeping in lock-step. There are certain scenes that are excised for time/continuity and a few \"facts\" from the book that are blatantly different from the movie, but other than that it is a great representation.In fact, in a departure from the norm, I actually enjoyed the movie experience better than the book. Why? Because of the way it was able to so wonderfully put a visual to all the great characters. For some, the \"mystery is gone\" when they see their literary characters up on the big screen, but in this case I was very pleased to put a face to all these great characters.The movie also has (just like the book) a sense of \"epic-ness\" to it. It is very clear that this is only the beginning of an epic series, with more and more mysteries and character development to come.Thus, \"Sorcerer's Stone\" is a great cinematic experience that will leave you wanting more as soon as it concludes. The mysteries and characters are paced perfectly, and the story (as it is geared for young adults in the first place) is easy enough to latch onto while nuanced enough to get sucked into.",
    "147": "With billions upon billions of pounds in revenue generated from book sales, film adaptations and all other mediums, and with the hysteria surrounding the series now all but gone, it seemed the perfect time to re-visit the Harry Potter film franchise. I'll state outright that I'm a fan of the books: they are hardly ground-breaking pieces of literature, but they are a meticulously crafted and widely imaginative set of novels, maturing with it's progression and with the age of it's characters and readers. The movie adaptations were consistently average, fiercely loyal to J.K. Rowling's prose but always somewhat lacking in substance.Shut away in the cupboard under the stairs by his adoptive parents (Richard Griffiths and Fiona Shaw), 11 year-old Harry Potter (Daniel Radcliffe) lives an unhappy life. But there's something different about him, as he learns when he talks to a snake at a zoo and makes the protective glass disappear, causing his vile cousin Dudley Dursley (Harry Melling) to fall into the tank. His life changes when he is invited to enroll at Hogwarts School of Witchcraft and Wizardry. The invitations are burned by the Dursleys, and they go to great lengths to stop him going to a place that will teach him magic, until he is rescued by a hairy giant named Reubus Hagrid (Robbie Coltrane).When introduced into the magical world with Hagrid, Harry learns that he is famous. His parents were killed by an evil wizard named Lord Voldemort (generally referred to as You-Know-Who), but Harry survived the attack, seemingly killing Voldemort and inflicting Harry with a lightning bolt scar on his forehead. When he gets to Hogwarts, he is befriended by the bumbling Ron Weasley (Rupert Grint) and the precocious Hermione Granger (Emma Watson), and the three are quickly embroiled in a plot involving murdered unicorns, a mysterious artefact known as the philosopher's stone, and a giant three-headed dog.Philosopher's Stone is almost defiantly faithful to the books. Sure, lines are altered here, and minor characters are snipped out there, but this is as close as literally 'bringing a book to life' gets. Yet while this works in it's favour in terms of visualising Rowling's creations, it doesn't even try to develop any ideas of it's own that would have only worked in a visual medium. Much of Rowling's silly and charming sense of humour is lost in simply filming whatever happens on the pages. One of the main criticism's I have for the books is that a lot of the major characters are little more than archetypes, so a lot rested on the three young leads' shoulders in making us interested enough to stick with them.Sadly, two of the three fall rather flat, with only the gurning and hang-dog Rupert Grint showing a natural gift for appearing on the big screen. Potter is a simple enough character anyway, at least he is at this point of the story, shy, naive but brave, but Radcliffe gives an incredibly one-note performance, encapsulated in the scene in which he discovers he can perform magic. \"I'm a... wizard?\" he says, lacking anything resembling a facial expression. Watson also struggles to bring much likability to her self-satisfied bookworm, her eyebrows constantly rising and falling as she struggles to perform her lines with any conviction.For the rest of the cast, director Chris Columbus has rounded up a smorgasbord of British and Irish talent, a collection of well-trained thespians who steal the entire film from it's leads. Richard Harris plays Professor Dumbledore, Hogwarts' headmaster, Maggie Smith is Professor McGonagall, head of Gryffindor, the house Harry is chosen for, Alan Rickman is Professor Snape, Harry's greasy-haired Potions teacher, and John Hurt makes a small appearance as a wand-maker. Coltrane probably steals the film as the beast-loving grounds-keeper Hagrid. It's an amazing line-up that would consistently grow both in talent and in numbers as the films progressed.Ultimately, Harry Potter and the Philosopher's Stone is a success, weaving an interesting enough story about the possible return of the dark lord Voldemort, with Harry's wide-eyed introduction to the world of hocus pocus. John Williams' Oscar-nominated and now widely recognisable score captures some of the giddy movie magic of early Spielberg, and the attention to detail is often remarkable. But like the book, it ultimately suffers from being too kid-friendly, spoon-feeding lessons in morality without giving much for adults to chew on. It's little more than a well-told children's story, something that would change as the novels became darker and more complex, but at this point, it's a gentle introduction to a captivating world.",
    "148": "In the first outing for Harry Potter, he learns of his descent from a magical background and enrols at the school of witchcraft and wizardry 'Hogwarts'Largely character building this magical adventure takes Harry and his new friends, Hermione (a very talented young Witch) and Ron (Harry's best friend) on a quest for the Philosopher's stone, a powerful stone wanted by the murderer of Harry's parents (Voldomort)Not having read the books, i can't make any comparisons, but even as a stand alone movie, this makes a fine fantasy adventure, fun for all ages. The characters are great, the scenery is wonderful and there is enough magical enchantment to charm and entertain all of us.8/10",
    "149": "Harry Potter and the Sorcerer's Stone is not a perfect film, but it is a magical film. The franchise has been a large part of my life for most of my life. With the first book coming out when I was three years old and the first movie when I was seven, there is a special place in my heart for the Wizarding World of Harry Potter.I know that it is not the most remarkable piece of art when looking at it from a filmmaking perspective. However, let us remember that this movie was made for children. When it comes to world-building and enveloping the audience, I would argue that this movie goes toe to toe with Lord of the Rings and some of the other greats.What Chris Columbus and company did is nothing short of game-changing. They took excellent source material, stayed true to the book and built upon it. The visuals, specifically involving Hogwarts, are gorgeous. The score by John Williams is one of the most recognizable of all time. The characters are instantly likeable (or despicable). There is honestly so much to praise and love about this movie.While not every scene is necessary to the plot, those \"pointless\" scenes further add to the feeling of magic. From sitting in Flitwick's classroom to ruminating on a windowsill with an owl, I could watch footage of Hogwarts on repeat. This is a movie that I could turn on at any time and jump right into the story. Simply put, I instantly have a warm feeling which stays with me the whole way through.While the acting and dialogue have some rough moments, particularly with the younger actors, the casting is excellent. From Alan Rickman and Robbie Coltrane to Richard Harris and Maggie Smith, there is not a single dud when it comes to the adult cast. The students are also perfectly cast, with the main trio's chemistry on full display.At the end of the day I'll say it again, I know that this is not a perfect film, but it is a magical film. The movie is highly rewatchable, endlessly quotable and enchantingly enjoyable. When defining \"comfort film\", this movie is at the top of the list. Simply put, Harry Potter and the Sorcerer's Stone set the stage for one of the most popular movie franchises of all time and one of the most impactful parts of my childhood.Best Character: Rubeus HagridBest Moment: Arriving to Hogwarts on the boats.Best Quote: \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.\" - Albus DumbledoreAdditional Note: Having the house cup ripped from Slytherin is why I have issues with premature celebration. That being said, the whole sequence is still chill-inducing."
}