{
    "0": "'' May December '' is a drama about an actress who is about to portray the story of a sex offender, and so she starts spending time with her in order to prepare for her movie.The movie has an intriguing story, and you get the feeling right from the start that there is something even more sinister about those characters that is about to rear its ugly head at any moment. However, that never happens. In fact, in the end, nothing happens. Things remain where they are, and the audiance, who knows that no one is who they appear to be, is left perplexed.However, the performances were strong from the two leads, Portman and Moore. But, other than that, the movie is a let down.",
    "1": "Maybe I had too many high expectations for this film. But the script is all over the place and many of its plot points raised more questions than answers.First of all, why would it only be the lead actress Elizabeth (Natalie Portman) who is spending time with the family her film is focused on? Surely that's for the director and the screenwriter to unpack? I understand she wanted to get into her character and meet the woman she would be playing. But then she does something completely innappropriate, and there are no consequences for it.With Gracie, in the end, there really isn't much more to unpack than what we already know from the beginning. She is a sexual predator and a child rapist who ended up marrying her victim and had kids with him. That's it.Joe, on the other hand, is probably the most interesting part of the film. His character goes through a lot and is the most conflicted out of all of them. He slowly realises that the decision to stay with his abuser and raise a family was done out of naivety, youth and possibly grooming. Now that he, as well as all of his children, have grown up, he starts to mature and question his life.So perhaps the film should have been only from his point of view and not Elizabeth's, as she was very undeveloped and vapid.In the end, not that all impressed.",
    "2": "In peculiar character drama \"May December\" married couple Julianne Moore & Charles Melton are notorious in their Georgia hometown, as 23 yrs earlier she (at 36) first seduced him (at 13) - subsequently having their first child behind bars. 23yrs on, with two more kids (twins) about to graduate, actress Natalie Portman comes to stay with them as she prepares to play Moore in a movie - which stirs emotions, heightens traits, and draws memories / accusations. The experienced Todd Haynes directs Samy Burch's debut screenplay with an odd, slightly stylized tone (including with the bizarre score) before ending on ambiguity (sigh). Yes, it's a strange one.",
    "3": "On this website, the film \"May December\" is listed as a comedy-drama. If there is a comic element to the film, it has to be of the darkest nature imaginable. To put it another way: This tawdry film is not like the Neil Simon comedy \"The Odd Couple\"!!!It is graduation day for the family of the Atherton-Yoos, as two of the children are preparing for commencement and heading off to college! But this is not your regular nuclear family ... not by a long shot!The conceit of the film is that Miss Elizabeth Berry is an actress who will be playing the role of Gracie Atherton-Yoo in an upcoming made-for-television movie. The audience follows along with Elizabeth in getting to know the Atherton-Yoos! But in one of the most bizarre scenes in the film, Elizabeth seduces Joe, the husband of Gracie. When the poor schlub says that he feels they have a \"connection,\" Elizabeth brushes him off with the remark that this is what grown-ups do!In another outrageous moment, Gracie refuses to have a \"serious\" conversation with her husband about their \"relationship.\" Again, Joe gets the brush off when he is told at age 13, HE had seduced the much older adult Gracie, and HE was \"the boss.\" It is no wonder that after smoking a joint with his son, Joe begins blubbering like a baby and is comforted by the high school graduate!It is difficult to conceive what the filmmakers were thinking in adapting to the screen the true story of Mary Kay Letourneau. The actress Elizabeth Berry was ostensibly aiming for an accurate characterization of the real Gracie Atherton-Yoo. And yet the filmmakers completely missied the mark on the true story of Letourneau, who seduced her seventh-grade student, as opposed to hooking up in a pet store. And their coupling occurred in a car, not in a storage room. The offspring were born in prison, and the family did not live in luxury home in Savannah!The film merits 3 stars only for the fine performances of Natalie Portman as Elizabeth and Julianne Moore as Gracie in a film that is utterly depressing and unpleasant.",
    "4": "If there ever was an award for the most overrated film, this movie would win for sure. All the hype and praise for this film has gone way over my head; I just don't see what others have seen in it. It had absolutely no point, it's disjointed with no direction and a score that absolutely did my head in. All that music was completely unnecessary. I'm sure it will be oscar nominated, but for what, I just don't know. It didn't feel like the film was finished and there was so much more story that just wasn't told, even though the the film was near 2hrs. Apart from some good acting from Charles Melton, this was a complete waste of my time.",
    "5": "With two power houses like Julianne Moore (Still Alice) and Natalie Portman (Black Swan) I expected good things from May December. Instead it was boring and tedious. I only kept watching because I expected it to get better. Nope, it never did. I am not even sure what the story was trying to say. I just found it to be a waste of time. I know the review needs to be a certain number of characters, but I am not sure what else I can say. Who to blame for this lackluster creation? I guess you can start with the writers, the director, the producer, and maybe even the actors for taking the part after reading the script and seeing it goes nowhere.",
    "6": "Do not and I mean do not listen to the obviously delusional praisers of this movie. If you want to see three people ( really two ) talk about inane, stultifying dull jibber jabber; then this is the ideal movie for you. If this played in a theatre it'd be mostly empty by the halfway point. My wife begged me to turn it off after 30 minutes. After another torturous 10 I mercifully acquiesced knowing that this absolute zero, celluloid abomination was not going to improve and in fact every proceeding minute was worse than the one preceding it. Avoid like the bubonic plague and every other disease imaginable.",
    "7": "Even after all this time the story is still fascinating. And with Macron's situation so similar it feels like we are constantly reminded of such relationships. So that will keep viewers watching this movie. This movie is more about their later years after the scandal broke when they were married and their kids were older. Seeing the effects on the kids is moderately diverting. But the TV movie with Penelope Ann Miller was actually better and more involving. It dealt with the scandal at the time and not the later life. And Penelope had that slightly over bright perky look that the real Mary Kay had. The essence of her was captured by Penelope in a way Julianne doesn't.Several jarring things about this movie. The Korean element seems like the makers of this movie are trying to latch on to the current Korean wave by jumping onto the bandwagon. It's like if it has something Korean it must have artistic merit. Also the sex between Natalie and Charles was so out of place and unnecessary. It makes them seem disloyal and amoral. The story is bizarre enough as it is they didn't need to make it weirder.The directing is strange. Why do they talk so unnaturally and intimately. Like they are whispering secrets to each other. Also so much of the movie is in the dark lightning wise. The sudden loud music was wrong too.The casting is hit and miss. Julianne Moore looks great for her age but she looks too put together and unlikely to have been a person who could have done all that. Natalie looks too old to play a 36 year old. She is in her forties. Charles Melton gained weight to be almost unrecognizable. Didn't really have to. Villi isn't that fat.In the end a Lifetime style accurate fact based movie about the scandal would have been better than this weird treatment.",
    "8": "Allow me to say this, if you know anything about the Mary Kay Letourneau case where she groomed, seduced, and had sex with an underage boy by the name of Vili Fualaau (he was 12), then you'll understand the storyline in \"May December.\" Only the names and locations have been changed. The screenwriter Samy Burch said at a New York Film Festival screening that she drew inspiration for the film from seeing the connection between the media climate during Letourneau's case and the current true-crime boom.My primary question is: why choose to base a film on the actions of Mary Kay Letourneau, a notorious sexual predator? Given the numerous documentaries and films already exploring this disturbing story, it raises concerns about the decision to create yet another work with similar subject matter.Despite very good performances by Moore and Portman, the film suffered from a slow and unnecessarily lengthy runtime of 113 minutes, which could have been condensed to 90 minutes. Certain scenes seemed mundane and failed to contribute meaningfully to the story and as they say...should have been left on the cutting room floor.Charles Melton, portraying the pivotal role of the young man who becomes the adult husband of Moore's character, fell short in delivering a convincing performance. His portrayal lacked depth and failed to capture the nuanced emotions of a person grappling with suppressed trauma from a childhood incident of sexual abuse by his older, manipulative wife. The character's complexity demanded a more adept actor, and Melton's portrayal ultimately felt inadequate.Additionally, a subplot involving Portman's character seducing Melton's character for information felt unnecessary and problematic. It added another layer of exploitation, with a more experienced woman taking advantage of the vulnerable young man. This further detracted from the film's credibility and overall impact.Overall, \"May December\" is 4 star for me only because of Moore and Portman.",
    "9": "I didn't know anything about the movie, as soon as I started paying attention, it came to mind the infamous case, that, since it happened it became so well known that we saw everything on the news, or in subsequent documentaries.But since I like Natalie Portman and Julianne Moore, I kept on watching.I was surprised but the male protagonist and his huge talent, I mean it's so big that it's worth a second view. Just to make sure that it's real talent and not some fake or CGI. Congratulations Mr. Melton, i'm guessing it's real, and good luck at the Oscars.For the rest of the movie, yeah, it was boring... sorry.",
    "10": "They show a guys erect Johnson full on in this movie, like you see everything.... That was the most shocking part of this movie. Everything else was so meandering and pointless.They didn't focus on the crime enough, it seemed like a real whatever type of attitude from most people in this movie, the actress could have uncovered some stuff about how everything went down but it's basically just 2 hours of folks stumbling through awkward conversation then Julianne Moore decides her character has a lisp in the last half of the movie for no reason... This movie does not deserve its rating.Its score would have to believe you're watching a thriller but it just swirled the drain until it mercifully ended.Do yourself a favour and dump a can of tuna down the alleyway next to your apartment, watching stray cats gather to eat discarded food would be more interesting than this film.",
    "11": "With talent like Julianne Moore and Natalie Portman I had higher hopes for this film, but these weren't their strongest performances. That said, acting is not the reason this movie failed to hit the mark. The screenplay was not great from the start and the directing felt inexperienced. However the biggest issue I had was one I rarely pay attention to - the score. Music should elevate moments in a movie. This score was often loud and so out of sync with the story it made some scenes distressing to watch. I also don't understand why they created this fictional story that is so obviously based on Mary Kay Latourneau's life. Legal reason of some sort - who knows?",
    "12": "The movie was not what I expected. The aesthethics and the setting were beautiful and all the lead roles did a good job acting their parts HOWEVER everything else was, to put it mildly, underwhelming. The plotline was flat and didn't offer many surprises. Dramatic music and scenes building up the excitement made me long for some sort of a climax, and it just never came. It was basicly 2 hours of waiting, like smelling delicious food but never getting to taste it. The themes were interesting and important and offered a lot of potential for a great movie. The movie was just simply missing the turning point! All in all, I would not see this movie again.",
    "13": "I was confused because an ex-felon had been in prison coming out living in a big fancy nice house without a job. Where did she get the money to afford such a house. Her husband that she seduced at 13 years old getting pregnant by didn't have a high paying job. He worked at a hospital as a X-Ray tech. And let's talk about the brief full frontal nude scene Charles Melton did in this movie. He was wearing a prosthetic penis because it was huge as he got up off the woman after sex. I personally found the characters to be disgusting and I don't know why Netflix would make such a movie. Finally, when the actress had sex with the man that was seduced at 13 was immoral and disgusted for me. I found this movie to be boring and disgusting.",
    "14": "This movie is bad with a capital B. I'm really not sure how they got to A listers like Natalie Portman and Julianne Moore to act in this.First off, it feels and is shot like an ABC after-school special. For some reason there are random single shots that have nothing to do with the story.There is very little obvious conflict until the end and it's pretty predictable. The movie never get to tell the story it's trying to tell. The plot meanders and there's very little that contributes to the single plot point near the end.Highly forgettable and not with your time even if you are a fan of these too fine actress es.",
    "15": "I don't understand all the vitriol and hate, this movie is a study in character building and imagery. Have people become so jaded by cartoonish-superhero effects that they need over-the-top action to think a movie is good. The dumbing-down of America has broke my heart. This is a wonderful movie, with a simple story of an already shocking event that we all know, this is the aftermath. Natalie Portman is a genius, let's all agree on this, she slowly morphs into the Moore character bit-by-bit, by dressing like her and finally speaking like her, she nailed her down. I also loved the animal references, from the cocoons and butterflies to the hunting fox scenes with both characters, that was a beautiful touch. This is a real movie with real faces, real places, and deep emotions.",
    "16": "May December is a very good film. At the core of this movie is a brilliant character study of a woman who tries to understand people's awful actions even when there is no solid reasoning. Natalie Portman is absolutely phenomenal in this movie and gives one of her best performances in her entire career. She will definitely be a front runner at the Oscars this year. The script here by Samy Burch is great and the director Todd Haynes does a great job brining it to the screen. Julianne Moore and Charles Melton also give stellar supporting performances. I loved the ending of this movie and just like Natalie Portman's character it makes you reevaluate the entire story. The movie is powerful, makes you think, and I had a really good time with it. 8/10.",
    "17": "Had I not read any of the buzz, I would have never watched this movie and if I had watched it, I would have given up on it more or less after the first 20 minutes. I kept watching, thinking all the buzz meant something, but it did not. This was a bad Lifetime movie and that's being generous. Hackneyed with sledgehammer metaphors and symbolism, especially as the end nears (freeing the butterfly, Gracie and the fox, puhlease). Ugh. And the gratuitous penis shot with the ridiculous prosthetic. Talk about the symbolism for the whole sophomoric movie! I can't believe anyone likes this. The critics have lost their minds.",
    "18": "A film that recalls the commitment of an actress groomed in 'method' to understand the character she is playing by interacting with the real living 'evil' subject just as in the 1978 Jules Dassin masterpiece \"A Dream of Passion,\" with Melina Mercouri and Ellen Busrtyn. Though similar in the departments of screenplay, direction and acting, the film is indeed as good as the Dassin product. Another superb performance from Julianne Moore. I hope Ms Moore gets nominated to the Oscars for it. This is Todd Hayne's fourth film to get nominated for the Golden Palm unsuccessfully. Evidently Haynes loves to explore the human psyche in depth (\"May December,\" \"Carol.\" \"I'm Not There\"). Mr Haynes will surely win at Cannes eventually.",
    "19": "What is with the random dramatic music like an early 50s film noir? It's ridiculous. Completely wasted talent of Julianne Moore. I'm 40 mins in and nothing is happening. Unbelievable. Portman is overrated so I can't tell if she's just bad in this or not. I know Moore is working on some other projects which I hope are better than this. No I haven't finished the movie yet but a waste of 40 mins so far. I should make a movie with my 2 black kitties. Might be more dramatic and better than this dumbass movie Have u guys seen AT CLOSE RANGE? That was an excellent movie. I'm writing this to reach the minimum amount of characters.",
    "20": "Todd Haynes really knows how to blur the lines between real and artificial, and that liminal space in between almost always yields something. Sometimes it is something insightful or something uncomfortable, but it is almost always something unique (and true). Moore and Portman are absolutely entrancing here. They both alternate between endlessly confident and totally terrified, but the end result is a story that has lots to say about how we perform for ourselves and others. I'm not totally sure I understood all the layers here, honestly, but I'm not totally sure they did either. One thing is for certain: you won't see anything else quite like this film this year.",
    "21": "\"May December\" isn't your run-of-the-mill movie; it's a deep dive into characters and subtext, not everyone's cup of tea. Crafted like art, it leans more toward those who enjoy unraveling stories rather than clear-cut narratives. The acting is a highlight, with Natalie Portman and Julianne Moore delivering standout performances that elevate the film.Be warned, though; watching \"May December\" is no easy ride. It's a bit sickening as it peels back layers, leaving you with a disturbing aftertaste. The impact sticks with you; there's a thin line between observing a real-life monster and teetering on the edge of becoming one. This movie isn't for casual viewing-it's a thought-provoking experience that lingers, whether you like it or not.",
    "22": "Gracie Atherton (Julianne Moore) writes a script telling her side of a scandal in which she was involved 24 years before: when, as an adult woman, she gave birth to the child of Joe, a seventh-grader (thirteen year-old, for non-US viewers). The couple's relationshiop survived both the national scandal and Gracie's time in prison: they stayed together, had more children, and now live in a gorgeous riverside house. How will the arrival of actress Elizabeth (Natalie Portman), to whom Gracie sent the script, affect things? Bearing in mind the first thing she does is discover a box of excrement that has been left on the couple's porch, the omens do not look good...Moore, predictably, is very good in the role of the complex Gracie, a woman for whom the film at first seeks to evoke sympathy before gradually revealing that she is actually rather controlling. Portman's role as the actress who will play Gracie in the film-within-a-film I found rather one-dimensional; it certainly does not allow her to display her acting chops, which is odd as Portman is a co-producer. The other main player is Charles Melton, as the now-adult Joe. His acting never really rises above that of a typical soap opera, although the viewer should give him the benefit of the doubt because Joe is written as a sort of immature man-child - possibly as a result of Gracie's controlling nature.This is an enjoyable, watchable film, admittedly with some predictable plot developments but also with lots of ambiguity which will keep the viewer thinking. And the soundtrack is pleasingly ominous too. Seen at the 2023 London Film Festival.",
    "23": "The plot of this movie touches on the awkward and cringeworthy themes, based on true events and real people but taking creative license to the absurd level. Julianne Moore has mastered the art of portraying fragile, confused women, and here she gives us more of the good stuff. Opposite her is Natalie Portman who is always a reliable, capable actress, so going in, I am excited that I am in for a treat. However the flow leaves a lot to be desired, as it does move very slowly without much satisfying progress. It weaves in and out without any punch. Therefore the artistic cinematography becomes superficial and the efforts of the actors seem wasted. I do keep giving it a chance to redeem itself, however when the movie ends, I am left with disbelief that it concludes this way.",
    "24": "I just got out of a screening at the New Zealand film festival and wow what an experience. Julianne Moore plays Gracie who is married to Joe she has been with him since he was 12. Their relationship became a scandal and she went to jail. More than twenty years later Elizabeth played by Natalie Portman is an actress who comes to stay to study Gracie for a movie. This film has a lot of campy humour and darkness below the surface. It has some great acting from the two leads. There are a few scenes that remind you of Bergman's Persona. When Gracie and Elizabeth are looking at each other in the mirror. Joe is having empty nest syndrome that his kids are growing up and going to college. Gracie is a naive woman who tells Elizabeth in a scene she always has been and she likes it that way. Haynes explores themes of child molestation, tabloid hysteria and how actreess's like Elizabeth become consumed with a role. I loved every minute of this film. I think Haynes is at the top of his game and so was Portman and Moore. One of the best films of 2023.",
    "25": "This movie feels like so much wasted potential. The concept and story seems interesting and there's a lot of opportunity to explore the motivations of the different characters, but it seems like they barely scratch the surface with any of that. The movie was very slow, and the music was so distracting, anytime anything interesting happened it was punctuated by this very corny, made for TV style music, which totally took me out of the story and made the whole thing feel very hokey. Julianne Moore was excellent and I think did the best she could with the character and story but overall I was very very bored.",
    "26": "May-December, starring Natalie Portman and Julian Moore, was one of the movies I saw recently, and I think it's worth seeing, for the well-detailed script and the acting of the two leading ladies.The film is based on a true story in the nineties, in which the relationship between a thirty-six-year-old female teacher and her 13-year-old teacher, a relationship that leads to the imprisonment of this female teacher, and in prison she declares that she is pregnant. Gets released from prison and marries his scientist. Of course, this marriage does not last long and leads to divorce and separation.The title of May-December's sarcastic title refers to this relationship because the two months of birth, with the time difference, tell the age difference.May-December is about a starring Natalie Portman who comes to the two's house for an acting investigation, she is set to star in a performance film about the incident mentioned.The music of the movie is one of the strange points of the movie, the strange music of the movie suits more crime and mystery movies, and you may seem a little unsuitable for the movie at first, but as the story progresses and the young actor tries to achieve the role of the music, it gradually becomes its place. Opens in the mind of the audience, as if he is solving an old mystery.The film is full of visual cues, sarcasm, and symbols that gradually find meaning in the subject matter, without having an additional role in the film's story.Produced by Netflix, the May-December movie was nominated for best film by the Golden Club and New York Critics Association.I want to compare May-September with Ingmar Bergman Movies.",
    "27": "Undone by its heavy handed metaphors. Butterfly emerging from its chrysalis? Upside down cake (of a life) he has to choke down for her to prove he doesn't believe it's garbage? Plus the ridiculous use of suspenseful music where no suspense is warranted almost sink this movie, but the writing and acting save it every time.We get it. We're all just kids trying our best to muddle our way through adulthood/ parenthood, and while some of us believe we have enough of it figured out to impose our will on others, most of us are still muddled. Which is why the ending rings so true: just when you think you have it all figured out, you find out there's always more questions than answers to a life.A for effort. And it doesn't hurt that both Moore and Portman are excellent at their craft here. Top notch performances that will cancel each other out come Oscar time.",
    "28": "Director Todd Haynes has a preternatural gift of turning tawdry dishiness into something close to high art. Veering dexterously between social drama and black comedy, the 2023 film felt almost like Ingmar Bergman's \"Persona\" in presenting Elizabeth Berry, a successful actress who spends time with a deceptively sunny woman named Gracie who notoriously seduced Joe, a 13-year-old boy 23 years before. Joe and Gracie have been married all these years and are now preparing for their twins' high school graduation. Portraying Gracie in an upcoming indie film, Elizabeth insinuates herself into their lives and you can figure out the rest from the awkward situations and conversations that ensue. Both leads deliver the goods with emotional precision. Julianne Moore, Haynes' muse, plays Gracie with unsettling calm, and Natalie Portman nicely captures Elizabeth's cynical ambition and veiled sincerity. However, Charles Melton turns out to be the film's standout accurately conveying the tentative man-child that defines the perpetually uncertain Joe. Eminently watchable.",
    "29": "I am begging for someone to explain the ending. Why would Elizabeth shudder quite obviously along with a score fitting the end of The Sixth Sense, as if we just found out a stunning plot twist? Why is it so shocking that Georgie, whose nuts, would tell his mother, also nuts, what he told the dumb and equally nuts, actress? This movie was slow, boring, the sex was thrown in to stun. What the heck was Elizabeth doing in the stockroom? Joe and Gracie are without a doubt, Mary Kay and her 13-year-old, Vili. They re-shot all the magazine and tabloid photos that we saw at the time, with these actors, so the writer saying they only borrowed from that scandal a bit is a little ridiculous. It's boring and so dark. Would've made a lousy TV movie. Oh wait, I guess that's what it is.",
    "30": "A most shallow and predictable movie. Don't be fooled. It's really that bad. The psychology in this movie is so unsophisticated. But a drama it sure is. I could have clipped my toenails for two hours, would be a better way to spend my evening. The acting isn't bad, except for the husband who, I get it, has to seem young. But young doesn't mean unsophisticated. I watched this movie with my wife and daughter, we all felt the same way. It has the psychological depth of the average Marvel movie. So there you have it. Run while you still can. Moral of the story is: if you ever have a relation with a 12 year old, please don't turn it into a movie.",
    "31": "Really boring, dull movie that went nowhere. I've seen movies rated way lower that are far better to watch. It's badly written, really hard to follow and down right strange and creepy. It follows a woman played by Julianne Moore who raped a 13 year old and manipulated him to stay and raise a family. While Natalie Portman plays an actress collecting information before they shoot a tv film on the whole situation where she plays the predatory woman. It's about 2 hours of awkward conversation and piss poor dialogue which is a shame for actors of their calibre. The actress (Natalie Portman) sleeps with this man who is like a 13 year old boy trapped in a 36 year olds body. Similar to Nina in Black Swan except awfully done. There was even a part in the movie where Natalie's character is looking at the prospects for the role of the 13 year old boy and she says \"The kids are cute, but not sexy enough. You've seen him, I mean he's got like this quiet confidence...even as a kid I'm sure.\" What...? Wtf does that mean. Made my skin crawl. Avoid this movie, it's garbage I'd honestly rather watch a dog piss up a wall.",
    "32": "The concept behind this movie is interesting. In the form of an actress aiming to portray the wife that actually married a twelve year old when she was 30, the opportunity is opened for a probe into exactly what happened and why. Instead of using this device to actually penetrate reality, the actress instead spends her time talking to everyone she meets about absolutely nothing more than idle conversation. Then she decides to become a participant instead of an observer and derails any attempt at depth. The whole thing is basically a rehash of the superficial combined with an extraneous side issue. It's all too bad. A great idea, but no follow through, no insights, and a diversion into how a busy body intruder doesn't accomplish anything.",
    "33": "I love the way the film is framed, as an outsider, a flawed person entering this toxic family looking for the truth. Melton really nailed the portrayal of someone stuck in life, unable to process the trauma he lived through. The only adult in his life he could turn to as an adolescent, young adult was his groomer, a delusional woman who projected ridiculous, unbelievable things onto a child and took no responsibility for entrapping him.The scene when Elizabeth/Joe briefly hookup just displays the ludicrous nature of an adult claiming they were overpowered by the seduction/prowess of a 13 virgin boy or girl. No, you weren't!",
    "34": "The film \"May December\" presents itself as a challenging and, unfortunately, frustrating experience for the viewer. The screenplay falls short from the early minutes, with a narrative that seems to lack consistency and engagement.The difficulty in understanding the dialogues due to Spanish subtitles adds a level of discomfort to the experience, making some scenes even more obscure. This is particularly relevant in a film with pivotal moments left in doubt, such as the conversation between Gracie and Joe Yoo at 1:03:15, where the intensity of the scene is notably delivered by Julianne Moore.Moore's remarkable performance, in contrast with Charles Melton's unsatisfactory portrayal of Joe Yoo, negatively impacts the overall quality of the production. The plot appears to unfold into a series of disjointed and, in some cases, unnecessary events, like the forest scene at 1:43:32, where Gracie, armed, confronts a fox, leaving the viewer puzzled about its necessity and importance.Tense moments, such as the conversation in the room between Joe and Gracie at 1:32:10, promise emotional complexity, but the difficulty in fully grasping the context limits the appreciation of these crucial scenes.The final scene, set in a studio as Elizabeth records the film about Gracie, concludes with a disappointing outcome. This narrative choice may leave viewers dissatisfied, especially when compared to the initial promise of the film.Amidst these challenges, the exceptional performances of Natalie Portman and Julianne Moore stand out as undeniable positive aspects. Both actresses deliver magnificent interpretations, providing a more palatable experience despite the film's shortcomings.In summary, \"May December\" is a film that has garnered both positive and negative reviews, where the stellar performances of the leading ladies contrast with a problematic screenplay and questionable directorial choices. The confusion in understanding certain scenes, a personal issue of mine as I am not proficient in English and couldn't comprehend all the Spanish subtitles, coupled with a disappointing conclusion, left me disheartened with this Todd Haynes drama.",
    "35": "I have very mixed feelings on this movie. Firstly off there were some absolutely great things about it. The camerawork and cinematography as whole were beautiful. The movie itself felt very unsettling which I believe can be largely attributed to its phenomenal soundtrack. Also Natalie Portman is brilliant and easily the best actress in the film.On the downside however, I felt the film was a bit messy. I was waiting and waiting and waiting for something to happen but nothing really did. I felt the movie itself didn't know which way it wanted to go for much of the movie but even at that it was really predictable, that's not to say the movie wasn't really original though. Still a worthwhile watch. 7.7/10.",
    "36": "Another self-aggrandising piece from hollywood. Tmz worthy material made to look like a shakespearian tragedy when the actual message should be \"that's life I guess\" since there is little to be talked about.The main actresses do their best to give their roles a heaviness, some solemnity but it falls flat when confronted with the reality of the script and premise. It is a Hollywood cheat scandal drama personified in a movie. Old famous celebrities choosing their pick from the young flock and enjoying their rich lifestyle. Only this time the old celebrity seems to have some conscientious. Doubt. Well what a twist. That did not need 2 hours. Curb your own narcissism and keep us sober audience alone with your self absorption please. Thank you.",
    "37": "POSITIVES:1) The acting here is all phenomenal, especially Natalie Portman who I think is my new favourite for the Best Actress Oscar this year, replacing Lily Gladstone. A career best performance for both her and Julianne Moore in my opinion\n2) The film is masterfully directed. There are so many long unbroken takes coupled with deliciously awkward scenes that leave you almost begging for a cut because the awkwardness of what you're watching is so excruciating. Sounds like a backhanded compliment but I mean that in a good way\n3) The score was superb and really adds to the tension that was present throughout the filmNEGATIVES:1) Outside of our two leads the characters are all quite forgettable, to the point that I frequently got confused about who was who and what relation everybody was to each other\n2) As much as I enjoyed the film while I was watching it, I did come out of it wondering what the real point of it was? None of the characters are really in a different place by the end than they were at the start, there's no real climax to speak of, and the film just kinda ends unceremoniously.",
    "38": "This film.... I wasn't sure if I was going to watch it given the subject matter but I'm so glad I did. The whole film exudes unease and discomfort.From the first introduction to the characters the audience can sense the quiet desparation of the Atherton-Yoos to convince us that not only is there life quaint and good but also so normal. I loved the way every conversation Natalie Portman's character has with friends and extended family leaves you with the idea that they are all trying to convince themselves this is normal and fine. Everyone is avoiding the elephant in the room.The slow breakdown of the facade and the obvious tensions between children and mother \"May December\" does an incredible job of showing rather than telling how each character perceives their own reality.I'm not sure why so many feel like nothing happened or that the end was unsatisfactory; I feel that the film said everything it intended to. It leaves you with the knowledge that there is no way to justify the relationship and with the discomfort of seeing an entire community allow Gracie to get away with her actions with few consequences.I'm certain several people will be winning awards for this film.",
    "39": "A wife and a mother of four approaching the age of 60 doesn't seem able to accept the reality of her past. Her husband and father of three of those same four at the age of 36 is coming to terms with a major life change. An actress, also 36, has come to visit this family for the purpose of learning more to prepare for an upcoming film in which she will portray the wife. The reason for the upcoming film is due to the 23 year old sordid tabloid headline making story of how this wife and husband met and fell in love when she was 36 and he was 13, when she was also his school teacher, his supervisor in a part time job, pregnant with his child and ended up imprisoned. When released from prison they were married. These three come together at the time the couple's youngest children, twins, are about to graduate high school and move from their beautiful, idyllic homelife for college leaving their parents empty-nesters for the first time. The wife seems a control freak who becomes frazzled when there is disorder. The husband is a sweet man-child who adores his children and nature. The actress seems kind and well-meaning, but isn't really. This is a very subtle, nearly hypnotic film for much of the time that suffers a bit due to an ending that offers no clear resolve leaving us to question what comes next, though the continuing marriage without children to care for and tend to seems ready to fall apart as he is finally coming to terms with things as they really were 23 years earlier, prompted by this new rehash, and she seems to be unable to see things as they are/were or through his lens putting it on him. That is my assumption on the end results in which other factors may or may not be involved. The three actors playing these parts, Julianne Moore, Natalie Portman and Charles Melton, are all excellent. Portman is particularly effective, I'm not sure I've ever appreciated her more, in an odd and curious role. The cinematography annoyed me slightly, but the music, somehow familiar, was very effective. A thought provoking film that really requires more than one viewing.",
    "40": "This movie had no depth whatsoever. We get no real glimpses into the motivations or back stories of the characters. It's hard to really care about any of them and it feels gross watching a somewhat sympathetic look at a woman who has assaulted and manipulated someone since they were in 7th grade. Melton's character barely has a voice until the end and even then it feels like a stretch to have gotten to that point. Portman's character essentially exploit Meltons character at the end and it seems to draw parallels with the exploitation Julianne Moore's character Gracie did and continues to do to Joe. The way the relationship was portrayed was icky as well as the overall tone of the movie. The reveal that Gracie's character was abused by her brothers (although even the implication feels so bland and almost painted over by the quickness of the moment) doesn't excuse her behavior. Trauma is valid but not an excuse for people to do horrible things to others, but this plot point is thrown like a stale biscuit to viewers. And then it turns out it wasn't true? Idk did I miss something. This is a pass for me.",
    "41": "I've read through majority of the reviews high and low and completely shocked no one has mentioned the ending! So much to dig deep into, especially the shot of Natalie Portman after Julianne Moore says to her with a straight face, I'm secure...Elizabeth's shoulders go down almost looking valuable and also realizing now..this woman knew what she was doing the whole time. As Natalie Portman killed it once again, I enjoyed watching her as Elizabeth a committed method actor & became Gracie, in so many ways..then I feel at the very end that scene shined a whole knew light which makes you go so much deeper. Very compelling film and impeccable acting from all three!Awards are coming for this one.",
    "42": "Todd Haynes is a great director especially for Tar in the last couple years the similar aspect is both are a bit slow yet very well made, May December is great to be nominated that's for sure! The beginning was strange to jump into a party without introducing anyone that felt like a middle scene except Natalie Portman arriving that part made sense the rest was a weird way to start, I wonder if anyone else was thinking this. The mimicking is fantastic the 2 leads are exceptional worthy of praise regardless of anything it's a great movie. Very smooth, peaceful feel, solid drama, and unique flow I absolutely love Natalie she's amazing in Black Swan, Annihilation, and this May December she is great at her craft.",
    "43": "May December is 2023's Tar, the movie from last year that started out by giving Hollywood legend Cate Blanchett great material to work with but still asked her to do an insane amount of heavy lifting, wherein she churned out career best work with a script that demands you watch much harder than you listen. Only May December has two all time greats of their respective generations churning out career best work that both demand you watch them much harder than you listen to them, as well as a new actor I'd never heard of before now who's asked to center the entire film with the only real human performance, stuck between two infuriatingly self-involved aliens who've buried every last human thing about themselves underneath layers of selfishness and hubris.And what Charles Melton is being asked to do with Joe can't be understated. A man who was never afforded an opportunity to explore himself, discover what he desires, desperately reaching out for connection, but too afraid to act out of his own self-interest because of how utterly dependent everybody in his tiny little bubble are upon him, growing up as an adolescent without a support system of adults he could confide within, as all of the adults in his life always needed him to take care of them. First taking care of his sick sister to compensate for an overworking father, and then becoming the emotional rock for the unstable Gracie (Julianna Moore), a relationship he was groomed into, and then trapped within for the entirety of his youth after they were exploited by tabloids, isolated by infamy. And his performance truly is the one you must watch more than you listen to, as he repeats Gracie's version of their story to whomever asks about it, insisting it's true, they were in love, refusing to confront the fact that he was a child, at least until the very end in which is attempt to confront that fact is shot down immediately by Gracie, who in spite of her volatility, prone to emotional breakdowns after wasting a single cake, or at the sight of not enough hot dogs for her guests, has an uncanny ability to bury and never confront trauma she's experienced or inflicted upon others. And as Elizabeth (Natalie Portman) investigates Gracie's history, you begin to realize how inextricably linked Joe is to her, living in a community that's constantly, distrustfully watching both he and his wife, repeatedly putting in orders for her baking business simply to keep her busy, keeping them involved but at an arm's distance, making it impossible for Joe to explore himself, being stuck in a community that will forever define him by the act he was groomed into as a child.So yes, I agree with the general consensus right now, given the incredible amount of layers Melton is asked to take on, he absolutely deserves that supporting actor Oscar, though even though he's being asked to be the grounded center between two selfish sociopaths who ruthlessly exploit him, that certainly doesn't manage to steal any spotlight away from what Natalie Portman is doing here, an actress playing an actress who goes to the farthest most vile extremes any method actor could go for a trashy exploitative made-for-TV role, as she not only seeks to emulate Gracie's mannerisms and her lispy accent, but she goes digging into all of Gracie's past connections, interviewing her family members as she's an investigative journalist, and even finding excuses to sneak around with her husband Joe just so she can become the \"real\" Gracie, constantly digging for something \"real\" without an ounce of self-awareness, discussing with others Gracie's sociopathy and inability to self-reflect without a hint of irony. And it's not until she lectures a class full of high school drama students that she fully gives the game away, questioning when she's performing intimate scenes whether she's pretending to experience pleasure, or pretending not to, as she revels in imagining herself in Gracie's shoes, revels in fantasizing about seducing a teenager, and revels in seducing that same teenager herself (though at this point he's technically her age even though he's never gotten to grow from beyond where he was as a teenager). And the exploitative cruelty of Elizabeth's involvement with this family that discards any notion that she's striving for anything \"real,\" that she's trying to create a piece of empathetic art, becomes abundantly clear in that sudden joyous outburst after she watches herself in the mirror performing Gracie's letter to Joe. It's a game for her. She can no longer pretend she's not experiencing pleasure from this.And with all this talk from Elizabeth about searching for something \"real\" making her performance \"real,\" it's genuinely difficult to watch Joe in his attempt to actually find a real emotional connection, in the end attempting to confide within the woman who claims to love him the most, only to discover that she is every bit as incapable of processing any real human emotion as Elizabeth, and he'll forever be trapped by the act he was groomed into as a child, unable to connect with anybody, unable to emotionally process any of the trauma that was inflicted upon it, and forced to internalize all of it as he's forever being used by the tabloids, the \"artists,\" his parents, and his wife.",
    "44": "I watched this movie because I love Natalie Portman and Julian Moore, my semester ended on its release date and I loved \"Carol\", directed by same director Todd Haynes. I went in blind and I enjoyed the movie quite a bit. It starts off with a very interesting premise with an actress living with a person who was once at the center of national spotlight because she got into a relationship with a teenager as a married woman. The actress being Natalie Portman and the woman being Julian Moore, we can see the transformation of Elizabeth Berry to Gracie Atherton-Yoo as she spends time around her and the community she lives in. At first, she does seem to be like a Hollywood actor with a touch of elegance. But as time passes, she becomes more and more like her interpretation of Gracie with her being reckless enough to cheat with the young husband, Joe.This movie's charm comes from the fact that it's not quick to jump to conclusions about the moral character of Gracie. It never fully paints Gracie as the \"perpetrator\" and Joe as the \"victim\". It presents evidence on both sides. It helps the audience follow Elizabeth as she tries to uncover the \"truth\" in their situation. However, it does not play like a true crime. At its heart, it is a very \"human and complex story\" as Elizabeth puts it, but the word \"camp\" does describe it best. The perspective it takes on is very interesting and I loved its ending. Despite all the tension and the damage that Elizabeth has caused or exacerbated, the end production is cheap and tacky. That's the irony of this movie. Perhaps it's a criticism on all the Netflix specials that are based on true stories and how much potential damage those might cause in the name of telling the \"true story\".It's hard to describe this movie but it's captivating with wonderful performances by both Portman and Moore. Todd Haynes is becoming one of my favorite directors with both of his films I watched becoming my favorites.",
    "45": "Feels like a prank or something what is this movie. Why does this movie even exist? It's excruciatingly boring and the scenes make no sense. Natalie Portman portrays a really weird and robotic character and you just don't care for any of them. Everyone is kind of pathetic and/or weird. It's obviously based on that case that happened in real life but this is just bizarre. Not sure whether we are supposed to root for who in this movie. The music is also terrible and made the movie feel like a meme. Natalie Portman is super creepy, the whole thing is strange and uncomfortable and I want my time back.",
    "46": "This movie just gets in its own way both of the lead actresses overact and that's a fact and the young man who plays the husband can't act at all he's overacting is just downright pitiful I understand the point of his mopey sad head hanging down stuck in childlike mode supposed to be character but I guess Natalie Portman got him to overplay it and Julianne Moore is that her name her character as she plays it just seems unreal like she can't really make it work not for me and also Natalie Portman her affect gets worse and worse as she supposedly is getting better and better at portraying Julianne Moore's character her diction and enunciation gets more and more stupid, the name or title May December doesn't really make sense anyway even in an artsy fartsy way, to be honest I'm inclined to tell you just skip it once again I watched it for you ha.",
    "47": "I'd waited weeks to watch this film, and boy oh boy I was so disappointed. This film is currently the worst film I've ever seen. I'm so shocked to see people rate this film a 8/10. They have to be bots. The movie literally seems like a bunch of scenes had been removed. I played the film back a couple of time to make sure we didn't miss some of the film. This movie could be classified as a comedy because it is a complete joke. Whoever put up the cash for that movie will get hosed on this deal. This only buzz this movie should get is for how terrible this film is. I've completely disappointed in Netflix for paying for such a terrible film.",
    "48": "In a word, contrived. If you get over the tired cliche of the actress wanting to lose herself in a role you ll still have to swallow how contrived this mess is. I m working on a movie about your grotesque life story can i move in with you for a week or two? Thanks. The predictable seduction scene is ridiculous by any standard. Dang why work so hard and spend all this time making such a tepid movie! The over the top music sounds like something from an SNL parody. Another soon to be forgoten netflix production. They keep piling them on. Todd Haynes has made some fantastic movies. I guess he just got tired.",
    "49": "The late Gene Siskel used to say that the simplest way to decide if a film was worth a damn, was if you thought watching the same cast have dinner together would be a better use of your time. This film absolutely does not pass that test.There's nobody to root for. The two primary characters are a woman who raped a child and the woman who's playing her in a movie. Neither is likable or sympathetic. The young man who had his youth stolen by a predator is the only one who deserves sympathy, but he's got his own problems and isn't really likable either.I don't understand how anyone would think this is a good film. But to each their own.",
    "50": "As a psych major, I really found this movie fascinating. It reveals a part of human weirdness that exists in society. While it causes some people to be disgusted, it intrigues other people to the point of wonder. What's behind a criminal mind? I think people who wonder about that will find this movie very interesting The acting and directing of this film is amazingly good. The ending is unexpected. It's a definite watch for those who like to experience the outer limits of mankind.Julian Moore and Natalie Postman are the right actresses to portray the uncanny characters of this film. It's a movie you must watch with friends who like to have deep discussions on the human condition.",
    "51": "This film is not about the story on the surface. This film is a commentary on film making and the blurred lines and crosses boundaries that so often accompany telling uncomfortable stories.The last line of the film gives this away when she says \"it's starting to feel real.\"When does the line between filmmaking and reality lie? Are we exploiting children by putting them in roles that they are truly too young to be in?Who is the villain in this story? On the surface it would seem to be Julianne Moore's character. But there is a lot more nuance going on here. From this perspective it is a poignant film with important social commentary.The music sucks, though.",
    "52": "The acting is horrific. Terrible. Unbelievable. The dialogue is truly awful. I don't know who wrote it, but I shall research this to make sure I NEVER watch anything else they do. The music/score sounds like it belongs in a cheap horror movie. The music doesn't fit in one single scene and is the same in every scene regardless of what happens in the scene. There is nothing quality or redeeming about this movie. This is honestly one of the worst movies I've ever seen. I hated everyone in this. There was not a single person I connected with or cared about. The story was slow and drug on and on with nothing happening. Awful. Stay away. Anyone that have this above a 1 or 2 is lying.",
    "53": "I don't understand the hype over this film among TY movie reviewers. This movie is basically a boring mockery of the lifetime movie genera based on a tragic true story that continues to harm everyone it has ever touched.Its slow. Its creepy and cringy at times (e.g. Portman's reenactment in the pet shop storage room (vomit) or her manipulation of the Joe character to what end who knows, (double vomit/yuck)). It looks awful--like its a VHS recording or nondigital TV broadcast. The music is atrociously overdramatic. And most importantly, It's just a story that doesn't need to be told and from a perspective that should never be explored.The only redeeming quality of the film is the tenderness with which it treats the Joe characterization. Given this is based on a true story and the individual whose story was used to create this mess deserves all the empathy the film and we viewers can muster.",
    "54": "Walking a thin line between elegant and creepy, Todd Haynes' \"May December\" is a suspenseful psychological maze that leaves you knowing less than you did when you started.Julianne Moore and Natalie Portman star, playing two versions of the same person. She's Gracie Atherton-Yoo, who made tabloid and People Magazine covers years earlier when she seduced a coworker in the pet store where they both had jobs. She was in her mid-30s at the time; her co-worker, Joe Yoo, was 13.She gave birth to their child in jail. After her release she wed the boy, and they're still married with more kids a quarter-century later.Julianne plays the real Gracie. Natalie is TV star Elizabeth Berry, who will be playing Gracie in an upcoming movie. She has come to Gracie's beachfront home in scenic Savannah to research the role.Charles Melton plays hunky husband Joe, who's all grown up now. He's about the same age as Elizabeth, in fact.If this is sounding vaguely familiar in a tawdry tabloid way, it's because it was inspired by the true story of elementary school teacher Mary Kay Letourneau who went to prison in the 1990s for raping a 12-year-old student in her class. She married him on her release.Writers Samy Burch and Alex Mechanik aren't trying to tell her story, but rather to untangle its hairball of intertwined emotions. The relationship between actress and subject is pretty weird to begin with. (I must have missed the part in the script about why Gracie and Joe agreed to the deal in the first place.)\nBut even as Portman and Moore merge visually on-screen, sometimes with only the color of their hair to tell them apart, they're obviously at cross purposes. Gracie is a sly one, or maybe just batshit nuts. Under the guise of artistic process, it's not hard to notice that the TV star is here to steal her soul.Oscar winners Portman and Moore have a field day with the material, playing cat and mouse, continually switching which one is the aggressor. Haynes is a wily observer of their potentially lethal interplay, enhancing the increasingly sensual undercurrents with mirrors and amazing cinematic inflection points.It's all about playing roles ... and playing each other.Husband Joe gets in on the volatile sexual chemistry, too. Seemingly an innocent victim when the relationship began, he now seems to be the prize in the undeclared catfight. Whether he will be collateral damage before it's over is another thread in Haynes' kinky mystery.With notebook always in hand, the actress continues probing. Gracie's ex (Chris Tenzis), the kids they had together, the pet store owner, the lawyer in Gracie's trial - she interviews them all, trying to find the pieces Gracie won't share. The detective work sends her, and the audience, down lots of rabbit holes.Characters imprisoned - metaphorically if not literally - for their sexual inclinations is familiar territory for award-winning director Haynes. In his \"Far From Heaven\" in 2002, Dennis Quaid played a perfect '50s husband hiding his homosexuality from his wife, also played by Julianne Moore. Haynes' award-winning \"Carol\" in 2015 follows a developing relationship between Cate Blanchett and Rooney Mara, set once again against the sternly disapproving social norms of 1950s Manhattan.Haynes also directed Blanchett in \"I'm Not There,\" where she was one of six actors (Christian Bale, Heath Ledger and Richard Gere among them) portraying Bob Dylan. After that, having just two actresses do one character is child's play.As much as Haynes is a deep diver into dangerous unsettling emotional places, he is also an impeccable visual artist paying homage to cinematic glories of bygone eras. He's fond of saturated colors and lush orchestrations.Interspersing closeups of cocoons evolving into butterflies - one of the script's sub-themes - with gorgeous Savannah landscapes and interiors, \"May December\" is as gorgeous as its stars to just gaze at.Netflix, which premieres the film Friday, is billing \"May December\" as a comedy drama. That may be for Golden Globe consideration, which has separate categories for each.But finding the humor is a bit of a stretch. Whatever laughter it generates is the nervous kind, discovering yourself in an uncomfortable situation just beyond your grasp, hoping you're not the butt of the joke.",
    "55": "I've read through majority of the reviews high and low and completely shocked no one has mentioned the ending! So much to dig deep into, especially the shot of Natalie Portman after Julianne Moore says to her with a straight face, I'm secure...Elizabeth's shoulders go down almost looking valuable and also realizing now..this woman knew what she was doing the whole time. As Natalie Portman killed it once again, I enjoyed watching her as Elizabeth a committed method actor & became Gracie, in so many ways..then I feel at the very end that scene shined a whole knew light which makes you go so much deeper. Very compelling film and impeccable acting from all three!Awards are coming for this one.",
    "56": "Todd Haynes is a great director especially for Tar in the last couple years the similar aspect is both are a bit slow yet very well made, May December is great to be nominated that's for sure! The beginning was strange to jump into a party without introducing anyone that felt like a middle scene except Natalie Portman arriving that part made sense the rest was a weird way to start, I wonder if anyone else was thinking this. The mimicking is fantastic the 2 leads are exceptional worthy of praise regardless of anything it's a great movie. Very smooth, peaceful feel, solid drama, and unique flow I absolutely love Natalie she's amazing in Black Swan, Annihilation, and this May December she is great at her craft.",
    "57": "May December is 2023's Tar, the movie from last year that started out by giving Hollywood legend Cate Blanchett great material to work with but still asked her to do an insane amount of heavy lifting, wherein she churned out career best work with a script that demands you watch much harder than you listen. Only May December has two all time greats of their respective generations churning out career best work that both demand you watch them much harder than you listen to them, as well as a new actor I'd never heard of before now who's asked to center the entire film with the only real human performance, stuck between two infuriatingly self-involved aliens who've buried every last human thing about themselves underneath layers of selfishness and hubris.And what Charles Melton is being asked to do with Joe can't be understated. A man who was never afforded an opportunity to explore himself, discover what he desires, desperately reaching out for connection, but too afraid to act out of his own self-interest because of how utterly dependent everybody in his tiny little bubble are upon him, growing up as an adolescent without a support system of adults he could confide within, as all of the adults in his life always needed him to take care of them. First taking care of his sick sister to compensate for an overworking father, and then becoming the emotional rock for the unstable Gracie (Julianna Moore), a relationship he was groomed into, and then trapped within for the entirety of his youth after they were exploited by tabloids, isolated by infamy. And his performance truly is the one you must watch more than you listen to, as he repeats Gracie's version of their story to whomever asks about it, insisting it's true, they were in love, refusing to confront the fact that he was a child, at least until the very end in which is attempt to confront that fact is shot down immediately by Gracie, who in spite of her volatility, prone to emotional breakdowns after wasting a single cake, or at the sight of not enough hot dogs for her guests, has an uncanny ability to bury and never confront trauma she's experienced or inflicted upon others. And as Elizabeth (Natalie Portman) investigates Gracie's history, you begin to realize how inextricably linked Joe is to her, living in a community that's constantly, distrustfully watching both he and his wife, repeatedly putting in orders for her baking business simply to keep her busy, keeping them involved but at an arm's distance, making it impossible for Joe to explore himself, being stuck in a community that will forever define him by the act he was groomed into as a child.So yes, I agree with the general consensus right now, given the incredible amount of layers Melton is asked to take on, he absolutely deserves that supporting actor Oscar, though even though he's being asked to be the grounded center between two selfish sociopaths who ruthlessly exploit him, that certainly doesn't manage to steal any spotlight away from what Natalie Portman is doing here, an actress playing an actress who goes to the farthest most vile extremes any method actor could go for a trashy exploitative made-for-TV role, as she not only seeks to emulate Gracie's mannerisms and her lispy accent, but she goes digging into all of Gracie's past connections, interviewing her family members as she's an investigative journalist, and even finding excuses to sneak around with her husband Joe just so she can become the \"real\" Gracie, constantly digging for something \"real\" without an ounce of self-awareness, discussing with others Gracie's sociopathy and inability to self-reflect without a hint of irony. And it's not until she lectures a class full of high school drama students that she fully gives the game away, questioning when she's performing intimate scenes whether she's pretending to experience pleasure, or pretending not to, as she revels in imagining herself in Gracie's shoes, revels in fantasizing about seducing a teenager, and revels in seducing that same teenager herself (though at this point he's technically her age even though he's never gotten to grow from beyond where he was as a teenager). And the exploitative cruelty of Elizabeth's involvement with this family that discards any notion that she's striving for anything \"real,\" that she's trying to create a piece of empathetic art, becomes abundantly clear in that sudden joyous outburst after she watches herself in the mirror performing Gracie's letter to Joe. It's a game for her. She can no longer pretend she's not experiencing pleasure from this.And with all this talk from Elizabeth about searching for something \"real\" making her performance \"real,\" it's genuinely difficult to watch Joe in his attempt to actually find a real emotional connection, in the end attempting to confide within the woman who claims to love him the most, only to discover that she is every bit as incapable of processing any real human emotion as Elizabeth, and he'll forever be trapped by the act he was groomed into as a child, unable to connect with anybody, unable to emotionally process any of the trauma that was inflicted upon it, and forced to internalize all of it as he's forever being used by the tabloids, the \"artists,\" his parents, and his wife.",
    "58": "I watched this movie because I love Natalie Portman and Julian Moore, my semester ended on its release date and I loved \"Carol\", directed by same director Todd Haynes. I went in blind and I enjoyed the movie quite a bit. It starts off with a very interesting premise with an actress living with a person who was once at the center of national spotlight because she got into a relationship with a teenager as a married woman. The actress being Natalie Portman and the woman being Julian Moore, we can see the transformation of Elizabeth Berry to Gracie Atherton-Yoo as she spends time around her and the community she lives in. At first, she does seem to be like a Hollywood actor with a touch of elegance. But as time passes, she becomes more and more like her interpretation of Gracie with her being reckless enough to cheat with the young husband, Joe.This movie's charm comes from the fact that it's not quick to jump to conclusions about the moral character of Gracie. It never fully paints Gracie as the \"perpetrator\" and Joe as the \"victim\". It presents evidence on both sides. It helps the audience follow Elizabeth as she tries to uncover the \"truth\" in their situation. However, it does not play like a true crime. At its heart, it is a very \"human and complex story\" as Elizabeth puts it, but the word \"camp\" does describe it best. The perspective it takes on is very interesting and I loved its ending. Despite all the tension and the damage that Elizabeth has caused or exacerbated, the end production is cheap and tacky. That's the irony of this movie. Perhaps it's a criticism on all the Netflix specials that are based on true stories and how much potential damage those might cause in the name of telling the \"true story\".It's hard to describe this movie but it's captivating with wonderful performances by both Portman and Moore. Todd Haynes is becoming one of my favorite directors with both of his films I watched becoming my favorites.",
    "59": "Feels like a prank or something what is this movie. Why does this movie even exist? It's excruciatingly boring and the scenes make no sense. Natalie Portman portrays a really weird and robotic character and you just don't care for any of them. Everyone is kind of pathetic and/or weird. It's obviously based on that case that happened in real life but this is just bizarre. Not sure whether we are supposed to root for who in this movie. The music is also terrible and made the movie feel like a meme. Natalie Portman is super creepy, the whole thing is strange and uncomfortable and I want my time back.",
    "60": "This movie just gets in its own way both of the lead actresses overact and that's a fact and the young man who plays the husband can't act at all he's overacting is just downright pitiful I understand the point of his mopey sad head hanging down stuck in childlike mode supposed to be character but I guess Natalie Portman got him to overplay it and Julianne Moore is that her name her character as she plays it just seems unreal like she can't really make it work not for me and also Natalie Portman her affect gets worse and worse as she supposedly is getting better and better at portraying Julianne Moore's character her diction and enunciation gets more and more stupid, the name or title May December doesn't really make sense anyway even in an artsy fartsy way, to be honest I'm inclined to tell you just skip it once again I watched it for you ha.",
    "61": "I'd waited weeks to watch this film, and boy oh boy I was so disappointed. This film is currently the worst film I've ever seen. I'm so shocked to see people rate this film a 8/10. They have to be bots. The movie literally seems like a bunch of scenes had been removed. I played the film back a couple of time to make sure we didn't miss some of the film. This movie could be classified as a comedy because it is a complete joke. Whoever put up the cash for that movie will get hosed on this deal. This only buzz this movie should get is for how terrible this film is. I've completely disappointed in Netflix for paying for such a terrible film.",
    "62": "In a word, contrived. If you get over the tired cliche of the actress wanting to lose herself in a role you ll still have to swallow how contrived this mess is. I m working on a movie about your grotesque life story can i move in with you for a week or two? Thanks. The predictable seduction scene is ridiculous by any standard. Dang why work so hard and spend all this time making such a tepid movie! The over the top music sounds like something from an SNL parody. Another soon to be forgoten netflix production. They keep piling them on. Todd Haynes has made some fantastic movies. I guess he just got tired.",
    "63": "The late Gene Siskel used to say that the simplest way to decide if a film was worth a damn, was if you thought watching the same cast have dinner together would be a better use of your time. This film absolutely does not pass that test.There's nobody to root for. The two primary characters are a woman who raped a child and the woman who's playing her in a movie. Neither is likable or sympathetic. The young man who had his youth stolen by a predator is the only one who deserves sympathy, but he's got his own problems and isn't really likable either.I don't understand how anyone would think this is a good film. But to each their own.",
    "64": "As a psych major, I really found this movie fascinating. It reveals a part of human weirdness that exists in society. While it causes some people to be disgusted, it intrigues other people to the point of wonder. What's behind a criminal mind? I think people who wonder about that will find this movie very interesting The acting and directing of this film is amazingly good. The ending is unexpected. It's a definite watch for those who like to experience the outer limits of mankind.Julian Moore and Natalie Postman are the right actresses to portray the uncanny characters of this film. It's a movie you must watch with friends who like to have deep discussions on the human condition.",
    "65": "This film is not about the story on the surface. This film is a commentary on film making and the blurred lines and crosses boundaries that so often accompany telling uncomfortable stories.The last line of the film gives this away when she says \"it's starting to feel real.\"When does the line between filmmaking and reality lie? Are we exploiting children by putting them in roles that they are truly too young to be in?Who is the villain in this story? On the surface it would seem to be Julianne Moore's character. But there is a lot more nuance going on here. From this perspective it is a poignant film with important social commentary.The music sucks, though.",
    "66": "The acting is horrific. Terrible. Unbelievable. The dialogue is truly awful. I don't know who wrote it, but I shall research this to make sure I NEVER watch anything else they do. The music/score sounds like it belongs in a cheap horror movie. The music doesn't fit in one single scene and is the same in every scene regardless of what happens in the scene. There is nothing quality or redeeming about this movie. This is honestly one of the worst movies I've ever seen. I hated everyone in this. There was not a single person I connected with or cared about. The story was slow and drug on and on with nothing happening. Awful. Stay away. Anyone that have this above a 1 or 2 is lying.",
    "67": "I don't understand the hype over this film among TY movie reviewers. This movie is basically a boring mockery of the lifetime movie genera based on a tragic true story that continues to harm everyone it has ever touched.Its slow. Its creepy and cringy at times (e.g. Portman's reenactment in the pet shop storage room (vomit) or her manipulation of the Joe character to what end who knows, (double vomit/yuck)). It looks awful--like its a VHS recording or nondigital TV broadcast. The music is atrociously overdramatic. And most importantly, It's just a story that doesn't need to be told and from a perspective that should never be explored.The only redeeming quality of the film is the tenderness with which it treats the Joe characterization. Given this is based on a true story and the individual whose story was used to create this mess deserves all the empathy the film and we viewers can muster.",
    "68": "Walking a thin line between elegant and creepy, Todd Haynes' \"May December\" is a suspenseful psychological maze that leaves you knowing less than you did when you started.Julianne Moore and Natalie Portman star, playing two versions of the same person. She's Gracie Atherton-Yoo, who made tabloid and People Magazine covers years earlier when she seduced a coworker in the pet store where they both had jobs. She was in her mid-30s at the time; her co-worker, Joe Yoo, was 13.She gave birth to their child in jail. After her release she wed the boy, and they're still married with more kids a quarter-century later.Julianne plays the real Gracie. Natalie is TV star Elizabeth Berry, who will be playing Gracie in an upcoming movie. She has come to Gracie's beachfront home in scenic Savannah to research the role.Charles Melton plays hunky husband Joe, who's all grown up now. He's about the same age as Elizabeth, in fact.If this is sounding vaguely familiar in a tawdry tabloid way, it's because it was inspired by the true story of elementary school teacher Mary Kay Letourneau who went to prison in the 1990s for raping a 12-year-old student in her class. She married him on her release.Writers Samy Burch and Alex Mechanik aren't trying to tell her story, but rather to untangle its hairball of intertwined emotions. The relationship between actress and subject is pretty weird to begin with. (I must have missed the part in the script about why Gracie and Joe agreed to the deal in the first place.)\nBut even as Portman and Moore merge visually on-screen, sometimes with only the color of their hair to tell them apart, they're obviously at cross purposes. Gracie is a sly one, or maybe just batshit nuts. Under the guise of artistic process, it's not hard to notice that the TV star is here to steal her soul.Oscar winners Portman and Moore have a field day with the material, playing cat and mouse, continually switching which one is the aggressor. Haynes is a wily observer of their potentially lethal interplay, enhancing the increasingly sensual undercurrents with mirrors and amazing cinematic inflection points.It's all about playing roles ... and playing each other.Husband Joe gets in on the volatile sexual chemistry, too. Seemingly an innocent victim when the relationship began, he now seems to be the prize in the undeclared catfight. Whether he will be collateral damage before it's over is another thread in Haynes' kinky mystery.With notebook always in hand, the actress continues probing. Gracie's ex (Chris Tenzis), the kids they had together, the pet store owner, the lawyer in Gracie's trial - she interviews them all, trying to find the pieces Gracie won't share. The detective work sends her, and the audience, down lots of rabbit holes.Characters imprisoned - metaphorically if not literally - for their sexual inclinations is familiar territory for award-winning director Haynes. In his \"Far From Heaven\" in 2002, Dennis Quaid played a perfect '50s husband hiding his homosexuality from his wife, also played by Julianne Moore. Haynes' award-winning \"Carol\" in 2015 follows a developing relationship between Cate Blanchett and Rooney Mara, set once again against the sternly disapproving social norms of 1950s Manhattan.Haynes also directed Blanchett in \"I'm Not There,\" where she was one of six actors (Christian Bale, Heath Ledger and Richard Gere among them) portraying Bob Dylan. After that, having just two actresses do one character is child's play.As much as Haynes is a deep diver into dangerous unsettling emotional places, he is also an impeccable visual artist paying homage to cinematic glories of bygone eras. He's fond of saturated colors and lush orchestrations.Interspersing closeups of cocoons evolving into butterflies - one of the script's sub-themes - with gorgeous Savannah landscapes and interiors, \"May December\" is as gorgeous as its stars to just gaze at.Netflix, which premieres the film Friday, is billing \"May December\" as a comedy drama. That may be for Golden Globe consideration, which has separate categories for each.But finding the humor is a bit of a stretch. Whatever laughter it generates is the nervous kind, discovering yourself in an uncomfortable situation just beyond your grasp, hoping you're not the butt of the joke.",
    "69": "I was excited about this movie coming out because it featured 2 of my favorite actresses. Also, having worked in the television news field, I was familiar with the true story. But this movie was BORING and showed little depth into the possible origin of this real life story. It was dull and uneventful. The music was flat and bland and tries to convey drama, but it was more appropriate for a tv soap opera. Moore and Portland tried their best, but didn't have much to work with. I stayed with it because I thought it would get better, but unfortunately, it got worse. You come away really not knowing anything about this forbidden \"love\". What a waste.",
    "70": "Todd Haynes has done a great job again. I admire this man's ability to create a distinct ambiance and atmosphere in a movie. It was great to watch two actors who are among the best of their generation, Julianne Moore and Natalie Portman, against each other. While the film follows the relationship that develops between a woman with a very problematic past and a woman who will portray her in a movie, it deals with the relationship between reality and fiction, the effort of art to perceive and accurately reflect reality, and the slipperiness of reality. This slipperiness is about the questions of both \"What really happened?\" and \"In how many different ways can that be seen and evaluated?\" I had goosebumps when the movie ended! 9/10.",
    "71": "I am writing this as I finish this movie that I paused and restarted about 10 times. It's pretty slow and pretty boring but I kind of wanted to finish it to get the entire story. It's just glorifying what happened with MaryKay in the 90s. It's strange. I do like Natalie Portman though and she does play some weird roles. I didn't really understand the point of the movie to be honest. It was just kind of OK. This is their life now. Just pretty weird all the way around. I kind of feel bad for the young father. I know that in real life, MaryKay passed away, and before that they had already split up so I assume that would be the case here.",
    "72": "So i didn't realise this was a film based on a play based on a book based on a news item. I expected a campy, lesbian rom-com (based on the film poster) not an agonising angry-woman-married-to-man-boy story with the most annoying, awful piano music played by a one-fingered pianist with most of the keys missing.Honestly, skip this. The single redeeming feature about the whole movie is the man-boy;s ecological quest to increase a butterfly population. Other than that, the performance of all three leads are mostly wooden. You can tell their hearts aren't into it. The actors playing the graduating kids, however, are really very good.Awful. 2/10.",
    "73": "I loved this movie. People are too distracted these days and expect constant over-stimulation and are upset because the movie moves slow. I think it runs a pace that is real. No flashback scenes which I appreciated because you follow the story with Natalie Portman as she studies Julianne Moore, but discovers a lot more than she expected.You see Natalie slowly turn in to the character and lose grip on reality. Just as she had once said about Julianne while talking with the lawyer in regards to her being delusional and not in touch with reality. In trying to become Julianne, Natalie actually does become her as you can see in the end.A couple parts with music were a little distracting from the heavyweight of emotional exchanges. The actors did an incredible and believable job. You see the toll that Julianne's actions take place on her mental health, and everyone else she hurt around her. It was so disturbing to see personalities switch and flow with ease, a real psychotic skill. I'm also so glad to see Charles Melton step away from Riverside because he does have a true talent for dramatic roles. You can see him clearly being an adult, still trapped as that 13 year old boy she took advantage of. The constant struggle he has within himself about everything, especially towards the end when he realizes he's about to be isolated just as much as Julianne has made herself to be.In a tragic and unimaginable trauma, this story really shows the multitude of victims and of consequences tied to one person's decision.",
    "74": "I have absolutely no idea how i got through 3/4 of the movie & I had to stop. Nothing was happening - it was like watching a terrible high school play, even those are better than this \"piece of art\". What happened to natalie portman? She was phenomenal in the other boleyn girl, v for vendetta, the black swan & after no strings attached.. nothing. Nothing at least i heard of (i do not consider superhero movies as movies for adults). The other actress had some good movies as well & now ... this. As I said, I didn't even finish the movie, I have no idea how i even got through most of it. It was waaaay to slow, too dull, too boring. Wasted talent. Wasted money for sure.",
    "75": "This is a terrible movie wasting the talent of some fine actors. It's hard to care about any of the characters. It's a difficult subject but the constant question for me was why are we watching a movie about making a movie about a story that has so little strength.It's dull. There's no point to it. Tell me at the end why this movie was made..!?This is a terrible movie wasting the talent of some fine actors. It's hard to care about any of the characters. It's a difficult subject but the constant question for me was why are we watching a movie about making a movie about a story that has so little strength.",
    "76": "The so called critics have already made their minds up about this film before the majority of us would see it. Like with any 'notable' film, Bradshaws of this world got to see it for free, so we can be bestowed with their learned and divine opinions. Wikipedia copied tomatoes and all is set: universal acclaim and another near genius. Nothing really much happens in this film, lots of dialogue and not a lot else. If you did not know the back story - you would be confused as to what the film is about as well as the predictable flaw of using known actresses - cheap trick. Fame over quality. The film has important issues but it underwhelms. The film is like winning the lottery and then finding out all you won was another lottery ticket.",
    "77": "Don't wait for anything to happen if you're unlucky enough to be sucked in to watching this movie. All the positive critic reviews enticed me to walk in the door. I sat there waiting for there to be some twist or complication to create a plot. It didn't happen ... never, nothing! I wasn't even expecting when the end thankfully came.I have no idea what the critics liked about it. I think it was a case of the king's new clothes. Nobody was going to say anything bad because they thought they couldn't criticise an art house film. Maybe it was just too high brow for me to see any value in this film.",
    "78": "I don't leave reviews on IMDB, but I felt compelled after seeing a bunch of low ratings. I'm definitely aligned with the critics on this one. Phenomenal acting, original script, masterful directing and cinematography, eerie soundtrack, and simmering tension. If you appreciate these and don't mind a slow burn, this movie will not disappoint. It kept me engaged throughout, and I personally love some subtlety and ambiguity that is thought provoking and forces the viewer to arrive at their own conclusions. Natalie Portman, Julianne Moore, and Charles Melton were all superb. The setting in Savannah, Georgia is beautiful as well. I wasn't sure what to expect, but I really enjoyed this movie.",
    "79": "The best thing about this film was the discussion the story line provided our household. After that ... WOW! Please do not waste your time.I was genuinely disappointed, we ignored the marmite reviews here on IMBD, simply, because I thought, 'how can Natalie Portman and Julianne Moore, get it wrong?'\nStrong Hollywood Actors. Excellent back catalogue and a history of good decision making:We read an interesting article indicating Natalie brought this script to fruition, therefore we felt it was going to be of substance and provide a fresh concept within a tricky narrative.Unfortunately NOT the case!!! The niche didn't portray, and it was quite frankly the epitome of a Channel 5 lunchtime movie. ( something you'd expect to see Meghan Markle in circa 2005).We persevered for many reasons. Mainly the high scores on here,\nGUYS !!!!!! Please!!!!!, are you just trying to be cool? Or are you just really new to this and finding art and bullcrap somewhere we aren't?Perhaps it was the husbands prosthetic '10 incher'\nWhich we found hilarious and extremely entertaining... hence the 1 for the score!Extremely strange, not sure what the message was and I do not understand how our Nat P got it to the screen. Stick to your day job Nat, as a talent and leave the strange scripts where they belong, on the hairdressers coffee table!",
    "80": "First off, not everyone knows the true story on which this is based. So right off the bat there were question marks. I watched anyway, waiting for something to happen. More back story, flashbacks, some sign of emotions from any of them (except a daughter who came to visit who showed some anger). Otherwise it played more like a weird dream where the characters in it say little and seem robotic. The acting was fine but I don't get the point of the story except that Grace was fine with her decisions in life and the truly troubled player was Natalie Portman's character who has a bit of an All About Eve going on. In the end without more drama, this story wasn't worth being made into a movie.",
    "81": "Everything about this movie is so tedious, I keep waiting for it to get better, but it won't, I know. Most of all, the annoying music playing in between scenes is tedious and repetitive. Feels like it's going to build up to some kind of crescendo and still nothing happens. Probably the most annoying part of this movie.I usually enjoy the acting of the two main actresses, Joe as an actor is new to me, but could be adorable. Also, the kids are probably usually good, the script is pretty bad and a snoozer\nGrateful it was free, to speak, on Netflix.It's quite a good and certainly believable story plot. Probably the directors worst work.",
    "82": "I was excited and looked forward to watch this one as Todd Haynes movies have all been good so far. But this one just keeps wandering left to right, back to left without going anywhere. It was almost painful to watch after 40 minutes into it but I patiently kept waiting for the script to make some sense. Natalie Portman and Julianne Moore level of performers also can't help save this one. They are both good but...the story doesn't go anywhere, literally! Seems like the director was ready with SOME sort of script and didn't work much on it, or the studio rushed into it with the big actors' names. Totally disappointing!",
    "83": "None of the characters are sympathetic. No matter how you spin it, a woman who has sex with a 13 year-old is a predator and there's no place to go but downhill from there. The couple's kids, her ex-husband, the kids from her first marriage, and everyone else in town for that matter seem to be angry or depressed, and even the actress trying to get to know this sad maimed family turns out to be predatory. Natalie Portman and Julianne Moore and Charles Melton act their hearts out but the movie itself has no hope, no heart. Life is tough enough, so why add to it with a couple hours of this hopeless story.",
    "84": "What did I just watch?I guess this was supposed to be a comedy, but maybe they did an early 90's lifetime drama too well, cinematically and story wise for it to be actually funny. The horribly repeated piano background drama music just became incredibly grating. It eventually became one of the only hints that this was supposed to funny. Watching it on Netflix I was honestly just completely confused and bored. Play it on lifetime as a throwback and no one would bat an eye.There rest isn't anything more to say about it, except that i have no idea what other people have gotten out of it that they rated it so well.",
    "85": "With a strong and potentially sensational premise, May-December really should have been fascinating. But it just isn't. The film's characterisation of the Older Woman and her once Schoolboy Lover could scarcely be more predictable: she's naive and vulnerable, he's more mature and responsible. She's dependent; he's starting to feel trapped, etc. So while it's not exactly a commonplace story, the movie has about it the air of instant cliche. Meanwhile, Natalie Portman's actress researching a role is uninspired and unconvincing. She's in an awkward position, yet does little to try and ingratiate herself or win over her subject. Ultimately, the movie goes exactly where you expect it to go, yet to very little dramatic effect. And we're really no wiser at the end than we were at the beginning. Just two hours older and wondering why Todd Haynes thought this strained soap opera was worth his attention.",
    "86": "First of all it's slow, and for the first 1 and 15 I wanted this film to be over. However in the last 45 you do reap the rewards of this movie. An interesting look at stolen childhood innocence, whilst also provoking the audience to question what is real. Character expositions tend to be hit or miss for me as they tend to verve towards slow pacing. This one does however the payoff at the end is worth the watch.Charles Melton stole the show for me with Julianne Moore also very strong, wouldn't be surprised if either received and Oscar nod for their performances. Some nice comedic moments however the first 3/4 of the movie were a little too slow to keep my attention.",
    "87": "Was not happy that Elizabeth's character chooses to perpetuate the same disgusting crime that Gracie did to Joe when he was a child. In alot of ways, Joe still has the mind of a child since his abuse by Gracie and Elizabeth realizes that but still seduces him and then hurts him by saying \"its what adults do\". Makes it seem like all adults are just hurting the children and its okay to do that. DID NOT LIKE THIS AT ALL. The film should have clearly shown that this was a crime perpetuated against Joe when he was a child and how he is still affected by that crime all these years later. As humans, we need to do a better job in portraying the crimes against our children.",
    "88": "Many other reviews touch base on reasons why the movie is a let down. I thought it was reasonably OK in terms of all the Big Time Acting. I enjoyed the setting because Savannah looks like a different and unique kind of town. I was really distracted by the size of the house.....grounds....estate? Did they inherit it from Gracie's family maybe? Who pays the taxes when one of them is a radiology tech and the other bakes cakes out of other people's sympathy? Or is it just the notion of rich film makers that people in the south live at Tara? Also the final scenes were ridiculous in their lack of subtly.",
    "89": "I really respect director Todd Haynes for the many great movies he has made untill now, but this is not one of them...The bad: however intrigueing this story might sound, the execution of it was bland and tedious. Director Todd Haynes is known for making exquisite subtle SLOWburning dramas in which characters are central, but however good the acting, however promising the set up of this story, the end result is completely void of real drama.We get to see some ladies chatting at diner, ladies arranging some flowers, ladies at a party etc etc. This goes ON and ON from the very start till the last minute. Endless scenes wherein literally NOTHING happens whatsoever.Bring your search light and a microscope in order to detect any trace of drama or thrill. What a complete and utter misfire of a drama.At best, only to be recommended for old ladies who dont mind watching an absolute snorefest on a slow sunday afternoon...",
    "90": "In moviemaking, there's subtlety, and then there's subtlety carried too far. In the case of director Todd Haynes's latest, the filmmaker unfortunately indulges himself far too much in the latter. This story of an actress (Natalie Portman) who visits a middle-aged sex offender (Julianne Moore) to prepare for a role she's about to play in a movie about her subject's life never seems to find a footing to stick with and explore. The narrative examines many different aspects of the back story behind the lives of the characters to be portrayed in this pending production without ever really resolving any of them by the time the credits roll. This includes not only the protagonist's reasons for pursuing her once-underage husband (Charles Melton) - actions that got her jailed and made her fodder for countless tawdry tabloid cover stories - but also the nature of the actress's real motivations in conducting such an excessively intense in-depth study of her character. In the process, virtually everyone comes across as somewhat unsavory, and, considering that the truth is never clearly revealed about any of them, it begs the question, why should we care about any of this? The film depicts all of this so subtly that it goes beyond nuance, veering into the realm of enigmatic, thereby further reinforcing the notion of why any of us should care. Ironically, these underplayed elements are in stark contrast to some rather obvious (and terribly trite) symbolism, particularly in images related to themes of transition and transformation. The picture's inconsistent changes in tone don't help, either, vacillating between allegedly serious drama and a seemingly underdeveloped desire to break out as an exercise in full-fledged camp (which, by the way, probably would have made this a much better offering). The script's meandering flow and glacial pacing also don't help, leaving viewers scratching their heads more often than not as to where this story is headed. In the end, all of the foregoing is ultimately quite unfortunate, because there's definite potential in this project, but it's never adequately defined and fleshed out. Leads Moore and (especially) Portman turn in admirable efforts to make this material fly, but they simply don't have enough to work with to make that happen. While there appear to be allusions to themes like the difficulty involved in dealing with long-buried feelings and the fact that we may never be able to adequately grasp the truth behind them (either as outsiders looking in or as active participants in the midst of such dealings), the cryptic handling of those ideas undermines whatever meaningful messages or cinematic value they might have, making all of this seem like just such a big waste of time. Director Haynes has an impressive filmography behind him with such releases as \"Poison\" (1991), \"Far From Heaven\" (2002) and \"Dark Waters\" (2019), but, regrettably, \"May December\" certainly can't be counted as part of that list.",
    "91": "It's a drama set in the spring of 2015 in Savannah, Georgia. It follows the visit of actor Elizabeth Berry (Natalie Portman) to a couple who were the subject of a major scandal in 1992. At that time, Gracie Atherton (Julianne Moore), a married woman with children who worked in a pet shop, had an affair with a 13-year-old boy, Joe Yoo (Charles Melton), and bore his child. She served prison time and later married Joe; they now have three children. The two twins, Mary (Elizabeth Yu) and Charlie (Gabriel Chung) are about to graduate from high school.Elizabeth is to play the role of Gracie in a TV movie. We also meet Gracie's first husband, Tom (D. W. Moffett), and son, Georgie (Cory Michael Smith), from her first marriage. The movie follows Elizabeth's investigation into Gracie's life, which results in picking up some ambiguous messages. She also begins to identify with Gracie in some strange ways.\"May December\" was a significant disappointment. Julianne Moore gives a strong performance, but the storyline wanders without apparent direction. The Portman character veers in mystifying directions and arrives at an ending with little logic. The Moffett, Smith, and Melton characters remain too undefined despite their centrality to the story. This lack means an underdeveloped script.",
    "92": "Greetings again from the darkness. Contentedly, most us live our lives in a manner that would never be worthy of tabloid headlines. Not so for Gracie in this psychologically complex new film from expert director Todd Haynes (FAR FROM HEAVEN, 2002) and writers Samy Burch and Alex Mechanik. Early on, Haynes shows us those tabloids featuring Gracie's scandal following her seduction of 7th grader Joe in the stock room of the local pet store. She was 36 years old, and he was 13. Soon after, Gracie went to prison, where she bore their first child.The story picks up 24 years later as Gracie and Joe are married, and their second and third children, twins Mary (Elizabeth Yu) and Charlie (Gabriel Chung), are graduating high school and preparing to ship off to college. In other words, they are all living a fairly normal life. However, as a harsh reminder that their lives are not actually normal, Elizabeth (Oscar winner Natalie Portman) arrives at their Savannah home to research her role as Gracie in an upcoming indie film about the scandal.Oscar winner Julianne Moore plays Gracie, in her fourth collaboration with director Haynes. Charles Melton (THE SUN IS ALSO A STAR, 2019) plays Joe, who is now the same age as Elizabeth, as well as the kids from Gracie's first marriage. Elizabeth is polite and apologetic as she initially treads carefully in asking probing questions of the family and their friends. Her approach generates some awkward moments, and although Gracie seems to hold firmly to her did-nothing-wrong stance, it's Joe who begins to question things ... mimicking the slow development of the Monarch butterflies he breeds.Perhaps the film's best sequence occurs when actress Elizabeth shows up for a Q&A with Mary and Charlie's class. When the question gets a bit risqu, Elizabeth's answer borders on inappropriate, and is an honest depiction of the fine line between acting and reality. Back at the house, Elizabeth's questions raise previously unspoken doubts, as well as the ongoing impact of the scandal ... not the least of which are periodic postal deliveries of excrement denoting some of the public's view of a female predator.The similarities to the true-life story of Mary Kay Letourneau are inescapable, though a twist here is that Gracie and Joe's recollection of how things started are not necessarily in sync. Savannah is always a character unto itself, and the accompanying music is eerily spot on ... including the repurposing of Michel Legrand's score from THE GO-BETWEEN (1971). The three lead actors (Ms. Portman, Ms. Moore, Mr. Melton) are terrific, and director Haynes has delivered yet another complex movie that gives the appearance of simplicity due to how beautifully it's done.Opens in select theaters on November 17, 2023 and streams on Netflix beginning December 1, 2023.",
    "93": "This movie is based on subtext and doesn't have an overt narrative that progresses like most films.This movie is about the about one of the worst crimes that exists - CSA (look it up). If you understand it's generational and also very difficult to comprehend this movie will hit you HARD.That being said, this is a very well done movie about adults who are really just children. They never healed from their traumas and what ensues is a vision of how life is when you ignore that stuff.I personally have dealt this this crap, and ignoring it is the easy way out...but leads to a unlived life. You have to put the bright lights on it which is what Natalie Portman's character does.The movie is for people that love film as art - not narrative. It is very well done. All the acting is based on nuanced subtext. The score and the cinematography are also very well done (I love slow zooms...sue me).Overall it's a great film if you can just absorb the artform of a well paced uncovering of the aftermath of a crime and what happens when you steal innocence. It's a truly remarkable movie that will impact people that understand this dynamic in life. 8/10.",
    "94": "I thought it was boring and slow. They kept playing dramatic music like something horrible and shocking was going to happen. But nothing ever did.I understand it's supposed to be about the Mary Kay Letourneau situation. Indicating it was an unhealthy relationship. And how older women can take unfair advantage of younger men.I thought technically it was done well. The acting was good. I like Natalie Portman and Julianne Moore. And Charles Melton got a lot of raves on his performance.But it seemed like this movie never went anywhere. I kept waiting for something to happen. But nothing ever did.I think viewers will enjoy this movie more, if they know --- going in --- it's supposed to represent the Mary Kay Letourneau situation. Otherwise like me, they may be left holding out their hands as if to ask, \"What was that supposed to be?\"",
    "95": "I remember the whole Mary Kay Latirneau case years ago, so I thought the movie would be interesting, entertaining, or at least worth somewhat good. Ha! Wrong on all counts!This was such a snoozer; we struggled to stay awake since the pace was so slow; every scene was so drawn out that it truly was hard to stay interested.The actor who plays Joe had so little charisma or charm; he was not the right actor for this role.The music was just bizarre- a bizarre, odd choice. We were constantly aware of the music since the volume always increased at the oddest times.For the life of me, I can't begin to grasp why anyone would praise this odd movie- or why anyone could rate it any higher than a 2.When I read that it made a hit at the Cannes Film Festival, my first reaction was laughter. It's like the old story of The Emperor's New Clothes.Don't waste your time on this utter snoozer of a movie!!",
    "96": "After hearing a lot of good reviews about it, particularly about Riverdale star Charles Melton's stellar performance, May December became my most anticipated movie of this year. Thanks to Netflix winning its rights to release it, I can now watch it before the year ends.In May December, Moore plays Gracie, a mother with an infamous past. In the 1990s, Gracie got pregnant by a seventh grader named Joe, portrayed by Melton. As if that wasn't enough, she married him later on and they had two more children. Natalie Portman is Elizabeth, an actress who, twenty years later, is set to act the part of Gracie in an indie film based on her controversial life. Before the shooting of her film, Elizabeth visits Gracie's home to interview them and prepare for her role.May December is my first Todd Haynes film. It is a slow-moving character study of three complicated characters. Depending on the viewer, it can be tedious or it can be interesting. For me, it's the latter. The movie starts with showing the seemingly picture-perfect family of Gracie and her attractive husband. It is through Elizabeth's prying eyes and investigation that we gradually begin to learn more about the couple as the story progresses. It is hard to understand why Gracie acts the way she do, and it is exactly the reason why Elizabeth chose to play her. It is also interesting to see how Gracie treats her children, but I wouldn't delve deeper into that. Her husband Joe, meanwhile, is still a kid trapped in an adult's body. His childlike quality is very apparent early on in the film as we observe his body language and reactions. He is a caterpillar who never learned how to fly. The highlight of the movie is Joe's breakdown. Melton is this year's shocker. A butterfly is shown in the film a lot, an obvious metaphor to his slow transformation and realization as the film moves forward. It is sad to watch.Other things that I love about May December are its skillful camera works that excellently capture the characters' emotions, and a campy score that elevates the tension that is in the story.I highly recommend this movie.",
    "97": "Todd Haynes' 'May December' is not for everyone. I can easily imagine many viewers saying, 'What was that?' after its conclusion. In fact well before its conclusion. We've got a boatload of unlikable adult characters to deal with. A good many likable but confused adolescent poorly-drawn characters to deal with. And frankly we've got no one to root for.Even so, somehow the film 'worked' for me. There is a sensual tension that sits over the film from its start to finish. The story is that of an adult mother and wife (Julianne Moore) seducing a thirteen year old boy and as a result bearing three children. And this is only one aspect of the film's sensual / sexual tone. When twenty years later an actress (Natalie Portman) arrives in town (Savannah, Ga.) to learn more about the now-adult May-December couple (Portman's character is going to portray the mother in an upcoming film) that sense of sexual tension only increases, as did my interest in the story. The film's center concerns two characters; where little by little one of the two takes on the personality of the other.There are, however, several 'side-stories' most of which go nowhere. The May-December couples' children are graduating high school (So what?). A son born to the mother in her first marriage is a blackmailer (again, So what?). That same son alleges a same-sex affair with the seduced thirteen year old .. again this goes nowhere. And the actress; her relationship with an unseen film executive is vague, at best. Finally, the thirteen-year-old now a man in his thirties is having a crisis of sorts; though the details of this plot point are never really laid out.So, if the subject of a May-December affair interests you, you might well enjoy this film. Despite its problems.If not; I'd say, You can miss it.",
    "98": "Famous actress Elizabeth (Natalie Portman) goes to spend some time with Gracie (Julianne Moore) a woman who is notorious for 20 years earlier being imprisoned for committing the statutory rape of a 13 year old boy. She has now been married to the 'boy' for over 20 years and they have several children. Largely accepting her place in her local town as a somewhat disreputable character still, will Elizabeth's digging open up old wounds.Billed rather strangely as a dark comedy, which I will admit, I don't get, this is actually a complex, multi layered drama focussing on both the behaviour of Gracie, whose life has in fact been entirely shaped by what she did and more mysteriously whether the method actor Elizabeth is all she claims to be and whether what she is seeking to uncover will be used in her film honestly and respectfully. The performances from Portman, Moore and Charles Melton - who plays Moore's husband - are all excellent. Gracie is short with just about everyone and treats her husband, young though he is, like a child, whilst Elizabeth's understanding and empathy to get the character detail she needs for her film part is soon revealed as being skin deep. Ultimately, none of the characters ever really gain our sympathy and in fact all are quite unlikeable, finely drawn though they may be and as a result there is much to admire here rather than like. Excellent acting, I just found it a little too cold to get totally drawn in or care.",
    "99": "\"May December\" finds Natalie Portman and Julianne Moore in an unsettling character study (literally) about an actress researching a role in a movie where she will play a 36 year old woman who had an affair with a 12 year old boy and then ended up marrying him.This is being billed as a dark comedy, and I've seen more than one person talking about how funny it is. It's not funny in the conventional sense, but I suppose there is a certain (extremely dark) joke played on the world of actors and how they go about preparing for roles. Portman's actress character is ostensibly doing so much research because she wants to truly understand Moore's sex offender and show a sympathetic side. But at the end of the movie, Portman -- and us, the film's audience -- are no closer to really understanding Moore than we were at the beginning. So what was Portman doing, really, with all of that \"research?\" Is it really important to her understanding of this woman and her upcoming performance that she knows how Moore applies her makeup? I imagine this movie might seem funnier to people in the movie industry than to the casual movie goer.What makes \"May December\" so unsettling is that at the center of all this is the boy, now a grown man, but who in many ways is still stuck at twelve. Are movies about subjects like this really trying to get at \"truth\" as they claim, or are they exploiting other people's pain? And if the latter, what role do we as an audience play in being complicit in that exploitation? This seems to me to the be crux of what director Todd Haynes is exploring in this film, and it doesn't come to a conclusion about it. It asks the question and leaves us to ponder it.The trio of Moore, Portman, and Charles Melton as Moore's husband are giving great performances in this. Moore's is especially a fascinating creation. What if there isn't a lot of depth to this woman that Portman is trying so hard to unravel? What if she's actually just a crappy person? Where does that leave Portman and her desire to tell the other side of the story. Moore walks a knife edge with her character, and we're never completely sure whether she's the villain or the victim. Portman gets an Oscar moment of her own, a monologue delivered directly to the screen. Is she an actress truly committed to her craft, or is she just a narcissist using other people's pain and confusion for her own gain? Are all actors narcissists to a certain extent? And Melton has a few moments of heartbreaking vulnerability where the lost little boy peeks out from the facade of the man.A juicy film that gave my wife and I a lot to chew on after we watched it.Grade: A.",
    "100": "A profound character piece about some very not too deep characters - or at least one who has deluded/distorted who she is into this sweet mother and housewife who did a... disgusting thing, and a husband who isnstarting to open up, like a butterfly.... or that's how hed like to think of himself, or the climax of this could be the start.If Todd Haynes had a Douglas Sirk film previously with Far From Heaven in a sort of classical mold - how people were somewhat more shaped by their circumstances at that period of time zz this is another but spiked to the brim with the acid satire of 21st century tabloid \"stories\" (don't neglect when the actress Elizabeth slips and talks about these real people's lives as \"stories\" or scenarios of a kind), and how what can be turned into pulpy melodrama through the act of dramatization is actually not all that deep. And yet at the same time there is a tragedy of loss (childhood for example) amid the notions of what it means to \"recontextualize\" through performance.This is a credit to the brilliant screenplay by Samy Burch and Alex Mechanik, but Haynes has such an awesome command of his medium for the most part and giving the space the actors, Moore and Portman (that one monologue to the camera, as commanding a moment as she will ever deliver) and Melton who comes close to running away with this as the only character who is realizing what a... *problem* this all is.May December (what a title by the way) is also the kind of experience you need to sit with for a few minutes after it ends, not necessarily for its insights, though it does give us apt and biting and all too true insight about how the \"complex/morally gray\" people who actors and the like try to study are sometimes... not (re: Jeffrey Dahmer, and other lessor True Crime scansls), but because of how the ending is an anti-climax that sort of pulls the rug out from expectations of this building to a conventional thriller point (ie who will get killed if at all).It instead recontextualizes what this is about: how people tell themselves what they want and/or need to get through their lives and work - that goes for Gracie and how she's chosen to distort herself (the \"Naive\" comment about herself isn't wrong, but the Lizard brain part of her knows how to move and manipulate in her way, hence what she says in that explosive argument scene in the bedroon), but also Elizabeth and her career and Joe and how he sees his life with this woman, now at the age she was when the statutory rape occurred. And the community around them that doesn't bat an eye anymore about what this family is? Shrug. People forget these things, it seems.No matter how happy you've think you are or how many cakes you can make (or, nah, she's not really making that many), or what the kids think of all this (mostly just... whatever), love and control of reality are quite malleable. In other words, May December is a gripping satire Melodrama pop culture commentary with a couple of narrative loose ends I can acknowledge but mostly overlook (the asthma I thought would play a little more of a plant/payoff role, and some odd editing in the graduation set piece) because of the strengths; the performances are among not only the finest of the year but ones all the leading actors should be proud to say are highpoints of their careers.I mean, the Gracie voice? No notes. Last but certainly not least - it's the kind of film that feels of a piece with the You're Wrong About podcast, looking at a real life case and going \"wait... let's debunk this and show how things can just be... dumb and silly and shallow.\" Great, incivise, uncomfortable times.",
    "101": "Saw this that the filmfestival 2023 in Ghant (Belgium). Although this is not a whodunit, it shows many similarities in design and storytelling. Things come to light, maybe not in the right order, maybe not all true, maybe disformed or even invented by the revealer. We add it all to the mix of \"facts\" to build a picture of the main protagonists, and we draw our conclusions on the fly, only to be confused by the next \"fact\", having to start all over again.This movie is exemplary in that respect. The story is well told and keeps our attention from start to finish. Several characters were not very likable, especially Gracie, but this is bound to be on purpose. For a very long time, the impression is maintained that Gracie is superficial, nave and not really grown up despite her age, but near the end we are sent in a different direction. Nothing is certain, and we are left puzzled and confused, exactly as it should be.The running time may look long, given the ingredients. Now I've seen it, I don't think it overly long, at least I did not have that feeling. Moreover, leaving things out would have destroyed the storytelling and prevented fleshing out the respective characters as done here. Finally, the plot is not over-complicated. As I see it now, ample interesting ingredients but not too many.",
    "102": "\"May-December\" (2023) is the kind of movie that sticks with you. It's the film you find yourself thinking about not just in the days after you've seen it, but when you're lost in thought, all by yourself. It has a way of getting under your skin with its unsettling scenes that can catch you off guard.Even with its dramatic moments that can feel a bit showy, the film bravely addresses a dark and serious issue that really bites into your sense of ease. It's a gutsy contrast to the film's lighter, sometimes playful moments, but it's a contrast that ends up working really well. The storyline cuts close to the bone, touching on painful childhood issues and awakening emotions and memories that many of us might not have even realized we were suppressing.In terms of performances, it's Charles Melton who unexpectedly steals the show, bringing a depth to his role in a way that's just mesmerizing. Sure, Natalie Portman and Julianne Moore are incredible, but Melton is the one who truly commands your attention. Take the scene where he just listens to Portman's character - the silent story his face tells is powerful.Melton's acting is heartfelt and sincere; it's the kind of performance that not only draws you in but also touches you deeply. I've cried during many movies, but this one hit me harder. Seeing Melton portray a man with the naive heart of a child, caught in a complicated, uneven love, moved me to tears of genuine sympathy.Director Todd Haynes navigates through the film's challenging themes with skill, shining a harsh light on the twisted ways of predators with unsettling realism. He approaches a subject that could easily cause a stir, as it pulls from headlines we've all seen, yet he manages to create a film that's as intellectually stimulating as it is captivating, guiding the audience through an emotional journey with the expertise of a master.What really stays with me, though, is how the film knows when to call it quits. \"May-December\" has moments where it feels like it's starting to drag, and I was worried it might lose its way. But then it pulls off something remarkable - it ends right when it should. The film wraps up without any unnecessary fuss, leaving a quiet impact that echoes with you. In a world where movies often overstay their welcome, this one feels refreshingly confident and decisively smart.",
    "103": "Some movies creep in to our subconscious, not because they are shocking or graphic in their depiction of violence, but sometimes subjects morally ambiguous might linger, as our conscious mind tries to make a moral judgement on subject we witnessed.This type of latent reflection might show up after watching 'May December' (2023) directed by Todd Haynes, movie of which the subject might make us feel a little uneasy.\"Twenty years after their notorious tabloid romance gripped the nation, a married couple buckles under pressure when an actress arrives to do research for a film about their past.\"The short synopsis sounds quite innocent until we realize is that the married couple is a union between 13th years old boy and his adult female teacher, which seduced one another...\nThe unique aspect is that this film is presented from the perispective of what happened with this couple 25 years later. The young boy is now 36 years of age (played by Charles Melton) having his own kids with the discraised teacher (Julianne Moore) who after lengthy prison sentence ,now as a married couple together is raising a family.This potentially normalized relationship is being investigated by actress (Natalie Portman) who is supposed to play the character of the teacher in biopic.Subject of this sort could have been easily sensationalized by lesser director and yet Todd doesn't cross the line of bad taste, letting the characters internalize their trauma individually.All the performances are very strong, specially Portman and Moore, as we learn the inner workings of what motivates their characters.The cinematography is rather simple using usually two camera setups for each scene, focusing rather on performances of the actors to install narrative depth. Some nice symbology is used, with shots of caterpillar becoming a butterfly, which nicely showcases what is happening with the characters as the plot develops.The music reminded me the main theme from Kiesowski's 'Three Colors: BLUE' a movie which deals with sense of grief, which ties in to subject of 'May December' very well, as all the the characters here are dealing with trying to function in relationship with moral stigma attached to.Even the title MAY DECEMBER has a nice esoteric depth and could be translated as LOVE, TIME. (In astrology month of May is ruled by Taurus and Taurus is ruled by planet Venus, associated with LOVE, December on the other hand is ruled by Capricorn which in turn is ruled by planet Saturn which in Greek mythology was known as Cronus associated with TIME).Very intellectually sharp symbolism indeed!After it's premiere at Cannes Film Festival 2023 'May December' was sold to Netflix for $11 million and on December 1st it will have its official premiere on this streaming service, however right now it has a limited cinema release and it's good enough to justify trip to your local arthouse cinema.!!",
    "104": "\"May December\" is for sure and certainly a film of mature and not light subject matter, still you as the viewer will feel the complex and harsh emotions of the central characters as the scenes are telling and revealing with all involved.The story involves a 20 year old tabloid like romance between a married couple Gracie(Julianne Moore) and Joe(Charles Melton). However this all began in a very dark form when Gracie was a school teacher and started with the seduction and dating of Joe at the age of 13. The affair as shown in the film was a legal and front page drama headline sensation.Now in a wild card like moment and big play of the film enter Elizabeth(the always super great Natalie Portman) an actress who comes into town and enters the life of Joe and Gracie, as she has plenty of stories to take in and do her own research as she gets ready to play Gracie in a film about the love affair.Along the way all involved get to know one another and feel each other out as strengths and weaknesses are learned and secrets and past lives are revealed and desire and passions are given into. Overall director Todd Haynes makes a pretty compelling character study of raw and real like acceptance showing things in the lives of grown up adults. \"May December\" may not be everyone's cup of tea, yet I found it an interesting emotional like drama to where the characters open up to one another, plus the acting and on screen chemistry between Moore and Portman is top notch in A plus form.",
    "105": "This actually reminded me a little of \"All About Eve\" (1950) as television actress \"Elizabeth\" (Natalie Portman) arrives at the home of \"Gracie\" (Julianne Moore) about whom she is to star in a biopic. Initially welcoming of her and keen to help, we follow the changing dynamic as we learn that \"Gracie\" has quite a past, and that her husband of 20-odd years, \"Joe\" (Charles Melton) is considerably younger than her and there was quite a furore when they first hooked up that saw the older woman incarcerated. The more she finds out, the more involved \"Elizabeth\" becomes and the more immersed we all become in this quite compelling story of a taboo that rather broke a mould or two and is now surrounded by an atmosphere of hypocrisy, faux-friendships, and lemon drizzle cake. There is a strong, increasingly well delivered, competitiveness between these two women and Melton delivers quite strongly too as the young man who seems devoid of much purpose as he heads towards his forties. The script is quite tight, frequently potent and Todd Haynes's overall style of intimate direction genuinely encourages us to invest a little in one of the women - I didn't manage to invest in both, especially as the denouement loomed (perhaps just a little predictably). This film quite successfully presents us with quite an interesting character study that works both ways in their relationship - and is well worth a watch.",
    "106": "Can't deny how much I enjoyed this movie. Julianne Moore and Natalie Portman give great performances in this dark tale. A Tale that seems too common at one point anyway.Also enjoyed the actor who played Joe Yoo in the film I thought he handled his part perfectly.Was expecting more laughs but I was far more disturbed at the plot of the movie than anything.Also a sucker for movies about Hollywood and this counts because of Portman's character playing an actress doing research to play Moore's character. Also feels that Todd Hayes was making the film to fit a style that relates to the Hollywood vibe.Well played Cinema.",
    "107": "As \"May December\" opens, Elizabeth, an actress, arrives in Savanah, GL, where she is to meet with Gracie, whose character she will play in an up-coming movie. Turs out that then 36 yo Gracie had a sexual relationship with then 13 yo Joe and was imprisoned. Not almost a quarter century later, Gracie and Joe are still together. What happened? At this point we are 10 minutes into the movie.Couple of comments: this is the latest from director Todd Haynes (I'm Not There; \"Carol\", Dark Waters\"). Here he explores uneasy relationship at call kinds of levels; actress Elisabeth and her subject matter Gracie; Gracie and her kids: Gracie and the community arounds her; Elisabeth and people close to Gracie, and so on. In spirit this movie reminds me of \"Carole\", a deeply moving love story, and one cold say that the same is true of \"May December\", albeit in a very different way. If you are expecting a lot of drama and plot twists, you are bound to be disappointed. This is a study of human behavior, and in the end yet another fine film by Todd Haynes, in my book one of the top Hollywood directors of his era. Leads Juliana Moore (as Elizabeth) and Natalie Portman (as Elizabeth) are in great for,. (Is it just me but as Portman, now 42, ages, she resembles Julia Roberts more and more.)\"May December\" premiered at this year's Cannes Film Festival to immediate critical acclaim, and there is good reason this movie is currently rated 92% certified Fresh on Rotten Tomatoes. After a brief US theatrical run in select cities, the movie started streaming on Netflix just this weekend, which is where I caught it. If you liked Todd Haynes' earlier work, or simply are a fan of either Natalie Portman or Julianna Moore, I'd readily suggest you check this out, and draw your own conclusion.",
    "108": "May December is the type of film that advertises itself as something but feels different when you watch it. That's honestly neither a negative nor positive here because the marketing for this film felt odd. For such a wild storyline, I found myself wondering if anything pivotal or important was ever going to be revealed, but it just wasn't. I'm perplexed by this film but I would still love to deliver my thoughts. Here is why I both liked and disliked May December all at the same time.Gracie (Julianne Moore) and her husband Joe (Charles Melton) are living their lives together, after their historic, frowned upon past. She had a child with him back when she was an adult and he was in the seventh grade. Flash forward 20 years and now a film is about to be made about their lives. Elizabeth (Natalie Portman) enters the picture as someone who wishes to study them because she is about to play the role of Gracie in the film. Natalie Portman is easily the standout of this film, as I believe she was acting circles around everyone else. I found Moore's performance to be good, just a little hollow at times. This was a strange watch for me overall though.This story can be uncomfortable to watch, especially if you know that it's loosely based on a real scandal from about 30 years ago. I was just going along with it, trying to ignore that the story itself is just wrong, and hoping for some kind of satisfying conclusion to it all. Sadly, the film has no such ending. I'm all for films not having finality, but there's really not much of a story here in my opinion and then it sort of just ends. I felt there was much more that could've been explored with these character's lives. I guess I would use the word underwhelming, even though it's a well-made movie overall.I now have a firm stance on director Todd Haynes. Whether you're talking about his solid direction on the film Carol or his producer credit on the film Night Moves, the projects he's involved in usually don't land well with me. I think his direction is good and he always brings out great performances in his cast, and even though most of his films are critically well-received, maybe his storytelling just isn't for me. I've seen a few films from him now and I have always been both intrigued and underwhelmed with all of them. May December is now streaming on Netflix and the majority of people are really liking it, so maybe you will too. It just wasn't for me, and that's okay, I'll still give Hayne's next film a shot.",
    "109": "May December (2023) is a Netflix film about an actress who visits a woman she's about to play in a movie. The woman is infamous for serving a 5-year jail term for molesting a 13-year-old boy when she was 36. When she gets out of jail, she marries the kid. 20 years later, they are still married and about to celebrate the high school graduations of their twins (they have another kid a year older). But something is roiling beneath the seemingly placid waters.Natalie Portman plays the actress who gets a little too involved in her study of the woman and family. Julianne Moore plays the woman approaching 60 whose OTHER family still lives nearby and her kids from THAT marriage were classmates of her current husband. Quite the mess.While neither Portman nor Moore are favorites of mine, they both turn in good performances and play complex characters. The child groom is played by Charles Melton. Maybe an awards contender in the upcoming season, Melton's performance is wildly overrated.",
    "110": "For some people, they struggle to sleep after watching horror films. For me, I struggle to sleep after watching films like May December.The premise hooked me in from the start: it seemed like it would be a camp thriller flick about a tabloid scandal, but instead it ended up being a thought-provoking piece on sexual assault and tropes in the media that have become far too normal.I never would have guessed that in a film with A-listers like Portman and Moore it would be Charles Melton's performance that struck me the most. I'm glad he could break free from the type-cast of Riverdale and the constraints of that script to showcase his talents because in reality the film centres around him. And he carries it indeed.The ending was definitely satisfying for me - it showcases the dangers of method acting but also being consumed by the media and how it pushes tropes onto the consumer without highlighting the severity. There is space for contempt, but also for understanding - this is a line that director Todd Haynes walks along very skilfully.",
    "111": "I have enjoyed various works Todd Haynes' work with \"Safe\" being my favorite of his. This movie is sickening, dark mixed with non-serious tones, and thought-provoking with strong performances, direction, writing, and characters throughout. The camerawork, production, and the atmosphere is really good as it helped bring the essence of the atmosphere and setting. With the narrative being loosely based on the story of Mary Kay Letourneau, the writing could have been sloppy but the writing from Samy Burch was well-executed as the writing explored interesting themes and dramatic elements. Some may say this could be exploitive but I disagree. A movie that is exploitive would be something like \"Blonde\" or \"The Passion of the Christ\". Hayne's direction on the narrative is great as it's clear the movie doesn't take itself too seriously that perfectly blends the dark humor, melodramatic tones, and atmosphere well together.The characters are pretty interesting as they provide some interesting insights and situations of the narrative. The performances are fantastic as Natalie Portman and Julianne Moore are amazing with good dialogue provided for their roles. Charles Melton actually stands out the most as Melton gave a great performance of his character with emotions and energy. The soundtrack and many of the technical elements are great.It's definitely not going to be for everyone but this is one of Todd Hayne's best works in a while.",
    "112": "An intense and at times quite disturbing look at the damage wrought upon a family by an abusive and controlling mother. Certainly a departure for director Todd Haynes who, in such previous works as \"Carol\", \"Far From Heaven\" and \"Safe\", has treated his female protagonists with great sympathy, if not outright feminism. And a not completely successful departure, in my opinion. But first let us look at thhis film's main virtues, the character of Joe and the performance of the actor who plays him, Charles Melton. What a powerful study in arrested development! As presented in Samy Burch's perceptive screenplay and Melton's sensitive performance we are basically given a thirty six year old teenager. A dad who acts around his kids like a sibling more than a parent. A husband who is quietly bossed around and told what to do by his wife, treated by her pretty much as he was when their relationship started, in junior high school. We witness Joe's passivity and then his frustration at his impotent efforts to grow up and break out of his cocoon. And our pity is aroused as well as our anger toward his wife, the very damaged Gracie. And it is with this character that the film's primary flaw is shown, in my opinion. Despite a fine performance by the always good Julianne Moore Gracie is too much a caricature of the sort that Davis and Crawford played in the 40s and 50s, a devious, manipulative monster. It isn't enough that she infantilizes her spouse or controls her kids. She has to go and kill foxes on her daughter's graduation day! And fat shame her daughter, as well. In short, we are, in Gracie's scenes, perilously close to the world of Mommie Dearest camp. Does this film ever cross the line? I'll leave it to you to decide. Give it a B plus, mostly for Melton, as well as Haynes' adept pacing (the previous reviewers who say this film is slow must have been raised by wolves who watched \"Fast And Furious\" films), Natalie Portman's fine satiric portrayal of an insincere actor promising a \"sensitive\" take on Gracie and delivering just the opposite, and Christopher Blauvelt's beautiful but ever so faintly noir-ish cinematography which allows Haynes to do what he does best, namely take a post card pretty surface and expose the ugliness underneath.",
    "113": "Todd Haynes' sexual-abuse psychodrama May December is the sort of film whose hype and concomitant words of praise may seem bizarre to some people, namely those who only understand cinema as simple pastime/entertainment:Reviewers commend the film for being the most skin-crawling and uneasy picture of the year. If that doesn't sound too appealing, or even sane (even though it's perfectly sensible to judge a film based on how well it achieves what it sets out to do), there are numerous other reasons you should see it -- its 35mm cinematography is a joy to behold (though I concur with the critics who say Haynes' 2015 Carol looked better), its music is deliciously unnerving, and its symbolism is often brilliant.Another reason to give this film its due attention is, of course, the performances. Julianne Moore and Natalie Portman (who definitely deserves to have her true talents on display after the Thor 4 fiasco) are as fantastic as they ever were, but the most head-turning performance in the film is no doubt that of Charles Melton. And no, it's not just a matter of critics being surprised that one of the Riverdale kids can act.It may be the fault of all this hype and praise that, in spite of all the things I loved about this film (on top of generally agreeing more with the positive reviews than the negative ones), I also somehow found it a touch underwhelming; the ending, in particular, lacked a certain punch for me. A lot of the confusion and dissatisfaction that detractors express about this narrative is, I suppose, by design -- it's thematically relevant that we aren't supplied with all the answers. Yet, I feel like the lack of a \"real\" payoff is a disservice to this film, as is the fact that we only learn so much about its characters.Other reviews helped me see the point of the ending more and here's the part you'll want to skip if you don't want spoilers! (I'd also recommend not going on Twitter since users are particularly non-shy about spoiling this film for some reason.) We learn that Portman's character -- herself an actor in-universe -- did all this method-actor research for a schmaltzy stinker that reduces the experiences of grooming victim Joe Yoo into what's essentially a soap opera. Many critics have likened the movie to last year's Tr, mainly because of its subject matter and immaculate performances (though I would argue the characterization of Lydia Tr is more intriguing and that hers is easily the better, more haunting film), but also because of the Reveal of its ending.One reason the ending of May December didn't stick out to me, certainly not on the same level as that of Tr, is probably because the \"joke\" was expected; it didn't surprise me that the movie-within-the-movie was bad and had hokey acting. Something more could have been done to bolster this finale as a final word on the way we treat abuse stories; an in-universe final joke at Joe's expense. Clearly, it still worked for a good chunk of viewers, but I would offer that there's a reason I'm far from the only one who felt underserved when the movie ended.I will continue to hold its key moments in high regard and root for its cast, particularly Portman, as Oscar season draws near. But because of some of my notes on the ending and the fact that its first third is a bit too slow for its own good, revisiting it is a \"maybe\" for now.One more thing, though: Tr and May December may indeed be equivalent movies in terms of \"importance\", namely in the sense that their themes and subject matters, coupled with the fact that both films are as popular and talked-about as they are, might cure the post-Tumblr \"gender-wars brain\" that many people still suffer from but are starting to overcome. Over the years (whether you want to pin it squarely on the 2016 election, that one \"gamer\" debacle, or whatever else), too many people have subscribed to the idea that those who look like X are always guilty and those who look like Y are always victims, and that this is the extent of how complicated things are/always were. Tr, then, was the gateway drug -- bluntly showing that powerful groomers/abusers can sometimes be women -- whilst May December reveals that, yes, sometimes those on the receiving end are men and it sucks just as much then. Anyways, keep those lol-random Letterboxd blurbs coming.",
    "114": "\"It's the complexity. It's the moral grey areas that are interesting.\"To me, this is this year's Tr. An immaculate character drama, a nuanced psychological study of grey characters. Todd Haynes does an exceptional work in telling this story. The screenplay is as good as tight as it gets. The actors are at their best as we get 3 of the best acting performances of the year. The final result is this masterpiece named May December.Is the movie boring? Yes, but not if you can keep attention and observe how subtly each scene has so much to say. It's a narrative that demands concentration in order to be appreciated. The way it slowly reveals key points of the couple's story is masterful.I absolutely loved the camera work here. The lighting, the blocking shots, the mirror shots (some of the best scenes in the film); it's fascinating. And a special mention to the score. It's not a sophisticated or epic musical piece that will be considered among the best in the business, but it is just perfect for this film. The tune is not just addictive, but it also captures the uneasy tone of the film perfectly.And the acting obviously deserves a lot of praise. Julian Moore and Natalie Portman are great as always. The first half of this movie is just a talent showcase for these two. Portman brings her Black Swan energy into this. But Charles Melton was the star that shines the brightest in the latter half. A heart wrenching performance from him.To sum it up, it's just amazing craftsmanship involved in every aspect of this film.\"I'm secure. Make sure you put that in there.\"",
    "115": "Some actors do get an opportunity to meet and talk to the characters they are required to play in a movie under production. This is one such story where Elizabeth Berry ( Natalie Portman) a movie actress visits the home of middle aged Gracie Atherton ( Julianne Moore) who lives with her husband and three teen aged children and who is the central character of the planned movie. Gracie has had a tumultuous past where she at the age of 36 years had a brief amorous encounter with a 13 year old Korean boy Joe ( Charles Melton) which resulted in adverse publicity and gave her prison time. Some years later she marries Joe and settles down. (The title of the movie is interesting because it refers to a marriage where the age gap between the partners is considerable like 23 years as in this case. May refers to the younger partner and December to the elder.).The movie is a complex slow burner which periodically drags, meanders and sometimes lacks direction. Thanks to the excellent performances of Natalie, Julianne and Charles the narrative remains interesting enough to sit through. Director Todd Haynes could have made the movie gripping with the fairly taut screenplay available but it doesn't happen. His penchant for static camera and long duration shots doesn't help. A few impressive scenes. Natalie by herself recreates the encounter as it may have happened. In the QA session Natalie answers how mechanically intimate scenes are filmed.( Ironically she enacts a similar scene in this movie). Joe's hobby of maintaining butterflies is shown well and the butterfly emerging from the chrysalis looks nice. A good word for the melodious piano tunes played out in the BGM which beautifully matches the theme of the movie.",
    "116": "Where to start? Well I'll say upfront this was one of the most disappointing films I've seen in recent times.Let's start with some positives though. Natalie Portman and Julianne Moore are both brilliant, but then let's face it they're great in everything aren't they?! It's also a unique idea. However that's where the compliments end.This is one of those films where you get to the end and you wonder why on earth you wasted your time watching it. Don't really understand what the point was, what they were trying to say, why they picked such a weird subject matter, etc etc. Script was also a bit boring, and for a drama there strangely wasn't enough err... drama!Oh well, both actresses have made so many great films I'll watch those instead in the future.",
    "117": "Is it just me, or is Todd Haynes a Douglas Sirk fan? Because with his new film, May December, he has brought about the return of the melodrama in a way that feels like a homage to the films of Sirk. A melodramatic campy satire on tabloid stories, character studies, crime docs, and specifically Method Acting. Todd Haynes really delivers with something so unexpected, walking a tightrope in executing a distinct tone for this deeply uncomfortable story. It's darkly comic and tragic, but also sly and cerebral in its approach. Very good stuff. Haynes has made a beautiful, terrible nesting doll of a film with a uniquely twisted core. Beneath the droll portrait of an actor's obsession with her muse is an unsettling tale of what happens when people refuse to tell the truth.This movie explores the deepest, most unspoken layers in each of its characters. Pitting the stories they tell themselves about who they are against an elusive truth, observing how they break down when confronted with just the suggestion of a reality that breaks their narrative. I love filmmaking that allows the actors to tell a different story than the dialogue. May December puts you on your toes, watching every move of these characters, and the actors reward the audience for paying close attention. There are so many small lines of dialogue or subtle glances that make your skin crawl - you're truly never sure what each character is thinking. Every moment is filled with \"they say one thing, but mean another\" tension. It's a movie with many layers, spanning generations and motivations, that bears thinking about and certainly re-watching. It goes without saying that this script is incredible!Natalie Portman and Julianne Moore are sensational, but Charles Melton managed to stand out from the two actresses with a sincere standout performance in a tricky role. Portman and Moore fight for control in this tale of abuse and celebrity, but Charles Melton, playing a man frozen in time as a young boy, steals the show in a vulnerable, heartbreaking fashion. Three of the greatest performances of the year.As a whole, May December is intoxicating, deeply upsetting, and funny in ways that contradict the sickly interior of the film's genre boundaries. The score goes immensely hard in its theatricality- I loved it. Haynes lets us sit in the truth of the situation. No matter what occurred in the past, there's still considerable tension to explore in each relationship. How he exploits those tensions is what makes Haynes a master. It's a film ripe for rewatching and exploration of every detail. Lots to unpack and think about, and that's what makes it great!",
    "118": "So, I just finished \"May December\" on Netflix, and honestly, it's one of those films that really makes you sit up and pay attention. The way the director, Todd Haynes, captures the everyday life with a sort of haunting twist is something else. You've got Natalie Portman, who absolutely nails her role as Elizabeth, this actress trying to delve into Julianne Moore's character, Gracie. The story itself is heavy, dealing with past relationships and moral complexities that don't give easy answers.What's really striking is how the film plays with perceptions. One minute, you think you've got Elizabeth figured out, and then the next, you're questioning everything. Julianne Moore as Gracie is phenomenal - she brings a depth to her character that's both unsettling and captivating. The way the film portrays their lives in Savannah, with its dream-like quality, adds another layer to the whole experience.And let's talk about the background score and cinematography. They're not just there for show; they add to the mood, almost becoming characters themselves. The historical tours in the background, for instance, add this eerie sense of history and tragedy lingering just out of sight.This isn't just a movie; it's an experience that challenges you to think and re-think. It's the kind of film that stays with you, makes you question things. Definitely worth the watch, especially if you're into films that aren't just black and white but explore the grey areas of life and relationships. For anyone scrolling through Netflix looking for something that's not just your run-of-the-mill film, \"May December\" is it. M.",
    "119": "Another heavy-hitter from the maestro of a certain type, Todd Haynes, again capitalizing by collaborating with his muse from the start, the amazing Julianne Moore. Their earliest collaboration, Safe (1995), blew my mind (and my girlfriend's...I think she said to me less than a week ago that she considers it her favorite movie now), so I had a lot of faith that this would be another very special and probably very heavy experience. It fully lived up to that expectation, and surpassed it.Everyone is hyping up Charles Melton's performance, and with good reason - he does give the strongest of the batch, but it's this perfect trifecta of trouble that makes this film function so well. It is jarring but very effective seeing Natalie Portman play one of her only \"alluring but mostly unlikable\" characters, which to my knowledge, she has not done since one of her most memorable movies, Closer. It's the way all 3 of the primary cast members bounce off of and around each other's character's problems and/or vulnerabilities that make this movie so magical (it's a dark kind of magic though).While I've seen a handful of films that focus on an older character being attracted to someone that's way too young, I've definitely never seen one that focuses on the elements this does. It's hyper-real, and the way it finds balance between such an unsubtle plot with such subtle storytelling is very impressive. Then there's the whole psuedo-meta element with Portman's character being an actress who's hanging out with Moore's in order to study her so she can play her in an upcoming film...there's plenty of movies about a movie, but there's more layers to this - it's definitely way more complex than Inception...................I was rather surprised how sour some of these characters turned. Threw me for a loop, in a good way. Moore really is one of the contemporary queens of unhinged, when she is hired to go there. All in all, this is a stupendous showcase of acting, storytelling, and filmmaking. Just a really good movie, but a very heavy one, not for the faint of heart.",
    "120": "I am really not sure what to say about May December - Natalie Portman was so good in her role, as was Julianne Moore, however it just felt like it was lacking something. The music effects were over the top and in my mind completely not necessary, they were very cringe and off putting. It would have been better if they had used a more subtle undertone and allowed the actors to convey the necessary drama.The story is of a mature ages married woman (Moore) who grooms a young seventh grade student who works in the pet shop that she manages. The even was splashed all over the papers and resulted in Moore's character going to prison, but the romance continued and she fell pregnant and they eventually married. Portman plays an actress who is going to play the character and is there to study her for a movie role.I think overall it was an interesting film, and really highlighted the damage caused especially for the young man Joe.",
    "121": "That line is spoken by one of the characters in the film and it not only describes the specific situation in which it is said, but is an excellent summary of the film itself. In other words, there really isn't a story here, and those looking for a plot and dramatic scenario will likely be frustrated. On the other hand, if one is interested in the use of cinema to reveal many of the paradoxes of day to day living, then this beautifully acted film has much to offer. Among the numerous complexities this film addresses with unfailing tonal accuracy are:\n. How a single personality can be alternatively fragile and steely.. How \"the past isn't over, the past isn't even the past.\"\n. How \"mixed families\" (siblings and half-siblings) navigate the often uncomfortable situations when everyone is in the same room.. How some people can be amoral in their excessive manipulation of others.If these concepts are of interest, check this fine film out; if not, it won't be your cup of tea.",
    "122": "From the first couple of scenes May to December starts to intrigue. The young man is chastised for having his second beer, then kissed on the lips. It sets out the stall for an excellent thoughtful film, as the outcome an eighteen year old scandal.Resisting the temptation to be salacious, the film lets the viewer develop an opinion on the morality of the relationship, but that changes as we meet more characters and see how they have been affected.Natalie Portman has grown into an excellent actress, able to carry a character who uses her talent to win the trust of the other adults, but leaves the children suspicious. She wheedles her way into the family to get to grips with the motivations of the Julienne Moore character.As the director peels off the layers we see that the surface level acceptance of the strange and illegal relationship is covering up a multitude of factors that would give therapists a field day .",
    "123": "Joe Yoo (Charles Melton) and Gracie (Julianne Moore) seem to be happily married in a May to December romance. They welcome famed actress Elizabeth Berry (Natalie Portman) who is making a movie about their lives. She interviews their friends and family to get inside the original scandal. She was a middle age woman when she had the affair with a 13 year old Joe.This is a ripped-from-the-headlines story using the Mary Kay Letourneau scandal as the jumping off point. Right from the start, this feels like an icky situation shown in a glowing sunlit summer vacation. People are talking about the situation and around it. It's passive aggressive. It's like playing around with a poisonous snake. I didn't really know what the movie is trying to do. Eventually, there is the one scene with Joe and Gracie which pulls everything into focus. I really love Melton. Moore and Portman are being their award winning acting selves. This is going to be a critical awards darling for this year. I certainly love everybody's work but I don't know if I actually love the movie. It's fascinating. I just kept thinking that she had sex with a boy. I wanted someone to explode and maybe that's why I love that one scene.",
    "124": "That theme song. It's so gigantic, so ominous. Absurd even. The haunting hammered hymn of dissonance bookends every scene, looming around each set of interactions. Midway through the film, as it played for like the umpteenth time, it occurred to me- this theme song is a character, too. The music hovers over the couple (and the actress) like an evil spirit that's always sneering, quite sarcastically,' you've done nothing wrong 'I must admit I was reluctant to stick it out until the bitter end (it's not often a pleasant film, and many scenes go beyond cringe), but it was certainly a rewarding challenge, and I am glad I committed and got to experience the full impact.This movie is for fans of demanding stories about severely damaged people working through psychological trauma in the only way they understand, such as: Rose Plays Julie, Mysterious Skin, Elle, Serenity (2019), First Reformed, & Snow Angels. . . If you find these kinds of films enjoyable, then I think you'll find something to resonate with in May December, it hits pretty hard. Ok, please be safe out there, I love you, hope you have a nice breakfast, even if it's night!",
    "125": "I can't convey how much joy I get from seeing veteran actors play their respective parts with such conviction and maturity.More than the narrative and the real-life case on which it is largely centered, I became preoccupied with watching Portman and Moore pour their souls out on-screen, which was an amazing delight for someone who enjoys superior acting skills.And I have to give a shout out to the director, Todd Haynes, who did a superb job of keeping everything together and functioning smoothly throughout.He placed a strong emphasis on the main characters, allowing them to breathe and for their personalities to emerge, which is something I value immensely in any movie, let alone one designed particularly for the goal of enunciating complex characters with their complex emotions.Having said that, I still have some reservations about the writing, notably the final act and its 'less explosive', 'less explicit' mood & tone.Following such a powerful second act, with gradually increasing tension and anticipation of and between the characters, I expected a more dramatic denouement, which I did not get, therefore I wasn't totally satisfied with the climax.",
    "126": "I'm not sure why we're supposed to believe that Natalie Portman is a 36 year old when she looks 45 with that sunken in face and stringy thin hair, but it was fairly distracting to watch her in all those close ups. Were they really stooping that low to make her look so much older in order to create more sympathy for a teenage boy who would only be so glad to sleep with any woman at all? We'll never know because the point of the movie is never determined. It's your usual cliche of women are crazy and controlling (though not untrue, we're more dynamic than that), and men have no personalities.This movie shouldn't be nearly as long as it is considering nothing actually happens. It was quite boring and Natalie's odd sounding lisp throughout the movie was too much to put up with for that run time. I've always been a fan of hers and Julianne's, but this almost felt like the TV movie she looked to be making. I'm not sure why it's getting rated so well when the actors had little material to work with and ironically none of us knew much truth about any of them at the end.",
    "127": "There are two quite compelling storylines playing out inside May December--both supported by excellent acting. Unfortunately, instead of picking one approach and sticking with it, director Todd Haynes goes back-and-forth between the two to the detriment of the entire production.For a very basic overview, May December tells the story of Gracie (Julianne Moore), a now middle-aged woman once notorious for an affair with a 13-year old boy--Joe (Charles Melton)--she is now married to. When actress Elizabeth (Natalie Portman) comes around to do some research for the upcoming film about the saga, both parties end up a bit shaken and shocked at the emotional scars still lingering.Had this movie really honed in on the Gracie and Joe relationship, I think it would have been better overall. Why? Because there were some very interesting themes and character dynamics present in this thread. Who initiated the large age-difference fling? Why are they still together? What happens when their children move out soon? Are they just play-acting as a couple? This is all really compelling stuff and is heartily supported by some great dramatic turns from Moore and Melton.Conversely, had this film been almost entirely about Portman's character it also would have had a better shot to be great. Is Elizabeth really trying to understand the odd circumstances--or just use them for her thespian advantage? Is she in any way capturing the \"real\" Gracie and Joe? Her going around town to converse with people about the situation provides some of the best scenes of May December.Sadly, this movie tries to make both of these films at once and is the worse for it. Instead of feeling it to be more rich, I instead came away unsatisfied with all the angles.So, in my final reckoning I can only give May December a right-down-the-middle 5/10 rating. It has all the trappings of a really solid, meaningful drama but lacks the focus to make anything of it add up to much in the endgame.",
    "128": "First off, Natalie Portman is great in this and will probably get an Oscar nomination. Everyone else does a decent job.The issue with the movie are it's languid style, long cuts, sparing editing technique....as if Todd Haynes wanted to show off the actors and not the story.The story is interesting, but rather than concentrating on that we get these languorous takes and monologues. Portman was a producer, so, small wonder.I would have preferred to have a coherent plot, consequences of actions and effect on the characters and community established way before the 'hey look at me' school of acting.In short. It's a a bit meh.",
    "129": "Todd Haynes' 'stranger that fiction' fictionalized version of the Mary Kay Letourneau case is a stylish, if quixotic, take which explores the question of what is the truth where only two people truly know what happened.Natalie Portman plays \"Hollywood star\" Elizabeth who is researching her role as Gracie (Julianne Moore), an older woman who, 20 years prior, seduced the then teenage Joe (Charles Melton) while in prison (where she also bore their baby). Elizabeth has been released and is raising their now three children in the same town that the scandal took place. The fact that they still reside there causes everyone around them to walk on eggshells.Haynes and screenwriter Samy Burch (Alex Mechanik has co-story credit) take a sideways view of the case with a tricky POV that includes both 'real' and 'reel' life. Elizabeth isn't your usual actress meeting her subject for a simple coffee and a chat. She embeds herself with Gracie and the family. The line between them isn't just blurred - it's obliterated. Haynes and cinematographer Christopher Blauvelt quite consciously sets up a duality straight out of Bergman's PERSONA.As interesting as that connection is, the one between Gracie and Joe is just as fascinating. Just who is the 'grown up' in the marriage is in question, as is one about who is really in 'control'. The movie never fully answers it - but, that's seems part of Haynes' intent here (one particularly dastardly development is brought up, but cleverly left hanging). The parallel story of Elizabeth's movie adds yet another layer of matching storytelling (amusingly, there is also a prior 'TV Movie' adaptation of Gracie's story that pops up in conversation, complete with clips). Elizabeth's is an \"Indie Film\" - so, it must have more integrity! The script clearly enjoys taking shots at the industry, even if one never fully believes in the movie within a movie set-up.Added to the mix is Haynes' penchant for melodrama, most exemplified here by the use of Michel Legrand's very emphatic score for THE GO-BETWEEN (Marcelo Zavros did the adaptation as well as original music). Much of the dialogue is also quite explicitly on point and overheated. Where MAY DECEMBER has issues is that it never resolves it's own thesis - if it has one at all. Several intriguing notions are brought out, but doesn't satisfactorily them. Entirely enjoyable on a surface level, and the main acting trio is exemplary, but it's still a relatively minor work in Haynes' filmography which includes such fine films as and FAR FROM HEAVEN, WONDERSTRUCK and CAROL (which shares some DNA with this one).",
    "130": "One of my chief with the film industry is fulfilled with this movie. Writers and performers are so vapid to believe that telling a story is that much better when told through their own eyes. Against my better judgement, I opted to watch this knowing they break one of my cardinal rules. Ie it's like one of those shows about a show being made. Ugh. To any script writer who may be writing this: folks in the film industry don't have some special fascinating way of seeing things. It's because your world view is so singular that your industry keeps buying these things up thinking they're brilliant. Someone fairly prominate in the industry once used a term I hate just as much to describe lazy film making: navel gazing. This movie totally lost itself by focussing too much on this.Anyways...back to this film...it's about an actress. And the story we would be interested in is actually only secondary to Natalie Portman's narcissistic (character's) story line. It should have been the opposite.I would have loved to whole film, with the weird music punctuation and absurdities without making it wholly about the film industry.I didn't expect this to be such a dramatic film. Kept my attention. I wish this story had been told with more justice.",
    "131": "May December is a brave movie taking on a complicated real life story and weaves a complex narrative to revisit the past from a different perspective. The characters are complex and revisiting the incidents from 20 years back being back unpleasant memories hidden within the subconscious mind. It allows characters who were not present during the incident (new neighbors, kids from the marriage) to express their feelings.Strong performances by Natalie Portman and Julianna Moore supported by and excellent supporting cast.It is a great approach to take a hyped up tabloid story and bring out the human angle for all the protagonists as they lived and survived the scandal.I really loved the strong ending as Natalie brings out the emotions which she has absorbed thru first hand experience.",
    "132": "Overall, its by the numbers drama that does not try to dampen the real problem of a May December affair - which is good. It is written like a Disney film with a surprise villain discovery ending.Loved the performance of Melton. He is the star in this film as the slowly crumbling avatar of Vili Fualaau. His role is very meaty and has the most 'growth' but I do not think that he will be a shoe-in yet for the nominations.Portman's plays an actress character that goes and act like an empty paper but she knows damn well her reasons and tries to act like she's playing everyone like a fiddle. Moore's Gracie is unsubtly displayed as controlling and insecure to the core. She tries to hide any shame by acting as if there is nothing to be ashamed off. Both were great but I felt their characters could have definitely been more nuanced and much more sinister. They were almost caricatures at some point.Overall, a well made film with a script that I wished tried to go for it. This felt too SAFE and for awards contention specifically. This could gone harder and much darker with how messy the relationship is.",
    "133": "I don't know how this is a comedy. This is the story of a woman who met a boy when he was in second grade and she groomed him to become her lover then father of her 3 kids by the time he was 15. I kept going back to this fact while i watched this cringe movie. You know there's something wrong in Hollywood when they wrap up a horrifying story in shiny wrapping paper and sell it to us as a dark comedy. I kept thinking what if the main character was a man and the boy was a girl? Would the movie still be considered a comedy? Wouldn't ppl be outraged ? They should be about this.Beyond that this is a dull and depressing movie. Portman is the quasi detective trying to understand why Benning is the way she is. Benning portrays Gracie as a quirky oddball rather than a predator. Melton is a non entity who in one moment seems to grasp his childhood was stolen away as he talks to his son after smoking weed. There's a cast of creepy family and neighbors (who were told at one point love the Gracie ( the predator--keep in mind ) so much! What???!! Is this the village from children of the corn?). The movie ends looking like a bad porno. Boring. Awful. And sad to see a movie portray a sexual predator with kid gloves.",
    "134": "Joe Yoo (Charles Melton) and Gracie (Julianne Moore) seem to be happily married in a May to December romance. They welcome famed actress Elizabeth Berry (Natalie Portman) who is making a movie about their lives. She interviews their friends and family to get inside the original scandal. She was a middle age woman when she had the affair with a 13 year old Joe.This is a ripped-from-the-headlines story using the Mary Kay Letourneau scandal as the jumping off point. Right from the start, this feels like an icky situation shown in a glowing sunlit summer vacation. People are talking about the situation and around it. It's passive aggressive. It's like playing around with a poisonous snake. I didn't really know what the movie is trying to do. Eventually, there is the one scene with Joe and Gracie which pulls everything into focus. I really love Melton. Moore and Portman are being their award winning acting selves. This is going to be a critical awards darling for this year. I certainly love everybody's work but I don't know if I actually love the movie. It's fascinating. I just kept thinking that she had sex with a boy. I wanted someone to explode and maybe that's why I love that one scene.",
    "135": "That theme song. It's so gigantic, so ominous. Absurd even. The haunting hammered hymn of dissonance bookends every scene, looming around each set of interactions. Midway through the film, as it played for like the umpteenth time, it occurred to me- this theme song is a character, too. The music hovers over the couple (and the actress) like an evil spirit that's always sneering, quite sarcastically,' you've done nothing wrong 'I must admit I was reluctant to stick it out until the bitter end (it's not often a pleasant film, and many scenes go beyond cringe), but it was certainly a rewarding challenge, and I am glad I committed and got to experience the full impact.This movie is for fans of demanding stories about severely damaged people working through psychological trauma in the only way they understand, such as: Rose Plays Julie, Mysterious Skin, Elle, Serenity (2019), First Reformed, & Snow Angels. . . If you find these kinds of films enjoyable, then I think you'll find something to resonate with in May December, it hits pretty hard. Ok, please be safe out there, I love you, hope you have a nice breakfast, even if it's night!",
    "136": "I can't convey how much joy I get from seeing veteran actors play their respective parts with such conviction and maturity.More than the narrative and the real-life case on which it is largely centered, I became preoccupied with watching Portman and Moore pour their souls out on-screen, which was an amazing delight for someone who enjoys superior acting skills.And I have to give a shout out to the director, Todd Haynes, who did a superb job of keeping everything together and functioning smoothly throughout.He placed a strong emphasis on the main characters, allowing them to breathe and for their personalities to emerge, which is something I value immensely in any movie, let alone one designed particularly for the goal of enunciating complex characters with their complex emotions.Having said that, I still have some reservations about the writing, notably the final act and its 'less explosive', 'less explicit' mood & tone.Following such a powerful second act, with gradually increasing tension and anticipation of and between the characters, I expected a more dramatic denouement, which I did not get, therefore I wasn't totally satisfied with the climax.",
    "137": "I'm not sure why we're supposed to believe that Natalie Portman is a 36 year old when she looks 45 with that sunken in face and stringy thin hair, but it was fairly distracting to watch her in all those close ups. Were they really stooping that low to make her look so much older in order to create more sympathy for a teenage boy who would only be so glad to sleep with any woman at all? We'll never know because the point of the movie is never determined. It's your usual cliche of women are crazy and controlling (though not untrue, we're more dynamic than that), and men have no personalities.This movie shouldn't be nearly as long as it is considering nothing actually happens. It was quite boring and Natalie's odd sounding lisp throughout the movie was too much to put up with for that run time. I've always been a fan of hers and Julianne's, but this almost felt like the TV movie she looked to be making. I'm not sure why it's getting rated so well when the actors had little material to work with and ironically none of us knew much truth about any of them at the end.",
    "138": "There are two quite compelling storylines playing out inside May December--both supported by excellent acting. Unfortunately, instead of picking one approach and sticking with it, director Todd Haynes goes back-and-forth between the two to the detriment of the entire production.For a very basic overview, May December tells the story of Gracie (Julianne Moore), a now middle-aged woman once notorious for an affair with a 13-year old boy--Joe (Charles Melton)--she is now married to. When actress Elizabeth (Natalie Portman) comes around to do some research for the upcoming film about the saga, both parties end up a bit shaken and shocked at the emotional scars still lingering.Had this movie really honed in on the Gracie and Joe relationship, I think it would have been better overall. Why? Because there were some very interesting themes and character dynamics present in this thread. Who initiated the large age-difference fling? Why are they still together? What happens when their children move out soon? Are they just play-acting as a couple? This is all really compelling stuff and is heartily supported by some great dramatic turns from Moore and Melton.Conversely, had this film been almost entirely about Portman's character it also would have had a better shot to be great. Is Elizabeth really trying to understand the odd circumstances--or just use them for her thespian advantage? Is she in any way capturing the \"real\" Gracie and Joe? Her going around town to converse with people about the situation provides some of the best scenes of May December.Sadly, this movie tries to make both of these films at once and is the worse for it. Instead of feeling it to be more rich, I instead came away unsatisfied with all the angles.So, in my final reckoning I can only give May December a right-down-the-middle 5/10 rating. It has all the trappings of a really solid, meaningful drama but lacks the focus to make anything of it add up to much in the endgame.",
    "139": "First off, Natalie Portman is great in this and will probably get an Oscar nomination. Everyone else does a decent job.The issue with the movie are it's languid style, long cuts, sparing editing technique....as if Todd Haynes wanted to show off the actors and not the story.The story is interesting, but rather than concentrating on that we get these languorous takes and monologues. Portman was a producer, so, small wonder.I would have preferred to have a coherent plot, consequences of actions and effect on the characters and community established way before the 'hey look at me' school of acting.In short. It's a a bit meh.",
    "140": "Todd Haynes' 'stranger that fiction' fictionalized version of the Mary Kay Letourneau case is a stylish, if quixotic, take which explores the question of what is the truth where only two people truly know what happened.Natalie Portman plays \"Hollywood star\" Elizabeth who is researching her role as Gracie (Julianne Moore), an older woman who, 20 years prior, seduced the then teenage Joe (Charles Melton) while in prison (where she also bore their baby). Elizabeth has been released and is raising their now three children in the same town that the scandal took place. The fact that they still reside there causes everyone around them to walk on eggshells.Haynes and screenwriter Samy Burch (Alex Mechanik has co-story credit) take a sideways view of the case with a tricky POV that includes both 'real' and 'reel' life. Elizabeth isn't your usual actress meeting her subject for a simple coffee and a chat. She embeds herself with Gracie and the family. The line between them isn't just blurred - it's obliterated. Haynes and cinematographer Christopher Blauvelt quite consciously sets up a duality straight out of Bergman's PERSONA.As interesting as that connection is, the one between Gracie and Joe is just as fascinating. Just who is the 'grown up' in the marriage is in question, as is one about who is really in 'control'. The movie never fully answers it - but, that's seems part of Haynes' intent here (one particularly dastardly development is brought up, but cleverly left hanging). The parallel story of Elizabeth's movie adds yet another layer of matching storytelling (amusingly, there is also a prior 'TV Movie' adaptation of Gracie's story that pops up in conversation, complete with clips). Elizabeth's is an \"Indie Film\" - so, it must have more integrity! The script clearly enjoys taking shots at the industry, even if one never fully believes in the movie within a movie set-up.Added to the mix is Haynes' penchant for melodrama, most exemplified here by the use of Michel Legrand's very emphatic score for THE GO-BETWEEN (Marcelo Zavros did the adaptation as well as original music). Much of the dialogue is also quite explicitly on point and overheated. Where MAY DECEMBER has issues is that it never resolves it's own thesis - if it has one at all. Several intriguing notions are brought out, but doesn't satisfactorily them. Entirely enjoyable on a surface level, and the main acting trio is exemplary, but it's still a relatively minor work in Haynes' filmography which includes such fine films as and FAR FROM HEAVEN, WONDERSTRUCK and CAROL (which shares some DNA with this one).",
    "141": "One of my chief with the film industry is fulfilled with this movie. Writers and performers are so vapid to believe that telling a story is that much better when told through their own eyes. Against my better judgement, I opted to watch this knowing they break one of my cardinal rules. Ie it's like one of those shows about a show being made. Ugh. To any script writer who may be writing this: folks in the film industry don't have some special fascinating way of seeing things. It's because your world view is so singular that your industry keeps buying these things up thinking they're brilliant. Someone fairly prominate in the industry once used a term I hate just as much to describe lazy film making: navel gazing. This movie totally lost itself by focussing too much on this.Anyways...back to this film...it's about an actress. And the story we would be interested in is actually only secondary to Natalie Portman's narcissistic (character's) story line. It should have been the opposite.I would have loved to whole film, with the weird music punctuation and absurdities without making it wholly about the film industry.I didn't expect this to be such a dramatic film. Kept my attention. I wish this story had been told with more justice.",
    "142": "May December is a brave movie taking on a complicated real life story and weaves a complex narrative to revisit the past from a different perspective. The characters are complex and revisiting the incidents from 20 years back being back unpleasant memories hidden within the subconscious mind. It allows characters who were not present during the incident (new neighbors, kids from the marriage) to express their feelings.Strong performances by Natalie Portman and Julianna Moore supported by and excellent supporting cast.It is a great approach to take a hyped up tabloid story and bring out the human angle for all the protagonists as they lived and survived the scandal.I really loved the strong ending as Natalie brings out the emotions which she has absorbed thru first hand experience.",
    "143": "Overall, its by the numbers drama that does not try to dampen the real problem of a May December affair - which is good. It is written like a Disney film with a surprise villain discovery ending.Loved the performance of Melton. He is the star in this film as the slowly crumbling avatar of Vili Fualaau. His role is very meaty and has the most 'growth' but I do not think that he will be a shoe-in yet for the nominations.Portman's plays an actress character that goes and act like an empty paper but she knows damn well her reasons and tries to act like she's playing everyone like a fiddle. Moore's Gracie is unsubtly displayed as controlling and insecure to the core. She tries to hide any shame by acting as if there is nothing to be ashamed off. Both were great but I felt their characters could have definitely been more nuanced and much more sinister. They were almost caricatures at some point.Overall, a well made film with a script that I wished tried to go for it. This felt too SAFE and for awards contention specifically. This could gone harder and much darker with how messy the relationship is.",
    "144": "I don't know how this is a comedy. This is the story of a woman who met a boy when he was in second grade and she groomed him to become her lover then father of her 3 kids by the time he was 15. I kept going back to this fact while i watched this cringe movie. You know there's something wrong in Hollywood when they wrap up a horrifying story in shiny wrapping paper and sell it to us as a dark comedy. I kept thinking what if the main character was a man and the boy was a girl? Would the movie still be considered a comedy? Wouldn't ppl be outraged ? They should be about this.Beyond that this is a dull and depressing movie. Portman is the quasi detective trying to understand why Benning is the way she is. Benning portrays Gracie as a quirky oddball rather than a predator. Melton is a non entity who in one moment seems to grasp his childhood was stolen away as he talks to his son after smoking weed. There's a cast of creepy family and neighbors (who were told at one point love the Gracie ( the predator--keep in mind ) so much! What???!! Is this the village from children of the corn?). The movie ends looking like a bad porno. Boring. Awful. And sad to see a movie portray a sexual predator with kid gloves.",
    "145": "Figuring out Todd Haynes' tone in Netflix's May December is just one of its many delights. Throw in two top-tier actors, Julienne Moore and Natalie Portman, and you are in for a challenging serio-comic film experience.The title pretty much tells us all we need to know with an older woman, Gracie (Moore), having married a much younger man, Joe Yoo (Charles Melton). As if that imbalance weren't enough, the couple became embroiled in tabloid fame.Into lives that seem tranquil enough comes the outsider, the character who changes things. Natalie Portman's TV actress, Elizabeth, visits to get a sense of Gracie as she plays her in an independent film about the scandal. Elizabeth gets to know the scene a bit too well visiting Joe at his hospital job as an X-ray technician. Artifice and reality begin to merge.Given that it's Natalie Portman playing Elizabeth and Joe's vulnerable as he was in the pet shop with Gracie, no wonder the original scandal takes wing again with a turn not likely to surprise anyone. It's director Todd Haynes's territory, where a character like Gracie is clueless to a certain extent, allowing the drama to take on comedic undertones where surprises about fellow human beings modeling soap opera characters ring true but no less dangerous than on the tellie.No scene is more telling about the juncture of reality and romance than when Elizabeth visits Gracie's daughter's high school acting class to equivocate about sexual pleasure during sex scenes. Coupling Haynes's naughty innuendos with Michel Legrand's overtly soap opera music, what seems like a developing tragedy repeating the tabloid circus in 1992 turns into a parody of ordinary folk played by actors who are ordinary themselves. Haynes hits human weaknesses universally.May December starts with a tabloid set up of older woman-very younger man to a more probing study of motives and maturity, wherein an older woman evades reality and a younger man begins to create his own. Not bad at all for comic melodrama.",
    "146": "After watching the movie, I initially thought to myself that despite its horrible everything besides some nice make-up!, the movie would garner at least 50% of any mumbo jumbo that it represents and that you can imagine.Well, after addition and subtraction, you see the result and I am surprised too. Throw the movie under an 18-wheel truck and tell Natalie Portman to skip producing / writing / directing whatever and stick to her \"memorable, powerfully bland\" acting even if she sheds some tears in the process of her everlasting grief and facial depression.One observation, when she smiles she irradiates and truly has a beautiful smile and she is not overrated, respectfully, to viewers who think so. It's the roles she chooses and the way she plays them that makes it seem so. Unfortunately, after nearly 30 years, she has not really improved, though she has learned some things here and there, mostly because of her biological clock.Screenplay/storyline/plots: 4.5Development: 6Realism: 5Entertainment: 1.5Acting: 6Filming/photography/cinematography: 5.5VFX: 2Music/score/sound: 6.5Depth: 2Logic: 1Flow: 1Comedy/drama: 1.5Ending: 2.5.",
    "147": "\"May December\" is a film that intricately weaves an atmospheric narrative reminiscent of the works of the legendary filmmaker Krzysztof Kieslowski. From the onset, the film envelops its audience in a rich tapestry of emotions and philosophical reflections, akin to the profound storytelling found in Kieslowski's masterpieces.The film's atmosphere is a testament to the director's keen eye for capturing the intricacies of human relationships and the subtleties of life. The ethereal quality of the scenes transports the viewer into a world where emotions linger in the air, much like the lingering themes found in Kieslowski's films.One striking parallel between \"May December\" and Kieslowski's oeuvre lies in the film's musical score. The music, carefully chosen and masterfully integrated, mirrors the haunting and evocative compositions often found in Kieslowski's works. The soundtrack becomes an integral part of the storytelling, creating a harmonious blend of visuals and sound that resonates with the soul.The narrative unfolds in a manner reminiscent of Kieslowski's exploration of the human condition. \"May December\" delves into the complexities of time, love, and the interconnectedness of lives, drawing inspiration from Kieslowski's thematic depth. The characters, much like those in Kieslowski's films, are portrayed with nuance and depth, allowing the audience to connect with their struggles and triumphs on a profound level.In essence, \"May December\" pays homage to Krzysztof Kieslowski cinematic legacy, capturing the essence of his storytelling prowess and philosophical reflections. It is a cinematic journey that invites viewers to reflect on the profound mysteries of life and love, leaving an indelible impression much like the films of the great Krzysztof.",
    "148": "Honestly this movie is not bad at all. It wasn't what I was expecting but I never hold that against a film. The only thing that probably drags the script down is that it struggles a bit in the first half hour or so, moving so slow as to almost be boring.It isn't until more than an hour in that the film is done playing with the superficially odd element of \"Hollywood actress is hanging out with our normal family to learn more about us\" and finally starts delving into the real core of the film; the aftermath of what began as a romantic relationship between a teacher in her 30s and a 13 year old student now that they are married with children.What remaining time is given to this, and to the gradual realization from Joe that his late childhood was basically stolen from him, is what really makes this film fascinating, along with the perpetual presence of Nathalie Portman's character Elizabeth, who is involving herself further and further into the family dynamic to the point where she would seem to be getting too close to them.But what really drags this film down as a whole is the goofy little piano cue that plays after almost every scene or dramatic moment. It is like something you'd hear in a parody of a soap opera, or in \"The Room\". It does not fit the tone of the movie at all and is cringeworthy in how goofy it is played.I thought after some time that this was possibly intentionally goofy in a satirical way, but as the film progresses you start to realize it isn't, they went with this goofy faux-soap opera piano cue. It is so bad I almost stopped watching completely.",
    "149": "You would think that delving into one of the most controversial and disturbing true life stories about CSA would lead to a deep narrative, but this movie takes all the wrong steps and sheds little light on our main characters.Overall the movie is extremely boring, with the cast inexplicably allowing Portman's character to wander around without notice and with very little judgement placed on an unforgivable relationship. Everyone stays quiet about explicit CA and even the abused barely registers the insanity of his predicament until he's 30 years old.It doesn't make sense that everyone enables this situation and ultimately it comes as no surprise that the abuser is entirely in denial that what she did was wrong. She's a bad person and we see this throughout the movie. Is that supposed to be surprising?A Teacher covered all of this thematic material in a much more interesting way and with more believable outcomes.Bad script, okay acting, no real purpose. Neither Poignant or Plausible."
}