{
    "0": "Greetings again from the darkness. We've all had that teacher. You know, the one with an evil streak who just seemed to thrive on making students miserable. Throw in a staff and administrators who feel the same way, and the casting choice for the teacher becomes obvious. Enter the always great and perfectly curmudgeonly Paul Giamatti. This is the first time Giamatti has worked with two-time Oscar winner Alexander Payne since their brilliant SIDEWAYS (2004), and it's clear these two share a wavelength for comedy and drama, even in throwback form.Paul Hunham (Giamatti) is a long-time professor at Barton Academy, an all-boys private prep school located in the snowy northeast. It's December 1970, and an early scene exemplifies how he relishes the failing grades he bestows upon desperate students so afraid to disappoint their rich parents. In the final class before the holiday break, the student-teacher banter doesn't go so well for the boys, and they head to break with an extra workload. Hunham is easily manipulated into babysitting the titular holdovers - students stuck at school over the break, while most others spend time with family, often on exotic trips.Initially there are five students, but after a certain development, what remains is Hunham, smart but troubled Angus Tully (first timer Dominic Sessa) and the school's head cook, Mary Lamb (a divine Da'Vine Joy Randolph, DOLEMITE IS MY NAME, 2019). Hunham is perpetually annoyed and has a weakness for booze. Angus is frustrated that his mother left him at school so she could travel with her new husband, and Mary is grieving over her son who was killed in Vietnam. Watching these three struggle to bond is a case study in psychology, yet of course we know they will ultimately form a family of misfits, depending on each other to offset the loneliness.The genius tagline for the film is \"Discomfort and Joy\", and initially the first overshadows the latter. Isolated from the world in their own way, the three characters begin to influence each other, showing broken/wounded people need and deserve love and friendship as much as anyone else. \"Entre nous\" (just between us) becomes a kind of calling card for this trio, and a Christmas party thrown by an eternally optimistic staffer (Carrie Preston) is a turning point.Giamatti is master of this material and only goes over the top a time or two. It's painful and humorous each time he is so anxious to infuse his breadth of ancient civilization facts into even the most mundane conversations. Newcomer Sessa possesses star potential and nails a complex first role. Da'Vine Joy Randolph's Mary is the heart of the film, doling out advice to Hunham and comfort to Angus. Depression is a vein running through these characters and it's acknowledged, though not the focus.This is Alexander Payne's first film since the disappointing DOWNSIZING (2017), but his brilliance has been proven in ABOUT SCHMIDT (2002), SIDEWAYS (2004), THE DESCENDANTS (2011), and NEBRASKA (2013). This time he's working from a screenplay by successful TV writer, David Hemingson, and though there is never much suspense about where the story or characters are headed, we enjoy the ride immensely. Cinematography from Eigil Byrld (IN BRUGES, 2008), perfectly complements the emotions (shot on digital, graininess added in post), and the soundtrack is period-specific, including the great Cat Stevens. Pay attention to the retro opening credits and logos, and enjoy a smart and funny film (an Alexander Payne trademark).Opening in theaters November 10, 2023.",
    "1": "Now here's a film with a life affirming theme, that should encourage most viewers to think of their dreams, and shovel away all their cloaks, inhibitions, and open fresh doors to their heart's intuitions; as a teacher whose life is as stale as dead fish, whose life is the opposite of happy and bliss, meets a boy who's ignored by all those he holds dear, and a friendship is formed that is warm and sincere; it's a subtle reflection of how we get trapped, by tradition and habits and past circumstance, where surroundings like prisons can temper our thinking, to distil all our spirit, to bottles for drinking; so embrace all the chances when they come along, break out of that mould and sing your own song, open your eyes to the paths unexplored, take a stand and stand tall, and stop being ignored.",
    "2": "Quite possibly one of the best Christmas films ever? I first saw Payne & Giamatti's previous film together, \"Sideways\" during my screenwriting training class, and it is one that I would think of for a while. Their new film, \"The Holdovers\", is hilarious, beautifully shot and acted, heartwarming, and has a great sense of grief and joy meshed together. Definitely leaning towards Randolph for Best Supporting Actress; her performance BLEW me away.Overall, I love these films. Light-hearted & comedic while also have a sense of darkness and a lot of heavy emotion to it. Definitely is one of the most heartfelt films of the year.",
    "3": "\"Penis cancer in human form.\"Alexander Payne's \"The Holdovers\" is a laugh-out-loud comedy strengthened by Paul Giamatti and Dominic Sessa's magnetic performances and their incredible chemistry together. I am in awe by the film's brilliant and inventive screenplay, 70s-style cinematography, slick editing, and great production design. I could watch Paul and Angus bicker for another two hours. Throughout the film, the humour gets more interwoven leading to a crescendo of hilarity. \"The Holdovers\" offers the perfect blend of humor and pathos.*That waitress was so rude for refusing to accept their order of cherries jubilee. She is a fascist and a \"penis cancer in human form\".*The film reminded me of Peter Weir's \"Dead Poets Society\", Milos Forman's \"One Flew Over the Cuckoo's Nest\", and John Hughes' \"The Breakfast Club\" (kind of).Final verdict: 10/10.",
    "4": "Very enjoyable film with outstanding performances and a wonderful warm vibe accompanied by the Christmas season. It's funny at times, sad at times, and feel-good. It's a story that almost all can relate to and will really touch your heart. It deals with so many themes, but mainly grief, the past, family, and what makes a person who they are. It's also very original and has a great script, cinematography, and soundtrack. I would highly advise to see it in the theaters as well as you really get the 70's vibe and deep moment on the big screen. There aren't many negatives to this film and I would recommend it to most people.",
    "5": "When the director Alexander Payne appeared on stage following a screening of \"The Holdovers\" that I attended at the Toronto International Film Festival he received a standing ovation. That was not surprising because it's a heartwarming crowdpleasing film and one of Payne's best. It reunites Payne with Paul Giamatti who starred in the director's 2005 film \"Sideways.\" Giamatti and Da'Vine Joy Randolph are superb and Dominic Sessa in his film debut is a brilliant find. Set during the holiday season in 1970 at a New England boarding school with a side trip to Boston \"The Holdovers\" shows how human connections that may seem unlikely can be transformative.",
    "6": "Finally, Alexander Payne has made a worthy follow up to his (in my opinion at least) masterpiece Sideways.I really related so much to all three of the main characters, who all come from different backgrounds. Paul Giamatti, brilliant in almost anything he does, plays a grumpy, alcoholic, sour professor who does not suffer fools and doesn't cut his privileged students any slack. Dominic Sessa is troubled teen with a dysfunctional family and mental issues. D'Avine Joy Randolf is a grieving mother stuck in a job wanting to make ends meet for her family, by her choice.This movie has great character development, a wholesome story with flawed yet lovable characters you can root for and terrific, funny dialogue. Simple, yet perfect. 9 out of 10.",
    "7": "Excellent drama/comedy. Well crafted with nuanced retro details. Great character study as well with strong performances throughout. Also, the 70's cinematography if fabulous, especially the fade scene editing. My favorite was the details though. Every location, every costume and vehicle looked authentic to 1970. Driving without seat belts, smoking in the movies! Exquisite detail hats off to the director. The three main characters are our Holdovers learning about one another during a unwanted Christmas break bonding over the loss and regret that hold them back from living a full life. Amazing film and highly recommended.",
    "8": "Director Alexander Payne is for certain one that makes films about life, love, journey, and connection, and with this latest \"The Holdovers\" he hit on all those themes. Set in the 1970's at a Northern New England prep school the story involves the Christmas holiday. The highlight and central character of the film is Paul(a well done performance from Giamatti) a set in his ways odd tough history professor who likes to flunk everyone. And this university is indeed his life and he decides to spend the holiday break with some students and employees who don't travel home. Finally it's down to one student and Paul takes him under his wing doing a trip to Boston. Overall good film with a warm vibe showing that people, times, connection, and memories help make a person. Overall an A okay film to view for a feel good feeling.",
    "9": "On paper it hit its notes, but there was something wrong with it that I could not articulate. Then I realized. It's a bait and switch. They broke the entire concept of the movie. The entire premise is that they are stuck in the school together, to the point where when the helicopter takes off, you feel a sense of dread that they're now alone, trapped together and must make due, must find grace in the discomfort, learn all those lessons. This is a great premise for a film and it must work in that premise. SUDDENLY, they're going out to bars, to parties, to the city, to insane asylums, to bowling alleys. This is is a problem so fundamentally wrong with the movie it sinks the entire thing in my view. To start with, it's lazy, but artistically, it's cowardly. The helicopter taking off now means nothing because they hit the road regardless. Imagine in The Breakfast Club they escape the school and go on a road trip with ten different stops. It's no longer The Breakfast Club then, it becomes Ferris Bueller's Day Off; as in here, in the Holdover, there is no Holdover to speak of. They aren't trapped in the school, they just go wherever they fancy, with this gigantic god-eye copout of 'well we have a field trip fund so let's throw the screenplay out the window'. Bait and switching the premise is one of my great pet peeves in films, and it's a shame because they set out to make a great film but Payne couldn't help it, he is unable to break out this mold of making road-trip films, and there I was refreshed going in that he was trying something new.",
    "10": "It sought so badly to be \"Dead Poets Society\" but couldn't get there. For full disclosure, DPS is my favorite movie ever so it's a tough job to come close to it. Still, I'm not sure the teacher did that much wrong (except drink alcohol in the classroom) to get fired.The actors were good, but the story just didn't have the depth it needed. The whole mental hospital angle came out of nowhere and added nothing to the story. Maybe it could have come full circle with the boy teaching at the same school 10-20 years later or something like that.It wasn't awful, but it was a little disappointing in my eyes.",
    "11": "Brilliant and moving, this film is the cinematic gem of this December. I loved this unexpected trio, for whom you can't help but feel a sincere tenderness. Paul Giamatti, Dominic Sessa and Da'Vine Joy Randolph succeed in taking us from laughter to tears from start to finish. BRAVO to the costume, set and prop teams, who make the story's temporality totally believable. We even gets misled from the cinematography offering the typical image grain of this period: excellent work ! Exactly the kind of film we love to see in theaters, but unfortunately don't get to see often enough. It is sure to become one of my Christmas classics.",
    "12": "I'm sure many folks will tell you this movie is too earnest or too simple. A curmudgeonly teacher and a wiseass student are stranded at their boarding school over winter break and learn some lessons? I know, I know. But Alexander Payne has been reminding us for a long time that simple stories can also be great stories when told well. This movie took a handful of flawed and relatable characters, put them into circumstances that aren't that tough to imagine, and let them navigate the Christmas of 1970 together. The end result may not be perfect and may veer towards cliché, but it is absolutely moving. By the end, I had laughed and cried and cared. The story took it's time, the vibes were immaculate, and Giamatti made the most of every scene. So believe the people who say this movie's simple, but remember that doesn't mean it isn't really good too.",
    "13": "I went into this movie expecting a comedy, and while I did have a few laughs, it was actually very depressing. There was nothing funny about the experiences of the characters, and the whole movie felt pretty mediocre to me. I started falling asleep at the final 20 minutes out of pure boredom. All actors were great in their roles, and I liked the setting and time period. I would not watch again, nor do I care what happened in the last 20 minutes.The teen was on antidepressants. I'm no expert, but seemed a bit far fetched for early 70's. He visits his father in the psych ward, and the scene is so depressing and awful.",
    "14": "I saw The Holdovers, starring Paul Giamatti-Billions_tv, Jungle Cruise; Da'Vine Joy Randolph-Only Murders in the Building_tv, The Lost City; Carrie Preston-Claws_tv, True Blood_tv and introducing Dominic Sessa-this is his first movie.This is a heartwarming story of some unlikeable people that come together under bad circumstances. Paul plays an unlikeable history teacher-by the students and the faculty-that gets stuck with the holdovers during the Christmas holidays. Holdovers are the ones that don't have anyone to go home to, so they have to stay at the school. It's 1970 and the prep school-12 to 16 year olds-is in New England. Paul has plenty of attitude and doesn't really even want to be there. Paul is in charge and when all the other holdovers get last minute rides home, Dominic is the only one left to watch. Da'Vine is a cook at the school and Carrie is a secretary to the Dean of the school. Dominic has lots of problems with everyone too-doesn't get along with the other kids or teachers-so Dominic, Paul and Da'Vine sort of clash over things while trying to bond together over their differences and similarities.It's rated R for language, drug use, smoking and sexual content-no nudity-and has a running time of 2 hours & 13 minutes.The actors are very good-especially Dominic in his first role-and it would be a good one to stream.",
    "15": "Whoever labeled this a comedy, failed this movie. If we had known it was just a Drama, we would've been prepared better and maybe wouldn't have watched. Dramas are not our favorite genre but sometimes they're just so good it doesn't matter, but when you go into a movie thinking it's also going to be comedy along with the drama elements and all you get is drama ONLY.., with maybe two laughs in the whole movie... you leave disappointed and not satisfied/liking a movie, that was otherwise well made if labeled correctly as a Drama, nothing more. The actors did good with their roles, again, if you are into dramas and you watch this knowing it is NOT a comedy, it's a decent movie for what it is. It is NOT a cheerful, laugh out loud throughout, with the typical drama thats added for a touching Christmas movie,... so if that's what you are looking for, this is not it, go elsewhere.",
    "16": "A private all-boys high school in Massachusetts is the setting. One teacher is asked to stay in the dormitory with the handful of students who, for whatever reasons, can't go home for the Christmas vacation. How this grumpy Classics teacher struggles through his duties toward a surprising personal fulfillment is the subject of this delightful, at times poignant American film. It takes place in the 1970's, and the movie itself feels like it could easily have been filmed then. In addition to Paul Giamatti's performance, his best since his TV work in the John Adams series years ago, there is a fresh, distinctive performance by Dominic Sessa - as the student going through a difficult ordeal involving his parents. It's one of the few excellent films about school-related subjects - Goidbye, Mr. Chips, To Sir With Love and Hoosiers come to mind. If you enjoy well-written, traditional movie making\nwith sharply observed characters and plenty of heart, track this one down in theaters before it gets buried in streaming.",
    "17": "The Holdovers is a Christmas classic in the making. Or, that's just way Alexander Payne wanted us to feel while watching it. Either way, this is the bittersweet comedy of the season and an absolute must see. The laughs really sting. Payne is at his very best with this material. You'll notice right away the 1970s pastiche, complete with a crackly, poppy celluloid sheen (even though this film was shot digitally), but that is not even close to what makes The Holdovers so special. It has, arguably, the richest screenplay written this year. The characters are developed beautifully, akin to a novel. Payne understands that when the story and characters shine the most brightly in a film, everything else is Thanksgiving gravy. Paul Giamatti is, once again, a treasure as Paul Hunham. Even in a film as good as this, Giamatti is the heart and soul.",
    "18": "I absolutely love Alexander Payne. Election, Citizen Ruth, Sideways, he's unbelievable. But this film is so deeply flawed. First thing, I'm sorry, but young Dominic Sessa was overacting in so many scenes I just couldn't understand how he landed the role OR how it could possibly be Alexander on the other side of the camera directing that performance???Second, the cinematography was some of the worst I've seen in years. Sharp? Yes. Pretty? Yes. Can you see any character's faces clearly and understand their emotions? No. The cinematography didn't make any sense. Every shot should've been 5-10mm closer. I honestly don't think it's about style, I love Emmanuel Lubezki's wide angles, so it's just so bizarre to choose to have the camera so far from the subjects for the entire time. Not sparingly, but the entire time. First close up was glaringly obvious when Angus gets close to a girl and it's like BOOM 85mm and suddenly the film feels like it has emotion??? But nope, it went back to 24-35mm shots nearly for the rest of the time, feeling distant and emotionless.Also what was happening with the editing? Why were there so many of the conversations cut right as the next person speaks? Not many L or J cuts, and the edits could've been 4-10 frames quicker for LITERALLY every shot of the entire movie. Is this a new style where we watch an extra third of a second before a character decides to speak? It feels so unnatural, so bizarre.I just don't understand how this could be Alexander. Is this film so deeply personal to him, as if this is his \"The Fabelmans\" that the quality wains? I want so deeply to support independent filmmaking at all costs, but I'm just feeling confused.",
    "19": "This film has a surprisingly strong 8.4 viewer rating here on IMDb as I write this. If that were to hold for the requisite number of votes, it would wind up in IMDb's Top 100 films. Personally, even though I thought it was a good story, I don't think it has that kind of staying power. The three principal players in the picture are all very good. For his very first and only film role, Dominick Sessa does remarkably well as the troubled youth Angus Tully, stranded at Barton Academy during Christmas break because his mom and her new husband are vacationing on their own. Supervising him after a handful of other students received permission to leave with another boy's rich father, Angus finds himself pitted against the headstrong and one-dimensional ancient history teacher left in charge as supervisor for those left behind. Because they have to eat during the two weeklong break, the school's cook (Da'Vine Joy Randolph) has also remained behind. Harboring recent grief over the death of her adult son in Vietnam, Mary Lamb serves as sort of a bridge between the curmudgeonly Paul Hunham (Paul Giamatti) and the unruly Angus Tully.Various breakthroughs occur throughout the story that ultimately help all parties grow in understanding of what the other is going through in their personal lives. Hunham, who one would think has it all together as a long-time teacher at Barton from which he himself graduated, gains insight into the young teen's turmoil when he discovers that they both take the same medication for depression. In sharing their unguarded feelings for each other, Hunham and Tully realize they have more in common with each other than would have been imagined at the outset. Hunham in particular, demonstrates true character when he fully accepts responsibility and blame for taking Angus to see his institutionalized father who his mother had committed for dementia. The parents, recalled from their honeymoon vacation, would have placed their son in a military academy had it not been for the selfless act of Paul, whose own position was sacrificed for the prestige of the school.Perhaps the surprising player in this dramedy is the formidable Da'Vine Joy Randolph, whose patient coaching of Paul and understanding of Tully's angst, helps her to deal with her own sorrow for the son lost in war time tragedy. It's her strength that sees their relationship through a bleak period that would have remained so if not for the life altering events that transpired throughout the story.",
    "20": "Hands down one of the best films of 2023. Performances across the board are terrific. Every actor has a chance to shine- and shine they do! Paul Giamatti is always great , but the find here is Dominic Sessa making his debut. The guy is spectacular. He is so darned convincing as a 17 year old kid - and considering he is twice that age, it is a performance that is even more amazing. The gestures, the facial expressions, the gangly walk , the slouch are all perfect. Deserves an Oscar nomination - and, in fact, should head the list. He should be on his way to a great career. Da'Vine Joy Randolph is another standout. She should also be remembered come Oscar time. She's wonderful. However, even the smaller parts are beautifully played. The original screenplay is one of best in years. It's funny, heartfelt, and above all, surprising. Just when you think you have it figured out, it takes a turn. So good. Alexander Payne has done it again.",
    "21": "The Holdovers ...is not a comedy, more a Bittersweet drama...set in a New England college during the Xmas break in 1970-71... We fet to know and like our 3 mains characters ...each having stop liking life, like people, going threw the motion of interacting with others their deception, their hidden pain preventing them from moving forward...this typical film of redemption ...we get to like them, feel sorry for their pain, and they find thanks to there interaction their redemption...the college used for the filming is gorgeous. The acting is good by the main characters...L'expression américaine : Bittersweet, ici décrit beaucoup mieux le genre de ce film que j'ai aimé même de qui m'en reste est plus amère que doux.",
    "22": "The narrative of this film orbits around the absence of a compelling punchline, leaving audiences yearning for a substantial crescendo or a resounding resolution. While the story unfurls with promising characters and engaging plot arcs, the absence of that climactic moment, that unforgettable denouement, detracts from the overall impact. The direction and cinematography articulate a tale with glimpses of brilliance, offering stunning visuals and emotive sequences that captivate the eye and engage the senses. The performances, too, resonate with depth and conviction, breathing life into the narrative. However, the story's trajectory falters as it approaches closure, leaving viewers with an underwhelming sense of conclusion.",
    "23": "This is one spectacular film and Giamatti deserves an Oscar for his realistic, hilarious, and heartfelt performance. Da'Vine was also on fire.as Mary and will get the supporting nom. Alexander Payne is a genius and I would rank this one second to Sideways. There was hardly a false note and I connected with every character. One minor quibble being the fact that Dominic Sessa, portraying a 15 year old, looks a bit closer to 30 but it is what it is. Hemingson deserves an Oscar nomination for writing and Payne for directing. It's a sweet, gentle, realistic journey focusing on three beautiful humans finding ways to connect.",
    "24": "THE HOLDOVERS (2023) **** Paul Giamatti, Dominic Sessa, Da'Vine Joy Randolph, Carrie Preston. Filmmaker Alexander Payne and Giamatti reunite in this funny and surprisingly poignant Christmas holiday themed dramedy about a curmudgeonly history professor at a prep school circa 1970, who is tasked in taking care of a student (newcomer Sessa) who is suddenly without family for the duration on campus resulting in a mix of troubles and revelations in the process. Fine support by Randolph as the school's chief of the kitchen who is grieving the recent loss of her only son to Vietnam and a vintage jukebox of period tunes keep things grounded in its core realities. Giamatti and Sessa give good thrust and parry with the former at the top of his game and the latter a talent to watch for years to come. One of the year's best films.",
    "25": "Borrowing from familiar tropes about coming of age and redemption, this film fails to deliver the emotional depth of connection.Disappointing first hour with meandering secondary character stories that disappeared after their introduction. A contrived helicopter landing to deliver the fortunate few to their family and vacation was not believable.I do appreciate the character arcs of the two main characters. Perhaps it would have been more effective as their story. I was drawn to the character of Angus and wanted to know more about his back story and well as Paul. That as they say, is the movies.",
    "26": "The 1970s, crammed into an introverted comedydrama, for some reason a pretty fascinating story about loneliness on the most major holiday season of all called christmas.A storyboard about private school students that becomes stranded at the dorms due to different reasons during yule season, developes into a caracterdrama between two collosusses on the drama scene. Paul giamatti gives you the driest buisqits of them all, but the way he does it is just excellent.Its not really a funny story and understating that will for many not be a problem, cause its a sad story really, and it may only trawl in the older generations that may have experienced these times 60 years or so ago...but the production really amazes me on the production design, reflecting the zip of the historical era, with gadgets and sets that really set me back to those glory days. Also the musical score will prevail you into the environment, and i do believe this film will become a yule time classic in the years to come...x-mas season are for many folks a warm and cheerful time of life, but it may also be one of the difficult ones for others, me the grumpy old man pivots to the latter one each year, howcome i wont tell its just like that. But my recommendation to view'' the holdovers'' are strong and relentless. A great weird flick for the season to all of you from all of them.",
    "27": "Reminds me of films of the late 70s and early 80s. Deep, flawed but likeable characters and scenes that let silence contribute to the dialogue.The story feels familiar but it's very satisfying watching these characters live it. It flirts with cliches but draws back just enough to keep it authentic to the characters.Great soundtrack that enhances the feeling of being alone in a place built for so many more people.Watching people who think they know each other actually learn about each other and exercise their empathy is such a positive message. We need to get over our preconceptions and remember most of us come from shared experiences and are more similar than we are different.",
    "28": "... but ends with the protagonists just a tinch up off the bottom.We went to see this movie looking to be uplifted and happy. We left content the three leads were over the bad spots in their lives, but just barely. This is a great Hollywood art film, great acting, great directing, good plot development, twists and surprises, sadness, tragedy, verbal abuse, snide comments, zero warmth at first, even something naughty, and tepid warmth at the end. We have hope that maybe, likely, but maybe not all will ultimately come out well for our three new friends.But we are bummed out they have had such tough and almost loveless, friendless, humorless lives. Yes, they have gotten up off the floor from their latest knockdowns, but what will the future bring?",
    "29": "Why the Director would choose a 21+ aged man to play a 15 y/o is really deceiving. To those who scored this an 8-9, what are you smoking? Movie was dark, boring, and I kept waiting for it to get good; instead, movie kept getting more depressing! A 2 hr and 13 min movie that was not in the spirit of Christmas! A 4-5/10 at best, & that's just for the Christmas music. Paul Giamatti, Da'vine Joy Randolf & Carrie Preston are great actors/actresses. I think I would have enjoyed movie better if people hadn't given it high ratings. My expectations for a movie that was highly rated 8-10, were not met. I feel like I wasted my time.",
    "30": "Pet peeve. Older actors playing parts that are much, much younger on screen. Great actor but I think it would have been even better with actual high school age actors. (The young actors, Park and LDS, seem almost too young when compared to the other holdovers.)I wasn't too thrilled with the helicopter conveniently flying in to remove unneeded characters. Actually, when I think about it, I spent way too much time analyzing the movie rather than simply watching and enjoying it.I agree with other reviewers that this could turn into a Christmas movie. (And glad to see Carrie Preston in a movie!) My viewingartner loved this movie, so I think I'm in the minority with my thoughts.",
    "31": "Those hoping director Alexander Payne reuniting with lead Paul Giamatti might spark the magic they weaved in \"Sideways\" will NOT be disappointed by \"The Holdovers\"... it is SUPERB. Giamatti's a crusty teacher at a prestigious US East Coast boarding school, charged (with chef Da'Vine Joy Randolph - great again) with 'babysitting' those pupils forced through parental circumstance to stay there over the Cristmas break... inc bright and individualistic Dominic Sessa (in his excellent debut). Rich in character, conflict, relationships, humour, & simple but profound wisdom... it's a genius movie - props to Payne, Giamatti & writer David Hemingson. Outstanding.",
    "32": "This movie is beyond amazing, and everyone must see it. Especially anyone dealing with Dad issues.The Holdovers captures the 70's really well, but it also showcases timeless coming of age struggles. It's.also set in Massachusetts, which I liked, since I'm from Connecticut. Anyways, it feels like you're sucked back in time, and truly there. The characters say politically incorrect things, and while one of the racist kids is called out he isn't cancelled. The call out is also realistic, and not woke.*Here's the jump to the spoilers:* Angus' Dad ends up being mentally ill in a psych ward. The trailer had us thinking he was dead. He talks about how his Dad changed and became violent, and then his Mom had him put away. I grew up with a mentally ill Dad who physically abusive. No one saved me, and my Dad can still function, but this still made the movie for me. Anyone with a mentally ill parents knows what it is to be seen. Mr. Hummel was able to break away from his Dad's abusive ways, and so will Angus. *End of spoilers.*I'm in the middle of the characters age wise, since I'm in my 30's, but I still relate to Angus a little more. Either way there's a character for everyone. Everyone needs to see this movie.",
    "33": "The film industry (aka \"Hollywood\") has a long history of \"redemption\" stories. So what makes this movie any different? I think it's because The Holdovers is genuine and sincere. Embracing clichés with conviction is an art in itself. But by elevating the plot and dialogue, combined with stellar acting, you now have a near perfect film from start to finish!The Holdovers has the look and feel of several '70s comedies, which makes this little holiday gem both charming and consistently funny.No spoilers here (as usual) but in one scene Paul Giamatti is talking to a man who is dressed like Santa Claus. Giamatti played Santa Claus in Fred Claus (2007).",
    "34": "This movie is not for everybody, but my beloved wife and I both enjoyed it. The next day, we both agreed on something interesting about the movie in general. It wasn't preachy. It wasn't pushing an agenda. It was just a well-made slice of life story about 3 interesting characters forced together over a short period of time.Ignore the trailer, which gives the impression of a heartwarming story with redemption, second chances, blah, blah, blah. Two of the three main characters weren't especially likeable, but neither were they overtly bad guys. If open to something besides the typical Hollywood schlock so prevalent these days, be sure to check it out.",
    "35": "I wasn't alive in the 70s but this movie here didn't feel like a soulless grab at nostalgia, it well and truly felt like an old movie. The style of filming and cinematography in this movie were brilliant. It's two hour runtime whizzed by. One thing I really loved about this movie was that I was smiling the whole time which I can't say it's true for many movies. Paul Giamatti was really good but I can't believe this was a breakout role for Dominic Sessa. A really heartwarming film that shows us all how everybody needs some love and affection when it's time for the holiday season. I'm pretty sure there was a fart joke somewhere in this movie tho:(. 8.5/10.",
    "36": "The Holdovers deserves to be nominated, I'm glad I decided to see this earlier today and that's it's praised by many. Paul Giamati was exceptional and Alexander Payne's films are fantastic I bet it was nice for the 2 to work together many years after Sideways. The 8.1 rating is genius for this it's got some fun comedy, an amazing new actor and well written smooth dialogue throughout; I loved quite a lot! I hope Dominic Sessa becomes a flourishing star his character was a delight even as a punk he made everything better. A small trivia I like is how Kelly Aucorn as the past friend has one scene and he worked with Paul on Billions. All around excellent film id recommend to anyone.Stop hating on my review this movie is one of the best dramas I've seen and if it makes a difference I have autism.",
    "37": "Tell me an original story. Introduce me to some relatable characters. Move me. Make me laugh a little, make me get a little teary eyed, make me feel some empathy. I don't need any CGI, and nobody needs to have any super powers. Tell me a story about humans having human experiences with each other that I can relate to. Tell me a story that I can connect with.This is a movie that has all of the components of what I love about movies: great acting, storytelling and screenplay, cinematography, editing, and score. This is the type of film we need more of, and it's the type of film that used to get nominated and win lots of awards. We'll see if that happens. It should. I hope people go out to see this at the box office and the studios take notice.",
    "38": "Generously sprinkled with familiar carols (opening with a beautifully harmonized TTBB ensemble of Oh Little Town of Bethlehem), \"The Holdovers\" is funny, sometimes poignant, and ultimately warm, a fitting Christmas offer. Watching the first half-hour, I thought this is an updated \"Breakfast Club\". But then the movie heads in a different direction. Let me back up a little.The \"stage\" for this endearing little drama for play out is introduced through the beautiful photography of a winter wonderland, a boys' boarding school called Barton, somewhere in New England in 1970. The movie title denotes five \"poor little Christmas orphans\" who for one reason or another have nowhere to go when the boarding school closes for Christmas. As they watch their fellow students depart for merry holiday season, the decorated Christmas tree in the school is also removed, a win-win situation, I suppose. School saving on the budget and vendor making a little extra. Not exactly a joyous spirits.Adding to the unhappiness is the teacher who has been charged with the noble responsibility of babysitting these kids, a last minute fill-in for a colleague who gets sick. Paul Hunham (Paul Giamatti) is an icon of an old-school educator. \"Latitude is the last thing these boys need\" is one of his mottos. The principle, his boss as well as a long-time colleague, used to be like him but see things differently after being promoted to the lofty position, which right away put funding at top priority. That translates into different treatment for different students - those whose parents have made generous donation get preferential treatment. Seeing that Hunham absolutely refuses to compromise on his firm standards even during the holdover period, his boss can only ask him to at least \"pretend to be a human being\".I'll be very brief with the 5 holdover students because, as mentioned, \"The Holdovers\" is not \"Breakfast Club\" although at one point it would appear so. Only one I'll name, Angus Tully (Dominic Sessa), scores B+ in Hunham's Ancient History. Unfortunately, that seems to be the only good thing one can say about him. In slow-boil fashion, Tully's story unfold gradually as the movie progresses. Of the other four, one is a \"privileged\" student born with a silver spoon in his mouth. One is not just underdeveloped, but outright un-developed. The only thing we know about him is that the parents do not want him back for Christmas unless he cuts his hair short. One is from Korea, obviously terribly homesick. The last one who is comparable with the Korean in their minute stature is from a Mormon family. At one point, the 5 boys seem to start a reasonable amount of rapport, getting to know one another, a bonding that will forge a solidarity, foundation of a life-long friendship. But, just one quarter into the movie, the four other boys' fortune stars shine, and they go home. Switch gear, into a different movie.It would, at this point, be quite obvious to movie veterans that the trajectory will be one of father-and-son story, in spirit if not actual. There is a third character, Mary, played by Da'Vine Joy Randolph who has already swept an impressive collection of Best Female Actor in a Supporting Role even before the Oscar nomination list is announced. Mary, the invaluable in-house cook, is not surrogate of a mother figure. She has her own heartbreaking story.All told, while not everything is outright predictable, there is little surprise as the story of Tully unfolds, as we see the relationship between him and Hunham goes from acute animosity to heart-warming affection. The friendship between Hunham and Mary transcends gender and skin color, just two lonely human souls with deep compassion connecting. As aforementioned, Randolph is a strong contender for Oscar. Sessa has already been recognized by awards as a breakout talent. Giamatti is, as always, his solid reliable self. The comforting Christmas carols background aside, the performance of these three superb actors bring true Christmas spirit to \"The holdovers\".",
    "39": "Quick question(s): Do you like Alexander Payne flicks? Do you like Paul Giamatti even one of ten on a ten scale? Do you like emotional films? Well, brothers & sisters you have picked yourself a winner here! If you look at this film and really examine the script, you'd see for yourself that this is one hell of a grouping of words to memorize for an on camera and you'd offer nothing but respect to these actors. This was just outstanding work.It was an emotional film, with emotional music, set in an emotional era for Baby Boomers, 1970-1971. I promise if you buy a ticket to this film (I just watched it late night 10:40pm on a Friday whilst everyone else was watching The Marvels) you will find something that you truly enjoy about it. If you don't want to leave the theatre scratching your head, catch up on your classical studies. 10/10.",
    "40": "I did not find the writing, the directing, or the character development up to the level I hope to see in a film where I must pay theatrical prices. The payoff in most scenes was negligible. Giamonti in the central role was an adequate curmudgeon but otherwise there was little fun or drama to be had. I saw the film with a total audience of three people and exited before the midpoint. The reviews lie, save your time. The story is too dry, ugly and depressing, and if that's not bad enough, the pace is so slow I had to increase the playback speed by 50% to make it tolerable. At about four-fifths of the movie I just shut it off, because no payoff at the end could possibly make up for what this horrible film put me through. The acting and the attention to detail of recreating the time period were the only redeeming values.",
    "41": "Very well done. Paul Giamatti is brilliant, as always. He and Sideway director Alexander Payne sure make a great team. And the kid is very good too, which doesn't always happen. It's a fairly typical story: two social outcasts (for different reasons) are forced to deal with each other during the holidays. But between the tight writing and fantastic performances you're more than willing to go down this somewhat familiar path. Also the third wheel (so to speak) in this is Da'Vine Joy Randolph who is equally fantastic and help makes this film rise above the average indie drama/comedy. Overall, this is a fantastic holiday themed flick with a wonderful balance of comedy and drama.",
    "42": "Alexander Payne movies have always been a mixed bag for me. I love his work in \"The Descendants\" and \"Nebraska,\" but could care less for \"Election\" and \"Sideways.\" What I do admire most about his films is the focus on unique characters and the struggles they're working through. \"The Holdovers\" is an exceptional example of this story arc.Payne zeroes in on three people at a boarding school during Christmas of 1970. The main character is a reclusive and arrogant ancient civilization's professor (Paul Giamatti), whose sole purpose is to make his students lives' a living hell. The second main character is a grieving mother (Da'Vine Joy Randolph), who serves as the school's head lunch lady. And finally, there's an intelligent but brash student, who gets left behind by his selfish parents during the holidays (Dominic Sessa). Starting out, we aren't particularly fond of any of the characters. They come off as brazen, rude, and aloof. But as the film progresses, we get to learn about them, layer by layer, who they really are, why they act the way they do, and by the story's climax, evolve into something more and better.\"The Holdovers\" is packed with humor, drama, ambivalent characters, snappy dialog, brilliant directing, and a surprisingly fast pace for its' two hours and 13 minutes. The performances are some of the best I've seen this year. Giamatti delivers top-notched work as Paul Hunham. He hits every note with perfection. He's my pick for 2024's Best Actor Oscar. Da'Vine Joy Randolph gives a quiet yet stoic performance as Mary Lamb. She never overacts, nor does she slip into the stereotypes Hollywood often utilizes for grieving mothers. She's a definite frontrunner for the supporting actress category. Dominic Sessa's breakout performance is truly a breath of fresh air. I can see a long, successful career ahead of him.I went in to see this movie as a pure recommendation from a friend and am glad I saw it. This is now my favorite Alexander Payne movie and it's officially added to my holiday movie rotation. As of now, I will go so far as to say that this is the best movie of 2023, although I do have a lot of catching up to do. See it on the big screen if you can. It's worth watching, even just to see how people react to some of the zaniness that happens in the movie. 10/10.",
    "43": "I do not remember when was the last time in this year when I felt after a movie that it worth every single minutes. Beautiful movie about human fates, character developments, affection and Christmas as well. Great characters, fantastic acting and directing and a lovely story.Huge point goes for the cinematography. I felt like I time travelled back to the past. Really strong emotions emerged inside me about my childhood. The whole movie remembered me how I loved Christmas when I was kid. How I was waiting to be with my loved ones. How I enjoyed this period of the year when everything is so magical, people come together closer, they get rid of the bad things and we let the love overwhelm us.",
    "44": "Melancholic comedy that masterfully balances heartwarming and heartbreaking moments. It navigates the delicate line between humor and emotional depth, drawing us deeply into the lives of its characters. Despite its simplicity, the narrative is deeply emotional and resonates with a sense of authenticity. I found myself unexpectedly moved to tears at the end with both joy and sorrow.The film delves into themes of loneliness, isolation, and the hidden struggles that each individual faces but often conceals. It offers a touching reflection on human connections, capturing the unpredictable nature of life.",
    "45": "Although this movie isnt the funniest out there, its a hearty and full movie nor is it easy pull a comedy and heartfelt drama like this today with a two hours long running time. The movie builds characters that are very well known to the movie-goes, the sour and strict teacher, the undisciplined problem maker and the hated schoolmater. But it builds the film around these character with mastery and allows for new emotions to come up, so it is not a repetition of the old trope. That is why i think this was a particulary difficult film to make- there were so many things that could go wrong but the film stands on its feet and creates its in scenario relationships with resepct and a renewed curiosity. That is why i give this film a 9/10 for pulling off a difficult feat.",
    "46": "In a world of remakes, political statements disguised as movies, plots that depend on people having special powers or saving the triple quantum multiverse, predictable stories with predictable outcomes, etc. This was so refreshing. I thought movies like this were extinct....\nPrepare for an actual original screenplay that keeps you interested, brilliant acting, beautiful real non-CGI (or soundstage) sets, and most importantly, as well as the thing that they always get wrong nowadays, believable characters.I'll be shocked if this doesn't become a classic. People were literally laughing out loud in the theater, holding back tears, and everything in between.Treat yourself, buy a ticket, and hopefully more movies like these will get made.",
    "47": "Life is hard. People are complicated. We hide the hard things we carry (don't hide them very well). The film felt very real in that way. Many of the boys have tough backgrounds. Their parent abandon them over break. And some react by becoming menaces.This movie doesn't add a ton of new material to old ideas, but is exceptionally done. \"Sometimes we need to go into the past to understand the present.\"The setting of the boys school was vivid. Excellent job making it all feel real. The parties, the dinners, the classes all felt as if we were dropped in.Great movement throughout the story. It's so easy for these character driven stories fall into plot-driven traps. But every plot point felt organic.Every character was VERY fleshed out. Their backgrounds were palpable in their actions. Even the minor characters. Even the other holdovers.The main characters were compelling. Giamati's portrayal excellent.The dialogue was natural and fluid. Good humor throughout.Very interesting visually. The colors were dull and wintery. Punctuated with color to make a point.So many great moments\nLydia's boyfriend entering the partyThe dad visit in the hospitalAlise the niece and the boyChoosing the songs to play at the partyAll in all, strong film. Strong themes around the holidays: loneliness, family, failure, tradition.It was not an epic story. It was more grounded. Which made the characters feel like real people.Although definitely a grown-up, adult film. And heavy. Thank god for the well timed fart and poop joke to remind us that life still has its silly bits.",
    "48": "Old time movie style, like they made in the 60s and 70s, so it is appropriate that The Holdovers is set in 1970. A good well developed plot. Sub stories that keep your interest, because they concern characters that you care about, characters that develop and reveal themselves in interesting ways. Characters that are made believable with a good dialogue, delivered by excellent actors, directed well. Nothing flashy or gimmicky or contrived, simply because a script this good does not require it. The production is flawless, the 70s settings being very authentic. It could have been a bit claustrophobic, being located in a semi deserted boarding school over the Christmas holidays, but it is given room to breath and develop over the two and a quarter hour running time. A great film to end the year on IMO.",
    "49": "An unruly student, a curmudgeon teacher, and a grieving cafeteria worker are forced to hold over for the holidays. Trapped together for two weeks, the teacher and student are forced to learn from one another and realize they have more in common than they imagined. Reflecting upon their lives, they take this opportunity to learn from one another and change their lives.An engaging coming-of-age dramedy that shows there is no specific age at which someone can discover themselves. Unlike traditional coming-of-age movies, both protagonists see themselves in each other and use what they learn to change their outlook on life. The film has a mixture of comedy and heavy moments, spread evenly so as not to burden the viewer emotionally. It is a good watch for anyone looking for a different type of holiday movie this season.",
    "50": "I recently watched this in theaters. Early on, I was worried by the rigid delivery of individual lines, as well as the basic nature of their content. I even began to wonder whether the best aspects were shown in the trailers. After about the 30-minute mark, the movie takes a shockingly improved turn, peeling back the layers of humanity and its severe lack of generosity. While it serves as a distressing look at depression and may bring you to muster up a tear or two, it also provides many laughs. Since this movie is based around Christmas and New Year's break, it needs some uplifting moments, right? Thankfully, this film provides that. There are very few movies that have made me sad, happy, and inspired, all in one. After watching this, you will realize that no matter how great or bleak somebody's future may look, everyone is going through something. There are always things we can do to improve the lives of those around us. In other words, don't just say \"It's Okay to Not Be Okay\" because commercials and celebrities tell you to do that. Really try to find a connection with those in need and offer tangible support.",
    "51": "Internally, everyone harbors personal narratives that may be challenging to express. \"The Holdovers\" brings these stories to light. Ultimately, it underscores the power of human connection, uniting people through shared experiences and empathy, thereby enriching the tapestry of life.Love the soundtracks; they perfectly align with my favorite playlist for Christmas and complement the scenes in the movies.The plot is straightforward; some might argue it's overly simple. However, for me, simplicity suffices for a holiday film. Light, heartwarming and a bit emotional - isn't that precisely what we seek for a winter day?",
    "52": "My wife and I always need something fine to do or see to get us out of the dreadful routines of these horrible days. Seeing this movie seemed like a good bet, and it was. It has a wonderful narrative quality, like slowly paging through an engrossing book. We knew it was likely going to be both funny and sad - the deeply moving won out, but we had our laughs. We just recently lost a close member of our family to cancer and have still been grieving. There are many sad moments in the story, but at one point the Angus character stares in close-up at a snow-globe with a Santa inside and I realized I was choking up. Next thing, there was water coming out of my eyes. The acting was amazing! I'd give Oscars to all three main actors. Young Dominic Sesso has very promising talent. The first thing I said after leaving the theater was how \"loveable\" it was, and I'm not given to sentimentality. This is not a movie you will forget about, it's got great soul.",
    "53": "I really enjoyed this movie. I am not sure why some are acting like it has flaws. It could have been a 10/10 with an out of the woodwork periperhal to main story, but that wasn't the point. In fact. The tweak we got was actually really moving. It made me laugh, tear up, in some ways yearn for the pre-internet years even more, and then laugh again. Strong cast led by Giamatti, but the young kid and DaVine Joy Randolph, the latter playing a key role as the go-between, also hit it. Nice little soundtrack, too. It sort of reminds me of Dead Poet's Society meets Outside Providence. It also has a nice ending.",
    "54": "I wanted something that wasn't too loud and not too soft. I wasn't expecting action or a solid comedy. I just wanted something well done. The fact that Paul Giamotti was in it was a big draw. He is a subtly strong actor and a joy to watch him do his thing.The time period was well represented in this film. The music and details felt like a comfortable pair of shoes. This is a warm Christmas movie, but not like an unrealistic Hallmark movie. It just works well.I just enjoyed the ride and remember well the private schools of the seventies (although I never was a student of one). I went to Catholic school, so that is close enough.",
    "55": "I laughed. I cried. I cringed! This movie will make you a better person and points out the dangers of hypocrisy. I love Paul Giamatti. Even when he is straight faced, he speaks a thousand words. Parents, grab your teens and take them to see this. I also loved the 70s vibe of the cinematography. They must have used CGI to line the street scenes with old cars. Either that, or they emptied every junk yard & vintage car collection. This put me in the mood for Christmas with the party and constant snow scenes. Parents: do not send your kids to boarding school. It's not all about you or your posh dreams for your future or theirs.",
    "56": "Great acting, scenery, pace, and just the whole feel of the place made for an enjoyable movie. Really enjoyed how the story started with everyone at the school, to just a few boys, then just the three of them. Then expanded from there to get bigger to slowly include the city and other people they had known outside of the school. What else to say to get the required characters. I really liked the scene when she was reaching into the closet to get the Box on top. Was a really well lite closet and just reminded me how often I kind of overlook my own closet possibly because as a kid I I found myself spending much more time in closets playing hide and seek and just exploring. Which that thought probably opened up good foreshadowing the movie provided about her own child hidding in the closet waiting to be found and shared again with the world.",
    "57": "I'm an admirer of Alexander Payne's films. His movies are always exceptionally grounded and have a middle-America feel to them. This film is no different. Superb acting from top to bottom and Giamatti was the best he's ever been. He deserves an Oscar nomination for this. Seriously, he's amazing. I was not expecting much as I didn't even hear about this movie until I saw it listed for rental. After reading the reviews, I decided to give it a shot. I'm glad I did as it entertained me thoroughly during a cold, winter day. In a world full of movies filled with cgi, superheroes, and aliens we need more films like this. A+",
    "58": "The Holdovers feels like a classic from the 70's or 80's that shows real flawed characters with good and bad coming together. The underlying message and tone of the movie is Compassion and love. If you like good films and not just action super hero movies, you will enjoy this film. I believe this will become a Christmas classic. The characters were likeable, amazing performances, great story telling, funny, sad, and engaging. Paul Giamatti is definitely a contender for an Oscar, as he is brilliant along with Dominic and the Da'vine carry this movie to make it what it was. Feels fresh and it not a cookie cutter movie that are common in todays movie age. Some movies are meant to entertain you for a moment, some are cash grabs, some are great story telling that will touch you and I believe this is the latter.",
    "59": "Every aspiring filmmaker should take a page out of this book. This is a great story and you're constantly learning about the characters. You get to watch them grow and develop.I was never bored or trying to figure out what was happening, I was just along for the ride and hooked from start to finish. It human, it's funny, it's dramatic and heartwarming.It's too bad films like this don't sell with the majority of the population. They'd rather watch mindless BS (Marvel ect..) than something with substance. If that offends you, then I'm sorry....you're probably simple or 14.I would love to see this type of film become a part of filmmaking again.",
    "60": "One thing that attracted us to the movie was that a) it was a holiday movie, and b) the first genre listed is that it's a comedy. While there may be a few cute lines and an occasional chuckle, it most definitely is not a comedy.Some of the first few scenes foretell so much of the film. Students and Professor have anger issues to deal with...some warranted, some not so much. With the movie being set in 1970, successfully matching the look & feel can be very tricky but they did a great job with the location shots.Between the Civil Rights movement, the Vietnam War, some misplaced attitudes toward returning vets at that time, the film exposes us to those issues but never lingers or preaches about it, but these are relevant topics in everyday life back then. If anything else, it exposes one of the privileged student to things they may not be exposed to in everyday life by attending the boys Prep school this film is based in.",
    "61": "We 100%, without a shadow of a doubt, absolutely need more movies like this. I saw it on 35mm in Nashville and my wife and I both thought it was fantastic. Alexander Payne is back at the top of his game. Dominic Sessa is a true artist and Giamatti is somehow still grossly underrated in the pantheon of all time great character actors. See it! See it in the theatre!The storytelling and pacing are pitch perfect. The acting is incredible and the substance.... man, the substance. Loved how it was shot and am hoping to see it again as soon as possible.I know this review might seem hyperbolic, but it's my favorite film of the year!",
    "62": "The wife and I watched this last night, mainly due to its good reviews.Paul Giamatti didn't disappoint, as he's truly an actor's actor. And really, the other members of the cast held their own, as well.I mentioned in the review title that this is a perfect Christmas movie. That's true in many ways, and no so much in others. Cases in point: It's centered around Christmas; there are gifts and parties and trees and snow. But it isn't always uplifting like other Christmas movies such as Die Hard, say. Just kidding. It can be a bit heavy in parts, but that's just the subject matter...and what makes this film so great.Lastly, I do like that even though it was digitally filmed, it had a definite old 70's feel to it.",
    "63": "It's good to see that small-budget but cinema-defining projects are still being made. This one hits directly our hearts. After six years of absence, Alexander Payne made a tremendous comeback. One of the best films of 2023. I smiled, I laughed, I felt sorrow, I cried and did all these on repeat again and again. This year came like a fresh breath for non-franchise films. Of course, there is a place for every kind. There definitely should be! But just like Jodie Foster said, the time for superhero films to keep the spotlight was generously longer. I can see The Holdovers easily becoming a new Christmas cult classic. A must-watch for families.",
    "64": "Movies like this usually fall short by preaching and getting in there own way to make a moral point. Not this beautiful gem. Three main characters with no agenda besides being human,take us on a journey of growth and friendship.Amazing cast, writing,soundtrack & direction how can it miss. I love how it grabbed me from the beginning and before I knew it,the journey was coming to an end. I was a little apprehensive at the beginning you never know these days. Propaganda is everywhere and this movie just wants to tell a story of three human beings & how they learn to share time and fellowship. Wonderful.",
    "65": "The Holdovers is a great movie overall. It is a bit long and low-key - not action packaged at all, which is good, in a way. The cinematography was well done as well as the entire atmosphere for the entire movie. A somewhat grumpy and stern, rule-following professor having to babysit a group of misunderstood and mishandled teenage boys leads to a potentially explosive situation if not handled correctly. In this case, the professor really only has to deal with one teenager, and both handle each other correctly. They both teach each other about themselves, in other words. In the end, great and powerful lessons are learned by all involved.I would not classify this as a true CHRISTmas movie, although it is set over the CHRISTmas holiday. My biggest issue with the movie was the few comments that mentioned and indicated the professor is an atheist and is project it onto other people. That could have been completely left out as it does not contribute a thing to the movie and actually takes away a good bit of the respect I had for it. Also, the use of foul language was totally unnecessary as well. It also detracts from the movie.Overall, all of the actresses and actors did a superb job and the movie is a great one to see if you keep the aforementioned issues in mind.",
    "66": "Finally , a movie about life, privilege, and misfortune all rolled into an intelligently written film. Paul Giamatti plays a history professor at a private school having students of privilege attending in 1971. Those who have done poorly in his class are required to be holdovers during the Christmas break in an effort to attain a passing grade. Each of these young holdovers has a unique story which expands as the film plays out. The stories within the story are well thought out and fit together perfectly. The acting is impeccable as each character feeds off of the others to expertly weave the tale. Giamatti plays his professorial role with expertise being serious, funny, sad, obnoxious, and extremely intelligent all at the same time. Amazing range as always!! This is a worthwhile film depicting life with all its pimples and boils in full display. Don't miss it.",
    "67": "Probably one of the best Christmas movies ever made and surely the most beautiful one. Each and every frame and aesthetics of this film was far beautiful than the previous one. With the best music I have heard this year. The use of the songs and background tracks were perfect. It wasn't just aesthically pleasing the plot was heart wrenching and inspiring. All of the characters were beautifully drawn out by top notch acting. Paul Giamatti gave the best acting performance of this year with a stellar side cast who were at the top of their game. This is without any doubt the best film of the year for me. Because it made me feel my emotions and I could relate thoroughly with it. We really need more movies like this.",
    "68": "Overall a really great thought provoking film. It started out with Paul as the stereotypical hated teacher, whom we have all had. I don't agree with the reviews that call him a \"professor.\" He is not; he is teaching at an elite boarding which is the equivalent of a high and its not clear that he even graduated from Harvard.His character development is pretty straight line until he and Angus get to Boston and he meets a Harvard colleague and spins a tale of his professional successes and helps Angus do that thing that he needs to do in life; visit his father. Angus chips right in with fabricated details about Paul's in the works book on the Camera Obscura.I really liked Carrie Preston as Lydia Crane; she was a \"wears her feelings on her sleeve\" contrast to Paul. And he was too obtuse, for a while, to appreciate her even though she brought him cookies.I would be remiss if I didn't mention Da'Vine Joy Randolph as the emotionally disemboweled Mary Lamb. She was fabulous sharing with the audience the pain of the loss of her pride and joy son to the morally bankrupt Vietnam War. But she was a survivor and beginning to live again through her sisters pregnancy. She left me with the feeling that I was confident she would make it.The ending left me a little unfulfilled as Paul got what he knew was coming after crafting a credible story that kept Angus from having to go to military school. A quick ending shot of him in Greece or Turkey, admiring some underappreciated work of art, would have been fulfilling.I HIGHLY recommend this film and if you don't see it you are missing something special.",
    "69": "Let's just get this out of the way now - when it comes to writing this review, I'm probably a little bit biased (and a little bit drunk, currently, but that's besides the point). You see, I have an affinity for indie coming of age movies, and \"The Holdovers\" is basically an indie coming of age film, so it may - or may not - come as a surprise to you that I absolutely adored this picture. So, with that little preface out of the way, it's time for me to gush over this movie.Starring none other than Paul Giamatti as Paul Hunham, Giamatti plays a professor at an all boys boarding school where, over Christmas break, he has the misfortune of looking over a group of boys, one of whom is named Angus, played by Dominic Sessa. After a rocky start, where Paul clearly doesn't get along with any of the boys, making his disdain clear and evident, he eventually finds himself alone with Angus - as well as with the school's cook, Mary Lamb, played by Da'Vine Joy Randolph - in an unexpected chain of events. What occurs after is a slice-of-life style piece of cinema that allows broken people to find comfort in each other's company.\"The Holdovers\" is, without a doubt, one of my favorite movies of 2023, as well as probably one of the best movies of the year, as well. This Christmas-themed gem doesn't hold back on the drama, delivering a thoughtful blend of comedy, coming-of-age storytelling, and a touch of romance - all wrapped around a very raw, human plot-line that virtually everyone can relate to. I'm no spring chicken myself, but I found myself deeply connected to both main characters - one who is older and basically dejected with life as he knows it, and one who is younger but who feels lost, aimless, and disconnected from both family and friends. And admittedly, not everyone will have a direct parallel to these experiences, but even if you don't, you're in for a story that's bound to tug at your heartstrings... and make you laugh out loud in the process.This is a high-quality movie - from the impeccable acting to the beautiful on-location cinematography to the relatable, thought-provoking plot, every element is executed with pinpoint precision and finesse; it's a testament to the art of storytelling on the silver screen. Director Alexander Payne knows how to create an artful film, and \"The Holdovers\" is no exception. It's at once indie and art-house while simultaneously being mainstream and easily accessible; in short, it's a film for everyone that actually feels like a genuine crowdpleaser instead of a pandering mess.I'm having a difficult time describing what I liked about this movie, and the reason is because I liked almost everything about this movie. So why the 9 out of 10 rating instead of the perfect 10? Literally the only thing that's holding me back is because I would've liked a touch more romance; yes, there was romance here, but a bit more would've pushed me over the edge into 10 out of 10 territory. Besides that, this is basically a perfect film, one that I loved, and one that has become one of my favorite movies of the year, if not of all time. I am genuinely looking forward to rewatching this, and I can't wait until it becomes closer to Christmas so I can view this on my own TV, cuddled under blankets, with a glass of whiskey, and bask in the absolute heartwarming experience that is \"The Holdovers.\" My recommendation: Do yourself a favor and watch this as soon as you can - you won't regret it.",
    "70": "Here is a film that feels and looks like something out of the early seventies. The Holdovers is a strong and warm-hearted piece that gives actors roles with powerful lines, without any reliance on flashy editing and being overwhelmed by special effects.The story is simple three people get stuck for the Christmas holidays in a boarding school. It's cold, lonely, and boring for the parties involved. The adults drink to cope with whatever pressures they live with. The young man resorts to bad behavior and altercations with the teacher in charge.Through the vacation period these people will get to interact and get to know each other, something that will prove to a challenge to say the least. As the story evolves, we get to understand what has made the people who they are. We get to feel their pain and frustration through the very insightful writing of the director.It's a strong film with superb acting by the main leads. They have great chemistry together.Most outstanding is Paul Giamatti who plays the tormented and defensive man with relish and speaks volumes with his eyes.Hope the academy honors his performance as the best the year because no one else so far is coming close.",
    "71": "Do you miss how they used to make films in the 1970s? Plenty of filmmakers do, except they take that nostalgia and just do watered down versions of better movies. As an example see Taxi Driver and King of Comedy then watch Joker and you'll get what I mean.Thankfully, Alexander Payne has managed to take his sentimentality and make an original film out of it. Or if The Holdovers is a pale imitation of a superior picture then the filmmaker has managed to trick me because I don't feel as if I've seen this movie before but done better.Now to be clear, there aren't things you've never seen before in the movie. I mean, you know the characters are going to bond at some point. And people will grow to care about each other. That's a given. How we get there, however, is what makes the film seem fresh and entertaining and ever bit as good as any flick made back in the day.I hope more people see it.",
    "72": "It's a comedy-drama set from December 16, 1970, to the first week of January 1971 in an exclusive boy's boarding school in New England and Boston, Massachusetts. It follows the experiences of the \"holdovers,\" that is, the students who cannot go home over the Christmas holidays and the two Barton staff left to supervise them during the holidays.There are five holdovers: Teddy Kountze (Brady Hepner), Jason Smith (Michael Provost), and Angus Tully (Dominic Sessa) are upper-class wealthy WASP students. Alex Ollerman (Ian Dolley) is a younger Mormon student whose parents are on a mission in South America. Ye-Joon Park (Jim Kaplan) is from South Korea.Left to supervise is Paul Hunham (Paul Giamatti), an unmarried ancient history teacher who was once a student at Barton and has taught there all his career. He's a demanding curmudgeon who almost everyone dislikes. African American Mary Lamb (Da'Vine Joy Randolph), the head cook, is also present; her son, a Barton grad, has just been killed in Vietnam.The film follows the shared experiences of the holdovers, though four students leave after a week when a wealthy father takes them for a ski holiday. Paul cannot contact Angus's parents, so he must stay with Paul and Mary at Barton. We also meet the school's headmaster, Hardy Woodrup (Andrew Garman), his administrative assistant, Lydia Crane (Carrie Preston), and janitor Danny (Naheem Garcia).\"The Holdovers\" is a delightful comedy leavened with wisdom as we learn the dark secrets that have shaped Paul Hunham and Angus Tully. Giamatti, Sessa, and Randolph are all excellent. The script unfolds the twists and turns superbly. \"The Holdovers\" is a great Christmas movie.",
    "73": "One does not expect a Christmas film to be challenging, and this one certainly isn't. But it is a lot of fun.A boys' boarding school empties of almost all staff and pupils for the 1970/1 Festive Season. Left behind are Paul Hunham (Paul Giamatti), the unpopular history teacher who has to keep an eye on the school; Angus Tully (Dominic Sessa), a teenaged pupil whose mother does not want him on her honeymoon; and Mary Lamb (the impressively-named Da'Vine Joy Randolph), the school cook who is facing her first Christmas alone since her son died on military service. As these three lonely souls come together, there are tantrums, emotional revelations, the revealing of long-hidden secrets, a noble sacrifice... the usual stuff.Also the usual stuff are the characters: Paul is cynical and frustrated; Angus is ironic and insecure; and as Mary is overweight and black, she of course has to be sassy.But while in some films such predictability would be annoying, it works here. Within the limits of their somewhat two-dimensional personalities, the characters are well-written - even Angus' tantrums do not seem unreasonable. Plus, there are some great gags (\"You hit him? You mean you punched him out?\" \"No, I hit him with a car...\") And I will not be the only viewer who finishes the film with a lump in his throat.Great fun. I can easily see myself buying the DVD and watching this for many Christmases to come...",
    "74": "Mid-way through \"The Holdovers,\" I started openly weeping in the movie theater, and I pretty much kept it up on and off for the rest of the movie. Sometimes, there wasn't even anything obviously sad or moving happening in the scene, and I still couldn't stop. I think it's because this movie is so kind, and kindness is a rare commodity these days. It's sad to think that a movie about characters learning to have compassion for each other and for the hardships they've been through should feel like such a rare beast, but here we are.This is Alexander Payne firing on all cylinders as a director, and though he didn't write this movie, it feels like he could have. It's an obvious throwback to the kinds of movies Hal Ashby made throughout the 1970s and is touching in exactly the same way \"Harold and Maude\" was. It's also a master class in acting from the three principal characters played by Paul Giamatti, Dominic Sessa, and Da 'Vine Joy Randolph, and I hope all three of them, and the movie overall, is remembered come Oscar time.This will easily make my top ten list for the year.Grade: A+",
    "75": "The Holdovers is, for all of the character dynamics and dysfunction and depression and other things we find out about the leads, mostly with Mr. Hunham and Angus and how their characters over these couple of weeks turn away from the \"Barton\" way of not telling lies (because, well, sometimes context and the moment matter for telling a lie that won't really hurt, maybe), a strangely comforting film to watch. Not for all of that exactly, though what we understand slowly but surely is this is all material for comedy and tragedy in equal measure, but because of the feeling that we get with a filmmaker who is so primed and confident with material that you don't feel like it can go wrong.What is more impressive is that, as enjoyable as the first half is, it is in the \"I like this\" mode as we are introduced to this world and Hunham and Angus and Mary, but it doesn't feel so special. But I should have known Payne and writer David Hemingson were laying down the necessary groundwork for what comes the moment a) the majority of the other supporting characters leave for reasons I don't have to mention here, and b) then the characters go outside the Barton campus grounds on a holiday party and then a \"field trip\" to Boston, you get the sense moment by moment and interaction by interaction it is so sharp and cutting and wise, and one scene in particular makes the jump into \"oh, OK, this is taking off into another level of personal pain and about familial expectations and what will come with in a life measuring up to others - and why that is wrong - and... yeah, it's great\" territory.In other words, it's the kind of film I want to watch again right away simply because now that I know a little more about the characters, I'll want to experience all of the extra textures (its 1970 down to the wood paneling and the car seats), and dig a little more into those absolutely wonderful natural restrained and complete performances - we take Giamatti for granted sometimes and this is a character he should be proud of to craft, lazy-ass eyes and all; Sessa's first role and he is an immediate star; I can't be more sure of anything for the next Oscar's that, if Randolph is nominated, she will win, if nothing else for everything she does at the Christmas party scenes, and a moment looking over some objects in a room later on is so moving - and my comfort is in seeing Payne clearly loving directing this intimate character study where he can show what a comedically observant, quick witted, and heartbreaking story this all is.It's one of the best Christmas movies in several years, embodying many themes and ideals that fit like a 70s wool sweater, and I'm sure the first thing Payne must have thought after reading the script was \"whoa. This is gonna be the best Hal Ashby or Bob Rafelson movie never made... is 'The Last Holdover' too on the nose?\" Even Hunham would give this... a B+ probably (did he ever give As? Shrug).",
    "76": "\"I find the world a bitter and complicated place. And it seems to feel the same way about me.\" Paul Hunham (Paul Giamatti)Teaching privileged boys at an elite new England prep school called Barton (think for example, Philips Exeter), might be the pinnacle of an academic's career. But not Paul Hunham in The Holdovers, an elite movie itself of the year.Paul should be teaching classics at an ivy school, not teaching entitled \"vermin,\" among the many sobriquets he tosses around about the fortunate young men to experience his brand of grumpy intellectualism and misanthropy. He prepares them for a world that won't always be coddling and protecting them as their family wealth so naturally does in their early years.Director Alexander Payne worked with Giamatti in Sideways, so he is prepared to have another winning cynical character who is endearing while distanced by negative temperament from normally positive fellow humans (Paul's last name, Hunham, suggests a distant connection with the better angels of humanity).As Paul accepts the assignment to supervise holdovers (exiled to Christmas vacation in the absence of parents or guardians), the number whittles down to just Angus Tully (Dominic Sessa, reminiscent of young, Timothy Chalamet and Adam Driver), who shares Paul's dark attitudes and, with the sharp writing of David Hemingson, some witty dialogue- e.g., about Paul he says, \"I thought all of the Nazis had left for Argentina.\"Although, as in likeminded dramas such as Dead Poet's Society or Goodbye, Mr. Chips, the principals are destined to be transformed into more humane characters, Holdovers continues, even in its denouement, to accentuate the unsunny side of life for Paul and Tully, whose fortunes are still compromised by cold-hearted parents and administrators. The chilly world, however, is warmed on these lovely, snowbound days, by women, viz., the cook, Mary (Da'Vine Joy Randolph) and administrator Lydia (Carrie Preston).Mary good-naturedly deals with the death of her son, Curtis, a Barton grad who had to join the military because he did not have the resources as other Barton grads of the late '60s did to avoid the draft.Lydia, an attractive middle-aged staff member, holds the promise of a love interest for Paul, only to show how difficult it is for social exiles to enter the romantic mainstream.The Holdovers is a small gem of a move that will immediately remind buffs about Hal Ashby comedies of the same era like Harold & Maude, where character development is paramount and detachment from the mainstream is required to look at humanity clearly with its foibles and endearments.The Holdovers is a movie everyone can enjoy with endearing characters who share with us our moments about loneliness peppered with the possibilities of love and happiness.\"Do you think I want to be babysitting you? No. I was praying your mother would pick up the phone, or your father would arrive in a helicopter or a flying saucer....\" Paul Hunham.",
    "77": "I am big fan of director Alexander Payne (The Descendants, Sideways) and of actor Paul Giamatti in particular. Both have teamed up before with marvellous results, but this movie has got 1 problem that made me only rate it with 6 stars though:The bad:the middle part of this story stretches out too long, with several quite tedious scenes, which could have easily been cut out of it without hurting the storyline. I started watching at my watch half way through several times because of this lack of spark and punch. Such a pity!Fortunately this movie picked up momentum again towards the warmhearted Christmas spirited final, but I still will only award this movie with 6 stars (instead of 7) because I got bored at many moments during the somewhat tedious and long middle part.The story: It's about a young student and his teacher, who both are lonely souls and although they cant stand each other at first, eventually slowly do bond with each other during a Christmas holiday. Acting by Paul Giamatti is masterful (as always), BUT some of the other actors fail to impress me.Not the best of director Alexander Payne's work, but definitely still worth a watch, because it left me in my seat with a smile on my face and a feel good Christmas spirit of caring for one another!",
    "78": "Finally......a GOOD movie. The story/script, although not a breakthrough idea, was heartfelt,full and real.The settings were also real and gorgeous (not really a cgi fan)\nCamera, cinematography, lighting,sound,score....every level made my eyes and ears satisfyingly full.Acting was oscarworthy across the board.Directing was brilliant.Only negative I can come up with is that the pace was a bit slow, but so much of the movie is so focused and so superbly and beautifully made I just sat back and enjoyed it.A very thoughtful substantial and beautiful movie. A rare gem in today's superficial gimmicky movie making world.",
    "79": "As \"The Holdovers\" (2023 release; 133 min.) opens, it's 1970 and we are at the Barton HS boarding school in New England as the Fall semester wraps up. Paul Hunham, a teacher of classical studies and a curmudgeon, gets summoned by the head of school, and is told he will take charge of the 4 or 5 \"holdovers\", students who for one reason or another, cannot go home and need to stay at the boarding school for the entire Christmas break... At this point we are 10 minutes into the movie.Couple of comments: this is the latest from director Alexander Payne (\"Sideways\", \"The Descendants\"). Here he brings to the big screen what life is like in Fall of 1970 among a group of privileged HS students along with their testy classics teacher and a Black woman who runs the kitchen. On the surface of it all, this looks to be a terrible combination, but as the movie plays out, more and more is revealed. The movie is plot-heavy and I shan't say another word on that. Paul Giamatti, a regular of Payne's prior movie work, brings what I feel is one of his strongest movie roles ever. Da'Vine Joy Randolph is outstanding as the Black kitchen supervisor with a heavy heart. Dominic Sessa is frankly too old (33 in real life) to play the rebellious HS student Angus (17 in the movie), I mean, it's really really obvious. That said, Payne just hits all the right notes in this film, and this resonated with me on so many levels. Despite the serious undertones, there are quite a few funny moments in the movie as well.\"The Holdovers\" premiered a few months ago at the Telluride film festival to immediate and widespread critical acclaim. There is good reason why this is currently rated 87% Certified Fresh on Rotten Tomatoes. The movie opened at my local art-house theater here in Cincinnati the weekend before last. The early Sunday evening screening where I saw this at was attended so-so (about 12-15 people). If you are in the mood for a top-notch comedy drama, I'd readily suggest you check this out, and draw your own conclusion.",
    "80": "I have always had a great respect for Alexander Payne. While an American director, his films (usually) stayed away from the typical American predictable, simplistic, good guy/ bad guy stereotypes and easy solutions.The Holdovers has an interesting premise and interesting main characters: a nerdy history teacher, a troubled student and a sad cook. The depiction of high cost private boarding schools is pretty realistic and the characters are well contoured. There are some clever dialogues and some intelligently constructed scenes. The plot keeps one engaged from one end to another of the film.Having said that, one leaves the cinema with the nagging feeling that this was not quite what one expects from Mr. Payne. In my opinion, he \"sold out\" to mainstream American cinema. The bad guys are really bad; the good guys, well, God bless them. There are some \"deus ex machina\" solutions (a helicopter landing on campus - really?) and the eventual explanations for everything going on was quite contrived and simplistic, in the good ol' Hollywood tradition.A good film for a Netflix evening - definitely.Something Mr. Payne can put on his resume along \"Sideways\" and \"About Smith\" - not so much.PS: The film is rated R. Why? Because there are a few swear words and some people smoking and drinking?",
    "81": "Set in December 1970, \"The Holdovers\" follows a small group of students who have to stay on campus over the Christmas break at Barton Academy (a prestigious boarding school in Massachusetts,) alongside a curmudgeonly ancient history teacher (Paul Giamatti.) That sounds like a potentially amusing premise for a breezy comedy-drama, especially when Alexander Payne is directing. Having greatly enjoyed and admired several of Payne's previous films such as \"Sideways,\" \"The Descendants,\" and \"Nebraska,\" I was looking forward to this film. Overall, I found it to be simply fine and not up to par with the level of quality of most of Payne's films. There's nothing too wrong with it by any stretch of the imagination, but it's often generic and forgettable compared to Payne's other films.An indie dramedy like this film would generally be expected to be defined by being character- and writing-driven. Unfortunately, neither the characters nor the writing here are especially unique enough to structure a compelling plot around. Paul (Giamatti's character) is very generic, as is the rebellious student Angus, whose relationship with Paul is a pivotal part of the film. On a better note, Da'Vine Joy Randolph gives a strong and impactful performance as Mary, a cafeteria worker dealing with bereavement; her character is interestingly more dynamic and multi-dimensional than either Paul or Angus. The writing and humor is less unique, funny, or engaging than many of Payne's films, as the attempts at plot devices, character development, and humor often boil down to insult comedy between Paul and Angus--which, ultimately, wears out its welcome a bit, and actually causes a bit of collateral damage in making the film's tone and story feel less sincere. Regardless of the sincerity of the story, another thing that is clear here is that there needed to be a stronger and less predictable core to the plot in order for the film to remain engaging for its 133-minute runtime.The film's retro, 1970s-aesthetic is commendable and helps contribute to the atmosphere of the film, and there still are some sporadic sweet moments of Paul and Mary hanging out around the television and a few decent jokes here and there. So \"The Holdovers\" is a fine enough film, but it won't be a new holiday classic for me. 6/10.",
    "82": "Nearly 20 years after \"SIDEWAYS,\" director Alexander Payne and actor Paul Giamatti reunite in this worthy addition to your seasonal film rotation. Let me just say, Alexander Payne did a wonderful job bringing back teenage school movies with coming-of-age films from the '70s into the modern era. When I first saw the trailer for this film, I knew it was going to be a wonderful time watching it! It has so many good jokes and brilliantly written one-liners in it! It's got a great sense of heart with comedy, and without spoiling the ending, it has deep and profound relationships with the cast.This movie wasn't shot on a soundstage; it was filmed at five Massachusetts academies to depict its fictional New England boarding school, Barton Academy. Filming began in Massachusetts on January 27, 2022. The crew filmed on location at Groton, Northfield Mount Hermon, Deerfield Academy, St. Mark's School, and Fairhaven High School. Director Alexander Payne doesn't disappoint. Comparing it to some of my other favorite films he's directed, such as \"Nebraska\" and \"The Descendants,\" which were also excellent! This was shot on a very unique film stock as well, giving it a very vintage '70s appeal. Payne has mentioned that he took inspiration for making this movie from films like \"Loneliness of the Long Distance Runner,\" the movie \"IF,\" and another feature called \"Merlusse.\"This movie will tug at your heart at the end and make you laugh from the beginning. This movie was tailor-made specifically for Paul Giamatti, and it doesn't disappoint. I don't want to spoil the ending for people; go check it out yourselves. I wasn't expecting this movie to end the way it did; that's all I will say. But it is deep and full of impressive emotion, dealing with some very challenging things I wasn't expecting from this movie. I will say this movie is for an older audience but is young at heart. A pleasure to see Alexander Payne and Paul Giamatti work together again!",
    "83": "Who gives F Plusses? Paul Hunham that's who. Paul Giamatti's character doles out failing grades of varying levels with as much frequency as he does disgust and disdain for his pupils.But hey, this is New England boarding school at the onset of the 1970's.What do I know about their grading scale?I do know this film gets an absolute A.I wondered if this film might borrow from Dead Poets Society or Catcher In The Rye, or even The Ice Storm. Something of that manner.All fine things to borrow from.I'm happy to report that it doesn't take from those amazing works but instead stands on its own in its own fantastic way for the entire running time of over two hours.I dig the opening 1970's titles and credits.The vibe remains throughout in glorious interior and exterior shots.Excellent soundtrack of the era with Badfinger, Cat Stevens and Guy Lombardo among many, many others.The sounds float around this story of a people in their own time.In the beginning, you are unsure of where this is going or when it might get going.Is this thing going to take off like The Breakfast Club?Are we going to have on-campus shenanigans?Or will it be like The Last Detail? Maybe an escape into the city from this institution of learning or some sort of road trip or something?But the fun is in all of the characters.This is about people.Alone in a time of gathering and are left to themselves to gather.It is beautiful in that way.This is about tremendous loss.This is about never having.This is about the beginning of adulthood but it is also about realizing you're far beyond the middle of it.I love all of the casual cigarette smoking and hard alcohol consumption.This is the commencement of the 1970's.This movie is also about losing what little you have and making sacrifices.It's a lovely message.Especially around the holidays.",
    "84": "Well, i normaly will not spend more than 20 minutes watching a movie/tv episode, if it has not yet Drawn me in, but due to the high rating and Paul Giamatti, i stuck with it, hoping it would \"start up\" at some point, but it never did, it just meandered along without ANY real connection from myself, nothing about it engaged me at all.It is lacking throughout and not just in parts, there was nothing to \"draw you in\", nor FEEL concern for anything going on, or any character.Paul played his part Completely as always, a real quality actor, but even he cannot inspire any real engagement with this movie.I would not pan it, nor guide people away from it, but i am bewildered at the very high rating, over 9 i think when i first looked, now at 8.2 and i expect it will drop further as we get more legitimate ratings from more viewers.It is simply NOT agreat movie at all, which c ertainly a 9 would indicate. If i were to be negative, i'd say it was more like a couple of episodes of a so so TV series and NOT a great movie.I think most watching shall be waiting for it to \"take off\" as i did, which it will not, and when the more realistic rating of around 6 settles in, people won't have such high expectations.Possibly if some dark humour had been injected into it, may have helped, but as it is, it's fairly uneventful, lacking humour, or anything to really engage the viewer.",
    "85": "It's 1970. Paul Hunham (Paul Giamatti) is a strict cynical ancient history teacher at Barton Academy, an all-boys New England boarding school. He had been a student back during the school's better days. Nobody likes him except Miss Lydia Crane (Carrie Preston). He gets the unenviable task of watching over the holdovers, students who have nowhere else to go during the Christmas holidays. Angus Tully (Dominic Sessa) is one of those students. Mary Lamb (Da'Vine Joy Randolph) is the head of the cooks.This opens with lots of 70's including the fake-old opening production credits. It does need to state the year 1970 out right. The Vietnam war is different from year to year and the movie needs to be more precise. The running time is over two hours long and the first section can be a little scattered. Once the movie narrows its focus, it really takes off emotionally. The three main leads are all great and Carrie Preston contributes some needed positivity. Da'Vine Joy has real personal depths. Giamatti is reuniting with director Alexander Payne for more greatness. The new discovery is Dominic Sessa. It's crazy that this is his only acting credit. Apparently, he attends the school where the movie was shot and they gave those kids audition to be in the movie. No matter how, the kid is full of screen presence and acts like a veteran. He really holds the screen even against Giamatti. After the slow start, the movie really picks up as a four person story, then three person, and finally two person. By the end, I am truly taken with both Sessa and Giamatti.",
    "86": "Saw this on its limited release at the Alamo Drafthouse in Downtown LA--one of Alexander Payne's best, and easily one of the best movies I've seen in a long time. That said, the story and the plot is simplicity itself, and not all that remarkable or new--it's in the execution that the whole crew hits it out of the park. Now as if my own voice as an academic isn't pretentious enough, here's channeling the POV of a stuck-up film critic from my next life:Been a fan of Payne from the beginning--I remember driving all the way to Omaha Nebraska in the middle of one of those thick midwestern fogs to catch ABOUT SCHMIDT in the theatre--so I was favorably predisposed towards the movie, not to mention towards Paul Giamatti as well after seeing him in SIDEWAYS. But the story and the movie still had to earn my trust--which it did by the time the young lead, Dominic Sessa, appeared in his initial scenes. Giamatti was funny as the teacher (some would call him cranky but I would only call him real, having taught for more than twenty years myself)--but Dominic really sold the character of Angus because watching him I was reminded of my nephew a lot who also happens to be in high school right now.Again, the plot is simplicity itself: Dominic who plays high school student Angus ends up staying over on campus between terms because his mom and stepfather switch plans at the last minute, opting to go on their honeymoon instead of staying home for the holidays. To watch over Angus two adults stay over at school too--the aforementioned teacher Paul (essayed by Giamatti) and the cook (played by Da' Vine Joy Randolph of MURDERS IN THE BUILDING fame). The latter, a single mother, also just lost her son in Vietnam. With these three main characters in the mix--admittedly very different from each other--the movie's magic is about how the drama and even comedy develops organically as a result. The fineness of execution I mentioned earlier is key here--everything works so well for us precisely because very little is overblown.Must mention that I was slightly disappointed to learn this was shot digitally with film grain added later--but I understand the choice better now after hearing the DP discuss the matter in a Cinematography podcast, where he explained how they experimented with shooting on film at first, but then realized that they would have to alter things in post-production anyway given the \"70s film look\" they were going for.",
    "87": "The Good:The movie gives a wonderful homage to 70s filmmaking without overplaying its hand. The shots, the colors, the set, the 1.85:1 ratio, it all fits the bill without looking like major effort was put into itThe colors, the indoors v. Outdoors atmosphere, the wide shots of the boarding school and the snow are just wonderful. Some of the best I've seen in a whileAll 3 major characters gave very respectable performances. Giamatti is on his usual A-game, Randolph brings a lot of nuance to the scenes she's in, and Sessa absolutely kills it considering it's his feature film debutThe movie has a very \"feelgood\" vibe to it. It is a perfect family viewing and, my bet is, in a few years, it will be considered a Christmas classic.The Bad:I was surprised it lasted 2h20min considering it felt like 3h20min. In terms of plot, it definitely covers more ground than I thought it would, but I think the slow setup kneecaps its pace a little bitThe plot is basic. Way too basic. There is a grumpy teacher and a rambunctious student, and they hate each other, but they're both kinda good people, and they are locked in a boarding school for 2 weeks over Christmas. What do you think was gonna happenThe late 60s folk choice was way overplayed. The same 2 minutes of the same Cat Stevens song is played 3 times. It desperately tries to get you to feel something, almost to a point where you feel a little cheesed about itThe Verdict:Holdovers is a delightful \"Christmas\" movie. Even though you know where it is trying to take you, the trip ends up being quite pleasant due to strong cinematography and great main actors.7/10.",
    "88": "2h13m - Ugh, once again, why does Netflix think that movie length no longer matters just because most viewers stream them at home?Paul Hunham is a horrible little man who spends most of the movie complaining about his students and how uneducated and uninspired they all are, but isn't it his job to inspire and educate? He's a total disgrace as a teacher and as a human.He's charged with caring for a group of kids whose parents lived in an era before legal abortion was an option so they did the next best thing: they sent their unwanted offspring off to boarding school. The fact that they can't even be bothered with their kids at Christmas really drives home the argument for Planned Parenthood and all of its services.Old professor Crabby is not fun and wants to turn the holiday weeks into a juvie prison. In a desperate attempt to add balance and humor to the already foundering ship of this movie, they bring aboard the sassy Black lunch lady. Did I mention she has a dead son? Viet Nam. None of this matters because the lunch lady can't keep this thing afloat and she mostly sits it out on the sidelines smoking and drinking.The kid mouths off to a working-class guy playing pinball. Unlikely that some skinny little rich twerp would do that.Sorry, but a couple of off-hand Latin aphorisms isn't the same thing as a good script.Lots of time with no really big moments. This is the eye you should look at? That's the big reveal at the end? Weak.",
    "89": "\"If there is no love lost between Paul and Angus in the beginning, David Hemingson's slightly astringent, drolly belligerent, predictably benevolent and familiarly structured (the bittersweet consequence is pretty much in the offing) script ascertains that after a profound interpersonal bonding, both will become a better person, and that's the Christmas spirit that could and does melt our hearts. Along its character-driven, secrets-divulged narrative, THE HOLDOVERS ticks all the boxes concerning what makes human contact the raison d'être of our existence. On the one hand, Paul's hardened loneliness and uncompromising pedantry betrays the shaft he has received before whereas Angus's apparent recalcitrance and wry mordancy are the phenotypes of his own deep-set insecurity and dread caused by his original family; on the other hand, Mary's character arc is relatively simplified, still doesn't go much beyond the \"magical negro\" stereotype brimmed with pithy one-liners, maternal sensibility and steely dignity, yet, her own personal grieving process is confined with stock signifiers (drowning her sorrows, putting on a strong face and pining over children clothes), though Randolph is a phenomenal player, par excellence.\"read my full review on my blog: Cinema Omnivore, please google it, thanks.",
    "90": "Endearing, Intimate and Sweet. Encouraging start to the awards season makes for a promising year in film.One of Giamatti's finest performances - refreshingly understated - bravo Paul 👏. Deserves Best Actor in Leading Role nomination.In addition, Deerfield Academy student Dominic Sessa got this, his first movie role, via on campus auditions - an amazing discovery and performance that is worthy of Oscar attention.Ensemble cast highly competent, including a spotlight supporting performance by Da'Vine Joy Randolph that is also Oscar-worthy.Period film circa 1970/71 set in the land of New England Prep Schools. Messaging positive and the film safe for adolescents and older. Like to see this film come in with at least 4 awards nominations including one for the brilliant Sceenplay by David Hemingson.Ignore the promo trailer production which fails to capture the atmosphere of the film.Highly recommended!👍👍",
    "91": "Despite what the film promises to be from the outside, i.e., a humorous, lighthearted feature, there's a strong undercurrent of emotions here that hold the capacity to both devastate and mesmerize our state of mind!While the banter and the playful nature of the narrative will lift your spirits high, the grief-stricken individuals sharing their life stories (or tragedies, to be precise) with each other will make your heart melt, and you will shed some tears.Those moments will teach you a life lesson: you do not, or rather should not, judge anyone without knowing what they went through or what they had suffered!'The Holdovers' is one of those rare Christmas movies that presents humane emotions in their rawest and truest form.Suffice it to say, I enjoyed it. I had a good time.",
    "92": "Heartwarming films for the holidays are something we're all supposed to love, right? Well, if you're talking about the works of directors like Frank Capra, George Seaton, Michael Curtiz and Chris Columbus, you'd be correct. But, since it's been so long since we've had releases of that quality, in recent years, viewers hungry for such movies have been glomming on to anything that even remotely approaches such titles, whether or not the accolades are deserved. And that, in my view, sums up my feelings on the much-celebrated new feature from director Alexander Payne. This tale of a curmudgeonly, condescending, middle-aged, fuss-budget prep school teacher (Paul Giamatti) assigned to babysit a group of rambunctious students who are unable to be with their families for the year-end holidays has a premise with considerable potential that, unfortunately, is squandered by a narrative that feels loosely stitched together and ultimately comes across as patently undercooked. Indeed, what could have been a fun-filled romp a la a Christmastime take on movies like \"Dead Poets Society\" (1989), regrettably, comes up decidedly short. Admittedly, the film has its share of modestly funny and warm, fuzzy moments, but many of the scenes don't flow smoothly from one to the next, creating a storyline that feels forced without delivering the goods to make a release like this work. While it's true that the film succeeds (surprisingly) at depicting the mostly one-dimensional characters' requisite personal evolution over the course of the picture, that almost-accidental accomplishment is seriously overshadowed by a series of plot elements that largely feel thrown together, incorporated without a terribly great amount of thought and an undeniable lack of cohesiveness. And, to be honest, the picture's most interesting character is the academy's chief cook (Da'Vine Joy Randolph), whose richly layered persona (and deftly nuanced performance) runs circles around those of its other two principals (Giamatti and Dominic Sessa as one of the stranded students). It's disappointing that a director as talented as Alexander Payne has churned out a project as half-baked as this one is (particularly one that comes across as self-satisfied with itself as this offering often does) when compared to previous titles like \"Nebraska\" (2013) and \"The Descendants\" (2011). And would-be viewers should be wary of many of the inflated claims and awards season buzz being showered on this offering. But, in an age in which moviegoers are looking for pictures that provide the kind of holiday cinema comfort they so desperately crave, it's understandable that such viewers might be drawn to a film like this. It's just such a shame that they won't find what they're looking for in this one.",
    "93": "Alexander Payne's (Downsizing/Citizen Ruth) current release in theaters starring Oscar nominee Paul Giamatti. It's 1970 & the War is on but at this New England university Christmas break is upon the teacher/student body but a passel won't be going home since they don't have any port of calls to receive them so they have to stay behind chiefly among them Dominic Sessa who ends up being the sole person left (the rest are picked up by a helicopter which provides a ride for the stranded). Giamatti, a history professor, who rules (at least he believes!) w/an iron hand soon butts heads w/Sessa which culminates when during an act of defiance, trips & falls dislocating one of his arms. Their differences are soon aired out w/the intervention of the head cook of the university, Da'Vine Joy Randolph, the pair finally start to warm up to each other, especially during a faculty member's, Carrie Preston, invite to her Christmas party which loosens them up so to speak. After the gala, Giamatti & Sessa head to the town proper, have a meal, catch a movie (Harold & Maude, how apropos!) & facilitate a visit to Sessa's father who's being held at a sanitarium which finally lands Giamatti in hot water for transpo'ing a student off campus w/o his parents' permission. What's going to happen? As is the case w/films of this ilk, the end of the journey is not as important as the journey itself & Payne acquits himself nicely w/returning champ Giamatti (nearly 20 years after their collab w/Sideways) but since Payne didn't have a hand in the script (which he usually does) the film feels like a pastiche of the time period it's set in w/the appropriate tunes & wintry climes to put audiences in the mood to watch something from another time & place but when you do a shout out to Harold & Maude (itself a journey between 2 people from different age spectrums), Hal Ashby's counterculture hit complete w/a Cat Stevens tune on the soundtrack (which featured prominently in the earlier film), you risk having people feel wistful about the originator rather than this handsomely mounted carbon copy.",
    "94": "The goal of The Holdovers is very clear from its very first images: to make a film in the style of a movie from the late 60's , early 70's. The rating card shown before the movie is in the format of the period, as are the production company logos and the opening credits. And everything that follows seems aimed at that overarching goal.Let's talk positives: the Holdovers achieves its goal. The color, the grain, the camera shots all look very much like a movie from the late 60's, early 70's. Not necessarily one of the best -more Love Story or Barefoot in the Park than Faces or Barry Lindon- but hey, to each their own nostalgia.The problem is it doesn't achieve much more than that goal. The characters fail to come to life. The story is a bit slow but more importantly, fails to touch our hearts. Too busy trying to \"look like a movie from the 70's\", it lacks a purpose. Ironically, it's this concern with \"looking like someone you're not\" that could bring The Holdovers closer to the psychology of its teenage characters. But that self-awareness never surfaces and all you're left with is an inconsequential limited distribution movie.",
    "95": "3 main characters with each having a story that will touch your heart directly. Told through a once in a lifetime acting performance from Paul Giamatti who portrays the perfect role of the hated history teacher, Dominic Sessa, who is just a young boy trying to have a Christmas break like every other young boy, and Da'Vine Joy Randolph, a grieving woman who misses her family.As the story progresses, we experience a beautiful two weeks that the 3 main characters are stuck on together. The story develops and we start to know more about their personal lives, their experiences, and who they really are as individuals.I can't put into words how enjoyable, comedic, and heart warming these 3 weeks were, told in a runtime of 2 hours 13 mins. The customs, make up & hairstyle, interior & exterior design, soundtrack, and the cinematography that made the film look like it was shot using an old camera. These elements were all able to portray the vintage vibe of 1970.",
    "96": "Yep. This rules. A beautiful return to form for one of the greatest comedy directors of the last 30 years. While it doesn't quite reach the excellence of Payne's dark comedy masterpieces (his first three films: Citizen Ruth, Election, and About Schmidt), it does sit perfectly with his fourth film, which was his breakthrough and one of his most celebrated, Sideways.This is fantastic because it's a movie you could go see with your grandma and you'll both be likely to love it just as much. It's far from a traditional Christmas movie but it's a loose one that will surely be referenced in the future, and is surely your best bet if you like to go to the movies with family around the holidays.Paul Giamatti puts in an iconic performance as the ultimate grump, Mr. Hunham. I think he might be one of the great film grumps of all time. ALL of his dialogue is outrageous, and hilarious. I do think this movie actually has a lot of replay value now that I think of it, and it's primarily because Hunham's role is packed to the brim with memorable quotes and perspectives so uptight it will take you to another realm of lameness. Da'Vine Randolph adds a lot of warmth and more humor to the film - I was introduced to her through the controversial series The Idol, in which she very much stood out. All the teenage actors are fantastic as well, and lead Dominic Sessa delivers a wonderfully dynamic performance. This isn't a movie about plot so much, but rather a character study that is hilarious and surprisingly endearing, and its greatest strength outside of its humor is in the effectiveness of its characters arcs.From the opening credits, this feels like a classic film, perhaps even one that would have come out the same year that it takes place, that being 1970. That makes sense because cinema was a hell of a lot better then. See this if you know what's good for you. Payne is a king.",
    "97": "I remember reading about a fellow who said, the times of sarcasm, lazy cynicism, the cheap protections we use in our day to day to buffer us from the pain and disappointments in life must be discarded. This was the first thought that came to me after watching The Holdovers.I didn't know what to expect when I started watching it. What initially felt like the usual boarding school dramedy, suddenly fell away and left another kind of film that, while still using the cliched \"gruff teacher shows callow student his potential\", was totally unexpected.There was something so honest, truthful and innocent here, despite the heaviness of each character's underlying story. It was the stripping away of artifices in a time of upheaval (that is seems innocent in retrospect) that made this a film one to want to live in... pain and all.PS: Soundtrack is perfect!!!",
    "98": "Paul Giamatti does not attempt or hold up to anything Mr. Chips aimed to do in this 135-minute-too-long story. Overhyped and not well marketed, the Holdovers fails on so many levels it hurts the credibility of both Paul Giamatti and Alexander Payne. While trying to be another Dead Poets Society with its setting. It does not even come close. Elements of Outside Providence and Mr./ Hollands Opus are sprinkled throughout the storyline but fail to add up. Dominic Sessa is unable to catch up with Paul Giamatti's acting ability. His addition to the cast holds back the story. He is unrelatable and has not enough back story that makes anyone care about his situation.While others in the story have more interest and are given less to work with. With that said, Da'Vine Joy Randolph is a pleasant surprise as her addition to the supporting cast is a win. Her back story garners interest from the audience as every scene she is in draws the audience closer into the story. Although the overall attempt of a movie is worth the watch, it takes too long for the story to begin. By the time we begin to care about the characters, much of its potential audience has given up on The Holdovers. Although the movie has its flaws, I recommend you hold out for the second half. The Holdovers is worth it.",
    "99": "I'm delighted that I got to see Alexander Payne's The Holdovers on VOD before compiling my end-of-the-year list (because even someone as brilliant as me is no less a slave to calendar dates than the rest of you), but the decision to release it this way hasn't exactly delighted everyone.The film's success (relative to the number of theaters it was in) probably means that someone somewhere is regretting that they didn't give it a longer theatrical run. Those who did catch it in a theater - and are about the same age as me - typically report that they were the only non-senior in attendance, reminding me of when I saw the latest Roy Andersson movie at my local culture house and was the only one there younger than 60; woulda been fun (and thematically relevant, in a way) to vibe with old-timers at the movies again.Regardless, The Holdovers is a massively cozy film that I'm sure will climb to the status of \"Christmas classic\"; a love story that's truly about love and how we all want/need some form of it. It also bolsters that Paul Giamatti is not only one of the modern titans of acting, but also possesses, to paraphrase another reviewer, one of the best and most expressive faces in the business. I'm almost uncertain if that lazy eye of his was prosthetic or if he can just make it do that.In the movie, he portrays a strict and old-fashioned boarding school teacher in 1970's New England (whose vibe is palpable throughout and the visuals achieve the \"film from the 70s\" look near-flawlessly), who is tasked with spending Christmas break overseeing the \"holdovers\", students who are forced to stay on campus over the break for various reasons, chief among them Angus Tully (wonderful newcomer Dominic Sessa), with whom he eventually shares an unlikely bond. Da'Vine Joy Randolph (Dolemite is My Name) is no less wonderful as the grieving school cook.This is, in short, a mightily loveable film. Depending on how I feel about it after letting it sit with me a while, you might hear me talk more about it when I do my 2023 list.",
    "100": "Rating: 8.7\nOverall, a profound coming-of-age dramedy that really embodies the time period it is set as the performances (especially Paul Giamatti's) coupled with the writing really shows the impact loneliness has on people at different point's of their lives, although the movie is held back by playing too much into the time-period as it can only do so much with following the 70s Christmas trope.Very Good Direction (Employs a very traditional 70s storytelling style as it feels like he uses works from the time period (and some from the 80s) to influence how the story is told; controls everything well on a macro; really excels in on a micro-scale as the group scenes and especially the one-on-one scenes really drive the movie forward with its emotion and comedic moments), Very Good to Great Acting (Great from Paul Giamatti (Somewhat of a spiritual successor to his performance in Sideways as he carries off the smug demeanor of someone who suffers from digging their hole further into loneliness), Great from Da'Vine Joy Randolph (Does a great job working off of Giamatti and Sessa as she acts as the mother-figure for the main cast and embodies someone who is dealing with the trauma of loss; embodies the New England working class), Very Good from Dominic Sessa (Has great chemistry with Giamatti as he embodies someone trying to find his place in the world (and looking for Giamatti to be that unexpecting father figure in his time of loneliness)), Good from the rest of the cast (Play their role well (especially the child actors), but the film is mostly the main cast)), Very Good Story (The story is pretty simple and laid out well as it draws from many sources of inspiration to embody something made in the 1970s-80s (which kinda hurts it from being unique and going above and beyond); the character writing is very good to great as you get to learn about who they really are the more you get to know them (to where Giamatti's and Sessa's character are actually a lot more alike than they thought); the story elements are interesting and the flow is pretty similar to that of a Christmas/coming-of-age movie), Great Screenplay (The dialogue is very of the time and flows very well; the jokes were funny and embody movies from the time period; the symbolism was very prominent as it helps provide the message of finding purpose and the dangers of loneliness; the foreshadowing was pretty typical of movies from the 70s-80s (which made the movie pretty predictable)), Pretty Good Score (Helped establish the time and the Christmas tone), Good Cinematography (Gave the movie a very 70s multi-cam feel), Good Sound (The slapstick feel helped give the movie a 70s-80s feel), Good Editing (Felt very 70s and helped with setting the tone and time period), Plot Structure was pretty formulaic as it followed something from the 70s (but it does do a good job at having the plot elements build on each other), Pacing was a bit on the slower side (but this helped with giving the 70s feel); the runtime maybe could have been cut 10-15 minutes when the conflict was introduced to provide more emphasis on the relationship between Giamatti and Sessa's characters, Climax was executed very well as it is a real epiphany moment for the characters and invokes a lot of feel-good emotions from the audience (was definitely some of the best dramatic moments of the movie), Tone was very similar to Christmas movies (like A Christmas Story)/Dead Poet's Society/70s movies as this helped give the movie a throwback feel to the time period it is set, Saw a premiere at Austin Film Fest.",
    "101": "I'm glad Hollywood continues to make (bittersweet) films like this. And by films like this, I mean simple-yet-dramatic stories about difficult (by perception) people. Alexander Payne has always been a master at emotional storytelling, and here too, he does no less. The Holdovers is going to feature among my Christmas season regulars hereafter. What can I say, the film is brimming with WARMTH. Like the most wholesome version of it there is! The three protagonists are not going through the best of times, and while the whole world is celebrating Christmas (and the winter holidays), they're left behind due to reasons not entirely theirs.I've always liked films with characters that are hard to crack. They tend to come with a very realistic, very emotional core, even when their outward demeanor might indicate otherwise. That's the case with our protagonists here as well, and the more we get to know them and their vulnerabilities, the easier it is to like them. Payne only dresses the frames with typical Christmas imagery when the characters start shedding their stiffness and begin to showcase their inner psyches. There are plenty of heartwarming scenes, and it doesn't make sense to single them out as the writing (by David Hemingson) is almost like viewing life as it is. The Hal Ashby comparisons are completely valid.Paul Giamatti, Da'Vine Joy Randolph, and Dominic Sessa shine in their respective roles, and Randolph for sure, is due for some recognition in the award circles. As a concluding note, I'll say this.. only a few films manage to give me that \"floating cloud\" feeling, and this is definitely one of those.",
    "102": "Not your typical popcorn flick, more of an indie film vibe, centered around a cranky history teacher stuck at a remote prep school over the holidays with a troubled student who has nowhere else to go. It doesn't feel like an actual story happening but more more like just people who got stuck together, unwillingly. Not thrilling in the traditional sense, it's a mellower movie.It is character driven story. We witness an unlikely trio bonding and, by the end, see them undergo significant life changes, well mostly two of them, Mary seems content where she is. All three are united by grief, mourning either a loved one or an unrealized life.Been watching Paul Giamatti in billions for years now and that's what I associate with him most, other than \"Mouthful of air\". He plays someone who's just as damaged as his students. And Da'Vine Joy Randolph, liked her role more here than the idol. Just realized it was a boys school, i do think she put in an amazing, emotional and memorable role. Along with Dominic Sessa, I loved that all the characters had good depth to them, and ample screen time too.It was written really well, had heartwarming moments and impeccable comedic timing. I didn't expect it to be as funny as it was, especially considering how it started. I wouldn't say it has a comedy vibe, but is littered with little funny qiurps throughout. It got a few laughs, but they were pretty good laughs.While it doesn't reinvent storytelling or characters and lacks groundbreaking arcs or narration, the film weaves together nicely. It does well in delivering what it set out to be.",
    "103": "The director of masterpieces such as Election and Nebraska is unfortunately relying on a very clichee formula story and bombarding us with beautiful warm winter images with a lot of sentimental music because probably deep down, he's very aware that story -if there's one- is quite shallow and relying on a very old formula with having no other dimension. I was really looking forward to Alexander Payne's next movie -even after Downsizing was less than satisfactory- but unfortunately we see here many cardboard characters.It could be argued that these three main characters each represent another positive side of American experience with teacher being the historical roots reaching back to Romans and Carthages, the boy being the rebellious youth moving forward and the lady being...well the diversity. Maybe this formula works for American audiences who will surely embrace this film during their festive period but from where I look, experience was rather dull and an unfortunate copy of Dead Poets Society.",
    "104": "The Holdovers is a truly special, wonderful, and most of all, wholesome film! They don't make movies like this anymore! Frankly, if you would have told me that this was a classic film from the 70s I would have believed you! From the look and feel of the film, to the type of story it tells, this is the type of film I miss seeing so much! It feels like the type of movie that you watch every holiday season, curling up under a blanket near a fire while it's too cold outside. It's cozy. It's sweet. It's funny. And it's heartwarming. What I would most compare The Holdovers to is films like Dead Poets Society. I loved watching this teacher and student come to find understanding in each other and overcome their differences while finding similarities. It's just so pure and enjoyable. I loved this movie - it's an instant classic for me and one of the best this year! And I was surprised to feel this way, I didn't expect much and when it started I was doubtful, but before I knew it I was completely sucked in and never looked back. The film has such a great sense of grief and joy mixed together - it is beautifully bittersweet! Paul Giamatti is superb as the tough teacher, Da'Vine Joy Randolph steals every moment she's on screen and Dominic Sessa is a revelation. Each are masking deep pain under the surface in this empathetic, heartfelt and funny film. The Holdovers is a return to form for Alexander Payne - it's his best since Sideways - and it is quite possibly one of the best holiday films ever! Light-hearted and comedic while also having a sense of darkness and a lot of heavy emotion to it. Definitely one of the most heartfelt films this year! I LOVED it!",
    "105": "Paul Hunham is an History teacher at Barton's who has irked the headmaster for failing the son of one of the Donor. He is a strict teacher and disliked by both students as well as his colleagues which is fine as he even dislikes them. He is put incharge of 4 holdover students who for various reasons have to stay back at the boarding school during Christmas holidays. Angus Tully is the 5th holdover as in the last minute, he is forced to stay back. He is a smart student who doesn't have friends and constantly triggers others. How does Paul Hunham and Angus Tully bond over the period of two weeks along with the cook Mary forms rest of the story.For what is worth, this is right up there with Past Lives as the best film of 2023. I simply loved this film thanks to solid performances by Paul Giamatti as Paul Hunham, Dominic Sessa as Angus Tully and Da'Vine Joy Randolph as Mary Lamb. There were multiple scenes that stood out right from the rebelling Angus, clashing with Paul at the school. These two unlikely personalities bonding over was truly worth watching. The screenplay revolving around these 3 characters, dug into their emotions perfectly and kudos to the director Alexander Payne for having yet another feather on his cap. It was a dignified approach in handling the characters where even simple gestures made my heart ache.Strongly Recommended.",
    "106": "An academically adroit but emotionally troubled student is thrust into sharing company with a tyrannical and reviled history teacher at a New England prep school in the early 1970s during the holiday break. Their lack of chemistry at first makes for an ordeal but as the days pass and they get better acquainted, they recognize how much they have in common. They discover they share the fierce drive for academic excellence but also privately yearn the respect of their peers.Paul Giamatti is a commanding presence in this role, as he draws on facets of his past roles to put together a performance that is wondrously complex and which in the hands of a lesser actor, might have been a one-note portrayal. He's the perfect combination of Chuck Rhoades' bullying and Miles Raymond's intellectual righteousness. Newcomer Dominic Sessa matches him with an equally compelling performance as the promising student from a family in ruins.This is the kind of holiday tale that was never new and never gets old. In the end, everyone in the story has learned something. It's a joy to watch this kind of old school storytelling flourish the hands of director Alexander Payne and the performances he draws. Highly recommended if you like good Christmas entertainment.",
    "107": "This is one heartwarming story which will envelope you with its old world charm dealing as it does with the events which take place in a school in USA in 1970. The three characters at play are a grumpy history school teacher Paul ( Paul Giamatti), a teenaged restless and mischievous student Angus ( Domoinic Sessa) and a matronly grieving head cook Mary ( Da'Vine Joy Randolph). The narrative plays out during the last two weeks of December particularly during the week commencing Christmas. The three diverse characters have not gone home during Christmas break for different reasons and are the Holdovers during the Christmas break. Paul has no home to go to since he has no family, Angus's parents are on a holiday themselves and for Mary the school is now her home because she has lost her young son in the war in Vietnam.Director Alexander Payne has presented an emotional movie which will move audiences of all ages. Scenes of bittersweet complexities of human relationships are shown well. The highlight of the movie is the acting of Paul Giamatti who lives in the role of a cranky senior. He has made the character relatable through his facial expressions and natural dialogue delivery. Equally impressive with their convincing portrayal are Dominic and Da'Vine. All three performances are award worthy. The cinematography has beautifully captured the locale of the school surrounded by snow. Music has been used effectively.",
    "108": "A Nice film.When a kid is forced to stay at his Boarding School during a winter break, he develops a friendship with the school's guardian and his most hated teacher. On their get-to-togethers, they discover much more about each other and see through each other's eyes.Practically would have been taglined \"WITH A Christmas they'll all will remember forever.\" If things are classically released still.This is in theory basics of great filmmaking. Simple yet memorable characters, a very complicated backstory and just enough sentimentality. Nothing fancy, and this film is the perfect storm of that. Its kind of sad that this is muddled down into a pile for a streaming site. Especially since this simple yet effective filmmaking is shockingly missing in a lot of films.Everyone in the film did well. The story is wonderfully written. Wonderful touch to use older stocks to add the vibes to seventies' vibes. I do think that this could definitely have a bigger arc BUT not all films needs to be big.Acting wise, Giamatti does the most with a sublime role. Both Sessa and Randolf were welcome additions.Overall, recommended.",
    "109": "The movie you are referring to is \"The History Teacher.\" This heartwarming film tells the story of a cranky history teacher who finds himself stuck at a remote prep school during the holidays. He is paired with a troubled student who has nowhere else to go.\"The History Teacher\" explores the unlikely bond that forms between the teacher and the student as they spend the holidays together. Through their time together, they not only learn about each other's pasts but also find solace and understanding in one another.The film beautifully captures the essence of human connection and the power of empathy. The performances are outstanding, particularly from the lead actors who portray the teacher and the student with depth and authenticity. The story is engaging and thought-provoking, delving into themes of redemption, forgiveness, and the importance of second chances.The cinematography in \"The History Teacher\" is visually stunning, capturing the breathtaking scenery of the remote prep school and its surroundings. The film's soundtrack adds an extra layer of emotion, enhancing the overall viewing experience.Overall, \"The History Teacher\" is a heartfelt and touching movie that explores the complexities of human relationships and the transformative power of compassion. It is a must-watch for those who appreciate character-driven stories and meaningful narratives.",
    "110": "Movie critics often sway public opinion, influencing individuals' decision-making when choosing films to watch. It's disheartening to witness a movie garner rave reviews from critics, only to find it personally underwhelming. Similarly, a low-rated comedy might surprise you with its humor and entertainment value.The inconsistency in ratings across different films highlights the subjective nature of movie criticism. What resonates with one person may not resonate with another. Instead of blindly following critics' opinions, it's crucial to form your own judgment based on your unique preferences.Take the example of \"The Holdovers\" and \"Genie.\" Despite critics' praise for \"The Holdovers,\" I found it unentertaining, while \"Genie,\" rated lower, struck me as heartwarming and funny. This perfectly demonstrates the subjectivity of film criticism.Embrace your own cinematic taste and don't let critics dictate your viewing choices. Explore different genres, directors, and actors to discover hidden gems that resonate with you personally. After all, the joy of cinema lies in the personal connection you form with a film, not in catering to the opinions of others.",
    "111": "These are not your typical holdovers, this trio of of people who seemingly have absolutely nothing in common except for their individualistic misanthropies, and who would have or could have ever had the foresight to realize this trio would be forced together through the magic of screenwriting. This is a paint-by-numbers tale, worth hearing only because the acting is good and Paul Giamatti's lazy eye will have to fight Bradley Cooper's prosthetic nose for a spot on that shelf of honorary Oscars right next to Will Smith's open hand.The Holdovers is presumably Alexander Payne's attempt to apologize for Downsizing, a disappointingly small effort which will go down in the annals of movie-review aggregators for being one more film we all wish Christoph Waltz had had the temerity to tell his agent: \"Thanks, but money ain't everything.\" It is hard to imagine being an accomplished director, let alone being an accomplished director who would be excited for the chance at reputational redemption once upon reading the screenplay for The Holdovers. The plot of The Force Awakens feels fresh in comparison.If the worst one could say about a movie is that it is \"unwatchable,\" The Holdovers presents us an exemplary chance to describe a movie as \"milquetoast watchable.\" It also would have been better to title it \"Warmed-up Leftovers.\"",
    "112": "The Holdovers is a profound coming-of-age dramedy that perfectly captures the 1970s era. The standout performances, especially Paul Giamatti's nuanced portrayal of a lonely man seeking connection, paired with the thoughtful writing, spotlight the impact isolation can have across one's life. While the adherence to 1970s Christmas movie tropes grounds it in the time period, it also hinders the film from being entirely unique.The direction employs a traditional 1970s style, drawing inspiration from classics of the decade. It excels at both the macro level, with well-controlled pacing and tone, and the micro level, using emotive group and one-on-one scenes to propel the narrative forward.The acting shines, particularly from Giamatti, who delivers a performance reminiscent of his Sideways role as a smug yet sympathetic character battling loneliness. Da'Vine Joy Randolph likewise impresses as the mother-figure for the makeshift family, conveying the resilience of working-class New Englanders while dealing with her own loss. Dominic Sessa's chemistry with Giamatti perfectly captures his character's journey to find belonging. The child actors and supporting cast all deliver solid performances that round out the ensemble.At its core, the story follows a simple coming-of-age formula, enriched by complex character development that reveals more depth as relationships form. While not wholly unique due to its adherence to the era's tropes, the thoughtful character writing and pacing make for an engaging journey. As expected in a 1970s Christmas dramedy, the symbolism highlights the quest for purpose and dangers of isolation. The foreshadowing, while predictable, stays true to the period.The technical elements, from the soundtrack to the cinematography and editing, transport viewers seamlessly back to the 1970s. The slapstick sounds punctuate humorous moments. While the plot structure follows a predictable formula, this remains consistent with the homage to 1970s classics. The climax provides an earned, feel-good epiphany that delivers the dramatic and emotional payoff.Ultimately, The Holdovers excels as a poignant 1970s dramedy that finds humanity in its lonely characters as they discover the true meaning of family. While firmly grounded in the conventions and style of the era, Giamatti's standout performance paired with thoughtful storytelling make for a rewarding journey.",
    "113": "Right from it's 70s style opening credits, Alexander Payne declares that his newest movie will be a throwback pastiche complete with a faux 35mm film look digitally captured and processed by Eigil Bryld. Set in 1970 at a private boarding school, THE HOLDOVERS centers on a grumpy old professor, Paul Hunman (Paul Giamatti) who is placed in charge of a small group of students who are left behind for the Christmas holiday. A deus ex rich dad arrives to whisk way all but one student - the troubled Angus Tully (Dominic Sessa). The only staff are the cook, Mary Lamb (Da'Vine Joy Randolph) and maintenance man, Danny (Naheem Garcia).David Hemingson's screenplay follows many familiar beats with the teacher and student battling wills, a sad backstory to the cook, the usual Holiday kerfuffles, bittersweet homilies...laughter, tears, a road trip, life lessons and a mostly predictable ending. The New England settings are handsome with bucolic scenery and appropriate music. The trip is to Boston in winter which is a sight to see.For all of that, Payne and the cast greatly elevate the material. Giamatti (who has become this generation's Richard Dreyfuss) brings levels and nuance to his character which aren't apparent on the written page. Hunman is dislikable in many ways, but the performance humanizes him. Sessa, Garcia and Carrie Preston (as a school assistant who sees the best in Hunman) are all good in support. Randolph steals whatever is left of the film that Giamatti doesn't have a firm grip on. She is simply excellent.Hemingson's writing is warmer than usual for Payne's films (he usually has a credited hand in the scripting - not here). It's less cynical and credibly moving without being cloying. Payne has succeeded in making a movie that pays tribute to the many character driven films which marked the American cinema of the 70s while still feeling contemporary in its own right. Bravo.P. S. On a personal note, it was a joy to see one of my favorite movie theaters in the land, The Somerville Theater just outside of Boston used for a scene where two of the characters catch a movie - appropriately enough, a counterculture film by Arthur Penn.",
    "114": "I took my wife to this film and when explaining the plot to other people, I noticed that a lot of them didn't take the premise seriously:\"What? A movie about a teacher at a boarding school looking after students who aren't going home for the holidays? And it's set in 1970? That's the movie you're going to the cinema to watch?\"We don't get movies like this released widely anymore, and when you're talking about Christmas films, I can't think of a classic made in the last 6-7 years. They're either Hallmark kitsch or need some sort of narrative innovation: Santa fighting bad guys, a deaf guy fighting bad guys, a Christmas stoner comedy etc. For us to be treated with a simple, straightforward film about love, family, and human connection is a treat and so needed in todays film landscape.I'm sort of downplaying what makes this film special. Alexander Payne is such a great director, it almost feels effortless. The performances are fantastic; Paul Giamatti is an amazing actor who excels in basically everything, so it's surprising to see how notable he is in this film. There's so much depth and complexity to his character and performance. A curmudgeon, sure, but a guy you genuinely root for and want to see succeed, because you know he has a good heart. A man who knows everything and nothing at the same time. Dominic Sessa, in his acting debut, is fantastic here. His character, Angus, could've been an irritating person in lesser hands, but instead, he's a witty, fun, likeable, if not frustrating young man that you don't mind hanging around with. Him and Giamatti have excellent chemistry and their relationship is the heart and soul of this film. It's incredible.Rounding out the main cast is Da'Vine Joy Randolph, who brings so much heart and pathos to the role. She's the poster woman for pushing through grief and trauma, and standing up with a smile regardless of the pain. And she's also the best character to drive home what this movie is really about: the holidays bringing out the best in us. This film is so earnest, so sweet, and sincere, that I don't think anyone with at least one positive memory of the holidays could hate it.This movie is also visually gorgeous; one of the best looking films of the year and completely committed to the 70s aesthetic. This is a special era of film and I feel like film makers will always go back to it for as long as film exists. And this movie is exemplary as to why; it's such a visually and culturally distinct era: the brown wooden panels, the corduroy and dress shirts, the music. Payne and his team made a film so authentic in its depiction of 1970, you'd be forgiven for forgetting it was made in 2023. There's also a strategic aspect to this as well: I don't think an era of film has captured social realism quite as well; the patient restrained nature of filmmaking in that era just works so well.I could go on and on about this movie, but honestly...the best way I could describe it is as a warm hug. It's a movie where you kind of don't want it to end, and you'd love to just spend as much time as possible in this universe and with these people. Like the best Christmas movies, it reminds us why it's such a special time of year. I'd watch this again in a heartbeat and I genuinely don't think there's anything wrong with it as a film.",
    "115": "Movie The Holdovers directed by Alexander Payne ( also directed 2 of my favorite movies Sideways and The Descendants) is focused on teenagers in a boarding school in a beautiful location in MA during Christmas break in 1970. All the \" rich brats\" get to go home except 4 students who are left behind due to different reasons. History teacher Paul Hunham, disliked for his grumpy unpleasant personality ( actor Paul Giamatti known for many interesting roles)is forced to stay back to monitor students.. After a few days, only student Angus Tully ( newcomer Dominic Sessa), Teacher Paul and cook Mary lamb ( actress Joy Randolph) are left on huge school campus /grounds. Angus, a teenager, longs for simple white Christmas holiday with his mom who changes plans in the last minute. Angus's desire to go to Boston, skate, have a real Christmas is expressed very well. The interaction between Angus and his dad is extremely sensitive and depicts longing for normalcy in a child , longing for love , parental affection and desire to have a normal happy healthy relationship with mom and dad. The similarity between Paul and Angus way of dealing with life behind fabrications with given circumstances is very well depicted. Occasional glances from Mary Lamb who understands 2 humans who are so different and still so alike is Oscar worthy. Alexander Payne depicts relationships very well. Dominic Sessa as Angus is excellent and very impressive in his first role as an actor . His childish tantrums and then his responses to extreme emotional display of Mary Lamb during a party are noteworthy .Paul Giamatti is impressive as angry, bitter, lonesome alcoholic who has made peace with his own lifestyle. I just cannot shake off the innocence and childishness of Angus and his happiness displayed during Christmas break when his simple desires were being met by rude and kind teacher Paul. Oscar worthy acting. Oscar worthy Direction. 2hr13min long ..needed some editing.",
    "116": "I think this is what commonly happened during the holiday season: the unplanned loneliness, boring days, the awkward moments.. and even though it was set in the 1970, I think the situation is still relevant to these days... Also, I like that it bring the slow pace..because sometimes those bored moments just made it seemed the clock's ticking slower... And this movie captured it perfectly.This is surely different from the other christmas movies where they're trying to bring more joys.. I think this movie just reminded us that we have to swim through some uncomfortable time, and if we had enough patient, something's good might happened in the end. I think this movie just the cup of tea needed to warm the lonely hearts, especially during the holidays.. and for me, every scene absorbed us to those moments entirely.Thank you very much for making this movie, it was a great one and all the actors brought their best here. Mr. Giamatti was a great Mr. Hunham!",
    "117": "The live show I was planning to see tonight was cancelled unexpectedly but I decided since I was out, I'd go to a movie. I wasn't planning on seeing a Christmas movie. I just remembered seeing a preview earlier this year of a Paul Giamatti movie and thinking it looked interesting. I had completely forgotten it was about the people left behind on campus during the Christmas break. I went in the theater thinking how tired I was of the trend of super violent Christmas movies or bubble gum stupid comedies trying to be the next Die Hard or Elf. I certainly was not prepared to get exactly what I was looking for in a Christmas movie.I kinda feel like it's the perfect holiday movie for people like me. I love the holidays but there are certainly moments where I feel like I'm on the outside looking in - sometimes by choice, sometimes by happenstance. Not to sound cliche, but I laughed, I cried, I left feeling lighter. What more can you ask for from a film?Very smart, quiet picture. And I enjoyed it very much indeed. Exactly what I didn't realize I needed this holiday season.",
    "118": "A bittersweet holiday movie with great acting, perceptive and funny writing, wonderfully bleak, wintry east coast cinematography, an excellent, early 70s music score (minus the obligatory Cat Stevens, that is) and a relentless steering away from the expected and the usual in holiday fare, this film is a glorious return to form for director Alexander Payne after the \"Downsizing\" misadventure. All three lead actors are great but if you were to put a Marcus Aurelius to my head and force me to choose I would express a preference for Paul Giamatti's irascible, feckless Mr. Hunham. This is a competitive year for best actor Oscars but I sure hope this fine fellow breaks through and nabs at least the nomination he should have gotten for \"Sideways\".My only criticism is that David Hemingson's otherwise good screenplay tends to caricature some of the subsidiary characters like the too political headmaster and the racist lout of a student, Kountze.Bottom line: As a private school movie this is head and shoulders and feet on the desks better than \"Dead Poets\". A minus.",
    "119": "Or, Dead Poets Society in a Christmas setting.A pragmatic English teacher at an elite prep school in an early seventies setting, is forced to spend his holidays at campus, joined with some disappointed students, and the female cook, a widow that lost her son only a year before. Obviously lonely, however not for obvious reasons but armed with Latin phrases, and profound quotes like Cicero's, he humbly accepts since the teacher who was supposed to, managed to get out with a lie.Honoustly, after seeing the movie I first had to look up again if this movie was really made in 2023 and not a remastered classic I somehow missed. It oozes 1970's, from the playing titles to the filming. From the calmness and none explosive, sequency after sequency images everyone can watch as well as the consequent haircuts of the men with sideburns and longhaired older boys. Of whom most of them only see the school as nothing more than a stepping stone to a prestigious University, regardless their interest and blatent lack of intelligence, just because alumni daddy pays for the study. Accept for one, officially (and for a reason) introduced, Dominic Sessa (as the well played only intelligent and emotional struggling later on protegé of Giamatti's character) of course the one that's get left behind. And like the poster suggested, we do get to see these three characters together, and better, get to know them better. However though we do get to know them better, I wish we got to know them even more. The movie has a long enough play time, if they got rid a little earlier of the Ski-trip-boys we may would have. I would have love to have seen even more of evolvement of Giamatti's character in a romantic, Dickensen way especially this holiday season not even in the movie but irl (with Carrie Preston, a beautiful play). Also why students don't seem like him I doesn't hit me, he seems like an honest, passionate, firm but fair teacher, who only threathens to 'discipline' with after school chores after a fight.. But I guess it would have been too tacky if he did in an outspoken way. Why make it a Dickinsonian movie stuffed like a turkey with another outdated over-due nostalgia feed of clichés, just because it's Christmas. I actually like the half open ending. And the recycle of it at the end, of which you know it's going to be different.. And give us audience, finally, something to think about again. As well as the story of mrs Lamb, Da'vine Joy Randolph, you will want to get to know her better. A huge supporting role in this movie, you love her from the beginning, you want to sit next to her and watch a 'boring' re-run tv showMaybe we, with we I mean me, have gotten used so much to good series because movies as simple and clean like this are getting rare. This movie brings back nostalgia into movies again the old fasioned way. And that has nothing to do with the lack of cell or smart phones, or old fashioned - now hip - haircuts, many movies now are made pre- internet considering the period has so much more to offer in suspense, tension and uninterupted private moments. It helps a lot and it has a lot to with the absence of it all, as well as a simple bit thoughtfull script and some top of the class acting. With a little wink to Robin Williams in Giamatti's own style.However, entre nous, if this movie would come to a serie show, I would very much watch it untill then, Carpe Diem.",
    "120": "It's okay to not like a film. But to not like it and then explain Why with examples, examples that are not opinions, when they are not even correct, is foolish.Several sub 5 star rating commenters have complained that a 30 year old actor shouldnt be playing a 17 year old. 1) Dominic Sessa is now 21 in 2023 and was 19 during filming, portraying a high school junior who was held back 3 times because he kept getting kicked out of schools. He even explains his being a bit older than a typical junior situation to a classmate IN the film. 2) Some reviewers claim the film is falsely labelled as a comedy then say it has no comedy. Although what is funny, like beauty, is subjective, the film is objectively funny, amongst other things. 3) complaining about editing of conversations to cut them off before completion. It is as if these people watched a different film. There are no conversations that are cut off abruptly. 4)claiming that the same Cat Steven's song is played 3 times in a row, from the same verse each time...huh? 5) complaining about focal length of shots....are you joking? There are more goofy ones too. I rated it a 10 even though it's a tiny bit lower, just to help offset these nonsensical low 1 ratings. Watch and judge for yourself, but pay attention. If its not your cup of tea that's okay. But it is a well made film.",
    "121": "It's the most wonderful time of the year, or so they say. We must always remember that Christmas isn't necessarily a joyous experience for everybody and for many people out there who are alone on the holidays or dealing with recent loss, it can be difficult. Alexander Payne's The Holdovers is a fantastic, bittersweet Yuletide comedy drama that serves to remind us all just that and shows us several folks who, left to their own devices in a holiday situation out of their control, find family and fellowship where they can, making the most out of it. Paul Giamatti gives one of his customarily excellent and boisterously heartfelt performances as Paul (naturally), a gruff teacher at a posh Massachusetts boarding school for boys sometime in the 70's, a stylistic aesthetic that Payne leans into right down to details like a grainy, retro Universal logo. Paul is tasked with looking after the 'holdovers,' boys who aren't jetting off somewhere with their families for Christmas and will be instead spending it on campus, with him. One in particular is rowdy, wise beyond his years Angus (newcomer Dominic Sessa) and the two clash royally at first. Now from the trailers I almost expected something overly treacly and cloying but Payne and his actors have something far more organic, earned and realistic in mind in terms of the drama. These two connect on a level that unfolds situationally as it would in real life, and as an empty holiday stretch gives them ample time to get to know each other, the setting aside of one's differences and eventual bond feels valid and important. Da'Vine Joy Randolph gives brilliant supporting work as the school's head chef who has her own tragedy she's dealing with and tags along with these two on their introspective Yuletide misadventures. With gauzy, cozy cinematography, a soundtrack of subtly well placed Christmas carols and a script that levels with us and its characters every step of the way, this is dramatic storytelling at its best, and one of the finest films of that (sometimes) most wonderful time of the year.",
    "122": "Set against the tranquil backdrop of a New England prep school during the Christmas break, \"The Holdovers\" is a poignant and heartwarming film that explores the power of human connection and the transformative impact of unexpected friendships. The film revolves around three individuals from different walks of life, each grappling with their own personal struggles, who find solace and companionship in each other's company.Director Alexander Payne masterfully weaves together these three characters' stories, creating a tapestry of human emotions that resonate deeply with the audience. Payne's signature blend of humor and pathos shines through, capturing the complexities of human relationships and the delicate balance between self-preservation and vulnerability.The film's ending, which I won't spoil here, is both surprising and deeply satisfying, providing a fitting resolution to the characters' journeys of self-discovery and connection. It's a testament to Payne's ability to craft stories that linger long after the credits roll, leaving you reflecting on the transformative power of human connection and the enduring resilience of the human spirit.Overall, \"The Holdovers\" is a cinematic treasure, a heartwarming and poignant tale of unexpected connections, second chances, and the enduring bonds of friendship. With its stellar performances, insightful direction, and captivating narrative, it's a film that will stay with you long after the final scene.",
    "123": "If you watch the trailer, you'll see how it is filmed in a 70s pastiche, but excellently done. From the crackling film to the fonts used in the titles, the panning of the camera, the type writers, the scenes, this was expertly filmed. Indeed even the story line brings you back to an era where people made proper stories for their films. Certainly the best antidote to DC and Marvel universe CGI rubbish.So, the acting was spot on. Although the three leads were all good, Da'vine managed to get a sob out of me at one particularly moving moment. In no way does it work hard to get emotional effect, it is subtle and shows the beauty of each of the characters hearts, though each one is pretty unsightly in their own way (skinny tall teen, cock-eyed teacher, overweight cook). The supporting characters were also interesting, but the main story revolves around the developing caring relationship between the grump lonely teacher and the dejected and rebellious skinny teen. Definitely a worthwhile watch, especially on a Sunday afternoon and especially if you're over 40 and can appreciate how well they've made it look like a film from the 70s. Overall quite heart warming and touching without being at all cheesy. Congratulations to the team that made this.",
    "124": "I'll start off by saying three things about this that I think most audience members will say after watching it: 1) it wasn't what I expected; 2) it's not the big warm fuzzy the trailers made it out to be; and 3) it's really very good.It's the kind of drama (with real life humor as opposed to schtick or antics) that delves deeply into the personal background of the three leads. Giamatti, Randolph and Sessa bring depth to their characters, and while each experiences some growth/closure during the story, it never devolves into schmaltz. We're used to seeing Giamatti do this, but Sessa as the disaffected student and Randolph as the aggrieved and world-wise cook make this more than a one man show, and the movie shines because of it.Director Payne (Sideways) likes bringing a fully dimensional feel to his films, and this one leans heavily into its 1971 time period, right down to the opening credits and titles as well as the cinematography. I could have done without the deliberate graininess of the cinematography, but it doesn't hurt the overall movie.The stereotypical secondary characters almost create tropes, so shallowly are some of them written, but the central story pulls things back to the core plot each time.Go into your viewing knowing that this movie shares a spiritual brotherhood with The Dead Poets Society and Sideways, and not movies like Wonder or A Christmas Story, and you'll likely enjoy it very much.Recommended.",
    "125": "The Holdovers is hopefully the catalyst needed for a resurgence in real nostalgic filmmaking. The film fully embraces the time period with care. (Hence all the gray heads in the theater trying to relive their heyday, haha.) Even forgoing the technical aesthetics, the set design and dialogue are fabulously crafted to resemble 70s culture. The film is rift with hilarious moments and a warm Christmas atmosphere. I definitely see this becoming a holiday classic later down the road. With that being said: the film is bloated. I sense there were way too many wandering voices on what the film wanted to say. Is it a buddy Christmas flick? A coming of age story? A drama showcasing the woes of transitioning after tragedy? Well, it's all three and the drama bears the brunt.The film seemed unsure of how to effectively fuse all three genres without pacing issues. As I was in the midst of a chuckle, I had to anticipate someone on screen start to wallow in self-pity or an outburst. It seems each lead needed their moment to look right into the camera as a single tear rolled down their eye. It's a dramedy, so that's to be expected. However, it wouldn't come off as tedious if every lead didn't have some sort of baggage. It became emotionally redundant, especially since the film tries to connect with Paul Giammati's character the most. He is the heart of the story, but his arch feels less satisfying due to having to explore the other character's trauma.With all that being said, I still think this is a spectacular film. The performances are phenomenal. Paul Giamatti steals every scene, and I wouldn't be surprised if this role takes him to the award circuit. His emotional and comedic delivery hits every beat and every heart string. I can't wait to watch this film at home with a nice cup of cocoa, but unlike in the theater, I can fast-forward the jejune moments.",
    "126": "\"The Holdovers\" is a comedy drama film directed by Alexander Payne (\"Election\", \"About Schmidt\", \"Sideways\"). Starring Paul Giamatti in the lead role, as well as Dominic Sessa and Da'Vine Joy Randolph, it makes great use of its talented cast and excellent script to create a potential future holiday classic.In December 1970 in New England, Paul Hunham (Paul Giamatti) works as an ancient history teacher at Barton Academy boarding school. Due to his strict, uptight nature, Paul is widely despised by both his students and his fellow staff members. With Christmas fast approaching, Paul is forcibly tasked with supervising the \"holdover\" students who are being left on campus over the holiday break. Much to Paul's annoyance, the only student who ends up remaining is Angus Tully (Dominic Tessa), a troublemaker known for causing problems in the past. Joining them is the campus cook Mary Lamb (Da'Vine Joy Randolph), who is still in mourning over losing her son in the Vietnam War. With the three of them stuck on school grounds for the next few weeks, Paul, Angus, and Mary each try their best to get along with one another, an undertaking that proves much easier said than done.During the holiday season, I'm sure it's a tradition for many people to watch at least one popular movie set around this time. Some like to watch Kevin McCallister setting traps for burglars in \"Home Alone\", some like to watch George Bailey learn the value of his life in \"It's A Wonderful Life\", and some like to watch Clark Griswold's family mishaps in \"National Lampoon's Christmas Vacation\". As for me, I'm one of those few who like to watch John McClane save people from terrorists in \"Die Hard\". What can truly define a \"Christmas Classic\" is open for interpretation but after watching \"The Holdovers\", I have a strong feeling this film could very well fit that bill in a few years time.The film expertly plays into each of the personality traits of this trio of characters. Of course, out of the three, it would have to be Paul Hunham who is clearly intended to be the lead protagonist. Paul embodies just about everything you could dislike in a teacher; he frequently grades his students harshly and he is tactless in the way he handles their feedback. Overall, he is a very unpleasant person to be around, and other members of his faculty seem to be in mutual agreement with the students. But where Paul's character becomes interesting is in how he interacts with the two others he is forced to spend time with. It is here Paul starts to open up for the first time, and we learn that beneath his mean exterior is in fact a vulnerable, lonely man who has never been shown any real love his entire life. He secretly yearns for affection but after a lifetime of pushing people away he has no idea how to make others truly like him for who he is.Similarly, we are also shown that Angus has his own insecurities to deal with. Throughout the first act, we watch as Angus makes things difficult for Paul and the class, often interjecting with blunt questions regarding Paul's teaching methods, attracting the ire of others in the process. Like Paul, Angus is not very popular either but he has plenty of time to mature as he grows older, which is something Paul has failed to do. We later see that Angus acts the way he does as a coping mechanism for the lack of attention he receives at home. Angus longs for a family to spend time with, as his father is no longer in his life and his mother has chosen to leave her son behind over Christmas in favour of an impromptu second honeymoon with her new husband instead. As a result of all this, Angus lacks a true parental figure to show him love whenever he needs it, which has him living a directionless life.Rounding things off is Mary, the bereaved school cook who is struggling to move on from her son's recent passing. Since this story is set in the early 1970s, a time when the Vietnam War was still a contentious issue among the public, it is shown that Mary is receiving little support for her loss due to her son's involvement in an unpopular conflict. Because of this, Mary is apathetic towards most others and feels dejected from the world around her. In spite of that, Mary nonetheless continues to work efficiently at her job as a way of keeping her mind off painful memories, demonstrating a stronger level of emotional intelligence than the other two. However, she is not above breaking down in front of others if someone makes an insensitive comment regarding her methods of grieving.All three of these characters are each given their own individual arcs and thanks to David Hemingson's superb script, there are so many great dialogue scenes that allow for them to really come into their own. I particularly loved watching Paul and Angus interact with each other, almost like they are a bickering father and son unable to make sense of what makes the other one tick. There is also this scene that takes place in a bar that really shows how much they are growing as people. Here, we see Paul commit his first altruistic deed in preventing a physical fight from escalating between Angus and a drunk patron. He accomplishes this on the basis of intellect rather than brute force, which is heavily reflective of his character up to this point. Additionally, throughout the film, Mary serves as a necessary mediator between the two if things turn hostile. This is her way of demonstrating maternal instinct toward her two male acquaintances, as her son is no longer around for her to enact her usual parental duties. Each character relies on the other at some point in the story, and part of the fun is watching the ways in which one of them may assist in helping another become a better person.Thanks to director Alexander Payne, the film also has a very distinct look to reflect the time period. Although the film was shot digitally, Payne uses a specific grainy colour grading scheme to make it look like it has been shot on film reels from the 1970s, something that helps enhance the atmosphere of many important scenes. Even the opening titles use the old Universal Studios and Miramax logo from this era, which is a perfect way to establish the film's retro setting. It's also worth noting that Payne has shot the film on location, using real buildings and schools that resemble a place you'd visit in this particular decade. Numerous scenes that take place inside small bars and school kitchens are appropriately cramped along with the characters inhabiting them, which allows the audience to better understand how they must be feeling at this time.Each of the three actors all gave fantastic performances, but I think Paul Giamatti is the real highlight due to how much his character grows over the course of the film. There aren't too many actors who can play a completely unlikeable character that can change into a sympathetic hero, but Giamatti does a wonderful job here. Giamatti has always been one of those actors who adds at least one memorable thing to the films he is in and this just so happens to be one of his best roles to date. Newcomer Dominic Tessa also shines considerably as Angus, who carries his role with the right level of maturity and sincerity. For his first film role, Tessa knocks it out of the park as a troubled young man who craves love from a real family. However, my one complaint is that Angus is supposed to be fifteen but the 21-year-old Tessa clearly has a visible five o'clock shadow on his face throughout the whole film. Da'Vine Joy Randolph is also a nice addition to the cast, managing to hold her own alongside the other two. Many times throughout the film, Randolph plays into Mary's grief and depressed state, never once coming off as someone wishing to thrive on other people's sympathy. She knows she needs to move on from her son's death, but is also aware of the long and arduous healing process until that can happen.If you're craving something beyond the usual onslaught of holiday movies, then \"The Holdovers\" might just be the film to satisfy your needs. It stands tall among most other films set during the Christmas season thanks to the combined efforts of its great cast, assured direction, and first-rate screenplay. In my eyes, this film has already earned its place as a modern holiday classic, although the reach of its popularity will dictate whether or not future opinions will agree with me. At this point, only time will tell.I rate it a solid 9/10.",
    "127": "The HoldoversThis is a film that presents pain, suffering and grief internalized by the three main characters. A common theme centered around the negative ways these would manifest. I observed anger, addiction, intentional isolation by lashing out, and then judging other people for doing the same thing. It's a vicious cycle.I was moved by these themes because I have directly felt \"If you can't understand me, with no context whatsoever, then it's your fault, and I judge you for being stupid.\" Each of the three has hidden secrets, and when they are stuck together at a boarding school Christmas of 1970, they slowly emerge.Mental health struggles continue to be a not completely understood subject. Disclosing visiting a therapist, or being seen taking medication, is not very easy, even today.I enjoyed watching the aforementioned internalized emotions break free of the self, and they all start to relate, causing the rifts to heal. Understanding, patience and having the ability to pause, take a breath, and react with positivity was a joy to behold.I recommend the film for those who are either experiencing mental health issues, or know someone who is, because you might just change a life.",
    "128": "This is an old school comedic offering. Grounded in a realistic story, believable characters, and beautifully shot in a real setting. Lots of guffaws in the theater. I smiled a lot but no belly laughs for me.But as a kid growing up in the 70's, I identified with the time and place. I remember cloths like that, people with hair like that, and a general malaise that was settled over the country.Giamatti is awesome as a curmudgeonly teacher. People can't teach this way today, for fear of angering students and parents. But lets be real here. This was a time when students had to bear more responsibility for their own work. Some of the best one-liners in this movie are when Giamatti is interacting with his terrible, spoiled students.The new kid actor plays much older. And looks much older than he is. From what I've read he really was a student in the school. Somehow he finds a world weariness in his acting that shows edges of real disappointment and yearning beyond his years. Like the guy in his mid-thirties in a bar, telling his problems to a bartender. He still has hope, but life is grinding on him.And lastly. Ms. Randolph is great here. She's the cynical cop from a great show, Only Murders in the Building. In this movie, she feels different and that speaks to her acting chops. She's a wounded, grieving mother who's still able to function and empathize despite her loss.I could see Oscar noms galore for this film. Davine and Giamatti both deserve nominations. And I could see the argument for Best Director and Screenplay. I could see this as a dark horse for Best Picture too.",
    "129": "I noticed that The Holdovers had an 8.4 rating on IMDB when I wrote this. I'm afraid not, although I did give it a \"7\". This was a typical example, I believe, of people rating a movie based on its ending and ignoring the first 90 minutes that got them there.In short, the first 1/2 of the movie was slow and took a while to develop, most of which consisted of the scenes filmed at the school. But in the latter half of the movie when the characters went in to town, attended a Christmas eve party, and visited Boston, the movie definitely picked up.In the last third of the movie, the characters really started to bond, and individually grow after discovering revelations about themselves, which made for the best part of the film. And that led to a nice ending, which saw one of the characters do something they would have never thought of doing at the beginning of the story. All characters ultimately learned something about themselves, which made them better people. And that's why I think people are giving this an 8.4. But I can't go that high because of how the first half of the movie dragged on. And this might have something to do with Alexander Payne not writing the script. I wasn't aware of that until I saw the opening credits, which immediately worried me a bit.Another reason is because of Dominic Sessa, who played played Angus, Paul Giamatti's student project in the movie. For me, I wasn't able to connect with him emotionally. I just didn't feel for him like I wanted to. If this was made about 20 years ago, Toby Maguire would have been perfect in the role. The movie needed someone more like him, and someone who could keep pace with the brilliant Giamatti. Sessa was out of his league. But that's just my opinion.The movie was beautifully filmed in typical Alexander Payne style by using the landscape and scenery as almost another character of the movie. Just like he did in Sideways, Nebraska, and The Descendants.Bottom line, the film is certainly worth seeing. But I would recommend a matinee rather than forking out the full price of the movie.",
    "130": "Accessible & digestible for everyone. Heartfelt, charming, & feel-good with some very unique characters that are strangely lovable. While it's both funny & emotional, neither element is strong & feels safe overall..\n..\nAccessible & digestible for everyone. Heartfelt, charming, & feel-good with some very unique characters that are strangely lovable. While it's both funny & emotional, neither element is strong & feels safe overall..\n..\nAccessible & digestible for everyone. Heartfelt, charming, & feel-good with some very unique characters that are strangely lovable. While it's both funny & emotional, neither element is strong & feels safe overall.",
    "131": "I love movies like this. Seasonal, set in the 70's, new actors, excellent script, superb casting and directing, and Outstanding acting!! Would be filmmakers, this will be in your best of collections. Dominic Sessa's performance is exceptional. It's hard to believe this is his first film. Da'Vine is a force as she redefines the supporting cast role wringing out every drop of the script to create an unforgettable character. Then an absolute master class in acting from Mr Giamatti as the balance, the glue that helms the course of this film as you'd expect from one of our generations best actor's.. He's got the best eyes in cinema, (no pun). How Payne paces the sad to the funny is pure genius. There are moments of complete heartache. The holidays always brings out the inventory of our year(s). Struggling with the discomfort and sadness of being lonely, the three have each other for at least a few weeks. Then there are true laugh out loud moments with a less than 5 actor getting one of the biggest laughs. Set in 1970, the set, costumes, script, and incredible acting makes me want to transport to that time and be at the table with them. I'll be rewatching like I have Sideways, Wonder Boys, and Scent of a Woman.",
    "132": "Such a wonderful movie. I love the simplicity, the characters, and the way they all grow and learn together. It felt like a time capsule of the era and the flavor of the locations and era shone through. It felt like I was in the era with the characters and that was a fun journey.I did find a few parts to be a little contrived. A few scenes and also just the style were a little forced in a few spots. There seemed to be some extra drama put in the movie just for heck of it.. without it being properly motivated. Also they really messed with the sound and the image to make it look like it was shot on old film.. but that felt a little heavy handed at times too. It was still super sharp like digital.. but they added the film effects. Not a huge issue.. but just felt like it was a little overly manipulative. But it didn't really take away from my enjoyment of the movie.Saw this in the theater and it was a fun time out at the movies.",
    "133": "While not my favorite from Alexander Payne, I thought it was pretty good. It's a good dramedy Christmas movie with strong direction, interesting characters and good performances. Alexander Payne has made some good movies in the past with his works on \"Sideways, Election, and About Schmidt\" being my favorite ones from his work. Although his previous movie \"Downsizing\" was disappointing, \"The Holdovers\" is an improvement.Throughout, the narrative, while simple and predictable, it remains interesting as the narrative does have a feel good 70s feel to it and elements that did remind me of classical comedy works from Hal Ashby. Payne's direction, the camerawork, and the production design was pretty good which helped capture the setting's atmosphere and tone. All the performances are pretty good, especially Paul Giamatti and Dominic Sessa as both carried good chemistry and dialogue between one another.The soundtrack was alright as some of the musical moments was a little repetitive. The characters are interesting and while I wasn't fully emotionally connected to the characters, I found the characters still to be interesting to observe as each had interesting personalities and backgrounds explored. I think the movie is a bit too long as there are certain moments that slightly dragged on.Overall, despite the predictable story, the movie still sells well with the strong performances, ambitious tone and characters.",
    "134": "I went into this movie expecting something great due to the fact that Alexander Payne and Paul Giamatti are reuniting, but what I didn't expect was one of the best movies of the year.This movie moved me in numerous ways. It deals with subjects such as grief, loneliness, mental illness, and many more. While it's set at Christmas time, I wouldn't necessarily consider this a Christmas movie. It's a movie about friendship and how important personal connections are to humanity.Paul Giamatti is 100% getting an Oscar nom, he knocked this role out of the park, as well as everyone else involved. This might be his best performance yet. Also a huge shoutout to Dominic Sessa. This is his first major role and you can tell he's a star in the making. Without getting into too many details, this is a must watch film. I laughed, I cried, and it left me thinking about multiple things going on in my own life and how I can be a better person. Thank you to everyone involved in making this movie, this is a prime example of Hollywood at its finest. Big budgets and CGI aren't needed to make something great. This movie has the perfect formula.10/10.",
    "135": "It is Christmas break in 1970, in a boarding school for boys of mostly well-off parents. A killjoy teacher gets the task of supervising the students who are not going home (or elsewhere) for the holidays. When they get down to one last student, s troublemaker, the teacher-and-student duo end up bonding with each, oftn breaking the \"Barton boys' code\" of never lying, just to cover for each other.While this is a nice story and well acted, I find too many holes in it.It becomes apparent that that teacher really has no place to go himself over the holidays, so the plot about rotating teachers is suspect.It takes too much time to get rid of the other students, while making feeble attempts to flesh out those characters.By story and looks, the teacher is in his 50s, though they meet with a Harvard classmate of his, who is more likely in his 30s, and having just gotten tenure at his university post (easy in that era, with the baby boomers swelling the post-secondary population).The chief cook's son just got killed in Vietnam, but now her sister seems to be pregnant for the 1st time. How big an age difference is there between them?However, I did like the bits of dialogue that trashes how kids of rich and influential parents have power over mere mortals.",
    "136": "They simply don't make movies like this anymore. I went into this simply hoping Alexander Payne could recreate an ounce of the magic he captured with my all time favorite movie Sideways. I could not have been more pleased with this magical little movie.I hate modern cinema and all of the CGI, bright and loud chaos that almost everything Hollywood is pumping out these days contains.The subtleness of the sets, the throwback feel of seventies nostalgia left me speechless and so very pleased.The acting was flawless by all of the leads. Paul Giamatti can do no wrong in my eyes. His voice is so calming and pleasing and nobody today can touch his acting. The other two leads were also impeccable!I did not want this gem to end and was so sad when it did. If you love great acting and hate todays CGI-Fest Hollywood I implore you to run...don't walk to see this film!!",
    "137": "Considering that it's billed as a feel-good movie for the holidays, there's something slightly Scroogelike in admitting I didn't love \"The Holdovers\" as much as I expected to.There's lots to like though.It reunites award-winning director Alexander Payne with his \"Sideways\" star Paul Giamatti in a bittersweet coming-of-age dramedy set in a New England prep school in the last week of 1970. Giamatti plays priggish classics teacher Paul Hunham, convinced that civilization hit its zenith with ancient Greece and has been in a downward slide ever since.He treats his students accordingly, referring to them as troglodytes and reprobates.Although he bullies his students with his intellectual rigor, Mr. Hunham is hard to take too seriously. His corduroy wardrobe is stodgy, he smells, and his eyes go in different directions. \"Walleye\" is the hardly affectionate nickname given to him behind his back by fellow faculty members as well as the student body of Barton Academy.Pity the poor handful of boys who can't go home for the holiday break when he gets the assignment of babysitting them in the dorms. Among them is Angus Tully (Dominic Sessa), a bright, rebellious challenge for the by-the-rules teacher. Feeding them is Mary Lamb (Da'Vine Joy Randolph), the black cafeteria supervisor grieving the loss of her own son in Vietnam. They're a unique trinity, three broken souls sheltering in place at the allegedly most wonderful time of the year.David Hemingson contributes the script that echoes with the preppie angst of such classics as \"Catcher in the Rye\" or \"Dead Poet's Society.\" Young Dominic Sessa makes his screen debut, more than holding his half of the two shots with lovable veteran Giamatti. Sessa never seems to be acting, relying instead on the awkward anxieties of his own adolescence to make the portrayal so real.\"The Holdovers\" upends the familiar father-figure-and-son dynamics by making each of them such damaged goods. Throw scene-stealing Randolph into the mix and the movie turns into one of those rare but uplifting instances of everyone saving everyone else.Like director Payne's best work - personal favorites include \"About Schmidt,\" \"Sideways,\" \"Nebraska\" and \"The Descendants\" - the setting is a character in the story. This time it's snowy New England, offering a postcard assortment of colonial settings to come in from and get warm.While Payne's trademarks are wisdom and empathy for his very vulnerable characters, the one glitch this time is predictability. Ever since Charles Dickens created the template in \"A Christmas Carol,\" audiences have known that heartlessness stems from deep wounds and is, ultimately, a pathway to salvation. We know where \"The Holdovers\" is headed the first time we see the poster. Hemingson's script offers few surprises. It doesn't crackle. The dialogue often feels like actors reciting lines.The movie also continues a disquieting trend on screens this year, as I watch eras I actually lived through transformed into what the industry calls period pieces. Often their filmmakers were kids at the time or not even born yet.Most of the small (but much appreciated) audience for this blog falls into my demographic niche - once invincible baby boomers, now the market for CPAPs and Depends - who may know what I'm talking about.\"Authentic\" is a much used word these days, signifying things or people who are real and true. But when I was growing up in those eras that have become period pieces, the word authentic appeared prominently on the boxes of airplanes and battleships my little fingers assembled.In those days authentic referred to a replica made of plastic.On my way out of the theater after watching \"The Holdovers,\" I noticed a poster for the 20th anniversary rerelease of \"Love Actually.\" Now there's a holiday classic that still crackles with originality and warmth two decades later. That's the difference between authentic and the real thing, actually.",
    "138": "I was able to stream the movie,with pauses for natural breaks,or so I thought,after the first twenty minutes riveted by the superlative acting and characters introduced, the plot being an irascible classics history teacher working in an older generation small town public school, coerced into keeping students at school over the Christmas break for further coaching to get their grades to be accepted into the prestigious colleges, Harvard etc.As it all unfolds with the different characters introduced, the students all have personality problems, a disparate bunch, the usual growing up , hormonal,tantrums,personal tragedies,secrets yet to be revealedPaul Giamatti's character at first portrayed as a curmudgeonly teacher\ntreating his pupils as temporary inconveniences, a bit of a saga, as it unfolds albeit with a happy but also sad ending,which eventually resolves,a warm performance from all the actors. A great Christmas treat.",
    "139": "It's a great film. Don't miss it. There are a lot of very important humanistic layered stories in this film.The acting was great, all three main ones were strong and into their role. Dominic Sessa's work was exceptional as a debut! I think Paul Giamatti did his best work on this one.Such \"simple\" stories can tell a lot if you pay attention enough.Technically, it was a great film. Art direction, production design...Song choices for the soundtrack was almost perfect.Wish it has a more elaborate screenplay that was richer and deeper.There's a scene in the film in the first third of the film which you find yourself confused that how it's going to continue after that, that's the real beauty of this film.Parenthood and negligence, being a teacher, boarding school, getting lost in the routine and work and forgetting about your dreams, coming-of-age... these are the main elements of this great film.7.7/10.",
    "140": "In a age when films are pumped out dipped in agenda politics at the cost of accessibility & craft, The Holdovers, brings a refreshing & much needed change.If new Marvel films are white wine spritzers, The Holdovers, is visual cognac; deep, rich & smooth. To be sipped on and savoured.Beautifully shot, written & acted.The soundtrack is also beautiful.I so hope the film gets the accolades it truly deserves.The 70s & 80s were a time when films like this were far more common and it's apt the film is set in that time period.Well done and thank you to all involved.There's not much more to say.",
    "141": "But compared to all the iconic Christmas films out there I think it falls a bit short.The film follows Giamatti's character who's our Scrooge per se, surrounded by people around him who want him to become a 'better' human being. It's a tale as old as time. Of course, it's a reliable tale so there are some lovely wholesome moments throughout the runtime, but it also means there are many cliches that you just have to expect.From other reviews I thought it would be more moving, and while we do have the wonderful Da'Vine Joy Randolph carrying the moving scenes, the backstories to many characters resemble a Hallmark Christmas movie rather than a movie that's aiming for the Oscars. I wish that the writing could have aimed to try something different with these tropes (i.e. The main takeaway being 'don't judge a book by its cover!'), but for a Christmas film this is difficult because sticking to tradition is safer and, usually, it pays off.Overall I did enjoy the film, it gets you into the Christmas spirit, the cinematography is gorgeous and the acting is fantastic. It just suffers from lazy writing at some points, so it's down to the actors to elevate that which they successfully do.",
    "142": "Finding a holiday film that is light enough to enjoy yet serious enough to reflect upon feels nonexistent in today's movie-going demographic. What's the answer? A film set in the '70s, shot on location at five different schools to emulate Barton Academy, and a snow-glazed environment paired with countless glasses of Whiskey. The story balances its purpose by highlighting teenage entitlement along with adult humility, allowing the script to extend to audiences of most ages (still rated R). Though the plot moves slowly, it's fueled by the thoughtfulness of the human experience and what it means to live without preferences, connect in unlikely circumstances, and grow out of our own stubbornness. The tone isn't happy nor is it sad, but rather it's a compilation of complicated emotions from the perspective of two individuals who steadily develop an unlikely understanding for one another. Paul Giamatti is one of the most technically gifted actors in the world and his stylistic flavor is on fully display as the grumpy Paul Hunham. On the other hand, Dominic Sessa is vulnerable and sharp in his debut performance. Will \"The Holdovers\" become a Christmas classic? I'm not sure, but I don't think anyone would be upset if they were to revisit this film every Winter.",
    "143": "The Holdovers is a welcome return to form for director Alexander Payne, who seemed to peak with The Descendants twelve years ago. As with Sideways, he's been blessed with another incredible performance by Paul Giamatti. Giamatti is the rare actor who can play a character who starts out as a universally detestable ogre and gradually evolves into a sympathetic and caring person. His performance as Paul Hunham is a treat and is among the best of Giamatti's career. Even though Giamatti's character is the fulcrum of the story, he's amply supported by Da'Vine Joy Randolph and Dominic Sessa. As gruff cafeteria administrator Mary Lamb and troubled student Angus Tully, respectively, the two tease out the better angels of Hunham's nature. Together, the three learn how to stop being holdovers in their own lives and start living. David Hemingson's screenplay contains some of the funniest and sharpest dialog I've heard this year. At this point in his career, Payne has not only mastered the dramedy but its last cinematic practitioner. His direction invites us to embrace these characters while we laugh at their hangups and sympathize with their struggles. The movie is by turns hilarious, touching and philosophical but never sentimental. The Holdovers is one of the best movies of 2023. Highly Recommended.Detroitcineaste dot net.",
    "144": "This is one of my first ever reviews. Because I really want to convince other people to watch this movie.Where can I begin.This movie made me laugh, it made me crie, it was so heartwarming. It felt like a warm blanket on a cold night.The soundtrack of this movie is sublime.You really create a bond with the characters.You get to love them like they are one of your own. I didn't find it predictable. I wish the movie lasted even longer.The actors are fantastic in there job. The play there parts with so much convincing.I think this is my new favorite christmas movie.Just watch it, it will not disapoint.",
    "145": "The Holdovers\n9.3/10Sometimes we stumble upon a film that is so human, you know? A film that truly shows us who we are and makes us wonder and ask ourselves why we are like this?In this life, we meet a lot of people, we build relationships and friendships, once last, others fade away fast, but the thing here is, sometimes we just meet some people who look evil, bad, or even crucial; they seem to be careless, messy, etc., and we just don't ask ourselves that question: What led them to act this way? How were their lives? What happened to them? What did they experience?I believe this is the heart of the film; it tells you the story of three different people; each one of them has a story, something that made him act the way he does, whether it's loneliness, loss, pain, or the three together and even more complex... But the important thing is that when they started to interact with each other, they started to reveal themselves, to talk about their problems, their past, their choices, and their dreams, until the point where they all changed for the better, each in his own way, because when we understand the people around us, we start to understand ourselves, we start to act better and be better, and we start to be truly human.Also, I want to talk about Christmas since I personally don't have a true connection with that particular event, but still, I believe that the people who know and experience those exact feelings of celebration every year will appreciate this film even more. For those like me, please go watch this film immediately because you will see great characters, a heartwarming story, wonderful cinematography, smart dialogues, and most importantly, a lesson in this life!",
    "146": "THE HOLDOVERS (2023) is the best Christmas movie I've seen since... since ... well, in a long long time. It's one of the best Christmas movies I've ever seen and it hits hard in that dark place that sadness reigns in the brightest of times. My favorite Christmas film is IT'S A WONDERFUL LIFE (1946) and HOLDOVERS hearkens to it with the dreadful darkness of its central characters, all of whom are trapped in an elite prep school for the Christmas holidays in 1970: a curmudgeonly teacher that is uniformly hated (with reasons) by all his students, a student that hates him and has been abandoned by his mother, and the school lunch-room lady that is dealing with the loss of her only child. It pulls very few punches and has moments of stark sadness.Director Alexander Payne struck gold with veteran lead Paul Giamatti in his film SIDEWAYS in 2004. Here he rewards Giamatti with such a wonderful role in this new project; Giamatti's Paul Hunham is a wall-eyed wreck of a human being with so many flaws that it is difficult to initially root for him. His is a master class in character building and he is utterly believable, aided by a solid script from writer David Hemingson whose previous work has all been for television and shorts. Giamatti's main foil is a high school junior named Angus Tully played by Dominic Sessa, himself an actual veteran of only high school play productions. This kid is just tremendous. I hope he has a fine career if this is the kind of stuff he has as a novice. Finally, Da'Vine Joy Randolph is impeccable as Mary Lamb, who has to struggle with her own bitter reality, every parents' nightmare.The entire film is shot in real locations, at Fairhaven High School in Fairhaven, Massachusetts during the school's snowy February break. The minutiae of school life seem very well captured; as I've said before, as a rtetired teacher I always want \"the smell of chalk\" in a cinematic school and this film has it in spades. The entire piece was shot on digital cameras but post-production work makes the film look exactly like 1970's celluloid; I actually cackled with happiness at the vintage MPAA R Rating warning that precedes the film.As you can tell, I loved this one without reservation. It is a film set in ice with a warm beating heart somewhere in there, if the characters can only find it.",
    "147": "The Holdovers (2023) is a comedy-drama film directed by Alexander Payne and starring Paul Giamatti, Dominic Sessa, and Judy Greer. The film tells the story of Paul Hunham, a curmudgeonly English teacher who is forced to stay on his school's campus during Christmas break to watch over a group of students who couldn't go home. Against all odds, Paul begins to forge an unlikely bond with one of the students, a smart and troubled young man named Henry.The film has a somewhat slow start, as it focuses on introducing the characters and the situation. However, once Paul and Henry begin to interact, the film comes alive. The two characters are polar opposites, but they complement each other in an unexpected way. Paul brings his wisdom and experience, while Henry brings his youth and freshness.The relationship between Paul and Henry is what makes the film so special. It is a relationship that develops slowly, but it is deeply moving. Giamatti and Sessa give exceptional performances, and their chemistry is undeniable.The film also explores important themes such as family, loss, and forgiveness. The ending is bittersweet, but it is satisfying.Overall, The Holdovers is a well-made film that offers a heartwarming story and memorable characters. It is a film that will make you laugh and cry, and it will leave you thinking about it long after you watch it.Rating: 8/10.",
    "148": "Worst movie no matter what.1) Bad bad script. What is a point of a dialog leading to no where with no follow up.2) Bad casting. 30 year old playing a high school kid, asking for permission to go to the bathroom. Seriously!!! The writters/director couldn't think of a better dialog to fill the time?!!!3) Bad editing. Scenes were abruptly cut. Made you wonder, did anyone review the result of this editing fiasco?4) A helicopter lands and picks up the unwanted cast. What an amateur move!5) Directing: Don't quit your day job. A 30 year old pretending to be a high school kid playing hide and seek with his teacher. Did you really think this was remotely believable or cute? What a stupid waste of time.Bad, Bad, Bad movie.",
    "149": "It's a different type of xmas movie: It's authentic, relatable and heart warming with guaranteed zero Holliday cheesiness attached!Set nostalgically in 1970 in New England, a strict & bitter history teacher played by the talented Paul Giamati is stuck on campus with a handful of so called \"Holdovers\" ie some privileged private school brats who have nowhere to go over the two week break.Inspired by the screen writer's autobiographical events this movie is a bittersweet, light-hearted dramedy with a great cast!It deals with many relatable topics among others parenting, family, friendship and loyalty. It's slow but entertaining, sometimes funny and happy and other times serious or sad. All together it is very original.Its occasional deepness will hit you unexpectedly!"
}