{
    "0": "Eli Roth is a genius! This is some of Roth's best work. The social commentary on Black Friday was well played and Thanksgiving has some of the best gory kills I ever seen. I was bursting out of my seat watching some people get killed and other deaths I felt bad for even though they were not great people. It's just that no one deserved to die the way Roth had some of these folks taken out.Plus it was witty. Thanksgiving took some stabs (pun intended) at itself and it was funny.Defiantly a worth wild horror flick. Felt like I been waiting 16 years for it sense that trailer in Grindhouse and it did not disappoint.",
    "1": "There were so many opportunities for this movie to go wrong. There is nothing better than a painfully stupid concept well executed to the point that it is actually good. Thanksgiving is the only Thanksgiving slasher movie I can think of. It is really enjoyable and, somewhat, grisly in parts. Eli Roth has a a unique and twisted mind. Roth does a great job in all of his movies tempering his grotesque imagery and thematic content with humor. This is no exception. The cast is good and strong- had it been a no name Director the film would not have attracted so many named stars. Patrick Dempsey is very good. I liked it.",
    "2": "I'm so confused about how this has a decent rating. This movie was painfully boring and predictable. The acting was absolutely atrocious. The story was as bland as it comes. I love cheesy horror movies, but this doesn't even count as one. I can't tell you how many times I have seen all of the 80s slasher flicks. I will binge watch them over and over. But I will never watch this one again. It's just so bad. I can't even laugh at it. Honestly, I'm insulted that anyone would put something out that is so bad. And that people would review it so well. I only went to see this movie based off of the reviews. It seems like people have lost touch with what makes a good movie.",
    "3": "The original trailer was very raw, this film was polished like Scream 6, and its the same production company, but it was still very fun! The killer's mask was pretty weak, but the kills were fun. The opening was so damn good. I liked this film better than Saw X and Five Nights at freddys. And if you like Hobo With A Shotgun, it's not as nasty or vile as that film, but it is technically better than The Hobo with a Shotgun film we got in 2011! Also, Thanksgiving 2023 is not exactly like the grindhouse trailer...But it is fresh and I'm just glad we finally got the full length film! So if you want a new slasher, you should definitely watch this, it had my poor mom jumping and frightened...Also, Some people started arguing and ruined the film for us. Lol they even started cussing...oh well I'll wait for it to go to streaming to refresh my memory.",
    "4": "Look, I love slashers. Despite their low numbers they are my favorite subgenre of horror. I don't ask for much, a coherent story and a surprising villain. However - I draw the line at being insulted. I don't even know how this film got the funding - it is just an insult to audiences. The gore, great, and sure there are some laughs. However the story is beyond stupid, and fine I could forget that if the film was fun like \"Freaky\". However, the cast are awful, 30 year olds mascarading as high schoolers? Ok, I'll get over it. A killer who simply can't be the killer cause you just showed them in TWO places at once? I draw the line. It's insulting, and it made me so mad. All it took was a small rewrite to make something timeless. Instead an absolutely horrible film. So disappointing. More disappointing is people with no brain cells giving it 8 and 9 out of 10.",
    "5": "I'm a little stunned by the positivity of the reviews I've seen. Thanksgiving has some good surrounded by mostly bad. I'll start with the few positives. It's mostly well-made from a technical perspective. I loved the scenes of carnage and chaos. And all of the kills made my jaw drop. It doesn't hold back.Everything outside of the kill scenes is bad. I wish they leaned more into the dark fun slasher vibes. Instead they try to be serious, which magnifies how bad, bland and dumb the rest of the movie is. And while the mystery is intriguing and unpredictable, the reveal is barely satisfying.This will probably be more enjoyable if you haven't seen many movies. (1 viewing, 12/19/2023)",
    "6": "I was quite surprised yet happy to see a thanksgiving horror film getting such high praise. I went in with no expectations and only saw the trailer possibly once. Let me start by saying that this film has quite graphic kills and inventive kills at that. This film starts solid with an extremely dramatic opening and then follows the basic slasher whodunnit outline. I didn't find any of the characters interesting nor do I remember a single person's name so it was kinda hard to stay invested when I don't have a connection to anyone.After the killer is revealed the movie then rushes to the end. Not sure if the director wanted to keep the run time short or if they just didn't know how to end the film but it literally sprints to the end. If you're looking for a cheesy horror movie and just watching for fun this is for you. I just need a little more substance.",
    "7": "You must be in either middle school or high school to give this movie a seven or higher. The first 20 minutes is by far the most annoying, obnoxious scene I've seen in a while. The characters or just absolutely cringe. After that, it starts getting OK, but The fact that the sheriff ended up being the killer was just stupid. If you're trying to have a surprise twist at the end, at least make sure that character was able to be the killer. To point out the more erroneously one is the very end when he has everybody trapped at the house, cooking the stepmom and having everybody tied up and the main character escapes, then she jumps the fence and runs to the factory leaving the killer behind, she sees the sheriff laying on the ground, he just got knocked out from her ex-boyfriend Tommy or whoever w a tire iron. It would actually be impossible for him to be the killer if he was at the house for the past hour but now he\nwas fighting Tommy and got knocked out with the turn iron. Just so stupid. And that's not the only time he is two places at once.",
    "8": "Im so confused as to how there are so many positive reviews on here ðŸ˜­ this movie was so bad it was laughable (and not in a good way). The acting sucked, the plot was boring, the scares weren't even scary, and the reveal of the killer was so lackluster. I couldn't tell if the movie was trying to be funny or be serious, but either way it just did not work. Also, Hollywood, please stop caring tik tok stars in movies. There are hundreds of talented people out in the world who are waiting for their big break in films, and you're giving movie roles to people who aren't even actors. *cough cough* Addison Rae *cough cough*",
    "9": "Thanksgiving is a blast. Eli Roth's best since Hostel. Also so happy to see Milo Manheim in the movie because I love him in the show School Spirits. It's wild because the film kind of plays like a teen horror for awhile but then the gore is just gnarly, which I love, think Scream and Final Destination franchises. A love letter to 80's and 90's slashers, it's fresh, funny, and brutally gory. The whole theater was wincing and cackling the whole time. This will be a yearly holiday rewatch for sure.For fans of: Black Christmas, Violent Night, Happy Birthday To Me, Cutting Class, My Bloody Valentine.",
    "10": "My goodness, what ever possessed me to start watching this pile of utter garbage I will never know. Yes, some decent reviews did that to me, but do not trust those, trust me instead! See what I did there, eh? :) As far as horrors/thrillers go, this is bottom of the barrel. Predictable development leads you to first, then second, potential suspect, both with legitimate axes to grind, but we all know those are just decoys and the real killer is someone that will come totally from the left field, but still has a deep level motive. Yes, welcome to the usual suspense story unwrapping in most boring and predictable way imaginable. Lack of creativity from the writers leaves me feeling insulted for the 2 hours i invested in this utter pile of amateurish crap.",
    "11": "After promising \"white meat ... dark meat ... all will be carved, this Thanksgiving,\" director Eli Roth delivers,\" 16 years later, and it's a disappointing slasher that doesn't carve well. It features the worst characters I have ever seen in a slasher movie with dialogue that sounds fed through a pasta maker. Every character in this movie is a scumbag, and all we're left with is gory deaths, a killer whose identity reveal is underwhelming and Police that are so dumb they don't know if they are going left or right trying to catch the killer.If you remember \"Grindhouse\" back in 2007, \"Thanksgiving,\" was one of the fake trailers along with, \"Machette,\" and the disgusting \"Hobo With a Shotgun,\" filmed in Atlantic Canada. Roth is known for his over-the-top gory horror films such as \"Hostel,\" and \"Cabin Fever,\" and, for the first time, he holds himself back by changing a \"key\" scene from the fake trailer. I'm sure he knew It would get him in trouble because it's 2023, and the watchdogs that polarize horror films would come after him. Perhaps he thought nobody would remember the infamous \"cheerleader\" scene, or maybe it's because the ratings board would have come after him for such a scene? I will get to that.It opens on Black Friday, where a volatile mob storms the Black Friday sale at RightMart, and they are so over the top, it's not believable because the city Police would be everywhere for the chaos they are creating over free waffle irons. They storm the doors like animals, leaving several people injured, trampled and dead. Someone critical to the story gets killed, and I knew from the moment I saw this scene, It was going to have something to do with the events that unfold. Maybe I have seen too many of these movies in almost thirty years.One year later, a mysterious killer with a mask of the first Plymouth, Massachusettes Governor, John Carver, shows up with a sinister plan, targeting those responsible for the tragedy. The high school kids who sneak in through the employee entrance, Jessica (Nell Verlaque), Gabby (Addison Rae), Yulia (Jenna Warren) and Scuba (Gabriel Davenport,) provoke the mob. The owner, Thomas Wright (Rick Hoffman,) washes his hands while his wife, Kathleen (Karen Cliche,) doesn't do much else. The mob's heinous acts are caught on security camera footage that is suddenly deleted. Who could have done that?Jessica, Thomas's daughter, starts piecing together what is going on when they all start receiving cryptic Instagram posts involving a table that has been set with all their names on it. Aside from Jessica, they all have the intelligence of a wrench and serve no other purpose than to be killed because they are arrogant, dumb teenagers who are selfish. One of the girls can't put her phone down long enough to fix the fake eyelashes.One of the friends, Evan (Tomaso Sanelli) is an arrogant, mouthpiece that is so over the top you can't wait to see him die. He's an a*****e throughout the entire movie until he is caught, gagged and starts bawling. I snicked just a little bit with a sense of happiness, but It was more pitiful than the whimpering, a few minutes later. Another one gets her ears popped with Corn Skewers, basically, everything we saw in the trailer, and it's a case of trying to find this killer with a dumb police force, led by Sheriff Eric Newlon (Patrick Dempsey) jumping from one crime scene to another for most of the movie.The scene I was referring to with a Cheerleader jumping on a trampoline in the gritty fake trailer had a knife come out from under the trampoline while she does the splits, and you can figure out the rest. In this movie, the scene is so misplaced, for one thing, it feels like it was just thrown in. Someone dies in the high school while the cops stand around outside, and John Carver attacks inside.A muscle dummy sees his girlfriend in the window in a blue cheerleader outfit, and he follows her to the gym, which is pitch black. He sits on the floor, and she saunters over and turns the light on as if Roth is hinting, \"You remember that part in the fake trailer, oh my, here it is.\" She bounces on the trampoline and, she falls and gets stabbed three times. It's not even a gory kill or anything, just stabbed, and I don't even think the cops investigate her death, so It's on to who dies next.John Carver is the most interesting aspect of the movie as a killer, not who the identity is, which will keep you guessing. The mystery of the killer's sinister plan begs the question because, as a vengeful killer in a mask, it makes sense, but when you see out who the killer is, It's dumb and the motive, which I figured out at the beginning of the movie is predictable. I figured out who the killer was about 5 minutes before it was revealed.It feels like Eli Roth is cheering for the killer, and the audience should be too, which I was. The revelation as to why everything is happening is to be expected for a slasher film, in an atypical fashion, but every time John Carver showed up, I found a little bit of excitement because he is brutal. There is a scene involving an oven, and the fake trailer makes it look like someone is going to get stuffed. Don't count your blessings, it's 2023, but it's the last thirty mins of the movie where it gets nasty but not as nasty as Eli Roth could've made this movie.\"Thanksgiving\" will please the easiest of gore hounds, but It doesn't deliver the Grindhouse fashion the trailer did Because Eli Roth waited 16 years and in 2023, horror directors are scared to show the goods. The damage scratches would've worked wonderfully but instead, it's slasher violence and no nudity, which was a surprise. \"Hobo With a Shotgun\" was Grindhouse material that didn't skimp or shy away from disgusting and I have to give director Jason Eisner credit for that movie for not holding back even if it was awful and cruel where Eli Roth doesn't live up to the fake trailer for whatever reason, he made a holiday-themed slasher with a potentially interesting killer that gets lost in the mix of a typical slasher that serves up nothing new.",
    "12": "The story was interesting with a logical villain, but it wants to have it both ways, being either a scary slasher movie and a disgusting, forced horror movie. Some of the dialog was funny, but the violence was frustrating. I couldn't tell if some of the deaths were intended to scare me or just gross me out. It seems Eli Roth intended horror, laughs and senseless deaths. I'm split on the movie because there were entertaining scenes and forced scenes and the characters were so laid back as victims. They didn't seem as scared as they should. Didn't see any of his movies before; aside from the fake Grindhouse trailer of Thanksgiving.",
    "13": "There's a few things that keep Thanksgiving from being a truly great slasher (run time & final moments) but everything here is still strong enough to be a really good one. Indebted to Scream and Halloween in a way it's proud to show off, it starts by showing the horrors of what black Friday brings out in people and then morphs into a steady stream of inventive kills.The majority of the characters here fit into classic horror stereotypes and everyone does a good job of making them worthy cannon fodder. The exceptions being Patrick Dempsey's Sheriff who has a kindness steeped in tragedy and Nell Verlaque, who turns Jessica into one of the best final girls horror cinema has offered recently.Even though Eli Roth's direction may lack the grindhouse style of the original idea, it still stays true to his sensibilities whilst breaking some new ground with plenty of sequences that have a good amount of tension before getting to their gory crescendo, which is always a little more unpredictable than expected.",
    "14": "As a fan of Eli Roth's work, I was super excited for Thanksgiving and it absolutely did not disappoint! This film will definitely become an instant seasonal must watch. It's filled with with laughs, suspense, horror and mystery all rolled into an exciting film.In a way, Thanksgiving is reminiscent of 80s slashers. It includes some twists and iconic scenes. The mystery keeps you guessing right up to the end. If you like lHalloween, Happy Birthday To Me, I Know What You Did Last Summer, and Scream you will enjoy Thanksgiving.For a more fulfilling experience, I recommend viewing Thanksgiving in a theater with a nice size crowd.",
    "15": "I'd practically written off Eli Roth as a hack, always trying to emulate the films he so clearly loves but never quite succeeding. Thanksgiving has changed my opinion somewhat, the film feeling every bit like an authentic old-school slasher. Only a lot gorier.The set-up is classic stalk and slash: one year after a Black Friday riot resulted in several deaths, a masked killer takes revenge on the people who caused the tragedy. It's wholly predictable - so much so that I correctly guessed the identity of the killer very early on - but that's all part of the fun... this is a comfort movie for slasher fans, delivering nostalgic feels, with increasingly splattery kills guaranteed to please gore hounds.And despite the familiarity of proceedings, Roth still manages to conjure up a fair amount of tension, a few scares, and a couple of surprises -- the biggest surprise for me being that this might very well be my favourite horror film of 2023.",
    "16": "Honestly this movie is one of those either you love it or you hate it type of movies. It's a modern day slasher that's nostalgic, campy, gory, and fast-paced. If you're a fan of gore and over the top death scenes then you'll likely enjoy this movie. I'm a big fan of the Chucky movies (especially the later ones) as well as the more recent series and that's kind of the vibe this movie gives off when it comes to tone for me. I laughed a lot while watching this movie and cringed at just about all of the deaths. It's also very reminiscent of I Know What You Did Last Summer and Scream. If you enjoy any of the movies I've mentioned and you need something to do and you're not a horror snob, you'll likely have fun with this one! :)",
    "17": "I saw Thanksgiving, starring Patrick Dempsey-Grey's Anatomy_tv, Meatballs 3: Summer Job; Rick Hoffman-Suits_tv, Hostel; Nell Verlaque-Big Shot_tv, The Marijuana Conspiracy and Milo Manheim-School Spirits_tv, Doogie Kamealoha, M. D._tv.This is a horror slasher film that is written & directed by Eli Roth and is based on a fake trailer he did back in the 2007 movie, Grindhouse. This film takes place in Plymouth, Massachusetts, the birthplace of Thanksgiving. One year after a Black Friday goes bad-people pushing and shoving and people actually getting killed-a Thanksgiving inspired killer starts killing people using Thanksgiving inspired utensils as weapons. He even dresses like a Pilgrim and wears a John Carver mask-if you don't know him, look him up. Some of the killers' weapons of choice are corn on the cob corn holders, a carving knife, an ax, a meat tenderizer and one victim's whole body is even placed in a huge oven-sprinkled with salt, pepper and herbs, of course-and cooked and then placed on a table. This is NOT your Charlie Brown's Thanksgiving movie. Patrick plays the sheriff, Rick is the store owner, Nell is Rick's daughter and Milo is Nell's boyfriend. Lots of people are likely suspects for being the killer-one person even says, Don't trust anyone! If you stay until after the end credits, there is a blooper shown.It's rated R for bloody violence, gore, language and sexual content-partial nudity-and has a running time of 1 hour & 47 minutes.If you like these types of movies, it's a good one. I would buy it on Blu_Ray.",
    "18": "For a horror movie fan like me, I predicted this more than I predicted Scream VI. Quite obvious who it was when the car scene happened. Excepted.The Black Friday scene was my favorite scene. There was a lot of gore, and the scene maybe even made me giggle a time or two. It was constructed with care, and the deaths were on point, I also enjoyed the killers motive. It made sense and it was a smart point.I also enjoyed the cat scene. It gives some kind of feeling for the killer that makes you feel sad for him. If you don't understand what I mean, then ignore this.Overall I would give this a 6.8 out of ten.",
    "19": "Wasn't expecting too much with this one, but the trailers did have me intrigued when I first saw them back in July this year!After a Black Friday riot ends in tragedy, a mysterious Thanksgiving-inspired killer terrorises Plymouth, Massachusetts - the birthplace of the infamous holiday!I found the film to be quite entertaining! The opening alone was killer with so much tension & chaos going on around you find yourself being unable to process what's happened until the films title appears! But it's ace!The films gory deaths are on point & the killer & motive are so Scream like it's great, even though the film drags somewhat a little, but not by much & the runtime isn't bad either at 1 hour & 38 minutes! The story might be considered cliche, but the film in itself is unique & enjoyable!There's some eye candy to be had too & the actors do a great job here! The ending wasn't too bad either & makes me wonder if there will be a Thanksgiving 2 in the works...!Overall, Eli Roth does a great job here! You'll love this film! It's one of the best ones of this year for me behind Talk To Me, Evil Dead Rise, Saw X & Five Nights At Freddy's! Give this a watch! It's gory as!8/10.",
    "20": "There is no way this movie should've been as good as it was. Certainly, it had a lot of components that made me think of the Scream franchise. This was simply a lot of fun. Very gory, very graphic, but very unique and intriguing. It is very enjoyable and certainly has set itself up for a sequel and potentially a franchise. I would definitely go see the sequel. The trailer looked pretty stupid, but I sure I'm glad that I went to go see the movie itself. Proof that you should not judge a book by its cover. Not going to win any awards, but a good movie to sit back, try to relax, and enjoy the gruesome fun .",
    "21": "Overall, the movie was fun, bloody, and surprising. It exceeded my expectations, which genuinely pleased me.Highlighting its strengths, the makeup was excellent, the bloody scenes looked incredibly realistic, and, importantly, about 90% of it didn't feel forced-a significant positive for me. The brutality and blood were well-dosed, and compared to other films of this type, this one took itself seriously, which is commendable.One of my favorite aspects was the plot twist coming from a genuinely unexpected place and transitioning to the audience (meaning me) smoothly. It was well-executed and surprising. Additionally, the Sheriff's motivation was genuinely good, which mattered to me. The performances were also of high quality, surprising like the other elements.Regardless of everything, the film's seriousness and its approach to resolving events were different. Unlike the terrible horror films that often end with a cheesy, clichÃ© conclusion, this one didn't; it had a clear and open-ended conclusion, which was at least decent and successful.Turning to the negative side, the film sometimes relied on simple things in its transitions and key points (when characters were fighting, for example), and our highly skilled killer sometimes behaved surprisingly absurdly, which I felt the cheesiness of at those moments. Of course, I didn't have excessively high expectations, but it was still noticeable.In short, despite some easy last-minute decisions, it was an incredibly enjoyable film. It questioned how greedy people can be and highlighted their strangely absurd habits when looked at from the outside. Despite some cheesy moments, it left me with entertainment beyond my expectations and became a memorable film. Congratulations to Eli Roth and Jeff Rendell for a beautifully bloody evening entertainment.",
    "22": "I was so hesitant to warch it, that's why I went for it on its third day of release, otherwise I would been the first in line on its premiere. And to be honest, It was just a torture watching Hostel and Cabin Fever. But surprisingly it's one of the best horror movies of 2023 and the best of Eli Roth so far. Damn, it was unbelievably good. Not pretentious at all, very simple premise, somehow a stereotype but so original in its own way. Solid script, great actings from some newcomers, magnificent shots and a surprisingly great direction of Eli Roth. To me, it's a new beginning for Eli and a requiem for movies like Scream!A totally fresh breath to slasher genre!",
    "23": "Acting is below par. You constantly have to ask yourself why and how? Plots moves along and leave you not knowing the point of many scenes. Dont waste your time on this one. At the end of the day a movie is made by directors and actors and their performances can make a dull storytelling into something good to watch. But even acting here is very very bland. This could have been a fun watch but it is very forgettable and you have to ask yourself why did I even pay to come and wantch such garbage. I barely leave 1 star review for a movie but this one surely deserves it. Good trailers wont make good movies.",
    "24": "I gotta say this horror slasher film is so graphic I mean Hollywood did an amazing job putting it all together like it all looked so real like the deaths let me just say don't bring your kids unless you wanna spoil Thanksgiving for them I would recommend that kids who wanna see this film must be mature because none of this stuff is funny it could really give them nightmares I'm not gonna spoil anything about this film but I will tell you it has a lot of blood and guts this movie is a mixture of to other films Halloween and Friday the 13th it's that good anyway I give this film two thumbs up hope they make a sequel.",
    "25": "On a big Black Friday sale, starts like a riot and ends in tragedy, a year passes by, and somebody is picking out anybody involved with last years riot, wearing a pilgrim costume, will some of the townsfolk will put it together and put an end to the killers reign of terror before it's too late?May never look at Black Friday in the same way again, showing how people can be crazy during Black Friday. Thanksgiving is a very well paced horror film, never a dull moment. The kills are gory but inventive. You also root for the characters all the way. Eli Roth pays homage to slasher films of the past, and does it without trying to make fun of them. I have to say if you're not in to this kind of film, then you should probably avoid this.",
    "26": "Thanksgiving is a 2023 Slasher starring Addison Rae,Milo Manheim,Nell Verlaque and Patrick Dempsey.After a Black Friday riot ends the lives of people including Amanda Collins(played by Gina Gershon) , a mysterious Thanksgiving-inspired masked killer wearing a John Craver mask terrorizes Plymouth, Massachusetts for revenge by killing people who were part of the Black Friday massacre. Now it's up to Jessica (Verlque)and her friends(Rae) and her boyfriend(Manheim) to find the killer before they strike again.So they report it to a police officer named Eric(Dempsey) who warns them not to trust anyone. Question is who is the killer?.Overall I actually enjoyed this film especially with the twist involved with the killer(hint: as they never played a killer before in their film career) and it was nice to see them in a different role for a change.If you like Halloween or Totally Killer then check it out.",
    "27": "I borrow this from another viewer who completely expresses my opinion.\" I'm at a loss\nI'm so confused about how this has a decent rating. This movie was painfully boring and predictable. The acting was absolutely atrocious. The story was as bland as it comes. I love cheesy horror movies, but this doesn't even count as one. I can't tell you how many times I have seen all of the 80s slasher flicks. I will binge watch them over and over. But I will never watch this one again. It's just so bad. I can't even laugh at it. Honestly, I'm insulted that anyone would put something out that is so bad. And that people would review it so well. I only went to see this movie based off of the reviews. It seems like people have lost touch with what makes a good movie.\"",
    "28": "Very bland. Basically a unwritten Scream script, minus the movie references. Terrible dialog with horribly miscast \"teens\" that have no chemistry with each other what so ever. The few good veteran actors are wasted. Especially Rick Hoffman who has little to nothing to do. It felt like there was no love in it. You would have thought after all these years Eli Roth would learned how to write dialogue. Even Patrick sounds wooden. He tried to pull off a grindhouse style movie but doesn't have the talent to do pull it off. It feels like it was made because they knew it'd make money and was written by a robot. Very cookie cutter story with a very predictable end.",
    "29": "I ended up liking this movie pretty well and I am already desiring to watch it again to put the pieces of the puzzle together with who the killer ended up being. It for sure has its flaws though. Mainly, it's pretty impractical that the sheriff would be in multiple places within a very short time frame (both doing his job and doing the killing). Plus the acting and kills were a little too laughable. The best character in the film imo was the party host guy with the guns (played by Joe Delfin). Other than that, it was a creative premise and I'm glad that it became an actual movie and went beyond just being a parody. There were some intense scenes and it kept me engaged and guessing throughout!",
    "30": "Who in the hell is reviewing this film. The acting is really terrible school trying to be school kids where do you find these actors from. From start to finish it is rubbish. Oh let's just film everyone in a supermarket killing each other and let's bang a trolley in someone's head and take off her skin and hair on her head. What a joke this film is. I'm so glad I didn't waste my money on this rubbish and how it even made it to the cinema is beyond belief. Should have been banned. Makes me wonder if some of reviews are genuine!!! They can't have watched what I did. The slasher is not even acting just trying to basically. This film is just a joke. There's no storyline just a slasher that fancies coming to Plymouth and having fun.",
    "31": "What's the point of this film, to gross out the audience or give them nightmares. These \"slasher\" films to me border on sadist perversion. How can one be entertained by brutal and vicious murders. This whole mess has me scratching my head. A few demented laughs, your typical horror film acting, an over the top psycho killer wearing a pilgrim mask (He looked more like Ronald McDonald) and Thanksgiving theme slaughter. Poor Patrick Dempsey is reduced to appearing in this trash bag stinker. I am not a prude, I enjoyed the original Halloween and even The Town That Dreaded Sundown. This film is just not my cup of tea. But, what do I know......",
    "32": "I thought this was just going to be another cheesy camp slasher movie but it was actually really smart and Entertaining. There were some funny moments, but also some jump-scares and a lot of gore! Some of the kills were particularly brutal and the cinematography was really good. Very inventive with the kill methods. The ending felt a little bit rushed. It did kind of keep you guessing until the end as to who the killer was. I had predicted it in a comment on Facebook on the movie page weeks before the movie came out but it had me questioning whether I was right or not the whole time. I was also extremely happy that it did not have a ton of gratuitous sex like most slasher films do because I was able to bring my son to see it. If you like good slasher films I would definitely go see this one!",
    "33": "The only slightly amusing part was the revelation of the killer. The acting was terrible IMO, After Yulia was killed, Jess delivered the most monotonic speech, as if she was reading something from a newspaper. At the carnival the guy's head was destroyed, and the little girls were crying WAKE UP GRANDPA! Really? WAKE UP grandpa?The characters were mostly annoying to me. I have no Idea how it has 6.8 rating ATM. I started watching because it had a relatively good score, but I regret the time I spent on it.If the only thing you want to see from a slasher movie is its gruesome murders and don't care about other aspects, then I guess this is the movie to watch.",
    "34": "Everything from beginning to end about this movie is great! Good character development, perfect plot construction, it's set up brilliantly and keeps your attention from start to finish.Great red herrings and breadcrumbs throughout to keep you guessing. Some funny one liners keep it light and on point with the genre.The R rating is spot on because with Roth at the helm you don't want to be eating a meal through this movie. You'll cringe and gag multiple times.Great to see Roth back and killing it - we loved this movie and can't wait for a sequel.He's absolutely nailed what audiences want from a slasher and with the tradition of thanksgiving behind it, it'll be one to add to the annual viewing lineup.",
    "35": "After reading all the positive reviews i thought id give the film a chance...mistake! It could be down to the possibility that this film features a popular tiktok content creator which is why its got the positive reviews from the ones consuming her content but you've already seen this film a thousand times before.The storyline didnt bring any excitement, and after a...lets say an intriguing intro into the film i had some expectations for the film but the middle and end never deliver what you want as a viewer...a good story and good acting (apart from Rick Hoffman of course).Wait for it to come out and watch it home, but dont waste an evening going to the cinema as you'll be looking at your watch wondering if you should leave or wait it out.",
    "36": "I wanted to watch and enjoy the movie but it's just way to violent and way too much gore for no reason. I was aware of this going in since it's what the director does but hoped it wouldn't be that bad. Turned it off midday into the riot, maybe 10mins of the movie, just too brutal and I really don't see the need. Wish it was more along the lines of blumhouse horror where there is blood and things are scary but it doesn't need to be torture porn. I don't need to feel really grossed out at what I'm seeing or thinking someone's skin being peeled is really realistic so somehow that makes it better or more enjoyable.",
    "37": "Is Thanksgiving Eli Roth's best film? No. Was it still enjoyable? Hell yes!Thanksgiving is a fun, laugh-out-loud slasher flick that does well in its parody of classic 80's slasher films. The kills are way over the top and in some cases very unrealistic, but to me that just added to the enjoyment.Patrick Dempsey was fantastic in his role as the town sheriff. I've been a Dempsey fan since the 80's with his fantastic film Can't Buy Me Love. So it was terrific to see him in this 80s slasher film parody.Did I guess who the killer was? Yes, I had it pretty much worked out before the killings even started.",
    "38": "This is Eli Roth at his best. The kills are over the top, the build up to the mystery led to surprises, and it touched on the commentary on commercialism and its effects on the town. The jokes don't always hit the roof, but as a nod to 80s and 90s horror, this is how a horror movie should be. It seems to tease a potential sequel, but for now this long awaited feature is worth additional viewings. Another fake trailer is now a movie, leaving only two more to go for a full set. I'll be returning to my local movie theater in town and definitely hungry for more of that bloody Thanksgiving carnage.",
    "39": "I wonder why people rated this joke more than 5! Very weak slasher graphics and effects, beside a lot of copying from the Saw movies, a lot copying from motivations and alibi of the killer and locations and buildings and the jigsaw tricks like fake location streaming of the victims. I found a sense of humor and absurd in acts and storyline, which isn't a good match for a slasher serial killer style. The time i watchd The Hostel franchise and after that the Green inferno i was thinking Eli Roth is going to have his own style but now it seems like he doesn't have enough creativity. Honestly Eli Roth can't be another James Wan or leigh whannell, the plot must impress the audience not reminding you another movies, it was just a funny blood bath show, with very basic graphics.",
    "40": "Better than I expected. I hadn't seen Rick Hoffman since his time in 'Suits,' so I was curious to see him in a different role, even though he wasn't one of the main leads. My expectations for the movie were pretty low, especially after watching \"It's a Wonderful Knife\" a few weeks ago. Surprisingly, this one was alright. B list movie vibes, and it gets pretty chaotic quite a lot. I like that it didn't shy away from the gore. You can tell it's mid budget. It wasn't the most realistic but in a slasher movie done right, who cares? As long as it's fun. And it was. I typically end up disappointed with slasher films, but this one was a bit better than I anticipated. It even managed to get a few unexpected laughs out of me. This and The Holdovers, two movies in a row that were surprisingly funny. The abs in the classroom bit was funny. I started thinking slashers movies were only fun when I was a kid, this gave me some hope.",
    "41": "I'm tweeting this while watching #Thanksgiving.This film is horrible.This is one of the most poorly directed and poorly written slasher films ever.It has horrible story, horrible direction, horrible acting, horrible pace.This film is so poorly cast, I can't express how bored yet annoyed I am at how this film plays out.I have absolutely no idea what the characters names are.There is no connection between the killer and the main group of friends in this movie that makes sense throughout the film.There is the most random series of deaths in the beginning of the movie before the killer starts picking off the main group.I genuinely had absolutely no idea why people were being killed other than they were all present at the beginning of the film.Eli Roth is not fit to direct slasher films.He got away with giving us Hostel and its sequel, but this abomination of a horror film is so unbelievably bad.Does this film have memorable kills? Yes.Will you remember this film after you leave the cinema? Yes.Does this film make any sense?Absolutely not.5/10.Skip this and save your money.",
    "42": "I borrow this from another viewer who completely expresses my opinion.\" I'm at a loss\nI'm so confused about how this has a decent rating. This movie was painfully boring and predictable. The acting was absolutely atrocious. The story was as bland as it comes. I love cheesy horror movies, but this doesn't even count as one. I can't tell you how many times I have seen all of the 80s slasher flicks. I will binge watch them over and over. But I will never watch this one again. It's just so bad. I can't even laugh at it. Honestly, I'm insulted that anyone would put something out that is so bad. And that people would review it so well. I only went to see this movie based off of the reviews. It seems like people have lost touch with what makes a good movie.\"",
    "43": "Very bland. Basically a unwritten Scream script, minus the movie references. Terrible dialog with horribly miscast \"teens\" that have no chemistry with each other what so ever. The few good veteran actors are wasted. Especially Rick Hoffman who has little to nothing to do. It felt like there was no love in it. You would have thought after all these years Eli Roth would learned how to write dialogue. Even Patrick sounds wooden. He tried to pull off a grindhouse style movie but doesn't have the talent to do pull it off. It feels like it was made because they knew it'd make money and was written by a robot. Very cookie cutter story with a very predictable end.",
    "44": "I ended up liking this movie pretty well and I am already desiring to watch it again to put the pieces of the puzzle together with who the killer ended up being. It for sure has its flaws though. Mainly, it's pretty impractical that the sheriff would be in multiple places within a very short time frame (both doing his job and doing the killing). Plus the acting and kills were a little too laughable. The best character in the film imo was the party host guy with the guns (played by Joe Delfin). Other than that, it was a creative premise and I'm glad that it became an actual movie and went beyond just being a parody. There were some intense scenes and it kept me engaged and guessing throughout!",
    "45": "Who in the hell is reviewing this film. The acting is really terrible school trying to be school kids where do you find these actors from. From start to finish it is rubbish. Oh let's just film everyone in a supermarket killing each other and let's bang a trolley in someone's head and take off her skin and hair on her head. What a joke this film is. I'm so glad I didn't waste my money on this rubbish and how it even made it to the cinema is beyond belief. Should have been banned. Makes me wonder if some of reviews are genuine!!! They can't have watched what I did. The slasher is not even acting just trying to basically. This film is just a joke. There's no storyline just a slasher that fancies coming to Plymouth and having fun.",
    "46": "What's the point of this film, to gross out the audience or give them nightmares. These \"slasher\" films to me border on sadist perversion. How can one be entertained by brutal and vicious murders. This whole mess has me scratching my head. A few demented laughs, your typical horror film acting, an over the top psycho killer wearing a pilgrim mask (He looked more like Ronald McDonald) and Thanksgiving theme slaughter. Poor Patrick Dempsey is reduced to appearing in this trash bag stinker. I am not a prude, I enjoyed the original Halloween and even The Town That Dreaded Sundown. This film is just not my cup of tea. But, what do I know......",
    "47": "I thought this was just going to be another cheesy camp slasher movie but it was actually really smart and Entertaining. There were some funny moments, but also some jump-scares and a lot of gore! Some of the kills were particularly brutal and the cinematography was really good. Very inventive with the kill methods. The ending felt a little bit rushed. It did kind of keep you guessing until the end as to who the killer was. I had predicted it in a comment on Facebook on the movie page weeks before the movie came out but it had me questioning whether I was right or not the whole time. I was also extremely happy that it did not have a ton of gratuitous sex like most slasher films do because I was able to bring my son to see it. If you like good slasher films I would definitely go see this one!",
    "48": "The only slightly amusing part was the revelation of the killer. The acting was terrible IMO, After Yulia was killed, Jess delivered the most monotonic speech, as if she was reading something from a newspaper. At the carnival the guy's head was destroyed, and the little girls were crying WAKE UP GRANDPA! Really? WAKE UP grandpa?The characters were mostly annoying to me. I have no Idea how it has 6.8 rating ATM. I started watching because it had a relatively good score, but I regret the time I spent on it.If the only thing you want to see from a slasher movie is its gruesome murders and don't care about other aspects, then I guess this is the movie to watch.",
    "49": "Everything from beginning to end about this movie is great! Good character development, perfect plot construction, it's set up brilliantly and keeps your attention from start to finish.Great red herrings and breadcrumbs throughout to keep you guessing. Some funny one liners keep it light and on point with the genre.The R rating is spot on because with Roth at the helm you don't want to be eating a meal through this movie. You'll cringe and gag multiple times.Great to see Roth back and killing it - we loved this movie and can't wait for a sequel.He's absolutely nailed what audiences want from a slasher and with the tradition of thanksgiving behind it, it'll be one to add to the annual viewing lineup.",
    "50": "After reading all the positive reviews i thought id give the film a chance...mistake! It could be down to the possibility that this film features a popular tiktok content creator which is why its got the positive reviews from the ones consuming her content but you've already seen this film a thousand times before.The storyline didnt bring any excitement, and after a...lets say an intriguing intro into the film i had some expectations for the film but the middle and end never deliver what you want as a viewer...a good story and good acting (apart from Rick Hoffman of course).Wait for it to come out and watch it home, but dont waste an evening going to the cinema as you'll be looking at your watch wondering if you should leave or wait it out.",
    "51": "I wanted to watch and enjoy the movie but it's just way to violent and way too much gore for no reason. I was aware of this going in since it's what the director does but hoped it wouldn't be that bad. Turned it off midday into the riot, maybe 10mins of the movie, just too brutal and I really don't see the need. Wish it was more along the lines of blumhouse horror where there is blood and things are scary but it doesn't need to be torture porn. I don't need to feel really grossed out at what I'm seeing or thinking someone's skin being peeled is really realistic so somehow that makes it better or more enjoyable.",
    "52": "Is Thanksgiving Eli Roth's best film? No. Was it still enjoyable? Hell yes!Thanksgiving is a fun, laugh-out-loud slasher flick that does well in its parody of classic 80's slasher films. The kills are way over the top and in some cases very unrealistic, but to me that just added to the enjoyment.Patrick Dempsey was fantastic in his role as the town sheriff. I've been a Dempsey fan since the 80's with his fantastic film Can't Buy Me Love. So it was terrific to see him in this 80s slasher film parody.Did I guess who the killer was? Yes, I had it pretty much worked out before the killings even started.",
    "53": "This is Eli Roth at his best. The kills are over the top, the build up to the mystery led to surprises, and it touched on the commentary on commercialism and its effects on the town. The jokes don't always hit the roof, but as a nod to 80s and 90s horror, this is how a horror movie should be. It seems to tease a potential sequel, but for now this long awaited feature is worth additional viewings. Another fake trailer is now a movie, leaving only two more to go for a full set. I'll be returning to my local movie theater in town and definitely hungry for more of that bloody Thanksgiving carnage.",
    "54": "I wonder why people rated this joke more than 5! Very weak slasher graphics and effects, beside a lot of copying from the Saw movies, a lot copying from motivations and alibi of the killer and locations and buildings and the jigsaw tricks like fake location streaming of the victims. I found a sense of humor and absurd in acts and storyline, which isn't a good match for a slasher serial killer style. The time i watchd The Hostel franchise and after that the Green inferno i was thinking Eli Roth is going to have his own style but now it seems like he doesn't have enough creativity. Honestly Eli Roth can't be another James Wan or leigh whannell, the plot must impress the audience not reminding you another movies, it was just a funny blood bath show, with very basic graphics.",
    "55": "Better than I expected. I hadn't seen Rick Hoffman since his time in 'Suits,' so I was curious to see him in a different role, even though he wasn't one of the main leads. My expectations for the movie were pretty low, especially after watching \"It's a Wonderful Knife\" a few weeks ago. Surprisingly, this one was alright. B list movie vibes, and it gets pretty chaotic quite a lot. I like that it didn't shy away from the gore. You can tell it's mid budget. It wasn't the most realistic but in a slasher movie done right, who cares? As long as it's fun. And it was. I typically end up disappointed with slasher films, but this one was a bit better than I anticipated. It even managed to get a few unexpected laughs out of me. This and The Holdovers, two movies in a row that were surprisingly funny. The abs in the classroom bit was funny. I started thinking slashers movies were only fun when I was a kid, this gave me some hope.",
    "56": "I'm tweeting this while watching #Thanksgiving.This film is horrible.This is one of the most poorly directed and poorly written slasher films ever.It has horrible story, horrible direction, horrible acting, horrible pace.This film is so poorly cast, I can't express how bored yet annoyed I am at how this film plays out.I have absolutely no idea what the characters names are.There is no connection between the killer and the main group of friends in this movie that makes sense throughout the film.There is the most random series of deaths in the beginning of the movie before the killer starts picking off the main group.I genuinely had absolutely no idea why people were being killed other than they were all present at the beginning of the film.Eli Roth is not fit to direct slasher films.He got away with giving us Hostel and its sequel, but this abomination of a horror film is so unbelievably bad.Does this film have memorable kills? Yes.Will you remember this film after you leave the cinema? Yes.Does this film make any sense?Absolutely not.5/10.Skip this and save your money.",
    "57": "IMDB should add comedy to this movie's genres because it's much funnier than it is scary or thrilling. All the kills (with the exception of perhaps one) are strongly telegraphed by the camerawork and sound design. Who the killer would end up being was quite obvious to me about halfway through, but the mystery isn't really the point of this movie. You all know that the reason to see this movie is for the gory kills, and Eli Roth certainly delivers on that point even if the rest of the movie felt pretty textbook. Grab your family and friends to go see this for a fun dessert right after your Thanksgiving dinner!",
    "58": "A plot that completely ignores logic. What kind of discount makes people rush to grab goods regardless of their lives? I guess it's 99% off? The killer actually appeared in different places at the same time. The director filmed it casually, and the screenwriter wrote it casually. It's fine if the audience doesn't have any brains, and they will become stupid if they think about it for a little bit.If you like to watch bloody plots without thinking, you can go watch it. If you're looking for logic, you can't watch this movie.The people and things in it will also ignore the physic, making it difficult for people to believe it.",
    "59": "Disgusting gorefest . Ridiculous bloodfest. The challenge was to spill the most blood and have zero plot. Anyone watching this and enjoying it is sick and stupid. The most clever gimmick was the pop up stick in the \"turkey, although I saw that coming from a mile away. I just wish they put some thought into this plot. And I love the killer murdering several people but carefully putting on gloves to try and kill he last victim. The killer says\"you took my family away from me \" . How ? What is he talking about ?? Sorry Jessica, this year there will be NO LEFTOVERS!! And after digesting this garbage you wouldn't want any.",
    "60": "I walked in with no expectations of this move and was extremely disappointed. It started off on a good note and the gore was probably the only good thing about this movie. Throughout the entire movie you're expecting there to be two killers and towards the end you know there has to be since the killer is in two places at once. Yet, you'd be wrong. Somehow the killer can magically transport and the character who was framed(who also happened to be wearing the killer outfit), wasn't. Apparently the framed character just wanted to wear the killers outfit and then turned around to be the hero? No explanation there. The story was lackluster to say the least and besides the bad acting, it was just a waste of time.",
    "61": "Amazing acting by seemingly new comer on the scene Gabriel Davenport (playing Scuba). Looking forward to seeing this guy in a big budget block buster. Mark your calendars for the day you got to see this guy in his last small role. Not personally a fan of gore but I was able to get through this movie. The characters are all well acted and the kills are pretty creative and thanksgiving themed. I cannot reiterate the amount of talent that this movie contains with a cast full of half superstar half lesser known. Definitely a movie you're gonna wanna see if you're a horror buff, gore fan, or just in the mood for a scary movie.",
    "62": "A seriously average movie that if the visual effects, their realism and the real logics within those realism were on par, hand in hand like links in a chain, we would have had one of the best slasher movies in years.As it is, it is mildly entertaining, with some clever cooked-up scenes, nothing that hardcore fans had already seen, besides maybe the oven roast \"saga\".I, for one, liked it for Nell Verlaque's acting who showed that tiny something that set her aside her other co-stars.Quite nice to see another facet of Patrick Dempsey's talent and \"powerful\" hairs, this time as a sheriff !Note: Black Friday, one of the most dangerous inventions of men. Do not try at home!Screenplay/storyline/plots: 5.5Development: 7.5Realism: 6Entertainment: 7Acting: 6.5Filming/photography/cinematography: 7.5VFX: 8.5Music/score/sound: 6Depth: 4.5Logic: 1.5Flow: 7.5Horror/mystery/thriller: 6.5Ending: 6.5.",
    "63": "Seriously are any of these high scores reviews even real? I saw the high rating on IMDb and I can't lie I was hopeful because a horror getting such high marks is pretty rare especially when it comes to a slasher so I decided to watch it and boy was I disappointed.Don't get me wrong it isn't that bad it's just really generic and obvious, the kills are pretty decent but that's about it. Maybe it's an American thing and me being a Brit just doesn't understand the hype of thanksgiving and black Friday.I don't think it deserves more than a four and k felt a little generous and bumped that up from a three. I'd say only watch if you haven't got anything else to watch.",
    "64": "Eli Roth is the last person I would have thought would have watered down the transgressions in a film so highly anticipated, especially after such a transgressive and popular fake trailer.Overall, the film is not bad by any means, but it misses the mark of what it is truly derived from.The 2007 grindhouse thanksgiving trailer was a grainy, \"video nasty\" inspired piece of media that truly captured the essence of what made the 1980's slashers so exciting and unique.This version of thanksgiving is much more aligned with a modern scream sequel than an original slasher flick, both in tone and content.Some examples include; the trampoline scene, which in the grindhouse trailer was far more risquÃ© and spirited rather than then washed out version we got in thanksgiving; the lack of sexuality in the film in general which was a staple in classic slasher flicks; the lack of a gritty feel to it, for example, see a film like Terrifier 2, very gritty and gory in a classic slasher kind of way, this film is missing that 80's grain and feel to it and feels too much like a 2000's remake that watered down the sex and brutality that is so representative of this genre.Another example of a missing scene is the \"bj\" decapitation from the original trailer; this scene was iconic as it demonstrated the type of sexualized violence that was classic for 1980's slashers, completely removed from the full length feature!Overall, I believe that unfortunately this movie is a sign of the times and is likely a product of today's society which has seemingly entered another moral panic (albeit for very different reasons than in the past).Oh, what could have been had Eli Roth made thanksgiving as it was originally intended! Stacked with sex, gore, and 80's grain, vibes, and set in the 1980's!",
    "65": "Im pretty disappointed overall and i cant understand the rating of this movie . I had also hard times to be with the actors : some of their performances really put me out several times off the movie and i didnt appreciate that .We have also that story with thanksgiving but i really didnt get into it . The name of the killer was pretty surprising but nothing really impactful and interesting in my opinion. We have also the kills of the people and it get me off by how unrealistic it is and really just remind me it was a movie ( the woman who get her body separate in two ways by a garbage can in plastic ? Come on ! Its exaggerate for nothing !). We have the other kills also who really just an excuse to make blood appear on screen .The characters are ok nothing really complex or any depth but we follow along with them and witness the crimes . I need to admit that i found the look of the killer pretty great and give an interesting vibe . When the name of the killer is given everything become flat and we have an ending that really is rushed and its not really psychological or anything like this but i wanted something more that make me think but it was ok.I love also the brief scene with the sexy cheerleader only because she has a nice body and the kills here was pretty violent and i think its only that scene of the kills that i enjoyed and also we have a little nudity that s pretty welcome . And i really enjoyed it to be honest how the lights give a nice atmosphere and mood to that scene .So yeah kind of disappointed even if i like the lighting some killing scene and the investigation and of course the name of the killer . An ok movie that i expected way more.",
    "66": "Like Machete and Hobo with a Shotgun before, I found out this scary movie was based on a mock trailer from Grindhouse (aka Planet Death/Death Proof combined), I heard positive things about it, and I liked the tagline \"There will be no leftovers\", I was looking forward to it, directed by Eli Roth (Cabin Fever, Hostel, Death Wish). Basically, during Thanksgiving 2022 in Plymouth, Massachusetts (the town that settlers, or Pilgrims, first celebrated in 1621), people have gathered outside the RightMart superstore ready for the Black Friday sales. Thomas Wright (Rick Hoffman) is the owner of the store, and his daughter Jessica (Nell Verlaque) lets her boyfriend Bobby (Jalen Thomas Brooks) and her friends Evan (Tomaso Sanelli), Gabby (Addison Rae), Scuba (Gabriel Davenport), and Yulia (Jenna Warren) inside early through a side door. The crowd outside sees them, including some goading, but Eric Newlon (Patrick Dempsey) and the security are unable to hold them back. A riot begins as the crowd pushes over the barricade, breaks down the door and stampedes into the store. Whilst the frenzied shoppers grab waffle irons and various cheap goods, the chaos sees people fighting each other and severely wounded, all of which is caught on CCTV and social media. The resulting violence sees Bobby getting his arm broken trying to save someone, and several people are killed, including Amanda Collins (Gina Gershon), the wife of store manager Mitch Collins (Ty Olsson); she is hit by a shopping trolley and her scalp is torn off by the wheel. One year later, despite the protests of Mitch and several townspeople, RightMart is preparing for another Black Friday sale. Meanwhile, Jessica and her friends have been tagged in a social media post, a photo of a Thanksgiving table with their names around it. Local diner waitress Lizzie (Amanda Barker) is attacked by a figure dressed in black clothing wearing a John Carver mask and buckle hat. Lizzie is killed trying to get into a dumpster when she is split in half, and the bottom half of her body is planted on the store sign beside a 50% off banner. Jessica and her friend become concerned when they hear police have discovered that Lizzie was present at the Black Friday riot. Meanwhile, Bobby, who lost his sports career following his injury and broke up with Jessica, has returned to Plymouth to work for his uncle, which irritates Jessica's current boyfriend Ryan (Milo Manheim). \"John Carver\" next targets security guard Manny (Tim Dillon), attacking him with an electric carving knife and decapitating him with a wire. The killer takes Manny's head and places it at the table, alongside Lizzie's dead top half. After connecting these victims to the Black Friday massacre a year ago, the police believe The Carver is targeting those involved in the riot. High school students Amy (Shailyn Griffin) and Lonnie (Mika Amonsen) are next to be killed. Lonnie's neck is broken, with his head twisted right around, and Amy jumping on a trampoline is stabbed several times from underneath. Evan and Gabby are soon abducted by John Carver, while Jessica narrowly avoids the killer attacking with an axe. Fearing the police cannot protect them, Scuba takes Jessica to meet drug dealer and gun nut McCarty (Joe Delfin) to get some weapons. Yulia's father has decided to move their family to Florida, but he and the police deputy guarding them are attacked by The Carver. Jessica and Scuba driving to Yulia's house receive a video call of the killer attacking Yulia. They arrive at the house and find Julia being held at knifepoint, and the killer holds a mobile screening footage of Evan and Gabby tied up at the dinner table. Scuba forgets to take the safety off his gun, allowing the killer to activate a buzzsaw which disembowels Yulia before he escapes. The police are concerned that the killer may strike at the upcoming Thanksgiving parade, but Jessica convinces them that it is the only chance to lure Carver out, by having the Wright family and Scuba participate in it. The parade goes ahead, with some spectators wearing John Carver masks. Eventually, the killer reveals himself, wearing an evil clown mask and decapitating a turkey mascot with an axe. Several smoke bombs are thrown into the crowd, causing a truck, holding a boat, to crash and the boat's mast to impale the driver's head. Jessica, Scuba and Thomas try to escape the mayhem but are knocked out by tranquiliser darts and driven away by the killer. The Carver prepares a Thanksgiving dinner, including Jessica's stepmother Kathleen (Karen Cliche) who has been abducted, he bastes her with fat and seasons her with salt and pepper. Kathleen awakens and tries to flee, but the killer impales her with a pitchfork, drags her back inside screaming, and throws her in the oven to roast to death. The police try to locate the killer's hideout and are sent a video link from an unknown phone which broadcasts the kidnapped victims at the dinner table. Tracking the phone's location, an armed unit finds the killer has tricked them, broadcasting a live video on a laptop screen. The Wrights, Scuba and Gabby wake at the dinner table, and Thomas vomits seeing the corpse of his wife decapitated and served on the table like a roasted turkey. The Carver speaks to the group with a microphone altering his voice (Adam MacDonald) and drills a hole through a dead Yulia's neck to drain her blood to serve in a glass. The killer then livestreams Evan, who filmed the Black Friday riot a year ago, and bludgeons him to death with a meat tenderiser. While the Carver talks about his motives, mentioning their greed and the death during the Black Friday massacre, Jessica removes a ring with a miniature knife given by McCarty, uses it to cut her bindings, and passes it to Scuba. The killer slices part of Kathleen's leg to serve to Thomas, but Scuba breaks free, and he and Jessica flee. Scuba is knocked unconscious, but Jessica escapes the hideout, the mock Pilgrim village house, climbs a fence covered in brambles and reaches the woods. She makes it to the warehouse containing the parade floats and props and finds Newlon unconscious on the ground. She follows a figure wearing the Carver's mask inside and sees it is Bobby. She calls Newlon to help capture Bobby, a gunshot is heard, but Bobby escapes. The police soon arrive and inform them that the survivors are safe. Jessica and Newlon are left alone, and she notices the debris of brambles from the fence on Newlon's trousers and shoes, deducing he is John Carver. Newlon reveals that his wife left him, Amanda helped get him back together and they had an affair, and she was pregnant with his child when she died in the massacre, this was his motive for revenge. To Newlon's horror, it's revealed that Jessica has livestreamed his confession. Newlon tries to kill her, but Bobby appears and helps her; Jessica opens a gas canister that inflates a turkey parade balloon. Bobby and Jessica try to escape in a tow truck belonging to Bobby's uncle, but Newlon hooks it to a support beam. As Newlon approaches with an axe, Jessica fires a musket into the turkey balloon, causing a gas explosion that engulfs Newlon in flames. The following morning, Bobby is taken away in an ambulance and Jessica reunites with Gabby, Ryan, Scuba and McCarty. The authorities are unable to find Newlon's remains, they assume he was incinerated in the explosion. However, Jessica has various nightmares of a flaming Newlon attacking her, suggesting he may return. Also starring Russell Yuen as Detective Peter Chu, Derek McGrath as Mayor Cantin, and Jeff Teravainen as Deputy Bret Labelle. Dempsey (who starred in Scream 3) is good as the sheriff, and Verlaque is adequate as the leading teenager, it works just like Scream as a masked Pilgrim killer whodunnit, and the various holiday tradition references are weaved in well, but the absolute crown of the turkey is the death sequences. It is deliciously gory, with many laughably over-the-top mutilations to feast your eyes on, you will squirm and smirk in equal measure with its playful tongue-in-cheek violence with all the trimmings, it is actually tense as well, it is a brilliant campy splatter-fest to be thankful for, a great fun slasher horror. Very good!",
    "67": "Have you ever been to a party that you didn't want to go before but once u arrived u had so much fun that u didn't even expect from yourself? Well, Eli Roth created the definition of the saying. I love old style slasher films and oh boy this one does delivers that. I had so much fun. You don't have to think about the details. Just enjoy the exciting, gory, stupid ride. After I left the theatre I felt energetic and positive even though I literally sat through utterly imaginative killing methods. It's one of those don't ask, just watch films. Especially, if you are an Eli Roth fan this one is definitely for you! Go check it out on the biggest screen possible. It's worth it!",
    "68": "This movie is terrible!I love horror from B rated, to cult, to foreign, to classic, to blood and guts. So Im well versed in the horror genre. Ive always loved what Eli Roth has done he doesn't flinch which makes him a good writer and director. I was looking forward to this movie because of that and the good reviews I had read. I almost couldn't finish watching it, it's a TERRIBLE movie, the plot is so bad I figured out the killer in the first 5 minutes of the movie. The plot is lazy and the actors are terrible it has zero humor and the whole premise is insulting to a persons intelligence.SUCK.",
    "69": "Man is the story bad. There is no logic or realism to the deaths. The victims all just die cartoony deaths.The whole movie is a string of cartoony deaths and easy kills by the masked murderer. It's as if the writers thought of half a dozen death scenes and then try to figure out how to string them together as an afterthought.The murderer has no real finesse or menace. The victims never really fight back. There is no tension or suspense. It's just wham here's another cartoony death scene. And wham here's another death scene.This is a pale imitation of Scream. You'll be better off rewatching the first Scream rather than this very lazy attempt.",
    "70": "Maybe it wasn't for my taste, i really didn't like it. The horror movie in question left me utterly disappointed and regretful of spending my time and money on such a lackluster experience. From the opening scenes to the final credits, it failed to evoke any genuine fear or suspense, instead resorting to tired clichÃ©s and predictable jump scares.It felt like the filmmakers put more effort into creating jump scares than developing characters with depth and complexity. As a result, when the inevitable horrors befell them, I found it difficult to care about their fates, robbing the film of any emotional impact it might have had. The plot felt disjointed, leaving gaping holes in the storyline. The characters' decisions were so irrational that it was hard to empathize with their plight. Overall, a disappointing attempt at horror that failed to send chills down my spine.",
    "71": "Another horror film that triumphs over that awful Exorcist movie. Thanksgiving is a definitely a new must see horror classic. Great plot, great motive for the killer, and the casting was great too. Now I'm not gonna give away too much of this film, but there was a Michael myers reference in one scene. There was also an It reference in another scene. Anyway, the movie had tons of great jump scares and just the right amount of gore in it too. Although Terrifier 2 was a lot gorier, this movie had plenty of gore in it too. This movie definitely deserves to be recognized every thanksgiving. 9 out of ten for this.",
    "72": "It took more than a few years, but we finally got a full length film based on the fake horror film trailer Eli Roth made for GRINDHOUSE back in 2007, titled THANKSGIVING. It was a tongue in cheek send up of holiday themed slasher films, along the lines of HALLOWEEN and BLACK CHRISTMAS, and it was just amusing enough and on point to whet the horror community's appetite. And in my opinion, the final product has been worth the wait, as Roth delivers a fun thrill ride which hits the right beats in an often disparaged and disreputable, but equally beloved, genre. As someone who has worked in retail, and had to report to work on a Thanksgiving Day more than once, I can say that I honestly related to parts of this film.The film opens in a fictional version of Plymouth, Massachusetts, on the title holiday, where families gather for dinner before rushing out to the local big box store (clearly modeled on Walmart) just after dark to be there for the early opening in order to get a jump on all those Black Friday deals. As people gather outside the store, and workers prepare for the onslaught of shoppers inside, we meet the film's protagonists: a circle of teenagers from the local high school; managers and employees; law enforcement on hand for security; and impatient locals, who are not happy being forced to wait in the parking lot. An escalating series of events leads to a riot as a mob runs rampant in the store, and in the process, several characters are trampled to death. One year later, as Thanksgiving approaches, an ominous figure, wearing the historical mask of John Carver, begins killing various sundry individuals involved in the riot in some most gruesome ways.To reveal much more would ruin the movie. What I love is the way that Roth deftly handles the tropes of the genre, including Nell Verlaque as Jessica, a most resourceful Final Girl, and a large cast of characters, played by Patrick Dempsey, Jalen Thomas Brooks, Milo Manheim, Rick Hoffman, the ever beautiful Gina Gershon, Karen ClichÃ©, Gabriel Davenport, Tim Dillon, Addison Rae, Jenna Warren, Amanda Barker, and Tomaso Sanelli, all of whom play characters who are potential victims, or who might be the killer, because Roth does know how to create a red herring. But the biggest trope of the genre is spectacularly gory killings, and on that THANKSGIVING more than passes muster. There are decapitations, a disemboweling, skulls are crushed, and one character gets cooked alive and served up, all in a fan-pleasing over the top way. There's plenty of gore, but it never feels like nasty torture porn. There's an ample supply of humor without it ever going over the line into camp and much of it is derived from stretching more than a few broad New England stereotypes. Maybe what I found most satisfying about this film is that not one moment or one single line of dialogue is devoted to any kind of political message or agenda. This is a film out to do nothing more than entertain, and Eli Roth really knows how to steer the horror lane. I'd forgotten how satisfying a good hard R-rated horror film can be.If I was to find a fault with THANKSGIVING, it is the one other trope of the slasher genre that it fails to provide, and that is sex and nudity, which those old classics from the '80s with Freddy and Jason never failed to deliver. That is a shame, but we live in an era when showing skin and gratuitously getting it on have all but disappeared from the big screen. But as it is, this great American holiday now has its very own horror film, and fans have a new classic to watch over and over again every year.",
    "73": "\"Thanksgiving\" has the charm that its fake trailer promised in the now distant 2007. The product as a feature film has all the classic elements of the slasher, with a script whose story becomes predictable and the identity of the murderer is easy to guess from the middle of the film but it is something intentional and suits the story it tells. The script also pays homage to slasher classics and adds wild black humor accompanied by good gore scenes. Eli Roth's direction is on point, the performances do their job, the cinematography is good and has masterfully executed camera movements that stand out in the suspenseful scenes. As I mentioned before, this film includes good tribute scenes to other American and Canadian slasher films, having nods to \"Halloween\", \"Happy Birthday to Me\", \"Friday the 13th Part 2\", \"Scream\", \"I Know What You Did last summer\" and \"I Still Know What You Did Last Summer,\" among others. \"Thanksgiving\" is an instant classic, a successful co-production between the United States, Canada and Australia.",
    "74": "This movie was entertaining, and I'd watch a bad sequel. But, I just wish they worked on the realism.First, the good. Patrick Dempsey, still nice to look at. He seems to be in on the joke. And, like all good teen slasher films, it is supposed to be ridiculous. I'm pretty good at guessing the ending before most, and I didn't know who it was. Love a good surprise, no matter how dumb. Second, the opening Black Friday scene was pretty great, but there were some technical problems. I like my horror somewhat believable. And, I did enjoy the nostalgic horror feel - the creative murder scenes of dislikable victims. The one with the cat was probably the best.Now, my gripes. 1. People don't stampede. This is a myth. I know it's pretty minor, but people actually do not tend to do this, even when very frightened. But, certainly not running for a waffle iron. People can be awful, but they're honestly not that awful (even if it sometimes seems like it). This is a common incorrect belief. 2. How did the waitress get chopped in half? The physics did not make sense at all. She was jumping in to the dumpster. The car was headed in a horizontal plane. She was chopped vertically, we're supposed to believe by the dumpster? No. Even if the car caught her legs, that would not happen. 3. I hate to ruin this for everyone, but human thighs don't look like chicken. I feel like the gore factor, if you're going all out, could have been better for the oven scene. I can't think of a more terrifying way to go. 4. Gina Gershon was supposed to be pregnant, but she was born in 1962, making her over 60 years old. She looks great, but I find this insulting to women. Come on. I know there were other little things, too, which just kind of annoyed me. I get that it's supposed to be dumb, but there were just too many things for me to overlook.Overall, Thanksgiving is original in it's theme, which means that obviously there needs to be one for every other major holiday, too. (Easter anyone?). I like all types of horror, even the slasher films like this that are more about gore than actually scary. It was very well done for what it is.",
    "75": "A non horror actor as a killer, slice and dice people, blah blah. Stupid, dumb, and unoriginal. What did I expect, it's a slasher film written and directed by Eli Roth. I'm so tired of slashers, horror in general. It's all the same bullcrap repackaged and peddled to the masses that eat this petty crap up. The fact that it's being praised just shows how sick people are. One Million Moms, you wanna do something good for the world? Stop protesting people's rights and protest horror. Get horror cancelled. THAT would be an accomplishment. There's my rant for the evening. Give thanks and go trample some people for great deals on this dumb trash holiday.",
    "76": "I had a good laught watching this Film. Espacilly the opening Scene was really Hilarious. Reminded me a bit of the First Scream mobile which was also a good Mix between Horror and Comedy. The Film didnt Take IT Self very serious and Made a few Jokes on His own behalf despite the Jokes the Film wasnt very trashy as IT often is. I found this mobile quite refreshing ... Not as many jumpscares as i expected which i think is a good Part. But the jumpscares that came really delivered. Many of the Killing scenes where really original and Well executed. Afterwards i had afunny Talk with Friends about the best execution.",
    "77": "I anticipated \"Thanksgiving\" to be a mediocre slasher film. Midway through, I realized it was definitely more than that. There are many jumps. Lots of gore. A major twist and several minor ones. The story is original enough to the point that I haven't seen another horror movie with a theme just like it, although it does feel similar to \"Final Destination\", \"Truth or Dare\", & \"Smile\" at sometimes. The acting in this movie is surprisingly good. Patrick Dempsey never disappoints, but the female lead, Neil Verlaque, was very strong also. The ending was even strong in this movie. It was, well - abrupt.",
    "78": "The movie delivers intense action with impressive special effects, but its storyline falls within the ordinary. The climax, while decent, doesn't reach remarkable heights. If you're a fan of extreme violence and eye-catching visuals, it's worth a watch for the spectacle, but don't expect a narrative that breaks new ground.While the movie successfully captivates with its engaging screenplay, the predictability of the ending leaves little room for surprise. Despite this, the journey through the storyline keeps you hooked, offering an entertaining experience.That's why I rate above average. Six out of ten.",
    "79": "It is Thanksgiving in Plymouth, Mass. Thomas Wright (Rick Hoffman) owns the local Rightmart store, similar to Walmart. He has remarried to the dismay of his daughter Jessica (Nell Verlaque). Wright decides to open his store on Thanksgiving Eve to kick off Black Friday. A group of teens, friends of Jessica, go into the store early through the employee's entrance and taunt the large crowd. A stampede erupts. People die and Booby's (Jalen Thomas Brooks) injury ends his chance at a baseball career. (Didn't he see \"The Natural\"?)The next Thanksgiving rolls around. There is a murder and the killer posts a photo of a table with the name settings of those he plans to kill. The town is scared. The killer wears a Governor John Carver mask and a Pilgrim outfit. The masks are all over town.Decent slasher. It is a whodunit and they give you a head fake. You get an idea of who the actual killer might be, but there is a lack of motive.Guide: F-word. No sex. Near Nudity.",
    "80": "Starring Patrick Dempsey, Addison Rae, and Milo Manheim, 2023's Thanksgiving is one of those movies where the genre steadily inserts itself into any day of festivity. I mean you've got Halloween for Halloween, Silent Night, Deadly Night for Christmas, April's Fool's Day for spring break, and Thanksgiving for well, Thanksgiving. Hey why not. Horror fans are always thirsty and they need their fix. Next year maybe we'll have a slasher flick about some psycho getting his kill on during Yule. Again why not.So yeah, Thanksgiving is directed by Eli Roth, a guy who wants to make you sick, to gross you out (he probably did it to his buddies via childhood). Eli came on to the scene with 2002's Cabin Fever which did all those things but also messed you up mentally. With Thanksgiving he just goes for the basics, mechanical dispatching, shrill screams, and creative offings. Sans a shocking, opening Black Friday scene, the film is borderline schlock, cartoon-like in its brutality with enough fake blood and guts to power the sun. Um, Roth is not peaking here (as he did with \"Fever\"). He's almost on marginal holiday (pun intended).Mounds of corn syrup ichor and discounted price rioting aside, Thanksgiving is about a murderer named \"John Carver\" (ha ha get it?) who terrorizes a small Massachusetts town by capping its denizens in a screw-loose revenge plot (you'll see). It's all so amusing and initially fun, as Roth's TikTok, teenage characters spew lots of F-bombs before getting picked off one by one. Just think a little Scream and a little John Carpenter circa 1978 and that's what you'll get with Thanksgiving. What fails this pic is how it reveals the antagonist at the end. I mean you don't think he would do any of the actual killing, you don't think he is capable of swiftly moving from point A to B to eliminate his victims, and you don't ultimately care because everything comes off as slightly trivial. \"Turkey trotted\".",
    "81": "\"Thanksgiving,\" featuring Nell Verlaque and Patrick Dempsey, pleasantly defies the typical holiday-themed horror flick stereotypes. Despite my initial reservations, the film delivers an unexpected blend of humor and scares. Its 'who done it' style plot, reminiscent of 'Scream,' keeps you engaged, and while the twist didn't entirely catch me off guard, it added an intriguing layer. The acting is decent, the kills are creatively executed, and the plot unfolds with a refreshing twist. While it may not be the pinnacle of the horror or slasher genres, \"Thanksgiving\" is certainly worth a watch, earning a solid 6 out of 10 in my book.",
    "82": "Plymouth, Massachusetts, was where the All-American holiday of Thanksgiving was born. But the place also seems to have created a killer meant to strike terror on an otherwise warm and memorable occasion.Bloody murder soon unravelled following a Black Friday gone wrong - more so than it usually does. Fans have gained another new slasher serial killer and he brought plenty of horror-festival cheer to the movie and the season.Classic slasher-film tropes, more than a few jump scares, and a neat storyline made \"Thanksgiving\" 2023 a genuinely amazing addition to the genre. Eli Roth has outdone himself with this one, the original screenplay for which he co-wrote with Jeff Rendell. Outstanding stunt choreo and chilling suspense added to the entertainment value of almost every scene that featured the killer. The John Carver mask reminded me of Guy Fawkes - and at times Jesus (!) - but this character was given his own raisons d'Ãªtre in the 2023 movie \"Thanksgiving\".Sweet punishment took the form of John Carver, or rather a guy in a mask that evoked one of Plymouth's earliest settlers. He set the table alright, in more ways than one.A deeply uncomfortable truth in the movie was the aggression of shoppers during discount seasons. Comparing some of the shots in the movie with Black Friday photos in the news and on social media, I believe they captured the 'consumer craze' in a realistic light.There were also scenes portraying gun sales and portions in which social media 'encouraged' the sharing of violent posts. These, and other, sequences rang some interesting bells in \"Thanksgiving\".As for the 'victims', they delivered some good scream-queen and yell-king performances. But let's face it, many of them were given cookie-cutter tropes that have been done to death - in this movie, quite literally. Nevertheless, it was nice to see something old-school woven alongside something new.There were a few plot-wise similarities to 2023's \"It's A Wonderful Knife\" and \"Totally Killer\", but those stories took their own curious directions. In \"Thanksgiving\", it was more about keeping it real than indulging time-travel fantasies (which worked quite well in both \"Knife\" and \"Totally\").The idea of uncontrolled consumerism and the lack of accountability for anyone who actually died or was seriously injured during such events drove the plot of \"Thanksgiving\". A lot of it was based on real-life tragedies, which made this movie equally ironic, amusing, and unnerving.The killer thus became a vigilante seeking vengeance in the only way he knew how. The plot itself was akin to a mirror held up for society to see its own ugly reflection, and how some of our actions directly create the criminals who then return to destroy us.For a horror movie, \"Thanksgiving\" was deep in a lot of ways. This was the most surprising thing about it, and I enjoyed how Eli Roth went about delivering that message in a bloody not-too-subtle way.The inimitable Patrick Dempsey gave the killer, Sheriff Eric Newlon himself, an exceptionally captivating aura, rife with sneaky suspicions and well-guised charms. I never would've guessed he could've pulled this off as well as he did. Adam MacDonald provided the killer's voiceover in select sequences, and did admirable work with it.\"Thanksgiving\" 2023 was proof that anyone with a good mask and a better motive can become a captivating slasher. Just don't go getting any ideas.",
    "83": "I attended an advance screening of Thanksgiving (2023) this evening. The plot revolves around the infamous town of Plymouth, Massachusetts, grappling with a tragic Black Friday massacre. As the locals gear up to celebrate Thanksgiving a year later, someone decides to deliver festive justice to those responsible.Directed by Eli Roth (Cabin Fever), the film stars Patrick Dempsey (Grey's Anatomy), Addison Rae (He's All That), Gina Gershon (Killer Joe), Nell Verlaque (The Marijuana Conspiracy), and Rick Hoffman (Ballers).The movie is truly remarkable. I found myself smiling from the opening scene to the closing credits. It captures a 90s slasher vibe with a plethora of characters who could be the killer, a high school class facing peril, and a relatable motive for the antagonist. The kill scenes are all top-notch, earning a solid 10/10, with a perfect blend of creativity, gore, blood splatter, and more gore. The Black Friday and parade sequences are standout moments, eliciting cheers from tonight's audience. Noteworthy are the elite decapitation scenes and a sequence reminiscent of Heath Ledger's Joker in The Dark Knight. For a modern-day slasher, it doesn't get much more enjoyable than this. I'd give this an 8/10 and highly recommend it.",
    "84": "We actually got it. It took a long time but we finally got a 'Thanksgiving' movie based on the infamous 'Grindhouse' trailer from 2007. I always liked to imagine what this film would actually look like. In all of the ways I envisioned it though, I never foresaw it being as coherent and well put together as this film ultimately was. This movie was a blast.The first thing to note is that the film is absolutely brutal. They haven't toned things down from the original trailer at all. They have committed to the concept and the film is that much better off for it. Like most Eli Roth films it feels like nothing is off limits.I was pleasantly surprised to find the film was done in a whodunit style. The mystery, and not knowing what characters could and could not be trusted, added another layer to the film and worked really well.When we first meet the characters, and in particular the teenage characters, I was a little worried they were going to be extremely unlikable, as is usually the case in these types of films. As the film went on though most, if not all, of them grew on me. And by the end of the film I actually cared about their fate.'Thanksgiving' is going to go down as one of my most pleasant surprises of 2023 for me. It was everything I wanted and more. 9/10.",
    "85": "Roth has always been an enigma to me. He's clearly got the eye for sheer brutality and putrid gore. He knows what buttons to push and create throwback style horror . But then on the other side of the ticket, his overall stories suffer from dull plots and fizzled potential. None of his films aside from the Death Wish Remake awhile back have been fully effective IMO until Thanksgiving.He takes a concept that was conjured up for a bonus trailer styled element within a different movie from 16 years ago with Grindhouse. You wouldn't think the concept could translate to a full feature length but it really does . He does his best 80s slasher impression that actually feels legitimate and not forced. A new age potential iconic slasher is introduced and will absolutely be a new staple of horror genre.The setting is ambient and perfect for the theme and provides a great visual feast. Roth has upped his game in making sure all attention to detail in presentation is covered and even implements a more complete film. The brutality is unleashed and doesn't hold back along with disgustingly fun gore. The cast is also shockingly well put together which is rare in most horror now.Overall a new age holiday themed classic that shows what Roth can offer with the right amount of focus and time. And remember ....be thankful.",
    "86": "Thanksgiving starts with a fantastic opening scene. The Black Friday shopping mayhem scene is straight out of South Park, with crazed shoppers rampling people to death in gruesome ways over a free waffle maker. That scene is perfectly acted, with all performers giving a spot on impression of awful greedy trash people. That scene has something to say.The rest of the film starts off as your average \"I know what you did last summer\" style revenge slasher with an unknown killer in a pilgrom costume stalking and killing the people responsible for the opening scene Black Friday tragedy.Towards the third act, the movie further devolves into needless, evil spirited torture porn.A central problem is the main characters, who are a chore to endure. All except the main girl (who seemingly has just one facial expression) and the Russian girl are awful. Especially the males. For a while I wondered if the director / writer were on a dare or pulling a prank by having every single line have the F-word in it. But then a few lines without it showed up. A pity, that would have been more clever than what we got. We are left with intensely unlikeable protagonists, waiting for them to be picked off one by one.The film barely gives us any hints to who the killer is, what in particular he's motivated by, and in the end pulls a random character out of the hat. The only reason I knew it wasn't one of the teens was that Gina Gershon had a brief appearance and death scene in the opening, so I knew the killer had to be connected to her. Otherwise why cast a name actor in a no name role?When the reveal does happen, it's ridiculously stupid, and most of all, the needless cruelty and sadism of the killer goes way beyond revenge. In particular one scene involving the centerpiece of the revenge is sickening, case in point being it's something that happened during the October 7th Hamas attack. It's so messed up that it ruins the tone of what should be a fun, scary holiday slasher / horror film. Eli Roth really needs to get his demons under control. Pushing the boundaries is one thing, but missing the tone of your movie is another.Oddly enough, the gore effects are quite bad. For a movie that goes so deep into gore, I was surprised it didn't look better.Speaking of things that look bad: the Killer's mask. This is a big one, since a slasher film lives and dies by its killer. The killer here looks boring. Like a low budget V for Vendetta, he's neither scary nor iconic. They must have realized the former, because midway during the movie, he burns his mask for no reason other than he knows he's in a movie and wants to look scarier.The film moves at a brisk pace, and thankfully the obligatory scenes of characters nervously tiptoeing through corridors with the Killer lying in wait aren't 5 minutes long like in older 80s and 90s Slashers where the narrative ground to a total halt before every kill scene. They throw in a few chase scenes to mix things up as well.Here's something I'm thankful for: Thanksgiving didn't bore me. It annoyed me with it's nasty characters, it repulsed me with the it's mean spiritedness, bit it didn't bore me.Had they kept the tone and social commentary from the opening scene, they could have had a real classic here. As it stands, this is a missed opportunity let down by a weak script and a director who's pathological need to shock undermines his talent.",
    "87": "This will be one of my favorite Thanksgiving movies going forward. It really will. I will watch this on an annual basis with many of my other favorites around this holiday, which is my favorite holiday, by the way.Let me just say also that there are two generations of wow going on here:\nGina Gershon. One of my all time gorgeous babes. Still got it. Never lost it.And Addison Rae as Gabby, bounding out of social media stardom and into true Hollywood stardom. It will be amazing to watch her every move from here. The sky is the limit.This movie starts off with one of the most unexpectedly gory and hilarious sequences. Roth bring Roth and not wasting any time.Do not be late for the beginning of this movie.I love this new character, John Carver.I want a mask. You will too.Next Halloween, everyone will be dressed as this scariest Pilgrim, ever.This movie is laugh out loud funny.And the kills are spectacular.Patrick Dempsey is great as he always is.The kids are all great in this.Far superior to this new group of Scream kids we've been given here lately.The movie is wonderfully short.The mood and environment is peak November.It's actually quite beautiful at times.Awesome soundtrack.Humor and action.The killer isn't who you think it is.No, not him.Him, either. Maybe her? No.Dare, I say this is actually one of the best movies of this year?Yes, I do dare. It's fabulous.And stay for the end credits scene. There is an end credits scene.Happy Thanksgiving!",
    "88": "First, let me just say if gore isn't your thing than skip this one. Fans who saw the trailer from 2007 remember the gritty throwback to the 80s slasher movie craze. Those movies were named after holidays or days of the week. My favorite was the 1980 My Bloody Valentine which was a mean, nasty violent flick. That's what you expected walking in after seeing the trailer.This one reminds me of that original slasher flick from the golden age of horror. The make up effects are pretty gruesome and the movie is unapologetically mean and nasty with some clever kills. The back story has been revealed throughout the previews but who the killer is and that third act really got me by surprise.One minute it's playing like a black comedy then the next some dumb idiot is getting chopped up. While some remember those slasher movies from back in the day as bad, fans like me remember the mystery of who the killer is with the big reveal. We went for those Tom Savini make up effects and here you can see these kills kills were heavily inspired by the make up genius. The preview audience I sat with had a great time and fans of horror will too.Just know what you're getting into with an Eli Roth homage to the 80s slasher movies.",
    "89": "Even for a slasher pic, Thanksgiving is crude, messy (in every sense of the word) and ridiculously over-the-top. Far from being an homage to Friday 13th, Scream etc it's a mockery of the genre, devoid of any merit. It lacks a shred of originality, and tries to make up for this by going for grossness in ridiculous ways. I have a strong stomach, but grossness simply for grossness' sake makes me shake my head.Other than gore, there's no plot. There's no style, no elan - there's not even a character worth rooting for. There's no talent, either. Everything - writing, acting, directing, camera-work - is just dialled-in, by-the-numbers stuff. Usually the wrong numbers.I might add that the poster is misleading - presumably deliberately. It gives the impression that this is going to be a period piece - which might've been interesting. It isn't.I suppose I've only myself to blame for watching it. Clearly, I should've remembered Bob Newhart's words: \"See, Walt, that's an *American* holiday.\"Thanks to a membership card, I saw this for free - and I still feel ripped off.",
    "90": "One of my top five favorite slasher movies ever (and I've been watching horror films for over thirty years now, so I've seen a lot). I think it's also easily Eli Roth's best film. Actually, for what it is -- an extremely inventive, effective slasher film -- we thought it was genuinely perfect. And it's probably the most I've ever liked Patrick Dempsey in a movie (also cool that he's in this and Scream 3).It's both a throwback to 80s slasher movies, along with 90's slasher movies ala I Know What You Did Last Summer, while also having a modern feel. However, it doesn't repeat what's been done, and makes the tropes feel new.Eli Roth also really takes advantage of everything that he can think of relating to Thanksgiving in both imaginative, clever and disturbing ways.People were talking to the screen while the movie was playing, and after the movie ended, people were standing outside the theater talking about how unexpectedly good the movie was.It turns what could be a gimmick into one of the most fun horror movies in years. Pretty badass.",
    "91": "At this point one would think after all these movies, Eli Roth would learn how to make a good movie.Unfortunately, he didn't so he doesn't.While the premise is fine and plot could be salvaged with someone better at writing, the whole movie is quickly spiraling into your average stupid slasher movie.They probably tried to make a new Scream like movie, but failed.There is so many, many (not important) characters in this that waste screentime, so many unused chekhov guns that is not even funny.Even worse, there are many plot dead ends, which is somehow worse than having a good ol' plot hole. For example - part about store camera backups. It looks like an important part of the plot but no, it just resolves itself in the minutes after being mentioned. And it was resolved by one of the characters just watching those backups at some random point, concentrating on the dumbest part of it, printing some photos and going to police. What?Having so many unncessary characters is probably seen on paper like having so many options for viewer to think who is the killer - \"Oooh, no, who it is, ooohh\". But in reality it just wastes screen time and the only thing getting killed is any hope for plot coherence.Which brings me to the pacing of the movie. It's done so amateursh and incompetent that I go back to the first sentence - how did this dude didn't learn after all these years to make a coherent story flow? There is no sense of time in the movie, no sense of space, no sense of plot order. Things just happen.One of the worst things a movie can do is to make viewer constantly think \"That doesn't seem right/That's stupid/What?\" while watching a movie.The ending also looks super slapped on, contrived at best.It's not the worst movie ever, or from this year, but it ain't good. There is a solid horror movie in there somewhere but that movie is not written, directed and produced by Eli Roth.",
    "92": "THANKSGIVING (2023) **1/2 Patrick Dempsey, Neli Verlaque, Rick Hoffman, Milo Manheim, Addison Rae, Karen Cliche, Shailyn Griffin, Jenna Warren, Mika Amonsen, Gabriel Davenport, Joe Delfin, Gina Gershon. Patient horror fans have waited 16 yrs from its GRINDHOUSE teaser 'trailer' and Eli Roth FINALLY delivers its holiday centered slasher flick with dank Ã©lan and plenty of second helpings of gore with the vengeance seeking John Carver masked killer a year after a Black Friday melee resulted with deadly results. While the characters are cookie cutter ass-hats, douchebags and cowards the stalking and menacing echoes Craven, Carpenter and yes, even DePalma in each dispatching. If you put SCREAM, HALLOWEEN and even, FINAL DESTINATION into a CuisinArt and hit puree you'd get this by-the-numbers, all-the-tropes genre flick served on a silver platter (and if they do the inevitable sequel I suggest the tagline of \"And This Time We DIDN'T Forget the Gravy!\")",
    "93": "Set in the town of Plymouth, Massachusetts one year after a tragic Black Friday stampede left several injured or dead, the town prepares to celebrate Thanksgiving once again until a figure in a John Carver mask begins targeting those who participated in the deadly Black Friday stampede dispatching them in gruesome displays.Thanksgiving is an adaptation of the fake trailer Eli Roth directed for the 2007 film Grindhouse which Roth crafted as an homage to holiday/day themed Slasher movies of the 70s and 80s of which Roth is a vocal fan. While the prospect of adapting the trailer as a feature had been discussed as far back as 2007, it lingered in development hell either due to Roth's schedule or an inability to get the project to come together. The film finally regained some traction when Spyglass Media Group became involved, and no doubt inspired by the success of the recent Scream films gave Roth the backing he needed to make the film. Thanksgiving is very much truth in advertising and while certainly a straightforward slasher, it's played with a level of charm and irony that I honestly wasn't sure Roth was able to pull off.If you've seen the 80s slashers outside of the major benchmarks such as My Bloody Valentine, Prom Night, or Graduation Day, Thanksgiving follows that same template and is very much a whodunit with a revenge angle much like those other 80s era Slashers that didn't have the cultural exposure of Friday the 13th or Halloween. From the opening scene where Roth introduces key members of the cast at a Thanksgiving dinner before transitioning to a department store with a volatile crowd ready to literally bust down the doors, Roth has fun playing with the Autumnal and Thanksgiving iconography while also indulging in some creative brutality with the Black Friday stampede filled with all manner of shocking violence and dark as black humor that sets the bar high for what follows. While Roth has had a history of creating abrasive characters, here he feels like he's dialed that back so we have a much more humanized set of characters in comparison to something like Hostel or Cabin Fever. Nell Verlaque makes a solid protagonist and we also get some good supporting work from Patrick Dempsey, Rick Hoffman, and Gina Gershon, as well as a scene stealing performance from Joe Delfin as a fun skeezy character named McCarty. What critiques I have are pretty minor in the grand scheme of things, but they still should be addressed. While I thought the cast was good there were times where I didn't learn a character's name until after they had died. I also guessed the killer's identity halfway through the film but even if the reveal didn't catch me off guard there's enough entertainment value throughout that it's forgivable.Thanksgiving is a refreshingly straightforward slasher that mostly plays itself straight with just enough humor while keeping it from going into full on parody. Even if you haven't been a fan of Roth's work in the past I think you should definitely give this a watch.",
    "94": "A superstore in Plymouth, Massachusetts hosts a thanksgiving, pre black Friday sale, but an angry public storms thr barriers, carnage ensues, and a year later, someone is out for revenge.Having just experienced the misery if black Friday at work, witnessing people's greed and selfishness, this film resonated.I thoroughly enjoyed Thanksgiving, talk about a breath of fresh air, this film delivers on so many levels, and spans numerous genres, it's a horror, a mystery, a thriller, and for me, something of a black comedy.Eli Roth delivers another horror classic, it's a film I can see getting something of a cult classic as time passes by, a 2020's slasher that's actually well worth your time.Some gross moments, and several scenes that will have you squirming in your boots ....trampoline.....all I'm saying.It's pretty well acted, it's nicely directed, some of the jump scares worked very well.It's a riot.8/10.",
    "95": "While certainly not showing up on anybody's Oscar picks, Thanksgiving will show up on a few lists: movies to watch every Thanksgiving, top tier campy slasher flicks, and well made practical gore extravaganzas. The movie earns its strong rating for achieving what it's going for, and surprisingly being better than it could've been. It could've been a movie that was good albeit not memorable. Instead, I'm happy to know I'll watch this on a steady rotation.A movie that has been anticipated for 16 years can easily be internally overhyped to the point where it could fall flat. You can expect a tongue-in-cheek slasher, but you will be rewarded with more: a well done slasher with an interesting plot. As with many slashers, you have a large dinner table full of characters lined up to get killed. Eli Roth made every single one of them stand out with some good character traits. They are likable for the most part. Even most of the characters who have downfalls, can be charming. Even the killer has some moments that are slightly forgiving. The best aspect of the movie is how the thematic plots and killers motive converge in a finale that balances both factors in a rewarding way.Thanksgiving is one the better horror movies of the past several years. It's not because there have been a lot that have been overhyped and/or letdowns, it's because it earns the respect that it strives for. It wants you to have a good time. Have some laughs. Get grossed out by the gore. Be surprised by its intelligent script. When a film not only does what it needs to do, but exceeds in ways that most in the genre don't, then it earns a high grade and a very high recommendation.",
    "96": "This was a nice surprise, the acting was better than i expected and there are some amazingly done practical Effects that work sooooo well! (I wish more movies would use practical effects and less CGI).Eli Roth also does a good job directing this movie, the first 2 parts are wonderfully done and structured very well and then the ending is just nuts, some will like the end some won't, I think people will be split on it. The writing is also good to.The audio and soundtrack is also done well to and the cinematography and kills are very well done. The only complaint I have (and I hope this gets added for the DVD/Bluray release!) is that I wish the Grindhouse look was still there from the trailers and the Grindhouse movies. Toss some filter or something on it to make it look grindhous'ish. I can understand it probably wasn't doable for this release (I imagine higher ups wouldn't like that old school grindhouse look and would want things more pretty looking), but I REALLY hope that for the Bluray release that we get another version that has the Grindhouse look to it, sort of like some movies have done with Black and White versions available.Overall its mostly all good here, go check it out! This is much better than the modern Scream and Halloween films.",
    "97": "Thanksgiving is what happens when you take all the bad of recent Halloween movies and mix it with Scream.The only good this film has going for it is an interesting slasher killer and brutal kills (some of those kills make no sense and are not possible), but they did look good. Everything else is trash!Terrible writing, horrible pacing, trash story, boring generic characters, and rittled with cliche slasher horror tropes. This film made me laugh from it all.Nothing about this film is different. Granted, it's not all that possible to be unique in the slasher genre, but we've seen everything this film has done before, and we've seen it done better.The highest compliment I can give Eli Roth for this film is that he did create an interesting slasher villain. He looks great and has great command of the screen. But you need more than an interesting slasher villain to carry your film and this horrible story, and these boring characters definitely did not do it.I genuinely do not understand how this film is getting the high scores and positive reviews it's getting. But oh well, perhaps it's just not for me.IMDb: 3/10\nLetterboxd: 2/5Watched in Theaters.",
    "98": "Thanksgiving is a movie I had always hoped would come to life, like Machete did. It seemed like the perfect premise for a new slasher. And now that it's finally here over 15 years later I can say that I wasn't disappointed.The plot is relatively simple, just the way we like it with these kinds of films. A black Friday tragedy leads to a string of murders exactly one year later, all with the same suspect, a masked killer. The film does a great job of distracting you with \"who-dunnit\" temptations and cat-n-mouse terror. By the time that we had an understanding of the killer, I was surprised. That in itself was the nice part of the film, yet the justification of the origin story didn't totally gel. I can't spoil anything or say that it's bad, it just needed a bit more understanding, if anything- more time to delve into the details.The gore is awesome and definitely practical. The mystery aspect is done well considering that the audience, as well as the characters cannot quite understand why these murders are happening. The writing is not bad by any means, it just simply caters to the typical horror tropes of having disposable characters (and some that you actually hate right off the bat.)All in all it was very well done, great dialogue for a horror movie, music was awesome although I'm not sure if they made a theme song for it. The effects were dope and the whole ride was fun. The only reason I knocked 2 stars off is because the origin story of the killer isn't so believable given the extremes he went to. Go see it.",
    "99": "Going into this movie with such low expectations had me blown away. I thought it was gonna be terrible, but it was actually one of the best slasher movies that have come out in recent years. The plot is simple, characters are simple, and the kills are amazing. At the beginning of this movie almost none of the characters are likeable. And to be honest, they don't get likeable until maybe halfway through the film. The acting isn't great either, Patrick Dempsey(the sheriff) was easily the best of the whole cast. There's also so really corny lines and cheesy moments but it's a slasher and they always come with that. The highlight of this entire movie is the way characters are killed off because it's straight up brutal. The movie doesn't shy away from showing blood and guts, and from what we could see only maybe two of the deaths are CGI, the rest looked like practical effects, and there's so much death. From the start of the movie you can just tell it's gonna be a wild ride. The ending was kind of weird and not at all what you expect, I guess kind of setting up a sequel, not really sure actually. But definitely a fun movie to enjoy if you have nothing better to watch.",
    "100": "Eli Roth's \"Thanksgiving\" is based on a mock trailer from 2007's \"Grindhouse\"*. As Roth loves to show some of the most grotesque things imaginable, this movie gives us the goods. It's got some of the most shocking kills that I've ever witnessed onscreen.As it happens, I had just learned of John Carver a few days before seeing this, having watched the 1952 movie \"Plymouth Adventure\", about the Pilgrims' journey across the ocean (as you may have suspected, it was one of the most inaccurate movies ever). Imagine how shocked the Pilgrims - all of them religious fundamentalists - would've been to learn that one of their leaders would get used like this.All in all, a truly fun movie. A nice counterweight to the overly wholesome things people do for the holiday. In other words, I'm thankful that this movie got made.*Roth, a friend of Quentin Tarantino, filmed the mock trailer as a favor to him. Tarantino later cast Roth in \"Inglourious Basterds\" as the Bear Jew, who enjoys bashing in Nazis' heads.",
    "101": "Not since the year 1621, or more accurately 2007, we haven't had a proper Thanksgiving holiday horror. And despite the LONG delay, this year I give thanks for this finally coming to fruition.And YES, I know there were other Thanksgiving horrors. Just nothing like this. I would only really recommend 2019's Pilgrim which I did like a lot. 1981's Home Sweet Home and 1983's Blood Rage were alright. And 2009's ThanksKilling probably was made as a poor joke or drunken dare.For 2023's Thanksgiving, I was afraid I was going to write my review all biased. Waaay back in 2007, I saw the fantastic Grindhouse film/double feature opening weekend and while I loved Planet Terror and thought Death Proof (at the time) was just okay (I've since appreciated it,) the highlight was the fake trailers and #1 on my list of definite wants to see was...well, isn't it obvious?Thanksgiving, the fake trailer, was EVERY SINGLE THING that scared me to utter death as a young boy who LOVED horror movies. Since I wasn't allowed to see them, I'd have to sneak/watch them in my bedroom late at night. Mostly those were the ultra-low-budget, splatterfest, actual grindhouse movies. One I'll never forget that kept me up for weeks was 1973's Don't Look in the Basement. Coincidentally enough, the 2007 Grindhouse fake trailer list included an homage to the \"Don't\" movies simply called \"Don't.\" (That was my second favorite trailer.)We, as in the horror-fan-community, have been desperately and impatiently waiting for Director Eli Roth to make this movie since. Now, while I WISH this 2023 product was as gritty and grimy as the fake trailer - the little boy in me would absolutely reemerge and I might have had trouble sleeping tonight, I was SO VERY pleased with the final cut.Plymouth's Black Friday deals might not have been worth it for some people and unfortunate \"accidents\" causes some survivors to be targeted. Will they stay alive long enough to get some delicious pumpkin die?I only have a few gripes about this movie and while, spoiler, I'm going to make this a Thanksgiving tradition to watch year after year, I may need a few additional rewatches to see if I'm wrong here. The movie felt uneven and unfocused at times. While this fits right in with this type of movie, most of the second-tier characters were so interchangeable, I barely knew who was who and where they belonged in the story. And when they died, I barely cared.Other than that, I LOVED THIS MOVIE. Besides a ton of comedic jokes/scenes that totally landed, this was a thankful collage of homages. To Slashers, of course, but also to other holiday Slasher/mainstay classics. Just from memory, this played respect to: Halloween, Happy Birthday to Me, My Bloody Valentine and even Krampus. You can absolutely tell Roth LOVES those movies. And I do too, so naturally, these blatant references were supreme to me.This will most certainly NOT win anyone new to the Slasher subgenre, but if you're already a huge fan like me, you cannot go wrong here. PLUS, it was a VERY welcomed HARD-R. Sure, a ton of PG-13 horror is fine and works. More often than not, I really want to get back into a gory film that leaves my horror-loving-eyes satisfied.And a TON of the kills and carnage rampages were ruthless, inventive and original. Bravo. Bring the family; they say there'll be no leftovers...so don't be late to the party!***Final Thoughts: Now that I've seen the movie, I can watch the new trailer and catch up on the old one I haven't seen in years. (Since the other one was fake, I did gleefully watch it in 2007, but normally I won't watch any trailers I'm even remotely interested in. They ALWAYS spoil WAY too much, and in most cases, show the very last scene.)My thoughts of rewatching the 2007 fake trailer: Still VERY effective and personally scarier than the 2023 feature-length. But, that's just me since that grittiness and low-budget quality brings out the frightened boy in me. I did like they included some of the key scenes in the actual 2023 movie.2023's trailer: OY VEY, yep, I was right. SOOO much was spoiled. I'm glad I never watch trailers for movies I'm even remotely interested in. While it amazingly didn't show the last scene, I would've been sad to have so much ruined for me. See this movie cold, if you can. Much more worth it.",
    "102": "I love horror movies, specifically my favorites are stalker/killer/slasher types.I wasn't sure how Eli Roth would handle this type of movie because he's really more known for his \"gore\" rather than \"run from the killer\" style of films. Although I enjoy his dialogue in his former scripts and have good things to say about the hostel series, I was still a little skeptical.My final verdict is a good one. I liked it. I thought the story was good, it was entertaining, and the killer scenes were pretty well done. I like how he inserted just enough humor to make me laugh, but didn't take it over the top. The jokes were subtle and just right.The kills were pretty good too... knowing Eli Roth's past resume, I was afraid that he would take the gore too far... but thankfully he didn't.A pretty satisfying horror holiday outing... I wouldn't mind a sequel now either.",
    "103": "It's Thanksgiving in Plymouth, Massachusetts. More importantly, it's Black Friday in RightMart. A large crowd has gathered and waiting for the opening. Eric Newlon (Patrick Dempsey) is the Sheriff. Thomas Wright (Rick Hoffman) is the greedy store owner. His daughter Jessica Wright and her friends are allowed into the store before the opening. It starts a riot and people die in the ensuing chaos. It's a year later and nobody has been brought to justice. Thomas is doing another sale despite a feared repeat of the incident. A masked serial killer is on the loose.This is an Eli Roth horror. There are so many A-hole characters. Then I remember that it's an Eli Roth horror. Of course, it's filled with A-hole characters. Here's the thing. This is actually not that bad despite some ridiculous ideas. First, Black Friday is no longer this anymore with all the internet shopping. I don't care about these characters. Their deaths mean very little to me. They are cannon fodder for the meat grinder. I do really like the oven and the dinner although her hair should be burnt off. As for the murder mystery, it's fine. I was hoping for someone else, but the reveal is not as surprising as Eli probably wants. There is plenty of gore and it's a good Eli Roth horror.",
    "104": "I thought this may be an occasion where not watching the trailer hindered my experience but having watched the trailer retrospectively, it is clear that this movie advertised itself as a film that took itself seriously but that was certainly not the case...Thanksgiving is a who dun it slasher in the vain of SCREAM. However, the violence was ridiculously over the top in the fashion of the Evil Dead Rise movies. Despite this, the film dialled the campiness all the way to 100% and that really messed with the tone of the movie. The jokes were shoe horned in all over the place and didn't work.Moreover, I didn't find there to be any redeeming qualities. The characters who were predominantly a teenage school group, who were not interesting at best and at worst they were cliche and frustrating. They made several deleterious decisions and seemed to be incapable of doing anything to improve their situation.I welcome scares and gore in horror movies but the extreme deaths felt wasted and gratuitous given the inconsistent tone of the film. Some of the death were so over the top that they seemed to be attempting comedy whilst others seem to focus on pure horror.Whilst the likes of SCREAM or even Totally Killer manages to strike a perfect tonal balance and knows what it wants to do, Thanksgiving didn't have a clear direction which left me disinterested and confused. It's Thanksgiving so I'm thankfully for some of the unique kills scenes.",
    "105": "Thanksgiving is a surprisingly good, funny and gory horror movie. I would say its a mix of Halloween, Scream and Terrifier. Halloween because of the holiday theme, Scream for the plot and tonal similarities, and Terrifier for the well done gory kills and practical effects.Eli Roth is no stranger to the horror genre, but he's more at home making torture p*rn films like the Hostel series. This is a slasher through and through, with a mix of mystery, comedy and a couple genuine scares mixed with the gore.And the gore is pretty high up there. It's not quite the level of Hostel or Terrifier, but gets close in some moments. The camera isn't shy about the violence like some slasher films, and you see more than just blood.I think it's worth watching. Don't take it too seriously, and have fun with the gory moments, and you'll find a lot of enjoyment from it.",
    "106": "Cheaply made, with cheap special effects and a bunch of unkown B-actors, but there is still something to like about this flick...The good: I love it when a horror doesnt take itself too seriously and basically is a sort of a parody on horror movies in general, with lots of humor packaged in a lighthearted way, even during the many GROSS scenes where meat gets cut of someone's body.However gross this movie is at certain moments, it never gets really scary though, but that is the whole point of this lighthearted horror movie. It's a cheap thrill, but a very well made cheap thrill with some good laughs.Recommended for those who simply want to be entertained with some cheap thrills with lots of humor. NOT recommended for those who might (wrongly) expect to see a (REALLY) scary movie...",
    "107": "\"Thanksgiving\" is a serviceable horror film that touches upon all the high school horror tropes. Jocks, nerds, party kids, cheerleader, and so forth. The template is so mid that what you find yourself waiting for is the kills. The murderer isn't that hard to figure out. It's essentially the person whom you know during the Black Friday stampede is the one who is the most traumatized.Was this a social commentary on capitalism? Not in the least. It is really a commentary on horror films of the 80's and 90's.Though director Eli Roth finds gruesome ways to dispense with the annoying teens, for the most part it gets tiresome to watch the gore. And there is also very uneven smirks. Such as when the first victim is murdered, the police are going over the viscera whilst we are (I think) suppose to be laughing. It's sadism from behind the camera.The movie does give you what you want. The kills are associated with the holiday. All the victims have their heads chopped off and placed at the table. And it doesn't take long for the killer (named Carver since he wears a John Carver mask) to make quips as he kills.The motivation for the killings aren't entirely convincing. Though, much like what its being influenced by, the killed are worthy of being killed. They are obnoxious. And, and a lot of points, really find yourself cheering for the killer. Even when the final girl is fleeing, you want her to be done in as well.The Plymouth, Mass. Locale adds a really nice mood. But there are too many logistical quirks to elevate this movie to anything other than a curious look. A total matinee priced flick.",
    "108": "Though it's very formulaic, this film, it's still at the better end of recent gore-fests. We start off with the most unlikely of scenarios - a Thanksgiving sale at a supermarket that goes spectacularly and violently wrong. The population of the founding father's very own Plymouth in Massachusetts become frenetic and determined to do whatever it takes to get into this store and get their free waffle iron! Anyway, a group of kids manage to sneak in first and provoke the waiting crowd - that leads to a stampede with tragic results. Scoot on twelve months and the same store is proposing to have anther such sale, despite the fatalities last time round that led to no prosecutions thanks to some security camera \"errors\". Sheriff \"Eric\" (Patrick Dempsey) is concerned for public safety but that's just the start of his woes. When the rather odious and foul mouthed waitress \"Lizzie\" (Amanda Barker) is found - well half of her is found - stuck to the store's illuminated signage, he must find the culprit before there are even more revenge attacks by the masked pilgrim... Yes, we've seen this all before but here Eli Roth takes a cast that might have been graduates from Ben Platt's \"Theater Camp\" (2023) and turns them into prey for a menacing killer who certainly has some imagination when reeking his havoc on those who did him wrong. It takes a swipe at the commercial culture around this American holiday - rather well presented via Rick Hoffman's store-owning \"Thomas\", father or our lead \"Jessica\" (Nell Verlaque) and husband to the really rather shallow \"Kathleen\" (Karen Cliche). There's a bit of boyfriend rivalry that accidentally displays the versatility (?!) of Milo Manheim who quite successfully ditches his butter wouldn't melt image (anyone seen \"Journey to Bethlehem\"?) before a suitably far-fetched denouement that does take it's time, repeats itself a bit and concludes screaming sequel. There are some some funny moments, the cast largely gel well and though not exactly scary, there are a few effective jumps. I doubt that you'll recall it for long after, but I think this is actually quite good.",
    "109": "This sorry movie could not have been more typical of the lame and trite movies of the last 20 plus years.I thought Roth was a pretty good director, he went down a few pegs after making this color by numbers, weak as hell, 30 minutes too long hunk of trash.The biggest thing to plague this and other \"modern\" horror movies, especially American made ones? Truly unlikable characters. 5 minutes in and I can't wait for these one dimension, selfish undeveloped characters to all get massacred.Even the dialogue is painfully forced, with so many forced f bonbs it was laughable, and I am not in any way opposed to swearing or f bombs, but it was a distracting amount, not believable in any way. I assume Roth was/is also a fan of movies. HOw could he not see what I am seeing? Seems to me, he must. But he made this dolt of a film with all its typical-ness intact anyhow. Why? To cash in.",
    "110": "Thanksgiving begins very well with a terrific scene of catastrophe putside a home ware store on Black Friday. Eli Roth brilliantly films these crazy shoppers like deranged zombies- clawing, fighting, shouting just to get the latest, cheap household appliances.I hate shopping and this and Thanksgiving (which we don't celebrate in the UK) don't appeal to me at all.Sadly, once the plot kicks in it falls apart. First, there's too many characters to follow that i got confused by who exactly they are- and they all are stereotypical; the cocky jock, the need, the sexy cheerleader, the confused, sensitive young woman whose also the lead.At least Scream had less characters but they were more developed. Neve Campbell was rather touching in that but here young Nell Verlaque is bland and unsympathetic. She doesn't gain any real horror just a dead eye stare- probably bored listening to Roth rabbiting on and on about his favourite horror films to the rest of the cast and crew ad nauseam! Like his audio commentary tracks.The kills are fun and well designed, the use of vapid social media is ultised to good effect and the motivation to the killer believable.However it just feels like a ' greatest hits' package of other horrors and it became rather boring.Eli Roth is a talented horror director- he OBVIOUSLY knows his films and it shows but he's coasting here; Hostel is one of the best horrors in the last 30yrs ; here he feels like a studio director playing it safe.",
    "111": "During the exposition of this story, I realized this movie wasn't quite what I was expecting from watching the trailer. The script and the acting were a few degrees hokeyer than I was expecting.I know this was self aware and intentional but maybe a bit more than I wanted or was expecting. I wanted it to feel a little bit more like it was in on the joke, and not so aware that it was THE joke, if that makes any sense. Regardless, this was a fun, campy and almost nostalgic slasher/thriller. It had some super fun and gnarly kills, gore and special effects.I do think that this popular representation of GenZ being these lazy, arrogant, phone obsessed narcissists as we have also seen in Talk to Me, Bodies Bodies Bodies and others is a bit tired and misrepresentative.... but I also understand that it is filling the classic horror trope of insufferable teens in a horror movie of the time.It definitely slow down a bit towards the middle and I think maybe about 10 minutes could've been shaved off of it, but otherwise, the pacing was good and kept you engaged.Overall, this is a very face value movie and I don't mean that in a negative way. You're getting exactly what you sign up for With this one... It is fun, silly and bloody as hell. Definitely see this becoming a classic and something the genuine horror community will thoroughly enjoy. 5.5 rounding up to a 6, would recommend.",
    "112": "LIKES:Pace:\n-It's fast, it's exciting, and surprisingly it makes your pulse pound in this thrill ride of a slasher, getting right to the chaos at hand in the second scene/sequence.-Thanksgiving returns to the roots of this type of story, taking little time set things up and then pushing a continuous run of trying to solve the killer and how to catch him.-Interludes of safety are sprinkled throughout like seasoning, granting time to know the personality, see the minute growth, and reset for the next attempt at survival.-And for this, it's a balanced pace that works for this kind of movie and having the fun these type of genre brings with you.The Acting:\n-While no major victory in terms of the thespian arts, Thanksgiving surprisingly obtains victory in making their characters come to life.-The top billed actors, well... they aren't really the focus of the movie, outside of one, so I'll break tradition and put my top three in here instead.-Dempsey, may still look McDreamy to the fans who followed him on Grey's, and in this film, he has a fine delivery of lines and a small town personality well. Sure, his accent is very strong as most are in this film, but I really felt that he played the sheriff role well and added that comfort role extraordinarily well.Gabriel Davenport as an odd named Scuba, was my next up. A balance of teenage drive with instinct to survive, I felt his character and balance were fun as she started taking charge of the group. Hot headed, certainly, but with a few more layers than the rest of the flock, he succeeded super well in playing one of the male leads.-The winner for me is Nell Verlaque. From her time in Big Shot to now, she has certainly continued to evolve her portrayal of lead characters. I loved seeing her in this role, now pushed for a different type of survival, and having that attitude curtailed to a believable, non-Disney infused, part that made an engaging character to root for.-Chemistry wise... it's what you would expect of a horror movie, good, but nothing mind blowing, as the community screams, runs, and acts terrified to the mysterious murderer in town.The Characters:\n-Again, this is nothing like Star Wars, Lord of the Rings, or other franchises, but it still holds much more quality than say the movies on direct release.-The killer's motifs for once are actually decently fleshed out and explained, each target adding a piece until the revelation for why this was going on.-Meanwhile, our \"heroes\" are showing their colors, several being prime targets for getting their desserts, while others hold a much better role that had me rooting for them making it out of this mess.-It's not certainly complex or unique, but in this genre, not begging for all of them to get killed is a positive sign that you have made the film a bit more engaging.The Comedy:\n-There is always a stigma that comes when you find humor in a horror that isn't say, Scary Movie franchise.-Well this isn't the sociopathic laughs to death, but rather the hokey content and writing that sometimes comes out of this movie.-Thanksgiving is a funny experiment in the concept and \"execution\" of the film, alongside just how funny the gaps and idiotic runs there are. Loaded with these moments, I found myself laughing just at the cheese factor of this movie.-And in some cases, the movie just has lines that had me chuckling. Insults, boorish behavior, and the puns of the villain himself are well-timed and hold a pun power that makes me laugh when done right.-All in all, it's a movie that maintains that campy behavior of the 80s-90s horror that got us started in this genre.The Kills/Horror:\n-For seasoned viewers, this isn't going to be a scary movie, but it has its suspenseful moments where you might find yourself leaning towards the screen wondering if the odds are in their favor.-Yet, we know that the movie is going to involve a lot more death than anything, so in this case the movie's planned fatalities have a little more to chew on than others.-There are no punches thrown, the opening scenes calmest death being a simple glass in the neck, but soon unfolds into disturbingly gruesome finishes that made some skin crawl in my showing.-And with only more ludicrous showings occurring, you again have to be ready for modern day graphics with over the top kills that are horrible, but, quite honestly fun to enjoy.DISLIKES:Too Gruesome At Times:\n-I can't lie, there are moments where this movie crosses into territory not quite enjoyable to me.-No spoilers, but this starts to approach the point of disturbing without having the old school campiness to dilute it, and that sometimes excess was not in my wheelhouse to enjoy.-A warning to those very sensitive to the darker aspects where the odd pushes the frontier a little too far, as this movie might ruin your holidays.The Thanksgiving Theme Is Only Half There\n-Don't be fooled by the first trailers, this movie only uses the Thanksgiving items to an extent, but the rest are traditionally using devices that we've seen a hundred times.-That aspect is disappointing, as that was the unique component that I felt this movie had going. While there are still plenty of Halloween themes, it's just still a Michael Meyers dressed up in a Thanksgiving costume.-It is the fun that comes with it that helps make this act less bludgeoning, but in all honesty I agree with fans and reviewers that not having that creativity after advertising was disappointing.More Character Usage:\n-This is an odd one, but the movie takes a long time in the second scene and sequence to introduce the six to seven main kids and make them this odd family to fight the murderer.-Unfortunately, the movie feels off to some degree in how some of these people are used, several being just group shots and poster characters than significantly contributing to the plot.-Love interests that seem halfway thrown together and becoming a love triangle are fluff, as after a juvenile argument, gets thrown to the wind and cast out into an awkward side that doesn't get enjoyed.-Other times, the character randomly reappears for a death only, once more showing how modern storytelling doesn't quite get it right in the grand scheme of things.-I don't expect a masterpiece with this, but even Syfy channel use the characters better than this mess.The Lazy Dialogue:\n-Is it a cultural thing in the upper states? I guess, but this movie again falls into the trap of using the F word for just about every part of the dialogue.-It's annoying to me, it's boring, and amazing how the writers can be clever in other areas, but using that word for everything is just not my cup of tea, nor does it add anything more than just R rating to what clearly had no issues.-Sure, it's funny and hit just right, but, in this excess, I was ready to take a nap from being overindulged in it.The VERDICT:\nThanksgiving is a love letter to the classic slashers of the bygone era, with modern day visuals that capitalize on the gore. While it is highly aggressive and perhaps too gruesome in the way they took it, the movie holds the campiness, fun, and cheese factor of the drama that should be quite entertaining. A cast that helps draw you into some decent characters, alongside a pace that is thrilling and perfect for hack and slash, you can be sure most fans of this series should have fun carving into this terrifying turkey. I can't say it's the best movie I've ever seen, the most unique, nor really the smashing success I wanted it to be. Yet, to my surprise, I was very happy with this movie and enjoying the twists of a good, engaging slasher, even without the promised twists they were presenting. Factoring in the lazy dialogue and the odd character usage at time, I have to also recommend this movie for the theater viewing in the next few weeks, as I think it is very up the alley of mind numbing thriller.My scores are:Horror/Mystery/Thriller: 8.0\nMovie Overall: 6.5.",
    "113": "It's funny for how big a flop the Tarantino/Rodriguez masterpiece Grindhouse was at least 4 films have flowed from that overlooked film (Machete, Machete II, Hobo With a Shotgun, and of course Thanksgiving). I highly recommend you go on YouTube and check out those fake trailers, as they're not only awesome, but Roth's Thanksgiving trailer actually references a lot of what happens in this film. So, as a film nerd for whom Grindhouse was a seminal film, seeing this movie come to life was a real thrill.And I'm happy to say, Thanksgiving is a lot of fun. Shockingly, it's probably the best slasher I've seen this year, managing to do what all slashers want to do, but few can: deftly balancing horror, comedy, and suspense, and having a ton of fun doing. Roth feels his most comfortable here; it's almost effortless how he bounces from one tone to the other, handling the material with supreme confidence.Thanksgiving really feels like Roth's most professional and polished film.This is aided by a good cast and script; this movie plants its tongue firmly in cheek, but the actors take the material pretty seriously. A good slasher is usually filled with at least memorable people, and Thanksgiving definitely succeeds here. Nell Verlaque is a strong final girl, but it's all the random side characters, a lot of whom are elevated by the performances and actually given some stuff to do. The town of Plymouth in this film feels like a real (if sometimes confusing re its size) place, populated with people who lived lives before and will live after this movie. Shout out to Patrick Dempsey, Rick Hoffman, Tomas Sanelli, and hell, even Addison Rae is pretty good here.I also loved how much this film leaned into Thanksgiving; not just aesthetically, but thematically. The film is a satire of American consumer culture and reminds us that Thanksgiving is a time we should take to appreciate what and who we have - before it's too late.To that end, Roth employs his patented ultraviolence and gore to really drive the message home. Yes, this a bloody one, and yes, it sometimes is a bit jarring given the otherwise serious tone, but I wouldn't have it any other way. This movie has some pretty gnarly kills and imagery and a lot genuinely tense sequences. This isn't like Scream VI, where who survives is predictable. Roth reminds us of the beauty of a great cat-and-mouse scene throughout this movie.Yeah, I loved this thing. I'm absolutely sure it'll become a cult staple of Thanksgiving, easily the best horror film about the holiday, and a great return to form for Roth.",
    "114": "Thanksgiving is a new slasher directed by Eli Roth and set around the holiday of thanksgiving. It started life as a fake trailer in between Roths and Tarantinos grindhouse double feature (Roths best work).Before I even talk about the story, I've been hearing a lot of people asking why there aren't more horror films that take place over this holiday. Surely that answer is simple, it's a Holliday that's mainly only celebrated by Americans and Canadians and so straight away that lessens the films appeal. So for those that don't know thanksgiving takes place at the end of November and is a chance for those who celebrate to pig out on a glorified roast dinner and get hammered with their friends and family whilst forgetting that their country's economy's in the toilet and half the worlds at world but I digress.The first 20 minuets were for me the most original and best part of this film. It takes place on Black Friday and we see the stress that retail workers have to go through to prepare for such an event. This is then followed by hoards of people almost like zombies basically ram-raiding the shop to get 'great deals' on products the shop likely had been trying to get rid of unsuccessfully up to this point. As a result of this carnage several people die and then at the same time the following year someone is out to get revenge on the people they perceive as being responsible but who is this mysterious killer?After the first 20 minuets or so the film basically becomes scream, it's a group of survivors of the Black Friday riot trying to stay alive whilst working out who this killer is. As the audience I felt we were given very few clues throughout as to who it may be and I instead felt the film focused too much on pointing fingers at certain characters to try and distract the us. This resulted in me not really having even a clue as to who the killer might be by the end and when they were eventually revealed I felt their motive to commit such horrific murders was a bit pants.The kills themselves were at the very least always creative however I did feel the gorier the death, the more cheap and unrealistic it looked. I will however say there is one kill towards the end that will stick with me purely for its ingenuity.Personally, I'm not the biggest Eli Roth fan I think his films feel quite cheap and whilst I get that he's going for that 80's B movie nostalgia it doesn't always work for me.With that being said it is one of his better films although if I'm going to watch a slasher I'm still going to stick with the likes of Scream, Halloween or Child's Play.",
    "115": "People who rated this at a 7/10 owe me 9 euros for the purchased cinema ticket. This is the worst 'horror' film I have ever seen in a cinema!The 'Black Friday' opening scene is slapstick, which can't be taken seriously at all.Then the entire film turns out to be based on the ridiculous events in that scene. It feels strange that after the openingsscene that could have been part the scary movie franchise, much weight is put on that scene.The humor in the film is just lame and out of place. But also the story makes no sense. Weird and often too long dialogues are going nowhere at all. The acting is deplorable, the kills are over the top and with little impact or originality. Where movies like Terrifier and Scream are able to successfully mix comedy with horror and over the top kills, 'Thanksgiving' really misses the mark on all fronts. This film might have been suitable at an indy film festival for people who enjoy very bad movies, but based on the ratings I assumed this was a good film. Shame.",
    "116": "Cheaply made, with cheap special effects and a bunch of unkown B-actors, but there is still something to like about this flick...The good: I love it when a horror doesnt take itself too seriously and basically is a sort of a parody on horror movies in general, with lots of humor packaged in a lighthearted way, even during the many GROSS scenes where meat gets cut of someone's body.However gross this movie is at certain moments, it never gets really scary though, but that is the whole point of this lighthearted horror movie. It's a cheap thrill, but a very well made cheap thrill with some good laughs.Recommended for those who simply want to be entertained with some cheap thrills with lots of humor. NOT recommended for those who might (wrongly) expect to see a (REALLY) scary movie...",
    "117": "\"Thanksgiving\" is a serviceable horror film that touches upon all the high school horror tropes. Jocks, nerds, party kids, cheerleader, and so forth. The template is so mid that what you find yourself waiting for is the kills. The murderer isn't that hard to figure out. It's essentially the person whom you know during the Black Friday stampede is the one who is the most traumatized.Was this a social commentary on capitalism? Not in the least. It is really a commentary on horror films of the 80's and 90's.Though director Eli Roth finds gruesome ways to dispense with the annoying teens, for the most part it gets tiresome to watch the gore. And there is also very uneven smirks. Such as when the first victim is murdered, the police are going over the viscera whilst we are (I think) suppose to be laughing. It's sadism from behind the camera.The movie does give you what you want. The kills are associated with the holiday. All the victims have their heads chopped off and placed at the table. And it doesn't take long for the killer (named Carver since he wears a John Carver mask) to make quips as he kills.The motivation for the killings aren't entirely convincing. Though, much like what its being influenced by, the killed are worthy of being killed. They are obnoxious. And, and a lot of points, really find yourself cheering for the killer. Even when the final girl is fleeing, you want her to be done in as well.The Plymouth, Mass. Locale adds a really nice mood. But there are too many logistical quirks to elevate this movie to anything other than a curious look. A total matinee priced flick.",
    "118": "Though it's very formulaic, this film, it's still at the better end of recent gore-fests. We start off with the most unlikely of scenarios - a Thanksgiving sale at a supermarket that goes spectacularly and violently wrong. The population of the founding father's very own Plymouth in Massachusetts become frenetic and determined to do whatever it takes to get into this store and get their free waffle iron! Anyway, a group of kids manage to sneak in first and provoke the waiting crowd - that leads to a stampede with tragic results. Scoot on twelve months and the same store is proposing to have anther such sale, despite the fatalities last time round that led to no prosecutions thanks to some security camera \"errors\". Sheriff \"Eric\" (Patrick Dempsey) is concerned for public safety but that's just the start of his woes. When the rather odious and foul mouthed waitress \"Lizzie\" (Amanda Barker) is found - well half of her is found - stuck to the store's illuminated signage, he must find the culprit before there are even more revenge attacks by the masked pilgrim... Yes, we've seen this all before but here Eli Roth takes a cast that might have been graduates from Ben Platt's \"Theater Camp\" (2023) and turns them into prey for a menacing killer who certainly has some imagination when reeking his havoc on those who did him wrong. It takes a swipe at the commercial culture around this American holiday - rather well presented via Rick Hoffman's store-owning \"Thomas\", father or our lead \"Jessica\" (Nell Verlaque) and husband to the really rather shallow \"Kathleen\" (Karen Cliche). There's a bit of boyfriend rivalry that accidentally displays the versatility (?!) of Milo Manheim who quite successfully ditches his butter wouldn't melt image (anyone seen \"Journey to Bethlehem\"?) before a suitably far-fetched denouement that does take it's time, repeats itself a bit and concludes screaming sequel. There are some some funny moments, the cast largely gel well and though not exactly scary, there are a few effective jumps. I doubt that you'll recall it for long after, but I think this is actually quite good.",
    "119": "This sorry movie could not have been more typical of the lame and trite movies of the last 20 plus years.I thought Roth was a pretty good director, he went down a few pegs after making this color by numbers, weak as hell, 30 minutes too long hunk of trash.The biggest thing to plague this and other \"modern\" horror movies, especially American made ones? Truly unlikable characters. 5 minutes in and I can't wait for these one dimension, selfish undeveloped characters to all get massacred.Even the dialogue is painfully forced, with so many forced f bonbs it was laughable, and I am not in any way opposed to swearing or f bombs, but it was a distracting amount, not believable in any way. I assume Roth was/is also a fan of movies. HOw could he not see what I am seeing? Seems to me, he must. But he made this dolt of a film with all its typical-ness intact anyhow. Why? To cash in.",
    "120": "Thanksgiving begins very well with a terrific scene of catastrophe putside a home ware store on Black Friday. Eli Roth brilliantly films these crazy shoppers like deranged zombies- clawing, fighting, shouting just to get the latest, cheap household appliances.I hate shopping and this and Thanksgiving (which we don't celebrate in the UK) don't appeal to me at all.Sadly, once the plot kicks in it falls apart. First, there's too many characters to follow that i got confused by who exactly they are- and they all are stereotypical; the cocky jock, the need, the sexy cheerleader, the confused, sensitive young woman whose also the lead.At least Scream had less characters but they were more developed. Neve Campbell was rather touching in that but here young Nell Verlaque is bland and unsympathetic. She doesn't gain any real horror just a dead eye stare- probably bored listening to Roth rabbiting on and on about his favourite horror films to the rest of the cast and crew ad nauseam! Like his audio commentary tracks.The kills are fun and well designed, the use of vapid social media is ultised to good effect and the motivation to the killer believable.However it just feels like a ' greatest hits' package of other horrors and it became rather boring.Eli Roth is a talented horror director- he OBVIOUSLY knows his films and it shows but he's coasting here; Hostel is one of the best horrors in the last 30yrs ; here he feels like a studio director playing it safe.",
    "121": "During the exposition of this story, I realized this movie wasn't quite what I was expecting from watching the trailer. The script and the acting were a few degrees hokeyer than I was expecting.I know this was self aware and intentional but maybe a bit more than I wanted or was expecting. I wanted it to feel a little bit more like it was in on the joke, and not so aware that it was THE joke, if that makes any sense. Regardless, this was a fun, campy and almost nostalgic slasher/thriller. It had some super fun and gnarly kills, gore and special effects.I do think that this popular representation of GenZ being these lazy, arrogant, phone obsessed narcissists as we have also seen in Talk to Me, Bodies Bodies Bodies and others is a bit tired and misrepresentative.... but I also understand that it is filling the classic horror trope of insufferable teens in a horror movie of the time.It definitely slow down a bit towards the middle and I think maybe about 10 minutes could've been shaved off of it, but otherwise, the pacing was good and kept you engaged.Overall, this is a very face value movie and I don't mean that in a negative way. You're getting exactly what you sign up for With this one... It is fun, silly and bloody as hell. Definitely see this becoming a classic and something the genuine horror community will thoroughly enjoy. 5.5 rounding up to a 6, would recommend.",
    "122": "LIKES:Pace:\n-It's fast, it's exciting, and surprisingly it makes your pulse pound in this thrill ride of a slasher, getting right to the chaos at hand in the second scene/sequence.-Thanksgiving returns to the roots of this type of story, taking little time set things up and then pushing a continuous run of trying to solve the killer and how to catch him.-Interludes of safety are sprinkled throughout like seasoning, granting time to know the personality, see the minute growth, and reset for the next attempt at survival.-And for this, it's a balanced pace that works for this kind of movie and having the fun these type of genre brings with you.The Acting:\n-While no major victory in terms of the thespian arts, Thanksgiving surprisingly obtains victory in making their characters come to life.-The top billed actors, well... they aren't really the focus of the movie, outside of one, so I'll break tradition and put my top three in here instead.-Dempsey, may still look McDreamy to the fans who followed him on Grey's, and in this film, he has a fine delivery of lines and a small town personality well. Sure, his accent is very strong as most are in this film, but I really felt that he played the sheriff role well and added that comfort role extraordinarily well.Gabriel Davenport as an odd named Scuba, was my next up. A balance of teenage drive with instinct to survive, I felt his character and balance were fun as she started taking charge of the group. Hot headed, certainly, but with a few more layers than the rest of the flock, he succeeded super well in playing one of the male leads.-The winner for me is Nell Verlaque. From her time in Big Shot to now, she has certainly continued to evolve her portrayal of lead characters. I loved seeing her in this role, now pushed for a different type of survival, and having that attitude curtailed to a believable, non-Disney infused, part that made an engaging character to root for.-Chemistry wise... it's what you would expect of a horror movie, good, but nothing mind blowing, as the community screams, runs, and acts terrified to the mysterious murderer in town.The Characters:\n-Again, this is nothing like Star Wars, Lord of the Rings, or other franchises, but it still holds much more quality than say the movies on direct release.-The killer's motifs for once are actually decently fleshed out and explained, each target adding a piece until the revelation for why this was going on.-Meanwhile, our \"heroes\" are showing their colors, several being prime targets for getting their desserts, while others hold a much better role that had me rooting for them making it out of this mess.-It's not certainly complex or unique, but in this genre, not begging for all of them to get killed is a positive sign that you have made the film a bit more engaging.The Comedy:\n-There is always a stigma that comes when you find humor in a horror that isn't say, Scary Movie franchise.-Well this isn't the sociopathic laughs to death, but rather the hokey content and writing that sometimes comes out of this movie.-Thanksgiving is a funny experiment in the concept and \"execution\" of the film, alongside just how funny the gaps and idiotic runs there are. Loaded with these moments, I found myself laughing just at the cheese factor of this movie.-And in some cases, the movie just has lines that had me chuckling. Insults, boorish behavior, and the puns of the villain himself are well-timed and hold a pun power that makes me laugh when done right.-All in all, it's a movie that maintains that campy behavior of the 80s-90s horror that got us started in this genre.The Kills/Horror:\n-For seasoned viewers, this isn't going to be a scary movie, but it has its suspenseful moments where you might find yourself leaning towards the screen wondering if the odds are in their favor.-Yet, we know that the movie is going to involve a lot more death than anything, so in this case the movie's planned fatalities have a little more to chew on than others.-There are no punches thrown, the opening scenes calmest death being a simple glass in the neck, but soon unfolds into disturbingly gruesome finishes that made some skin crawl in my showing.-And with only more ludicrous showings occurring, you again have to be ready for modern day graphics with over the top kills that are horrible, but, quite honestly fun to enjoy.DISLIKES:Too Gruesome At Times:\n-I can't lie, there are moments where this movie crosses into territory not quite enjoyable to me.-No spoilers, but this starts to approach the point of disturbing without having the old school campiness to dilute it, and that sometimes excess was not in my wheelhouse to enjoy.-A warning to those very sensitive to the darker aspects where the odd pushes the frontier a little too far, as this movie might ruin your holidays.The Thanksgiving Theme Is Only Half There\n-Don't be fooled by the first trailers, this movie only uses the Thanksgiving items to an extent, but the rest are traditionally using devices that we've seen a hundred times.-That aspect is disappointing, as that was the unique component that I felt this movie had going. While there are still plenty of Halloween themes, it's just still a Michael Meyers dressed up in a Thanksgiving costume.-It is the fun that comes with it that helps make this act less bludgeoning, but in all honesty I agree with fans and reviewers that not having that creativity after advertising was disappointing.More Character Usage:\n-This is an odd one, but the movie takes a long time in the second scene and sequence to introduce the six to seven main kids and make them this odd family to fight the murderer.-Unfortunately, the movie feels off to some degree in how some of these people are used, several being just group shots and poster characters than significantly contributing to the plot.-Love interests that seem halfway thrown together and becoming a love triangle are fluff, as after a juvenile argument, gets thrown to the wind and cast out into an awkward side that doesn't get enjoyed.-Other times, the character randomly reappears for a death only, once more showing how modern storytelling doesn't quite get it right in the grand scheme of things.-I don't expect a masterpiece with this, but even Syfy channel use the characters better than this mess.The Lazy Dialogue:\n-Is it a cultural thing in the upper states? I guess, but this movie again falls into the trap of using the F word for just about every part of the dialogue.-It's annoying to me, it's boring, and amazing how the writers can be clever in other areas, but using that word for everything is just not my cup of tea, nor does it add anything more than just R rating to what clearly had no issues.-Sure, it's funny and hit just right, but, in this excess, I was ready to take a nap from being overindulged in it.The VERDICT:\nThanksgiving is a love letter to the classic slashers of the bygone era, with modern day visuals that capitalize on the gore. While it is highly aggressive and perhaps too gruesome in the way they took it, the movie holds the campiness, fun, and cheese factor of the drama that should be quite entertaining. A cast that helps draw you into some decent characters, alongside a pace that is thrilling and perfect for hack and slash, you can be sure most fans of this series should have fun carving into this terrifying turkey. I can't say it's the best movie I've ever seen, the most unique, nor really the smashing success I wanted it to be. Yet, to my surprise, I was very happy with this movie and enjoying the twists of a good, engaging slasher, even without the promised twists they were presenting. Factoring in the lazy dialogue and the odd character usage at time, I have to also recommend this movie for the theater viewing in the next few weeks, as I think it is very up the alley of mind numbing thriller.My scores are:Horror/Mystery/Thriller: 8.0\nMovie Overall: 6.5.",
    "123": "It's funny for how big a flop the Tarantino/Rodriguez masterpiece Grindhouse was at least 4 films have flowed from that overlooked film (Machete, Machete II, Hobo With a Shotgun, and of course Thanksgiving). I highly recommend you go on YouTube and check out those fake trailers, as they're not only awesome, but Roth's Thanksgiving trailer actually references a lot of what happens in this film. So, as a film nerd for whom Grindhouse was a seminal film, seeing this movie come to life was a real thrill.And I'm happy to say, Thanksgiving is a lot of fun. Shockingly, it's probably the best slasher I've seen this year, managing to do what all slashers want to do, but few can: deftly balancing horror, comedy, and suspense, and having a ton of fun doing. Roth feels his most comfortable here; it's almost effortless how he bounces from one tone to the other, handling the material with supreme confidence.Thanksgiving really feels like Roth's most professional and polished film.This is aided by a good cast and script; this movie plants its tongue firmly in cheek, but the actors take the material pretty seriously. A good slasher is usually filled with at least memorable people, and Thanksgiving definitely succeeds here. Nell Verlaque is a strong final girl, but it's all the random side characters, a lot of whom are elevated by the performances and actually given some stuff to do. The town of Plymouth in this film feels like a real (if sometimes confusing re its size) place, populated with people who lived lives before and will live after this movie. Shout out to Patrick Dempsey, Rick Hoffman, Tomas Sanelli, and hell, even Addison Rae is pretty good here.I also loved how much this film leaned into Thanksgiving; not just aesthetically, but thematically. The film is a satire of American consumer culture and reminds us that Thanksgiving is a time we should take to appreciate what and who we have - before it's too late.To that end, Roth employs his patented ultraviolence and gore to really drive the message home. Yes, this a bloody one, and yes, it sometimes is a bit jarring given the otherwise serious tone, but I wouldn't have it any other way. This movie has some pretty gnarly kills and imagery and a lot genuinely tense sequences. This isn't like Scream VI, where who survives is predictable. Roth reminds us of the beauty of a great cat-and-mouse scene throughout this movie.Yeah, I loved this thing. I'm absolutely sure it'll become a cult staple of Thanksgiving, easily the best horror film about the holiday, and a great return to form for Roth.",
    "124": "Thanksgiving is a new slasher directed by Eli Roth and set around the holiday of thanksgiving. It started life as a fake trailer in between Roths and Tarantinos grindhouse double feature (Roths best work).Before I even talk about the story, I've been hearing a lot of people asking why there aren't more horror films that take place over this holiday. Surely that answer is simple, it's a Holliday that's mainly only celebrated by Americans and Canadians and so straight away that lessens the films appeal. So for those that don't know thanksgiving takes place at the end of November and is a chance for those who celebrate to pig out on a glorified roast dinner and get hammered with their friends and family whilst forgetting that their country's economy's in the toilet and half the worlds at world but I digress.The first 20 minuets were for me the most original and best part of this film. It takes place on Black Friday and we see the stress that retail workers have to go through to prepare for such an event. This is then followed by hoards of people almost like zombies basically ram-raiding the shop to get 'great deals' on products the shop likely had been trying to get rid of unsuccessfully up to this point. As a result of this carnage several people die and then at the same time the following year someone is out to get revenge on the people they perceive as being responsible but who is this mysterious killer?After the first 20 minuets or so the film basically becomes scream, it's a group of survivors of the Black Friday riot trying to stay alive whilst working out who this killer is. As the audience I felt we were given very few clues throughout as to who it may be and I instead felt the film focused too much on pointing fingers at certain characters to try and distract the us. This resulted in me not really having even a clue as to who the killer might be by the end and when they were eventually revealed I felt their motive to commit such horrific murders was a bit pants.The kills themselves were at the very least always creative however I did feel the gorier the death, the more cheap and unrealistic it looked. I will however say there is one kill towards the end that will stick with me purely for its ingenuity.Personally, I'm not the biggest Eli Roth fan I think his films feel quite cheap and whilst I get that he's going for that 80's B movie nostalgia it doesn't always work for me.With that being said it is one of his better films although if I'm going to watch a slasher I'm still going to stick with the likes of Scream, Halloween or Child's Play.",
    "125": "People who rated this at a 7/10 owe me 9 euros for the purchased cinema ticket. This is the worst 'horror' film I have ever seen in a cinema!The 'Black Friday' opening scene is slapstick, which can't be taken seriously at all.Then the entire film turns out to be based on the ridiculous events in that scene. It feels strange that after the openingsscene that could have been part the scary movie franchise, much weight is put on that scene.The humor in the film is just lame and out of place. But also the story makes no sense. Weird and often too long dialogues are going nowhere at all. The acting is deplorable, the kills are over the top and with little impact or originality. Where movies like Terrifier and Scream are able to successfully mix comedy with horror and over the top kills, 'Thanksgiving' really misses the mark on all fronts. This film might have been suitable at an indy film festival for people who enjoy very bad movies, but based on the ratings I assumed this was a good film. Shame.",
    "126": "I live in Canada and thanksgiving here is not only in a different month than the US, it seems to be a less... feral tradition overall lol. We don't have the looming obscenity of that Black Friday nonsense hovering around the same weekend and the overall custom is just... not as psychotic. Eli Roth fully embraces that American version of the holiday in his bonkers seasonal slasher Thanksgiving, a fleshed out (literally) expansion on the faux trailer that Quentin Tarantino and Robert Rodriguez commissioned him to do for their Midnite double feature GrindHouse. The result is lots of fun and definitely Roth's best work so far as a filmmaker. Fun really is the key word here and it's what seems to have been missing from his work in horror overall so far, with the exception of Cabin Fever, his second best film. In dour, unpleasant failures like Hostel, Green Inferno and the deplorable Knock Knock he just seemed to be coming from a place of malcontent. Thanksgiving is a party though, as any slasher set around a holiday should be, and it not only satirically skewers the rabid consumerism of Black Friday in a shocking opening sequence, but also pokes subtle fun at the woke millennial sentiment around whining and cancelling Thanksgiving itself these days. The gory mayhem is off the rails here, some of the downright outrageous moments from the fake trailer make it into the feature intact and Roth assembles a fine cast including Gina Gershon (sadly, very briefly), Rick Hoffman, Addison Rae and angelic, scene stealing Final Girl Nell Verlaque. I still maintain that Roth should have kept Michael Biehn in the sheriff's role he casted him in for the faux trailer to preserve the horror aura, instead of picking the Grey's Anatomy dude instead but I can see how that guy could be more bankable to the superficial filmgoing demographic aimed at filling the seats. In any case though it's a great horror flick, the killer is genuinely creepy at times, suspense is orchestrated very well, there a a few incredibly effective jump scares that are truly unpredictable moments and the kills.... well they are something else, a grisly parade of well thought out murders that frequently push the boundaries of shock and awe. Tons of fun.",
    "127": "Thanksgiving is a stupid movie, and not a particularly well-crafted one if you want to look at how it's presented, how it's written, and how it's acted... but there's a good deal of fun to be had here. It took a little while to get going, but fitting to the holiday it's named after, you feel stuffed by the end of it. Once things kick off, there's a constant amount of violence, chaos, and mystery, and though it feels like there are too many characters at first, it does help the whole whodunnit aspect of the film.I liked this as a mystery film, and for an over-the-top/sometimes darkly comedic one (very, very stupid comedy for the most part, but the more ridiculous scenes are fun). However, Thanksgiving did little for me as a horror film. I was expecting it to be a little scarier than it was, and it feels limited when it comes to being frightening. There are some intense moments here and there, but many of the scares end up feeling repetitive.Still, the idea of a horror movie about Thanksgiving is so stupid that it working at all is worth commending, and it's possible it's more self-aware about being kind of a joke than I'm giving it credit for. I just found the horror stuff a bit whatever, but Thanksgiving ends up wading into various other subgenres with more success.I'd be willing to see Eli Roth go even further into making a full-throttle - perhaps even sillier - horror comedy, because this feels like a step in the right direction compared to other films of his like Hostel and The Green Inferno (the only other movies of his I've seen - Thanksgiving is much, much better than either, in my opinion).",
    "128": "Halloween season is over and normally i keep my horror for that period, but having heard how good this movie was and that it was still in theatre, i wanted to support it.Being a Quebec Canadian, we don't really celebrate thanksgiving here, even tough we have a Canadian version that is close to the USA one, but im always up for a good slasher.This movie is basically Scream meet Halloween Kills. It has you guessing on who is the killer but also has a pretty high and creative bodycount. Thats the part i apreciated the most. The blood and gore is well done and the guessing game is solid.That said it is not without a few minor flaws. Personally i couldn't really care much about the characters. They are all very shallow and uninteresting. You never spent much time with them exept the main girl and altough everyone is in a couple, you never get much intimacy moments with them to make you care much. But i guess thats the price for having a big bodycount so its a balance, it really depend on what you prefer. Ill admit i usually watch a slasher more for the kills than character developement so it didn't bothered me that much.There is also a few \"characters\" that are there stickly to make the bodycount rise and you barely get anything else with them.A part i didn't like as much tough is the \"Final Destination inspiration\". Some situations are VERY stretching it when it comes to \"suspend your disbelief\", including in the introduction. I know being stomp is a real thing and freak accidents CAN happen, but that was pushing it a lot. Some of them really had no purpose once again beside giving us more blood and gore. And there is a few parts where i felt these humans were made out of marshmellow. Human bones do not break \"THAT easy\". But again its a minor flaw for me.Apparently the movie didn't do crazy numbers in theatre but everybody seem to love it (myself included) so i wouldn't be surprise it make a lot more money with its VOD/Bluray release and this could very well become a franchise. Maybe then i could get a little more interested in some of those characters if we spend more times with them.Overall a solid slasher flick thats a welcome addition to any horror fan collection.",
    "129": "You hear the term 'jump scares' thrown about a lot. This movie had me literally leaping out of my seat numerous times, not to mention taking names in vain and flinching involuntarily.Eli Roth has served up a long form version of the\nmemorable trailer he provided for the Rodriquez/Tarantino Grindhouse double feature with mixed results.When it makes with the horror, scares and general gruesome goings on it really works.A good 20 minutes early in the film is pretty slow going, though It kind of makes sense why it's there: build a world to familiarize yourself with the community & its characters to raise the jeopardy and generate a well of suspects.The dialogue in this portion isn't necessarily corny or unrealistic, it's just kind of bland & inconsequential. Though I know Roth is contributing an entry into a genre not known for it's subtlety or hyper realism, there have been many sale stampedes that have not resulted in any such carnage as this.",
    "130": "There are so many holiday themed scary movies mostly centered around Christmas and Halloween but now we finally have Thanksgiving, a horror flick directed by horror movie legend Eli Roth. Die-hard fans of the genre may know that Thanksgiving is based off the mock trailer in Quentin Tarantino and Robert Rodriguez's double feature Grindhouse which Eli Roth was also attached too.Thanksgiving, the movie not the holiday, is about a serial killer attacking people from the town of Plymouth Massachusetts a year after a tragic Thanksgiving/Black Friday event. Although the Grindhouse film was campy from beginning to end, Thanksgiving felt like a more serious movie with campy aspects to it. However, the execution of that concept doesn't always work. There was a more \"grounded\" tone when it came to mystery of who the killer might be and his motives but it was always undercut by the absolutely dumb decisions made by the most unlikeable cast of characters one of which played by TikTok star Addison Rae for some reason.Eli Roth movies are known for their over the top violence and this movie is no exception. There are quite a few slow moments but Slasher fans will be happy when the killer does his thing because he gets the job done in some creatively disturbing ways.The writing is the weakest part of the film. For example I think Eli Roth made the characters here extremely unlikeable on purpose which would've been a great idea if he didn't try to spend a good part of the movie making audiences care for teens by the end.Eli Roth has worked with many horror movie connoisseurs so its unfortunate Thanksgiving falls into so many generic tropes including many leaps in logic when it comes to the killer getting to his victims. On top of that time the killer's reveal and motivation made the ending feel pretty anticlimactic.Despite Thanksgiving's shortcomings, it's an enjoyable slasher movie. Eli Roth knows how to deliver on the gore, suspense and camp at times but the film as a whole left a lot to be desired.",
    "131": "I finally got the chance to watch Thanksgiving, and oh my god, this movie is the real deal! Since it was based on Grindhouse fake trailer of Thanksgiving, we finally got the real Thanksgiving movie every horror fans really wanted. Thanksgiving is a lot of fun, and also more real than I expected. The Jumpscares, the Gore, and the Kills was insanely wild!Patrick Dempsey, Addison Rae, Milo Manheim, Nell Veraque, and Rick Hoffman, and every actors did a solid job with there performance and the acting was really good. I am very thankful for Eli Roth, our legendary director of Hostel 1 & 2, Cabin Fever, Knock Knock, and The Green Inferno, to be the right guy for the job, because he wanted to make a thanksgiving movie for a very long time.And now we've finally got the best Thanksgiving slasher movie of 2023! Because like the poster says: \"There will be no leftovers\" and I gotta say... all has been carved on the Big Screen! This is the best Thanksgiving horror slasher movie I've ever watched!9/10.",
    "132": "Slasher movies are often predicable, same kinda plots and gross out scenes... But not this movie, what Eli Roth has done is not far short of genius...This movie kinda reminded me of 'I know what you did last Summer' and the continuing successful franchise 'Scream' but this time the gears have been turned up.The opening sequence was a brilliant start centring around the American 'Thanksgiving' festivities with the associated BLACK FRIDAY event... With out any spoilers, you'd think the beginning of the movie pushes it gore to the max but this is just a taster, snippet of what's to come..Like all decent slasher movies, there is always an ulterior motive which drives the movie, what follows is such movie gold... A movie with a great plot, use of excessive blood, moments of pure shock with a little bit of seasoning to add... I'm satisfied.",
    "133": "We'll, the headline says it all.If I hadn't been asleep for 15 minutes of the film, we would have left earlier than we did which was after about an hour and 10 minutes.This is as much a US college movie as you'll ever see, even more than the I know what you did last summer movies.It was just horribly bad.Poor acting, an absolutely ridiculous story and just a patheticly poor movie.I wouldn't even recommend watching it at home when it's released on Netflix or prime whichever is desperate enough to pay for it.This is officially the first movie I've walked out of the cinema while watching, and my wife thinks exactly the same as me and was also happy to leave.Seriously, don't waste your time with it.",
    "134": "Okay, so I went in expecting brutal kills. Didn't really get those but we will get to that in a bit. I also went in expecting a film where I could just turn my brain off and enjoy a decent slasher - similar in tone to Friday 13th / Halloween etc. I didn't get that.The problem is, it was boring. The characters were all 2 dimensional (you can have a throwback to yesteryear films but still have characters who are different to each other). The constant swearing was too \"try-hard\" and grated me. How's about using swearing in scenes where it actually has an impact instead of just noise? And, no, swearing doesn't bother me in life.Then the kills... One woman gets cut in half because a bin closed on her? Okay - so it's a comedy film then? Cool. Then we see her body hanging up next to a sign advertising 50% off... Okay, so it's a bad comedy film... Got it. But then, no more \"humour\" and the kills just got boring. No build up, just DONE. (neck snap being an example: no pre-warning, no cat and mouse game - just killer comes on, snaps neck and goes again). Talk about zero tension.This might be a throwback to films gone by but, I wish it didn't exist because it won't be helping the genre. It'll just be encouraging more awful writing as people try and \"out do the kills\" whilst ignoring the story.",
    "135": "I loved it! It's a real old-fashioned slasher, with a constant high pace, very inventive and gruesome killings, and an abundance of hefty gore. The stampede on the superstore at the Black Friday-sale in the beginning is absolutely awesome, and even gives this for the rest pretty one-dimensional horror-flick a nice cynical edge. The acting (not that important in this kind of movie) is actually quite good, with Patrick Dempsey in an important, albeit not very challenging role, but it's always a treat to see his handsome face.Maybe the motive for all the killings was a bit farfetched. And I sometimes had a hard time to keep all the different characters apart. And when you put a person fully clothed in a burning oven, then it seems likely that all the clothes are fully burned away afterwards. But that's just nitpicking, it sure didn't mar my pleasure.Definitely not for the tenderhearted, but for the slasher-fans highly recommended!",
    "136": "If you're looking for a terrible use of your time then Thanksgiving is the way to go. I recently watched this movie and to put it plainly, it was like watching a bad intern making a movie. A totally tasteless experience.Directed by Eli Roth and starring Patrick Dempsey, Thanksgiving told a completely predictable story.Thanksgiving is a \"horror\" movie about plain characters, doing something dumb and getting killed for it. Despite the obstacles, big and small, the characters in the movie, as well as the viewers, still meet a terrible end. The performances from Patrick Dempsey illustrate the narrative of this movie with such a viable effort. Consequently, this film ended up being as cheap as it is.Thanksgiving intertwined visuals, audio, and plot in a very flat way.It was as if Eli Roth combined the characters, the setting, and the valued objects within the film and then threw them into a mixing bowl to create a giant serving of terrible turkey. As a viewer, chewing and pondering on the quality of my turkey, I couldn't help but think about how sour it tasted. The flavours of the film blended so terribly that I considered getting McDonalds for emotional support!This story of this slasher is a triumphant effort on Eli Roth's part in making viewers weep with indifference.Overall, I found Thanksgiving to be tasteless, predictable and cheap! It is a terrible plate of turkey, seasoned with the theme of a slasher, and to leave you with a lingering sour taste in your mouth.",
    "137": "Why in the world would you take a parody of 70s/80s slashers and make it into a straightforward, unironic horror flick? Why??!? The 2007 fake trailer for \"Grindhouse\" was everything this feature version is not: fun, funny and witty. Sure, there are some, er, humorous moments in \"Thanksgiving\", but too often the film feels like a forthright (and uninspired at that) splatter film - more \"I Know What You Did Last Summer\" than \"Scream\". The characters, including the final girl (but with the notable exception of the arms dealer dude) are dull. The plot is predictable (it took me 20 mn to guess who the killer was and little more to know how he would be dispatched) and often includes far-fetched or impossible twists. The death scenes are not particularly exciting and confuse gory with fun. At no point do you get the feeling that this movie is winking at you knowingly, concealing its satirical nature behind a pose. If Roth's intention was to make a camp and self-aware film this is a total failure - unless it was all too subtle for me, which I grant you is a possibility. When the killer exclaims, \"And this time there will be no leftovers!\", it just comes across as a cheesy line, not as a campy reference to b-grade movies.What the filmmakers have accomplished here is make an exploitation film that takes all the kitschy fun out of exploitation flicks and only keeps the tedium. But hey, maybe that's what the joke is all about??",
    "138": "Who in their right mind thought Eli Roth would make his best (slasher) work by far in 2023? Not me. But, here we are! This is a solid, shining example of Roth playing to his grindhouse strengths, crafting a straightforward slasher that sticks to the genre basics. The Thanksgiving riot scene is incredibly chaotic, and it's hard to take your eyes off what's going down, even in all its violent, gnarly glory. Roth also takes not-so-subtle jabs at the whole Black Friday tradition, which by now, is notorious for its laundry list of gruesome injuries and deaths.The film, as a whole, is even better than the latest Scream entry, and the kills are wholly fresh and inventively executed. It also smartly gets one slasher trope right (which many such films get wrong), i.e. The characters that get offed are the ones that had it coming for them. This is what worked (for me, at least) in the latest Saw installment as well, and when a filmmaker hits the right storytelling beats, the gory violence and superb special effects are just fun add-ons. Also, I'm really (like REALLY) surprised at one of Roth's casting choices - Rick Hoffman (who played one of the most evil dudes in Hostel) plays a loving dad. I'm guessing this decision is also why I loved the post-credits scene (LOL!). The Gen Z cast, while not perfect, are better than the ones in your average slasher.P. S. Hollywood, please cast Patrick Dempsey in more movies. Can someone cast him and Paul Rudd in a roadtrip-buddy-comedy soon?",
    "139": "Pretty much your typical horror movie that you get these days. The focus isn't really on the scares but more so on how gross the movie can get and this one gets pretty gross. I guess it's supposed to make you laugh also, I found myself laughing at some of the kills because they were so ridiculous. Especially in the opening scene. There were some things I was hoping to see make it into this movie that were in the Grindhouse trailer but unfortunately they didn't.Towards the end everything starts moving fast. I wish the dinner table scene would have lasted a little longer but it's like the director seen he only had 15 mins. Left and sped through everything. The reveal was lackluster, and the killer was a little lackluster. The conflict is resolved to quick (or not at all). Some of the characters that were prevalent throughout the movie just pop back up at the end. And the very last scene wasn't needed and then a quick cut to the credits.I enjoyed the movie besides how quickly everything got wrapped up towards the end.",
    "140": "Just Got out of a Thanksgiving Screening.Excellent Opening but Yeah, It was Just Boring as Hell after a While.Positives -1. ðŸ“º The Black Friday Opening Scene was Great.2. ðŸŽ‰ The Core young Characters were lively, so that was another Positive.3. ðŸ‘º A lot of the Kills were Brutal.4. ðŸ˜Š There were some Amusing Comedic Moments During and After some of the Kills.But that runs thin after a while.Negatives -1. The Plotline after a while, is Just Boring. Again, after a while, I didn't really care about who the Killer Could be.2. The Build up and Reveal was just absolutely Terrible.Overall, Great Opening and Some of the Kills were Ok but the film is the Just Boring as Hell after a While.",
    "141": "This is based on a short fictitious trailer by Eli Roth from the film Grindhouse (2007), a trailer I thought would have been interesting to see a full horror movie on it, since there are other fictitious trailers from Grindhouse (2007) that have been turned into full movies, like the movie Machete (2010). Now we have a Thanksgiving slasher movie that is designed to be watched during the holiday; the movie slasher movie Thanksgiving (2023) is a fun, gory, and entertaining slasher movie that is not perfect, but the movie has a fitting killer and message that involves how people act during the holiday. Also, the movie shows how consumerism from Black Friday at a store affects people to distract them from what the holiday is about, leading to a big situation in the movie.The movie focuses of these people after an intense Black Friday at one of the town's well-known stores, and the performances are not that bad; the teenagers getting attacked by the killer were not involved in the Black Friday incident, so you can at least care for them, but also there are people who were involved that deserved to be attacked by the killer because of what they did on that day. There are some characters that could be annoying, and some of the dialogue could have been better; these characters are not meant to be memorable, because this movie does follow horror movie slasher tropes, but they are done well where the tropes are not annoying to watch.I liked the killer of the movie with how he looks, and how he kills people with traditional Thanksgiving items or in interesting brutal ways just by hitting them with an axe; he does a lot of Thanksgiving related things and there are a lot of brutal bloody kills that horror fans will like. The reveal of the killer was not bad, and it made sense why the person was killing people, along with the movie having some suspenseful moments, and scenes that replicate moments in the trailer the movie is based on. There were moments that did not make sense, or characters who do not appear until a certain point like they teleported around, something like that happens in the third act.Thanksgiving (2023) is not a perfect horror movie, but it is a fun horror movie that I would recommend watching on Thanksgiving, especially if you are a horror fan; the kills are brutal, the Thanksgiving theme is well done, the characters are not bad, and the killer is cool and fits the theme of the movie. The movie has its issues with some dialogue, some characters, and some of the execution of scenes; but other than that, I will watch this movie again next Thanksgiving as my go to movie to watch during the holiday.",
    "142": "\"Thanksgiving\" is a horror and comedy film directed by Roth and Jeff Rendell, starring Jeff Rendell. The film follows a Black Friday sale with a high body count, showcasing Roth's expert timing for shock and laugh-out-loud awe. The film highlights the tension and brutality of the situation, as a mob bursts into a Right Mart store, requiring rations for the apocalypse. The film highlights the \"black\" in \"Black Friday\" as blood splatters and people die for free waffle irons. A year later, a killer with the mask of first Plymouth, Massachusetts governor John Carver terrorizes the town, targeting high schoolers, the owner, and customers who were part of the tragedy. The local sheriff investigates the murders, but Jessica, the store owner's daughter, starts piecing together the events while receiving cryptic Instagram notifications and images of a table set. Some suspects include her boyfriend Bobby, who vanished after a Black Friday sale, and Ryan, who swooped in on Jessica after Bobby left. The story explores themes of identity, revenge, and the consequences of a tragic event. Despite an R rating, Roth has held fast to the demented playfulness of classic exploitation in a stick-to-your-ribs feast of ascended schlock. He serves up prime-certified laughs and mutilations, no fillers or additives, and delivers prime-certified laughs and mutilations without fillers or additives.\"Thanksgiving\" is a well-crafted slasher film with a single jump scare, thanks to Roth's focus on timing and impressive kills. The film's steady flow of horror and comedy adds to its suspense, but it can be too sadistic in the last third, potentially pacing. The director's support for the killer is evident in the film, which is scattered and delivers its reveal in a clunky manner. The film's survival game is a satisfying experience for viewers. Eli Roth has been a pioneer in blending low-rent genres into mainstream cinema, such as splatter horror, erotic thrillers, and mondo films. Roth directed a short for a Z-grade slasher that loosed a killer in a pilgrim get-up on Plymouth to slice up their annual Turkey Day parade. In his gorefest Thanksgiving, Eli Roth's new horror film, Thanksgiving, features a leering POV of a killer plotting his next home invasion. The opening shot is a fake out, paying tribute to the voyeuristic beginnings of Halloween and Black Christmas. Roth's flamboyantly gross, tongue-in-cheek addition to the holiday-horror calendar is somewhere between homage and parody. His first attempt at this premise was a mock trailer for Grindhouse, which was a spoof of the slasher programmers of the early '80s. Sixteen years later, Thanksgiving is a real movie, with Roth ditching the retro, grainy, damaged-print gimmick. His new Thanksgiving is like a remake of the imaginary '80s version, upgraded for the age of smartphones and Scream-inspired slasher whodunits, but with the sick-puppy sense of humor left intact. In Plymouth, Massachusetts, a Black Friday promotion leads to a stampede, resulting in casualties. A year later, a killer in pilgrim attire and a plastic John Carver mask begins to wreak havoc across town, targeting rioters, store owners, and teenage girls. A cop, played by Patrick Dempsey, is hunting the killer. The violence in Thanksgiving is both ridiculous and brutal, balancing memorability and inventiveness without becoming truly unpleasant. The film's director, Roth, has adapted his sadism from the cartoon inconsequiality of slasher cinema, making even the most ghoulish moments closer to shock comedy than horror. The film feels indebted to the infamous Terrifier movies, with a villain who occasionally trades out his pilgrim theme for a pistol and clown getup. The film's violence is both ridiculous and brutal, with mileage varying according to sensibility, sensitivity, and gag reflex.",
    "143": "The movie is just bad, and lacks any and all redeeming qualities. The backstory, is confusing and felt rushed. It was so confusing and instead of going in depth a bit. They just jumped straight to the slaughters, like we're just going to glimpse over it. The characters are cliche as hell, and the plot is blender then iceberg lettuce. This movie lacks any sort of originality, the characters are stupid, The actors have no sort of acting skills. These people are literally being hunted down and they're showing the most mellowed down expression, while trying to give the correct reaction. Its like watching a five year old try to be surprised about something they already knew about, the expression is just so fake while the reaction is usually over the top. Half of the movie I was just trying to wrap my head around what the hell was going on and all I got in the end was a headache. I'm not even a picky dude about movies, especially horror, and usually believe that a horror movie will either have a good story, enjoyable characters, or is just ridiculously funny meaning it will at least have something that shows it the time of day, but no not this, Dhar man could come up with something better. And I think the saddest part about all of this is how hyped up I felt from the trailer. Thanksgiving slashers aren't exactly common, so seeing a new one was coming out with what looked like an interesting killer, and a good backstory, turned out to be more of a disappointment, then a kid getting coal for Christmas. TI will give this movie the benefit of the doubt though, it had good gore and the murder scene's are well crafted. I want to write an essay just about how much of a disappointment this movie was though , but ill save your time. If I could rate this a 0/10 stars i definitely would. Dont waste your money or time on this movie please.",
    "144": "4 out of 5 stars.Thanksgiving is a good slasher film which Eli Roth has fun with its gory and bloody kills and thrills.The plot is good. It involves a massacre at a black friday shopping which leaves people injured and dead. A year later, someone dressed as a thanksgiving figure is murdering one person at a time that was involved in the massacre the year before.The kills are bloody and gory. Not as bad as Eli Roths earlier films like Hostel or Green Inferno. It is still thrilling. The cast ensemble is good. The script and direction is thrilling while trying to have a little fun with the slasher genre.Overall, it is one fun thriller that will keep you entertained.",
    "145": "A year after a massive tragedy, a group of friends trying to get past the incidents are shocked when a masked killer starts to pick them off one by one for their supposed involvement in the tragedy the year before, and when they realize the true purpose of his rampage must figure out who's responsible and stop them.This was a rather fun if somewhat problematic genre effort. One of the better features of this one is the solid storyline at play which gives this a really fun mainstream quality setup. The initial setup with the fantastic incident at the store that sets everything in motion where the surge of occurrences at the time provide the perfect storm for the chaos and tragedy that takes place, a scene that not only serves the film well from a storyline standpoint but also has a lot of high-energy action and confusion as the various setpieces get showcased. The ensuing aftermath that comes in the following year is effectively handled with the incidents detailing how they've fractured and split apart, still struggling with the incidents of the previous year, and trying to move on all form a fine focus here with the way it all builds up to the life they've lived since everything's went down. This provides the kind of starting point that leads into a solid mystery angle with the kills once the bodies start dropping in the current day. With the clues starting to appear as soon as the first kill happens, this one provides the kind of starting point for the mystery of the killer that gets enhanced quite nicely with the social media posts targeting them, the series of clues left behind at the scene of the crimes, and how the different reveals from the recovered pieces of footage from the fateful night that all come together into a fantastic scenario. There are plenty of logical red herrings at play as this one goes along which is a fine touch for how this type of effort is supposed to play out, and the way they're built up logically through these various twists and turns that come about here which ends up leading to the solidly surprising reveal at the very end. That provides all the basic setup required for a slew of highly effective and enjoyably graphic slashing scenes that have a lot to really like here. Mixing a slew of impressive stalking tactics with unflinching gore, there's a lot to like here with the scenes of him taking out the waitress at the diner, the security guard in his apartment, or the stalking scene at the school where his double-attack on the students there come with suspenseful setups alongside a brutal death. The result of his stalking scenes, with the demented dinner the killer's prepared which features everything being livestreamed over the internet which leads to a slew of effective chases and encounters throughout the area that are immensely fun and thrilling reveals that are at play with this one. Combined with a high-energy finale that gets a lot to like, there are plenty of positive aspects to like with this one. The film does have a few minor issues, but they aren't that detrimental overall. The main issue with this one is the unnecessary overwhelming amount of characters who are still alive at the end of the film. This one tends to utilize way too many survivors of the finale by simply abducting them alive and not killing them off at the big dinner sequence despite going for the jugular at that point so it's rather odd that it would leave so many still alive at this point by doing the exact opposite before then. That extends to the curious ability to save the couple's romantic triangle at the heart of the film with some unresolved aspects in place due to how many of the survivors it leaves who are involved with this, so it does have an even bigger confusing feeling about the film having too many survivors. Beyond this, though, there's not much to hold this back.Rated R: Graphic Violence and Graphic Language.",
    "146": "From the man who brought us such ground-breaking classics such as 'My possessed pet' and 'A ghost ruined my life' comes yet another sub par, uninspired, poorly executed attempt at horror.A cliched collection of one dimensional high school friends with zero personlaity are targeted by a unhinged, masked killer on Thanksgiving.The film rips off a number of well renowned horror classics such as Halloween, Scream, I know what you did last Summer, the usual suspects.Terrible dialogue, complete lack of atmosphere,awful acting, Eli Roth yet again attempts to cover all this up with gore and lots of blood.Add a nonsensical plot, ridiculous set ups and you have an insulting movie that treats it's audience like turkeys.For someone who loves horror so much, Eli Roth continues to fail to add anything worthwhile to the genre.",
    "147": "After being absent for a couple of years, Eli Roth returns again not only with a new slasher for the holiday season, but with a new spin off of the Grindhouse project created by Robert Rodriguez and Quentin Tarantino. After RodrÃ­guez made two Machete films and then the Hobo With A Shotgun film came out, it was a surprise that Eli Roth finally made a film to continue what RodrÃ­guez and Tarantino started, this being the sixth installment of the Grindhouse project . What Eli Roth does is revive one of the old sectors of slasher cinema that is oriented around festive dates. It's been a long time since the last time a slasher related to a holiday was made, leaving aside those related to the Halloween season. Now Eli Roth revives this type of slasher by making a Thanksgiving-oriented film, which is something no slasher has done before. The concept that Roth showed in the original trailer released in 2007 was pretty good, but like Machete and Hobo With A Shotgun, there were changes. The original trailer was pretty rough around the edges, but the film made some changes to make something more suitable for public cinema. Roth's original idea at the time of making the trailer was more outlandish and more fitting for an NC-17 rated film. Roth decided to renew the idea into something much simpler that would not stray away from an R rating and it is not strange because some scenes from the original trailer were modified and others were discarded. The film is not that gruesome, but it does have brutal death scenes. The other Grindhouse films had a retro B-movie feel and quality, but Thanksgiving has none of that except in the credits. On that side, it moves away from the idea of being a new exploitation film as the original trailer showed. What Thanksgiving does manage to achieve is to be a traditional slasher despite being focused on the 2020s. In terms of script, pace and quality, the film has the air of a slasher film from the 80s. It offers us a murder story originating from A tragedy occurred on a festive date and those involved become the main targets and the majority of the victims are usually teenagers. It has many of those characteristics common in eighties slashers and manages to follow the formula of Black Christmas, Silent Night Deadly Night, My Bloody Valentine, among others. You could say that Thanksgiving is the new film that slasher cinema needed to return to the classic, but at the same time present something fresh. Not only is it another good return for Roth to horror cinema, but rather a gift for slasher film lovers. My final rating for this movie is a 9/10.",
    "148": "Lots of fun for the Thanksgiving holiday. Sardonic and twisted. We kept trying to figure out who was the killer. I guessed it before anyone else in my group. Pretty funny. Not Annaconda fun, but pretty close.Best joke involved a meat thermometer...pop! You're done!Eli Roth usually makes very dark movies. This one was a lot lighter. I liked the social commentary on Black Friday mayhem greed and avorice. About time we have more movies about crazed ax welding pilgrims set lose on the public during the Thanksgiving holiday!We loved all the funny deaths scenes. The dumpster, the cheerleader, but the best was the horrific and sardonic oven roast!I really recommend this movie if you like twisted deaths that are ironic in nature. I give it two thumbs up!ðŸ‘ðŸ‘",
    "149": "Who ever thought that, of all the active directors in the world, none other than Eli Roth would be the one responsible for the best (arguably) and most entertaining (definitely) horror movie of the year 2023? Despite several long-awaited and acclaimed sequels/remakes (\"The Exorcist: Believer\", \"Evil Dead Rise\", \"Saw X\", ...) and curious experiments (\"Five Nights at Freddy's, \"Renfield\", \"Cocaine Bear\", ...) it is Roth who triumphs with an old-fashioned but blood-soaked and delightfully tongue-in-cheek throwback to the glorious era of 80s slashers.The history of \"Thanksgiving\" began in 2007, when Roth put together a gritty two-minute fake trailer as part of Quentin Tarantino's and Robert Rodriguez' \"Grindhouse\" film-project. It was a quick and dirty little assignment on the side, but nevertheless fantastically handled by Eli Roth. His trailer genuinely looked and felt like an early 80s relic, because he cleverly cashed in on the contemporary popular trend of holiday-themed horrors (\"Halloween\", \"Happy Birthday to Me\", \"My Bloody Valentine\", \"Graduation Day\", ...) and he stuffed it - like a Thanksgiving turkey - with gore, imaginative kills, sleaze, dumb teenagers, and hysterical shrieks.Now, it's one thing to create a fun trailer for a movie that never existed, but making a compelling and entertaining full-length out of it is something else entirely. And yet, Roth did practically everything right. He didn't try to turn \"Thanksgiving\" into another 80s period piece but brought the action to present day Massachusetts and incorporated typically irritating 2020s hypes like Black Friday shopping madness and the live streaming of other people's misery for the sake of likes.Simply put, \"Thanksgiving\" revolves around a strong and merciless killer who, disguised as an original pilgrim and armed with an axe, goes after the people responsible for a tragedy that occurred in a shopping mall one year before on Black Friday and resulted in the death of three people. The killer, referred to as John Carver, does not only target the irresponsible manager of the shopping complex, but also the obnoxious teens and greedy people who were ready to trample others to be the first to get a free waffle maker! In good old slasher tradition, there are numerous suspects for who might be the killer, and just as many subtle hints/clues for the attentive viewer to guess along for his/her identity. The key words in \"Thanksgiving\" are: fun, gore, tribute, and absurd. The first three are self-explanatory, and I'm adding \"absurd\" because you truly haven't lived until you witness a grown woman getting baked and served like a (tasty looking) Thanksgiving dinner!"
}