{
    "0": "Five children from different walks of life win golden tickets that enable them to partake on a tour of an elaborate candy factory run by eccentric recluse Willy Wonka (superbly played to the creepy and quirky hilt by Gene Wilder). Director Mel Stuart and screenwriter Roald Dahl use the deceptively pleasant premise as a means to turn the concept of the breezy and innocuous escapist fantasy musical that's fun for the entire family completely on its ear by presenting four hideously obnoxious kids -- Julie Dawn Cole's petulant and pampered rich bitch Veruca Salt, Michael Bollner's gluttonous Augustus Gloop, Denise Nickerson's rude gow-chewing Violet Beauregarde, and Paris Themmen's addled boob tube addict Mike Teevee -- who are terrible toxic products of too lenient and/or indulgent parents and hence wholly deserving of the harsh fates that befall them. Mostly importantly, while protagonist Charlie Bucket (a fine and likeable performance by Peter Ostrom) is a basically decent and honest boy, he isn't bereft of a few flaws himself. Director Stuart deftly crafts a light, yet dark and sardonic tone as well as keeps the immensely entertaining story moving along at a brisk pace. Dahl's clever script not only provides lots of sparkling witty lines and sharply drawn characters, but also offers a potent and provocative central message concerning morality and responsibility. Moreover, it's acted with zest by an enthusiastic cast, with especially stand-out contributions from Jack Albertson as the doting Grandpa Joe, Roy Kinnear as the long-suffering Mr. Salt, Leonard Stone as the crass Mr. Beauregarde, and Gunter Meisner as the sinister Mr. Slugworth. Kudos are also in order for Arthur Ibbetson's vibrant cinematography and the marvelously catchy songs by Leslie Bricusse and Anthony Newley. A sheer delight.",
    "1": "What can I say? Grandpa Joe is a slacker who faked a disease so that his child could take care of him in his infirmity and then has a miraculous recovery when his grandson finds the golden ticket. He also nearly loses the grand prize for Charlie by counseling him to commit industrial espionage by giving the everlasting gobstopper to Slugworth.\nAfter Charlie decides against GJ's nefarious plan, he wins the contest and is rewarded with the factory. When Wonka tells Charlie he can move in immediately, GJ exclaims \"Me too?\"\nI'm still waiting for the true life sequel where Grandpa Joe wrests control of the factory from Charlie and \"disposes\" of him and the family.",
    "2": "\"If you want to view paradise, simply look around and view it.\" Willy Wonka & The Chocolate Factory is one of the best children films of all-time. The characters, you all have to adore, even if their annoying or not. The film is about a boy who finds a golden ticket in a Willy Wonka chocolate bar and heads off to see the Willy Wonka factory with his grandpa and other people. Gene Wilder was great as Willy Wonka and his performance was quite funny and actually kind of weird. The kids were all great especially Augustus Gloop, he was hilarious. Overall, Willy Wonka & The Chocolate Factory is a classic and should be viewed by everyone.Hedeen's Oulook: 9/10 ***+ A-",
    "3": "'Willy Wonka & the Chocolate Factory' has withstood the test of time. And though quite dated, it is still a widely enjoyed film (with good reason!). This movie had a magnificent performance by Gene Wilder as Wonka, a wonderful story and great art direction for its day as they brought all of the awesome things at the Wonka factory to life (how cool it would be if you could actually go to a place like that), to being a superb musical.The story is that of a famed chocolate manufacturer, Willy Wonka, who's factory is a magical secret that was shut down when competing candy companies kept trying to infiltrate the factory with their spies who wanted hold of the ingredients that made Wonka's candy the most novel and ultimately, the most novel. Of course, Wonka has a change of heart, and decides to hold a contest whereby the people who can find one of the five golden tickets randomly (maybe, all of the winners were conveniently children, four of which had horrible manners) in Wonka candy. It could be anywhere. One by one, it seems that the tickets are being found, particularly by obnoxious kids who are all about the same age. (Veruca Salt, the most horrid and funniest of them all, would later inspire a late 90s alternative band). The selfish British brat, the slothy German boy, the record gumchewer with the sleazy car salesman father, and the boy who lives in front of the television. And there's only one ticket left. Meanwhile, a pathetic, depressed little boy named Charlie Bucket wants nothing more than to get hold of one of those tickets and witness the magic of the Wonka factory. Well, cheer up Charlie, because its about to happen.The trip in Wonka is more than just an invitation for unrivaled fun, however. It is a test. One of Wonka's rivals known as Slugworth, has promised a valuable sum to each of the children who steal from Wonka one of his newest inventions -- an Everlasting Gobstopper-- so that his company might steal the ingredients. Will all remain loyal to Slugworth? This is one of Gene Wilder's best performances, perfectly making the Wonka character his own. This was also the movie that introduced to the world the cautionary cult favorite midgets known as the Oompa Loompas, slaves who were rescued by Wonka to...well serve as his slaves. And, serving as a brief psychedelic inject into the events in the factory, make the lessons learned more obvious than they could have already been. Charlie Bucket's character, however, could not be written to be more pathetic, as though the filmmakers were absolutely sure that this was the kid you had the most sympathy for. From the mother working in the laundry hand-washing clothes, to the bare one room house and the enormous bed shared by all of the grandparents with counterpart names, to Charlie's constantly furrowed brow and curled lip. But, aside from this minor flaw, the movie has so many memorable things about it. I particularly like the Dr. Suess-esque setting. I can see why Tim Burton might be asked to be the next to recreate the story of Charlie and the Chocolate Factory, as the original looked like his style to begin with (like the foamy float machine or the bizarre sequence where Wonka appears to go momentarily mad). Nonetheless, may the legacy of the first live on for years to come. It is still one of the greatest family films ever made.",
    "4": "All the ideas that Rould Dahl puts into his book \"Charlie and the Chocolate Factory\" are here in an imaginative visual form appropriate to the time it was made. A lot of attention was paid to the sets and visual effects, clever special effects such as a trap door and miniturization testify to the care that the producers put into making this movie. The theme of the movie is difficult for adults. There are bad children in the world. They come from bad parents, they're not created by emulation, but rather the parents \"produce them\", much like chocolate is produced in a factory. The factory is populated by miniature people named oomphaloopas that remind the listener at intervals of Dahl's moral points: Too much TV is bad for children, books should be read instead, and children need to adhere to an ethical code of some sort in order to grow up strong. And who knew Gene Wilder had such a beautiful singing voice! The music is some of the best show music of it's time, including \"The Candy Man\".",
    "5": "A childhood favorite. I'll never forgive Johnny Depp and all involved in that war crime of a remake.This is the first time I've rewatched this movie in nearly a decade, maybe more (and even longer since I've read the book). I had completely forgotten about most of the scenes prior to Charlie finding the ticket. I'm sure as a kid, I probably found these scenes really boring, but now as an adult I have a whole new appreciation for them. So many clever and funny moments that went over my head as a child.Everything else that I do remember is just as good if not better, including the Pure Imagination scene, which (as a fat kid) is one of my favorite of all time.",
    "6": "The first time I saw this film was about 15 years ago when I was at school. This is about Charlie Bucket winning a ticket to go to Willy Wonka's chocolate factory with 4 other children. As a kid I found it frightening when Violet turned blue when she had that gum that wasn't meant to be chewed. I liked the songs in the film, I used to find the song Cheer Up Charlie boring but I like it better now I'm older. As much as I love Johnny Depp I thought this version was better than the 2005 remake. Roald Dahl may of disapproved of the film but I thought it was great. I think the all the cast members did a great performance. The one scene that I found boring was when Charlie and his Grandad stole fizzy lifting drink and was floating in the air.",
    "7": "Willy Wonka and the Chocolate Factory has got to be one of the people's most fantastic movies ever i think. I really enjoyed this movie and it was very good and magical. This movie was a movie that was made into one of Roald Dahl's books. I think Roald Dahl was a great author, he wrote some fantastic stories and those stories were made into films. I give this movie 10 out of 10 because i just think that it is fantastic and very enjoyable to watch.",
    "8": "I wasn't sure what to expect from this movie but I'm pretty sure it wasn't what I wound up viewing. I thought I would like the general feel of the thing but something about the movie felt off kilter. Willy Wonka (Gene Wilder) seemed mean spirited at times, and almost indifferent at others, giving me the impression that the picture over all wasn't that kid friendly. I mean, four out of the five Golden Ticket winners wound up transported to some never never land never to be heard from again, while Charlie (Peter Ostrum) had to take it on the chin with his grandfather (Jack Albertson) for swiping some of the fizzy lifting drinks. That he wound up inheriting the Chocolate Factory seemed almost like a consolation prize given the tenor of the story.I did like the idea of the Golden Ticket contest, and have to wonder why more companies didn't follow up on the idea after this movie came out. It seemed like it would drive a lot of business and create excitement about a company's products. There's no denying the sets are colorful and imaginative, yet they seemed strangely surreal and fake at the same time. When I think back to the creativity on display in a film like \"The Wizard of Oz\" made three decades earlier, it's like this film didn't put the era's technology and artistry to any kind of use to look more polished. The thing is, the movie held out a lot of promise with the opening scenes of chocolate candy being made on a variety of assembly lines pumping out bars and candy kisses. And the scene in the candy shop took me back to the good old days of my youth when penny candy was the rule. I kind of feel sorry for today's youth who can't ever experience the thrill and/or frustration of making such a fateful decision with just a few available pennies in the sweaty palm of their hand. If you could pick up four of five pieces of penny candy today for under a buck you'd probably be lucky.",
    "9": "What is so great about Willy Wonka & the Chocolate Factory is it seems like a nice kids film but really it's a Grimm's Fairy-tale. Gene Wilder is fantastic and quite the sadomasochist in the most delicious way. As far as I am concerned this is really an adults film and one of my favorites of all time.Wilder was born to play this role. Forget Johnny Depp's version it has nothing on this.",
    "10": "A reason that is often overlooked on the brilliance of \"Willy Wonka and the Chocolate Factory\" is the author of the original book. Roald Dahl not only creates wonderful characters, he has the ability to perfectly capture children's imagination. Aside from Dahl's writing, there are strong performances throughout the movie especially Gene Wilder as \"Willy Wonka\" who is perfect. Germany's Michael Bollner as \"Augustus Gloop\" should also be applauded for the delivery of his lines which for him were in a foreign language, although not entirely convincing.Even if this movie was butchered by the director, which it certainly wasn't, it would have been good. The moronic parents in this movie provide an accurate portrayal of how one eyed and disillusioned parents can be of their children. See it.",
    "11": "This entire movie is just so magical. Roald Dahl, the author of the book on which the film is based, is known the world over for being one of the most prolific children's book writers, but many don't realize that the books aren't just appealing to children. James and The Giant Peach, Danny the Champion of the World, The Witches, and Willy Wonka are all well written stories for the most part, and so movie adaptations feeding off their success started to predictably appear. Out of all of Dahl's books to be turned into movies, this one is without a doubt the most famous, and it's not hard to see why. The movie's plot is about the titular Willy Wonka who owns a mysterious chocolate factory that nobody can have access to. Soon, Wonka announces that there is a contest that involves people buying his chocolate bars and finding golden tickets hidden inside. The winner receives a tour of his strange factory, but since there are only 5 tickets in the entire world, it's way easier said than done. A modest boy named Charlie is the story's unlikely protagonist, he is humble enough to not let the temptation of finding a golden ticket control his life. He doesn't expect to find one, and his family is much more important to him than a bunch of candy. As time goes by, the golden tickets start getting discovered by lucky children from various locations around the world, but the kids who win are all spoiled and don't really deserve them. A gluttonous German kid named Augustus is the first winner, followed by Veruca Salt, Violet Beauregarde, and Mike Teevee. Finally, Charlie manages by pure luck to find a ticket after the original fifth winner is proved to be a fake. Out of all the children who win, Charlie is the only decent one that doesn't have a snarky, in-your-face attitude, and it makes the audience sympathize with him. The rest of the movie involves Charlie being taken on a tour (along with the other children) of Wonka's factory while he is chaperoned by his formerly bedridden grandfather. Wonka shows them all kinds of strange candy related things, from waterfalls made of melted chocolate to drinks that allow the consumer to float. There's a shocking false ending where Charlie, as the only remaining member of the tour after all the other kids have been eliminated, asks Wonka about the promised lifetime supply of chocolate, and Wonka tells him he's not getting any as he \"broke the rules\" by stealing the lifting drinks. Charlie's grandfather suggests to Charlie he should get even with Wonka by giving the recipes for some of his secret Candy to his adversary Slugworth, but Charlie returns the gobstopper to Wonka instead. As it turns out, this whole part was just a test of morals that only Charlie was decent enough to pass, and Wonka tells Charlie that his family now has legal ownership over his factory. The performances in this movie are all amazing, especially Wilder's, and he was without a doubt the best Willy Wonka ever. Also an interesting note about this movie, the part at the end where Wonka yells at Charlie for violating the rules is actually non-rehearsed, and Charlie didn't know Gene was going to yell at him. This allowed the filmmakers to get his real reaction.",
    "12": "The very best part of this movie is Gene Wilder's WIlly Wonka. He is absolutely crazy, unhinged and charming at the same time, which is how real psychopaths are. Now from what I remember from the Johnny Depp version, he portrayed the character as an awkward, bumbling genius kind of guy, that may be more like how movies portray psychopaths? So either way, it seems the consensus is that Willy Wonka is a psychopath.Other than that, the movie was a delight to watch filled with childlike wonder, sometimes scary, sometimes wild. A not-so-subtle implication of supporting slavery while criticizing capitalism but with no regard for the government. But I'm gonna take things here more at face value considering the nature of the film and the time it came out. The new Wonka trailer does seem to be more closer to this than the remake.",
    "13": "SPOILERS Roald Dahl is perhaps one of the most famous names in children's entertainment. Author of stories like 'The BFG', 'The Witches' and 'Matilda', Dahl's stories have given joy to children for a long time now. With so many of his stories being made into films, it's not difficult to see that Hollywood loves him too. In 1971, one of his finest stories was made into a musical starring Gene Wilder. Magnificantly 'odd', Wilder's Willy Wonka is a genuinely surreal performance. Twenty years on, and an inferior sequel later, and Wilder is still the way to go. The film might be dated, but with a Wonka like this, it's impossible not to fall in love with the film again.Charlie Bucket's (Peter Ostrum) family are incredibly poor. Living with his mum and four grandparents, Charlie dreams of better things. When the mysterious Willy Wonka (Wilder) announces that five lucky children will be allowed to tour his chocolate factory, Charlie has a dream. Receiving one chocolate bar on his birthday however, the odds are stacked against him. Still, this is a fairy tale, so you can imagine what's coming next.Filmed in Eastern Europe and with five children paid on the cheap, 'Willy Wonka and the Chocolate Factory' is full of legends on screen and off. Colourful and beautiful throughout, it possesses many amazing scenes.As far as children performers go, the three kids do an alright job. Ostrum and Julie Dawn Cole (playing the greedy Veruca Salt) in particular are singled out for praise as they jump, run, sing and perform for the camera at every possibility. Ultimately though, the children will always be overshadowed by Gene Wilder.Wilder takes insanity to a new level. One moment seeming totally normal, and the next randomly talking and singing to himself, Wilder's Wonka is a man on the edge. You watch him and you just know that he could win your heart whilst simultaneously scare you senseless. You certainly have to wonder what Grandpa Joe (Jack Albertson) is thinking when Wonka hugs Charlie towards the end. Ultimately though, however nuts Wilder is in this film, it is him who makes it watchable so many years later.Well, Wilder mostly, but let's be honest, another reason for always enjoying this film is the regular song and dance of the Oompa Loompas. 'vertically challenged' (or whatever the PC description is now) individuals painted orange with green hair could just look incredibly offensive and weird. Dress them in weird outfits and have them sing catchy tunes though and automatically they become figures of fun. Yes there are definite indications towards the slave trade, but for family films, the Oompa Loompas are people that children never forget.'Willy Wonka and the Chocolate Factory' is a film many of us grew up with and love. Beautiful and bright, it is always a joy to watch. Led by an amazing performance by Gene Wilder and the songs of the Oompa Loompas, the film has many treasured moments that you can't help but fall for. By modern standards, the film does look slightly dated, but with so many magic moments, this is easily forgivable. Pure family fun.",
    "14": "At first glance Wonka is exactly the opposite of the films I usually watch and enjoy (i.e. action and horror), a string-pulling and cheerful kiddie's film blessed with a fine sense of visual style (the factory and its various areas are quite spectacular, and whilst some of the special effects are a little dodgy they more than hold up to today's blockbusters). It's a bright and colourful musical that screams twee throughout and has somewhat been superseded in the public's imagination by Tim Burton's ill-advised rehash, CHARLIE AND THE CHOCOLATE FACTORY.However a little digging beneath the surface reveals a slightly disturbing and horrific yarn of infanticide, in which young children are led unsuspectingly to various terrifying fates (being squeezed, stretched, and \"juiced\" to name but three). It's a film in which subliminal images of millipedes crawling over people's faces and a chicken being beheaded are inserted into one darned scary boat-tunnel ride and the twinkly eyes of Gene Wilder may just be hiding a sinister madman behind them. As such this film can be enjoyed both as a family classic and as a subtle chilling horror story.",
    "15": "Fantastic musical performances from the delightfully creepy Oompa Loompas, and you can really feel the heartache of a British boy living in poverty.Amazing scenery and effects that don't feel too dated, even 50 years later. Not to mention an excellent musical score. A never-ending source of memes and iconic quotes.It's incredible how a movie this good was made with such a tight budget -- only three million dollars.Truly the best incarnation of the Chocolate Factory. The book is great but this is a rare case of the film adaptation being superior. However, the same cannot be said for the 2005 remake...",
    "16": "This version of the Roald Dahl classic has always weirded me out, and not in a good way. I don't like the way it looks - gangly and ugly - nor the liberties the screenwriters took with the book. I would borrow \"Charlie and the Chocolate Factory\" from my little grade school library, read it, and as soon as I got to the end of the last page go right back to the beginning and read it over again. It was imprinted on my wee young brain, and I simply cannot accept any deviation from it.Gene Wilder at least has fun with this, though he reminds me way too much of my loser ex-brother-in-law for comfort. The thing I remember most about this movie, as many others probably do as well, is the catchy anthem sung repeatedly by the Oompah Loompahs.Grade: C",
    "17": "Willy Wonka and the Chocolate Factory (1971)This is one of those classic movies we've ALL seen, and I mean ALL. This film, brilliantly brought to life by Roald Dahl's story, is a work of \"pure imagination\". It is wonderful for kids and maybe even more enjoyable for the adults.This movie is great for kids who have a huge imagination, and is a fantasy tale that can be enjoyed by anybody. Simply a classic. 10/10.",
    "18": "I first saw this film when I was 4, and I have been enamoured ever since! It was made the year before my parents were born, but it is timeless and pure genius. You feel so many emotions as this film progresses, and the magic will leave you feeling like a child again. The songs are contagious and funny too. Gene Wilder was the perfect actor to play Willy Wonka, and he does a truly beautiful job! What a classic film.",
    "19": "I have been watching this since it came out in 1971 and I still love it. Gene WIlder and Jack Albertson are awesome in this. This is a movie for all ages. I love the oompa loompas singing and dancing. My favorite parts of the movie are when Charlie gives back the everlasting gobstopper at the end and when they are on the boat and keep going faster and faster then come to a compete hault.",
    "20": "I've read the book and even the sequel, and I still loved Willy Wonka and the Chocolate Factory. Surprisingly, someone said that this movie was darker than Tim Burton's remake/reboot/re-imagining with Johnny Depp called Charlie and the Chocolate Factory, and maybe it is.There is a morality tale behind the demise of four of the children who find the golden ticket, and even Charlie came close to falling out of favor of Mr Wonka, but thankfully his honesty shone through.I understand Roald Dahl wasn't exactly happy with the way the movie adapted his fine novel, but millions love the movie, and no doubt led to massive sales of his novel again.I kind of chuckled when the \"fifth winner\" of the golden ticket was a casino magnate from Paraguay LOL! Can you imagine an alternative version of the movie, where he really did win and turns up at the factory?!",
    "21": "I wasn't sure what to expect from this movie but I'm pretty sure it wasn't what I wound up viewing. I thought I would like the general feel of the thing but something about the movie felt off kilter. Willy Wonka (Gene Wilder) seemed mean spirited at times, and almost indifferent at others, giving me the impression that the picture over all wasn't that kid friendly. I mean, four out of the five Golden Ticket winners wound up transported to some never never land never to be heard from again, while Charlie (Peter Ostrum) had to take it on the chin with his grandfather (Jack Albertson) for swiping some of the fizzy lifting drinks. That he wound up inheriting the Chocolate Factory seemed almost like a consolation prize given the tenor of the story.I did like the idea of the Golden Ticket contest, and have to wonder why more companies didn't follow up on the idea after this movie came out. It seemed like it would drive a lot of business and create excitement about a company's products. There's no denying the sets are colorful and imaginative, yet they seemed strangely surreal and fake at the same time. When I think back to the creativity on display in a film like \"The Wizard of Oz\" made three decades earlier, it's like this film didn't put the era's technology and artistry to any kind of use to look more polished. The thing is, the movie held out a lot of promise with the opening scenes of chocolate candy being made on a variety of assembly lines pumping out bars and candy kisses. And the scene in the candy shop took me back to the good old days of my youth when penny candy was the rule. I kind of feel sorry for today's youth who can't ever experience the thrill and/or frustration of making such a fateful decision with just a few available pennies in the sweaty palm of their hand. If you could pick up four of five pieces of penny candy today for under a buck you'd probably be lucky.",
    "22": "What is so great about Willy Wonka & the Chocolate Factory is it seems like a nice kids film but really it's a Grimm's Fairy-tale. Gene Wilder is fantastic and quite the sadomasochist in the most delicious way. As far as I am concerned this is really an adults film and one of my favorites of all time.Wilder was born to play this role. Forget Johnny Depp's version it has nothing on this.",
    "23": "A reason that is often overlooked on the brilliance of \"Willy Wonka and the Chocolate Factory\" is the author of the original book. Roald Dahl not only creates wonderful characters, he has the ability to perfectly capture children's imagination. Aside from Dahl's writing, there are strong performances throughout the movie especially Gene Wilder as \"Willy Wonka\" who is perfect. Germany's Michael Bollner as \"Augustus Gloop\" should also be applauded for the delivery of his lines which for him were in a foreign language, although not entirely convincing.Even if this movie was butchered by the director, which it certainly wasn't, it would have been good. The moronic parents in this movie provide an accurate portrayal of how one eyed and disillusioned parents can be of their children. See it.",
    "24": "This entire movie is just so magical. Roald Dahl, the author of the book on which the film is based, is known the world over for being one of the most prolific children's book writers, but many don't realize that the books aren't just appealing to children. James and The Giant Peach, Danny the Champion of the World, The Witches, and Willy Wonka are all well written stories for the most part, and so movie adaptations feeding off their success started to predictably appear. Out of all of Dahl's books to be turned into movies, this one is without a doubt the most famous, and it's not hard to see why. The movie's plot is about the titular Willy Wonka who owns a mysterious chocolate factory that nobody can have access to. Soon, Wonka announces that there is a contest that involves people buying his chocolate bars and finding golden tickets hidden inside. The winner receives a tour of his strange factory, but since there are only 5 tickets in the entire world, it's way easier said than done. A modest boy named Charlie is the story's unlikely protagonist, he is humble enough to not let the temptation of finding a golden ticket control his life. He doesn't expect to find one, and his family is much more important to him than a bunch of candy. As time goes by, the golden tickets start getting discovered by lucky children from various locations around the world, but the kids who win are all spoiled and don't really deserve them. A gluttonous German kid named Augustus is the first winner, followed by Veruca Salt, Violet Beauregarde, and Mike Teevee. Finally, Charlie manages by pure luck to find a ticket after the original fifth winner is proved to be a fake. Out of all the children who win, Charlie is the only decent one that doesn't have a snarky, in-your-face attitude, and it makes the audience sympathize with him. The rest of the movie involves Charlie being taken on a tour (along with the other children) of Wonka's factory while he is chaperoned by his formerly bedridden grandfather. Wonka shows them all kinds of strange candy related things, from waterfalls made of melted chocolate to drinks that allow the consumer to float. There's a shocking false ending where Charlie, as the only remaining member of the tour after all the other kids have been eliminated, asks Wonka about the promised lifetime supply of chocolate, and Wonka tells him he's not getting any as he \"broke the rules\" by stealing the lifting drinks. Charlie's grandfather suggests to Charlie he should get even with Wonka by giving the recipes for some of his secret Candy to his adversary Slugworth, but Charlie returns the gobstopper to Wonka instead. As it turns out, this whole part was just a test of morals that only Charlie was decent enough to pass, and Wonka tells Charlie that his family now has legal ownership over his factory. The performances in this movie are all amazing, especially Wilder's, and he was without a doubt the best Willy Wonka ever. Also an interesting note about this movie, the part at the end where Wonka yells at Charlie for violating the rules is actually non-rehearsed, and Charlie didn't know Gene was going to yell at him. This allowed the filmmakers to get his real reaction.",
    "25": "The very best part of this movie is Gene Wilder's WIlly Wonka. He is absolutely crazy, unhinged and charming at the same time, which is how real psychopaths are. Now from what I remember from the Johnny Depp version, he portrayed the character as an awkward, bumbling genius kind of guy, that may be more like how movies portray psychopaths? So either way, it seems the consensus is that Willy Wonka is a psychopath.Other than that, the movie was a delight to watch filled with childlike wonder, sometimes scary, sometimes wild. A not-so-subtle implication of supporting slavery while criticizing capitalism but with no regard for the government. But I'm gonna take things here more at face value considering the nature of the film and the time it came out. The new Wonka trailer does seem to be more closer to this than the remake.",
    "26": "SPOILERS Roald Dahl is perhaps one of the most famous names in children's entertainment. Author of stories like 'The BFG', 'The Witches' and 'Matilda', Dahl's stories have given joy to children for a long time now. With so many of his stories being made into films, it's not difficult to see that Hollywood loves him too. In 1971, one of his finest stories was made into a musical starring Gene Wilder. Magnificantly 'odd', Wilder's Willy Wonka is a genuinely surreal performance. Twenty years on, and an inferior sequel later, and Wilder is still the way to go. The film might be dated, but with a Wonka like this, it's impossible not to fall in love with the film again.Charlie Bucket's (Peter Ostrum) family are incredibly poor. Living with his mum and four grandparents, Charlie dreams of better things. When the mysterious Willy Wonka (Wilder) announces that five lucky children will be allowed to tour his chocolate factory, Charlie has a dream. Receiving one chocolate bar on his birthday however, the odds are stacked against him. Still, this is a fairy tale, so you can imagine what's coming next.Filmed in Eastern Europe and with five children paid on the cheap, 'Willy Wonka and the Chocolate Factory' is full of legends on screen and off. Colourful and beautiful throughout, it possesses many amazing scenes.As far as children performers go, the three kids do an alright job. Ostrum and Julie Dawn Cole (playing the greedy Veruca Salt) in particular are singled out for praise as they jump, run, sing and perform for the camera at every possibility. Ultimately though, the children will always be overshadowed by Gene Wilder.Wilder takes insanity to a new level. One moment seeming totally normal, and the next randomly talking and singing to himself, Wilder's Wonka is a man on the edge. You watch him and you just know that he could win your heart whilst simultaneously scare you senseless. You certainly have to wonder what Grandpa Joe (Jack Albertson) is thinking when Wonka hugs Charlie towards the end. Ultimately though, however nuts Wilder is in this film, it is him who makes it watchable so many years later.Well, Wilder mostly, but let's be honest, another reason for always enjoying this film is the regular song and dance of the Oompa Loompas. 'vertically challenged' (or whatever the PC description is now) individuals painted orange with green hair could just look incredibly offensive and weird. Dress them in weird outfits and have them sing catchy tunes though and automatically they become figures of fun. Yes there are definite indications towards the slave trade, but for family films, the Oompa Loompas are people that children never forget.'Willy Wonka and the Chocolate Factory' is a film many of us grew up with and love. Beautiful and bright, it is always a joy to watch. Led by an amazing performance by Gene Wilder and the songs of the Oompa Loompas, the film has many treasured moments that you can't help but fall for. By modern standards, the film does look slightly dated, but with so many magic moments, this is easily forgivable. Pure family fun.",
    "27": "At first glance Wonka is exactly the opposite of the films I usually watch and enjoy (i.e. action and horror), a string-pulling and cheerful kiddie's film blessed with a fine sense of visual style (the factory and its various areas are quite spectacular, and whilst some of the special effects are a little dodgy they more than hold up to today's blockbusters). It's a bright and colourful musical that screams twee throughout and has somewhat been superseded in the public's imagination by Tim Burton's ill-advised rehash, CHARLIE AND THE CHOCOLATE FACTORY.However a little digging beneath the surface reveals a slightly disturbing and horrific yarn of infanticide, in which young children are led unsuspectingly to various terrifying fates (being squeezed, stretched, and \"juiced\" to name but three). It's a film in which subliminal images of millipedes crawling over people's faces and a chicken being beheaded are inserted into one darned scary boat-tunnel ride and the twinkly eyes of Gene Wilder may just be hiding a sinister madman behind them. As such this film can be enjoyed both as a family classic and as a subtle chilling horror story.",
    "28": "Fantastic musical performances from the delightfully creepy Oompa Loompas, and you can really feel the heartache of a British boy living in poverty.Amazing scenery and effects that don't feel too dated, even 50 years later. Not to mention an excellent musical score. A never-ending source of memes and iconic quotes.It's incredible how a movie this good was made with such a tight budget -- only three million dollars.Truly the best incarnation of the Chocolate Factory. The book is great but this is a rare case of the film adaptation being superior. However, the same cannot be said for the 2005 remake...",
    "29": "This version of the Roald Dahl classic has always weirded me out, and not in a good way. I don't like the way it looks - gangly and ugly - nor the liberties the screenwriters took with the book. I would borrow \"Charlie and the Chocolate Factory\" from my little grade school library, read it, and as soon as I got to the end of the last page go right back to the beginning and read it over again. It was imprinted on my wee young brain, and I simply cannot accept any deviation from it.Gene Wilder at least has fun with this, though he reminds me way too much of my loser ex-brother-in-law for comfort. The thing I remember most about this movie, as many others probably do as well, is the catchy anthem sung repeatedly by the Oompah Loompahs.Grade: C",
    "30": "Willy Wonka and the Chocolate Factory (1971)This is one of those classic movies we've ALL seen, and I mean ALL. This film, brilliantly brought to life by Roald Dahl's story, is a work of \"pure imagination\". It is wonderful for kids and maybe even more enjoyable for the adults.This movie is great for kids who have a huge imagination, and is a fantasy tale that can be enjoyed by anybody. Simply a classic. 10/10.",
    "31": "I first saw this film when I was 4, and I have been enamoured ever since! It was made the year before my parents were born, but it is timeless and pure genius. You feel so many emotions as this film progresses, and the magic will leave you feeling like a child again. The songs are contagious and funny too. Gene Wilder was the perfect actor to play Willy Wonka, and he does a truly beautiful job! What a classic film.",
    "32": "I have been watching this since it came out in 1971 and I still love it. Gene WIlder and Jack Albertson are awesome in this. This is a movie for all ages. I love the oompa loompas singing and dancing. My favorite parts of the movie are when Charlie gives back the everlasting gobstopper at the end and when they are on the boat and keep going faster and faster then come to a compete hault.",
    "33": "I've read the book and even the sequel, and I still loved Willy Wonka and the Chocolate Factory. Surprisingly, someone said that this movie was darker than Tim Burton's remake/reboot/re-imagining with Johnny Depp called Charlie and the Chocolate Factory, and maybe it is.There is a morality tale behind the demise of four of the children who find the golden ticket, and even Charlie came close to falling out of favor of Mr Wonka, but thankfully his honesty shone through.I understand Roald Dahl wasn't exactly happy with the way the movie adapted his fine novel, but millions love the movie, and no doubt led to massive sales of his novel again.I kind of chuckled when the \"fifth winner\" of the golden ticket was a casino magnate from Paraguay LOL! Can you imagine an alternative version of the movie, where he really did win and turns up at the factory?!",
    "34": "\"Willy Wonka & the Chocolate Factory\" is a beloved children's classic movie with lots of nods to adult viewers, throughout. It certainly earns the eight stars I gave it, thanks in great part to the endearing musical score, composed by Anthony Newley and Leslie Bricusse. However, if we are going to be honest, and I think we should be, we need to see what's actually happening in this screenplay.My first assertion is that there is only one redeeming character in this film: Charlie Bucket, as played by young towhead, Peter Ostrum. Literally every other character with a speaking part does something that proves they are selfish, thoughtless, manipulative (or manipulatable, which might be worse), greedy or just plain rotten. You wouldn't want to be around ANY of these people for any length of time. Seriously. That's extremely rare for a film that people generally like!A quick aside. Some might argue that the Oompa-Loompas should be considered \"redeeming characters.\" The reason why they are not is because they are, essentially, a \"Greek Chorus.\" They are commenting on the actions of the characters, mostly without ever interacting with them at all.But the more crucial thing to note about this film is that the main antagonist, the \"bad guy\" of the movie is Willy Wonka, himself! I've seen commentary that has suggested the other four Golden Ticket winners, or their parents or the obvious target, Jack Albertson's Grandpa Joe deserve to share the infamy. I get it, and Grandpa Joe is, in nearly every way, the most despicable parental figure in the film for many reasons (like, laying in bed for twenty years, then suddenly being capable of a song and dance production number to the tune, \"I've Got a Golden Ticket\" -- No, Joe, YOU don't have anything! That's Charlie's ticket!) so, let me briefly explain why this dishonor belongs completely to Willy Wonka.First, Wonka has placed five Golden Tickets into his standard candy bars, offering the winners a tour of his factory and a lifetime supply of chocolate. Therefore, he is making all of this happen (at an incredible profit). Second, he is a saboteur. He hired a guy to pretend to be his rival, asking the winners to steal an Everlasting Gobstopper! Third, he pretends to be disabled, just for a sight gag. Fourth, he gets everyone inside of his factory and THEN shows them an enormous contract they must sign to continue. Additionally, much of the fine print is illegible. That leads to fifth, disqualifying each winner from receiving the prize, for breaking Wonka's unreadable rules.Along the way, Wonka tempts the winners with things he knows they find irresistible (a piece of gum for Violet, a chance to be on television for Mike, etc.), never fully disclosing his intentions or goals. He used the ticket winners' interests to make them Guinea Pigs for his beta test level products, then punishes them when it all goes wrong. And he has a demonic boat!Finally, the most atrocious element is why Wonka did all of this: he was looking for a protégé, a person whom he could train to do everything HIS way, so he could retire, knowing his replacement would robotically follow his instructions. Also Wonka was clearly not more than forty years old, and was doing a job he presumably loved. Why would or should he retire?BUT, the reason why we forgive EVERYTHING can be summed up in two words: Gene Wilder.Mr. Wilder's portrayal of the title character not only makes Wonka palatable, it makes all of his bad deeds so obscure, he's charming and loveable! That is an amazing testament to the actor and his genuine goodness and talent. Without Wilder, this movie would likely have been forgotten and certainly never would have had a real candy company founded, a film reboot, a Broadway musical and a prequel!All hail Willy Wonka. All hail the amazing Gene Wilder.",
    "35": "A movie that has shaped my life, teaching me as a young child that things are not always what they seem. A film with a great message amd a happy ending, I love happy ending. This movie has the best closing line in any film I've ever seen and it always resonates with me every time I watch it. Great music, fun adventure, Gene Wilder is the man.",
    "36": "I like the bit where he was falling over but then did a somersault",
    "37": "'Willy Wonka and the Chocolate Factory', about to be remade, seems ripe for reappraisal. Two schools of thought - one thinks this film is inventive, timeless, and worthy of a place in the best kids movies of all time; the other thinks it is embarrassing trash which didn't work and which should be ditched for a much better interpretation.For me, it falls somewhere between the two extremes of good and bad. There's no denying that Gene Wilder's performance is irritating, but isn't that what Willy Wonka was? The horrible kids are just that, and completely deserve their fates within the walls of his gloopy sugary factory. And Charlie is a cute little hero.Anthony Newley's songs may be an acquired taste but I bet you go away from this film humming 'The Candy Man' or the Oompa Loompa song. The story is a good one - a toffee treat with a lot of bite. Will the remake be any better? I doubt it.",
    "38": "After several years of thinking that the remake was superior I watching this original version again recently.I was amazed at how well it holds up, all these years later. While not truly faithful to the original source text this film is full of charm, heart and features some fun songs.At the centre of its success though is the fab performance given by Gene Wilder. He shows Johnny Depp how Wonka should be played, with just enough oddness and darkness to counter the 'candy man' persona.All five of the children give great performances and ultimately it is the combination of all these things that for me mean that this is the version I will remember.",
    "39": "I say YES! This movie changed my life as a kid. Magic. Amazement. Wonder. Creativity. It told me you can be a man and be fun, serious, creative, silly, witty, magical. Gene Wilder portrays all the masculine archetypes of warrior, lover, magician and king in this role perfectly. Perfect casting. Peter Ostrum would become a veterinarian and his only role but he was brilliant. If you are a fan of The Andy Griffith Show you will note a song in the movie which is a theme used on the show. It is a beautiful musical passage used when Andy and Opie connected after some misunderstanding written by Earle Hagen. This can be heard when Charlie and Grandpa almost get booted from the factory in Willy's office. Very emotional scene. It is almost a note for note comparison and easily missed if you're a fan of TAGS.",
    "40": "Willy Wonka and the Chocolate Factory is a magical movie that still manages to delight and enchant viewers decades after it was made. This film is full of fun visuals, clever jokes, and memorable musical moments. Gene Wilder plays the titular candy man in a way where you are kind of scared of him, but you also really like him. I also want to give some praise to Peter Ostrum, who gives Charlie Bucket such genuine innocence. Yes, there are some slower moments (I'm looking at you, \"Cheer Up, Charlie.\"), but Willy Wonka and the Chocolate Factory is a sweet film the whole family can watch together.",
    "41": "I saw this at ten when it first came out and enjoyed it. I have squeezed some nostalgia value out of it since. Gene Wilder is wonderful as Willy Wonka (if perhaps too young to have had all the life experiences discussed early on in the film). Still, to kids, everyone who is not a kid is old.The problem with the movie is the cutting of corners. The movie was originally sponsored by a food company who meant to make a mint marketing various Wonka bars, but that never got off the ground. In other words, it was a big commercial for a product that never came off (though some Wonka products do exist to this day).The story of the movie is a tale of producer David Wolper cutting costs however he can to streamline a budget. Two big stars of the period, Sammy David Jr. and Anthony Newly (who co-wrote the songs) showed interest in playing the candy man at the beginning, and being able to sing \"The Candy Man.\" Both were nixed. Wolper suggested having a big star might interfere with the fantasy--but it also meant paying a star's salary. He might have gotten either for a cut rate, but foolishly rejected them, perhaps damaging the box office and certainly ruining the song, which became a big hit for Sammy Davis, Jr. anyway.Then, according to the book PURE IMAGINATION, some wanted the \"Golden Ticket\" song turned into a huge production number (see \"Consider Yourself\" in OLIVER or \"Every Sperm is Sacred\" in THE MEANING OF LIFE). It's a good song that seems to call for a big production number. But Wolper, no doubt with an eye on expenses, decided it would work better in a more intimate (and more boring) setting.My final criticism is Roald Dahl's fault. His original CHARLIE AND THE CHOCOLATE FACTORY had the oompa-loompas singing terribly moralistic songs that go on even longer than the truncated versions in the films! After they enter the chocolate factory, apart from one song from Veruca Salt, all they have are the repetition of the oompa-loompa's moralistic ditties against gum, television, etc. What a bunch of (if you pardon the term) blue-nosed bores.The film desperately needs an \"eleven o'clocker.\" These are songs near the end of shows (usually half an hour before Broadway shows used to let out at 11:30, and the audience may be tired) that are either comic (\"Sit Down, You're Rocking the Boat\" from GUYS AND DOLLS; stirring (\"Oklahoma\" from OKLAHOMA!; or perhaps martial, with a neat military cadence. Instead, \"Willy Wonka and the Chocolate Factory\" just sort of trickles out to the end, in the Great Glass Elevator.Some scenes do work, but even they have flaws. The \"Chocolate Room\" takes the breath away on an initial viewing (esp. in the theaters) and the song \"Pure Imagination\" is arguably the best in the show. But then one wonders--why didn't they decorate the posts holding up the roofs, perhaps to look like candy canes? Was that more cost-cutting? And the chocolate river never looked anything to me but repulsive, even when I was ten and willing to believe.Some of the effects look cheesy in the twenty-first century. Overall, this is a better version than the twisted vision of Tim Burton that came out later, with the androgenous Willy Wonka and the unnecessary backstory that Dahl, for all his faults, never included. In fact, his Wonka is a jolly little chap rather than bizarre as in Burton's tale, or perhaps bipolar in this version.Gene Wilder is mostly restrained for a pretty good performance to follow up his brilliant breakthrough in Mel Brooks' \"The Producers.\" The kids are mostly surprisingly good actors, especially the bickering girls. Three good songs (including \"Pure Imagination\" and the all but ruined \"Candy Man\"). The boy playing Charlie is good but his hair is right out of the 1970s and it clashes with the timeless, nameless, old-world village where he lives.Also, keep an eye out for David Battley as the annoyingly hilarious Mr. Turkentine. Tim Brooke-Taylor from \"The Goodies\" has an amusing bit as a computer operation. And some welcome dark-comedic vignettes during the hunt for the golden ticket should please adults who are trying to persuade their kids a half-century-old movie with shoddy effects is worth the waste of a dull afternoon.",
    "42": "Gene Wilder, Jack Albertson and Peter Ostrum star in this 1971 musical fantasy based on Roald Dahl's book, \"Charlie & the Chocolate Factory.\" Charlie (Ostrum) is a boy who lives with his mother and 2 grandparents. They don't have much and soon notice a contest to meet famous candy man, Willy Wonka (Wilder) and visit his factory. After 4 other bratty kids find Wonka's 4 of the 5 winning golden tickets, Charlie hopes to be the 5th winner and does. He decides to bring his grandpa Joe (Albertson) along with him and they all meet Wonka who gives them a tour of his magical factory where odd things happen. I've liked this film since I was a kid and Wilder is great in it. I recommend this family film classic.",
    "43": "The late great Gene Wilder as the titular character but it is Peter Ostrum in his first and only movie role as Charlie that is so broke and poor that buying a chocolate bar is a treat in itself.But when he buys the last of the five Golden Tickets and how that the last ticket was a fraud somewhere but now he and four obnoxious children there. Gum loving Violet, bratty Veruca, TV loving Mike, and German Augustus as whoever survives at the end wins it all.But that there are mishaps along the way. Question is will Charlie lose his chance there and to get away from his broken home situation there?!",
    "44": "A classic thay still holds up today. This film is based on a classic children's book. I was shocked to learn it is also a musical. The film comes off so strong that you can not even place it into the categorie of being a musical because of how serious it comes off at times.",
    "45": "There's a message behind the darkness of Willy Wonka's wacky chocolate factory here, and that is if you are a glutton, a gum chewer with a massive ego, a spoiled brat or a television addict, you will not inherit the Kingdom of Willy. This is one of those strange stories that is probably not for infant children, maybe best for 10 years and up, and probably better for mature adults who can look back at this years after first seeing it to determine what Ronald Dahl was trying to say in his story of gooey goodness. There's no gooey feeling about the story. This is purely adult fare with visual treats for the kids, and a few scary moments as well. Willy Wonka in a sense appears to be a metaphor for some spiritual being utilizing a rather materialistic method in order to find out who will be the grand prize winner for his kingdom. In a sense, he's a bit like God, as some literary critics and movie historians have determined Frankenstein's monster and Edward Scissorhands to be a metaphor for Jesus.Peter Ostrum is Charlie Bucket, one of five lucky recipients of the golden ticket, and he is indeed a sweet, unselfish child. The four other winners range from horrid (Veruca Salt) to grossly obese (Augustus Gloop) to obnoxious (Mike Teevee) to somewhat of a braggart (the more likable Violet Beauregarde) and their parents are just as horrid. Charlie takes along his beloved grandpa Joe (a wonderful Jack Albertson) who was bedridden along with his wife and Charlie's other two grandparents (think of \"Bob and Carol and Ted and Alice\" meet \"Cocoon\" and Maude, as in \"Harold and...\"). The visual of the four elderly in-laws in the same bed is probably enough of a nightmare in itself let alone what Willy Wonka (Gene Wilder) has in store for them.The Wonka factory is a fun house in itself, with coat and hat racks that literally can grip what is being placed on it, an \"Alice in Wonderland\" like tiny door that opens to a world of pure imagination, a beautiful steamboat run by orange faced little people that goes into the tunnel of hell, a goose that lays golden chocolate eggs, a piece of gum that turns little girls into giant blueberries, a room filled of gas filled liquid that threatens to carve its drinkers into sliced cold cuts, and a television like machine that shrinks big things into little things, like bratty children. Of course, Wonka's garden is the most beautiful of these segments, and in each one, sin is dealt with as each nasty child prepares to get their come-uppance.Some critics may call Charlie too perfect to be real, but there are indeed children out there with his sweetness and love, and that is what Willy Wonka's God-like character is searching for. Each child is given the test because of a villain named Slugworth, and it is easy to see who will pass, who will fail. The Oompah Loompas are a \"Harry Potter\" like version of Oz's Munchkins, and after each child fails their test, these wisened little men sing the moral of what that child needed to learn. The music and lyrics of Leslie Bricusse features one of the top movie themes of all time, \"The Candy Man\" (made into a hit single by Sammy Davis Jr.; sung by a candy store clerk here), and \"Pure Imagination\" is equally as memorable.This takes on what some of the Disney musicals lack, and that is an appealing lesson for adults to pass on to their children. As Willy Wonka says, it is possible that some of these children will come out a bit better than they were before, although you can lay odds on the nasty Veruca Salt turning into a British version of either Leona Helmsley or Monica Lewinsky in her selfish quest for \"I Want It Now!\".",
    "46": "Gene Wilder creates one of the most memorable screen performances in a family film with his mercurial Willy Wonka, a mysterious chocolate factory owner who sprinkles his candy bars with five golden tickets that give the finder access to explore his factory for the day. Once there, the participants are put through a series of strange personality tests for reasons that become clear at the end.Willy Wonka & the Chocolate Factory is a colorful and, at times, mouth-watering adventure for the whole family with just enough macabre humor and danger to keep the stakes high. The musical numbers are a mostly interesting lot with the show stopping (for all the wrong reasons) \"Cheer Up, Charlie\" being the only one that could stand to be omitted.",
    "47": "Everyone knows this movie, what with the endless supply of candy. It's hard to believe that Dr. Fronk-en-steen played Willy Wonka, or that \"The Man\" from \"Chico and the Man\" played the grandfather. I've read Roald Dahl's book, which didn't have a bunch of songs (except those from the Oompa Loompas).I will be eager to see what Tim Burton and Johnny Depp do with the remake, as they are both people whom I trust. Granted, Gene Wilder has always been good (especially when co-starring with Richard Pryor), but this version of \"Willy Wonka & the Chocolate Factory\" was pretty hokey. Still, the scene where the girl turns into a blueberry was kinda neat.",
    "48": "Charlie and the Chocolate Factory was one of my favorite books growing up, but surprisingly, I waited until last night to watch this film adaptation. It's unfortunate that what precipitated this was the passing of its star, Gene Wilder, but it was certainly worth the time and money. He exudes charisma and charm seasoned with humor in every scene that he appears. The songs were wonderful, and I found myself tearing up during 'Pure Imagination,' which becomes a sort of leitmotif for the film as a whole. Aside from Wilder, the performances from the rest of the cast were generally good, especially the children who felt like they leapt off the pages of the book. The visuals are bright, colorful and optimistic, occasionally trippy and surreal, befitting the source material. It was such a pleasure to take in. Although this was a spur-of-the-moment rental, this is one that will definitely find its way into my personal collection. WILLY WONKA AND THE CHOCOLATE FACTORY is a bonafide classic that I will be returning to again and again.",
    "49": "For some strang reason, many people like this movie and call it \"delightful family fun\"... Which part is your favorite, the part where they chop a chicken's head off, or the parts where the children are killed in various ways like you might see in \"Nightmare on Elm Street\"?  Let us not forget the impish Oompa-loompas, who are forced into slave labor by the totally creepy Willy Wonka, who also makes everyone sign away their souls in a deal-with-the-devil contract at the beginning of the movie.  Someone else compared this movie to \"Seven\", which is exactly what I was thinking when I watched this movie the other day.  A bunch of bad kids are killed by their \"sins\".  If this is the kind of movie you consider to be \"fun\" for kids, you might as well make it a double feature with \"A Clockwork Orange\".",
    "50": "Well, I'm clearly out of kilter with the public mood on this one.I thought WWATCC was the most boring kids' movie I've ever seen. It was slow, patronising and contrived from the outset. Unfortunately; if you'd read the book, you knew pretty well what was coming next. And the trouble then was that the sets and props never lived up to the imagination.Tempo inside the choc-works didn't improve. The 'Oompa Loompa' song just about saw me dozing off. As to Gene Wilder's Wonka; I couldn't mesh with him at all, not even as a fantasy character. His mood-swings were actually a wee bit scary. And when he was being meaningfully nice, it really made me rather cringe. Much too sweet for my tastes. The sets were as colourful as a kids' fantasy movie could be, but they never stopped looking cheap and stagy. The dialogue was trite, the surprises unsurprising. Frankly; I think 5 stars is a generous award.The ancient 'Wizard Of Oz' could kick this into a sweet-vat with a glass slipper. It is superior by any evaluation. At first, I thought this was because I'm not a Wilder fan, but there's been a recent remake employing Johnny Depp in the Willy Wonka role. Sadly, that one didn't do anything for me either.I dunno; everyone seems to love it but me. I'm an outcast and a pariah. But I won't apologise for thinking it's crap.Peter Cooke & Dudley Moore should have starred in it. Then again; maybe not.Can't Recommend A Purchase.",
    "51": "This is a fantastic and witty film, a genuine treat for all ages. It's been said that the movie never feels quite happy with itself and is occasionally a touch too dark, but that's partly the point-there's some serious messages and themes about greed and family here amongst the candy bars, Oompa-Loompa singalongs and weird gadgets. Gene Wilder is great as Willy Wonka-this is a vastly entertaining and interesting family flick. Great fun.",
    "52": "This is one of my favourite childhood films. It just holds so many memories for me. This is the perfect children's film with music and comedy and, of course, candy.The movie is nothing like the book. It only uses the names and the idea, but it is great as a stand alone film. The songs are catchy and memorable, and Gene Wilder's performance as Wonka is genius. It's a really enjoyable family comedy and there's not a doubt in my mind that it will hold up for many years to come. Another good thing about it is that there's comedy for children and for adults. Everybody can find enjoyment from this movie. The sets are great for a 1970's film, and it really lets you believe that such a place could exist. Really, if you haven't seen this movie yet, go out and rent/buy it. You won't be disappointed.8/10",
    "53": "This movie is excellent. I have it on VHS. It is definitely deserving of 10 out of 10 stars. Everything about it is great.My favorite part is the scene when they are in The Chocolate Room. Charlie and The Chocolate Factory is way better, but this is great too. I like it that Charlie wins the Grand Prize, because he deserves it every bit. He is such a nice and good little boy and I like that.I hope they make a movie of The Great Glass Elevator Story. That is a good story too. Two Thumbs Way Up! Kudos to the cast, crew and filmmakers. Everything about it is great: acting, costumes, directing, script, photography and production.",
    "54": "I enjoyed this movie as a child, but looking back on it today it is almost a step or two away from being a horror movie.  The strange red-faced people, children meeting with unfortunate accidents, and that boat scene...whoa!  In the end though this was a pretty good movie for kids even if it didn't really teach them very good lessons.  I mean come on; three of the kids weren't exactly that bad...only the spoiled brat deserved some punishment. In this movie though it is apparently evil to want to be a TV star, a fat kid, and someone who chews gum.  The story is about a contest to get into the chocolate factory and of course the kids above win a chance, and so does the poor kid Charlie.  Though considering how many kids have accidents in the factory they would have been better off in a knife warehouse.  The red-faced dudes are a bit annoying, but Gene Wilder turns in an excellent performance...but what the heck is up with that scene on the boat?  All in all a good movie for children...one question though, how much stuff in that one room full of candy was actually edible?",
    "55": "Pretty much the definitive movie you could watch as a child, and remember fondly as an adult. Roald Dahl's classic book and adaptation is pure gold from beginning to end.Charlie Bucket is a poor kid, who soon competes with every other child in the world to obtain one of five golden tickets into the famous chocolate factory run by the apparently eccentric, but public recluse Willy Wonka. By miraculous odds Charlie gets a ticket, along with four other children who finally enter the factory. From there on, the movie takes on the presence of a proverbial slasher movie, as each child is disposed of through their own greedy faults. Incorporate one of the weirdest tunnels scenes ever committed to film and in all seriousness, it's actually one of the most charming movies ever made.Gene Wilder is the definitive Willy Wonka. Obviously he's still a few years away from Mel Brooks's comedy goldmine, but no one can do what he does in this movie and sell a performance like he can. \"Pure Imagination\" is one of the all time greatest songs from this musical, and the Oompa Loompa's are parodied to death nowadays because they're so darn good.Out of all his stories, this remains my favourite of Roald Dahl's work. Though it may shy away a little from it's source material, this movie blends fantasy, adventure and dark humour perfectly. The factory is so incredibly detailed, and I heard that the chocolate river was two feet deep and became stagnant almost immediately (Poor Augustus).Final Verdict: Another children's timeless classic. 10/10.",
    "56": "I was a child when this film was made and I know it's considered a classic. And there's no denying that the sets and the props are outstanding. They truly created a dream world, a child's image of what a chocolate factory would be like. And there are important lessons about how to behave. But the unrelenting meanness of this film was too much. With the exception of the hero, the children are overly obnoxious. What are the odds that of all the winners of the contest, all but one would be among the worst a parent could raise? Julie Dawn Cole is absolutely brilliant in her role as an obnoxious debutante and the other actors do well. Also, the musical numbers are well-written and performed. But it seems as if the naughty are being set up to do bad things so that Wonka can have an excuse to see them suffer. Willie Wonka at times seems to lure the children into misbehaving so he can enjoy watching them get punished. The unrelenting nastiness permeates the entire movie and as a result, I never enjoyed it as much as I wanted to.",
    "57": "This is a delight for all ages. Gene Wilder will always be the definitive Willie Wonka (sorry Johnny Depp--not even in the game). This is the moralistic tale that tells us that the selfish undisciplined child will eventually pay a price for his or her transgressions and the good will win out. But like all of Roald Dahl's books, it has a hard edge filled with many surprises. Wilder plays the quirky Wonka as he moralizes and cruelly punishes the little brats for their negative attributes. Even Charlie begins to wonder if what has been promised him has so many conditions that it may not be worth the effort. While the special effects may seem a bit dated, they work well and the factory is a wonder. And then there are those Oompa Loompas, providing employment for the most little person actors since \"The Wizard of Oz.\" I've watched this so many times and I never tire of it.",
    "58": "I wasn't a fan of Willy Wonka and the chocolate factory. Don't ask me what problems i had with it. I just thought that the original film was terrible. I read the book Charlie and the chocolate factory because after seeing the good Tim Burton version I had to. I think Willy Wonka and the chocolate factory is really overrated. I preferred Gene Wilder's Willy Wonka because he didn't look like a drag queen. I think that the story for it is unique and interesting and fun. But the film version falls flat. I hated the Oompa loompas because they were disturbing. well, so were the new ones. The Roald Dahl book was great, but the film isn't Dahl, it's dull. I know most people will disagree with me, but it's a terrible film. Not the worst, but pretty bad.",
    "59": "A lot of people put this film in the back of their minds and label it as a kid's movie. First of all, it's very entertaining for all ages and it has some parts which are really scary for kids like when Wonka takes his guests through a tunnel full of nightmarish images such as a chicken getting its head cut off which was actually edited out for television.Wonka is fascinating, funny and often terrifying. The look in his eyes is demented and when he screams, all hell seems to spew forth. Wonka doesn't care about what happens to the kids that get knocked off. He didn't give any warning to that boy not to drink out of the chocolate lake, but starts yelling and running at him once he starts slurping it. In all the excitement, the boy is pushed into the lake and gets sucked up a tube while the mother cries \"he'll be grounded into marshmallow.\" Wonka's response is \"That pipe doesn't lead to the marshmallow room. It leads to the fudge room.\" After the girl turns into a blueberry, he casually says \"we'll have to squeeze the juice out of her before she explodes.\" Meanwhile the father is standing right beside him looking on horrified. When one of the brats does something they're not supposed to do, Wonka gives less of a warning, each time. The last time is nothing more than a softly spoken \"No, wait. Come back.\" After the kids meet their fate, we never see them again, which is the equivalent of what? Death. At the end, Wonka says they'll all be returned back to their \"normal rotten selves\", but I don't trust that smirk. Besides, how are we to believe him if we don't see the kids ever again? He's a child killer who uses candy as bait. Sure the kids deserved it, but the idea is still twisted.Take a slasher movie like Halloween for example, where all the main characters are killed, except for one who is innocent compared with the rest. Here, it's kids instead of young adults and they all get disposed in some way or another until only Charlie is left to confront the demon Willy Wonka. What I'm saying is that Willy Wonka and the Chocolate Factory is a horror movie in disguise as a children's movie. Ingenious!",
    "60": "Tim Burton's recent version of the classic Roald Dahl story may have been more faithful to its source material, but this 1971 musical adaptation of the much loved children's classic, directed by Mel Stuart, is still well worth watching as it manages to accurately capture the feel of the book and is a whole heap of fun.Gene Wilder plays eccentric sweet-maker Willy Wonka, who allows five children to tour his amazing factory after they find lucky golden tickets hidden in winning bars of Wonka chocolate. Of the five, only Charlie Bucket is truly deserving of such an honour and, as the tour progresses, the other children suffer from a series of bizarre mishaps.This movie is a colourful, candy coated treat with a deliciously dark comical centre. Wilder is excellent as the slightly sinister recluse who welcomes the (mostly) obnoxious children and their equally awful parents into his world. His factory is a brilliantly realised surreal wonderland and is a feast for the eyes (as well as the stomach!). The music, for the most part, is pretty memorable with standout tunes being 'I've got a golden ticket' and the Oompa Loompa songs.The wonderfully bizarre characters are all perfectly realised by the talented cast, from poor little Charlie (Peter Ostrum) to the spoilt kids (in particular, the brilliantly brattish Julie Dawn Cole as Veruca Salt) and their parents (including the great Roy Kinnear).My only gripe with the movie is when it strays too far from the original story. I'd have loved to have seen the squirrel room from the book, rather than the geese, but I guess that this was probably too hard to translate to the screen in 1971 (however, this scene does appear in the recent Burton movie). I also disliked the introduction of Slugworth and the whole everlasting gob-stopper 'test'. In the book, I always thought that the children were being tested as soon as they entered the factory, and that when they broke the rules, they had failed that test. In the book, Charlie abides by the rules and becomes the deserving winner, but in this telling, Grandpa Joe and Charlie also break Wonka's rules by stealing the lemonade. Why were they spared the kind of nasty fate suffered by the other rule-breakers? Had Wonka already made his mind up to choose Charlie at the start?If you haven't read the book (or as not as much of a purist as I am when it comes to adaptations), you will adore this film. Although not perfect, I think it is a very good movie which will appeal to adults and children alike.",
    "61": "Yes. Indeed. Speaking about the likes of greed, gluttony, and the absolute grotesque - You can be sure, it's all here - Wrapped up into one deceitful, under-handed, little package that has Willy Wonka's chocolatey mess smeared all over it.Without question - (From my perspective) - This 1971 children's picture has got to be one of the ugliest, most cringe-worthy movie-experiences that I've had to endure in a mighty long time.Its stupid-minded story is utterly childish nastiness to the max. And the totally repulsive \"Willy Wonka\" character (played so spitefully by Gene Wilder) is even more despicable than the obnoxious, little brats who all win a visit to Wonka's chocolate factory and inevitably get their (rightful?) comeuppance.",
    "62": "This is a pretty insulting title for a review, I know. But I don't like fantasy as a rule, and Roald Dahl's imagination tends to creep me out severely, so there was no point in my seeing this film at any point over the past 40+ years, even though I was the target age when it first came out in theaters. But, it finally came up free on streaming and I figured what the heck, I could always turn it off.I haven't read the book or seen the Johnny Depp re-make (there's another guy who creeps me out severely), but I do like Gene Wilder, he turned in a good performance here, and he was reason enough for me to finish the whole thing. I kept forgetting it was a musical just a handful of mostly lame, forgettable, awkwardly-inserted songs. To show you how little I knew about this film going in, I was actually surprised to find that the song \"The Candyman\" originated here. (Back to severely creepy for a moment: whoa, that Candyman guy needs to be closely watched by local law enforcement; he just oozed 'predator'!) The four grandparents in the same bed together all those years was disturbing thanks, Mr. Dahl, for yet another grotesque image. I can only imagine what some small children might think of the chubby kid getting stuck in the chocolate pipe, the \"funhouse\" boat ride, etc., not to mention the scary-looking Oompa Loompas heck, I'm twice their size and I wouldn't mess with 'em! Of course, any tour that starts with the signing of a waiver immediately indicates how dangerous this tour is going to be, so viewers (not to mention the characters) have been fairly warned. Who even *thought* about waivers in 1971? Almost nobody, right? And was I the only one wondering why minor children were allowed to sign this supposedly legal contract instead of their guardians?(Okay, I'm over-thinking this part, but still that looked ridiculous.) To those who complain that it didn't follow the book: as I said, I haven't read it, so I can't agree or disagree. But I would point out that the \"Wizard of Oz\" movie wasn't especially faithful to the book either. (Thank goodness I couldn't stand the book!) Watchable. Not lousy, not good, but watchable(particularly for Gene Wilder fans).",
    "63": "The movie was far better during the first hour when we see a very good boy, his poor widowed mother, both of whom are taking care of bedridden grandparents. They're caught up in this business of finding the golden ticket to the chocolate factory.As far as I'm concerned, the picture deteriorates with the boy finding one of the 5 tickets and his visit to the chocolate factory with grandfather Jack Albertson and some of the most obnoxious other children who get what they deserve at the visit.The tunes are delightful and was that really Jack Albertson singing? The film goes to show you that kindness is ultimately rewarded and selfishness does not go unpunished.The ending in itself proves that chocolate factory owner was sly, but a real child himself at heart.",
    "64": "The world goes on chocolate overdrive when it's announced that famed candy maker, Willy Wonka, has put five golden tickets in his Wonka Bars. The lucky recipients of these tickets will be treated to a day out in the top secret Wonka factory, where they can see how the sweets are made, and if they are even luckier, they will get a lifetimes supply of free chocolate. Nobody wants a golden ticket more than Charlie Bucket, from a desperately poor family, Charlie has learned to accept his heritage with a grace and credibility not befitting most other children. So when a miracle upon miracles happens, and Charlie finds a golden ticket, it just may prove to be a turning point far beyond his wildest dreams.They say that true love lasts a lifetime, so shall it be the case with Willy Wonka and myself. As a child I was captivated by the colours, the dream of myself being able to visit a magical place where sweets and chocolate roll off the production line purely for my ingestion. Songs that I memorised back in my youth have never left me, and now as a considerably middle aged adult male, I can still embrace, and feel the magic, whilst enjoying the darkly knowing aspects of this fabulous and wondrous black comedy.Roald Dahl was quite a writer of note, and thankfully the makers here have brought his astute morality tale to vivid cinematic life. Director Mel Stuart, aided by his screenwriter David Seltzer, even manage to add to Dahl's wonderful story courtesy of a sinister outsider, who apparently in the guise of a rival corporation, will pay handsomely for a Wonka top secret, morality, greed and power all coming together in one big chocolate explosion. The greatest gift that Willy Wonka gives, tho, is that of the set designs and art direction, where in an almost hypnotically drug induced colourful world, Wonka's factory is a child's dream come true, however, peril is at every turn as life's lessons dolled out courtesy of the scarily cute Oompa Loompas.Songs are provided by Anthony Newley and Leslie Bricuse, with the sumptuous art coming from Harper Goff. Gene Wilder takes the lead role of Willy Wonka, magnetic and bordering on clued in madness, Wilder takes his rightful place in the pantheon of memorable performances performed in fantasy pictures. But ultimately it's the story and the way it appeals to every age group that makes Willy Wonka a prize treasure, the kids love it, while the adults watching with them will be wryly nodding and trying to suppress the onset of a devilish grin.Pure magic is Willy Wonka, see it now in High Definition TV to fully realise the dream/nightmare on offer, oh oh I love it so. 10/10",
    "65": "Surprisingly, Roald Dahl (author of Charlie & The Chocolate Factory, on which this film is based) reportedly hated this big screen version of his book. There's no denying that the book is sheer genius, but in all honesty this film adaptation is exceptionally well made too. In fact, it comes high up on my list of all-time movie favourites.The Wonka Chocolate Factory is an amazing building from which some of the most scrumdiddlyumptious sweets are delivered to the world's candy stores. Wonka-mania hits the world when five golden tickets are hidden inside packs of Wonka bars - for the winners will be granted a tour of the top-secret factory. Young Charlie Bucket, a poor boy whose family cottage lies within sight of Wonka's factory, dreams of becoming a winner - but with barely a penny to his name, does he have a chance?What makes Willy Wonka and the Chocolate Factory such a success is the way it skillfully blends entertainment and a serious underlying moral. Each winning child is exposed as being rotten-to-the-core, then dealt with harshly and dismissively by Wonka. Seeing these awful brats get their come-uppance is hilarious, enjoyable and - on a serious level - quite eye-opening (it's as if parents in the audience are being told how to prevent their children from turning bad). Gene Wilder was simply born to play Wonka (every eccentric phrase, every bemused expression, and every mischievous glance is judged to perfection). The film's set design is fabulous, with particular high-spots including the chocolate room, the egg room and the wacky corridor which gets smaller and narrower the closer you get to the end. Willy Wonka and the Chocolate Factory is simply magic - a film that everyone must see, especially parents whose kids are just becoming that bit too big for their boots!",
    "66": "Willy Wonka and the Chocolate Factory is a truly magnificent piece of filmmaking and remains one of the most fascinating and wonderful adventure films ever made. One of the things that makes this film so intriguing is that it could have been made at any time. I mean, just from watching it, you can't really tell when it was made. It has been one of my favorite films for almost 20 years now, and it wasn't until today that I actually realized when it was made. Watching it again last night, I had convinced myself that it was made sometime in the early to mid 80s, and I was shocked to find out that this year is the movie's 30 year anniversary. Until now, pretty much the only movie I associate with 1971 is A Clockwork Orange, and it's just strange for some reason to find out that this classic movie was made so long ago.At any rate, Willy Wonka is a tremendously imaginative and inspiring film. It's a family film, but one of the most important aspects of a family film is that it has to be enjoyable for a variety of ages. This is what makes movies like Toy Story and Shrek such huge successes- the adults will love it just as much as the kids are sure to. Hence: `family' film. On the other hand, this is also the downfall of such other movies that are strictly for a much younger audience, like Cats & Dogs. The makers of Willy Wonka and the Chocolate Factory understood this very well, and you can see that just by the way that the cast is divided. Here are all of these kids (funny how it was only kids who found those golden tickets) who were at this candy factory, and they had each elected to bring one of their parents with them as the one admissible member of their family who was allowed by Wonka to accompany them to the factory. One of the best elements of this film is the excellently written script and, even more, the songs. These are some of the best songs in any movie ever made, rivaling even the best of the songs from Disney's films (hey, some of them are really good). There are, of course, some exceptions, such as `Cheer up, Charlie,' which I have been fast-forwarding through for as long as I can remember, but for the most part, the songs are fun to listen to and they pertain to life outside the movie. They are not just songs about the candy-making genius of Willy Wonka or the excitement of being able to tour his mysterious factory, but they are about life in the real world. They're about believing in yourself and being motivated in life (`Anything you want to, do it. Want to change the world, there's nothing to it'), but there are also some that have to do mostly with the movie but are still just as enjoyable, such as the classic song that Wonka sings in the tunnel on board his boat (curiously named `Wonkatania'), which was creepily covered by Marilyn Manson a couple of decades later. The dialogue in the film contains some of the most interesting little tidbits in the entire movie. Wonka's lines, in particular, are wonderfully strange and amusing (`A little nonsense now and then is cherished by the wisest men.'). He is a truly eccentric and fascinating man, and Gene Wilder captures the character flawlessly, as he delivers the lines from the brilliantly written script. Willy Wonka and the Chocolate Factory is one of those rare movies that comes along and completely changes the way that fantasy films are made. It's all about having fun in life and being hopeful against all odds and, most of all, being able to have fun in life. There are times when you have to let things go for a while and just act like a kid. Eat candy, run around and play, steal fizzy lifting drinks and bump into the ceiling that now has to be washed and sterilized, it doesn't matter as long as no one's looking. That's such a trivial little quirk of Wonka's (who sterilizes their ceiling?) that it becomes obvious that the movie is trying to say that it's okay to break the rules every once in a while. Have fun in life. Besides being absolutely mouth-watering (to this day, I still fantasize about sinking my teeth into one of those gigantic gummy bears), the movie is an uplifting adventure that warms the heart and sends people of all ages away with fairy tale candies dancing in their heads and wonderful songs just behind their lips. It is an always-welcome vacation from reality for people of all ages, and it should always be remembered and loved for that. This movie will ALWAYS be a must-see.",
    "67": "It's Gene Wilder, at the top of his form, who made this unique imaginative adventure more vibrant and gleeful. His energetic performance is by no means different from Julie Andrews as Mary Poppins. He absolutely deserved ,at least, an Oscar nomination. The movie lost some of its sharpness and suffered from some monotony after some time from reaching the factory. But besides the gorgeous production design and cool visuals, there was Wilder's charisma that helped to elevate the movie. The first half of the movie has great emotional value, and established the characters very well. Also, it feature some of the most beautiful songs of the movie. But due to the fast pacing, there was an action in the first half that felt forced, if it was necessary to serve a turning point of the story.There are many powerful and very important messages in the movie. But the greatest thing about them is not actually the messages themselves, as we witnessed them delivered in a lot of movies before, but it's how genuine these messages seem as they are delivered in this particular story. Peter Ostrum is great in his first and ,unfortunately, his last role. There are many dramatic scenes that required a very good actor and he is. Actually, I didn't feel for even a moment that this is his acting debut. Willy Wonka & the Chocolate Factory is a total blast from start to finish.\nIt's Scrumdiddlyumptious! (8.5/10)",
    "68": "Anyone could love this film and I don't see how you couldn't fall in love with Willy Wonka. This is without a doubt one of the most charming movies of all time that is still to this day one of the most enjoyed movies for a family night. Despite it's dark little messages, it still made light of everything and made this movie \"satisfying and delicious\".You'll see a world of pure imagination and will absolutely fall for Willy Wonka. Gene Wilder is a comedic genius who will forever be the timeless Willy Wonka. He played it so well and made it look so easy. All the kids were amazing as well, I mean the boy who played Charlie was so adorable and you felt so awful for him. You just wished for his deepest wishes to come true. The sets are also just fantastic and so yummy to look at. On of my favorite scenes was with the \"inventing room\", all the amazing gizzmo's. I also loved how we took a peek into Wonka's madness when he throws a shoe into a boiling water pot and says \"It gives it a little kick\". One of my favorite lines of all time is \"Candy is dandy, but liquor is quicker\".The film is not only great to look at but it has terrific and catchy songs that will be stuck in your head and find yourself humming down the street. This is going to be a timeless classic that I can't wait to show my future children.10/10",
    "69": "This is a hugely enjoyable film, based upon the book by Roald Dahl. The film does have a number of merits, especially the flawless performance of Gene Wilder as Willy Wonka, a characterisation that is charming and funny at the same time. Another standout is Jack Albertson as Grandpa Joe, his scenes with Charlie were lovingly realised, but in his song, he was just hilarious, and his singing voice was remarkably good. However, whereas Peter Ostrum is perfectly agreeable in terms of acting as Charlie, he is let down by his lack of any real singing ability. Though the film does look beautiful with excellent cinematography and colourful sets, and the supporting characters like the Oompa Loompas, the odiously spoilt Veruca Salt, television addict Mike Tevee and the rather disgusting Violet Bueragarde, are very well done, and the actors are further advantaged by a wonderful sparkling script. The songs are lovely, especially Oompa Loompa, Imagination and I want it Now, though I will say I felt Cheer Up Charlie was rather tedious and slowed the film down quite considerably. Overall, a beautiful film, and I do think it is underrated. 8/10 Bethany Cox.",
    "70": "Even with Johnny Depp's darker portrayal of Willy Wonka of more recent vintage\nout there, what Gene Wilder did with the part stands out as the definitive Wonka\nfor our times. I'm willing to bet that more families rent this one than Johnny\nDepp's.In Roald Dahl's children's fantasy the great candymaker Willy Wonka locked up\nhis candy factory because of industrial spying by his competitors. No one goes\nin or out except the raw material and the candy. Now however it's worldwide\nnews that Wonka is opening his giant River Rouge GM like plant for five lucky\nadolescent tourists. They will be determined by five lucky golden tickets found in Wonka Bars.That fifth one goes to Peter Ostrum who takes the tour with his grandfather\nJack Albertson. The other kids who are showing various degrees of spoiled also have adult companions. The four other kids, well they don't quite finish the trip. As they rather colorfully drop out Gene Wilder has some snarky comments. Accompanied by\nthe pygmy tribe of Oompa-Loompas who Willy Wonka moved from their\nPacific island home to work in his factory. This part I thought was truly\nstretching it as these little guys look a whole lot like slaves working on the old\nplantation.The film got an Oscar nomination for Best Musical Scoring and the song The\nCandy Man became a big old hit for Sammy Davis, Jr.After almost 50 years the Candy Man can and is still doing it.",
    "71": "When I first saw this movie on VHS in the late '80s, I was shocked. A '70s movie with a GOOD message?? I couldn't believe it. The message: kids - be honest and be trustworthy and don't be obnoxious; parents - don't spoil your kids or they'll quickly turn out to be brats.Wow, no wonder liberal critics like Leonard Maltin trashed this film. It was not the normal message being delivered in movies, which usually trashes the good and glorifies the bad. That's what makes this story refreshing, and the same goes for the re-make that was released in 2005.Peter Ostrum plays the likable Charlie and is very good. He's one of the nicest kids ever put on screen and was a fine actor. It's kind of surprising this was the only film he ever did! Jack Albertson does a nice job of Charlie's loving grandpa and so do the bratty kids, especially the English girl who is so bad you have to laugh at her.The first part of the story was a good satire on how people sometimes make trivial things so important and how the news media gets carried way with stupid issues. (Wow, look at it now!) The second half of the story is intriguing because of the co-star of the film: Willy Wonka - a no-nonsense candy maker who doesn't put up with the brats - was fascinating to watch. (The critics thought he was too nasty.) Gene Wilder is excellent as Willy. Yes, he has a bit of a mean streak to him but his comments are fun to hear and on the money despite his lack of verbal tact. Most people prefer Wilder's version of \"Wonka,\" by the way, over the bizarre-but- talented Johnny Depp's.This was an entertaining film that should keep your interest. It's also an interesting comparison to the 2005 movie. Frankly, I enjoyed both.",
    "72": "When I was a kid, my mom made me sit through this a trillion and one times. It's one of her favorites. I liked it well enough back then, but it's only now that I'm older that I can appreciate the true sinister glory of this movie. It's so deliciously creepy! For those who have to whine about how messed up it is, consider the original \"Cinderella.\" Now that was awful. Willy Wonka is the stranger with a bag of chocolate that parents are always warning their kids about, but what he's really offering is a seductive nightmare in a kaleidescope of candy colors, a cautionary tale told with fairy story whimsy. I got it when I was 5, but the thrill didn't register. \"A dirty trick on innocent children?\" Some people out there obviously don't remember what it's really like to be a kid. Childhood is full of booby traps and the allure of the forbidden, and that which is evil frequently looks divine. \"Willy Wonka\" is about giving in and seeing the horrors and delights, the choices and pratfalls  on the other side. It's disturbing because it strikes a certain primal chord: freedom and danger are entwined, and people have never wanted to associate children with either.",
    "73": "Chocolate maker Willy Wonka hasn't been seen for some time, so there's a huge interest when he offers 5 random people the chance to see his factory. Hopeful of finding a golden ticket is young Charlie, a boy from a poor background.One of my favourite films growing up, and one that really did translate well into adulthood. It's heart warming, funny, surprising and wonderful for the whole family.Roald Dahl's wonderful book translates incredibly well, and it's a truly faithful adaptation, for me it will always beat the follow-up, although I rather enjoy that one too.Easy to forget that this film was actually Oscar nominated, and for good reason, this is a very well made and well acted movie, one that fans will never tire of. Music that you can't help but sing along to.What child hasn't dreamed about an endless supply of chocolate, I know I certainly did, and that's exactly what this film is all about, escapism, imagination and of course dreams.Gene Wilder, absolutely phenomenal, he's just magical in the role. Plenty of well known faces to enjoy.8/10.",
    "74": "With the brand-new version of Tim Burton coming up, I thought it would be appropriate to watch the very first film-adaptation of Roald Dahl's popular children-novella first. Over 30 years old already, but this charming and moralistic fairy-tale still is a joy for all senses, with its likable main characters, exhilarating songs and valuable life-lessons. The movie might start out a little slow and overly dramatic with the extended portrait of the poor Charlie Bucket who has to work in order to support his family and he can only secretly dream about winning a grand tour in the wonderful chocolate factory owned by the mysterious Willy Wonka. But, when the miracle than occurs and Charlie walks into the factory together with four greedy kids, the movie REALLY takes off! The children and their adult companions are guided through the colorful landscapes and ingenious techniques of Wonka-world, where chocolate flows in rivers and candy bars can be taken out of TV-screens. This is a very fun movie and Dahl's rich but bizarre imagination is wonderfully put to the screen by Mel Stuart. The set pieces are magnificent and they really have the true magical feel of fantasy. Typical for Roald Dahl's work also is the slightly sinister and horrific touch, which is perfectly illustrated here in the unsettling boat-ride-through-the-cavern sequence. This particular scene is perhaps the most memorable one of the entire movie because of it's great use of sound and lighting! New surprises and eccentric plot-twists are provided every couple of seconds and Gene Wilder's jolly (but tempered) performance as the extravagant factory-owner really makes this movie complete. I can only hope the 2005 version will be as fabulous as this but I'm quite sure it will be. After all, if there's one team able to re-tell this insanely great tale, it has got to be Tim Burton and Johnny Depp. \"Willy Wonka and the Chocolate Factory\" is like a big bar of chocolate: delicious...and you're never too old to enjoy it!",
    "75": "Willy Wonka & the Chocolate Factory: ****\"Willy Wonka & the Chocolate Factory\" is a wonderful movie that should be viewed by everyone. It is one of my personal favorites. Willy Wonka & the Chocolate Factory is about a poor boy named Charlie (Peter Ostrum). His life is horrible. But one day, he hears the news that Willy Wonka (Gene Wilder) is sending out five golden tickets and then letting the winners go into his factory. The first four winners are Augustus Gloop (Michael Bollner), Veruca Salt (Julie Dawn Cole), Violet Beauregarde (Denise Nickerson), and Mike Teevee (Paris Themmen). Charlie then wins the fifth golden ticket by luck.\nWilly Wonka & the Chocolate Factory is visually stunning and cleverly written. The songs are remarkable. The whole movie is a fun journey through the chocolate factory. It is very enjoyable, fun, and clever. The scenery and props are eye candy.\nThe most underrated character in the movie is Mr. Turkentine. He is only in three scenes, but everytime he is on screen he is hilarious. I love the quote: \"I've just decided to switch our Friday schedule to Monday, which means that the test we take each Friday on what we learned during the week will now take place on Monday before we've learned it. But since today is Tuesday, it doesn't matter in the slightest.\" He is very, very funny.\nJulie Dawn Cole plays Veruca so well. She is so bratty and she is one of those characters that you hate so much you love them. Roy Kinnear (who will be missed) is hysterical as her father.  The whole movie is funny in it's own odd and strange way. It is a classic that will be treasured for many years to come.",
    "76": "I admit, for a grown man of 51, this is still a guilty pleasure...and I think my wife knows why.From the first time I saw it on network television in 1976, I just knew I wanted to find a golden ticket to the Wonka factory. Heck, I was just 9 back then, but this movie remains a wonder, 40+ years later. Not only do I have it now on DVD, I can sit through this endlessly. That's how good it is to me.Gene Wilder, who plays Wonka, is a very believable character here. I admire the way he portrayed his role as being one of \"pure imagination\", just as the storyline goes. The same goes for the entire cast. I had read Roald Dahl's \"Charlie and the Great Glass Elevator', and this is so much like it.But...why my guilty pleasure? I have to snicker when I told her that both Julie Dawn Cole (Veruca Salt) and Denise Nickerson (Violet Beauregard) were my very first childhood crushes. She doesn't get mad, she just does when I watch the movie so much...for that reason. This is a very wonderful movie, has always been so close to my heart, and that's where it always will stay. As long as there is \"pure imagination\" indeed.Awesome indeed.",
    "77": "Most excellent works in the arts are seen and enjoyed at a variety of \"levels.\" That is true of this movie in general and of Gene Wilder in specific.Wilder has been known in the circles of movie creators as a creative genius for many years. Here, his acting ability showcases that genius. To be sure, at the level of good fun for kids and Moms and Dads, he comes through. But writers must have loved his work. Watch for the \"look\" in his eyes. You will see \"changes\" in them as he speaks or as he listens to the kids. Those unheard, barely seen changes can be read many ways. And that is the genius. They put more into the lines than the words themselves.Art should be clearly and quickly understood. It should also be the tool used to make us wonder a bit. Think a little. Or find meaning we didn't see at first look. In this movie, Gene Wilder's almost imperceptible nuances speak volumes.",
    "78": "Willy Wonka & the Chocolate Factory is a beautiful film which I can still watch today and enjoy.Before I saw this movie I had read the book entitled Charlie and the Chocolate Factory by Roald Dahl and it was magic. As for this film, it was pure fantasy.Anybody can enjoy this film whether they be aged 10 or 100. I loved fantasy as a child and being whisked off to worlds with magic and wizards and strange creatures. Willy Wonka is set on Earth but not the Earth we know of. Willy Wonka's world is beautiful. Wonka is a benevolent old chocolate maker who invites some kids round to his chocolate factory where they can see all his delights and visit his magical world.The really great thing about a film like this is how it can whisk you off to another world. Forget whatever troubles you've got, forget about those bills you have to pay, forget about sitting in rush hour traffic every morning and just enjoy this magical film which whisks you off to another world, a world where dreams come true, a world where there is nothing but love and magic. I can guarantee that whoever watches it will be taken in by the magic.Simply beautiful!",
    "79": "All over the world the chocolates and sweets of famed and enigmatic candy maker Willy Wonka (Gene Wilder) are enjoyed by all as they wonder at how he makes such delicious sweets despite the factory having been closed off to the public after rivals sent in spies to steal his sweets. Eventually a contest is announced wherein within the wrappings of five Wonka chocolate bars Mr. Wonka has placed five Golden Tickets that will allow entry into his factory. The five tickets are eventually found by gluttonous Augustus Gloop (Michael Bollner), spoiled and bratty Veruca Salt (Julie Dawn Cole), gum chewing show-off Violet Beauregarde, TV obcessed Mike Teevee (Paris Themmen), and poor but sweet and good natured Charlie Bucket (Peter Ostrum) are the winners and allowed entry into the wonderous candy factory but have all been approached by insidious candy magnate Arthur Slugworth (Günter Meisner) who has offered rewards for being given an everlasting gobstopper from Wonka's factory.Willy Wonka & the Chocolate Factory is an adaptation of the 1964 book Charlie and the Chocolate Factory by author Roald Dahl. Director Mel Stuart's then 10 year-old daughter had read the book and asked her father to make a movie out of it with family friend and Stuart's producing partner David L. Wolper. By massive coincidence Wolper was in negotiations with the Quaker Oats company regarding a new vehicle to introduce a new candy bar from their confectioner's division (which has since been sold to Nestle along with the Wonka branding) and the company purchased rights to the book intent on using the film to promote the real life Wonka Bar. Roald Dahl had agreed to write the screenplay for Wolper, but only delivered an outline leading to some uncredited re-writes to fill in scenes (which Dahl disagreed with making Willy Wonka yet another Dahl adaptation that didn't meet the author's approval). Several actors auditioned for various roles in the film including Fred Astaire and Joel Grey who wanted the role of Wonka but were deemed too old and too short respectively, and reportedly Peter Sellers begged Dahl for the role of Wonka to no avail prior to Wilder's casting. While upon initial release the film was a minor disappointment making only $4 million against its $3 million budget resulting in Quaker Oats relinquishing their rights to the film to Warner Bros. For $500,000, the film grew in popularity almost a year after its release with TV airings increasing exposure to the film and impressive home media sales helping to ensure that the film became a staple of many people's childhoods and becoming as well regarded as classics such as Mary Poppins and Wizard of Oz, and rightly so because Willy Wonka & the Chocolate Factory is a classic in all respects.From the opening sequence following the production of Willy Wonka's chocolate set to the incredibly memorable score by Leslie Bricusse and Anthony Newley, Willy Wonka sets up a tone of wonder and magic and captures the joy inherent to the sweets which the titular chcolate factory produces and the enduring wonderful song Candy Man at the sweets shop is near pitch perfect in setting up the wonder of this world. Peter Ostrum is really good as Charlie Bucket who's positioned as an \"everykid\" who despite being of lower means than other kids maintains a good heart but is also a kid who possesses flaws and even allows some selfishness and vitriol to his thoughts but not to the point he becomes unlikable or unrelatable. Scenes of Charlie sharing what few Wonka Bars he can get with his family or Grandpa Joe (Played wonderfully by Jack Albertson). Stuart used a method style of direction when handling the child actors often preventing the kids from knowing the full context of scenes prior to filming in order to elicit genuine surprise and amazement from them and that undeniably comes through in the final product with the kids and their personalities well defined and very distinguished. The movie features some terrific humor such as the various vignettes of the buying frenzy of Wonka Bars that comes after Wonka announces the contest with some very funny bits involving a super computer, a psychiatrist, and especially a kidnap and ransom still being very funny.Structurally the movie is really well done with Charlie kept as the main focus for the movie with Willy Wonka kept mostly absent until we actually get to the Chocolate Factory which helps to build the mystique of this world and the eponymous chocolatier. Roald Dahl apparently didn't like this movie very much, and one of the reasons he stated was because the film focused too much on Willy Wonka and not enough on Charlie. I really have to laugh at this statement because considering how enigmatic Wonka is in the film and he doesn't show up until halfway into the movie, Charlie is positioned as he should be as the audience proxy and his journey with the emotional payoff at the end of the film feels earned and true to the spirit of the story. Tim Burton would \"reimagine\" this story in 2005 with Charlie and the Chocolate Factory, and despite that movie allegedly being closer to the book it pushed Charlie further into the background with more focus brought to Depp's portrayal of Wonka.Willy Wonka and the Chocolate Factory is still a classic and for good reason. Much like films such as Mary Poppins and Wizard of Oz, the film creates a world of colorful fantasy but with an edge of intelligence and wit that respects the audience regardless of age so both children and adults can enjoy the movie together (there might even be a bit more for adults). I love this movie and have seen it dozens of times before and I'm sure I'll see it dozens of times more.",
    "80": "I have always liked this film. Despite the new film (which I like even more), I still enjoy the old fashioned aspects of this film. For 1971, it's pretty good children's fare--much better than crap from the same era (such as CHITTY CHITTY BANG BANG and DR. DOOLITTLE). Some may find all the singing annoying or complain that the songs are not the ones Roald Dahl wrote in the book (which appear in the remake), I still found them catchy and cute. In fact, I have no major complaints other than the stupid sequence where they are on the boat. All the awful and pointless images projected across the screen look cheap and gratuitous--unlike the rest of the film.However, I think that the BEST thing to do is to watch this and the recent remake and think of them as totally different movies. The 1971 film is a bit saccharine and kitschy but is still fun and memorable. The new Johnny Depp version is much darker and full of modern special effects. And, as a result they are so different, it's worth watching them both and DON'T compare them--just enjoy.",
    "81": "One of the best films - for children, for adults - ever made. It never panders, it can be quite dark. The wonderful performance of Gene Wilder can boarder, at times, on madness, cruelty, but - even when I was little, I loved this, and, I understood. 'Remember what happens to the man who got everything he wanted? He lived happily eve after...'It's one of the last lines in the film, and while it's spoken to Charlie, it's really about Wonka himself. He found someone - someone he could trust with his secrets. And, Charlie learned that, being honest does pay off.Another line from the film; ''So shines a good deed in a weary world,' which while, originally from Shakespeare's Merchant of Venice, still resounds with much meaning.There are some 'perennials,' in the film, and, this one shines as one that every child, can love, and, grow up, to share with theirs.",
    "82": "It was one of my first movie on Sunday matinee Theatre, I remember quite well, today revisiting this fantasy on Blu-Ray sounds much better even I already pass of the fifty, but somehow it wasn't a sort Disney picture, perhaps to reach to mature audiences as well, when this movie came up many parents criticized Wonka's behavior on umpteen times where the child was sucked by a drain piping, also child inflated a like a blob, a girl has been disappeared on a hole and finally the last one getting smaller inside of TV set, such cruelty wasn't still understood by mostly, however Willy Wonka is an eccentric character at own way, he playing a kind of game where he looking for a prefect child, thus he acted on purpose, an odd fantasy, where everything has a boundary that no one dared to pass, Wonka expose how spoiled kids becomes unbearable quite often, the great lavish sets boosted the picture in another level, countless gadgets, sharp dialogues implies a dual understanding, the casting apart Gene Wilder all others were almost unknown, Charlie (Peter Ostrum) and Veruca (Julie Dawn Cole) were the most interesting and colorful characters, to close the movie had a key scene, when Charlie return the everlasting candy to Wonka, so compelling moment, in fact the producers and the casting speak at bonus material that didn't believe this movie will got such greatness in near future, now we knows why it got large proportion due it was really unique!!Resume:First watch: 1973 / How many: 5 / Source: Theatre-TV-Cable TV-DVD-Blu-Ray / Rating: 10",
    "83": "Roald Dahl's Grimm-like book \"Charlie and the Chocolate Factory\" gets a careful, pointed musical treatment here, involving five Golden Ticket-winning tykes who get to tour a mysterious candy factory--at their own expense. Turns out the journey is a test of their personalities and upbringings, and the film is a little presumptuous to suggest that the poorest kid may be the most noble and honest (as if all rich kids were rotten). The opening moments and TV commentaries on the race to find the tickets are littered with smart satire and a particular kind of dry-ice British humor which may confound kids but should delight grown-ups. Once inside the factory, the film coasts happily along on Gene Wilder's coattails (he's incredibly nutty, occasionally a jerk, but always unpredictable). The screwy Wonkatania boat ride is a highlight, with gross-out flickers on a screen that really are a freak-out. Yes, some of the songs are a drag, but I loved Veruca Salt's number \"I Want It Now!\" (she really wants ten thousand tons of ice cream??); \"The Candy Man\" is a classic and, I may be in the minority here, I thought \"Cheer Up, Charlie\" was a sweet lament. The movie is uneven and a bit grotesque, but it sends kids out on a high and doesn't bore parents, and that's a plus for family films. Critics dismissed it in 1971 (Pauline Kael described it as \"Prussians at play,\" which I'm pretty sure is an insult) and Dahl himself publicly nixed it, but it has bratty kids getting what they deserve, a fabulous looking factory, and wild-eyed, frizzy-haired Wilder at his peak. His performance is like an Everlasting Gobstopper; it will live on and on. ***1/2 from ****",
    "84": "I have seen the remake ages before, and I must say that I do think that the remake does a few things better than this. As for the things that the remake did better, I like the scene in which Charlie insists to share the chocolate because it's his birthday so he can do whatever he wants to, I like the grandpa dance scene better, I like the family backstory with dad losing his job and grandpa being an ex-worker in the factory, I like the dark backstory of Willy Wonka and I guess I like the spoiled kids a lot more in the remake as they felt a bit more realistic and not over-the-top overly-stereotypical as in the original. But even with all these things, the original is still highly superior.I must say that I have a few problems with this film, one being that what the hell was wrong with the beginning. The family barely has any money and the old man wants to quit smoking to save money and lead a healthier lifestyle, yet the family insists on him to keep smoking... Also, I can't believe that Charlie and his grandpa broke the rules during one part of the film especially when before they despited others breaking the rules. Also, the fat kid is not fat enough haha. But that's all I have for the flaws of this otherwise magical film.But now to the good parts. This film has some of the most charming and heartwarming sets I've ever seen, so much colour and so cute. The songs are very good, they're memorable and iconic. Most of the dialogues are very smart, two-sided and meaningful. Humor is truly ahead of its time, still holds up as if the jokes were made today. Acting is phenomenal, especially by Gene Wilder. But most importantly watching it with the theory of Willy Wonka being a serial killer makes this truly an original and thought-provoking film and it seems that all checks out perfectly. All in all I truly enjoyed this magical film.",
    "85": "I think it's pretty safe to say that Willy Wonka and the Chocolate Factory is a timeless classic. Not only does it feature a great plot, fantastic acting and show how movies don't have to be full of computer animation to be good, but it also features some of the best music I have ever heard in a movie.I still remember, almost as clearly as if it were yesterday, the remarkable thing the movie did to me the first time I watched it: It completely changed my mind about musicals! I was about 10 years old when I first sat down and watched the movie. Like a lot of kids, I didn't much care for musical numbers in movies. So when the music for \"Pure Imagination\" started playing, I thought, \"Oh great, a musical number!\" I was just about to press the fast-forward button when Willy Wonka (Gene Wilder) began singing.Within about two seconds, I was completely mesmerized! I didn't think I had ever heard such a beautiful song in my life, nor had I heard too many singing voices that were as beautiful as Willy's. It felt like he was singing that song as much to me as he was to the kids and parents in the movie! That song certainly captured MY imagination, and after hearing it for the first time, I saw musicals in a whole new light.I may be grown now, but I still like the movie every bit as much as I did as a ten-year-old....and I will always have a special spot in my heart for \"Pure Imagination\" the song that convinced me that musicals can be some of the best movies out there!",
    "86": "I thoroughly enjoyed finally seeing this movie in full. I never really saw the whole movie throughout these years, lots of bits but never the full thing. Now my first contact with the story was with the remake. Which isn't great but not terrible either. But this movie is on another level. The level you wish for when putting on a fantasy family film.The musical sections are so well done, I love how they are kept contained and they make them that much more personal when they need to be. Normally I kind of daze off when the musical section gets so big and random folk start to join in, but that's never the case here. The characters are just 10/10 I love all of them. From the annoying to the charming and kind. You simply cannot not find Charlie endearing, and his grandpa just as much. And talking about the musical aspect, the songs here are fantastic and as we have all experienced: so very memorable.The directing is surprisingly fresh, I love the special sections during the Oompa Loompa songs. With the funky text and framing. The directing overall is simply great, something to say coming from a director that had only done documentaries before.Any moment with Wilder is one you want to hold on to and never end. His performance is enchanting and something you keep looking forward to. But it didn't overshadow the others as I enjoyed them just as much.The comedy imo, still works. There's a ton of quick jokes that would fly over a kids head. So there is much to laugh here not just at the slapstick humor that's there for the kids but also the comedy within the dialog.The set design.. I don't think there is much to say other than that it's art. Whilst the Tim Burton remake has this quality as well, the practicality in the original here has that extra something. Even though you could see some of the candy as being red tubing or balloons, for some reason the authenticity is endearing towards the whole movie.Overall I really enjoyed my time with this classic.",
    "87": "This movie is about as good as it gets, barring the tedious first 30 minutes before Gene Wilder comes on screen. But all the better, his entrance is perhaps the most memorable one in cinematic history (yes, better than Orson Welles in \"The Third Man\").Willie Wonka & the Chocolate Factory is NOT a kid's movie. It is saturated with literary allusions (Shakespeare galore), musical references (that was Mozart, not Rachmaninoff!) and a quirky sense of humour that only a mature audience will truly get. For that reason, I can understand why many of the kids today disparage this classic in light of the 2005 version with its CGI special effects and Johnny-the-hottie Depp. But for the purists who enjoy a good, powerful performance without the fluff, this is the film for you.What amazes me about this film is that it is really quite dark and cynical, despite its colorful and upbeat appearance. The candy man Willie Wonka is at times a malevolent and frightening presence with a jaded, almost hopeless view of life. But despite it all, he makes us laugh uncontrollably and sing along and revisit our childhood as only an madman can. Whether this was in the original screenplay or whether it was Gene Wilder's own tinting I don't know, although I suspect the latter. For that reason I'm sure it deviates significantly from the theme of the original children's book. But I wouldn't have it any other way.",
    "88": "To me this is arguably Gene Wilder's best role. Of all the stuff I've seen him in this is the most indelible performance and character he performed and created for the silver screen. I hope I don't sound like I'm fawning, but the sarcastic quips and baiting he provide in his Wonka character are exacting and just simply laugh-out-loud hilarious.To me this is one of the last of the great non-Disney children's films. Made in a day and age when process shots were expensive and hard to produce, Willy Wonka & the Chocolate Factory rely on the musical trend of the time, but do so successfully I think. So much that I think modern contemporary audiences, most of whom disdain the musical genre, will go along with the numbers as part of the narrative, and not as something meant to draw attention to themselves for the sake of adornment.Even in my middle age I am delighted by this film, and even though I knew the film backwards and forwards like a lot of other adults who saw this film when it first premiered on the big screen in 1971, I still felt a thrill when Charlie has his big moment of luck. I felt like a boy all over again. And when Willy Wonka makes his smiling remarks to the various comments and actions made by his guests touring his establishment, I simply could not hold back my laughter.Even as a teen and 20-something when I saw this film I smiled at both the story and the Wonka character, as well as at Charlie and his family.To me Willy Wonka was made in a time when there was still a kind of understood (all be it tacit) \"respect\" for the spirit of the ever so repressive rules of the former Hayes' office that had clamped down on a lot of perceived \"immorality\" portrayed in films. Nobody wants to take their kid to a film with a lot of sex and explicit gory violence. And where everyone has a kind of innate understanding of what is proper and improper, to me Willy Wonka has that kind of essence of truly making a family film, or a G-rated film that can be enjoyed by everyone.The script is intelligent and witty, the child actors are truly marvelous in this, and the leads and supporting cast do their usual exceptional bang up job. And the music isn't half bad either.Colorful, a bit slower paced in terms of editing, but no less full of zest for modern conventional story telling style, Willy Wonka is the kind of film they don't make anymore but should. And kudos to the entire cast, and in particular Gene Wilder for giving us the sly eccentric genius whose quest for character is fulfilled superbly.A great film. Get a copy or stream it for yourself, or with those you love.Enjoy.",
    "89": "This film is 100% pure theatrical magic. SKIP THE REMAKE. In this version a few minor changes were made from the book but all films do this that are based on books. In case you did not know the story here it goes. Willy Wonka in this film is an unknown man who makes the worlds best candy and of course chocolate. Nobody knows how he makes such wonder candy. As Grandpa Joe tells Charlie: Nobody comes in and nobody comes out. Then one day there is a worldwide announcement. Willy Wonka is having a contest and 5 lucky people will get to tour the factory if they land a golden ticket which is inside his candy bars! Charlie is very curios about the factory and would love to go but his family is very poor and can afford to buy many candy bars but luck seems to be on Charlie's side. The only 2 films that I can think of that are more magical than this is \"The Wizard of Oz\" and \"Mary Poppins\". Again avoid the soulless remake! This film sparkles!",
    "90": "Reclusive Willy Wonka (Gene Wilder) is opening his factory after years of secrecy. It's been a long time since he has used people as workers. Nobody ever goes in and nobody ever comes out of his factory. Then he announces that five golden tickets found in Wonka bars will grant five lucky children and their guardians a tour of the factory. Charlie is a poor boy living in the shadows of the factory. He is lucky to enough to find the final ticket. He brings his grandpa along as each child succumbs to some mishap. They are introduce to wild candy magic and the Oompa-Loompas.This is one of the weirdest and yet mostly fun ride. Gene Wilder is pitch perfect as the outlandish master of ceremony of this unique three ring circus. It has one of the most unique vision. Nothing is crazier than the Oompa-Loompas. The funnier thing about them is that they're not necessary cute. There is something disturbing about them. That goes for the factory in general. There seems to be some danger and magical about everything. It is just pure movie magic.",
    "91": "Pure magic film in the first shot version of the attractively eccentric Roal Dahl novella , whose storyline written by Roald himself . Stars the great Gene Wilder as the charmingly devious Willy Wonka , the factory's bizarre owner . As Gene Wilder organizes a lottery to participate a tour throughout his factory operating behind locked gates, like a hostle Xanadu . As the factory contains extaordinary landscapes , whole location is full of candy striped trees , rivers of chocolate negotiable by gondola, and sinister caverns manned by orange-faced dwarfs . Five kiddies and their parents are prized to carry out a colorful tour of the factory , and several of them destined for appallingly appropriate fates . As a few of his guests of this tale, four greedy companions are stickly fingers , pun intented, and suffer the consequences . As some children disappear to suffer torments of their own devising .This is a a Grimm-style moral story which has real and true magic touch of fantasy . Slow to beggining , but once the youthful little hero and his grandfather arrive for the prize tour of the mysterious and surprising chocolate factory the movie really takes off . Gene Wilder is oustanding playing a chocolate company owner who choses some lucky children and their parents to a tour across the facility . This essentially amusing and entertaining film has a lot of memorable and enjoyable moments . Packing surprising and stunning Heath-Robinson type settings in the wonderful chocolate factory . Marvelous and catching dances and songs , in fact there are foot tapping songs ,most of them sung and danced by sympathetic midgets . The agreeable and catching songs were stunningly composed by Anthony Newly and Leslie Bricusse .Along with the extraordinary Gene Wilder for once delivering an impecable controlled acting , here appears as starring the likable kid Peter Ostrum of short career , the veteran Jack Albertson who had a long career and likable secondaries such as : Roy Kinnear , Gunter Meisner, Audrey Woods , Michael Bollner, among others . It packs a colorful and glamoroos cinematography by Arthur Ibbetson. The motion picture lavishly produced by David L Wolper , was competently directed by Mel Stuart , that is -nowadays- considered to be a real Cult Movie . Rating : Above average, being a big fun . It has an inferior and diferent version by Tim Burton with Johnny Depp .",
    "92": "Nice gentle family feature, back in the days when \"HR Pufnstuf\" on TV and \"Bedknobs and Broomsticks\" in the cinema were the heights of children's imagination. Roald Dahl's mild cautionary tale on the pitfalls of consumerism, greed (still relevant today in our mass - advertising, obesity-conscious society) is presented pleasantly for the cinema and has a winning turn at its heart by Gene Wilder. The children can't quite act their lines but the adults support well (with a fair smattering of British comedy staples like Roy Kinnear, Tim Brooke Taylor and others on board). The music is fair, certainly not up to \"Oliver\" standards, with the well-known \"Candy Man\" standing out in a less than brilliant vocal performance by the shopkeeper although, to be fair, none of the lead singers is particularly exceptional. The special effects are okay, fine for the time, a bit dated now especially considering the wonders of Tim Burton's big - budget remake, and not too much of the confectionery looks truly scrumptious, to borrow a phrase, but some of the shots (especially the process shot above the rooftops at the end) are embarrassingly processed. The Oompa Loompahs, I suppose, evoke the Munchkins of Oz but are less characterful and really just act as decoration only. I'm struggling to get away from words like nice, pleasant and I suppose bland - it seems to me, all in all, to be one of those films you remember better from your youth than when seeing it again as an adult.",
    "93": "One of the best films - for children, for adults - ever made. It never panders, it can be quite dark. The wonderful performance of Gene Wilder can boarder, at times, on madness, cruelty, but - even when I was little, I loved this, and, I understood. 'Remember what happens to the man who got everything he wanted? He lived happily eve after...'It's one of the last lines in the film, and while it's spoken to Charlie, it's really about Wonka himself. He found someone - someone he could trust with his secrets. And, Charlie learned that, being honest does pay off.Another line from the film; ''So shines a good deed in a weary world,' which while, originally from Shakespeare's Merchant of Venice, still resounds with much meaning.There are some 'perennials,' in the film, and, this one shines as one that every child, can love, and, grow up, to share with theirs.",
    "94": "It was one of my first movie on Sunday matinee Theatre, I remember quite well, today revisiting this fantasy on Blu-Ray sounds much better even I already pass of the fifty, but somehow it wasn't a sort Disney picture, perhaps to reach to mature audiences as well, when this movie came up many parents criticized Wonka's behavior on umpteen times where the child was sucked by a drain piping, also child inflated a like a blob, a girl has been disappeared on a hole and finally the last one getting smaller inside of TV set, such cruelty wasn't still understood by mostly, however Willy Wonka is an eccentric character at own way, he playing a kind of game where he looking for a prefect child, thus he acted on purpose, an odd fantasy, where everything has a boundary that no one dared to pass, Wonka expose how spoiled kids becomes unbearable quite often, the great lavish sets boosted the picture in another level, countless gadgets, sharp dialogues implies a dual understanding, the casting apart Gene Wilder all others were almost unknown, Charlie (Peter Ostrum) and Veruca (Julie Dawn Cole) were the most interesting and colorful characters, to close the movie had a key scene, when Charlie return the everlasting candy to Wonka, so compelling moment, in fact the producers and the casting speak at bonus material that didn't believe this movie will got such greatness in near future, now we knows why it got large proportion due it was really unique!!Resume:First watch: 1973 / How many: 5 / Source: Theatre-TV-Cable TV-DVD-Blu-Ray / Rating: 10",
    "95": "Roald Dahl's Grimm-like book \"Charlie and the Chocolate Factory\" gets a careful, pointed musical treatment here, involving five Golden Ticket-winning tykes who get to tour a mysterious candy factory--at their own expense. Turns out the journey is a test of their personalities and upbringings, and the film is a little presumptuous to suggest that the poorest kid may be the most noble and honest (as if all rich kids were rotten). The opening moments and TV commentaries on the race to find the tickets are littered with smart satire and a particular kind of dry-ice British humor which may confound kids but should delight grown-ups. Once inside the factory, the film coasts happily along on Gene Wilder's coattails (he's incredibly nutty, occasionally a jerk, but always unpredictable). The screwy Wonkatania boat ride is a highlight, with gross-out flickers on a screen that really are a freak-out. Yes, some of the songs are a drag, but I loved Veruca Salt's number \"I Want It Now!\" (she really wants ten thousand tons of ice cream??); \"The Candy Man\" is a classic and, I may be in the minority here, I thought \"Cheer Up, Charlie\" was a sweet lament. The movie is uneven and a bit grotesque, but it sends kids out on a high and doesn't bore parents, and that's a plus for family films. Critics dismissed it in 1971 (Pauline Kael described it as \"Prussians at play,\" which I'm pretty sure is an insult) and Dahl himself publicly nixed it, but it has bratty kids getting what they deserve, a fabulous looking factory, and wild-eyed, frizzy-haired Wilder at his peak. His performance is like an Everlasting Gobstopper; it will live on and on. ***1/2 from ****",
    "96": "I have seen the remake ages before, and I must say that I do think that the remake does a few things better than this. As for the things that the remake did better, I like the scene in which Charlie insists to share the chocolate because it's his birthday so he can do whatever he wants to, I like the grandpa dance scene better, I like the family backstory with dad losing his job and grandpa being an ex-worker in the factory, I like the dark backstory of Willy Wonka and I guess I like the spoiled kids a lot more in the remake as they felt a bit more realistic and not over-the-top overly-stereotypical as in the original. But even with all these things, the original is still highly superior.I must say that I have a few problems with this film, one being that what the hell was wrong with the beginning. The family barely has any money and the old man wants to quit smoking to save money and lead a healthier lifestyle, yet the family insists on him to keep smoking... Also, I can't believe that Charlie and his grandpa broke the rules during one part of the film especially when before they despited others breaking the rules. Also, the fat kid is not fat enough haha. But that's all I have for the flaws of this otherwise magical film.But now to the good parts. This film has some of the most charming and heartwarming sets I've ever seen, so much colour and so cute. The songs are very good, they're memorable and iconic. Most of the dialogues are very smart, two-sided and meaningful. Humor is truly ahead of its time, still holds up as if the jokes were made today. Acting is phenomenal, especially by Gene Wilder. But most importantly watching it with the theory of Willy Wonka being a serial killer makes this truly an original and thought-provoking film and it seems that all checks out perfectly. All in all I truly enjoyed this magical film.",
    "97": "I think it's pretty safe to say that Willy Wonka and the Chocolate Factory is a timeless classic. Not only does it feature a great plot, fantastic acting and show how movies don't have to be full of computer animation to be good, but it also features some of the best music I have ever heard in a movie.I still remember, almost as clearly as if it were yesterday, the remarkable thing the movie did to me the first time I watched it: It completely changed my mind about musicals! I was about 10 years old when I first sat down and watched the movie. Like a lot of kids, I didn't much care for musical numbers in movies. So when the music for \"Pure Imagination\" started playing, I thought, \"Oh great, a musical number!\" I was just about to press the fast-forward button when Willy Wonka (Gene Wilder) began singing.Within about two seconds, I was completely mesmerized! I didn't think I had ever heard such a beautiful song in my life, nor had I heard too many singing voices that were as beautiful as Willy's. It felt like he was singing that song as much to me as he was to the kids and parents in the movie! That song certainly captured MY imagination, and after hearing it for the first time, I saw musicals in a whole new light.I may be grown now, but I still like the movie every bit as much as I did as a ten-year-old....and I will always have a special spot in my heart for \"Pure Imagination\" the song that convinced me that musicals can be some of the best movies out there!",
    "98": "I thoroughly enjoyed finally seeing this movie in full. I never really saw the whole movie throughout these years, lots of bits but never the full thing. Now my first contact with the story was with the remake. Which isn't great but not terrible either. But this movie is on another level. The level you wish for when putting on a fantasy family film.The musical sections are so well done, I love how they are kept contained and they make them that much more personal when they need to be. Normally I kind of daze off when the musical section gets so big and random folk start to join in, but that's never the case here. The characters are just 10/10 I love all of them. From the annoying to the charming and kind. You simply cannot not find Charlie endearing, and his grandpa just as much. And talking about the musical aspect, the songs here are fantastic and as we have all experienced: so very memorable.The directing is surprisingly fresh, I love the special sections during the Oompa Loompa songs. With the funky text and framing. The directing overall is simply great, something to say coming from a director that had only done documentaries before.Any moment with Wilder is one you want to hold on to and never end. His performance is enchanting and something you keep looking forward to. But it didn't overshadow the others as I enjoyed them just as much.The comedy imo, still works. There's a ton of quick jokes that would fly over a kids head. So there is much to laugh here not just at the slapstick humor that's there for the kids but also the comedy within the dialog.The set design.. I don't think there is much to say other than that it's art. Whilst the Tim Burton remake has this quality as well, the practicality in the original here has that extra something. Even though you could see some of the candy as being red tubing or balloons, for some reason the authenticity is endearing towards the whole movie.Overall I really enjoyed my time with this classic.",
    "99": "This movie is about as good as it gets, barring the tedious first 30 minutes before Gene Wilder comes on screen. But all the better, his entrance is perhaps the most memorable one in cinematic history (yes, better than Orson Welles in \"The Third Man\").Willie Wonka & the Chocolate Factory is NOT a kid's movie. It is saturated with literary allusions (Shakespeare galore), musical references (that was Mozart, not Rachmaninoff!) and a quirky sense of humour that only a mature audience will truly get. For that reason, I can understand why many of the kids today disparage this classic in light of the 2005 version with its CGI special effects and Johnny-the-hottie Depp. But for the purists who enjoy a good, powerful performance without the fluff, this is the film for you.What amazes me about this film is that it is really quite dark and cynical, despite its colorful and upbeat appearance. The candy man Willie Wonka is at times a malevolent and frightening presence with a jaded, almost hopeless view of life. But despite it all, he makes us laugh uncontrollably and sing along and revisit our childhood as only an madman can. Whether this was in the original screenplay or whether it was Gene Wilder's own tinting I don't know, although I suspect the latter. For that reason I'm sure it deviates significantly from the theme of the original children's book. But I wouldn't have it any other way.",
    "100": "To me this is arguably Gene Wilder's best role. Of all the stuff I've seen him in this is the most indelible performance and character he performed and created for the silver screen. I hope I don't sound like I'm fawning, but the sarcastic quips and baiting he provide in his Wonka character are exacting and just simply laugh-out-loud hilarious.To me this is one of the last of the great non-Disney children's films. Made in a day and age when process shots were expensive and hard to produce, Willy Wonka & the Chocolate Factory rely on the musical trend of the time, but do so successfully I think. So much that I think modern contemporary audiences, most of whom disdain the musical genre, will go along with the numbers as part of the narrative, and not as something meant to draw attention to themselves for the sake of adornment.Even in my middle age I am delighted by this film, and even though I knew the film backwards and forwards like a lot of other adults who saw this film when it first premiered on the big screen in 1971, I still felt a thrill when Charlie has his big moment of luck. I felt like a boy all over again. And when Willy Wonka makes his smiling remarks to the various comments and actions made by his guests touring his establishment, I simply could not hold back my laughter.Even as a teen and 20-something when I saw this film I smiled at both the story and the Wonka character, as well as at Charlie and his family.To me Willy Wonka was made in a time when there was still a kind of understood (all be it tacit) \"respect\" for the spirit of the ever so repressive rules of the former Hayes' office that had clamped down on a lot of perceived \"immorality\" portrayed in films. Nobody wants to take their kid to a film with a lot of sex and explicit gory violence. And where everyone has a kind of innate understanding of what is proper and improper, to me Willy Wonka has that kind of essence of truly making a family film, or a G-rated film that can be enjoyed by everyone.The script is intelligent and witty, the child actors are truly marvelous in this, and the leads and supporting cast do their usual exceptional bang up job. And the music isn't half bad either.Colorful, a bit slower paced in terms of editing, but no less full of zest for modern conventional story telling style, Willy Wonka is the kind of film they don't make anymore but should. And kudos to the entire cast, and in particular Gene Wilder for giving us the sly eccentric genius whose quest for character is fulfilled superbly.A great film. Get a copy or stream it for yourself, or with those you love.Enjoy.",
    "101": "This film is 100% pure theatrical magic. SKIP THE REMAKE. In this version a few minor changes were made from the book but all films do this that are based on books. In case you did not know the story here it goes. Willy Wonka in this film is an unknown man who makes the worlds best candy and of course chocolate. Nobody knows how he makes such wonder candy. As Grandpa Joe tells Charlie: Nobody comes in and nobody comes out. Then one day there is a worldwide announcement. Willy Wonka is having a contest and 5 lucky people will get to tour the factory if they land a golden ticket which is inside his candy bars! Charlie is very curios about the factory and would love to go but his family is very poor and can afford to buy many candy bars but luck seems to be on Charlie's side. The only 2 films that I can think of that are more magical than this is \"The Wizard of Oz\" and \"Mary Poppins\". Again avoid the soulless remake! This film sparkles!",
    "102": "Reclusive Willy Wonka (Gene Wilder) is opening his factory after years of secrecy. It's been a long time since he has used people as workers. Nobody ever goes in and nobody ever comes out of his factory. Then he announces that five golden tickets found in Wonka bars will grant five lucky children and their guardians a tour of the factory. Charlie is a poor boy living in the shadows of the factory. He is lucky to enough to find the final ticket. He brings his grandpa along as each child succumbs to some mishap. They are introduce to wild candy magic and the Oompa-Loompas.This is one of the weirdest and yet mostly fun ride. Gene Wilder is pitch perfect as the outlandish master of ceremony of this unique three ring circus. It has one of the most unique vision. Nothing is crazier than the Oompa-Loompas. The funnier thing about them is that they're not necessary cute. There is something disturbing about them. That goes for the factory in general. There seems to be some danger and magical about everything. It is just pure movie magic.",
    "103": "Pure magic film in the first shot version of the attractively eccentric Roal Dahl novella , whose storyline written by Roald himself . Stars the great Gene Wilder as the charmingly devious Willy Wonka , the factory's bizarre owner . As Gene Wilder organizes a lottery to participate a tour throughout his factory operating behind locked gates, like a hostle Xanadu . As the factory contains extaordinary landscapes , whole location is full of candy striped trees , rivers of chocolate negotiable by gondola, and sinister caverns manned by orange-faced dwarfs . Five kiddies and their parents are prized to carry out a colorful tour of the factory , and several of them destined for appallingly appropriate fates . As a few of his guests of this tale, four greedy companions are stickly fingers , pun intented, and suffer the consequences . As some children disappear to suffer torments of their own devising .This is a a Grimm-style moral story which has real and true magic touch of fantasy . Slow to beggining , but once the youthful little hero and his grandfather arrive for the prize tour of the mysterious and surprising chocolate factory the movie really takes off . Gene Wilder is oustanding playing a chocolate company owner who choses some lucky children and their parents to a tour across the facility . This essentially amusing and entertaining film has a lot of memorable and enjoyable moments . Packing surprising and stunning Heath-Robinson type settings in the wonderful chocolate factory . Marvelous and catching dances and songs , in fact there are foot tapping songs ,most of them sung and danced by sympathetic midgets . The agreeable and catching songs were stunningly composed by Anthony Newly and Leslie Bricusse .Along with the extraordinary Gene Wilder for once delivering an impecable controlled acting , here appears as starring the likable kid Peter Ostrum of short career , the veteran Jack Albertson who had a long career and likable secondaries such as : Roy Kinnear , Gunter Meisner, Audrey Woods , Michael Bollner, among others . It packs a colorful and glamoroos cinematography by Arthur Ibbetson. The motion picture lavishly produced by David L Wolper , was competently directed by Mel Stuart , that is -nowadays- considered to be a real Cult Movie . Rating : Above average, being a big fun . It has an inferior and diferent version by Tim Burton with Johnny Depp .",
    "104": "Nice gentle family feature, back in the days when \"HR Pufnstuf\" on TV and \"Bedknobs and Broomsticks\" in the cinema were the heights of children's imagination. Roald Dahl's mild cautionary tale on the pitfalls of consumerism, greed (still relevant today in our mass - advertising, obesity-conscious society) is presented pleasantly for the cinema and has a winning turn at its heart by Gene Wilder. The children can't quite act their lines but the adults support well (with a fair smattering of British comedy staples like Roy Kinnear, Tim Brooke Taylor and others on board). The music is fair, certainly not up to \"Oliver\" standards, with the well-known \"Candy Man\" standing out in a less than brilliant vocal performance by the shopkeeper although, to be fair, none of the lead singers is particularly exceptional. The special effects are okay, fine for the time, a bit dated now especially considering the wonders of Tim Burton's big - budget remake, and not too much of the confectionery looks truly scrumptious, to borrow a phrase, but some of the shots (especially the process shot above the rooftops at the end) are embarrassingly processed. The Oompa Loompahs, I suppose, evoke the Munchkins of Oz but are less characterful and really just act as decoration only. I'm struggling to get away from words like nice, pleasant and I suppose bland - it seems to me, all in all, to be one of those films you remember better from your youth than when seeing it again as an adult.",
    "105": "Wonderful, surreal movie.Adapted from the Roald Dahl book, with screenplay by Dahl himself. A boy, Charlie Bucket, lives in semi-poverty with his mother and four grandparents. One day, Willy Wonka, a reclusive confectionery magnate, announces that five lucky people will get to tour his chocolate factory, and receive chocolate from his company for the rest of their lives. To win the tour, you have to find a golden ticket inside your Wonka chocolate wrapper...Sweet, wonderful, imaginative movie with some great moral themes. Good fun for all ages with some subtle yet great profundities and some quite moving moments too. Quite funny at times as well.Good special effects, especially for 1971. The effects and sets do great credit to Dahl's imagination.The creative plot, clever dialogue and great special effects are aided by an excellent performance by Gene Wilder as Willy Wonka. Quite spellbinding in his delivery. Good support by Peter Ostrum (as Charlie), Jack Albertson (as Grandpa Joe) and many others.",
    "106": "Willy Wonka & The Chocolate Factory (1971) is a movie in my DVD collection that I recently rewatched with my daughter on HBOMAX. The storyline follows an infamous chocolate factory that has been closed to the public for some time. One inauspicious day an announcement is released that five lucky children will be allowed to visit the factory with one lucky winner receiving a special prize. The five children will be determined by their ability to find golden tickets distributed within chocolate bars that have been sent all over the world.This movie is directed by Mel Stuart (The White Lion) and stars Gene Wilder (Young Frankenstein), Jack Albertson (The Poseidon Adventure), Peter Ostrum, Michael Bollner, Roy Kinnear (Scrooge), Julie Dawn Cole (Poldark) and Denise Nickerson (Smile).This movie is an all time cinematic gem. The storyline is unique, magical and breathtaking. The settings, plots and subplots are very well portrayed and told. They do a great job of exaggerating the situations to draw in the audience. The characters are perfectly portrayed and were well cast and Wilder is out of this world as Willy Wonka. The factory really captures the imagination and makes you wish you were there. The soundtrack and music numbers are brilliant and portray the lessons perfectly.There's nothing I would change about this masterpiece. It's a perfect family film that is a must see and own. I would score this a perfect 10/10 and strongly recommend it.",
    "107": "After all these years, I feel that this movie still hasn't lost any of its charm or power. It's one that should really speak to every kid's imagination and to those who still have a little child hidden somewhere inside of them. And isn't that basically being everybody on this world? I absolutely still have some problems with this movie but I feel that none of this makes this movie any less of a great and fun experience. In essence it's being a very simple and straightforward movie, in which just a whole bunch of random insane and wonderful stuff happens, the moment they step into Willy Wonka's factory. This is a movie that doesn't need to explain anything. It can let things simply happen and it shows that fantasy has no limitations. You could wish whatever you want from and sometimes dreams come true, as happens to little Charlie in this movie.It's a wonderful, imaginative, fantasy movie, that besides is a great looking one. It has wonderful visuals and colors in it and most importantly, it doesn't look fake! It all looks as if it could be part of the real world and it looks as if every machine really works and all the candy is eatable and tastes wonderful as well.It really looks like Gene Wilder had a great time playing his role. He goes all out, without coming across as insane. It probably is a more subtle performance than most people give him credit for. He is a great comedy character, who besides is capable of placing himself in a kid's world and their fantasy. This doesn't feel like a movie written and made by adults for kids but more like one that in fact got made by kids.It's definitely thanks to Roald Dahl's writing, who of course also wrote the book this movie was based on, that this movie comes to life. He manages to put really a lot into the movie its characters and overall atmosphere. It besides provides the movie with some absolutely great dialog and at time it wants to make you rewind the movie, just to check if you really heard things right. But as I said before, it's being still far from a perfect movie, for me. I have always felt and thought that the beginning of the movie goes on for a bit too long and might be a bit too boring, for young kids especially. I also always thought it was strange that the movie never showed what happened to all of the other kids and what happened to Charlie and his family. The ending feels a bit too rushed and also comes far too sudden. There is no real good buildup to it and it might even be a bit confusing to those who aren't familiar with the book.But despite of all these minor issues, this movie remains a perfectly watchable and fun movie to watch for children and those who still are in touch with their inner child, or have a rich imagination.8/10 http://bobafett1138.blogspot.com/",
    "108": "Willy Wonka is not a nice man. Yet, somehow, you can't help but like him, at least as he's played by Gene Wilder in \"Willy Wonka and the Chocolate Factory,\" the semi-psychedelic, and \"psychotronic,\" 1971 version of Roald Dahl's classic children's novel. Wonka is aloof, sardonic, sarcastic, mysterious, manipulative, and devious--a leprechaun with a hyperactive thyroid and an edge. But, as Wilder plays him, you sense the sweetness behind the wild gleam in his eyes; he's really hoping that one of the five children he's invited to tour his chocolate factory will be a worthy heir to the world of his imagination.Yes, Wonka is a cynic and a misanthrope. (What else could he be after sequestering himself in his own little world for years on end?) But he wants to believe that there is still some good to be found in a \"weary world.\" Wilder captures Dahl's creation perfectly.The rest of the cast is perfect, too, and they make the most of Dahl's often witty script. Peter Ostrom, in particular, is excellent as Charlie.Yet, this minor classic of a movie has its flaws. The production design suffers from a lack of budget. Wonka's \"Chocolate Room\" looks like an elaborate mini-golf course, with a dirty river running through it, in a brick warehouse. The \"Inventing Room\" is meant to be a whimsical, magical laboratory, but comes off more like an especially elaborate hideout for the Joker on the old \"Batman\" TV series. The songs range from reasonably good (Veruca Salt's ode to brattiness \"I Want the Whole World\") to saccharine (\"The Candy Man\") to downright wretched (the Oompa-Loompa oeuvre entire, with lousy choreography to match). Wilder's rendition of \"Pure Imgaination,\" an overly sugary confection that could induce diabetic comas in the wrong hands, works thanks to the faraway look in his eyes; he makes it magical. The make up and costumes of the Oompa-Loompas (Wonka's workers), on the other hand, are simply embarrassing.Yet despite these flaws, \"Willy Wonka and the Chocolate Factory\" is hugely entertaining and probably the best family film of the 1970s. Think of it this way: \"Willy Wonka\" is to Burton's \"Charlie and the Chocolate Factory\" as the \"Batman\" TV series (from the 1960s) is to Burton's \"Batman.\" Both are different, entirely valid takes on the same source material. Both are worth watching.",
    "109": "Watching this movie as a kid, \"Willy Wonka the Chocolate Factory\" works great on whimsy alone; the technicolor factory, eccentric candymaker, people merrily bursting into song. But as an adult, it's surprisingly creepy. And that's not just the Oompah Loompahs; there's a subtle malevolence to Wonka himself, and that really adds a new dimension to the movie. Clearly, I'm not the only one who wanted Veruca to suffer a miserable fate, right? The songs are good and the message of honesty still rings true today, but the movie really belongs to Gene Wilder. He was a real showman in the role, and his comic timing is a huge reason why the movie is so enjoyable after so many years. I don't usually watch a movie in memory of the deceased, and in this case, it just seemed like the right time to revisit this one. Even so, R.I.P. Mr. Wilder.8/10",
    "110": "A delicious film - a tasty treat for all that watch! A fun-filled family fantasy classic. When I think of this original version of the film, I think of lollipops, gumdrops and chocolate! Lots of chocolate.This movie is great fun for all ages and should not be missed by anyone who considers themselves any sort of a movie buff.This part seemed to fit Gene Wilder very well. He's always been great at odd-ball comedies and why should this film be any different?! Willy Wonka's humor is a bit strange as he is.The musical numbers are cute even if the songs are not so great.This is another film I grew up with. And, even though it's an older film, it's still a film I think the very young kids today would enjoy.10/10",
    "111": "There have been many movie adaptations of the great Welsh children's author Roald Dahl, to various degrees of success. I used to love his books as a youth, relishing the dark twists and the playful, if somewhat dark, humour. Yet even the best adaptations didn't really capture the sinister themes behind the best of Dahl's works, but that was up until I saw this, Mel Stuart's adaptation of Charlie and the Chocolate Factory, one of Dahl's most popular works. As well as being often psychedelic, it is Gene Wilder's wild yet subtle portrayal of the unpredictable and possibly quite evil Willy Wonka that truly captures Dahl's essence.Poverty-stricken Charlie Bucket (Peter Ostrum) lives in a cramped house with his mother and the bed-ridden Grandpa Joe (Jack Albertson). The news announces that the reclusive Willy Wonka of Wonka's chocolate company is offering a once-in-a-lifetime opportunity for five lucky children to come and see his world-famous factory. Five golden tickets have been placed in Wonka Bars throughout the world, and Charlie, finding the fifth and final ticket, arrives with Grandpa Joe along with fellow winners Veruca Salt (Julie Dawn Cole), Violet Beauregarde (Denise Nickerson), Mike Teevee (Paris Themmen) and Augustus Gloop (Michael Bollner) to meet the eccentric inventor.This is one of those popular films that everyone had seemed to seen apart from me, so I was expecting a familiar family film full of catchy songs and annoying freckly kids. The songs, apart from the famous 'Pure Imagination', are somewhat forgettable, but I was surprised by the effective performance from the children, and the sheer darkness of the film. Apart from the various disappearances of the increasingly bratty, greedy and ungrateful children (who aren't actual seen again), the boat ride that Wonka takes his party on is particularly unnerving. There are bright, flashing lights, strange music, and various disturbing imagery (including a chicken being decapitated) that infest the screen, making me wonder if I was in fact watching a children's movie, or some f****d- up acid trip from the 70's.Gene Wilder has made many films that portray his energy and comedic ability that often borders on genius, but he blew me away as Wonka. From his entrance, shuffling along on his cane only to do a somersault in front of the awe-struck crowd, to his furious outburst at the climax, makes Wonka an almost threatening presence, never allowing us to feel completely comfortable when he's on screen. He's ultimately a misanthrope, with only a glimmer of hope that one of the children he's welcomed to his home is truly worthy of inheriting his life's work, using subtle glances or whispers of poetry to merely hint at his true personality. Along with the beautiful sets and solid supporting cast, Willy Wonka was a complete surprise, and surely the best Dahl adaptation that's yet to grace the screen.www.the-wrath-of-blog.blogspot.com",
    "112": "This is another classic film from my childhood. Adapted from the book \"Charlie & The Chocolate Factory\" by Ronald Dahl, this is a nice musical for its time, as it tells the tale of Charlie Bucket, who finds a golden ticket which invites him to tour the factory of Willy Wonka. Taking his Grandpa Joe, he is in for the adventure of a lifetime as the tour takes him and four other kids to some wacky and imaginative areas.Yeah, it is weird, but it a legendary film. However, Ronald Dahl would disown this due to the changes Warner Bros. would make to the story (resulting in the studio being banned from making a sequel). including making Slugworth a villain, and the many songs added in. IMHO, I prefer this over the 2005 remake (which was more accurate). The songs (especially the Oompa Loompa songs) are memorable, Gene Wilder does a good job as Willy Wonka, and when we get to the chocolate factory tour that makes up the second half of the film, a lot of the sets are well done (especially the chocolate room), proving that movies can be creative in a time without computer animation. I recommend this in anyone's film library.",
    "113": "No matter how many times I have watched this tape, I love it more and more.Except the Oompa Loompas.I have nothing against little people, but the Oompa Loompas always creep me out, with their weird looks and bursting into song (Oompa Loompa doompade doo/I've got another puzzle for you), just creep me out!Otherwise, I like the film (I never read the book, but I've heard that it doesn't stick too close to it). The kids (Charlie excluded), are the most obnoxious bunch on the face of the planet (I've always wanted to slap Veruca Salt in the face!). Charlie is your typical poor-boy-with-a-good-heart (And wonderfully played by Peter Ostrum), with a mother and grandparents. Winner of a golden ticket along with 4 other kids, he gets to go on a magical tour of Willie Wonka's Chocolate Factory. Wonka (Gene Wilder, who seems to enjoy torturing the kids).The film still holds up over 30 years later and I still love the ending.But still...Those DAMN OOMPA LOOMPAS!!!!",
    "114": "Pure imagination. Every moment in Willy Wonka's chocolate factory was enchanting and wonderful (even the creepy boat ride). Gene Wilder was perfectly cast as the candy man and is the main reason that this film is regarded as a classic. Watching it back, I was surprised at how long it took to finally meet Wonka and enter his factory - nearly 45 minutes! While the moments leading up to October 1st at 10:00am added character depth and motivation, I found myself impatiently waiting for the real adventure to begin.Once in the factory, I couldn't take my eyes off the screen. As the guests meandered through the marvelous world of Wonka's chocolate factory, the absurdities became marvels and I instantly trusted in Wonka's all-knowing behavior. Even when child after child fell by the wayside, it's Wonka's careless, yet confident control of each situation that makes you forget the severity of the situation. With a strong message of the consequences of misbehaving, the real essence of this film is in the limitless possibilities of imagination. Largely driven by Wilder's charming performance, Willy Wonka and the Chocolate Factory is escapism at its finest.",
    "115": "Willy Wonka has long since locked his factory doors and operates in seclusion to produce wonderful chocolate without the risk of industrial spies.  However he decides to open his factory doors to 5 lucky people who can find the golden tickets hidden in 5 of his bars.  Charlie is a poor, honest kid who longs for the chance.  When he finds a ticket he and 4 other children from around the world get the chance to enter the weird world of chocolate production with their guide, Willy Wonka himself.Based on the Roald Dahl book `Charlie and the Chocolate Factory' this film is a wonderful little piece of imagination and whimsy.  It is fun to watch for adults and children mainly because of it's endless imagination  it simply doesn't draw the line at anything, it is colourful bright and fantastic.  The film has plenty of jokes that only adults will get but also much for kids to appreciate  I know that is the norm nowadays in kids films but remember this was 1971!As implied in the title, the film takes the focus off Charlie and puts it on Wonka himself.  This is good because Charlie, bless him, is quite a dry little so and so!  Putting the focus on Wonka is a good move and doesn't stop at the title  Wonka is the sole of the film and much of the humour comes from him.  Wilder is the only choice for the role and he pitches it perfectly, being understated and not going over the top at any real point. His dry style of humour is used well and he is as flamboyant and unusual as his surroundings.  Albertson is good as Joe and Kinnear is recognisable as Salt.  Overall the child actors all do good work being as horrible as their characters require.  I felt like Ostrum got the short straw as his character is far too moral to be of great interest, I felt like I was only rooting for him because the rest were so horrid.Some of the music is quite poor.  No, scratch that, the majority of the songs are poor or just lack lustre.  None of them are really catchy or funny and none are that well choreographed.  Only the Ompah-Lumpah song really catches my ear. It's a shame because the songs near the mid point really serve to slow the film down a bit.  However despite this I still found it fun to watch.Over 30 years old and this is still a lot more fun than the CGI filled, soulless live-action kids films that seem to be doing the rounds of late (yes Harry Potter I'm looking at you).",
    "116": "There are not enough words to describe this masterpiece of a movie! This is a film that touches the heart and soars the spirit to a time when political correctness was unheard of. It was a time where you could experience the remarkable joys and test the temptations of childhood with valuable lessons to be learned. However, at no time does this film \"preach\" anything.The acting, music, set-designs, and songs, will dazzle YOUR imagination time and time again! I have seen this remarkable film so many times, However, every time I see it again, I learn something new from the movie! There are not many other films made today that can say that.Willy Wonka and the Chocolate Factory is to be preserved and cherished for all generations! Like fine wine, this masterpiece only IMPROVES with age. Gene Wilder is pure gold! Watch and listen to his mannerisms as he interacts with the children and their parents. He delivers some of the funniest and most memorable sayings that YOU the viewer will remember for the rest of your life! The ending gives me chills and moves me to tears every time! If it doesn't for you, check to see if your heart's still there.An absolute triumph for all involved! And to anyone connected to this film who is still around and may read this review, just let me say: Thank you for this landmark film!",
    "117": "Fantasy sparks imagination, and in a film like \"Willy Wonka and the Chocolate Factory,\" that's probably a good thing, because applying any sense of logic to this story will give you a brain tumor.The film centers around a small, poor, basically-homeless boy named Charlie. In his world, there is a chocolate company named Willy Wonka (which now does exist because of this movie), owned by a mysterious man with the same name: Willy Wonka (Gene Wilder). Wonka has started a worldwide phenomenon as he states that he has put five gold tickets in candy bars around the world. When all five are found, he will invite all the ticket holders into his mysterious candy factory, and show them his wonderful world, filled with a room made completely of candy, and Umpah Lumpahs, little short orange men with green hair.But Mr. Slugworth, who owns Slugworth Candy, wants to put a stop to Wonka's newest creation: The Everlasting Gobstopper (which is now made by Willy Wonka chocolate). After each ticket is found, he visits the ticket holders and tells them who he is, and that he wants them to bring (steal) back the Everlasting Gobstopper so he can study it and beat Wonka at his own game.So as Charlie finds a gold ticket and goes to Wonka's chocolate factory with his grandfather, he is tempted to steal one of the gobstoppers, but will he do it?I didn't always like this movie very much. I always liked the scene with the edible room and the Umpah Lumpahs, but everything else seemed odd and slow-moving to a certain degree. It's like taking Lewis Carroll and putting him in a room with Gene Wilder. That's what you get out of author Rohald Dahl's book, and the same can be said for the film. It has an odd sense of reality and twisted sense of humor.For example, all the children get whisked away one by one. For being a childrens' movie, this is quite odd, because I do not often see children being taken off screen like they are dead, especially in a childrens' story. One boy gets sucked through a tube of chocolate, to go into the boiling room; one girl turns into a giant balloon, and one boy gets transported into a television and can't get back out. All interesting but nevertheless deeply strange scenes.Gene Wilder was the perfect choice for the strange Willy Wonka--he fits him like a glove. Wilder doesn't seem to appear in films much anymore, but I guess he ended on a high note. \"The Producers,\" \"Young Frankenstein,\" and \"Willy Wonka and the Chocolate Factory\" all on his resume, I'd say he has quite a good one. I looked at his most recent films, and in 1999 he appeared in and wrote a made-for-TV film; after that he hasn't really been in much. I guess that's because he sensed the bad films coming and wanted out before he started appearing in more TV movies.But anyway, Wilder is perfect. He seems to state the odd as if there is nothing odd about it. I love the scene where he talks about the Umpah Lumpahs and where they live, and the geography teacher in the room says, \"I'm a geography teacher, and\"--he cuts her off, saying, \"Oh, good, then you know all about the bad place? Why, the [somethings] would eat ten Umpah Loompahs a day and think nothing of it!\"His tale is odd, yet strangely entertaining.I've never really been one for tales of oddness. I like \"Alice in Wonderland,\" but even that is a bit too odd for my taste. I seem to like realistic films (well, at least films that take place in our world). I like comedies, action, drama, sci-fi--the works; but I've never been one for fantasies.But if one film has ever sparked imagination, nothing has as much as \"Willy Wonka and the Chocolate Factory.\"3.5/5 stars - maybe 4 -",
    "118": "Apparently, there is no category in the Academy Awards for unusual or extraordinary sets. If there were, \"Willy Wonka & the Chocolate Factory\" would have walked away with that Oscar in 1971. The set for this movie – once inside the chocolate factory, is exceptional, and at least half the draw and appeal of this movie. It is a delight to behold for young and old. This film is cause for one to marvel at the Hollywood designers, tradesmen and craft people for such splendid work. That said, the story is a nice fairy tale, but with live action all the way. Gene Wilder is very good as Willy Wonka, but this entire cast performed well, down to the most obnoxious child. One especially has to like Jack Albertson as Grandpa Joe, and Peter Ostrum as Charlie. This was Ostrum's only movie. Not bad for a child star's single performance in a leading role. Ostrum was offered a three-film contract, but turned it down. He says that although he enjoyed acting and studied it for some time, his parents weren't stage people. Instead, he went on to earn a PhD in animal husbandry from Cornell University and practice veterinary medicine for large farm animals in outstate New York. I wonder if Paramount received any negative feedback for how it portrayed a couple of the children – namely the German boy, Augustus Gloop, and the French girl, Violet Beauregarde. I doubt that any Americans would have complained at the portrayal of the two sassy, snotty, spoiled and nasty kids. Most of us have seen a Mike Teevee and a Veruca Salt more than once. But the actors who played those parts, as well as those of their parents, were very good. One wonders, though, if it was much a stretch in a couple instances. It's interesting that none of the child actors in this film made acting their career. Only one had more than a few films. This is a fun film, although with some dark overtones for kids.",
    "119": "Now before we start, I want to make one thing perfectly clear. I love this movie, I love it, this is one of the films I watched all the time as a kid. It was great when I was a kid, and it's still great now. However, this movie could be one of the weakest book to film adaptations ever made. Granted I haven't read every book and read every movie, but I have read the book \"Charlie and the Chocolate Factory,\" and yes it does have the same plot and moral, but there are so many changes made.OK, the reason I love this film is because of a few things. The actors are great, every child fits the role perfectly. And Gene Wilder IS Willy Wonka. The songs are super catchy, and the special effects are outstanding. This film is over forty years old, and it still looks good. And it has a great sense of imagination, always being creative with the names of the candies.However it doesn't work well as an adaptation, they were squirrels in the book, the Slugworth guy was only in a short sentence, they used a glass elevator right after veruca. The Wonka Wash didn't exist. They were allowed to bring two guests. Charlie's dad wasn't dead. And they added songs for no reason.Remember, I love this movie, it's one of my most nostalgic movies, but it isn't that great of an adaptation. If you want a closer version to the book, watch Charlie and the Chocolate Factory. But I do recommend this movie.",
    "120": "Roald Dahl's classic \"Charlie and the Chocolate factory\" has always been one of my favorite readings. I discovered the book in my high school's library, and naturally, I couldn't resist to a story with such an evocative title. And on a yummy level, I wasn't disappointed, the descriptions of the many tastes, whether the Wonka bars or other candies, had the same effect than a Kinder ad.Another aspect of the novel captivated me: the characters, from the description of the Bucket family, with the four grandparents sharing the same bed, the whole suspense built upon the five golden tickets contests and the four little brats who found the first, a whole universe was immortalized in my mind, and I got to hand it to Dahl for having imagined so many colorful characters, much more with the guts to portray kids in such a negative and provocative light. Which leads me to the factory visit and its dark undertones through the fate that awaited the four participants: the gluttonous Augustus Gloop, the competitive Violet Beauregard, the capricious Veruca Salt and the TV-addict Mike Teavee. We already knew kids could be cruel but I defy anyone to find a book where children get such cruel punishments.As a kid, I could easily relate to the story and it didn't bother me much that the kids would get their comeuppance, as an adult and while I enjoyed the reading three of four times more, I realized how subtly subversive the story was, and perhaps this is the greatest compliment you can give to a children's book: finding the perfect mixture between the joy and nastiness inherent to childhood, something kids can understand, and adults too. The Oompa-Loompas are a perfect example as they clearly reflect this ambivalence: while they are exotic and peculiar enough to appeal to children's imagination and their natural craving for adventures, they're also spooky and can easily pass as a miniature and collective version of the bogeyman. Still, the book cleverly focuses on an adorable kid who sets a positive example to better highlight the other kids' flaws, but he's not a one-dimensional character either, although the two films didn't give him much depth and substance.Indeed, the choice of Mel Stuart was to focus on Willy Wonka rather than Charlie. If the choice is debatable, it shouldn't overlook how a fantastic challenge adapting \"Charlie and the Chocolate Factory\" was, in the way it restored the magic and fairy-tale atmosphere of the chocolate factory. It was also a risky project, if ever the screenwriters were tempted, no pun intended, to sugarcoat the story. Tim Burton's adaptation probably suffered from the opposite criticism as it portrayed Wonka as a kind of creepy and too enigmatic character, but the recreation of the factory, but all the technology available in the 2000's redeemed these little imperfections. While I deplored the focus on Wonka's background and the Oedipal back-story that distracted us from the real character: Charlie or the real star: chocolate, I expected the original film to be more faithful to the book, and maybe, more politically correct.But the 1971 version was quite astonishing. Granted the effects are not as dazzling as the remake, they still work and even restore a magic that was only prevailing in Disney animated movies. But the film, in itself, is a glorious achievement in the same vein that the inevitable: \"Wizard of Oz\". The journey of Charlie and Grandpa Joe, played by a convincing Jack Albertson echoes Dorothy's adventure in Oz, the 30's had the Munchkins, the 70's the Oompa-Lommpas. The film is not flawless, the songs are not as memorable as the 1939 MGM classic, except for the unforgettable \"Candy Man\", Peter Ostrum is no Judy Garland, but \"Willy Wonka\" works a wonderful tribute to Hollywood Golden Age, surprisingly effective in 1971, at the peak of the more realistic and cynical Hollywood New wave  or maybe this 'cynicism' was already embodied by Wonka's eccentric and bizarre personality, as described in the book.Naturally, the casting of Wonka was the hit-or-miss element, any kid with innocent-looking eyes and rosy cheeks could have played Charlie, given the relatively small role he has in the film. It's a choice that was criticized by the author himself but since Wonka was the pillar of the film, the studios had to come up with the perfect actor. Personally, when I read the book, I imagined Wonka as an eccentric man, wearing bright colors and sophisticated, elegant, charming but very secret, hiding in his heart a much darker soul. When I saw Wilder, I thought in myself, now that was the Willy Wonka I imagined. Loony and funny enough to make a positive impression... soon to be contradicted during the factory tour, Depp gave away that impression from the very beginning, Wilder maintained the perfect level of mystery and carried the whole film thanks to his magnificent performance.I'm sorry to fill this review with references to the remake but it's only to highlight my appreciation of the 1971 version. I was perplex regarding some deviations from the book, the global craze surrounding the contest was an inspiration for hilarious gags, but I could have done without the floating, elevating and belching part. Speaking of that moment, there's no doubt that it's Gene Wilder's performance that elevates the film, as soon as he enters, the story truly picks up and we know we're into something that would be a delightful for our eyes, and our senses, and respecting our intelligence, as kids and adults.Now, which version I prefer? 2005 or 1971? Well, let's just say I still prefer the book.",
    "121": "I feel like I'm dreaming each time I watch this movie. It's one of my favorites and has meant a lot to me in my life.Definitely one of a kind, due to it's adamant surrealism, it appeals to both kids and adults.The elusive Wonka chocolate factory is holding a worldwide contest so that 5 lucky winners can finally get a glimpse inside the factory walls and win a lifetime supply of chocolate.It's supposed to take place in America, but maintains an industrial European feel. Charlie Bucket, our protagonist, lives with his mother and 4 grandparents. They're very poor, and rely on Charlie's paper route money to get by. Which is why Charlie wants, more than anything, to win this contest.Anyone who's ever known they wanted something more than anyone else in the world can relate to Charlie's childlike desire to win Wonka's contest. It may seem frivolous, but that only highlights Charlie's desperation. He can only imagine luxurious things. And that ingenuous mindset is what just may give him what he needs.The film enraptures you within the first 35 minutes, before we even get inside the magical factory. And once we're in, the film ascends to a whole new level. So full of unique ideas and concepts. Set pieces that made people depressed about the movie's fictionality long before Avatar's ever did.And Willy Wonka, himself, portrayed by Gene Wilder, is a marvel. No other man could have given us such a brilliant performance. He's sweet, he's creepy, he's sincere, and he's mischievous. Roald Dahl's original 1964 novel could be adapted for film one thousand times over, yet Wilder will always remain exclusively synonymous with the role.Oh yeah, and the music is phenomenally perfect.For being a \"flop\" from 1971, this film holds up better than most, if not all, of its contemporaries.Twizard Rating: 100",
    "122": "Roald Dahl is one of my favorite fantasy writers because what I loved about his stories was how he brought fairy tales to our modern era and existence, which to me showed that fantasy stories don't have to just be confined to the medieval era but can be in our time frame. Which also further show that in the fantasy genre anything truly is possible and anything can go. This film is another one of my favorite fantasy films of all time and it's also another childhood relic, I've seen this film when I was about seven.I really love the production value, everything is practical they successfully create a great look of the factory, the factory is sort of like the Tardis in \"Doctor Who\" it's literally a hidden world where you see all sorts of things from the Candy Land which as a kid I wanted to go to because I wanted to chomp on most of that candy. Down to the machines that look like something out of Rub Goldburg cartoons, my favorite machine is that gum machine, which is strange from what it has like crushing tomatoes and a bee hive. The writing is excellent, the dialog is just clever and at times really funny, there are so many memorable lines that it would take more than one watch to hear and get them all.Though like in Brothers Grimm fashion the film can also be kinda dark and a bit scary. From each of the life and death situations the kids stupidly get themselves into. Down to that infamous boat ride from hell scene, that scene is one of the most bizarre and scariest scene I've ever seen really scared me when I was a kid. It's like some trippy experimental film that some doped up film student cooked up as you are just seeing random nasty images.The music is great as there are plenty of memorable songs. Two of my favorites are of course Pure Imagination sung beautifully by Gene Wilder. And my second one is \"I Want it Now\", that song is just fun and really hilarious as the song is the expression of the epitome of Veruka's greed and vanity.The characters are great, really like protagonist Charlie whom is the everyday kid you've probably passed by or were. He's good natured, never selfish he's selfless as he loves his family and does his best to help them out. He's sympathetic as he really has not much to anything going for his life. I wouldn't say he's so much a kid with dreams but more like a kid whom is looking for something great in life, a chance to taste it may'be be part of it.I really like how you see a parallel contrast between him and the rest of the kids in the group. All of the other kids have been in rich or high class existences which means they had practically every advantage in life but as we see have turned out kinda rotten. Where we see Charlie he's lived on the low end of things but he turned out to be alright as he's smart and kind. It just shows that just because you grew up on the wrong side of the tracks doesn't mean a person will turn out bad; and just because someone grew up on the right side doesn't always mean they'll be good.Veruka Salt she is a kid you just love to dislike. To me she is just the absolute worst of the bunch because she is just spoiled rotten to the core. Her constant bad case of the gimmies can make you both laugh and grown at the same time. But seeing her just goes to show that giving your kid everything he or she asks for is bad parenting at best because your teaching your kid a bad lesson that they get everything handed to them. As Lincoln Hawk once said \"Life don't go one way for nobody\", Veruka is going to learn that saying the hard way.And of course my favorite character is Willy Wonka played by one of my favorite comedic actors Gene Wilder. This is my favorite role from him, he has some of the best lines ever but he just has just this great amount of energy both physically and comedically, to me Gene really is Willy Wonka. In a way he's kinda like \"Doctor Who\" as his character has this three dimensional enigmatic quality to him. At times he can be truthful but then he's not, he can also flip on his persona. There's a bit of a good back and forth between both Charlie and him, it's almost a father and son like dynamic as Willy fills in that father figure role that Charlie is sorely missing.One of my favorite moments with Willy is the cream room where it's literally both verbal and visual humor at work. As he is just saying something and then putting his play on words to practice, when he puts some random things in each cream mixture. I always wonder what else does he put into the mixtures.And of course like with most fairy tales this film has a sense of morality, there are a lot of underlying messages without being preachy or heavy handed. Like how it's OK for kids to indulge in the sweets of life but it's more important they get what they need in order to grow healthy and happy. But also about bad parenting, why we need to be better teachers for kids, teach them and give them what's more important in life, to not spoil and indulge them all the time which is practically the equivalent of giving them nothing.This fantasy is full of rich goodness.Rating: 4 stars",
    "123": "A wonderful story with a wonderful message: honesty cannot be bought for any price, but it is the most valuable gift that any person (child or adult) can have.This is a great film because it appeals to both kids and adults.  Roald Dahl packs his story full of all the tasty and grotesque things that children love, while the script includes enough clever jokes and quotations to keep the attention of their parents.  It is without question the finest family film ever made.The first part of the film is possibly the funniest.  Rather than seeing a group of children searching the world for Golden tickets, we are instead presented with a variety of obsessed adults who seem willing to pay any price for the prizes.  This makes the film even more enjoyable for children; they get to see their parents acting like maniacs, the way the children themselves would.But it is five children who find the tickets, and they are hand-picked to be the worst examples of bratty kids: the overfed glutton, the snotty gum-chewer, the smarmy couch potato, and of course the most demanding, spoiled little demon in history (in my opinion, one of the greatest performances by a child actor ever)But the fifth is the golden child, the hard-working, honest little boy who has never had anything.  From the beginning he's taking care of his family, trying to be the man of the house now that his father is dead.  One can't help but love Charlie, especially as he sadly walks home alone to the sounds of his mother singing him a lullaby.The point of the film is that honesty, innocence, and faith will eventually make dreams come true.  Those dreams are brought to life through the Chocolate Factory, a spectacular series of sets and scenery, along with a delightful musical score.  Yet all through the Chocolate Factory, it is only Charlie who really seems to be enjoying himself; the others only whine and complain about all the strange and wonderful things around them.I thoroughly recommend this movie to anyone and everyone.  It teaches an inspiring lesson, it has many colourful characters, and the scenery is enough to make your mouth water.  It's positively scrum-diddly-umptious!"
}