{
    "0": "The animation, flow of everything, genius character development, and action were all electrifying! This is one of the best Spider-Man adaptions deserving of the high ratings entirely. I love all the portals connecting to other dimensions and Spot is such a fun villain. Shemeik Moore, Hailee Steinfield, Jake Johnson, and Oscar Issac among everyone else was superb so much talent this movie better be nominated for best animated feature like the previous one was years back deserving of its win! For a movie that's fairly long it stayed entertaining from start to finish and keeps you wanting more, I loved it all so much.Also since this review is doing well I have autism and would love any opportunity to be more known in the world! My real name is Alex Nolan and I crave movies a lot since I was quite young. I wish I could work on movies and spend time with famous people.",
    "1": "This film is a visual concert. The animation and character design neatly put me to tears. The opening of the film took an approach that shocked me, but it was fantastic to watch. Many of the jokes were in the trailers, but plenty caught me off guard in the cinema. Miguel even had a couple of funny moments. The presence of existing spider characters, such as snippets of the other films, did feel somewhat strange I have to admit. However, it is made up for in how incredible this film was. It was artistic, mature, adult, and profound. It leaves the viewer on a cliffhanger that shocked me. I thought I was an hour into the film, but it was the end. I implore everyone wondering if they should see this film to do so. Easily the best film I have seen in a long time and the best film to see in theaters. A true masterpiece.",
    "2": "First off, you should know that this is the first part of one big movie split into two, Harry Potter style. Except, everyone in the theater went nuts when it ended, I guess because it doesn't have \"Part One\" in the title. It doesn't really stand on its own, as far as the story goes. So it's kind of hard to rate it, since it set up way more than it concluded. Can't wait to see the next one.Anyway, even as just one half of a two-parter, this movie is awesome. If you thought you liked the style of \"Into the Spider-Verse\", then you got another thing coming. This movie is so much more than that, it's crazy, and it does not disappoint. Boggles the mind how this much stuff can even be animated at all.The visuals have got to be seen to be believed. Every scene has so much going on, and you could even say each scene has its own art style. It goes way beyond what the first movie did, and that was already crazy. The blending of styles on its own makes this a one of a kind movie, that will be hard to replicate. I'm even sort of mad that this creative energy hadn't been released before, because we are getting some insane stuff nowadays.One small complaint I do have is that all this, combined with the very fast action can make it a bit hard to breathe sometimes. Honestly I can't take too many points off for that though.The soudtrack is great, I can't wait for it to release. There truly are some bangers in there, and most of them are actually the score of the movie, not licensed music.And the story is awesome as well, although again it's hard to judge before seeing the next one. There's a lot more going on than in the first one, and most This movie explores the character of Gwen more and it's awesome. It's still about Miles though, and that part is also cool. I loved the Spot.So yeah I could say more, but I think you should just go see it. This might end up as one of the best trilogies of all time.",
    "3": "Spider-Man: Into the Spider-Verse is probably my favorite Spider-Man movie. However, my feelings about Spider-Man: Across the Spider-Verse are currently glitching. On one hand, the action scenes are spectacular, and the animation is, once again, amazing. On the other hand, this movie is 2 hours and 20 minutes long and it feels like it. Plus, the visuals can be so kinetic that the film becomes busy & chaotic. This sequel offers some real drama, however it's not a complete story, and it ends on a cliffhanger. I think my rating will solidify when I watch Beyond the Spider-Verse and see how it all ends.",
    "4": "Let me just say that the first hour of this film had me hooked and I just knew this film surpass it's predecessor in terms of the story & entertainment. Around the 2 hour mark I started wondering when or if there would be a climax? Various scenes felt like they were dragging on for way too long. We really didn't need all the scenes of Peter B. Parker and his child. For me personally I felt like there was no build up or anticipation due to how long certain scenes played out. Then the film ended on a cliffhanger and then I understood, this film is a middle movie, a gateway between the first film and the next film and unfortunately it showed. They didn't have a definitive ending for this film which is fine but at some point the scenes just felt like filler. I believe it is still a movie worth seeing, however, it falls short of the first movie in terms of keeping my attention.",
    "5": "I really enjoyed Into the Spider-Verse, but the way people hyped this movie up they made it seem like it was some award winning masterpiece of cinema but in my opinion it's fails to live up to the legacy of the first one.Visually this film is a spectacle like the first one but that only does so much when you are watching a 2hr+ film. The fact that this is a cliffhanger and it ends very abruptly makes it feel like it's both overly long and incomplete. There is so much going on in this film and so many new characters introduced and just as the plot finally starts to pick up and get good they end it on the cliffhanger. I don't understand how people are giving this movie such a high score but complaining so much about Fast X doing the same thing. This film is not complete and for that reason I felt like it wasn't as enjoyable as it could've been.",
    "6": "It's obvious by the 10 star reviews that we live in a generation where if you drag a TikTok video out for two and a half hours the mindless will be entertained.Don't get me wrong, there is a lot of good in this film, hence why I gave it a solid 5.But it's an absolute mess. Exploring it's visuals rather than it's characters it switches art every 5 seconds it seems. It never lingers, never breathes, never lets you absorb it.It can't decide if it wants to be teen angst, family drama, superhero, commentary. It's simply all over the place forgetting it's villain several times during the running.Oh and congrats for absolutely destroying the Spider-Man 2099 character.",
    "7": "It was absolutely awesome. I felt like I was traveling from the multiverse to my childhood back in 2002 when I saw Tobey maguire Spider-Man 21 years ago when I was 7 years old. And seeing all the other spider people including Spider-cat and Spider-rex . The spot traveling to venoms universe was absolutely hilarious. I hope to see ultimate Spider-Man from the video game I never finished on GameCube or Xbox for almost 17 years since I was a kid. Seeing 2018 Spider-Man from the PS4 game was very outstanding. I hope in Spider-Man beyond the spiderverse meets Tobey maguire and miles teams up with him and he helps him build the device and Gwen meets Andrew Garfield's Spider-Man and they help build the same device to bring miles home .",
    "8": "The 5 years was worth the wait. Amazing animation, beautiful characters with rich backstories, the fights are amazing, Gwen's story is amazing, EVERYTHING IS AMAZING! This entire movie is gorgeous and keeps you hooked and almost forces you to continue watching, that's how amazing it is. The hype around this movie was 100% deserved and made sense, seeing as how this movie may be the greatest film I have ever seen.This isn't your run of the mill kids move, action movie, animated movie. It's a masterpiece that all ages can enjoy. An amazing sequel that sets extremely high hopes for the third movie.",
    "9": "I generally liked the animation but it constantly reminded me of trying to watch a 3D movie without the 3D glasses. The petty drama is endless and becomes old fast. There are loads of action scenes that immediately devolve into slow soap opera drama. My wife and I kept nodding off during these whine-a-thones which seemed very contrived. I did like all of the iterations of spider flavors in the Spiderverse which were endlessly creative and entertaining. The music always suggests exciting action scenes but this becomes a little exhausting after the 4th or 5th wind up. Long winded exposition seems necessary to spoon feed a very lengthy and convoluted plot. When I booked I noticed the theater was sold out but we left before the end and noticed that only 10 members of the audience still remained having left before us. Spot was a good albeit comedic villain. I would suggest going just for the animation and humor even with the 140min run time.",
    "10": "Takes itself way too seriously, and fails to tell a compelling story.The writers apparently tried to re-use the formula for the first Spider-Verse movie, at the expense of character growth.This movie has a cliff-hanger ending, meaning that it's really just half of a movie. It hurts the pacing.The action is very predictable, but at the same time, the story is unnecessarily complicated. There's never any fear that any of the main characters are in danger.Overall, it's missing the wholesome, lighthearted moments which were so endearing in the first movie. This is a good movie to skip in the theaters and catch on streaming/DVD.",
    "11": "Spider-Man: Across the Spider-Verse is a disappointing sequel to the 2018 film Spider-Man: Into the Spider-Verse. The film is plagued by pacing issues, a reliance on clichés, and a lack of focus.The film's biggest problem is its length. At two hours and twenty minutes, it feels like two movies crammed into one. The first half of the film is slow and meandering, with too many subplots that don't really go anywhere. The second half of the film is much better, but it still feels rushed.Another issue with the film is its reliance on clichés. The theme of family is particularly overused, and it doesn't really add anything new to the story. The film also suffers from some pacing issues, with some scenes feeling too long and others feeling too short.Overall, Spider-Man: Across the Spider-Verse is a disappointing sequel that fails to live up to the high expectations set by its predecessor.",
    "12": "As visually stunning and groundbreaking of the animation, unfortunately, it was too much to take. I'm in my early 40s so younger viewers probably won't be affected as much. Didn't have an issue with Into the Spider-verse, but apparently, they increased the intensity to the point that I left with a headache. The different frame rates of characters in the same scene, the visual distortion in the background at times, made it difficult to focus and was basically visual overstimulation. I enjoyed the story and would like to see Beyond the Spider-verse but may have to just read about it if the animation is as intense as this film.",
    "13": "Not great but it's good. They could of made this movie about 30mins shorter tbh. There's a few things I don't like about this movie. I found it sort of stupid that in a world of Spider-Man, not one Spider-Man could catch Morales. Just found it odd. You watch a whole movie to get a Clift hanger. Which wasn't that great. I felt like we were missing a big climax that never happened. I found the characters in the first movie more funny. They sort of tried too hard on this one. The cgi comic book art is cool. I find it distracting at times and it takes away from the emotions. I don't know I just had higher expectations from what reviews were saying.",
    "14": "The first movie was great; original, funny, interesting, diverse. This movie is like you when say you like a song, so they play the same song twice as loud hoping you love it twice as much. It more disjointed, the emotions get lost, and really, the ending? In 2 hours and 16 minutes you can bring this movie to at least a temporary conclusion? The villain does not have a good enough back story to carry one, much less two movies. That said some of the spiderverses we see were very creative (especially India-Manhattan mix), and the lead character is as always very likeable. It's like they really didn't much else to say, and then they take too long to say what they did.",
    "15": "Remember when people were able to tell a story in two hours or less? When stories had a beginning, middle and an end? When the number one priority wasn't to build a never ending franchise, but to simply tell a story?I liked Spider-Man: Into the Spider-Verse (2018) which I thought was surprisingly good.Please, give the whole multiverse schtick a rest. Sure, it offers the great (merchandising) opportunity to include a zillion versions of Spiderman, but it also reduces the stakes to absolutely nothing.In the first half of the movie they establish the new main bad guy (or so one would think) whose backstory is a ridiculous throwaway gag by one of the animators of the first movie. After an hour or so the new bad guy vanishes from the movie. As we get closer to the end I look at my watch thinking \"There's no way they'll wrap this up in the ten minutes that are left\". And of course they don't, since their priority isn't to tell a coherent story, but to build a franchise. So we're left hanging with no resolution. If we want one, we'll have to pay for the next movie too! Genius film making.Of course it was 20-30 minutes too long as per usual for comic book movies today. And this is only the first installment! Including the sequel (or rather, the third act of this movie) this simple story will probably be about an hour longer than Gone With The Wind. Amazing.I watched this movie on a huge screen in Tokyo. The visuals were grating. The dotted areas and the double/triple outlines, which I suppose are meant to emulate early printing techniques of shadows/gradients and out-of-focus areas did not look good on the big screen. The first movie employed the same visual style, although not as pronounced as in this sequel. On a small screen (like my 65 inch OLED at home) they were not an issue. But on a huge cinema screen they were making my eyes bleed.There is no way I'll pay to see the third one.",
    "16": "Don't get me wrong. I liked the movie but people are acting like this is Godfather 2. It's rated higher than The Dark Knight lol . I'd probably put it 7th on the list of Spider-Man movies.The positive:Gwen was probably the best part of the movie. They did a great job with her and she is probably as much the lead in this movie as Miles. Her action scenes were great and her character was likable.Miles character was also very well done and it was nice to see his character progress and mature from the last one. I'm a Peter Parker guy but there is definitely room for Miles.I thought the Spot, who is usually a lame villain, was pretty cool. I liked the character arc and progression they gave him.Miguel was a decent character. I'm hoping there is more character development in Pt 2 because he just comes off like an angry jerk the entire movie.The action scenes were well done and all the cameos were a lot of fun and the final twist at the end was fantasticThe negative:It was about 45 minutes too long. I miss the sub 2 hr movie. My youngest was bored to tears before the midway point.They totally neutered Peter B Parker, who was the best part of the first movie. They made him a complete buffoon.The animation was a bit much at times. It was headache inducing.Hobart was cool when you could understand what he was saying. It was like listening to a Gallagher brother voicing a Spider-Man character..I hated every scene that Spider-Woman was in. She was easily the worst out of all the main characters in the movie.",
    "17": "It just excels in every category! Peak cinema right there. I can't imagine the amount of work that went into this movie, every aspect of it just blew me away.Words cannot accurately describe this experience so I'm not even gonna try. I can't remember the last time I was so hooked for more than 2 hours in a cinema. So much emotion, beauty and cool-ness!It's time for everyone to appreciate animation as a veritable film genre and give it the recognition it deserves. Across the Spider-Verse perfectly shows that you just can't do in a live-action movie what you can do with animation. I 100% think that the richness of emotions this masterpiece conveys was greatly benefited by the animation and its mesmerizing style. Just see it and you'll agree!",
    "18": "Spoiler alert: At 2 hours and fifteen minutes, this is not a complete movie, and unfortunately this was not clear before sitting through this. I was fine with the movie and thought that it was well done, however I dragged my spouse to it, whom I knew would not be a fan, and he was left with a worse feeling than I even expected. Needless to say that he will not be seeing the next installment. Following this movie, we then saw Fast and Furious X, which was also an unadvertised two parter. Hollywood needs to do a better job of alerting folks to this so that an informed decision can be made. It seems that movies are getting longer, and are we now seeing that even 2 1/2 hours isn't adequate to tell a story?",
    "19": "It's not very often we get an animation film like this...The art is astounding, colorful visuals, a jaw dropping movie phenomenon. The score and songs flow very well, the acting is on par with new additional characters involved...Some we may know, and some we haven't seen on screen yet. The plot of the story is well thought out. Has its silly moments without taking away the essence of the story. Has a very dark tone. This is a movie is aimed not only for children but for comic fans and adults alike. They really achieved movie history and everyone involved did a stiller job! One of the best Spider-Man movies thus far!",
    "20": "I never thought Into the Spider Verse was a movie that needed a sequel, but Across the Spider Verse is just as incredible as Into the Spider Verse. The animation style is even more beautiful than in the first movie, every shot looks like a painting. The exploration of Miles and Gwen and what it really means to be Spider Man is excellent, and leads to so many deep and emotional moments. Every scene with Miles' parents were top tier. The voice cast all gave it everything they had, and Hailee Steinfeld as Gwen was the stand out for me. The cliffhanger ending was so epic, it actually gave me chills. If the third movie is as good as these first two this might become the best trilogy of all time. 10/10.",
    "21": "I don't remember how long it has been since I've seen the first one but I am pretty sure I liked it better than this one. This is both a sequel and an unfinished story which negatively impacts my interpretations.First of all this film is once again really well done, visually. They went from the interesting art style of the first one to expanding and giving the other universes unique styles. It is so well done and so pretty and I only rarely got overwhelmed with the visuals. I can think of only once. This is a really great film to look at. The filmmakers did such an amazing job.The story is incomplete but pretty well done. I would rather have seen a 6 hour film than a part one. I like how they expanded the characters from the first film and explored more of the multiverse. I am not a huge fan of references to the MCU but the short references to the other live action Spider-Man films are less annoying. Also I only get like half of the references to the comics because I have never read a single Spider-Man comic book. But that's fine I'm not really interested in fan service, if I knew more I might just have been more annoyed. So I loved it and I loved seeing so many different versions of this character. Hobie is my favorite character, once I got used to his accent I realized he has amazing politics. I loved everything he did in this film and I wanted to see more of him but I'm guessing we'll get more of him in part 2.Being a film so heavily interconnected to comics, I feel like they decided it wouldn't be a bad idea to end it on a cliffhanger but they were wrong. The MCU does this thing where they don't have their films be self-contained stories and so they are fine with leaving threads open and teasing future installments. All very similar to actual comic books which are famous for their cliffhangers. Unfortunately, this is a film and I treat them as such because I like films more than comics. If they wanted to tell a grand story then make it a longer movie, I can handle it. Whether they did it because they wanted a second release date for more money, or they did it because of the logistics of having a 3-hour plus movie, I think it was a bad idea. If I wanted an incomplete story that ends on a cliffhanger then I'd read a comic or watch a show.I do think this film justifies it's own existence and I'm glad it was made. I think this story was interesting enough to carry a 6 hour runtime so it could have finished the story. I didn't mind 2.5 hours because it was such a fun story and the visuals were fantastic. Once the second part comes out I'll probably pretend this was just one long movie.",
    "22": "This might possibly be one of the best movies I've seen all year. I'll definitely put it in my top two for the year. The comics look better in animation in my opinion and the design of this super man looked great in IMAX.If there's anything to complain about, it might be the running time which with previews ran around 2hrs and 25 min. Like a lot of good action movies thought it seem to go by pretty fast. The movie doesn't drag and does a good job with its pacing.This time around Miles Morales finds his spdey going across dimensions to save the universe. I'm not revealing any spoilers but let's just say for the fans of the comics, this one stays true to the material. The soundtrack isn't bad either and helps with the pacing. Above all this is one super hero done right. Recommend you see it on the largest screen you can find. Maybe even the drive in.",
    "23": "Another outstanding spectacle filled with depth, character building, emotion, while delivering top notch animation through the entire run time.It uses nostalgia and other funny quirks, for the viewers to take notice of and have a laugh at. Despite that it isn't driven by those aspects, but instead the characters and story. Where the first movie felt like a conclusive origin story about Miles Morales, this instead feels like an expansion of the universe and the beginning of a larger tale.In the end it feels very much like the first part of two, and I can't wait for the second half. That being said, the story still has a but not as conclusive as the first one. Its a bigger and more expansive story, about Miles' journey about what it means to be Spiderman and the responsibility that follows.",
    "24": "As visually stunning and groundbreaking of the animation, unfortunately, it was too much to take. I'm in my early 40s so younger viewers probably won't be affected as much. Didn't have an issue with Into the Spider-verse, but apparently, they increased the intensity to the point that I left with a headache. The different frame rates of characters in the same scene, the visual distortion in the background at times, made it difficult to focus and was basically visual overstimulation. I enjoyed the story and would like to see Beyond the Spider-verse but may have to just read about it if the animation is as intense as this film.",
    "25": "Not great but it's good. They could of made this movie about 30mins shorter tbh. There's a few things I don't like about this movie. I found it sort of stupid that in a world of Spider-Man, not one Spider-Man could catch Morales. Just found it odd. You watch a whole movie to get a Clift hanger. Which wasn't that great. I felt like we were missing a big climax that never happened. I found the characters in the first movie more funny. They sort of tried too hard on this one. The cgi comic book art is cool. I find it distracting at times and it takes away from the emotions. I don't know I just had higher expectations from what reviews were saying.",
    "26": "The first movie was great; original, funny, interesting, diverse. This movie is like you when say you like a song, so they play the same song twice as loud hoping you love it twice as much. It more disjointed, the emotions get lost, and really, the ending? In 2 hours and 16 minutes you can bring this movie to at least a temporary conclusion? The villain does not have a good enough back story to carry one, much less two movies. That said some of the spiderverses we see were very creative (especially India-Manhattan mix), and the lead character is as always very likeable. It's like they really didn't much else to say, and then they take too long to say what they did.",
    "27": "Remember when people were able to tell a story in two hours or less? When stories had a beginning, middle and an end? When the number one priority wasn't to build a never ending franchise, but to simply tell a story?I liked Spider-Man: Into the Spider-Verse (2018) which I thought was surprisingly good.Please, give the whole multiverse schtick a rest. Sure, it offers the great (merchandising) opportunity to include a zillion versions of Spiderman, but it also reduces the stakes to absolutely nothing.In the first half of the movie they establish the new main bad guy (or so one would think) whose backstory is a ridiculous throwaway gag by one of the animators of the first movie. After an hour or so the new bad guy vanishes from the movie. As we get closer to the end I look at my watch thinking \"There's no way they'll wrap this up in the ten minutes that are left\". And of course they don't, since their priority isn't to tell a coherent story, but to build a franchise. So we're left hanging with no resolution. If we want one, we'll have to pay for the next movie too! Genius film making.Of course it was 20-30 minutes too long as per usual for comic book movies today. And this is only the first installment! Including the sequel (or rather, the third act of this movie) this simple story will probably be about an hour longer than Gone With The Wind. Amazing.I watched this movie on a huge screen in Tokyo. The visuals were grating. The dotted areas and the double/triple outlines, which I suppose are meant to emulate early printing techniques of shadows/gradients and out-of-focus areas did not look good on the big screen. The first movie employed the same visual style, although not as pronounced as in this sequel. On a small screen (like my 65 inch OLED at home) they were not an issue. But on a huge cinema screen they were making my eyes bleed.There is no way I'll pay to see the third one.",
    "28": "Don't get me wrong. I liked the movie but people are acting like this is Godfather 2. It's rated higher than The Dark Knight lol . I'd probably put it 7th on the list of Spider-Man movies.The positive:Gwen was probably the best part of the movie. They did a great job with her and she is probably as much the lead in this movie as Miles. Her action scenes were great and her character was likable.Miles character was also very well done and it was nice to see his character progress and mature from the last one. I'm a Peter Parker guy but there is definitely room for Miles.I thought the Spot, who is usually a lame villain, was pretty cool. I liked the character arc and progression they gave him.Miguel was a decent character. I'm hoping there is more character development in Pt 2 because he just comes off like an angry jerk the entire movie.The action scenes were well done and all the cameos were a lot of fun and the final twist at the end was fantasticThe negative:It was about 45 minutes too long. I miss the sub 2 hr movie. My youngest was bored to tears before the midway point.They totally neutered Peter B Parker, who was the best part of the first movie. They made him a complete buffoon.The animation was a bit much at times. It was headache inducing.Hobart was cool when you could understand what he was saying. It was like listening to a Gallagher brother voicing a Spider-Man character..I hated every scene that Spider-Woman was in. She was easily the worst out of all the main characters in the movie.",
    "29": "It just excels in every category! Peak cinema right there. I can't imagine the amount of work that went into this movie, every aspect of it just blew me away.Words cannot accurately describe this experience so I'm not even gonna try. I can't remember the last time I was so hooked for more than 2 hours in a cinema. So much emotion, beauty and cool-ness!It's time for everyone to appreciate animation as a veritable film genre and give it the recognition it deserves. Across the Spider-Verse perfectly shows that you just can't do in a live-action movie what you can do with animation. I 100% think that the richness of emotions this masterpiece conveys was greatly benefited by the animation and its mesmerizing style. Just see it and you'll agree!",
    "30": "Spoiler alert: At 2 hours and fifteen minutes, this is not a complete movie, and unfortunately this was not clear before sitting through this. I was fine with the movie and thought that it was well done, however I dragged my spouse to it, whom I knew would not be a fan, and he was left with a worse feeling than I even expected. Needless to say that he will not be seeing the next installment. Following this movie, we then saw Fast and Furious X, which was also an unadvertised two parter. Hollywood needs to do a better job of alerting folks to this so that an informed decision can be made. It seems that movies are getting longer, and are we now seeing that even 2 1/2 hours isn't adequate to tell a story?",
    "31": "It's not very often we get an animation film like this...The art is astounding, colorful visuals, a jaw dropping movie phenomenon. The score and songs flow very well, the acting is on par with new additional characters involved...Some we may know, and some we haven't seen on screen yet. The plot of the story is well thought out. Has its silly moments without taking away the essence of the story. Has a very dark tone. This is a movie is aimed not only for children but for comic fans and adults alike. They really achieved movie history and everyone involved did a stiller job! One of the best Spider-Man movies thus far!",
    "32": "I never thought Into the Spider Verse was a movie that needed a sequel, but Across the Spider Verse is just as incredible as Into the Spider Verse. The animation style is even more beautiful than in the first movie, every shot looks like a painting. The exploration of Miles and Gwen and what it really means to be Spider Man is excellent, and leads to so many deep and emotional moments. Every scene with Miles' parents were top tier. The voice cast all gave it everything they had, and Hailee Steinfeld as Gwen was the stand out for me. The cliffhanger ending was so epic, it actually gave me chills. If the third movie is as good as these first two this might become the best trilogy of all time. 10/10.",
    "33": "I don't remember how long it has been since I've seen the first one but I am pretty sure I liked it better than this one. This is both a sequel and an unfinished story which negatively impacts my interpretations.First of all this film is once again really well done, visually. They went from the interesting art style of the first one to expanding and giving the other universes unique styles. It is so well done and so pretty and I only rarely got overwhelmed with the visuals. I can think of only once. This is a really great film to look at. The filmmakers did such an amazing job.The story is incomplete but pretty well done. I would rather have seen a 6 hour film than a part one. I like how they expanded the characters from the first film and explored more of the multiverse. I am not a huge fan of references to the MCU but the short references to the other live action Spider-Man films are less annoying. Also I only get like half of the references to the comics because I have never read a single Spider-Man comic book. But that's fine I'm not really interested in fan service, if I knew more I might just have been more annoyed. So I loved it and I loved seeing so many different versions of this character. Hobie is my favorite character, once I got used to his accent I realized he has amazing politics. I loved everything he did in this film and I wanted to see more of him but I'm guessing we'll get more of him in part 2.Being a film so heavily interconnected to comics, I feel like they decided it wouldn't be a bad idea to end it on a cliffhanger but they were wrong. The MCU does this thing where they don't have their films be self-contained stories and so they are fine with leaving threads open and teasing future installments. All very similar to actual comic books which are famous for their cliffhangers. Unfortunately, this is a film and I treat them as such because I like films more than comics. If they wanted to tell a grand story then make it a longer movie, I can handle it. Whether they did it because they wanted a second release date for more money, or they did it because of the logistics of having a 3-hour plus movie, I think it was a bad idea. If I wanted an incomplete story that ends on a cliffhanger then I'd read a comic or watch a show.I do think this film justifies it's own existence and I'm glad it was made. I think this story was interesting enough to carry a 6 hour runtime so it could have finished the story. I didn't mind 2.5 hours because it was such a fun story and the visuals were fantastic. Once the second part comes out I'll probably pretend this was just one long movie.",
    "34": "This might possibly be one of the best movies I've seen all year. I'll definitely put it in my top two for the year. The comics look better in animation in my opinion and the design of this super man looked great in IMAX.If there's anything to complain about, it might be the running time which with previews ran around 2hrs and 25 min. Like a lot of good action movies thought it seem to go by pretty fast. The movie doesn't drag and does a good job with its pacing.This time around Miles Morales finds his spdey going across dimensions to save the universe. I'm not revealing any spoilers but let's just say for the fans of the comics, this one stays true to the material. The soundtrack isn't bad either and helps with the pacing. Above all this is one super hero done right. Recommend you see it on the largest screen you can find. Maybe even the drive in.",
    "35": "Another outstanding spectacle filled with depth, character building, emotion, while delivering top notch animation through the entire run time.It uses nostalgia and other funny quirks, for the viewers to take notice of and have a laugh at. Despite that it isn't driven by those aspects, but instead the characters and story. Where the first movie felt like a conclusive origin story about Miles Morales, this instead feels like an expansion of the universe and the beginning of a larger tale.In the end it feels very much like the first part of two, and I can't wait for the second half. That being said, the story still has a but not as conclusive as the first one. Its a bigger and more expansive story, about Miles' journey about what it means to be Spiderman and the responsibility that follows.",
    "36": "As visually stunning and groundbreaking of the animation, unfortunately, it was too much to take. I'm in my early 40s so younger viewers probably won't be affected as much. Didn't have an issue with Into the Spider-verse, but apparently, they increased the intensity to the point that I left with a headache. The different frame rates of characters in the same scene, the visual distortion in the background at times, made it difficult to focus and was basically visual overstimulation. I enjoyed the story and would like to see Beyond the Spider-verse but may have to just read about it if the animation is as intense as this film.",
    "37": "Not great but it's good. They could of made this movie about 30mins shorter tbh. There's a few things I don't like about this movie. I found it sort of stupid that in a world of Spider-Man, not one Spider-Man could catch Morales. Just found it odd. You watch a whole movie to get a Clift hanger. Which wasn't that great. I felt like we were missing a big climax that never happened. I found the characters in the first movie more funny. They sort of tried too hard on this one. The cgi comic book art is cool. I find it distracting at times and it takes away from the emotions. I don't know I just had higher expectations from what reviews were saying.",
    "38": "The first movie was great; original, funny, interesting, diverse. This movie is like you when say you like a song, so they play the same song twice as loud hoping you love it twice as much. It more disjointed, the emotions get lost, and really, the ending? In 2 hours and 16 minutes you can bring this movie to at least a temporary conclusion? The villain does not have a good enough back story to carry one, much less two movies. That said some of the spiderverses we see were very creative (especially India-Manhattan mix), and the lead character is as always very likeable. It's like they really didn't much else to say, and then they take too long to say what they did.",
    "39": "Remember when people were able to tell a story in two hours or less? When stories had a beginning, middle and an end? When the number one priority wasn't to build a never ending franchise, but to simply tell a story?I liked Spider-Man: Into the Spider-Verse (2018) which I thought was surprisingly good.Please, give the whole multiverse schtick a rest. Sure, it offers the great (merchandising) opportunity to include a zillion versions of Spiderman, but it also reduces the stakes to absolutely nothing.In the first half of the movie they establish the new main bad guy (or so one would think) whose backstory is a ridiculous throwaway gag by one of the animators of the first movie. After an hour or so the new bad guy vanishes from the movie. As we get closer to the end I look at my watch thinking \"There's no way they'll wrap this up in the ten minutes that are left\". And of course they don't, since their priority isn't to tell a coherent story, but to build a franchise. So we're left hanging with no resolution. If we want one, we'll have to pay for the next movie too! Genius film making.Of course it was 20-30 minutes too long as per usual for comic book movies today. And this is only the first installment! Including the sequel (or rather, the third act of this movie) this simple story will probably be about an hour longer than Gone With The Wind. Amazing.I watched this movie on a huge screen in Tokyo. The visuals were grating. The dotted areas and the double/triple outlines, which I suppose are meant to emulate early printing techniques of shadows/gradients and out-of-focus areas did not look good on the big screen. The first movie employed the same visual style, although not as pronounced as in this sequel. On a small screen (like my 65 inch OLED at home) they were not an issue. But on a huge cinema screen they were making my eyes bleed.There is no way I'll pay to see the third one.",
    "40": "Don't get me wrong. I liked the movie but people are acting like this is Godfather 2. It's rated higher than The Dark Knight lol . I'd probably put it 7th on the list of Spider-Man movies.The positive:Gwen was probably the best part of the movie. They did a great job with her and she is probably as much the lead in this movie as Miles. Her action scenes were great and her character was likable.Miles character was also very well done and it was nice to see his character progress and mature from the last one. I'm a Peter Parker guy but there is definitely room for Miles.I thought the Spot, who is usually a lame villain, was pretty cool. I liked the character arc and progression they gave him.Miguel was a decent character. I'm hoping there is more character development in Pt 2 because he just comes off like an angry jerk the entire movie.The action scenes were well done and all the cameos were a lot of fun and the final twist at the end was fantasticThe negative:It was about 45 minutes too long. I miss the sub 2 hr movie. My youngest was bored to tears before the midway point.They totally neutered Peter B Parker, who was the best part of the first movie. They made him a complete buffoon.The animation was a bit much at times. It was headache inducing.Hobart was cool when you could understand what he was saying. It was like listening to a Gallagher brother voicing a Spider-Man character..I hated every scene that Spider-Woman was in. She was easily the worst out of all the main characters in the movie.",
    "41": "It just excels in every category! Peak cinema right there. I can't imagine the amount of work that went into this movie, every aspect of it just blew me away.Words cannot accurately describe this experience so I'm not even gonna try. I can't remember the last time I was so hooked for more than 2 hours in a cinema. So much emotion, beauty and cool-ness!It's time for everyone to appreciate animation as a veritable film genre and give it the recognition it deserves. Across the Spider-Verse perfectly shows that you just can't do in a live-action movie what you can do with animation. I 100% think that the richness of emotions this masterpiece conveys was greatly benefited by the animation and its mesmerizing style. Just see it and you'll agree!",
    "42": "Spoiler alert: At 2 hours and fifteen minutes, this is not a complete movie, and unfortunately this was not clear before sitting through this. I was fine with the movie and thought that it was well done, however I dragged my spouse to it, whom I knew would not be a fan, and he was left with a worse feeling than I even expected. Needless to say that he will not be seeing the next installment. Following this movie, we then saw Fast and Furious X, which was also an unadvertised two parter. Hollywood needs to do a better job of alerting folks to this so that an informed decision can be made. It seems that movies are getting longer, and are we now seeing that even 2 1/2 hours isn't adequate to tell a story?",
    "43": "It's not very often we get an animation film like this...The art is astounding, colorful visuals, a jaw dropping movie phenomenon. The score and songs flow very well, the acting is on par with new additional characters involved...Some we may know, and some we haven't seen on screen yet. The plot of the story is well thought out. Has its silly moments without taking away the essence of the story. Has a very dark tone. This is a movie is aimed not only for children but for comic fans and adults alike. They really achieved movie history and everyone involved did a stiller job! One of the best Spider-Man movies thus far!",
    "44": "I never thought Into the Spider Verse was a movie that needed a sequel, but Across the Spider Verse is just as incredible as Into the Spider Verse. The animation style is even more beautiful than in the first movie, every shot looks like a painting. The exploration of Miles and Gwen and what it really means to be Spider Man is excellent, and leads to so many deep and emotional moments. Every scene with Miles' parents were top tier. The voice cast all gave it everything they had, and Hailee Steinfeld as Gwen was the stand out for me. The cliffhanger ending was so epic, it actually gave me chills. If the third movie is as good as these first two this might become the best trilogy of all time. 10/10.",
    "45": "I don't remember how long it has been since I've seen the first one but I am pretty sure I liked it better than this one. This is both a sequel and an unfinished story which negatively impacts my interpretations.First of all this film is once again really well done, visually. They went from the interesting art style of the first one to expanding and giving the other universes unique styles. It is so well done and so pretty and I only rarely got overwhelmed with the visuals. I can think of only once. This is a really great film to look at. The filmmakers did such an amazing job.The story is incomplete but pretty well done. I would rather have seen a 6 hour film than a part one. I like how they expanded the characters from the first film and explored more of the multiverse. I am not a huge fan of references to the MCU but the short references to the other live action Spider-Man films are less annoying. Also I only get like half of the references to the comics because I have never read a single Spider-Man comic book. But that's fine I'm not really interested in fan service, if I knew more I might just have been more annoyed. So I loved it and I loved seeing so many different versions of this character. Hobie is my favorite character, once I got used to his accent I realized he has amazing politics. I loved everything he did in this film and I wanted to see more of him but I'm guessing we'll get more of him in part 2.Being a film so heavily interconnected to comics, I feel like they decided it wouldn't be a bad idea to end it on a cliffhanger but they were wrong. The MCU does this thing where they don't have their films be self-contained stories and so they are fine with leaving threads open and teasing future installments. All very similar to actual comic books which are famous for their cliffhangers. Unfortunately, this is a film and I treat them as such because I like films more than comics. If they wanted to tell a grand story then make it a longer movie, I can handle it. Whether they did it because they wanted a second release date for more money, or they did it because of the logistics of having a 3-hour plus movie, I think it was a bad idea. If I wanted an incomplete story that ends on a cliffhanger then I'd read a comic or watch a show.I do think this film justifies it's own existence and I'm glad it was made. I think this story was interesting enough to carry a 6 hour runtime so it could have finished the story. I didn't mind 2.5 hours because it was such a fun story and the visuals were fantastic. Once the second part comes out I'll probably pretend this was just one long movie.",
    "46": "This might possibly be one of the best movies I've seen all year. I'll definitely put it in my top two for the year. The comics look better in animation in my opinion and the design of this super man looked great in IMAX.If there's anything to complain about, it might be the running time which with previews ran around 2hrs and 25 min. Like a lot of good action movies thought it seem to go by pretty fast. The movie doesn't drag and does a good job with its pacing.This time around Miles Morales finds his spdey going across dimensions to save the universe. I'm not revealing any spoilers but let's just say for the fans of the comics, this one stays true to the material. The soundtrack isn't bad either and helps with the pacing. Above all this is one super hero done right. Recommend you see it on the largest screen you can find. Maybe even the drive in.",
    "47": "Another outstanding spectacle filled with depth, character building, emotion, while delivering top notch animation through the entire run time.It uses nostalgia and other funny quirks, for the viewers to take notice of and have a laugh at. Despite that it isn't driven by those aspects, but instead the characters and story. Where the first movie felt like a conclusive origin story about Miles Morales, this instead feels like an expansion of the universe and the beginning of a larger tale.In the end it feels very much like the first part of two, and I can't wait for the second half. That being said, the story still has a but not as conclusive as the first one. Its a bigger and more expansive story, about Miles' journey about what it means to be Spiderman and the responsibility that follows.",
    "48": "I had decently big expectations for this one, especially for a spider man movie, but rarely any of them were filled.I don't know how people find this movie that great, i just find it an ok movie with an ok plot. I definitely saw a lot of potential, but the plot was too overwhelming with so many things in the background. Main thing that i didn't like was the lack of action. I went to watch this movie to see a great plot, and a ton of action, but that certainly didn't happen.The first 40 minutes of the movie covers just the main characters which i found pretty boring. Rest of the movie was just 20 things happening at the same time. I felt like falling asleep halfway through, but luckilt at least there was some action.Definitely an \"Avengers: infinity war\" try, but lacks action. 7/10 at most.",
    "49": "Times moved on since the adventures with your brethren, and life doesn't seem to be just quite as much fun, but a visit from Gwen Stacy, escalates things to quite racy, as you enter other worlds, and start to run; after coming face to face with angry Spot, who's more than capable, of tying knots (especially of himself), but it's revenge that he desires, and now he's pulling all the wires, and the canon has misfired its latest shot; into worlds of masks and costumes that astound, with variations on the theme that just dumbfound, a kaleidoscope of dazzle, of electrifying frazzle, as you leave you just can't wait for the next round.It's just a bit spectacular.",
    "50": "After the wildly creative and emotionally profound \"Into the Spiderverse\" Blew us all Away, the sequel takes us across the spiderverse with keeping the core strengths of the first movie intact, and setting up a spectacular final film that will make this the Greatest Spiderman trilogy. Once again the revolutionizing art style steals the spotlight, with each character getting its own unique color palette and motion art, with visual angles to die for and creating some of the most jaw-dropping action scenes. Once again incredible voice-acting and writing, focusing on the core family bonds and how each spiderman's destiny and story correlate. The Villain \"Spot\" also is given his own unique journey. I dont like Cliffhanger endings in films so that was a negative for me. But what truly matters is that Its a Love Letter to all Spiderman Fans... Go and watch it.",
    "51": "There is not enough good things I can say about this movie, except, go and watch it, its amazing. I have never seen a sequel so good, I honestly think it was better then the first film. The movie is beautifully constructed. The art work is phenomenal and story is extremely interesting. It has everything in a movie that you could ask for and its great for all audiences. There is no agenda being pushed, or political message trying to be told, instead its just a good old fashion movie with a ton of fun, action and adventure, great family values and innocent love. It has the perfect balance of everything. The art work is stunning. And the story is captivating. I could honestly sit and watch this movie over and over again.",
    "52": "When I first watched and reviewed \"Spider-Man: Into the Spider-Verse\", it ranked #29 on IMDb's list of Top 250 Movies of All Time. It now sits at #67 as I write this. At the time, I thought the film was OK, not great, but OK. As far as animated movies go, I thought it was exceptionally rendered with bright, vivid colors and an interesting cast of characters. Regarding the story however, it wasn't particularly new or innovative. How many threats to reality have you encountered over the course of your movie viewing lives? This one, if I can make a timely comparison, might have been titled \"Spider-Man: Everything, Everywhere, All at Once\". That comes with the territory of taking place in a multiverse, where just about anyone and anything goes. It's just a little bit too much in my estimation, making the story somewhat confusing and disjointed, perhaps perfect for the attention deficit generation, but unappealing to someone my age who grew up on the very early Spider-Man stories. There's some nod to that era, with a brief glance of an 'Amazing Fantasy #15' comic book cover, along with various other covers appearing in too rapid succession to focus on their relevance. Another turn off for me was the clichéd dialog that took place throughout the story, with phrases like 'been there, done that', 'wait, what?', and the ever-popular turn of phrase, 'are you serious, right now'. It all made for a direct appeal to an under twenty-five-year-old audience, nothing wrong with that, but with limited appeal to someone who's outgrown their teen years. At present, the movie ranks #22 on IMDb's Top 250. I think it hit as high as #11 when I was following it when it came out. That's higher than its predecessor, and will probably remain that way as both progress down the chart over time. The fact that it was not a done in one film was also a mild annoyance, particularly since it didn't recommend to me that I had to catch the next installment, considering the disorderly course of this one.",
    "53": "Miles Morales' second adventure brings him back into contact with Spider-Gwen. Outcast from her own universe where she has been erroneously accused of the death of her Peter, she is now working with a squad of spider-people patrolling the multiverse. Meanwhile, Miles as problems with new villain, The Spot.Plotwise and characterwise, this is fun. It mixes some emotional character stuff with exciting action, and interesting (and sometimes unexpected) plot developments, right up to the end. Oh did I say \"The End\"?...There's plenty of fan service here.Yes, but what does it look like? Because the look of the first one was striking, right? I bet this is jnot as good, or just more of the same, right?Wrong. The look of this film, whether a quiet scene in an office, or a hyper-kinetic action scene, is simply dazzling. There are so many animation styles, and touches, and tweaks, and Every. Single. One of them serves a dramatic purpose in the storytelling.Fantasic.",
    "54": "Miles Morales continues to be a captivating protagonist, grappling with his identity and responsibilities in a way that feels relatable and deeply human. The chemistry and camaraderie among the Spider-heroes bring both heartwarming moments and exhilarating action sequences, keeping viewers engaged from start to finish. It's a groundbreaking work of art that propels the superhero genre to new heights. With its flawless execution, rich character development, and breathtaking visuals, the film rightfully earns its place as a 10/10 cinematic triumph that will undoubtedly be celebrated for years to come. Need I say more?",
    "55": "Miles Morales and Gwen Stacy are back as they continue their adventures across the multiverse. There are more Spider-people in a whole multiverse organization of Spider-people. Miles is battling a not-so-super villain The Spot.This is a sequel to the animated Spider-Man: Into the Spider-Verse (2018). It's a great follow-up to a great movie. Both have the great animated energy and fun comedy. It's a great continuation and expansion of this multiverse. The teens are a little older and their romance is getting deeper. There are interesting villains. If you love the first one, you'll love second one.",
    "56": "My favorite movie of all time. Seen it twice less than 24 hours since it opened. Every frame is perfect. Every line of dialogue, story beat, voice actor, are all perfect. Metro Boomin's songs and Daniel Pemberton's score are perfect. I love every second of this movie. It hit me hard man. This is my Empire Strikes back, my Infinity War. Planning on seeing it again multiple times. See it on the best screen possible. I love Miles and Gwen's relationship. Miguel is a fantastic and complex character. There is so much here for every Spider-Man fan to enjoy. And there is plenty for people who aren't fans too.",
    "57": "Does Across the Spider-Verse really deserves the rather impressive 8.9 score it currently holds here on the Internet Movie Database?I don't know, but I can tell I enjoyed a lot this film from beginning to end.Despite its unusual lenght, the movie never gets boring or tedious in any moment, keeping a frenetic pace in every single one of its scenes.Maybe the dialogue was a little bit too \"quippy\" in a couple of moments, but the snappy writing doesn't get in the way of the most dramatic moments, never lessening them in any manner.The animation deserves a particular mention, alternating in a rather different impressive manner several distinct visual styles, taking a full advantage of the medium in a way in which would be almost impossible to depict via live-action.This sequel lives up to the original, and left me with very high expectations towards its continuation.Now that the bar has been set up so high, I really hope the finale of the Spiderverse series doesn't disappoint.So far, the ride has been quite amazing.8.5/10.",
    "58": "I'm on the fence about it. Split into two scores. One is very, very high: the music score and soundtrack. Amazing! 10 out of 10 for me. The other score is weak: the movie itself. I find the story , direction, animation and the voices very mediocre. For children mostly. The script is very predictable, yet confusing at the same time. The amazing music score kept my attention till the end, were it not for the music I suspect I'd be bored. I'm not a fan of comics in general and I'm not a child. Only 2 out of 10 for me. So, I add the score of 10 and the score of 2, and divide it in half. I give the movie 6 stars.",
    "59": "Can't rave enough about this movie. Everything was excellent and I have nothing I can think of to complain about. It was a joy to be back, hanging out with Miles, Gwen, Peter, and the handful of new characters. The film takes it's time early on developing Gwen and Miles as they live their separate lives in their respective dimensions and deal with the frustrations and realities of being their own Spider persons. We're immediately given the emotional weight of Gwen's life, one that is very lonely and who has seemingly lost the only friend she had left after having to say goodbye to Miles. Miles is in a similar predicament, though he is less hung up on being alone and missing Gwen, and more so on having to balance school, his responsibilities to his parents, and his role as Spider-Man.After spending some time with their respective lives, we get to the meat of the story, which involves new villain-of-the-week-becoming-major-villain The Spot, who is setting out to further disrupt the multiverse after Kingpin's plot in the first movie. Miguel O'Hara, aka Spider-Man 2099, comes into the picture as having established a hub of Spider characters from various dimensions who are attempting to fix the anomalies created by the collider's explosion from the first film. Miguel acts as a darker version of Spider-Man who has little tolerance for anyone treating their task with anything but the utmost seriousness.The animation and art is once again excellent, this time giving us various designs for the different Spider characters, with Spider Punk and Crimson Spider being highlights. Everyone gets a chance to shine as a character, even when their part is small and the loads of easter eggs and references will delight fans while not feeling superfluous or there purely for fan service. Like No Way Home, this is a celebration of the Spider-Man franchise, but feeling like it's celebrating the entirety of the brand, covering everything from comics, animation, live action, and even the video games. There are quite a few pleasant surprises.Some might be off put by the abrupt ending, especially if they have no idea this the first part of a two part film duoglogy, but having known this going in, I felt pretty comfortable with where it ended. It is a cliffhanger ending, so don't expect to feel like the story has an ending, but it creates an anticipation for the next movie and it's something I can wait patiently for as it comes early next year. Overall, the film, like the first one, demonstrates itself to be one of the year's best. I even expect this to possibly be my favorite film of 2023.",
    "60": "Wow wow wow. This is absolute masterpiece, cannot fault it at all. The animation is probably the best I've ever seen. The level of detail is ridiculous and the amount of effort that went into making this is clearly shown. The voice acting is great, the music is great, it's funny and lots of cool Easter eggs. The story is great as well and leads perfectly into the sequel which I absolutely cannot wait for.I wouldn't be surprised if not only if this was nominated for best animated picture at the Oscars but also best picture, it's that good.There's nothing more to say, just go watch it in yh Cinema and appreciate the art!",
    "61": "Across the Spider-Verse has done the impossible: be better than Into the Spider-Verse. And by leaps and bounds too. The animation is spectacular. Every frame looks like a Van Gogh, a Picasso. It makes Into the Spider-Verse look like a first grader painted it. The voice cast is very well done, Oscar Isaac, Haliee Steinfeld, and Andy Samberg are definite highlights. The action sequences are superb, but they complement a fantastic story that when its massive cliffhanger hits you, you'll be begging for more. Daniel Pemberton brings his A game once again with a score that's even better than the first. Across the Spider-Verse succeeds in every way, and should be seen on the biggest screen possible.",
    "62": "People who are saying that they can't like this movie because it ends in a cliffhanger are silly. Plenty of books and pieces of media that are objectively and subjectively enjoyable end with cliffhangers. It's interesting because some of the people who complain about this film ending the way it did also are giving praise to Empire Strikes Back- a movie that ended in a cliffhanger. There doesn't need to be conclusion to a film to enjoy it and have fun. There's a lot of character growth, a good story, a lot of interesting ideas and the art direction is beautiful and revolutionary. There's plenty in this film to satisfy movie goers and fans alike.",
    "63": "I can't even describe how much fun this movie was! The animation, the voiceover, the music (OHH, THE MUSIC). It was a complete surreal experience. Every frame of the movie looks so beautiful. The way that it has been stylized makes it so pleasing to your eyes. The story has different aspects running simultaneously that will keep you engaged till the very end and will leave you wanting for more. I'm pretty sure they're gonna make a third one and I simply can't wait for it. Don't miss this one in the theatres. It's one of a kind experience that needs to be enjoyed on the big screen. Alright, until next time! Peace!",
    "64": "At long last we have our sequel to Into The Spiderverse. One thing I'll point out is the astonishing animation/visual effects. Truly a work of art. The way each Spiderperson had their own unique style continues to be a highlight of this franchise. It was really cool to see all the different variations of Spider-Man all in one movie. With that being said the script was a little misguided, and really failed to tell a solid story in one movie. The focus of this movie is fractured, and we as an audience are along for the ride. Definitely feels like an extended 2nd act. I've aways said a movie should be more than sequel bait, and I feel the writers stretched this story to get one more movie out of it. While it'll be an epic binge in the future, I don't see myself rewatching this one until the Spiderverse trilogy is complete.",
    "65": "Does Across the Spider-Verse really deserves the 8.9 score it currently holds on Imdb? I don't know, but I enjoyed it immensely from beginning to end, leaving my hopes very high for its next part.Despite its unusual lenght, it never gets boring, keep the same level of fun and excitement from its predecessor, with a rather impressive mixture of many different animation styles and a solid characterization for its large cast.The bar has been set pretty high, and I really hope the sequel does not disappoint. I think it would the be the ultimate resolution of all the loose ends left here which will ultimately decide the staying power of the Spiderverse series.8.5/10.",
    "66": "From the opening scene I was sure the film's gonna be a masterpiece. An esthetically flawless picture with special animation style for each dimension. Especially Gwen's world, it was a definition of 'emotional', I still have goosebumps every time enjoying the scene. Also, the visuals were complemented by the soundtrack which made me wanna smile every time a song starts.Should I even mention all the references to not just the MCU, but other different things? I'm not sure if one can tell me the exact number of spiders that appeared. That's what Marvel does the best and it's the perfect film for such references.Overall, it was an unbelievable superhero picture with some interpersonal problems explored. I highly enjoyed the pacing of ATSV which wasn't boring at all. Looking forward to watching Beyond The Spiderverse. Not sure if it's gonna be EVEN better but my expectations are still high.",
    "67": "Spider Man across the spider verse was nearly perfect. The only flaw was the ending. It did rap up well though. Gwen assembled a Spider Man team to find Miles, Miles went to a universe were his uncle was still alive, and that Miles was the Prowler. So it really did get me excited for the next one, but at the same time I was pissed off that I have to wait another year to see it. It was a cliffhanger, but a good one. The ending could of been worse though, because I thought it was going to end with the Spot arriving in Gwen's current universe, and start attacking Miles's Dad. Just imagine that cliffhanger. Other then the ending, the movie was perfect. It had an amazing soundtrack, amazing action, amazing comedy. Amazing acting. The best part though was the small cameos, e.g when it showed the lady from the dairy in Venom, and Donald Glover as the Prowler. I'd recommend this movie, but not for little kids, because the plot is to confusing. It involves a lot of multiverse madness, that you really have to pay attention in order to understand.",
    "68": "It's honestly absurd how good the \"Spider-Verse\" movies are. \"Across the Spider-Verse\" is just as great, if not better than \"Into the Spider-Verse\". I really don't know how. \"Spider-Man: Across the Spider-Verse\" is fantastic! Deftly juggles deeply heartfelt character beats with crazy multiverse content, just packed with so many delightful easter eggs. Loved how Gwen's story is expanded, her scenes with Shea Whigham's Captain Stacy are truly special.Can't wait for the third one. Every frame of this movie is gorgeous! I didn't want to blink because I didn't want to miss anything. You can watch this film over & over & finds something new to enjoy. There are some surprises in this film that I truly wasn't expecting.\"Across the Spider-Verse\" is another milestone for animation. Yes it's gorgeous & visually mind-blowing, but this sequel surpasses the first for always putting Miles and his family front and center. The movie feels like a massive celebration for Spider-Man fans everywhere, whether you love the movies, games, comics, etc. But again, all the cameos and multiversal elements come second to both Miles and Gwen's story. Is a stunning achievement. Yes, it's visually dazzling, with expansive, expressive new realms The movie's real superpower is its emotional depth and its beautiful, melancholic tone.What more can I say...It's an actual work of art! Every frame deserves to be hung in a museum. The jokes and nods to Spidey lore are perfect. It's outstanding. \"Spider-Man: Across the Spider-Verse\" is yet another resounding win for the Lord Miller-produced universe. Hailee Steinfeld really comes into her own as Gwen Stacy. It's darker and sadder than I expected, but necessary.",
    "69": "If it wasn't already obvious in the first film, it's now officially clear as day that the people behind the Spider-Verse franchise (including writers/producers Phil Lord and Chris Miller, who are absolute creative godsends to the once magnificent place known as Hollywood) understand EXACTLY what they're working with.Don't let the marketing fool you: this film has GUTS. It's easily one of the heaviest PG-rated films I've ever seen. Payoffs and character revelations that were only hinted at in the first film are carefully, deliberately unraveled and come around beautifully. It made me think about my own life and what I mean to the people I care about in ways I never expected. The fan-service is BATTY too, and yet somehow it's never too much.I wish every movie was as good as this---but then again if the world was like that this wouldn't feel as special. So I'll just stick to being IMMENSELY grateful that it exists in this universe.This is no ordinary sequel. It's art of the highest form.",
    "70": "It's been some time since I've walked out from a cinema feeling as satisfied by a film as this!I enjoyed Into The Spider-verse, in my humble opinion, this went one better, my anticipation for the next installment has definitely gone up a few notches.The best element for me, the visuals, I'd argue this was a labour of love by the team behind it, it looks sublime, the action sequences are seamless, one to the next, jaw dropping.Pacing is terrific, visit the loo or go for a drink at your peril, you may just miss something.I think this is a film that fans of Spider Man, any fans, new or old will enjoy, its appeal is so broad.I'm not a die hard Spidey fan, so some of it went over my head, but I am reliably informed by my fellow cinema goers that there were plenty of Easter eggs to hunt, lots of references to all forms of Spider Man.Shameik Moore did a first rate job, as did Hailee Steinfeld as Gwen, her character development was a key element.I assume this will win many awards, it deserves to, that good I'm going again!!!Nailed it!! 10/10.",
    "71": "LIKES:The Pace For The Most Part\n-Comic book movies are an art that requires balance to tell all it has to tell, and Miles' next story.. has A LOT to tell.-It found a good pace for me to tell the story, giving you the character development, but not at a pace that was too slow and lost on itself, for the most part.-Yet, the movie did manage to keep it slow enough that there was real development, build up, hints, and appreciation to age like fine wine.-This dynamic was very impressive to me, keeping an engaging movie for my attention, but not skimping out on the action like some of these deeper movies try to do.-That takes talent in the cooking pot as big as this, building on the past movie, but yet doing its own thing until the end for the setup.The Voice Acting\n-Everyone rocks in this movie, and I have to agree with my friend that it is grade A on many levels with what you get in live action movies.-Isaac is still strong as the anti-hero role that he often plays. His moodiness, his anger, his dark edge are mirrored in the character. There is hurt, anguish, and the fire that he shows so well, and I love how his voice is the main focus in his performance and not the looks.-Hailee Steinfeld is fantastic in Gwen. It's like taking all of her characters from her movie and integrating a piece of them into this Gwen and expanding her far into a character I really liked.-She was vulnerable and strong, a realistic character whose performance came out in spades and fully awakened the character I think they were going for.-And Moore... well Moore is just freaking amazing as Morales. That tone, vulnerability, this maturity but still immaturity cascading and once more evolving a character from the first one being believable. A stellar performance and one that I think brought so many things together, engaging with each of the others into this dynamic role.-It all works so well and I loved the strong talent bringing things to life.The Storytelling\n-There are so many who say that comic movies seldom tell a good story or are telling the same story over and over again. And to a degree... they are right.-Yet... for Across the Spider-Verse, that story feels fresh, engaging, and grounded to a degree that helps balance reality and super heroism into a great mashup.-It's not so in your face super adventures that are all about action, violence, and CGI madness, but it also isn't CW bologna about exploring our feelings in colorful underwear.-This sequel really focuses so much on building up characters, but integrating it into this main comic adventure that works to keep both involved and feel like a superhero.-I love the heart into it, and the way they built up from the first movie, but yet made this movie its own thing, until the final moments where the known cliffhanger was going to come in.-And to add relative components to it, engaging characters, and keeping those characters involved in the story... that is tough work.The Comedy To A degree\n-I really enjoyed the diverse comedy in this movie, and how many types of jokes and styles that were in it.-Miles is sort of a jack of all trades, sarcasm, banter, slapstick, he has a little bit of everything in it and I love it.-Others are just rambling idiots who are throwing so many jokes and statements that some eventually hit, but you have to listen because they fluctuate in terms of volume and such.-And other jokes are so well-timed and loaded with sarcasm that you just appreciate the laugh from the time alone.-It has it all and in relative balance to keep things fresh and not overwhelmingly stale as they hope from one joke to the other.The Nostalgia and Easter Eggs\n-Part of that comedy comes in the references loaded into this movie almost as much as the plot in this movie, and it works.-Across the Spider-Verse, tackles many famous tropes in both Spiderman comics and movies, blending the two of them together into this natural flowing arc that utilizes it well.-Nostalgia reigns supreme in this movie, all the comic and show references of the webbed wonder just taking my child nature and taking it for the roller coaster ride of finding everything I could.-But the movie references as well... so much fun as well, seeing these micro moments and nods to the other universes and watching them blended into the comedy and story.-Then to have it just in the world, it's going to make for a fun rewatch potential in the future.The Action Scenes\n-A huge step up, Across the Spider-Verse took my dislike from the first film and unleashed much more of the action I knew it had.-The opening scene paints for some great things to come, but soon the fight scenes and adventure transform into something that is fun, exciting, and family friendly.-Chase scenes have energy, with styles that flow and show off the heart of the animation, feels of the comic book and fan art coming together into this cascade of color and energy.-I loved the way that they evolved past punches and added more emotions and stakes that though predictable still held glimmer of exciting twists if they come.-And the fact they can punch, kick, and slam without being bloody messes should please so many, alongside the fact that the action all goes in line with the actual plot.The Animation/Art Style\n-You've seen the trailers and the first one and know how beautiful the movie is. Amidst the blurry backgrounds, the movie really has bold art direction that captures comic book spirit.-The computer animation goes well with the natural feel of the art, and I loved the way it felt like flipping through a flip book and seeing it come to life.-It respects both worlds so well, and like the story keeps things easy to follow and discover to appreciate everything the Spider-Verse had to offer. That was epic.-And to keep all that in relatively stable camera work, something the first movie struggled with, shows how you can really continue to improve if you take the time and think things through.DISLIKES:The Comedy A Bit Too Forced\n-There are times where the humor is a bit forced for me, primarily in the moments where they just spout joke after joke after joke to the point where things get lost.-These moments are few and far between for me, but there are times where a character gets annoying over funny.Some Pacing Offsets\n-There are times where the movie trips up on the pace for me. A few moments where the conversations are dragged out or we get a tad touchy feeling and not enough of seeing what's going on.-This happened about the first hour or so for me, but once that part passes most of the movie establishes the pace I talked about for much of the movie.-At least until the need.The Ending 20 minutes for me\n-The ending 20 minutes felt very dragged out as it set up the cliffhanger we knew was coming the moment it said part 1 long ago.-The ending is very drawn out, you know the movie is over, and you know what is coming, but it uses the art to drag it out, bloating the movie for the twenty minutes that could have been in the next movie.-Fortunately one of the final moments adds that fantastic bridge with music, shots, and feels that work, but still... we could have cut a few things out.-And fortunately there are no end credits, which there does not need to be.The Sound Quality With Some Characters\n-It might have been my theater, but some of the characters mumble and talk fast meaning... it's hard to hear them.-Spider-Punk has some of the best lines, but they get drowned out by background noise, mumbling speakers, and sound inconsistencies.-This leads to missing several things and taking away from the character that seems so cool, and this happens to several other characters when there is so much noise. As such, those moments are annoying to me, but again could be theater dependents.The VERDICT:\nOverall, the praise is worthy to Across the Spider-Verse, and I was very happy with much of the film that they brought to life to this theater. It's a sequel that does things right, taking the first movie's foundations and bringing with it something to build up and enjoy to the full extent. That bold and beautiful art has been refined to near perfection, and does so much storytelling alone that it's almost enough to go see it just for that in theater. But the movie integrates story, morals, comedy, nostalgia, and action to a degree that really feels like some of the strongest storytelling in a superhero movie. I love the authentic feel of a superhero story, and I love the passion of balancing so much in a movie without every losing track of the story to tell. Sure there were pacing issues and some sound flops for me, but that's really minor when it comes to the movie overall and everything they did to make this movie the middle of the trilogy, but still stand on its own. You can obviously guess I'm recommending this for the theater, and yes families can see it as there aren't too much dark moments. And my scores for those who need it are:Animation/Action/Adventure: 9.0-9.5\nMovie Overall: 8.5.",
    "72": "\"Spider-Man: Across the Spider-Verse\" currently has an astounding overall rating of 9.0. Like many other incredibly high ranked movies, I'm sure over time the score will drop but given it's so high now, I cannot imagine it leveling off below 8.0...meaning it's one of the best rated movies of all time. Well, while it might be a great crowd-pleaser, I am writing a dissenting review....and if you are like me, you might not be as bowled over as most reviewers.To put things in perspective, I am 59 years-old and certainly NOT in the target audience....so keep this in mind. While I like an occasional superhero film, I also don't adore them...but I did think the previous Spider-Man film, \"Spider-Man: Into the Spiderverse\" was one of the best of its genre. In fact, I gave it a 10...I was that impressed with its originality and story and animation. So why was I left colder by its sequel? Well, there are several reasons. First, if you are like me and not all that familiar with Spider-Man, you'll probably find much of the story confusing...unlike the previous film. Second, the artwork, while very original, made my brain hurt! It was LOUD and BRASH and really awful...at least to me. The worst part was that the backgrounds actually looked like I was watching a 3-D movie WITHOUT 3-D glasses! Uggh...it was an assault on my eyes. And, third, I hated how the film ended with no plot resolution whatsoever....none.So does all this mean I hated the film? No. I laughed quite a few times...and mostly when it introduced other alternate universe Spider-creatures (many are women or animals...not just Spider-MEN). I also thought the basic story, once you strip away the horribly fast edits and garish artwork, was very interesting. Overall, not a bad film but I just did not particularly enjoy it nor do I particularly need to see the third and final film in the series.",
    "73": "I absolutely loved 2018's \"Into the Spider-Verse\". It not only earned its \"Best Animated Picture\" Oscar, not only was it the best Spider-Man movie, but it stands as a landmark in animation. It set the record for most animators working on a single film. That record was then broken by this sequel. With five years of anticipation, and with the talented hands of Lord and Miller behind the scenes I was super hyped for this movie. I was prepped to love this film. I had heard nothing but good things, and all its praise is well deserved. But I couldn't help but walk away just saying the film was...good.Given the film's stellar reception, I feel compelled to explain why I only am giving this film a respectable 7. First off, this film is not a complete story. It is a \"part 1\" and ends on a \"To Be Continued...\". I don't think that's a spoiler considering the original teaser advertised it as \"Across the Spider-Verse: Part 1\". But like the great cliff hangers of the past, like \"Two Towers\", \"Empire Strikes Back\" or \"Back to the Future part 2\", the movie needs to complete some self-contained conflict. This film does not complete a conflict. There is no feeling of resolution. I feel my full review is currently being held hostage from the fact that the story is incomplete. I can't give this full marks considering the story could end like the series \"Lost\" and completely undermined the whole journey.With that out of the way, I can tell you all the things that makes this movie great. The animation is a step up even from the previous groundbreaking entry. There are so many different animation styles that the team juggles, and it they all looked visually stunning. For some it may be over stimulation, but I thought it moved at just the right speed.The \"fan service\", \"Easter Eggs\" or whatever you want to call them, are never overused. There are some movies that treat the Easter Eggs like they are the main course, this movie balances them well. They never overstay their welcome and always add to the story as opposed to distract from it.The humor is spot on. There are so many jokes in this movie that had me laughing awkwardly loud. The jokes don't have the typical MCU problem of detracting from a serious moment, those are given the time to breath. But the jokes are fast paced, witty and come from a variety of sources. There are visual gags, character jokes, situational jokes and it isn't all reliant on a single person for their humor.And the action in this movie, it is next level stuff. Every fight scene or chase scene is like the bridge fight in \"Kung Fu Panda\". The movement is fluid, the detail is superb, and everything falls in just the right place. It is poetry in motion, since they are Spider-Men doing the action, all the acrobatics and reflexes work well within the story. It is a reminder of what makes this character so much fun to write for.There are 2 main conflicts that pop up in the story, both feeding into the same narrative theme. When the second comes into focus, that is where the movie loses some momentum. It is nice for story reasons in that our hero feels completely alone. The problem is it raises a lot of questions that might get answered in later movies, but for now are ignored. On the positive side, just when I think I have the film figured out, it throws one last hook at me, and absolutely has me hooked for the next one.Who knows, maybe one day when the trilogy is completed, I will come back and amend my review. But as it stands right now, I can't give it anything higher than what I gave it. Don't let me down third movie, with great power, comes great responsibility.",
    "74": "I am absolutely lost for words. How the hell did they top the first one??? This is easily, without a shadow of a doubt, the film of the year. It perfectly balances humour and emotional beats on a razor thin blade. It's richly layered, complex and the attention to detail is absolutely incredible. The story is phenomenal, the characters are believable and have excellent levels of depth, the soundtrack is fantastic. My expectations were completely exceeded, I spent the entire 2h 30m runtime in awe. But one thing above all deserves very special praise :THE ARTWORK.This films aesthetic is jaw-dropping, I found myself plunged (for the second time now) straight into the pages of a comic book from my youth. The use of colour is remarkable, the animation is smoother than silk, the textures, the backgrounds, the lighting, the style itself - everything blends together perfectly to create one of the most visually stunning things ever committed to the screen. Almost any shot could be a painting, with inextricable layers upon layers of marvellous detail, hand-crafted by some extremely talented individuals. This is cinema.If this doesn't win the Oscar for best animated feature I'm rioting, and you'd better join me. GO AND SEE THIS FILM RIGHT NOW.",
    "75": "I was a huge fan of the first movie, excited for the sequel and pretty hopeful after I saw massive amount of RAVE reviews online claiming it to be better than the original. Well, that couldn't be further from the truth. The runtime was way too long and I FELT it from the beginning of the movie! (during Gwen's 20 minute opening.) By the time the film picked up its pace and stakes (the last 30 minutes) I was already mentally checking out, watching the time and waiting for it to end. And yes, basically nothing is resolved by the end of it, if you're wondering. Multiple people in my theater were groaning as the credits began rolling, due to the cliffhanger. Scenes stretched on far too long, had repetitive dialogue and just set up the final movie. I truly don't see the hype about this one. I think the wrap up next year will be good, I have seen films do a better job in a trilogy of making the second movie mean something. I feel harsh saying this, as the animation, soundtrack and characters are awesome! I just feel like people are acting like this is the best animated movie to be released, but it's just not. It doesn't live up to the greatness of it's predecessor. Hopefully the finale next year will make it all worth it!",
    "76": "I loved into the spiderverse, it had great animation, great characters, great plot development and great music. There is simply no way across the spiderverse is better. By the end of this it felt like they were dragging it out and I had lost interest quite some time previously. The animation is good but sometimes less is more, and there was less differentiation between the styles, I don't think bill sienkiewicz was involved in this one. I remember my emotions building in the first one, peaking when what's up danger kicked in in the soundtrack, but this got into some schlocky emotional teen drama territory that made me yawn. I also felt it was a bit cynical to split it in two, I'm sure the full story could have been told in one movie which would have upped the quality of the animation too. Then there was the sense of universal danger overload that this and other stories revert to to ramp up the drama; whether a universe or every parallel universe and it's uncle is at stake, who cares, trying to make it bigger than before doesn't increase drama, that comes from character and plot development, yeah, like it did in the first one. It needed more jokes too, nowhere near as funny as the last time.",
    "77": "Spider-Man - Across the Spider verseI am at a loss to understand the high scores on this movie, it was tedious in the extreme, we had no proper story, all that remained was emotions, feelings and a whole array of woke tropes. The one thing that is central to the Spider-man comics is a good strong story and nearly every film reflects this need, here it was missing.The graphics were very weird and at times just looked half finished, it was very much style over substance, Disney/Pixar would have realised this so we, the viewer, remain focused on the story and not the artwork. Animation must not be the star of the show, it is merely a vehicle in telling a story, even in Tron, animation at its most extreme, served to tell the story.With had scene after scene of breathless freneticism, I was quite frankly bored, this amounts to \"meat and no bones\", you just cannot sustain a movie on action alone, you observe in Rocky or Mission Impossible how all the action sequences are balanced with other elements.I really can't see why this movie was made and who was the target audience, I am a life long fan of Spider-Man, and this left me cold as it had just nothing for the fans, and it totally lacked any humour which is key.I'm giving this 2 outta 10 to my mind it was a disaster.",
    "78": "Spider-Man: Across the Spider-Verse is the first of a two part movie. These studios should be legally required to put \"part 1\" in the title. Fast X did the same thing and I felt unsatisfied when the movie abruptly ends with everything completely unresolved.Now Across the Spider-Verse endlessly better, but I still had that unsatisfied feeling when I realized I was watching the first half of a really long movie. So much is set up in the first act, including a cool villain, and is left completely unresolved.Think about your favorite movies. Now imagine that when you saw them for the first time, someone cut it off halfway through and made you wait a year for the rest. A movie needs to be able to stand on its own.Aside from that, I pretty much love this movie. I don't think it's as good as the original, but that's a high bar. The animation is incredible, especially during a long intro scene in a different universe. There are so many different styles and techniques. The characters are awesome, as are the ideas in this story.My only real issue is that the story felt a little messy and all over the place. But that made way more sense when I realized it was half of a movie. That's why we're still getting setup and introducing conflicts late in the movie. We'll have to wait and see how the second part pulls it all together. I also found the sound a little low during the action scenes and sometimes had trouble hearing the dialogue, even in Dolby Atmos.I already can't wait to see the next one. And if it does everything right, I can see myself raising the score for this one. I had a great time with Across the Spider-Verse. I also feel a bit unsatisfied.EDIT: On second viewing, I feel the same. It's awesome, but it's not complete. Instead of exciting escalation to a beastly climax, in the last half hour we get setup.(2 viewings, opening Thursday UltraScreen 6/1/2023, UltraScreen 6/7/2023)",
    "79": "Adjusted rating - 8.5/10: a genuine spectacle, you could take thousands of shots from this movie and turn them into posters, it's beautiful to look at. I'd definitely suggest seeing this at the cinema because the use of colours and the work which has gone into the animations is undoubtedly the highlight, I actually can't think of a more visually creative movie I've seen. Great soundtrack too, and quite funny. One of my criticisms is it's got that \"Deadpool\" kind of style where literally everything is tongue in cheek, it needed more genuinely serious scenes just to break it up. Like there are these big arguments and then a joke is thrown in half way through, who does that? Also it's got quite bad dialogue but it's a family superhero movie so I went in expecting that, only a minor point really.Real rating - 7/10: it's half a movie man!! It's a part 1, and I feel a bit cheated that I went in not knowing that. There was commotion in the cinema when it ended, a lot of people were annoyed. I just don't get this trend in cinema, for me a great movie needs to be able to stand on its own. 2h30 is plenty of time to tell a compelling story without ending on a cliffhanger. Think the plot would've been better suited to a series format - it's already kind of like a high budget Arcane in feel - but obviously that wouldn't work with the first movie and it wouldn't make as much money. To make it a great movie they should've dissolved one of the sub plots and actually finished it.",
    "80": "I rarely write reviews, but this movie is truly exceptional. It takes everything that was great about the first film and elevates it to a whole new level. I have honestly never witnessed such remarkable animation as in \"Across the Spider-Verse.\" The visuals are breathtaking, featuring a wide array of styles. It is a true multiverse experience, with an abundance of captivating details in every frame, including numerous Easter eggs and a vibrant color palette. I found myself not wanting it to end, despite its substantial length. Knowing that the next part will be released in 2024 brings me immense joy because waiting a few more years to see how this story unfolds would be agonizing.The story is exceptionally well-crafted, expanding upon the existing characters while introducing new ones and incorporating intriguing twists. The humor throughout the film is spot-on, providing moments of levity without undermining the emotional depth of the narrative.Just go and see it!",
    "81": "The good: This is a gorgeous and competently made film. With every scene / direction / frame constructed meticulously and it shows. It pushes the boundaries of animated movies and does it with style. The voice acting is good. The movie respects and pays homage to spider-man lore whilst offering something fresh (hard to pull off). Almost all the side characters feel real and fleshed out - even those with minimal screen time.The bad: It's most definitely a middle chapter and the film suffers for it. The movie is long, the pacing suffers, and scenes feel drawn out - which makes sense when you understand it's not trying to reach the end. The movie 'finishes' literally in the middle of a plot beat - when it didn't need to. Empire Strikes Back has shown us how it's done. It feels like pure marketing/money making tactics. A shame.Should you watch it: If you like Into the Spider-Verse - most definitely. The film pays homage to spider-man (both on and off screen) while offering something new. It's also just a brilliantly made animated film. Highly recommended.",
    "82": "Across the Spider-Verse is a good film, better than the first one for sure but not something that should have 8.9 rating. I'm mixed about the animation, some things look really great but the other half is nauseating. I really didn't like the phasing, the movie is more than 2 hours long and it feels like the chase scene in the multiverse takes 1/3 of the film. The Spot is a fun villain but still don't get how he suddenly goes from wanting to rob an ATM machine to wanting to destroy the entire world, don't like how he just disappeared for the rest of the film. Miguel was fun even though his backstory was also really generic. Across the Spider-Verse is a good movie, but it relies on flashy animation and fanservice to cover up it's flaws. For example, am I the only one not ok with classic Peter Parker bringing his daughter to extremely dangerous places? Or with Spider-Woman getting slammed to a train while being pregnant? Also, too many Spider-Mans are just a parody of themselves. Don't get me started with awful modern humor. Overall, the sequel is better than the first film, but even more overrated. Flawed plot, great animation, ok soundtrack, fun action, too much fanservice.",
    "83": "This is whiteout a doubt peak Spider-Man and even peak cinema!Every scene in this animation movie was as good as perfect! The coloring, animation, character designs, music and the way they used the Spider humor was so funny and well timed!Bonding with character hasn't been as easy as it is here, they really explore the backgrounds of the different characters so emotional and passionately at the same time.It's a necessary darker & more emotional storyline for the characters but that's just how Peter Parkers storyline is...\nIt's a 2h20 movie but there wasn't one scene that I would've left out, I would've even preferred for it to go at almost 3h cause I wasn't a huge fan of the ending! You'll know when seeing it!There are so many Easter eggs & Spider-man's it to crazy for words!What more can i say than this is a masterpiece and probably the best Spider-Man movie to date!",
    "84": "I was really blown away by this masterpiece. It's beautiful, clever, funny and deep. And it dares being a comics in each and every frame. It never allows you to forget these are drawn characters you see. Unlike so many animated movies of recent time it doesn't go for the smooth polished look it makes certain we never forget that we watch a comics book that was brought to life on screen. Just like Rembrandt made sure we all see his brush strokes when we watch his paintings. But just like Rembrandt, it's done without allowing the technical mastery of it all to drop one little bit. But it's way more than simple issue of the looks of it. This is comics all the way, thematically as well as visually, hence the ending we got.They didn't give up on anything; didn't allow a single detail to go amiss. They wouldn't give up on any bit of storytelling. It's all there, no matter how long the final cut will be, and still, it's not too long not even a second too long. The characters are all fully developed - real human beings drawn in comics form, but human just like any of us watching them on screen. It calls for some of the best voice acing I've seen, by each and every member of the cast. I simply can't single out anyone of them. They were all superb.And than the story itself - It's way more than just sci-fi comics. It doesn't limit itself to the usual issues of power and its moral implications. It's asking us the deep questions of what determines the path our life take? Are we ruled by our destiny? Is it all written in our stars? If I had a problem with most of the comics I read it was because of the fatalistic approach adopted by most of them. This one defies the tradition in the best way. It breaks down all the accepted rules and leaves us all hanging in one of the best cliff hangers ever.If you love comics, science fiction, action movies or simply real brilliant cinema - go see it.",
    "85": "Sad night tonight. After 80-odd years, this was the last film to show in my local cinema before it closed down. Doubly sad because it's also not actually very good. The conceptualisation behind the hybrid styles of animation is spectacular and executed in an highly polished fashion - as you'd expect. The story is all over the pace though, and the proliferation of Spidey's seemed designed more to allow the narrative to become more culturally inclusive (and bankable) rather than to develop any meaningful characterisations. What personas there are spend their time wallowing in a mire of unrequited and/or confused familial love, or teenage angst more suitable in a soap. The dialogue has it's moments - assuming you can catch it - and there's a bit of humour to be found but I found the audio mix made following all that was said became a bit wearisome after a first hour that really does depend on your having watched (and remembering) the first - in my view far better - instalment. This whole \"multiverse\" theme can keep on recycling itself ad nauseam but if the writing remains at this unremarkable level then I'm not sure I'll be bothering with the next set of repetitively set-piece adventures for \"Miles\" and his parents, love interest and fellow Spider-folk.",
    "86": "The animations are fantastic. Something between 3D, comics and animated film. Other... Where to start? 2.5 hours of a festival of colors and chaos. The film seems to have been made by someone with serious ADHD while on LSD. There is rarely a pause between sentences to process what has been heard. Combined with the cluttered animations, I had the impression that I was watching the movie at 1.5x speed. It can be seen that the film is totally adapted to new generations. Parents are friends instead of being parents, they use slang, everything is colorful, fast and \"adapted\" to short attention spans. There is no tension, the dialogues just flow without much expressiveness or meaning. There is more drama than action. Once again, the animations and style are absolutely phenomenal. The level of dialogues, scripts and everything else is not at the level of animations. The movie had to be at least half an hour shorter with a better story, less woke crap and far more suspense. This gives the impression that it is a Coca Cola advertisement. Due to excessive animations and hasty speech, the film is difficult to follow for long periods of time. A good idea, but the execution (except for the animations) is average at best.",
    "87": "Best Spider-Man movie ever???, more of like the worst Spider-Man movie i've ever watched, Across The Spider-Verse is indeed fits with the title, it's basically a set up movie for the big finale/battle for the next movie, this movie is just the middle of it, i have so many problem with the film from it being too incredibly long, incredibly slow, and incredibly quiet, i don't know if it's just my theater that the volume of the movie was low but it's just not right, the slowness of the narrative and pacing really bothering me, even the dialogue was so slow that the quiet distance between each line i can hear couple people snoring because how so empty the film is, how boring the movie is, and i'm not blaming them at all, it fills with so many unnecessary long slow scene, the soundtrack was bad and compare to the fire soundtrack of the previous movie there is zero memorable song, the voice acting pissed me off too because how they talk mostly so quitely and so whispery and it also sounds mostly like they have no emotion at all, Across The Spider-Verse is missing a lot of the key part including the OG team with Spider-Man Noir, Peter Porker, etc. And i miss the depressed Peter B. Parker and in here he's having a perfect life which is good but not as fun and as engaging of a character anymore, the side villain of this movie was Miguel as Spider-Man 2099 and it didn't work as he was not as cool or as menacing as i expected, so do The Spot unfortunately, the positive was of course the animation was still great, i like both Spider-Man India and Spider-Punk, the action was decent, wasn't really blown away by it, it's quite entertaining, the cameos are fine, but the obvious cameos was very disappointing for me, anyway, Across The Spider-Verse for me was a bad example of a set up movie, a set up movie shouldn't be this long except if you fill it with a boring long narrative that fills with so many unnecessary long slow scene with bland and weak story, weak voice acting, and wrong decisions like this one, Across The Spider-Verse is bad, it's a failure, it's a complete waste of time and it could not be a waste of time if it's execute properly with the runtime, the content, and the story, it could be a less than 2 hours movie of a set up instead of more 30 plus minutes of unnecessary boring content, Into The Spider-Verse was a triumph while Across The Spider-Verse was a blunder, and i have my reason and that's the most important.",
    "88": "Its not bad, it just doesn't fill the shoes.The movie is caught up in doing a bad impression of the original but misses the small details and cleverness that made the original a hit.So much of the plot and dialog is flat. The surprises didn't surprise me. I barely noticed them. The jokes where uninspired. I think I laughed once. The stakes where much higher but the tension felt much lower.Its worse in the technical aspects as well. Sound design, Pacing, Art Direction, Character Depth and Development all worse. Technically Across the Spider-Verse has a deeper world but not much of it was not memorable. I felt like the movie took a long time to say and show very little where the original did the complete opposite.When the squeal was announced and I heard they had different directors I raised an eyebrow. I lightly considered that team to be miracle workers. Unfortunately the concerns seem proven. The current Directing team says they're done after the second act of Across the Spider-Verse.I know a colossal amount of time, energy and love went into this movie and I'm scorching it. Squeals are notoriously hard to balance. They are often caught between what the original was and what so many people imagine that it should have/ could have been. Squeals sometimes they get tangled trying to be an unnecessary correction.Despite all these criticisms its still a good movie. There was a lot to appreciate. It was fun and characters will make you feel something. The best parts of the movie where all around the Parents of the many Spider-Verses. They tried to make the importance of family the core but that is difficult in an action movie were the hero's are living split secrete lives. Holding out hope for the next one.",
    "89": "I admired Spider-Man: Across the Spider-Verse. I did not like it enough, it was not memorable enough and it was more interested in leaving it all to a sequel.Miles Morales has to deal with a villain called The Spot. He was an Alchemax scientist whose body was infused with portals during a collider explosion. He now blames Miles for his condition as he also brought a spider from another dimension that bit Miles, giving him spidey superpowers.Meanwhile Miles collides with Gwen Stacy, although she is from another dimension as well, where she is also Spider-Woman.In short Miles and Gwen as well as others chase the Spot through the multiverse. Only the Spot has plans of his own.The film starts off slowly, a crawl before getting supercharged. It just lacks the punch and effervescence of the first movie in this cartoon series.",
    "90": "I loved loads about this film, mainly the amazing action sequences and the sweet sweet fan service (one bit of fan service got a big loud oooooh from myself and most of the cinema).The problem I had with it is that despite it being a 2 parter so much of the emotional exposition was stretched out far longer than necessary through overlong dialogue. About an hour of the film is dedicated to ensuring we understand that Miles is a young man finding his path through life (I have no idea how some of the younger kids in the audience sat through it, they must have just been mesmerised by the flashy colours). It could have been handled in a much more condensed manner by better writers and still had the required impact. Given the film ends at a point that feels like a natural final third act it left me feeling shortchanged.If the overlong dialogue scenes had been condensed then I believe there would have been no need for the 2 parter. But then people wouldn't pay to see 2 films instead of 1.I expect when the initial mega fan reaction dies down and more ordinary filmgoers leave shocked at the \"to be continued\" message the IMDb score will dip dramatically.",
    "91": "One of the best animated movies I've ever seen, hands down. I wasn't the biggest fan of the first. I thought it was a tad overrated. This one takes the strengths of the first and ups it to 11.The animation: etherealThe voice acting: pristineThe story: well doneThe characters: convincing and well-developedThe themes in this movie are very good, and they're told in a thought out and mature way. In other words, it's not afraid to make you feel things and maybe scare your kids a little, despite the PG rating.Comparisons may not always be the best thing, but I believe this movie is better made than No Way Home.The twists at the end were completely unexpected. Overall, the final chapter was set up in a fantastic way.",
    "92": "Ok, my title is deliberately snarky, but ...Like the first movie, the animation here is spectacular. Plus, there are lots of incidental pleasures, mainly seeing all the different Spidermen and their crazy powers and costumes.However, I just wasn't that taken with the characters and plot. Maybe I'm too old for these sorts of films, but do we really need scene after scene of whiny teenagers talking about their feelings? Personally, all I really want from a Spiderman movie is some fun web action and a few zingy one liners. And a more interesting villain than the one we got here.Perhaps I'm old-fashioned, but I always thought the point of superheroes was to be focused on others - saving the world and all that - not endlessly dissecting their own emotions and obsessing about their families and relationships. Guess this just reflects the world we live in: a Spiderman movie for the me, me, me generation.",
    "93": "Into the Spider-Verse was one of the rare big studio movies that felt fresh, authentic and full of heart. Across the Spider-Verse falls short of matching its predecessor in each of those counts.Whenever a superhero movie succeeds, big studios try to distill its essence down to a formula, trim out any creative risks to make it safe for large-scale public consumption and add some fanservice. This is the case with the second instalment of Spider-verse.Except for the art. The art was brilliant and original. But little else stays with you after after the end.On a side note, is anyone else tired of multiverses? In the first movie, spider-beings from different dimensions were fresh and funny. Twenty popular movies and series later, it feels played out. The central plot feels like something out of an old Rick and Morty episode.But the bigger problem was this: the essence of Spider Man stories is that he is both a teenager and a superhero. He has typical teenager problems, struggles to juggle his double life, makes mistakes and learns from them. The first half of the movie followed that template and was good fun to watch.But then the movie turns it upside down and the teens become smarter than the adults. The adult Spider folks in Spider HQ(which was basically Citadel of Ricks from R&M) not only approach a sensitive conversation with Miles with the delicacy of a sledgehammer, it's unclear if they even know what they are talking about.The centrepiece of the movie is an extended chase scene with little suspense about the result. Here's another thing that annoys me: making your hero suddenly overpowered by having them beat other characters in a way that defies in-universe logic.The English punk spiderman made me chuckle though.",
    "94": "The good: This is a gorgeous and competently made film. With every scene / direction / frame constructed meticulously and it shows. It pushes the boundaries of animated movies and does it with style. The voice acting is good. The movie respects and pays homage to spider-man lore whilst offering something fresh (hard to pull off). Almost all the side characters feel real and fleshed out - even those with minimal screen time.The bad: It's most definitely a middle chapter and the film suffers for it. The movie is long, the pacing suffers, and scenes feel drawn out - which makes sense when you understand it's not trying to reach the end. The movie 'finishes' literally in the middle of a plot beat - when it didn't need to. Empire Strikes Back has shown us how it's done. It feels like pure marketing/money making tactics. A shame.Should you watch it: If you like Into the Spider-Verse - most definitely. The film pays homage to spider-man (both on and off screen) while offering something new. It's also just a brilliantly made animated film. Highly recommended.",
    "95": "Across the Spider-Verse is a good film, better than the first one for sure but not something that should have 8.9 rating. I'm mixed about the animation, some things look really great but the other half is nauseating. I really didn't like the phasing, the movie is more than 2 hours long and it feels like the chase scene in the multiverse takes 1/3 of the film. The Spot is a fun villain but still don't get how he suddenly goes from wanting to rob an ATM machine to wanting to destroy the entire world, don't like how he just disappeared for the rest of the film. Miguel was fun even though his backstory was also really generic. Across the Spider-Verse is a good movie, but it relies on flashy animation and fanservice to cover up it's flaws. For example, am I the only one not ok with classic Peter Parker bringing his daughter to extremely dangerous places? Or with Spider-Woman getting slammed to a train while being pregnant? Also, too many Spider-Mans are just a parody of themselves. Don't get me started with awful modern humor. Overall, the sequel is better than the first film, but even more overrated. Flawed plot, great animation, ok soundtrack, fun action, too much fanservice.",
    "96": "This is whiteout a doubt peak Spider-Man and even peak cinema!Every scene in this animation movie was as good as perfect! The coloring, animation, character designs, music and the way they used the Spider humor was so funny and well timed!Bonding with character hasn't been as easy as it is here, they really explore the backgrounds of the different characters so emotional and passionately at the same time.It's a necessary darker & more emotional storyline for the characters but that's just how Peter Parkers storyline is...\nIt's a 2h20 movie but there wasn't one scene that I would've left out, I would've even preferred for it to go at almost 3h cause I wasn't a huge fan of the ending! You'll know when seeing it!There are so many Easter eggs & Spider-man's it to crazy for words!What more can i say than this is a masterpiece and probably the best Spider-Man movie to date!",
    "97": "I was really blown away by this masterpiece. It's beautiful, clever, funny and deep. And it dares being a comics in each and every frame. It never allows you to forget these are drawn characters you see. Unlike so many animated movies of recent time it doesn't go for the smooth polished look it makes certain we never forget that we watch a comics book that was brought to life on screen. Just like Rembrandt made sure we all see his brush strokes when we watch his paintings. But just like Rembrandt, it's done without allowing the technical mastery of it all to drop one little bit. But it's way more than simple issue of the looks of it. This is comics all the way, thematically as well as visually, hence the ending we got.They didn't give up on anything; didn't allow a single detail to go amiss. They wouldn't give up on any bit of storytelling. It's all there, no matter how long the final cut will be, and still, it's not too long not even a second too long. The characters are all fully developed - real human beings drawn in comics form, but human just like any of us watching them on screen. It calls for some of the best voice acing I've seen, by each and every member of the cast. I simply can't single out anyone of them. They were all superb.And than the story itself - It's way more than just sci-fi comics. It doesn't limit itself to the usual issues of power and its moral implications. It's asking us the deep questions of what determines the path our life take? Are we ruled by our destiny? Is it all written in our stars? If I had a problem with most of the comics I read it was because of the fatalistic approach adopted by most of them. This one defies the tradition in the best way. It breaks down all the accepted rules and leaves us all hanging in one of the best cliff hangers ever.If you love comics, science fiction, action movies or simply real brilliant cinema - go see it.",
    "98": "Sad night tonight. After 80-odd years, this was the last film to show in my local cinema before it closed down. Doubly sad because it's also not actually very good. The conceptualisation behind the hybrid styles of animation is spectacular and executed in an highly polished fashion - as you'd expect. The story is all over the pace though, and the proliferation of Spidey's seemed designed more to allow the narrative to become more culturally inclusive (and bankable) rather than to develop any meaningful characterisations. What personas there are spend their time wallowing in a mire of unrequited and/or confused familial love, or teenage angst more suitable in a soap. The dialogue has it's moments - assuming you can catch it - and there's a bit of humour to be found but I found the audio mix made following all that was said became a bit wearisome after a first hour that really does depend on your having watched (and remembering) the first - in my view far better - instalment. This whole \"multiverse\" theme can keep on recycling itself ad nauseam but if the writing remains at this unremarkable level then I'm not sure I'll be bothering with the next set of repetitively set-piece adventures for \"Miles\" and his parents, love interest and fellow Spider-folk.",
    "99": "The animations are fantastic. Something between 3D, comics and animated film. Other... Where to start? 2.5 hours of a festival of colors and chaos. The film seems to have been made by someone with serious ADHD while on LSD. There is rarely a pause between sentences to process what has been heard. Combined with the cluttered animations, I had the impression that I was watching the movie at 1.5x speed. It can be seen that the film is totally adapted to new generations. Parents are friends instead of being parents, they use slang, everything is colorful, fast and \"adapted\" to short attention spans. There is no tension, the dialogues just flow without much expressiveness or meaning. There is more drama than action. Once again, the animations and style are absolutely phenomenal. The level of dialogues, scripts and everything else is not at the level of animations. The movie had to be at least half an hour shorter with a better story, less woke crap and far more suspense. This gives the impression that it is a Coca Cola advertisement. Due to excessive animations and hasty speech, the film is difficult to follow for long periods of time. A good idea, but the execution (except for the animations) is average at best.",
    "100": "Best Spider-Man movie ever???, more of like the worst Spider-Man movie i've ever watched, Across The Spider-Verse is indeed fits with the title, it's basically a set up movie for the big finale/battle for the next movie, this movie is just the middle of it, i have so many problem with the film from it being too incredibly long, incredibly slow, and incredibly quiet, i don't know if it's just my theater that the volume of the movie was low but it's just not right, the slowness of the narrative and pacing really bothering me, even the dialogue was so slow that the quiet distance between each line i can hear couple people snoring because how so empty the film is, how boring the movie is, and i'm not blaming them at all, it fills with so many unnecessary long slow scene, the soundtrack was bad and compare to the fire soundtrack of the previous movie there is zero memorable song, the voice acting pissed me off too because how they talk mostly so quitely and so whispery and it also sounds mostly like they have no emotion at all, Across The Spider-Verse is missing a lot of the key part including the OG team with Spider-Man Noir, Peter Porker, etc. And i miss the depressed Peter B. Parker and in here he's having a perfect life which is good but not as fun and as engaging of a character anymore, the side villain of this movie was Miguel as Spider-Man 2099 and it didn't work as he was not as cool or as menacing as i expected, so do The Spot unfortunately, the positive was of course the animation was still great, i like both Spider-Man India and Spider-Punk, the action was decent, wasn't really blown away by it, it's quite entertaining, the cameos are fine, but the obvious cameos was very disappointing for me, anyway, Across The Spider-Verse for me was a bad example of a set up movie, a set up movie shouldn't be this long except if you fill it with a boring long narrative that fills with so many unnecessary long slow scene with bland and weak story, weak voice acting, and wrong decisions like this one, Across The Spider-Verse is bad, it's a failure, it's a complete waste of time and it could not be a waste of time if it's execute properly with the runtime, the content, and the story, it could be a less than 2 hours movie of a set up instead of more 30 plus minutes of unnecessary boring content, Into The Spider-Verse was a triumph while Across The Spider-Verse was a blunder, and i have my reason and that's the most important.",
    "101": "Its not bad, it just doesn't fill the shoes.The movie is caught up in doing a bad impression of the original but misses the small details and cleverness that made the original a hit.So much of the plot and dialog is flat. The surprises didn't surprise me. I barely noticed them. The jokes where uninspired. I think I laughed once. The stakes where much higher but the tension felt much lower.Its worse in the technical aspects as well. Sound design, Pacing, Art Direction, Character Depth and Development all worse. Technically Across the Spider-Verse has a deeper world but not much of it was not memorable. I felt like the movie took a long time to say and show very little where the original did the complete opposite.When the squeal was announced and I heard they had different directors I raised an eyebrow. I lightly considered that team to be miracle workers. Unfortunately the concerns seem proven. The current Directing team says they're done after the second act of Across the Spider-Verse.I know a colossal amount of time, energy and love went into this movie and I'm scorching it. Squeals are notoriously hard to balance. They are often caught between what the original was and what so many people imagine that it should have/ could have been. Squeals sometimes they get tangled trying to be an unnecessary correction.Despite all these criticisms its still a good movie. There was a lot to appreciate. It was fun and characters will make you feel something. The best parts of the movie where all around the Parents of the many Spider-Verses. They tried to make the importance of family the core but that is difficult in an action movie were the hero's are living split secrete lives. Holding out hope for the next one.",
    "102": "I admired Spider-Man: Across the Spider-Verse. I did not like it enough, it was not memorable enough and it was more interested in leaving it all to a sequel.Miles Morales has to deal with a villain called The Spot. He was an Alchemax scientist whose body was infused with portals during a collider explosion. He now blames Miles for his condition as he also brought a spider from another dimension that bit Miles, giving him spidey superpowers.Meanwhile Miles collides with Gwen Stacy, although she is from another dimension as well, where she is also Spider-Woman.In short Miles and Gwen as well as others chase the Spot through the multiverse. Only the Spot has plans of his own.The film starts off slowly, a crawl before getting supercharged. It just lacks the punch and effervescence of the first movie in this cartoon series.",
    "103": "I loved loads about this film, mainly the amazing action sequences and the sweet sweet fan service (one bit of fan service got a big loud oooooh from myself and most of the cinema).The problem I had with it is that despite it being a 2 parter so much of the emotional exposition was stretched out far longer than necessary through overlong dialogue. About an hour of the film is dedicated to ensuring we understand that Miles is a young man finding his path through life (I have no idea how some of the younger kids in the audience sat through it, they must have just been mesmerised by the flashy colours). It could have been handled in a much more condensed manner by better writers and still had the required impact. Given the film ends at a point that feels like a natural final third act it left me feeling shortchanged.If the overlong dialogue scenes had been condensed then I believe there would have been no need for the 2 parter. But then people wouldn't pay to see 2 films instead of 1.I expect when the initial mega fan reaction dies down and more ordinary filmgoers leave shocked at the \"to be continued\" message the IMDb score will dip dramatically.",
    "104": "One of the best animated movies I've ever seen, hands down. I wasn't the biggest fan of the first. I thought it was a tad overrated. This one takes the strengths of the first and ups it to 11.The animation: etherealThe voice acting: pristineThe story: well doneThe characters: convincing and well-developedThe themes in this movie are very good, and they're told in a thought out and mature way. In other words, it's not afraid to make you feel things and maybe scare your kids a little, despite the PG rating.Comparisons may not always be the best thing, but I believe this movie is better made than No Way Home.The twists at the end were completely unexpected. Overall, the final chapter was set up in a fantastic way.",
    "105": "Ok, my title is deliberately snarky, but ...Like the first movie, the animation here is spectacular. Plus, there are lots of incidental pleasures, mainly seeing all the different Spidermen and their crazy powers and costumes.However, I just wasn't that taken with the characters and plot. Maybe I'm too old for these sorts of films, but do we really need scene after scene of whiny teenagers talking about their feelings? Personally, all I really want from a Spiderman movie is some fun web action and a few zingy one liners. And a more interesting villain than the one we got here.Perhaps I'm old-fashioned, but I always thought the point of superheroes was to be focused on others - saving the world and all that - not endlessly dissecting their own emotions and obsessing about their families and relationships. Guess this just reflects the world we live in: a Spiderman movie for the me, me, me generation.",
    "106": "Into the Spider-Verse was one of the rare big studio movies that felt fresh, authentic and full of heart. Across the Spider-Verse falls short of matching its predecessor in each of those counts.Whenever a superhero movie succeeds, big studios try to distill its essence down to a formula, trim out any creative risks to make it safe for large-scale public consumption and add some fanservice. This is the case with the second instalment of Spider-verse.Except for the art. The art was brilliant and original. But little else stays with you after after the end.On a side note, is anyone else tired of multiverses? In the first movie, spider-beings from different dimensions were fresh and funny. Twenty popular movies and series later, it feels played out. The central plot feels like something out of an old Rick and Morty episode.But the bigger problem was this: the essence of Spider Man stories is that he is both a teenager and a superhero. He has typical teenager problems, struggles to juggle his double life, makes mistakes and learns from them. The first half of the movie followed that template and was good fun to watch.But then the movie turns it upside down and the teens become smarter than the adults. The adult Spider folks in Spider HQ(which was basically Citadel of Ricks from R&M) not only approach a sensitive conversation with Miles with the delicacy of a sledgehammer, it's unclear if they even know what they are talking about.The centrepiece of the movie is an extended chase scene with little suspense about the result. Here's another thing that annoys me: making your hero suddenly overpowered by having them beat other characters in a way that defies in-universe logic.The English punk spiderman made me chuckle though.",
    "107": "The good: This is a gorgeous and competently made film. With every scene / direction / frame constructed meticulously and it shows. It pushes the boundaries of animated movies and does it with style. The voice acting is good. The movie respects and pays homage to spider-man lore whilst offering something fresh (hard to pull off). Almost all the side characters feel real and fleshed out - even those with minimal screen time.The bad: It's most definitely a middle chapter and the film suffers for it. The movie is long, the pacing suffers, and scenes feel drawn out - which makes sense when you understand it's not trying to reach the end. The movie 'finishes' literally in the middle of a plot beat - when it didn't need to. Empire Strikes Back has shown us how it's done. It feels like pure marketing/money making tactics. A shame.Should you watch it: If you like Into the Spider-Verse - most definitely. The film pays homage to spider-man (both on and off screen) while offering something new. It's also just a brilliantly made animated film. Highly recommended.",
    "108": "Across the Spider-Verse is a good film, better than the first one for sure but not something that should have 8.9 rating. I'm mixed about the animation, some things look really great but the other half is nauseating. I really didn't like the phasing, the movie is more than 2 hours long and it feels like the chase scene in the multiverse takes 1/3 of the film. The Spot is a fun villain but still don't get how he suddenly goes from wanting to rob an ATM machine to wanting to destroy the entire world, don't like how he just disappeared for the rest of the film. Miguel was fun even though his backstory was also really generic. Across the Spider-Verse is a good movie, but it relies on flashy animation and fanservice to cover up it's flaws. For example, am I the only one not ok with classic Peter Parker bringing his daughter to extremely dangerous places? Or with Spider-Woman getting slammed to a train while being pregnant? Also, too many Spider-Mans are just a parody of themselves. Don't get me started with awful modern humor. Overall, the sequel is better than the first film, but even more overrated. Flawed plot, great animation, ok soundtrack, fun action, too much fanservice.",
    "109": "This is whiteout a doubt peak Spider-Man and even peak cinema!Every scene in this animation movie was as good as perfect! The coloring, animation, character designs, music and the way they used the Spider humor was so funny and well timed!Bonding with character hasn't been as easy as it is here, they really explore the backgrounds of the different characters so emotional and passionately at the same time.It's a necessary darker & more emotional storyline for the characters but that's just how Peter Parkers storyline is...\nIt's a 2h20 movie but there wasn't one scene that I would've left out, I would've even preferred for it to go at almost 3h cause I wasn't a huge fan of the ending! You'll know when seeing it!There are so many Easter eggs & Spider-man's it to crazy for words!What more can i say than this is a masterpiece and probably the best Spider-Man movie to date!",
    "110": "I was really blown away by this masterpiece. It's beautiful, clever, funny and deep. And it dares being a comics in each and every frame. It never allows you to forget these are drawn characters you see. Unlike so many animated movies of recent time it doesn't go for the smooth polished look it makes certain we never forget that we watch a comics book that was brought to life on screen. Just like Rembrandt made sure we all see his brush strokes when we watch his paintings. But just like Rembrandt, it's done without allowing the technical mastery of it all to drop one little bit. But it's way more than simple issue of the looks of it. This is comics all the way, thematically as well as visually, hence the ending we got.They didn't give up on anything; didn't allow a single detail to go amiss. They wouldn't give up on any bit of storytelling. It's all there, no matter how long the final cut will be, and still, it's not too long not even a second too long. The characters are all fully developed - real human beings drawn in comics form, but human just like any of us watching them on screen. It calls for some of the best voice acing I've seen, by each and every member of the cast. I simply can't single out anyone of them. They were all superb.And than the story itself - It's way more than just sci-fi comics. It doesn't limit itself to the usual issues of power and its moral implications. It's asking us the deep questions of what determines the path our life take? Are we ruled by our destiny? Is it all written in our stars? If I had a problem with most of the comics I read it was because of the fatalistic approach adopted by most of them. This one defies the tradition in the best way. It breaks down all the accepted rules and leaves us all hanging in one of the best cliff hangers ever.If you love comics, science fiction, action movies or simply real brilliant cinema - go see it.",
    "111": "Sad night tonight. After 80-odd years, this was the last film to show in my local cinema before it closed down. Doubly sad because it's also not actually very good. The conceptualisation behind the hybrid styles of animation is spectacular and executed in an highly polished fashion - as you'd expect. The story is all over the pace though, and the proliferation of Spidey's seemed designed more to allow the narrative to become more culturally inclusive (and bankable) rather than to develop any meaningful characterisations. What personas there are spend their time wallowing in a mire of unrequited and/or confused familial love, or teenage angst more suitable in a soap. The dialogue has it's moments - assuming you can catch it - and there's a bit of humour to be found but I found the audio mix made following all that was said became a bit wearisome after a first hour that really does depend on your having watched (and remembering) the first - in my view far better - instalment. This whole \"multiverse\" theme can keep on recycling itself ad nauseam but if the writing remains at this unremarkable level then I'm not sure I'll be bothering with the next set of repetitively set-piece adventures for \"Miles\" and his parents, love interest and fellow Spider-folk.",
    "112": "The animations are fantastic. Something between 3D, comics and animated film. Other... Where to start? 2.5 hours of a festival of colors and chaos. The film seems to have been made by someone with serious ADHD while on LSD. There is rarely a pause between sentences to process what has been heard. Combined with the cluttered animations, I had the impression that I was watching the movie at 1.5x speed. It can be seen that the film is totally adapted to new generations. Parents are friends instead of being parents, they use slang, everything is colorful, fast and \"adapted\" to short attention spans. There is no tension, the dialogues just flow without much expressiveness or meaning. There is more drama than action. Once again, the animations and style are absolutely phenomenal. The level of dialogues, scripts and everything else is not at the level of animations. The movie had to be at least half an hour shorter with a better story, less woke crap and far more suspense. This gives the impression that it is a Coca Cola advertisement. Due to excessive animations and hasty speech, the film is difficult to follow for long periods of time. A good idea, but the execution (except for the animations) is average at best.",
    "113": "Best Spider-Man movie ever???, more of like the worst Spider-Man movie i've ever watched, Across The Spider-Verse is indeed fits with the title, it's basically a set up movie for the big finale/battle for the next movie, this movie is just the middle of it, i have so many problem with the film from it being too incredibly long, incredibly slow, and incredibly quiet, i don't know if it's just my theater that the volume of the movie was low but it's just not right, the slowness of the narrative and pacing really bothering me, even the dialogue was so slow that the quiet distance between each line i can hear couple people snoring because how so empty the film is, how boring the movie is, and i'm not blaming them at all, it fills with so many unnecessary long slow scene, the soundtrack was bad and compare to the fire soundtrack of the previous movie there is zero memorable song, the voice acting pissed me off too because how they talk mostly so quitely and so whispery and it also sounds mostly like they have no emotion at all, Across The Spider-Verse is missing a lot of the key part including the OG team with Spider-Man Noir, Peter Porker, etc. And i miss the depressed Peter B. Parker and in here he's having a perfect life which is good but not as fun and as engaging of a character anymore, the side villain of this movie was Miguel as Spider-Man 2099 and it didn't work as he was not as cool or as menacing as i expected, so do The Spot unfortunately, the positive was of course the animation was still great, i like both Spider-Man India and Spider-Punk, the action was decent, wasn't really blown away by it, it's quite entertaining, the cameos are fine, but the obvious cameos was very disappointing for me, anyway, Across The Spider-Verse for me was a bad example of a set up movie, a set up movie shouldn't be this long except if you fill it with a boring long narrative that fills with so many unnecessary long slow scene with bland and weak story, weak voice acting, and wrong decisions like this one, Across The Spider-Verse is bad, it's a failure, it's a complete waste of time and it could not be a waste of time if it's execute properly with the runtime, the content, and the story, it could be a less than 2 hours movie of a set up instead of more 30 plus minutes of unnecessary boring content, Into The Spider-Verse was a triumph while Across The Spider-Verse was a blunder, and i have my reason and that's the most important.",
    "114": "Its not bad, it just doesn't fill the shoes.The movie is caught up in doing a bad impression of the original but misses the small details and cleverness that made the original a hit.So much of the plot and dialog is flat. The surprises didn't surprise me. I barely noticed them. The jokes where uninspired. I think I laughed once. The stakes where much higher but the tension felt much lower.Its worse in the technical aspects as well. Sound design, Pacing, Art Direction, Character Depth and Development all worse. Technically Across the Spider-Verse has a deeper world but not much of it was not memorable. I felt like the movie took a long time to say and show very little where the original did the complete opposite.When the squeal was announced and I heard they had different directors I raised an eyebrow. I lightly considered that team to be miracle workers. Unfortunately the concerns seem proven. The current Directing team says they're done after the second act of Across the Spider-Verse.I know a colossal amount of time, energy and love went into this movie and I'm scorching it. Squeals are notoriously hard to balance. They are often caught between what the original was and what so many people imagine that it should have/ could have been. Squeals sometimes they get tangled trying to be an unnecessary correction.Despite all these criticisms its still a good movie. There was a lot to appreciate. It was fun and characters will make you feel something. The best parts of the movie where all around the Parents of the many Spider-Verses. They tried to make the importance of family the core but that is difficult in an action movie were the hero's are living split secrete lives. Holding out hope for the next one.",
    "115": "I admired Spider-Man: Across the Spider-Verse. I did not like it enough, it was not memorable enough and it was more interested in leaving it all to a sequel.Miles Morales has to deal with a villain called The Spot. He was an Alchemax scientist whose body was infused with portals during a collider explosion. He now blames Miles for his condition as he also brought a spider from another dimension that bit Miles, giving him spidey superpowers.Meanwhile Miles collides with Gwen Stacy, although she is from another dimension as well, where she is also Spider-Woman.In short Miles and Gwen as well as others chase the Spot through the multiverse. Only the Spot has plans of his own.The film starts off slowly, a crawl before getting supercharged. It just lacks the punch and effervescence of the first movie in this cartoon series.",
    "116": "I loved loads about this film, mainly the amazing action sequences and the sweet sweet fan service (one bit of fan service got a big loud oooooh from myself and most of the cinema).The problem I had with it is that despite it being a 2 parter so much of the emotional exposition was stretched out far longer than necessary through overlong dialogue. About an hour of the film is dedicated to ensuring we understand that Miles is a young man finding his path through life (I have no idea how some of the younger kids in the audience sat through it, they must have just been mesmerised by the flashy colours). It could have been handled in a much more condensed manner by better writers and still had the required impact. Given the film ends at a point that feels like a natural final third act it left me feeling shortchanged.If the overlong dialogue scenes had been condensed then I believe there would have been no need for the 2 parter. But then people wouldn't pay to see 2 films instead of 1.I expect when the initial mega fan reaction dies down and more ordinary filmgoers leave shocked at the \"to be continued\" message the IMDb score will dip dramatically.",
    "117": "One of the best animated movies I've ever seen, hands down. I wasn't the biggest fan of the first. I thought it was a tad overrated. This one takes the strengths of the first and ups it to 11.The animation: etherealThe voice acting: pristineThe story: well doneThe characters: convincing and well-developedThe themes in this movie are very good, and they're told in a thought out and mature way. In other words, it's not afraid to make you feel things and maybe scare your kids a little, despite the PG rating.Comparisons may not always be the best thing, but I believe this movie is better made than No Way Home.The twists at the end were completely unexpected. Overall, the final chapter was set up in a fantastic way.",
    "118": "Ok, my title is deliberately snarky, but ...Like the first movie, the animation here is spectacular. Plus, there are lots of incidental pleasures, mainly seeing all the different Spidermen and their crazy powers and costumes.However, I just wasn't that taken with the characters and plot. Maybe I'm too old for these sorts of films, but do we really need scene after scene of whiny teenagers talking about their feelings? Personally, all I really want from a Spiderman movie is some fun web action and a few zingy one liners. And a more interesting villain than the one we got here.Perhaps I'm old-fashioned, but I always thought the point of superheroes was to be focused on others - saving the world and all that - not endlessly dissecting their own emotions and obsessing about their families and relationships. Guess this just reflects the world we live in: a Spiderman movie for the me, me, me generation.",
    "119": "Into the Spider-Verse was one of the rare big studio movies that felt fresh, authentic and full of heart. Across the Spider-Verse falls short of matching its predecessor in each of those counts.Whenever a superhero movie succeeds, big studios try to distill its essence down to a formula, trim out any creative risks to make it safe for large-scale public consumption and add some fanservice. This is the case with the second instalment of Spider-verse.Except for the art. The art was brilliant and original. But little else stays with you after after the end.On a side note, is anyone else tired of multiverses? In the first movie, spider-beings from different dimensions were fresh and funny. Twenty popular movies and series later, it feels played out. The central plot feels like something out of an old Rick and Morty episode.But the bigger problem was this: the essence of Spider Man stories is that he is both a teenager and a superhero. He has typical teenager problems, struggles to juggle his double life, makes mistakes and learns from them. The first half of the movie followed that template and was good fun to watch.But then the movie turns it upside down and the teens become smarter than the adults. The adult Spider folks in Spider HQ(which was basically Citadel of Ricks from R&M) not only approach a sensitive conversation with Miles with the delicacy of a sledgehammer, it's unclear if they even know what they are talking about.The centrepiece of the movie is an extended chase scene with little suspense about the result. Here's another thing that annoys me: making your hero suddenly overpowered by having them beat other characters in a way that defies in-universe logic.The English punk spiderman made me chuckle though.",
    "120": "IN A NUTSHELL:\nThis is only Part 1 of a two-part sequel. Sweet! Fans are thrilled, rewarding the movie with $221 million at the worldwide opening. It was directed by Joaquim Dos Santos, Kemp Powers, and Justin K. Thompson, a truly magical team.Writing credits go to Phil Lord, Chris Miller, and David Callaham. The story is about Miles Morales who catapults across the Multiverse, where he encounters a team of Spider-People charged with protecting its very existence. When the heroes clash on how to handle a new threat, Miles must redefine what it means to be a hero.THINGS I LIKED:\nThe animation is colorful, energetic, and impressively expressive. It combines classic comic book design with modern-day CGI for a thrilling effect. Each frame looks like it came straight out of a moving comic book. Fans are completely nerding out!The cast of voice talents includes Shameik Moore, Hailee Steinfeld, Oscar Isaac, Jake Johnson, Issa Rae, Daniel Kaluuya, Jason Schwartzman, Brian Tyree Henry, J. K. Simmons, Luna Lauren Velez, Greta Lee, Rachel Dratch, Jorma Taccone, Karan Soni, and Shea Whigham.The script is extremely inventive, funny, and heartwarming all at the same time.We get some creative villains that come from various multiverses.Lots and lots of action!The movie takes place across 6 dimensions with 240 characters in it and over 1,000 animators working on it! It's the largest crew of any animated movie ever made!So many Easter eggs. They include references to six decades of movies, video games, cartoons, and comics. Wow.This is one of those movies that you HAVE to watch more than once in order to catch everything. Scratch that...two or three times! The frames fly so fast and furiously that you simply can't see it all.I've never read comic books, but I hear the movie stays true to the source material.I got a kick out of the Spot villain, the Lego spider verse, and the Indian Spider-Man. Haha\nI've always loved animated movies that include live-action characters.The cliffhanger will leave you counting the days until the next installment.Surprising twists caught me off guard. Sweet.There is plenty of humor, both spoken and visual.I've just seen a Nicolas Cage cameo in two different movies in two days! His appearance always gets a laugh from the audience. The other is in the new movie that just came out: The Flash. It's another fun adventure into the metaverse!You can definitely enjoy this movie without having seen the first Spider-verse one; however, you'll understand and appreciate it even more if you have.If you love Hailee Steinfeld's character of Gwen Stacey, you'll be excited to know that a female-focused spin-off is currently in development.THINGS I DIDN'T LIKE:\nSome viewers and fans will be annoyed that the movie doesn't actually end at the end and they'll have to wait an entire year to see the rest of the story. Spider-Man: Beyond the Spider-verse is scheduled to be released on March 29, 2024.Some of the action scenes are chaotic and happen so fast that you don't have time to really savor the moment.TIPS FOR PARENTS:\nThis is not just some random kids' movie. It's very mature and filled with humor and insights that adults can enjoy.Some Spanish is spoken without subtitles.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "121": "After the explosion of the super collider, there is a growing threat to all known worlds. The nature, identity and responsibility of being a Spider-person is examined.This is much bigger than the first, and they even manage to address the rare flaws: this time, despite the many universes and literally hundreds of characters, it never loses focus on Miles Morales(Moore, spot-on), and the creative, memorable action scenes are now each completely, not only mostly, unique. Considering what I just described, you might not believe me when I say that somehow this manages to not be completely overwhelming. That they managed to make the concept simultaneously infinite in possibility and yet not let it get overpowering.You can watch this without having any prior knowledge of the original movie, the comics, or other iterations. It will tell you everything you need to know. Certain things won't have the same emotional impact, and you will have to pay extremely close attention. But they actually managed it. Your average Spider-Man movie says that a person(way too frequently a Peter Parker, about time we got some more diversity) bitten by the right spider will gain superpowers, don a suit and fight crime. This one expands that into Various animals, shows literally dozens of them, in addition to featuring some great representation(ethnic, gender, age, body size). I would have loved to see openly trans individuals, especially considering the intense reactionary backlash against a split second frame in one of the trailers. Here's hoping we'll get there in part three.This is rated PG. There is no swearing or sexuality, and violence is mild. I recommend this to everyone. Regardless of your age, you can find something to love in this. 10/10.",
    "122": "The movie did a great job in the first part and I really enjoyed it so personally I am especially looking forward to the second part and after watching the movie it exceeded my expectations.I love how the film expands its scope and adds more stories to the characters, specifically Gwen (Gwanda), in the new cast I'm super impressed with Oscar Isaac as the voice of Miguel O 'hara , he's been through enough pain to make himself responsible for protecting Spider-Verse and believing himself to be right no matter what . Speaking of Miles, he's really matured in this part, he's just a 15 year old kid who has to balance his Spider-man lifestyle with himself, I like the way Miles tackles problems differently from the rest of Spider-Man . The movie is really fan service, making viewers satisfied with every detail, graphics and family story of Spider-Man.I love every moment of this movie and am looking forward to the sequel, hopefully more Miles and Spider-Verse movies will come out.",
    "123": "'Spider-Man: Across The Spider-Verse (2023)' is overwhelmingly fantastic. I'm still buzzing just thinking about it. If the first flick put the bar for stylised animation in the stratosphere, this just catapulted it into another dimension. It's hard to put into words just how viscerally vibrant and visually stunning it is. Its set-pieces simply hit different. The animation, the energy, the aesthetics, the choreography, the music, the sound design, everything just comes together in its unique brand of finely-tuned controlled chaos that keeps each and every exhilarating moment crystal clear even when there's a million different things happening all at once. It's phenomenal. It isn't afraid to pump the breaks every once in a while, too. It slows down considerably to develop its characters and explore their relationships with one another. It's actually quite an emotional experience at times. It has an unconventional structure and, as a result, it takes some pretty big swings with its story. There are some sequences that could have been tightened up and I really wish the picture had retained its original Part One title just to temper people's expectations, but the fact that this film's biggest flaw is simply that it ends is almost unbelievable. I can't say it's better than 'Spider-Man: Into The Spider-Verse (2018)' because it's essentially only half of what it's eventually going to be, but it's a miracle that it's at least as good as that masterpiece (and even outperforms it in terms of sheer spectacle). If they manage to stick the landing with the upcoming sequel (which I have no doubt they will), this is going to be one of the best five-hour movies ever made.",
    "124": "For the past two years, No Way Home was my favorite Spider-Man movie. Now, that title belongs to Across the Spider-Verse. Besides being a great Spider-Man movie, I'd consider this a great movie in general. I just saw Across the Spider-Verse, but I already feel comfortable placing this movie in the same category of sequels like The Empire Strikes Back, Aliens, Terminator 2, and The Dark Knight, which surpass every aspect of their predecessors.I love Into the Spider-Verse as much as everyone else, but I believe Across the Spider-Verse improves everything from the first movie. The one part of Into the Spider-Verse that always held it back from a 10/10 to me is the villains. Kingpin and the Prowler are serviceable, but I always thought they were uninteresting. With Across the Spider-Verse, the villain is a major improvement. Miguel O'Hara had a compelling motivation, while also being a genuinely threatening antagonist.I already thought Into the Spider-Verse's animation was breathtaking, but Across the Spider-Verse somehow surpasses it. The entire movie looks like a work of art, but the highlight for me would be every scene in Gwen's universe. The backgrounds and colors in those scenes are gorgeous. Just like the first movie, the fights here are fast-paced and fun. There are plenty of memorable action scenes here, but I particularly loved the first fight between Miles Morales and the Spot.This is sort of out of topic, but I also think Across the Spider-Verse was a better multiverse movie than Multiverse of Madness. Not only was the concept of other dimensions better utilized in Across the Spider-Verse, they were also more visually distinct here. Maybe it's because of the fact that this movie is animated, but each dimension in Across the Spider-Verse was able to have their own style and color to them, unlike the ones featured in Multiverse of Madness.Overall, Across the Spider-Verse is yet another masterpiece in the Spider-Verse series. It's both my favorite Spider-Man movie and my favorite movie of 2023. I know this year isn't over yet, but it's going to be tough to top this movie. I give Across the Spider-Verse a 10/10.",
    "125": "Story: 8.5The story was kind of going all over the place at first but slowly connecting with one another down the line. It was very detailed with alot of meanings and purpose in the different scenes of the movie.Characters: 8Alot of new characters in this movie except most of them\nwere lacking in quality except for a few newly introduced characters and the characters from the first movie.Visuals/Music: 10I mean do I really have to say anything. The song selections were fantastic and really matched the atmosphere of the scenes in the movie and the visuals were so dynamic and powerful to capture different imagery and depth. The visuals and song selections were simply top tier.Overall quite an enjoyable movie.Memorable: Sort of, Rewatchable: Maybe.",
    "126": "The film made me so upset because there was no epilepsy or flashing lights warning, horrid sound mixing, and overall so flashy it just wasn't fun. I got so overstimulated by the constant flashing lights that I could not enjoy the film. I was having to watch through my fingers. I don't understand why they decided to make 80% of the film a jolting van gogh kaleidoscope, that feels like you're watching it all in VR. It felt as if the Visual Team wanted the entire film to mirror the feeling you get as you're going through the wormhole sequence in Doctor Strange, but for 2.5hrs. Kinda feels Ableist to be honest. I could not enjoy the film, it was torturous. I am deeply saddened by just how flashy the film was. Also, what was the message of the film? Parenting is hard and it's ok to be selfish to get what you desire, regardless of consequences? I'm really confused by the high scores. I consider myself to be a cinephile, with having seen thousands of films and enjoying most all films, sometimes even bad ones. I am saddened to say that I am deeply in disagreement with the 9.1 current rating and 90% rotten, it makes no sense to me at all. This film was so over produced that it made my head physically hurt. Sony, maybe try and be less ableist when you're thinking about creating 2hrs of strobe light animation; it didn't need the consistent glitching, pulsating, and flashing mechanic to the multi-layered animation styles.It honestly felt expensive, but overall just lazy.Really disappointed.",
    "127": "Spider-Man: Across the Spider-Verse.Miles Morales catapults across the Multiverse, where he encounters a team of Spider-People charged with protecting its very existence. When the heroes clash on how to handle a new threat, Miles must redefine what it means to be a hero.I'm late, yes I'm and I wish I could make it to the theaters to watch this visually stunning masterpiece on the big screen.ATSV is an extension to what we had in ITSV, the same energy and the problems that Miles Morales had with his identity as the spiderman of his universe, this movie excels in presenting a multiverse concept, it is the best I've seen dealing with this matter.I mean every universe had its own colors, dimensions and animations it is a lot of work to do, it's the most beautifully made animation I've ever seen and most pleasing to watch without a doubt.I'm not going to compare it to the first one, I enjoyed them both and I love them equally I guess, considering that the story haven't come to an end and I'm counting on BTSV to be even better, as better it can goes.I was waiting for \"Calling\" song, it was late but I'm satisfied.",
    "128": "I was fortune enough to attend the premiere here in Singapore. A non-spoiler review follows:Spider-Man: Across the Spider-Verse does more than just swing into action; it weaves a narrative tapestry with passion, dedication, and love. The creators of this epic journey have clearly poured their heart and soul into every frame, and the result is nothing short of spectacular.The animation is a tour de force, seamlessly blending diverse art styles that bring the Spider-Verse to life in a way that feels vibrant and fresh. Each scene is a feast for the eyes, painting the screen with a burst of colors and imaginative designs that will leave you breathless.Equally commendable is the strength of the narrative that effortlessly connects with the audience. The story doesn't just unfold; it entangles you in its web, ensuring that you are invested in every dramatic interaction, every thrilling fight sequence, and every emotional climax.Character development is another highlight of the film. The growth our beloved characters undergo adds layers of depth to the story, making their journeys all the more engaging. Their interactions, whether action-packed or heartwarming, are captivating and contribute greatly to the film's overall quality.The score and soundtrack are also nothing short of fire, underscoring every moment with tunes that not only set the mood but also elevate the story to new heights.However, if I absolutely have to nitpick, there are a few moments when it seems to pull on the heartstrings a tad excessively. This slight overindulgence in sentimentality is a small nitpick in an otherwise excellent film.The way the Spider-Verse is portrayed, introduced, and expanded feels effortless and organic. You get a sense of a larger universe out there, waiting to be explored, which adds to the anticipation for the next part in this thrilling saga.In conclusion, Spider-Man: Across the Spider-Verse is a visually stunning and an emotionally gripping adventure. I, for one, can't wait to see where this journey takes us next.",
    "129": "Not even the most optimistic of pundits could've ever predicted the glowing reception and success that came the way of 2018's Into the Spider-Verse, slinging to almost $400 million at the worldwide box office, critical praise and a spot entrenched in the upper echelons of the IMDB's Top 250 Movies of All Time list, too say that the first iteration of the Spider-Verse animated universe was a roaring and unexpected success would be a huge understatement.Fast forward these close to 5 years on and expectations for teenager Miles Morales/Spider-Man next adventure are sky high but proving that lightning can strike twice, the creative team behind this colourful Spider-Man series overseen by Phil Lord and Christopher Miller have once again delivered a frenetic, energetic and most importantly entertaining animated epic that will likely cause much debate as to whether or not this is a case of a rare sequel that may in fact be better than its forefather.Still featuring the oddball humour and near endless parade of in-jokes, homages and side gags that made the first Morales venture such a delight outside of its visual spectacle, Across the Spider-Verse also feels like a much more mature outing this time around, with Morales himself more world weary and battered, coinciding with the film as a whole dealing with some heavy issues and subject matters that at times brings on an unexpectedly sombre tone, with credit going to the creative team here for not being afraid to make their film skew further from the young audience that may not quite understand the nuances on display here all the while allowing older audience members to feast on a film that is far from all style and no substance.Clocking in at close to two and a half hours, Across the Spider-Verse is one of the longest animated films ever widely released into cinemas and there are segments throughout the film where it feels as though we are covering off similar narrative ground on more than one occasion but when Morales adventure into the Multiverse swings into the sky it takes us on an often unforgettable journey, whether it be to a New York done the way of Mumbai or a Spider-filled version of Earth, Across the Spider-Verse has enough imagination and spark to fill countless other animated rides that would be desperate for even a portion of the creative magic on display here.As also was the case the first time around in 2018, this 2023 Spider-Verse features another array of on-song voice performances from its talented cast that works in tandem with the incredible artistry on display throughout, led once more by Shameik Moore and Hailee Steinfeld, new additions to the voice cast here such as a scene-stealing Oscar Isaac as Miguel O'Hara, Jason Schwartzman as The Spot or Daniel Kaluuya as Hobart Brown all bring their A-game to this big budgeted affair, making this an all-round package that has not only lived up to the legacy of the first instalment but arguably surpassed it.Even if there's a feeling of being teased by possibilities once the credits begin to roll here, the hype is going to be overflowing for next years Beyond the Spider-Verse which is setting out to prove that lightning can indeed strike more than twice.Final Say -People may bemoan the amount of Spider-Man themed films we've had slung our way over the past 20 years but if the quality of these outings remains as strong as what we get here with Across the Spider-Verse, they're going to be complaining for a long time yet to come.4 Chai tea's out of 5Jordan and Eddie (The Movie Guys)",
    "130": "GOSH! This is fantastic!I still cannot get over the Animation, beyond good! Love how it just changes with background. It just perfectly blends in with the crazy multiverse theme. It's so good and it conveys everything, the emotions, the step to seriousness and everything. Every single scene makes you to look at it with high focus in case you miss something.The artwork is fantastic. Massive step up from previously awesome ITTS.The Soundtrack man, it is up there with the very best for me. Just so so good.The Easter Eggs are all abound, which makes it more exciting.The Story and the direction they took was much lovely!",
    "131": "This has to be a top three movie/film for me personally. Just let me explain why before you are gonna go like, \"Top 3?!\". The whole movie literally explains in every reason why most Spider-Men in different demensions have the same exact storyline and background stories. A spiderman gets bit, falls in love, and then has a loved one die. That is what happens in every Spider-Man story, and this film literally explains it to us all. Not to mention, the whole storyline about Gwen relates to as of why she cares about Miles alot. Anyways, the animation has to be some of the best animation that we have seen so far, and the visuals were amazing as well. The film is kind of mind controlable at the same time, and here is why before you ask. At first, the movie was like, \"Why are you showing all of this so slowly\", but then, at some of the ending parts, it literally explains why they were. Speaking of ending parts, the plot twists were amazing as well. Some of them are like, \"oh, I get it\", and others were like \"WHAT?!\", which means that this movie was able to balance it very well. In my opinion, I think that this and the previous represent and show how the multiverse works alot better than the Marvel Cinematic Universe has ever done.",
    "132": "Even if I'd had a nice quiet crowd the first time I saw this (I really didn't), this still felt like the kind of movie that demanded a second viewing. Distractions aside, there's just a lot to take in the first time around. The basics are well explained, but the extra/additional details come fast and things that aren't specifically part of the core story can pass by so speedily I couldn't catch as much as I wanted to. A second viewing honestly felt like a first viewing for more than half this movie. I caught a couple more jokes, appreciated the unexpected turns in the narrative (that ending included), and just enjoyed the whole thing a great deal more.I still prefer the first Spider-Verse movie by a hair, because it has a little more emotional weight for me, and I think it's paced a touch better. But Across the Spider-Verse is still emotional and well-paced; I think it flies by so quickly that that ending feels shocking on a first viewing, because the film kind of feels like two acts (with an extended prologue and epilogue) rather than three. The structure's interesting and a little odd, but again, it worked better after seeing it once, and being able to piece it all together while seeing it play out again.And it probably goes without saying, but the animation here is just out of this world. That's the one area that is better than the first, and the first already looked amazing. The music's also just as good, possibly even better. I hope Beyond the Spider-Verse will conclude this trilogy amazingly, and it's probably no exaggeration to say it might be my most anticipated movie of 2024, at least for now (and I'm sure others feel the same way).",
    "133": "This is how a movie featuring multiverse should be.The first thing that one notices in the movie is how they have amped up their animation game. If you think the the animation in the previous installment was great, wait till you set your eyes on this one. With gorgeous colour palettes, each frame can be a wallpaper on your personal dekstop.No Spoilers here, but if you are a spidey-buff you will have fun picking up on the easter eggs. It is plain to see that the makers have a ton of love for the source material. From references to cameos, you will find everything over here.The soundtrack was also amazing. The collection of songs perfectly captured the tone of the film.The plot of the movie is also something that needs to be appreciated. It makes you root for the character and the third half of the film has a twist that you wouldn't see coming. There was a collectible gasp from the audience in the cinema while I watching, as no one expected. Even though there are jokes, it doesn't distract us from the core narrative, which has been the problem with MCU moviesEven though the movie is 2 hours 20 minutes long, the movie passes away like a breeze, you won't find yourself bored or checking your phone. Which is perfect for a commercial superhero flick.",
    "134": "From its very first opening moments, Spider-Man: Across the Spider-Verse is an undeniable work of art. A bigger, bolder sequel that's not afraid to take its time with its character's growth and truly understands the character. Exploring in extremely meta, reality bending fashion the true burden of being Spider-Man.Shameik Moore is once again perfect, he's able to portray how Miles has grown since the first film effortlessly and remains loveable. Hailee Steinfeld is even better than last time with the best arc of the film, its just as much her film as it is Miles. Jason Schwartzman is great as the Spot, able go from being a joke to a genuine threat in really convincing fashion.Out of the new Spider-people, Oscar Isaac brings a palpable anger to Miguel O'Hara that conveys the burden he has and the lengths he'll go to and Daniel Kaluuya is the best new addition as Hobie, an unashamedly British character with the strongest moral compass and never betrays it, making him an easy favourite.In the years since the original came out, a fair few films have clearly been inspired by its animation and put their own spin on it but directors Joaquim Dos Santos, Justin K. Thompson and Kemp Powers do an excellent job of reminding you nothing can compete with Spider-verse. Its the literal definition of every frame a painting and every new dimension is so vibrant and unique.The soundtrack and score by Daniel Pemberton remain highlights, maintaining a strong balance between the two but Pemberton has really outdone himself with this score. It brings back all the themes that were so unique and memorable whilst adding new ones that are equally strong, if not better.",
    "135": "No puns intended - and yes it is plural! So many things that are touched upon .. same is true for the movie. There is so much, that watching this once is not enough. While it has been a while since I saw the first (or rather previous) movie, it is not entirely necessary to have seen it. On the other hand, you will have some callbacks, if you have seen it. Maybe even more if you watch them back to back.The character are well drawn (no pun here, not an entirely intended one at least) - and talking of drawn: I remember that the first movie had one style throughout the movie. This combines many styles (and universes/worlds) ... which suits the movie well. You have so many characters (some returning, but also quite a few new ones) .. and you have the old ones \"evolving\" to a degree. Still stuck - still trying to handle their situation, still struggling with having a \"normal\" life and being the superhero their city deserves (well let's assume that is the case).Cameos are here - and this is all over the place (ok that can be found guilty of being a pun) - we get references of so many things. Me not being as familiar as other when it comes to Spiderman comics ... I assume there are even more in jokes here that I was not able to comprehend or even detect. Twists are here to stay and the trailer did not really give away too much - so no finger pointing (I had to - as did the movie).Dialog is great - and quite fast paced! It does not leave you with room to breathe ... but it is tight and it works. And it also is helping that the voice cast is as good as one can imagine. The multiverse is here to stay - or you know switch around, fighting the good fight ... what I did not know: the movie is only part of a larger story ... so do not be surprised if the movie leaves you wanting more at the end ... to quote the movie: to be continued (thankfully the sequel is coming next year)",
    "136": "There are very few sequels that come to mind that outperform the original in every way, this one certainly does. Not falling into the trap of bigger is better and throwing uncessercary cameos, fan service and budget at a series that was on a very strong footing. Everything in this movie had a purpose as apart of a trilogy.When they did announce that there was going to be a sequel to Into the Spider-verse I was unsure as that ended in a very finite way almost a cash grab from Sony on the back of the first one. I will eat my words that i was wrong, they seem as though they knew where they wanted both this and 3rd installments to end. The story of where this ended was a prefect place and i truly hope that there are screenings for both the 2nd and 3rd when new installment is released.One of the greatest leap forwards that has come from these 2 movies so far is that the animation is on another level artistically wise. Each of the Spider-men has their own unique style, as there have been tones of response over Spider-Punk and is way of being animated is a stroke of genius. Gwen Staceys world bring ripped straight from the panels of a comic with the watercolour emotion changing backgrounds even down to the last universe they visit. That cannot be understated as one of the best designed worlds in the series, as we are going to pick up from that we are going to be in for a visual treat.The cast yet again is stacked and the team behind the first have certainly built upon adding new actors to the roster and Oscar Issacs is a stand out as always. The Anti-Hero Spider-man is a tough character to take on. Played to perfection! Scary yet sombar, violent yet compassionate and down to his back story these are going to touge at the heart strings to then be hating him for the actions that he takes.As a second chapter in a 3 part story this is a marvel (pardon the pun) ends with everyone wanting more as a true story should. As mentioning before this goes into that very exclusive category along with T2: judgement day, The Two Towers and a personal favourite Sherk 2 to name just a few!",
    "137": "A good film, but very overhyped.A loud gasp of disappointment went across the entire 400+ seated cinema. Many people saying it was \"sh!t\" and \"nothing happened\" and \"that was the deadest film\"... and I partially agree.While an overall enjoyable film from my perspective, giving it an 8/10, critics have misled audiences AGAIN and set us up for disappointment. Not much...actually happens.We have a very VERY tedius 30ish minute intro and recap to all the characters we already know about, telling us everything we already know about Gwen and Miles, dragging out the runtime. There's no proper villain in the film either, we get a splatter of a few villains throughout, and one will obviously be a bigger villain in the third film, but... yeah...I sort of agree with the people complaining.I did find this more enjoyable than Guardians of the galaxy Vol 3, but its not the masterpiece 10/10 the paid critics give it.",
    "138": "Spider-Man Into the Spider-Verse dates back to 2018. The film was received extremely positively by friend and foe and rightly so. And such an animated film with a sublime animation style was something that had never been seen before on this scale. Like going to a comic book that was translated on screen and with a very, very good story. It may take five years for the sequel, but patience pays off and how. It seemed a fairly tough task in advance to be able to surpass Into the Spider-Verse, but this has absolutely succeeded in every area. Where the regular Marvel movies have fallen into disrepair, where the quality of those movies has gone up and down, the Spider-Verse movies are definitely not and maybe it's better for Marvel to focus on these gems than again for the umpteenth time to bring some weak and much too expensive live action film into the cinemas that are destroyed by the media and the public.The story is enriched by deepening the backgrounds of, for example, Gwen Stacy and Miles Morales and that really works out perfectly. Why mention Gwen first? That's simple, the story around Gwen really worked out best in this movie. The opening of the movie might make you think ok, I hope it really gets a lot better than this, but this feeling will go away very soon. The origin of Spider-Man's enemy Spot is beautifully worked out. At first it seems like a funny and above all clumsy figure who has absolutely no control over his powers. When it finally becomes clear who Spot is and what his ultimate intentions are, Gwen comes back into the picture with Miles, but it is not yet clear why. Until Miles finds out that all universes are connected and that Gwen turns out to be a key that brings Miles to the Spider-people, led by Miguel O'Hara. This all sounds very dull, but the story seems to have a really hypnotic effect and that is where the strength of the film lies.With a running time of almost two and a half hours, it might stop people from taking a quick look at the film, but the running time is justified. Where Into the Spider-Verse still felt like the best, which strangely enough was still kept under two hours, that is really different with this film. With Into the Spider-Verse it was in a chaotic and almost impossible to follow color explosion called the ending. This is really different in Across the Spider-Verse. The entire film is expertly worked out, with the story only leaving you wanting more. Obviously this is because the open ending is just a cutoff in the middle of the story, but that's not the only thing. The coming together of every Spider-Man in history and more also builds up to more than just confronting Spot. Of course we could dedicate an entire review to how beautiful the animation is, but this was of course already very clear after the first part. The different animation styles are mixed in this film with a number of other surprises that not only bring you to the drawn or animated Spider-Man, but much more.Spider-Man: Across the Spider-Verse surpasses its predecessor in every way and raises the bar for a sequel. Not only the animation is fantastic, but also the story is perfectly worked out. Perhaps with Across the Spider-Verse we had the best Spider-Man movie yet and that really promises something for the sequel. It is especially the depths of Gwen Stacy and Miles Morales that add considerable force to the film. The threat coming from enemy Spot is really good and the part where Miles joins the Spider-people is really well done. The playing time of almost two and a half hours is strangely enough still a bit on the short side, but good. That is not surprising in this case, because the film ends in the middle of the story, so there is still plenty to do. The movie has been in theaters for a while and for those who haven't seen the movie in theaters yet, do yourself a favor and just go there.",
    "139": "SpidermanAcrossTheSpiderverseReviewMy Rating : 96/100Across The Spiderverse is a spellbinding and mesmerizing experience and passes the sequel test with aplomb. Starting from developing the endearing characters we loved from the first part, it adds a few solid new ones which are written as brilliantly as we can expect. The dazzling cinematography and animations leaves you tranfixed and the thrilling plot shifts leave you floored. Spiderverse is expanded vividly with the captivating work of humour, emotions and keeps you excited for what next throughout. The loudest hooting when Pavitra Prabhakar , our very own desi Indian Spider-Man comes on screen got me exhilarated. With almost all emotions getting evoked with the drama, tension and elevated climax, the cliffhanger makes me thrilled for the final act. Magical experience.The writing is superlative and introduction of the new concept of Canon event definitely opens up new possibilities. Miguel's Spiderman is terrorizing and adds more seriousness to the plot. While the emotional moments of Miles and Gwen with their family add to the list of winsome moments during the course of the runtime. Manhattan is now Mumbattan and Pavitra Prabhakar made us go crazy. The action and visuals are enthralling to say the least.Overall, if you likes the part 1 stop reading ahead and go watch this epic spectacle asap and if you haven't then its the right time of this weekend to catch up both parts and join in the community of Miles Morales fan club.Instagram & Twitter : streamgenx.",
    "140": "I had tried to stay away from trailers to avoid as much as I can and wow, I am blown away.The story is good, it's a follow up to the previous where Miles is still struggling to balance the spider life and being a kid, he is missing his multiverse friends and especially Gwen. The movie really gets going when a new villain called spot who can travel through holes to anywhere is demolished by miles and insulted. He plans to grow his powers, creating the ability to multiverse travel. The story goes on and it's hard to say as it continues after spoilers but things MUST happen but Miles can't accept it.The animation was AMAZING,seeing miles and Gwen swing through NY was perfect, it goes along with a pitch perfect score, there was once or twice the voices were quite low behind the music but that could have been the cinema. I also love that there are 2 major different sides when it comes to Miles and Spider-Man 2099, and I can 100% see both sides !!!Obviously it's around Miles but this movie is equally Gwens movie, she has gone through and is going through a lot. The supporting characters were all great and this movie is genuinely funny.This is not a spoiler but the movie ends on a cliffhanger and the third movie is scheduled for next year. This doesn't take away from the movie, it leaves me wanting more in a good way, 9/10.",
    "141": "Here we come another month with another marvel content . Spider-man Across the Spider-verse is another great milestone to the animation movies , visuals were incredibly cool and gorgeous with variety animation styles . This time sequel easily surpasses it's predecessor , narration was great , comparing to it's precursor this movie take some time to build story , establishing characters and some breathe moment rather than just jumping into one action sequence to another , this actually gives us the depth of the characters and stories . Once again many characters and many Spidermans comes across this movie , each had good scope and characterisation . Voice actors did a good job in dubbing . Action sequence were literally roller coaster ride with some goosebumps moments . Background scores were mind blowing . Sound department did a great job in sound designing .Overall , a movie itself a great tribute and massive celebration for Spider-man and it's fans . Not only for marvel fans even general fans gonna like it . Highly recommended to watch it on big screen and experience the Spider-verse . Story isn't over yet , stage is now set up for \"Beyond the Spider-verse\" .",
    "142": "One of the most overwhelming movie experiences of my life. A feast for the visual and auditory senses.I had HUGE expectations from this as the first one is one of my favourite animated movies of all time, and this one even surpassed those!It's one of the longest animated movies of Hollywood, but it doesn't drag for a single moment. There's so much happening in this film, it feels like a miracle that it still works so well! So many different animation styles, such great use of colours that portray the emotions of each scene perfectly, dope soundtrack, countless Easter Eggs; and it still doesn't feel exhausting. So many characters and almost all of them have distinct characteristics. You can sense that the creators have an amazing understanding of the characters, and they do them full justice.But it's not just a compilation of awesome psychedelic animation with some great score, it has a fascinating plot too. It handles the multiverse well, delivers a couple of neat plot twists, while being an emotional coming-of-age story of a couple of teenagers trying to balance their dual lives, and maintaining their relationship with their parents.It's the best Spider-Man film ever made. It's one of the best movies ever made.Now I can't wait for the final film which will establish the Spider-Verse trilogy as one of the greatest trilogies of all time.",
    "143": "Before I begin my review, WARNING! This is the first of a two-part movie. I don't mind two-parters, but I do resent finding out at the end.That said, when we begin this movie, we discover Miles Morales down in the dumps. True, he has just saved the multiverse, but he's a lonely neighborhood Spiderman, with his fellow spidermen (and women) off in their own versions of the Earth. However, when a villain called the Spot shows up, proclaiming himself Spiderman's nemesis, taking umbrage at being called the villain of the week, and Gwen Stacey's Spiderwoman shows up, Miles finds himself tagging along to discover a multiverse of Spidermen, Spiderwoman, Spidercats, Spiderbabies, and even a Spider Tyrannosaurus Rex, banded together to defend all reality.... and he's not welcome.Once again there are clever gags, every universe is drawn in a different style, and there is a clear metaphorical meaning to this: events may compel us into certain paths, making us seem no more than an expression of a trope, but who we are makes a difference in the outcome, too. The visual splendor of this movie makes it one you should see, if you are interested, in the theater. Even though I am annoyed at having a two-parter slipped past me without warning.",
    "144": "Spider-Man: Across the Spider-Verse is an absolute triumph in the world of animated superhero films. As a huge fan of the first Spider-Verse movie, my expectations were sky-high, and I am thrilled to say that this sequel not only met but exceeded them. From start to finish, it was a visually stunning, emotionally resonant, and action-packed adventure that left me on the edge of my seat.One of the standout aspects of this film is its animation style. The combination of traditional hand-drawn animation with cutting-edge CGI creates a unique and vibrant visual experience. The attention to detail is impeccable, with every frame bursting with color and energy. The action sequences are mind-blowing, with the characters leaping off the screen and swinging through the city with incredible fluidity. It truly feels like a comic book come to life.The story takes place after the events of the first film, and it delves deeper into the multiverse concept. Miles Morales, the young Spider-Man, embarks on a journey across different dimensions, encountering various versions of Spider-Man along the way. The narrative is engaging and keeps you hooked from start to finish. It seamlessly blends humor, heart, and high-stakes action, making for a well-rounded and satisfying experience.The voice acting is top-notch, with Shameik Moore reprising his role as Miles Morales. He brings a youthful energy and vulnerability to the character, making him relatable and likable. The supporting cast, including Hailee Steinfeld as Gwen Stacy and Jake Johnson as Peter B. Parker, also deliver fantastic performances, adding depth and humor to their respective roles.What sets this film apart is its ability to tackle complex themes and emotions. It explores the idea of identity, the weight of responsibility, and the importance of family and friendship. These themes are handled with care and resonate on a deep level, making the characters feel more human and relatable.If I had to nitpick, there were a few moments where the pacing felt slightly rushed, and some characters could have been given more screen time. However, these minor flaws do not detract from the overall excellence of the film.In conclusion, Spider-Man: Across the Spider-Verse is a must-watch for any fan of the superhero genre. It is a visually stunning, emotionally resonant, and action-packed adventure that will leave you wanting more. With its incredible animation, engaging story, and memorable characters, it deserves a solid 9 out of 10. I cannot wait to see what the future holds for the Spider-Verse franchise.",
    "145": "Spider-Man: Across the spider verse(2023)This movie is a continuation from Into the spider verse and it expands the movie as a whole and it gets progressively better by the dimension they enter in and it got a lot of characters and i mean A LOT A LOT !The art style is what made this movie expands like this and it made what ever the characters are you've got spider punk and spider man india ( was hoping for more screen time ) and spider rex spider cat blah blah blah and moreThe movie is pretty good but the end left me really confused , the last 20 minutes of the film i was confused as heck i couldn't even know what was happening and just overall confused and SHOCKED by what was almost at near the endOverall a build up movie for beyond the spider verse but still cool ! This movie is kinda nuts tbh love it and its very enjoyable would recommend to everyoneoh yeah and btw the main villain of this movie is kinda scary tbh and thats how good the movie isI would recommend to watch the first one then ATSV :-)",
    "146": "Wow. An already great year for movies, just got extended by a masterpiece of filmmaking.Just as Into the Spider-Verse did before it, Across the Spider-Verse uses the audience's familiarity with Spider-Man as a consistent source of humor which makes it all flow flawlessly.I am quite frankly obsessed with this movie. There are six different animation styles featured in the film - and my goodness this is the most awe-inspiring animation I've ever seen in a film. Using stunning visuals as a way to elevate the emotion and action in every scene. Never seen the like. The voice acting is sublime (the dialogue between Miles and Gwen goes right under the skin), the characters are multi-faceted, the action sequences are electric, the music is mesmerizing and, my word, the storyline is the perfect balance of emotional depth and meticulously timed comic relief.I also love how Across the Spider-Verse balances setting up a sequel while being its own movie. Miles and Gwen have tidy and concluding arcs with enormous growth, as it still ends on a true cliffhanger. It's among the best part ones I've ever seen.This movie is pure art put on canvas, with every frame. Soulfull. A genuine love letter to Spider-Man and filmmaking itself.Note:\nIt's time for everyone to appreciate animated film as a true film genre and give it the recognition it deserves. Across the Spider-Verse perfectly demonstrates that you can't achieve and convey the same with a live-action film as with an animated film. The richness of emotions that this masterpiece conveys benefits greatly from the animation and its mesmerizing style.",
    "147": "This is such a cool movie! It's been a long time since I felt this excited about an animated film. The animation is amazing! The vibe reminds me of animated Teen Titans and even a little bit of how I felt watching Power Puffs as a little girl.It's not just action: it's a fresh story line with interesting and diverse characters, the familiar spiderman family angle, and plenty of random fun things throughout (no spoilers!).I love how Gwen and Miles are portrayed.It is a little long, but it has a unique way of story telling that keeps the mind engaged throughout.I'm already looking forward to the next one.",
    "148": "I think as audiences we know how hard it is for sequels to meet our expectations when the first installment of a saga was already an outstanding piece of art, it feels so good when sequels keep those standards...The sequel of the Spider-Verse gets almost everything right, it manages to bring you back to the insanely original multiverse storyline that was introduced to us on the first film, yet it manages to not fall into the trap of being a repetitive storyline with the same elements.I can't even properly comment the animation work, there are no words to describe how amazing it is, the detail that each universe depicted seems to have its own kind of animation is insane and it continues to be without a doubt the only Marvel / DC movie to make a proper homage to comic books, the original super hero format.It keeps the frenetic energy that the first got us used to, something is always happening and it's interesting to keep following, elements of the first story are brought to continue the protagonists journey and it's an organic narrative, doesn't feel like a forced story line for the sake of a sequel, it makes sense.All universes are beautifully animated, the soundtrack gives you ton of energy, everywhere in the movie you see marvelous imagery, a true piece of art.Adding the this the voice acting is also on point, it's an animated movie and it feels that it is leading the way on how animation should be used specially on the super hero / comic book adaptation world.Filled with dramatic and eye tearing moments and of course with themes that are transversal to probably every person either parent or child and that most of us can probably relate, gives soul to an already beautiful film. A pioneer film that continues on top of its game, I can't wait for the third..!",
    "149": "Miles Morales's story to the next part which traverses through the multiverse. The huge faults create a gigantic messed up cracks and fissures in the symmetrical flow of the timeline. The absolutely astonishing visual style of animation owns this film and teleports it to the place where no other film has reached. This film is bonkers in catering countless creative choices in its every fascinating frame, each looks like a spectacle at best. The graphics and artwork creatively screams and mellows us with its perfect comic style representation. The mega chase sequence with the spider society is an amusing ride. The action sequences are rushing pulses which standout and validify the reason why we shall blow our minds in front of the big screen. The creation team and art team of this film outperforms the first installment and establishes a benchmark for the future of animation. The humour and emotions find a way in this splendid world. The storytelling and narration is well webbed in the long pacing. Miles Morales's appealing storyline is intertwined with multiple other plots across the spider-verse. Gwen's character is a shining lamplight. All the other spideys from different worlds make a place to form the intriguing exploration of the multiverse. The spot is really an unique character choice to add on in the multiverse trajectory. Miles Morales's bond with his parents is an inspiration upon which the story finds a heart and soul. In here also, there is this fate of spiderman, that he or she has to make a sacrifice to withhold the power that flows in him. As every time, the stirring and insightful words from the mentors of spiderman thrives that matters in every storyline to serve the purpose that every superhero needs. The film often softens from its epic tone like a subtle colour to penetrate the bulky ambition and poignant emotions it carries. Probably the finest Spidey film to date. It ends with a cliffhanger, promising a beyond trek. Indeed, this film is a fabulous work of art that reminds us that there is no frontier to creation. It has just pulled us into its world of millions of our own-selves..."
}