{
    "0": "Such a wonderful spin on a horror/comedy where Santa Claus is the hero! David Harbor is absolutely perfect for this role has the best voice and great thrill to see in anything he's in! To me this is one of the best Christmas movies out there along with Bad Santa. I would defiantly agree with anyone that loved Violent Night, it's a great mix of Home Alone, John Wick, and any horror Christmas movie. Tommy Wirkola directed a pure blast of entertainment! I sorta can see how it could get hate the family was a little obnoxious at times but I void that out cause everything else positive outweighs heaps.",
    "1": "This movie is a beautiful mixture of Die Hard, Home Alone, Thor... It also contains several cliches from other movies. Not a problem. Yes, it's predictable, but it is kind of different of what we usually recieve on Christmas, and I personally appreciate different movies.First, action, gore and scenarios are great. Also the main cast. I think almost everyone here does a great job. I really enjoyed music used here too. Great choices.Second, the script is predictable but at the same time, it keeps you entertained from beginning till the end. Raw action mixed with some goofy scenes.So, overall if you want to watch a different brutal action Christmas thriller, this one is for you.",
    "2": "Greetings again from the darkness. HO-HO-HO! Who is ready for the best ever Santa slasher movie? Admittedly, it's a narrow sub-genre and anyone that knows me or reads my reviews, knows full well that this is not the type of movie I typically recommend. However, it's the season for charity and director Tommy Wirkola (HANSEL & GRETEL: WITCH HUNTERS, 2013 - sequel in the works) and co-writers Pat Casey and John Miller (the screenwriters behind the \"Sonic the Hedgehog\" films) have gifted us an extremely violent and often very funny Christmas present, replete with a sledgehammer-slinging Santa Claus.We first meet an inebriated Santa (\"I'm on a break\") at a local pub, where he explains to a mall Santa why he has become so disenchanted with the job ... greedy, self-centered kids who only want more video games. The booze numbs Santa's disgust as he heads off on his sleigh ... and Wirkola delivers the first shocking moment as Santa's barf keys us into the type of twisted tale we are about to experience. David Harbour (best known for \"Stranger Things\" and HELLBOY, 2019) is absolutely all-in for this far-from-glamorous portrait of jolly ol' Saint Nick. On his rounds, Santa raids household liquor stashes while chomping on cookies and eschewing skim milk. He's a full-blown slob, yet still holds a soft spot for \"nice\" kids, while having little mercy for the \"naughty\" among us.Most of the story takes place at the Lightstone family compound, where one-percenter Gertrude (CHRISTMAS VACATION alum Beverly D'Angelo) is the foul-mouthed matriarch ruling over her entitled and unlikable family consisting of daughter Alva (Edi Patterson) and her airhead-actor husband Morgan (Cam Gigandet) and their poser teenage son Bert (Alexander Elliot). Also present for the festive evening are Gertrude's son Jason (Alex Hassell), his estranged wife Linda (Alexis Louder) and their precious 7-year-old daughter Trudy (Leah Brady). Santa arrives at the Lightstone mansion not long before a team of mercenaries, led by Mr Scrooge (John Leguizamo), storm the place and take the family members hostage. Their mission is to break into the family vault and abscond with $300 million in cash.What follows is a demented mash-up of DIE HARD (1989), HOME ALONE (1990), BAD SANTA (2003), and THOR (2011). Deadly weapons used here include your expected firearms, but also a finely-honed candy cane, an icicle, a skating shoe, and a Christmas tree star, among other holiday items. Most prominent is the sledgehammer wielded by Santa, and the flashback to his pre-Santa days for explanation. The violent action is plentiful, and it's well-balanced with countless lines of comedy. Surprisingly, there is a story nestled in amongst the mayhem, and the heart of it revolves around the bond between Santa and young Trudy. She's a true believer in him and that overrides his uncertainty about the job, and inspires him to stick around for the fight. Santa can't explain the mystique of Christmas \"magic\", but he does know an 1100 year marriage has its ups and downs.Obviously, this is not one for the kiddos (it's a hard R-rating), and they should be shielded from this Yuletide yuck. Director Wirkola has delivered an instant holiday classic for those seeking the bizarro world flicks contrasting to the more respectable family fare of IT'S A WONDERFUL LIFE and A CHRISTMAS STORY. Who would have ever thought that Festivus might be the safer holiday?Opens in theaters on December 2, 2022.",
    "3": "The first movie I watched in the new year, 2023. I regret not seeing it in the cinema. I really liked the movie. It was fun. It's like a family movie though, with lots of bloody scenes. There was a lot of inexplicable stuff about Santa in the movie. This shows that there will be a second movie. According to me. Acting was good. David Harbor was great again. I liked the movie overall, except for a few cringe scenes. The action scenes weren't bad either. It was a funny movie. It was a movie that didn't take itself seriously, but took it seriously at the same time. I recommend. It was one of the best movies of 2022 for me.",
    "4": "Violent Night may be just 10 mins too long but thankfully that doesn't stop it from executing it's beautiful premise extremely well. A super violent and really funny action movie that doesn't forget to bring the necessary heart and festive spirit as a Christmas movie.David Harbour gives a terrific lead performance as Santa, displaying an emotional range way beyond what's expected and delivering some truly heartwarming moments with Leah Brady who brings a boundless optimism to her adorably innocent character.Tommy Wirkola's direction is great, the action scenes are so much fun to watch, really inventive and always comprehensible. The music by Dominic Lewis is really good, combining the epic action movie pieces with more traditionally festive moments.",
    "5": "I would've liked to see more and funnier comedic moments, but there are still some fun laughs in this film. It sure beats all the romantic cheesy Christmas films that are in abundance this time of year. The directing was decent, and the pacing was spot-on in the comfortable 112 minute runtime. The story was pretty much predictable, although there were many refreshing references to past iconic Christmas holiday films. All casting and performances were excellent. Even the score and holiday soundtrack was on point. It's certainly an enjoyable one-time watch of mindless entertainment, and a well deserved 7/10 from me.",
    "6": "A true enjoyment of action and celebrating the Christmas spirit, this time putting Santa Claus has an action hero. And who's better cast for that then David Harbour, who's a drunken, depressed Santa Claus, and not so jolly, feeling the world has lost the true meaning of Christmas.But soon finds himself in a situation where a gang of murderous crooks invade a big house, and it's up to Santa Claus to save them and Christmas, but will he?Action scenes are well done, fight scenes keep you excited has the film goes on. John Leguizamo really gives a good performance has the main leader of the crooks. The rest of the cast are pretty good also. This does deliver the action and the laughs.",
    "7": "Where do I start other than to say so, so much fun. This movie runs the gamut to sappy Christmas themes to Clockwork Orange ultra-violence to the magic of Ted. There are other connections to a few other movies but I really can't name them as it would be a spoiler and I don't want to deny anyone from enjoying this one full force. Harbour is absolutely fantastic. Lots of luggage/issues with most of the supporting characters and that just adds to the constant entertainment in many subtle ways. If you can handle the crossing-the-line-a-little-bit violence, this is one very enjoyable holiday season movie.",
    "8": "The trailer for this one was excellent. Santa versus the robbers in a kind of ultra-Christmas variant on DIE HARD, itself a perennial Christmas favourite. David Harbour riding high from the success of STRANGER THINGS, and John Leguizamo a reliably entertaining villain. What could go wrong, right? Well, the presence of the writers behind the SONIC THE HEDGEHOG films (!) is the sticking point here, because VIOLENT NIGHT struggles with a puerile script and a tone that bounces back and forth between gory black humour and saccharine schmaltz presented unironically. Seriously, who thought the kid would be a good addition here? It should have been much harder and darker, more like the MOTHER'S DAY remake with Rebecca De Mornay. A shame, as the DEAD SNOW director works his socks off and the action's fun.",
    "9": "I have heard great things, I expected a very good, fun, thrilling movie. No, it's none of these things. It's not very good, because the direction is lacking and the script is poor. It's not very fun because there's not much of witty and funny dialogue in the script. And its not really thrilling. The fight scenes are mediocre, shot in close ups, often in the dark. Only the final fight, between the Santa and the Leguizamo character, got me excited. The tone of the movie is very uneven, it jumps between irreverent brutality mixed with gross cussing and the overly sweet, syrupy moments of family-friendly melodrama. It's like a weird mixture of a Tarantino movie and a Hallmark Christmas one. Apart from the Santa and the little girl all other characters are lazily written, even Leguizamo is a bit bland. The score is irritating, at least for me. So, the idea was excellent, but the execution pretty disappointing. 4/10 from me.",
    "10": "From Previews, I wasn't too sure about this, but, had a feeling at the same time it might be good!The film sees a wealthy family being suddenly held hostage on Christmas Eve & Santa Clause, who happens to be dropping by their place, hears the commotion & then masked it his mission to stop the terrorists & their gang leader, Scrooge!I found the film to be epic! I was skeptical at first given how films are nowadays, but, I enjoyed it quite a bit! It's gory, funny & action packed! It was a Die Hard Christmas Themed Action Comedy! It had also, Home Alone references inserted in which was ace! The comedy, the gore & action were on point!The story was good, but some of the scenes did drag a bit! Although, the action was more enforced than the drama so it was all good! The films run time is 1 hour & 46/47mins long, but the runtime does drag somewhat!Overall, though, it's a great festive horror/comedy/action film with a cross between Die Hard & Home Alone! You'll love it!9/10.",
    "11": "This laborious trog through bits and pieces of cool ideas gets frustratingly derivative of every single home invasion trope mixed with a (clearly) not villainous villain. The least they could do is maybe include the backstory of John Leguizamo's character quicker. How much he hates Christmas and how his worst nightmare would have to be to go mano-a-mano with the man himself. The LEAST they could do is an action catchphrase like \"Sorry, Jimmy, you're now a stocking stuffer\" when he drives him up a chimney and turns him to pulp. None of this is as fun as I'm explaining it. Because it takes the dumbest parts of \"Die Hard\" and adds in a very baffling McGuffin. And, honestly, the villain are justified in their crime. Since the matriarch of the family played by Beverly D'Angelo is the ballbusting head of family and a very bad person. The \"terrorists\" are also very uneven in humor. At once they talk about holding onto a man's phallus as it's being fed to a nutcracker (get it?!) and the next they're into \"Home Alone\" booby trapped antics. It was a misstep and the tone of the film is so uneven. The balance of laughs is way off. Also the guy who plays the Dad seems more like a Dad than Liberace. He isn't convincing in the least. As either a Father or a son of Beverly D'Angelo.David Harbour plays Santa Claus. In this case, a reborn Nordic warrior who was given the power to return his crimes of violence to do good. This makes a LOT more sense if it opened the movie, and then have him at the bar. You see what I mean by poor structure? It was such a layup and the template was there. The little girl Trudy is obnoxious. She is clearly playing the always good kid kid. This type in movies irk me the most. They are total gems because the script needs them to be. The \"I wish Father and Mother would get back together\" corny \"Parent Trap\" trope works in specific tones of films but not really shoehorned into a decidedly brutal violent movie.There are too many moments of drag. Everytime Harbour is alone talking to Trudy, you expect some pearl of wisdom. Or clever dialogue, but extend Bruce Willis's John McClane talk to Al Powell during when he speaks of his wife and multiply that by a thousand and that is what you will be putting yourself through.Has the bar of movies gone so low that we see this flick as \"original\" It is a lazy, tired, boring story written by stunt people who probably suffered horrific head injury. This is tacked on sentiment which lacks so much heart. Harbour wants to be that smug reluctant hero. But, the concept of St. Nick holds him to a standard these people forgot.A gimmick flick filled with poor choices. It could've been really fun.",
    "12": "LIKES:Music:\n-Festive, fun, and does start out capturing the holiday spirit\n-Expert timing with the tracks to emphasize the emotions of the scene and added spice\n-Comedic use at times that works well with the dialog and helps kick the message in your face\n-And yet also has the action edge to really give you the epic feeling of fighting with St. Nick.-Very Versatile overall without going too far.The Setting\n-You want a Home Alone house? You got it! The manor is five times a big and five times as extravagant.-The setting is a battlefield that offers lots of fun parts to play in and plenty of things to play with when taking on the big bad guys.-The lighting is perfect without getting in the way with artistic shots and lighting, meaning we got to see everything.--It does feel like a holiday household you dream of being in and seeing the visuals evolve and get torn up, sort of being symbolic.-Lots of nods to the classic movies that this group used for the basis of the film.Pace\n-Fast and easy to get into, no heavy handed character moments in this film.-The chaos erupts about 25 minutes into the film and then seldom stops to take a break and reset.-However, the resets are well placed and timed, helping you recover a bit from the carnage that just happened.-The scenes are high octane speed, ridiculous fun to enjoy, and really is just about having fun with Santa taking out the Naughty List\n-Leads to nearly two hours not feeling too long or too short for the most part.The Fighting\n-Like much of this movie, very extreme and corny, but somehow really works and doesn't feel too extreme, providing balance.-The movie takes elements of Die Hard and the Equalizer and mixes them into this ballet of bashing that is comedic and fun at the same time.-Santa's got some moves in this film and the fact he brings lots of combat styles to the mix kept things dynamic and made many fights memorable.-And the bad guys actually for the most part can fight back, helping, mostly, avoid the one man army beating \"elite\" warriors with little challenge\n-It actually has edge and circumstances.The Acting\n-Much of the acting is okay, cheesy characters that don't' diverge much, but hey it works for the theme of this movie.-Leguizamo is funny, but he is intense and blends two sides of his acting super well to make the leader role pop and yet be deadly, with the mouth and skills to back it up.-D'Angelo is fine, but more of the mouth than anything, and though funny at times, the character doesn't go too far to really be the wow factor compared to others on this movie.-Harbour is the star hands down and steals the show with his performance.-He is the soul of the movie and much of the comedy is due to his brilliant timing, his strong delivery, his facial mannerisms, and how much he is committed to the part.-The chemistry is there, but only some parts really come out with that wow factor for me. It's just silly games for the most part, but it works and the parts work.The Creativity/Originality\n-The movie is just very clever in how it handles this mash up of genres and handling it well to really be the original film of the season.-As stated, the fights are dynamic and really balance so many film mechanics without getting lost to either side.-The direction of Santa is something that is amazing to me, and yet it doesn't dilute any of the craziness, but supports it.-It keeps the message embedded, but then uses it to fuel to the character methods to help and keeps a decent story to this flick.-And original comes in the way that the action is put into this film and some of the kills that he does leaving an aftermath of carnage that most will remember for years to come.The Comedy\n-Hands down the biggest factor to help handle the dark parts of this film, it sort of blunts the material.-Harbour again sells much of this comedy and made me laugh in how he interacted to the crap he was dropped into.-Much of the dialog is so awkward and clunky, but in Harbour's hands and the timing it really works to help lighten the mood.-Hearing the child interact is sweet, but then she breaks out of the shell a bit further making you laugh at just it getting pulled out.-Other characters are just so corny or in your face, you might enjoy what they are poking fun at despite how annoying it can be.The Sweetness\n-There is surprisingly a few heartwarming messages in the film that serve as the heart of the story.-They are sweet, a tad emotional, and add that extra Christmas punch that you hope to get from the film.-And it is a giant relationship that is one of the strongest character moments of the whole movie. Yet, it does not get in the way to trip up the antics of the movie.DISLIKES:The Cursing At Times\n-Watch yourself, because this movie easily goes into the deep end on using language, with several F bombs and MF bombs to grace your ears\n-Gets excessive at times and loses the clever dialog in the process, but often does regain its footing to be better control.The Plot Holes That They Make\n-Though most aren't going for a story, there are attempts to expand the story past just the trivial violence.-Several of the stories are hinted, but then get lost or just dropped. Why did the bad guy get to the way he was? Why that particular house and not something else?-Santa's origins are sort of explained, but there is still more missing as they use broad explanations to get the job done.-Much of the character build up kind of craps out, and is the least original thing, leading to mundane characters that could have had heart.-Several of the soldiers become generic and may be unaccounted for, meaning potential sequel?Semi-Loses The Home Alone Spirit/Creative\n-Eventually the movie takes a direction that is less Home Alone feel of comedy and clever traps, and becomes violent bashing.-These parts are still enjoyable and fun, but they lose the spark built in the opening moments and lost that Christmas charm that I really liked.-John Wick might be proud of the moves, but I almost would have preferred them to stay with working Home Alone mechanics to Nick's bag of tricks and leave the other side for the finale.-Feels a bit rushed at the end that further robbed the magic.Sometimes Goes A Little Too Stupid/Corny\n-There are times where it tries too hard to be funny or establish a moment that again is funny in small doses, but then goes too far for me.-This is primarily true for several characters that are just meant to be lame and over the top, mimicking the social media stars.-Other times, the running joke takes it too far, and again just trip up the natural humor of the movie.-The stupidity factor sometimes feels a little too farfetched and threw off the intensity of the moment. It's fun, but does throw off the consistency.The Blood Factor Goes A Little Too Far At Times\n-Cringe worthy moments that will leave you hurting in your seat\n-Brutally archaic that you have to laugh to get through it because it's that intense. This is certainly not a Home Alone remake, it's really more of an Equalizer.-The blood factor sometimes goes a little sick and twisted that sensitive constitutions may leave you wanting to hurl or leave the theater.-It tries to cartoony chaos, but blood baths are not going to be something you enjoy if you can't handle torture, killing stabs, and very scarring injury moments.The VERDICT:\nViolent Night is easily ridiculousness wrapped up in holiday wrapping paper. It's an amalgamation of many genres mixed together and somehow despite the differences in them, they made it work with their creativity and originality they brought to the mix. This Christmas fix is really funny, really action packed, and very R-rated, and yet the rough exterior hides an ooey-gooey center that helps deliver that holiday punch. Harbour is the star of much of the movie and lifts much of the film with his comedic styles and his focus on just being an amazing and dark Santa works so well to bring the message to life. Certainly there are weaknesses in terms of plot holes and excessive use of things at times. However, the movie somehow works for me and overall was the crazy experience that the trailers promised it would be. It's worth a theater visit for the effects and fun times, but it can be enjoyed at home too. My scores are:Action/Comedy/Crime: 7.5-8.0\nMovie Overall: 7.0.",
    "13": "Look no one is coming here to be intellectually challenged and Action Santa flics isn't exactly an oscar-batting genre. That being said this movie hit 100% of its potential. It surpassed the restrictions of the genre and made it a little deeper. I went in expected some solid action and that was it. The cast all over performed. It's not Shawshank redemption nor could it ever be but it was the absolute best movie it could have been. The best part of the movie was the score. Dominic Lewis delivered a master piece of emotion all while keep the music within holiday theme. I'm not sure if there will be a sequel but if there is I'll be in the front row.",
    "14": "I gotta say, I really liked this! Lots of shout outs to movies like \"Home Alone\", \"Die Hard\", and even the recent \"Fatman\"! And Santa's cheesy one-liners as he beats down the bad guys is perfect action movie dialogue! David Harbour is perfect as Santa, and rocks every scene he is in! And Beverly D'Angelo is awesome as the matriarch of a rather unlikeable family. My favorite scene in this movie is when Santa takes out a dozen or so bad guys in a barn to the lovely holiday tune \"Christmas Time\" by Bryan Adams! Absolutely perfect!P.s. - there is also an interesting bit of an origin story for Santa that I've never heard of before. I liked it!",
    "15": "Violent Night was a blast. Despite some people calling it an action movie, I do think it qualifies as a horror movie. Horror comedy? Whatever it is, it's laugh-out-loud, brutal, gory, sentimental, and fun from start to finish. David Harbour is kind of a mess for part of the movie; wasted, grumpy, but he remains so likable and funny throughout. John Leguizamo is a charismatic sweary bad guy and i'm so glad he had the lead in this film. Great performances by everyone in every role. This will 100% be one of those crazy Xmas movies you throw on every year. Go see it and get in the holiday spirit 🎅🏼🎄🔨",
    "16": "I saw Violent Night, starring David Harbour-Stranger Things_tv, Black Widow; John Leguizamo-The Menu, John Wick: Chapter 2; Beverly D'Angelo-The Good House, the Vacation movies and Leah Brady-Erin's Guide to Kissing Girls, The Umbrella Academy_tv.This is not your ordinary Christmas movie. It's an R rated action/comedy-think Die Hard meets Home Alone-that I feel might become a cult classic. David plays Santa Claus as being a little burnt out at his job-he's thinking about quitting the whole business-mainly because of all the greedy attitudes of people. The movie starts with David drinking in a bar, while he's taking a break and checking his naughty or nice list. Leah plays a little girl that still believes in David and the only thing she wants for Christmas is for her parents to stay together-they have been having problems, lately. Beverly plays Leah's rich grandmother that is having Christmas Eve get together at her house for the whole family when John and his mercenaries interrupt the festivities. John wants to rob Beverly and it's up to David to stop them-with a little help from Leah. It is pretty violent-but funny, too-and you learn about who David was before he became Santa Claus.It's rated R for strong bloody violence, language and drinking and has a running time of 1 hour & 52 minutes.I really enjoyed this one and would buy it on Blu_Ray.",
    "17": "If you're looking for a film that virtually has it all this is the one finally a film that is as advertised!! We loved it my wife and I kept laughing out loud giving high fives it was just so much fun hard to describe IT I guess take home alone and combine it with die hard then add the santa clause and here you go that's right it's an action Christmas comedy!! The whole cast is great but David Harbour is PHENOMENAL and John Leguizamo is an excellent villain he's SO much better here than he was in the menu. The film does not let up once the action gets going which doesn't take long it kicks Christmas butt and then the laughs kick in!! We will DEFINITELY watch it again then we will see the mean one and of course AVATAR WAY OF WATER in 3d!! December is going to be a PHENOMENAL movie month so get out of the house quit streaming and go see it how it should be seen ON THE BIG SCREEN!!! THANK TOU TO THE CAST AND CREW WE LOVED THIS FILM!!!!!!",
    "18": "I loved the idea of having a badass Santa trying to save the day and all the scenes with David Harbour (Santa) . And that's about it.Most of the dialogues and plot lines were extremely cheesy and cliche. I found the acting of the rest of the cast very poor and cringy, the script was very repetitive (how many \"I believe in you Santa\" can you squeeze into one movie; well take that and triple it).In summary,\n+1 for the attempt to differentiate from traditional Christmas movies; the whole concept of seeing Santa beating people up while dropping cheesy Xmas lines is indeed entertaining\n+1 for David Harbour who portrayed Santa\n+1 for the production.",
    "19": "Feels very much like Agatha Christie wrote the script and had to mix it with a part of Die Hard 2 and a part of Bad Santa and a little Home Alone.Although nothing is especially new, it's a very standard action movie after all, it managed to feel refreshing and entertaining, and funny at the same time. The violence is so over the top, it almost becomes funny and something that makes the movie more appealing to a gore enthusiast like me.It's only real flaw lies in some scenes that do not make sence. I would also have appreciated more background information on the characters, but it had taken too long. For me it will be a seven, but it was very close to an eight in rating.I can strongly recommend this movie to enyone who likes to be entertained!",
    "20": "Got to see a funny and mildly interesting concept take a nosedive through a chimney and burst into flames with the lame execution and annoyingly bad screenplay.The tone of it was confusing even with the preknowledge of it's rating.The tonal changes just didn't blend...\nIt was like watching Home Alone & Bad Santa featuring movies getting mashed together with the pg13 rating being covered with a thin R rated filter or somethin.The only watchable part of this Christmas action comedy was those last 30mins.The sledgehammer powered action sequences were decent and i liked the home alone style booby traps getting that gory payoff.But the only interesting and takeaway kill for me was the \"Scrooge's\". That was plain oof and awesome :)Harbour did a good job but the writing did him real bad here and his version of savage Santa felt weakly written, not praiseworthy or memorable and definitely not that entertaining.",
    "21": "I watched this last year and I was pretty disappointed\nBecause I think I set my expectations too high for what I wanted it to be\nBut despite all that I decided to give it another watch\nWith that in mind Here's my new take on it :\nThe relationship between Santa and Trudy made the movie for me\nBecause most of the characters are pretty unlikable and hard to have any sympathy for\nThe fight scenes are pretty impressive But the final act is probably the best part of the movie (For Me)\nI saw this marketed as a mix between Die Hard and Home Alone\nI'd say more Die Hard\nOverall not a bad way to spend some time.",
    "22": "Maybe I'm just getting old, but it really seems like every year we get a new attempt at an edgy Christmas comedy. Well this is indeed another one to throw in without much differentiating from certain past films. Funny enough the last good Christmas comedy in my opinion was Bad Santa which this film definitely borrows from slightly as well as many others I'm not going to name though you will see the obvious similarities. The story is throwaway and the violence is another shock value slugfest that even for the comedy seems cheap. David Harbour definitely delivers as usual and is the standout which isn't surprising. The attempts at certain twists really don't land much nor does the comedy for most of the film. Once again just another random Christmas comedy that won't really have any long lasting value but just fine for a Casual watch. Hollywood needs to accept the fact that Christmas Classics aren't something you can just manufacture every year.",
    "23": "It feels like 3 people were writing this story, the first wanted this to be a family christmas story , the second wanted this to be a funny silly comedy , and the third wanted it to be brutal, violent action with lots of gore, I guess all of them succeeded in their way but it was just not worked as a movie with all this different pieces, atleast one of them should have been outIts good production and acting, its funny and the christmas spirit is there , but it could have been a perfect family movie if not the gore , it also could had been a dark comedy with violence if not the drama and the silly feeling of \" home alone \" the mix make this ,, wrong and just close to perfectIts total ok , but if you put a 10 in this movie you havnt seen that much.",
    "24": "I like horror comedies, especially Christmas themed ones. I expected to really like this one, because the idea seemed fun. Unfortunately, this is a terrible movie. The script is just plain stupid. The movie doesn't know whether it wants to be a gory action movie, or a Hallmark drivel, so it ends up being the worst of both worlds. \"The world's safest compound\" is incredibly easy to hijack, the world's best soldiers are a bunch of unskilled amateurs. Santa goes from being barely able to move to being an overpowered superhuman (and no, the suggested \"belief\" factor is not done properly if that was supposed to be the answer). Fight scenes are boring and the final boss fight is especially disappointing. And its hits its personal low (and that's saying something) during the part when it becomes a shameless Home Alone ripoff.I should have just rewatched Die Hard instead.",
    "25": "I love it that this is a action Christmas movie because we haven't got this in a while. The jokes are good but not always hit me hard. Santa Clause is a scene stealer and by far the best Character. All the family members are ok but have no depth even the ones who should have depth.Also the movie is very brutal for a FSK 16 but it's funny to see a real Santa Clause fight some bad guys. This is the heart of the story and it makes sooo much fun watching. The story is ok. We are supposed to see a movie where Santa stops bad guys who want to steal from this family but we don't really care about that plot, but that's ok cause that plot isn't that great.Overall it's a good brutal Christmas movie that is something different.",
    "26": "I went into this with low expectations and walked out wanting to see it again. Look, no one is winning an Oscar here, but it's exactly what you'd want from a movie focused on an ass kicking Santa. The warm family moments, the violence, that asshole sloth from Ice Age, the Christmas themes...it was great. Pay special attention if you can for the hidden easter eggs. They do a nice job tipping Santa's hat to other popular Christmas films along the way. The entire film was utterly unbelievable, but so was Abraham Lincoln, Vampire Slayer and it wasn't too bad either. Check your mind at the door and enjoy the mindless fun!",
    "27": "Listen up. I am going to save you some dollars.Seriously, even if you know what's coming, this is one lame movie. Bad guys invade rich, dysfunctional family at christmas time. Daughter talks to santa through walkie talkie. Santa and little girl save family. Santa survives many, many bad guy attacks and very serious injuries. I hope parents don't mistake this for a family film, just because its a holiday movie. It is extremely violent and even though i know its a movie, there was no need for some of this violence. Shooting an innocent person through the head is not much of a christmas present. The acting is non existent, for the most part. John harbour is not bad as santa, but provides zero laughs and john leguizomo does ok with his thankless role. Otherwise, yuk. I know technically there are 8 reindeer, but we do expect to see rudolph. Its christmas after all. This is no \"bad santa\". Sadly.",
    "28": "As a fan of Stranger Things, I am happy to see David Harbour in headlining role kicking butt. In this, he is Santa Claus and when he gets trapped at a mansion full of mercenaries he must rise to the occasion to save the lives of this wealthy family taken hostage. Violent Night nods heavily to Die Hard, but is more of a Christmas movie. John Legizomo is no Hans Gruber(Alan Rickman), but is decent enough as a villain (and a Scrooge wannabe and anti Christmas one at that). Santa(David Harbour) is no expert at firearms, but uses a sledgehammer and whatever he can use in his environment as a weapon. The violence is often graphic and has a little gore for good measure. I don't regard Violent Night as a instant classic, but it was pretty entertaining and might inspire a little cardio after getting filled up on cookies and egg nog.",
    "29": "I love this movie. You don't have to think too much just watch and take in the craziness and utter violence and gore. I think this movie has been underatted The characters are spot on and David Harbor plays the santa role to a T and a little over the top and so is the storyline but hey it's fantasy after all right? I will just say this if John Wick did christmas it would probably look something like this! Go lose yourself in this movies for 2 hours! You will feel much better for it. In fact it was so good i might just go and watch it again. I wonder if there will be a violet night 2? Hope so...",
    "30": "Ridiculously fun new adult Christmas classic \"Violent Night\" has drunk, jaded Santa (David Harbour) delivering young Leah Brady her pressie at her uber-rich grandma Beverly D'Angelo's mansion... where he's caught in John Leguizamo's murderous gang robbery of the place. To save Brady (and family inc Alex Hassell & Alexis Louder) AND Christmas, Harbour must evoke his viking warrior origins to wipe the baddies out (with Brady's help) in over-the-top bloody style. Writers Pat Casey & Josh Miller cleverly blend the likes of \"Santa Claus The Movie\", \"Die Hard\" & \"Home Alone\" while director Tommy Wirkola turns up the gory slapstick violence (duh) to great effect. Boom!",
    "31": "I pretty much got what what I was expecting from \"Violent Night\". It's a pretty funny movie that's filled with action. The cast does a nice job with the standouts being David Harbour and John Leguizamo. Leguizamo is not nearly as annoying as he often can be. He also gets credit for playing the material straight. He does a nice job. \"Violent Night\" is definitely an R rated movie. There is quite a bit of blood spilled in this film. \"Violent Night\" is all about having fun and it delivers the goods. Will this movie grow into a Christmas classic? I'm not sure. Then again, if you asked me 19 years ago if \"Elf\" would become a Christmas classic, I would have said no. So what do I know. (I saw \"Violent Night\" at the AMC Raceway 10, Westbury, NY.)",
    "32": "Hi personally loved this movie. It was not pretentious, even though it did have a message. I didn't shove it in your face making you feel like an idiot. The message was very organic. Through and through this is if die hard, and John Wick had a baby with a Christmas Carol. Dave Harbor did an amazing job at Santa. Santa's character in this movie also had some character development which was great as well as a decent arc. The Supporting cast was okay at best except for John Leguizamo who was great.There's not much that I can say I did not like about this movie. Possibly the ending could've been shortened by 10 to 15 minutes but other than that it was paced very well.If you like violence and mayhem with a Christmas theme, this movie's for you.",
    "33": "I saw Violent Night, starring David Harbour-Stranger Things_tv, Black Widow; John Leguizamo-The Menu, John Wick: Chapter 2; Beverly D'Angelo-The Good House, the Vacation movies and Leah Brady-Erin's Guide to Kissing Girls, The Umbrella Academy_tv.This is not your ordinary Christmas movie. It's an R rated action/comedy-think Die Hard meets Home Alone-that I feel might become a cult classic. David plays Santa Claus as being a little burnt out at his job-he's thinking about quitting the whole business-mainly because of all the greedy attitudes of people. The movie starts with David drinking in a bar, while he's taking a break and checking his naughty or nice list. Leah plays a little girl that still believes in David and the only thing she wants for Christmas is for her parents to stay together-they have been having problems, lately. Beverly plays Leah's rich grandmother that is having Christmas Eve get together at her house for the whole family when John and his mercenaries interrupt the festivities. John wants to rob Beverly and it's up to David to stop them-with a little help from Leah. It is pretty violent-but funny, too-and you learn about who David was before he became Santa Claus.It's rated R for strong bloody violence, language and drinking and has a running time of 1 hour & 52 minutes.I really enjoyed this one and would buy it on Blu_Ray.",
    "34": "If you're looking for a film that virtually has it all this is the one finally a film that is as advertised!! We loved it my wife and I kept laughing out loud giving high fives it was just so much fun hard to describe IT I guess take home alone and combine it with die hard then add the santa clause and here you go that's right it's an action Christmas comedy!! The whole cast is great but David Harbour is PHENOMENAL and John Leguizamo is an excellent villain he's SO much better here than he was in the menu. The film does not let up once the action gets going which doesn't take long it kicks Christmas butt and then the laughs kick in!! We will DEFINITELY watch it again then we will see the mean one and of course AVATAR WAY OF WATER in 3d!! December is going to be a PHENOMENAL movie month so get out of the house quit streaming and go see it how it should be seen ON THE BIG SCREEN!!! THANK TOU TO THE CAST AND CREW WE LOVED THIS FILM!!!!!!",
    "35": "I loved the idea of having a badass Santa trying to save the day and all the scenes with David Harbour (Santa) . And that's about it.Most of the dialogues and plot lines were extremely cheesy and cliche. I found the acting of the rest of the cast very poor and cringy, the script was very repetitive (how many \"I believe in you Santa\" can you squeeze into one movie; well take that and triple it).In summary,\n+1 for the attempt to differentiate from traditional Christmas movies; the whole concept of seeing Santa beating people up while dropping cheesy Xmas lines is indeed entertaining\n+1 for David Harbour who portrayed Santa\n+1 for the production.",
    "36": "Feels very much like Agatha Christie wrote the script and had to mix it with a part of Die Hard 2 and a part of Bad Santa and a little Home Alone.Although nothing is especially new, it's a very standard action movie after all, it managed to feel refreshing and entertaining, and funny at the same time. The violence is so over the top, it almost becomes funny and something that makes the movie more appealing to a gore enthusiast like me.It's only real flaw lies in some scenes that do not make sence. I would also have appreciated more background information on the characters, but it had taken too long. For me it will be a seven, but it was very close to an eight in rating.I can strongly recommend this movie to enyone who likes to be entertained!",
    "37": "Got to see a funny and mildly interesting concept take a nosedive through a chimney and burst into flames with the lame execution and annoyingly bad screenplay.The tone of it was confusing even with the preknowledge of it's rating.The tonal changes just didn't blend...\nIt was like watching Home Alone & Bad Santa featuring movies getting mashed together with the pg13 rating being covered with a thin R rated filter or somethin.The only watchable part of this Christmas action comedy was those last 30mins.The sledgehammer powered action sequences were decent and i liked the home alone style booby traps getting that gory payoff.But the only interesting and takeaway kill for me was the \"Scrooge's\". That was plain oof and awesome :)Harbour did a good job but the writing did him real bad here and his version of savage Santa felt weakly written, not praiseworthy or memorable and definitely not that entertaining.",
    "38": "I watched this last year and I was pretty disappointed\nBecause I think I set my expectations too high for what I wanted it to be\nBut despite all that I decided to give it another watch\nWith that in mind Here's my new take on it :\nThe relationship between Santa and Trudy made the movie for me\nBecause most of the characters are pretty unlikable and hard to have any sympathy for\nThe fight scenes are pretty impressive But the final act is probably the best part of the movie (For Me)\nI saw this marketed as a mix between Die Hard and Home Alone\nI'd say more Die Hard\nOverall not a bad way to spend some time.",
    "39": "Maybe I'm just getting old, but it really seems like every year we get a new attempt at an edgy Christmas comedy. Well this is indeed another one to throw in without much differentiating from certain past films. Funny enough the last good Christmas comedy in my opinion was Bad Santa which this film definitely borrows from slightly as well as many others I'm not going to name though you will see the obvious similarities. The story is throwaway and the violence is another shock value slugfest that even for the comedy seems cheap. David Harbour definitely delivers as usual and is the standout which isn't surprising. The attempts at certain twists really don't land much nor does the comedy for most of the film. Once again just another random Christmas comedy that won't really have any long lasting value but just fine for a Casual watch. Hollywood needs to accept the fact that Christmas Classics aren't something you can just manufacture every year.",
    "40": "It feels like 3 people were writing this story, the first wanted this to be a family christmas story , the second wanted this to be a funny silly comedy , and the third wanted it to be brutal, violent action with lots of gore, I guess all of them succeeded in their way but it was just not worked as a movie with all this different pieces, atleast one of them should have been outIts good production and acting, its funny and the christmas spirit is there , but it could have been a perfect family movie if not the gore , it also could had been a dark comedy with violence if not the drama and the silly feeling of \" home alone \" the mix make this ,, wrong and just close to perfectIts total ok , but if you put a 10 in this movie you havnt seen that much.",
    "41": "I like horror comedies, especially Christmas themed ones. I expected to really like this one, because the idea seemed fun. Unfortunately, this is a terrible movie. The script is just plain stupid. The movie doesn't know whether it wants to be a gory action movie, or a Hallmark drivel, so it ends up being the worst of both worlds. \"The world's safest compound\" is incredibly easy to hijack, the world's best soldiers are a bunch of unskilled amateurs. Santa goes from being barely able to move to being an overpowered superhuman (and no, the suggested \"belief\" factor is not done properly if that was supposed to be the answer). Fight scenes are boring and the final boss fight is especially disappointing. And its hits its personal low (and that's saying something) during the part when it becomes a shameless Home Alone ripoff.I should have just rewatched Die Hard instead.",
    "42": "I love it that this is a action Christmas movie because we haven't got this in a while. The jokes are good but not always hit me hard. Santa Clause is a scene stealer and by far the best Character. All the family members are ok but have no depth even the ones who should have depth.Also the movie is very brutal for a FSK 16 but it's funny to see a real Santa Clause fight some bad guys. This is the heart of the story and it makes sooo much fun watching. The story is ok. We are supposed to see a movie where Santa stops bad guys who want to steal from this family but we don't really care about that plot, but that's ok cause that plot isn't that great.Overall it's a good brutal Christmas movie that is something different.",
    "43": "I went into this with low expectations and walked out wanting to see it again. Look, no one is winning an Oscar here, but it's exactly what you'd want from a movie focused on an ass kicking Santa. The warm family moments, the violence, that asshole sloth from Ice Age, the Christmas themes...it was great. Pay special attention if you can for the hidden easter eggs. They do a nice job tipping Santa's hat to other popular Christmas films along the way. The entire film was utterly unbelievable, but so was Abraham Lincoln, Vampire Slayer and it wasn't too bad either. Check your mind at the door and enjoy the mindless fun!",
    "44": "Listen up. I am going to save you some dollars.Seriously, even if you know what's coming, this is one lame movie. Bad guys invade rich, dysfunctional family at christmas time. Daughter talks to santa through walkie talkie. Santa and little girl save family. Santa survives many, many bad guy attacks and very serious injuries. I hope parents don't mistake this for a family film, just because its a holiday movie. It is extremely violent and even though i know its a movie, there was no need for some of this violence. Shooting an innocent person through the head is not much of a christmas present. The acting is non existent, for the most part. John harbour is not bad as santa, but provides zero laughs and john leguizomo does ok with his thankless role. Otherwise, yuk. I know technically there are 8 reindeer, but we do expect to see rudolph. Its christmas after all. This is no \"bad santa\". Sadly.",
    "45": "As a fan of Stranger Things, I am happy to see David Harbour in headlining role kicking butt. In this, he is Santa Claus and when he gets trapped at a mansion full of mercenaries he must rise to the occasion to save the lives of this wealthy family taken hostage. Violent Night nods heavily to Die Hard, but is more of a Christmas movie. John Legizomo is no Hans Gruber(Alan Rickman), but is decent enough as a villain (and a Scrooge wannabe and anti Christmas one at that). Santa(David Harbour) is no expert at firearms, but uses a sledgehammer and whatever he can use in his environment as a weapon. The violence is often graphic and has a little gore for good measure. I don't regard Violent Night as a instant classic, but it was pretty entertaining and might inspire a little cardio after getting filled up on cookies and egg nog.",
    "46": "I love this movie. You don't have to think too much just watch and take in the craziness and utter violence and gore. I think this movie has been underatted The characters are spot on and David Harbor plays the santa role to a T and a little over the top and so is the storyline but hey it's fantasy after all right? I will just say this if John Wick did christmas it would probably look something like this! Go lose yourself in this movies for 2 hours! You will feel much better for it. In fact it was so good i might just go and watch it again. I wonder if there will be a violet night 2? Hope so...",
    "47": "Ridiculously fun new adult Christmas classic \"Violent Night\" has drunk, jaded Santa (David Harbour) delivering young Leah Brady her pressie at her uber-rich grandma Beverly D'Angelo's mansion... where he's caught in John Leguizamo's murderous gang robbery of the place. To save Brady (and family inc Alex Hassell & Alexis Louder) AND Christmas, Harbour must evoke his viking warrior origins to wipe the baddies out (with Brady's help) in over-the-top bloody style. Writers Pat Casey & Josh Miller cleverly blend the likes of \"Santa Claus The Movie\", \"Die Hard\" & \"Home Alone\" while director Tommy Wirkola turns up the gory slapstick violence (duh) to great effect. Boom!",
    "48": "I pretty much got what what I was expecting from \"Violent Night\". It's a pretty funny movie that's filled with action. The cast does a nice job with the standouts being David Harbour and John Leguizamo. Leguizamo is not nearly as annoying as he often can be. He also gets credit for playing the material straight. He does a nice job. \"Violent Night\" is definitely an R rated movie. There is quite a bit of blood spilled in this film. \"Violent Night\" is all about having fun and it delivers the goods. Will this movie grow into a Christmas classic? I'm not sure. Then again, if you asked me 19 years ago if \"Elf\" would become a Christmas classic, I would have said no. So what do I know. (I saw \"Violent Night\" at the AMC Raceway 10, Westbury, NY.)",
    "49": "Hi personally loved this movie. It was not pretentious, even though it did have a message. I didn't shove it in your face making you feel like an idiot. The message was very organic. Through and through this is if die hard, and John Wick had a baby with a Christmas Carol. Dave Harbor did an amazing job at Santa. Santa's character in this movie also had some character development which was great as well as a decent arc. The Supporting cast was okay at best except for John Leguizamo who was great.There's not much that I can say I did not like about this movie. Possibly the ending could've been shortened by 10 to 15 minutes but other than that it was paced very well.If you like violence and mayhem with a Christmas theme, this movie's for you.",
    "50": "I enjoyed sitting back and watching an easy, fun and over the top Christmas film. This one has a fun twist, Santa Clause is real and he has some magic. He also is a bit disgruntled which works well and taking on a bunch of baddies is an interesting spin. The film does not shy away from the profanity and it does seem quite grounded in reality. David Harbour carries this film well and plays the disgruntled but still caring Santa nicely. You have to forgive a lot of plot conveniences, a few goofs and allow a little bit of luck. The value in this film for me was the different and dark spin and off course the action. It had small echoes of Die Hard and Home Alone and I felt it somewhat unraveled towards the end but it was still some light hearted fun. A film you could tolerate during the silly season. 6.8/10.",
    "51": "Finally an X-Más movie which doesn't take itself so seriously with the x-más theme & over saturates itself, it's just a good ol' fashioned straight action flick with a slight hint of X-más in it. Yippe Ki-yay mother #*$! Lol...good ol'Die Hard days. I really hope they run with this one more time, cause this one was a lot of fun. Story plot was simple to follow, Hellboy/Hopper/Red Guardian/Santa was just a blast & perfectly casted for this film. The story plot was really simple to follow. It has its Xmas/family story throw in there mixed up with a action. Trudy was very fun, and even the o.g himself\nLeguizamo was just as good as Harbour.",
    "52": "The title says it all. Albeit, with some exceptions. Delightfully violent, vulgar, borderline disgusting fairy tale that will keep adults laughing while the kids are asleep.Deservedly hard on the criminals and criminally sweet on the innocents, this modern take on Christmas is a winner. Absurdly violent, disgustingly funny and irrevently sanctimonious, no one could ask for a more modern treatment of the absurdity of the modern illusion that haunts December 25.The acting is superior, the sets authentically delineated and the script superior in its depictinn of rich, the impoverished and the criminal.Question everything you feel about this holiday and then ask yourself what it is truly all about. The answer may surprise you.",
    "53": "This movie doesn't really appear to know what kind of genre it wants to be.There is a lot of graphic violence and David Harbour is good at coming across like a cynical bad Santa type (5 stars for him), but at the same time they tried to make about a third of this film into a hallmark Christmas movie which just.... doesn't gel at all.Despite the \"wholesome\" aspects they tried to add, even the girl's parents appear to be horrible people (beating someone to death and stealing millions respectively).On top of the tonal mess there were some very odd plot threads that never led anywhere like Santa originally being a viking (??!?) and apparently also an alcoholic who's got troubles with his wife, which is also never elaborated on nor resolved. And the dad just moved 300 millions out of his mom's safe (money which btw she embezzled??) and put them outdoors into bales of hay(????). It all felt lazy and not very thought through.They weren't as creative with their \"defense\" of the house as they could've been, which arguably should've been the main draw of the movie. It's all very graphic yet pretty bland.This is not the fun classic it's trying to be and it doesn't really read like a satire either.",
    "54": "It is too boring to be an action flick, the slow parts kill that possibility. It is not funny enough to be a comedy, most of the jokes fall flat. It is too stupid to be a movie about crime, the plot is too simple.Although it contains child-like elements (believing in Santa) it cannot be recommended for children because of the violence. Also, the acting is annoying and the spacing is all over the place.Even if you feel like you don't have anything better to watch it will disappoint you.This movie is really just a hastily thrown together mishmash of ideas in order to rake in some cash in the holiday season.",
    "55": "Ok, 7 of ten because there are several failings that keep this movie from being a perfect revenge/redemption film. I'll start with the cons, to get them out of the way because I really did like this movie.Cons:\n1. Innocent deaths. The bad guys, who are already implanted, start murdering staff, security, and even the nice front gate man. That's just not cool, these are innocents, and you are just supposed to shoot them in the leg and lock them in a room or something. No one wants to see the poor dude who is holding a tray with cookies on it take a bullet to the brain and bleed into a puddle on the floor. Not cool.2. Not quite a funny as I had hoped. I was hoping for a few more lines like \"season's beatings\" but most of the comedy comes from the creative deaths and use of Christmas stuff to kill people, although I must admit it's morbidly hilarious.3. A bit heavy on plot, but I say this about every comedy. But then again, was this a full comedy?Pros:1. David Harbor has \"it\" that makes you like him immediately. He's a leading man in film now.2. Fan service: the Oscar the Grouch sketch featuring David Harbor on SNL was constantly commented on as \"if this were a real movie, I would go to see it\" well they made it! So go see it.3. Creativity. The deaths of the bad guys were absolutely brilliant. Few died the same way (or, spoiler, by the same person) and it had just enough gore and blood to satisfy, and it's the bad guys so that never bothers me. Guess I'm judgemental like Santa. Clever use of many different weapons, a little Santa backstory, and some grit and determination saves the day! I was happy when more bad guys showed up in the film, knowing that we'd have some more gory revenge deaths.4. Well acted by supporting cast. Every one of them. And Beverly D'Angelo still looks damn good.5. It's good enough that I'm worried it will be a holiday classic... Understand, it is VIOLENT. I mean they warn you in the title, don't blame me if your kids get traumatized.",
    "56": "It's an odd film that can be humorous, sometimes literally painfully funny, nasty as sin, ridiculous, clever, very sappy, extremely violent (as the title suggests), bloody as hell and still be considered a holiday movie, but somehow, someway, this thing works in a stupid sort of way most of the time, though I had a hard time swallowing some of the sappier moments, but as someone who could count on one hand the number of Christmas movies I like, that is not a surprise. David Harbour plays a Santa you don't want to screw around with, but some here do as they attempt to rob the house of a rich family while this Santa is making a visit. Harbour plays a slovenly, violent, drunken Santa and he does it quite well.",
    "57": "What are the rave reviews about?, this movie was horrible from start to finish. I really don't know what I went into this expecting, but it was way worse.. Do yourself a favor, go watch \" A Christmas Story\". This movie wanted to be funny and it wasn't, It wanted to have a backstory, however it didn't. I'm so tired of wasting my money on these pathetic attempts at movie making.. Do better writers and directors, because you cannot continue to release these horrible movies that is utter garbage. I'm not a writer, however i've could've written a better movie. I used to have a little faith in reviews, however I see now I can't even trust them.",
    "58": "Now I'll certainly admit it takes a lot to sell me on a Christmas movie, but the trailer seemed decent and I enjoyed Bullet Train so I decided to give it a go.There are a couple moments where I thought there was some good humor. The scenes with Harbour and Leguizamo together are really entertaining. Unfortunately there isn't enough of them prior to the ending where I'd already checked out in part. When there is action, mostly at the end of the film, it drags on a bit too much and you become kind of numb to the violence.The Home Alone like scenes also were fine, but again not enough of it. Too much time was wasted with the family just sitting in the living room with not much really going on. None of the characters at all were interesting except Santa and the villain. In particular the father of the young girl (Alex Hassell) seemed to have almost no personality at all. Not sure whether this was just poor acting or what they were aiming for. He also had very little on screen chemistry with the mother. It was implied that they were divorced but neither seems resentful nor joyed with one another until of course the movie decided to bring them back together at the end without any real reason. There was nothing in the movie where they worked together or found a spark again.Overall some really funny brief moments, but filled with a lot of dry filler as well. If you enjoy seeing David Harbour play Hopper from Stranger Things but in a Santa outfit it may still be worth your while. For me I'd probably give this movie an even lower ranking if I weren't in the Christmas spirit. For that reason it was passable , but just.Merry Christmas !",
    "59": "Got some problems, but it kinda rocks.Intro scene was perfect.David Harbour was perfect casting, he's really got the action/comedy thing down.Leguizamo was kinda disappointing. I think it's honestly just because I've seen him be so brilliant before, but this (and the Menu) just seemed like phoning it in. Plus, the character's hatred for Xmas seems like an afterthought.Alex Hassel...keeps getting work...I guess he was good as Translucent in the Boys, but he was laughably terrible in Cowboy Bebop (probably not his fault)...but I definitely wasn't really rooting for him here...The little girl? She was great.It's a bit sloppy overall, but it's doing a great job of filling the Christmas Action movie hole, and unlike die hard, Christmas is essential to the plot. It's also better than a lot of the Christmas garbage out recently hoping to make it into the zeitgeist's yearly rotation.Good work, y'all.",
    "60": "This movie is the weirdest combination of Die Hard, Home Alone, and John Wick. Maybe even throw in a pinch of The Santa Clause and a few drops of Final Destination, The Kingsman, and Deadpool. If you're a fan of any or all of the above this is fun and silly, albeit bloody, escape into ridiculous, action-packed fantasy. Fair warning: give it at least 30 minutes before giving up on the action-packed parts. It does take a while to get going. But be prepared to laugh, cringe, and roll your eyes a lot. Certainly nothing award-winning, but that's not what this one was made for. Oh, and did I mention blood? Lots and lots of blood. Enjoy!",
    "61": "Santa saves a \"wealthy family\" from mercenaries, but does he help the poor and downtrodden? Lol, no.Another rich yuppie christmas for wannabe rich yuppies to watch and drool over. Tis a crappy season!The guy from Stranger Things is good! I mean, he def can hold his own without a buncha kids grabbin at his skirt like in that other show. But, the direction is lacking, the script is muddled and in dire need of a rewrite and it never really does much but aim for the low hanging fruit.People that say things like \"Die Hard plus Bad Santa\" (ie. 11 year olds) are the audience here. If you are looking for real comedy or drama or action, go elsewhere.",
    "62": "Santa is hav8ng a bit of a crisis. He's drinking too much, his relationship with Mrs Claus is rocky, and he's disillusioned with hos thoroughly so many kids have lost track of the importance of Christmas. He sits down while delivering to Trudy and falls asleep. Trudy's Dad Jason, separated from Mom Linda, is the son of fabulously wealthy Gertrude. Jason's sister Alva is engaged in single-minded one-upmanship for ccontrol of Gertrude's wealth. Into this comes Scrooge and a crew of Christmas-named stooges, minded to steal a great deal of Gertrude's wealth. The sound of gunfire wakes Santa..This film is completely loopy. It is a family under threat/heist movie. It has some incredibly graphic violence. It was some heartwarming folksy moments. There is some emotion and character growth. There are some truly funny lines. And a lot of bad language. This mixture should not work, but it does.I think this is fated to become a Christmas classic.",
    "63": "On Christmas Eve, a group of ruthless mercenaries lead by nasty John Leguizamo attack and take over the home of a morally challenged and rich family with a view to stealing some hidden cash. However, at the same time, grubby, drunk Santa (David Harbour) is delivering presents to the house and is having none of it.A strange mixture of rather sadistic and quite real brutality and R rated comic type violence. This is at its best when Harbour, a funny mess of a Santa, is killing the baddies in comic brutal ways and when others are being tortured in an open homage to Home Alone. Its other mood swings between torture and 'Miracle on 34th Street' sentiment are less convincing, but overall it's a fun flip side of Christmas for all the enjoy.",
    "64": "There wouldn't be much else to talk about if you keep David Harbour and all those nicely choreographed action pieces on one side. It was meant to be a fun, action-filled entertainer and the movie turned out as we all expected, i.e. Style over substance. Depending on what the majority of the audience wants to see and is satisfied with, that could be a blessing in disguise, and in this case, it seems most won't complain.Now when it comes to 'we', the ones who belong to the enthusiast community, we will always strive for these films to break traditions, to go the extra mile, to break loose from all conventional tropes and clichés, however, in the majority of cases, things do not go our way; that is something we must accept and let go of, and I assure you that we will continue to do so.",
    "65": "This is the first time I've ever seen something jolly and violently gory in the same movie. I've never thought it can happen, cause usually Christmas movies are PG13. But we get all the adult package in this movie. Swearing, cussing, violence, blood and gore. And yet, there's still talk about Christmas magic and being nice or naughty. How quaint. I love it! I think this is my favorite Christmas movie this year. Exactly what we all need after we got struck by a horrible pandemic that is COVID19. A little something sweet that balanced out the violence. The acting was spot on and the plot was interesting. This is a good way to spend time on Christmas eve. Merry bloody Christmas, everyone!",
    "66": "An extremely slow starting movie-- the first action occurs approximately 30 minutes into the film... But you have to sit through a cast of ridiculously unlikeable stereotypes chew scenery as if it's their last role ... (Which it could be after this).Harbour is likeable as always but that doesn't carry a film (remember Hellboy?). Santa isn't a traditional Santa, but a drunk magical being with undetermined abilities. He's strong enough to crack walnuts with his fingers but can't knock out a goon hitting them with a sock of billiard balls. For an extremely long lived character (at this point I don't know if he's immortal) I don't feel any risk or tension he CAN be hurt. Where's the conflict?Beverly D'Angelo is unrecognizable -- I had to look up the role on IMDB.Leguizamo is earning a paycheck and has zero menace.The problem with this film? Santa has super plot armor -- we know he will survive... So scenes of him sewing wounds shut means nothing. He won't die. There's zero threat when he fights someone.The whole plot reminds me of an Archer episode --without the charm or sex appeal. Die Hard, which is referenced several times is a much better watch. Don't waste your time on this...53 minutes in and I've wasted enough time.",
    "67": "I'm a huge fan of the holidays and I love Christmas movies...not Hallmark movies (no offense to anyone that likes those, my mom is one of them) but I like the nostalgic movies or ones that have some quality.This is a grown up Christmas movie. It is DEFINITELY violent and a bit gorier than my usual taste but it was funny and entertaining and just the right amount of cheesy-ness. Don't take your kids. Take a date or your best friend as a holiday treat. Mt best friend and I went and we both loved it! Highly recommend and I can't wait to buy it and watch it every year :) just be prepared for a lot of gore. I promise it's worth it.",
    "68": "Best Christmas movie since Die Hard. Not everyone's cup of tea for a holiday movie but lots of action and funny at the same time especially if you are one of those that watch Jimmy Stewart's It's a wonderful life every year.Yes, the action sequences are over the top, but also considering its a movie about the real Santa you have to take it in stride and with the spirit of the movie!Being a fan of David Harbour, he play a great role of the disillusioned jolly old St. Nick preferring beers and Bourbon to milk and cookies.I'm hoping that that like Die Hard, this movie will have a sequel for the next holidays.",
    "69": "I don't know what it was, but I just couldn't get into this. I gave it 30 minutes...and if I'm honest, even that was hard! After half an hour, I had to switch it off, because I wasn't enjoying it.I don't know if it's the way it was filmed...the actors...or something else altogether, but this just didn't grab my attention. This is a shame, as I was really looking forward to watching it.As my title suggests, I can only describe the 30 minutes that I watched, as a mixture of Die Hard and Home Alone...which sounds awesome...but it just wasn't.Maybe I could of gave it longer, but I feel 30 minutes is a fair chance...and if the film hasn't grabbed my attention by then, I don't think it ever will.",
    "70": "Absolutely outstanding. I imagine a bunch of drunk guys started arguing at the bar about the best Christmas movie, whether it is The Santa Clause or Home Alone, and then one guy points out the obvious- Die Hard. A few drinks later they have combined them all and hired the director of What Ever Happened to Monday, and this is the movie they came up with.Over the top gratuitous violence and gore. Every Christmas trope you could imagine. Even Ellen Griswold is in it.The movie stays consistent on its explanation of Santa (Christmas magic, but even Santa doesn't know how it works). And even more consistent on the blood splatter, severed limbs, crushed skulls, and homages to Home Alone. Absolutely the best Christmas killing spree you could have wished for.",
    "71": "This was plain delightful. Brutal and heartwarming. The perfect mix of holiday romance and violence culminatiang in everyone discovering the true meaning of christmas.Santa's back story was a particularly nice touch and I thought the little girl was great. Much to be said about what's important in life and how we make our own destinies.There were lots of genuinely hearty laughs and there were unlikable and likeable characters on both sides which is what I look for in a film.Well written, well acted, good holiday fun, though probably not for the whole family. Definitely not for the whole family.",
    "72": "Not sure why this movie has so many high reviews.The opening scenes in Bristol UK were laughable and totally unnecessary to the story...anyone from the UK will know only to well that Bristol does not have skyscrapers as seen in the roof top scene. Straight away this makes the film a complete joke to anyone in the UK.Some of the action scenes were pretty good, but it really took too long to get going. There was too much lame writing in this movie for those action scenes to save it, and it all felt incredibly predictable. There are so many better action movies out there, and so many better Christmas movies out there.",
    "73": "Violent Night is the story of an ultra rich family in the Eastern part of the United States that gets taken hostage by a well-organized para-military group for their money until they are freed by the actual Santa Claus!! Violent Night can best be described as nothing but a dark action, comedy, thriller, as David Harbour (Black Widow) plays the role of a butt kicking jolly old St. Nick who does exactly that against a para-military group led by versatile actor John Leguizamo (Moulin Roouge!) who is called Scrooge in the film but acts much nastier than that. Most of the characters in this film have a dark side to them and act badly towards each other. The only one that really had true hope and goodness - and in a way saves the family in the end - is the very young daughter Trudy played by Leah Brady (The Umbrella Academy). With a title Violent Night, you would guess there would be a tremendous amount of violence and action in the movie and there was. This movie had its share of bloodshed as well, something I haven't seen since the Kill Bill movies. This was an okay movie. I wrote in my title that this movie is a lot like Die Hard and Die Hard II because it is, Santa Claus is by himself in many scenes taking on a number of terrorists much the same way that John McClain did in those other classic winter time films. I can see why they released this film during the holidays, to capture the holiday feeling dollar, and while this movie is by no means meant for children it was a nice distraction for adults during the busy and stressful holiday season. It won't be up there for me as far as favorite Christmastime movie go with It's A Wonderful LIfe, Christmas Vacation, Elf, Love Actually, or even Bad Santa but it's a film that you have to see at least once in your life to say you've seen it. Tommy Wirkola directed as previously mentioned a dark Christmas thriller that was somewhat hackneyed and reminded me of a few Christmas movies of the past but was new in its own way. Pat Casey and Josh Miller both combined to write an acceptable script that was satisfying action wise but might have borrowed too much on movies of Christmas past. Dominic Lewis composed a script that brought that feeling of Christmas and added action at just the right time. Laura DeLuca did a fantastic job costuming all of the ultra-wealthy characters during the holiday season and of course Santa Claus. Violent Night received an R rating when it was released in 2022. 6 out of 10 stars!!",
    "74": "Hard-drinking Santa Claus (David Harbour) is getting tired of Christmas. He gets caught up when Mr. Scrooge (John Leguizamo) launches a home invasion against the corrupt and wealthy Gertrude (Beverly D'Angelo). She had gathered her family for Christmas and he wants her stolen $300 million locked in her vault.This has some fun. David Harbour is putting his dad bod to good use. I like the premise. The movie needs to be tighter. Santa needs to have more tools. It's not imaginative enough. The movie is also too long. Maybe they could do more referencing Die Hard and other movies. This has some fun. I just want more.",
    "75": "A lousy script with David Harbour and John Leguizamo surrounded by a lousy cast made this film something of a stinker but watchable nonetheless. Santa shows up at same home where a band of theives are there to rob the vault of it's content (money) and with the help of a little girl, Santa is able to thwart the attempts of the band of robbers and save the family on Christmas eve. The script had way too much unnecessary vulgarity, Harbour's role as Santa and Leguizamo's role as the head of the bad guys were meh at best and the rest of the cast was barely needed. Enough brutal fight scenes and bloody messes throughout. A film that was nothing more than a cheesy B popcorn dark comedy. A barely one time watch for the heck of Harbour and Leguizamo.",
    "76": "Are you kidding me?I thought the Mel Gibson Christmas movie, Fatman, was the worst movie of all time but this beats it. Where should I start. I won't even criticize the subject material (yet). If you like slasher movies fine.First of all, the plot is an amalgamation of Die Hard, Home Alone, The Bad Santa and The Santa Claus. I kept waiting for the bad guy to say he is doing this because he didn't get his Oscar Meier Weenie Whistle when he was 5 years old. They don't even explain any reason why any of this is happening. It's full of tropes that are totally used up:The inter-racial divorced couple with the man pining over the wifeThe kid who just wants mommy and daddy to make upThe rich, foul mouthed corporate grandmotherThe trendy, snooty in-lawsThe livecasting nephew teenager videoing everythingThe terrorist hit squadThe Christmas Party that is invaded by terrorists/robbersThe stupid henchmen with German or Swedish namesWho wrote this script? There's not a bit of originality, creativity or continuity in it! There no funny lines in this, no funny gags, the best (creative) death was one guy gets sucked into a snow blower and gets ground up and shot out, while anyone who actually uses a slow blower knows that would jam the thing almost instantly and the guy would only get cut up a bit.Santa Claus flashes back to his past life as a Viking where he used a hammer to kill people. Oh interesting! Santa Claus has a back story? He was evil and mean at one time. Ooooo. What caused his transformation??? Nada, nothing. They don't explain anything. Nothing about his past except that he knows how to use a hammer and finds a sledge hammer in the shed of the mansion and uses it to mash up the bad guys.Santa Claus doesn't use any ingenuity or clever tricks to win. He just smashes 25 heavily armed guys with a hammer and avoids every bullet that gets shot. This is a movie that only a 12 year old, or an adult with a 12 year old mentality could love.Oh, oh, and I at least thought Santa Claus, having been alive for 1100 years, would at least have some magic powers, or something but no: All he can do is pick his nose (literally) to shoot up a chimney, and reach into a never ending bag to pull out presents, none of which magically help him with his problem like Felix the Cat who at least had a Bag of Tricks. At least the Gritty Mel Gibson Santa Claus could resurrect from the dead after having been shot dead (a nice image for the kids) through the heart.Oh, and the team of like 12 guys move to kill him inside the shed, and he kills 25 people. This movie doesn't even make sense. It's completely misedited, mispaced, no-humor, no plot, no character development, no nothing except, well, I would say nothing except taking my money but I have a monthly pass at Regal to see all the movies so all I can ask for back is my time. I left this boring, predictible movie early and waited outside for my wife and watched much more interesting material on YouTube on my phone.Pathetic really. Maybe I wouldn't mind that the goodness of Santa Claus gets butchered by these types of movies, if they were at least good.It is interesting that the same general story line is behind the greatest movie of all time, Die Hard, and the worst: this smoking pile.I'm going to go home and watch, \"The Room\" again, to cleanse my mind.I'm giving this movie 2 stars instead of 1 because the acting was passable.Who blew the studio executive to get this turd made?",
    "77": "Violent Night reminds me a lot of the first Die Hard movie! It's an action movie but really a Christmas movie at heart. Violent Night is a film about Santa Claus stumbling upon a heist at a very wealthy family's house while deliver Christmas presents on Christmas Eve. Also we are talking about the real Santa Claus here! This movie hits all the right notes with over the top action, comedy, and some Christmas Spirit. I really enjoyed. I really enjoyed David Harbour here as our Santa Claus. He brings some depth to the character and is the hero we need in a movie like this. Please know this movie earns its R rating with violence/gore and language. Violent Night is going to be up there with my other favorite Christmas films to watch during the Holidays. Violent Night gets a solid 8 stars out of 10 from me.",
    "78": "It truly is a mashup of Die Hard and Home Alone. It was funny, it was silly, and it was VIOLENT. Really enjoyed it. I can't imagine a scenario where we don't get at least 1 sequel.David Harbour was perfectly casted. The supporting cast was good not great. I believe 8 is a fair rating.John leguizamo was also a pleasant surprise in the film. Many of the other bad guys were disposable but that did not take away from the film at all. It's not going to win best picture anything but if you are going to the movie just to be entertained as I was with my friends, they don't think you will be disappointed.",
    "79": "I went into this blind, not having read anything about it or even watched the trailer.What a pleasant surprise of humor, action, and even some sentimental moments.It's so much fun. This will become a Christmas essential viewing in my home. Everyone loved it, snd I just can't say endo ugh. The family is horrible, the bad guys had no clue what they were up against, and the lore is really enjoyable.I would have just said \"Die Hard with Santa Claus, but with the humor of Home Alone. Enough said.\" But IMDB requires a long review, but honestly the best I can say is you really should do yourself a favor and see it yourself.",
    "80": "The Fact that hes the real Santa and is just FED UP is super relatable and draws you in right away. THEN the drama starts and youre just glad you came.I walked out feeling like I got my moneys worth and more importantly found my new favorite Christmas movie... might not be able to show the kids but $%^# em!David Harbour is amazing and will continue to shine in wahtever he is in.The rest of the cast are enjoyable and deliver. John Leguizamo is funny af and secretly a badass.The story will ward your heart before it stabs you in the chest and you will be left bleeding out with a smile on your face !",
    "81": "I was coaxed into the cinema to watch 'Die Hard with Santa'.And whilst that's a decent enough premise, the movie is utter dross. There is much violence, which I suppose you should expect given the title, but it was all pathetic choreographed fisticuffs or senseless murder. None of the tension in the Nakatomi tower!There were a few funny jokes about Santa being drunk and vomiting over the barmaid, but the rest of the film is so dull you would be far, far better off watching bad Santa on tv.I have no idea how it ends as I left after 45 minutes. Presumably Santa kills all the baddies and the black woman forgives her weedy white husband.",
    "82": "I went into watching this movie with no real idea of what type it was aiming for, and after finishing it, I don't know how to classify it. The opening scene in the bar was funny, and when he took off with his sleigh, and left the bartender his \"present\" I knew this is a different holiday movie. The extremely wealthy Lighthouses have their party in their gated mansion, and they are about to get robbed. Onto this comes Santa, delivering presents. There is both sweetness and over the top comic violence. There is both comedy and killings. The Lighthouse have a very dysfunctional family. The robbers have planned ahead carefully, and are determined to get the money that is in the house safe. There is a lot of blood spilled, and Santa is one very hardy person. The acting is quite good.",
    "83": "Better than I expected, although I could have done without all the @$@%#*!, even though I've been known to cuss like a drunk sailor.Plenty of bloody violence and people die in multiple different ways. Someone on here complained about not enough action scenes. There are plenty of them and they are gory and well choreographed and light. They weren't afraid to use blood and enough lighting so you can see the action. It must have been a big part of the budget.We come to learn that rather than being a jolly ol' elf, Santa is a drunk with a bad attitude who in another life was a bad ass warrior wielding a giant hammer ala Thor.This isn't for the kiddos and has the potential to become a cult classic.",
    "84": "Kind of like, Home Alone meets the north pole version of John McLain. (On steroids) Cliche storyline of a drinking away his problems Kris Kringle actually becomes watchable when he finally adorns the shotty and begins to blast away the chest cavities of bad guys who magically appear on his naughty list. The slap stick version of traps set by the protagonist little cutie (the only one who still believes in Christmas and Santa) hit just a little different when you see an antagonist's face impaled by it. Leaving you in the movie audience shouting, \"Oooohhhhh sh**\" out loud. John Ligz* Gillian? 👍🏾",
    "85": "I was intrigue or curious how this new Christmas flick would turn out, after seeing the trailer. It has all the elements of the usuals, lots of comedy, some drama but overall more action this time, but with more gruesome scenes only catered for adults, and as my title goes, not for the faint of hearts! It has patterned to the classic Home Alone, but totally different plot. If I makes you curious more, go see it but again be warned! David Harbour as Santa Claus gives a new character showing his multiple behavior, showing the classic persona and showing a new different Santa that will shock you, how he comes a warrior!",
    "86": "Violent Night is basically an adult and twisted version of Christmas classics mixed with Die Hard. The concept and idea is genius and honestly had so much more potential than what we ended up with. The acting is tremendously bad and the writing is just a little too much and cringey at times. I really expected and wanted better. The killing and violence did get pretty good at the end except the lighting and darkness made it difficult to see. Despite it not being the best movie and falling short of expectations, it's still entertaining and crazy to watch. IMDb needs to relax with these minimums.",
    "87": "So bad it's good!! Violent Night has a certain charm to it for being a wholly unoriginal rip off of a movie. You could make this same film and put it during any day of the week and it would work. The fact they made the John McClain character Santa is redundant but it does give the film some decent puns. The action isn't particularly good. It's rated R but easily could've been PG-13. David Harbour's performance saved it from disaster and he gives this schlock some decent charm. The parts I like the most were the back and forth between Santa and the little girl. John Leguizamo and the rest of the villains are completely forgettable and boring.I think this film is a rip off a ton of other films and the filmmaking is pretty poor as well but that performance from Harbour and the little bits of comedy made me give this a 6. Not a Christmas classic in anyway but i enjoyed certain parts of it.",
    "88": "I didn't see any trailer for this Christmas movie, I only heard the title and saw the poster with jolly old Saint Nick being the lead character, I often enjoy an alternative festive film, directed by Tommy Wirkola (Dead Snow, Hansel & Gretel: Witch Hunters). Basically, on Christmas Eve, in Bristol, England, Santa Claus (Hellboy's David Harbour) drinks in a pub and complains to a mall Santa (John B. Lowe) and the Barmaid (Marina Stephenson Kerr) that children have lost their Christmas and become increasingly materialistic. The Barmaid follows Santa to the roof, and she shocked and delighted seeing him fly away in his sleigh with his reindeer, until he accidentally vomits on her. In Greenwich, Connecticut, Jason Lightstone (Alex Hassell), his estranged wife Linda (Alexis Louder), and their daughter Gertrude aka Trudy (Leah Brady) are going to the mansion of his mother Gertrude (National Lampoon's Beverly D'Angelo) to celebrate Christmas, along with his alcoholic sister Alva (Edi Patterson), her new boyfriend and wannabe action movie star Morgan Steel (Cam Gigandet), and Alva's social media streamer son Bertrude aka Bert (Alexander Elliot). Jason and Linda tuck Trudy into bed, Jason gives her an old walkie-talkie that they found and tells her she can \"talk to Santa\". Jason and Linda listen overhear Trudy's only wish: for her parents to get back together and to become a family again. Santa drunkenly continues to deliver presents, he arrives at the Lightstone estate, helping himself to tasty cookies left by Trudy, who believes in him, and he also finds aged alcohol. Meanwhile, the caterers of the family Christmas get-together reveal themselves to be mercenaries with Christmas-themed codenames. \"Mr. Scrooge\" aka Jimmy Martinez (John Leguizamo) is the leader of the group, who slaughter the staff and take the family hostage. Santa hears the gunfire and is discovered by one of the henchmen, who is left behind by the reindeer after being scared by the gunfire. Santa and the henchman fight, until Santa knocks him out of a window, getting tangled in a string of tree lights, and he is impaled to death on an icicle decoration. Santa later kills another henchman, stabbing him in the eye with a tree topper, before plugging it in and electrocuting him. Taking the henchman's walkie-talkie, Santa accidentally finds Trudy who is calling him for him, and he finds she is on his Nice list. Santa decides to save her and the family, while also finding that all the mercenaries are on his Naughty list. Scrooge is after the $300 million in cash that was meant for the Lightstone company to supply oil in the Middle East but was stolen by Gertrude and is in the vault beneath the mansion. When Trudy's walkie-talkie is discovered, Jason and Linda try to convince the captors that she is simply playing make-believe. Trudy tries to make her parents believe that Santa will save them, but Jason is frustration and disbelief declares \"Santa is not real!\" and that he is \"made up to make children feel better\". Upset, Trudy runs and hides in in the attic. She calls for Santa, he tells her that in his life before delivering gifts to children he was a barbaric and greedy Viking warrior named Nikamund the Red, and he has been married to Mrs. Claus for 1,100 years. He confirms to her that he is real by telling her about the letters she wrote to him. Meanwhile, lead henchman Krampus (Brendan Fletcher) forces the family to present their gifts to Gertude, who is surprised by a card from Jason. Wounded, Santa is taken hostage by Scrooge, who bears a childhood grudge against Christmas because in his childhood his father lost his job, so he never had a good Christmas. Santa's knowledge of the mercenaries' real identities and their desired gifts as children convinces henchmen Gingerbread (André Eriksen) and Candy Cane (Mitra Suri) that he is real. When he gets his opportunity, Santa uses his magic to escape up the chimney. Gertrude's private \"kill squad\" arrive outside the mansion, but it revealed that Commander Thorp (Mike Dopud) and the entire squad are in league with Scrooge. Morgan tries to escape, and the squad kill him. The vault is successfully opened, but it is empty. Scrooge threatens Linda causing Jason to confess that he stole the money and was planning to flee with his wife and daughter, this is what was written in Gertrude's card. He takes the mercenaries to the money, which is hidden in and around a nativity scene outside, and Gertrude forgives his treachery. Retreating to a shed, Santa finds a sledgehammer and brutally slaughters the kill squad. Meanwhile, Trudy has created booby traps, inspired by the movie Home Alone, to defeat Gingerbread and Candy Cane. While the traps result in Gingerbread's death, Candy Cane is severely injured and prepares to shoot Trudy, but is killed by Santa. Scrooge gives the order to kill the hostages, but Alva, Linda, and Bert manage to kill Krampus instead. Scrooge and Thorp flee with the money and a captive Gertrude on motor sledges, pursued by Santa. Linda kills the last mercenary and Trudy is happy to see her parents share with a kiss. Lured by Scrooge, Santa crashes into a cabin; Scrooge finally acknowledges Santa is real seeing himself on the Naughty list but is determined to kill him and end Christmas. They fight, with Scrooge gaining the upper hand, until Santa uses his magic to drag him up the cabin's chimney, instantly killing Scrooge when he is crushed and disembowelled. Santa is fatally shot by Thorp, who is killed by Gertrude. Jason burns some of the money to keep Santa warm, but he succumbs to his wounds. Trudy inspires her family to all declare their belief in Santa, who is revived by the Christmas magic he still does not really understand. Santa is happy to see his reindeer and sleigh return, his faith in Christmas renewed, so he bids goodbye to Trudy before flying off to finish delivering gifts. Also starring Stephanie Sy as Sugarplum, Sean Skene as Lead Bodyguard, Finn McCager Higgins as Jingle, Can Aydin as Frosty, Cha-Lee Yoon as Techie, and Phong Giang as Tinsel. Harbour as the world-weary volatile Father Christmas is interesting, Leguizamo does well as the no-nonsense villain, Brady is cute as the little girl, and D'Angelo with her gravelly voice is good being acid tongued. It is essentially the same format as Die Hard, the hero must kill the bad guys and save the day at Christmas, with the icon in the red suit being John McClane. But it doesn't matter, as you would expect from the title it does get brutal, in a humorous way, it pokes fun at and pays homage to Christmassy conventions, cliches and movies, and it is genuinely thrilling and entertaining, an enjoyable seasonal action comedy. Very good!",
    "89": "Really hard to watch. Wouldn't recommend.the jokes weren't funny, was sitting there waiting for something to laugh at but barely a chuckle. I gave it a go thinking it would improve but it just didn't do anything for me. Weren't too keen on the concept, the script was not good. Some of the actors lines just felt forced. Sounds bad but genuinely don't really have anything nice to say about this film. So glad I didn't go cinema to see this. Would of been fuming if I did lol. Found myself, doing odd bits around the house while this was on, was on my phone, didn't think to pause it or hurry back, it was just that bad and dry.",
    "90": "This is easily my favorite Christmas Movie ever\nThe title does nothing to give away the excellent joy and laughter that the movie brings\nThey were able to match the magic of Christmas and Santa with the craziness, naivete and vulnerability of life and humanness\nHarbour is a genius, the chuckles and the laughter, I felt like Santa was in the room\nThe other characters were beautiful in their own way, but the standout obviously was the Kid with her throwback Home Alone moments. I laughed and clapped when the shenanigans ensued\nWhat a movie, what a show they put on.Amazing amazing amazing. I would watch this again.",
    "91": "Fun, entertaining and erm... violent alternative Christmas film. Was not expecting it to be so good but it really was. David Harbour is brutal and brilliant.Lots of action, comedy and a little bit of magic. And like I say in the title; it's a bit like Deadpool meets The Santa Claus (with a heavy emphasis on the Deadpool side!). Some good ones liners and dark comedy which totally appeals to my sense of humour. Will definitely be top of my festive film list.Just turn your brain off, switch the Christmas tree lights on, pour yourself a little cup of Christmas cheer and enjoy!!!.... Oh, and absolutely make sure the kids are in bed!",
    "92": "On Christmas Eve Santa (David Harbour) is drinking at a dive bar. He likes his drink and you don't want to stand under his sled as it passes overhead. Jason (Alex Hassell) and his separated spouse Linda (Alexis Loude) with daughter Trudy (Leah Brady) have agreed to spend Christmas at his mother's (Beverly D'Angelo) estate. Mom is a multi-millionaire who is a hard nosed business woman who swears like a sailor. She has caterers for Christmas. Jason and his sister Alva (Edi Patterson) are the sole Lightstone heirs with Alva jockeying for position. Santa enters the house through a chimney in another room while a home invasion is in progress. Deserted by his reindeer, Santa decides to go into \"Bruce Willis- Die Hard\" mode while Trudy plays \"Home Alone.\" Santa has lost a few steps over the past 1100 years and is comically not up to Willis mode.I enjoyed the film. Sure John Leguizamo is no Hans Gruber, but this wasn't really a spoof, just similar. The dialogue was funny. Seeing Santa act like a real human was fun too.Guide: Ample F-words and adult language. No sex or nudity.",
    "93": "A wealthy family home is invaded by a group of criminals, their only hope is Santa Claus.I think this film may surprise a few, I was pleasantly surprised, action packed, violent, quietly amusing, I have a feeling that for those of us that adore Die Hard, and embrace it as a Christmas movie, this is probably going to be up your Street. I'm not sure it's deserving of cult status, but don't ask me why, I have a feeling that in years to come, this may well develop something of a following.The clue is in the title, Violent Night, and boy this film doesn't hold back, in terms of violence and manner of deaths, this film packs a real punch, you will see all sorts, people dismembered, shot, impaled, it really doesn't hold back.If Santa did actually pop down for a visit, I can imagine him being this disillusioned, this irritated, with a genuinely low opinion of people, this is where the film scores in my opinion, the performance of David Harbour, who is genuinely very good.Enjoyable music throughout, good special effects, plenty of action, Violent Night was a Christmas surprise.7/10.",
    "94": "Possibly the most tedious film question ever asked is, \"is Die Hard a Christmas movie?\" Violent Night says \"what if Die Hard WAS a Christmas movie?\"Its an excellent mix of two genres. First and foremost it's a (very violent) man in a tight spot action movie but hidden beneath is a traditional Christmas story of people becoming believers and a jaded main character getting their feative mojo back.The film success is largely down to David Harbour's fantastic turn as a disillusioned St Nick. His ability to project charisma even when appearing tired and fed up carries the day, or in this case, night. He also cleverly avoids the trap of playing Santa too dark, for all his boozing and necessary killing he is still recognisably Father Christmas. The rest of the cast are all decent as well, with John Leguiziamo making a fun villian. Even the child character manages to not be annoying, although some of her dialogue hints that they had originally wanted a younger actress than Leah Brady.The other big plus Violent Night has is its, well violence. The set pieces go above and beyond, with villians being impaled, burned and dismembered. Highlights include a Home Alone inspired sequence (turns out the invaders in this film are a lot less durable than Harry and Marv) and a Mortal Kombat worthy finish to the final showdown. There's also a decent vain of comedy even if you won't exactly be guffawing in the aisles.There are a couple of things that take you out of proceedings, like the bad guys refusal to just shoot their guns and some very generic family interactions, but overall Violent Night is a very fun couple of hours.8 lumps of coal for 10 naughty mercenaries.",
    "95": "And there's nothing wrong with that.When Violent Night is good, it's really good. It isn't always nearly as entertaining as it could be, but it definitely capitalises on its goofy premise in all the right ways at various points.The violence is blunt and rudimentary, but there's something strikingly effective about it. Each hit is loud and visceral, and many of the actual deaths are a lot more creative than I was expecting them to be, even if the violence leads me up to each death is pretty by-the-numbers.I was pleasantly surprised with the small but satisfying character arcs that the script weaves into the simple story. Santa is given a cynical outlook on humanity and himself to overcome, the family has tension to work out, and the mythology of Santa's backstory is actually given a twist to make his capacity for violence make sense in this movie.There's nothing particularly groundbreaking about any of this, but it's all crafted with care and it's investing enough that I could easily see myself watching this in subsequent years.Its aforementioned strengths help it largely overcome its weak supporting actors, dialogue that's sometimes so corny it's cringey, and its few too many scenes of characters sitting and talking.",
    "96": "If you enjoy reading my Spoiler-Free thoughts, please follow my blog to read my full review :)\"Violent Night is one of the biggest surprises of the year, instantly becoming a contemporary Christmas classic! David Harbour expertly embodies a shockingly brutal, savage version of Santa Claus that somehow still delivers lovely messages.Fighting sequences feature truly violent practical stunts, taking advantage of the R rating to provide unmeasurable amounts of gore. Creative use of Christmas songs will leave audiences crying with laughter.A brilliant homage to the seasonal genre classics that should be seen in a packed theater!\"Rating: A-",
    "97": "As far as Christmas movies go, is this better than Die Hard? Of course not! However, it's no doubt a Christmas movie. David Harbor plays a Santa Claus who lost his Christmas spirit and gets it back by going total medieval on a gang of kidnappers looking to take a small fortune from the type of rich folks you hate the most over the Holiday season. Harbor's Santa reminds me a lot of his version of Hellboy, I think when it comes down to it both pictures are Metal as Hell, and it's like Mr. Stranger Things just doing vocals for both albums. Mr. John Leguizamo is in the flick as the naughtiest of naughty men (not as naughty as Hans Gruber, but who can be). Like a sick guitar riff Leguizamo brings his season experience as an actor to create an interesting and funny bad guy. Leaning towards the Home Alone factor, this movie is as violent as the title suggests, which is rare, really. The little kid in turns out to be worse than Kevin McCallister when it comes to projecting her home from criminal masterminds. It's like someone read the minds of every person that watches Die Hard on Christmas day and just wanted to give us something official. I appreciate that.",
    "98": "It speaks so well to the movie that even in its opening scene it manages to swirl together holiday cynicism, holiday magic, and modern comedy, well before the plot picks up for real. Following the title screen writers Pat Casey and Josh Miller, and director Tommy Wirkola, swiftly prove that the first taste was no fluke, for right off the bat this is simply a joy. As we're introduced to our characters we meet a Santa who is all but completely over it all, a deeply divided, mostly unlikable family whose dynamics and personalities recall the Bluth clan of 'Arrested development' (in the original three seasons, when it was funny), and a group of criminals who in their brutality and sobriety represent a distinct foil (well, mostly). Even early on David Harbour fully commands the show with each scene where he dons the red suit, white beard, and black boots, yet with surprisingly strong violence adjoining the bombastic wry humor, in no time 'Violent night' is fabulously entertaining and strings us along for a wild ride that moves fast. I'd heard good word of mouth, but this is even better than I'd hoped!Anchored by those scant few characters that are likable and sympathetic, there's a meaningful current of earnestness in the storytelling that helps to ground it amidst the cheeky echoes of 'Die hard,' the swarthy smarm of the obscenely rich and powerful, the unabashed blend of action thrills and riotous irreverence, and the pointedly peppy, cheerful soundtrack. (And, okay, also those few sweeping themes that would feel right at home in the latest highfalutin superhero flick.) Casey and Miller penned an outstanding screenplay that twists holiday themes and ephemera into the most delightfully warped interpretations of adrenaline-pumping fight sequences and winking, brazen frivolousness. The characters and dialogue are sharp and biting, the scene writing is unexpectedly smart, clever, and varied, and the narrative is richer and more thoughtful than I could have guessed even as it's liberally peppered with free-wheeling, crimson-soaked ridiculousness. The fact that we even get some inside information on Santa himself is just icing on the cake, to say nothing of \"the meaning of Christmas.\" This is definitely not to count out Wirkola, whose tight direction brings every tiny moment to vivid, invigorating life with equal parts joyfulness and ferocity; 'Violent night' may be a romp, but it's an extraordinarily well made one.As the writing and direction lay the foundation, that excellence extends to every component part. Where computer-generated imagery is employed it looks great and blends well into the filmed footage; more importantly, the panoply of stunts, practical effects, and fight choreography is phenomenal. Some small moments are genuinely cringe-worthy, some of the blood and gore is entirely over the top, and some bits are so hard-hitting and impactful that if the likes of Jean-Claude Van Damme were subbed in for Harbour, John Leguizamo, or Mitra Suri this could have been any more straightforward action flick. At the same time, the cast give fine, heartfelt performances to realize the fraught emotions of the underlying drama - including even young Leah Brady - and it's readily apparent that the actors are just as capable when it comes to embracing the forcefulness of the violence, the whimsy of the fantastical elements, and the raucousness of the comedy. Even beyond the aspects borne of the action, the setting and scene writing also provides the basis for terrific art direction, costume design, and hair and makeup. Even the props and weapons look splendid, and keen cinematography and editing help to visualize every piece and otherwise shape the picture into a solid, compelling whole.Somewhere within the last act there does come a point where the tone shifts ever so slightly, and I think it amounts to the comedy fading out as the saga climbs toward its climax. For as much as the title is a zany lark, at its core it relies on a delicate balance between three primary facets of its storytelling; no matter how conscious - and reasonable, within the broad structure of fiction - the reduction of one facet somewhat weakens the whole. (Imagine, if you will, a table with three legs, and one of those legs begins to shrink.) Yet even with this in mind, far more than not the film is so tremendously shrewd and dexterous in every capacity that the loss of some measure of strength in the back end is ultimately rather negligible. It's narrow of purpose and wide of vision, and manages to very ably weave in a wider array of ideas and feelings than one would assume of a Christmas-themed action flick. The central tenet was pure entertainment, yet the skill, intelligence, and sincerity that brings that entertainment to bear is really very impressive. For all the broad praise I'd gathered about 'Violent night' since its release I had every reason to think I'd like it, and still I'm blown away by just how fun and weirdly well-rounded it is. It's safe to say that it won't appeal to everyone, but if you're open to hard-charging action movies, and the swirl of action with comedy, AND the infusion of holiday embellishments, then it's really just hard to go wrong here. Whatever your impetus for watching this 2022 feature is a wonderful time, and I'm happy to give it my very high and enthusiastic recommendation!",
    "99": "Violent Night is a pretty cool idea for a movie. David Harbour is a perfect casting choice. I was really enjoying it for a while but there are a few mixed aspects that hold it back for me.The action scenes are really good with clear camera work and good choreography. The only problem is the scarcity. I believe there are two action scenes before the climax. I wanted more.I was really surprised at how often they seemed to shy away from showing the violence in a move with the word \"violent\" in the title. Now there is definitely a bunch of violence and gore. But there are numerous times where they use strategies seen in PG-13 movies, like cutting away or having the scene darkly lit. They shortchanged the gore fans.And while I thought there were some good heartfelt moments, it became mushy and cheesy more than once.I mostly enjoyed this movie, but I can't help but feel disappointed at how close it came to being awesome. (1 viewing, opening Thursday SuperScreen 12/1/2022)",
    "100": "There is truth in advertising: \"Violent Night\" is set on Christmas and it's gore-in-Santa's-beard brutal. That is the one shred of honesty in a terminally cynical movie that tries to pass off lamebrained sadism as edgy comedy. Please - there is not enough edge here to cut through a fruitcake. David Harbour, cruising on his \"Stranger Things\" fame, portrays a Santa Claus in the grip of existential malaise: He's been doing the gig for centuries and for what? Nothing can please those modern consumerist, ungrateful brats. In between deliveries he drowns his despair in booze. Santa's schedule eventually brings him to the estate of the ultrawealthy Lightstone clan. The matriarch, Gertrude (Beverly D'Angelo), rules over her company and her family with an iron fist and a potty mouth. That last is because everybody in Hollywood knows that nothing is funnier than a swearing grandma, with the exception of a swearing kid. Enter 7-year-old Trudy (Leah Brady), Gertrude's granddaughter, who is happy to oblige. Tellingly all of the movie's would-be meme-able lines are unprintable in this newspaper. Adding insult to bodily injury, the director, Tommy Wirkola (\"The Trip,\" \"Dead Snow\"), and the screenwriters, Pat Casey and Josh Miller, can't even muster any decent set pieces. Instead, the movie unfurls as a tedious series of bloody deaths and witless dialogue. Speaking of wasting one's time: Why cast the excellent Edi Patterson (\"The Righteous Gemstones\") as Gertrude's calculating daughter if you're not going to give her anything remotely fun to do? \"Violent Night,\" trying to have its gingerbread and eat it too, also panders to the Yuletide spirit with Santa learning the meaning of Christmas again and a subplot about Trudy wishing for her estranged parents (Alex Hassell and Alexis Louder) to reconcile. It doesn't help. In the gleefully crass comedy \"Violent Night,\" Santa is real, but also really naughty. He cusses, drinks to excess and relieves himself off the side of his flying sleigh. He thinks kids are greedy, Christmas is tarnished and life lacks meaning-until a house in Greenwich, Conn., to which he is delivering presents gets invaded by robbers seeking to crack a vault while holding a wealthy family hostage. Then Santa becomes John McClane. \"Violent Night\" might as well be called \"John McClaus.\" As Santa stomps and cuts and maims his way through the Lightstone mansion, with a giddy Trudy going full \"Home Alone\" to support him, \"Violent Night\" is often quite entertaining. (Wait for the moment Wirkola unveils a truly demented spin on \"The Nutcracker\"; you'll never look at that ballet the same way.) But even as Wirkola and company ratchet up the violence and find still more clever ways to off the naughtiest of the naughty, a hefty sack of subplots, personal motivations, and nefarious double-crossings bog down what could have been the season's most bloody good time (emphasis on the bloody).",
    "101": "Disillusioned with the increasingly material nature of Christmas, Santa Claus (David Harbour) has taken to drinking and considers abandoning his role after tonight. Meanwhile in Connecticut, Jason Lightstone (Alex Hassell) and his estranged wife Linda (Alexis Louder) along with their daughter Gertrude \"Trudy\" (Leah Brady) get together to spend Christmas at Jason's mother, Getrude's (Beverly D'Angelo), home which will also be attended by Jason's gold-digging sister Alva (Edi Patterson), Alva's influencer son Bertrude \"Bert\" (Alexander Elliot), and her wannabe action star boyfriend Morgan Steel (Cam Gigandet). Trudy still believing in Santa Claus only wishes for her parents to be back together and prepares homemade cookies for Santa. Upon arrival to the Lightstone estate, Santa tastes the cookies loving that they are homemade as opposed to store bought and falls asleep having raided the Lightstone liquor cabinet. However, when a team of mercenaries lead by Jimmy \"Mr. Scrooge\" Martinez (John Leguizamo) storm the mansion and take the Lightstone family hostage intending to steal $300 million from a vault under the house, Santa must rescue Trudy and her family.Violent Night is the latest action spectacle from John Wick producers 87North Productions and their third film overall this year after Day Shift and Bullet Train. Universal acquired the original pitch from Sonic the Hedgehog screenwriters Pat Casey and Josh Miller with the intention of having 87North produce it. David Harbour and Tommy Wirkola were soon attached shortly thereafter with filming taking place in Winnipeg from January through March of this year. Upon release the film received mostly positive reviews from critics and while the film opened in second place behind Black Panther: Wakanda Forever, Violent Night was meant to be a hard edged piece of Holiday counterprogramming comparable to Universal's 2015 horror comedy Krampus with Violent Night's numbers being slightly above Krampus and ultimately becoming a success. Violent Night features many of the staples that action afficionados have become attuned to from other 87North productions, but with an enjoyable take that mixes twisted humor, hard knuckle action, and a surprising amount of sincerity for Christmas and the Holiday season Violent Night's probably my favorite 87North film since at least Nobody.David Harbour's take on Santa Claus has been very much front and center in the marketing for this movie, and deservedly so as he creates a memorably untraditional take on the Christmas icon that near matches Billy Bob Thorton's character from Bad Santa in terms of matching the drunkenness and burnt out cynicism with an opening scene at a bar in Bristol, England setting the stage for his character arc and also being very funny. The movie also features a great collection of characters with the Lightstone family with Alex Hassell and Alexis Louder very strong as estranged husband and wife Jason and Linda, and we also have some very funny jerks populating the family with Beverly D'Angelo having fun playing the casually foul mouth matriarch of the family or Edi Patterson, Cam Gigandet, and Alexander Elliot playing more opportunistic family members. But making her debut is Leah Brady as Trudy and she is absolutely fantastic playing an innocent child character, but also gives the character just enough of an edge to make her more than a construct such as her scenes talking to Santa via walkie or setting up Home Alone style booby traps that aren't restrained by a PG rating.The movie also gives us some memorable villains with the always welcome John Leguizamo playing up the menace with the aptly codenamed Mr. Scrooge who although his primary goal is the $300 million underneath the house makes no secret of his hatred and disdain for Christmas while also being very funny. Brendan Feltcher also gives us some memorable scenes as Scrooge's unhinged henchman \"Krampus\" including something involving a giant nutcracker that had me laughing to a point of near suffocation. Despite the humor present in the film however, the movie is actually a Christmas film spiritually as well as in its usage of iconography with several moments played for sincerity in their discussion of the Holiday season and the scenes David Harbour shares with Lead Brady do a nice job of aiming for the heart. But also aiming for the heart (and the eyes and everything else vulnerable) are the action scenes which are once again nicely choregraphed and brutally entertaining.Violent Night gives you exactly what you want from an darkly comic action take on Santa and features solid filmmaking, writing, and acting to pull it off. David Harbour has created a memorable take on Santa that I'd love to see more of (and they certainly leave the door open for that) and if you love your Christmas tales dark, bloody, twisted, and funny then rejoice because you've found another one.",
    "102": "I wasn't sure I wanted to see a violent Christmas film but I was captivated from start to finish. The story has a certain simplicity yet the writers pull everything together in a way that actually makes sense of things you might want to question. Plus it has a good message, more or less. I won't start by telling you the synopsis and name all the actors with their character name, the way so many reviews seem oddly compelled to do. You already know what the film is about and can easily look up the cast. But I will say that Harbour and Brady are the true stars of this film, although I thought all the actors did a great job selling me on who they were and what they were about.This is truly a dark comedy and I'm a bit perplexed at all the references to Die Hard since the only thing in common are that they happen on Christmas eve and there's a great deal of violence. But the violence here is a work of art, every scene staged to be comical yet gory. For me, it wasn't the laugh out loud type - well, not usually - since there is a level of shock in many cases. Kudos to the writers.I would characterize it more as a Home Alone for adults (no kids, please). There's even a reference to Home Alone in Violent Night which gave credence to my own thoughts of the similarities. The fact that Leguizamo was Scrooge was a nod to the comedic value of the film since he is always in sarcastic parts if not humorous, and stands only 5'8 to Harbour's 6'3.I thoroughly enjoyed this film. But be warned: It is very violent and gory.",
    "103": "Currently in theaters, a Christmas movie you thought you didn't want & you were right. Playing fast & loose w/Die Hard's plotline, we have a bunch of thieves holding a family & its rich matriarch, Beverly D'Angelo, hostage in order for D'Angelo to give up a passel of dough she has foraged somewhere in her home. The crooks, led by John Leguizamo, make mince meat (pie?) out of the rent-a-cops at the estate & even when back-up arrives, it turns out they're in league w/Leguizamo so who can the beleaguered captives look toward for help; why the actual Santa Claus, David Harbour, of course! Meting out justice w/a sharpened candy cane & even a deadlier quip, Harbour engages the bad guys & dispatches them in a manner which would make the Toxic Avenger proud but w/all the spit & polish thrown into the narrative by director Tommy Wirkola (Hansel & Gretel: Witch Hunters/Dead Snow) you get the dreadful feeling of who was this made for? Surely not me since it's essentially an extended SNL skit or the opening gambit from 1988's Scrooged which involved Lee Majors, not something I should have to suffer 90 minutes through. To be honest me & my viewing buddy were off to see something else which we missed so this was the consolation prize...I rather have the lump of coal. Also starring Alex Hassell (late of Netflix's Cowboy Bebop series) as D'Angelo's son, Cam Gigandet as his brother-in-law & Alexis Louder, so good in last year's Copshop, as his estranged wife.",
    "104": "There's such a true point this film makes which not surprisingly gets lost amongst the internet generation, the greed, entitlement and arrogance people show now has killed traditions and long time fables quicker than at any point, people are so weak now they couldn't accept not getting all the gratitude for presents anyway.I've always been a believer in Christmas , I know for some it's the worst time of year and for those I'm sorry, but there's still something magical about what Christmas does to people. I think Christmas films stay with you longer than any other type, from home alone to modern ones like klaus there are films you watch every year that bring you joy, I have a section of horrors and this slots perfectly into that, they're maybe more of an every other year kinda deal.There are a few flaws it's like outside the child and Santa all the budget had gone and these actors felt like those awful tv movie ones you know shouldn't be in the big time, the mom of the girl is fine but the rest, not so much, the only other thing was the order at the end should've been the satisfaction after the event not before as that moment felt forced at that point whereas 10 minutes later it'd have made more sense.The villains were far better, the Scandinavian and the girl doing the home alone stuff was brilliant, normally comes across as cheap and cliche but they did this so well, I like how they didn't try to use logic or make things up, Santa not getting how it worked just felt so much more natural. Whilst I'd have loved more of the home alone style stuff I thought the fight scenes were fresh and creative and really well done.I feel with tweaks this could be a new bad Santa trilogy maybe? Could prequel how his joy got run down over the years and tie in things he did as Xmas wishes that were potentially violent? Just ideas but I'd gladly see a return.I wasn't sure how to feel when I saw the trailer, in my gut I thought it'd be a straight to dvd film that conned me at the cinema, but it isn't. I'm struggling to remember that last really good Xmas film at the cinema, I had a whole imax to myself and watched this and it was joyful!",
    "105": "Make no mistake, this is a violent, curse-y Christmas film. Imagine \"Home Alone,\" except the booby traps worked, and spurted blood. But there's a similar feel good resolution, such as perhaps the sequel (\"Home Alone 2\"?).What I like about this film it is a family coming together movie, it is Old Saint Nick getting his mojo back, and it is the most creative, gruesome moments with Christmas ornaments, candy cane, presents, tinsel, etc. The violence is cheerfully gratuitous, but the message about the Christmas spirit does also come through. And feels fresher, because the message of the importance of family actually comes at some high stakes risk.Sure there's some moments where I wondered where the urgency was-how can Santa spare the time to have an in depth conversation with a little girl with hooligans chasing him? It's not a perfectly constructed film. As well as the little girl seems a bit too old to believe in Santa like she does.But I think the holiday message is there, and even made me reflective of my own consumerism habits of mind.",
    "106": "Now, I did not go into this expecting an academy award winner, but come on! They can do better than this. Idiodic characters make idiodic choices and get themselves into idiodic situations that have deadly consequences to them. Where have I seen this before? Oh yeah, name any movie within the b-movie action genre and it'll probably fit. And the sad part is I could deal with all of that, if the film did not pull as many punches as it did. Now don't get me wrong, this is a violent movie. For the vast majority of it's kill though, it tends to cut away more than it sticks with it. I felt that was just unforgivable considering the nature of the film. Beverly D'Angelo hams it up, big time, as do all of the supporting cast and John Leguizamo feels like one the most underwhelming villians in quite some time. I was not buying his bad guy routine one bit, but was impressed with his inevitable fight scene with Santa. Speaking of Santa, I think David Harbour was the best part of the whole film. He was a great BA Santa that I felt I could root for! To be honest, I'm probably rating this too high for what the movie was. However, I would be lying if I said I didn't find the film enjoyable. Like a guilty pleasure, but one that fried my braincells at trying to connect the dots with the plotholes. Overall, you could do worse than this film, but there are a whole lot of other movies out right now that deserve the attention a lot more than this film does.2.5 naughty people out of 5.",
    "107": "It's hard to believe that some reviewers here actually take this film seriously. Whatever happened to their Christmas spirit?Scrooge is certainly alive and kicking within some people.Well, it's time for Jacob Marley to pay them a visit.What a film this is. It's miracle on 34th Street updated. Edmund Gwenn has been reinvented for 2022 and what a job he does.Of course this film is anarchic, disrespectful, violent, crude, foul mouthed. But it's never nasty\nI've never heard of any of the actors in this film but that doesn't matter does it. Not when the action is this good.It had me laughing out loud frequently.This is not a film for children.This is not a family film.This is a film for adults who believe in Father Christmas.If you don't believe before it starts and you still don't believe after it's over then watch out for Jacob Marley, for he's about to pay you a much needed visit tonight.",
    "108": "This was instantly my favorite Christmas movie, like ever. I was solidly into the story from the beginning, even before the mercenary Santa Claus begins his retaliation.We were given just enough backstory on Santa to make him interesting, but not too much to invest and care about the story and characters. I was given John Wick vibes throughout, and I shouldn't be surprised that the same producers were involved in this movie.I loved the blend of family stories, (sometimes comically) evil bad guys and assassin violence, all with a Christmas twist!Not to mention a really intriguing and then hilarious introduction to Santa.Most of the characters seemed relatively fleshed out, though superficial. The main kid was classic Nice List, and well-acted. We were given some good twists and some insane/over the top references to Home Alone.Honestly, this has to be my new favorite Christmas movie. David Harbour is a great Santa. Idk if I'd like a followup bc I loved it, or not to avoid ruining something pretty great.",
    "109": "IN A NUTSHELL:\nThis is NOT your typical Christmas movie. In fact, it's not appropriate for kids at all. It's a very dark, bloody, violent comedy about Santa Clause. Viewer beware!If you can handle the gory violence and F-bombs, you'll have a fun time. In between the gruesome fight scenes, there is magic and a sweetness about it.A team of elite mercenaries breaks into a wealthy family compound on Christmas Eve, taking everyone inside hostage. But the team isn't prepared for a surprise combatant: Santa Claus is on the grounds, and he's about to show why this Nick is no saint.THINGS I LIKED:\nFans of Stranger Things will love seeing David Harbour play a butt-kicking Santa. John Leguizamo even says a line about a small town with a cop and 5 kids that is a playful nod to fans of the popular TV show.I always get a kick out of the characters John Leguizamo plays in every movie. In this one, he plays a criminal who calls himself Scrooge.I love it when movies reference other movies. A little girl reenacts two famous lines from the family-friendly movie Home Alone. There are also MANY references to Die Hard 2 (1990). People have debated for years whether or not that movie even counts as a Christmas movie (hint: it does).Some of the fight sequences are pretty clever and entertaining.Believe it or not, this movie was written by the same team that made the movie Sonic the Hedgehog in 2020.The walkie-talkie gimmick was pretty cute.THINGS I DIDN'T LIKE:\nMost of the characters aren't very likable.There were quite a few inconsistencies. For example, someone gets their fingers smashed at the beginning of the movie but is completely fine during the rest of the film.Some of the acting isn't very good. It makes the characters feel more like cartoon characters, rather than real people.People make really dumb decisions.TIPS FOR PARENTS:\nThis movie is NOT appropriate for children!Lots of profanity and a million F-bombs\nSooo much bloody violence\nPeople die in brutal, gory ways\nCrude humor and conversations\nSanta is drunk during the entire movie\nSanta pees off the sled while flying\nWe see a shirtless, bloodied man.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "110": "I wasn't sure I wanted to see a violent Christmas film but I was captivated from start to finish. The story has a certain simplicity yet the writers pull everything together in a way that actually makes sense of things you might want to question. Plus it has a good message, more or less. I won't start by telling you the synopsis and name all the actors with their character name, the way so many reviews seem oddly compelled to do. You already know what the film is about and can easily look up the cast. But I will say that Harbour and Brady are the true stars of this film, although I thought all the actors did a great job selling me on who they were and what they were about.This is truly a dark comedy and I'm a bit perplexed at all the references to Die Hard since the only thing in common are that they happen on Christmas eve and there's a great deal of violence. But the violence here is a work of art, every scene staged to be comical yet gory. For me, it wasn't the laugh out loud type - well, not usually - since there is a level of shock in many cases. Kudos to the writers.I would characterize it more as a Home Alone for adults (no kids, please). There's even a reference to Home Alone in Violent Night which gave credence to my own thoughts of the similarities. The fact that Leguizamo was Scrooge was a nod to the comedic value of the film since he is always in sarcastic parts if not humorous, and stands only 5'8 to Harbour's 6'3.I thoroughly enjoyed this film. But be warned: It is very violent and gory.",
    "111": "Currently in theaters, a Christmas movie you thought you didn't want & you were right. Playing fast & loose w/Die Hard's plotline, we have a bunch of thieves holding a family & its rich matriarch, Beverly D'Angelo, hostage in order for D'Angelo to give up a passel of dough she has foraged somewhere in her home. The crooks, led by John Leguizamo, make mince meat (pie?) out of the rent-a-cops at the estate & even when back-up arrives, it turns out they're in league w/Leguizamo so who can the beleaguered captives look toward for help; why the actual Santa Claus, David Harbour, of course! Meting out justice w/a sharpened candy cane & even a deadlier quip, Harbour engages the bad guys & dispatches them in a manner which would make the Toxic Avenger proud but w/all the spit & polish thrown into the narrative by director Tommy Wirkola (Hansel & Gretel: Witch Hunters/Dead Snow) you get the dreadful feeling of who was this made for? Surely not me since it's essentially an extended SNL skit or the opening gambit from 1988's Scrooged which involved Lee Majors, not something I should have to suffer 90 minutes through. To be honest me & my viewing buddy were off to see something else which we missed so this was the consolation prize...I rather have the lump of coal. Also starring Alex Hassell (late of Netflix's Cowboy Bebop series) as D'Angelo's son, Cam Gigandet as his brother-in-law & Alexis Louder, so good in last year's Copshop, as his estranged wife.",
    "112": "There's such a true point this film makes which not surprisingly gets lost amongst the internet generation, the greed, entitlement and arrogance people show now has killed traditions and long time fables quicker than at any point, people are so weak now they couldn't accept not getting all the gratitude for presents anyway.I've always been a believer in Christmas , I know for some it's the worst time of year and for those I'm sorry, but there's still something magical about what Christmas does to people. I think Christmas films stay with you longer than any other type, from home alone to modern ones like klaus there are films you watch every year that bring you joy, I have a section of horrors and this slots perfectly into that, they're maybe more of an every other year kinda deal.There are a few flaws it's like outside the child and Santa all the budget had gone and these actors felt like those awful tv movie ones you know shouldn't be in the big time, the mom of the girl is fine but the rest, not so much, the only other thing was the order at the end should've been the satisfaction after the event not before as that moment felt forced at that point whereas 10 minutes later it'd have made more sense.The villains were far better, the Scandinavian and the girl doing the home alone stuff was brilliant, normally comes across as cheap and cliche but they did this so well, I like how they didn't try to use logic or make things up, Santa not getting how it worked just felt so much more natural. Whilst I'd have loved more of the home alone style stuff I thought the fight scenes were fresh and creative and really well done.I feel with tweaks this could be a new bad Santa trilogy maybe? Could prequel how his joy got run down over the years and tie in things he did as Xmas wishes that were potentially violent? Just ideas but I'd gladly see a return.I wasn't sure how to feel when I saw the trailer, in my gut I thought it'd be a straight to dvd film that conned me at the cinema, but it isn't. I'm struggling to remember that last really good Xmas film at the cinema, I had a whole imax to myself and watched this and it was joyful!",
    "113": "Make no mistake, this is a violent, curse-y Christmas film. Imagine \"Home Alone,\" except the booby traps worked, and spurted blood. But there's a similar feel good resolution, such as perhaps the sequel (\"Home Alone 2\"?).What I like about this film it is a family coming together movie, it is Old Saint Nick getting his mojo back, and it is the most creative, gruesome moments with Christmas ornaments, candy cane, presents, tinsel, etc. The violence is cheerfully gratuitous, but the message about the Christmas spirit does also come through. And feels fresher, because the message of the importance of family actually comes at some high stakes risk.Sure there's some moments where I wondered where the urgency was-how can Santa spare the time to have an in depth conversation with a little girl with hooligans chasing him? It's not a perfectly constructed film. As well as the little girl seems a bit too old to believe in Santa like she does.But I think the holiday message is there, and even made me reflective of my own consumerism habits of mind.",
    "114": "Now, I did not go into this expecting an academy award winner, but come on! They can do better than this. Idiodic characters make idiodic choices and get themselves into idiodic situations that have deadly consequences to them. Where have I seen this before? Oh yeah, name any movie within the b-movie action genre and it'll probably fit. And the sad part is I could deal with all of that, if the film did not pull as many punches as it did. Now don't get me wrong, this is a violent movie. For the vast majority of it's kill though, it tends to cut away more than it sticks with it. I felt that was just unforgivable considering the nature of the film. Beverly D'Angelo hams it up, big time, as do all of the supporting cast and John Leguizamo feels like one the most underwhelming villians in quite some time. I was not buying his bad guy routine one bit, but was impressed with his inevitable fight scene with Santa. Speaking of Santa, I think David Harbour was the best part of the whole film. He was a great BA Santa that I felt I could root for! To be honest, I'm probably rating this too high for what the movie was. However, I would be lying if I said I didn't find the film enjoyable. Like a guilty pleasure, but one that fried my braincells at trying to connect the dots with the plotholes. Overall, you could do worse than this film, but there are a whole lot of other movies out right now that deserve the attention a lot more than this film does.2.5 naughty people out of 5.",
    "115": "It's hard to believe that some reviewers here actually take this film seriously. Whatever happened to their Christmas spirit?Scrooge is certainly alive and kicking within some people.Well, it's time for Jacob Marley to pay them a visit.What a film this is. It's miracle on 34th Street updated. Edmund Gwenn has been reinvented for 2022 and what a job he does.Of course this film is anarchic, disrespectful, violent, crude, foul mouthed. But it's never nasty\nI've never heard of any of the actors in this film but that doesn't matter does it. Not when the action is this good.It had me laughing out loud frequently.This is not a film for children.This is not a family film.This is a film for adults who believe in Father Christmas.If you don't believe before it starts and you still don't believe after it's over then watch out for Jacob Marley, for he's about to pay you a much needed visit tonight.",
    "116": "This was instantly my favorite Christmas movie, like ever. I was solidly into the story from the beginning, even before the mercenary Santa Claus begins his retaliation.We were given just enough backstory on Santa to make him interesting, but not too much to invest and care about the story and characters. I was given John Wick vibes throughout, and I shouldn't be surprised that the same producers were involved in this movie.I loved the blend of family stories, (sometimes comically) evil bad guys and assassin violence, all with a Christmas twist!Not to mention a really intriguing and then hilarious introduction to Santa.Most of the characters seemed relatively fleshed out, though superficial. The main kid was classic Nice List, and well-acted. We were given some good twists and some insane/over the top references to Home Alone.Honestly, this has to be my new favorite Christmas movie. David Harbour is a great Santa. Idk if I'd like a followup bc I loved it, or not to avoid ruining something pretty great.",
    "117": "IN A NUTSHELL:\nThis is NOT your typical Christmas movie. In fact, it's not appropriate for kids at all. It's a very dark, bloody, violent comedy about Santa Clause. Viewer beware!If you can handle the gory violence and F-bombs, you'll have a fun time. In between the gruesome fight scenes, there is magic and a sweetness about it.A team of elite mercenaries breaks into a wealthy family compound on Christmas Eve, taking everyone inside hostage. But the team isn't prepared for a surprise combatant: Santa Claus is on the grounds, and he's about to show why this Nick is no saint.THINGS I LIKED:\nFans of Stranger Things will love seeing David Harbour play a butt-kicking Santa. John Leguizamo even says a line about a small town with a cop and 5 kids that is a playful nod to fans of the popular TV show.I always get a kick out of the characters John Leguizamo plays in every movie. In this one, he plays a criminal who calls himself Scrooge.I love it when movies reference other movies. A little girl reenacts two famous lines from the family-friendly movie Home Alone. There are also MANY references to Die Hard 2 (1990). People have debated for years whether or not that movie even counts as a Christmas movie (hint: it does).Some of the fight sequences are pretty clever and entertaining.Believe it or not, this movie was written by the same team that made the movie Sonic the Hedgehog in 2020.The walkie-talkie gimmick was pretty cute.THINGS I DIDN'T LIKE:\nMost of the characters aren't very likable.There were quite a few inconsistencies. For example, someone gets their fingers smashed at the beginning of the movie but is completely fine during the rest of the film.Some of the acting isn't very good. It makes the characters feel more like cartoon characters, rather than real people.People make really dumb decisions.TIPS FOR PARENTS:\nThis movie is NOT appropriate for children!Lots of profanity and a million F-bombs\nSooo much bloody violence\nPeople die in brutal, gory ways\nCrude humor and conversations\nSanta is drunk during the entire movie\nSanta pees off the sled while flying\nWe see a shirtless, bloodied man.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "118": "I know people will complain about how similar Violent Night (2022) is to Die Hard (1988) and I agree on that fact, but I do not think that is a terrible thing. Violent Night (2022) might be like Die Hard (1988), but I had an enjoyable time with this movie.David Harbour as Santa was great watching. He was funny and cool seeing him fighting the mercenaries, along with heartfelt interactions with a nice little girl who believes in him and hopes for him to save her and her family.John Leguizamo as the head mercenary gave a satisfactory performance that was seriously over the top in the right ways and was funny. The other mercenaries are also over the top in the right ways, and they all have Christmas themed names.The violence in the movie is brutal and can be funny when they want it to be. It was cool seeing David Harbour's Santa have a backstory to why and how he can fight to protect people, while also keeping some Santa lore we all know and the use of his magic in the fight scenes.A cool fight between David Harbour's Santa and John Leguizamo as the head mercenary, along with unexpected moments. Violent Night (2022) is a fun Christmas action movie that I would watch again during the holidays like Die Hard (1988).",
    "119": "Bruce Willis keeps repeating Die Hard is not a Christmas movie. Well, Violent Noght pretty much combined Die Hard 1 & 2 with Scrooge Gruber as the villain. Then add a touch of Christmas classic hits like Home Alone, and so on.Funny thing is, Violent Night is very enjoyable. Of course, it's a violent X-Mas movie with humor and suspense.David Harbour is perfect the role, no wonder he wants a sequel. Maybe next year?The action is solid, with David Leitch involvement as the producer means the stunts are excellent.I vote yes for a sequel, and this time with Mrs. Clause and elves. With a cameo of Easter Bunny and Tooth Fairy.",
    "120": "Hilarious. Over the top. Good Violent Christmas fun. If Christmas and violence werent fun before, they are NOW!For all those who hate the Hallmark Christmas movies THiS IS YOUR best WISH come true: Santa Clause Goes DIE HARD!I have seen many anti Christmas movies and this is one of the funniest new additions to this genre.The good: terrific action fighting choreagraphy, with terrific violent fights that are incredibly FUNNY and ORIGINAL simultaneously. How about being killed by Santa trough electrocution by Chrismtas lights? Or by a skullCRUSHER!More good: despite this being a really VIOLENT Christmas movie (NOT suited for the kids), it still has got an endearing Christmas spirit. Honest!The story: a dysfuntional, but incredibly wealthy family (who hate each other's guts) come together for Christmas. But bad guys kidnap them in order to steal all the money from the vault. Will the bad guys succeed or die trying, when Santa is about to whoop their butts with a skullCRUSHER!",
    "121": "For some reason I believed 'Violent Night' to be a slasher horror movie. I couldn't have been more wrong! This is predominantly comedy, but also a great action movie. This was a pleasant and delightful surprise.The film had me hook, line and sinker from the opening scene. David Harbour stars as Santa Claus (the real Santa), complaining about \"yet another Christmas\" and naughty kids. This is completely in contrast to the loving, caring, patient Santa we've come to know. This Santa hates Christmas.Santa happens to be at the Lightstone mansion when the house is sieged by a group of robbers demanding $300 million from the safe. The group is led by Mr Scrooge (John Leguizamo), who knows every detail about the Lightstone family. Head of the family, is the mother, Gertrude (Beverly D'Angelo), who shows no fear for the robbers. Her daughter Alva is there with her son, Bert, and movie star boyfriend Morgan. And then there's Gertrude's son, Jason, with his wife Linda and their daughter Trudy.Little did Jason know when he gave Trudy a walkie talkie saying it was a direct line to Santa, that it would turn out to be exactly that, and that Santa would be the one to save the family. David Harbour does a mighty fine job as Santa, and he's kinda sexy too.If you're looking to be entertained, 'Violent Night' has it all. The humour is really funny, the fight sequences are incredible, there's loads of action, and there's also gross killings (yup, there are horror elements too). To see a bunch of guys getting hammered (literally!) to the soothing sounds of Bryan Adams' 'Christmas Time', is unforgettable!Well, hell, this was very entertaining from beginning to end and this is going to be a guilty pleasure every Christmas - and throughout the year. It is a very different kind of Christmas movie, and one I enjoyed very much. It is in the vein of horror comedies like 'Ready or Not' and 'The Babysitter'. Love it, love it, love it!",
    "122": "The actor John L . Ruined this movie . He does not come across as a believable character . Sad they couldn't find a better actor to play that role.That said , the biggest problem is the movie is relatively stupid as you would think.I mean someone as Santa's going nuclear is a bad idea. It's like Black Christmas but the opposite of who Santa's is in this .I just found it laughable at the points suppose to be suspenseful and action packed.I guess using John L ( what is his name how do you spell it?) just left me with a bad taste in my mouth .When he was in Moulin Rouge playing the French painter I found that so unbelievable too .It's like why is this guy showing up in roles he was not meant to play?Any how stay home and watch the classics this movie sucks.",
    "123": "I thought the trailer looked potentially funny, but not likely to work when you watch the full film. Surprisingly it did. David harbour plays the real deal Santa Claus, who had lost belief in what he does because of the generations of kids who just expect video games and cash for Christmas. He ends up stumbling into a money heist at the home of a wealthy but dysfunctional family, and despite trying to avoid the situation, the young girl in trouble asking for help us just too much for him to ignore.Let's be clear, this is inappropriate for kids. From how bad Santa has become (swearing, drinking) to how messy the film gets with blood and decapitation. And it's that that makes the film entertaining, of only because there's not too much like it. The heist is very die hard (with plenty of references), a 5 min home alone tribute that turns things up a notch compared to McCauley culkins efforts. The fights with Santa aren't 100% great, but he always finishes wellThe bad thing with this movie is the family overall. The kid is cute enough, but everyone else is annoying. In some ways it's intentional, there's meant to be a couple of good eggs in a family full of vain rich annoyances, but still not entertaining on their end. Also, as entertaining as the movie is, it is silly, don't expect clever writing, but just go with it (I mainly have it a go for stranger things David harbour, legend)",
    "124": "Love actually was actually the only Christmas movie I ever loved so I was pretty excited to potentially add a second to the list. I avoided trailers because this seemed like the type of movie to reveal the entire movie plot in them so I suggest going in blind.From the start, you clearly have a frustrated Santa who's lost hope in the Christmas spirit. David Harbour did a great job at playing a perfect blend of Jason Statham' and Will Farrell' as Santa Clause. For a guy who works once a year sure is grumpy.The movie took time to find it's footing, a couple funny one liners carried the first act but it gets better as it goes. A lot of action, but once it starts it's on and off, so the pacing felt off for me especially in the second act but it all strings together after that to make up for it.Most of the cast was decent, just about did their job but the little girl,Trudy, was just as much a main character and adorable character. I would also watch a Santa's prequel. He seemed to have an interesting original story that wasn't explored, they can't tease us like that, then again it wasn't what the movie was about.Action scenes are great, gory too, so it's not a Christmas movie you'd take your kids too. It's literally Love actually but for the bros. It's a Christmas slasher movie and I'm glad they didn't give it a family friendly rating so they didn't have to mollify any of the bloody scenes. Third act really pulls itself together and is we're you get everything you had expected of the movie going in. Even though Christmas is a prevalent theme, it's less about the message, just more of a comedy and action slasher. Same reason the story and plot isn't anything to behold.There was a really good movie in here somewhere, biggest issue is first half of the movie didn't feel well put together so it takes too long to kick off. I still love it though and violent night goes on a really short list of Christmas movies I've enjoyed. Also, I recently saw a video saying only 'pick me' boys say they like love actually; well to hell with that, I do think it's a good movie lol. I thought everyone thought that.",
    "125": "Violent Night stars the likeable David Harbour as a heroic Santa Claus. This is a movie that will make you believe Santa Claus is real. As the title warns us, it is violent, and it takes place at night. Like all good action thrillers, there's also a lot I found hilarious about it, including some dialogue and certain predicaments the characters find themselves in.It has the good sense to acknowledge up front the homage it is to Home Alone when young Trudy announces she just watched that movie for the first time and really seems to have enjoyed it. Later in this movie she shows she learned something from it. But Home Alone is not the movie this one most resembles. Rather I was reminded of a certain other Christmas time movie with a character named John McClane. Not that one, the other one with the airplanes and the snow on the ground.I have always admired the acting skills of John Leguizamo, and here he delivers another powerful performance, this time as the main villain. The way he delivers his lines and does not hesitate in his actions, is actually pretty scary. But unfortunately for these bad guys, they picked the wrong time and place, because Santa and his little helper just happen to be there, and they are not prepared to deal with what they have coming for them.I watched this on Christmas Day. I should've watched it on Christmas Eve. Better late than never. Check it out while 'tis still the season.",
    "126": "Lots of jerky characters attack the house of a rich woman who has millions of dollars in her personal vault at home. She is having Christmas Eve dinner with her family. The villains and the rich are equally unpleasant. The only exception is the young grand-daughter, who still believes in Santa Claus.Enter dysfunctional Santa Claus, who is having a midlife crisis, and is drunk most of the time because nobody really believes in Santa Claus anymore (and he is overworked).Can the sweet girl who is the only good person in the mansion reinstill the love for Christmas into the disillisioned Santa (David Harbour)? Can the villains be stopped from killing off the rich? Can Christmas be saved?Lots of cynical Christmas situations. Entertaining combination of violence, fight scenes, gun fights, and comedy.",
    "127": "From the producers of John Wick, Violent Night is an action packed dark comedy that really focused on one specific thing: Humor and much blood. A Santa with a heavy past is the one that have to save the day (And Christmas), and he won't do it in an easy way. The movie did a fun build up, as well as much stupid and time filling entertainment. They tried to make a mix of John Wick, Home Alone and some Christmas holiday special and combining it to this. Some of the parts were greatly made, but from another side, some things did let the rating a little lower. Let's mention the cast first. Santa Claus performed by David Harbour was the absolute star in here, he had humor, irony, but at the same time he kept the serious face on and he really did the performance as the badass Santa Claus with no mercy. The Lightstone family was played by basic actors and I would say rather mediocre than serious material. The youngest girl from the family, Trudy, was fun though, as a youngster she did a good job and carried the cast some more. The mafia were fine. They were menacing, but they could be presented better. A better introduction, could I say. The humor was fine, from time to time there was some serious dark humor here, so stupid that it was funny. The bad language was noticeable here. I don't want to say that it was unnecessary, but too much. When they were saying the same word over and over again, the humor became weaker. But I have to admit that the concept with the badass Santa Claus and the bandits was a fun one. The action sequences were interesting at times, but sometimes boring and badly made. When they fought, they only used one camera view, and the scene became less interesting then. If they could make some more views, faster transitions or just something that could sparkle up a little, that would be cool then. The blood and gore were a lot in here. They focused a lot on that, and their point came really brightly in. What I think could be better is if they could develop the story some more, and spare the blood for later. Because the big lack of story made things predictable and basic. They did some story here and there, and then, it was fine, but more developed plot could be fine. I think they did a nice moral about being good and that everything has consequences. The editing was decent, and the score and music choice were just typical for a Christmas movie. After all, Violent Night was a decent Christmas film, very stupid, some things could be changed, some things that could have an upgrade, but in the end, if you want to watch a dark Christmas comedy with much blood and gore, then this is a movie just for you. But if you look from the quality side, then some things could be better.",
    "128": "Violent Night is Bad Santa meets Die Hard via Home Alone.An unpretentious violent festive movie.Gertrude Lightstone (Beverly D'Angelo) is the rich greedy head of a grasping family in Greenwich, Connecticut. She is a corrupt corporate shark. Members of the family despise each other but hang about for the inheritance.Scrooge (John Leguizamo) is the villain, his home invaders plan to rob the Lightstones of $300 million hidden in the house vault.The only reluctant hero is a drunken Santa Claus (David Harbour) who was in the house to deliver some presents. What he lacks in yuletide cheer, this Santa has a sledgehammer from hell to deal with Scrooge and the gang.Unpretentious and manic. Violent Night even has hints of an origin story.It is slightly overlong with some characters just a bit two dimensional. Leguizamo is just a nasty thug who hates Christmas rather than a charismatic villain.",
    "129": "This agreeable but violent picture contains powerful and haunting images, entertainment and amusement. When a group of ruthless mercenaries attack the estate of a wealthy family, the rowdy, unorthodox Santa Claus must step in order to save the day (and Christmas). Santa Claus is on the grounds, and he's about to show why this Nick is no saint. You better watch out!. You know the man !. You know the legend. But you don't know the real story. This the season to get even !. This holiday season, you don't want to be on his hit list !. You better watch out !.Loosely based on the all-time classic Christmas legend, here we have an unusual situation: when a team of mercenaries breaks into a wealthy family compound on Christmas Eve, taking everyone inside hostage, the bunch isn't prepared for a surprise combatant: an offbeat Santa Claus competently performed by David Harbour. This is an adult , engrossing and entertaining picture containing fun, violence and amusement enough. Beautiful scenery though mostly inside, colorful cinematography, atttractive musical score and a breathtaking climax at an impressive final duel lift this story. It is a genuine as well as surprising tale written and directed with professionality, fairness and imagination, though some scenes are far-from-snappy, and basically some set piezes approach to ¨John Hughes' Home alone¨ (1990). If you like David Harbour, you'll enjoy this light-weight thriller/comedy, in which he stars Santa joining forces with a girl to vanquish extremely cunning killers led by John Leguizano who use all kinds of means to achieve their objectives at any cost without caring about committing a criminal massacre. This is one of the many movies starring Santa Claus, most of them are characterized by the traditional Santa, the good bearded Old Man who delivers presents to children, such as: ¨Santa Claus: The Movie¨ (1985) with Dudley Moore and those played by Tim Allen as ¨The Santa Clause¨ (1994) , ¨The Santa Clause 2 : The Escape Clause¨ (2002) , ¨Santa Clause 3¨ (2006) , while others on one side negative dealing with an usually disguised Santa who commits evil deeds and murders, such as: ¨Silent Night, Bloody Night¨ , ¨Silent Night, Bloody Night 2: Revival¨ , ¨Silent Night, Bloody Night 3¨ and ¨Dont Open Till Christmas¨ , \"Violent night\" , \"Christmas Bloody Christmas\", \"Christmas Horror Story\" . Besides, \"Bad Santa\" (2003) by Terry Zwigoff with Billy Bob Thronton and \"Fatman\" (2020) by Eshom Nelms, Ian Nelms with Mel Gibson. Interpretations are pretty well, David Harbour is nice as always , as the outlandish Santa Claus, sympathetic Beverly D'Angelo as the willful grandmother, Alex Hassell, Edi Patterson, Cam Gigandet, Brendan Fletcher, Mike Dopud, while Leah Brady is terrific as the neglected and precocious little girl, as well as John Leguizano playing the relentless and avenging killer.The motion picture was well directed and skilfully made by Tommy Wirkola (What happened to Monday, I onde dager, Hansel & Gretel: Witch Hunter, Zombies Nazis, Zombis nazis 2. Red vs. Dead ), it was fairly successful at the box office but not too much. This craftsman director creates a special ironical thriller that manages to be both scary and humorous, deserving an acceptable consideration. This is an imaginative terror/action/gore picture in which the camera stalks in sinister style and packing lots of blood and guts, but some laughs as well. It's just one long unrelenting bloody feast and average budget terror/tongue-in-cheek movie that still packs a punch for those who like to be horrorized out their wits. Rating : 6.5/10, good; the pic will appeal to action/thriller/humor enthusiasts .",
    "130": "A good old fashioned action movie with a charismatic villain, cliché henchmen and a down on his luck hero portrayed perfectly by Harbour.- - - - - - - - - - - - - - - - - - -There's nothing truly original about it and the moral message was a bit labored and a bit mixed if you think about it, but it was entertaining and good fun even though the middle did drag on a bit.- - - - - - - - - - - - - - - - - - -The action scenes were good, although there could have been greater use of Christmas paraphernalia, and there was the right amount of humour, gore, violence and festive cheer.- - - - - - - - -Score = 7/10.",
    "131": "Are you looking for a Christmas movie that involves Santa? Are you a fan of Die Hard? Do you like gore? If you answered yes to those questions, Violent Night will be right up your alley. Upon hearing that David Harbour would be portraying Santa Claus in a film that would have him taking out criminals on Christmas Eve, I was already sold. I'm glad to say that after watching it, it was exactly what I expected it to be, in all the best ways. Brutal, violent, hilarious, and surprisingly full of heart, if you know what you're in for, here's why I recommend Violent Night.The plot of Violent Night is quite simple. A rich family is gathering on Christmas Eve as a group of criminals enter their home to rob their vault. Santa Claus (David Harbour) also happens to be at this house while he's delivering the gifts. All being awful people and not caring if the people in this family die, this group of criminals becomes the prime target for Santa. Becoming attached to Trudy, a little girl who befriends Santa as the night goes on, their rep-ore becomes the heartbeat of the film and what made me like it even more than the fun, gruesome action that I also loved.If you go into this movie hoping for the next holiday classic or the next great action flick, you're probably going to leave a little disappointed. With that said though, I can actually see myself watching this at least once every Christmas or two. The clever kills, great humour, and surprising heart really do make this one worth watching. If you can get behind excessive kills, this movie does provide some pretty great action sequences. The use of holiday songs also made me laugh quite a bit, in particular, a scene that happens in a barn where Santa is just taking out a bunch of henchmen.Overall, you can't go into a movie like Violent Night hoping for it to be Shakespeare. If you can go into this film, have fun with a ton of violence and equally enjoy the holiday spirit throughout, I think you'll have a great time with this one as I did. The cast is also pretty enjoyable, but more than anything, this is one of the best roles David Harbour has ever had the chance of playing. I would gladly watch a sequel or an entire series based on his rendition of Santa. His performance here made me want to cheer every time he was on screen. I loved every second of this character, but I'm also slightly biased because I love the actor so much. In the end, if you're good with gore and like Christmas movies, I absolutely recommend checking out Violent Night.",
    "132": "Okay. Let's cut the crap, it's Die Hard meets Home Alone.Forget John McClain, Saint Nicolas has you covered.Santa is an absolute bad ass, who attacks a bunch of organised thieves hell bent on robbing a Rich ladies vault, whilst protecting an innocent child trapped in the family Mansion full of hostages.The violence is graphic. The perpetrators are fun. And the hostages are whitty.It quite literally is a violent night and a bullet filled holey night ....for the criminals.Popcorn film if ever there was one.Remember to leave milk and cookies for Santa.....oh and don't forget the whiskey!",
    "133": "Can one even peel a turtle? Let's hope not. But to my point - Violent Night (2022) is not exactly what I expected, though I had no real expectations at all having elected to ignore the trailers and show up with no \"baggage.\" Yet, there were many scenes that harkened to other \"holiday themed\" films, and it's easy to see why many reviewers have compared Violent Night to Die Hard (1988), Home Alone (1990), The Ref (1994), and in a more crude piece of disgusting imagery, Bad Santa (2003).Nonetheless, this is precisely where Violent Night sets into motion the duel themes of cynicism and hope. And in this kind of comedy thriller, it can be quite difficult to tell how it's going to end. In any case, you'll be stuck to your seat even as the credits begin to roll.The warming presence of Beverly D'Angelo was comforting in an odd way. She's mean and nasty, yet loving in a lethally maternal sort of way. I always enjoyed her performances in the Vacation film series. But she looks strangely different here, and I have a feeling she may have had some bad work done on her beautiful face. I feel deeply for actors who probably cringe at having to watch themselves \"age\" so publicly on the screen and so privately as victims of the relentless paparazzi. But let me be clear, this in no way diminishes Ms. D'Angelo's charming performance. She's a dynamic wonderland on two feet and as fun to watch as ever.David Harbour plays the irascible Santa Claus, in both comedic and horrific tones, yet we are immediately sympathetic to him. Harbour is no newcomer to the big screen or small screen. For his work in the Netflix series Stranger Things (2016), Harbour received a critics choice television award, two Emmy award nominations, and a Golden Globe nomination. He also portrayed the titular character in Hellboy, 2019, and appeared as Red Guardian in Black Widow (2020). He's a versatile actor to be sure and always presenting us with something deliciously different.I'm not going to go into the plot here because other IMDb reviewers have provided an ample amount of reading on the subject. But I will say this is neither a Christmas Carol (1951), It's a Wonderful Life 1947), Holiday Inn (1942) (or it's loosely based sequel, White Christmas 1954). I would have to describe VN as both a beautifully wrapped homage to all that is Christmas, like a wonderful holiday Turkey dinner, but with a unexpected side dish which looks very much like a giant lump of coal.No spoilers here (why spoil the fun) but I can say Santa reveals how he came to be, which, while not an original plot device, has clearly never been portrayed like this before. And it's not just \"Christmas Magic.\"",
    "134": "Because this was the perfect x-mas movie. One shall as santa says never compare good or bad x-mas movies cause we all have our own x-mas delights, but this one must be the best made, at least for us grumpy old folks that still believes in the miracle of santi clause... the guy who makes revenge feel like a breadslice full of sweet nugatti (a norwegian food product) which are so full of allergenic histaminic nutt crackling ideas how to make the naughty one understand the true message of christmas...so if you dont understand the message im HAMMERING on my qwertykeyboard then hopes are gone for you. Its violent and to some extent gory, but you wont get a scar on your mind, cause ive seen worse, old and grumpy as i'm and ive seenalåt...just a pity that this film aint for the whole family, because this is really a real make believe in the santa claus concept, because its far too violent for kids under the age of 9, my 27 year eldest would not see this even with his grumpy old parents attending him, and ive doupts that my wife would neither, but mr wirkola, i shall make some serious efforts to make her some time...ohhh , its a wonderful world , full of gremlins, home aloners and other krampussies, grinchos, and tinkerbelles. So if your all in for a sleazy understement of your childhoods most hidden belief, namely ''i believe in santa claus'' then scream it out in the theater of wherever you might be...this is the funniest, wittiest and most violent x-mas action ive seen in 30 years, because its made as a sweet revenge, with just one kill that cannot be sanctified. Which one that is i wont spoil, just see it. A highly recommended x-mas movie tip from the grumpy old man.",
    "135": "Okay, so I was under a very different impression about this movie. I thought it was about a mall/corner Santa that was a trained killer who had to defend his home against a home invasion. I was really looking forward to seeing that movie. What I got was a movie about the actual Santa Claus, Reindeer and all, caught in the middle of a home invasion against a family that was doing shady/illegal/evil business dealings to begin with. Who thought this was going to be a good film?The cast itself was probably one of the most unattractive ensembles in all of cinema, and their talent wasn't much better. The adults were insufferable and the children even more so, and there was not a single person worth rooting for. Santa himself was a lame potty-mouthed drunk, and the antagonists were all no talent lames that looked like they were still doing stunt training instead of working in an actual movie. None of it worked for me, and even the comedy fell flat on its face. (John Leguizamo, in particular, was just dreadful in this movie. The casting agent really dropped the ball there.)I wanted violence and gore, but it was so tame and poorly done that I just didn't want to keep watching it to see how it ended. After about an hour of this nonsense, I threw in the towel and just turned it off. Nothing about it will be remembered or thought of fondly, and I seriously question the taste of anyone who finds this movie to be enjoyable in any way.In a year chock full of duds, this one has to be at the top of the pile. What a complete and utter disappointment of a film.",
    "136": "Every year people are looking forward for the Christmas movie. I'm one of them only I don't need those cosy cheesy Christmas flicks to watch withthe whole family. Give me the ones were Santa offers more then presents.I went totally blind in this one. The only reason I went watching it was due the director I knew from Dead Snow and other flicks.I guess you are only a few minutes in this flick and things already goes wrong in a funny way. And from there on the black jokes and situations keeps coming until Santa himself is left behind by his reindeers. Things really go wrong and the movie turns into a messy gory flick.But it's not a horror, be aware therefor there's to much going on between a teen and Santa, you know, the cheesy talking.I do understand that some will have issues that it's the real Santa going beserk. But hey, don't take it all that serious. And if you know Home Alone well, there's a part referring towards it but much more funnier.I left the theatre with a big smile. David Harbour killed it...the skullcrusher ho ho ho.Gore 2/5\nNudity 0/5\nEffects 3/5\nStory 3/5\nComedy 3/5.",
    "137": "And this just doesnt meet them.I expect a lot of unhelpfuls given everyone else seems to love it. But what a load of rubbish.The editing was terrible and story structure shocking.The movie was a third (trying to be comedy), a third action/thriller, and quarter hallmark movie. Maybe it was trying to be a parody. But it wasnt. It missed the mark on every one. Pick a lane. Or if your going to do more than one, you need to be good at itNothing made sense/was explained - viking anybody? Anybody got any idea how difficult it would be to move £300m in cash with all the (useless) security?Ok ok im maybe taking it too seriously, but man alive. Everybody was horrible except the wee girl, but even she was annoying, like ur 10 love, not 4.And i love beverly d'angelo but, like, can she not move at all? It was like she couldnt move.4 stars as the acting wasnt that bad. Leguizamo was particularly good as usual.",
    "138": "The first thing I notice about \"Violent Night\" is how non-cheesy it is considering I have the expectation of this movie being very cheesy. Instead, I am quite surprised by the production values: decent dialog, good acting by most everyone, good editing, and fabulous fight scenes that are even more engaging than the usual trope delivered by Tom Cruise and X-Men movies. \"Violent Night\" shows no pretense; it is indeed very violent, yet it is the kind of violence that's really more satire and dance choreography than brutal gore. It especially works with the backdrop of a Santa Claus fantasy merged with the hopes and dreams of a little girl during Christmas season. The movie works because of the convincing core relationship between badass Santa endearingly played by David Harbour and the little girl played by Leah Brady which is a highlight of the movie. She effectively conveys a perfect combination of sass with the funny booby trap setups ala \"Home Alone,\" and an overall heartfelt performance led by her expressive eyes and winning smile. This movie is more enjoyable when viewed during Christmas season, but seeing it in late January works, too.",
    "139": "Here's The 4K Lowedown on \"Violent Night\" (R - 2022 - Theater)\nGenre: Action/HolidayMy Score: 8.5\nCast=9 Acting=7 Plot=9 Ending=10 Story=8\nViolent=10 Pace=8 F/X=10 Holiday=6 Humor=8A team of elite mercenaries breaks into a wealthy family compound on Christmas Eve, taking everyone inside hostage. But Santa Claus is on the grounds, and he's about to show why Nick wasn't always a saint.\"I'm gonna eat these guys...like they were a plate of cookies.\" This is gonna crack my top 5 Christmas movies for sure! They say \"Home Alone\" meets \"Die Hard\", but I think it's more Santa Clause meets Die Hard with a Home Alone scene, but I still loved it. It was extremely violent, really funny, with a touch of holiday cheer for good measure. You don't need to run to the theater for this, but it is a very fun watch.",
    "140": "Violent Night is such an incredibly fun film.We follow Santa - the real Santa - as he stumbles into an armed robbery and must go all John McClane on the bad guys.As you can imagine with a premise like this, there is so much potential for outrageously entertaining action scenes and great comedy, and the film really does deliver on both of these elements.The name is incredibly apt because this film is VIOLENT! There are some immensely gory injury details that had the whole theatre gasping and wincing. It truly is a spectacle to watch and any action fans will absolutely love this.Whoever cast David Harbour as Santa deserves a raise, because he is just the perfect casting for this role. He fit the bill in every possible way, from his physical presence, to his comedy, to his dramatic moments. Just perfection.I do think some elements could have been pushed a little further, and the bare bones of the plot was quite formulaic and predictable. These are very minor criticisms however and don't even remotely detract from the incredible fun of the film.In short, go an see Violent Night asap! Santa absolutely smoking bad guys for a couple of hours? What's not to love?",
    "141": "I expected some violence, being that the movie has \"Violent\" in the name, but this was just too much, for no pay-off.I also expected, being that it's touted as holiday movie, some actual comedy and goofiness, but there were none to be found, besides some \"witty\" lines during the marathon of violence and gore, if you find that funny.The story of this movie can easily fit into 10 minutes. This movie requires you to turn off your brain and just expose yourself to murder in a lot of different forms, but it doesn't have anything else going for it.I made a habit not to watch trailers, because some can reveal too much, but oh boy was I mistaken in this case. Instead I relied on few great reviews and overall rating for this movie.Lesson learned, but the movie will be forgotten in few weeks.",
    "142": "Retaining all the joy, merriment & jolly good spirit that makes Christmas such a festive delight even when things go downright brutal & bloody, Violent Night is a surprisingly fun, thoroughly amusing & gleefully violent offering that takes a simple premise and executes it with such wit, flair & sincerity that the film remains an enjoyable ride for the most part.Directed by Tommy Wirkola, the story follows Santa Claus who decides to step in & save the day by going on a vicious rampage after witnessing a wealthy family being taken hostage by a group of mercenaries. The plot is serviceable at best but Wirkola manages to get ample mileage out of the thin script while keeping things sufficiently entertaining & action-packed.There is plenty in here that shouldn't even work and a whole lot of it also looks silly & ridiculous but like any Christmas miracle, it all works out. The film never loses sight of the festivity it's set around and employs all the props, myths & traditions to its advantage. Still, the real highlight is David Harbour who steals the show & steers the film past the finish line with a badass input.Overall, Violent Night is well-aware of its strengths & limitations and makes rather impressive use of available resources to deliver a festive fare that's got all the makings of a holiday classic. An embracingly warm & wickedly wholesome action comedy for those who like their Christmas gifts to be R-rated, this thrilling & mostly satisfying romp is a welcome entry that achieves all it set out to do.",
    "143": "There's a popular misconception that action stars don't really have to act. All they have to do is make the fighting look real, everything else is secondary. This misconception gave birth to the career of a few big action stars who's acting abilities are fairly minimal - I won't mention any names but every action lover can make his own list with ease. Still, I always thought that being able to act is as important in action movies as it is in any other movie. In fact, I think that the choreography of movies' fight scenes is the secondary bit, that could always be worked out.For me David Harbour's performance in this movie is a case in point, it's the second time I notice him in a movie, and the second time I'm owed by his talent. The first time I noticed him was in Black Widow, but I found out that I saw him before in a few other movies, never realising he was there. It's very simple, Harbour is the kind of actor who get so completely into his roles that if you don't pay special attention, you'll miss him altogether. That is, unless his role is big enough to stand out. Harbour is not a scene stealer, he's a consummate professional who performs his role so flawlessly it's as if he's not there, only the role he plays. Without him this movie would've been nothing more than a bloodbath with some Home Alone jokes, with him it gains unexpected depth. The jaded Santa he plays, is so human one has to empathize with him. One can almost feel what it would be like to be that mythical being giving gifts everywhere one Christmas after the other.Harbour gets some real support from John Leguizamo and from Beverly D'Angelo the rest of the cast is very professional, but no special fireworks are flying on screen. And yes, we do get loads of blood - if that's not your cup of tea - avoid the movie, but if you don't mind cinematic bloodletting - this just might be the movie for you.",
    "144": "Violent Night tells the story of Santa Claus(David Harbour) on Christmas Eve. When a group of mercenaries led by Scrooge(John Leguizamo), attack the estate of the Lightstone family to steal their riches, Santa must swoop in & save the day.Violent Night is a brilliant film. Director Tommy Wirkola has given us a Christmas movie that's more suited to hardcore action aficionados & not suited for family viewing. Don't fret though. There's plenty of Christmas magic in this one. The action set pieces are mind-blowing. There are quite a few heartwarming scenes. The slapstick humor is guffaw-worthy & a tribute to Home Alone(1990). One minor flaw is, when does it stop being a tribute & start being a straight up copy of the beloved 1990 classic, albeit with gore. David Harbour is the star of the show as Santa Claus. Harbour steals the show in every scene he's in & is the highlight of the film. John Leguizamo is spectacular as Scrooge. Alex Hassell is awesome as Jason Lightstone. Alexis Louder is amazing as Linda. Cam Gigandet is hysterical as Morgan Steel. Edi Patterson is perfect as Alva Lightstone. Beverly D'Angelo is brilliant as Gertrude Lightstone. Leah Brady is outstanding & adorable as Trudy Lightstone. The supporting cast is fantastic. Violent Night is a must watch for action & David Harbour fans. Go for it & you will definitely be in a jolly mood after!",
    "145": "\"Santa\" (David Harbour) is getting a bit disillusioned with the whole Christmas thing. He is tired of delivering gifts to modern day children who live in an unappreciative, throw-away, culture and so has taken to the bottle rather. Leaving Bristol one night, he rather drunkenly crash-lands thousands of miles away at the compound of the wealthy and therefore entirely dysfunctional \"LIghtstone\" family. Now here we have group of people ruled over by matriarch \"Gertrude\" (Beverly D'Angelo - who just reminded me of Goldie Hawn) who are dealing with their own issues of separation, avarice, precociousness and, yes, I too was already thinking - same old, same old... Wait, though, it seems that this family are the target of some seriously nasty robbers who are after the $300 million hidden in an impenetrable vault in the cellar. \"Santa\", unwittingly, becomes embroiled in these shenanigans and after being initially desperate to get out of the place, he spots the terrified young \"Trudy\" (Leah Brady) and, well, someone's goose is about to be cooked! It can't resists wallowing a bit in sentiment at times, and the familial discord stuff is all very old hat, but when the action scenes kick in we are offered a sort of \"Home Alone\" (1990) meets \"Thor\" (2011) experience peppered with some genuinely laugh-out-loud moments as, of course, the plot follows it's own, very obvious course. It's violent and gory, but the fact that much of that emanates from this epitome of kindness and avuncularity makes this just a bit different - and quite entertaining - with Harbour carrying it off quite engagingly. It is a bit long, and there are times when you want it to pedal faster, but it's a fun watch that is certainly not for the youngsters!",
    "146": "Now, this movie was definitely one that I was looking forward to getting to sit down and watch. And when the time came for me to watch it, I definitely was thrilled.So would writers Pat Casey and Josh Miller manage to deliver a script for \"Violent Night\" that would meet my expectations. To this question I can honestly say; yes. I was genuinely and wholeheartedly entertained by the storyline in \"Violent Night\", as it was a great mixture of a great many number of season themed movies.But the biggest reason for why I was looking forward to watching \"Violent Night\" was because of David Harbour taking on a role such as this and a movie such as this. And he was phenomenal in the movie, as he tends to be in whatever he performs in. He was nicely cast for the role and really carried the movie quite well.I was rather impressed with the cast ensemble in \"Violent Night\", because they had a great ensemble of talents here, with the likes of John Leguizamo, Beverly D'Angelo, Brendan Fletcher, Mike Dopud, and more.\"Violent Night\" is a very enjoyable and entertaining movie, just keep in mind that it is a rather violent Christmas-themed movie, so it is not suitable for everybody. I was very much entertained by \"Violent Night\". It is definitely a movie that I would recommend you to sit down and watch.My rating of director Tommy Wirkola's 2022 movie lands on a seven out of ten stars.",
    "147": "David Harbour as a heroic, butt-kicking Santa Clause is all we really needed for Christmas in an awesome holiday comedy. Violent Night deserves its place up there with all the other well-known Christmas classics that this movie borrows a few elements from each of. It includes gleaming references and clever boobytraps from Home Alone, a crime-hostage concept like in Die Hard, some of the dark fun from Better Watch Out, some confusion from The Santa Clause, as well as potty mouths and kid-unfriendly humour from Bad Santa.One of the most fulfilling and freshest parts of the movie is, without discussing it all, the savagely brutal violence and insane gore. If you're rooting for as much gore as entertainment, quality, characters and decent story, who needs John Wick when you've got Saint Nick in Violent Night. If you've seen some humour he's been involved with in the past, like all his funny scenes and the jokes in Stranger Things, it doesn't take a lot to notice that actor David Harbour is a gem, the one key for most of the fun in this thrilling Christmas action-comedy. He pulls off a really funny, yet cursing and violent Santa who's extremely likeable and incredibly entertaining to watch. But he's not the fake mall Santa like in Bad Santa; this is a sweet, dark movie for adults that still believes in Christmas magic.You can find plenty of people online complaining about how the family in this movie is too quirky and obnoxious at times, which they certainly are and they especially are while being held at gunpoint, but that's another really fun side of the film. When the audience isn't with Harbour's fantastic Santa character, we're either with the serious-behaved mercenaries or having fun inside with the family. The only aspect that feels really uninspired is the fact that this movie is sort of all held together only by Santa being motivated to save the family because he's been communicating via walkie-talkies with the little girl. She's probably the least best character in the movie. But for a holiday movie, Violent Night is something you should definitely watch; don't be afraid to spend your money on it and watch it with a bucket of buttery popcorn.If you liked this review, check out the full review and other reviews at aussieboyreviews.",
    "148": "This is just so mad that it works.Is it high brow? No.Is it a tonne of fun? Hell yes!If you like \"traditional\" Christmas flicks but also are in the \"Die Hard is a Christmas movie\" camp you will probably enjoy spending 2 hours with this. Seasonal daft fun.You need to be looking for a festive film, but also be looking for an action movie to really appreciate this, I guess. The main protagonist is Santa Claus, but the violence is brutal in places and it's like John Wick staged a Nativity in places. It knows what it's trying to do those and does it well. Fights are excellent, but -somehow- you stil come out of it feeling Christmassy.,"
}