{
    "0": "Poor Things tells the story of animated woman with her baby's brain. She develop conscience and slowly carved herself into womanhood with some few man getting on her way.The First two thirds of the film works really well.Emma, Rufallo, Ramy Youssef were marvelous in their respective role.You could feel that Yorgos really camped it up and could see how he was enjoying the material. The visual game too in these portion is through the roof. All the jokes were hitting well. AND while do feel weird thinking that this is a baby trying to heck out of her loins, the most important thing about this is that there is a constant growth in Stone's character. She develops a childlike confidence in her ideas AND develop empathy. AND even gives some pointed observation of the questionable people around him.But something went south after the Paris scene.Everything that it is heading towards suddenly felt very empty.I just do not know if Emma's character is representing everything at all. Suddenly, all her growth just felt surface level. She wants everything and just gets everything. It became that 'Genius'\nplot AND it seems to lose track of what she really represent. It just became pure fantasia without any kind or semblance of a stakes. She just wants, and she gets. That really bothered me, since then film is positioned that she killed herself because she feels stifled by the her husband and his controlling ways.Its a liberation alright BUT it does not know what is she being liberated from. She just is free BUT with everything free to begin with.Overall, a great setup that fails to stick its landing. Overhyped.",
    "1": "The story is so bizarre and what occurs can only be explained as a chaos of emotions but the movie translates that into one of the best coming of age stories I have ever seen. Emma Stone is the star of this movie. She carries the movie's bizarre scenes and dives fully into the this chaotic character. The movie does not shy away from its R rating and challenges the audience on what to feel during those moments. The supporting cast is just as weird and quirky in all the best ways. Mark Ruffalo especially is almost unrecognizable from his recent roles but is a lovable stand out and is usually the centerpiece of many of the jokes of the movie. This is a must watch for its original story and beautiful world it creates.",
    "2": "While he is unmistakably a unique voice in cinema, I'm not as big of a fan of Yorgos Lanthimos as many critics and cinephiles tend to be. I sometimes feel that his films focus more on attempting to provoke and shock the viewer rather than, and at the expense of, putting compelling storytelling first. While his quirky and risqué new film \"Poor Things\" doesn't completely overcome that concern, it is a step in the right direction from a storytelling perspective. An occasionally rudderless plot and some not very well developed supporting characters prevents it from being a home run, but it's still a solid film that should please independent film lovers who know what they're getting themselves into.The film centers on Bella Baxter, a woman who is brought back to life with the brain of her baby by Goodwin Baxter (Willem Dafoe, who Bella refers to as \"God.\") The movie primarily centers around Bella's development and autonomy as she begins to understand the world around her, including her relationships with two very different men and her gradual questioning of her purpose and desire for liberation within the confines of a patriarchal society, particularly as it relates to sex. Despite some darker undertones, this premise has plenty of fodder for humor, which Lanthimos delivers. There is deadpan and screwball-style humor in various places throughout the film that feels clever and incisive, although some jokes feel a bit too forced or repetitive. The jokes and writing are complemented by the performances, which are generally very good but not always optimally effective in displaying a strong range. Emma Stone is great, however, as Bella. The supporting cast is generally good, including Mark Ruffalo, Willem Dafoe and Ramy Youssef, although I would not necessarily say any of them uniquely stand out. What does stand out within the confines of the narrative, however, is the film's stunning production design of fantastical Victorian Europe, which is stunning to look at and combines a variety of unique aesthetic choices and color palettes to great success. The film probably didn't need to be nearly two and a half hours long, and some scenes feel a bit dragged out or lacking in purpose, yet the outrageous and blackly comic tone accentuated by the bold stylistic choices on display here make the film a worthwhile viewing experience. Recommended to those okay with graphic sexual material. 7/10.",
    "3": "First of all, I can't express how happy I'm to be among the lucky ones having the opportunity to watch something so special before the official release and all that thanks to the organizers of Cinelibri IFF who brought the movie in my country Bulgaria just after its screening at NYFF and six other prestigious festivals. So if somehow somebody of the organizers of the festival see this, I'm so grateful, it was a special night and even the idiots in the public couldn't ruin it for me. That's what we should see in Bulgarian cinemas. Anyway, now to the point.One is certain, this is a movie that is not just one of the hottest and most successful films of the year, but a movie that instantly becomes part of cinematic history. It's so beautiful and accurate in capturing a person's development and clashing with the world. I won't be able to describe the professional means used to accomplish the whole experience, but ones you see it, it's impossible not to feel it. At the same time, the movie is definitely not pretentious in any way, regardless of the depths of the philosophical problems that it covers - live, death, faith, God, poverty, social classes, inequality of sexes, trauma, love and etc. It is so normal in its own abnormality which for me is making it so special and close to my heart. And, of course, the humor. Don't know if there is such a thing as your type of humor, but if it exists, this definitely is mine. And everything is brought to life(literally in this case) by these talented, talented people - the actors.I'm sure this type of movie will bring broad audience among which way more eloquent and experienced people than me who will have something more appropriate to say about the movie(not to mention the critics reviews that are already available), but I believe that shouldn't stop me from trying to express what something so special made me feel and think about. I can't wait for the world to see it and me with all the people. Again. And again.",
    "4": "Director Yorgos Lanthimos takes us on a captivating journey with \"Poor Things.\" Emma Stone's portrayal of Bella is nothing short of mesmerizing. The character's evolution is beautifully captured through the director's unique visual style and rich textures. Lanthimos delivers a thought-provoking experience that leaves the audience deeply engaged.Additionally, Emma Stone and Mark Ruffalo truly deserve their Oscar nominations for Best Actors in \"Poor Things.\" Their performances are nothing short of brilliant and bring depth to the characters. The film's soundtrack, sound editing, costume design, and production design are all equally amazing, contributing to the overall excellence of this cinematic gem. \"Poor Things\" is a masterclass in storytelling and filmmaking that deserves recognition at the highest level.",
    "5": "I had high hopes knowing that this was a Yorgos film, but was also hesitant because not all of his films I loved... However, this might have been the best film he's done so far. Emma Stone is a scene stealer. If she doesn't get at least an Oscar nomination for this role, I'd be stunned. Stunning set design, cinematography, use of colors, and overall, fantastic story on feminism. Highly recommend this to anyone, though I feel most people would either love this or hate this. Plenty of laughs, but also plenty of endearing moments that truly make you think. Yorgos is an auteur, and I look forward to his future films.",
    "6": "\"Poor Things\" is a captivating cinematic experience that delves into the complexities of life, love, and societal expectations. Directed by Renowned Director X, the film takes inspiration from Alasdair Gray's novel of the same name but adds a cinematic flair that elevates the narrative to new heights. The movie boasts a stellar cast, including Oscar-winning actors and rising stars, who deliver performances that breathe life into their characters.The storyline follows Bella Baxter, portrayed by the talented Lead Actress Y, a woman with a mysterious past who undergoes a transformative surgery, resurrecting her into a new, vibrant existence. As the narrative unfolds, we are taken on a journey through Bella's tumultuous life, exploring themes of identity, agency, and the consequences of playing god.One of the film's strengths lies in its thought-provoking screenplay, penned by Screenwriter Z. The dialogue is sharp, infused with wit and humor that provides a necessary balance to the darker undertones of the narrative. The pacing is deliberate, allowing the audience to absorb the nuances of each character and the intricacies of the plot.",
    "7": "Excellent works should really win the oscar. The visual effect is better than that of Marvel movies. There are many elements you want to express, but they are not messy at all. The best work in the film in the past two years, the best soundtrack, the best costume design, the best performance, the best photography, and everything is an excellent work.Everything in the film is novel and unprecedented. It is not just feminism, but the director wants to express more, including intellectualism, cognition of self-body, motherhood, socialism, and slave society. All this is so real, but it turned out to be a fantasy film. When the heroine stopped to enjoy the music, I once cried. I cried and laughed at the same time in this masterpiece.",
    "8": "I was never shocked or surprised by the film, it just felt like it was trying to be bizarre for the hell of it. It felt like they could never settle on an age Bella Baxter was supposed to be, the music was so sharp and painful to listen to, I didn't care about the characters, it felt like there was no point to so many scenes - like the dad showing the kids how to have sex. And then in the end she says she's gonna save her ex-husband and then instead turns him into a goat. It's a very bizarre and pointless film. It seems like the film was trying to be a dark comedy, but it ended up being more of a nightmare. I did like Ruffalo and Usseff's characters a lot in totally opposite ways. I appreciated the dark, introspective moments the film had, but they only went so far into that. I saw it opening night at the theatre and could feel the disengagement from the audience. Walking out afterwards there was a lot of murmurs of disappointment.",
    "9": "This blew me out of the water. I had been waiting for this film for a year and when I finally got the chance to go see it at my local film festival, in a fact I didn't get tickets at first but then some people cancelled and I got those tickets and boy, this film is the best of the year. Make-up, art design, background design was all amazing. All of the actors did an phenomenonal job but some standouts to me were, obviously Emma Stone, William DeFoe, Ramy Youssef and Mark Ruffalo. The fact that they some things in this film are just so interesting and the way the capture Bella's growth as a character is just all to the screenwriter Tony McNamara. Yorgos Lanthimos uses some of the most interesting camera styles I have ever seen. All in all this is a standout film and I will never forget it.",
    "10": "Let's start with the obvious: the film is visually captivating and every performance is stellar. The world Lanthimos builds around Bella Baxter is gorgeous and unique. Emma Stone and Mark Ruffalo are definitely at their best here. Willem Defoe's performance is wonderful as well. You could feel through the screen that the cast had so much fun making this film.That said... the story, the dialogue, the point? If there was one? All fell flat for me. It felt like weirdness for the sake of weirdness. Firstly, let's really think about the story for a moment. A mad scientist finds a pregnant woman teetering in the space between life and death, and brings her back to consciousness by putting her unborn baby's brain in her skull. In the beginning of the film, Bella is like a toddler. Breaking things, throwing tantrums, walking funny. Then one day out of nowhere she starts playing with herself and becomes sex-obsessed. This is... questionable. Concerning. Was weird to watch as a pregnant woman myself. Okay, I thought, just an awkward part of our protagonist's development. NOPE! The rest of the film is centered around her sexual escapades. First playing with herself, then using an apple for her sexual pleasure, then asking her fiancé to \"do\" her, then running off with a colleague of her father's because he gropes her w/o consent and she likes it, then becoming a prostitute to make money in Paris. The sex scenes in the film are frequent, raw, graphic, and really hard to watch. (keep in mind that she's supposed to have the mind of a child!)About halfway through Bella Baxter's time in Paris, my husband and I were considering walking out. And we're not prude or anything- we saw Saltburn a few weeks ago and thought it was so fun. We walked out of Poor Things, looked at each other, and rolled our eyes. I was left feeling like a lot of Bella's potential was left unexplored, like her desire to learn, become a surgeon, understand what lead to her suicide, etc. All of those things were an afterthought compared to her interest in what she calls \"furious jumping\".Three stars for the visuals and the acting. As for the whole package? Disappointing and vastly overrated.",
    "11": "\"Poor Things\" is a spellbinding tale that catapults the audience into the fantastical evolution of Bella Baxter, a young woman brought back to life by the brilliant and unorthodox scientist, Dr. Godwin Baxter. This film is nothing short of a hero's journey, meticulously crafted into a new frame, and one can't help but imagine Mary Shelley reveling in the sheer audacity of it all.The filmmaking prowess displayed in \"Poor Things\" is nothing short of remarkable. Directorial choices, cinematography, and a hauntingly beautiful score come together seamlessly to create an immersive experience that captivates from the very beginning. The film dares to tread into unexplored territories, blending elements of science fiction, drama, and dark comedy with astonishing finesse.Emma Stone's performance in \"Poor Things\" is nothing short of a revelation. With nuance and depth, Stone breathes life into Bella Baxter, delivering one of the most captivating performances ever witnessed on screen. Her ability to convey the complex emotions of a character grappling with the very essence of existence is a testament to her exceptional acting prowess.At its core, \"Poor Things\" is a compelling exploration of what it means to truly live. As Bella navigates her newfound existence, the audience is taken on a journey that challenges preconceived notions of life, morality, and the boundaries of scientific intervention. The narrative is richly layered, and the script masterfully weaves together humor, philosophy, and poignant moments, offering viewers a thought-provoking experience.It's important to note that \"Poor Things\" might not be for everyone. Its unique blend of genres and the exploration of existential themes may polarize audiences. However, for those willing to venture into the extraordinary, the film rewards with a storytelling brilliance that transcends conventional norms.In conclusion, \"Poor Things\" stands as a cinematic triumph. It pushes boundaries, challenges expectations, and delivers an unforgettable experience. Emma Stone's stellar performance, coupled with the film's daring narrative, makes it a must-watch for those seeking a thought-provoking and visually stunning journey into the realms of life, death, and everything in between. Beyond brilliant, \"Poor Things\" is a testament to the power of storytelling and the magic that unfolds when a talented cast and crew come together to create something truly extraordinary.",
    "12": "Every facet of Poor Things is odd, quirky, and unsettling--and intentionally so. This area is a well-known powerhouse for director Yorgos Lanthimos, and perhaps what is most impressive about it is how smartly crafted everything comes together, from the way various shots are framed all the way down to the witty dialogue and expressions moment to moment. Even the music theme is in a frequent pitch-bend, with each twing grating our ears with discomfort like the insidious Midsommar score by Bobby Krlic. This one goes even deeper down the rabbit hole than The Favourite, with hysterical running gags, fisheye lens, mad science, outrageous characters, and stunning set and costume design as if from a lavish Michel Gondry period piece.The story has strong vibes of Voltaire's Candide, as the protagonist, a beautiful, young, naive woman, takes an optimistic dive headfirst into a nightmarish world of men and propriety. Emma Stone is tasked to portray a wide range of mental acuity for her character, given a science fiction aspect of the film's premise (one that becomes less and less shocking the more we explore the world around it). It features peak Willem Dafoe, in a memorable role that just seems written entirely for him, and Mark Ruffalo, who expertly plays one of the more overtly satirical figures in the film. The degree to which these three (and others) commit to and embrace the absurdity of their roles in this world is a big part of why everything works as well as it does.Runtime is 2 hours 21 minutes, yet there is not a dull moment in the film not worth rewatching. You get invested in this wild tale and will not want it to end. It delivers raw, bold, scathing critiques on class, shame, sex, abuse, and dependence--all in impeccably awkward and satirically brilliant form. Like many of his films before it, Poor Things is a robust package of truths about ourselves that are as embarrassing to witness as they are impossible to deny. Yorgos delivers yet another remarkable film of the highest quality. If you've enjoyed his other films, I would not miss this one.",
    "13": "\"She's like nothing you've ever seen\"The same can be said for this film, which I saw at Film Fest Gent in a packed theater. It was the 5th film of the day for all of us there, but the audience was lively and exuberant. And it's no wonder, since Poor Things is nothing short of a monumental achievement: it is at once the funniest, smartest, best looking and most entertaining film of 2023. With its radical inventiveness and audacious creativity, this masterpiece may turn out to be viewed as a cinematic milestone by future generations. At the very least, Poor Things is Yorgos Lanthimos' magnum opus and deserving of instant classic status.The plot outline for Poor Things could be described as Frankenstein with a modern, feminist twist, with Godwin 'God' Baxter (William Dafoe) assuming the role of the doctor who brings Bella Baxter (Emma Stone) back from the dead. As an adult woman equipped with the brain of an infant, Bella is blessed with the intense curiosity and sense of wonder that only a newborn can have. She quickly develops a will of her own and it isn't long before she escapes her imposed confinement (shades of Lanthimos' debut film Dogtooth) by running off with smarmy lawyer Duncan Wedderburn (Mark Ruffalo) on a journey of exploration of both herself and the world.I cannot say enough about the breathtaking cinematography and spectacular production design of this film, which is quite frankly atypical of what I'd had to come expect from a Lanthimos film. Not that his previous films have looked bad, but \"visually striking\" is just not what pops up first when calling to mind his films. The first act, which takes place at Dr. Baxter's mansion, is filmed in gorgeous black and white (a nod to the original Frankenstein adaptation perhaps?) and already displays some bold artistic choices, such as the frequent use of fish-eye lenses to create distorted images. But it is once Bella embarks on her adventure into the outside world that we realize we're not in Kansas anymore. Stunning visuals of luscious sets and amazing costumes in impossibly vivid colors light up the screen, as we discover an exaggeratedly artificial world through Bella's perspective, being one of childlike bewilderment.Emma Stone gives a career-defining performance as Bella Baxter. When we first meet her, Bella is less a person than a stumbling 'creature' equipped with the vocabulary of a child. Stone does an excellent job of portraying Bella's development towards becoming a 'real person', by gradually improving her grasp of language and her manner of walking, to name just a couple of things. She also convincingly sells the incredible character arc that Bella goes through during this film. It's a physically and mentally demanding role, the kind of performance they usually hand out Oscars for.William Dafoe is perfectly cast as mad scientist Godwin Baxter, who looks more like the monster of Frankenstein than the doctor that created him. Dafoe unsurprisingly does a fantastic job here, knowingly leaning into the absurdity of the story with some of his delivery, but still playing his character sincerely.A special mention has to go to Mark Ruffalo as Duncan Wedderburn here, the impossibly suave globetrotter and self-proclaimed ladykiller who brings temptation into Bella's life and takes her into the wide world. Ruffalo chews the scenery, playing Wedderburn almost as a parody of the archetypical smooth womanizer and delivering his lines with visible glee. But his histrionics actually suit the arc of his character perfectly, as he is eventually driven to utter madness by Bella's insatiable taste for sexual and intellectual exploration and the often irrefutable logic she uses to explain her actions and dismiss his complaints.However, Poor Things doesn't only overwhelm with its abundance of style and larger-than-life performances, it has something to say too. As Bella, with the voraciousness a child, develops a taste for both sexual and intellectual gratification, the film cleverly uses her unbiased perspective to ask seemingly logical questions about some of the the established gender roles and class roles she perceives in the world around her. Who would have thought that Yorgos Lanthimos, the Greek director known for his idiosyncratic style, which often expresses a cynical worldview through pitch-black, deadpan comedy, would be the one to deliver not only the most visually dazzling film of 2023, but also the most piercing critique of the patriarchy and established gender roles? (looking at you there, Barbie)Time will tell if Poor Things will be heralded as the game changer that I personally envision it to be, but at the very least we can just be happy that such a defiantly original and wonderfully creative film was made to be consumed by a mainstream audience here in 2023. As long as this kind of uniquely cinematic experience continues to exist, we can look optimistically at the future of the medium. Go see this film!",
    "14": "Hilarious, bizarre and a philosophically very dark comedy - cinema at its finest!I just watched this film at the Biennale Festival in Venice and I'm totally mesmerized by it: This is as good as cinema can get!!!The film dares to ask boldly all the deepest und most relevant questions in our life.A philosophical journey of questioning the established values of the society, the concept of morality and the true meaning of life itself. An absolutely brilliant performance, especially by Emma Stone (I'm quite sure she will win an Oscar for this!), a fantastic set and costume design, I'm not even getting started on storytelling, cinematography and editing... Oh Yorgos oh Yorgos!I would love to watch it again immediately as soon as it is out in theaters.PS: I have only one wish regarding music: Tom Waits would have gone very well with this. In my head Tom was playing while I watched the film.",
    "15": "\"I must go punch that baby.\"The first film of the Leeds International Film Festival 2023 (LIFF), and what a strong start!Poor Things is a humorous, sexy, and Gothic tale that can be philosophically but in the most bizarre ways. There is something so wonderful about the weird, especially in art.Emma Stone's performance as Bella Baxter was just glorious. It's also a very \"risky\" performance because when we first meet her, she is a child in an adult body after being reanimated, with her vocabulary being on the same level as a three-year-old, and her uneven body posture/moments, as if she's still learning how to move. There is A famous movie saying, \"Never go full stupid\", but Stone finds the right balance that prevents it from being embarrassing to watch, which other actors failed at. However, that section is only at the beginning, and as the film progresses through her journey of becoming herself, we see her understanding of language and walking improve significantly.Bella is a fantastic main character, and she's easy to care about. We want to see her succeed, and Emma Stone was terrific.This is the best performance I have seen from Mark Ruffalo, as every time he was on screen, the audience and I were laughing. His character is a loudmouth parody of the ladykiller, who takes Bella under his wing and has her for himself. He chewed up the scenery, and it was astounding. There is a scene in this movie where both Bella and he have a chaotic dance, but the little dance he does on his way to the dance floor, I can't stop thinking about it. It was so funny.William Dafoe, which should come as no surprise, delivers a superb performance as the monster-looking scientist Godwin Baxter. He is often referred to as 'God' at times, with his patchwork flesh of a face having a distant cross on the right side of his face. He very much plays the role of God, as he does the impossible and gives new life to unfortunate lost souls.I'm just saying this right now, but the Best Supporting Actor race next year might be the best if nothing ruins it. I hope not. Imagine this: Robert Downey Jr. For Oppenheimer, Ryan Gosling for Barbie, Robert De Niro for Killers of the Flower Moon, and Ruffalo & Dafoe for Poor Things.Everything on a technical level, such as cinematography, the score, costumes, and the production design - all extraordinary and benefited in bringing this world alive. The whole movie feels otherworldly and timeless.What I find compelling about director Yorgos Lanthimos is that if you examine his movies, the stories in his movies are simple. The Lobster is about fulfilling societal norms we feel we need to follow, such as getting a job, applying to a college and university, being with a romantic partner, having kids, having interests, and eventually dying. The Killing of a Sacred Deer is a horror revenge tale where a family gets cursed after the fathers' wrongdoings. The Favourite is a period piece drama/comedy about two reveals who try to win the love of a bipolar queen.Poor Things is a fresh re-imaging of Mary Shelley's Frankenstein (also based on a novel by Scottish author Alasdair Gray), remodeled as a coming-of-age story told through a female perspective. The needs, the wants, the issues, and losing our inner child in this demanding world. Unique and isn't afraid to approach sexuality so openly.At the start, the character of Bella has the mind of a child while having an adult body but is not restricted and not insecure about things. She can be loud, messy, playful, and expressive in emotions. Especially when it comes to sexuality, hence the openness to it. Like, there's nothing wrong with something that everyone does, but we don't talk about it. As we get older and more exposed to the world, we get quieter, speak less, get insecure about things, care too much about what others may say/think, and become closeted. That is one angle of the film that I found incredibly compelling.But the execution is wild. I do not buy for one second that it's strange for the sake of it. It leans more into steampunk absurdism. Yorgos Lanthimos presents the events as they are without questioning them, as the surface level normality peeled back, and focuses on the strange happenings in life and people. He's one of the most unique voices in cinema, not only for what he has to say but what he must show and how to show it.The only issue I had with the film was towards the end when it started to get a bit preachy, going as far as hitting you on the head with it, and I was thinking, \"Alright, I get it.\"Other than that, the film was excellent and one of the most unique and memorable experiences I had this year. Even if this is Yorgos Lanthimos's most accessible film so far, it may still be too much for some, but even with its peculiar nature, you will find it impossible to take your eyes off the screen.",
    "16": "A woman is reborn by a crazy scientist after she committed suicide. But she has the brain of a baby and has to learn the mysteries of the world and how to develop into an adult again. With comic results. Anything goes for her at the horror of all the other adults.Sex has no bounds even in public. Hitting people. Dancing unconventionally. Eating crazily. Saying rude things to people.She is innocent to everything like a baby. There is no right and wrong for her at first. When she develops she understands more the horrors of the world and has her own morality, learning through her own experience.By letting her self roam free and experience everything possible in the world she manages to find herself. Rejecting what she wants and keeping what she likes. Other people remain trapped in the world imposed on them by society which creates animosity. For what is right for one person is wrong for another.By the end the other adult characters seem more flawed than her and she seems more wise. Which is the joke. Let yourself roam free and you will be free of the chains imposed on you by fellow man. And you will become a better person.",
    "17": "Being weird can be interesting, but if being weird is THE ONLY feature a movie has to give to it's viewers then I can not get interested, let alone be mesmirised or captivated about it.Hurrah for the arthouse movie fans, of whom a niche group will love it to pieces, but for the casual viewer or Emma Stone fan, I would definitely not dare recommend it. It's artsy fartsy silly, sorry!Not any good? This movie really looks the part! The photography is out of whack, but in a beautiful, dreamlike way. The intrusive soundscore falls in the same category. And so do the acting performances, who more resemble dream like sequences than anything understandable. It's masterfully created, beautiful to watch. Respect. (BUT... artsy fartsy silly)More good: Emma Stone definitely delivers with her quirky performance. We get to see Emma Stone transform from a cute looking zombie into a more humanlike being, who discovers what's it like to have sex for the first time, like other human beings for instance. More trivial human \"experiences\" like Emma Stone discovering what \"eating\" is like are quite amusing to watch as well. (BUT.... still artsy fartsy SILLY)Ultimately this movie disappointed me, because however weird a story or it's characters are, somewhere in a story there needs to be something or someone I can relate too or sympathize with. And there is NONE...Because of the absurdity of the enitre story AND it's characters, this movie left me cold, but as I said before, some folks will love it to pieces, and many more though will be only raising their eyebrows and be quite bored with it...",
    "18": "As a big fan of Yorgos I was really hyped for this one, and let me tell you, it's not for everyone.The first two thirds of the movie are setup, and only the last one is the payoff, which is more in line with Yorgos' style.If you're accustomed to artsy films, you're gonna like the whole style of the production design, but otherwise it might seem kind of weird - the wide angle lens, the overexaggerated landscapes, the old timey, quirky dialogue lines and mannerisms.Also a good aspect is the fact that Emma Stone here, has maybe for the second time, left her own snarky personality aside, and completely immersed herself in the character - the director's job, well done.Otherwise the film is a recreation of the stages of development of the emancipated woman's psyche, and it's quite interesting in that metaphorical realm.The acting is good all the way, with highlights from Mark Ruffalo and the guy that plays the baddie, William Daffoe is amazing In everything he's in, but that's expected, and he's not the focus in this film either way.If I have to state my subjective opinion - whether you're able to withhold the want for instant gratification is gonna play a major role for whether you're gonna like this film, if you can hold for at least half the movie, at least you're gonna get involved with the characters and it might keep your interest, but if you're one which stays committed to watch something till the end, you're definitely not gonna regret it.If you're expecting something groundbreaking, like Yorgos' first three films, this is not the one.If you plan on watching this stoned, go ahead, it'll be magnificent.I gave it a score of 9, but if you're not inclined to give higher score to a film because of it's production value and technicality, you should take my score more like 7-8.",
    "19": "Confused (for the first half hour or so), moved, charmed - that's how I can describe my emotions while watching 'Poor Things' by Yorgos Lanthimos. He's definitely a \"twisted mind,\" overindulging in the fisheye effect, but that doesn't detract from the film's brilliance.In short, Willem Dafoe is someone like Dr. Frankenstein, who even physically resembles the doctor's creation from the classic films. Here, he has created... Emma Stone - a beautiful woman with a baby's brain transplanted into her, and she's just starting to explore the world. The first part is quite dark, black and white, repellent, often resorting to the mentioned fisheye. Everything changes when the heroine awakens her sexual sensuality and begins to experience reality through it. Suddenly, the film becomes richly colorful and even funny. Throughout, it maintains its intelligent humor, shining in every scene, with the main focus being the questioning the postulates of the world surrounding the characters (something like the end of the 19th or early 20th century, but with many elements of steampunk) through the unburdened consciousness of a child in a woman's body.I generally have reservations about Lanthimos's aesthetics, often crossing certain boundaries. And it's present here, but in moderate doses, mainly in the beginning. But the fact that I was charmed by the film despite my reservations should speak even more. I believe it should win not only the Golden Lion from the Venice Film Festival but also any Golden Globes, Oscars, or whatever else is up to be grabbed this season. And Emma Stone, too. Definitely a 10/10 rating, which I don't give that often.",
    "20": "I've recently watched many 'monster' movies ('Godzilla Minus One', 'Monster' by Hirokazu Koreeda, and 'Poor things'), and Emma Stone's unrestrained and explosive performance in 'Poor Things' presents a different possibility of Frankenstein's monster. Set in a finely crafted landscape and time, it subtly deconstructs the 'polite society' through adventures, experiments, and embodied exploration in societal slices, making it a feminist cult film. It's one of the best movies I've seen recently.Many people might compare it to 'Barbie', which, beneath its commercial veneer, offers shallow, didactic content and a direct satire of the present. However, 'Poor Things' delves deeper into dark fantasy and absurdity. In the end, it doesn't dissect and reconstruct patriarchy and privileged society, representing a return to reality in another sense.The movie also reminded me of 'Killers of the Flower Moon' and 'Babylon.' The former because I rewatched it yesterday and I, despite noticing more details from Scorsese's masterpiece, still maintain my initial view that it overly stereotypes women from a 'straight white male perspective,' fitting too realistically into the era. 'Poor Things,' however, perfectly balances this offset from 'Killers.' As for 'Babylon,' which I watched at the end of last year in the similar time, it's filled with bizarre physical and visual spectacles, but compared to 'Poor Things,' it's too full, too noisy, and tries too hard.",
    "21": "Poor Things is a visually stunning and intellectually stimulating film, offering a unique blend of dark humor, social commentary, and gothic romance. Director Yorgos Lanthimos, known for his bizarre and unsettling films like The Lobster and The Killing of a Sacred Deer, delivers another distinctive and thought-provoking work.Emma Stone shines as Bella Baxter, portraying her transformation from a naive child to a defiant woman with captivating charm and depth. The supporting cast is equally impressive, with Mark Ruffalo delivering a memorable performance as the eccentric scientist and Olivia Colman adding her usual comedic flair.The film's visuals are captivating, featuring meticulously crafted sets and costumes that evoke the Victorian era with a touch of the surreal. The use of color, lighting, and cinematography is masterful, creating a visually stunning and immersive world for the characters to inhabit.Lanthimos' signature dark humor is present throughout the film, often used to satirize societal norms and challenge traditional gender roles. While some may find the humor unsettling or uncomfortable, it effectively complements the film's themes and adds a layer of complexity to the narrative.The film's central themes of identity, societal expectations, and female empowerment are explored through Bella's journey of self-discovery. As she encounters prejudice and discrimination, she learns to challenge the status quo and forge her own path. While the message may be delivered with a heavy dose of Lanthimos' signature absurdity, it resonates deeply and leaves a lasting impression.However, the film is not without its flaws. The narrative can feel uneven at times, with some scenes dragging on and others feeling rushed. Additionally, the film's ending may leave some viewers feeling unsatisfied or confused.Overall, Poor Things is a compelling and challenging film that pushes the boundaries of traditional filmmaking. It is not a film for everyone, as its dark humor and bizarre elements may be off-putting to some viewers. However, for those who appreciate Lanthimos' unique style and are willing to engage with its complex themes, Poor Things is a rewarding experience offering a stimulating and unforgettable cinematic journey.",
    "22": "Greetings again from the darkness. Greek filmmaker Yorgos Lanthimos is possibly the most divisive director working today. Movie goers tend to either love his films like THE FAVOURITE (2018), THE KILLING OF A SACRED DEER (2017), THE LOBSTER (2015), and DOGTOOTH (2009) or walk away baffled that any decent human being could enjoy such dark works of strangeness and oddity. Despite this, two of his films have received Oscar nominations, and this latest may be both his most accessible and most outrageous project yet. It's also a rare outing where Lanthimos left the writing to others. His co-writer on THE FAVOURITE, Tony McNamara (\"The Great\") has adapted the screenplay from the 1992 novel by renowned Scottish writer Alasdair Gray, whose tome was influenced by Mary Shelley's \"Frankenstein\".Oscar winner Emma Stone delivers a truly remarkable (and physically demanding) performance as Bella Baxter. When we first meet Bella, she has the mind and coordination of a toddler in an adult woman's body ... the product of Dr. Godwin Baxter (you can call me God), played by Willem Dafoe. God is a surgeon-slash-mad scientist, his own scarred body the result of experiments conducted by his father. God is both doctor and monster. Although various animal blends (ducks, chickens, dogs, etc) roam the premises, it is Bella who is clearly God's most treasured production. Her reanimation process and backstory are spelled out in the movie.Bella develops daily, and when Godwin's lawyer, Duncan Wedderbum (Mark Ruffalo) shows up to take care of some business, he is intrigued by Bella and offers to take her on an adventure ... one that ultimately spans Lisbon to Paris, and a luxury cruise ship to a brothel. Duncan and Bella engage in \"furious jumping\" (her phrase for sex) and soon her libido is quite advanced, and her river of independence flows freely, turning Duncan into a whiny buffoon. This story, Bella's story, is really about a woman finding her own way in a world where men try to control/manager her. It's fascinating to see her hyper curiosity about the world and her surroundings. On top of that, Bella is often quite direct and unfiltered in her statements.The humor here is frequent and unconventional as evidenced by Bella being described as \"a beautiful retard\", and the stream of deadpan one-liners. Still, the message comes across loudly and clearly as we marvel at Bella and Emma Stone's performance. I hesitate to use the word fearless (unless it's Tom Cruise) since it's just acting, but the word applies to Ms. Stone here. Supporting work comes from Christopher Abbott, Margaret Qualley, Ramy Yussef, Jarrod Carmichael, Hannah Schygulla, and Kathryn Hunter, while Mark Ruffalo revels in flashing his comedic chops.Cinematographer Robbie Ryan interjects black and white for effect and makes good use of the fish-eye lens. Production Designers James Price and Shona Heath get creative with set pieces, especially the cruise ship and brothel, and Costume Designer Holly Waddington nearly steals the spotlight with Bella's outfits, which are always a bit exaggerated. The music adds a specific element and works quite well, and there is a truly awesome dance scene. Yorgos Lanthimos again earns the title Master of Strangeness with this outlandish film with bits from Frankenstein, Bride of Frankenstein, and Young Frankenstein (a common thread). The film is somehow both extremely funny and severely disturbing, and is an example of good people trying to come to grips with the realization that people often do bad things. My only complaint is the film features what are possibly the worst closing credits ever.Opening in theaters on December 8, 2023.",
    "23": "Nothing like a movie that does what cinema is supposed to do, give you a story as visual as it is audible. It was fun just looking at the style of this film.The story in itself was quite amazing. What seems like a strange take on Frankenstein with Willima Defoe perfectly playing the role of the doctor.Emma Stone was fantastic in this lead role; she seemed to go all in and all out to make this character breathe.Last but not least Mark Rufflo just showcases what a great actor he is.It's not a coincidence this film came out in December. It is going for that gold, and I would not be surprised if it won everything it went up for.Deserves it.",
    "24": "Visually stunning, 'Poor Things' mirrors Tim Burton and Dr. Seuss with its landscapes, sceneries, themes, and eccentric characters.Bella learns and explores a new world, defying her comfort zone along the way. Her uncivilized behavior discussing others sexual habits, threatening to punch babies, and encouraging any child like behavior from others was amusing and also beautiful to watch as people gravitated towards her openness and honesty.Before anything 'Poor Things' is outrageously funny and doesn't overshadow its poignant message of female empowerment and personal freedoms. It's a perfect balance between humor and meaningful themes.With its masterful storytelling, it's an easy front runner for the year's best. All around great performances from the cast with Emma Stone being the obvious standout performance.",
    "25": "When the circumstances of our lives don't suit us, it's time to reinvent ourselves - something that happens both literally and metaphorically in this latest offering from director Yorgos Lanthimos. But the way that result comes about here represents a truly inspired fusion of genres, including comedy, romance, social commentary and sci-fi, making for one of the most inventive, unusual and hilarious releases of recent years. This offbeat feminist fable tells the story of how a pregnant, young, anonymous suicide victim (Emma Stone) is reanimated with the aid of a brain transplant from her unborn fetus, an achievement accomplished by a colorful, controversial but well-meaning surgeon/scientist a la Dr. Frankenstein (Willem Dafoe). He nurtures his subject back to life, health and sentience, a sometimes-challenging process that finally surfaces when she discovers sexuality, the trigger for exploring a new, independent life for herself, both physically and emotionally. Through a series of adventures over the course of a trip through Europe with a free-wheeling, lusty but lecherous, self-serving lawyer (Mark Ruffalo), she finds herself as a self-actualized woman in an age where that's more of a rarity than a standard, particularly in a world where men treat women more like property than people. While the film's pacing could use some shoring up in the middle, this offering nevertheless entertains with uproarious laughs throughout, even when the narrative turns more thoughtful and substantive. The superb performances by Stone, Dafoe and Ruffalo are top shelf, contributing to the picture's whopping 13 Critics Choice Award and 7 Golden Globe Award nominations. The film is also visually stunning in its cinematography and editing, as well as in its spectacular and whimsical production design, filled with images reminiscent of the movies of Wes Anderson and Terry Gilliam while sustaining a look all its own. Admittedly, this release features a good deal of explicit sexuality, both visually and in the dialogue, so sensitive viewers should take note. However, as one of the most anticipated pictures of this year's awards season, \"Poor Things\" never disappoints, serving up a solid offering that consistently tickles the funny bone while giving audiences much to think about - and there's nothing poor in any of that.",
    "26": "I was fortunate to see this film before its premiere. This movie offers an interesting way to tell the story of growing up and discovering how the world works and leaves its mark. The strong cast also contributes to a more descriptive portrayal of the types of people who can appear in your life's journey. The dramatic experience can captivate you from start to finish.After the movie ends, you'll find yourself pondering how the story would have unfolded if the characters' appearances were in a different order. Nevertheless, the movie may seem a bit strange in the first half-hour as you try to explore what it's all about. The beginning of this film appears somewhat similar to \"Flowers for Algernon,\" albeit in a more vulgar way, but it still evokes strong similarities.I also admired Emma Stone's costumes. The humor in the movie is quite debatable; there are genuinely funny jokes and moments, but if you delve deeper, it can take on a darker tone. Nonetheless, it's very enjoyable, and you might find it satisfying.In conclusion, for my very first review, I can confidently say that it's truly worth seeing. It will provoke a range of controversial thoughts and feelings due to its polarizing scenes. I rated it a 9 only because I'm not a big fan of explicit scenes on the big screen, and you should also be prepared for a significant number of erotic moments in the film.",
    "27": "Anyone who is familiar with Yorgos Lanthimos's style of filmmaking knows better than to expect something low-key or non-descript from him. Win, lose or draw, he always goes out with the weirdest bang a director can come up with. This might be his most extreme film to date, but still not for all tastes. For those who love his work, be prepared to be giddy.A young woman whose brain has been replaced by that of her child finds herself in the stately house of a renowned brain surgeon whom she regards as a father figure. But as her mind rapidly develops and catches up with her age, she starts to realize what she's been missing. She chances to meet a reprobate older man who handles the doctor's legal affairs. But as she grows, her bond with the doctor never truly dies even if he initially kept her cloistered. Lanthimos evidently views the scientific community as giving women a route to overcoming entrenched patriarchy.Emma Stone gives another electric performance as the female version of Frankenstein's monster whose burgeoning development overcomes the shackles she lives with under her caring but ancient father figure. Mark Ruffalo and Willem Dafeo are also a joy to watch. Although the film's length becomes noticeable at one or two points, it's still a superb job by Lanthimos. Highly recommended to anyone who enjoys audacious and layered storytelling.",
    "28": "I was lucky enough to see this incredible film at this year's LFF (to which the audience reacted with almost constant laughter). Straight away, you're sucked into its strange, steampunk Victorian world thanks to incredible directing/production design/cinematography/performances/score.Even with its many quirks, the film remains grounded by a somewhat conventional story (as far as Lanthimos is concerned) which gives it the unique feel of both an old epic and something very new.The incredible acting and dialogue are what make you buy into this crazy world - with career best performances by Emma Stone AND Mark Ruffalo (and Willem Dafoe - which goes without saying).Can't wait to see this one again, if you love good storytelling (and aren't put off by quirky dialogue and stylised shots), you will love this!",
    "29": "\"Poor Things\" (2023) is a cinematic masterpiece that effortlessly weaves together the intricate threads of adversity and redemption. Directed by the visionary filmmaker, Yorgos Lanthimos, the film delivers an emotionally charged narrative that leaves a lasting impact.Set in a world where misfortune seems to be the only constant, \"Poor Things\" explores the lives of its characters who, in their moments of vulnerability, find strength, courage, and an unbreakable spirit. The story unfolds in such a way that it tugs at your heartstrings, immersing you into a world where the line between despair and hope is razor-thin.The cast delivers outstanding performances that bring their characters to life with raw authenticity. Each actor embodies the struggles and triumphs of their roles, making it easy for the audience to connect and empathize with their experiences.The film's visual and auditory elements are nothing short of remarkable. The cinematography captures both the bleakness and beauty of the world these characters inhabit, while the evocative score complements the emotional depth of the story, enhancing the overall viewing experience.What sets \"Poor Things\" apart is its ability to strike a chord with audiences from all walks of life. It serves as a poignant reminder that no matter how bleak our circumstances may seem, there is always room for hope, resilience, and transformation.In a time when the world often seems plagued by challenges, \"Poor Things\" serves as a beacon of inspiration, reminding us that even the most downtrodden can rise above their circumstances. This film is not just a masterpiece of cinema; it's a testament to the strength of the human spirit. \"Poor Things\" is a must-see, a heartwarming and thought-provoking journey that will leave you both moved and inspired.",
    "30": "Yorgos Lanthimos once again presents us with an excerpt from a distorted fantasy world, which, however, has more parallels with ours than one would initially expect. The story is focused on Bella, who was brought back to life after death by a peculiar scientist, after which she learns about the world with the brain of a child and gradually develops in all directions, even those that could be described as taboo. Emma Stone gives a masterful acting performance and her character adds more and more layers as the minutes of the film go by until the triumphant finale.Transforming from Bella the toddler into a socially conscious woman, she surpasses all her previous roles. Whether it's her walk, thoughts, facial expressions, or body games, she leaves us in no doubt as to what mental stage she's currently in, and with Mark Ruffalo seconding her, there's no shortage of bizarre moments.Intelligent dialogues, thoughtful concept, topical theme, visually intoxicating images, captivating performances, devilishly morbid ideas, lots of nudity, art film, Oscar nominations are inevitable.",
    "31": "I went into this film relatively blind other than having seen the trailer. Right from the trailer you know you're in for a chaotic yet stunningly beautiful journey.The acting performances were top-notch. Emma Stone blew it out of the park and convincingly portrayed a very unique and quirky character. William Dafoe is not a stranger to weird characters, and his performances are equally natural and convincing. Mark Ruffalo was absolutely hysterical here.The set designs are amazing. It's magical, it's delightful, and it flawlessly accentuates the perception of our main character. When she visits a new place, there is beauty and novelty in everything she sees, and we, the audience, gets to experience that with her. The soundtrack equally accentuates the film as a whole with its bizarre notes and wondrous themes.There is also quite a bit of dark humor that, again, like the set designs, the quirky characters, and the odd music notes, help shape the beautiful world these Poor Things live in.I enjoyed the character progression of the main character. We get to observe innocence, curiosity, hedonism, and a natural progression toward meaningful purpose. It is important to note there are quite a lot of scenes involving pleasure, but it is driving home a point about sexuality that you might agree or disagree with.The plot progression definitely relied on a handful of convenient events, but I don't find them to be critical flaws for the film. I believe the message inherent in our main character's journey is a thoughtful one. There is a celebration to curiosity, to experiencing new things, and to constantly challenge your own views. I think it is very easy to lose that curiosity as an adult but it is an important lifelong quality to maintain.With such an absurd yet fantastical premise, the film adapted its source material extremely well and is sure to be one of the most memorable films of the decade."
}