{
    "0": "All these critics and people on here are bagging this film. I get it, you want action, twists, a plot that goes along quickly and more, more, more. Well don't watch this movie then. Simple really.If you approach a film with the right mindset (like this one) and don't expect to be blown away you can actually enjoy its nuance, acting and glimpse into sea fishing. I enjoyed it for those reasons. It's definitely a meandering film with some scenes not driving anywhere - they're there instead to develop characters.This film is a character family drama with a small crime element. It's mis marketed in my opinion. Just watch it causally and enjoy the acting. And for the bad scenes that don't really work, just appreciate it for what it is. Good acting. 6.4/10.",
    "1": "This was a good movie. Fall River/New Bedford aren't the normal NE fishing towns. This flick dives in and shows us how people get sucked into \"the suck\" and love every moment of it. It was a good not particularly great movie. I would recommend it to anyone who doesn't take themselves too seriously. Jenna did a nice job of encapsulating the areas culture. She was a good choice for a fisherman's gal and daughter of a broken house.All in all it's worth a watch and a 7 rating. I'd wait till it's on Netflix or Prime though. I think 5.8 which it is currently at is a bit too low. What do you think?",
    "2": "This gritty thriller has a Dennis Lehane feel for the blue collar working classes on the North East Atlantic side of the US, in this case a group of fisherman tied up with a drug plot to get money.It's a film of two halves and goes in a direction I didn't anticipate: at first I thought it a family disaster movie et al A Perfect Storm then goes into another territory of drug running.It's all very watchable and the cast are well picked, they all look weatherbeaten and belong at sea.The scripting is a little lazy: surely a small community would react to grizzled old Tommy Lee Jones shooting and killing three drug dealers in a donut store and report it to his ex wife and her new husband before their son shows up and if so surely they would mention it. It's HUGE news in a quiet fishing community!And no mention of Jenna Ortegas beaten up face at the family dinner?If I were the mother I would put two and two together...\nAlso the father wanting in on the fishing business as a partner, seemed too neat and tidy at the end ;especially when he was so against it in the beginning and Charlie being so involved.",
    "3": "This movie is a boyz movie. It's about brotherhood, friendship, role models. The first half of the movie is about the process of belonging. Any guy who ever wanted, craved, hoped to belong to a gang of guys-who they deem tougher, wiser, stronger-will identify. Don't wait for explosions, don't wait for cheap thrills. Enjoy the process. Get dirty with the fishermen. That's what the movie captures very well. The second half is about nerves. That's when it becomes a thriller in more known territory. It's not a bad thriller, and you actually care for all characters. There are good actors, excellent cinematography and camera work. I liked the movie. Reviews and critics aren't doing justice to it.",
    "4": "1) When the boat explodes, the captain's Mayday reports his position as 69 degrees west. When the coast guard helicopter locates the life raft, USCG report its location as 42 degrees east, 65 degrees west. Are you kidding me? They give two incorrect longitudinal positions and no latitude? Longitude at 40 miles SE of New Bedford is about 70 degrees west. The life raft would've had to drift about 300 miles, almost an impossibility, to reach 65 degrees.2) While being rescued, they act like drunks at a frat party.3) Once aboard the helicopter, they continue laughing hysterically for no reason.4) After losing their boat and nearly their lives, the brothers seem unconcerned about the boat and the huge financial difficulties that await them. Instead, they head directly to a bar for drinks the same morning as the rescue. Never mind that their mother might be worried. One brother finally calls the mother after he is served a boilermaker.This all occurs in the first nine minutes of the film. Tommy Lee's character hadn't even been introduced yet. I couldn't watch another moment of this trash.",
    "5": "This movie was fantastic. It was like movies used to be: not trying to push a political agenda or social justice agenda. Just a good story, good acting and lots of feeling. All the actors were outstanding, but Ben Foster was award worthy. It's not surprising that Taylor Sheridan was a producer on this movie since everything he does is great. There are a few negative reviews on here, but I don't know what they watched. It was the best movie I have seen in the last few months. There seem to be some people that think the depiction of mass residents and the accents are off base.... I have news for them.... I know guys like this.... I've worked blue collar jobs with these types of guys. The depiction is spot on.",
    "6": "In sub-standard macho-drama \"Finestkind\" Toby Wallace joins older half-brother Ben Foster's self-satisfied ruffty-tuffty crew of US East Coast fishermen (including Ismael Cruz Cordova (decent)) whose troubles at sea spiral exponentially when they try smuggling heroin for the mob (led by Clayne Crawford). Experienced writer / director Brian Helgeland messed up badly with this superficial, short-cutting, clichéd guff that doesn't seem to know what kinda film it wants to be - especially considering the talented cast he had for it, that also included Jenna Ortega (rising superstar - with good reason), Tommy Lee Jones & Lolita Davidovitch. Major disappointment. A turd. Flush it.",
    "7": "Unbelievably slow. And grossly misleading. It's 2 hours of my life I want back. Surprising because it's a great cast and an interesting concept but I've literally seen grass grow more interestingly. I cannot recommend under any circumstances.The entire first half of the money is stupid and not related to the plot description. And then, when there finally is some activity, the movie goes in a completely different direction and ends in a shockingly stupid way. It's literally painful.And again, every supporting actor/actress is TERRIBLE. I can't say enough bad about this movie.And how did they get Tommy Lee Jones in this dog? I assume he lost a bet or something.",
    "8": "I was 50-50 on whether to even watch this. I think Ben Foster is terrific and he picks really good movies. That was what tipped the scales.After about 20 minutes into the movie, I was unimpressed. Didn't care for the plot. Didn't care for the characters. Just wasn't into it.Then, I don't know. Something changed. It got more interesting. The relationship between characters felt authentic and I became enamored. Suddenly Tommy Lee Jones appeared and I didn't even know he was in it. I kept watching. By the time the end rolled around, I was smiling.I give it a 7. It's not a movie I'd recommend immediately to someone asking me for something interesting. But I'd say it's worth a watch and I don't regret it.",
    "9": "This is a very good picture, one that has quickly become one of my favorite this year. It is not an action movie, far from it, and not a crime story either. It is all about human emotions, and how we deal with them. Don't make me wrong: it is quite slow in development (of the story), but grows and grows, and gradually grows on you. By the time it ends, you feel emotionally lifted. All the attributes of a good movie are there: the production value is first class, the acting is impeccable as so is the direction, with the editing and the score not far behind. If you liked 'Fathers and Daughters' (2015), this project is definitely for you.",
    "10": "Unfortunately I was really disappointed that I left 15 mins before the ending which I never do,,,, not really sure what was wrong it wasn't gripping, the story line is so predictable. The main characters were superficial, there was no depth in personality at all, you really can't connect with any depth of any of the main characters,,,, except Lee Johns, it was such a disappointment for me, when I went it I didn't expect that esp with the \"awesome\" prior reviews.Initial scenes esp lacks depth, conversations were shallow and lack originality,,, I had to force myself to stay expecting better esp reading from prion reviews but I have up even just 15 mins before the ending.",
    "11": "This was not an enjoyable watch by any stretch of the imagination. The whole time I was just wondering where this thing was going. It almost felt like watching a pilot episode of a TV show where all the foundations of the various subplots to unfold later on are first getting built out. I think the film just needed to do more to really engage me. The only scene of the movie that had me watching was the scene where the lady was giving birth while the drug dealers were intruding. But that's a cheap, Chicago Fire-esque method of demanding attention that I really don't care for. The lady giving birth while the scene was going down added absolutely nothing to the story.The great cast is what initially got me to watch this in the first place. Tommy Lee Jones and Jenna Ortega? How does that not sound appealing? Despite that though, I found pretty much all the characters generally unlikable and the acting to be questionable. And I really didn't feel like Ortega was a good fit for the tough, drug dealing girlfriend-role. I just can't take her seriously in a role like that.So really I fail to find the point as to why this movie was made. It has mediocre acting and a plot that jumps all over the place with not much cohesion.",
    "12": "The film fell short of delivering the suspense and thrills I had anticipated from a crime/thriller genre. The first half, centered around fishing boat expeditions, impressed with its visuals and sound design, yet it left me craving a deeper narrative. The second half veered into familiar drug and crime territory, lacking a substantial storyline. However, the movie managed to wrap up on a somewhat positive note, leaving me with a feel-good sentiment despite its shortcomings.It's worth noting that I had the privilege of viewing this film at TIFF, where ticket prices were notably higher than usual. TIFF premium screenings typically include appearances by the cast, and my wife had eagerly anticipated seeing more members of the cast e.g. Jenna Ortega live. Unfortunately, her absence was a disappointment to her. Additionally, prior to the screening, Google erroneously listed Jake Gyllenhaal and Zendaya in the cast, further elevating my expectations. While these factors may not directly impact my rating (which I tried to base primarily on my watching experience), they undoubtedly contributed to my elevated hopes, particularly given Gyllenhaal's impressive track record in exceptional crime/thriller films like \"Nightcrawler.\"",
    "13": "Some scenes are extremely embarrassing like poor soft porn. Terrible acting. It pains me to say it but they used jenna as an object that is only there for perverts who want to see half of you## (they wasted a new talent by doing this). There are other scenes that I didn't like but I don't want to give spoilers so I'll stop here, but I say that if you love these actors, see other works. Still taking Jenna as an example, it's true that she has been \"sexualized\" in other films too, there must always be a bit of these dirty scenes, but here I repeat myself that she was chosen just for this reason! And the same reason also for another film of hers that is about to be released. I saw the trailer and I hope it isn't like this film, and that she is evaluated in a better way and not as someone to be undressed in front of a video camera.",
    "14": "This is a terribly weak movie. Jenna Ortega plays the role of an ornament in this film. Her role in this film is completely nonsensical. She is sexualized and objectified. Jenna Ortega is like a Christmas tree in this film, she just looks nice and nothing more. The script is chaotic and just stupid, neither Jenna Ortega nor Tomy Lee Jones help this film. I haven't seen something so weak in a long time. B-class cinema is sometimes better.This film is a mishmash of nonsensical threads. There are no nice shots, good music, or a sensible script here. Two hours of complete boredom. I struggled to get to the end of this thing without fast-forwarding.",
    "15": "I was expecting a movie about the rigors of life at sea. Instead it's a mishmash of bungling and inept criminals with some family drama thrown in. They lose their boat in a storm so they use the father's boat and lose it by illegally fishing in Canadian waters. Of course they get caught and lose the father's boat. In a misguided attempt to get the father's boat out of impound, they smuggle heroin for the local mob boss. Of course, they lose that too. The acting is mediocre to dreadful. It's just not worth the time. Tommy Lee Jones is the only light in the darkness. He adds a reality to his character; beaten by life, disappointed in his son, and is dying from cancer. But in the end he's the one that saves everyone.",
    "16": "As a hard working chef for the past three decades, this film tells a story of how life for many in the passion of an art really is, weather it's fishing, cooking or farming. The way this story brought the audience into the life of two brothers one young brother wanting to hangout with his older brother and life just happens, some of these reviews by probably white collar picky folks that have no clue on how to have a passion like fishing, farming or cooking getting their hands dirty and loving it. I appreciate the crew that made this story, the acting was on point, and to some folks the story hits home. Great plot, great film and it was worth the time to watch. To the negative reviews sorry you felt that way about this great film, that unfortunately many people can relate or have been in a similar situation. God Bless you all. Aloha.",
    "17": "This movie wasn't perfect. There were definitely some holes in the plot and a few things I would've liked to see go in a different direction. But you know what? I'm not a director or a producer and it's not really up to me. I take in what's in front of me and if I enjoy the characters and the outcome then be damned with the little arguments over points of the movie that aren't just absolutely perfect. To be fair, Charlie's sudden head over heels relationship with Mable was a little rushed and how the boys got out of any connection to a triple murder donut store shooting is beyond me, but it's a movie. And suspending belief in every logical point is sometimes necessary when trying to watch a 2 hr movie covering a complex week in the lives of the characters. Worth a watch.",
    "18": "Always looking for a good Sunday movie. Found this on a Saturday, grandkid day, so the house is hectic and movies are hard to watch. So, we tried again on Sunday. Movie was pretty good. Being a huge Ben Foster and Tommy Lee Jones fan didn't hurt. There were a few sub-plots about brothers, love, fisherman, drug dealing, death, life, father-son, brother-brother, and evil Canada, but the movie still managed to be entertaining. Probably would have been better as a mini-series with so much going on, since sone things just seemed to \"happen\" and weren't well explained. All said I'd still recommend it.",
    "19": "Just watched it and I thouggt it was great. Good plot, good characters and yes, Tommy Lee Jones has still got it! And even more, it ends well. I truly don't understand the negative reviews. Has a great plot. Younger college educated brother wants to spend time with his rough older fisherman brother. Their trip out ends with the boat sinking and they are thrown a (what appears to be at first) lifeline by older brothers Dad. Well.... he gets caught fishing where he shouldn't because he wanted to show off the haul to the Dad. Boat gets seized and what was a bad idea gets worse when they make a deal to pick up smuggled drug load. Great characters in show and you truly feel for them. There are some fun parts, thanks to the little bro and some sad emotional parts, thanks to Foster and Jones. Highly recommend watching.",
    "20": "Great film. Fantastic acting, great filming, good plot...frankly, a really nice movie in the middle of a lot of garbage right now. The tremendously strong nuance of father/son relationship between all the sons and fathers was enjoyable and refreshing to see on screen. Tommy Lee and Ben Foster, what great pairing. All the actors did a really good job there's no doubt. And the details surrounding the work on the boat and the fishing industry was done well and I found that interesting all by itself, but that was woven well into the overall plot. The piece around the heroine thieves was a bit rushed but that's the only part that was a little clunky.",
    "21": "As someone who lives in New Bedford this movie missed almost every mark. Right from the start they embellish the Massachusetts \"accent\" like these movies always do. So bad at one point that one character tries to say Durfee street and pronounces it Duffy street. I understand it's tough to drop the R in the correct spot but the R would be pronounced in \"Durfee.\"\nSeeing all the New Bedford landmarks was cool because everything was immediately recognizable. Seeing the scenes filmed in a bar that I've been in many times was satisfying, but the script was absolute trash. It starts going in one direction then with no resolution goes in a different direction.The acting and casting was actually very good but, at times, the acting seemed campy because so many of the lines were terrible and undeliverable.I would imagine if I didn't live in New Bedford I wouldn't enjoy this movie at all.",
    "22": "Disregard any and all reviews that are searching for a new movie to grasp for their absolute dull expectations and minds, because where life begins to happen, just like with Charlie explanation to his Dad, you see the shine in an individuals calling. I could guess that 95% of the population has absolutely no IDEA what kind of mind it takes to go out to see for multiple days, risking their lives for the dollar, to ensure their families back home get to eat, have a place to call home, and thrive in their life.Most would say it takes too long to get into the action parts or the answers of the story, but in reality, things take time, PATIENCE most would say, therefore I believe this film delivered precisely on time, everything it needed to grasp me. Taking time to learn the characters, the background of the story and piecing things together with the hardship of rough patches in life, truly show the lengths that parents would go for their children.When Tommy Lee's character Ray, expresses to Tom, that when you put your eyes on your kid for the first time, something within you just changes, and tells you that you'd do anything to protect and support your son or daughter, I deeply resonate with that. As a father of 3 myself, that's where my tears started flowing.The togetherness of the crew also is sensational! The trust and loyalty that gets tested always between friends and family, proving correct when one is able to hear another's plea, and take their advice over our own made up minds, giving us outside perspective, instead of running our minds among anger, and potentially acting out something we'll regret later.I give this film an absolute 100% 10/10, well done to the cast, directors and producers, thank you for giving me a reminder of why I'm so honored to be a Father, friend, brother, and hard working individual. God Bless.",
    "23": "Brilliant movie wasn't expecting anything great acting good to she Ben Foster back in his prime tommy lee Jones great as usual this movie was great from the start and just got better family is everything proper feel good movie. Great camera work and supporting acting movies like this should go to cinema instead of all the crap cgi movie with no story line actors don't get the reckonision there deserves these days ben foster should be more famous that he his and his brother in the movie done a great lead star and the girl who plays Wednesday is great but I no we will see a lot more of her to come.",
    "24": "Quote: \"There is life and death, but it is the in-between that counts\". Cute line. Doesn' really make sense though. Since life is the in-between. It should be: you are born, you die and it is the in-between that counts. There is point to that. The quote doesn't make sense, the movie doesn't either.The worst thing of this movie is that it doesn't service its good actors. This movie got Tommy Lee Jones who makes the most of his part. Ben Foster as plays Ben Foster but at that he is always great. Their father and son story was the only thing good buried in the crap around it. Jenna Ortega has just a presence that can't be denied. She tried hard to make her cliché character work.They are all three fine in this movie but absolutely nobody can fix this mess. This movie has no idea what it wants to be. It tries to be a heist movie, a character drama, a comedy and a thriller. Add to that that the structure is completly off. Instead of the usual 20 Minutes it will take one hour and five minutes until we get introduced to the problem, the conflict, to what this movie is actually about.Since it is two hours long the second act which should make two thirds of the movie is now crammed into the second hour.Because of these two problems you can see this movie getting worse with every minute. Making the last 30 minutes feel like a montage or make them feel like they were cut by three differend editors. Movies need a strong start and a strong ending but it also the in-between that counts.",
    "25": "Quite a slowburning, bleak and depressive story, that is certainly not suited for the casual viewer who might be (wrongfully) expecting some sort of fun action thriller, which it is definitely not and was never meant to be either...The good: Tommy Lee Jones steals the show with his stellar performance as the father of a son (Ben Foster) in dire money troubles. But as magnificent the performance of mister Tommy Lee Jones may be, actor Ben Foster just didnt cut it in the dramatic scenes, in which he (and all the other actors for that matter) failed to deliver true drama.True drama needs credible acting performances from ALL the actors concerned. Now we have only Tommy Lee Jones performance to deliver true drama, but his role (however important) was of a supporting nature, which makes us viewers have to deal with other leading actors who fail to impress.",
    "26": "So, I just watched Finestkind and oh boy, do I have thoughts. Ive never seen a movie try to do so much with so little that wasn't also a CG fest. There are potentially two good movies in here, but tye mashing up of the family melo drama and the crime hiest thriller comes off as comical, insincere, and muddled. I was following the making of this for some time since I heard Jenna Ortega and Tommy Lee Jones were attached, little that I know this was 25 years in the making, cost the film crew thousands in lost equipment and injuries, and had several names attached to it. I do like the cinematography, the Whale footage was nice, but like, this isnt a documentary, it was supposed to be an engaging film about what happnes in the in-between when were born and when we die. This was directed by the guy who wrote Man on Fire (Which probably explains why Jenna was attached) and directed Mystic River! This had all the makings of a hit... what happend!? Ugh. Ill still buy the DVD for my collection, but I'm not watching this again.Ps. The romantic subplot in this would give a Disney princess whiplash with how fast it happened.",
    "27": "Rating: 2.3\nOverall, a complete misfiring on all cylinders as everything in this movie is so bad that is borderline camp on New England culture, making it a must watch to see how something this terrible got made into a movie.Terrible Direction (Has no control over any part of this movie; the movie is terrible on a macro-scale it feels very formulaic and any other movie from New England (but clashed with a forced drug trafficking storyline); the movie is Terrible on a micro-scale because there is absolutely no chemistry in the entire cast (really does not help his actors in any way) and the scenes just feel forced and choppy; the storytelling is terrible because everything just feels choppy and forced (with nothing feeling like it is happening for a reason)), Terrible to Very Bad Acting (Very Bad from Ben Foster (He feels so over-the-top that it is comical and he has no chemistry with any of the other characters (and is just so shelved off)), Terrible from Toby Wallace (Just terrible all around as he is not convincing as the lead and just forces himself into every conversation and situation somewhat in a Deus Ex Machina way; so over-the-top that he is funny when he is meant to be serious and boring when he is meant to be funny; Has zero chemistry with Ben Foster and somehow negative chemistry with Jenna Ortega), Very Bad from Jenna Ortega (Incredibly forced and unnecessary as her interjections really have nothing to do with what is going on and she clearly hits a ceiling when it comes to the dramatic points; the deadpan moments when it comes to the comedic parts does not work with the rest of the cast; has negative chemistry with Toby Wallace because it just feels forced and rushed), Bad from Tommy Lee Jones (Plays himself giving no effort as his experience can only take him so far given how bad the script is (and it seems like he knows how bad the movie is and just wants to finish the job); at least elevates the scenes he is in (but by a marginal amount)), Terrible from the rest of the cast (Just inexperience all around and terrible/unconvincing acting from people in this area/profession; no chemistry in the entire cast whatsoever)), Terrible Story (The concept was somewhat personal to the director but the overall story was horribly constructed as there just feels like there is no vision for what he is going for (just does a terrible job at clashing two different ideas into one); the story construction was poor because the conflict is introduced at the 1-hour 15-minute mark of a 2-hour movie, prioritizing a poorly written exposition that leaves for very little rising action and a rushed climax(could have cut like 20-30 minutes of the exposition and would have gotten the same film); the flow between sequences is just so forced and on a grand scheme makes no sense (especially in the shift in plot for the conflict; the characters are just so shallowly written that you don't really care for them or what they are going through (and it doesn't help that they do not have any chemistry, especially the relationship between Wallace and Ortega's characters as its just so rushed and forced), Terrible Screenplay (The dialogue just is so unnatural and incredibly stupid that it is very campy (it is impossible to think that people talk this way and the amount they repeat the word 'Finestkind' is laughable); the jokes are just so bad and sad at how bad they hit (like when Jenna Ortega's character calls the main character 'White Boy' when no aspects of her race/identity are ever mentioned in the movie; there is practically no symbolism as every metaphor they introduce is forced to the point that the message makes no sense and not believable; there is no foreshadowing (the movie just so shallow that hooks left at the beginning of the movie just make the story so predictable), Decent Score, Very Bad Cinematography (So bad that it honestly felt nauseating at times; the handy-cam moments were just too shaky and the polished moments cut way too many times that it felt amateurish; over-used the of shot-reverse shot technique that it made me madder than focus on the characters in frame), Decent Sound (Just felt like that of a standard action movie), Very Bad Editing (The sequences are so so sharply edited that it felt like there is no sense of continuity they were going for (and it feels amateurish too)), Decent Visual Effects (Mostly practical effects), Plot Structure was terrible because the movie spends too much time on the exposition (and does a bad job at that too) to where the conflict is introduced so late in the movie that there is no room to develop a rising action (and the climax suffers because of it because it feels rushed and forced), Pacing is a mess because it is incredibly fast in going through plot points (but there is just so much meanless plot that that it somewhat feels slow at the same time), Climax is incredibly rushed and feels incredibly out of place (and it just feels like a child directed it), Tone feels like a generic Boston 'Dad' movie but making the movie a drug trafficking thriller just completely shifts the tone in a 180 fashion (and nothing prepares for this), Saw a premiere at Austin Film Fest.",
    "28": "I have been waiting for this movie for over a year now, which seemed to be stuck in post production indefinitely and finally released a few days ago.The truth is, I had pretty high expectations for the story especially from a writer/director of Helgeland's level.I don't know what he originally had in mind, but here he seems to have put two films in one. On the one hand it's a family drama and on the other it's a drug deal gone wrong that doesn't seem to make a good transition and on top of that an almost unnecessary love story.It has a somewhat OK third act, which has enough tension, but raises a lot of questions.On the good side now. The cinematography is excellent, the transitions between city scenes and sea scenes work very nicely. The cast is well chosen and for the most part the actors know where they need to be. And of course the two strongest cards of the film are Tommy Lee Jones and Ben Foster in the role of father and son.Although it's a nearly three-decade-old project it could have been executed way better, especially when the person working on it has such an impressive track record under his belt.An honest 6/10 mainly due to acting.",
    "29": "I don't know here to begin. First, it was so slow. The music was ripped from a Hallmark TV movie and so on the nose of how you should feel. It was just too distracting. Tommy Lee was useless in this. The acting for the most part was terrible, but especially from Jenny Ortega.And then the writing was just so bad. Like the \"dad\" coming into the bar in the beginning and caused a scene, which just would never happen.The movie didn't know what it wanted to be. It was all over the place with too many ideas and not enough focus. 45 minutes into it and nothing has really happened, except the superfluous rushed relationship between Mabel and Charlie.I just don't see why this was even made. What was the point of it? If you want to make a movie have something NEW to say., like a message, maybe just pure entertainment, but then it should be funny. This was nothing new. It reminded me of the Perfect Storm, kinda.Everyone seemed unlikable and uninteresting. Over an hour into it and I'm bored to death!!",
    "30": "This was premiered at the TIFF Friday 8 Sept 2023 with a huge crowd. The director shared that The Finestkind was conceived and written more than 20 years ago, but was one of his latest (not last) works.It's because big studios don't like to make films that are just good on basis of deep exploration of basic but essential human relationships.Luckily, with the director's record and faith by paramount, they created a simple film set in MA (USA)'s fishing port that immerses us in the hard but courageous lives of fishermen.The crisis in the movie is most unreal, but narratively superb in allowing the full expression of brotherly-fatherly love and friendship-mateship.So at last viewers will be able to understand the nuanced and rich Title Phrase \"the finestkind\".",
    "31": "Finestkind is a gripping and intense thriller that explores the themes of family, loyalty, and survival in a brutal world. The film follows two half-brothers, Tom (Ben Foster) and Charlie (Toby Wallace), who have grown up in different environments and have little in common. Tom is a hard-working fisherman who struggles to make ends meet, while Charlie is a reckless and impulsive young man who has fallen into a life of crime. The brothers decide to join forces and make a deal with a ruthless Boston crime boss. However, things go awry when they encounter a mysterious and beautiful woman (Jenna Ortega) who has her own agenda, romance and secrets.The film is a masterful blend of action, drama, and suspense, with a stellar cast that delivers powerful performances. Foster and Wallace have a great chemistry as the conflicted brothers who have to overcome their differences and work together to survive. Jones is excellent as the father who tries to reconnect with his sons and protect them from harm. Ortega is a revelation as the enigmatic Mabel, who adds a layer of mystery and intrigue to the story. The supporting cast, including Clayne Crawford, Aaron Stanford, Ismael Cruz Córdova, and Lolita Davidovich, are also impressive in their roles.The film also boasts of stunning cinematography and sound design that create a realistic and immersive atmosphere. The film captures the beauty and harshness of the sea, the grittiness and violence of the city, and the tension and danger of the border. The film also has a thrilling score that enhances the mood and emotion of the scenes.Finestkind is a film that will keep you on the edge of your seat from start to finish. It is a film that will make you feel for the characters and their plight, and will surprise you with its twists and turns. It is a film that will make you think about the choices we make and the consequences we face. It is one of the best crime thrillers of the year, and one that you should not miss.",
    "32": "Finestkind is a good movie. There I said it. Granted its not fantastic but its also not the dredge some of the \"professional\" reviews would have you believe. For me it's just a pleasant surprise. Sure it won't win awards or go down in history as a filmic masterpiece but it's a pretty nice way to spend a couple hours especially if you're a fan of the cast which is steller.I won't bother breaking down the plot since everyone knows it by now but will say that overall its entertaining if a bit silly, nonsensical and hardboiled at times. That said I didnt find myself bored watching the film, it moves along at a nice clip and a good chunk of the story is genuinely heartfelt, I felt for some of these characters at points, a testament not so much in the script but in the performances.Toby Wallace, Jenna Ortega, Tommy Lee Jones, and Ben Foster are the standouts here.Toby Wallaces, Charlie is a likable guy and Toby brings a certain goofy naiveness to him thats fun to watch. As the co-star of the film he carries it pretty well, sure there's the occasional cringy line of dialogue or needles bout of unnecessary exposition, and Charlie does feel a little overcooked as a character at times but I didn't mind since the majority of the screen time with him was enjoyable.The term \"miscast\" has been thrown around (eroniously) when it comes to Jenna Ortega as Mabel, the reluctant young drug dealer who just wants a better life for herself. Admittedly I nearly fell for that opinion based on early reviews and previews of the film but having seen it for myself, personally I think she did a admirable job here. It's not her best role to date but its a solid outing and she did what she could with the limited material she had to work with which is the main issue. Mabel is underutilized, and thinly written. Jenna has considerable acting chops (she's done alot more then just Wednesday) but wasn't allowed to flex here. Granted she's only a supporting character but there are scenes where it seems like things are heading in a interesting direction with Mabel or some profound statement is coming but they just kinda, end. Often abruptly at that, like a sentence thats never finished thus leaving you wanting more. Still Mabel is a likeable character that's easy to root for and get behind thanks to Jennas on screen presence and performance. Her chemestry with Toby Wallace is also noteworthy. The two play off each other very well and have a puppy love relationship thats kind of adorable.Tommy Lee Jones is the typical grumpy dad character. Sure he's played the curmudgeon before in films but that's why we're here, its what we want to see him do and he does it well. Ray is a gruff guy, dieing of cancer and dissapointed in his son's decisions. He's believable, strangely likable, and deep down a softy when it comes to his boy Tom. His journey comes to a satisfying conclusion, one that's perhaps telegraphed a bit but still impactful.Ben Foster is Tom, the gruff too much like his dad for his own good captain of these fishing expeditions. He's supremely confident of his crew and warey of the deal they get themselves into. He's oddly the most grounded and reasonable person of the bunch knowing what's at stake but unable to do much about it. Ben's performance is probably the most grounded relatable and realistic performance here.The rest of the cast is filled out with what can be described as fun characters to watch. Don't get me wrong alot of the 2nd half of the film is hammy as heck but these guys are likeable, and I know I keep saying it but are just fun on screen with what plays like real banter and angst between them.The production quality of the film is okay. The camera work sound and music is largely fine but is wildly inconsistent. Wide sweeping and often beautiful shots are intermixed with rough jump cuts, the music ranges from swelling and pleasant to grating misplaced rock. Its odd for sure, not enough to ruin my experience but enough to take note of. Scene placement is nicely done though and overall is easy on the eyes.In the end I liked the film, it's clearly a mid budget made for TV movie doing what it can with what its got, propped up by a pretty stellar cast and performances. The plots thin and some of the situations almost comically implausible, but despite its flaws I came away surprised that I liked it as much as I did and thats an important aspect of any film. I'd recommend giving it a watch or two.",
    "33": "\"Finestkind\" is a good movie, but you got to have the mood too watch it. I tried to watch it once, but thought it was a waste of time and changed to something else. Today, I tried a second time, and looked at it from a different perspective. The story float better this time, and the movie felt more enjoyable than last time. The plot is taking place in New Bedford, where a man and his crew are putting their life's into one thing: Fishing. And when they suddenly have to pay a high price for the boat, bad things starts. The story is a little bit slow at the start, it's a nice and quiet beginning and nothing special happens in particular. But later, things are getting better and better, and the story is building up much more interesting afterwards. I really liked the part in the film when they were just fishing, and they showed the hard work and process, and then we can remind ourselves that it's hard work required for the seafood you eat from the store. The pictures were very nice, the nice blue ocean, and the great camera angles did the job. The characters that go through the story are surprisingly interesting and I got some sort of connection with them. Character development and expression of the persons were a great part that carried much of the film. I really liked the action that was going on, but I wished some better camera filming many places. When they were at sea, the filming was great, but at land, the screen ideas became generic. Something to pick on, but it's quite important actually. The acting was decent. I think the brothers Tom and Charlie were greatly performed and their connection didn't felt fake. Jenna Ortega took her role in good hands and performed her character very good. After all, just a nice cast. The music soundtrack was very American, I got to say. Nothing bad about it, many American rocky songs, and I'm just ok with that. The runtime was good, but I think that in the end it could be ten minutes shorter. To summarise, Finestkind was a good film, could have some small changes, but was overall enjoyable and a nice film to watch on a Saturday night!",
    "34": "They had me at Ben Foster and Tommy Lee Jones. I'd watch either of them act out a bread recipe over anything Hollywood has put out the last 20 years.Anyone else who has lived long enough to understand that statement will probably like this movie. Others, not so much.I read somewhere this was a made for TV movie. I couldn't tell. The quality was big screen worthy.Also, real fishermen may or may not find fault with the technicalities. (I was in the medical profession and find medical inconsistencies on film yank me out of the required suspension of disbelief easily so I avoid those types of movies.)I enjoyed the glimpse into the fishing lifestyle.It was a decently strong story, good acting,good cinematography, and decent directing. Not as strong as the movie \"The Perfect Storm\" but still a very worthy watch.P. S. BTW, for people dissing on the accents.....Ben Foster is from Massachusetts.",
    "35": "This is actually a beautiful movie when you think about the meaning behind it. It's a movie about life, and fishing is the metaphor. What happens in life when you make mistakes, when you don't understand someone else's reasoning, when you have failed relationship, businesses, down on your luck... you fight.This movie is about the fight to maintain a livelihood for money, and a livelihood for those you love. When you realize what's really important and when you steer away from it,, you will inevitably seek it to return.A father abandoning his son, a father over loving his son, a brother who strayed away and the bonds of your fellow man.The main saying in this movie is, \"you live and you die, what matters is what you do in-between.\" Redemption, finding your purpose, giving all to those who you love, finding your path and amending the past. It's never too late to find what is truly important in your life.The actors did a wonderful job, the cinematography was beautiful and the meaning behind the movie is deep. It doesn't seem like it would be, but it covers so many things that we, as human beings, go through in life.Will this movie just be another movie, most likely. But if you enjoy looking beyond the scope of a film and diving into deeper meanings, you'll certainly enjoy it.",
    "36": "Disclaimer: I am not in any way affiliated with this production. I've seen this movie once, yesterday, & will eagerly watch it again. What rang my bell pretty early into viewing was what it ultimately proved to be, so here goes my hypothesis:This is an ode to stoicism.It's not about how things are, but rather about how they shoud be.It's a meditation upon Marcus Arelius' \"Meditations\".To run and do what your nature demands, fearing only your unfulfilled potential.To be the kindest, most virtuous self while facing certain adversity.To receive wealth via hard work & letting it go without regret.To achieve happiness, instead of pleasure.To accept the future unphased by doubt.Other topics are coded rather abstractly, like the crossing of the line, the \"duty to death\", forgetting & being forgotten by all things & even the sea itself.And since I find it highly unlikely that all of this is a coincidence, I hereby rest my case & proclaim that this movie is a magnificent piece of timeless, stoic philosophy.The best part about it: It's gloriously uplifting."
}