{
    "0": "Scrooged is a fresh, dark and original take on the classic Christmas Carol story. The ghosts are humorous and horrifying and Bill Murray does an excellent job of creating a modern-day Ebeneezer Scrooge. The ending is quite cheesy, but, then again, isn't that what Christmas movies are all about?",
    "1": "This is a modern take on the classic Christmas story about Ebeneezer Scrooge from the story A Christmas Carol, by Charles Dickens. To say that there was a lot of creative license taken here would be an understatement, but that does not detract from the fact that this is a great social comment on how commercialized Christmas has become. Bill Murray plays Frank Cross, a television network head that is trying to put on a live version of A Christmas Carol. He is driving his people like slaves and even tells someone to staple antlers to a mouse because they would not stay. He fires a member of his team on Christmas Eve for disagreeing with something he said. He has led a life of greed and cut off anyone that stood in his way, including his brother. That night he is payed a visit from fours ghosts, the first being his mentor, followed by the ghost of Christmas past, present and future. I am sure you are all familiar with the telling of this story. David Johnson and Carol Kane as the ghost of past and present respectively, steal the show. This is a great movie and should be enjoyed by all, every year.",
    "2": "Scrooged (1988): Dir: Richard Donner / Cast: Bill Murray, Karen Allen, Bob Goldthwait, John Forsythe, Carol Kane: A parody of the Charles Dickens classic with a modern take on the tale. Bill Murray plays Frank Cross, a cynical program executive who is the modern day Scrooge. He objects to his secretary taking time off to deal with his son's inability to speak. He fires someone on Christmas eve. Plus he is making everybody's life miserable on the set of the Charles Dickens play that he is producing. Bill Murray is hysterical as Cross who believes that he is going crazy during a long night of interruptions by three ghosts that showcases scenes from his life from past, present and future. Cross is humbled in humorous fashion until a third act where everything goes way over the top. Karen Allen plays a former girlfriend who lends her services to a homeless shelter. Through flashbacks Cross is reintroduced to their first encounter through their budding relationship until pride divides them. Bob Goldthwait plays a fired employee whose drunken spree goes into overdrive of singing carols and brandishing a shotgun. John Forsythe plays Cross's ghostly boss who returns to give him a warning. Carol Kane is delightful as the ghost of Christmas present who cheerfully smacks sense in Cross. While its humour is too crass for younger viewers, its satire view of the classic tale is a well produced holiday laugh fest. Score: 8 / 10",
    "3": "If you had any doubt about the talent that is Bill Murray ... another fine example why you shouldn't doubt him. He can be sweet and funny in one moment ... and mean and funny in the next! Just like that and it works like a charm. Now the story of Scrooge is very well known ... even to our characters in this movie too. That doesn't mean that we can't have some tweaks and changes along the way.And the movie does a really fine job with that. Not to mention that it really has one of the best castings I have seen for a movie like that. So many incredible people besides Murray ... it's just simply amazing. It may be a bit too grim for some at places, but it still has its heart in the right place! And while the breaking of the fourth wall at the end may seem strange - even that is funny while not being able to achieve what it would have on the big theatre screen.",
    "4": "Scrooged must be watched every Christmas. Bill Murray is in top form in this movie. He makes a great Scrooge in his selfish TV exec Frank Cross. This movie manages to never be boring and instead keeps you laughing throughout. The classic story of A Christmas Carol is well updated for these modern times and turned into a well thought out comedy. The supporting cast makes for a memorable and funny cast of characters, especially the ghosts of Christmas past, present, and future. Murray is the jewel of this film and he never fails to turn in a great performance. Bottom Line: You need to watch this at least every Christmas. It's a nice family comedy.",
    "5": "In the 80's and early 90's Bill Murray knew exactly what his fans wanted from him. He had a distinct comedic style and he delivered almost every time. Scrooged was primed and ready for a Bill Murray performance and he is terrific in it. He can play a role completely sarcastically and yet you suddenly find yourself invested in the character and actually caring about him. Its what made him indelible in his SNL skit days. I am always amazed that Hollywood actually manages to take a concept that they have milked to death (in this case Charles Dickens' immortal classic A Christmas Carol) and actually find one more slightly unique way to do it. Scrooged puts the timeless tale inside of itself, puts an absolutely adult spin on it and turns sarcasm and brutal pessimism into a heartfelt story. I was even surprised by how touched I was by the final scenes. I was convinced they couldn't turn it into something tangible by the end and they do which really captures the Dickens spirit I think. Best of all, the film is very funny, laugh out loud funny with physical comedy, outrageous stunts and Murray's fast talking, witty one liners that really work especially if you're a fan of his.I seem to have already talked a lot about Bill Murray headlining the film. He is terrific in the \"Scrooge\" type role and you know what you're in for if you know his work in that period. Karen Allen is an unusual choice for Murray's romantic interest. I don't think I've seen Allen in much and being a huge Indiana Jones fan, I always recognize her as Indy's first love Marion. She's very plain but I don't mean that to be insulting. She's just very \"girl next door\", down to earth and looks very sweet in this film and it works very well. You actually really root for their romance because it feels so genuine. Its not that they have amazing chemistry but there is something the works. David Johansen and Carol Kane are two of our Christmas spirits. Kane is hilariously over the top and Johansen is pretty terrific too. Bobcat Goldthwait is fantastic in a small but significant supporting role, John Glover, Robert Mitchum and John Forsyth are all very good in small supporting roles. Alfre Woodard is good but a little underdeveloped as the \"Bob Cratchit\" type character, a nice little twist on the story and Nicholas Phillips is very good but completely underdeveloped as her son. The cast work very well together and fit their respective roles.Richard Donner is one of my favourite mainstream directors. He has directed some truly outstanding films and had an incredible start in Television too. He knows how to tell a terrific story and get the most out of characters. This is a little bit of a different type of movie for him but it definitely has a style unique to him as well. Even if someone absolutely hated or was sick of seeing \"A Christmas Carol\", Scrooged is told in such a way that you won't even realize what you're watching. Its different and fun and dark and twisted and almost satirical in many ways. Satire is a genre of comedy rarely done well anymore and this is an example of what it used to be like. Scrooged is also classically 80's in the way that it unabashedly uses sexual innuendos, gratuitous bad language and doesn't apologize for it regardless of the fact that its a Christmas film. So adults if you're looking for something with a little bite and something outside the box for a Christmas film and have never watched this I definitely recommend it. Its entirely entertaining. 8/10",
    "6": "This was a pretty entertaining update of the famous \"Scrooge\" story. Unfortunately, however, that update includes profanity which certainly isn't necessary for this famous story.When the special-effects start, the movie kicks in. Bill Murray is convincing in his role as the bad guy - Bill usually is entertaining, like him or not - and Karen Allen is winsome when she flashes that pretty smile. Two minor characters are decidedly not funny: Carol Kane as the ghost is just plain annoying and Bob Goldthwait's voice is irritating.Like other versions of Scrooge, this one also has a touching ending. In fact, there are several very touching moments in this film despite the edginess to it. Then again, that's the message of the story.",
    "7": "After Bill Murray struck gold with Ghostbusters in 1984, he dropped off the radar a little. His personal project The Razor's Edge flopped with audiences and critics, and I think that must have been a blow to him. Besides making a cameo in the amusing Little Shop of Horrors, he stayed away from the Hollywood circuit for four years.But then in 1988 he resurfaced with Scrooged, an update on the classic Charles Dickens tale. Obviously trying to repeat the success of Ghostbusters, Scrooged was a modest hit with audiences, who considered it Murray's comeback role.When I was younger, I loved Scrooged. I thought it was funny and delivered on so many levels. But as I've gotten older, Scrooged has gone down considerably in my estimation. Instead of feeling funny, it now feels laboured, and forced. And I never thought I would say this, but the main reason Scrooged doesn't work is because of Bill Murray.Bill Murray is one of my favourite comedians. In fact I think he's one of the funniest men alive. His dry, laconic outlook on life is nearly always hilarious. Just look at some of the gems he's turned out. Ghostbusters. Groundhog Day. Lost in Translation and the sadly overlooked Broken Flowers.But then there's Scrooged. A film that should have been a perfect vehicle for Murray's talents, but it never even gets out of the gate. And I blame that on Murray, sadly. He did the theme of a miser seeing the error of his ways to much greater effect in the absolutely wonderful Groundhog Day, which is my personal favourite comedy of the 90s.In Scrooged, Murray is the borderline power-mad TV exec Frank Cross. A man so consumed by greed and hate he thinks nothing of firing employees if they even look at him the wrong way. Frank is on a dangerous path, and will lose everything if he doesn't change his ways. And so step in the Ghosts of Christmas Past, Present and Future to show Frank what he's missed out on in life.There is some invention during the scenes of ghostly visitations. The Ghost of Christmas Past is a grizzled New York cab driver. The meter is actually a calender that shows the year Murray is in. The Ghost of Christmas Present (a horribly screechy performance by Carol Kane) is like an insane Sugar Plum Fairy with a nasty habit of punching Frank repeatedly. The Ghost of Christmas Future is just as Dickens left it. Except it has a TV for a face.Usually I like Christmas tales with dark centres, like the excellent Nightmare Before Christmas and the hilarious Gremlins. Two brilliant films that succeed on every level. But sadly, Scrooged doesn't deliver. Whenever Bill Murray is in a film, he's usually the best thing about it. Here he's the worst. He's clearly not having a good time. He approaches each scene with indifference. When he's hands on with material, he can deliver superb performances. But he's strictly hands off with this film. And as a result, it makes his supposed redemption in the final scenes that all the more false.There are occasions where his trademark sarcasm shines. I liked the scene where he collects an award for Humanitarian of the Year. Its funny because Murray is notorious for shunning the award ceremonies, and his clear distaste for the Oscars is mirrored in that scene. His acceptance speech is a marvellous send-up of the countless celebrities who stand up to the mike and drone on and on about their achievements.But elsewhere Scrooged falls flat. There is no evidence that Frank is slowly thawing. And because Murray overacts badly in this film (strange considering that he prefers minimalist acting), I couldn't believe for a second what I was seeing. Murray spends a lot of his time shouting his way through the film to the point that it becomes tedious.In the supporting cast, we do get some occasional rays of sunshine. John Glover is hilarious as the exec brought in to lighten the burden on Frank's shoulders, when really he's after his job. John Forsythe sports an astonishing makeup job as Frank's old boss, who appears as a decaying corpse, the film's version of Marley's Ghost. And the underrated Karen Allen shines as the woman Frank gave up for the sake of his career.But its in the final scenes where Scrooged comes crashing down. Frank has seen the error of his ways. And to prove it, he barges on to the set of a live retelling of A Christmas Carol the TV studio is putting on. Frank goes on and on (and on) about the true meaning of Christmas. And its a horrible thing to see. Murray doesn't sound like he believes a word of what he's saying. It seems to go on forever. And I felt really embarrassed for him.What a pity! Scrooged could have been a hip, witty deconstruction of A Christmas Carol. And nobody does nasty and sarcastic better than Bill Murray. Where did it all go wrong then? How did it so completely miss the mark? Shame considering it came from Richard Donner, the man behind classics like Superman and The Omen. And such a waste of Robert Mitchum and John Houseman.Very poor, and ultimately very depressing too.",
    "8": "Okay, so here's the deal: a rich television executive learns that there's more to Christmas than ratings when he gets visited by the ghosts of Christmas past, present, and future, during a disgustingly reworked live televised version of A Christmas Carol. Once the executive (played by Bill Murray) gets a heart, so to speak, then it's time for everybody to feel better about the world and remember what Christmas is about, exactly.And just like most other ridiculous Christmas creations out there, it is itself a product of the very thing it claims to be warning against. Sure, Murray learns his lesson. Sure, sensationalist advertising-saturated promo creation is a Bad Thing (r)(tm). So why mix that message in with a big ol' dolloping of crude humor, sexual innuendo, and spastic cynicism? Oh, because it's \"making fun of all of that\". And selling it at the same time. Or something.Bill Murray also is at a career low here. I don't know how precisely he managed to do this, but his delivery in this film makes Groundhog Day seem like a bigger, more important holiday than Christmas. This is a vehicle of the worst sort: a movie meant to sell with star power, where the star basically plays himself, but the movie doesn't care enough about what it's doing to give the star any room to shine, and as a result the star just gets repetitive and obnoxious in his role. Probably the best example of this is the \"Oh, I get it now!\" monologue at the end, which never really says anything and keeps going on and on as Murray stumbles around throwing out ideas that are less revealing than the ones given to him in the spectral visits.By the time this movie ends, one can't help but anticipate the credits to see who's responsible for this stupidity. Surprisingly, it's Richard Donner, of Goonies and Superman II fame. Huh.--PolarisDiB",
    "9": "A selfish, cynical TV executive (Bill Murray) is haunted by three spirits bearing lessons on Christmas Eve.Does anyone know how many times \"A Christmas Carol\" has been turned into a film? Surely it would not be an exaggeration to say one hundred. But of those, very, very few go on to become classics (because, honestly, who needs to watch the same story over and over). This, after almost twenty years, seems destined to be a classic. Already it gets a solid holiday rotation.What makes it different is the updating (most seem to focus on the Dickens era) and the injection of humor. And even among those that have humor, how many have Bill Murray? Probably no other. Surround him with a great cast (including his own brothers) and you have a solid film.",
    "10": "As an admirer of Dickens' \"A Christmas Carol\" and one who has watched the Reginald Owen, Alastair Sim, Gene Lockart, and even the Henry Winkler versions several times, I found this to be a great disappointment.  I am a great fan of Bill Murray (Groundhog Day is a great favorite of mine), and I don't mind his mugging cynicism at all.  But his character in this movie is hateful.  At no time do I care about him, even in the flashback with his family, which, I suppose, is designed to tug at our heartstrings.  His epiphany is silly and insincere, making the last ten minutes an eternity. The charm of \"A Christmas Carol\" is that Scrooge once had love in his soul, but it needed to be let out through self discovery.  As Bill Murray invites people to join him, he is still smirking--doing Saturday Night Live schtick--making fun of his own movie.  Even if this is intended as a parody of the original, it is so cold, it doesn't work.",
    "11": "Scrooged is supposed a funny Christmas movie. The main problem with this flick is its unfunny in every way. Scrooged just isn't funny at all, and when that's the main selling point in a movie, when it doesn't deliver on it, it's kinda like, what else is there?? Bill Murray was alright as Scrooge, not awful or great. Carol Kane was actually pretty good in her role, she held her own well. The script is just so-so at best, nothing much to brag about on that account. There is some nice special effects in the movie, for 1988 that is. If you're looking for a nice family Christmas movie to sit down and watch, this might possibly be for you, it is PG-13, and it does have some language in it. You might could catch it on television when it's edited, ABC Family and AMC usually show it around Christmas time. But in my personal opinion, you can do a lot better. Scrooged is just boring and unfunny and not really sweet or heart warming at all. 3/10 for Scrooged",
    "12": "There is one single scene in the film I found to be genuinely moving and that is when Frank Cross (Bill Murray) is transported via taxi cab driven by Jake Johansson to when he was a boy. Watching him with his mother at that age is the only heartfelt moment in this otherwise ugly and very mean spirited Christmas movie. I've seen various adaptations of A Christmas Carole and even at his worst Scrooge is never as cruel.and sadistic as Frank Cross. Perhaps it is due in part of my dislike of Bill Murray who seems to have found a niche place with these sort man-child characters who need to go on some sort of quest to redeem himself. But in most of those previous adaptations of the Dickens story the redemption was earned and we get the impression that Scrooge was made bitter by various events in his life. I have never felt that way about Frank Cross. He comes across as a spoiled and entitled SOB who feels more like a sitcom caricature that an actual character. As much as I like Carol Kane her scene with Murray has to be the most unpleasant to watch as she smashes him with a toaster, pokes him in the eye, and just beats him up. It should be slightly enjoyable to watch but it isn't by any stretch of the imagination. But even the supporting characters are straight of a sitcom and the ending is nothing but schmaltz. It could have been a good retelling of the story but it is as subtle as a ballpean hammer to the chestnuts. If it wanted to go dark then stay dark and not go for the warm fuzzy ending. But as mentioned above, that scene with his mom, especially when she calls him Frankie Angel. Niagara Falls.",
    "13": "Over the years, there has been many different variations & renditions on English author, Charles Dicken's 1843's novel; 'A Christmas Carol' story, through film. Yet, there hasn't been many adapted movies that sway too far for the source material. That was, until 1988's 'Scrooged'. Not only did it modernization, the settling of the Christmas Carol-like scenario with a different set of time, characters & locations, but it also, in universe, make fun of premise of loosely adapting the novel, by having a cynical, selfish TV executive, Frank Cross (Bill Murray) go through the ghostly visits, while also planning a live adaptation of the book for his network. Because of that, I can say, this black comedy directed by Richard Donner is unique enough to stand on its own; as much of the humor here is focuses on the shallowness, greed, and sensation of commercial television, when it comes to the holidays. However, the strange, mood-swingy blend of mistletoe jokes with that, satirical trash television doesn't really mesh that well, together. Much of that, come from the fact that actor, Bill Murray and director Richard Donner reportedly did not enjoy working together, creating a lot of tension on set. It shows in their work. Murray still depress over the failure of 1984's 'The Razor's Edge' gave a stagnant somewhat rusty detached performance as penny-pinching TV producer, Frank Cross (Bill Murray), as he never really wanted to return to comedy after four years away from the business. Because of that, along with Murray penchant for unwanted improvisation, taking real physical abuse by actress, Carol Kane, including injuries & oddly time, mood swings, which Donner wasn't keen on, a lot of footage ended up on the cutting room floor; making the film look very sloppy & uneven in certain parts. All this detached anger & mean-spirited by both men, never truly make it seem like Cross change into a decent person, by the end of the film. Instead, the climax come across as a little too unpleasant/cynical and not enough joyful. Most of the themes of the film doesn't even seem focus on moral redemption, at Christmas, at all. I felt that the film written by Mitch Glazer and Michael O'Donoghue was a little too unfocused, spending too much time on a competitor subplot with Bryce Cummings (John Glover) & a murderous ex-employee, Eliot Loudermilk (Bobcat Goldthwait) that rarely affects the main plot. Another thing, the writing was a little heavy-hand on, showing the subliminal political/humanitarian reference to Apartheid controversy. It wasn't really needed. Another, preachy choice was showing the hypocritical when it comes to regulate violence & sexual content, with slapstick humor, & cartoony action. Because the focus was spent on that, it left little to the redemption parts. It really did seem those sequences got the short stick. Because of that, songs like 'Put a Little Love in Your Heart' perform by Annie Lennox & Al Green and written by Jackie DeShannon, Randy Myers & Jimmy Holiday seem to come, out of nowhere & seems oddly used. Nevertheless, the rest of the music choices, were alright for the most part. However, composer, Danny Elfman's score, does come across as jarring, because the fact, that he recycled parts of the tune for later films such as 1992's 'Batman Returns' & 1993's 'Nightmare Before Christmas'. As for visual & special effects, most of the effects, really does hold on, over the years. Even the makeup & puppet work for this film is still impressive. However, they did go, a little overboard at parts like Lew Hayward (John Forsythe) trying to kill Frank, by tossing him, off a building, rather than warning him about the three spirits. Nevertheless, regardless, the way, the movie was shot with the help from cinematographer, Michael Chapman was well-handle. There were parts of the film, where the spirits really did look like they were, about to jump out of the screen. As for the supporting cast that played those spirits; I also believe that they were good in their limited roles. Both, Carol Kane & David Johansen as the Ghost of Christmas Past & Present were wonderful. Even some of the acting in the non-supernatural roles, were fine, such as Karen Allen as Frank's love interest, Claire Phillips & Alfre Woodard as Grace Coolney, an employee for Frank. Even the cameos from Bill Murray's brothers, John, Joel and Brian were fine for the most part. As for the celebs cameos, such as Mary Lou Retton, Lee Majors, Paul Shaffer and others. They were also, nice to see. In the end, they all did their parts. Overall: I can't say, that this film is worth being a stocking stuffer. Don't get me wrong, it's watchable, but I seem better, holiday movies from Bill Murray, such as 1993's 'Groundhog Day'. In the end, like a blizzard on Christmas. It's a little too cold to play. Check other films, out.",
    "14": "Acerbic studio president, often loud and abrasive to those under his employ, gets a visit from three ghosts(and his deceased former boss, for whose place he took over, who prepares him for what awaits)who take him into the past, present, and future, in this noisy, brash, and often acidic satire on the Christmas season, taking shots at Charles Dickens' immortal story of Ebenezer Scrooge. Bill Murray never, to me anyway, looked comfortable in the role of Frank Cross, someone who polarizes everyone he comes in contact with, completely concerned with only his own needs and wants. John Glover is Brice, hired by the the leader of the studio, Preston(Robert Mitchum, who presents his character as if he's approaching senility), a potential problem for Frank's future as the man calling(most)of the shots. Glover is full of energy and enthusiasm, a \"people's guy\" who talks a mile a minute and seems very persuasive in gaining the favor of those around him.The first ghost(I'll get to Forsythe in a minute)is David Johansen(from the New York Dolls), Christmas Past, who drives a taxi cab full of smoke from his cigars, kind of resembling a chain-smoking, yellow-teethed elf(his has Vulcan ears)you might dig up in an alley somewhere catching zzz's in a cardboard box. Ghost Past carries him to his home as a child(whose meat market father is portrayed by Bryan Doyle Murray), not to mention, we see the love passed up for a career in radiant Karen Allen's Claire Phillips. The second is fairy Carol Kane, Christmas Present, with wings and a tutu, all sparkly, who enjoys smacking around Frank, punching him in the face repeatedly, as they visit his underpaid secretary's happy(if fatherless due to his murder)home and brother's party with friends. It's here Frank begins to see how empty his life is. The third is a ridiculously large, hulking Reaper as The Ghost of Christmas Yet to Come and Frank's visits (with the visual stylings of surrealistic art deco) involving his secretary Grace's visit to her mute son in a padded cell and Claire, now a cold hearted bitch who yells for pauper kids to leave her midst, are simply bizarre(and lack any form of emotional depth). The problem is when Frank \"finds the errors of his ways\" in regards to walking over innocent people to get to the top, it doesn't ring true or have any form of sincerity. Murray constantly barks loudly throughout the movie and never really captures your heart. This whole movie reeks of cynicism, and sadly lacks the Murray charm. I dunno, in the past I've enjoyed this movie, but this year it's so hollow and so many of the characters come off annoying and/or aggravating, especially Carol Kane who I wanted to see in a choke hold until her eyes popped out. Steller make-up work on Forsythe who informs Frank of the three ghosts' visits, a rotted corpse, with little flesh, mainly bones and dust. John Murray(Bill's actual brother)portrays Frank's brother, James. Alfre Woodard is Grace, Frank's beleaguered secretary. Bobcat Goldthwait is the poor employee who tells(correctly)Frank that his commercials for a bloody horror movie, SCROOGE(in name only), are ill advised, getting sacked in the process. Bobcat, drunk, unemployed, his wife having left him, goes berserk attempting to kill Frank with a shotgun at the end. A supporting cast, which includes Buddy Hacket and John Houseman as participants in the big-budgeted IBC(the name of the network company for which Frank is in charge)live telling of Scrooge, yielding a collection of familiar faces.",
    "15": "The Night The Reindeer Died!! They should MAKE that movie. Of course...without Lee Majors. lol.Among the many wonderful comedies starring Bill Murray, this one has to be one of my favorites. It's a rather irreverent remaking of the Dickinsian classic, \"A Christmas Carol,\" and is one of the best of Bill Murray's portrayals, in my opinion.This quirky, funny, and sometimes melancholy movie is quite entertaining, intelligently funny, and a must see for any fan of the original work which this movie parodies.Murray is a classic megalomaniac; a sycophantic, narcissistic, egocentric fool who manages, through his bastardization of the human condition, to rate the \"ghost of xmas past, present, and future\" treatment from the Powers That Be.Don't miss this wonderfully funny movie, especially around xmas time. It's an endearing, heart-warming and hilarious production which is horribly under-rated.It rates an 8.9/10 from...the Fiend :.",
    "16": "A departure from Richard Donner's regular features is \"Scrooged\", a comedy loosely based on Charles Dicken's immortal classic, \"A Christmas Carol\". Bill Murray is 'Frank Cross', a heartless television studio president who is both cruel and uncharitable (ala \"Scrooge\"), a terrible way to be on Christmas Eve! But all is not lost, as Frank is soon visited by three ghosts.Bill Murray and the supporting cast are only reasonable, with Bobcat Goldthwaite (\"Police Academy\") being a very funny exception. The comedy is never consistent, but Donner does manage an ending which may touch the sentimental, predictable as it is. Fairly good Christmas fun.Tuesday November 3, 1992 - Video",
    "17": "Bill Murray is attracted to weird movies like a moth to a flame. Not exactly \"Groundhog Day\" but I can't imagine anyone else playing the part, as a \"Scrooged\" TV executive! A great but disjointed cast! Carol Kane, as always, steals the show as a feisty fairy with a chip on her shoulder as \"The Ghost of Christmas Present\". That creepy David Johansen as the cab-driving \"Christmas Past\". A video-tubed Giant-Muppet-sized creepy \"Christmas Future\". Karen Allen is the long-suffering love interest. A ridiculous sub-plot of the most garish, oddball, TV version of \"Scrooge live\" with Mary Lou Retton as an acrobatic \"Tiny Tim\" and a surprisingly good (yet funny) Buddy Hackett as Bob Cratchit. The solid Gold Dancers as \"The \"Scroogettes\". So much going on. Murray is pursued by Bobcat Goldwaithe as an armed disgruntled ex-employee. Does it all work? Partially. So many good and bad cameos, including Michael J. Pollard. Younger viewers might not recognize them all. An over-the-top ending that you will either love or hate, as Frank Cross (Bill Murray) give the most sincere or insincere performance of his life as he \"stops the live show in it's tracks\" with his apology to all. You will enjoy it more if you are a Bill Murray fan. It holds up quite well, being almost 30-years- old! Fun for all but a very strange version of \"Scrooge\"! It might require a 2nd viewing, as the modern-day parallels to The Dickens' characters are a bit vague, at best.",
    "18": "What a terrible Christmas movie. It's supposed to be one of the best Christmas movies. Doesn't compare at all.It's entertaining seeing a cutthroat executive getting into the holiday spirit, and finding the nice guy within him. But it just dragged on and on. Couldn't finish it. Bill Murray is entertaining though in everything. Here it's a bore fest.Skip4 stars",
    "19": "Screenwriters Mitch Glazer & Michael O'Donoghue put their own warped, \"hip\", very 80s spin on the Charles Dickens perennial with this vehicle for star Bill Murray. The \"Scrooge\" that Murray is playing is Frank Cross, the working definition of the word rotter. Frank is a top network TV executive, and is crass, selfish, and sleazy. His idea of good Christmas programming is unconventional, to say the least. But he is then visited by the spirit of his mentor (John Forsythe) and three other ghosts who show Frank where he's come from, where he is, and what the future could possibly hold for him if he doesn't change.Revisiting this seasonal feature for the first time in a while, this viewer found it reasonably amusing, often in a dark vein. There certainly are inspired moments, and some poignant ones as well, in addition to a steady parade of familiar faces (both cameos by established stars and bit roles for recognizable character actors). Forsythe is especially good as this movies' version of Marley's ghost. Murray, who clashed with director Richard Donner behind the scenes, is clearly having a ball playing this shameless s.o.b. In need of a wake-up call. Karen Allen is her usual radiant self as the love of Franks' life. Bobcat Goldthwait does some of his typical shtick as the stammering executive who loses his job for no other reason than daring to speak his mind during a meeting. John Glover is a hoot as always as a smarmy type from California whom Franks' boss (Robert Mitchum) seems to be grooming to take Franks' place. David Johansen (as a maniacal cabbie / Ghost of Christmas Past) and Carol Kane (as a cheery yet sadistic Ghost of Christmas Present) are both fun to watch. And Alfre Woodard is wonderful as the long-suffering secretary whose silent son (Nicholas Phillips) serves as a stand-in for Tiny Tim.Admittedly, \"Scrooged\" *can* get rather loud and frenetic, so it's not for people who prefer subtlety and restraint. But overall, it's decent entertainment that at the least is certainly never boring. One of the best bits: the opening TV spot for the Cross-approved TV special 'The Night the Reindeer Died'.Seven out of 10.",
    "20": "Bill Murray stars in what was an eagerly awaited film when released back in 88. Murray plays a tv exec who is filming a version of the holiday classic only to see the classic tale and its ghosts visit him. A big budget can't help the flaws that include an overall unpleasant feeling for the Murray character (i know the Scrooge is not supposed to win anyone over but the viewer just doesnt care for the guy at all) and a general lack of funny situations. A very disjointed uneven comedy on a scale of one to ten..4",
    "21": "Good comic vehicle for Murray as a modern day Scrooge. Murray has many great one liners and the film moves along swiftly with no gaps.",
    "22": "SCROOGED (1988) ***1/2 Bill Murray, Karen Allen, Bobcat Goldthwait, Carol Kane, David Johansen, Robert Mitchum, John Forsythe, Alfre Woodard, Joel Murray, Brian Doyle-Murray, John Glover, Buddy Hackett, Jamie Farr, Mary Lou Retton, John Houseman, Wendie MalIick, Pat McCormick, Lee Majors, Robert Goulet, Paul Shaffer, Miles Davis. Hilarious rewrite of Dickens' classic \"A Christmas Carol\" with a manic Murray (top-notch perf) as a Scrooge-like tv network named Frank Cross (\"a thing they nail people to\") who faces three kooky spirits to jar him into being a caring, loving human being with some memorable, dark comic moments. Inspired screenplay by former \"Saturday Night Live\" scribes Mitch Glazer and Michael O' Donoghue (who has a cameo as a priest) with some faithful characterizations with a surprisingly touching speech a la \"Mr. Smith Goes To Washington\" by Murray at the film's conclusion. Also starring Michael J. Pollard as a Richard Burton on the brain homeless man and Anne Ramsey (her final role; best known from \"Throw Momma From the Train\"). Murray's three brothers, Brian Doyle, John and Joel play his father and brothers. Yule love it!",
    "23": "I couldn't get more than a quarter way into this movie. Murray did not convince me as what his character was supposed to be. They threw in some very mean moments to try and make it work, yet his startled face and poor delivery just never got into the character. It's hard to describe, but something about the movie is very messy. It zooms around without ever anchoring you into any scene or to any character.",
    "24": "I've seen most of Bill Murray's most popular movies now and I'm glad to have seen a Christmas one. The funniest thing is how it's a remake of \"A Christmas Carol\" but it actually features the story of \"A Christmas Carol\" existing in universe. It's even relevant to the plot! The best person in the whole movie had to be the Ghost of Christmas Present. She was just unbelievably funny and feisty, making for the film's best visual jokes. This ends up playing like most Christmas Carol adaptations, only with new funny original stuff.All of the Christmas ghosts are fun and even the title is a nice pun (I'm not trying to rhyme). Our protagonist isn't named Scrooge but he fits the bill. I especially like how they introduce The Ghost Of Christmas Future. It isn't who you think it is at first, or is it? It's a nice looking film that opens by showing a movie on TV making it look like it's part of the movie. Good for any Bill Murray fan like myself! ***",
    "25": "I recently rewatched this movie after having seen it not long after it's release. I couldn't remember much about it and perhaps this was a case of my mind protecting me from recalling the initial experience.\nThe 3 stars I'm giving it is a generous rating, and it pains me to say that, since I generally enjoy Bill Murray quite a bit.\nHowever, as most of the other negative reviews here note, he is dreadful in this retelling of Dickens' \"A Christmas Carol\". Others have pointed out that he seems uninvolved in the movie but I'm going more with those who feel his performance suggests he's more contemptuous of it than anything else. Shouting, scowling and declaiming his lines in a perfunctory devoid of any true emotionalism, he's exhausting and tiresome to watch. His \"redemption\" at the grand finale is utterly unconvincing and a drawn out mess that feels tacked on and perfunctory.Only David Johansen and Carol Kane bring any life to the film while Robert Mitchum, John Forsythe and Karen Allen are largely wasted in their thankless and underdeveloped roles.\nLook for Miles Davis literally \"on the corner\" in the band of buskers in one of the few moments of interest.",
    "26": "One of the worst films that I have seen and the worst Christmas one by a long way.Almost every scene is terrible and ridiculously over the top, to the point that it looks silly. Murray just screams and shouts his way through the entire film. He got away with it in Groundhog Day, as he had a brilliant plot to fall back on and toned it down after a while.There is none of that here. They take an ok Dickens story, fine but not one of his best and make it considerably worse in either version playing out. There is not scene which is either interesting, funny, believable or moving.",
    "27": "Bill Murray is on perfect form as a modern day TV executive who is devoid of any goodwill and charm at the most magical time of the year. Modern day elements have been successfully merged with all the well known aspects of Dickens' timeless masterpiece. Well recommended for viewing at Christmas.",
    "28": "This is in My opinion one of Bill Murray's best films and one of My favorite Christmas films.The acting is very good by Murray,Karen Allen,the late great Robert Mitchum,Carol Kane,David Johansen,Alfre Woodard,John Glover,John Forsythe Bobcat Goldthwait,and the rest of the good cast.The music by Danny Elfman is very good.Scrooged is a serious but funny film and I think all Billy Murray and Christmas movie fans should enjoy this!",
    "29": "I bought this because its Christmas and I thought I might enjoy it. I watched it as a child and have fond memories. Unfortunately I was extremely disappointed, this movie is a mess from start to finish. I like Bill Murray, he's always watchable but he cant do anything with this script, its dull, unoriginal, lifeless and very NOT FUNNY!The end of of the movie especially is so pointless, its like the director just made it up five minutes before filming it. Its not sentimental, the message is confused (how is he supposed to help people if he has just lost his job by acting stupid?.The more I write about this film the more I realise how much it SUCKED! Don't let nostalgia get the better of you, this movie is not worth your time or money.",
    "30": "Richard Donner's \"Scrooged\" is feel good Christmas fable. A re-imagining of the Dickens classic, set in the caring and sharing 80s. The plot is simple - a hard hearted TV exec is shown the folly of his ways by a series ghosts. There are no twists or surprises - the outcome is obvious from the first five minutes, but that doesn't make it any less enjoyable.The film is carried by a wonderful performance from Bill Murray - it's hard to imagine it working with anyone else in the lead role. There is a bit of bite to the comedy early one - particularly with the over the top trailer for \"the night the reindeer died\" - but this fades over the course of the film.This is not a film for the cynical - it can be overly sentimental at times - but fans of 80s comedies and Murray should find a lot to enjoy here.",
    "31": "A delightful Christmas movie. Nobody does smoking a cigar quite like bill Murray",
    "32": "What the actual hell did i just watch ???? this movie was awful, its very very differnt from anyother take on this story, and not in a good way, good god, dont recomend this one",
    "33": "Bill Murray stars in a yuppie, eighties spin of A Christmas Carol, playing a selfish TV exec, who is putting a on live broadcast of Dickens classic on Christmas eve.Due to his career, he avoids his family, or the love of his life.So the three ghosts pay him a visit over the course of one day, and change his life.The film is hilarious, and along with Die Hard, one of the best Christmas movies ever made, and it's thanks to Bill Murray and an awesome cast.It's so eighties, it almost throws shoulder pads at you, and Murray is the most cynical rich person of the eighties, since Gordon Gekko gave greed the thumbs up.Woodard and Goldthwaite are the exposition, and really add the bittersweet element to the story, and Allen adds the warmth and lie to the story.It helps that it's as laugh out loud as it is tear inducing, and I defy anyone not to shed a tear when Hermans watch plays or Calvin says the immortal line come the end.Murray makes the film what it is, and his breaking of the fourth wall in the last ten minutes, may be sickly sweet, but it grips you and doesn't let go.A true Christmas classic, with a lovely dark side to it.",
    "34": "Must be one of the worst ever created. For some reason it bugs the dickens (no pun... ok, maybe) out of me. That's all I really have to add since the film isn't much better.",
    "35": "Frank Cross is a very powerful executive of a successful TV station and he's about to make the contribution that will set him in motion for ages to come. Unfortunately Mr. Cross isn't a very nice person. With the help of his old business partner and the Christmas ghosts Mr. Cross will get the scaring of his life.This movie of course follows the whole Christmas Carol thing and all in all I think it did a great job. Bill Mury is probably one of the funnier actors out there and the acting for this film was very nice. I enjoyed the twisted takes on the Christmas ghosts. The overall feel of the film also makes it a good Christmas piece. The only down side is that it is a bit slap sticky so it brings things down a little.Though not a masterpiece. It is indeed a pretty good film.",
    "36": "Bill Murray stumbles through this muddled mishmash of Christmas clichés and vague references to the classic Dickens characters. Scrooged is an ugly mess punctuated by random, unnecessary violence and sexual innuendo. This is indeed a dark film, as other reviewers have noted, but without a deeper meaning or purpose. The writers seem to have written it simply for the dubious pleasure of wallowing in their hatred for the holiday itself.The predictable ending, which is nauseating in its insincerity, made me cringe with embarrassment for Murray. He rants madly about how he \"gets it\" and beseeches viewers to spread a little Christmas cheer and goodwill into their everyday lives. And then he smarms his way through a humiliating routine that lasts well into the credits, complete with a \"Feed me, Seymour!\" reference to his previous cameo in Little Shop of Horrors.I remember enjoying Scrooged when I was a child; now I wonder why my parents allowed me to watch such pointless, inappropriately sexual and violent \"Christmas\" dreck. This movie is trash.",
    "37": "'Scrooged (1988)' is an interesting, if relatively straight-forward, modern twist on a well-known Christmas classic, with the central cynical, money-grubbing curmudgeon here portrayed by the charmingly quick-witted and drolly dry Bill Murray as a jaded TV-exec producing his very own version of the classic 'Scrooge' tale. This adds a nice 'meta' layer to the piece and allows it to reflect on the ever increasing 'extreme' nature of the 1980s. While the flick is predictable down to its last plot-point due to its strict adherence to its source story's rigid outline, the picture manages to set itself apart from the numerous other adaptations by being not only as emotionally resonant as you'd expect but also genuinely funny, too. The inventive visual effects and somewhat more relatable domestic aspects bring a fairly visceral and close-to-home feel, one that's compounded by the focus on interpersonal relationships and the fact that Murray's selfish cynic is constantly understandable, charmingly dissonant and yet every bit as despicable as you'd want him to be. 6/10",
    "38": "Bill Murray gets a Scrooge treatment in Scrooged, my favorite(perhaps favorite)Christmas movie. This film makes me laugh so hard every time. Not that many movie do that. If I watch a movie by myself, I don't really laugh that much. But if I am with someone else, I laugh incredibly hard unless the movie just ain't funny. With Scrooged, I laugh anyways.Bill Murray stars as Frank Cross, a Scrooge like television executive that is visited by three ghosts on Christmas eve. Wow doesn't that sound familiar? Frank is shown his past, involving him as a child and him when he was in love with Claire(Karen Allen). The present in which he sends his brother a DVD player that he didn't even buy. And future, in which, well, you have all either read or seen one of the hundred adaptations of Dicken's classic. You can figure out the last one.Bill Murray is fantastic as The Scrooge like character. Perhaps my favorite line of his when he is talking to his old boss. His boss is telling him about the three ghosts and Murray says\"Let see if I can squeeze you in for a breakfast\". I don't know why but I love that line.Murray and other funny moments really make this movie for me. Murray is one funny guy, as we have all seen him in things such as Groundhog day. I am sure we all already knew that. Scrooged is perhaps my favorite Chriatmas film ever. I don't exactly know. I am still up in the air about that.",
    "39": "This must be the worst movie ever made of the classic Scrooge story. I felt bad for the people I watched this with. It was my fault for putting them through it. Sorry guys!",
    "40": "Richard Donner directed this updated and comedic version of Charles Dickens' \"A Christmas Carol\" starring Bill Murray as network programming executive Frank Cross, who is a most cynical, cold-hearted man with no Christmas spirit, who is planning a live-action musical version of \"A Christmas Carol\" (with an \"all-star\" cast!) who is himself visited by the ghosts of Christmas' past, present, and future, in order to save Frank's soul, and bring holiday cheer to everyone in his life, and on the airwaves. Crazy comedy does have some funny moments to be sure, but is seriously uneven and morally confused, since viewer is left with the uneasy feeling that the film is putting us on with the happy ending...still, this has become a cult favorite.",
    "41": "Bill Murray is simply sensational in this as per. My favourite Christmas movie. A real \"feel-good\" ending and a must watch during the Christmas season. Love it!",
    "42": "Bill Murray grabs the reins and refuses to let go in this almost-one-man-show modernization of A Christmas Carol. It's a dark, biting and sarcastic take on the tale that's set firmly in the murk of the corporation-friendly '80s, but it completely falls apart on the back nine. The first act is an inspired lampoon of bad network television (and the bad network executives behind it) with Murray, deliciously sinister as the worst boss in America, at the height of his powers. It's when the narrative tries to cram in a tepid love story and a sudden, jolting redemption that the cornerstones begin to crumble. This really could've worked if it didn't wear its intentions and inspirations so garishly on its chest, but subtlety is, sadly, not among the picture's attributes. A riotously fun opening forty minutes, followed by an uncomfortably transparent closing sixty.",
    "43": "I can't believe that Richard Donner, ( Director of George C. Scott's excellent version of Scrooge ), directed this pile of garbage.This film had no depth, and was not funny.I read lots of reviews, mostly positive reviews, and all I can say is that we are all entitled to our opinion..Sorry people, garbage from start to finish. Absolutely meaningless tripe.",
    "44": "*** SPOILERS AHEAD *** This movie is plenty funny enough -- albeit a bit loud and annoying in places -- but the sequence with Carol Kane as the Ghost of Christmas Present is absolutely priceless. She delivers killer lines with a cute little lisp: \"HE: If you touch me again, I'm gonna rip your goddamn wings off\", \"SHE: You know I like the wough stuff, Fwank\". All the while putting a beating on him: \"It's for you, Fwank. It's a TOASTER!\" (SMASH) Ms Kane is a comedic genius, and Murray rose to her level in these scenes.The Elfman score was great. Way to go, Danny!-R.",
    "45": "This is one of my all time favourite Christmas films, it's over the top humour and modern take on a Dickens classic is lightweight fun made for those dull bank holidays. The part of Frank Cross is a perfect fit for Bill Murray nobody else could have pulled it off, his totally over the top rants are a joy to watch. Murray is not the only one to turn in a fine performance in this film both Carol Kane and David Johanson are excellent in this film. The cigar smoking ghost of xmas past and the violent abusive but very cute looking ghost of xmas present are two of the many highlights in this film.In 6 months time when Christmas comes around again forget Bing Crosby or yet another showing of It's A Wonderful Life check out Scrooged instead.",
    "46": "Bill Murray plays a TV anchorman who is selfish, ruthless and mean.  He is visited by three ghosts and learns the true meaning of Christmas.  Murray is passable in the lead role, but this is really a ho-hum Christmas comedy that never has the magic of other Christmas movies, let alone A CHRISTMAS CAROL. SCROOGED is one of the weakest holiday movies, and is also a stupid vehicle for both Murray and director Richard Donner, whose LETHAL WEAPON movies and Spielberg's THE GOONIES were much better.2 out of 5",
    "47": "Quite a steady and uninspired film in my opinion. Despite the praise that is dumped on Bill Murray I find him unimpressive once again in this slow film that has a weak payoff. Not even the magic of Christmas carries it.",
    "48": "With this movie being a take on Dickens' \"A Christmas Carol,\" one challenge is to get the audience invested in the main characters, and drawn in by the storytelling, while presenting an overly familiar plot. However, the idea that Murray's character learns the error of his ways, or is worthy of redemption in the eyes of a love interest, is a bit strained. (A Bill Murray movie that does this well, by comparison, is Groundhog Day.) The idiom of describing a thing as \"better than the some of its parts\" is not true in this case. This film feels more like a bunch of parts that are disjointed, but shown in sequence. Some saving graces of this movie include: Nice celebrity cameos in the TV production of \"A Christmas Carol\" (which Murray's character oversees) and some good costumes and makeup. All in all, it's not the worst way to pass the time, while you're huddled in front of a living room TV with your extended family during the holidays.",
    "49": "Scrooged is based on A Christmas Carol (or something like that) by Charles Dickens where uncle Scrooge, a miserly old man, is visited by a three ghosts, and shown how nasty he really is, and thus in the end he changes and becomes a nicer person. A sickly moral by an idealistic author who really couldn't get over the fact that his father was a mean and nasty old man.This movie has Bill Murry playing the Uncle Scrooge character who is actually a TV executive that is just as miserly. After treating everybody like dirt, he is visited by a grotty taxi-driver who is the ghost of Christmas past, a psychotic fairy who is the ghost of Christmas Present, and of course death.Though I liked the psychotic fairy, I really found that this movie was even more dull and boring that Ghostbusters and really couldn't wait for it to end. There was so much moralistic rubbish in this movie that it made me sick. It was like most people are sweet and innocent and don't deserve the rubbish that they get. Okay, Murry's character was a not a very nice person, but I simply did not like the fact that a character like his changes so quickly. Oh sure, it does happen, but this is a fantastic movie set in a fantasy world where everybody turns out to be good little boys and girls and to me that is just putrifying.The critics described this as being a dark, depressing movie with a tragically flawed character. Personally I thought this was a long, boring movie, with a pathetically created character. In the end, I wouldn't suggest anybody return to watching garbology such as this (with the exception of the psychotic fairy).",
    "50": "(Possible spoilers) SCROOGED is the cinematic equivalent of coal in your stocking, a disheartening experience that sours your feelings about the Yuletide season. If this film conveys the true meaning of Christmas, I don't want to observe this holiday.The concept is promising- Charles Dickens's \"A Christmas Carol\" updated for the 1980s with Scrooge as a callous, ratings-mad television executive. And the film gets off to a great start with hilarious promos for \"The Night the Reindeer Died\" about Santa battling terrorists and \"Robert Goulet's Old-Fashioned Cajun Christmas.\" But from there, the movie generally goes downhill.Part of the problem, as a previous reviewer has noted, is that SCROOGED doesn't know whether to honor or skewer Dickens's story.  By constantly fluctuating between iconoclastic humor and earnest sweetness, the movie not only reveals the filmmakers' lack of focus, but their cynical desire to pander to both sentimentalists and scoffers. This only results in a meandering muddle.What ultimately ruins SCROOGED is Bill Murray's surprisingly bad performance in the lead.  Most of the time when he's mean, he's humorless and unpleasant.  Murray doesn't even convey an interesting ruthlessness that made Alastair Sim's pre-reformation Scrooge so compelling. He's just an unbearable boor.  And in his tender moments, Murray's too detached to be moving.He is at his worst in the final scene where he proclaims his love for Christmas on live television.  There's no joy in his speech, just desperation.  It's enough to make one empathize with the pre-reformation Scrooge.If you rever Dickens' original story, watch a straightforward adaption, especially the 1951 Alastair Sim version. If you're in the mood for holiday satire, watch BLACKADDER'S CHRISTMAS CAROL. Whatever your mood, I doubt you'll find SCROOGED satisfying.",
    "51": "First let's get one thing straight\nI do not like Bill Murray's performances\nOne of the only shows that i have found him reasonable chi's in Groundhog Day\nAll his performances are putrid in all the shows I have seen him in\nHe is loud, rude, obnoxious, idiotic, a big mouth arrogant and totally unlikable\nI don't know what he is like off stage but onstage chev comes through as a totally despicable person\nEven in Groundhog Day he was the same but he redeemed himself at the end\nLikewise with Jim Carey\nThere is only one movie I have enjoyed him in and that is Liar Liar\nAs one critic said many of the scenes were most definitely not for children\nThe violence in this movie although dubbed as slapstick are very much over the top both with the ghost of Christmas present and the fired employee\nIt was interesting to see him playing a different role compared to the one he played in POLICE Academy\nHe still retains his squeaky voice\nThe Ghost of Christmas Present is the biggest turn off of the whole movie\nThe Ghost of Christmas was worthy of a horror movie\nDefinitely not for children\nThe only reason why I watched the show is because I had it on DVD and the DVD also found the show reprehensible and stopped working 25% into the show so I wanted to see the whole movie\nI'm sorry I did\nThis is one show I would take and throw in the dustbin\nThe ending was lousy as well yetbthst was really the only redeeming feature of the show\nIt wasn't the finale but the song Put a Little Love in your heart that's gets the show 2/10 rather than a one out of ten.As far as I'm concerned this show is a total mockery and an insult to the Original Christmas Carol\nI have seen many other versions of a Christmas Carol and not one of them have scored less than 7/10 with me\nStay away from this show and even more important keep your kids away from it as well.",
    "52": "From director Richard Donner (Superman, The Omen, Lethal Weapon), it was a question on my mind whether filmmakers could do the classic Christmas story set in the present day, and this was certainly the chance to see. Basically an American US TV station is planning a live Christmas Eve production of the Charles Dickens classic A Christmas Carol, but the guy making it all happen, programming executive Francis 'Frank' Xavier Cross (Bill Murray) is a cold-hearted, selfish and mean bigot. Having spent years being the way he is, and being Christmas Eve, he is visited by the spirit of his dead boss, Lew Hayward (John Forsythe) and told that he could be like him if he doesn't change. Just like the Dickens tale he also says Frank will be visited by three other ghosts to try and mend his ways and appreciate the Christmas spirit, and he ignores it at first thinking he was dozing. While walking around the television studio however, Frank is first visited by the cab driver Ghost of Christmas Past (David Johansen), who shows him his childhood and growing up, including falling in love Claire Phillips (Starman's Karen Allen), and ultimately becoming mean. Next is the life-size pixie Ghost of Christmas Present (Carol Kane) who shows Frank all the people who know him and he finds out what they really think of him behind his back. Finally the seven-foot-tall ghoul, The Ghost of Christmas Future shows Frank what will happen in the time to come if he doesn't make a difference to his life. Of course Frank returns to the TV studio with a change of heart, even interrupting the live broadcast to increase salaries and wish the viewers a Merry Christmas, and he shares a kiss with Claire. Also starring Police Academy 2: Their First Assignment's Bobcat Goldthwait as Eliot Loudermilk, Robert Mitchum as Preston Rhinelander, John Glover as Brice Cummings, Alfre Woodard as Grace Cooley, Brian Doyle-Murray as Earl Cross, Throw Momma from the Train's Anne Ramsey as Woman in Shelter, The Love Bug's Buddy Hackett, Beetle Juice's Robert Goulet and Lee Majors. Murray for the first half of the film is the kind of modern Scrooge you would expect with his sarcastic comments and humorous grouchy demeanour, but the rest of the film does indeed go into sentimental mush and get less funny, overall, I don't necessarily agree with the critics' three stars out of five, but not a terrible seasonal comedy. It was nominated the Oscar for Best Makeup. Okay!",
    "53": "Easy to forget about this movie because you'll only watch it once a year at best - that's if you own it.  If not, try it again.  I'm sure you'll agree this is actually one of Bill Murray's best performances! It's not a Christmas movie - it's a comedy.  It belongs in everybody's collection.",
    "54": "Bill Murray plays a hard nose tv executive who only sees Christmas as a commercial gain when he visited by the first ghost who tells him he will be visited by 3 ghosts one a taxi driver is the ghost from Christmas past the second is a mad fairy about the present and the third is the ghost of the future it's okay film but the ending was a bit hammy but it was worth a watch.",
    "55": "What a fun little Christmas film! I was always creep out by the Christmas Carol story growing up, especially this version. Nowadays I find a lot of nostalgia for Scrooged and love the effects on all the ghost. They remind me a lot of Beetlejuice, especially the Ghost Of Christmas Past. Bill Murray is always charming and hilarious, (although the last speech was kinda awkward and speratic, I'm not sure if that were what they were going for, but it leaves the movie on a bit of an awkward mood instead of heart warming), and Karen Allen is always great to see and plays every part she gets perfectly. May not be an every Christmas movie, but is definitely fun!",
    "56": "Woefully heavy, noisy, over-produced holiday comedy rethinks \"A Christmas Carol\" for the modern (i.e., \"cynical\") new generation. In this scenario, wisecracking, rapid-fire Bill Murray is a good fit as a rotten TV network executive. He's initially a hoot, but the visiting ghosts and the constant stream of chattering characters weighs \"Scrooged\" down like an old fruitcake. Murray, pulling out all the stops, is a hearty actor who knows a great deal about nuance, but here his worst tendencies are encouraged and often he's just a nuisance. Karen Allen is a sweet love-interest and Alfre Woodard is wonderful as a harried secretary, but too many in the large supporting cast get stuck over-projecting in minor roles that don't call for so much caustic mania (Carol Kane and Bobcat Goldthwait are the biggest offenders). John Glover's sniveling villain is pitched so far over the top that he's not even a fun bad guy; the great Robert Mitchum is given nothing but weak material. Full of peaks and valleys, \"Scrooged\" is overly-dark and alienating, with an unshakable sense of claustrophobic smugness. ** from ****",
    "57": "A hilarious and heart-warming up-date to Dickens' fairy tale has Bill Murray in the titled role as a high-class television executive who cares much more about money and ratings than people. John Forsythe, David Johansen and Carol Kane are memorable as the first three ghosts while Bobcat Goldthwait dominates as a former employee fired on Christmas Eve. Karen Allen is adequate as Murray's love interest. Robert Mitchum, Alfre Woodard and Murray's real-life siblings (Brian Doyle and John) complete the likeable cast. Good direction by Richard Donner and some truly inspired moments help to make \"Scrooged\" a nice little film that still plays well, especially around the holiday season. 4 stars out of 5.",
    "58": "I have to say if you don't like this movie, then your sense of humor is non-existent.\nIt's a More modern version of a Christmas Carol, ramped up with lots of comedy.",
    "59": "Before Groundhog Day and Rushmore we have Bill Murray in Scrooged. I saw it on the small screen, so perhaps it didn't have the impact that the cinema offers. The ending is, as one reviewer said, somewhat cheesy, but that's Christmas for you.",
    "60": "I am someone who loves goofball 80s comedies like Trading Places, Fletch, Private Resort and Caddyshack. And i love Murray. But \"Scrooged\" just leaves a bad taste in your mouth. I found it loud, mean, dark and amateurish. It is supposed to be a comedy, but where are the jokes?Murray plays a selfish tv executive, who is in trouble with their christmas production. When he is visited by 3 christmas ghosts, he sees the error of his ways and decides to become good and charitable. But somehow i don't buy it. It seemed staged and insincere. Murray's performance seems flat, as if he's uncomfortable.The supporting cast is talented, but it's wasted as there's no real story. I found myself washing dishes out of boredom. Not recommended.",
    "61": "Great Christmas story with the bill Murray humour 👍",
    "62": "I don't know what it is exactly that constitutes a great film, I guess it's a combination of all the right elements falling into place at the same time, but whatever it is, this film has it. I can't imagine any other actor of modern times, as appropriate, for the title role. Bill Murray goes beyond the bounds of funny here. His performance is the next level up. In fact, I would endeavor to say that this is his best performance in any movie he's made to date. But it isn't only he that makes this one great film, his supporting cast is spot-on perfect. I love the slapstick repartee between himself and Carol Kane (Christmas Present) and \"Bobcat\" Goldthwait's performance is impeccable. The scene in the restaurant between Bill, Bob Mitchum and John Glover had me reeling in my seat. There are simply too many hilarious moments in this film for me to mention, it could take all night. This is truly an essential for inclusion to your personal library of classic films. Come to think of it, he does resemble Richard Burton, LOL, that's just one of a myriad of terrific scenes! GREAT FILM!",
    "63": "I've seen this underrated Christmas comedy so many times I can basically sing along to it like a popular holiday song.",
    "64": "Yet another version of \"A Christmas Carol,\" this one set in the present day and starring Bill Murray as a self-absorbed television producer.Though another version of the classic story probably wasn't really necessary, this one is entertaining enough if you're looking to kill a couple of hours on the sofa. The funniest moments come not from the main action, but rather from glimpses of the kinds of terrible shows Murray's producer character is responsible for putting on the screen.Featuring some ghoulish makeup effects that won the film its sole Academy Award nomination.Grade: B-",
    "65": "Billy boy.  What makes you so humorous.  How do you slide into a seemingly underwritten role and crack me so consistently... up?  Who cares?  Scrooged is not his best movie (What About Bob is my personal favorite, but pick yours and if it doesn't have an elephant or Michael Jordan in it it'll be hard to argue with you).  And it's got Marion from Raiders in it to boot. The story is an update of the classic Dickens tale - Jacob Marley, three ghosts, Tiny Tim, yada yada. There are some funny takes on the scenarios and some interesting cameos to go along with nifty special effects.  Anyway, for the man who mumbled, \"Nobody gets my jokes,\" I give Scrooged an: 8 out of 10",
    "66": "Very few laughs and not even Bill can save it from its predictible and ever increasingly schmaltzy message. Everything is thrown into it towards the end, but by then my mind had long wandered off.",
    "67": "this new watching left me disappointed while in my memories, it was a good moment: i'm sure that the lack of subtitles put me in pain but anyway this time i found the movie really dark, oppressive and not really funny in spite of being a Christmas tale! The past work of Dickens is a gloom reading, the future work of Zemeckis won't be lighter... In addition, if Murray has a few good lines, 99% of his time is being a really cold, totally acid, egocentric TV producer and that hurts! So it's not like having Christmas with cool Venkman but with the sad Connors...Sure the end of this tale warms the heart but the way to get there is as painful as a cold, dark winter night...",
    "68": "This isn't going to be a Christmas movie I ever watch again. It is over the top, Bill Murray is ridiculous, and the plot has been done a million times before. But there is something about Murray's charisma that hold the movie and wins the viewer over. I would never call this a good movie but it one I could see people either enjoying or hating.",
    "69": "This is a very 80's adaptation in a lot of ways and it doesn't always work. You never really get the sense that his redemption is earned, it's just required by the script. What does work is the blackness of it all and the ways they pushed forward the story into modern times. Uneven is a good way to put this as it's only occasionally funny, but when it does click, it's solid, it's just not always clicking...",
    "70": "This is another perfect example of the critics getting it WRONG!! They rarely get movies right!! Roger Ebert said this was the worst version of a Christmas Carol hed ever seen, hey moron it's not a version of a Christmas Carol it's a PARODY!! That's why its title is scrooged NOT a Christmas Carol. And it accomplishes exactly that, it's a great parody with an extremely funny yet touching performance by Mr Bill Murray the whole cast is excellent. I actually like it when the little boy at the end says god bless us everyone , compared to the original one where the boy says it and its annoying. Anyway if you want the perfect example of the classic a Christmas Carol watch allister sim in 1951s a Christmas Carol, if you want a funny parody then watch this. The combo is perfect!! We watch both every year. We also watch jim Carey's 3d version as well that's a visual masterpiece!! And above all.......MERRY CHRISTMAS!!!!",
    "71": "Easy to forget about this movie because you'll only watch it once a year at best - that's if you own it.  If not, try it again.  I'm sure you'll agree this is actually one of Bill Murray's best performances! It's not a Christmas movie - it's a comedy.  It belongs in everybody's collection.",
    "72": "Bill Murray plays a hard nose tv executive who only sees Christmas as a commercial gain when he visited by the first ghost who tells him he will be visited by 3 ghosts one a taxi driver is the ghost from Christmas past the second is a mad fairy about the present and the third is the ghost of the future it's okay film but the ending was a bit hammy but it was worth a watch.",
    "73": "What a fun little Christmas film! I was always creep out by the Christmas Carol story growing up, especially this version. Nowadays I find a lot of nostalgia for Scrooged and love the effects on all the ghost. They remind me a lot of Beetlejuice, especially the Ghost Of Christmas Past. Bill Murray is always charming and hilarious, (although the last speech was kinda awkward and speratic, I'm not sure if that were what they were going for, but it leaves the movie on a bit of an awkward mood instead of heart warming), and Karen Allen is always great to see and plays every part she gets perfectly. May not be an every Christmas movie, but is definitely fun!",
    "74": "Woefully heavy, noisy, over-produced holiday comedy rethinks \"A Christmas Carol\" for the modern (i.e., \"cynical\") new generation. In this scenario, wisecracking, rapid-fire Bill Murray is a good fit as a rotten TV network executive. He's initially a hoot, but the visiting ghosts and the constant stream of chattering characters weighs \"Scrooged\" down like an old fruitcake. Murray, pulling out all the stops, is a hearty actor who knows a great deal about nuance, but here his worst tendencies are encouraged and often he's just a nuisance. Karen Allen is a sweet love-interest and Alfre Woodard is wonderful as a harried secretary, but too many in the large supporting cast get stuck over-projecting in minor roles that don't call for so much caustic mania (Carol Kane and Bobcat Goldthwait are the biggest offenders). John Glover's sniveling villain is pitched so far over the top that he's not even a fun bad guy; the great Robert Mitchum is given nothing but weak material. Full of peaks and valleys, \"Scrooged\" is overly-dark and alienating, with an unshakable sense of claustrophobic smugness. ** from ****",
    "75": "A hilarious and heart-warming up-date to Dickens' fairy tale has Bill Murray in the titled role as a high-class television executive who cares much more about money and ratings than people. John Forsythe, David Johansen and Carol Kane are memorable as the first three ghosts while Bobcat Goldthwait dominates as a former employee fired on Christmas Eve. Karen Allen is adequate as Murray's love interest. Robert Mitchum, Alfre Woodard and Murray's real-life siblings (Brian Doyle and John) complete the likeable cast. Good direction by Richard Donner and some truly inspired moments help to make \"Scrooged\" a nice little film that still plays well, especially around the holiday season. 4 stars out of 5.",
    "76": "I have to say if you don't like this movie, then your sense of humor is non-existent.\nIt's a More modern version of a Christmas Carol, ramped up with lots of comedy.",
    "77": "Before Groundhog Day and Rushmore we have Bill Murray in Scrooged. I saw it on the small screen, so perhaps it didn't have the impact that the cinema offers. The ending is, as one reviewer said, somewhat cheesy, but that's Christmas for you.",
    "78": "I am someone who loves goofball 80s comedies like Trading Places, Fletch, Private Resort and Caddyshack. And i love Murray. But \"Scrooged\" just leaves a bad taste in your mouth. I found it loud, mean, dark and amateurish. It is supposed to be a comedy, but where are the jokes?Murray plays a selfish tv executive, who is in trouble with their christmas production. When he is visited by 3 christmas ghosts, he sees the error of his ways and decides to become good and charitable. But somehow i don't buy it. It seemed staged and insincere. Murray's performance seems flat, as if he's uncomfortable.The supporting cast is talented, but it's wasted as there's no real story. I found myself washing dishes out of boredom. Not recommended.",
    "79": "Great Christmas story with the bill Murray humour 👍",
    "80": "I don't know what it is exactly that constitutes a great film, I guess it's a combination of all the right elements falling into place at the same time, but whatever it is, this film has it. I can't imagine any other actor of modern times, as appropriate, for the title role. Bill Murray goes beyond the bounds of funny here. His performance is the next level up. In fact, I would endeavor to say that this is his best performance in any movie he's made to date. But it isn't only he that makes this one great film, his supporting cast is spot-on perfect. I love the slapstick repartee between himself and Carol Kane (Christmas Present) and \"Bobcat\" Goldthwait's performance is impeccable. The scene in the restaurant between Bill, Bob Mitchum and John Glover had me reeling in my seat. There are simply too many hilarious moments in this film for me to mention, it could take all night. This is truly an essential for inclusion to your personal library of classic films. Come to think of it, he does resemble Richard Burton, LOL, that's just one of a myriad of terrific scenes! GREAT FILM!",
    "81": "I've seen this underrated Christmas comedy so many times I can basically sing along to it like a popular holiday song.",
    "82": "Yet another version of \"A Christmas Carol,\" this one set in the present day and starring Bill Murray as a self-absorbed television producer.Though another version of the classic story probably wasn't really necessary, this one is entertaining enough if you're looking to kill a couple of hours on the sofa. The funniest moments come not from the main action, but rather from glimpses of the kinds of terrible shows Murray's producer character is responsible for putting on the screen.Featuring some ghoulish makeup effects that won the film its sole Academy Award nomination.Grade: B-",
    "83": "Billy boy.  What makes you so humorous.  How do you slide into a seemingly underwritten role and crack me so consistently... up?  Who cares?  Scrooged is not his best movie (What About Bob is my personal favorite, but pick yours and if it doesn't have an elephant or Michael Jordan in it it'll be hard to argue with you).  And it's got Marion from Raiders in it to boot. The story is an update of the classic Dickens tale - Jacob Marley, three ghosts, Tiny Tim, yada yada. There are some funny takes on the scenarios and some interesting cameos to go along with nifty special effects.  Anyway, for the man who mumbled, \"Nobody gets my jokes,\" I give Scrooged an: 8 out of 10",
    "84": "Very few laughs and not even Bill can save it from its predictible and ever increasingly schmaltzy message. Everything is thrown into it towards the end, but by then my mind had long wandered off.",
    "85": "this new watching left me disappointed while in my memories, it was a good moment: i'm sure that the lack of subtitles put me in pain but anyway this time i found the movie really dark, oppressive and not really funny in spite of being a Christmas tale! The past work of Dickens is a gloom reading, the future work of Zemeckis won't be lighter... In addition, if Murray has a few good lines, 99% of his time is being a really cold, totally acid, egocentric TV producer and that hurts! So it's not like having Christmas with cool Venkman but with the sad Connors...Sure the end of this tale warms the heart but the way to get there is as painful as a cold, dark winter night...",
    "86": "This isn't going to be a Christmas movie I ever watch again. It is over the top, Bill Murray is ridiculous, and the plot has been done a million times before. But there is something about Murray's charisma that hold the movie and wins the viewer over. I would never call this a good movie but it one I could see people either enjoying or hating.",
    "87": "This is a very 80's adaptation in a lot of ways and it doesn't always work. You never really get the sense that his redemption is earned, it's just required by the script. What does work is the blackness of it all and the ways they pushed forward the story into modern times. Uneven is a good way to put this as it's only occasionally funny, but when it does click, it's solid, it's just not always clicking...",
    "88": "This is another perfect example of the critics getting it WRONG!! They rarely get movies right!! Roger Ebert said this was the worst version of a Christmas Carol hed ever seen, hey moron it's not a version of a Christmas Carol it's a PARODY!! That's why its title is scrooged NOT a Christmas Carol. And it accomplishes exactly that, it's a great parody with an extremely funny yet touching performance by Mr Bill Murray the whole cast is excellent. I actually like it when the little boy at the end says god bless us everyone , compared to the original one where the boy says it and its annoying. Anyway if you want the perfect example of the classic a Christmas Carol watch allister sim in 1951s a Christmas Carol, if you want a funny parody then watch this. The combo is perfect!! We watch both every year. We also watch jim Carey's 3d version as well that's a visual masterpiece!! And above all.......MERRY CHRISTMAS!!!!",
    "89": "This is a perfect vehicle for Bill Murray, his brand of sarcastic and caustic delivery is nailed on perfect for Frank Cross, the modern day scrooge in this tale. I have often found him to be an acquired taste, I mean don't get me wrong here, I'm a big fan and can repeatedly watch his best offerings, but it's not hard to understand why his style is not universally loved. Scrooged is pure and simply the modern spin of the story we all have grown up with, that isn't to say that the film loses anything as regards Christmas spirit, because it doesn't, the message is still the same, and in this ever changing world of ours the core essence of the story is one the world should heed.This version is a blast, it's loud, it's brash, but boy is it damn funny, and I personally watch it every Christmas without fail. And yes, I watch it alongside the glorious Alistair Sim version, for although they are poles apart in class, they both entertain for very different reasons.Joining Murray in this festive romp is the delightful Karen Allen, while luminaries such as former New York Dolls front man David Johansen and Mr. Laconic himself, Robert Mitchum, add some weight to the cast list. It all works really rather well with the exception of Carol Kane's Ghost Of Christmas Present, where to me she comes off as being more annoying than funny, but that of course is a personal opinion and I know as fact that many others adore her energetic performance. With quips aplenty and of course with a simple heartfelt message at the core, Scrooged is truly a sharp and enjoyable film to be enjoyed at the festive period. Thanks boys, get the nurse! 8/10",
    "90": "Scrooged was a starring vehicle for Bill Murray who teamed up with director Richard Donner for this re-working of Dicken's A Christmas Carol.The movie is essentially a 'concept vehicle' a term in vogue at the time. A starring role for Murray, make him a high powered television executive and team him up with an action director who had success a year earlier with Lethal Weapon.Bill Murray is climbing the corporate media ladder as the ruthless, cynical, mean and heartless Frank Cross. In his office he has a sign which defines Cross. 'Something you nail people to!'For Christmas Murray has devised a multi location live television broadcast which has to be the show to watch with a strong promotional clip to publicise it which makes his fellow executives sick. However he has to contend with a rival, John Glover, there to help out but actually eyeing up his job.One night before Christmas his old television boss (John Forsythe) who has been dead for years visits him and tells him to mend his ways and informs him that he will be visited by three ghosts.They include the Ghost of Christmas past, a cigar smoking cab driver, the Ghost of Christmas Present, an angelic fairy who likes a bit of the rough stuff and certainly dishes it out, finally the Ghost of Christmas Future, a terrifying dark hooded figure who would certainly scare the kids.Each ghostly spectre takes Murray to a time and place. Such as when he was young and dorky working his way up in television and in love with Karen Allen. As time goes by he becomes obsessed with work and frustrated by Allen's do-gooder attitude.Murray actually calls on Allen when he his spooked out and finds out that she is helping out with the homeless but she stirs something in Murray who his still a Grinch.There is no Cratchit in this movie that part in effect goes to Alfre Woodard who plays Murray's secretary. Bobcat Goldthwait plays an executive whose life heads towards a downward spiral when he is dismissed by Murray.I remember the film was largely dismissed by critics when the film was released but it is rather an enjoyable reworking of Dickens's story. Murray despite not getting on with the director pitches it just right, almost remaining lovable even though he is mean spirited. I rather enjoyed his Richard Burton impression. The film has lots of star cameos from John Houseman, Lee Majors, Jamie Farr, Anne Ramsey and Robert Mitchum as Murray's cat obsessed boss.Director Richard Donner adds plenty of social commentary with references to apartheid South Africa for example.The ending might be regarded as tad sentimental which follows the book, but once they start singing the final song even you would want to 'Put a Little Love in Your Heart.'",
    "91": "I just finished watching this film (on TNT) for the countless time. What a fine seasonal offering. It's so much better than a lot of the pulp and smarmy c*** that passes for Christmas classics.Bill Murray exclaims at the end of the movie, \"I get it now!\" Apparently, some folks watched this flick and didn't get it. The movie is essentially a star turn for Murray, who's in almost every frame - and that's fine with me because he can carry a film. Trivial quibbles over the movie's name and reference to the original work, the lack of faithfulness to the book and other complaints miss the point of the project. While staging a production of 'A Christmas Carol,' a TV executive experiences the very same circumstances as one of the characters in the novel. That alone makes it work. A few reviews question the overall harsh tone of the movie, or more specifically, Murray's role. Frankly, I would not have minded had it been even a little darker. There's a lot of water to carry in that bucket of trying to measure the callous and thoughtless manner in which some folks act on all but the most treasured of holidays. Murray's demeanour boils it down into one strong mean spirit and evaporates it with a truly positive and well-wishing finale.Scrooged is, along with Groundhog Day, among his best work.",
    "92": "Francis Cross is a successful TV executive but at Christmas time he is about as miserable a man as you could wish to meet.  Forcing people to work over the holidays and unwilling to think of anyone but himself.  As Christmas Eve approaches Francis is visited by his dead boss, warning him to change his ways; when he doesn't he is visited by three ghosts who show him Christmas in the past, present and future.Each year there are plenty of versions of the classic Christmas Carol story, but this film is consistently one of the better ones.  It starts with a great dark comedy that sees some very imaginative gags (The Night The Reindeer Died) as well as Murray given great material.  At some point (roughly ghost 2), sentimentality starts to set in and the film doesn't quite have the edge on it that it did.  It still works - in fact, ghost 3 is not so much sentimental as really dramatic!What holds it all together though is a great performance from Murray.  He is funny throughout but also does the work to try and hold off the sentimentality of the piece - although it does come through, as one would expect with a Christmas movie!  The support cast is good and includes Woodard, Goldthwait, Goulet, Farr and Mitchum.  I didn't feel like Kane's Christmas Present really worked and didn't find her funny in the least. While the support cast add to the film, it is almost totally belonging to Bill Murray and the fact that it is so enjoyable is mostly due to him (although not even he can carry off the audience interaction over the end credits).Overall this is a good Christmas movie - it does give you a nice little festive glow but also has enough cynical edge to keep the syrup at bay for a certain amount of the time.  Regardless of everything else, Bill Murray is great in the lead and holds the movie together better than someone else may have been able to.",
    "93": "SCROOGED (1988) ****Starring: Bill Murray, Karen Allen, John Glover, John Forsythe, Bobcat Goldthwait, Carol Kane, David Johansen, and Alfre Woodard Director: Richard Donner   Running time: 101 minutes    Rated PG-13 (for violence, language, and sexual references)By Blake French:\t\"Scrooged\" is one of the top ten holiday comedies ever produced on the big screen. It enables a viewer to experience the true meaning of cinema: to jump out of our lives and experience another. Once in a long, long while we get a movie with as much magically irrelevant context as Richard Donnar's 1988 adaptation of Charles Dickens classic fable. \"Scrooged\" holds a place on my list of the top 100 American movies ever made.\tThe film takes place a few days before Christmas. Bill Murray stars as the heartless  Frank Cross, a corporate tightwad in charge of a highly profitable television company. This man seldom gives raises,  airs stomach churning TV ads, and fires desperate employees at the drop of a hat, regardless of what time of year it is. Currently, Frank's company is producing the first live Christmas program on network television, on Christmas eve. It is a Charles Dickens fable. Frank is at the prime of his life, living a wealthy, glamorous, but unhappy life.\tHis greed soon catches up with him, however, when one night his old boss visits him, who has now been dead for years. Frank is at first astonished; he thinks he is hallucinating. The talking corpse tells him that  very soon he will be introduced to three ghosts involuntarily. Franks then calls his old girlfriend, and continues on with his deprived life.Bill Murray plays his role straight, with intensity and imagination--just like everyone else in the cast. He acts like he is yelling at his workers, and they act like they are being yelled at. This is what generates the film all of its laughs. It takes the characters seriously, and the comical situations in which they are placed are what makes the film funny.\tEach of the three ghosts visit Frank. They include The Ghost of Christmas past, a rough cigar smoking taxi driver, an angelic but brutal pink fairy, the Ghost of Christmas Present, and the most feared ghost, Christmas Future, the death-resembling, dark capped figure. They each contribute a heartfelt, terrifying message to Frank, explaining to him how that he either needs to clean up his act and become a giving, generous man, or dastardly things will happen to him.   \tThe three ghosts are some of the most memorable characters ever seen in the movies. The human characters are also very interesting and entertaining. The filmmakers write each with distributive characteristics, provoking empathy and captivation. They are wonderfully portrayed as well.\tThe interlocking stories each related to each other in Richard Donnar's comedy classic as well. Each scene relates to the next with a strong, supportive narrative through line through Frank Cross.\t''Scrooged'' definitely fits into the comedy genre, and offers copious amounts of laugh out loud material. There's even dialogue and sight gags that provoke laughter. On the other hand, the film doesn't lose track of its message by being all over the wall slapstick silliness. It leaves room for the emotions and feelings present. For this type of comedy to work, the humor needs to be played accurately. Some scenes involving the past of Frank are quite emotional, and the filmmakers use this to their advantage to develop the Frank character even further. ''Scrooged'' may be a spoof, but if still holds true to the classic story it is based on.\tI also enjoyed the illustrious style this film uses: a mesmerizing blend of perfect set direction and colorful atmosphere. The sound track is very effective as well, with memorable tunes and voiceless medleys.  The closing scene of ''Scrooged'' may feel a bit contrived and fake, but it also allows us to leave the theater with joyful happiness inside. If this film doesn't put you in the Christmas spirit, nothing will.Brought to you by Paramount Pictures.",
    "94": "Well, Christmas is almost upon us again. So I'm going to comment on a view Festive films. Starting with Scrooged:I personally enjoyed this film, but after reading other user's comments on here for the movie, I guess you either Love it or Hate it.Why do people get so serious about a movie ? Its just a comedy that pokes a little fun at the Dickens classic.They mention that Murray's character of Frank Cross was hateful, spiteful, nasty, horrible etc. etc. ... That was the whole idea!! (You wouldn't have had a movie if he wasn't those things). Scrooge in the novel was horrible, spiteful, nasty,  etc. etc. Scrooged is funny, but it does hit on a few serious notes also. Especially when Frank is visited by Carol Kane's Ghost of Christmas Present.\nScrooged is the type of movie that no-one will ever agree on. They have their opinions, and I have mine.I love it. The bit at the end where Bill Murray finally realizes what Christmas is really all about, is quite moving as he talks directly to the viewers about it. Then when the cast break into song, Murray urges the Cinema audience to join in with them. The cinema we went to, did! It was a great atmosphere with the cinema singing along with the cast. And it was near Christmas too, which made it all that little bit more special :o)",
    "95": "Charles Dickens's classic Christmas tale gets a late 20th Century makeover with Bill Murray as our protagonist. Murray plays a hardboiled TV executive who only sees Christmas as a commercial opportunity to get the best ratings. The usual ghosts from Christmases past, present, and future visit Murray and in a more contemporary idiom explain the error of his ways. No need to explain this universally beloved plot, I think other than the Christmas story itself, more people know this story than any other in the English speaking world.A couple of Hollywood veterans John Forsythe and Robert Mitchum have some nice supporting roles. Both are TV executives, Forsythe from his past and who Bill Murray was something of a protégé. Robert Mitchum is the Bill Paley/David Sarnoff network tycoon and who already sees some flaws in Murray's approach and is grooming a smarmy John Glover to take his place.The Bob Cratchit part is split in two with Murray's secretary going home to a not so Merry Christmas with the family when the expected bonus she was counting on doesn't materialize, she gets a network monogrammed towel like everyone else. She's played by Alfre Woodard and she's drowning in some real 20th century debt. The junior executive Murray fires is Bobcat Goldthwait and he doesn't take his Christmas Eve sacking in the resigned frame of mind the original Cratchit it. As this is the ever zany Goldthwait his method of dealing with it is unorthodox.The spirits of the past, present, and future are played by David Johanssen, Carol Kane, and Michael J. Pollard. Of the three and in fact in the film Carol Kane is the best. She certainly has an original way of getting one's attention.Karen Allen plays the girl that Murray loved and lost and Scrooged gives him an interesting opportunity to make that up as well as change his way of living. Scrooged is first and foremost a Bill Murray show and Bill Murray delivers on all levels. All the spirit of Dickens is maintained, in fact when the cast in the finale starts singing Put A Little Love In Your Heart over the closing credits, isn't that what Charles Dickens meant to say what Christmas does?",
    "96": "This is a Christmas movie that also is very enjoyable to watch outside of the holiday's.Another name for the movie could be \"The Bill Murray Show\", he simply makes this movie and I can't even imaging how the movie would have been without him in it. He's amazingly funny and on top of that he also is a wonderful actor. You can see that in some of the scene's he improvised a lot and he did that brilliantly! All the other actors and characters are merely sidekicks.The story is basically a modern version of the classic Dickens novel \"A Christmas Carol\" and it's done wonderfully. It's great to see how the the classic story is translated into the 20th century. Everything works very well: The settings, the characters and the events, everything.From the hilarious opening involving Santa Claus and Lee Mayors (I say no more) till the wonderful ending the movie delivers non stop fun and pure entertainment with a nice love story, brilliant dialog and a great and important message in it. Only thing is that I feel that the movie could have done without the whole Loudermilk thing, but oh well...Very recommendable and close of being perfect.9/10http://bobafett1138.blogspot.com/",
    "97": "Every year, I make it a point to watch one new (to me, at least) holiday-themed film. This year, it was \"Scrooged\". After years of seeing it played over and over on cable, I finally sat down to watch it all the way through. What I discovered was perhaps the worst \"take\" on A Christmas Carol that I have ever seen.For a very basic overview, \"Scrooged\" follows Frank Cross (Bill Murray), a high-power TV executive who cares little for anything or anybody not helping his beloved ratings. While in the midst of staging a \"Scrooge Live\" sort of production, Frank himself is thrust into the shoes of the titular character, being shown the past, present, & future of his life should he continue on his jerk-ish path.There was almost nothing here that worked for me from beginning to end. The entire film is over-the-top, garish, sometimes outright silly/stupid, and about the furthest tone from the source material as possible. Murray--truly a star when this film was made--is not everyone's cup of tea, and that will bear out in \"Scrooged\". The movie will not make you like him if you didn't, or not like him if you did. He also plays a character so unlikeable in a real-world sense that his \"redemption\" is almost patently ridiculous.Truth be told, the biggest kick I got from \"Scrooged\" had nothing to do with the plot or characters but rather the star-studded cast. The likes of Karen Allen, John Forsythe, John Glover, Bobcat Goldthwait, Robert Mitchum, Carol Kane, Alfre Woodard, & Michael J. Pollard together under one roof is quite an ensemble.Overall, though, I was bored (and sometimes outright disgusted or confused) by \"Scrooged\" from the opening credits through the closing ones. This is a holiday adaptation I will never be returning to.",
    "98": "\"Scrooged\" opens in the clouds, and then suddenly descends on a snowbound cottage. Signs inform us that it's Santa's workshop and we're at the North Pole. Inside, elves work hastily as Santa prepares himself for his impending duty on Christmas Eve night. But then, terrorists, packing some serious heat with them, lay siege to the workshop.Panicking, Santa, Mrs. Claus, and the elves run towards the back of the shop, open a tool cabinet, which reveals an arsenal of M-16s, and soon everybody's armed to the hilt with automatic weaponry. But then Lee Majors appears on a snowmobile and reassures Santa that Christmas will be coming on time this year. Then Lee goes to work killing the terrorists with a large Gatling gun.Then we're treated to a promo spot for a television production of \"Scrooge,\" which features a bloody highway shooting, a plane blowing up, and drug addicts taking heroin. It is this sort of cynicism that's underlying in much of the subtext of this film, and it's also something that Frank Cross (Bill Murray), \"the youngest television president in network history,\" thrives on.And so opens \"Scrooged,\" director Richard Donner's contemporary take on Charles Dickens's classic tale \"A Christmas Carol.\" Dickens's novel has been fodder for countless television, film, and stage productions over the 150+ years it has been an accepted part of American literature, and this 1988 dark comedy is the latest incarnation.The biggest reason it has is because it describes the need for mankind to not be so selfish, and it takes three ghastly apparitions over the course of a 24-hour period to show an old miser the error of his ways.But all of this is in the past. Cross is so swept up in himself, that he gives bath towels to everyone (even his only brother) on Christmas. He asks his loyal secretary Grace (Alfre Woodard) to stay late at work, despite the fact that she has to take her mute son to the doctor. (\"I care!\" Frank says, when she confronts him about it.) He fires an underling named Eliot (Bobcat Goldthwait) for questioning him about his un-Christmas-like promo ads. He shuns Claire (Karen Allen), the only woman who's ever cared about him when she tries to provide comfort for the homeless. Yeah, Cross is every bit as a unsavory as most misers are when it comes to \"A Christmas Carol.\"But life is about to change for Frank, and that's marked by the sudden and (literally) explosive appearance of the rotting corpse of his late boss. The walking, talking \"worm feast\" informs Frank that he's going to be visited by three ghosts over the next 24 hours, and this may be his last chance to change his ways. And from there on, it's ghastly, darkly comic hilarity as Frank goes back, forward, and stays in the present as three ghosts (a manic cabbie, a jilted, abusive fairy, and a towering, cloaked skeleton, respectively) take him on a wild ride through his life.Bill Murray is at his comic best here, getting \"Scrooged\" the way someone in his position should. Much like the lead character in \"A Christmas Carol\" realizes the error of his ways, Frank Cross does so too, but with a kind of cynicism that could only be provided by someone as indifferent, uncompromising, and selfish as him. And he's also quite aware from the appearance of the first ghost of what this trip entails.The makeup and special effects are also worthy of some mention. The ghosts all look fantastic, even though some would argue that the effects that brought them to life are dated; well, this movie was made in 1988 for crying out loud!I liked \"Scrooged,\" as it is certainly a fantastic Christmas movie to watch, and is quite funny, especially just to see Murray get his comeuppance in a role that seems to suit him perfectly.Watch Bill Murray get \"Scrooged\" - 10/10",
    "99": "This is my favorite \"adaptation\" of A Christmas Carol.  It's also my favorite Christmas movie.  A lot of people say that Bill Murray's character of Frank Cross is unlikeable.  Would you prefer a warm and fuzzy Scrooge for the first half?  Then there are those who say that the end is sappy.  The ending is what I like the most.  And Murray's acting is much better than other Scrooges, who usually overact.  Murray manages to be over-the-top with his cruelty while still making his acting believable.  Cross is truly Scrooge-like, reveling in the death of an old woman caused by his commercial because it's free publicity.  Another common comment is that Carol Kane steals the scene as the Ghost of Christmas Present.  Not true.  The chemistry between Murray and Kane ensures that they share the screen perfectly.  This is a wonderful movie.  I can't understand why anyone would say otherwise.  Bobcat Goldthwait puts in a great performance as a disgruntled employee fired on Christmas Eve.  The best part is the end. This movie has what has to be the happiest ending in the history of movies. He understands the meaning of Christmas, gets a new lease on life, gets the girl, the little boy talks, and everybody sings a song.  Danny Elfman provides the score, doing a brilliant job as always.  A beautiful movie all around.  A+",
    "100": "I'm amazed by all the negative and mean-spirited comments for this movie. \"Scrooged\" is a cinematic gem, one of the most outstanding films of the '80s or any time for that matter. Bill Murray is at his comedic best, and he is entirely convincing as a bitter network exec who has lost sight of the important things in his life, like family and friends. You know the Dickens story, but Richard Donner's film version breathes life into the story and gives it extra meaning for modern audiences. Supporting actors all do wonders with their roles, from Robert Mitchum to Carol Kane to Michael J. Pollard. This film will make you laugh, and will certainly bring a little warmth into your Christmas season.For those who sight this film as mean-spirited or dark, they surely must be missing something. This film is funny, charming, and sweet. Frightening and warm at the same time, \"Scrooged\" is a modern masterpiece that has been unjustly overlooked and unappreciated. While there are other enjoyable Christmas films of the '80s (\"A Christmas Story\" and \"Christmas Vacation\" seem to get more than enough praise), none can hold a light towards \"Scrooged\", an excellent Christmas movie for modern audiences.",
    "101": "Another movie adaptation of \"A Christmas Carol\"?! Yes, but a new kind, with Bill Murray as a creepy executive about to get a new lease on life. Murray does his usual goofy stuff. I think that my favorite line was \"You are just a hallucination brought along by alcohol! Russian vodka poisoned by Chernobyl!\" I bet that Charles Dickens never envisioned anyone mentioning a nuclear disaster in an adaptation of his novel.So, it's not any kind of great movie, but funny just because of what Murray does. Many years after it came out, I learned that it was in the theaters when we moved into our new house (others included \"Rain Man\" and \"The Naked Gun\"). But that's just a side note. The point is that this is a pretty funny movie, and you're sure to like it. Also starring Karen Allen, John Forsythe, John Glover, Bobcat Goldthwait, Carol Kane, Robert Mitchum, Michael J. Pollard, Alfre Woodard, Jamie Farr, Robert Goulet, Buddy Hackett and Lee Majors.The Manson Family Christmas! Ha!",
    "102": "Frank Cross (Bill Murray) is the arrogant cynical president running IBC TV network. He aims to bastardize the Christmas classics. He overworks his assistant Grace Cooley (Alfre Woodard) and fires Eliot Loudermilk (Bobcat Goldthwait) who questions his methods. Preston Rhinelander (Robert Mitchum) is his boss and Brice Cummings (John Glover) is after his job. He ignores his only brother James (John Murray) and rather be alone. He is reunited with his true love Claire Phillips (Karen Allen) after 15 years apart. He is visited by Ghost of Christmas Past (David Johansen), Ghost of Christmas Present (Carol Kane) and finally Ghost of Christmas Future.Bill Murray is a modern Ebenezer Scrooge in this black comedy. It is dark and he is meaner than Ebenezer. It's not really a laugh fest unless you have a demented sense of humor. Murray is sarcastic and angry, and perfect for the role. Carol Kane is a great loud violent foil to him. She has some of the funniest scenes. It's a touching tale of redemption every bit as much as the classic.",
    "103": "A greedy, selfish television executive goes through a transition period on Christmas Eve.Scrooged is not the type of good natured Christmas classic that I would recommend for families to get into the festive holiday spirit, but as a dark, 1980s, yuppie spin on 'A Christmas Carol', I think it works well.I think you need to be a fan of Murray to fully appreciate the humour, as it is his performance, ad-libbing and persona that has so much focus. For me he is perfect in the pre-transformation scenes as he behaves despicably bad, yet is still funny whilst doing so. It makes me wonder which studio executives or showbiz moguls inspired the character Frank Cross.I think the finale is one of those love it or hate it concepts. Has the character gone through enough of an arc to justify the fairly sudden resolution? Does he deserve any plaudits after all the bad behaviour? If you take it seriously, definitely not. However, in keeping with the parallel to the Dickens story and the comedic tone, it probably needs to happen.Generally the humour has a satirical feel and cynically attacks the commercialisation of Christmas very well. This feels ironic in a movie with a primary goal of maximising profit with a late November theatrical release.It is a typical 80s comedy with certain moments that maybe too strong for children, but then some of the humour is quite juvenile as well. There are moments of sexism that may not sit well with a modern audience, but taken in the context of the era it is fairly tame.The supporting cast members are excellent, especially Karen Allen, Bobcat Goldthwait, John Glover, David Johansen, Carole Kane, Robert Mitchum, Alfre Woodard, and John Forsythe.Visually, as you would expect from a Richard Donner production it has lots of great visual moments of comedy, horror and general spectacle. The visual storytelling is strong, plus the art design and effects are great.For me it's a 7.5/10, but I round upwards.",
    "104": "When the film isn't even an original script (this being loosely based on Dickens' \"A Christmas Carrol\"), you'd at least expect the film to provide added value of its own.This here isn't funny. It's totally uninspired, and it's terribly flat. Very vacant in places, you'll find yourself wondering where you're at in the film, and not even caring. Bill Murray is fine, but he only portrays his terribly shallow, badly written, implausible, boring semblance of a role.There's no sentiment or strength in the narrative that makes you care about the characters, what's going on... and as I've read in a review, \"the overriding emotion seems to be anger\", the whole love/redemption thing is as forced as it could be in the end.The fairy ghost is pretty fun, and the NY cab driver's okay...2.5/10. Awful, awful comedy.",
    "105": "SCROOGED is a cynical '80s retelling of the famous Dickens story, transplanted to modern society and featuring a crass TV producer who must learn the error of his ways when confronted by the ghosts of Christmas past, present and future. It's fast-paced, refreshingly mean-spirited, and quite simply good fun.The main reason for this film's success is, of course, Bill Murray, delivering a delightfully deadpan turn as an absolutely villainous character. His Frank Cross is the epitome of '80s-era greed and commercialism, and Murray nails it from the outset. It helps that he's given great support (the underrated Karen Allen and Bobcat Goldthwait in particular), but this is the Murray show through and through.Okay, so watched today, some of the special effects look a little rubbery, and some of the schmaltzy stuff feels a little twee, but it doesn't matter. SCROOGED has a great script, lots of successful gags that come thick and fast, and another good turn from the reliable Murray. What's not to love?NB. I rewatched this film once more to see how it holds up in high definition. It looks a treat, and the '80s-style special effects are fine and pleasingly macabre. However, I think Murray's shouty performance is a bit too much. It's not the actor's fault, but rather director Richard Donner's, who insisted on everything being dialled up to 11. I think if the film had been a little more subtle and nuanced it would have been an all-time classic; as it stands it's merely a fun and snappy '80s variant on the famous storyline.",
    "106": "Why do I keep watching this? I don't like it! That may be controversial and I know that there will be friends on Facebook that will disagree with me wholeheartedly (Why am I friends with them?), but it just seems like Bill Murray spends two hours shouting and being silly, with equally annoying people!\nThank God for Karen Allen, the only sane, normal seeming character throughout. Although, believe it or not, even Bobcat Goldthwaite is more appealing in this one.It's a nasty and grimey interpretation of my favourite book and many classic films before and after it and I just think it is unnecessary and misses the point that the story tries to make. The last ten minutes is actually quite painful to watch as Murray attempts to make good, but just blabs incoherent nonsense to the camera.He is too extreme and the second ghost is soooo stupid it was cringey.I must not watch this film again!",
    "107": "Richard Donner's Scrooged, although fairly odd in places, is a visual opus of glassy New York nightscapes and a prancing Bill Murray sporting a grinchy attitude and a hairdo that would make Sonic the Hedgehog jealous. Murray plays ad TV mogul Frank Cross with a bitter resentment that's just this side of mean, but that's always been his charm, blurring the lines between comedy and drama, seriousness and farce until we're not quite sure what kind of performance we're getting from him. Thrill follows the standard Dickens play by play, showing us a regressed, antisocial prick who gradually opens up over the course of one magical Christmas Eve, after being visited by three ghosts. The standout here is David Johansen as the Ghost Of Christmas Past, here manifested as a howling lunatic of a cab driver, a decrepit old ghouls that keeps Frank on his feet via manic energy for his segment of the film. Carol Kane will puzzle as the swooning, creepy Ghost Of Christmas Present, a doped out Tinkerbell in her twilight years. There's wicked fun from other actors including John Forsythe, John Glover, Karen Allen as Frank's old flame, and a nice Yuletide vibe that's only hampered by an extremely out of place third act monologue from Murray that feels forced, demented and uncomfortable, otherwise, solid holiday fun:)",
    "108": "Yes, this particular story has been pretty much done to death being right up there with such fare as Hamlet and Romeo and Juliet as far as having way to many movies made with the same storyline. There is even another one coming out done in the same way as that \"Polar Express\" movie with Jim Carrey lending his voice and likeness as Scrooge. This one though surpasses all those other versions as I do not really care much for the story as it is. Why do I like this one then? It is funnier than all the others to me and Bill Murray does an excellent job in the lead role. A guy who is going to make people work on the holiday and suggests stapling little antlers on live mice. The story progresses a lot like all the others with the ghosts of Christmas past, present and future paying our guy a visit. Still, a lot different and there are some touching moments as well. There are also some parts of the movie that are overdone and let us face it, if you do not like Christmas that really is your business. I do not really care for how all these movies make it out to be a crime to not like Christmas. Still, for the most part the movie does not get all that heavy handed and there are a lot of laughs to be had as well. Not a super classic by an means, but it is a good Bill Murray movie.",
    "109": "I loved \"Scrooged\". It took a new turn and twist on a classic Christmas tale by Charles Dickens. Just think \"A Christmas Carole\" updated with the comedy stylings of Bill Murrey.Bill is absolutely hysterical in \"Scrooged\". I just love watching him interacting with the three ghosts. Also, another great twist. The first ghost of Christmas past is a smart alleck taxi driver who takes Frank on journey through his pathetic and wasted life of just wanting and thinking too much of his career instead of his family and friends. The ghost of Christmas Present, a wonderful comedic performance by Carole, is perfect. She takes Frank on a journey of seeing how his decisions are effecting his friends and brother, and despite his poor and careless ways, he's sees just by the joy of having a family and friends around that love you, you can have the best Christmas. And of course, the ghost of Christmas Future, where Franks sees the results of his decisions and what can happen.This is probably the first and only that can make me feel so good after I see it. All the performances are great and the story is just wonderful. This is a great Christmas flick that should be watched by everyone. Just put a little love in your heart and enjoy! Merry Christmas! See! It is effective! 8/10",
    "110": "What always impressed me about Dickens' original tale, aside from the serious message and the edgy bitterness, was that Ebeneezer Scrooge at the end never became a Franciscan fool. Scrooge didn't quit being a man of business, give everything away, and take a vow of poverty. He simply stopped being less of a turd head and more of a Mensch. It's a lesson that resonates as much today as it did in 1843. It's that our choice isn't necessarily between two extremes -- \"socialism\" and \"Ayn Rand\". There is a middle road that some of us seem unwilling to recognize.I think this is what Hollywood called \"a high concept movie.\" \"A Christmas Carol\" has been done to death. It's been done seriously and made into a musical. Now it's time for another telling of the tale, but this time let's make it a comedy with a the usual sentimental ending.There are a horde of recognizable faces on the screen, from Robert Mitchum to John Housemann, but the movie belongs to Bill Murray as the modern Scrooge, head of IBC who insists on a live broadcast of \"A Christmas Carol\" on Christmas Eve, even though everyone knows that people should be enjoying their family dinners and not glued to the telly.Frankly, it didn't sound promising. And in fact it had its unfunny violent slapstick moments, as when the Spirit of Christmas Present, Carol Kane, kicks Murray in the family jewels and drops him howling to the floor. That's not the only example of mayhem that pushes the envelope.Yet, even though we know what's going to happen, it's possible to get swept up into the story. There are, of course, CGIs but they don't overwhelm us. They're used judiciously, which is refreshing in itself. And Murray just can't be too serious, especially during the cornier moments when he should be. As the end credits role over Murray standing on the TV set and surrounded by cast and crew, all singing \"Get A Little Love In Your Heart,\" an emetic scene in itself, Murray addresses the camera and shouts things like, \"Okay, now just the people on the left side of the theater!\" And then he shouts for \"All the women! No, no -- the REAL women!\" It sounds as if he's deliberately sabotaging the clichéd scene and, in the process, bringing a little subversion to all the painful joy. \"FEED ME, Seymour!,\" he shouts. It has nothing to do with the story but it's an allusion to \"The Little Shop of Horrors\" in which Murray played the part of a dentist's pain freak. Still, Murray's efforts to undercut the clichés notwithstanding, it goes on too long. Nobody, not even Santa Claus, could have relieved the distress of that ending.It's not a masterpiece but a lot of effort has gone into it, it's sometimes actually touching and sometimes quite funny, and there are gags that work.",
    "111": "Scrooged (1988)* (out of 4) Comedies are suppose to make you laugh. This so called comedy made me angry. Bill Murray plays an extremely mean and cold hearted TV exec who plans on spending Christmas Eve by putting on a live broadcast of Scrooge but soon he's visited by three ghosts who will try and teach him the true meaning of the holiday. Okay, I know this movie was a critical failure when it was released but in the past several years it has gained a large cult following. That's fine but I'm not one of them. I really can't remember the last comedy I watched that really made my blood boil and get me this angry. I thought the film started off fairly bad and just grew worse with each passing second. I don't mind that this was a complete rape of the Dickens story as even the cutest or nicest story can have an adult twist to it. I also don't mind the rather profane sections of this film. I really didn't mind anything going on here except for the fact that none of it was funny. I really couldn't believe how unfunny this movie was but I think a lot of the blame has to go towards director Donner as it seems each scene in the movie is just grasping for laughs. The entire film is so uneven that each scene just seems out of control with it trying to get laughs. The entire screenplay is over the top yet it never really seems to know if it wants to go all out or just stay low key. To me the film really came off as some weird mixture of adult humor that tries not to go too far where it would earn an R-rating. Perhaps this film would have been better had it gone all out but I'm not sure if Donner could have handled that either. As far as Murray goes, there's two ways too look at it. I guess you could say he gives a brilliant performance as the evil exec, which is good for him but it hurts the movie because you hate this guy so much that you really don't want to spend any time looking at him. The thing with the Dickens story is that we could see some good at the bottom of Scrooge's meanness but I never felt that with this guy. Karen Allen, John Forsythe, Bobcat Goldthwait, Carol Kane, Michael J. Pollard, Alfre Woodard and Robert Mitchum are all wasted in supporting roles. Every cult movie is going to have people that love it and people that hate it. This is one that I ended up hating.",
    "112": "I know what you are saying, \"Another version of Charles Dickens!\" But this one has Bill Murray and he is funny. Even if you have seen several versions of this classic, you have to see the one with Murray. It'll be the one you watch every year.Murray plays Frank Cross, a grouchy television exec who's obsessed with putting on a $40 million production of A Christmas Carol for his network on Christmas Eve. He really is a Scrooge and is mean to his workers.So, who better to have a visit from the Christmas Ghosts?. Cross gets a visit from his former boss (deceased) who warns him of the imminent visitation of three ghosts. Cross writes this off as a hallucination brought on by stress and his network's big project, at least until the first ghost arrives and yanks him back to the past. The Ghosts are really free and they do a great job, particularly the abusive ghost of Christmas present (Carol Kane).There are interesting cameos from a variety of stars, such as Bobcat Goldthwait, Jamie Farr, Robert Goulet, and Mary Lou Retton.This is my favorite Christmas Carol Movie.",
    "113": "Between directing Christmas-based action movie Lethal Weapon and its inevitable sequel, Richard Donner gave us a different kind of Christmas classic... Scrooged, a contemporary reimagining of Dicken's seasonal favourite A Christmas Carol. The film opens very much in Lethal Weapon mode, with machine guns ablazing, as Lee Majors helps Santa in his fight against heavily armed terrorists; this scene is from 'The Night the Reindeer Died', one of the many programmes scheduled for the festive break by cynical TV station president Frank Cross (Bill Murray), for whom the holiday season means one thing only: a chance to up the station's viewing figures.As Cross prepares the jewel in his scheduling crown, a live broadcast of A Christmas Carol, he finds himself visited by his long-dead boss (John Forsythe), who tells him he will be visited by three ghosts: The Ghost of Christmas Past (David Johansen), who reminds Frank of his biggest regrets; The Ghost of Christmas Present (a hilariously oddball turn by Carol Kane), who shows him how his current horrible behaviour is affecting others; and The Ghost of Christmas Yet to Come, who shows him his not-so-bright future. These three visitations trigger a Scrooge-like change of heart in Frank, who, in the feel-good finale, understands what Christmas is really all about, broadcasts a cheery message, leads a sing-along, and hooks up with old flame Claire Phillips (Karen Allen).Like a trial run for his only-slightly-less-contemptuous character in Groundhog Day, Bill Murray's Frank makes the absolute most of the SNL star's acerbic brand of wit. Murray is the linchpin of the film, but his dry sarcasm is perfectly complemented by the more eccentric turns from Johansen and Kane, who provide many of the film's most memorable moments (Kane, dressed in fairy costume, but packing a mean punch, manages to be frighteningly unhinged yet strangely alluring). Also, Bobcat Goldthwait, as sacked station employee Eliot Loudermilk, is as bizarre as always, especially when he turns up toting a shotgun to take revenge on his boss (the uplifting ending to the film spares showing him being gunned down by trigger-happy cops).Donner proves just as adept at comedy as he is at action and horror (he gave us the '70s classic The Omen), giving us an assured slice of slick entertainment that, while not overly stylish, still impresses with its charming pre-digital visual effects, plus great make-up by Tom Burman (Forsythe's zombie make-up is superb). There's also one particular moment that stands out to me as truly macabre: Frank has freaky visions while talking to his boss in a restaurant, including a waiter catching fire. A one-of-a-kind, demented-yet-touching, Dickens-inspired classic with scenes of agonising fiery death: that's Scrooged!",
    "114": "Even though this is an attempt to turn Charles Dickens' classical story, \"A Christmas Carol\", into a modern version it is now a fairly old movie being made 1988. Yesterday was 2nd of Advent and I was in the mood for something \"Christmasy\" so when I saw that this movie was given on Paramount Channel I (actually we the family) decided to sit down and watch it.Unfortunately this attempt to modernize Dickens' old classic is met with, at best, a moderate success. Bill Murray is doing a good effort with the role he has been given. Actually, he being in the movie was one of the reasons that I decided to have a go at watching it. However the movie never really moves beyond being yet another rather mediocre comedy.His old \"friend\" visiting him as a dead guy and the first ghost was both quite cool and up to that point the movie was quite okay. However when the second ghost comes in the form of some wacky, sadistic fairy then it started to go downhill. She was not really funny and Frank's going more and more loony was not very funny either. The third ghost was rather meh.Sure there are a few laughs sprinkled around but not enough to elevate the movie to the heights that I was hoping from a movie with Bill Murray and based on Dickens' story. Most importantly, I never really got that nice and cozy Christmas tale feeling when watching the movie. The ending with the lunatic and disjointed speech by Frank was quite a letdown as far as I am concerned.The movie was good enough that the evening did not feel like a real waste but that is about it.",
    "115": "I already have an existing list of my 25 all-time favorite movies, but this would probably be #26 or 27!What's not to like?There's a pre-\"Lost in Translation\" Bill Murray, a Richard Donner in excellent form, a hilarious revamp of a classic story... and a toe-tappingly amazing score by Danny Elfman!Among other things, I like the idea of Bob Cratchitt being Alfre Woodard. I like the idea of a TV station standing in for Victorian England. For heaven's sake, I love everything right down to the Richard Pryor joke!Don't get me wrong, \"A Christmas Story\" is a great movie too, but I think this is the one that should be played nonstop on TV on Christmas Eve/Day every year. It's a classic!Again, what's not to like?",
    "116": "\"Scrooged\" is a very hard sell for me from the outset. I have long felt that there have been WAY too many versions of \"A Christmas Carol\"...way too many. Think about it, in addition to the traditional versions, there have been Flintstones, Mr. Magoo, Sanford & Son, Jetsons and Mickey Mouse versions. And, when I last looked, IMDB listed nearly 100 different versions of this Dickens story. Except for a few rare instances (such as \"A Muppet Christmas Carol\" and \"Blackadder's Christmas Carol\"), the many, many versions are just too many. And what innovations does \"Scrooged\" offer? Well, it's angrier, meaner, and features a Christmas Spirit that kicks the grouch in the crotch and punches him repeatedly for laughs, some nipples, as well as cursing...making it a lousy bet for family viewing!I won't bother talking about the plot.....EVERYONE knows it already other than it's a modern retelling of the story. The big difference here is that it appears as if they just let Bill Murray run amok with the adlibs and jokes....which, to me, just didn't fit in to the story at all. It also lacked subtlety and was rather ugly. The film certainly was NOT sweet and fun like \"Groundhog Day\", \"What About Bob?\" or \"The Man Who Knew Too Little\". No...it is just abrasive. And, in its own way, it is very cynical.So was there anything I liked about the film? Not much...though it was nice seeing Robert Mitchum and John Houseman in small roles. Also, the mouse with the antlers was cute. But apart from that....nothing.",
    "117": "...not quite , but his performance in Scrooged isnt far behind omnipitancy. With exception to Ghostbusters and Groundhog Day, this is probably one of his most hilarious performances to date. In this re-working of Dickens \"A Christmas Carol\" , Murray plays Frank Cross, a tight fisted,selfish Network Executive who, as christmas rapidly approaches, finds himself needing to hasten up proceedings on his networks live Christmas Carol show, which is airing on Christmas eve. From the very start of the film, we are treated to how unkind and selfish, Murrays character really is, yet we still cant bring ourselves to hate him.....even when he suggests to a prop man that he should STAPLE little plastic antlers to the heads of door-mice.Due to a very creepy encounter with his dead boss, Cross is warned that he will be visited by 3 ghosts, and so the story takes off, as he meets 3 very unusual ghosts with even weirder traits, such as the ghost of christmas present, who likes to randomly beat Cross up, every time he shows no heart. Best of all is the NOO YAWK talkin taxi driver, who i feel almost steals the show from Murray ....which is one of the hardest things in the world!!!Running throughout the film, is, ...sadly, a rather weak sub plot of Cross and his ex-lover, which , i love for all the wrong reasons.....but sadly, to people who have never seen the film, might find a bit tedious.But of course....its Murray who comes away from this looking cool, as , even though he has experienced some genuinely scary things ( the halucination of a waiter on fire is still creepy), we lap up his dead pan reactions to it all!!",
    "118": "Since I'm not a Bill Murray fan, it's no wonder his version of A Christmas Carol is one of the worst I've ever seen. And, since there are plenty of people who love him, there are plenty of people who love Scrooged and watch it every year. Like all art, movies are a matter of taste.In this modern take, Bill Murray stars as the cold miser whose life has passed him by and whose heart can only be warmed by the visit of three Christmas spirits. Since he's too young to feel life has passed him by, and since he's not the most convincing repenter in the world, to me, the story's message is lost in this version. The Ghosts of Christmas are the frightening David Johansen and the idiotic Carol Kane; and the love story with Karen Allen, normally a sweet and tender flashback in versions of A Christmas Carol, feels more like a one-night-stand than a lasting romance. Scrooged is dark and cynical, so if you're not normally a fan of Bill Murray's style, you probably won't like the movie. Like every other American, I watch Groundhog Day every year, but I always think how much better it would have been with the original casting of Michael Keaton in the lead. If you do rent this Christmas classic, you'll be treated to many cameos, which are always fun: Miles Davis, Robert Goulet, Lee Majors, Buddy Hackett, John Houseman, Brian Doyle-Murray, J. Pollard, John Forsythe, Alfre Woodard, and Robert Mitchum.",
    "119": "On occasions I find myself in the minority and that is the case with this holiday classic. Apparently not too many people in my humble circle of friends even like this film. This is, of course, an updated riff on the classic \"A Christmas Carol\" by Charles Dickens as Bill Murray portrays an obnoxious President of a television station who's the modern day Ebenezer Scrooge.The writing here is witty as most of Dickens's classic tale are woven into the storyline and all the while the real \"Scrooge\" tale lurks in the background as the Television Station is hours away from broadcasting a live showing on Christmas Eve. It's all here; The Ghost of Christmas Past, of Christmas Present and Future as Murray is shown the true meaning of Christmas and the importance of being a decent human being.I suppose if you don't like Bill Murray then you won't like the film. He's in every frame here and his over-the-top performance is what makes or breaks this film. I love his sarcastic delivery of witty one-liners and, ironically, my favorite parts are when he's at his nastiest (the bit with the old woman and the cab is priceless).The message here is timeless and always leaves me with a warm feeling in my heart. \"Scrooged\" gets a viewing once a year at my household along with other feel-good Christmas classics. I'm always chanting \"Put a little love in your heart\" at the end and that can't be bad.",
    "120": "Bill Murray lends his comedic talents to this contemporary version of the Dickens' classic `A Christmas Carol,' with somewhat skewered results in `Scrooged,' directed by Richard Donner from a screenplay by Mitch Glazer and Michael O' Donoghue.  This time around, Ebenezer is one Frank Cross (Murray), programming executive for a major television network with an office in New York.  Above all else, Cross covets the `ratings' he can add to his coffers, and this year he's going all out with a `live' broadcast of `A Christmas Carol' planned for Christmas Eve, starring Buddy Hackett as Scrooge and Mary Lou Retton as Tiny Tim.  And that's just a taste of the kind of humor this film has to offer.  There's more, much more, and it's all handled with aplomb by Donner, Murray and a great supporting cast. \tWhatever genre he's working in, Donner knows his stuff and knows how to deliver the goods.  Here he wisely lets Murray lead the way, but keeps his star on task and the film moving along with a tempered pace and great timing.  The story remains the same, but placing Scrooge-- Cross-- in the entertainment industry was a stroke of genius, and it all works exceedingly well, as it gives the audience a medium with which it can readily identify. Let's face it, television is a part of our culture, like it or not, and it's here to stay; and in this instance, using it as a setting for this story offers a `tableau vivant' rich with possibilities that are tapped to the fullest.  There's a promo for the upcoming live broadcast like you've never seen before; there's the `inside' industry jokes, like Network executive Preston Rhinelander (Robert Mitchum) urging programming for cats; `Marley's ghost' becomes Lew Hayward (John Forsythe) the exec who sold his soul for ratings; the casting of Hackett and Retton; but most of all, it puts Murray right in his element. \tMurray gets right to the heart of the character, imbuing Cross with a sense of jaded, dubious and sarcastic paranoia that so perfectly fits the psychological make-up of an executive in a business where you're only as good as yesterday's ratings.  And Murray plays him to the hilts; he has the tone and the body language, and nobody can look `askance' like he can, a nuance he makes the most of here.  it's an original take on a familiar character, and in Murray's skin Cross becomes a memorable and entirely believable figure, from his credible ruthlessness (he fires an underling, Eliot Loudermilk--played by Bob Goldthwait-- just before Christmas for disagreeing with his `vision') to his epiphany on Christmas Eve. \tThe terrific supporting cast includes Karen Allen as Claire, the girl Frank lets slip away as he follows the siren's song of career; John Glover (Bryce Cummings) as Frank's new `assistant,' plotting his way to the top; Alfre Woodard (Grace) as Frank's secretary, a single mom with a sick child; Michael J. Pollard (Herman); Nicholas Phillips (Calvin); John Murray (James); Brian Doyle-Murray (Earl Cross); David Johansen, as the cab-driving Ghost of Christmas Past; and Carol Kane, who turns in an unforgettable, hilarious, scene-stealing  performance as the Ghost of Christmas Present. There's plenty of laughs and some touching moments in `Scrooged,' which is a wonderfully entertaining holiday treat, especially if you want your `Christmas Carol' served up just a little bit differently this year.  And the speech Murray gives at the end, once he's had his revelation, is worth the price of admission alone; it's one of those things Murray does best, and he really connects with the audience, especially when he finishes up by leading everyone involved (including the audience) in song.  This is a movie that has become an annual event for many since it's arrival on video;  give yourself a present this year and put this one under your tree.  You'll be glad you did.  Like the song at the end (sung by Annie Lennox and Al Green), it'll `Put A Little Love In Your Heart.'  I rate this one 8/10.",
    "121": "I disliked this movie when it first appeared 14 years ago. I've just now seen part of it again, and like a bloody car accident scene, I couldn't turn away. But afterwards I felt dirty and polluted--- as if I needed to take a shower. I had forgotten how truly mean spirited and ugly this glob of vile really was. Yuck! And not to forget... Ewwwww.Karen Allen and Alfre Woodward are both such beautiful people--- hot babes, of course, but also fine spirited and good hearted folks. What were they doing in this disaster? I bet that either someone tricked them into it, or else 1988 was a lean year for them somehow, and they were desperate for money. And Annie Lennox! She sang the wonderful closing credits theme song--- \"Put a Little Love In Your Heart.\" Boy--- \"Scrooged\" is such a filthy disservice to those three marvelous ladies--- Karen, Alfre, and Annie. What a crime!Bill Murray may have some appeal for some people. But for myself, he makes my skin crawl. Please don't make the mistake of falling for the \"theme\" this movie is advertised under. It is NOT any kind of holiday movie you'd ever want to show any child, nor any loved one. Excuse me now, I must go and shower for about a week...",
    "122": "Acid Rain. Drug Addiction. International Terrorism. Freeway Killers. Now, more than ever, it is important to remember the TRUE meaning of Christmas! Don't miss Bill Murray's immortal classic Scrooged. You're life might just depend on it.Christmas Specials are a big deal, with some of them (such as Charlie Brown and The Grinch) going down in TV history. When it comes to story a lot of lazy staff writers just milk the Christmas Carol goat and there are millions of different takes out there to prove it with Roseanne and the original Star Trek series all doing their own rip-offs. IBC boss Frank Cross (Bill Murray dressed up as Steven Seagal's long-lost twin brother) is a delightfully wicked man of hate who is planning his very own live broadcast of said story. Little does he know that very tale is about to wind its way into his life.Why I like Frank Cross is because he's a lot like me. He's mean to those beneath him, yields power with a ruthless swagger and is sarcastic to just about everyone. If you disagree with him in even the slightest, tiniest little way he'll fire you. Just like I would. But on this certain Xmas Eve life is getting very weird for him.The owner of the station is doubting his abilities to undertake such a heavy production, a slimy Californian director is trying to muscle-in on his job and his dead boss comes back to haunt him. He brings an important message that if he doesn't change his way he's going to hell and that three ghosts, of Xmas past, present and future, are going to show him the results of his evilness.In the hands of just another comedy director this would have been a missed opportunity, but Richard Donner shoots the film as a supernatural fantasy and gives it a pretty superior shine. Something Brian Levant could never do. And let's not forget Bill Murray, the guy is a genius no matter what he does and he dominates the whole film with his loud an maniacal performance. Everything he says seems to be ad-libbed and babbles some brilliant one-liners and sarcasm.Most people are put-off by the ending and claim that when the nastiness stops and sentiment kicks in the film goes downhill. I don't feel this way. In a world where Xmas is commercialised and the time of year where people go in huge debt we need a constant reminder of what we should be feeling. No one is asking you to celebrate the fact that Wal-Mart are selling cheap turkeys or that greedy stores have a limited stock of $700 X-Boxes. At the end Frank Cross, the world's biggest scrooge and non-believer, tells us that it's the fun, the determination to make a difference, the easiness of changing someone's life and the spirit of the holiday season that really matters. You don't have to hate it and if you surrender your pride and just give it a go then maybe the miracle to happen to you to.For me, Scrooged has been an annual tradition for years and will continue to be so. Not only is it very funny but, in its own way, very important. If you give a little, you can get back a whole lot more. Sounds corny, I know but Xmas is what you make it. And you only get a small amount so it's best to make every one count. This movie is a step in the right direction.",
    "123": "Given how disappointing a number of revisited 80's film have been for me, I was delighted to see that one of my former favourites \"Scrooged\" has gotten even better with time.Embittered Television Network President Frank Cross (Bill Murray) is under pressure, trying to organise a live adaptation of A Christmas Carol to air on Christmas Eve. He's brutal on his fellow executives and a tyrant to his assistant Grace (Alfre Woodard). With the presentation looming, he's visited by the corpse of Lew Hayward (John Forsythe) his former boss who tells him that he'll be visited by three spirits, the Ghosts of Christmases past (David Johansen), present (Carol Kane) and future who'll show him the error of his Scrooge-like ways.\"Scrooged\" is a film I watched many times as a kid. Looking back now, I can't imagine what I thought some of the comedy was about, I probably just liked the slapstick - but now I can appreciate a lot more of the jokes and bits that make up the film. The Karma Sutra Christmas gift and Bill Murray's Richard Burton impression are both gags that I've never have gotten before. There's a lot more going on in Murray's performance than I would have appreciated and so much of it, particularly in the earlier scenes made me laugh. The two ghosts that we see are excellent, Carol Kane's manic, violent (somewhat sexual) fairy and, if you would have put a gun to my head, I'd have said Gilbert Gottfried played the Taxi driving ghost of Christmas past, but it isn't - it's David Johansen from the New York Dolls, who pretty much steals the film from under Murray, which is never easy to do.Looking objectively, you can see that the film doesn't quite nail the landing though. His big gesture at the end shows that he's learned the error of his ways - but I'm not sure why that means that Karen Allen falls back into his arms after 15 years! Maybe if they'd broken up a couple of years ago, but 15! He doesn't really do enough to earn that. It gets less funny as the plot takes over towards the end and I too can't help but feel like there was a better, cleverer way to finish the film that doesn't just involve a monologue to camera.It remains great though, and one of the few Christmas films that are actually worth watching, even if it's not quite all it could be.",
    "124": "Of all the versions of A Christmas Carol I have seen this is by far the most mean spirited one. I am not a great admirer of Bill Murray as he seems to play a variation of the same character in film after film, namely the man-child who must go through some quest to find redemption and to win over the central love interest of the story. Once in a while the formula works despite Murray always coming across as an annoying presence no matter what he does. In Scrooged he is at his most obnoxious. There is one sequence that I find genuinely moving and involves him being taken back in time to see himself as a young boy and his very sweet relationship with his mother. \"Merry Christmas, Frankie angel, \" says his mother. The adult Frank Cross tears up....and so do I. It is a scene that earns its emotions naturally, unlike the conclusion where you are beaten over the head in a desperate attempt to solicit emotions. The sequence where Frank is being beat up by one of the ghosts (played by Carol Kane) is among the most unpleasant. I'm willing to bet that a few of those punches landed, whether intentionally or accidentally is a matter of speculation. Karen Allen is the only genuinely likeable character in the film and it seems to be the most implausible aspect of the story that such a kind-hearted person would be interested in such a deeply cynical person as Frank Cross. I'll believe in Jacob Marley before that relationship. I've watched this once or twice and that's enough. There are far better Christmas films.",
    "125": "Back in my youth I used to love this film, it had such great comic moments for me and I loved watching it every chance I got. It has now been quite a number of years since I last saw it and it seems I've changed my view somewhat. I'm not sure if it's because I've got older (& wiser), or it's because it has become dated, but I certainly didn't enjoy it as much as I used to. But more of that later, here's a brief summary first (summary haters please find a humane way of fitting those tiny antlers to that mouse thank you).Frank Cross is a young and ambitious TV executive. He has risen through the ranks to the position of President of the Network at the expense of his relationships with his family and his girl, Claire Phillips. They are to put on a live production of Dickens' 'A Christmas Carol', but they call it 'Scrooge' for some reason. This means everyone has to work on Christmas Eve... Not popular as you might guess. When Frank is visited by the ghost of his former boss, he is told he must change his ways. To this end he will be visited by three ghosts. These ghosts, The Ghosts of Christmas Past, Present and Future show Frank the error of his ways But it's up to him to change.Although it's a pretty well produced film I did find it a little dated by today's standards. Yes, Bill Murray really pulled them in back in the day, but today I find him a little bit irritating. Having said that, he played the part of Frank Cross with great professionalism. It was the actors in the smaller parts I found more interesting; Carol Kane really gave her all as the Ghost of Christmas Present, Bobcat Goldthwait was great (as ever) as the unfortunate Eliot Loudermilk and it as nice to see Robert Mitchum as Studio owner, Preston Rhinelander. Oh, and I should also give an honourable mention to Karen Allen as Claire Phillips.I think part of the problem I have with this film is the Frank Cross character is so obnoxious that I find it really hard to have any empathy for him when he finally has his revelation. Maybe they took it a bit too far (for me), but having said that, there is still something about this film or am I reliving my youth again? Still, it's a bit of Christmas fun, if a little dated, so, recommended but only if you're in the mood.My score: 6.2/10",
    "126": "For a person like Richard Donner, it would seem difficult to make a film that rides close to the middle of being just okay. Considering he's only directed a handful of films of which many of them gained lots of praise or went on to be cult films, it's surprising when moments like these happen. Richard Donner headed Superman (1978), The Goonies (1985) and Lethal Weapon (1987). So for this, it's even more confusing when a well- respected director is paired up with decent writers and a cast of good actors. For comedy legend like Bill Murray, being in popular movies like Caddyshack (1980), Stripes (1981) and of course Ghost Busters (1984), how can a pairing create an output so okay-ish feeling? It may be hard to believe but it is in fact a film that's better than average but only marginally. Apparently it was reported that Bill Murray and Richard Donner did not get along during production either so this could be why. Things could have always been worse though I guess.The film screenplay is another alteration of the classic Charles Dickens story of the Christmas Carol. Here Murray plays Frank Cross, the head chair of a major TV studio that loves finding and attracting any viewer they can find. Until on the night of Christmas Eve, Cross will be given a chance to redeem himself as a better person. Written by Michael O'Donoghue (an SNL writer) and Mitch Glazer (probably his best known writing credit), the script to this holiday comedy can be hit and miss. For example, the studio will do anything it can to make sure its the hottest thing being watched, whether its making parody films of classic Christmas tales, straight out desecrating them or even making channel programs that appeal to cat and dog viewers. It's a bit of stretch there, especially the last one. A lot of these incidents feel over exaggerated and feels forced on the audience like they're supposed to believe that people would accept such things and find it believable.What is a nice change of pace is Richard Donner's directing skills. The story execution is fairly predictable but there are some various changes to the script that make it feel like effort was put in to make sure it doesn't feel like an exact copy. Much of this is due to the supporting cast being so helpful in their comedic timing and how they knock up Murray's character. John Forsythe as Cross' dead business partner has possibly the best introduction than any other ghost who visits him. David Johansen as the taxi driving ghost of Christmas past is the second best character with his no-cares given attitude. Perhaps the ghost who gets the cutest and most violent personality is Carol Kane as the ghost of Christmas present. There's also characters played by Karen Allen (Cross' ex), Bobcat Goldthwait (the voice of XL from Buzz Lightyear of Star Command (2000)), Robert Mitchum, Michael J. Pollard and Alfre Woodard playing a Bob Cratchet-like role. Then there's Bill Murray who is surprisingly the exact opposite.It's not that he is unfunny because there are occasional scenes that do produce a laugh, but the problem is he produces the least amount. Yes, Cross is supposed to be unfeeling but even unfeeling characters can have some kind of charm; but Murray doesn't pull it off. It's more obnoxious than charming. Another problem in the script is sometimes the story will spin off the main focus from Cross' development as a character and just wonder back into his reality to do whatever. It's distracting. Back to positives though, a visual element that works in this films favor are the special / practical effects. The special makeup effects creator / designers behind those scenes were Thomas R. Burman and Bari Dreiband- Burman (The Goonies (1985)& Die Hard 2 (1990)). There's also special effects supervisor Eric Brevig (Total Recall (1990), Hook (1991) and Men in Black (1997)) who shows that even before big Hollywood blockbusters he still had the talent needed to make things look good.Thankfully another visual treat is Michael Chapman's cinematography. Chapman is also the cameraman for Taxi Driver (1976), Ghost Busters II (1989), Space Jam (1996) and Six Days, Seven Nights (1998) all of which had decent lighting and steady movement. Also Chapman's work mixes evenly with whatever special or practical effects were put to screen. Lastly is Danny Elfman's score to the film that oddly enough sounds like a precursor to his future score for The Nightmare Before Christmas (1993). Sadly though, his score here feels underdeveloped. It is clear that its Elfman's signature theme with chanting choirs in a minor key, but after the title card appears it disappears for quite a long time. Then out of nowhere it rears its head and then abruptly vanishes again. Viewing Lala Land records website, it seems like there was a lot of material that wasn't used. It's also a shame when not even the original composition is that prevalent in the final product. What gives post production? Either way, when heard it is enjoyable.This holiday comedy does have some unique mutations with its direction in the script, but it also suffers from its main lead (Bill Murray) not being that funny and the main story sometimes jumping around. Thankfully the camera-work is able, the creature effects are well crafted, the music (although not abundant) is appropriate and the supporting cast adding to the laughs.",
    "127": "Unless you're watching for nostalgia, which turns even the worst movies into 10/10s, don't bother.It's awkward, badly paced, not funny, and the plot makes zero sense by the end, especially when compared to any other Christmas Carol movie adaptation. I'd recommend a Muppet Christmas Carol over this version any day.This is heartbreaking to say, but I wasn't convinced by Bill Murray's acting portrayal of this character at all... he has great movies, but this isn't it. His acting was awkward and seemed forced, probably due to the underwhelming writing.Groundhog Day could be a better Christmas movie than this, if not for the winter spirit then for the amazing performances, execution, and acting: everything this movie doesn't have.",
    "128": "BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM VERY HONEST ABOUT THESE FILMS.Another spin on the Charles Dickens tale this time set in the world of American Network Television. By updating the story (To then present day New YorK) also stripped away the heart and since of innocence to the beloved novel. In this version Bill Murray plays the Scrooge but here his name is Frank Cross a Network Television President. Franks idea of Christmas programming is basically putting the Manson Family on Television if it will get ratings. Of course he learns to take in the joy of the season by the end of the movie but the film makers themselves failed to infuse the story of heart. This film is a tad better than the HALLMARK Christmas MOVIES but that is because David Johansen steels every scene away from Bill Murray. Please if you want to see a great Version of \"A Christmas Carol\" see the 1938 Version produced by MGM. It set the standard",
    "129": "This is something that has bugged me since I saw this film in the theater, oh so long ago (youthful indiscretion!). I could prattle on (as I am wont to do) about the uninspired rewrite of the Dickens' classic, the wasted talents of notables such as David Johansen and Carole Kane, and the general Hollywood pitfall of missing the whole damn point of an otherwise good story! But I won't. Well, not much anyhow.At the center of this story-within-a-story, Bill Murray's character's TV station is about to put on a star-studded version of \"A Christmas Carol.\" I don't know how or why this could have happened, but they keep referring to the story as simply \"Scrooge.\" Of course, this was the name of the musical remake, but the show in the film is not the musical. Yet they continue throughout the film to refer to it as \"based on Charles Dickens' immortal 'Scrooge.'\" Who was in charge of research on this film? why didn't the best boy or lead man or hairdresser speak up and say, \"Uh, guys? That's not actually the right name.\" A perfect example of Hollywood spending lotsa cash and producing garbage.Okay, I can't help it: A thing that really bothered me was the final ghost visitiation. When Bill Murray watches his body being cremated and then finds himself in the coffin is a complete misrepresentation of that point of the original story. Scrooge is moved by seeing his own grave, not because he is dead, but because he realizes he will die all alone, with not one to mourn his passing. I wish I could say \"Scrooged\" was destined for the same lonesome fate, but it is so damn annoying I can't stop babbling about it.There. I feel much better now.",
    "130": "There were three things about \"Scrooged\" that drew me to the theatre during its initial run: it had Bill Murray after an extended time-off from films, the basic \"A Christmas Carol\" story and...it was a comedy.  Like I said, that's what drew me.Now all I can say is: people, learn from my mistakes and DON'T WATCH \"SCROOGED\"!To say that Murray is wrong in his part as network head honcho Frank Cross isn't comment enough - he approaches it as if he was right in the middle of something important and wants to hurry back to it.  He's mean, nasty, irritable, cranky, foul-natured, hostile, violent and disrepectful. Usually, those are positive qualities in his movies, but here they are not. Everyone he is in the same frame with seems to consider him like that passenger in coach who complains about everything, yells at the stewardesses and hasn't bathed in a week.  Maybe they're right, I dunno.Then there's the tone of the story - does it want to be a parody of \"A Christmas Carol\" or a retelling?  It fails at both because they never find a consistent tone and stick with it.  It's slapstick, then it's maudlin; it's satire, then it's love story; it's sentiment then everyone breaks into song. WHAT THE...??!  If the film-makers weren't sure about how to make the film, how should we know how to take it?And finally, there's the wisdom of a \"comedy\" where a child is struck mute after his father is killed, a homeless person freezes to death and an old lady dies of a heart attack after watching one of Cross' (Murray's) paranoia-driven commercials for his network's production of \"Scrooge\".  This is a holiday comedy?  I haven't even mentioned the part where he steals another woman's taxi then flips her off as he rides away.  Ho ho ho.This is about the most depressing holiday movie I've ever seen; enough to put you off your egg nog.  Any good parts?  Well - Forsythe in the Jacob Marley part has a good first scene, Allen is radiance and light as an old girlfriend who loves her \"Lumpy\", and Kane is a fantastic Ghost of Christmas Present by the sole virtue that she gets to beat the holy beans out of Murray with her fists, uppercuts him with a toaster, knocks him down a flight of stairs, slaps him, electrically zaps his ears, plants a nice firm kick right where you'd expect and tries to rip his bottom lip off.  God, I love that woman.Other than that, nothing.  Not a thing that celebrates the season, goodwill, peace, love, charity, the Christmas spirit, and not one mention of the original source material: Dickens NEVER wrote a story called \"Scrooge\".BTW, wasn't there a musical made with Albert Finney called \"Scrooge\"?  Maybe they missed a good bet, here.Two stars only for \"Scrooged\" - one for Murray (he's worth one, anyway) and another for \"Robert Goulet's Down-Home Cajun Christmas Special\".  Now THAT I'd like to see.",
    "131": "The reviews by the critics for this film were terrible. However the general viewer feedback is good. The film has some sappy, overblown moments ie.- the ending. But its all done in good spirits. If your a Bill Murray fan you'll love it. As the morally redundant TV exec Frank Cross, Murray gets far and away the most screen time and his straight faced, dry humour is just perfect for this type of character.The film is a modern update of 'A Christmas Carol' for anyone who doesn't already know with the aforementioned Murray character Frank Cross replacing the role of Ebeneezer Scrooge. After being initially visited by his now deceased ex-boss(represented rather shockingly as an old decaying, mouse infested corpse still wearing the golf uniform he suffered his life ending heart attack in on the fairway) and on whom he had based his own career (though Frank has gone on to become even more selfish and concerned with the bottom line than even he was) Cross simply dismisses the episode as the result of high level executive pressure. In particular Frank is stressing out about his network's live Christmas eve broadcast which is surprise, surprise a big budget live version of 'A Christmas Carol'. However he is in turn visited by 3 very different versions of the ghosts of Christmas Past, Present and Future to the one's represented in the Dicken's tale , with the possible exception of the final ghost who is much more traditional in representation than the others. The role of Tiny Tim and Bob Cratchet are represented by Cross's long suffering secretary and her young son who is a mute as a result of the trauma of seeing his father murdered several years before. There is a couple of interesting side stories involving Murray rekindling the only real relationship he has ever had with his first love Clare who he decides to recontact amongst all of the madness as well as a confident young new executive who has been brought on board and tries to act as Frank's friend but is clearly planning to usurp him. This attempt is aided by everyone's perception that Frank appears to be suffering some kind of breakdown as he tries to deal with the bizarre impingement on his life by the aforementioned ghosts. Possibly the most entertaining of the story lines not relating directly to the main one involves a naive young board member played by the usually larger than life, but here toned down, Bobcat Goldthwaite who has been fired as a result of innocently questioning a violent promo for the live show which Cross has commissioned. As Frank is dealing with his ghost's Bobcat's character descends into a rather pathetic depression and desperate alcoholism , in the space of a few days, as he tries to come to terms with his unemployment.I really enjoyed John Glover as the slimy Californian exec who is obviously after Cross's job. It kind of underlines the point that though Cross is nasty at least what you see is what you get. Glover's character is completely 2-faced. The character obviously made an impact on the makers of Gremlins 2 because they cast Glover in an almost identical role in that movie a mere two years later.Karen Allen as Carol is convincingly sweet and warm as possibly the only person who can truly help redeem Frank but both her and Robert Mitchum as Frank's boss are somewhat underused and in the case of a legendary talent like Mitchum's you almost wonder why he is in it.Anyway in summation if you like Murray you'll love this. If you don't your enjoyment may suffer but there are still laughs to be had at the send ups of Christmas Network programming ie-. 'Bob Goulet's Cajun Christmas' , 'The Night the Reindeer Died' with Lee Majors and 'Dad Loves Chasing Beaver.' The soundtrack, special effects and make-up are also first rate. However be warned, it is very dark and at times a little sad, particularly in one scene in which Frank re-encounters one of the homeless people he had met earlier at Claire's shelter in a disused boiler room on a typically freezing New York winters night. So if your looking for an uplifting, fun seasonal movie instead of just a good laugh then avoid this. At least up until the end anyway where they all live happily ever after. I would also not be to keen on showing it to very young kids. Its not exactly a horror film but there are enough moments to scare some children and the humour is for the best part more on the adult side.",
    "132": "Christmas movies are fun. I like Christmas movies because they're generally nice, lightweight, enjoyable pieces of fluff with important moralistic messages (\"It's a Wonderful Life,\" \"Scrooge\") or sometimes they're just fun to watch (\"Gremlins,\" \"Home Alone\"). \"Scrooged\" isn't lightweight, cheery, or happy. It's dark, brooding, sort of evil, and it's the only Christmas movie I can think of that seems as if Tim Burton directed it.Am I insulting the film? Heavens, no. I love it. In fact, I'm complimenting it. Instead of repeating old traditions, it's trying something new, and the secret to the film is the way it actually pulls it all off.The plot: Frank Cross is the youngest television station president in recorded history because he knows the people. At least he thinks he does. In reality, he's just a greedy tycoon who gives people bath towels for Christmas -- including his own brother. Cross is a modern day Scrooge, and the movie \"Scrooged\" is a modern reworking of the classic Charles Dickens story. Frank Cross is played by Bill Murray absolutely perfectly. He's cynical, dry, and sarcastic, and doesn't give a darn about anyone else other than himself.So the night before Christmas Eve, Frank is visited by an old business partner -- who has been dead for seven years. (\"I wouldn't have guessed more than three, tops,\" says Frank in his usual sarcastic tone.) His old associate warns Frank to change his ways or he'll end up like himself -- angry, bitter...and dead.Frank doesn't pay any attention to his \"hallucination,\" and continues being his usual self during the festive Christmas holiday -- by ripping off old ladies' cabs and firing Elliot (Bobcat Goldthwait) on Christmas Eve. (Elliot is sort of today's version of Bob Cratchitt.)Frank is putting on a Christmas Eve production of Charles Dickens' immortal classic \"Scrooge\" (what happened to \"A Christmas Carol,\" I wonder?), and in the film's funniest scene, introduces his ad for the program. (It later scares an old woman to death and Frank takes it as a wonderful sign -- controversy is as good as advertising!)The three ghosts do indeed come and haunt Frank. Except Frank is more cynical than Ebenezer Scrooge ever was, and convincing him that Christmas is a season of giving will be hard. (Frank: \"I get it, you're here to show me my past and I'm supposed to get all dully eyed and mushy. Well forget it pal, you got the wrong guy.\")Frank is revisited by an old flame (Karen Allen) and his heart starts to beat once again after years of silence. Frank slowly but surely starts to learn to appreciate Christmas once again, following all of Scrooge's examples. His intern's son, who witnessed his father's murder and hasn't spoken since, is a sort of Tiny Tim, and \"Scrooged\" does indeed follow all of the elements of Charles Dickens' classic. Only it updates the tale, throws in a bunch of cameos, and great acting on Murray's behalf.Frank revisits scenes from his childhood and adulthood first hand with the wacky ghosts as companions. They can't see or hear Frank -- his cab driver ghost tells him that he's in the middle of a rerun.Frank remembers how his father brought him meat for Christmas, how he broke up with his girlfriend over a matter of greed vs. happiness, and how his life was a complete waste. (Ghost: \"Let's face it, Frank, garden slugs got more out of life than you.\" Frank: \"Yeah? Name one!\")It was a matter of time before \"A Christmas Carol,\" or \"Scrooge,\" got a modernized treatment. And it comes out fresh and ingenious, dark and hilarious. The movie owes its entire success to the casting of Bill Murray, whose cynical ways shone through in such early films as \"Stripes\" and \"Ghostbusters,\" and here compliment the film the way no other actor's talent could.Take, for example, the way he can remain unmoved but, at the same time, flippant and sarcastic, towards his boss when he tells Frank that cats and dogs are starting to watch television, and that he thinks Frank should target some advertising at the canine and feline demographic. Frank just stares at his boss as if he's crazy and whispers, \"Call the cops.\"The movie was directed by Richard Donner (\"Lethal Weapon\"), and is one of the films I watch as an annual tradition around Christmas. It's dark and often quite disturbing, and its eerie music adds to the mix. But it helps the film because it makes us see through Frank's eyes. And the outcome is, quite frankly, an instant Christmas classic. This is a film I'll be watching for years, and so far, it's only been getting better every time.",
    "133": "Entertaining and incredibly enjoyable- if overly-loud- Scrooged is a fun new spin on the obvious Christmas classic and may honestly be my favorite adaptation of the story yet. As a huge Bill Murray fan, I certainly went into this movie hoping to enjoy it, and thankfully it did even more than that. The film isn't anything great in terms of acting, but manages to be quite creative when its comes to its storytelling and execution- and obviously very funny from its starpower throughout. It can be a bit loud and annoying at times, but it manages to do so in all good fun- and provides a very grounded take to many people's lives during Christmas which had certainly not been shown very much on screen beforehand. In the end, Scrooged- is an underrated Christmas comedy with tons of joy to be found within it. It may not be perfect, but it manages to be creative and witty all while making the most out of the sum of its parts. And truly what more could you ask for Christmas than an entertaining and hilarious Bill Murray comedy.My Rating: 9.3/10.",
    "134": "1st watched 8/9/2009 - 4 out of 10 (Dir - Richard Donner): OK modern adaptation of Dicken's Christmas Carol starring Bill Murray in the lead role as the bad guy turned good due to hauntings from the ghostly trio. Murray is OK in the role but he really can't carry the range of emotions necessary for us to really believe the story. In this version, he's a television network President who's been ding'd by Christmas pasts and has the \"bah humbug\" attitude towards the sacred day. He fires a worker who disagrees with his programming on Christmas with such unholy titles like \"The Day the reindeer died\", where Lee Majors saves santa and the elves with firepower. This over-the-top stuff is not appropriate, of course, and so the head gives him someone else to help him with the work. He then starts seeing the ghosts and they supposedly are trying to help him see things straight. Murray's character also has a love interest, played by Karen Allen(who does nothing more than show her big brown eyes), to give him more motivation --- I guess. The movie is funny in spots, especially when Carol Kane plays the present ghost as a nice girl with a heavy boot, but the movie doesn't push through to all-out comedy in much other places. It doesn't go towards all-out drama either, so the viewer really doesn't have much to hold onto. The director, Richard Donner, usually does action movies and probably should stick to them, using this as the case for it.",
    "135": "Growing up as kids everybody became accustomed to the Charles Dickens tale \"A Christmas Carol\" thru readings, cartoons, and movies. Well in 1988 a film \"Scrooged\" with Bill Murray showed a new twist and different side to Christmas! \"Scrooged\" is a hilarious take-off of the Dickens classic as the story is told similar with the Christmas ghost of the past, present, and future, but with a modern day theme. Bill Murray is terrific as Frank Cross who is a nasty and cold TV network president who only cares about himself and no one else, he's simply a modern-day Scrooge. On Christmas Eve he's visited by a maniacal New York cab driver who takes him on the journey to the ghost of Christmas past, present, and future. Boy does his future sure look ghoulish, so Frank must change his ways! Overall this twisted and funny tale is just fine to watch every holiday season, not only is Murray's performance good, but the supporting cast from Karen Allen, John Forsythe, Carol Kane, and Alfre Woodard is super. It's nice to see a film that shows that Christmas can be funny and serious, and it's nice to put people first and love everyone. \"Scrooged\" is a fine film especially during the Christmas season, I even own it on DVD.",
    "136": "There are scores of cinematic adaptations of Charles Dickens' Yuletide perennial \"A Christmas Carol\" but this modernization/Americanization has always struck me as being a mostly disparaged one. Since I am now finding myself catching up with several films from the 1980s that I missed out on when they originally came out, and given that we are in full Christmas swing, it was perhaps a given that I was going to give this one a look at this point in time. First of all, I was surprised to see that such a star-studded cast was roped in for what was, essentially, a largely unsympathetic re-reading of a beloved literary classic: Bill Murray (obviously essaying an Ebenezer Scrooge for the TV-fed generation), Karen Allen (as his neglected school sweetheart), John Glover, Bobcat Goldwaithe (as a sacked underling who takes matters into his own hands) and Alfre Woodard comprise the 'newer' talents; Jamie Farr (unrecognizable as Jacob Marley!), John Forsythe, John Houseman (introducing the current TV adaptation of the Dickens story currently being produced by Murray), Buddy Hackett (as TV's Scrooge), Robert Mitchum (as Murray's boss) and Michael J. Pollard (as an ill-fated tramp) make up the veterans' list; David Johansen and the insufferable Carol Kane (form two-thirds of the visiting ghosts; and even Miles Davis (in street musician mode!), Robert Goulet and action hero Lee Majors pop in to make an appearance as themselves!! Although the overlong coda tries very hard to infuse some good cheer into the dismal world-view that we have inhabited until then, I still cut this film some slack for going all the way on the fantasy stuff (the make-up artists received an Oscar nod for their troubles) and holding out somewhat on the soppy material (nevertheless, we do get a mute colored boy in place of the lame Tiny Tim!). Interesting and fairly enjoyable, then, but hardly a success and certainly far from hilarious.",
    "137": "Bill Murray's Scrooged is...good enough. It does not quite reach the heights of \"holiday classic that needs to be re-watched every single year,\" but it does pass for an enjoyable, nontraditional take of the famed Dickens's A Christmas Carol. The first hour is when the movie is at its best with Murray channeling his inner Scrooge to delightful results. From there, it does lose a bit of its footing when more sentimentality is added. The whole speech at the end, while its heart is in its right place, seems a little misplaced. Regardless, there is enough here to like. If anything, it is not a traditional retelling...it is a unique story. The story within the story if that makes any sense. In addition to being a holiday movie, this stands as a scathing indictment of the entertainment industry. More than thirty years after the film was released, I see parallels within this industry. Some things never change.After four years in semi-retirement, Bill Murray returned to the world of acting. Ghostbusters tired him out and took a nice break. I find it interesting that this film's tagline mentioned three ghosts instead of one ghost alluding to Murray's 1984 blockbuster. Sadly, this film had all sorts of production trouble. Murray felt he was rusty when it came to his acting skills, and often butted heads with director Richard Donner (Lethal Weapon, The Goonies). Donner wanted the movie to be louder, louder, and even more louder. Essentially, Murray and Donner had different ideas how the film was to be. The screenwriters were even more angry about the final product. Michael O'Donoghue forever denounced the film. He called his original script a holiday version of It Happened One Night but ultimately most of the script was not used. Despite the calamitous production, this became a cult classic. I certainly enjoyed it to a degree, even if I do not wholeheartedly agree with how the film ended.Frank Cross (Bill Murray) is the obnoxious and downright miserable president of IFC. His latest project is to create a live adaptation of A Christmas Carol for his network. Of course, he makes everyone's life miserable on set including his secretary, Grace Cooley (Alfre Woodward). The network's CEO, Preston Rhinelander (Robert Mitchum) senses something is wrong and hires this gnarly outsider executive, Brice (John Glover) to \"help.\" Now, Frank is about to have his own Dickens moment when he is visited by the three ghosts to show him the meaning of his life. My favorite spirit? The Ghost of Christmas Present (played magnificently by Carol Kane). Loved how she kept physically abusing Murray with her wings.People gave Murray lots of trouble for his performance. Personally, I thought he was great throughout. Even when he becomes a better person, he still did great. The first hour is at his unhinged best when he uses dark humor to great effect. Carol Kane was my favorite ghost as she knocked it out of the part. Karen Allen was good, but not sure if I truly believed her romance with Murray. Mitchum and Glover made a fine pair, but their roles could have been expanded upon. Still, this is a great cast, and it was fun to see everyone in this kind of movie.Overall, Scrooged is a decent holiday movie. It is neither Donner's nor Murray's best, but still should be given a chance. The dark humor will certainly turn some people off, but Murray's deadpan was perfect for the type of humor. Yeah, it can go into mean-spirited mode at times before the sentimentality seeps in. Sadly, I can relate that to a world we live in today. Everyone seems to be channeling their inner Scrooge. The ending is somewhat weak but could have been worse I suppose. Another good thing? The soundtrack! Led by songs from Annie Lennox, at least the film gave us some good songs to add to our holiday collection.My Grade: B.",
    "138": "One of the major problems with adopting Dickens' Christmas Carol into a modern format is that Dickens' verse was written in a very different time, when idealists had very different cultural values. When Dickens wrote the material on which this is based, either the world wasn't as overpopulated as it is today, or people weren't aware of it. Whichever option you prefer, painting people who prefer to place their financial independence over the seeming obligation to breed or marry as empty, soulless ne'er-do-wells was acceptable in those days.Unfortunately for Scrooged, this is not the nineteenth century, and the cultural values of today could not be more different. The world is overflowing with starving people, and speculation is rampant that we don't have the resources for our society to survive another century. To push the kind of values or ideals that Dickens' original story represents, as far as I am concerned, is offensive. I bet Dickens would be utterly modified to hear that I refuse to have children until science is advanced enough that I can edit diseases that run in my family, diabetes being the number one choice, out of their genetic structure.Where Scrooged rescues itself, however, is in the acting. Bill Murray seems to be having the time of his life playing the modern Ebeneezer. In some scenes, he takes hammy overacting to a typically Murray-esque level. When he's confronted by the Christmas ghosts, on the other hand, he plays some of it so deadpan that it adds to the hilarity. Bob Goldthwait gets a brilliant cameo as the just-sacked employee. He's still squealing and almost screaming, but by his standards, this is a refreshingly restrained performance.Another problem with the film is that there seem to be a lot of missed opportunities. The script just seems to play everything not for laughs so much as to get from one scene to the next. Which is a big shame, as the material had so much potential for comedy, especially given its cast. A few wisecracks from Murray is simply not enough effort. Especially not compared to some of the sight gags from previous gems on Murray's resumé. Even Police Academy 4 was funnier overall than this pedestrian exercise, in spite of being made for less than a quarter of the money, and with considerably more questionable talent at that.If you're going to see Scrooged, see it for one reason. Bill Murray's performance is the rock upon which this entire comedy rests. His performance during his meeting with the ghost of Christmas Future, as one-sided as it is, makes one wonder how Bill Murray would perform a meeting with Terry Pratchett's Death. Karen Allen gets a turn here as the obligatory overstated love interest, and she does alright with what she is given. Unfortunately, her character is so underwritten that she only serves as a plot device, which serves to make point one (the \"get yeself hitcheded now, mister\" message) all the more aggravating.I gave Scrooged a seven out of ten. This score contains two bonus points for Bill Murray, and one for Bob Goldthwait. If it weren't for these two taking turns at injecting some genuine comedy, Scrooged would be very difficult to watch.",
    "139": "I guess I should probably lighten up, but I suppose I'm the scrooge here for not enjoying this 'classic' movie. I'm beginning to think its unfair for me to rate comedies, since I'm clearly not a fan of the genre. At least 'Scrooged' wasn't slapstick; I hate slapstick.Bill Murray stars as Television executive Frank Cross, a selfish and arrogant man with very little consideration for his staff, or anyone for that matter. On the night before their big Christmas show, Frank is visited by his ex mentor Lew Hayward - who has been dead for seven years. Lew tells Frank that another three ghosts will be visiting him.One of these ghosts come in the form of a taxi driver, who takes Frank on a journey through time to his past. I actually rather enjoyed this part of the movie and made me wish I could go back to watch myself when I was just a child - now from an adult's perspective. This part of the film was a rather emotional journey. (There's also a moment during the third act involving one of the homeless characters which stirred my emotions.)The love interest comes courtesy of Claire Phillips (Karen Allen) who works at a homeless shelter. Claire and Frank used to date when they were much younger and when Frank was just starting at the television studio. Now, as an executive, he has no time for Claire.Yes, there are many (valuable) lessons here, but in general the film suffers from over-acting, and silly events to the point where it actually becomes weird. Sort of ironic, but most of the times I don't find comedies funny. Maybe I'm just too serious, who knows? This is not one of the movies I will be watching every year around Christmas time...or ever again.",
    "140": "Scrooged, born of the unimaginative minds of untalented producers, attempts to render a classic into a modern adaptation (for originality). Clearly setting up a parallel between the classic story and the movie's story, the development is not lost on the viewer and could have been admirable, if it were not so obvious and actually contributed to the overall product. However, soon after the first minutes of the movie, the supposed ingenuity was lost and replaced with the typical, formulaic comedy movie starring a bumbling businessman, a hopeless love, and the newly recruited executive. While there are a few elicited laughs, the comedy is speckled with monologues, hopelessness, and anger, turning a Murray comedy into a drama. Maybe Donner was shooting for something like Fargo (1996), except that he forgot how to make a film, instead using the wrong movie mold straight off the shelf. The acting is typical of your typical comedy: typical, reminiscent of Happy Gilmore (1996). Everything was typical, possibly excluding the set and artistic direction aspect with the ghost costumes and TV sets. Unfortunately, the only question this film made me ask was: Why did I watch this film? Technically, the movie attacked the morality of corrupt and greedy businessmen, offering the resolution of living a humanitarian lifestyle, but it was simply adapted from a story as well-known as the Bible. The framing of the story by the writers was decent due to its parallelism to the adapted story and well-structured flashbacks, but they seemed to have forgotten their knock-knock joke book at home when they wrote the script. At least, Murray helped a bit with his classic improvisations. Should anyone watch this movie the day after they watched it the first time, it would be a completely new experience because they won't be able to remember anything of this unmemorable movie. Scrooge could remember his humanity, but Scrooged won't be remembered at all.",
    "141": "This movie stared off really good, I found some scenes very funny at the start of the movie.I was really into the movie, As the movies goes, it kinda of loses the magic from the start of the movie, I didn't find second part of the movie funny at all or that good. I was bored in some places , they really long speech at the end, Drag on for far to long. This movie did have some very odd scenes, which scare some kids I think! , I found I found that were some really silly stuff that may have be funny back then but just felt to Baby-ish The acting from Billy was very good as was rest of the cast and effect were very good in this movieI going to give this movie 6 out of 10",
    "142": "The premise for this movie was a good one. Have some fun, get some laughs and do a spoof with a modern adaptation of \"A Christmas Carol.\" \"Scrooged\" has a good cast for the job, the makeup is excellent, and Bill Murray mostly carries the film. That's because the screenplay isn't very good. Still, I might have scored it a notch higher but for the crass and crudeness of the script and some of the design. Debit those items and work on the script for more laughs and this film could score well. The funny parts are when Murray's character, Frank Cross, slips in and out of his trips with the ghosts, only to find himself in the middle of the stage set or rehearsal or broadcasting, and fouling it up. His change doesn't seem very believable. And the ending is a sappy effort to bring the story to happy conclusion. If one wants a lot of laughs for a Christmas season movie, try \"Christmas Vacation\" 1989, \"Christmas in Connecticut\" 1945, or \"Christmas with the Kranks\" 2004. Those take a little bit of thinking, but they are clean and very funny.",
    "143": "There are scores of cinematic adaptations of Charles Dickens' Yuletide perennial \"A Christmas Carol\" but this modernization/Americanization has always struck me as being a mostly disparaged one. Since I am now finding myself catching up with several films from the 1980s that I missed out on when they originally came out, and given that we are in full Christmas swing, it was perhaps a given that I was going to give this one a look at this point in time. First of all, I was surprised to see that such a star-studded cast was roped in for what was, essentially, a largely unsympathetic re-reading of a beloved literary classic: Bill Murray (obviously essaying an Ebenezer Scrooge for the TV-fed generation), Karen Allen (as his neglected school sweetheart), John Glover, Bobcat Goldwaithe (as a sacked underling who takes matters into his own hands) and Alfre Woodard comprise the 'newer' talents; Jamie Farr (unrecognizable as Jacob Marley!), John Forsythe, John Houseman (introducing the current TV adaptation of the Dickens story currently being produced by Murray), Buddy Hackett (as TV's Scrooge), Robert Mitchum (as Murray's boss) and Michael J. Pollard (as an ill-fated tramp) make up the veterans' list; David Johansen and the insufferable Carol Kane (form two-thirds of the visiting ghosts; and even Miles Davis (in street musician mode!), Robert Goulet and action hero Lee Majors pop in to make an appearance as themselves!! Although the overlong coda tries very hard to infuse some good cheer into the dismal world-view that we have inhabited until then, I still cut this film some slack for going all the way on the fantasy stuff (the make-up artists received an Oscar nod for their troubles) and holding out somewhat on the soppy material (nevertheless, we do get a mute colored boy in place of the lame Tiny Tim!). Interesting and fairly enjoyable, then, but hardly a success and certainly far from hilarious.",
    "144": "Bill Murray's Scrooged is...good enough. It does not quite reach the heights of \"holiday classic that needs to be re-watched every single year,\" but it does pass for an enjoyable, nontraditional take of the famed Dickens's A Christmas Carol. The first hour is when the movie is at its best with Murray channeling his inner Scrooge to delightful results. From there, it does lose a bit of its footing when more sentimentality is added. The whole speech at the end, while its heart is in its right place, seems a little misplaced. Regardless, there is enough here to like. If anything, it is not a traditional retelling...it is a unique story. The story within the story if that makes any sense. In addition to being a holiday movie, this stands as a scathing indictment of the entertainment industry. More than thirty years after the film was released, I see parallels within this industry. Some things never change.After four years in semi-retirement, Bill Murray returned to the world of acting. Ghostbusters tired him out and took a nice break. I find it interesting that this film's tagline mentioned three ghosts instead of one ghost alluding to Murray's 1984 blockbuster. Sadly, this film had all sorts of production trouble. Murray felt he was rusty when it came to his acting skills, and often butted heads with director Richard Donner (Lethal Weapon, The Goonies). Donner wanted the movie to be louder, louder, and even more louder. Essentially, Murray and Donner had different ideas how the film was to be. The screenwriters were even more angry about the final product. Michael O'Donoghue forever denounced the film. He called his original script a holiday version of It Happened One Night but ultimately most of the script was not used. Despite the calamitous production, this became a cult classic. I certainly enjoyed it to a degree, even if I do not wholeheartedly agree with how the film ended.Frank Cross (Bill Murray) is the obnoxious and downright miserable president of IFC. His latest project is to create a live adaptation of A Christmas Carol for his network. Of course, he makes everyone's life miserable on set including his secretary, Grace Cooley (Alfre Woodward). The network's CEO, Preston Rhinelander (Robert Mitchum) senses something is wrong and hires this gnarly outsider executive, Brice (John Glover) to \"help.\" Now, Frank is about to have his own Dickens moment when he is visited by the three ghosts to show him the meaning of his life. My favorite spirit? The Ghost of Christmas Present (played magnificently by Carol Kane). Loved how she kept physically abusing Murray with her wings.People gave Murray lots of trouble for his performance. Personally, I thought he was great throughout. Even when he becomes a better person, he still did great. The first hour is at his unhinged best when he uses dark humor to great effect. Carol Kane was my favorite ghost as she knocked it out of the part. Karen Allen was good, but not sure if I truly believed her romance with Murray. Mitchum and Glover made a fine pair, but their roles could have been expanded upon. Still, this is a great cast, and it was fun to see everyone in this kind of movie.Overall, Scrooged is a decent holiday movie. It is neither Donner's nor Murray's best, but still should be given a chance. The dark humor will certainly turn some people off, but Murray's deadpan was perfect for the type of humor. Yeah, it can go into mean-spirited mode at times before the sentimentality seeps in. Sadly, I can relate that to a world we live in today. Everyone seems to be channeling their inner Scrooge. The ending is somewhat weak but could have been worse I suppose. Another good thing? The soundtrack! Led by songs from Annie Lennox, at least the film gave us some good songs to add to our holiday collection.My Grade: B.",
    "145": "One of the major problems with adopting Dickens' Christmas Carol into a modern format is that Dickens' verse was written in a very different time, when idealists had very different cultural values. When Dickens wrote the material on which this is based, either the world wasn't as overpopulated as it is today, or people weren't aware of it. Whichever option you prefer, painting people who prefer to place their financial independence over the seeming obligation to breed or marry as empty, soulless ne'er-do-wells was acceptable in those days.Unfortunately for Scrooged, this is not the nineteenth century, and the cultural values of today could not be more different. The world is overflowing with starving people, and speculation is rampant that we don't have the resources for our society to survive another century. To push the kind of values or ideals that Dickens' original story represents, as far as I am concerned, is offensive. I bet Dickens would be utterly modified to hear that I refuse to have children until science is advanced enough that I can edit diseases that run in my family, diabetes being the number one choice, out of their genetic structure.Where Scrooged rescues itself, however, is in the acting. Bill Murray seems to be having the time of his life playing the modern Ebeneezer. In some scenes, he takes hammy overacting to a typically Murray-esque level. When he's confronted by the Christmas ghosts, on the other hand, he plays some of it so deadpan that it adds to the hilarity. Bob Goldthwait gets a brilliant cameo as the just-sacked employee. He's still squealing and almost screaming, but by his standards, this is a refreshingly restrained performance.Another problem with the film is that there seem to be a lot of missed opportunities. The script just seems to play everything not for laughs so much as to get from one scene to the next. Which is a big shame, as the material had so much potential for comedy, especially given its cast. A few wisecracks from Murray is simply not enough effort. Especially not compared to some of the sight gags from previous gems on Murray's resumé. Even Police Academy 4 was funnier overall than this pedestrian exercise, in spite of being made for less than a quarter of the money, and with considerably more questionable talent at that.If you're going to see Scrooged, see it for one reason. Bill Murray's performance is the rock upon which this entire comedy rests. His performance during his meeting with the ghost of Christmas Future, as one-sided as it is, makes one wonder how Bill Murray would perform a meeting with Terry Pratchett's Death. Karen Allen gets a turn here as the obligatory overstated love interest, and she does alright with what she is given. Unfortunately, her character is so underwritten that she only serves as a plot device, which serves to make point one (the \"get yeself hitcheded now, mister\" message) all the more aggravating.I gave Scrooged a seven out of ten. This score contains two bonus points for Bill Murray, and one for Bob Goldthwait. If it weren't for these two taking turns at injecting some genuine comedy, Scrooged would be very difficult to watch.",
    "146": "I guess I should probably lighten up, but I suppose I'm the scrooge here for not enjoying this 'classic' movie. I'm beginning to think its unfair for me to rate comedies, since I'm clearly not a fan of the genre. At least 'Scrooged' wasn't slapstick; I hate slapstick.Bill Murray stars as Television executive Frank Cross, a selfish and arrogant man with very little consideration for his staff, or anyone for that matter. On the night before their big Christmas show, Frank is visited by his ex mentor Lew Hayward - who has been dead for seven years. Lew tells Frank that another three ghosts will be visiting him.One of these ghosts come in the form of a taxi driver, who takes Frank on a journey through time to his past. I actually rather enjoyed this part of the movie and made me wish I could go back to watch myself when I was just a child - now from an adult's perspective. This part of the film was a rather emotional journey. (There's also a moment during the third act involving one of the homeless characters which stirred my emotions.)The love interest comes courtesy of Claire Phillips (Karen Allen) who works at a homeless shelter. Claire and Frank used to date when they were much younger and when Frank was just starting at the television studio. Now, as an executive, he has no time for Claire.Yes, there are many (valuable) lessons here, but in general the film suffers from over-acting, and silly events to the point where it actually becomes weird. Sort of ironic, but most of the times I don't find comedies funny. Maybe I'm just too serious, who knows? This is not one of the movies I will be watching every year around Christmas time...or ever again.",
    "147": "Scrooged, born of the unimaginative minds of untalented producers, attempts to render a classic into a modern adaptation (for originality). Clearly setting up a parallel between the classic story and the movie's story, the development is not lost on the viewer and could have been admirable, if it were not so obvious and actually contributed to the overall product. However, soon after the first minutes of the movie, the supposed ingenuity was lost and replaced with the typical, formulaic comedy movie starring a bumbling businessman, a hopeless love, and the newly recruited executive. While there are a few elicited laughs, the comedy is speckled with monologues, hopelessness, and anger, turning a Murray comedy into a drama. Maybe Donner was shooting for something like Fargo (1996), except that he forgot how to make a film, instead using the wrong movie mold straight off the shelf. The acting is typical of your typical comedy: typical, reminiscent of Happy Gilmore (1996). Everything was typical, possibly excluding the set and artistic direction aspect with the ghost costumes and TV sets. Unfortunately, the only question this film made me ask was: Why did I watch this film? Technically, the movie attacked the morality of corrupt and greedy businessmen, offering the resolution of living a humanitarian lifestyle, but it was simply adapted from a story as well-known as the Bible. The framing of the story by the writers was decent due to its parallelism to the adapted story and well-structured flashbacks, but they seemed to have forgotten their knock-knock joke book at home when they wrote the script. At least, Murray helped a bit with his classic improvisations. Should anyone watch this movie the day after they watched it the first time, it would be a completely new experience because they won't be able to remember anything of this unmemorable movie. Scrooge could remember his humanity, but Scrooged won't be remembered at all.",
    "148": "This movie stared off really good, I found some scenes very funny at the start of the movie.I was really into the movie, As the movies goes, it kinda of loses the magic from the start of the movie, I didn't find second part of the movie funny at all or that good. I was bored in some places , they really long speech at the end, Drag on for far to long. This movie did have some very odd scenes, which scare some kids I think! , I found I found that were some really silly stuff that may have be funny back then but just felt to Baby-ish The acting from Billy was very good as was rest of the cast and effect were very good in this movieI going to give this movie 6 out of 10",
    "149": "The premise for this movie was a good one. Have some fun, get some laughs and do a spoof with a modern adaptation of \"A Christmas Carol.\" \"Scrooged\" has a good cast for the job, the makeup is excellent, and Bill Murray mostly carries the film. That's because the screenplay isn't very good. Still, I might have scored it a notch higher but for the crass and crudeness of the script and some of the design. Debit those items and work on the script for more laughs and this film could score well. The funny parts are when Murray's character, Frank Cross, slips in and out of his trips with the ghosts, only to find himself in the middle of the stage set or rehearsal or broadcasting, and fouling it up. His change doesn't seem very believable. And the ending is a sappy effort to bring the story to happy conclusion. If one wants a lot of laughs for a Christmas season movie, try \"Christmas Vacation\" 1989, \"Christmas in Connecticut\" 1945, or \"Christmas with the Kranks\" 2004. Those take a little bit of thinking, but they are clean and very funny."
}