{
    "0": "I have watched this movie countless times over the years and it remains my all-time favorite.. Even now I cannot watch the last scene -  when General Waverley enters the dining room and sees his old troop - without becoming teary-eyed.  It is a great shame that Hollywood no longer makes movies of this quality .",
    "1": "I know, we've heard it all before, how the film, Holiday Inn is superior to this offering, but you'd never convince me of that!  I adore this film, it's fun, innocent, lively, has wonderful tunes and a top-notch cast.  My holiday viewing will never be complete until I've watched this film at least a half dozen times and probably more during the holiday season.  It's one of those 'feel good films' and this Christmas fanatic highly recommends settling in with some good snacks and simply enjoying yourself and this true holiday classic.  The DVD is a must-have, as it offers a wonderful commentary with the late-great Rosemary Clooney.",
    "2": "White Christmas is one of those movies you can just enjoy without having to think about why the characters act the way they do.  The plot is very thin, and seems to be written just to hold the musical numbers together, but it makes for a very enjoyable movie indeed.  Viewing this film has become a holiday tradition in my family, and it is great fun to quote memorable lines and sing along with Bing, Danny, Vera-Ellen, and of course, the incomparable Rosemary Clooney. We have a theater here in Austin that regularly shows classic films, and the year they screened White Christmas, there was a packed house, and everyone sang along with every song and yelled out lines, sort of like Rocky Horror Picture Show without the dressing up.  White Christmas is just a fun movie, and I highly recommend it for holiday viewing.  The Irving Berlin songs, the dance numbers, and yes, the \"schmaltz\" are just the right combination to put even the Grinchiest person in the Christmas spirit.",
    "3": "At the ripe young age of 28, I enjoy this movie more and more as the years go by. While it honestly has very few Christmasy scenes, no movie puts me in the Christmas mood more or faster than this one. For the humbugs that don't like it, they simply don't get it. It's heartwarming and delightful from beginning to end. Though somewhat cheesy, for a true fan, the cheese is just as good as the bread on either end. I personally fell in love with it because I'm a huge Danny Kaye fan, but the entire cast is wonderful. I grew up with movies like this thanks to my mother and grandmother, and I guarantee my kids will do the same. If you haven't seen it, do so. If you love it, grab some cocoa and join the rest of us in front the big screen. If you don't, then shame on you and a Merry Christmas anyway.",
    "4": "I would call myself more of a \"Holiday Inn\" than a \"White Christmas\" fan. Bing, Fred, the great dancing and the gift of the song White Christmas to a war weary world. However, last Christmas Eve my 13-year-old daughter and I had \"White Christmas\" on the TV as we wrapped last minute gifts. My daughter commented \"I think White Christmas is the best Christmas movie because there are no little kids, no angels or miracles. It's just the story of four people (the entertainers) trying to do something nice for somebody (the Major)\".I'm still more of a \"Holiday Inn\" fan, but now have a new fondness for \"White Christmas\".",
    "5": "WHITE Christmas is one of the best holiday movies not to mention musicals to come out of Hollywood in the 1950's. It has great performances by the 4 leads (Bing Crosby, Danny Kaye, Rosemary Clooney, Vera Ellen) who act, sing and dance with effortless aplomb. Crosby and Kaye have some amazing comic set pieces. It also has Mary Wickes in one of her signature comic supporting roles. Criticism of the acting in this film is really off base--the movie requires a certain style and the performances reflect it perfectly. This is the kind of film that could never be made now and it contains all the genuine pleasures of the movie musical as developed by Hollywood. There are several wonderful scenes set in \"supper clubs\" which evoke a bygone era. It has nothing to do with \"real life\" (what musicals do?) however it is completely charming, entertaining and satisfying. If you haven't seen it--I guarantee you will want to watch it every holiday season after you do.",
    "6": "Story: original, sentimental, wonderful.Songs: memorable, melodic, fun.Vera-Ellen's legs: COLOSSALLY PHANTASMAGORICALLY GORGEOUS. I was riveted from the moment she does her first twirl. And the early number of \"The Best Things Happen While You're Dancing\" features quite possibly the first pole dancing routine ever filmed in Hollywood. Amazing, simply amazing stuff. I can't believe I had never heard of Ms. Vera-Ellen before, and I can't believe her career was so short (barely 10 years long). You must see her in action. You simply must.That is all you need to know.",
    "7": "Legendary Michael Curtiz directs this showcase of talent in an attempt to capitalize on the song \"White Christmas\" that first appeared in the 1942 classic HOLIDAY INN. Quite innocent and evocative of the early 50's mindset. One of those let's save the day by putting on a show. A song and dance team will help keep their former commanding officer's(Dean Jagger)Vermont inn alive. A real talented cast that includes Bing Crosby, Danny Kaye, Rosemary Clooney, Vera-Ellen, John Brascia and Anne Whitefield. How can you have Bing Crosby and not hear his \"White Christmas\"? Other memorable tunes: \"The Best Things Happen When You're Dancing\", \"Count Your Blessing Instead of Sheep\" and \"Snow\".Note: Curtiz four years later would direct Jagger in the Elvis Presley classic KING CREOLE.",
    "8": "This is my all time, favourite, Christmas movie. Not to be confused with HOLIDAY INN (which is also a favourite) just because it has Bing Crosby and the music of Irving Berlin (and a revamp of the set of the Inn), it has a different story line and a different dynamic. HOLIDAY INN was a song (Berlin/Crosby) and dance (Astaire) production, WHITE CHRISTMAS is both of those items (sub in Vera-Ellen and some outstanding male dance partners) but also has the pure tones of Rosemary Clooney, the comedic genius of Danny Kaye and Mary Wickes, stunning ensemble choreography, a beautiful love story (or 2), a heartwarming premise and the advent of VistaVision, which was an innovation in colour and clarity in film (a fledgling technology that was a precursor for today's HD quality). I whole-heartedly give this film a 10 (perfection) out of 10. {Romantic Musical Comedy}",
    "9": "This is an Irving Berlin musical featuring Bing Crosby and Rosemary Clooney. There will be spoilers ahead:This musical is designed as a vehicle for the music of Irving Berlin, starring Bing Crosby and Danny Kaye as old Army buddies, with Kaye saving Crosby's life during the war. The opening musical number takes place during the war in their unit, at the company Christmas show, to celebrate their commander, who's being rotated out of command.Flash forward and the two are now prominent in show business, with a company of their own. The sisters (Rosemary Clooney and Vera-Ellen) of one of the men from their unit contrive to get an audition of sorts when Vera-Ellen sends them a note telling them of their act at a club. Through a series of improbable events (the plot is like cotton candy-sweet but insubstantial) the four wind up on a train together and headed to the same inn in Vermont.The inn is owned by the former commander (played well by Dean Jagger) and the inn isn't doing well, given that there's no snow. Again, through a series of plot contrivances, a show is planned for the inn, with an invitation to the men of their old unit, at least those who can do so, to come up to Vermont to express their support for their old commander.As this is a romantic comedy, the quartet pairs off, Crosby with Clooney and Kaye with Vera-Ellen. The course isn't smooth, but true love wins out in the end. There's a Hollywood ending and all's well in the end.None of that really matters, because the chemistry between the leads is fantastic. Danny Kaye and Vera-Ellen look perfect together in \"The Best Things Happen While You're Dancing\", Crosby and Kaye work well together and Crosby and Clooney are perfect as a couple.This film is available on disc and is well worth watching. Recommended.",
    "10": "It seems every Christmas this is one movie I must watch, and never tire of it. The cast I thought was mismatched, Danny Kaye was a poor substitute for Donald O'Connor, yet he makes the character he plays so likeable that you can't help but be drawn to his character. Danny Kaye and Bing Crosby dressed as girls has to be seen to be believed. They make the \" sisters \" song take on a whole other meaning.This is a picture that shows the magic of Christmas. The last scene with the general brings a tear to the eye. Once again this proves that musicals leave you with that special feeling.",
    "11": "\"White Christmas\" has to be one of the most wonderful holiday musical films ever made. Bing Crosby and Rosemary Clooney give great performances and Crosby's \"White Christmas\" is the best song in the film. After watching this you'll feel a great amount of holiday spirit. The snow, the songs, the music. You just get a good feeling. Watch it, your holiday will brighten. :-)",
    "12": "Quiet honestly this movie gets better with each watch. The chemistry of the cast is great, the choreography is excellent, and the songs are catchy and classic. Not only is it a great Christmas movie but it does a great service to honoring our armed services and veteran soldiers.When you watch classics like this you have to keep in mind the time in which it was produced. It's ridiculous reading people critiquing this movie calling it formulaic, when it's one of the movies that originated the formula.",
    "13": "I have watched White Christmas about 100 times, the reason is Vera Ellen .I have never in the thousands of movies i have seen,witnessed a dancer of Vera Ellens ability. Vera mesmerises me every time i see the movie.Don't just take my word for it,watch White Christmas a few times and watch Vera Dance i guarantee you will never witness a dancer male or female that comes close to Veras excellence.Danny Kaye is superb Bing sings with so much ease ,with that fabulous voice.Rosemary Clooney looks gorgeous and her voice is a thrill to listen too.I shall watch White Christmas many times in the future and Vera Ellen will continue to be the star as far as i am concerned.",
    "14": "This is one of my all time Christmas movies. Sure it's sugary sweet, it has some continuity problems. Yet the joy of the season, the military story line and the Crosby-Kaye duo are spot on. I always smile, cry and giggle during the movie. Never gets old and despite growing old and cynical, it still moves me.",
    "15": "This film is good, clean entertainment for the holidays. Not just a story of boy meet girl, fall in love etc., this film focuses on service and good holiday spirit. There is lots of great singing and some good dancing. Reminicent of the holiday hustle and bustle. This is truly a classic film. On top of that, with legends like Bing Crosby and Danny Kaye involved, there's bound to be great stuff.",
    "16": "Love all the music, funny acts and amazing dances. All wrapped up in a cute Christmas story. This is our tradition to watch this movie every Christmas.",
    "17": "White Christmas is the epitome of a true holiday classic. Great acting, a good storyline, and wonderful singing. The songs are absolute classics and you can't help but sing along. The acting is good and there is chemistry between the whole cast. Absolutely stunning sets and outfits. A true Christmas classic.",
    "18": "I am not an expert film critic like so many on here, but I just have to go with my heart. I absolutely just adore this movie!! I love the songs, dancing, and heart of this picture. I am very picky with my dance and singing movies. Give me West Side Story and White Christmas. This is just my opinion.",
    "19": "I suddenly decided to work this epic Christmas classic into my routine this year because I had never seen it. I HATE reviewing classics because who am I to say whether it is good or not because just out of sheer respect and longevity, obviously timeless classics are so for a reason. So I am strictly going by how it made me feel. White Christmas was cute, and it was fun and it certainly has plenty of song and dance routines for those 50's and 60's dance movie fans. The problem is that I just found it sort of ho hum. It never really takes off, I found some of the performances rather sluggish and certainly the pacing for the movie was sluggish. It did not need to be two hours long by any stretch and it just felt like it went on and on with the same concept. Secondly I don't think this really had to be a Christmas movie. Obviously it was built off the insane success of the Christmas song classic \"White Christmas\" but the entire film feels like Christmas is an afterthought and almost forced into the story. It would have made a much better comedy-romance without the Christmas theme.Bing Crosby is a brilliant singer and this is the first time I've seen him acting and honestly I didn't think much. I thought his performance was wooden and monotone a lot of the time until he sang which of course is amazing. The romance focusing on his character felt lost because he just looked so unimpressed most of the time and just really not the acting type I think. He looked even worse next to Danny Kaye who is nothing short of brilliant as the boisterous and loud Phil Davis. Kaye steals every scene between them and is just more comfortable and so much more charismatic on screen. He had some edge about him and some machismo but delivered his lines perfectly. Legendary singer Rosemary Clooney and Vera-Ellen are the sisters that capture the two guys' hearts. They are good, but I just didn't feel like they were great. The chemistry between the four of them was just okay although I thought Kaye and Ellen had better chemistry than the other two. Dean Jagger and Mary Wickes play decent roles but quite small, definitely supporting characters.The dance numbers are splashy and elaborate and fun to watch. However, after the first two you'll feel like you've seen it all before. Even some of the songs just feel like the same thing over and over again. The ending of the film was actually what really got me. It was a great ending and almost brought me to tears which is pretty good considering I thought the rest of the film was just all around average. I love musicals and this one just felt like it didn't try hard enough. But then I have to repeat what do I know because this is a timeless classic that has stood the test of time. I know that this won't make a permanent spot in my Holiday rotation, it just didn't impress me but I would never presume to tell anyone not to watch a classic, it simply didn't impress me at all. 6/10",
    "20": "This is one of the most underrated Christmas movies i think. It has classic songs, actors, and plot (though some things don't really fit, but that is in most movies in the 40s and 50s) I think this movie should be religiously watched every Christmas. The acting is wonderful, Bing Crosby and Rosemary Clooney are amazing. The comedy is great with Danny Kaye, and Vera Ellen brings great dancing to the picture. All the music is amazing, my favorite song is the Mandy, with its great dancing and funny jokes. The costumes are fabulous, with vibrant colors. Overall this movie is pretty much amazing, everything is just perfect when your in the Christmas mood.",
    "21": "The story opens during WWII, as two soldiers are putting on a Christmas Eve show near enemy lines. Flash forward a few years and the two soldiers (Bing Crosby, Danny Kaye) are now successful Broadway entertainers. They fall for a nightclub sister-act (Rosemary Clooney, Vera-Ellen) and the foursome spend Christmas in Vermont at an inn that just happens to be owned by their beloved old colonel (Dean Jagger) who's down on his luck.This wonderful musical is my favorite Christmas movie; it's sentimental and sweet and has four hugely talented stars. The Irving Berlin songs are upbeat and lovely and, of course, the classic \"White Christmas\" tugs at your heart. Bing plays the sensible, hard-working guy who funnyman Danny is always trying to marry off. Rosemary is a sensitive singer and Vera-Ellen is a dazzling dancer. They have such a good time together that viewers can't help but be carried away by the pure joy of it all.This movie is firmly-rooted in the fifties, purely G-rated and many call it corny, but I love this kind of movie. I can't count the number of times I've seen and yet it's never gotten old for me. The actors are beautiful, the romance is innocent, and the happy-ever-after finale with everyone dressed in red and white amid gently falling snow is unforgettable. If you like movies the way they used to be made, you'll love \"White Christmas.\"",
    "22": "There isn't much to say about this movie that hasn't already been said by many other fans, but the gentle humor and wonderful dance numbers, the engaging personalities of the stars, and the feel good storyline make this a true classic. The four main players interact so easily and comfortably with each other that their friendships and romances seem believable and very appealing. Who can fail to laugh at the engagement scene, when a seductive Vera Ellen puts the moves on a terrified Danny Kaye, or not choke up when the retired General enters the dining room to thunderous applause, and tries not to shed a tear of gratitude when he sees his former troops reunited to honor him?In a more cynical world of today, this movie is a heart warming tribute to sentiment and sincerity, beautifully played by all the cast.A wonderful movie to be enjoyed every Christmas, year after year.",
    "23": "One of the hokiest and most dated musicals of all time, this is also one of the most watched. Why? First, there are the songs by Irving Berlin, starting with the title song, which by 1954 was already a standard, having been introduced a dozen years earlier in \"Holiday Inn.\" Then there is the great voice of Rosemary Clooney, who, as was the practice in 1950s films, is paired with Bing Crosby, a love interest way old enough to be her father, and their break-up/make-up scenes are just tedious. None of it really matters; it's all just a trick to get everybody to sing and dance and clown around. Danny Kaye, who can be really cloying on screen, is at his best in this film, all tongue-in-cheek. His mockery of the song \"Sisters\" with Crosby is hilarious. Dean Jagger's portrayal of the General has probably done as much for Memorial Day as anything this film has done for Christmas. A real time capsule. --from Musicals on the Silver Screen, American Library Association, 2013",
    "24": "Yes I am a simple simple man, but it's not christmas with out this movie.\nThe dialogue is smart, the situations are convenient, but so masterly done with Irving Berlins songs, and movie stars from the golden age in Hollywood it is great.\nAnd when Phil Davis and Judy Haynes dance its part of American cinema iconography.",
    "25": "\"White Christmas\" is truly one of the most underrated musicals of all time. Although it is really not that unique for a film or a musical of its type, I found it completely enjoyable nonetheless, even more so than most musicals I've seen. By this time, the song \"White Christmas\" had become so popular that a musical about it would simply have to be made. This film is about as funny as an musical of its type, with scenes such as Bing Crosby and Danny Kaye dressing up as women to fill in for the \"Sisters\" act. I love the music as well. The title song is important of course, though the film includes one of my personal favorite songs, \"Count Your Blessings Instead of Sheep,\" a meaningful, inspiring, and beautiful song that is unforgettable. It's a great holiday film that will make you feel good, guaranteed. It's touching, fun, and nearly perfect.***1/2 out of ****",
    "26": "I remember when the Christmas season came after Thanksgiving and the networks all began showing Christmas films especially White Christmas and It's A Wonderful Life. Anyway, I liked White Christmas but only for the ending. It was kind heartwarming and sentimental at times but still you can't beat this cast featuring Bing Crosby, Danny Kaye, Rosemary Clooney, and Vera Ellen. Of course, there is romance in the air and a plot to help an old friend out. The film is dated but still beautiful in color and should be seen to be appreciated. Stay till the end of the film when you see those four wonderful stars of yesterday sing White Christmas with the white snow in the background. It's worth watching during the holiday season. Rosemary Clooney used to say that Bing would see her on Christmas Eve. You think they're all in heaven serenading God and the angels with White Christmas.",
    "27": "I have been watching White Christmas for as long as my memory goes back. Thanks to my music-loving mother, I grew up watching wonderful Hollywood musicals.White Christmas is filled with Irving Berlin songs which are magnificently performed by Bing Crosby, Danny Kaye, and Rosemary Clooney(Vera Ellen lipsynched).  Perhaps even more wonderful than the songs themselves, is the production numbers.  Vera Ellen and Danny Kaye make a wonderful couple and dance so well together.  Everybody should see the movie simply for \"The Best Things Happen While You'r Dancing\" scene.  This is quite possibly the most beautiful scene ever filmed, in my opinion.  Another thing about the film that I love is the costumes.  They are all beautfully made and worn.\nWhite Christmas is not only the essential Holiday movie, but also essential to film history in general.",
    "28": "WHITE CHRISTMAS is a super duper holiday family movie that will grow on you. The song, alone is now legend. After decades of watching this, it is in the category of MUST SEE. Bing Crosby and Rosemary Clooney are a stand-out, and sort of an updated pairing of Fred Astaire and Ginger Rogers, at least as far as the storyline goes; break up to makeup again! Nice! Rosie looks marvelous, particularly in an early scene, dressed in classic black against a purple/pink backdrop and on it goes and goes. This can also be recommended as a wardrobe showcase! Old soldiers Danny Kaye and Bing turn up at their former commanders (Dean Jagger) holiday inn hotel and the rest is magic and snow. A fun movie to put up the Christmas tree to, and one of the MEGA movie hits of the 1950s! (and still making money on dvd!) It was also a promotion of sorts for Bing and Rosemary who were doing a radio show at the time, recording together ( YOU CAME A LONG WAY FROM ST. LOUIE!) and on tour. Those were the days. Don't miss Mary Wickes and Jagger looks sharp all dressed up to meet his old crew.",
    "29": "This movie seems like a sort of excuse to give lots of singing and dancing opportunities to its various superstars, but underlying the merriment is a bit of pathos. It starts on a battlefield in Europe in the winter of 1944, and a soldier with a beautiful singing voice gently voices a prayer for a white Christmas that perhaps says more about the state of mind of the troops than any terrifyingly violent action film could say. The movie ends up being about finding love, self and some measure of contentment in the period after the war, and for that it packs more feeling than it first appears. For all of its clunky moments, it helps us find a meaningful Christmas.",
    "30": "There's a reason why some Christmas films become classics, watched every year without fail.This film is a prime example of that. Well written, well choreographed and performed it's a joy from start to finish.",
    "31": "And I really mean that. I watch this film almost every Christmas, and let's face it -- Bing is the focus of the film -- and he really was never better. For one thing, watch his face carefully during some of the musical numbers...he's visibly having fun. I'd have to say that at least in terms of film, he was at his absolute peak here, doing rather nicely in the dance numbers, and of course in the singing department.But aside from that, this is one of the best musicals...and it didn't come out of MGM. Paramount did this one up big! The Technicolor and Vista Vision (the first of the latter) are stunning.Despite having a fairly large cast, there are really only 6 main character. Bing and Danny Kaye play a song and dance team that headlined after the end of WWII, but it's especially interesting to see how nicely and sentimentally the battleground scene was filmed. Danny feels Bing is lonely, and is intent to match him up with a woman. Along comes the sister-singers -- Rosemary Clooney and Vera-Ellen (although in reality, Vera-Ellen's numbers are dubbed, in part by Clooney herself!) As with many romantic comedies there are a number of misunderstandings, taking the story from Florida to the winter wonderland of Vermont...where there's now snow. Where they bump into the boy's old General -- Dean Jagger -- now a floundering lodge owner. And his nemesis is housekeeper Mary Wickes.Bing was wonderful in movies, and especially so here. I seriously dislike Danny Kaye as a performer, but I do admire this performance, including his wonderful dance number with Vera-Ellen (\"The Best Things Happen While You're Dancing\"). Rosemary Clooney was delightful in her somewhat spiteful character, but it all ends in romance, with a few spats in between. Her specialty number \"Love, You Didn't Do Right By Me\" is terrific. Jagger is at his most ingratiating here, and it was in this general time period that he did some of his best supporting-actor work. Vera-Ellen's dancing is stupendous, and it's easy to see why some consider her the finest of the female dancers.And then, of course, there are the Irving Berlin songs: \"White Christmas\" (which opens and closes the film), \"The Old Man\" (a sentimentally wonderful tribute to the general by Crosby and Kaye), \"Sisters\" (by Clooney & Vera-Ellen, and then hilariously reprised by Bing and Danny), \"The Best Things Happen While You're Dancing\" (which includes a wonderful dance routine by Kaye and Vera-Ellen), the imaginative \"Snow\" (with Crosby, Kaye, Clooney & Vera-Ellen), \"I'd Rather See a Minstrel Show\"/\"Mister Bones\"/\"Mandy\" (Crosby, Kaye, Clooney,& Chorus; although it shows off Vera-Ellen's legs in a way that betray her anorexia); the timeless \"Count Your Blessings\" (by Crosby & Clooney; just why did Eddie Fisher's recorded version become the hit?), \"Choreography\" (by Kaye, and the one number in the film I despise and fast forward through each year), the sentimental \"What Can You Do with a General?\" (Crosby), and the nifty \"Gee, I Wish I Was Back in the Army\" (Crosby, Kaye, Clooney & Stevens). I'm not sure there has ever been a better cluster of Irving Berlin songs in any one movie (although, admittedly, some are recycled, including the title song).All in all, a smash film that was the top-moneymaker of 1954, and still wears extremely well. I treasure it!BTW, the Blu-Ray version of this is (for the most part) a real quality transfer...wonderfully vivid.",
    "32": "The 3rd musical film starring Bing Crosby, with all music composed by Irving Berlin. Each of those films included the singing of Berlin's classic \"White Christmas\", which was introduced by Bing in the i942 \"Holiday Inn\". In contrast to \"Blue Skies\", and \"White Christmas\", Paramount made the unforgivable mistake of filming it in B&W, instead of Technicolor. This deficiency has since been corrected with an excellent colorized version. Thus, \"White Christmas \" served partly as a reworking of \"Holliday Inn\" in Technicolor, with greater emphasis on the Christmas season.......... Of the 4 original stars, only Bing returned. Danny Kaye made a thoroughly entertaining replacement for the quite different Fred Astaire, who turned down the opportunity to costar once again. Reportedly, he was fed up with playing second fiddle to Bing. Actually, Donald O'Connor was the original replacement for Astaire, but had to bow out do to illness. Singer Rosemary Clooney and dancer Vera-Ellen made excellent replacements for the lesser known female leads of \"Holliday Inn\": Margorie Reynolds and Virginial Dale. Vera-Ellen's 's singing was dubbed. Rosemary quipped that she wished her dancing could have been dubbed........The relationships between the 2 male stars and between the 2 female stars is quite different in the 2 films. In \"Holliday Inn\" Bing and Fred sometimes cooperate, but mostly they compete in their talents and choice of girlfriend. The girls are not cast as sisters, and sometimes compete for roles. In contrast, in \"White Christmas\", Rosemary and Vera-Ellen are cast as loving sisters, rather reminding us of Betty Grable and June Haver, in \"The Dolly Sisters\", released in the mid-40s. Bing and Danny are mostly cooperative with each other. There is no trying to steal the other guy's girl. Vera-Ellen clearly is Danny's girl throughout, with Rosemary as Bing's girl. ........\"White Christmas\" is 20 min. longer than \"Holiday Inn\", at 2 hr., perhaps longer than optimal. It was the first film photographed in Paramount's wide screen Vista Vision, which more raised the height of the image than make it wider. This was an advantage when transferring the film to high definition . .......Berlin used a mix of previously composed songs and new songs in both films, as was his general habit....... Notice that the costuming for \"I'd Rather See a Minstrel Show\" did not include blackface, which historically was standard for Minstrel Shows. In contrast, the \"Abraham\" number in \"Holiday Inn\", included much blackface, as well as some authentic African Americans. I thought the blackface was done in good taste, although some object to seeing any blackface in a film.......So, which is better : \"Holiday Inn\", or \"White Christmas\". I'd hate to have to make this choice. Just see them both, preferably both in color. If you like singing and dancing, you won't be disappointed.",
    "33": "This is a grand Hollywood salute to Christmas.  In addition to the wonderful Irving Berlin standard \"White Christmas\" there are many other great songs and dance routines.  \"When You're Dancing\" featuring Danny Kaye and Vera-Ellen is terrific; Danny could really dance, and partnered the fabulous Vera-Ellen is a way that can only be called magical.  My personal favorite scene in the film is the number \"Choreography\" with Danny and Vera-Ellen. The opinion it expresses:  \"They're not dancing anymore; they're doing choreography.\" sums up the second half of the 20th Century!A film treasure!",
    "34": "I agree as a film buff and ex cinema worker that this film should be shown every Christmas at PEAK TIME. Here in the UK this year the viewers were subjected to awful boring worn out soap operas. Films like Gone With the Wind were shown at midnight while the soaps that are on every night 365 days a years were on at PEAK time every day over the whole Christmas period. What have these planners got for brains in their heads? People want to be cheered up at Christmas not subject to watching worn out soaps showing people and kids screaming and shouting at each other. This followed by the usual police murder series. The programmes planners should have been fined here for what they subjected us all to. With the treasure of films like we have from the golden age of cinema lets see these and less of Coronation Street, Emmerdale Farm and Eastenders. Happy New Year Everybody and lets see White Christas next Christmas at a sensible time.",
    "35": "I'm dreaming of a white Christmas...who am I kidding? It will be 84 here today and the chance of a white Christmas is about equal to the Dolphins beating the Patriots on Christmas Eve eve.But, I always am a chump for the music of Irving Berlin and the singing of Bing Crosy. I'll even put up with the antics and Danny Kaye and the groaningly awful vaudevillian numbers to see this film over and over.Add to that the crooning of George Clooney's Aunt Rosemary, the absolutely cute Vera-Ellen, Oscar-winner Dean Jagger (Twelve O'Clock High), and seeing snow the only way I can.This is one I watch over and over.",
    "36": "White Christmas is one of the best movie musicals of all times.  The cast is a exquisite gathering of talent.  The story covers music, theater, comedy, and drama; it is an exceptional classic.  It would be hard to find another selection with the same synergy.",
    "37": "I'd not watched \"White Christmas\" for a long time, and my (faulty) memory had it not quite rising to the level of \"Holiday Inn,\" the other Bing Crosby Christmas musical from 12 years before. Happily, when I saw \"White Christmas\" yesterday at my local theater, it proved to be far superior to what I had recalled.Capt. Bob Wallace (Bing Crosby) and Private First Class Phil Davis (Danny Kaye), both serving in the U.S. Army in World War II, starring in a musical comedy show for the troops in their outfit, lead a big good-bye show for Gen. Waverly (Dean Jagger), their commander, who is returning to the states. After the war is over, Wallace and Davis form their own singing-dancing duo and begin scoring well in live theater in the New York City area.They meet two other musical and dance performers, Betty (Rosemary Clooney) and Judy (Vera-Ellen) Haynes, who are sisters, and, naturally, a double romance begins to brew. The four wind up at a \"holiday inn,\" so to speak, in Vermont, and discover that the owner is none other than (retired) Gen. Waverly, whose bankroll is rapidly \"getting small\" because of no snow (in Vermont?!) and few customers.After several songs, both on stage and well-placed within scenes, Wallace gets in touch with a TV producer back in New York City, who agrees to set up a live TV show from the inn, which will be designed as a big tribute to Waverly (who must be kept \"in the dark\" until the trap is sprung).After some additional plot twists in which Betty gets mad at Bob because she thinks (incorrectly) that the show is going to be designed to poke fun at Waverly; and Judy tries to lure Phil into announcing a phony engagement between the two to try to get Betty and Bob back together; the movie finally climaxes with a giant Christmas show in the big dining hall at the inn, with many, many of Waverly's former subordinates from his Army career there with their wives; and the two show business couples finally falling into each other's arms. Good flick; good characterizations, although not terribly deep.Now: A few minor quibbles that kept me from giving it 10 votes:The opening scenes near the \"battlefield\" in France wouldn't have fooled a 5-year-old; the sets were very obviously in a Hollywood studio.Crosby's and Kaye's characters' names -- Bob Wallace and Phil Davis -- come on, guys! How Whitebread can you get? They needed a little more pizazz than that.Clooney's \"lady in a snit, if you don't know why, I'm not gonna tell you\" attitude when she thinks she has uncovered an unpleasant angle to the show being planned by Crosby. Why didn't she just tell him? Oh, I know why: It would have untangled the plot twists too soon.All in all, though, an excellent classic movie.",
    "38": "The four main actors in this movie are very talented and have great chemistry on screen together. The dancing and singing are great and there is also good humor in this movie.White Christmas is an old classic feel good movie that will make you happy watching it.",
    "39": "Army buddies Bob Wallace (Bing Crosby) and Phil Davis (Danny Kaye) become a successful song and dance team after the war. They receive a letter from another army buddy introducing his sisters Betty (Rosemary Clooney) and Judy (Vera-Ellen) as singing act wannabe. They become fast friends with the girls and travel to Vermont for a Christmas show. They find a failing lodge run by their former commander, and decide to save it with a grand show.As a rom-com, it's strictly vanilla flavor. There isn't much heat, and there aren't any surprises. This is really only interesting for the song and dance. And there are some great songs. It's not just the iconic title song, but there are a whole bunch of others also written by Irving Berlin. And that's the real star of this movie. It's a showcase for Irvin Berlin's talents.",
    "40": "If ever there was a \"guilty pleasure,\" it's Bing Crosby's White Christmas. From the sappy story line to the half-baked songs, this thing truly is mediocrity writ large.But it works! There's just such a prevailing aura of niceness in White Christmas that, except for the beatnik dance sequence where I always fast-forward, I can't stop loving the simple, guilt-ridden pleasure of this sweet contrivance.WC is a professional joy, wrapped with a big, fat holiday ribbon, that continues to make me smile some 37 years after I first saw it.My fifth grader loves it, too. Not a bad recommendation for a movie panned by the critics, both professional and amateur, of which I am one.",
    "41": "Many think 'It's A Wonderful Life' is the best Christmas film of all-time, but for me it's 'White Christmas.' The Irving Berlin score is jam-packed with great tunes, including the greatest ever-White Christmas. Director Michael Curtiz never lets the film drag and it looks sensational. Crosby, Clooney and Kaye are in top form and Dean Jagger and Mary Wickes support beautifully. Extra credit to choreographer Loyal Griggs.",
    "42": "A would-be successor to 1942's \"Holiday Inn\", this film begins and ends with \"Holiday\"'s Oscar-winning song \"White Christmas\" but otherwise doesn't have much of a seasonal theme. A song-and-dance team, best friends since their Army days, partner themselves with a tuneful and attractive sister act; together, the frolicsome foursome save a dwindling Vermont inn owned by the boys' favorite General (whom they still salute!). Bing Crosby (with his hand on his hip) looks awfully wooden or unsure of himself here, though he works rather amiably with the looser Danny Kaye. Still, there are no romantic sparks between Crosby and Rosemary Clooney, nor Kaye and Vera-Ellen, which causes the love story half of the picture to be left wanting. The colorful production (though a bit elephantine) is lustrous and glossy, and a few of the musical numbers are fun, yet there isn't enough plot on hand to cover two hours on the clock. The final military celebration seems unnecessarily overblown, but the film's technical aspects and choreography are marvelous. ** from ****",
    "43": "While this film certainly has a cult following, it really can't be counted as 100 percent a Christmas movie. Basically a remake of 1942's \"Holiday Inn\" where the title song from this movie was introduced (and deservedly won an Oscar), it adds color, camp, and Danny Kaye to the familiar story. Danny takes over in the role Fred Astaire played in \"Holiday Inn\", and his character adds comedy into the mix, some funny, some cloying. Technicolor loves Rosemary Clooney and Vera-Ellen, and they wear all sorts of gorgeous gowns. Unfortunately, this mixture of pastiche and Technicolor ends up being an extremely mixed bag that brings huge smiles in some scenes, rolled eyes in others.The campiest moment comes with the duet of \"Sisters\", first seen with Vera-Ellen and Clooney, and later repeated by the mincing Crosby and Kaye. The later version was apparently done as a gag and kept in the film. A big production number saluting the old minstrel shows features the tackiest of jokes and the ugliest of costumes. It worked great in \"Kid Millions\" in 1934, but in the post war world of 1954, it is a major groaner of a number. Even duller is Kaye's \"Choreography\", as pretentious as it sounds. He does get a nice duet with Vera-Ellen, \"The Best Things Happen When You're Dancing\", while Crosby and Clooney get to sing the beautiful \"Count Your Blessings Instead of Sheep\". Clooney gets a good solo moment with \"Love, You Didn't Do Right By Me\", a mediocre song which becomes better simply because of how she sells it.As for the Christmas sequences, they open and end the film, hence the reason for the title. Dean Jagger plays the retiring General who moves to the aforementioned \"Holiday Inn\" after the end of World War II, and is given a rousing send-off. Mary Wickes shines as his housekeeper, but then again, doesn't she always shine no matter what film she's in? The two major Christmas songs are the title song, first repeated by Crosby (who introduced it in \"Holiday Inn\") and later utilized for the lavish finale where the hotel walls open up like a Broadway set. I guess you're supposed to really feel the Christmas spirit when this happens, but had the whole story surrounded the holidays rather than just the opening and conclusion, I would have been much happier. A minor little number, \"Snow\", celebrates the season nicely, but its not one of Berlin's better songs. Michael Curtiz seems an odd choice for director of a big, elephantine musical. This was a busy time for Irving Berlin as he just had another catalog of his songs done on screen (the much better \"There's No Business Like Show Business\") and the previous year's \"Call Me Madam\", both with Ethel Merman. So while he may have been considered, as Jerome Kern called him, \"American Music\", he was represented elsewhere. This musical certainly has its fans, and while I applaud much of what is in here, I have to consider this one a missed opportunity, much like Crosby's next remake of an old film of his, \"Anything Goes\", where the same studio forgot that it was based on an old Cole Porter hit, and equally as disengaging.",
    "44": "This movie is a Christmas classic. I do get why some people don't like it, it's definitely kind of \"sappy\" and it has a very old school feel and older music... but that's what it's supposed to be. It's just a feel good Christmas movie with a nice happy story and some good Christmas music. Great singers, fine acting, a nice story, everything you need for the Christmas season, or any other time too.",
    "45": "I love this movie so much! It is my favorite annual movie to watch. It just isn't Christmas without it. The performances of Bing, Danny, Rosemary, Vera, and Dean are incredible.",
    "46": "Call it whatever you will tradition, family values, classic any label you chose to attach, you can't deny the fact that this movie is exactly what the holidays as well as our daily lives should be about. Give from the heart, give a gift that has no dollar value attached to it, make someone who has meant something in your life feel like they matter, they are loved respected and deserve a very special gift to cherish and remember always. Have any of us ever given a gift of the magnitude that is given in this movie, or done it just because and not due to the fact it was a holiday or birthday. Give of yourself everyday just because it's the right thing to do. Do the right thing even when nobody is watching! From my family to yours...\"May your days be merry and bright, and may all your Christmas' be white.\"",
    "47": "I love Christmas movies and I watch the same\nOnes every year and I try every year thinking it will grow on me or I'll start liking it but I just can't. Don't get me wrong it's not a bad movie it's just ok. I just don't get why so many love this movie. The dance numbers are long and pointless and there's not much of a plot. There's moments I like in it \"Count your blessings instead of sheep'' \"sisters\" and \"white Christmas \" and \"snow\" are the only songs I enjoyed. I still watch this film every year but it's one of my least favourite Christmas movies.",
    "48": "Hallmark makes about 30 Christmas movies a year. None of them captures the magic this film has but then again, the talent in front of and behind the camera can never be matched. This film 4 singers find themselves in Vermont at Christmas ready to put on a show to save a resort.Not much of a story but it is lots of fun and has lots funny scenes and great singing and dancing. The older you are the more you will enjoy!",
    "49": "A feel good classic Christmas movie. If you like old movies and musicals this is for you. I love the simplicity of it and the innocence of that time. The music is beautiful and it's just a happy fun film.",
    "50": "Going to Birmingham for some last-minute shopping for X-Mas presents,I checked to see what was being shown at The Electric (the oldest working cinema in the UK.) Despite having heard the classic title track countless times,I've never had the chance to catch the movie it came from, which led me getting a George Bailey's cocktail,looking out of the window from The Electric at a white Christmas.View on the film:One of three films he made in 1954, even with the film not being played in the VistaVision format, (a recently Blu-Ray finally brings the title out in the correct aspect ratio)the craftsmanship of director Michael Curtiz & cinematographer Loyal Griggs in elegantly composed wide-shots held on the growing bond between the couples.Sparingly holding the X-Mas snowstorm back as bookends glowing in Christmas red, rustic greens and crisp snow scattered across the front of the screen, Curtiz unwraps a Yuletide melancholy atmosphere, snowing down in swift panning shots on Bob and Phil planning how to cheer the General up.Improvising Bing's and Kaye's version of Sisters after the crew saw them both clowning around on set, Curtiz wipes away Winter blues in dance set-pieces brimming with Hollywood glamour of the era,shimmering in Betty and Judy's high-kicking Sisters,and the quartet gathered to sing a closing version of the title track against a picture (Christmas) postcard backdrop.Standing out from the jolly attitudes of the leads, Dean Jagger gives a very good turn as General Waverly, whose shaken post-WWII state inspires others to show warmth and compassion to him. Whilst their \"crowd-pleasing\" double act within the film looks tied and a bit naff, Bing and Kaye lay on the charm in breezy turns as swooning, loved-up pals Bob and Phil. Receiving the swooning from the gents,Rosemary Clooney and Vera-Ellen throw snowballs of sass at the screen as Betty and Judy until they join in with putting up tinsel for a white Christmas.",
    "51": "My father-in-law had looked at me crazy when I said that I had never seen this film. It's now 2008 and I've watch this absolutely wonderful classic! It has so much charm and wit! I loved it and would recommend it to anyone. My 8 year old son enjoyed it too. It is very family friendly. Danny Kaye and Bing Crosby really bring this film to life with their clever comebacks and such. The story line will have you wanting to know more every second. Even my 8 year old son (who thinks girls are yucky) was very interested in the flirtatious nature of the two couples in the film. So much charm and class. I can't praise it enough! The only thing I didn't like is that it had to have an end. I'll watch it again soon... Tonight!!!",
    "52": "Often, repeat viewings of a movie will reward me with a greater appreciation for it, however in the case of \"White Christmas\", the effect may be the opposite, so I might better 'count my blessings' and stop with today's screening. Don't get me wrong, I'm all for nostalgia, but this one appears to have aged rather poorly, perhaps for no other reason than the passage of time and changing tastes.Probably the thing that works against the film the most is the choice of songs that have nothing to do with Christmas or the holiday season. Yes, there's the title song and repeated lines from 'Snow', but what's up with the 'Mandy' dance number and the 'Choreography' routine. Rosemary Clooney's Carousel Club song, \"Love, You Done Me Wrong\" seemed particularly troubling, even though it momentarily fit her situation with the Bingster. Also, another poster on this board had it right about \"What Can You Do With A General\" - I actually picked up the video sleeve to remind me what I was watching.Apart from the actual story, there's no reason not to admire the talent on display by the principals. To my mind, there's no finer singing voice than Bing Crosby's. Danny Kaye is spirited as Bing's partner, but he does tap that arm a bit much in the later going. Clooney's charm manages to come through her reserved character, but the showstopper if there is one would be Vera-Ellen in that 'Mandy' routine, watching leaves one almost as breathless as she should have been while doing it.Except for the title and the packaging, \"White Christmas\" has no claim on the truly great holiday films like \"It's A Wonderful Life\" or the Alastair Sim \"A Christmas Carol\". The only thing I would like to know is if Emma (Mary Wickes) ever did resign from 'Busybody's Anonymous'.",
    "53": "Early in the film,Crosby and Kaye meet Rosemary Clooney and Vera Ellen at a supper club, for the first time.  The girls ask the boys to review their act, as sort of a favor to their brother, who served with the boys in the Army.  While they're talking, the girls show them a photo of their brother.Look hard.  If the fellow looks familiar, it's because it's none other than Carl \"Alfalfa\" Switzer of The Little Rascals.Switzer appeared a number of small roles, but this, by far, is the smallest. Another is the part of a mischievous high school student who opens the dance floor over the pool, as Jimmy Stewart and Donna Reed are dancing the Charleston in \"It's a Wonderful Life.\"",
    "54": "You can argue about which version of \"A Christmas Carol\" you prefer, or if \"A Christmas Story\" beats out \"Love, Actually\" in the modern era, but this film hands down is the best Christmas musical by a long shot. Choreography unofficially by Bob Fosse, \"The Best Things Happen While You're Dancing\" with Kaye and Ellen is one of the best dance routines on film, period. Crosby, Clooney and ensemble deliver a sentimental treat throughout that still delivers today.",
    "55": "Don't get me wrong, this musical romantic comedy film directed by Michael Curtiz certainly is a lovely classical movie, however, it's not much of a 'holiday' masterpiece. For a movie call 'White Christmas', it's barely has any themes to do, with the seasonal event. It felt more like a generic Broadway movie than a Christmas flick with all the theatrical stage song and dance numbers. Filmed in VistaVision and Technicolor, the movie tells the story of male performers duo, Bob Wallace (Bing Crosby) & Phil Davis (Danny Kaye) having to team up with sister singers act, Betty (Rosemary Clooney) & Judy Haynes (Vera-Ellen) in order to save a failing Vermont Hotel from going out of business. Without spoiling the movie, too much, I really didn't like, how the plot & sets is mostly a rethread from the 1942's film, 'Holiday Inn'. Originally, the plan was to reunite Crosby with his co-star from that movie, Fred Astaire, but Astaire turned it down, as he had temporarily \"retired\" at the time. Donald O'Connor was cast as Crosby's co-star, in what was hoped to be a reprise of his successful dance partnership with Vera-Ellen from 1953's 'Call Me Madam'. However, that fell through, as O'Connor contracted a severe bout of Q-Fever from his co-star, Francis the Talking Mule, and had to pull out. Danny Kaye was cast as a last minute replacement and he was mixed bag for me. I felt that Kayne was indeed funny, but also his character was a bit annoying. I also felt, a bit weird to see him, fight over the affections of a beautiful up-and-coming performer, when the character seem a bit 'gay'. It made little sense. If that isn't worst, that romantically subplot is nearly a beat to beat to 'Holiday Inn' subplot as well. Even the songs from songwriter/composer, Irving Berlin felt nothing new. After all, this is the third films to feature Bing Crosby singing \"White Christmas\" with the other two being 'Holiday Inn' and 1946's 'Blue Skies'. Don't get me wrong, Bing Crosby is one of the best Christmas themes singers out there, but his songs did get tiresome, after a little while. It felt a bit recycled. Old songs like 'Happy Holidays' also felt, repurposed as new songs. I really don't like, how it became 'Counting Your Blessing'. The same goes with the 'Free' song being rewritten as 'Snow' & \"Heatwave' along others. It really made the film's music seem secondhand and lazy. Plus, it made the film seem like it was a sequel to \"Holiday Inn' when it's not. It was a bit confusing. Yet, there were some moments in this film that didn't seem recycled. According to the accounts of the cast, the \"Sisters\" performance was not originally in the script. They were clowning around on the set, and director Michael Curtiz thought it was so funny, so he decided to keep it. I also like the \"midnight snack\" scene in which Bob Wallace expounds on his theory of what foods cause what dreams. It also was almost entirely improvised. It really did help this movie, a bit. Yet, there were a lot of scenes that didn't, such as the ones featuring Vera Ellen. It was a bit disturbing to see Ellen in a frighteningly thin waist. She looks so weak, due to the illness with Anorexia. You can practically see her gasping through her smile in some scenes. It was clearly shown that she was being dubbed, while singing, because of that. Numerous sources mistakenly assume Rosemary Clooney sang Vera-Ellen's part in \"Sisters\" thus dueling with herself, but in truth, actress, Trudy Stevens was Vera-Ellen's voice double in all of her songs. Despite that, Vera Ellen was given outfits in the numbers \"Choreography\" and \"Mandy\" just to show off her dancing figure, similar to how Rosemary was given more songs to show off her voice. Both actresses were alright in their roles, however, I just felt Vera Ellen should had recast, as she was truly, going through issues at the time. The film would better off, without her. Despite that, the film looks beautiful. The colors are shining, the images are clear, and the rapid movements of scenes, moves without much blurriness. However, the movie was just not as fun, as it could had. Overall: 'White Christmas' was just not that funny, nor the non-Christmas songs, feature in it, memorable. While, a lot of critics might disagree with me. After all, a popular Screen-to-Stage Adaptation hit Broadway, just recently. I just think the movie is highly dated, and a bit overrated. Nothing personal, but 'White Christmas' is purely not as good as it could had. Watch it if you're classic film nut, but clearly watch 'Holiday Inn', during the holiday season if you can. It's the more superior film. Now that's a film, worthy to bring home, during the holidays.",
    "56": "I love this movie so much! It is my favorite annual movie to watch. It just isn't Christmas without it. The performances of Bing, Danny, Rosemary, Vera, and Dean are incredible.",
    "57": "Call it whatever you will tradition, family values, classic any label you chose to attach, you can't deny the fact that this movie is exactly what the holidays as well as our daily lives should be about. Give from the heart, give a gift that has no dollar value attached to it, make someone who has meant something in your life feel like they matter, they are loved respected and deserve a very special gift to cherish and remember always. Have any of us ever given a gift of the magnitude that is given in this movie, or done it just because and not due to the fact it was a holiday or birthday. Give of yourself everyday just because it's the right thing to do. Do the right thing even when nobody is watching! From my family to yours...\"May your days be merry and bright, and may all your Christmas' be white.\"",
    "58": "I love Christmas movies and I watch the same\nOnes every year and I try every year thinking it will grow on me or I'll start liking it but I just can't. Don't get me wrong it's not a bad movie it's just ok. I just don't get why so many love this movie. The dance numbers are long and pointless and there's not much of a plot. There's moments I like in it \"Count your blessings instead of sheep'' \"sisters\" and \"white Christmas \" and \"snow\" are the only songs I enjoyed. I still watch this film every year but it's one of my least favourite Christmas movies.",
    "59": "Hallmark makes about 30 Christmas movies a year. None of them captures the magic this film has but then again, the talent in front of and behind the camera can never be matched. This film 4 singers find themselves in Vermont at Christmas ready to put on a show to save a resort.Not much of a story but it is lots of fun and has lots funny scenes and great singing and dancing. The older you are the more you will enjoy!",
    "60": "A feel good classic Christmas movie. If you like old movies and musicals this is for you. I love the simplicity of it and the innocence of that time. The music is beautiful and it's just a happy fun film.",
    "61": "Going to Birmingham for some last-minute shopping for X-Mas presents,I checked to see what was being shown at The Electric (the oldest working cinema in the UK.) Despite having heard the classic title track countless times,I've never had the chance to catch the movie it came from, which led me getting a George Bailey's cocktail,looking out of the window from The Electric at a white Christmas.View on the film:One of three films he made in 1954, even with the film not being played in the VistaVision format, (a recently Blu-Ray finally brings the title out in the correct aspect ratio)the craftsmanship of director Michael Curtiz & cinematographer Loyal Griggs in elegantly composed wide-shots held on the growing bond between the couples.Sparingly holding the X-Mas snowstorm back as bookends glowing in Christmas red, rustic greens and crisp snow scattered across the front of the screen, Curtiz unwraps a Yuletide melancholy atmosphere, snowing down in swift panning shots on Bob and Phil planning how to cheer the General up.Improvising Bing's and Kaye's version of Sisters after the crew saw them both clowning around on set, Curtiz wipes away Winter blues in dance set-pieces brimming with Hollywood glamour of the era,shimmering in Betty and Judy's high-kicking Sisters,and the quartet gathered to sing a closing version of the title track against a picture (Christmas) postcard backdrop.Standing out from the jolly attitudes of the leads, Dean Jagger gives a very good turn as General Waverly, whose shaken post-WWII state inspires others to show warmth and compassion to him. Whilst their \"crowd-pleasing\" double act within the film looks tied and a bit naff, Bing and Kaye lay on the charm in breezy turns as swooning, loved-up pals Bob and Phil. Receiving the swooning from the gents,Rosemary Clooney and Vera-Ellen throw snowballs of sass at the screen as Betty and Judy until they join in with putting up tinsel for a white Christmas.",
    "62": "My father-in-law had looked at me crazy when I said that I had never seen this film. It's now 2008 and I've watch this absolutely wonderful classic! It has so much charm and wit! I loved it and would recommend it to anyone. My 8 year old son enjoyed it too. It is very family friendly. Danny Kaye and Bing Crosby really bring this film to life with their clever comebacks and such. The story line will have you wanting to know more every second. Even my 8 year old son (who thinks girls are yucky) was very interested in the flirtatious nature of the two couples in the film. So much charm and class. I can't praise it enough! The only thing I didn't like is that it had to have an end. I'll watch it again soon... Tonight!!!",
    "63": "Often, repeat viewings of a movie will reward me with a greater appreciation for it, however in the case of \"White Christmas\", the effect may be the opposite, so I might better 'count my blessings' and stop with today's screening. Don't get me wrong, I'm all for nostalgia, but this one appears to have aged rather poorly, perhaps for no other reason than the passage of time and changing tastes.Probably the thing that works against the film the most is the choice of songs that have nothing to do with Christmas or the holiday season. Yes, there's the title song and repeated lines from 'Snow', but what's up with the 'Mandy' dance number and the 'Choreography' routine. Rosemary Clooney's Carousel Club song, \"Love, You Done Me Wrong\" seemed particularly troubling, even though it momentarily fit her situation with the Bingster. Also, another poster on this board had it right about \"What Can You Do With A General\" - I actually picked up the video sleeve to remind me what I was watching.Apart from the actual story, there's no reason not to admire the talent on display by the principals. To my mind, there's no finer singing voice than Bing Crosby's. Danny Kaye is spirited as Bing's partner, but he does tap that arm a bit much in the later going. Clooney's charm manages to come through her reserved character, but the showstopper if there is one would be Vera-Ellen in that 'Mandy' routine, watching leaves one almost as breathless as she should have been while doing it.Except for the title and the packaging, \"White Christmas\" has no claim on the truly great holiday films like \"It's A Wonderful Life\" or the Alastair Sim \"A Christmas Carol\". The only thing I would like to know is if Emma (Mary Wickes) ever did resign from 'Busybody's Anonymous'.",
    "64": "Early in the film,Crosby and Kaye meet Rosemary Clooney and Vera Ellen at a supper club, for the first time.  The girls ask the boys to review their act, as sort of a favor to their brother, who served with the boys in the Army.  While they're talking, the girls show them a photo of their brother.Look hard.  If the fellow looks familiar, it's because it's none other than Carl \"Alfalfa\" Switzer of The Little Rascals.Switzer appeared a number of small roles, but this, by far, is the smallest. Another is the part of a mischievous high school student who opens the dance floor over the pool, as Jimmy Stewart and Donna Reed are dancing the Charleston in \"It's a Wonderful Life.\"",
    "65": "You can argue about which version of \"A Christmas Carol\" you prefer, or if \"A Christmas Story\" beats out \"Love, Actually\" in the modern era, but this film hands down is the best Christmas musical by a long shot. Choreography unofficially by Bob Fosse, \"The Best Things Happen While You're Dancing\" with Kaye and Ellen is one of the best dance routines on film, period. Crosby, Clooney and ensemble deliver a sentimental treat throughout that still delivers today.",
    "66": "Don't get me wrong, this musical romantic comedy film directed by Michael Curtiz certainly is a lovely classical movie, however, it's not much of a 'holiday' masterpiece. For a movie call 'White Christmas', it's barely has any themes to do, with the seasonal event. It felt more like a generic Broadway movie than a Christmas flick with all the theatrical stage song and dance numbers. Filmed in VistaVision and Technicolor, the movie tells the story of male performers duo, Bob Wallace (Bing Crosby) & Phil Davis (Danny Kaye) having to team up with sister singers act, Betty (Rosemary Clooney) & Judy Haynes (Vera-Ellen) in order to save a failing Vermont Hotel from going out of business. Without spoiling the movie, too much, I really didn't like, how the plot & sets is mostly a rethread from the 1942's film, 'Holiday Inn'. Originally, the plan was to reunite Crosby with his co-star from that movie, Fred Astaire, but Astaire turned it down, as he had temporarily \"retired\" at the time. Donald O'Connor was cast as Crosby's co-star, in what was hoped to be a reprise of his successful dance partnership with Vera-Ellen from 1953's 'Call Me Madam'. However, that fell through, as O'Connor contracted a severe bout of Q-Fever from his co-star, Francis the Talking Mule, and had to pull out. Danny Kaye was cast as a last minute replacement and he was mixed bag for me. I felt that Kayne was indeed funny, but also his character was a bit annoying. I also felt, a bit weird to see him, fight over the affections of a beautiful up-and-coming performer, when the character seem a bit 'gay'. It made little sense. If that isn't worst, that romantically subplot is nearly a beat to beat to 'Holiday Inn' subplot as well. Even the songs from songwriter/composer, Irving Berlin felt nothing new. After all, this is the third films to feature Bing Crosby singing \"White Christmas\" with the other two being 'Holiday Inn' and 1946's 'Blue Skies'. Don't get me wrong, Bing Crosby is one of the best Christmas themes singers out there, but his songs did get tiresome, after a little while. It felt a bit recycled. Old songs like 'Happy Holidays' also felt, repurposed as new songs. I really don't like, how it became 'Counting Your Blessing'. The same goes with the 'Free' song being rewritten as 'Snow' & \"Heatwave' along others. It really made the film's music seem secondhand and lazy. Plus, it made the film seem like it was a sequel to \"Holiday Inn' when it's not. It was a bit confusing. Yet, there were some moments in this film that didn't seem recycled. According to the accounts of the cast, the \"Sisters\" performance was not originally in the script. They were clowning around on the set, and director Michael Curtiz thought it was so funny, so he decided to keep it. I also like the \"midnight snack\" scene in which Bob Wallace expounds on his theory of what foods cause what dreams. It also was almost entirely improvised. It really did help this movie, a bit. Yet, there were a lot of scenes that didn't, such as the ones featuring Vera Ellen. It was a bit disturbing to see Ellen in a frighteningly thin waist. She looks so weak, due to the illness with Anorexia. You can practically see her gasping through her smile in some scenes. It was clearly shown that she was being dubbed, while singing, because of that. Numerous sources mistakenly assume Rosemary Clooney sang Vera-Ellen's part in \"Sisters\" thus dueling with herself, but in truth, actress, Trudy Stevens was Vera-Ellen's voice double in all of her songs. Despite that, Vera Ellen was given outfits in the numbers \"Choreography\" and \"Mandy\" just to show off her dancing figure, similar to how Rosemary was given more songs to show off her voice. Both actresses were alright in their roles, however, I just felt Vera Ellen should had recast, as she was truly, going through issues at the time. The film would better off, without her. Despite that, the film looks beautiful. The colors are shining, the images are clear, and the rapid movements of scenes, moves without much blurriness. However, the movie was just not as fun, as it could had. Overall: 'White Christmas' was just not that funny, nor the non-Christmas songs, feature in it, memorable. While, a lot of critics might disagree with me. After all, a popular Screen-to-Stage Adaptation hit Broadway, just recently. I just think the movie is highly dated, and a bit overrated. Nothing personal, but 'White Christmas' is purely not as good as it could had. Watch it if you're classic film nut, but clearly watch 'Holiday Inn', during the holiday season if you can. It's the more superior film. Now that's a film, worthy to bring home, during the holidays.",
    "67": "This movie will live on as a ten out of ten, its a masterpiece and a small treasure, and every year millions of family look back on it during the holidays. I love watching it during the holidays because it gives me that cozy feeling, with my small cup of hot chocolate and the dresses up Christmas tree....what is Christmas without it? Anyone who dispises this movie, do you have Christmas spirit? It makes you feel warm, no matter what age, what year, what time it is, it always makes you feel at home and I don't understand how people can be disliking such a beautiful uprising movie. It's so indescribable, in a good way, I'm always going to love this movie.",
    "68": "Bing Crosby's most well-loved and Oscar winning Christmas song came from the film Holiday Inn, it became so popular, director Michael Curtiz (Casablanca, Mildred Pierce) was given the job to make a whole film out of it. Basically, in World War II, after leaving the army, Bob Wallace (Crosby) and Phil Davis (Danny Kaye) team up to become successful song and dance stage act, and also manage to get into Broadway as producers. In a night club, Bob is introduced to the Haynes sisters, Betty Haynes (Rosemary Clooney, George's aunt) and Judy (Vera-Ellen) who also sing and dance on stage, who end up following them all the way to a small Vermont lodge. Bob and Phil are really surprised to see their old commanding officer, Major General Thomas F. Waverly (Dean Jagger) as owner of the lodge, but he isn't having much luck with business. They come up with a plan to save his business with a song and dance act they created for Broadway, but brought to the small lodge instead. Obviously things don't go smoothly, there is a rift forming between Bob and Betty, even when they were originally smitten, and happy Phil and Judy try to get them back together. Eventually the whole show is brought together for a big surprise for Waverly as all his soldiers come to the show, and they sing and dance their Christmassy show with the snow falling outside. Also starring Mary Wickes as Emma Allen, John Brascia as John, Anne Whitfield as Susan Waverly and Sig Ruman as Landlord. Some of the dance sequences are fun to watch, and songs like \"The Best Things Happen When You're Dancing\" and \"Geee! I Wish I Was Back in the Army\" are catchy, and the performances are alright. It wasn't a bad film in any way, I did enjoy myself, and I can see why it would be given four stars, but the best part is indeed Crosby's treasured song, for that I would probably watch it again. It was nominated the Oscar for Best Song for \"Count Your Blessings Instead of Sheep\". It was number 37 on The 100 Greatest Musicals, and it was number 17 on The 100 Greatest Christmas Moments. Very good!",
    "69": "Don't know what I can add that hasn't already been said, but, here goes. I've been watching White Christmas since late '70's when I first saw it on a big 25\" Magnavox console. I was mesmerized by Bing and Danny. When it was released years later on VCR tape I bought it and enjoyed it at my leisure. I then got familiar with all the other characters and enjoyed it more every year. I've had a DVD for years and it may wear out one of these days. There is nothing in White Christmas that does not disappoint. Music, dancing, choreography, story, all of the players in this movie keep giving year after year. My favorite character though is General Waverley. I still after all these years get emotional when he makes his first appearance as the \"innkeeper\" and the last scene. This is the only Holiday movie that I watch every year. I'll sprinkle in some others, rotating other classics and current HM movies. White Christmas is a must.\nThey Don't Make 'em Like They Used To",
    "70": "Michael Curtiz, the director of the famous \"Casablanca\", with Humphrey Bogart and Ingrid Bergman, and many other films, different genres, Action, Adventure, Romance, Western. The man was very prolific and very inspired with his other films, but not with this \"White Christmas\". \"The boys\", Bing Crosby and Danny Kaye, are not funny, the girls are not beautiful, well, Vera-Ellen she is acceptable, but Rosemary Clooney looks like a man in a dress. Irving Berlin's music is usually beautiful but not in this one, where everything is annoying, banal, uninteresting, boring. The first feature in VistaVision is a waste of time.",
    "71": "I know that people may think me unpatriotic, but the message here is that we need to continue to glorify war. The U.S. had just finished World War II and celebrated a great victory. Now we had the big Commie fear and a trip to Korea where many more of our young people dead. So in 1954 comes a \"Christmas\" movie. It pushes all the right buttons and has the stars of the day, Danny Kaye, Rosemary Clooney, and Bing Crosby (one of the most hawkish performers of all time) and becomes a kind of recruiting poster when we were done with war for a while (of course, we were already meddling in southeast Asia). It does have a decent story and those songs were well performed, but there is no comparison between this and \"Holiiday Inn\" which carries a much more romantic theme, and also stars Bing Crosby. The main thing for me is that at times I just find it sort of dull.",
    "72": "Based on the title, I anticipated this movie would be about Christmas. I was very disappointed. The film seems to be a collection of various non-Christmas night club performances set around helping an old army comrade stricken with financial woes. Most of the songs are ones I had never heard before watching this movie. I only recall the title track relating to Christmas. Given the films popularity, I was surprised this film was not any better than it was. I found it to be average with few memorable moments, memorable music or memorable characters. If you are looking for a great old Christmas movie, I recommend It's A Wonderful Life. Perhaps if this movie had been titled, Saving The General's Inn or December in Vermont, my review would have been more favorable because my expectations would have been different.",
    "73": "So Thanksgiving Day 2020 I decided it was about time I gave WC a viewing. I'd overlooked it for so many years I was kind of looking forward to it. I really did enjoy the musical numbers, Vera Ellen is a great dancer. Rosemary Clooney is also good with her musical performances too and their costumes throughout were lovely. Danny Kaye certainly has his moments. As for Bing, he sings beautifully but I felt like the rest of his performance was on cruise control and was actually quite distracting and brought the film down. It was a battle to get this film off the ground anyway what with the plot line being as thin and vapid as can be. I'm guessing that if I had first seen this film during my youth, as I suspect many reviewers of this film have, then I too could still have great affections for it here in the 21st century. However, that is not the case for me and I have to admit to having a hard time finishing. Despite my not so favorable review I am still glad that I finally gave it a try and if you're someone like me that has always been curious about it, then I suggest you check it out and see what you think.",
    "74": "This is one of the best Christmas movies ever.  I watch it when it's not the holiday season.  I have two copies, in case one goes bad.  My family and I have a good laugh at Danny Kaye setting people up. He's one the best with Vera-Ellen, Bing Crosby and Rosemary Clooney.",
    "75": "White Christmas is one of the few films without faults. It is a pleasure to watch, and as the cover of my DVD says a lovely classic,in which dreams come true. The events work out well, in a credible way. Since the narrative unfolds in show business, all passions can be readily supported by magnificent sing- and dance-acts. The atmosphere of Christmas is captured extremely well, with Christmas trees, holly, snow, bells, Santa Claus costumes, and a cozy fireplace. Don't expect any references to the little child Jesus. The theme is the power of the old-boys network, in this case the strong bonding between the soldiers of a company, that fought during WW2. The general is a real peoples manager, and is adored by (most of) his subordinates: \"We'll follow the old man wherever he wants to go\". After the war he starts a hotel business in Vermont. Since he can use some publicity, his former subordinates Bob Hope and Danny Kaye, who are successful entertainers in show business, decide to do their rehearsals in the hotel. In addition they organize a giant reunion for the company there. It is actually not a dream, but good fun and nostalgia and re-bonding. On their way Hope and Kaye meet two sisters, Rosemary Clooney and Vera Ellen, and all experience love at first sight, in a compatible way. Even this is credible, considering the reputations of Hope and Kaye. In short the general, the four stars and the audience have a wonderful and self-assuring time. Luck reaches its climax, when suddenly the snow starts to fall. Snow in Vermont, this ensures a busy season for the generals hotel. Will the dream continue? Will luck last? Who knows? The hotel may well establish itself. Concerning the relations between Hope-Clooney and Kaye-Ellen I am not so sure, because from the start they look a bit shaky. But don't worry, thanks to their networks replacements will soon be found. All in all, the film White Christmas is a lovely film to watch in the domestic circle, during the darkest days of the year.Will the film itself last? The small number of reviews is astonishing. But it is indeed mainly the film of my parents, in a time when music and dance were still appreciated by the cinema spectators. Perhaps at that time the people craved for simple happiness, after the Depression and the war. I have inherited a liking for musicals and operas, but clearly the genre has become obsolete, at least in this shape. Modern people get bored by an indulgent narrative, that is devoid of any lessons of life. They expect drama or satire. It may well be, that White Christmas is a product of its period, that can not stand the judgment of time, and is eventually banned to the archives.",
    "76": "This film is a bit of con job, built around a song, or song title; it turns out to be a simple box-ticking exercise. It can be argued there are good reasons to watch it. Four established stars of musical cinema, some great songs and dance routines. It's in Technicolor and, it's got Christmas in the title.\nAlternatively, it's a weary, hackneyed chugger, piggy-backing on the then popularity of Hollywood musicals, recycling old songs mixed with pathetic new ones with too many drop-of-the-hat dance routines. And schmaltz is poured on by the bucketful.\nAs mentioned elsewhere, the movie has little to do with Christmas. The title is simply a hook. The absurd devotion to the Army will appear strange to modern audiences as will the minstrel show number. Although at least they didn't perform in blackface! Thankfully we are spared Danny Kaye's usual facial contortions and silly voices (did he perhaps inspire the likes of Robin Williams and Jim Carrey?) but the \"drag\"version of Sisters is simply embarrassing. Kaye seems comfortable in the routine. But Crosby seems very anxious to want to let us know that \"This is just a gag folks!\"\nWant to see a film built around a song which actually works? Singin' In The Rain!",
    "77": "I grew up on Bing Crosby films, and this was one of the best!  What a delight to see Danny Kaye, Vera-Ellen got her start in this, I believe; and of course the lovely songstree Rosemary Clooney got her big break here also! My vote will be 8/10",
    "78": "First off. The biggest criticism to be had of this movie centers around the two main lovers. Obviously, Bing and Rosemary are talented actors, but they are quite, quite, quite boring. Oh boy are they boring. Danny Kaye and Vera-Ellen on the other hand. Yes. Now, they are the fun ones in the movie!! I wish the movie was about them! Get rid of the old farts, and bring in the energetic dancers! Also, their scenes together are hilarious. I really enjoyed their scenes in the film. Touching back on the big criticism, the film does not know what it wants to be about. Does it want to be a touching group film about a bunch of soldiers who rediscover their old leader and try to be there for him as he was for them years ago? Or does it want to be a boring romance movie? The scenes of the forming are really touching; I teared up when General Waverly comes out and sees all the troops ready for inspection. The latter-snoozefest.All this being said-with the great costumes, the energetic dance numbers (which are visually dazzling), and the lovely songs-this is a fun movie. A bit long (given poor choices of choosing to focus on Rosemary/Bing over Vera/Danny!!! :) ), but it's entertaining, and a notch above \"standardized fun.\"",
    "79": "Plenty has been written about this movie. For the record, I disagree with those who say that Danny Kaye's performance was a disappointment. It's a little understated, for him, but it's the right foil for Bing. Rosemary's a knockout. Vera's amazing. And Bing was at his Basset Hound best. When Vera and Danny dance, you can tell they were having fun with it. Sure, it's a corny flick, but it works because it touches people at an emotional level; it's easy to overlook the few noticeable gaffes. As cheesy as it is, it's perfectly easy to suspend disbelief and go with it; we get caught up in the story, and we like the people in the film. It amazes me how little Mary Wickes changed between this film and \"Sister Act,\" nearly forty years later. All in all, it's great fun, and hundreds of thousands of American families have made this film an essential part of celebrating Christmas.",
    "80": "I am not sure I can express how much I love Bing Crosby. I am not really familiar with him, but the more I experience the joy that is Bing the more I love him. I think this is such a great time period for him. He is a little older so he has a bit of wisdom to him that only a weathered face contains, but he stills has enough energy to pull off some pretty nice dance moves and has an on screen energy that just does not exist anymore. My favorite scene in the whole movie is near the beginning when Crosby and Kaye go back and forth after the show and it is pure magic. The energy and dialog has rarely been match in my eyes. Granted my eyes are young and have seen a lot of the greats, but what a great scene. I love this movie and it makes me feel good. It is a Christmas movie for me and I could not watch any other time of the year, but it is a fun movie. I loved the dance and musical sequences and watching Vera-Ellen dance is quite a site. That women is more legs than anything else and she can move. I could immediately tell who the singers were and who the dancers were, but I did not mind. Everyone has a great dynamic with each other and it is so much fun to watch. The movie does have some problems, but it is easy to overlook it because it is just so gosh darn fun. Honestly I love the ending with the general. It really gets to me. On the other hand I loved both Crosby and Clooney's characters, but I did not buy their relationship and its development. That would be the biggest complaint, but it captures a memory that reminds of me of home more than most other movies. Honestly I really think there is a lot wrong with the movie, but it personally it creates a comfort zone for me that reminds me of what it means to be part of a family. It sounds corny, but I am sounding more corny each day. Good movie and Crosby just shines in a way that men don't shine anymore.",
    "81": "By 1954 the song White Christmas had become such a timeless classic that it was inevitable that a film would be made around it. And of course the star would be none other than Bing Crosby. But who to star with him.Originally this was to be the third Irving Berlin outing for Bing and Fred Astaire. Then Donald O'Connor was to co-star, but finally Danny Kaye teamed with Der Bingle. Proved to be a felicitous combination.By then Rosemary Clooney had worked in a few films well and more importantly, she had clicked with Crosby on the radio. Bing had teamed with several girl singers over the years, like Connee Boswell, Frances Langford, Mary Martin, Trudy Erwin, Carole Richards, Peggy Lee and a trio of sisters named Andrews. But he always said Rosemary Clooney was it for him and besides Mary Martin, the only other one who did became a leading lady for him.It's not remembered because of the success of her solo career, but Rosemary Clooney started as a duo with her sister Betty who retired early to raise a family. So with Vera-Ellen as her sister in the movie, that was an aspect of the plot Rosemary could handle with ease.The plot such as it is involves Bing and Danny as a song and dance duo who've expanded into the production end of show business. Through a little bit of a con game worked by Vera Ellen, the two meet a singing sister act like the Clooney sisters were. The sisters turn out to be headed to Vermont to work at a resort and the smitten guys go along with them.Problem is there ain't any snow there. It's an unheard of 68 degrees Fahrenheit in early December. And the place is owned by Crosby and Kaye's former commander from World War II, played by Dean Jagger. He's about to lose his shirt and his pride. So our intrepid quartet go to work.Irving Berlin's score for White Christmas is about half new songs and the other half from previous scores. That's how it was when you got Irving to work for you. Listen carefully even to the background music. You will not hear one note of a non-Berlin song. One of those songs was a personal favorite of mine, Count Your Blessings Instead of Sheep. I recall in grade school in Brooklyn it was a song that the teachers had us sing in the school assemblies. Little did I know that it was introduced by the guy who proved to be my favorite entertainer. It's a patented philosophical Bing Crosby song that he did best and it serves as a ballad to woo and win Rosie. Bing sings it and then Rosie joins him in the reprise.Danny Kaye has two good numbers. The first The Best Things Happen While Your Dancing is clearly originally for Fred Astaire, though Kaye and Vera Ellen make a lovely couple on the dance floor. The Choreography number I think was also done for Astaire, but here dancer John Brascia does the complicated dance routine while Kaye sings. I'm sure Astaire would have handled both jobs had the film been made with him.All the stars do the Minstrel Show/Mandy number, but Vera Ellen really shines in it. She was a great dancer, really sparkled in every film she did.Besides Sisters, Rosemary Clooney has a grand torch ballad that sold a few platters for her in Love, You Didn't Do Right By Me. She had a wonderful singing voice and the most impeccable diction of any female singer ever. You don't miss one throbbing word on any of her ballads.White Christmas was Paramount's first film done in their wide screen process called VistaVision. And of course it was proper that their number one star for over 20 years be in this film. Of course jokes about Bing's derrire and the wide screen got into the repertoire of a certain comedian named Hope.Just like the song that inspired it, White Christmas has proved to be a timeless holiday classic and will remain so.",
    "82": "I can not believe that I did not see this movie before now. Maybe when I was 8, when White Christmas was on every year, I wasn't as into musicals as I am now, save movies like Annie, Wizard of Oz and Oliver! I am truly sorry, for this was an excellent film, that is perfect for the Christmas holiday season. White Christmas looks lovely, shot in beautiful Vista Vision with nice cinematography and wonderful costumes. The red dresses in the reprise of White Christmas especially were to die for. The songs and score by Irving Berlin is outstanding; the title song White Christmas is not only one of my all time favourite Christmas songs but also one of my favourite songs ever in a musical. But the other songs go without fault too, particularly The Best Things Happen When You're Dancing and Sisters.The script and story, serving as a partial remake of Holiday Inn, are top notch, if a little fluffy and implausible in places. Even better were the performances, with Bing Crosby his usual charming self as Bob, and while weak at the start Danny Kaye is superb as Phil. His dance routine with Vera Ellen, who looked gorgeous here and sang and danced a dream, was a knockout. Rosemary Clooney is positively riveting as Betty as well, in a suitably calm and subdued performance. I have to say I loved the choreography, it was clever, fast-paced and energetic. Overall, it may be fluff and a tad schmaltzy, but it is an excellent and timeless holiday movie. 10/10 Bethany Cox",
    "83": "The music of Irving Berlin, one of America's most distinguished composers of the 20th century, is at the center of this pleasant holiday film, that if one is to judge by the comments submitted to this forum, is a perennial favorite of audiences that discover this charming movie, or just go back to visit from time to time.Directed by Michael Curtiz, a versatile man; he was at ease with drama as well as comedy, or musicals. He shows a light touch that helps make this a cherished film for movie fans of all ages. Based on material by another great team, Norman Panama, Norman Krasna and Melvin Frank, the movie is light as a feather. The film is sort of a variation on the theme, \"let's put on a show\", or even, \"if we stage it, they will come\", we know how it will end, but we feel good, and enjoy it even though we know the plot by heart.The main reason for watching, besides Mr. Berlin's wonderful tunes, is hearing those standard songs delivered by the likes of Bing Crosby and Rosemary Clooney, who were at the top of their careers. They had such wonderful and melodious voices, they enhance the songs they interpret. The story is just a pretext to bring together the talented principals plus Danny Kaye, Vera Ellen, Dean Jagger, and the marvelous Mary Wickes, in a film that will delight anyone, anytime, but especially at Christmas.",
    "84": "Irving Berlin's \"White Christmas\" movie almost was a classic when it came out in 1954. That's because the title song had been out for 12 years, and was made hugely popular after its first use in the 1942 film, \"Holiday Inn.\" It won the Oscar that year for best original song. The song already had broken sales records and was an annual Christmas favorite. So, even with as long as it took 20th Century Fox to make the film, the movie was seen as a sure-fire hit musical and comedy romance. The delay was mostly in trying to fill the role of Phil Davis, played by Danny Kaye. Fred Astaire declined the role and Donald O'Connor became ill just before shooting began. Perhaps providence had a hand in the delay, because I don't think any long-time movie buffs today could imagine anyone other than Danny Kaye in that role. The movie premiered Oct. 14, 1954, and became the top moneymaking film for the year. It had $12 million in box office sales (about $105 million in 2014 dollars). The second highest grossing film that year was \"The Caine Mutiny,\" at $8.7 million. Moreover, the record sales of the song continued to ring up. According to Guinness World Records, Bing Crosby's recording of \"White Christmas\" holds the world record as the best- selling single recording of all time. As of 2014, Crosby's recording tops 50 million, and the total sales of \"White Christmas\" by all recordings tops 100 million. Today this movie endures, along with \"It's a Wonderful Life,\" as the two 'must' original films on all lists for annual family viewing over the holidays. Without a doubt, this is the best musical of the season. Charles Dickens's \"A Christmas Carol\" is the third movie that is on most lists for annual viewing; but viewers have a choice of several different renditions to choose from. Any of four of those are very good. What's not to like about \"White Christmas?\" It's a wonderful story of the early musical play versions where the entertainment is the profession of the stars. The plot is very good, with some sub-plots interwoven. It's a nice romance and light comedy of the everyday life variety. And it has wonderful music, singing and dancing. This film is packed with talent. It has 17 songs  all written by Irving Berlin, and several dance numbers. The songs are a mix of previous numbers and entirely new ones. Several were Berlin hits that are still played today. Some have been used or can be heard in movies in the 21st century. Besides \"White Christmas,\" these include \"Heat Wave,\" \"The Best Things Happen When You're Dancing,\" \"Count Your Blessings Instead of Sheep,\" and \"Love, You Didn't Do Right by Me.\"Kaye has a couple dance numbers and one with Vera-Ellen who shows her dance talent in several other numbers. Rosemary Clooney plays half of the Haynes sisters act (as Betty) with Vera-Ellen's Judy; and she's also the romance interest with Crosby. Other top cast members include veteran actors Dean Jagger, Mary Wickes and Sig Ruman. Two future stars are in the music and dance cast  Barrie Chase and George Chakiris. \"White Christmas\" has one of the wittiest funny lines of filmdom. Kaye as Phil says to Crosby's Bob Wallace, \"My dear partner. When what's left of you gets around to what's left to be gotten, what's left to be gotten won't be worth getting whatever it is you've got left.\" Another good example of the comedic banter between the two male stars is later. Bob is talking about Phil to Ed Harrison (played by Johnny Grant). \"I have complete confidence in him. When it comes to conniving and finagling, you can't beat this boy.\"This wonderful film never wears thin for viewing year after year. The songs and dance numbers will always entertain any audience. And the story is a nice holiday tale of friendship, romance, kindness and fun. It's a classic that families will enjoy for generations to come.",
    "85": "\"White Christmas\" is guilty of many of the sins catalogued by other commentators: its got a sappy story line, predictable plot twists, it plays outrageously for sentiment and patriotism (not your usual Christmas theme!). But I confess to having loved it from the first moment I saw it nearly a half century ago.  I, too, like many, make it a point to view it every Christmas season, along with much better holiday fare such as \"It's a Wonderful Life,\" \"The Wizard of Oz,\" and \"Miracle on 34th Street.\" \tI think, contrary to many folks, that Danny Kaye succeeds in the second lead role better than Fred Astaire did in \"Holiday Inn,\" and while he isn't given an opportunity for his patented zaniness, he adds a thoroughgoing charm to the role that sometimes the rather stiff Astaire lacks. \tRosemary Clooney is lovely in the rather thankless role of the practical sister and was at the peak of her genius as a pop singer, Vera-Ellen does her usually charming thing, and Crosby!  The master implants his genius in virtually every frame.  In supporting roles veteran character actor Dean Jagger is splendid as the general, while Mary Wickes steals every scene she's in as the nosy hotel housekeeper, Emma. \tThe singing and dancing are first-rate (even without Astaire), and the songs by Irving Berlin are among his very best, including a number of tunes written especially for the film.  One that never ceases to charm me is the trifle, \"Snow,\" sung by our four stars in the dining car of the railroad train bound from Florida to Vermont.  What a magical moment, among many in this thoroughly delightful, if flawed, jewel.",
    "86": "Over the years, I've read a number of professional critics' reviews of this film; almost all were mildly to severely negative.  And here's the interesting thing: I don't disagree with most of the individual carps. Yes, the movie is a piece of fluff. Yes,the usually dependable Danny Kaye is a bit weak in his performance. Yes, the plot mechanism for inserting many of the production numbers is lame.  Heck, even the continuity is poor...I myself have discovered three noticeable continuity fluffs. But here's the thing.  The movie works, anyway!!! Bing and Danny nevertheless make a likeable \"Mutt and Jeff\" duo. The supporting cast all holds their own, from a radiant (and surprisingly voluptuous) Rosemary Clooney, to the astoundingly agile Vera Ellen, to Dean Jagger's Patton-like General Waverly...they all hit their marks very well. The plot-line is unbelievable.  Who cares?  This is a feel-good Christmas Movie, for cryin' out loud!  The production numbers are sheer fun, the plot doesn't get in the way of all the beauty and great music, the actors are obviously having a good time, and we're all allowed to window-peep on the shenanigans.  This is the PERFECT movie to put on after Macy's Parade, while all those who don't like football are helping prep for the big Turkey Day meal.  You sneak a bit of dressing or cranberry sauce, and watch a production number.  The plot is so user-friendly, missing five minutes here and there doesn't hurt. Treat yourself.  Discover why millions of views have made this movie a holiday favorite, despite the critics' opinions!",
    "87": "I absolutely ADORE this movie!  Have since the first time I saw it! Sure... some may classify it as simply a \"feel-good\" movie, but what's wrong with that?  Some may also classify it as pure schmaltz, but the movie truly does have it's sad points... like the priceless look on General Waverly's face whenever he enters the room where everyone who had been under his division is awaiting his arrival!The movie has a truly wonderful musical score, not to mention some VERY kick butt dancing!Bing Crosby is charming as Bob Wallace, a calm and reserved, yet witty and delightful and wise-cracking, and somewhat cynical kind of guy. Bing truly performed to his greatest.  And his vocal talent is enormous, not to mention evident throughout the entire movie!  It's a real treat to see him crack up when he and Danny Kaye are performing their rendition of \"Sisters\"!Danny Kaye is hilarious as Phil Davis, the foil to calm and cool Bob. Phil, too, is full of wise-cracks, and very intent on getting Bob to settle down. Danny gave such a life to his character, portraying him like no other! His best one liner was when a young blonde with voice like nails on a chalk board says to him (after his phoney engagment to Judy) \"I sure wish it would happen to me!\") to which he replies \"So do I!\"Rosemary Clooney is absolutely riveting as Betty Haynes, the older of the two Haynes sisters.  She is the most calm and most subdued.  She is looking for her \"knight on the white horse\" in life.  Rosemary played Betty to the fullest, making her every bit as believable as you could imagine!  And that voice... GOLDEN!  A gift from God!  It's a true treasure to see her in her solo \"Love (You Didn't Do Right By Me)\".  She's absolutely marvelous and extremely talented.Vera-Ellen is refreshingly delightful as Judy Haynes, the younger and more naive Haynes sister.  Judy is also the dreamer of the two.  Vera-Ellen does a wonderfully through job of portraying Judy!  She is a perfect foil to her older sister.  And those dancing stems... to see her dance in numbers like \"Mandy\" and \"Choreography\" is a real treat!  How ANYONE could ever dance as well as she is beyond me!  She really did a great job in this movie, even better than her performance in \"On The Town\" with Gene Kelly, Frank Sinatra and Betty Garrett.A GREAT MOVIE!!!!  GREAT CAST CHEMISTRY!!!!  GREAT MUSIC!!!!  GREAT DANCING!!!!  WATCH IT AND YOU WILL SOON BE DREAMING OF A WHITE CHRISTMAS!!!!",
    "88": "Sorry, Jimmy! My apologies, Alistair! My all-time favorite Christmas was, is, and always will be, \"White Christmas.\" First of all, there's that wonderful Irving Berlin score. \"Count Your Blessings Instead of Sheep\" and \"Sisters\" have become standards, of course. But, towering above them all, is Bing Crosby's definitive performance of the beloved Christmas favorite that he practically owned. All the performances are top-drawer, what with Bing, Danny Kaye (In a role meant for Donald O'Connor), Rosie Clooney, Vera-Ellen, Dean Jagger, and Mary Wickes, who, as you can see here, was playing nasty old things even when she was a nasty young thing!Corny, syrupy, kitsch. Perhaps it is all of that, to some. But, to unashamed sentimentalists like me, \"White Christmas\" will always be THE all-time great Christmas movie, particularly when viewed by the whole family, on Christmas Day, in front of the fireplace.God bless Bing, Berlin, and company, for making a lot of Holidays that much happier, including those of the Sorrentino family!",
    "89": "Although Frank Capra's \"It's a Wonderful Life\" deserves its place among the pantheon of Christmas movies, this comparative confection from 1954 still deserves special mention. Granted the plot, what there is of one, is rather thin, it is splashy good fun directed by the dependably versatile Michael Curtiz with several Irving Berlin standards and four superb variety performers in their prime. As much as Capra's film is an annual tradition, it is really this film that I look forward to the most of all the holiday classics.The storyline focuses on two former soldiers, Bob Wallace and Phil Davis, both song-and-dance men who become best friends when Davis saves Wallace from a falling building during WWII. After years of post-war success on Broadway and the nightclub circuit, they become reconnected with their gruff but lovable former army commander, General Waverly. The general now owns a Vermont ski lodge, but he is treading water financially since there is no snow as Christmas approaches. As it turns out, the Haynes sisters, Betty and Judy, are playing the lodge during the holidays, and of course, romantic entanglements ensue all the way through the big finale when all four star in a show that they hope will save the general's lodge.All of this seems rather incidental to the musical numbers showcased in the then-revolutionary widescreen process called VistaVision. The most relaxed of actors during this era, Bing Crosby plays Wallace with his natural lan, and he croons the classic title tune early on and leads the group sing of the same song at the end. In contrast, Danny Kaye plays Davis with his mercurial style intact, though compared to his other films of the period, he is relatively subdued here. With her smoky, silken vocal skills on display, Rosemary Clooney plays Betty, Wallace's love interest, with aplomb and complements Crosby easily on \"Count Your Blessings (Instead of Sheep)\". She also delivers a nice torchy Berlin tune with \"Love, You Didn't Do Right by Me\" despite some silly man-choreography.I have to say the most impressive performer of the quartet is Vera-Ellen, a phenomenal dancer who was the equal of Astaire and Kelly at her peak. She makes even Kaye look good in their musical duets - \"The Best Things Happen While You're Dancing\" and the amusing Martha Graham riff, \"Choreography\". However, her best numbers are with dancer John Brascia - the elaborate \"Mandy\" number where her pliable, slender frame seems to be everywhere on the screen, and the brief rehearsal number, \"Abraham\", where she and Brascia snap, pop, clap, kick and swing with unerring military precision. It's worth noting that her singing is dubbed by vocalist Trudy Stevens, which is pointed out by Clooney on the less-than-informative audio commentary track in the DVD package. Much better is the 16-minute retrospective interview with Clooney where her natural sense of humor emerges.There are other numbers worth mentioning in the movie - the duet, \"Sisters\", done first straight by the women and later by the men as a comedy routine in half-drag (Kaye steals this bit handily with his over-the-top clowning); the foursome on the vintage Berlin \"Snow\" and \"Gee, I Wish I was Back in the Army\"; and of course, the title tune at the end. Way over on the sidelines, Dean Jagger lends his warm dignity to the role of the retired general, and Mary Wickes plays Emma the housekeeper in her typically sarcastic manner. Special mention needs to be given to Loyal Griggs's vibrant Technicolor cinematography, which makes the entire movie look appropriately like a bright red candy box, and the print transfer in the DVD almost fully captures the original visual quality. This is undemanding entertainment and a dependable holiday classic that feels like a favorite well-worn blanket.",
    "90": "This movie is a Christmas tradition with me. But there is something strange about its allure. It's wonderful between Thanksgiving and Christmas, then on December 26th, it is like the Christmas tree. It turns from a glimmering tribute to the season into a bunch of dead pine needles that you want to haul to the pavement as soon as possible.Maybe that is because there are no bad guys in this film, it is pure good will, pure nostalgia - even in 1954 it was pure nostalgia - nostalgia for the men who had been soldiers in an all out fight for saving the planet from forces of pure evil just ten years before. And it is pure hope - hope for finding that special someone, hope of not being \"the forgotten man (or general in this case), hope that your friends and family care that your life turns out alright, hope for a White Christmas.The great Irving Berlin songs include \"Sisters\", \"White Christmas\", \"Count Your Blessings\", and \"Snow\". The musical numbers are greatly varied including - a minstrel number??? - but then you have a greatly varied cast. There's old pro Bing Crosby whose voice and demeanor warm any film, Danny Kaye's nervous exaggerated presence and Bing's old army buddy and now song and dance partner, Vera Ellen floating on air in all of her dance segments - and look at that waist..if you can find it!. Finally there is iconic 50s songstress Rosemary Clooney rounding out the cast.Dean Jagger plays the general and former commanding officer of Crosby and Kaye who has sunk all of his savings into a Vermont ski inn - except global warming seems to be parked overhead. Then there is great character actress Mary Wickes as the inn housekeeper whose bad habit of eavesdropping on the extension almost throws a fatal monkey wrench into what has up to that point been just been too happy of a film. Remember, if you are going to be an eavesdropper, listen to the WHOLE conversation! Highly recommended as a sugary holiday treat that hits the spot.",
    "91": "I HAVE REVIEWED OVER 400 (C H R I S T M A S ) MOVIES AND SPECIALS. BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE REVIEW THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I AM HONEST! I REVIEW MOVIES & SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN!Can you believe it? I have seen over 400 \"Christmas Movies\" and I finally saw \"White Christmas\" last night. I know that after \"It's a Wonderful Life\" and \"A Christmas Carol\" \"White Christmas\" must be one of the best known Christmas theme movies. For some reason I avoided this movie. I think I did see parts of it over the years but it never held my interest. It had to be 30+ years since I last saw clips from the film. Now in 2017 I finally saw it all the way through and I am glad I did. Its a fun film but, not great film. I think however the older you are the more you will enjoy it. On Christmas Eve, 1944, somewhere in Europe, two World War II U.S. Army soldiers, one a Broadway entertainer, Captain Bob Wallace (Bing Crosby), the other an aspiring entertainer, Private Phil Davis (Danny Kaye), perform for the 151st Division. But, word has come down that their beloved commanding officer, Major General Thomas F. Waverly (Dean Jagger), is being relieved of his command. He arrives for the end of the show and delivers an emotional farewell.Years later they run into the General who now own & runs a resort. The resort is struggling. They vow to help save his resort. The film is well worth seeing. Rosemary Clooney was a great singer and she shines in this. Watching Vera Ellen dance is worth the purchase of a DVD. Now if you are under 30 you might not like this. However the older you are the more you understand the motives of the people in the film. Don't miss this!",
    "92": "To celebrate Christmas and to pay respects to Mr. Bing Crosby who died a little more than 30 years ago, I decided to watch for the first time in its entirety, White Christmas. This movie made of Irving Berlin songs both old and new, also stars Danny Kaye, Vera-Ellen, Rosemary Clooney, Dean Jagger, and Mary Wickes with some familiar bit players like Herb Vigran and Grady Sutton. Also, George Chakiris, best known as Bernardo in West Side Story, is a dancing extra here. The story of two former army buddies-turned-musical-partners who meet a two sister singing act that's on their way to a lodge owned by the general of the former army pals is just a contrivance to put together various songs to fit in certain segments. Good musical performances abound with some of my favorites being \"Choreography\" with Kaye and Vera-Ellen making fun of Jazz-Ballet and the \"Count Your Blessings\" duet with Crosby and Clooney. While I said the story is pretty contrived, I also was mostly willing to go along with most of it as the performers made it all go down easy with director Michael Curtiz lending a brisk pace throughout. The now-classic song \"White Christmas\" was probably better handled in Holiday Inn by Bing some 12 years before but still, it's a good way to both begin and end this wonderful showcase to Mr. Berlin that's become a holiday classic for the last 50 years. P.S.-The picture that Vera-Ellen show of she and Clooney's brother that served with Bing and Danny is that of former Our Ganger/Little Rascal Carl \"Alfalfa\" Switzer!",
    "93": "On all counts, this movie succeeds as sheer entertainment. I watched it with my sisters as a little girl -- and the tradition has been passed down to my two daughters, who look forward to the tradition of throwing \"fake\" snow around every year in the final scene (no spoilers here...)!I have never encountered another movie that engenders such faith and respect among its followers. In fact, friends from across the country join me every year in watching it simultaneously as we chat about each scene in a chat room online. We call it \"Cyber White Christmas\" - and it allows us to celebrate and type away to our hearts content as we revisit the confection each year. Yes, we understand the film is confection -- and we trust and love it to be just so.I will always smile when Danny rubs his elbow. When the Hanes Sisters come out in that heavenly blue. We'll forever gasp at Vera Ellen's skeletal frame -- and the single tap from Mandy that seems to go on forever, not to mention Betty's magnificently scalloped dress in New York as she croons \"Love, You didn't do right by me..\" And it's true: the best things really do happen when you're dancing -- a number that transports me to the sublime every single time...In other respects, I live a fairly respectable ordinary life. But once a year, I'm a giddy schoolgirl as I watch this wonderful film with my family. I count this lovely film as one of my blessings, for sure. Mutual, I'm sure.",
    "94": "This was one of the last successful projects involving Irving Berlin. In 1943 he had made the film \"Holiday Inn\" with Bing Crosby and Fred Astaire, as song and dance partners who split when Crosby decides to leave the act, and Astaire tries to settle down with the woman in the act that both men loved. Crosby turns his farm in Connecticut into an occasional bed and breakfast inn that is opened only on twelve national holidays, and produces special shows for the guests on those nights, with Marjorie Reynolds as his new partner. Astaire (after getting the heave-ho from his girlfriend) shows up with their agent (Walter Abel) and tries to romance Reynolds away from the inn and Crosby.Eleven years later Berlin decided the time was ripe for a remake, and originally planned to have Astaire in it again (it would have been the third Crosby-Astaire film, with \"Blue Skies\" as the center one). Astaire could not be in the film, and eventually the role went to Danny Kaye. One wonders if the original script of \"Holiday Inn\" would have been used or a version of it. As it was, the new film was also set in a New England inn (in Vermont this time), and the story borrows a shade or two from Berlin's World War I musical \"Yip Yip Yaphank as well as his World War II war morale film \"This Is The Army\".Now Crosby is prominent singer and performer who was drafted and is a Captain in a regiment near the Battle of the Bulge in December 1944. The Major General commanding is Dean Jagger, although as the film begins he is on the verge of retiring. However, Jagger is present when the men, led by Crosby and assisted by energetic and talented private Danny Kaye, put on a Christmas show. Shortly afterward, Kaye saves Crosby's life when he knocks him out of the way of a collapsing brick wall, and suffers an injury. Crosby, as a promise, agrees to sing a song Kaye composed (as a duet - so Kaye has to sing it too) in his first performance after the war. As a result Crosby and Kaye become partners - eventually becoming like Rodgers and Hammerstein producers of shows as well.They meet a pair of singing and dancing sisters (Vera-Ellen and Rosemary Clooney) in Florida, and end up with the girls in the latter's next booking at an inn in Vermont. The inn looks like it should be a success, but it is on the verge of bankruptcy, especially as the temperature has been too hot for snow in December. Also the inn is run by Jagger, assisted by a young granddaughter and Mary Wickes. The plot of the film runs into two slots - will Crosby and Clooney and Kaye and Vera-Ellen get together, and will they be able to Jagger become successful without hurting his pride.The film may have started as a clone of \"Holiday Inn\", but it stands on it's own feet well. There is a nasty taste left in viewing \"Holiday Inn\", with Astaire as bounder - villain willing to break up Crosby's romances because of his own needs. WHITE Christmas does not have that. Kaye is willing to remind Crosby about the act of saving his life from time to time, but he actually is quite protective of Crosby's interests, including hoping to help Crosby settle down with a proper wife (though, oddly enough, he never thinks of marriage himself). Their care for Jagger's plight is also well accepted by the audience. Compare it with Walter Abel's constant looking for some type of long term show-biz contract to take to his clients (especially Astaire: in fact Abel continuously works for Astaire's benefit at the expense of Crosby in \"Holiday Inn\"). In short, the motivation of the leads in \"White Christmas\" is far more admirable.The tunes in \"White Christmas\" were actually far more memorable than the ones in \"Holiday Inn\", except for \"Easter Parade\" and \"White Christmas\".They include a revival of the song \"Mandy\" which had been sung in Eddie Cantor's film \"Kid Millions\" in 1937. The one real negative I found was that in \"White Christmas\" the lead-in to \"Mandy\" was a number glorifying minstrel shows. I doubt that African-American today would appreciate that number very much. But at least it was not done in black-face, as the \"Abraham\" number in \"Holiday Inn\" was. Somehow both films would have been different regarding those film sequences today if they were being remade.",
    "95": "i've just finished watching \"white Christmas\" for the jillionth time and loved it as much as i ever have.it may have a weak plot, it may have continuity problems, it may not be as good as \"holiday inn\" or have any number of other problems.... but it has a lot that sets it apart and makes it the classic film that it is and deserves to be!it is \"true.\" it speaks to the real comradeship and love that men who have bonded in war feel for each other. (if you don't believe me, ask any namvet who understands him better--his wife or the men he served with.)it presents men who are partners and who value each others opinions on how they run their business/act. it presents sisters who love each other--and are willing to give up their own dreams for each other. it presents a man who has served his country, is raising his granddaughter and now, in retirement, is about to lose everything thru the vagaries of weather.all of these people are willing to sacrifice of themselves in order to help each other. they are human and admit to making mistakes...and then rectify them.it is about love and caring and giving. it is the truest sort of Christmas story. it is about the TRUE spirit of Christmas.....and it gets there in a very entertaining way...despite whatever flaws it may have.the music is wonderful. the costumes are wonderful. the staging is entertaining.it makes me smile and warms the cockles of my heart....... we have too few movies these days that do that. especially Christmas movies.......",
    "96": "Watching White Christmas is like a remembrance of past nostalgias. It all brings me back to a time when I was young, where Christmas was the single most magical event there ever was. It was a time of endless and unbreakable euphoria, a feeling nearly unattainable with my age. And yet, this film managed to incite even more from me. Through its difference it comes to represent not only the past, but also the present. To show how these past nostalgia have shaped us into a hopeful and wiser version of ourselves, making me all the more grateful for today. Hidden beneath this glamorous portrayal of Christmas and performance, is something of true human sincerity and the ever present love for the moment, propelling the film into something extraordinary.First off, one aspect that sticks out about this film is it's dialogue. Upon hearing the back and forths it is all purely fun! The dialogue is witty and always feels as if it's consequential, as it's constantly building up to the next event. However, the main staple is how revealed these characters become through communication. Every piece of banter between each character gradually leads up to one being sincere. Slowly but surely the essence of each character begins to break through. We can't help but feel that they actually pondered the situation with the intelligence of a real person and simply stated what they felt deep down. It's a testament to this film on how much it respects and communicates the true human essence of each character. In a way, and like all great films, the dialogue felt like a reflection of real life. How so many of our conversations feel light hearted, with an emphasis on humor, and yet it's through these discussions that staples of who we truly are end up seeping through.It's because of how well defined each character is that the humor with it worked all the better. It's like a sitcom cast that you're well acquainted with. It's not the specific joke written, but the character actually saying it. The feeling that these real people, with all their complexities known to us, are actually saying these lines as if it was thought up in the moment. This can't help but propel life into it, containing the human aspects lacking on paper.Another notable aspect is its cinematography. In this case the camera felt like a character. It always seems to be reacting with the most insightful responses. It pans from thing to thing, highlighting the individual in the room and detailing them through their telling movements. It also embodies the mood of the room. This is ever present when the said mood is romance. The camera always seems to start with a subjective wide shot, encompassing the characters within a large room, as it seems to get seductively closer and closer. Pretty soon it's all built up to the max of anticipation. And then they kiss, making us feel as if it was truly worked for. But it's not all personal. There's glamour to the musical numbers, as these fantasy like moments are perfectly communicated through the camera that seems to soar as it takes up each bit of beautiful scenery. It all then becomes fulfilled with the beautiful and seamlessly intricate dances.And of course, the dancing and music is perfect. This is all obvious when including such professionals. Of course it will be perfect! But what about the \"why\" of it? How does it communicate the present emotions of the story? Well, pretty amazingly and it's the reason why it holds up so much as a musical. The dancers themselves felt suave, respectable, and yet harnessed this child like fun to it all. They use this to perfectly communicate the almost funny feelings of love, the unrelenting and yet seamless energy towards passion, and (most beautifully) the true joyful feeling of the present moment, where everything right seems to hit you all at once. Music all adds to this, through its communication of the joyfulness, the melodrama, the energy, and the liveliness of Christmas! It's all very glorious, as both communicated these feelings far greater than it could have been done any other way.As I write this now it is Christmas Eve. Having seen this movie I feel as if part of my past spirit of childhood has been restored to me. I'm bewildered on how much a film like this could instill into a person, and I'm so grateful to have seen it. As I go to bed tonight, restless and anticipating Christmas Day, I have no doubt that I'll be counting my blessings instead of sheep.And on a final note: Happy Holidays to whoever is reading! Whether you be young or old, or have the holiday spirit or not, I wish you the best!",
    "97": "Music, friendship, heroism, romance and a true Christmas theme states what this film has to offer and that does not even include four A-list actors in the crooners Bing Crosby and Rosemary Clooney (George Clooney's Aunt in real life) as well as comedian/singer/dancer Danny Kaye and the classy dancer Vera-Ellen.Since I was a very young child I have watched this 1954 Christmas classic, White Christmas every year in the month of December for the past half century and I have never grown tired of the songs and the heart warming story of the love an infantry had for their retiring Major General Thomas F. Waverly (Dean Jagger) who owns a winter resort that has fallen on hard times.So crooner Bing Crosby and Danny Kaye decide to organize their old infantry to all gather at their Major's winter resort and host a real Christmas get together to once again express their love and gratitude to the Major who brought all these brave men home safely. Of course there is also a tug-and-go romance brewing with Bing and Danny dating Rosemary Clooney and Vera-Ellen and the classic song \"Sisters\" is unforgettable just like this Christmas Classic which is on my TOP 3 list.A Perfect 10 for 10 rating",
    "98": "Old Army buddies Bob and Phil become a hugely successful song and dance act once the war is over. Taking a much needed vacation to Vermont, they are saddened to find that the ski lodge run by their old wartime General is due to be closed down on account of the lack of snow in the area. Falling in with two lovely sisters, Betty & Judy, the boys plan to put on a variety show with the girls to entice people back to the lodge. But misunderstandings and romantic leanings are not going to make this at all easy.Enduring, perennial, simple and beguiling are all words fit to be associated with White Christmas. It's directed by Mr Reliable, Michael Curtiz, features songs from Irving Berlin and stars Bing Crosby, Danny Kaye, Rosemary Clooney, Vera-Ellen & Dean Jagger. Filmed in Technicolor, it's also notable for being the first film to be shot in VistaVision (think wide-screen process). In truth the film is thinly plotted and doesn't remotely feature some of Berlin's best tunes, and I dare to be a touch more critical as the VistaVision is wasted on the studio led direction. Yet it's such a charming and heart warming film it feels churlish to let the negatives negate the over riding feeling of having been cheered after a viewing.So although it's not the brilliance it perhaps should have been, it's ultimately a picture that still reels in new viewers every yuletide year, and that's something that is hard to argue with. So enjoy the title song and the likes of \"Sisters,\" \"The Best Things Happen When You're Dancing,\" \"Count Your Blessings Instead Of Sheep\" & \"Love, You Didn't Do Right By Me\". Marvel at the zippiness of Vera-Ellen's dancing whilst lapping up the side-kick goofiness provided by the always watchable Kaye. Be emotionally involved with Dean Jagger's heavy hearted General, and of course there's Crosby too, seemingly ageless, he croons and simultaneously manages to melt the ice in your drink as you snuggle up by the fire.Delightful. 7/10",
    "99": "I am not a huge fan of musicals, especially those made in the 1960s and prior. However, \"White Christmas\" is one of the few musicals I would enjoy, as it always bring in the Christmas spirit in my home. The first time I heard of the White Christmas song by Irving Berlin was actually in this movie.Legendary actors Bing Crosby and Danny Kaye star as two successful song-and-dance actors, who try to save the failing Vermont of their former commanding general (Dean Jagger). In the mean time, they become romantically involved with a sister act, played by Rosemary Clooney and Vera Allen. There is witty comedy and old-fashion romance, provided by the four stars, and scores of toe-tapping musical and dance sequences one after the other.While this movie can be whimsical and some of the musical numbers can drag on at times, the story about the actors going through highs and lows to try to save the inn, with their romantic relationships intertwined in the process, is pretty entertaining to watch. The part where all four sing \"White Christmas\" together is my favorite scene - rich and vibrant in song helped by a children chorus, and a spectacular background containing a large Christmas tree and a beautiful snow scene.Again, I'm not a fan of musicals. But somehow, the Christmas references, albeit brief, made this a pretty enjoyable movie for me.Grade B+",
    "100": "and sentimentalism abound; but it is still a charming and innocent movie, marking the era it was made, 1954. My parents grew up in this era, and I have a remembrance of seeing this film at grandmother's house many, many times.While the story is predictable, it is peppered with musical numbers; interesting cinematography, and believable dialogue. It is also something suitable for young children, as it it creative and sentimental, without being completely saccharine-sweet.Rosemary Clooney is excellent when she sings \"Love, you didn't do right by me\"; the staging is very 50's, and kitschy. Bing Crosby is the straight man, Danny Kaye the comic relief; Vera-Ellen is the dance talent. The scenes where they take the train from Florida, to Vermont, hoping for snow, are pure Americana; The set decoration is original and nostalgic.The costumes and set decoration are quaint and somewhat familiar- It gives the audience a feeling of home, and security- Dean Jagger is the retired army general, and his ski lodge in the 1950's is something we all wish still existed, especially for Christmas in Vermont. If you need good Christmas memories, buy or rent this film- you should also let your kids see this while they are still young and not as cynical; it is a Christmas must, the music and dance numbers are very memorable. It reflects a Christmas past, and innocence we may never have again.",
    "101": "I remember when this movie first came out, and a clip was played from the movie to promote it on television. It was the scene where Rosemary Clooney has been misinformed about what Bing is going to do to promote the show and she slams a chair on the stage and walks off. This was at a time when new Wide-Screen Movies were going a-muck and this was the first movie presented in Vista-Vision one of the many to come our way such as Cinamascope, Super-Scope, Cinerama, and Todd-A-O just to mention a few. So, we know the movie and how entertaining it is, but there is a little history behind it and one of it's stars.Rosemary Cloony, born and raised in Maysville, Kentucky, started singing here in Cincinnati, Ohio with her sister Betty on W.L.W. Radio, and then eventually Rosemary went to New York City and then eventually to Hollywood where she made a few films, but White Christmas was to be her most well known and successful film of her career. I remember when Rosemary made her debut in the movies in \"The Stars Are Singing\" and we were having exams in High School, so after the exams a friend of mine and I went to the Albee Theater and saw her walk in through the Vine Street Stage Door to the theater. Then between showings she got on the stage, sang some songs and talked about how it was so amazing to see herself on that big movie screen. So, years later, Rosemary's brother Nick would be our news anchor at W.K.R.C. television and then his son George Clooney, Rosemarys nephew, would make his mark in Hollywood as an excellent actor. Wonder where he got the talent from? So, Rosemary was on Tom Snyders Show on T.V. and he said, \"I guess you're very proud of George, aren't you?\" And she answered, \"Oh, yes! But when he first came to Hollywood, all he wanted to do was sit on my couch, watch T.V., and drink beer. So, I had to kick his ass out of the house tell him to get a job!\" So, back to White Christmas: One thing that people don't know is that Donald O'Connor was originally scheduled to play the Danny Kaye part but couldn't so he eventually played with Bing Crosby in the remake of \"Anything Goes\", and since Vera Ellen never really had a good singing voice, her voice double was usually Anita Ellis and for Call Me Madam, Carole Richards, who dubbed mostly for Cyd Charisse, but for White Christmas, when Vera Ellen is singing, that's really Rosemary's sister Betty Clooney dubbing for Vera Ellen's singing voice. By the way, Vera Ellen was born and raised in a section of Cincinnati, Ohio called Norwood! We can count our blessings that we have such wonderful entertainers from this city, including Doris Day, George Chakiris, Tyrone Power, and there's a rumor that Roy Rogers was born on the waterfront, and of course, the Looney Clooney's including George!",
    "102": "I am surprised at the number of people who continue to say \"White Christmas\" is a remake of \"Holiday Inn\". Granted, both films include Irving Berlin songs, Bing Crosby, and the song \"White Christmas\", but otherwise it's all different!! I happen to like the film, \"Holiday Inn\", very much, and I like this film as well. But,the characters are different, the plot is different, and so are most of the songs.Both films are holiday classics. Each film can be judged on its own merits.There is one additional comment I'd like to make. Irving Berlin was a shrewd businessman as well as a great composer. For various movie studios, he'd pitch ideas for films (using his music of course and getting film credit above the title), and then not only write new material but revive some of his old songs. This was a very smart way of making money by re-popularizing mostly forgotten songs. By the way, the composer makes money every time his song is played on radio or TV.Not only is \"White Christmas\" an example, but also \"Alexander's Ragtime Band\", \"Blue Skies\", \"Easter Parade\", and \"There's No Business Like Show Business\".",
    "103": "I cannot remember a Christmas season when I did not watch \"White Christmas\" on broadcast television, cable and satellite, at least once. I purchased a VHS copy some years ago, when my job did not permit me to watch it during Christmas Eve with my family. The performances by Bing Crosby, Danny Kaye, Rosemary Clooney, Vera Ellen and Dean Jagger are excellent. The Irving Berlin Music, Choreography, Cinematography, and Direction by Michael Curtiz are outstanding. The rich Technicolor on the film, in wide screen Vistavision format no less, the dancing, singing, the indoor and outdoor scenes(even those on a sound stage), the supporting characters and the staging are wonderful. Rosemary Clooney never looked so beautiful or Bing Crosby more handsome. Danny Kaye is marvelous, dancing and singing, and acting too. This film brings a tear to my eye at the end of the film every time I watch it. I love this film, and never tire of seeing it, year after year. I watch other Christmas movies during the holiday season, but this is my hands down favorite. I would love to find a DVD copy of this movie in a widescreen format similar to Vistavision, to enjoy this classic all over again.",
    "104": "Two old army buddies (Bing Crosby, Danny Kaye) are a successful dancing and singing act. They try to help their ex-general (Dean Jagger) from loosing his Vermont inn. The love interest is provided by Vera Ellen and Rosemary Clooney.I've seen this multiple times (once in a brand new print at a repertory theatre)--and I've never really liked it. It starts off great with Crosby singing the title song to soldiers during WWII--that scene really works and is quietly powerful--but then the film falls to pieces. The script is--to be nice--pretty terrible with a totally predictable plot and tired comedy. None of the actors are given roles to play. Kaye seems lost and Clooney and Ellen try to inject life into their characters. Jagger is also far too mild-mannered to play a tough Army general. Only Crosby with his easy-going charm and Mary Wickes (with the few funny lines) really pull off any acting. The songs are pretty unmemorable--\"What Can You Do With a General\" has got to be one of the all time worst songs I've heard in a movie. All the sets look impressive--but they're very obviously sets--especially the outdoor ones. And there's no snow or anything Christmas-like until the last 5 minutes! This film does have its good points. It was the first film shot in VistaVision (a wide screen process) and the movie takes full advantage of it with a few elaborate production numbers in bright beautiful Technicolor. Also Kaye and Crosby do have a funny number in drag (sort of) and the beautiful, bright color and some interesting costumes keep you mildly interested. All the singing is good and some of the dancing is just incredible (especially with Ellen).But all in all this is too long (a half hour could have been chopped off), too slow and too badly written for me to like it. Give me \"It's A Wonderful Life\" or \"Holiday Inn\" over this. I give this a 5.",
    "105": "Every time I see White Christmas, I think of what a special generation my godparents' is.  This is a warm, admittedly sentimental movie, that just plain old makes you feel good.  Today, that is not such a bad thing.I agree with the previous post about what a great scene it is when the general walks in.  But the scene that moves me even more, and to me is a great piece of camera work, is when the cast begins singing White Christmas again (after the large doors have been opened to expose the snow).  As they sing, the camera pulls back and over the tables to show different people at each table rising to toast each other.  It is a remarkably  poignant scene for me.  Friends toasting old friends.  I tell you it brings a tear to my eye every time and makes me want to go out to dinner with friends and toast them to let them know what they have meant to me in life.  Something like this actually happened.  On my god parent's 50th anniversary, we took them for a weekend at the Lodge at Pebble Beach in Carmel.  During the dinner, someone came in and played \"I'll be Seeing You\" for them on the piano as they danced.  Wasn't a dry eye in the house.That may be a little deep for such a light movie, but it is what makes is work for me.  Any movie that makes you appreciate the important people in your life is all right in my book.  I give it 9 out of 10.",
    "106": "I've been watching this movie for 38 years. It's part of our family holiday tradition to watch White Christmas as well as Holiday Inn, Meet Me in St. Louis, not to mention the many other classics! Susan with her grandfather, Major General Tom Waverly brings me to tears every time. It reminds me of my grandfather who was a proud Marine and how much respect I had for him and still do. He, and his generation are almost gone which is saddest of all.The WWII Generation brought so much class to the movies. There aren't many classic movies anymore which is sad.I'm so glad we have all the classics like White Christmas on DVD to keep our hearts close to all those TRUE Hollywood greats like Bing, RoseMary, Danny and Vera.We miss you all and hope you know how much your performances over the years touched us all! Happy Holidays.",
    "107": "White Christmas (1954) is a movie I recently rewatched for the first time in a long time on Netflix. The storyline follows a a general who has since left the military and runs an inn in Vermont. The inn isn't doing well and his dream is to return to the military for one last go. Some former members of his battalion who are part of a singing group, along with a female group they often perform with, head to the inn in hopes of lifting his spirits and saving the inn.This movie is directed by Michael Curtiz (Casablanca) and stars Bing Crosby (High Society), Vera-Ellen (On the Town), Rosemary Clooney (ER), Danny Kaye (The Court Jester) and Dean Jagger (Vanishing Point).The storyline for this reminded me a little of Patton in how well it depicts the evolution of soldiers/men in the military who after their time served struggle with feeling useful and finding purpose. The songs are well selected and very good and Vera-Ellen was smoking hot. The circumstances have a good buildup and the end is fantastic.Overall this is a very well done holiday film that has depth as well as feel good elements. I would score this a solid 8/10 and strongly recommend it.",
    "108": "\"White Christmas\" is starring the man who made the titular song a smash hit some 80 years ago himself, Mr Bing Crosby alongside the comedy genius of Mr Danny Kaye. Surprisingly it was Danny who amazed me the most in this movie. I've watched him in a couple of movies ranging from mediocre to ok as well as his guest starring role in Lucille Ball's sitcom, \"The Lucy Show\", and everytime I thought to myself: \"Huh, that's not what you call a good acting\". But not in this one.\"White Christmas\" is not only a musical but also a romantic comedy and a drama which is why I loved it. After a slow start which is the first 20 minutes we finally get to know what this movie is all about: people. It's not so hard to make a person smile, let alone do something good for him. That's what this movie has done for me.Bing shines in every scene he's in whereas Danny keeps the pace and sometimes outshines the great performer, especially in a more dramatic scenes; he is a true diamond of this movie and I really enjoyed watching it. Two hours fly by so quickly and you're left with a miraculous feeling of joy in your heart that you never want to get rid of.",
    "109": "It's really difficult for me to apply my usual criticism to White Christmas because doing so is kind of like spitting on a national monument.  This film is so harmless and revered that it can't really be seriously judged against usual criteria.  It is a fun and cute musical comedy, and it is really corny unrealistic but then again so were most musicals in the 1950's.  Add a heavy dose of Christmas cheer and you have what is probably one of the most loved Christmas movies of all time.  One thing I can commend it for is that although it is essentially a remake of `Holiday Inn', they blessedly didn't stoop to the god-awful level of the `Abraham' number at any time during the film.  I also cannot help but laugh every time I see Bing Crosby and Danny Kaye's rendition of Rosemary Clooney and Vera-Ellen's `Sisters' act.Sure it's corny and saccharine, and yes it has some really mediocre musical and dance numbers, but White Christmas does indeed succeed at what it seemingly sets out to do:  Instill nostalgia for care-free times and engage even a little bit of the `Christmas Spirit' in most viewers.  (How can Bing Crosby singing `White Christmas' not make you at least a tiny bit sentimental?)  Besides, at the very least, you can marvel at Vera-Ellen's five inch waist and the fact that Bing ALWAYS looked sixty.--Shelly",
    "110": "This is the sort of thoroughly enjoyable movie that Hollywood has long since lost the talent to make. It's mainly about the singing and dancing, which is all top-notch. The plot is kind of thin, but it is sweet and sentimental. This movie was a product of America's \"greatest generation\", and it is a testament to the fact that that generation truly was better, in every sense, than the generations that followed. It sad that the stars of this movie are all gone, and this probably is true of most everyone who had anything to do with it. Every aspect of the production quality is first-rate. The film quality is superb and has not deteriorated, as evidenced by the superb picture quality on a modern HDTV. Sound recording has improved since then, but the sound quality is as good as it needs to be. Just a thoroughly movie, that allows you to relax for a couple of hours and forget about whatever it is that you worry about. There are no shoot-outs, robberies, rapes, ax murders, or autopsies. It is a sad commentary on where we have come in the sixty years since this movie was made, that Hollywood movies and television shows need to have those elements in order to be financially successful. Well, not always, but more often than not. Call it \"fluff\" if you want, but in spite of being fluff, and partly because of it, \"White Christmas\" is a unique, special movie, pretty much in a category of its own, and without question one of the better movies that was ever made. Merry Christmas.",
    "111": "VISTA VISION...when I see that on the television screen I know exactly what I am about to watch...I used to have to beg the kids to watch it with me....Hopefully though now they are teens they will still want to view it with their old dad...If not I can steal my 8 month old Granddaughter...she's to young to escape. This movie always took me back to the time I was a little boy and watched it with my mom. Hot chocolate, cookies stringing popcorn for the tree and waiting for the movie to be shown on a local station. Thank goodness we now have our favorites on VHS or DVD, so we don't have to worry about time constraints, or cutting out pivotal songs or scenes that add to great shows like this. Just talking about this movie makes me want to start decorating the whole house. I always wondered why Rosemary Clooney wasn't on the soundtrack....Peggy Lee did a good enough job, but it took something away for me....when you are used to hearing Rosie ! Funny how today artists can guest on another artists label and no problem....such were the days I guess.....TV STATIONS if you are going to show the movie...please show the whole thing. May your days be merry and bright.Lee Pecue",
    "112": "I agree with most of the comments, except those of the negative type. You can't accept this movie as great, then you ate too much fruitcake.I love this movie with all my heart. I just love the scenes, dialogue, the goofy corny stuff. Why must people be so serious all the time. Danny Kaye was masterful in this, as was Bing.I watch this movie about 15 times every year between Thanksgiving and Christmas. An uplifting, melodic movie with beautiful people with great thoughts. A must see. 10 out of 10. Vera Ellen dances with the grace of a Forrest doe, lightly on her feet. Her voice given to her is deep and trusting. I have since I was old enough to watch Rosemary Clooney in this movie, and appearing on Cincinnati's \"Bob Braun Show \". A voice so lovely, and so cute. Acting together as sisters is believable, and wholesome. I love how this movie shows kinda how life was in this time.",
    "113": "Danny Kaye is much the more natural here as he (\"Phil\") and successful partner \"Bob\" (Bing Crosby) hook up with the aspiring sister-act team of \"Betty\" (Rosemary Clooney) and \"Judy\" (Vera-Ellen). The latter pair have a gig at a remote Vermont inn, and so after some shenanigans on a train they all arrive to discover it is run by the gents' former wartime CO \"Gen. Waverly\" (Dean Jagger). Determined to come to the aid of this decent and proud man, they concoct a scheme to quite literally rally the troops! The gist of the plot is one of loyalty and integrity, but there is plenty of daft comedy interspersed to keep the whole thing from becoming too earnest or sentimental. The dance numbers are expertly choreographed and the musical numbers from Irving Berlin including the belters \"Sisters\" (with a little help from Gloria Wood) and \"Blue Skies\" keep the toes tapping too... It's a cheery, gentle romantic comedy that puts a smile on your face and reinforces any faith in the human spirit that might need topping up. I always found Crosby a little too slick on screen, but Kaye and Clooney are great and though perhaps just a shade too long, it's still an enjoyable seasonal romp, well worth a watch with some mulled wine and the odd chocolate Santa.",
    "114": "Doesn't something happen inside you when Bing Crosby starts to sing, especially the song that brings back so many memories for many of us - White Christmas? Rosemary Clooney ain't bad either. Danny Kaye is versatile with comedy, dance and decent singing. Vera-Ellen does some amazing dancing that you won't see on Hallmark or Lifetime in more recent movies.Despite the obvious age difference, Crosby and Clooney have that chemistry. Meanwhile Danny Kaye and Vera-Ellen are connecting while their characters scheme because Phil knows that Bob is a \"miserable\" man.Even nearly 7 decades ago, the misunderstood overheard conversation creates the conflict that takes longer to clean up than most of today's movies.A good story, good acting and great song and dance make this movie a classic to watch over and over.",
    "115": "Great move, great music, great fun.Is the movie, perfect? No, of course it isn't. But the missteps, and continuity problems can be forgiven. I have watched this movie every Christmas since I was a girl (many moons ago) and still love it.This year for the first time I noticed some problems. For example, some of the male dancers that are on staff with the Wallace and Davis show, are the same guys who dance in the night club act with Rosemary Clooney's character. Nevertheless, it can all be forgiven.I look at these old movies as stepping back in time to something less complicated-a time when women wore fancy dresses and night clubs were a great form of entertainment.Men, Women, Romance, Good Music, No Serious Problems--it's all good for me.",
    "116": "You still see it on the DVD racks every year at this time of year and can also guarantee its appearance on TV over the Christmas schedules so is there anyone out there who hasn't seen this old warhorse of a Christmas movie? Well, me for one, so with the snow thick on the ground for the first Scottish \"white Christmas\" in 9 years, what better time to break my duck...Personally I'd have preferred to have seen its predecessor \"Holiday Inn\" with an in-his-prime\" Fred Astaire in the Danny Kaye part, but that will have to wait for another year. Besides I like Kaye and while he gets a few dances alongside Vera Ellen and her impossibly thin legs, he's principally there, of course as a less sour Bob Hope to old Bing's holier-than-thou straight man.The story is of course hokum on a stick but I'll temper any cynicism with the thought of the relevance of the tie-in of Christmas to soldiers to the US cinema-going public of the time, not only so soon after the end of the Second World War, but with the then current war in Korea under way (isn't that always the way with wars, they just keep on coming).The four stars all act engagingly, with good support too from Dean Jagger as the revered major-general and Mary Wickes as his owlish receptionist, although I would carp that some of the song and dance routines are fairly unexciting, the movie does look awfully set-bound and it was a shame to see some fairly obvious lip-sync-hing on the big numbers. I also didn't understand why in the resolution of the misunderstanding of Crosby's motives in staging the big holiday pageant at their old commander's financially ailing resort, the director missed the chance to show the dawning of the truth on \"mistaken messenger\", Wickes, but by the time they \"open up\" the gates to let in the snow and the familiar strains of THAT song by the conclusion, there isn't a dry eye in the house.Irving Berlin's soundtrack is as ever, tuneful and pleasing, with the wit of the lyrics of his \"army\" songs, in particular, highlighting an underrated part of his talent. The photography is beautifully colourful and old maestro Micahael Curtiz unobtrusively and efficiently bringing this slight story to life.All in all, a pleasant release from today's wears and scares and I hope that anyone who watches it in the future gets to do so to a snowy backdrop outside, like I did as it somehow adds to the lustre of the film.",
    "117": "I have watched \"White Christmas,\" a hundred times, and to me it is a Classic. It's a feel good movie, with four top notch entertainers. Crosby is great. Danny Kaye is my favorite guy, he was wonderful as usual. RoseMary Clooney was terrific,and what a great shape she had, and such a velvety voice, and Vera-Allen was superb in her dancing but ghastly thin. Also I thought she really played to the camera way to much, always turning toward the camera, when she should have been looking at her dance partner, or when the four of them were singing \"Snow.\" I have so many different favorite parts to the movie that I love, one is Danny Kaye & Vera-Allen dancing to \"The best things happen when your dancing.\" Danny's \"Choreography\" number.I like the \"Abraham,\" number, but found myself watching John Brascia more than Vera-Allen. What a talent he was. I loved watching Mary Wickes, she was such a delight. It was so cute when she kissed Danny and Bing, she held that kiss a very long time. Loved Barri Chase as Doris (Mutual I'm sure) Loved when Danny announced his engagement, when she said, I sure wish it would happen to me, the guy she was dancing with heard her say that, and quickly moved away from her. LOL I'll be watching this movie for a long time, one of the best Christmas Movies of all time. Ruth",
    "118": "I know my words may not be as authoritative, knowledgable or mockishly sly as the other review/comments posted about this film, but I just had to write something.I love this film.  I don't exactly know why.  I know this is the one film I've been waiting to appear on DVD and it will be out in November (if that means anything to anyone).  I guess I had to write just to say that I didn't find the film as schmaltzy or...I have to say it...as bad as the other reviewer did.  They didn't say it outright but it's kind of implied.I think Bing and Danny are great in this film.  I really liked \"Holiday Inn\" as well, but I like Danny so much better than Fred Astair (if we're comparing the films and their very loosely similar stories).  I liked Rosemary Clooney and Bing playing off of each other (I just wish that Rosemary's vocals could have been included on the soundtrack.  Her version of \"Love, You Didn't Do Right By Me\" is wonderful) and Vera-Ellen (though maybe not the best actress) makes the dance numbers pop through the screen.\nIt might have been bigger and louder to compete with TV, but this is a great movie no matter how you cut it.  Just try it and see.",
    "119": "Sadly, it doesn't feel so good that almost every member of the cast & crew of this film is no longer with us, but this work that they have left is very watchable. This film was shot in color & wide screen & it still looks plush & alive even now. The way to watch it is when Turner Classic films is running it in wide screen too. This film is one of the only times Danny Kaye & Bing Crosby worked together & it is a shame it did not happen more. They are delightful in this film. Rosemary Clooney & Vera Ellen are too. This Paramount production was one of the most expensive they produced the year it was released & it was also number 1 in the box office.While the story is very simplistic by today's standards & even when it was released in 1954, it doesn't matter. You put your brain away & enjoy this holiday film as a rare chance to see some veteran performers from the World War 2 era entertain you. There's lots of musical numbers & dancing from the era of the big musical. All of it is well staged, & the music is at the height previous to rock & roll era. If your into old films, go back to the mid-1940's when Bing Crosby did the song \"White Christmas\" for the first time on film in Paramounts \"Holiday Inn\" as there are a couple of comparisons to note. First, Bing sings the song solo in the first film where in this 1954 version the entire ensemble (cast) sing it together. Second, the Holiday Inn is the same set used for the Pine Tree Inn in the second film. Paramount saved some money on sets there. Funny, Crosby gets demoted too in a way. In the first film he actually owns the Holiday Inn where in this film, his former Major-general owns it. The scripts between the 2 are quite different too. Fred Astaire is in the first one in 1942 too. In a way, some folks consider this an inferior remake to Holiday Inn, but to me there are vast differences in the films. White Christmas fits the era it was made, as 1954 was a feel good era where every problem was always being solved. An interesting thing about this film, it incorporates the power of the television media into the plot already in 1954. Most folks then did not realize how far that power would grow into todays national fixation where if something is on TV, too often people believe it as true. Back in 1954, people were still intelligent enough to know when something was not true on its media. That is why you don't care about a strong story line in this film. Everything is fake, but back then fake was fine with people, as long as it was harmless & entertaining.",
    "120": "Pour yourself out a nice big boatload of gravy to go with this gigantic slice of holiday ham....I love this movie, and I'm not ashamed to admit it. I don't even feel like doing a critical analysis of it, or talking about the acting, or anything of the kind. It's not even a good movie, really, and it suffers from that ugly 50s look from which so many movies from the decade suffered, when they thought the way to compete with television was to build enormous screens and cram them full of saturated color...Michael Curtiz and company make only the barest attempt at adhering to anything resembling a plot, and what plot there is could hardly be called coherent. This film was one of the last gasps of the \"Let's put on a show!\" genre, as well as one of the last shameless attempts to tearjerk a WWII recovering audience into submission.This movie contains more corn than Nebraska, and God love it for that.Grade: A",
    "121": "\"White Christmas\" is a pleasant but quite formulaic musical--a decent time-passer but not a lot more. However, rather inexplicably, the film turned out to be the #1 box office champ of the year--something I just don't understand when I see it today.The film begins during WWII. Bing Crosby and Danny Kaye play soldiers who are entertaining the troops during Christmas. Soon, the war is over and the two go on to Broadway and become a huge musical team--absolutely huge. The problem is that Kaye is dissatisfied, as they are always working---and his partner is always thinking of business. So, he comes up with a plan--get Bing married and then they'll have to take it easier! And, when the duo meet two musical sisters (Vera-Ellen and Rosemary Clooney), Danny and Vera just decide that Bing MUST marry Rosemary---just like that! Not surprisingly, there are MANY bumps and misunderstandings along the way--as, after all, it IS a very formulaic relationship. What is not exactly formula, however, is the parallel plot involving Danny and Bing's old commander--the General. The General is running a hotel in Vermont--but it's failing due to unusually hot weather. So, the four decide to get together and perform a show--just the sort of thing Mickey Rooney and Judy Garland would have done a decade and a half earlier.The film has a lot of pluses and minuses. As I mentioned above, the film is easy to predict due to its strong use of traditional film formulas. However, the actors did a nice job with what they had. My biggest complaint about the film were all the song and dance numbers. There were just too many and many were quite forgettable. Several could have been cut and more emphasis should have been on plot--but, considering how successful the film was, what do I know? I just know that today the film is a bit sluggish because of this. You cannot trim the title song, but a bit of trimming would have tightened up the film and kept a better pace. Overall, it's uneven but enjoyable.",
    "122": "The spirit of Christmas is alive and well in this delightful musical which features a number of songs, as well as an original score by Irving Berlin, entertainingly presented by the crooner, the comic, the singer and the dancer-- and not necessarily in that order.  It's `White Christmas,' directed by Michael Curtiz and starring Bing Crosby, Danny Kaye, Rosemary Clooney and Vera-Ellen.  One of the most popular films of 1954, it opens and closes with the title song, while in between it's filled with one great musical number after another.  It's just after the Second World War; the popular General Waverly (Dean Jagger) has retired to run an inn in Vermont, while a couple of his men, Captain Bob Wallace (Crosby) and Private Phil Davis (Kaye) have gone on to fame and fortune in show biz.  During a Christmas break from their successful show in New York, Wallace and Davis follow an up-and-coming act known as `The Haynes Sisters' (Clooney and Vera-Ellen) to Vermont, where they discover their former commander is in trouble; there hasn't been any snow this year, and no snow means no business at the inn for General Waverly.  But not to worry; with Wallace and Davis on hand, as well as the Haynes sisters, the General's problems are as good as solved.  It's just a matter of figuring out exactly how to go about it, which-- and, of course, it's not much of a surprise-- they do.  And along the way the audience is treated to some spirited and memorable production numbers.  They just don't make em like this any more, and it's a shame. Because this is pure entertainment, and one great show.\tVeteran director Curtiz, who directed his first film in 1912 in his native Hungary, consistently demonstrated his versatility again and again with films ranging from `Yankee Doodle Dandy,' `Life With Father' and `Casablanca,' to later fare such as `King Creole' in 1958 (which starred Elvis Presley).  And with this one he certainly proved that he knew his way around a musical.  Granted, it was hard to go wrong with Crosby, Kaye, Clooney and Vera-Ellen on board, but there's a big difference between delivering a finished product and making a great movie; and this one definitely falls into the latter category.  The story is solid, and Curtiz makes the most of the talent at his disposal.  Bing is at his best, and the antics of Danny Kaye are a joy to behold, as are the delightful song stylings of Rosemary Clooney.  But with all that talent on hand, the single element that truly takes this film to that higher plateau is the presence of the perky and winsome Vera-Ellen.  \tThought by many to be the best dancer ever to be a part of the studio system, Vera-Ellen is an absolute delight in this film.  Though she couldn't sing (her singing was dubbed by Trudy Stevens), what she could do on a dance floor more than made up for it.  Whether it's the `Sisters' number with Clooney, one with Danny Kaye or just with the guys in the chorus, she is mesmerizing to watch.  It may be a style that defines another era, but when she's dancing-- like Gene Kelley-- it's a timeless proposition and becomes entertainment that belongs to the ages.  It's just such a joy to watch someone like Vera-Ellen do what she does best.  It's transporting.  And when you consider that she is but a part of the equation here, it's easy to understand why this film remains so popular to this day. \n\tThe wonderful Danny Kaye gives a terrific performance here, as well.  It may lack one of the tongue-twisting numbers he was famous for, but he still has ample opportunities to showcase his many and varied talents, which he most certainly does.  There was never any question that this was Bing's picture, but he couldn't have asked for a better second banana than the charismatic Kaye who, like Vera-Ellen, is virtually spellbinding when he's doing what he does best, which is just about anything he does in this film, whether it's singing, dancing, mugging or just throwing out a line to Crosby.  \tClooney's part may not be as flashy as those of her co-stars, but she sure can sell a song, and whether it's a solo or a duet with Bing or Vera-Ellen, there's no doubt that it's another of the many strengths of this film.  And she mixes well with the laid-back Bing who, though clearly the star of the show, demonstrates his generosity as an actor by always allowing and never begrudging his co-stars their time in the spotlight.  Crosby was a star and he knew it without having to prove anything; he also knew there was plenty of star dust to go around, and because he let it his movies (this one included) were all the better for it.  \tThe supporting cast includes Mary Wickes (Emma), John Brascia (Joe), Anne Whitfield (Susan), Richard Shannon (Adjutant), Grady Sutton (General's guest), Herb Vigran (Novello), Johnny Grant (Ed Harrison) and Percy Herbert (Train Conductor).  Thoroughly entertaining in the truest sense of the word, `White Christmas' is an engaging, enduring and uplifting film that will whisk you away to a magic place in your heart and in your mind.  It's so refreshing to take this journey to a time that may not have in reality been any easier, but at least seemed simpler and somehow less convoluted than our present era of `political correctness.'  A time in which films like this one were not only able to be made, but were subsequently welcomed and embraced by audiences everywhere.  Today, we have `Harry Potter,' a new kind of magic and a great film in it's own right; but there will always be a place for Bing and his bunch, because theirs was a magic all their own, the kind that's lasting and immortal.  And it's all a part of the magic of the movies.  I rate this one 10/10.",
    "123": "It's hard to imagine Christmas without Bing Crosby and the song \"White Christmas\", so embedded in pop culture is that combination.  Here (though not for the first time), Crosby croons the title song as an entire film is built around it.  The plot is very thin, almost a throwback to the \"Hey! Let's put on a show in the barn!\"-type of Mickey Rooney/Judy Garland films. Here, Crosby and war buddy Kaye have developed a major variety act and, as a favor, help out Vera-Ellen and Clooney who find themselves in a jam.  The latter two are \"Sisters\" (as the song says.....and SAYS throughout!) who are booked into a ski lodge that has no snow in sight!  When Crosby and Kaye find that it's owned by their old general (Jagger), they decide to draw crowds with a huge Broadway-level show at the lodge.  A few minor romantic connections and complications are sprinkled in between the lavish musical numbers.  Casting is downright bizarre with relation to the script, but somehow the actors pull it off. Crosby, at 51, is way too old to be playing a recently discharged soldier who just hasn't found the right girl to settle down with and have \"nine kids\"!  He gives the film his patented slick performance (and there's a lot of make-up here!)  Kaye, in for an eleventh hour-departing Donald O'Connor, does a decent job.  He and Crosby do a somewhat uncomfortable number in partial drag with Crosby practically cracking up near the end of it.  Clooney, though younger than Vera-Ellen plays the older sister.  She is paired with Crosby who is twice her age. Her stellar voice is given a decent workout on several songs and she's a lovely, natural presence in the film.  Vera-Ellen is undeniably talented as a dancer and really gets to strut her stuff here.  However, she is ghastly thin, with a waistline that gives new meaning to \"wasp-waist\".  Her costumes all come up to her chin (and it was later revealed that Edith Head had to costume her this way to cover up a neck that was practically ruined by anorexia.)  In fact, it's rather sad to think that the stars who worked so hard to provide a charming, pleasing, perennial film fought such harrowing demons themselves.  Aside from Vera-Ellen's anorexia, Clooney suffered a nervous breakdown, Crosby had a tumultuous relationship with his sons and Kaye was reported to have some difficult sexual proclivities.  But, in any case, they left a colorful, sentimental film behind which, for many, is a yearly must-see.  Not every song is a stunner, but enough of them score a bullseye to make this worth viewing.  Also of note are Jagger's sentimental turn as the retired general and Wickes' busy-body housekeeper.  There are some nice costumes throughout, but none more dazzling than the ladies' long red gowns with white fur trim at the end.  It all ends as one would hope and no one is going to strain his brain trying to figure out the storyline, but for a cup of Christmas cheer, it hits the spot.",
    "124": "VISTA VISION...when I see that on the television screen I know exactly what I am about to watch...I used to have to beg the kids to watch it with me....Hopefully though now they are teens they will still want to view it with their old dad...If not I can steal my 8 month old Granddaughter...she's to young to escape. This movie always took me back to the time I was a little boy and watched it with my mom. Hot chocolate, cookies stringing popcorn for the tree and waiting for the movie to be shown on a local station. Thank goodness we now have our favorites on VHS or DVD, so we don't have to worry about time constraints, or cutting out pivotal songs or scenes that add to great shows like this. Just talking about this movie makes me want to start decorating the whole house. I always wondered why Rosemary Clooney wasn't on the soundtrack....Peggy Lee did a good enough job, but it took something away for me....when you are used to hearing Rosie ! Funny how today artists can guest on another artists label and no problem....such were the days I guess.....TV STATIONS if you are going to show the movie...please show the whole thing. May your days be merry and bright.Lee Pecue",
    "125": "I agree with most of the comments, except those of the negative type. You can't accept this movie as great, then you ate too much fruitcake.I love this movie with all my heart. I just love the scenes, dialogue, the goofy corny stuff. Why must people be so serious all the time. Danny Kaye was masterful in this, as was Bing.I watch this movie about 15 times every year between Thanksgiving and Christmas. An uplifting, melodic movie with beautiful people with great thoughts. A must see. 10 out of 10. Vera Ellen dances with the grace of a Forrest doe, lightly on her feet. Her voice given to her is deep and trusting. I have since I was old enough to watch Rosemary Clooney in this movie, and appearing on Cincinnati's \"Bob Braun Show \". A voice so lovely, and so cute. Acting together as sisters is believable, and wholesome. I love how this movie shows kinda how life was in this time.",
    "126": "Danny Kaye is much the more natural here as he (\"Phil\") and successful partner \"Bob\" (Bing Crosby) hook up with the aspiring sister-act team of \"Betty\" (Rosemary Clooney) and \"Judy\" (Vera-Ellen). The latter pair have a gig at a remote Vermont inn, and so after some shenanigans on a train they all arrive to discover it is run by the gents' former wartime CO \"Gen. Waverly\" (Dean Jagger). Determined to come to the aid of this decent and proud man, they concoct a scheme to quite literally rally the troops! The gist of the plot is one of loyalty and integrity, but there is plenty of daft comedy interspersed to keep the whole thing from becoming too earnest or sentimental. The dance numbers are expertly choreographed and the musical numbers from Irving Berlin including the belters \"Sisters\" (with a little help from Gloria Wood) and \"Blue Skies\" keep the toes tapping too... It's a cheery, gentle romantic comedy that puts a smile on your face and reinforces any faith in the human spirit that might need topping up. I always found Crosby a little too slick on screen, but Kaye and Clooney are great and though perhaps just a shade too long, it's still an enjoyable seasonal romp, well worth a watch with some mulled wine and the odd chocolate Santa.",
    "127": "Doesn't something happen inside you when Bing Crosby starts to sing, especially the song that brings back so many memories for many of us - White Christmas? Rosemary Clooney ain't bad either. Danny Kaye is versatile with comedy, dance and decent singing. Vera-Ellen does some amazing dancing that you won't see on Hallmark or Lifetime in more recent movies.Despite the obvious age difference, Crosby and Clooney have that chemistry. Meanwhile Danny Kaye and Vera-Ellen are connecting while their characters scheme because Phil knows that Bob is a \"miserable\" man.Even nearly 7 decades ago, the misunderstood overheard conversation creates the conflict that takes longer to clean up than most of today's movies.A good story, good acting and great song and dance make this movie a classic to watch over and over.",
    "128": "Great move, great music, great fun.Is the movie, perfect? No, of course it isn't. But the missteps, and continuity problems can be forgiven. I have watched this movie every Christmas since I was a girl (many moons ago) and still love it.This year for the first time I noticed some problems. For example, some of the male dancers that are on staff with the Wallace and Davis show, are the same guys who dance in the night club act with Rosemary Clooney's character. Nevertheless, it can all be forgiven.I look at these old movies as stepping back in time to something less complicated-a time when women wore fancy dresses and night clubs were a great form of entertainment.Men, Women, Romance, Good Music, No Serious Problems--it's all good for me.",
    "129": "You still see it on the DVD racks every year at this time of year and can also guarantee its appearance on TV over the Christmas schedules so is there anyone out there who hasn't seen this old warhorse of a Christmas movie? Well, me for one, so with the snow thick on the ground for the first Scottish \"white Christmas\" in 9 years, what better time to break my duck...Personally I'd have preferred to have seen its predecessor \"Holiday Inn\" with an in-his-prime\" Fred Astaire in the Danny Kaye part, but that will have to wait for another year. Besides I like Kaye and while he gets a few dances alongside Vera Ellen and her impossibly thin legs, he's principally there, of course as a less sour Bob Hope to old Bing's holier-than-thou straight man.The story is of course hokum on a stick but I'll temper any cynicism with the thought of the relevance of the tie-in of Christmas to soldiers to the US cinema-going public of the time, not only so soon after the end of the Second World War, but with the then current war in Korea under way (isn't that always the way with wars, they just keep on coming).The four stars all act engagingly, with good support too from Dean Jagger as the revered major-general and Mary Wickes as his owlish receptionist, although I would carp that some of the song and dance routines are fairly unexciting, the movie does look awfully set-bound and it was a shame to see some fairly obvious lip-sync-hing on the big numbers. I also didn't understand why in the resolution of the misunderstanding of Crosby's motives in staging the big holiday pageant at their old commander's financially ailing resort, the director missed the chance to show the dawning of the truth on \"mistaken messenger\", Wickes, but by the time they \"open up\" the gates to let in the snow and the familiar strains of THAT song by the conclusion, there isn't a dry eye in the house.Irving Berlin's soundtrack is as ever, tuneful and pleasing, with the wit of the lyrics of his \"army\" songs, in particular, highlighting an underrated part of his talent. The photography is beautifully colourful and old maestro Micahael Curtiz unobtrusively and efficiently bringing this slight story to life.All in all, a pleasant release from today's wears and scares and I hope that anyone who watches it in the future gets to do so to a snowy backdrop outside, like I did as it somehow adds to the lustre of the film.",
    "130": "I have watched \"White Christmas,\" a hundred times, and to me it is a Classic. It's a feel good movie, with four top notch entertainers. Crosby is great. Danny Kaye is my favorite guy, he was wonderful as usual. RoseMary Clooney was terrific,and what a great shape she had, and such a velvety voice, and Vera-Allen was superb in her dancing but ghastly thin. Also I thought she really played to the camera way to much, always turning toward the camera, when she should have been looking at her dance partner, or when the four of them were singing \"Snow.\" I have so many different favorite parts to the movie that I love, one is Danny Kaye & Vera-Allen dancing to \"The best things happen when your dancing.\" Danny's \"Choreography\" number.I like the \"Abraham,\" number, but found myself watching John Brascia more than Vera-Allen. What a talent he was. I loved watching Mary Wickes, she was such a delight. It was so cute when she kissed Danny and Bing, she held that kiss a very long time. Loved Barri Chase as Doris (Mutual I'm sure) Loved when Danny announced his engagement, when she said, I sure wish it would happen to me, the guy she was dancing with heard her say that, and quickly moved away from her. LOL I'll be watching this movie for a long time, one of the best Christmas Movies of all time. Ruth",
    "131": "I know my words may not be as authoritative, knowledgable or mockishly sly as the other review/comments posted about this film, but I just had to write something.I love this film.  I don't exactly know why.  I know this is the one film I've been waiting to appear on DVD and it will be out in November (if that means anything to anyone).  I guess I had to write just to say that I didn't find the film as schmaltzy or...I have to say it...as bad as the other reviewer did.  They didn't say it outright but it's kind of implied.I think Bing and Danny are great in this film.  I really liked \"Holiday Inn\" as well, but I like Danny so much better than Fred Astair (if we're comparing the films and their very loosely similar stories).  I liked Rosemary Clooney and Bing playing off of each other (I just wish that Rosemary's vocals could have been included on the soundtrack.  Her version of \"Love, You Didn't Do Right By Me\" is wonderful) and Vera-Ellen (though maybe not the best actress) makes the dance numbers pop through the screen.\nIt might have been bigger and louder to compete with TV, but this is a great movie no matter how you cut it.  Just try it and see.",
    "132": "Sadly, it doesn't feel so good that almost every member of the cast & crew of this film is no longer with us, but this work that they have left is very watchable. This film was shot in color & wide screen & it still looks plush & alive even now. The way to watch it is when Turner Classic films is running it in wide screen too. This film is one of the only times Danny Kaye & Bing Crosby worked together & it is a shame it did not happen more. They are delightful in this film. Rosemary Clooney & Vera Ellen are too. This Paramount production was one of the most expensive they produced the year it was released & it was also number 1 in the box office.While the story is very simplistic by today's standards & even when it was released in 1954, it doesn't matter. You put your brain away & enjoy this holiday film as a rare chance to see some veteran performers from the World War 2 era entertain you. There's lots of musical numbers & dancing from the era of the big musical. All of it is well staged, & the music is at the height previous to rock & roll era. If your into old films, go back to the mid-1940's when Bing Crosby did the song \"White Christmas\" for the first time on film in Paramounts \"Holiday Inn\" as there are a couple of comparisons to note. First, Bing sings the song solo in the first film where in this 1954 version the entire ensemble (cast) sing it together. Second, the Holiday Inn is the same set used for the Pine Tree Inn in the second film. Paramount saved some money on sets there. Funny, Crosby gets demoted too in a way. In the first film he actually owns the Holiday Inn where in this film, his former Major-general owns it. The scripts between the 2 are quite different too. Fred Astaire is in the first one in 1942 too. In a way, some folks consider this an inferior remake to Holiday Inn, but to me there are vast differences in the films. White Christmas fits the era it was made, as 1954 was a feel good era where every problem was always being solved. An interesting thing about this film, it incorporates the power of the television media into the plot already in 1954. Most folks then did not realize how far that power would grow into todays national fixation where if something is on TV, too often people believe it as true. Back in 1954, people were still intelligent enough to know when something was not true on its media. That is why you don't care about a strong story line in this film. Everything is fake, but back then fake was fine with people, as long as it was harmless & entertaining.",
    "133": "Pour yourself out a nice big boatload of gravy to go with this gigantic slice of holiday ham....I love this movie, and I'm not ashamed to admit it. I don't even feel like doing a critical analysis of it, or talking about the acting, or anything of the kind. It's not even a good movie, really, and it suffers from that ugly 50s look from which so many movies from the decade suffered, when they thought the way to compete with television was to build enormous screens and cram them full of saturated color...Michael Curtiz and company make only the barest attempt at adhering to anything resembling a plot, and what plot there is could hardly be called coherent. This film was one of the last gasps of the \"Let's put on a show!\" genre, as well as one of the last shameless attempts to tearjerk a WWII recovering audience into submission.This movie contains more corn than Nebraska, and God love it for that.Grade: A",
    "134": "\"White Christmas\" is a pleasant but quite formulaic musical--a decent time-passer but not a lot more. However, rather inexplicably, the film turned out to be the #1 box office champ of the year--something I just don't understand when I see it today.The film begins during WWII. Bing Crosby and Danny Kaye play soldiers who are entertaining the troops during Christmas. Soon, the war is over and the two go on to Broadway and become a huge musical team--absolutely huge. The problem is that Kaye is dissatisfied, as they are always working---and his partner is always thinking of business. So, he comes up with a plan--get Bing married and then they'll have to take it easier! And, when the duo meet two musical sisters (Vera-Ellen and Rosemary Clooney), Danny and Vera just decide that Bing MUST marry Rosemary---just like that! Not surprisingly, there are MANY bumps and misunderstandings along the way--as, after all, it IS a very formulaic relationship. What is not exactly formula, however, is the parallel plot involving Danny and Bing's old commander--the General. The General is running a hotel in Vermont--but it's failing due to unusually hot weather. So, the four decide to get together and perform a show--just the sort of thing Mickey Rooney and Judy Garland would have done a decade and a half earlier.The film has a lot of pluses and minuses. As I mentioned above, the film is easy to predict due to its strong use of traditional film formulas. However, the actors did a nice job with what they had. My biggest complaint about the film were all the song and dance numbers. There were just too many and many were quite forgettable. Several could have been cut and more emphasis should have been on plot--but, considering how successful the film was, what do I know? I just know that today the film is a bit sluggish because of this. You cannot trim the title song, but a bit of trimming would have tightened up the film and kept a better pace. Overall, it's uneven but enjoyable.",
    "135": "The spirit of Christmas is alive and well in this delightful musical which features a number of songs, as well as an original score by Irving Berlin, entertainingly presented by the crooner, the comic, the singer and the dancer-- and not necessarily in that order.  It's `White Christmas,' directed by Michael Curtiz and starring Bing Crosby, Danny Kaye, Rosemary Clooney and Vera-Ellen.  One of the most popular films of 1954, it opens and closes with the title song, while in between it's filled with one great musical number after another.  It's just after the Second World War; the popular General Waverly (Dean Jagger) has retired to run an inn in Vermont, while a couple of his men, Captain Bob Wallace (Crosby) and Private Phil Davis (Kaye) have gone on to fame and fortune in show biz.  During a Christmas break from their successful show in New York, Wallace and Davis follow an up-and-coming act known as `The Haynes Sisters' (Clooney and Vera-Ellen) to Vermont, where they discover their former commander is in trouble; there hasn't been any snow this year, and no snow means no business at the inn for General Waverly.  But not to worry; with Wallace and Davis on hand, as well as the Haynes sisters, the General's problems are as good as solved.  It's just a matter of figuring out exactly how to go about it, which-- and, of course, it's not much of a surprise-- they do.  And along the way the audience is treated to some spirited and memorable production numbers.  They just don't make em like this any more, and it's a shame. Because this is pure entertainment, and one great show.\tVeteran director Curtiz, who directed his first film in 1912 in his native Hungary, consistently demonstrated his versatility again and again with films ranging from `Yankee Doodle Dandy,' `Life With Father' and `Casablanca,' to later fare such as `King Creole' in 1958 (which starred Elvis Presley).  And with this one he certainly proved that he knew his way around a musical.  Granted, it was hard to go wrong with Crosby, Kaye, Clooney and Vera-Ellen on board, but there's a big difference between delivering a finished product and making a great movie; and this one definitely falls into the latter category.  The story is solid, and Curtiz makes the most of the talent at his disposal.  Bing is at his best, and the antics of Danny Kaye are a joy to behold, as are the delightful song stylings of Rosemary Clooney.  But with all that talent on hand, the single element that truly takes this film to that higher plateau is the presence of the perky and winsome Vera-Ellen.  \tThought by many to be the best dancer ever to be a part of the studio system, Vera-Ellen is an absolute delight in this film.  Though she couldn't sing (her singing was dubbed by Trudy Stevens), what she could do on a dance floor more than made up for it.  Whether it's the `Sisters' number with Clooney, one with Danny Kaye or just with the guys in the chorus, she is mesmerizing to watch.  It may be a style that defines another era, but when she's dancing-- like Gene Kelley-- it's a timeless proposition and becomes entertainment that belongs to the ages.  It's just such a joy to watch someone like Vera-Ellen do what she does best.  It's transporting.  And when you consider that she is but a part of the equation here, it's easy to understand why this film remains so popular to this day. \n\tThe wonderful Danny Kaye gives a terrific performance here, as well.  It may lack one of the tongue-twisting numbers he was famous for, but he still has ample opportunities to showcase his many and varied talents, which he most certainly does.  There was never any question that this was Bing's picture, but he couldn't have asked for a better second banana than the charismatic Kaye who, like Vera-Ellen, is virtually spellbinding when he's doing what he does best, which is just about anything he does in this film, whether it's singing, dancing, mugging or just throwing out a line to Crosby.  \tClooney's part may not be as flashy as those of her co-stars, but she sure can sell a song, and whether it's a solo or a duet with Bing or Vera-Ellen, there's no doubt that it's another of the many strengths of this film.  And she mixes well with the laid-back Bing who, though clearly the star of the show, demonstrates his generosity as an actor by always allowing and never begrudging his co-stars their time in the spotlight.  Crosby was a star and he knew it without having to prove anything; he also knew there was plenty of star dust to go around, and because he let it his movies (this one included) were all the better for it.  \tThe supporting cast includes Mary Wickes (Emma), John Brascia (Joe), Anne Whitfield (Susan), Richard Shannon (Adjutant), Grady Sutton (General's guest), Herb Vigran (Novello), Johnny Grant (Ed Harrison) and Percy Herbert (Train Conductor).  Thoroughly entertaining in the truest sense of the word, `White Christmas' is an engaging, enduring and uplifting film that will whisk you away to a magic place in your heart and in your mind.  It's so refreshing to take this journey to a time that may not have in reality been any easier, but at least seemed simpler and somehow less convoluted than our present era of `political correctness.'  A time in which films like this one were not only able to be made, but were subsequently welcomed and embraced by audiences everywhere.  Today, we have `Harry Potter,' a new kind of magic and a great film in it's own right; but there will always be a place for Bing and his bunch, because theirs was a magic all their own, the kind that's lasting and immortal.  And it's all a part of the magic of the movies.  I rate this one 10/10.",
    "136": "It's hard to imagine Christmas without Bing Crosby and the song \"White Christmas\", so embedded in pop culture is that combination.  Here (though not for the first time), Crosby croons the title song as an entire film is built around it.  The plot is very thin, almost a throwback to the \"Hey! Let's put on a show in the barn!\"-type of Mickey Rooney/Judy Garland films. Here, Crosby and war buddy Kaye have developed a major variety act and, as a favor, help out Vera-Ellen and Clooney who find themselves in a jam.  The latter two are \"Sisters\" (as the song says.....and SAYS throughout!) who are booked into a ski lodge that has no snow in sight!  When Crosby and Kaye find that it's owned by their old general (Jagger), they decide to draw crowds with a huge Broadway-level show at the lodge.  A few minor romantic connections and complications are sprinkled in between the lavish musical numbers.  Casting is downright bizarre with relation to the script, but somehow the actors pull it off. Crosby, at 51, is way too old to be playing a recently discharged soldier who just hasn't found the right girl to settle down with and have \"nine kids\"!  He gives the film his patented slick performance (and there's a lot of make-up here!)  Kaye, in for an eleventh hour-departing Donald O'Connor, does a decent job.  He and Crosby do a somewhat uncomfortable number in partial drag with Crosby practically cracking up near the end of it.  Clooney, though younger than Vera-Ellen plays the older sister.  She is paired with Crosby who is twice her age. Her stellar voice is given a decent workout on several songs and she's a lovely, natural presence in the film.  Vera-Ellen is undeniably talented as a dancer and really gets to strut her stuff here.  However, she is ghastly thin, with a waistline that gives new meaning to \"wasp-waist\".  Her costumes all come up to her chin (and it was later revealed that Edith Head had to costume her this way to cover up a neck that was practically ruined by anorexia.)  In fact, it's rather sad to think that the stars who worked so hard to provide a charming, pleasing, perennial film fought such harrowing demons themselves.  Aside from Vera-Ellen's anorexia, Clooney suffered a nervous breakdown, Crosby had a tumultuous relationship with his sons and Kaye was reported to have some difficult sexual proclivities.  But, in any case, they left a colorful, sentimental film behind which, for many, is a yearly must-see.  Not every song is a stunner, but enough of them score a bullseye to make this worth viewing.  Also of note are Jagger's sentimental turn as the retired general and Wickes' busy-body housekeeper.  There are some nice costumes throughout, but none more dazzling than the ladies' long red gowns with white fur trim at the end.  It all ends as one would hope and no one is going to strain his brain trying to figure out the storyline, but for a cup of Christmas cheer, it hits the spot.",
    "137": "Here we see one of the later examples of a subgenre that now seems to be extinct  the backstage musical  a song-and-dance movie in which the characters were themselves players in a show, and rather than bursting into song at any given moment, the musical numbers would all be in-context stage pieces. Plots would usually be flimsy and repetitive, and most of the effort would go into spectacular musical presentations. Even though it's now looked on as a rather outdated way of doing things, the backstager gave us many of our finest musicals  the Busby Berkeley pictures of the early 30s, the Fred Astaire/Ginger Rogers vehicles, and more recently the Arthur Freed production of The Band Wagon. As with any picture, it's all about getting the key elements right or wrong as the case may be.The story of White Christmas is appropriately light, just enough to make an excuse for a string of musical numbers, allow for some romance between the principle players, as well as a bit of post-war nostalgia. It was perhaps this latter that made White Christmas such a big hit in its day, although it's a bit too underdeveloped to really wring out any emotion for audiences who don't have that context. The director Michael Curtiz was never really at ease with the musical genre, instead focusing more on bringing clarity to the story. He makes a rather noble effort, using smooth tracking shots to keep various character story arcs interlinked, but really there isn't enough of a story here to warrant that. And although Curtiz was a master at lifelike and meaningful crowd-shots (as best witnessed here in the final scene) he fails to make best use of the neat Bob Fosse choreography, and just distracts us with a lot of pointless dollying in and out of the musical numbers.Of course, cast matters massively in any picture like this, and Bing Cosby is always welcome  a wonderful singer as well as a fine actor. But he's underused on both counts here, appearing older, tired, and without the spark that he brought to his pictures in the 30s and 40s. Danny Kaye, Rosemary Clooney and Vera-Ellen make lacklustre support, each one of them looking like second choices (which was more or less actually the case). Here and there is a hint that Clooney might actually be a great dramatic actress. If that's the case she's wasted here. On the non-musical side of things, Dean Jagger surely has the most important job as an actor, as he has to carry that poignant strand in the picture. Fortunately he manages this with naturalism and sensitivity. Beady-eyed musical fans may also spot a promising young George Chakiris (Bernardo in West Side Story) as a backing dancer in a couple of numbers.The title of this picture would naturally have us thinking of this as a Christmas movie. However, despite its theme it really lacks the cosy, glowing feeling of It's a Wonderful Life, Miracle on 34th Street, or even the less openly Christmassy Holiday Inn, in which the title song was first heard. But here White Christmas (the song) just comes across as another little presentation  it's far from being the heart of the picture. Irving Berlin was one of the finest songwriters ever to lend his talents to Hollywood, but unfortunately White Christmas (the movie) sells him short.And on that unseasonably gloomy note, here's wishing all IMDb users a merry and bright Christmas ;)",
    "138": "Let's get the elephant out of the room: Everyone gets Holiday Inn and White Christmas confused. There's no need to be ashamed if you do, since everyone else in America gets them confused, too-that's the only reason we continue to watch them at Christmastime, because we keep forgetting which one is \"the good one\".White Christmas is in Technicolor, and Bing Crosby's sidekick is Danny Kaye. That should help most of you set it apart from Holiday Inn, which is in black and white, and costars Fred Astaire. This one's story involves the troops, and the retirement of head honcho Dean Jagger. The girls are Rosemary Clooney and Vera-Ellen. That should clear things up for the rest of you.Just as with Holiday Inn, there are good parts and lousy parts to this movie, so whether or not this becomes \"the good one\" in your opinion is entirely up to you. The good parts are the adorable Danny Kaye song \"Snow\", the sweet dance number with Vera-Ellen, \"The Best Things Happen when You're Dancing\", and Bing's reprise of his signature song \"White Christmas\". The bad things about this movie are the cross-dressing reprise of \"Sisters\", the original version of \"Sisters\", the rest of Rosemary Clooney's songs, Rosemary Clooney's ridiculous argument that doesn't make any sense, and anything else that involves Rosemary Clooney. Vera-Ellen is beautiful, sweet, is an impeccable dancer, and has a perfect figure-why is another woman even in the movie?",
    "139": "White Christmas was an attempt to repeat the success of Holiday Inn, once again offering Crosby singing White Christmas and a bunch of singing and dancing.First off, this movie is incredibly dumb. A user review on this site insists, based on a film scholar's work, that we shouldn't judge movie musicals by their level of stupidity, but I feel it's reasonable to ask all genres to put at least a little thought into stories and characters. In this movie, no one does anything that makes any sense. It's lazy, connect-the-dots scripting that relies on constant misunderstandings and hair-pin mood changes.Danny Kaye is surprisingly low-key as Crosby's friend, with none of the bravura musical numbers I associate him with; the closest thing is a wonderful burlesque on modern dance. On the other hand, he's a solid dancer, even if not quite at the Astaire level.Vera-Ellen is a better dancer and does some impressive moves. As an actress she is limited; she only has one facial expression, which is basically that of someone who has had their entire face botoxed.There are a few good numbers, although not enough to make up for the lesser numbers and the terrible story.The movie is a step down from Holiday Inn, which wasn't really that great a movie either.",
    "140": "WHITE Christmas is the classic re-working of the 1942 film HOLIDAY INN, which follows the story of Bob Wallace (Bing Crosby) and Phil Davis (Danny Kaye), army buddies who later become a successful showbiz team who find themselves helping out their retired commanding officer (Dean Jagger) who now owns a run down Vermont Inn and falling for a sister act at the same time. This colorful and entertaining musical has been a favorite of mine since childhood. I was unable to go to sleep on Christmas Eve until I watched this...now they hardly ever show it on Christmas Eve anymore. Crosby and Kaye make a great team and they receive great support from Rosemary Clooney and Vera-Ellen as the Haynes sisters. Mary Wickes garners some big laughs as the general's housekeeper and future Oscar winner George Chakiris can be spotted in a couple of production numbers. Musical highlights include \"Sisters\", \"The Best Things Happen While You're Dancing\", \"Count your Blessings\",'Choreography\", and of course, the title tune. Some consider this film the bastard stepchild to HOLIDAY INN, but I absolutely love it and can watch it over and over again.",
    "141": "White Christmas (1954) :\nBrieflm Review -The Best Holiday/Christmas Musical of 50s decade. In 50s decade there were many Christmas films and Musicals that became popular and also carry huge fan following even today but nothing comes close to White Christmas. Not because it is a musical (We have incomparable Singin' In Rain in 50s) but it is a great film anyways (far better than Gentleman Prefers Blondes) and i wonder why this film is isn't remade several time not only in Hollywood but also in any other industry (mostly Bollywood) as it is a great rom-com too. The plot has everything needed for a perfect Christmas film and even for a perfect Rom com (if you don't like Holiday theme and Musicals) from comedy to romance to conflicts to emotions to positive end. Two hugely popular music artists become romantically involved with two sisters and team up to save the failing Vermont inn of their former commanding general. In 120 minutes it packs all in perfect shape, in a perfect size box and in a perfect wrap. It never looks boring because of engaging screenplay and meaningful musicals which surely gives it high repeat value. While i talk about set up, i don't really think this genre gets anything better than this unless you're looking for a lifetime message of something. But there an army backdrop here which covers the social part and also provides patriotic and emotional feel. Bing Crosby and Danny Kaye's pair is at peak of friendship, they create lot of laugh riots, funny moments, tricky gags and melodious musicals while two lovely sisters Rosemary Clooney and Vera-Ellen throws glamour from the other side. Irvin Berlin has given a timeless music but a special mention to the lyrics, especially in those two army songs towards the end. Director Michael Curtiz doesn't show much of class, he keeps it at its simplistic best and succeeds to deliver a Classic film that remains best of the decade among all Christmas films.RATING - 8/10*By - #samthebestest",
    "142": "I was told that 'Holiday Inn' (1942) from which this film was adapted was the better movie. Boy, was that a crock. I just saw it and it stunk.This film has Danny Kaye and Vera Ellen, the much more desirable pairing than Bing Cosby and Rosemary Looney, two schmucks who could not dance or act to save their lives - and they needed to in this holiday celluloid because they have all the personality of a couple of comatose slugs.Danny sings as beautiful as ever, and of course he's so funny. Vera is pretty and puts Rosemary to shame. Dean Jagger provides a solid block of dignity as a retired army general.Pass on Holiday Inn; this is the version to watch. It's 10 times more fun with more story and less random dance numbers. Enjoy!",
    "143": "This movie is a blatant money-grab.\nTake a beloved song from a WWII-era B&W movie. Flim the movie again in lurid Technicolor. Rename the movie after the hit song.\nBoom. You get White Christmas.\nI bet half-drunk network programmers in the 50 and 60s would slap this on their Dec. 25 schedules just because of the title. But beyond the song, this movie has nothing to do with Christmas. And I mean. Nothing.\nThe ''let's put on a show'' format is so shopworn and stale by this time you can see the mold growing. Crosby had already been lapped by Sinatra and he was about to be buried by Elvis.\nGranted, the singing and dancing is inoffensive entertainment if you put it on and watch it once. And I'm only human so I'm not going ot complain about seeing Vera-Ellen dance. But let's be honest - Rosemary Clooney had a face for radio. And Danny Kaye has far better movies on his resume.\nI don't even want to get into how offended I am about how the trite opening scene - a cheap Hollywood soundstage featuring Crosby singing the title song to what are supposed to be combat troops. This shtick might have played in the 40s when movie-goers would swallow anything while the war was ongoing. But all these years later? Cringe-worthy.",
    "144": "White Christmas (1954) ** (out of 4) Simple tale of a song and dance team (Bing Crosby, Danny Kaye) who travel to a rundown Vermont inn owned by their former Army general. They decide to try and bring some new business to the place and they also add a sister act (Rosemary Clooney, Vera-Ellen) to the lineup, which soon leads to romance. By the time this film was released Crosby's song 'White Christmas' was already a legendary classic so I guess it should come as no surprise that someone would try and wrap an entire film around it. I know this film is loved by thousands of people across the world but I wasn't all that impressed with it. For starters, this semi-remake of HOLIDAY INN doesn't hold a candle to anything in that movie. Every single item in the earlier film is much better than anything here so director Michael Curtiz isn't able to match anything. That wouldn't have been a problem had more simply been done here. There's no question that there are some good dance sequences as all four stars really give it their all. I think it would be fair to say that Kaye and Very-Ellen steal the film with their various dance scenes, which are clearly the highlight. There's also no denying that both Crosby and Clooney sound terrific together and they also have a nice spark that works in the romantic scenes. The biggest problem with the film is its screenplay, which is just one clich after another and it just never sparks to life. It also doesn't help that the majority of the Irving Berlin songs just seem like a poor imitation of something he would write. WHITE Christmas is loved by many and disliked by many so ones mileage is going to vary in regards to how they take the film. I will add that the film, the first shown in VistaVision, at least looks great but you just wish there was a tad bit more meat on the bone.",
    "145": "Michael Curtiz does a good job directing this picture, but the script, music and performances just don't add up to much.First off, this isn't a holiday movie at all. Other than the ending, there just isn't much holiday atmosphere to be found. Secondly, every five minutes another song or dance routine is thrown into the mix. With SO much music, it's only logical that there's gonna be some \"padding\" and this flick is loaded with lousy songs... \"What Do You Do With A General\", \"Sisters\", \"Gee I Wish I Was Back in the Army\". Ugh. The only worse piece of work by Irving Berlin was \"Mr. President\" in 1962 and that was truly horrid.Then there is the right-wing, militaristic theme we see everywhere in this picture. Sure, you can't avoid it with a plot device like a retired general, but the flag waving would make even Fox News fans want to hurl red, white and blue.Other things about this picture are disturbing... Vera Ellen's high neck-wear (to hide tell-tale signs of her bulimia) and her emaciated waist and legs, the ridiculous romance between a young and pretty Rosemary Clooney and Bing Crosby who was well into his 50's by this point. Bing's absurd hep-cat language. It's as if we're just supposed to ignore all this stuff because it's a big budget, technicolor songfest by happy, shiny people. Look at Bing's reaction shots and he looks like he's about to fall asleep. And watch him at the end of the film. He looks like a retired clown in that red outfit.There ARE some bright spots. The title track is one of the best holiday songs ever and Bing acquits himself well. The dance sequence with Danny Kaye and Vera Ellen is done very well and Kaye doesn't get his due in this picture. But these things just can't make up for a movie that wants you to suspend disbelief, but can't pull it off. Once something gets rolling, the next three scenes fall far short. I cringe when I see Bing talking to his old army buddies about how great things were in the war, it's just so fake. No infantry man in the history of the planet ever walked, talked or felt that way about the hell of combat. Then there's Dean Jagger's haggard, old General routine, always falling into military jargon that sounds false and hollow. The way the old troops cozy up to him at the end of the picture is nauseating - not because there's anything wrong with those patriotic feelings, but because the script can't pull it off.This movie just doesn't gel and you're really pulling for it to do so, but it just never comes. Star power alone isn't enough to make it work because this movie believes in its own falsehoods. It really DOES think its a great, classic musical. It really DOES think its funny and it really DOES believe that WE will believe the convoluted plot devices, laughable romantic scenes and terrible \"dance\" routines with Crosby-Kaye. Really? We're supposed to believe that a vaudeville team is the hottest act in show biz in the mid 50's? Elvis, Chuck Berry, Martin and Lewis and Little Richard might beg to differ. Look, really LOOK at how un-entertaining the showbiz schtick really is. Bing and Danny don't really entertain much at all. Why this horrible movie is a classic is beyond me. I guess it's because it's \"supposed to be\". Not enough for me though. See \"Holiday Inn\", \"Christmas In Connecticut\" or the 1951 classic \"Scrooge\" with Alistar Sim in the title role if you want to see a real classic. \"White Christmas\" is crap.",
    "146": "White Christmas is, simply put, a holiday tradition- but you can certainly enjoy it any time of the year. Others have described the story and script as a straight-forward happy experience, and it is just that. It could've been conceived any time of the year, but as it is, the story bookends two Christmases over the span of ten years. After it settles into the current year of the film, it ends with a luminous Christmas Eve snowfall. Simple, uncluttered magic. The film *is* sentimental and a bit schmaltzy, and that doesn't hurt it one iota. And while Bing Crosby is the star of this one as well as 'Holiday Inn,' I don't entirely buy that this is a remake of that. (No other holidays are mentioned in this film.) But it does have the late Rosemary Clooney (a siren of beauty *and* song) playing nicely off Crosby, especially in the duet \"Count Your Blessings,\" as well as comic genius Danny Kaye- who is especially fine in the satirical \"Choreography\" and his glamorous, Astaire-like dance with Vera-Ellen to \"The Best Things Happen While You're Dancing.\" The film's one sour note is in its leaden third act. It rolls along at a marvelous light-hearted pace for roughly 70 minutes, the principals all approaching their material with an ever-so-sly wink to the audience and each other. (\"Snow\" is especially lovely, with the group's 4-part harmony on the train tempered by their deadpan comedy at the less-than-climactic revelation of the 68-degree 'winter playground.') Then a sickeningly small misunderstanding- which could've been resolved in 5 minutes instead of the final third of the movie- slows everything down. But that's nitpicking. Few things on earth can match the joy of a tapping Vera-Ellen or the pair of Crosby and Kaye on the brink of giggles as they lip-sync \"Sisters\" in their rhinestones and feather boas. Would've liked more singing by the gorgeous Clooney, and more than one dance with Kaye and Ellen (but I understand that to be a compromise from the producers, who originally planned for Fred Astaire- and then Donald O'Connor- to be in Kaye's role). The other numbers- \"The Army,\" \"Mandy,\" and the title number- are all winning.",
    "147": "If it weren't for a few good song-and-dance routines, some great looking scenes at a Vermont lodge, and the fabulous Rosemary Clooney delivering some real professional song numbers, 'White Christmas' would be a forgettable, routine bit of Holiday fare.The trouble is--even though everything is all prettied up in technicolor and the cast includes four pros like Danny Kaye, Bing Crosby, Vera-Ellen and Rosemary Clooney, there is an artificial flavor to the sugary script--as well as a weak performance by Danny Kaye who is usually so non-stop great.\nWhen the Irving Berlin numbers take center stage everything is all right--but the minute they're over we're stuck with the dreary plot that begins in a highly artificial stagebound set supposed to be a war zone and ends in an equally artificial and artless manner when a barn door is opened to reveal the fake snow of a Vermont winter while our stars wear their Santa caps and do a reprise of the title song. It's all so obviously contrived and manipulated to bring tears in celebration of a plot to have the retired General and proprietor of the lodge (Dean Jagger) honored by fellow servicemen. Too much false sentiment cannot dim the charm of some of the song numbers, however. The film's greatest strength are the Berlin tunes sprinkled throughout: \"Count Your Blessings\", \"The Best Things Happen While You're Dancing\", \"Sisters\", and a wonderful torch number performed to the hilt by Rosemary Clooney (the title of which escapes me at the moment!)\nThe most surprising moment of the film occurs when Vera-Ellen and Danny Kaye dance gracefully to \"The Best Things Happen While You're Dancing\", the kind of number one would expect Fred Astaire to do with such ease. But Kaye is exceptionally talented here, matching the professional moves of Vera-Ellen with verve and fine form. It's too bad the rest of his performance lacks his customary comic flair, except for the \"in drag\" routine, \"Sisters\", performed with an uncomfortable looking Bing Crosby.Way below the standards one expects from a film directed by the great Michael Curtiz. It sure has a handsome look to it in technicolor--but except for a few good Berlin tunes, the story is as phony as the artificial snow the size of tennis balls that falls at the finale."
}