{
    "0": "If you're looking for a film that's clearly frightening, who's lid is very loose and needs some tightening, where the characters are dull, and the glass is less than full, join Poirot, in this grand faux, that's not enlivening. Although if Kenneth and his acting troupe engaged, gave the impression they weren't in it for the wage, I'd like to think it wouldn't stink, that my eyelids would not sink, into a stupor more akin to older age. Poor old Agatha must be spinning in her grave, it's not just the film that needs a little save, but I guess if you're a fan, can endure what others pan, you'll enjoy performances - that disengage.",
    "1": "Started with some beautiful shots of Venice and instantly I was captured by how beautifully shot this film is. This was a really good Poirot. It's appropriate for the Halloween season and it achieves that without silliness or gore.Synopsis:\n\"A Haunting in Venice\" is set in eerie, post-World War II Venice on All Hallows' Eve and is a terrifying mystery featuring the return of the celebrated sleuth, Hercule Poirot. Now retired and living in self-imposed exile in the world's most glamorous city, Poirot reluctantly attends a séance at a decaying, haunted palazzo. When one of the guests is murdered, the detective is thrust into a sinister world of shadows and secrets.",
    "2": "Guess who's back, Streamers? Hercule Poirot returns to solve another murder mystery in A Haunting in Venice. This movie is the third in a series of Agatha Christie adaptations directed by and starring Kenneth Branagh as the world renown detective. We all love a good murder mystery, am I right? A Haunting in Venice has a tinge of the supernatural just in time for Halloween season. Here's how it went.A Haunting in Venice is a loose adaptation of a later novel by Christie, Hallowe'en Party. In this movie, we find Poirot (Branagh) retired in Venice in 1947. He is avoiding potential client who want him to solve their various mysteries. However, when Poirot's bodyguard allows his friend, Ariadne Oliver (Tina Fey), a mystery novelist, in to see him, Poirot is confronted with a new mystery. Ariadne wants Poirot to attend a séance at the haunted palazzo of Rowena Drake (Kelly Reilly) to expose a psychic, Joyce Reynolds (Michelle Yeoh), as a fraud. Unable to resist, Poirot obliges Ariadne and attends the Halloween party and ensuing séance where things aren't all as they seem. Bumps in the night and deductive reasoning ensue.Branagh previously directed Murder on the Orient Express and Death on the Nile, which were mildly successful in bringing back these stodgy murder mysteries of Christie's. A Haunting in Venice is more of the same, but the setting does give a different energy to this movie. Venice looks good. From aerial shots and depictions of the canals, it all looks good. Additionally, the production design and costumes are well-done enough such that we are firmly anchored in the time and place of post-war Venice. I will say that the film looks too dark. It is difficult to tell at times what's going on, and I do not think that it was intentionally done in order to add to the mystery. It feels like a frustrating mistake in the cinematography.Here's my big issue with this movie: the mystery is not interesting. The outcome of this whodunnit is pretty obvious early on. Moreover, it is not explained well in the end. The movie feels both perfunctory and bored with itself. There are some interesting characters particularly Jamie Dornan's Dr. Ferrier and his son Leopold played by Jude Hill. On the other hand, Tina Fey is not good in this. She's out of place and takes you out of the movie every time she speaks, which is unfortunate.Ultimately, A Haunting in Venice is a ho-hum effort at injecting horror/supernatural elements into the well-worn murder mystery genre. If you liked the previous Branagh Agatha Christie adaptations, you'll probably enjoy this, but it really not worth the time, money or trip to the theater. Everything is fine, but nothing is exciting or interesting enough for anything more than one popped kernel of popcorn.",
    "3": "...and yer strangely the result is neither charming, funny or scary! The acting is the usual overwrought hamming you expect from this series of 'Poirot' films. Lacking in conviction and soul the script is delivered by rote leading to the viewer rapidly losing all interest in what is already a ludicrously contrived plot. I used to go to the cinema and usually leave uplifted, inspired or at least with some sort of feeling I'd been entertained but all too often lately I've left with the conviction that the focus is more on satisfying the producers of the film rather than the audience. As mentioned before if you want an entertaining Poirot story then look no further than Ustinov or Suchet...",
    "4": "For many years Dame Agatha Christie turned against her own creation Hercule Poirot and wanted to do him in. But his fans kept clamoring for more of his tales, so she keep churning his books out. After this ,movie I am starting to see her point.Allegedly based upon the so so novel, Halloween Party. Beats me how. The book takes place in England not Venice. There are different characters. The ending is different. Unless the similarity is that there are two E's in Halloween Party and two E's in A Haunting in Venice.I give up.Branagh's two previous Christies were a passable way to spend sn hour to two at the movies. They even have Ariadne Oliver, who Agatha Christie based upon herself and usually added tongue in cheek to a story. Not here. She even is part of a plot to fake a seance. God no! And Tina Fey who played her, is dismal to boot.This ship is sinking fast--whether the sinking is in a canal in Venice or the English Channel.",
    "5": "This film has really no interest except maybe some nice shots of Venice and the pretty decor of a bedroom with a superb four poster bed. The rest is boring and historical nonsense. No, Halloween was not imported into Europe after the Second World War! This commercial festival did not invade Europe until the 1990s. The Venetians have their sublime carnival and do not care much about Halloween. The script is slow and sluggish. We lose interest in the plot very quickly and we can't wait to finish it. The dialogues drag on, the moments that want to be scary are not and the mystery is not one. A completely failed film despite a beautiful casting and beautiful scenery. We barely forget we saw it. Next!",
    "6": "Let's first leave to one side the fact that Poirot kicks down a door in the film and plunged his manicured moustache into a bowl of water to bob for an apple! What on earth?It's a terrible film, terribly written and terribly executed. For example, a man stabs himself after a telephone call from a supposed friend who says she will harm his son. No questions asked. He just stabs himself.Ariadne Oliver, who hates her fame and curses her detective Sven, is now desperate for fame and even uses her dear friend Poirot to get it.A jilted ex fiancé happens to carry a perfectly torn photograph of his ex lover in his pocket and refers to her mental health struggles. It's 1947 though.Poirot's hallucinations are explained away by honey. But a \"medium\" swivels in a chair screaming for a full 10 mins and no one seems to want to know why.There are so many contradictions, so much terrible writing (\"mmm it's not wildflower honey, what could it be?\") I can't believe I managed to stay in the theatre for the full 1hr and 43 minutes. I'm beyond furious that a great writer and a great detective have been reduced to this.",
    "7": "Very far from a horror, and a mid whodunnit. Opened with a jump scare, was hoping that wasn't gonna be all that the movie is about; there's a few but the movie isn't a horror by any means. It is set in post world war Italy, it's mentioned several times throughout the movie as the characters grapple with consequences of postwar era.The movie lacks the eerie atmosphere commonly found in horror films because, in reality, it's more of a murder mystery in the Poirot franchise. I personally think it missed the mark. It's not supernatural either, although that theme plays an important role in the movie, influencing some of the characters' actions and personalities. I wished it had a scarier rating than PG-13. It felt more like a spooky campfire story told with proper Victorian language, largely due to the extensive narration. The dialogue itself was decent and had a certain wit without feeling forced.While the cast gave decent performances, there wasn't much they could do to elevate the movie. It reminded me of the sentiment expressed in \"See How They Run (2022)\" that if you've seen one whodunnit film, you've seen them all, and this film seemed to confirm that. The camera work, perhaps due to the IMAX viewing, felt shaky, and the edges of the screen often appeared blurry.The story itself wasn't particularly engaging, and when the mystery was finally unraveled, it didn't have a strong climax. The plot twists were just okay, and they couldn't make up for the shortcomings of the underlying story. I found it hard to become invested in the movie or its characters, so I didn't care much about how everything unfolded. This film was advertised as a horror but ended up being a mediocre whodunnit with a few jump scares, failing to excel at being interesting in either genre.",
    "8": "This movie had great cast and locations and is based on an Agatha Christie novel, so why so boring? This could have been like Knives Out but the mystery gets muddled and anticlimactic and most of it takes place in the same building with not that great lighting. Emma Laird from Mayor of Kingstown is totally wasted in her nothing role and sane for the French actress in Call my Agent. As for the direction at least there are some great shots of Venice and it is in colour unlike the pretentious and even more boring Belfast. This is not a movie for staying in and enjoying a film it is one thing to have an indifferent ending but the 100 minutes before that are not enjoyable at all. Maybe time to stop doing these movies.",
    "9": "The change of setting to Venice is inspired, it gives it an otherworldly and insular, claustrophobic tone, which is emphasised by the camera work, and lighting, this one is tricky to review without spoilers so I must be brief, and leave some ideas out, the script is close to superb, but it just hits a couple of bum notes, the third act is over too soon, the denouement rushed, but in part it's because the mystery for all the effort and effects isn't that mysterious, but fundamentally the problem is Branagh, he obviously wants to be Poirot, but he isn't, he just isn't idiosyncratic enough, or dare I say talented enough, and he pales in comparison to the giant magnificent performances that have been before, the genius of Peter Ustinov only surpassed by the subtlety and diligence and sheer depth of David Suchet, one of the greatest acting performances ever, unfortunately for Branagh it's a tough school, and he just doesn't make the grade, gave it a 7, felt like an 8, but also a 6 coz of KBs love letter to himself.",
    "10": "A Haunting in Venice is another winner for Kenneth Branagh's Hercule Poirot cinematic anthology! From the backdrop of Venice, to the horror elements, to the engaging performances and some of the most interesting cinematography and production design in a studio movie in recent memory, this may be Branagh's most cinematic Christie adaptation. The horror helps the cinematography, production design and sound work to shine and allows Branagh to dive deeper into Poirot making this the most captivating examination of the character yet. Plus it made for a spine-tingling and suspenseful crime-mystery with a cunning twist on the classic whodunnit - the mystery about the actual mystery itself made this one really fun. It's an old fashioned haunted house flick AND a great Poirot mystery; I hope Branagh continues making these films for the rest of his career!",
    "11": "This is a period piece that fails to evoke either a time or place, period. The DP is a hack. Who thought it was a good idea to use overt wide-angle lens and hand-held quasi-GoPros in a movie set in the late 1940's? Seriously?!? Really wanted to like this film, but there was no effort to give clues to draw in the viewer to solve the crime. The protagonist just rattles off facts that were never revealed in whole or in part. It's as if the characters are participating in a narrative that is not being shown to us: the actual viewing audience. This is a muddle mess filmed by a second rate cinematographer. Don't bother.",
    "12": "I don't know if the film is faithful to the book, but it is incomprehensible in its execution. A bunch of meaningless scenes. Luckily, Poirot gives us a summary at the end. Tina Fey and the little boy have blatantly fake acting. Exaggerated use of wide angle and other strange shots. The straw that broke the camel's back was seeing, once again, that there are basements in Venice!! This doesn't exist, let's stop showing this nonsense. And finally, in the credits, move a couple of buildings to create squares that simply doesn't exist. Isn't Venice beautiful enough?? Kenneth Branagh good as usual.",
    "13": "As an avid Agatha fan since I was a child, perhaps I always had high expectations for her book adaptations, and rarely do i get impressed. It's surely not an easy task, to adapt her writing, but none the less, movie should be made to rivet you to the screen, to keep you guessing and wondering, not to have you looking for books on amazon while watching it. If this move had all nameless actors with no Hollywood rep in it, this wouldn't even make it to cable TV in Timbuktu and nobody would bat an eyelid at it. Cheap theatrics were employed here and there to artificially inflate on-screen tension and have the audience jump up a bit, but even that was rubbish and as far movie suspense goes, that was about it. Thankfully, I didn't pay to watch this otherwise I'd be super annoyed. It's a decent flick to kill some time when nothing good is on, but it's a poor AC book adaptation and not a worthy representation of an excellent mystery novel.",
    "14": "I liked how dark and dreary the film felt with its scenery and the stormy weather. At first it felt like this might be a mystery movie that would be interesting but once the murder takes place the film becomes very bland. The mystery just isn't interesting enough to make one care about what happened or why it happened.All of the characters are pretty one dimensional even if the film attempts to give them a backstory. Their stories were just long enough to try to link them to the crime and make this movie a mystery.Overall this was just poorly written. The ending was very weak and was not satisfying at all.",
    "15": "This is an insult to the literary genius of Agatha Christie. The roles, from Poirot to the very least cast member, could not have been more sorely miscast. Branagh is not (nor ever has been) Poirot. Fey belongs in comedy, not this. This was like watching a so-so community theater undertaking of a poorly adapted Christie work. Emphasis on \"poorly adapted.\" Nothing really held together for me - World War II references, costuming, cinematography, editing, casting... none of it worked. It just didn't hold my interest enough to make sense. It was only after I looked it up on IMDb that I found out it was an adaptation of Halloween Party. Yeah, but no. You can't reinvent a classic by having it make less sense. This was, regrettably, a turd that couldn't be polished.",
    "16": "Director Kenneth Branagh again stars as Agatha Christie's preening detective Hercule Poirot, moving Dame Agatha's mystery from London to Venice and into the land of the supernatural. It is the best of Branagh's three big-screen Christie adaptations.A Haunting in Venice is a moody Gothic horror feature that feels completely refreshing in a landscape of jump scares and gore. While \"Murder On The Orient Express\" and \"Death On The Nile\" were hack-job excuses to force as many disparate and ghastly celebrities onscreen as possible, \"Haunting\" is an actual, surefooted film with strong performances and a luxurious-yet-frightful tone. As the mystery novelist Ariadne, a stand-in for Christie, Tina Fey brings nice comic touches to a performance that threatens to steal the movie.My Rating : 8.5/10.",
    "17": "Kenneth Branagh an actor of note. That's the extent of the good news here. The movie was maudlin gloomy slow with real dark blue hues. Branagh had limited lines cos I expect he was overly focussed on his movie directors role as well as staring. A supernatural type movie not a classic who done it. Nothing like murder on the orient express. It was boring slow and did not fire at all. Characters so so albeit some accomplished actors. Branagh looked like he was busting to say something but didn't. Photography ordinary. Location?? Ordinary. A convoluted pshycotic pile. Poirot is cast as a elite snob. Death on the Nile has better on water scenes. I lasted about 55 minutes and left. Extremely disappointing. Not worth waiting to download.",
    "18": "Have loved everything about Kenneth Branagh's Hercule Poirot, unfortunately , until this third installment ...Don't get me wrong , the acting is fine , setting is amazing , but somehow all film is just feels kind of silly ... Also , one of the main attractions of the previous films ( at least for me ) is a somewhat unexpected and dry humor of the great detective , that is what made his deductive brilliance shine so much brighter and made the story and his character more engaging and charming . In this film , it's all missing , yes , the horrors of wat etc ., etc., but it made this film just dull...",
    "19": "I don t understand why Mr Branagh persists in directing such lamentable films on Agatha Christie who must be turning on her grave .Everything is so ridiculous the atmosphere , the violence , the sets , the horror and above all the terrible acting of unknown actors. If you compare with David Suchet portraying Hercules Poirot or even Peter Ustinov in the unforgetable movie Death on the NIle we are at an extreme distance. I think it is time Mr Branagh returns to Shakespeare and abandons once for all Mrs Christie novels. Unless he decides to film the death of Hercules Poirot in the book entitled Curtain.",
    "20": "The title of this review says it all. After establishing its credentials with some terrific wide-angle views of Venice (a refreshing introduction to the strange otherworld of the story) the rest of this production is utter disposable garbage with a ridiculously flat and one-dimensional script, horrible embarrassed performances from a variety of A-list international actors (one coming out of this worse and less convincing than the next) and a plot that makes Scooby Do look like a contender for the Nobel Prize. Agatha Christie movies are always a bit hit and miss, the conventions of her time seeming quaint and unconvincing in ours. But this production spits on her grave while pretending to honour her memory. Offensively stupid. Avoid.",
    "21": "I must admit, I am a fan of both the book and David Suchet adaptation of Agatha Christie's 'The Halloween Party' and was skeptical. I have found KB's Poirot adaptations to rely on glitz and glam (and big name actors) instead of substance and have been underwhelmed and in some cases a little offended by both 'Death on the Nile' and 'Murder on the Orient Express.' But this movie is the worst of the lot. The characters only speak in exposition. The murder is laughable. The motives are pulled out of thin air and the cinematography, while unique, is nauseating. The only redeeming quality is perhaps the aerial shots of Venice and the costuming. PLEASE, if you haven't read Agatha Christie, don't assume that this is her work. It is not. It is, as I said, practically indecipherable, especially when one knows the complexities of the original work and the beauty of that mystery. Good luck making it through this movie... or... just watch the David Suchet version-- the writers clearly proofread their work.",
    "22": "I'm all for mystery and suspense movies, whodunnit movies are interesting and fun, but it all has to do with the presentation. One needs to build the suspense, have interesting characters, and have the viewer develop an emotional connection with the characters so it matters what actually happens. None of that occurs in this flick. We are dropped into a storyline with little exposition with characters that are often hard to understand in dimly lit surroundings and no reason for me to care who lives and who dies. And when the murderer is revealed, the reason behind the crimes makes no sense. And to top it off, another crime is committed by a completely implausible individual. This was boring and plodded along with basically Poirot interviewing one person after another and long all those scenes into a movie with an unrealistic end. Skip it and save yourself some time. .",
    "23": "Most people don't know that among Agatha Christie's lesser known works was an anthology called \"The Hound of Death And Other Stories.\" The title story being one of her few forays into genuine occult fiction. Another being a short story, from the same anthology, called \"The Last Seance.\"Though I cannot prove it, I strongly believe that the script writers for this latest Hercule Poirot movie incorporated some of its elements into the screen play otherwise mostly based on Dame Agatha's 1969 mystery novel THE HALLOWE'EN PARTY. One of the things changed by the screenplay, of course, is the setting. Venice, Italy, on Oct. 31, 1947 rather than 22 years later in Great Britain. Perhaps that was to avoid competing with the latest Indiana Jones flick which has the same chronological setting. But, I could be wrong.In any event, Poirot has retired to Venice, emotionally burned out from all the death he has witnessed, both as an expert solver of homicides and as a veteran of two World Wars. Along comes mystery novelist Ariadne Oliver (Dame Agatha's metafictional American counterpart played by Tina Fey) with an elaborate scheme to perk him up.Exposing a Chinese-American medium called Miss Reynolds as a fraud.What follows is a suitably creepy film that literally keeps you guessing as to whether or not Poirot (masterfully played by Kenneth Branagh) is hallucinating from survivor's guilt as the tension, the body count, and the flood waters just outside the crumbling palazzo all steadily rise. Those flood waters being the result of an almost stereotypical thunderstorm that, nevertheless, enhances the aforementioned creepiness quite effectively. Isolating Poirot and his suspects not only physically (no police intervention possible); but also mentally and emotionally.To say anymore would needlessly ruin this film for those of you who loved Branagah's first two forays as Poirot. I will just wrap this up by saying that movie-goers could not have a more suspensful bridge between the end of the Summer Blockbuster season and the Spooky Spectacular season.",
    "24": "I normally do not give a movie a great review, but this movie gave me everything I wanted in a murder mystery movie. A movie based on the old school movies that we used to enjoy as kids without agendas that we are tiring of with the recent release of films. A great movie to take the family to as well without having to cover your children's ears or eyes. I really enjoyed this movie. I do not want to give away any spoilers, but it was very difficult to figure out who did it. Those are the best movies of them all! Keep people guessing and have reasons why anyone could do the crimes. Good times had by all that went. The acting was amazing by Kenneth Branagh. Tina Fey wouldn't have been my first choice, but she did play her part well. If you like movies with lots of fun twists and turns, go see this movie. It was definitely one of the best movies I have seen in a while. Makes me want to go back to Venice. The scenery was amazing. Go enjoy a fantastic story told like they used to be told.",
    "25": "A total disappointment. I didn't have high expectations though but it was way more worse than I thought. Disoriented script, bad actings, poor direction, no suspense at all which is usually inherent to Poirot stories and very predictable. The only thing that kept me to my seat till the end was the great take on superstition, the fraudulent approach of all so-called mediums and their tricks to manipulate those in pain.I always admire movies which deal with ignorant people who fall short into the trap of these charlatans. That there's always a rational explanation for a bizarre occurrence. Nevertheless, it had nothing to do with Kenneth Branagh but the clever story of Aghatha Christie.And to me, Knives Out still stands out among the recent detective movies.",
    "26": "This was a disappointment as first the characters were not believable and Kenneth Branagh did not make a convincing Hercule Poirot, even the moustache was awful!The film relied more on dingy rooms, subdued lighting and terrible sound effects, rather than on 'substance' of plot, effective clues and dialogue.Then, we are expected to believe, that the 'child' Leopold has such skillful intellect and capacity, to be able to engage in high level deceptive blackmail, to extort enormous sums of money without no one knowing.It was painful to endure! I hope that David Suchet did not watch it as he is the epitome of Agatha Christie's Poirot and undoubtedly the best!",
    "27": "Kenneth Branagh, please stop making remakes of something that does not require one. Your impression of Poirot is horrible and tasteless. I can get over these ridiculous mustache and the way you portray the famous detective as a spiteful little man.Yes, you can do cinematography rather well (although in this movie not so much) and you are quite good in involving prominent actors to join your films but they are EXTREMELY BAD. The only thing I want to do after watching this garbage is to rewatch Poirot with David Suchet. These are done perfectly. So leave your garbage to yourself, we don't want it anymore.",
    "28": "The haunting part is silly and not a central part of this lame whodunit. The visual effects with incessant thunder and lightning and torrential rains is vapid, the script is quite boring and the acting especially that of the doctor and child is embarrassingly amateurish and distracting . Poirot in the novels and most films arrive to his conclusions in a very methodical way, yet here it just does not make sense, did they accidentally edit out some important parts ? Not recommended for Agatha Christie fans , or for mystery fans , it was quite boring. Also, there isn't such a thing as a Halloween in Italy let alone in Venice where they have a much more elaborate and sophisticated Event called Carnivale so there was a lack of authenticity to add to other issues with this mediocre film .",
    "29": "I like Agatha Christie a lot ..... and we have just come back from Venice, so memory lane was beckoning...\nHonestly, I thought this film was really awful......Kenneth Branagh OK as Poirot, but the storyline was weak, and this film soooo cheaply made\nA few ariel shots of Venice, followed by the rest of the film, filmed in a run down palazzo consisting of mainly one room.!Venice on a shoestring\nto say the least\nMaybe OK on TV a on a wet Sunday, but spending £23.99 in a freezing cinema on a Saturday night ......no way Hose !It comes to something when the star of the show is an 11 year old boy ! ( Jude Hill as Leopold Farrier ) Jamie Dornan passable as\nthe father of Leopold ( suffering from PTSD )\nAll in all .......a waste of time.",
    "30": "It is a film filmed with undoubted good taste. Not only is a splendid Venice displayed, which is the idea for a bucolic life, but it is also presented as the ideal place for a situation where reality and imagination can intersect in a very dangerous way. The characters are the classics of a novel by the very famous Agatha Christie: there are several and they all have a reason for being there and being accused of a crime. What is shown is done seeking to satisfy the eyes and ears, making the experience of watching the film something sumptuous. The acting is good, the script is good, and the scenery and photography are top-notch. There is some homage to the Giallo (the complex story, the forced framing, the mysterious characters) and there are brief moments for pleasant scares. It is a great film, enjoyable, it is one of those films that are no longer made. Without a doubt, Branagh is one of the best that cinema has today.",
    "31": "Director/star Kenneth Branaugh does it again with \"A Haunting In Venice\". It's a beautiful looking movie with excellent location photography. The cast is very good and they all deliver strong performances. This is very creepy movie. It's horror elements are well done as was the mystery. Unlike the first two installments (I liked \"Orient Express and I though \"Nile\" was excellent.), I did find myself trying to figure who the villain was. Kenneth Branaugh has turned his Hercule Poirot movies into a surprisingly enjoyable franchise. I hope they make another one. (I saw this movie at the AMC Raceway, Westbury, NY.)",
    "32": "Murder on the Orient Express was a very good start to the new films, the second film Death on the Nile was quite good, then came this third entry, the first time the story has been brought to the screen, based on the book Halloween Party by Agatha Christie, directed by Kenneth Branagh (Henry V, Mary Shelley's Frankenstein, Hamlet, Thor). Basically, in 1947, Belgian detective Hercule Poirot (Kenneth Branagh) has retired and is living in post-war Venice, with former police officer Vitale Portfoglio (Riccardo Scamarcio) employed as his bodyguard. On Halloween, mystery writer Ariadne Oliver (Tina Fey) convinces Poirot to attend a séance at the palazzo of opera singer Rowena Drake (Kelly Reilly). Oliver wants to expose medium Joyce Reynolds (Michelle Yeoh) as a fraud. Rowena has hired Joyce to communicate with her dead daughter Alicia (Rowan Robinson), who committed suicide a year ago after her fiancé, chef Maxime Gerard (Kyle Allen), broke off their engagement. Guests attending the evening are Maxime, Rowena's housekeeper Olga Seminoff (Camille Cottin), Drake family doctor Leslie Ferrier (Jamie Dornan) and his son Leopold (Belfast's Jude Hill), and Joyce's Romani assistant Desdemona Holland (Emma Laird). During the séance, Poirot deduces Joyce has two assistants, revealing Desdemona's half-brother Nicholas (Ali Khan) hiding in the chimney. But then Joyce speaks to Rowena in Alicia's voice, revealing that she was murdered, stating that one of the guests was her murderer. Poirot tries to confront Joyce; she tells him to lighten up and dresses him in a mask and cloak for Halloween. Poirot takes her advice and bobs for apples but is nearly drowned by an unknown assailant. Moments later, after the strike of midnight, Joyce is seen falling from a balcony and impaled on a statue in the courtyard. A storm stops anybody leaving the palazzo, allowing Poirot to individually interview all trapped guests as to their whereabouts during Joyce's murder. During the interviews, Poirot finds himself hallucinating, seeing Alicia's ghost. Leslie is severely traumatised after being held in a concentration camp, and he is in love with Rowena. Maxime was not invited to the evening; he broke off his engagement because he thought Rowena did not approve of him and that Alicia was obsessed with keeping her happy. Leopold claims he hears the voices of dead children from when the palazzo was an orphanage, they are said to haunt and kill doctors and nurses who enter the building. Nicholas and Desdemona have been stealing from Joyce and intend to travel to St. Louis, Missouri after seeing the film Meet Me in St. Louis. Later, the guests discover an underground chamber containing the skeletons of dead children. Leslie suffers a panic attack and nearly kills Maxime. He is locked in the music room to calm down, with Rowena giving Poirot the only key. Poirot deduces that Maxime received an invitation from Oliver and that she and Vitale conspired to bring him to the palazzo. Vitale investigated Alicia's death and gave Joyce private details, while Oliver admits she hopes to write a new book based on Poirot's incapability of explaining the séance. Leslie is then found stabbed to death. The remaining guests are gathered, with Poirot exposing Rowena as the murderer. She was obsessed with keeping Alicia to herself, cutting off contact with Maxime, and weakened her using tea ladened with honey extracted from rhododendrons (a deadly species of bees). One night, while watching over Alicia, Olga unknowingly gave her tea containing a fatal dose. Fearing she would be exposed for poisoning, Rowena staged Alicia's suicide. She used the same honey to cause Poirot's hallucinations. Rowena received blackmail threats and suspected Joyce or Leslie. She pushed Joyce to her death after mistakenly trying to drown Poirot and forced Leslie to stab himself, threatening to kill Leopold if he refused, hoping to get away with blaming the deaths on the children's curse. Rowena tries to escape and goes to the roof where Poirot confronts her. Alicia's ghost seemingly appears and pulls Rowena down, causing her to fall into the water and drown. In the morning after the storm has ended, Oliver leaves Poirot, he says he will not mention Vitale's involvement in the séance, and privately exposes Leopold as the blackmailer. Leopold explains that he recognised the poisoning, seeing a connection with Rowena's first starring role in an opera, with the lead character called the \"king of poisons\". Poirot suggests Leopold and Olga clear their consciences by using the money to help Desdemona's family. Poirot intends to return home and return to work as a detective and accept new cases. Also starring Amir El-Masry as Alessandro Longo. Branagh is having fun with the accent and the wonderfully ridiculous moustache, the supporting cast of famous faces all do their parts fine, and the murder setup and conclusion are gripping enough. The pace is a bit uneven at times, but it just about keeps you guessing, the traditional \"gathering\" scene is alright, the slight gothic horror element is intriguing, and its period detail and style are good, it is a reasonable murder mystery. Worth watching!",
    "33": "Plot : Its very nice to look a film that combine horror and detective. The plot begin with retired Hercule Poirot have to decide who is the murderer of Ms. Reynolds, but he must face the horror from the house. The horror is very good, not rely solely on jumpscare. The detective side not so good, its just plain. But good side, this film try to visualize every clue. The badside is this film didnt quite succesful to give the audience an emotion. Such a dissapointment watching a good plot without a proper emotion.Ending:\nClassic plot twist but no emotion, I'm not so surprised when actually the murder is the mother. Its very sad that the ending cannot give us emotion burst because if we read the novel, we can get that emotion burstConclussion:\nAgatha Christie is a good novel writer yet this film failed to visualize the emotion of her novel. I hope next time, we can see more improvement.",
    "34": "This film is truly unwatchable. For as long as I could bare it, I tried hard to get invested in it if only driven by its promising cast and what to me makes its major if only selling point (and most attractive character): the gorgeous city of Venice. And..., if I have to deeply unearth a compliment here, it is beautifully shot (2 stars for that). But it stops there. The characters aren't believable, or make me care at all for whether they live or die next. I've seen travel adverts more engaging than this. By the 20 min mark I quit ...and you should too. This isn't but yet another exercise in big budget production with subpar writing.",
    "35": "Honestly, this movie was a lot better than I thought it would be. Then again, I thought that it would be completely and utterly terrible. Instead, it is an OK murder mystery, nothing great nor spectacular, but it manages to keep attention, which is quite a rare thing in movies these days. Then again, I would almost say that this is not a Poirot movie, but a mystery movie that tries to piggyback on Poirot's name and fame in order to sell better. There are too many things that are wrong for a Poirot movie: the over the top insistence on supernatural moments, and being ambiguous at the end whether something supernatural did exist, has no place in a Poirot movie. Poirot was always firmly realistic and even if there was anything that seemed supernatural at first, it was always unambiguously rationally explained in the end. Then there is the completely out of character moment when Poirot dunks his head in a bowl of water trying to catch an apple with his mouth - a thing that he would never do. And finally, we even get Poirot the tough guy when he kicks down a door. Completely ridiculous.Other than that, the movie, for no reason, manages to cram in a seemingly obligatory \"men bad\" moment. When we find out that the ex fiance broke up with Alicia because of her sick, codependent relationship with her mother, Tina Fey (who is absolutely the worst and most obnoxious character in the movie) berates him for breaking up an engagement because \"a woman made him feel small\". The woke stupidity is off the charts here. No sane person should ever get involved with someone who has that kind of unhealthy relationship with their parents, and that has nothing to do with being a man, woman, dolphin or whatever. But it seems that Hollywood just has to do this crap in every movie, no matter how out of place it is.Fey's character is horrible and it is completely unbelievable how Poirot gives her a pass even though she deliberately deceived him and tried to ruin his reputation and in the end acted as if she did nothing wrong.Camera work is often weird, with strange angles for no reason, which is often annoying and distracting.If you love Poirot, and wish to see this movie, tell yourself that this is not really a Poirot movie. You'll find it more enjoyable that way.",
    "36": "Wow where do I begin? Me and my grandmother who loves an old fashioned mystery thriller ventured off to the theater today to catch a matinee of A HAUNTING IN VENICE. She loved Death on The Nile and Murder on the Orient Express.This was by far the worst movie I've seen all year. The execution was so bad, I couldn't believe they released this to the movie theaters. My grandma absolutely hated it. What a complete waste of time and money. The action was atrocious. The camera angles were annoying and there was no suspense or mystery to the movie. By the time you found out who was the culprit, you won't have a card in the world and will want to go home and do something more productive.The most boring movie of the year.",
    "37": "I love a good classic mystery and with an interesting plot one can usually forgive other flaws. For this one, after about half an hour I considered leaving (but thought, nope, I paid for the ticket.) It didn't get better. There's nothing wrong with the storyline, but it's played so rote and formulaic, it's like none of the actors are truly invested, they're all flat. In this one, Hercule has none of the idiosyncrasies that lend him some kooky charm, just a few typical Hercule-isms thrown in as a sop to the character, that even he seems bored with. Most irritating was that every scene ends with something designed to make you jump -- a loud bang, a door blown open by the wind, a ghostly apparition appearing and disappearing - they're just lame, cheap shots for surprise factor and it actually gets predictable and tedious. Suspense is totally missing and the movie feels much longer than it actually is. I'm rating this a six because the scenes of Venice are quite lovely, there are some intriguingly shot images and good set design, and the basic workmanship is fine. Otherwise, it's a very forgettable flick.",
    "38": "The shots in the film are quite beautiful, it's just a shame that the director's weak narrative approach makes all the finishing touches as fleeting as they are.It's also the only movie I watched that I didn't even feel like I'd seen anything. It ended without me even realizing it, the pale narrative was senseless, and it even ended abruptly without any warning, making it one of the strangest movie-going experiences ever.It's also the only movie I've ever watched that I didn't even feel like I'd seen anything. I didn't even realize it was over, the pale narrative makes you feel nothing, even to the end of the sudden end without any warning, experience the strangest viewing experience.",
    "39": "Idk how the books go, but did they also taper off like the films? Each new installment is less intriguing, less intelligent, and less rewarding than the last. This one is now full of ghosts, throwaway actors/actresses, and panic attacks for our protagonist.These movies are all about the unreal/unbelievable being ousted, and getting to the bottom of a devious crime. Now you wanna try and throw the audience off, fake em out, then play the ghost card you've baited the audience with all movie? It was fun because we knew NO WAY there'd be ghosts in the movie; The main character might've been experiencing some kind of environmental hallucinations. Yet, ghosts were there, and here we are. I didn't plan on watching a sci-fi movie.Take away the half brother and sister and does the story change?! Nope. Another waste of Michelle Yeoh's talent as well. Had a good idea to broach a convo about PTSD, but they play just the anger card and The Doctor is killed with no pay off on that end. Could've even done something with The Doctor's PTSD vs. The Detective's harsh view of life, but theme wasted.The editing and story were rushed, despite the movie feeling like it dragged on.In the end, the audience is coming to a whodunnit; They want to be fooled, but then still be satisfied by the reveal. Neither can be accomplished when you spoon-feed the audience all actions and tricks, but then still use \"ghosts.\"Idk if there's a 4th book/movie, or more, but I won't go out of my way to watch it before it hits a streaming service I pay for. Even then, it will not be high on my list, if at all.",
    "40": "When I noticed I had been 50 minutes into the movie, nothing was happening from the start. No action, nothing scary, dialogue that wasn't keeping me interested, mellow acting, in fact Michelle Yeoh was really the only one that had kept my interest on the screen until she got killed off so early. She gave an amazing performance at least, but that doesn't change the fact that this movie had way too much talking and it didn't seem to be getting anywhere whatsoever. I didn't care, I didn't know what was going on anymore, and I felt like I was wasting my time honestly. Thank goodness I was watching this in the comfort of my home instead of being at the movies. The 3/10 is for the location itself, the 40s look and the cinematography. Other than that, I wouldn't suggest watching this even if you were bored. Please go watch something better.",
    "41": "One of the fundamental things about an Agatha Christie who dunnit is that is has to be written by Agatha Christie or it's just a Who Dunnit and in the case of this movie - not a very good one.The writer of this story just didn't understand the bases of the genre. You can have as many red herrings as you like but you also have to remember to actual give the audience the real clues and they simply forgot to do it.The whole reason for the murders is simply thrust on us at the end without any links to the actual story we had watched and the whole idea of the honey being drugged was not even alluded too at any point.The movie itself is not too bad as a spectacle, although the acting is doubtful at times but it's not what it says on the box.Sadly Branner is not doing the world of Poirot any favours and should at least leave the core story alone in any future forays into the Poirot world.",
    "42": "Having seen (and very much enjoying) the film adaptations of Murder On The Orient Express and Death On The Nile, I was thoroughly disappointed with A Haunting In Venice. Perhaps I was taken in by the early trailers which focused on the seance and led me (incorrectly) to believe that the film would be a combined thriller and whodunnit, with horror elements. Instead, the seance scene was both laughable and ridiculous. And, the following murder seemed almost incidental to the film. Plodding through the next 30 minutes left me yawning and it was an easy decision to leave the theatre shortly thereafter.",
    "43": "I loved this movie. It took the classic structure of a whodunit, which I don't often enjoy actually, and added beautiful cinematography and sound to create a mysterious, frightening atmosphere. The acting was very good, turning typically single dimensional characters into something more. The writing was great, with well-designed story structure, interesting, eccentric but believable characters, and memorable lines. Plus, it added a philosophical dimension, exploring God, the soul, and the purpose of life. I really think this is what movies can be. It was slow, haunting, thoughtful, frightening, and clever, without superpowers, super villains, car chases, spaceships, gratuitous sex and violence, and every other gimmick that Hollywood thinks is needed to sell a story.",
    "44": "This has to be one of the worst adaptations of Halloween Party imaginable. The only saving grace is the scenery, although Christie never set the story here!I found the camera work distracting, it was as if the camera operator was using all of the \"tricks of the trade,\" different shots, angles and constant movement. In my opinion, the camera is trying to inject life into an uninspiring script.As a rule, I like Kenneth Branagh as an actor. I long for his Poirot films to be good, however, each one has been a disappointment. For such a great actor, his Poirot films are terrible.If you like Agatha Christie's work, or want to watch a good mystery, do not waste your time watching this. There are better options out there.",
    "45": "Oscar winner Kenneth Branagh's third outing as Agatha Christie's Hercule Poirot currently in theaters. Branagh is retired living in the titular city who's brought out of retirement by a compatriot in crime, a novelist, played by Tina Fey, who entices him to solve an old crime, a daughter died from a fall from her palazzo & the mother, Yellowstone's Kelly Reilly, who's throwing a Halloween party will also incorporate a séance since the belief is the soon to be sold abode is haunted. Cue the starry inhabitants (Oscar winner Michele Yeoh, Jamie Dornan & Jude Hill, both late from Branagh's Belfast, et al) as the bumps that go in the night may be actual spiritual bumps or the machinations of someone trying to throw Branagh off his game. I consider this one to be the best of the bunch since Branagh leans into the macabre more here than the gorgeous whodunnits he's helmed before making this a perfect vehicle for the upcoming Halloween season instead of the usual slice & dice gore geysers will be enduring.",
    "46": "\"A Haunting in Venice\" is a co-production between the United States of America, the United Kingdom and Italy and the latter has of course to do with the city mentioned in the title, which is also where the film was shot and from what I saw here, despite some of the horrific contents, it is a really nice place to travel and seeing some of the scenery and the water of course, I felt a bit of an urge to get there at some point. Anyway, this is once again based on an original story by Agatha Christie, maybe one of the most famous writers of all time, and the protagonist is, also once again, Hercule Poirot, even if you will not see his name in the title here. Or in any of the other films. There I am referring to Sir Kenneth Branagh who is the director here once again and also plays Poirot, the Belgian detective who is now enjoying his retirement in Italy, but a writer friend comes to see him and gets him involved in a new murder mystery that he eventually of course can impossibly stay away from. Branagh has written screenplays in the past too, such as the one for the recent big success \"Belfast\", but here he left that aspect to Michael Green again who also worked on the previous Poirot films. It's not like Branagh did not have enough else to do. You have to give him props for making these films interesting enough to general audiences to become really popular, regardless of how much you like them. This film being number four on the imdb MOVIEmeter is telling enough and the material is nothing that really made this an obvious turn of events really. This film could have gone way more under the radar. Of course, if you have the name Ridley Scott as your producer it always helps. Another producer has a really fitting name too given the story and atmosphere. Check it out for yourself if you want to know more.And surely it is no coincidence that the film got released around October/November as the original story from Christie even carries the word Halloween in its title. Ghosts are a constant factor here from beginning to end, even if the eventual explanation what happened and who killed who and why is expectedly very earthly. The film's only awards attention so far went to the composer, a previous Oscar winner and it is definitely possible that this is where the film gets an Oscar nomination, but we will see about that. Much more is probably not going to happen. Speaking of Oscar winners, Michelle plays a supporting character in the first half of the film or even a little bit less than that. Kelly Reilly is maybe the second somewhat big name. As for the males, one thing that caught my eye is how Branagh again cast Jamie Dornan and child actor Jude Hill, who had both been key reasons for the success of \"Belfast\" of course. And they are doing fie here too, even if I must say that Dornan did not have the material to really shine again, but oh well. Most of the other cast members have names that maybe do not sound familiar to you at all, so even bigger props to Branagh to turn the outcome into a success with, if we are a bit mean, a bunch of nobodies, but yeah, eventually it is just all about Poirot and maybe even more so about the solution of the whodunnit. The word is even used by him on one occasion when he explains to another character (and the audience) what he is doing.Oh and of course I totally forgot about Tina Fey, who initially merely plays a character that seems a bit of a sidekick, but also gets her twist towards the end then and we understand why she got in touch with Poirot in the first place and it was not her friendship. Here and there, her comedic background comes through and she has three or four moments where she developed a bit of a punchline that also could have been on \"30 Rock\". But as this film is not a comedy by any means, these moments are the exception. I still struggle a bit with taking her seriously as a dramatic actress. Maybe she is a better writer herself than an actor. The perhaps funniest moment involved her too, but really just her job, when another supporting character wonders if Poirot follows her character's writing, the detective she wrote about, when establishing his modus operandi. Now that was somewhat hilarious I must say, also Branagh's/Poirot's face expression that follows immediately when he hears it. Besides the key story, there is also a minor frame plot you could call it where we are also given a very general solution in the end that the doctor must be evil. Not Dornan's character and we never see said doctor. We only hear one character talk to Poirot to find help at the very beginning and very end of the film. As the camera moves away from the rooftop on which the two men are talking. This is a film that is predominantly in the English languages and inclusions of French, Italian and Latin are very rare and you do not need subtitles particularly for these.I know some are not too fond of Branagh's Poirot, but I just like the actor in general, which surely helped in my case. I would still say that this was not my favorite film from the series. Another one I really adored, so this one is maybe second place or, more likely, third place. But it is still good enough for a positive recommendation and that was never in doubt for me. I just caught myself here and there thinking that I really did not care as much as I cared in the past with the previous film(s) about the question who committed the murder. Or murders. Of course, as usual, I also had no clue who would it be, even if in terms of the actors' popularities and fame, the solution is not totally out of nowhere. But also in terms of the first murder victim or you could say second murder victim, even if she is really the first one in fact if we look at the solution in the end, it came a bit out of nowhere and I did not think it would be this character, but surprise is never a bad thing and it also was not unrealistic or so. Another scene that stayed in the mind here was surely the moment in which Poirot himself is almost killed, drowned by the killer and the reason there is just the clothes he is wearing and that said killer mistakes him for somebody else. Perhaps the way it is done there, in terms of physical strength you could guess that it might not be a male, but maybe that is a bit too far-fetched and easy to say now knowing who was behind all this. The revelation about what happened to the young girl who died first, quite a while before the action of the film, was really tragic though what the mother thought about her and what she did there with the tea she gave her and also how an unlucky coincidence resulted in the killing. This is also why I was wondering if the \"killer\" would really kill somebody else afterwards, because she was not a murderer by definition. Not yet. But the line would get crossed.So yeah, this is it then. We get the usual scenes in which Poirot talks to the suspects about who they are and their motives while placing them on a chair. There are moments where you might smile like a reference from one character about Charles Dickens and Edgar Allen Poe or rather a comment from a child character about Dickens that Poirot cannot really disagree. Once again, funny face expression and reaction. So we have Christie, Dickens and Poirot combined if you wanna say so. The film starts a bit more on the light side with the first meeting between Fey's and Branagh's characters and also with a Halloween party for kids we got afterwards, but things do get considerably more serious soon. What is finally worth mentioning is that locked doors, almost a prison, once again mean that the cast list is relatively small and almost every character contributes something crucial to the story as it had been on previous Branagh/Poirot films as well. This is good. Things do not get too confusing this way. Exactly the right approach from my perspective. Overall, this film does not really have any major flaws and felt like a nice watch. The good is definitely way more frequent than the weak, even if there is no true greatness either, so a 60% approval rating sounds accurate. Maybe in the middle, the film did have some minor lengths, but as a whole I like that it did not get stretched (closer) to the two-hour mark for no reason with the help of pointless filler scenes. The haunting atmosphere at times is another pro and I liked how they depicted ghosts and spirits. Not too little. Not too much. I am sure you do not need a recommendation from me here as you have probably seen at least one of the two previous films and can make up your mind yourself, but if I had to give on then it would certainly be on the positive side and my suggestion is that you go see this film. Perhaps for Halloween 2024 then. It does not need to be in a movie theater. Or maybe see it before the next Poirot film gets its theatrical release. Or I know something even better: Watch it a few days before an upcoming travel to Venice. It might get you in the right mood.",
    "47": "I love mystery movies. I wanted to guess who is the killer before they reveal the answer. Beautiful location in Venice, great directing skill, good casts and there is no boring scenes. I like how he analysis the situation. It is a fun movie to watch. I love mystery movies. I wanted to guess who is the killer before they reveal the answer. Beautiful location in Venice, great directing skill, good casts and there is no boring scenes. I like how he analysis the situation. It is a fun movie to watch. I love mystery movies. I wanted to guess who is the killer before they reveal the answer. Beautiful location in Venice, great directing skill, good casts and there is no boring scenes. I like how he analysis the situation. It is a fun movie to watch.",
    "48": "Ooops! Ken, what were you thinking?Really shouldn't have listened to everybody else on this. You are better than what you did here!This was far from the book, and shame on the Agatha Christie estate for keeping their eye on the bottom line, and not a good and faithful storyline. It was entirely filmed in the dark, which was supposed to add something. Whatever it was, it missed- only served to make the film more difficult to follow than it already was. Easily the worst of the three; closer to an insomnia cure than entertainment. Many predictable loud noises intended to scare, ultimately serve only to have a loud noise. Ken, What was the parrot for? Tina Fey and her character should have been dropped; the only thing she brought was a budget drain.",
    "49": "POSITIVES:1) The performances are all superb, none more so than the young brilliant Jude Hill. It really is an ensemble with everyone worthy of praise, but Hill especially was a standout\n2) After the fairly lacklustre Death On The Nile, this film felt very original and like an out and out horror film at times. I loved the fact that the film went so far into gothic horror rather than playing it safe and being too mainstream\n3) The film is fairly short and zips along at a good pace. I never felt bored and was completely engrossed in the mystery the whole time due to the very well written script\n4) The technical aspects of the film like the direction, cinematography, sound design and score all deserve a mention as they were all strongNEGATIVES:1) Due to the main part of the film taking place entirely at night and entirely in the same house, I found the setting and the visuals to become quite boring after a while. The daytime scenes out in Venice that bookend the film were very visually engaging, but I didn't think the main setting of the house was vibrant enough and it became quite stale to look at\n2) A common plot point in films that I really dislike is when a character is drugged / hallucinating and their hallucinations end up giving them information that they wouldn't have known otherwise and they just play this off as their subconscious mind knowing something that their conscious mind doesn't. It happens often when a film needs a way for a character to learn something that they shouldn't know and I just can't suspend my disbelief enough for it.",
    "50": "To start, I loved Branagh's Murder on The Orient Express, I liked A Death on The Nile. The second film in this current series I found suffered from the overuse of cgi green screen settings and backgrounds. A Haunting in Venice corrects this problem and looks amazingly authentic. If it was fake I couldn't tell, except for some aerial shots maybe. Branagh is of course excellent in the lead role. The rest of the cast is amazing as well. The spooky atmosphere is perfect for Halloween season. The house where the story takes place seemed lighted only by lamp and candles, gorgeous. I was instantly immersed in the mood of the film, then the rain started and added even more mood and atmosphere. The camera work, angles and lighting are incredible. I was genuinely scared more than once during the film. A perfect haunting story. As you can tell I love this movie and can't wait to see it again. It totally made my October. This film, in my opinion, made up for any flaws in the previous film. Bravo Mr Branagh, please keep this series going.",
    "51": "What did I just see? Was that Poirot? What's with all those jumpscares? Poirot means mystery not some silly scares in a dark as night set. I was really disappointed since I loved both the Orient express and death on the Nile with their amazing cinematography . HUGE disappointment. I hope they remain faithful to the Poirot spirit for the next movie. I waited all this time for this, went to the cinema, convinced my partner who hates mystery movies to come with me because it was supposed to be amazing like the previous two, paid my ticket and all for me to say I am sorry to have dragged him to this disaster of a movie. 2 stars and not one because the acting was fine.",
    "52": "I really wanted to love it. I know this series is a little quirky but this one was just dumb. It wasn't spooky, which is ok by me. The camera work was very strange, zooming in at odd times on odd things and was very distracting. It was almost comedic. But actually just annoying. A great cast, I love them all but even they couldn't save this movie. The plot was silly, the dialogue sillier. The set was beautiful but even that was weird, why would two people be living there at all? Those are the weird things that run through my mind when watching, ha ha. I wouldn't recommend this movie, sorry to say.",
    "53": "A Haunting In Venice is a 2023 mystery starring Kenneth Branagh(who also directed this film),Tina Fey,Jamie Dornan,Kelly Reilly,Kyle Allen,Emma Laird,Michelle Yeoh and Jude Hill.The story begins in a post-World War II in Venice and we see Poirot(Branagh), now retired and living in his own exile, reluctantly attends a senace, where he finds out that a young girl named Alicia, a ghostis haunting the house. Together he teams up with Vitale Portfoglio, a former police officer and another writer named Ariadne Oliver(Fey) to uncover the case.But when one of the guests is murdered, it is up to the former detective to once again uncover the killer. Could it be Rowena,Ariadne,Rowena's ex fiance or the medium?.Overall I enjoyed this one better than the 2nd one (Death On The Nile)as it had a supernatural twist to it and it left me guessing who killed Alicia?.",
    "54": "Firstly, I am a huge fan of David suchet as Poirot on the long running TV series from UK. I was also disappointed with the first two Kenneth Branagh outings as Poirot. I was intrigued by the trailer for this third outing, so decided to give it a go. Much better than the first two. Not great but an atmospheric murder mystery that would be nice to watch on a winters evening at home. All the actors were excellent. The story could still have been more developed and interesting, so whilst I enjoyed it overall, it still lacked excitement and the feeling that you wanted to know what would happen next. Not enough time spent on each character but still decent over all with great visuals. Took my 12 year old son who gave it 8.5 out of 10. Film moves well and I did not get bored.",
    "55": "Never knew this was a sequel to Death On The Nile until I properly looked it up & paid attention to the Trailers. But having seen the previous 2 films & enjoying them, I was wondering if this would be any good.Set in post-World War II Venice, Poirot, now retired & living in his own exile, reluctantly attends a seance. But when one of the guests is murdered, it is up to the former detective to once again uncover the killer.I found the film to be decent overall. It's not as good as the first 2 films I must say. But this film does have enough mystery & a good dose of supernatural elements in it to make it not only watchable but enjoyable too.The main actor does well here as do the others in this film. Though the story, killer & end reveal were somewhat underwhelming for me, I did think it was good enough. The supernatural elements added to this & made the films slightly mundane premise better. It added a spark so to speak.The pacing & runtime aren't bad & to be honest is what makes this better than Death On The Nile given that film is 2 hours. Ok, 2 hours isn't bad, but me, I like films that get more to the point. This film was 1 hour & 38 minutes in length.There's some great visuals here. A bit of them in Venice in the day & night. Then there's the supernatural visuals which were well done, the part at the end especially was well done & the kills & action we got in the film generally, were well done too.Overall, it's decent 98 minute murder mystery laced with supernatural elements. While it lacks the creativeness of the first 2 films & has a wish washy plot & killer reveal at the end, it just about holds up I think & the supernatural elements help make it better. With some not bad kills & action, actors doing great in their roles (especially the lead) & some great visuals with a decent runtime & pacing, this isn't bad at all, but don't expect to much.7/10.",
    "56": "While the book was a challenging one to make into a movie, the casting of Tina Fey immediately made this an unwatchable mess. She does not have the ability or range to play this role. The direction is muddled and half the acting stiff and inspiring. Kelly Riley's character was under utilized and her performance seemed shallow, most likely at direction. This had such potential based on difficulty of the source material but it fell short of its potential. The bright spots include Branaugh's performance as well as much of the supporting cast but it depended too much on close ups and odd camera angles. This makes it difficult to follow the plot.",
    "57": "I'm a huge Agatha Christie fan and genuinely felt frightened watching this movie. It was quite out of the ordinary fare, very dark and crazy. Not exactly a who-done-it, but more of a character study of Poirot himself. What makes him tick, what gets under his skin and what frightens him? I found that aspect to the film to be more interesting. The visuals and scenery were a little too dark to be truly enjoyed, but still the ambience was set appropriately. When I walked out of the theater, there was just a nip of Fall cool in the air, it was dark and windy with not many people around - it seemed I was living an extension of the set. I would say Branagh achieved his goal of making a memorable movie.",
    "58": "I saw A Haunting in Venice, starring Kenneth Branagh-Tenet, Wild Wild West_1999; Tina Fey-SNL_tv, Baby Mama; Michelle Yeoh-Everything Everywhere All At Once, Tomorrow Never Dies and Kelly Reilly-Yellowstone_tv, the Sherlock Holmes movies.This is the third in the Hercule Poirot movies that Kenneth Branagh has been remaking, following the 2017 Murder on the Orient Express & the 2022 Death on the Nile-all of which I have enjoyed. Kenneth returns as the detective that was created by Agatha Christie and this movie is inspired by her 1969 novel, Halloween Party-a few changes were made from the original script for this movie. In this film, Kenneth has retired and is living in Venice when an old friend, Tina, shows up and wants his help busting a fake psychic. Kelly plays a woman whose child has died and Michelle is going to perform a seance for Kelly to talk to the daughter. Tina has tried to bust Michelle-unsuccessfully so far-so she turns to Kenneth. Michelle claims to be the real thing but Kenneth doesn't believe in the supernatural. The writing is great, as usual, for the Hercule Poirot stories and there are plenty of suspects, as more murders do occur and Kenneth sees things that even he has problems explaining.It's rated PG-13 for violence and disturbing images and has a running time of 1 hour & 43 minutes.I enjoyed it and would buy it on DVD.",
    "59": "Who is this film for? The answer is Kenneth.It's just a by the numbers whodunnit with a wonderful location. The entire cast looks feels like a hodgepodge of talent and talent less. There are soap opera level performances from several of the main characters. The acting only magnifies the previous films casting.The central plot is all over the place. Is it trying to tell us to believe or is it saying belief is hopeless. Honestly, you could land on either side.The actual setting is beautifully shot. Venice is a big character in the film. However it feels more like an excuse for the cast to be on vacation than a reason for a true murder mystery.",
    "60": "A haunting in venice is a crime drama horror mystery thriller film directed by kenneth branagh. First of all, a great performance by kenneth himself. He embodies the subtle detective pretty well. The other actors specially kelly reilly in the concluding moments occupies the frames. I like how the film uses dutch angle in the opening scene to create a mental torment. Probably, a foresign of what was on our way. The film establishes the 'deceit behind the supernatural' theme beautifully, crtiticises the mediums of the same. The film loses its steam in the middle portions, the conversations become repetetive. But, it quickly tracks back and finds its true way. Not a perfect film, but a great one to watch.",
    "61": "I feel like I am one of the few people who enjoy Kenneth Branagh's Hercule Poirot adaptation, despite the flaws. A Haunting in Venice is the 3rd entry and it has none of the flaws of the previous 2. The cast is much smaller, allowing for more focus on the characters and allowing the audience to remember their names. It is also shorter with a runtime of 100 minutes compared to the roughly 2 hours of previous movies. This results in a way better-paced and tighter movie.The one unique aspect of this story is how it blends horror into a detective story. Hercule is dealing with a case involving the supernatural and this results in some weird things he sees and hears. The film has some great jump scares that work well. This is no doubt that this is the best in the trilogy with a unique premise and an engaging case that will keep your eyes peeled.",
    "62": "A Haunting in Venice: I actually asked for a ticket to see Death In Venice at the box office! Portot is back and I've warmed to Branagh in the role. He's living in retirement in Venice, pastries delivered twice a day to his window by Gondola, and goes out to select his breakfast eggs. But he's retired and has a bodyguard to fight off the hordes who wish to engage his services. An old friend asks him to attend a seance, he obliges but is intent on proving it to be a fake. Thus begins a night in a haunted Venice villa, a children's Halloween Party preceding the Seance. Murders ensue, even an attack on Poirot himself. The villa itself is a character with it's dark halls, corridors, staircases steps and cellar, battered by a storm. Poirot started to see and hear things, could there really be a supernatural element to the events taking place? An ensemble cast once again with Michelle Yeoh shining as a medium/psychic. An enjoyable Agatha Christie romp. Directed by Kenneth Branagh, from a screenplay by Michael Green. 7.5/10.",
    "63": "Why bother to watch these dreadful Branagh Poirots' when the Peter Ustinov Poirots' are ten times better and more entertaining ... This at least had the potential of not being another unnecessary remake, but failed on all levels ... Its too short, there's no decent character development, there is no humour or horror ... Its looks decent enough but is full of nothing new or inventive ... The main interesting casting point leaves far too soon, with the only story thread that could have led it into new territory ... It just has nothing to recommend it and is limp and of little interest ... What could have been a great modern rendition of an old dark house movie ends up being a just another flaccid piece of Hollywood cluelessness ... Shame.",
    "64": "We watch the trailer. Looked like an exciting, thrilling and a creepy ghost movie. This movie is soooo boring. It drowns the audience in (Supposedly fun banter) and misdirection. This book by Agatha C had been turned into a Hollywood trope movie. Hollywood loves taking the quirkiness script of the old clue movie and trying to reinvent it in different ways...they are running out of ideas. Tina Fey oddly cast in this (love her in most other things). Not sure if it was supposed to be funny, even at least in parts. But alas, we did not even giggle. If you're looking for a good thriller, suspense movie...not this. If you're having trouble falling asleep at night, skip the sleep meds, put this straight to streaming mess on.",
    "65": "The whole atmosphere from the previous movies is gone. This movie desperately tries to scare you with bad editing, loud sounds, and incoherent scenes. The story and manuscript falls apart, and your left wondering wtf you just watched. This movie is nothing like the previous unfortunately.. The charming detective with his funny and compassionate quirks is gone, and replaced with a depressing and less relateble character, despite having the same actress.It's was shocking to see what the rewievs scores where after we saw the movie at the cinema, clearly someone has a full time job rating this movie higher than it deserves..",
    "66": "I went in separating the book and the movie in my mind because I've read the book and didn't want to be disappointed. However, I'm extremely happy they just went ahead and basically redid everything.I personally think there are two things that happened that didn't fit two of the main characters but that doesn't make me enjoy the movie any less.I didn't expect as many jump scares, but that's was kind of fun as well.I didn't end up guessing who it was until close to the very end but my date guessed long before that. I'm really bad at guessing so idk if it was just me or not. Either way I really enjoyed the movie and would watch it again!",
    "67": "Directed by: Kenneth Branagh\nWritten by: Michael Green\nDistributed by: 20th Century StudiosSUMMARYDetective Hercule Poirot is invited by his friend Ariadne Oliver to debunk a psychic medium at a séance. The whole gang becomes trapped in a house after the murder of the psychic. In the end, we find out that the original murder of the young daughter was committed by the mother, who wanted to keep the daughter all to herself, and the scary visions throughout the film are due to the hallucinogenic effects of poison honey.RATINGAA thoroughly fun ride, and unlike the previous film, Haunting has a distinct point-of-view with its brilliant gothic stylings. I like that Tina Fey is venturing into darker drama territory. I cared about all the characters here.",
    "68": "Never saw the last Poirot movie if i'm honest. But i love some of those older movies and the horror twist in this one looked like there was a different spin here. I'm not sure the spooky stuff works but the detectives stuffs still decent.The movie is so nice too look at with lots of beautiful Venice scenery, mixed with lots of creepy old buildings and twisted horror like camera angles. Kenneth Branagh has grown on me as Poirot but the acting from some of the other actors is what's first rate. Especially from the grief striken Kelly Reilly and Jamie Dornan.Being based on a short story. It does all feel a bit straight forward in the end, and i'm sure one of the lesser twists has been done time and again. But its still such a well made movie (with some great one off lines) that its hard to put it down too much.",
    "69": "\"A Haunting in Venice\" is as close an adaptation of Halloween Party as Captain America: First Avenger is to a WWII biopic, but it is all the more delightful for it. The film is distinctly different than other Poirot adaptations, with a suspenseful atmosphere and some excellent jump scares. To me, this film captures the charm and cleverness that made Agatha Christie great and wrapped it up in a gripping classic scary movie. While I guessed many of the plot twists well before Poirot figured out the mystery, the amazing acting and atmospheric cinematography kept me engaged to the end. I hope many more people go see it in person, because I want to see Baraungh back as Poirot if future iterations are as fun as this one.",
    "70": "Overall the movie was fine, but just barely. One where if you watched it on a streaming platform you'd probably have shut it off, but with a nice movie theatre popcorn it sufficed. Kenneth Branaugh isn't convincing at all. The fake accent is hard to understand and his character is not nearly as interesting as I think they expected or hoped for. The movie had some nice shots of Venice, but as I always say, so does National Geographic. The movie has a bit of a slow start but does get a bit more interesting when the murder mystery part gets going. Unfortunately , it's not one of those murder mysteries you can actually really figure out by collecting clues as the movie develops. The big reveal so to speak is really mediocre. It's convoluted and leaves you sitting there accepting what their explanation was but never for a second giving you any moments of \"wow\" or \"clever\". There's better whodunnits out there.",
    "71": "Kenneth Branagh has spent quite a bit of time playing Hercule Poirot over the past few years, and this is certainly a case where practice has made perfect in this excellent adaptation of Agatha Christie's Halloween Party.Hercule Poirot (Kenneth Branagh) is burnt out, and has gone into retirement, dealing with as few people as he can. Assisting him in his hermitlike existence in Venice is his bodyguard, Vitale Portfoglio (Riccardo Scamarcio). Poirot seems perfectly satisfied with his existence until one day when Portfoglio presents Poirot with an apple from a visitor who claims that Poirot will know who she is and want to see her. Poirot asks that the visitor be shown to him, and receives Ariadne Oliver (Tina Fey), a friend and author who rose to fame when she wrote about Poirot many years earlier. She invites him to come to a Halloween party and seance at a house which used to serve as an orphanage during the time the plague was running rampant in Venice. The building has been cursed since the resident children were locked in and left to die of the plague. Once at the party, Poirot meets the current owner, opera singer Rowena Drake (Kelly Reilly) who recently lost her daughter. Alicia (Rowan Robinson) to suicide. After the party, the seance is held by Mrs. Reynolds (Michelle Yeoh) in Alicia's room, in hopes of contacting Alicia. Also in attendance are Ariadne; Portfoglio; Maxime Gerard (Kyle Allen), Alicia's fiance; Leslie Ferrier (Jamie Dornan), Alicia's doctor and Rowena's longtime friend and possible love interest; Leopold Ferrier (Jude Hill), Leslie's son; and Olga Seminoff (Camille Cottin), Alicia's nurse. Assisting Mrs. Reynolds is Desdemona Holland (Emma Laird). Ever the skeptic, Poirot manages to debunk Mrs. Reynold's seance by exposing her other assistant, Alessandro Longo (Amir El-Mazry), Desdemona's half brother, who has been hiding in the chimney. As he is preparing to leave for the night, Poirot confronts Mrs. Reynolds about her fraudulent activities. She is unremorseful. An attempt is then unsuccessfully made on Poirot's life, followed almost immediately by the successful murder of Mrs. Reynolds. Poirot then locks everyone else in the house, and declares that no one will leave until he has found the murderer. A raging thunderstorm which renders the canals of Venice impassable helps keep everyone in the house while Poirot and Ariadne investigate.This is a first rate adaptation, so the writing is excellent, giving us compelling characters, each of whom has a reason to commit a murder, brought together in a tense situation, who reveal themselves through their interviews with Poirot. Strange events happen, which could be supernatural or could be explained, an ambiguity which propels the story to the very end. The house is atmospheric, and the thunderstorm contributes to the tension of the story. The reveal is particular masterful, putting together clues that have been sprinkled throughout the story in such a way that it seems to be the only logical conclusion.The movie was well cast, and the acting is superb. Kelly Reilly gives an excellent turn as the grieving mother (most likely using her real accent in this film). Jamie Dornan's tortured doctor is well played, and Jude Hill's precocious child who cares for his father as much as his father cares for him is brilliantly handled. Emma Laird and Amir El-Mazry manage to be by turns sinister and sympathetic. Camille Cottin's pious yet tortured nurse is quite believable and Riccardo Scamarcio is excellent as the bodyguard who knows more than he lets on. Michelle Yeoh is excellent as always as Mrs. Reynolds, making the most of her limited screen time. Tina Fey gives an excellent performance in a dramatic role, although she does manage to provide some comic relief during the film. Mostly, though, the film belongs to Kenneth Branagh, who plays Poirot's befuddled curiosity to perfection, as he gradually unravels the mystery in which he finds himself. He carries the film with ease, portraying both Poirot's relentlessness and compassion with total credibility.The ghostly elements of the movie are particularly well done, giving some real scares in a plot that specifically sets out to debunk anything supernatural. The ultimate denouement is somewhat ambiguous, but still quite believable, making for a most satisfying conclusion.Overall, this is an excellent film, guaranteed to keep you guessing until the end while it provides a shiver or two. So sit back, and prepare to go to a most unusual Halloween party...",
    "72": "This version of Christies 'Hallowe'en Party has been transposed from a British country house to a gothic pile in Venice. With a few scenes around the canals at the beginning and end of the film, the rest has been shot mostly in a darkened studio. Branagh overdoes his version of Poirot again, as he did in the previous 2 films.It was very difficult to keep interested in anything that happened with the plot or the characters and I was looking forward to heading for the exit.Branagh could have done so much more than this. He can be a superb and impressive actor, but this seemed to be him simply going through the motions.Totally underwhelming and forgettable. I felt that I had just wasted the previous 105 minutes of my life!",
    "73": "A HAUNTING IN VENICE (2023) **1/2 Kenneth Branagh, Tina Fey, Michelle Yeoh, Kelly Reilly, Riccardo Scamarcio, Emma Laird, Ali Khan, Kyle Allen, Camille Cottin, Jamie Dornan, Jude Hill. Third time's the charm with Branagh reprising his franchise role of Agatha Christie's sleuth Hercule Peroit (as well as helmsman) this time in a reclusive self-retirement to be coerced by his friend, author Fey, to a Halloween party to solve the possible murder of a young girl only to find yet another death in her wake that evening. While Michael Green's competent screenplay keeps things lively with a supernatural tinge undercurrent the proceedings are a bit stiff with an underwhelming supporting cast largely bland and forgettable. Gorgeous and haunting cinematography by Haris Zambarloukos and John Paul Kelly's atmospheric production design are the true stand-outs for the film itself.",
    "74": "Typical Beth!!!!I told those whom I was watching this with, that I expected this to be much like Murder on the Orient Express where many of the characters played a role in the murders (directly or indirectly).I changed my guess as to the murderer several times throughout the movie which is all you can hope for in a murder mystery, and I was pleasantly surprised with the additional twists.This is a much darker take on the franchise than those of either Murder on the Orient Express or Death on the Nile, and I for one am very happy about that. It's been too long since their has been a serious Who Dunit as the Knives Out Franchise and the Hercule Poirot franchise are much more PG and conical.I was very happy with this installment!",
    "75": "I hoped the first one would set the tone, but they are all different. And this one is a scary movie with jump-scares. Not just inside the diegesis, but for your eyes too. Having a ghost story filmed like a ghost story inside a detective movie doesn't feel that satisfying. And despite him claiming that he is tripping balls on LSD and none of what we saw was real (or debunked), it seems like he've actually found a so-called god after his shrooms trip. Because he went back to taking new cases, which he said he won't ever do unless there's a so-called god.There's an amount of cheeky modern cinematography, achievable only with editing in software and recording with hardware more compact than a centner monstrosity on rails. Seeing that in a fantasy film about king Arthur is one thing, but seeing it in a period-piece about Poirot left me with mixed feelings.",
    "76": "Poirot, now retired, and living in exile, is convinced by his friend Ariadne Oliver, to look into the honesty and integrity of a medium, who's set to visit bereaved mother Rowena Drake.If you're going into this one hoping for authenticity, you may be a little disappointed, I recently read the book, and aside from a few names and events, it is only very loosely based on the book.Authenticity to one side, I really did enjoy this movie, talk about an interesting choice, you can understand why Death on The Nile and Orient Express were chosen, but Halloween Party doesn't exactly lend itself well to an adaptation, but overall it works very well, plenty of plus points.The main winner, the visuals, with Venice they were never going to fail I guess, it looks sensational, but the camera angles and focuses are really nice, very atmospheric and suitably sinister, a shame a few scenes couldn't have been just a tad brighter. The masks, robes and costumes looked so good, they really did give it a Halloween vibe.I'd say this is Brannagh's most accomplished turn as Poirot so far, the toned down moustache has definitely made a difference, he feels more like Poirot.Well acted all round, Kelly Reilly is no stranger to Agatha Christie, she's excellent as Rowena, and as for the young man that played Leopold, he was great.My one gripe, Ariadne, I'm not knocking Tina Fey, she did a good job, but when you read the books, I just don't see her as an American glamour puss, I wonder if we'll see her again.I'm awarding an extra point for the fact that Branagh chose Halloween Party, and didn't opt for Evil under The Sun or Appointment with Death, but I wouldn't be surprised if one of those was number four.It worked well, 8/10.",
    "77": "Poirot (Kenneth Branagh) has retired and is living in Venice where he is visited by his old friend Ariadne Oliver (Tina Fey) who asks him to come to a seance held in a palatial Venetian house by top medium played by Michelle Yeoh who is seeking to speak with the spirit of a girl who apparently killed herself jumping from the building. Oliver wants Poirot to expose Yeoh as a fraud or start believing in the afterlife. He attends and there is a murder.Branagh's third go at a Poirot story and depending on your fondness for these things, potentially the best. It is very different from the previous 2 mysteries in that whilst the usual interviews and ripping up of alibis takes place, there is a very distinct supernatural element here, which may or may not be real. What Branagh does though is use this to create a much darker and decidedly well crafted spooky story (he should definitely make a straight ghost story) which is looking both for a murderer and proof that the ghostly bit is true or false. So whilst the gloss and usual extravagant beautifully dressed characters might be missing there is still a great mystery to enjoy. I hope he does another one.",
    "78": "A Haunting in Venice is the best of Kenneth Branagh's trilogy of Poirot adventures. This one being a smaller scale whodunit with a supernatural edge fixes any remaining issues whilst still being an engaging mystery with a satisfying answer to whodunit.Kenneth Branagh is still endlessly entertaining as Hercule Poirot, the humour is toned down here due to the darker story and yet again he's grown as a character by the end. Each one has tested something different, first it was his morality then his humanity and here it's his sanity that is pushed to breaking point.The cast is still undeniably star studded but still smaller than the predecessor which means no one goes unnoticed. Highlights include Tina Fey who makes for a great double act with Branagh's Poirot and Michelle Yeoh, given her best role in a Western film in ages (excluding EEAAO of course).Mostly being confined to one smaller, interior heavy location, Branagh's direction is even better that what's come before. His trademark canted angles have never been more at home and even though the film isn't massively scary, Branagh is still able to craft some effectively uncomfortable moments.Thanks to the location this franchise is finally free of the distracting CG that's been its biggest flaw. Being majority practical just makes the whole thing infinitely more immersive and means the stylish visual composition on display isn't having to make up for shoddy effects.",
    "79": "Whereas the last two Branagh Agatha Christie adaptations were movies I sort of liked at first and started to realise were \"meh\" over time, this latest entry is one that I recognised as mediocre upon first viewing.Granted, it was really refreshing to see that this time, the filmmakers clearly put effort into the locations and production design. The film looks authentic and gorgeous, as opposed to its predecessors that were over reliant on unnecessary CGI backgrounds.The story does have some interesting ideas and compelling character interactions, but they unfortunately take a back seat half the time. For the other half, we get a lot of weak attempts at horror and red herring plot points that really do amount to nothing.I don't know what happened with the performances, but half of them are pretty great and the others are...well, awful. The actors clearly didn't agree on what kind of movie they were in, with some thinking it ought to be straight drama and others thinking they should play it corny.Like the previous films, this is a middling whodunnit, with all the rote machinations you expect from the genre, nothing shocking, nothing gripping, but nothing so bad as to tank the experience.It's the definition of mediocre.",
    "80": "My Review- A Haunting in Venice\nMy Rating 6/10I was underwhelmed by Kenneth Branagh's latest interpretation of an Agatha Christie novel this one is based on her 1969 novel Halloween Party .It was written late in the authors life to luke warm reviews one critic Robert Weaver wrote - Halloween Party is a disappointment,but with all her accomplishments is Christie can be forgiven some disappointments Poirot seems weary and so does the book.It was filmed previously in 2010 for television starring my favourite Hercule Poirot David Suchet which I watched only after seeing A Haunting in Venice.I must admit Kenneth Branagh who I like in some roles and not others is my least favourite characterisation of Hercule Poirot.His first effort in 2017 Murder on the Orient Express also underwhelmed me but did exceedingly well at the box office however his last effort in 2022 Death on the Nile flopped and for me also had nothing of the grandeur or appeal of the original film adaptations.All that needs to said about the plot line in this whodunnit is that Belgian sleuth Hercule Poirot investigates a murder while attending a Halloween seance at a haunted palazzo in Venice, Italy.I was expecting more from this new original adaptation of the Agatha Christie novel Halloween Party that's set in the mysterious and spectacular city of Venice because it's a story I didn't know and I had no preconceived expectations.Spectacular Venice is featured in the start and conclusion of this film but it's mostly set indoors in a gloomy gothic villa that could have been built on any movie set.A Haunting in Venice for me fails in a few aspects primarily because of its dark gothic reworking from Kenneth Branagh. It's probably his best Hercule Poirot performance but for me his interpretation of the novel lacks The Agatha Christie touch of humour, eccentric characters and is trying to be something it's not a gothic horror movie it's not really scary at all just dark and brooding.After I saw this movie I watched the 2010 television movie Hallowe'en Party starring David Suchet my favourite Hercule Poirot that bares no resemblance to A Haunting in Venice . It's not her greatest story but the television version has humour and lightness as well as suspense and the performances are much more impressive in my opinion.There are some interesting actors in the cast of A Haunting in Venice including Michelle Yeoh who dropped out of The action adventure 2024 film The Electric State to star in this movie. Why she chose to do this I'm not sure because her role as the clairvoyant Mrs Reynolds is more a short cameo role as is Jamie Dornan's who plays Dr Ferrier .The main supporting role is Tina Fey as Ariadne Oliver a crime writer but she didn't shine for me either. Tina Fey plays a similar role in Only Murders in the Building as Cinda Canning but that role is edgy and funny which she does best .With a much more modest production budget of $60 million than his last Agatha Christie move Death in Venice Kenneth Branagh who also directs this movie in my view features himself as Poirot more at the expense of the ensemble characters which is a mistake in an Agatha Christie movie.",
    "81": "A Haunting in Venice is the third film in the now Poirot trilogy directed and starring Kenneth Branagh. I'm a very casual Poirot viewer. My only exposure to the character is through these films and the British tv series, which I watched long ago and barely remember. As someone who has never read a Poirot novel, I personally liked the previous two films by Branagh, Murder on the Orient Express and Death on the Nile. I know many Agatha Christie fans do not, and I can understand why given that these films are not extremely loyal to the source material from what I'm told, especially this film.I haven't read the novel, A Halloween Party, but I'm told the only thing this film has in common with it is that it takes place on Halloween, and that there is a Halloween party in it. The culprit is the same in both, but the motivation and victims are entirely different. I'm guessing Branagh went with a far more obscure Poirot story this time, banking on the fact that not many have read and so they won't notice the many alterations made to it.However, as someone who is only a casual fan, just like with the last two films, I'll be judging this solely as a standalone piece and not an adaptation. From that viewpoint, I think the movie is good. Like with the last two movies, the film looks great, is wonderfully shot. This one evokes a strong haunting, Halloween atmosphere. The acting is good by everyone involved, even the child actors.The film is also significantly shorter than the previous two, though in some ways to the film's detriment. I felt Poirot solved the mystery a bit too quickly. The pacing is a bit rushed at the end, and I'm not entirely convinced of how Poirot comes to the conclusions he does.Despite that, the film is a fun mystery/haunting story. A fun movie to watch, especially around Halloween. I would still say I still like Murder on the Orient Express the most. But I would put this film slightly above Death on the Nile. If you're someone who likes the previous to films in this series, there's no reason not to check this out.",
    "82": "I have loved everything about Kenneth Branagh's Hercule Poirot series so far. So to see that his next adaption was going to be a fresh one and be more along the lines of horror - sign me up immediately. And the film lived up to the anticipation. If you don't get goosebumps when Poirot says, \"Tell the police not to worry, Hercule Poirot is on the case\" then you need to check your pulse. What an incredible character.Venice is such a terrific setting for a film. I've loved it (and been haunted by it) ever since seeing 1973's 'Don't Look Now'. The final scene in that movie will haunt me until the day I die. Even though 'A Haunting in Venice' is mostly set inside a closed building, Branagh continues to find ways to remind you just how great this setting is throughout the film.The mystery itself is really well done. I wasn't familiar with the story at all and it certainly stumped me and had me impressed once everything was revealed. The cast, while perhaps not quite as star-packed as the previous two installments, all still do an excellent job and play their roles well.I really enjoyed this film. I have no idea whether Branagh plans to stop at three or keep going, but I promise I will continue to watch them as long as he's involved. He has proven he very much knows what he's doing. 9/10.",
    "83": "This movie is an absolute slog. It did a terrible job of keeping me interested and invested. It doesn't take much to hook me, but I was barely engaged. I felt this from beginning to end.So much of this movie feels off. It's filled with eyebrow-raising moments. Like really odd character reaction shots and super awkward editing. Or other weird things, like a character who is listening, so she repeatedly says, \"Listening.\" I couldn't help but laugh.The only thing keeping me from leaving the theater was finding out the reveal and explanation. Unfortunately it's super lame and kind of dumb. Also, I'm a fan of Tina Fey but she doesn't fit here.The one positive that stands out to me is it's visually appealing. That's about it. I had a terrible time with this movie. Knives Out is now the clear winner of this mystery movie series rivalry.(1 viewing, early access screening UltraScreen 9/13/2023)",
    "84": "The film is a nonstop parade of extremely wide angle shots done from extremely high or extremely low positions. That and tons of dutch angles. If you get motion sick, avoid this!Usually those kinda camera tricks are used sparingly for a very specific effect. When used constantly, they lose impact and begin to confuse the audience (and make them nauseous!).Then, the script. It's silly and thin. The acting is all around just fine. But the lines and situations are dumb. Branagh can act, but his impression of a Belgian man is... uh... embarrassing.Finally, who is loving this stuff? It deviates incredibly far from Christie's stories, that I can't imagine too many hardcore fans liking this. Plus, when you have a rich history of David Suchet and Joan Hickson turning in fantastic performances as Christie's beloved characters; this one just feels wayyyy off center. No fun.",
    "85": "No-one would deny that Kenneth Branagh is a talented man and, in the right role, is certainly a fine actor but he's no Olivier and he's certainly no Orson Welles but he seems to have the ego of both. He gave us a fine \"Henry V\" and then an elephantine, full-length \"Hamlet\" that almost put me off Shakespeare for life. Now it seems he's put the Bard to bed and decided that he's the best man to take on the mantle of Hercule Poirot but I forgot to mention that he's also no Ustinov, Finney or David Suchet.His remakes of \"Murder on the Orient Express\" and \"Death on the Nile\" were both well below par and now he's turned his attention to an Agatha Christie novel not previously filmed. \"A Haunting in Venice\" is his version of \"Hallowe'en Party\" and it's just as tawdry as the others. To make matters worse this one lacks the star power we've become accustomed to in movies of this kind. Yes, there's last year's Best Actress Oscar winner Michelle Yeoh as a medium but basically that's it.As for the rest there's Jamie Dornan acting, or perhaps not 'acting', like he would rather be home in Belfast while his \"Belfast\" son, Jude Hill, is once again cast as his son. Elsewhere Tina Fey, Kelly Reilly, Camille Cotton, Kyle Allen and a few other less than famous faces mug their way through as various suspects. The setting is a 'haunted' mansion in Venice, there's been a murder and once again we are back in a stationary Orient Express as Branagh locks everyone in until he's solved the case. A disaster that should never have seen the light of day.",
    "86": "The one thing a good whodunnit should not do is put its audience to sleep. Unfortunately, this latest cinematic adaptation of an Agatha Christie novel fails miserably on this score. Director Kenneth Branagh's third outing as Belgian sleuth Hercule Poirot is a protracted snooze that leaves viewers caring little about the characters and even less about the story in which they're trapped. When the famed detective (Branagh) - now in retirement in Venice - is called upon by a friend and author of murder mysteries (Tina Fey) to help her verify or discredit the psychic powers of a medium (Michelle Yeoh) at a séance at an allegedly haunted Venetian palazzo, he's drawn into yet another of his famous investigations. The problem here is that what should be an engaging story is interminably dull, one that, regrettably, prompts frequent checking of one's watch. Moreover, virtually the entire film is shot with excessively dark camera work (so much for showing off the glories of Venice). And then there are the performances, which feature good turns by Yeoh and Jude Hill but a positively wooden portrayal by Branagh (compared to his previous depictions of the protagonist) and an absolutely dreadful performance by a woefully miscast Fey. To its credit, like its recent predecessors, the production values of this Christie offering are top shelf, but that's about all this release has going for it, a far cry from the much better overall work found in \"Murder on the Orient Express\" (2017) and \"Death on the Nile\" (2023). Indeed, even fans of the famed mystery writer are likely to find \"A Haunting in Venice\" tiresome and tedious. Pack a pillow for this one.",
    "87": "By 1930, Agatha Christie was fed up of the highly storied, but by-then \"insufferable\" Hercule Poirot. Yet her audience clamoured for more, prompting a reluctant Christie to churn out more of Poirot's cerebral, holmesian outings. It would seem history has repeated itself, people still want Poirot; but what we really need is something completely new from the drawing board. Christie would (probably) grimace to think that Poirot is getting a \"Poirotverse\" for-profit film series quarter way into the 21st century. Maybe the hunky, eccentric Benoit Blanc is a better sleuth-in-vogue or, dare one say, give the limelight to a fresh faced, budding whodunnit author. Instead, Branagh is eagerly sinking his teeth into what looks like a long dreary commercial march through 33 novels and 51 short stories of source material.This film sets out to combine the whodunnit with the horror genre and misses the mark on both. The meticulous, verbose, people-focused nature of the Christie-style whodunnit struggles to pair well with the timely, atmospheric build-ups of horror. Both needed time to deliver their respective punchlines. Neither had the scope to do it, and the waters became quickly muddied. The musical score (snore) is notably absent; sometimes using gaps of silence can be eerie and build tension, but here it's so overdone that the effect falls flat. The Dutch angle is used excessively and jarringly, and the film's direction just feels overall disjointed as Branagh both acts and directs. The screenplay is lifeless, the setting is dark and lifeless, the plot's culmination is lifeless. No joie de vivre, no buoyancy. One highlight would be Michelle Yeoh.If you're a Christie fan or devotee, you'll likely be pleased just seeing a depiction of Poirot on-screen, I'm sure. But for most people, I'd imagine this may disappoint.",
    "88": "I am not going to lie, I was very intrigued for this latest Agatha Christie Hercule Poirot offering. Unfortunately My hopes and excitement vanished within 15 minutes into the film when I realized how badly directed this was and how deadly dull the vibe of this film was going to be.There was no energy to the proceedings. The odd camera angles made my eyes roll. It was going for a artsy fartsy pretentious look with a oh so serious note that lacked any fun or thrill.I kid you not, halfway through one of the five at evening showing audience member started snoring.Tina Fey was horribly miscast and the guy from Fifty Shades was beyond bland and his acting was pure cringe. Aside from a few super lame jump scares this movie was so boring and a cinematic cure for insomnia. Michelle Yeoh and her bad wig needed to cash a paycheck because her role was beyond short and wasted.Everyone looked miserable and slightly embarrassed to be in this. I kinda wished it had camp appeal but everything played so serious and nothing about this was remotely unintentionally funny.The reveal at the end was so lackluster and dumb, it felt like you were watching a really bad Hallmark Mystery TV Series. This movie is going to bomb hard. It's pure cinematic torture and one of the years worst.",
    "89": "Kenneth Branagh is one of the great filmmakers of our time. And he was meant to play Hercule Poirot. He may be the best to ever do it. And I must thank him. I have taken on reading every Agatha Christie novel that he has adapted for film here in the last few years.I love to read her novels and then see his take on them in theaters.It is a joy. Such delicious fun to do so and I highly recommend this activity.Murder on the Orient Express.Death on the Nile.And now this film, based on Christie's novel, Hallowe'en Party.And there are some differences between this film and the book for sure.The biggest being the setting.The book takes place in England.And there's no seance.Some of the characters are the same, some are the same in name only, and some are not in the book at all.But this is still a fantastic and fun film to watch during spooky season.I loved it, even though I also love the book.Venice at Halloween?Yes, please!Tina Fey is wonderful as a mystery writer and friend of Poirot.She is just so lovely and perfect here in 1947 Europe.Michelle Yeoh, Kelly Reilly. Their stars shine so bright.And Camille Cottin, who I adored in Stillwater, well, I adore her here too as Olga Seminoff a character from the book (though not as I pictured and not the same as the book) and Jude Hill as Leopold also from the book but not the same but still great.This movie is an enjoyable mystery. It is a classic mystery.It's not Saw X or Nun II or even Halloween Kills.It's a dark film with a definitively ghoulish mood that oozes off the big screen.If that's your cup of tea, get ready to say Trick or Treat.Read Hallowe'en Party afterwards.I hope Branagh continues adapting Christie's novels. I will keep reading them if he does.",
    "90": "LIKES:The Pace:\n-Mysteries can be dull, all the setup, talking, and attempt at character development essential, but sometimes winded.-This movie though, not as much. The third installment has a pace that does the introductions, but does not drag its feet doing it, instead establishing the lore and mystery right from the get-go.-Thrills, chills, and the ever present case of murder linger in the air from then on, making it exciting, fun, and a bit of a challenge to keep things moving.-And even the ending has the same Christie feel, intense, dramatic, and theatrical to the point for that epic conclusion of who solved the case.The setting:\n-The mystery has an element of horror, and in my opinion, setting holds a lot of ground in how it comes off. Hercules' third case, accomplished that in spades for me.-A manor that is broken down, but not decrepit is the scene of our mystery, and it works so well to have the elements of horror, but the logic of being a place this happens.-Within the walls of the Venice is that air of nightmarish uncomfortable feelings of legend, the areas that show the nightmares of old, but yet buffered by the safety of the modern world.-It's such a great place with shadows, low lighting, elongated halls, and mystery mixed with spooks that are engaging to say the least. And that setting is almost a character as much as the others.The Cinematography:\n-How do you use a good setting? Simple, you get good camera work to make it come to life.-My mentor and I agreed that the direction of filming was fantastic, with good focus on bringing every inch of the manor to life and finding that key shot to give you as much as you could on the piece.-Diverse angles, mixed with close up shots, help give you that element of emotion, but always keeps the room in check. The way shots of horror come out to be spooky and engaging, but questioning helps keep things in check, and I like that very much.-And to really keep things moving without getting too overboard with the visuals accomplishes more than most may realize in just really bringing out the dismal nature of the film in the Canal City.The Sound Editing/Music:\n-Horror movies rely on sounds as well to help elevate, and though this may be a mystery, the setting requires that kick to blend both worlds.-I believe they accomplished this. Pounding doors, the moaning of the halls, the shrieks of other components... it all works.-The movie focuses on using subtle bumps in the night to help them uncover mysteries, but mixes those scary qualities in to help enhance both types of the genre.-With music to assist, that is of the times, the track list is one part cultural setting and fun, and one part that mood setting music that accomplishes so much.The Acting:\n-Another fine display, Hercules third cinema case in this line accomplishes the task of thespian work come to life in the classic way.-Every character, for the most part, has strong personality, collected balance, and works to make an incredible spectacle come to life.-Starting with the top three credited. Dornan is good in his role. Eclectic and jittery with that touch of trauma, his role is complicated and requires extremes. Yet, I found him to hold the extreme parts back enough to not be annoying, and with his young costar really make a touching relationship that was engaging to watch.-Special shout out to Jude Hill for his take on a complex character that is one part creepy, one part mature, and one part vulnerable. It was incredible to see what he accomplished, and quite honestly my favorite character outside of Hercule.-Yeoh, is great as usual. Her emphasis and incredible manner of speaking as elegant, fun, and so poised still enchanting to this reviewer, but at the same time dives into the extreme bouts of the horror that sort of works at me most times.-As Branagh has his character down pat. He knows the cues, he knows the personality, and he knows how to deliver the lines with that same mix of comedy and serious tone. This time, there is a little more challenge to the character and I think his direction and acting continue to evolve Hercule past the simple detective stereotypes most know.The Story:\n-It's probably my favorite of the three movies in this series.-A Haunting In Venice has essentially three elements to it, and I found the movie to play nicely with them and really give something for a lot of people.-One part dramatic element, one part horror that tests your logic, and one part mystery that weave together into a strong brand of rope to tie everything together.-And at the center is character driven motives that work to enhance the story, rather than be an extreme arc or side note that undermines the pace. That worked well for me and helps to further make this story stand out from the others.DISLIKES:Horror acting:\n-There are times where the horror genre requires people to do some hard things and times it gets silly.-Yeoh has one of those moments that made me really focus to not laugh, turning in her chair and making faces that were goofy. Was that the goal? Don't know, but it accomplished it in my book.-Other times, the screaming and terror are a bit too theatrical and corny, but, this is few and far between and nit-pick more than anything.Plot Elements That Feel Incomplete:\n-The biggest dislike, this movie runs at 90 minutes ( a good thing at times0, but something feels missing in the final cut of this movie.-There are some elements and characters that seem to hold more than we get. There is history and conflict that we see brought out, but the resolution, or the aftermath, seem rather diluted and thin.-Other characters with their visual cues and elements seemed to have other plots in mind, but again, feel shuffled and lost to a rather drab finish.-It's these elements that make some of the characters rather forgettable, again emphasizing that character use is important if you are going to include so many from a book.The Loud Volume:\n-Blame it on the theater, or my sensitive ears, but for those like me, the movie is loud and potentially detrimental to the ears.-Have earbuds, or something because the movie fluctuates enough that you are going to be hit hard and that can make the movie less enjoyable if you aren't prepared.The VERDICT:\nA Haunting In Venice is probably my favorite of the three adaptations so far, and no I have not read the books so please factor that out. The movie handles the genre mixing well, horror, mystery, and drama really capture and working together to give a mystery a little more oomph. The visuals and sound editing go a long way to helping support the plot, with a direction and acting to recruit character that make a cast of very suspicious charges. And making a story with this case only further helps to differentiate it from the countless mysteries and crime dramas that tv holds. A Haunting In Venice is quite honestly a solid piece that uses the theater elements well, and gives us another fine adaptation in the Hercule archives for cinema. But... The movie is another detective element with a formulaic component that you might find stale. Bouts of acting trips are noticeable, but not horrible, but in reality feels incomplete and missing something with the characters to truly maximize the amazing potential it has. A rushed pace with some cuts makes this movie still feel not as unique, and those looking for that film that stands out from all the others will not find it here, so lower the expectations on that. However, this movie certainly is worth the merit of going to check out and see if you can solve the case of the dead daughter, and so long as you prepare, wearing earbuds to help.My scores are:Horror/Drama/Mystery: 8.0\nMovie Overall: 7.0.",
    "91": "Finally, Kenneth BRANAGH has selected a somewhat lesser-known template (Halloween Party / The Snow White Party) by Agatha CHRISTIE. And lo and behold: a fresh wind is blowing through the eerie palazzo in Venice. The beautiful pictures are very strange, and there are also moments of shock.The cast is excellent: In addition to ACADEMY AWARD winner Michelle YEOH as a mysterious medium and erotic legend Jamie DORNAN (50 Shades of...) as a war-disabled doctor, lesser-known faces such as Kelly REILLY, Camille COTTIN and Kyle ALLEN also shine. Jude HILL, who played DORNAN's son in BELFAST, and Tina FEY as an Agatha Christie satire are really great. With this slight detour into the horror genre, the series can continue. Poirot himself also becomes more complex. So far, the film has grossed USD 89 million at the worldwide box office. We'll see whether DISNEY is enough for a fourth film.At the end, Kenneth BRANAGH sits on a roof terrace with Amir El MASRY and we, the cinema audience, are treated to an enchanting drone flight over Venice. Fantastically beautiful! Now I don't have to go there anymore, I've seen everything...",
    "92": "Forget the early 9/10 shill reviews, this movie is just plain terrible. The script is VERY dull, with pacing and tonal issues, but what really destroys the film is the visual mise en scene and the terrible editing. The whole film is shot at strange, jarring angles, many times with fisheye lenses. The camera will also spin or move around bizarrely for no reason.Then, there's the cinematography. The night scenes are so badly under lit it's hard to make out anything that's happening. Couple that with machine gun-paced editing and it is literally impossible to feel pulled into teh story. Branagh just does his darnest to make sure the technique always gets between you and the story.The film sports a stellar cast, yet most of the actors are truly terrible in this, including Branagh as Poirot who kept getting laughter in the theater I went to every time he spoke.Disclaimer, I walked out 30 min before the ending. I just figured I'd rather go home and do something I'll truly enjoy.",
    "93": "...and that's where my praise unfortunately ends.I thought my expectations could not have been any lower, but I was wrong. I honestly went to see this movie saying to myself, \"it's probably going to be bad and cringey, as the kids say..but what the hell, it's a Poirot\".It's called A haunting in Venice, obviously, it's going to take place in Venice, Italy, they'll find a reason why Poirot would be there - he travels a lot, it will make sense. It didn't.He apparently wanted some peace and quiet, so he retired..to Venice.Not English countryside, not any other countryside, Venice. (He reaaally doesn't want to be bothered - in this crowded city...he literally hired a bodyguard, to keep people away from him - in this crowded city..This bodyguard even beats up random people, that try to approach Poirot for help and only the pastry baker is allowed near him, twice a day.) Could have been worse, I guess, they could have made him retire in the walled city of Kowloon.This is one of the many totally nonsensical elements in this film.1947, Italy - how many Italian characters are actually in the film? The bodyguard/ex policeman, the pastry baker, the guy who wants to see Poirot, because his family is dead..and? The extras? The children that visit the palazzo on Halloween are Black and Asian...in 1947 Venice. In 2023? Absolutely, 100%, wouldn't question it a bit. In 1947? Yeah, nah.The Hungarian/Gypsy \"siblings\" are so obviously not even remotely related, it's not even funny, their names are \"Desdemona\" and \"Nicholas\" - \"Holland\"? - sure, typical Hungarian and Romani names.And then there's \"Mrs Reynolds\". Are you kidding me?? A lovely Asian lady, with a lovely English accent..and with a lovely non-Asian name..in 1947. Again, if it was set in the last 30 years, sure.Now imagine, that this character was actually portrayed like a mysterious Asian/Oriental lady medium, with a proper Chinese name, who would speak in broken English - how much more depth and mystery that could add. Instead we got something like \"'ello, my name is (insert the most generic name you can think of, like : Jennifer Smith..or how about \"Mrs Reynolds\"), hello, I'm Julie, or whatever Reynolds, and I be your medium tonight\".So very and unnecessarily inauthentic.It's almost surprising, that when the phone rang, it wasn't an iPhone.The rest of the cast is also quite meh. Jamie Dornan and the mother bothered me the least. The \"Poirot\" actor/director obviously hates the character, makes him look like a total buffoon. Yes, Poirot is quirky, but come on.Yeah, like Poirot, with his perfectly manicured moustache, would let this strange woman, place a mask over his face, cape over his head..yeah, right..and to walk over to the giant bowl, to submerge his entire face...to fish out an apple with his teeth! Poirot doing something like this? It's like Superman burning down a shack full of cute little bunnies and puppies.Moronic writing. I don't remember Ms Oliver being American and a despicable person, she is weird and of course, like I said earlier, Poirot is weird too in the books and other adaptations, but there's a limit to their weirdness.All the characters are actually excessively weird.The only positive points I can actually think of, are the scenery, which is very nice, and overall, the cinematography is great. These two thing make it look like it should be a really good film, unfortunately, the film is quite abysmal.Acting overall is just over the top. Everybody. And it's really annoying. The \"Mrs Reynolds\" lady spinning around and yelling is eye roll inducing, some of her other scenes are not bad. Except for the \"listening\"..\"listening\"...\"listening\"..and again some more \"listening\". Just enough already... Angry \"Poirot\" is trying to be an angry David Suchet Poirot...but at least he's copying the second best Poirot (BBC's John Moffatt is always no. 1), Peter Ustinov is 3rd and this current one probably somewhere around 57. I wouldn't hate him as much, if he wasn't also the director. He's not playing the character like someone else wants him to play it. He plays it like he wants to. This is how he sees it. That's just sad.I can see how people, who have never actually read the books, listened to BBC radio plays, or watched some much better versions of Poirot stories would like the film much better than I did, but I've spent decades loving this character, so for me this movie was very boring, shameful and embarrassing.",
    "94": "What did I like ?Venice looked niceBut not much elseFirst jarring moment was when a medium randomly draped a hooded cloak and a halloween face mask on Poirot (Wasn't he supposed to be really fastidious about his hair/clothes/looks etc ? )Next jarring moment is he ambles about in this getup then decides he's going to stick his precious moustache into a bowl of water and apples (to randomly try getting a bobbing apple ) Uh ??Having watched years of David Suchet so meticulous in his portrayal of Poirot Brannaghs efforts are a cardboard caricature by comparison.The film doesn't know if it's a murder mystery, a horror, or a ghost story.Characters are thin and lack development and it just doesn't deliver on any level. Very dissappointing.Would I watch again? No .",
    "95": "As someone who has read lots of Agatha Christie, used to watch the BBC Poirot TV series, and has enjoyed the previous two Poirot adaptations, I was excited to watch this film. Unfortunately, it was pretty disappointing.While I think all of Kenneth Branaugh's versions have its flaws, this adaptation was definitely the worst yet. The premise is intriguing enough, but the mystery feels a bit simple compared to the others. I guessed the ending pretty early on- even if you don't guess it, you probably won't be that surprised by anything. The characters also feel a bit underdeveloped and boring, and the setting is pretty dismal and dull (especially compared to the last film). Michelle Yeoh's character is probably the best part, but she's hardly in it.Overall worth a watch if you want to keep up with the series, but don't expect anything great.",
    "96": "At the behest of his author friend Ariadne Oliver (Tina Fey), retired world famous detective Hercules Poirot (Kenneth Branagh) attends a seance to try and debunk medium Mrs. Reynolds (Michelle Yeoh), who has been hired to contact the spirit of the deceased daughter of opera singer Rowena Drake (Kelly Reilly). The seance takes place in a creepy, rundown palazzo in Venice reputedly haunted by the vengeful spirits of children left to die there - the ideal location for a scary movie. Poirot quickly exposes Reynolds as a fraud, but when the woman is murdered shortly after, the detective's investigations lead to him become unsure about his previous convictions on the subject of life after death.A superb cast, slick direction from Branagh (this is his third turn in front of and behind the camera for a Poirot movie, so he knows what he is doing), and a script that that ably mixes mystery with the supernatural make this film perfect for the spooky season, which is why I am surprised that it was released mid-September and not the week before Halloween (maybe they're intending to have it streaming for October). There are one or two moments that prevent the film from being perfect - would a great detective drink a cup of tea offered to him immediately after an attempt on his life? - but overall this is a good time for whodunit fans, largely thanks to the solid performances and Branagh's deft handling of matters.",
    "97": "A Haunting In Venice (2023) :\nMovie Review -A Haunting In Venice Review: Kenneth Branagh quoted, \"My name is Hercule Poirot, and I am probably the greatest detective in the world,\" and we believe in his supremacy as he offers a new mysterious ride with \"A Haunting In Venice\". Agatha Christie's \"Hallowe'en Party\" (1969) is a well-known novel, but this is the first cinematic adaptation it ever had, serving as the next chapter in Branagh's detective franchise after \"Murder on the Orient Express\" (2017) and \"Death on the Nile\" (2022), which starred Branagh as Poirot. Christie's story has a splash of horror and makes for a fine Halloween experience for Poirot lovers. Kenneth's cinematic adaptation is sold on the same values but is a bit dragged as far as the gripping cinematic experience is concerned. The film takes the entire first half to build the characters, tensions, and atmosphere, which is too boring. Thankfully, it excels better in the second half as the mystical facts are revealed and the suspense is well explored to fulfil the genre's demands.Detective Hercule Poirot (Kenneth Branagh) is retired and living a cold life in Venice. He is called to attend a seance by his pal, Ariadne Oliver (Tina Fey), a crime novelist, to which he reluctantly agrees. The motive behind attending this seance is to debunk the claims of Mrs. Reynolds (Michelle Yeoh) that she can speak to dead people. These three are invited to Rowena Drake's mansion (Kelly Reilly), along with other guests who are somehow related to Drake and her dead daughter. The first attempt at a superstitious horror scene is immediately exposed by clever Poirot, but soon he is caught under the spell. As he hears voices and sees demons, a couple of murders take place in the mansion. Tired of pretending about his reluctant retirement life, Hercule Poirot is back on the job to find the killer. Will he find it or remain clueless about the mystical Gothic events?Michael Green's screenplay offers a novelty factor of horror elements to Branagh's detective franchise. Now, if it works or not, it's all up to you and how you look at this franchise. It's a fictional detective series anyway, so it didn't bother me much. What bothered me was the pace of the film. The screenplay for a 100-minute film should be fast-paced, especially with a suspense thriller. Green's measurements go wrong here. He still covers the rest of the narrative nicely in the conclusion part; it's just that we have to wait almost 70 minutes to arrive at the point. Poirot's character also looks too deemed and dull in the beginning, or, say, until the first is over. The main force has to be on the front for a longer period of time to win the battle. Branagh was kept behind unnecessarily, I believe. In 100 minutes, the actual film, the actual thrill, stays for only 30 minutes, leaving you somewhat satisfied and somewhat disappointed as well.Kenneth Branagh's accent was getting on my nerves in those early films, but since I have been acquainted with it long enough now, it does not annoy me. Actually, it's among Poirot's best features now. Branagh shows a little complexity in his character, as demanded, and who knows, you might end up liking that. He isn't the same as he was in the previous two films, so it's a new tide, I guess. Kyle Allen, Tina Fey, Kelly Reilly, and Michelle Yeoh are the ladies I'd remember from this haunting detective thriller. It's not normal to have so many female characters in a murder mystery, but sometimes it's needed and it's suitable too. Also, horror elements work on a higher scale if they are focused on women. The other cast has also done a decent job, which includes Jamie Dornan, Jude Hill, Camille Cottin, Riccardo Scamarcio, Emma Laird, and Ali Khan.Haris Zambarloukos handled the camera very well. I am just not sure whether those constant top views during thunderstorms were really needed. The artwork and visuals have been cheerful despite the old-school layout of the haunting mansion. A Haunting In Venice is set in post-war times, so I can understand why it was so mild in the beginning. The effects of war reflected on many human lives, while some didn't really care. This conflict is clearly visible in all characters, and the background score sounds apt there. Kenneth Branagh's filmography as a director is colourful and diverse. Comparing his adaptation style of Christie's novel to that of the great Sidney Lumet and John Guillermin from the 1970s would be unfair, as he did all he could to bring modern versions of the suspense stories. His creativity and storytelling might differ, but he never hurt Agatha Christie's acclaimed works. Even now, he bares it all to give full justice to Poirot's horror mystery and delivers a standard suspense thriller. It's a bit dragged and soggy, that's all. And we are just being fed with this stuff from all over the world, be it films, OTT, or TV, so somewhere, we are bound to get bored. Some people are very fond of this genre, though, so it's haunting enough for them.RATING - 5/10*",
    "98": "This is another one of those movies that would be more fitting on television, because of it's average quality: no originality, no thrill, no jokes. Just another detective story, with a lot to criticise about:The bad: I couldnt stand the leading actor, with his silly fake moustache and his even sillier (and hard to understan) fake accent. Kenneth Branagh directed AND starred in this picture as leading actor and his performance felt like a gimmick. But that's just my personal opinion.More bad: what's most annoying though is that this movie INTENDS to be spooky, but simply FAILS to achieve any real thrill. Even the suspense is lacking.And what's about all these dark scenes. There is so much darkness that I begin to wonder if they hadnt had any money for decent sets, and scaling down the light is a quite effective way to cover up that this movie is made on a budget.Not terrible, but kinda uneventful and quite tedious to be honest. Perfect sleeping pill...",
    "99": "A Haunting in Venice is a movie that claims to be based on Agatha Christie's novel Hallowe'en Party. However, the movie changes almost everything from the book, from the title, the setting, the premise, the tone, the characters, the timeline, the murder victim, and the murderer's identity. The movie makes many changes to enhance the story and create a suspenseful and mysterious experience for the audience. The movie also introduces supernatural elements and blurs the line between hallucinations and genuine ghostly encounters, while the book focuses on ordinary murders committed by regular people.Similarities? Hmm, both works feature Hercule Poirot as the main detective who solves the case with his brilliant mind and keen observation skills. Both works involve a murder that occurs during a Halloween event (a party in the book and a séance in the movie) and has a connection to a past crime.A Haunting in Venice diverges significantly from Hallowe'en Party, so that it's unrecognizable. Worse, Poirot is also unrecognizable. Poirot would never say the truth is sad, or there is no God or soul. He was a devout Catholic. He would not solve cases based on clues but on psychology. Ariadne Oliver would never betray Poirot's friendship.What a sad little movie that was.",
    "100": "Kenneth Branagh loves making Agatha Christie movies, but it's not necessarily something he's great at. None of his movies are near the top of the Christie films, but Branagh does the slick celebrity Christie movie well enough that they're worth watching if you keep your expectations low.At first, Haunting in Venice looked like a movie where low expectations might not be necessary at all. The haunted mansion setting is very stylishly filmed, starting with a great shadow puppet story and giving us mysterious gondolas on the canal and people in spooky masks. And Michelle Yeoh is terrific as a medium hired to run a seance to contact the owner's suicided daughter.Soon there's a body and Poirot is on the case. But besides the usual human suspects, could the murder have something to do with ... ghosts?The nods to the spirit world are a little out of the norm for Christie's mysteries (although she did actually write some spooky stories outside her mysteries), but I don't think it's too much, played as it is in a spiritual ambiguity where you can choose to explain it all away rationally - or not.The movie is a lot of fun at first, but runs into troubles along the way. First there is the issue of Ariadne Oliver, who seems off. I read all Christie's books 40 years ago, so I'm hardly an authority, but Ariadne is not the character I remember, and who was a lot of fun. Tina Fey's Ariadne is fun at first, but the character lacks consistency in attitude and action, and by the end is unsatisfying.Also, the explanation, when it comes, is overlong and a little ridiculous. So the last part of the movie drags a bit.I actually like Branaugh's take on Poirot - maybe a little too angsty, but at least not as excessively so as in Death on the Nile. And I did like the high-style haunted house vibe. But the denouement dragged on.Still, overall I think I like this the best of the three Branaugh films. Who knows, maybe if he makes enough of them he'll finally make a great one.",
    "101": "The plot is messy. The characters are very bland, and not the iconic ones in the original. Everything about it is annoying.But the worst of the worst is Poirot. This angry creep is not the charming if slightly silly, except when he needs to be deadly serious man that Christie created. This is an unpleasant, rough, angry man who falsely impriosns people, not caring at all for their safety. It's completely impossible to realize that Poiurot is COMPLICIT in the deaths by not allowing the people to leave the house, which he had no right to do. It is disgraceful. I could put up with it if they changed Poirot into something, but not something this unpleasant and ordinary. If they wanted him to act like a tv cop, they should have just made a cop show. BTW, I have full respect of real life police, and I know they wouldn't endanger people like this creep did.I was asleep through much of the film, because really n nothing happened.",
    "102": "A Haunting in Venice is a classic 40s whodunnit pulled off with great cinematography, writing and of course a murder mystery. Performed in a way with suspense, horror, thriller, heart and more.Over the course of 1 hour 40 minutes what feels like 3 hours (in a good way) stretches out different events intertwining into the same storyline. Nothing goes the way you'd expect, and keeps you on the edge of your seat.Action in this film is mainly in the beginning and doesn't show up later, the first half is more frightening content, and the other half is the nitty gritty murder mystery.The cast is spectacular. Tina Fey KILLS it. Everyone in this film does a spectacular job, especially the little boy.Emotion is really confusing in this movie. It's present, but more of an overlooked emotion. You can see characters change throughout the movie. You definitely don't start to notice it until the third act.Overall, this is a great movie to watch for a good murder mystery feel!",
    "103": "I don't understand how they make such a boring movie with such brilliant actors and such a high budget.Kenneth needs to give up this Poirot project because it's getting worse each time he tries to do it. He's the worst Poirot by a long way.It's like a TV movie, if it hadn't been shot well and on high budget sets this movie wouldn't even be something they would show in the middle of the day on free Tv.One long snoozefest from beginning to end, the music is like something AI made, none of the characters are believable and the DoP was obsessed with wide angle lenses during the entire shoot apparently. Very strange.Can't stand any more of these ones from Kenneth.",
    "104": "Was looking forward to it as the last two Branagh, Poirot outings, were good.Unfortunately I was fidgeting in my seat halfway through, thought of leaving but decided to hang in there.I know it is a difficult story, but I really could not get into it. I sort of knew where this was going, but really didn't care.All the characters were slightly off, from the thoroughly annoying author played by Tina Fey to the off his head doctor, played by the unfortunate Jamie Dornan ( I hope he was paid well).The boy was the only character I was convinced by, and it was performed well.The whole movie just did not seem to gel, I simply do not know why.",
    "105": "It takes a bit of effort to appreciate Kenneth Branagh. His self-absorption and misplaced arrogance combined with his fundamental lack of filmmaking talent make him consistently unlikable. But you have to give him points when he ventures into low-ambition commercial efforts like this Poirot series. In a way Hercules Poirot is Branagh's closest alter ego, a lonely character convinced that he is widely loved and the best detective ever. And the inconsequential nature of the films seems like the right match to Branagh's filmmaking skills.So there is something that feels right about these films, voluntarily mediocre and forgettable, but ultimately entertaining for a bit under two hours. And you sort of want to like them. A Haunting in Venice, the third installment, tries to accomplish this while turning the dial just a little on darkness and tension. And unfortunately that's where it loses us, because it becomes all too apparent that Branagh is actually unable to create that tension. The film consistently feels like it tries to be dark and haunting without really knowing how to, and the ridicule nature (and acting) of its main character, which worked better in the previous installments because the whole thing was silly anyway, clashes here with the intended tone of the film. The rest of the cast is likely feeling how the ship is constantly sinking, a bit like Venice itself, and fails to ever embody actual characters. The greatest disappointment probably comes from Tina Fey, who leaves the audience with the likely unfair impression that she's unable to step out of comedy roles.",
    "106": "It's a tongue-in-cheek murder mystery set in Venice during Halloween 1947. It follows famed detective Hercule Poirot (Kenneth Branagh) when he is invited to a séance called by the mother of a young woman who ostensibly committed suicide.Hercule Poirot is now retired and living in Venice. To avoid being bothered by people wanting his services, he's hired a recently retired police commissario, Vitale Portfoglio (Riccardo Scamarcio). Ariadne Oliver (Tina Fey), a famous mystery writer who has based her character on Poirot, invites him to a séance at the home of opera star Rowena Drake (Kelly Reilly). Drake's daughter, Alicia (Rowan Robinson), died in mysterious circumstances, and Drake wants to make contact with her daughter through a medium, Joyce Reynolds (Michelle Yeoh). Other participants at the séance include Rowan's housekeeper, Olga Seminoff (Camille Cottin), Alicia's former doctor, Leslie Ferrier (Jamie Dornan), and Ferrier's precocious son, Leopold (Jude Hill). Alicia's former fiancée, Kyle Allen (Maxime Gerard), also shows up, as do two of Joyce Reynold's assistants.Soon after the séance, where Poirot makes quick analytical observations, there is suddenly a murder. Continuing foul weather makes it impossible for the Venetian police to come, so solving the murder is left to Poirot. Before the storm lifts, there are two more deaths, but they are solved, albeit with an additional twist at the end.\"A Haunting in Venice\" is a fun movie. It is all darkness and creepiness, and Alicia's pet bird keeps an eye on everything. Apples also have some importance. There is good banter between Branagh and Fey, and the plot is classic Agatha Christie, even though the film has little relationship to Christie's original story.",
    "107": "Kenneth Branagh's third foray into Agatha Christie territory doesn't have the handicap of previous all-star movie adaptations to be compared with. This has enabled him to make savings with a slightly B-list cast (no disrespect intended). And, by taking one of the less well-known Poirot cases as its core, Branagh is able to put more of his own stamp on the project. This is not such a \"sacred text\" as DEATH ON THE NILE and ORIENT EXPRESS.Sorry to say, these factors have not proved advantageous. A HAUNTING IN VENICE seems rather under-scripted and under-played. A séance in a decaying palace in Venice ends in a murder, with all those present anxious to prevent the medium (Michelle Yeoh, miscast but on fine form) revealing their secrets. There's not enough back-story to establish character and motives. Even Poirot (Branagh) is a bit flat this time. Jude Hill as a precocious schoolboy steals the acting honours with a performance possibly inspired by Paul Dano.The cinematography lavishly evokes a dark mysterious Venice redolent of DON'T LOOK NOW. Unfortunately, murkiness overwhelms too many of the interior scenes, heightening confusion rather than tension for at least one viewer. Maybe Mr Branagh should invest his considerable talent in revisiting a different 20th-century author: is Anthony Powell due for a revamp?",
    "108": "In the third theatrical telling of a story featuring the unconventional detective Hercule Poirot, we get a slightly spookier version of the \"whodunit\" fare.While it's less ostentatious than 2017's 'Murder on the Orient Express' and less scenic than 2022's (inferior) 'Death on the Nile,' 2023's 'A Haunting in Venice' is a more subdued murder mystery that relies on solid acting and a suspension of reality to bring things to life.Kenneth Branagh is once again in perfect form in his dual role as protagonist and director, and this time he's supported by the likes of Michelle Yeoh, Jamie Dornan, Kelly Reilly and (least likely to be expected in a film adaptation of an Agatha Christie story) Tina Fey. While this film series typically brings in some \"names\" to help these characters come to life, 'Venice' didn't hold much back - and they all deliver.As for the film itself, don't go into it expecting a straight up horror movie. While the centerpiece of the film is an investigation into a murder that follows a séance in an old Venetian orphanage (creepy enough?), the focus is primarily on the \"who\" involved - much as you'd expect based on how these plots typically unfold. There are some pretty clutch moments mixed in with a few standard jump scares, but the twist that comes at the film's climax is not necessarily predictable.It can be said that Poirot's box office star is fading compared to when the character first took to the silver screen, but 'Venice' could just be what the doctor ordered to get this franchise back on track.",
    "109": "I generally love a murder mystery, and while I didn't think the Death on the Nile or the Orient Express were phenomenal, they were enjoyable to watch nonetheless.This one, however, was way worse. The writing was pretty bad from the start, leaving both the conversations and acting boring to watch and difficult to engage with. Fey and Reilley's acting leaves a lot to be desired, they both appear wooden and unnatural. Perhaps Fey leans too much into her comedic and sketch act persona, which doesn't do well in this movie. Reilley's character and acting are so cliché that it is unpleasant to watch. Other characters aren't much better, perhaps it was just a bad combination of actor selection and writing, and it doesn't work well.Overall, the film starts slow and boring and it never picks up, leaving the audience to endure a tedious experience that never really sucks you in but is interrupted by watching the clock, waiting for it to end. What a shame.",
    "110": "It is 1947 and the famous detective Hercule Poirot has lost all hope and faith in God and in all of humanity and he has just quit, retired and is living in Venice, Italy.On Halloween, a friend, mystery writer, Ariadne Oliver invites Poirot to attend a party after which there will be a seance.... and help her to expose this so called psychic as a fraud and prove it is all just a con\"I've seen a million of these psychics and they are all fakes. I am the smartest person, and I can't figure it out, so I came to the second.\" - Ariadne OliverPoirot is reluctant but the temptation of a mystery is to much and he reluctantly agrees to go.The seance is at the Grand Palazzo (Venetian house) of famous opera singer Rowena Drake. Drake has hired the infamous medium, Joyce Reynolds, to communicate with her daughter Alicia who committed suicide.The seance begins but is interrupted. Strange things happen. Poirot is still not convinced. So is Reynolds for real or is she a fake, staging an elaborate act.\"I wish I was a fraud, would be less painful\"- Reynolds\nThen a guests is murdered, and the famous \"Detective Poirot\" takes on the case.\"Somebody is dead. No one shall leave this place until I know who did it\" - PoirotBut as he sets out to solve this case and uncover the truth, Poirot begins to doubt and question himself. What if this psychic world is real. What really just happened? Has the dead really returned to the living? And have the living been killed by the dead?\"Why don't you have the answer? You always have the answer.\" - Ariadne OliverI am a big Agatha Christie fan and I love Kenneth Branagh's previous two film adaptations and he is my favorite Hercule Poirot ever. In this third Poirot film, \"A Haunting In Venice\" Branagh does not disappoint.This one is based on Christie's 1969 novel \"Hallowe'en Party\" and It is a really cool, sinister and clever, supernatural mystery. It is shot almost like a portrait and from every angle which gives a eerie feeling that you are right there in the movie.This story goes beyond the typical whodunit. It is creepy and it is scary and dark, and totally atmospheric. Oh and Wow! What an amazing cast! This is a true classic Agatha Christie story come to life. Branagh's best Poirot film... so far.\"Call back the police and tell them Hercule Poirot is on the case.\" - Poirot.Cast - Kenneth Branagh, Tina Fey, Michelle Yeoh, Jamie Dornan, Kelly Reilly, Jude Hill, Kyle Allen, Camille Cottin, Ali Khan, Emma Laird, Riccardo Scamarcio.",
    "111": "Agatha Christie has gained unparalleled success due to the peculiar quality of her writing. She managed to inject touches of comedy, incorporate keen human insights, and craft superb and believable atmospherics. The David Suchet adaptations were stellar because they captured all three.Kenneth Branagh's adaptations consistently miss what made Christie great. I understand the desire to freshen the material, but it is wrong to change the material, and in doing so remove what makes the material great and so nuanced in the first place. It is telling that box office has declined in each subsequent Branagh adaptation after Murder on the Orient Express.This film was not the story Dame Christie wrote, period. The characters are not how she'd have written them.I completely respect Mr Branagh's dedication to literature and fine cinema. But I think he loses his way.",
    "112": "Abysmal writing; abysmal acting. Excellent location. I give the Poirot character a 5 out of 10; the supporting cast-a 1. Things are pretty obvious in the film and clues are presented obviously, even heavy-handedly. There are a few twists you will not see coming because that is the way it has to be else the supporting cast is of no use.Other reviewers said Branagh was at his best in this movie of all three. This does not say much. The pace is boring, there is no real suspense and Tina Fey kept letting air out of so-called suspenseful events. Her acting style if you want to call it a style was a mismatch for Branagh.Overall this was mildly distracting but for goodness sake can't Hollywood do better? I don't blame Branagh but back him up with a real cast and not these ingenues. Do yourselves a favor. Watch the David Suchet version of Hallowe'en Party. A Haunting in Venice is left to spoil.",
    "113": "Great actors and great acting.I loved the first two in the series, Orient Express and Murder on the nile, but this was a lacklustre adaptation...\nHard to put a finger on it, but just boring. Never really got me interested.And Kenneth Branagh, as I usually love, not at his best. Felt forced.The star of this was honestly the kid playing Leopold. Hope he keeps up acting, that kid will be going places.Beautiful scenes and location though. Well filmed, a bit obviously \"artsy\" at places but that works in this. Can't fault cinematographer or set designers. Just the script and Mr branagh that fell short.",
    "114": "This whole Poirot series has not made any impact and I dont understand why Branagh continues to inflict this on the audience.The cinematography is beautiful like the earlier movies. This movie definitely had a more interesting plot than rest but halfway through you can guess who is behind the murders.David Suchet is to Poirot what Jermy Brett was to Sherlock Holmes. You want to redo Poirot, you give a different spin and dimension to the character like the Benedict Cumberbatch Sherlock series. They made him younger, put him in a different timeline , with brilliant screenplay and kept the core integrity of the characters. It started going down when they got over smart and added a non-doyle sister character in the last Season.Kenneth Branagh is too grouchy and misses the playfulness and politeness of Suchet's Poirot. The egg measurement scenes are hilarious in the TV Poirot series, here you wont even chuckle.The worst thing I felt was the treatment of Ariadne Oliver character.My favourite episodes of Poirot series are ones which have Ariadne Oliver because Zoë Wanamaker makes her so adorable with her humour and enthusiasm. Any Poirot fan would know it was modelled on Agatha Christie herself.And this movie actually makes her deceitful for a plot twist, Christie must be furious. And Tina Fey completely fails to make the character endearing.How did they get Michelle Yeoh for such a tiny role is another wonder?Humbly request to stop this series or at least don't call the main character Poirot.",
    "115": "A must-miss if you love Poirot.What Branagh did to the characters of Hercules and Ariadne in this movie is unforgivable. Both roles are also horribly miscast. Branagh is no Poirot and Fey is certainly no Ariadne.Why the movie claims to be based on Hallowe'en Party is also a mystery to me. It bears no resemblance outside of some bobbing apples.Unfortunately, the new premise is utterly uninspired.If you love Christie's books and/or David Suchet's Poirot, you'll hate this as much as I did.This is without a doubt the worst Poirot adaptation I've ever seen.Two stars for the shots of Venice only.",
    "116": "I'm a huge fan of Kenneth Branagh and his embrace of one of my favorite characters starting with 'Murder on the Orient Express' (my favorite so far and regardless of this film want more) I have to say disappointed in this film. Loaded with incredible talent, admittedly loved Tina Fey but lacking the humor and chemistry of Tom Bateman as one of the very few in Poirot's circle of 'friends' (\"I have no friends!\") she still allowed us to see what an incredible actor she is. I noticed midway I was bored. A dark background required for this type of film but missing was the incredible delight of being shot in Kodak 65mm film. Yes Venice is exotic but we are cheated. Missing to were the incredible quotable quotes from Poirot and others. Missing were the talents of this cast. Cheated! Camera angles used supposedly to create tension but causing imax headaches or a bad trip. I stayed as one reviewer stated to see the 'who done it' but only to add all the answers (clues) to the murders after an hour plus in a typical Poirot slam dunk without the clues so intellectually left throughout the film for Poirot and the viewers.Still, I want more. From all of the prior actors that brought Poirot to life, Albert Finney, Peter Ustinov, David Suchet, I love Kenneth Branagh. I'm hopeful he will continue. I so looked forward to this film and hate to write a negative review but to quote the great Poirot, \"I yes, it is most sad. The truth is sad!\" But rest assured 'I have not lost my faith'...",
    "117": "Kenneth Branagh as Hercule Poirot is always worth seeing.Murder on the Orient Express and Death on the Nile were great movies and what Daniel Craig is doing with the Knives Out franchise. Means a new era of classic detective is here and I'm down.I have to admit However while I love watching Kenneth Branagh do this character these movies are also about the ensemble cast that make up these Who done it movies, and this ensemble did not do it for me.I love Michelle Yeoh and will run to see anything with her in it, and Tina Fey as a murder mystery novelist was almost like she was born to play a great writer (or just be one). She was critical in my enjoyment of this film.The rest of the cast did not nearly do if for me, however. Did not care about anyone that much to care who did it. I also felt that might have had a lot to do with the story as well. I don't know if the book is better but the story as it played out is lackluster.Still, I hope they make more casue I would love to see more of these movies.",
    "118": "Not many people know about this film. A lot of them are going to think that it's a horror movie. This film is based on the Agatha Christie novel \"Halloween Party\" starring the famous, beloved detective, Hercule Poirot.I liked the blend of mystery and horror here. The way horror is used to build up the mystery more and more, was a great way to play tricks on the audience's mind and confuse them. Kenneth Branagh did this brilliantly with his direction as well as his portrayal of Hercule Poirot. Michelle Yeoh was also great in her side role.I don't want to tell you what the exact main theme of the movie is, but I'll say that the best aspect of the movie, was Hercule Poirot being challenged. In the first act, he had very firm beliefs, but as the movie went on he started unwillingly questioning them and you could see the fear and confusion in his eyes. Given how much of a renowned detective he is, that was very interesting to see, and the audience could relate to him.The movie did leave a lot of answers to the audience. But the more I think about it, the more I realise that this probably bodes well with the main theme of the movie. Although the answer to the mystery was just a bit underwhelming. I personally like the \"Knives out\" whodunit franchise a lot more, because I think the cast in those movies is always very energetic and plays off well with the detective Benoit Blanc, who has now become one of my favourite characters in movies.But this was a pretty good film. And if you like mystery movies, Agatha Christie's books or the character of Hercule Poirot, you'll have a great time with this one.",
    "119": "There is more to Hercule Poirot than a moustache and Belgian accent. From this and his previous two adaptations, it's clear that Kenneth Branagh has an eccentric view of how much artistic license should be taken with this character and with Agatha Christie's plots.Common sense suggests that instead of making so many changes, he should just start over with original characters and narratives. This film and the earlier ones are also really slow, in contrast the Christie's highly readable and enjoyable prose. Branagh may be a great actor and technically proficient filmmaker, but A Haunting in Venice is just awful and a huge waste of a talented cast.You don't have to be a purist to find the lost, spooked Poirot in this film unfamiliar. His old friend Ariadne Oliver is also completely transformed. The changes made in her character are especially offensive and a real insult to Christie. Is no one watching over her literary estate? And why would Branagh even want make to make such changes in one of Christie's recurring characters?The casting doesn't help. Tina Fey is better than expected but totally wrong for a role based on Christie herself. Michelle Yeoh is also not bad, though in the book Joyce Reynolds was a thirteen-year old girl. Why not just give Yeoh a more appropriate name, given all the other changes? Her two assistants, played respectively by Ali Khan and Emma Laird, are supposed to be gypsies and half-siblings. Neither one looks the part, and they don't look remotely like one another, though we are told they do. The inept casting and anachronisms keep piling up, while the story stumbles and staggers to the end.The book Hallowe'en Party that supposedly inspired this film doesn't have the eerie, decadent Venetian atmosphere, but it's better in all other respects.",
    "120": "My daughter and I caught A Haunting in Venice (2023) at the theater tonight. The story revolves around a retired detective who is drawn back into action by his author friend. The author presents a chilling tale involving a former orphanage that is now a home, a woman who tragically ended her life within its walls, and a notorious medium planning to communicate with the deceased on the estate. The detective agrees to come out of retirement to expose the medium as a fraud.Directed by and starring Kenneth Branagh (Death on the Nile), the film also features a stellar cast including Michelle Yeoh (Crouching Tiger, Hidden Dragon), Tina Fey (Mean Girls), Jamie Dornan (The Fall), Kelly Reilly (Pride & Prejudice), and Camille Cottin (Stillwater).The film's settings are undeniably stunning, arguably the highlight of the trilogy. The backstory is captivating, and the setup is perfectly executed. The supernatural elements add a layer of fun, with well-placed jump scares to keep the audience on edge. The film masterfully keeps viewers guessing about which occurrences are the result of the living and which involve the departed. The well-written dialogue contributes to the film's light and well-paced atmosphere, building intrigue until the final reveal. The final climax does not disappoint.In conclusion, A Haunting in Venice offers an entertaining and distinctive \"whodunit\" experience that's certainly worth a watch. I would rate it 7/10 and strongly recommend it.",
    "121": "It's mildly amusing and watchable at least, the setting is atmospheric and cold with some inventive, if overdone 'Dutch camera angles, to highlight the skewed setting and hysterical characters.However, this a messy, underpowered thriller with no real spark between the flimsy cast. They all are 'C list' actors and all seem rather bemused to be here- like a fancy trip to Venice where they are promised scenery, good food and wine then forgot they have to work! It needed someone with star power and gravitas to power these dullish characters along, only Jamie Dornan seemed rather effective as the war veteran suffering from PTSD, his relationship with his son was rather moving.The story just never gripped me unlike the original Murder on the Orient Express and Death on the Nile which had clearer narration, great settings and a stellar cast. The CGI here looked rather embarrassing.I'll admit I didn't didn't anticipate who the murderer was but just felt disappointed at the end.A bit of a smugfest!",
    "122": "Kenneth Branagh's \"A Haunting in Venice\" features a haunting melody that evokes a bright, cheery vision of early 20th-century America. The melody is a welcome but incongruous choice of music, as it is absent from the movie set over a dark and stormy Halloween night in 1947 Italy. However, the allusion is later incorporated when a character reminisces about a time during the war when she sought refuge in the 1944 film \"Meet Me in St. Louis,\" a poignant testament to how movies can sustain us through our darkest hours. The film also features a Halloween sequence where unruly children attack their neighbors, build bonfires, and nearly derail a trolley car. This spirit of youthful anarchy makes it a clever reference point for \"A Haunting in Venice,\" loosely adapted from Agatha Christie's 1969 novel \"Hallowe'en Party,\" which is particularly concerned with the mischievous doings of children, alive and dead. The story takes place in a Venetian palazzo, rumored to be haunted by the ghosts of girls and boys who died during the plague. The palazzo owner, Rowena Drake, invites a famous medium, Mrs. Joyce Reynolds, to perform a séance to establish contact with the spirit of her daughter, Alicia, who died a year earlier in a canal accident. The tragedy is a part of the larger plot and serves as a backdrop for the All Hallows' Eve gathering. Hercule Poirot, a Belgian detective, is a party-pooper who is retired from official duty but still willing to take on cases that interest him. Poirot finds the idea of actual occult phenomena intolerable, and the filmmakers take pleasure in irritating him by using the cozy tropes of classical detective stories and steering them towards full-throttle supernatural horror with jolting sound effects and grisly imagery. The film explores themes of occult phenomena and the dangers of embracing a different perspective. \"A Haunting in Venice\" is Branagh's best of his three big-screen Christie adaptations, despite being the most unfaithful. The film improves on one of Poirot's least memorable cases, \"Hallowe'en Party,\" where a 13-year-old girl is found drowned in an apple-bobbing tub. Instead of focusing on the murder, the movie portrays Poirot as nearly assassinated by a killer whose ruthlessness is less surprising than their identity. The film is beautifully shot on location by cinematographer Haris Zambarloukos. Branagh and his collaborators, including production designer John Paul Kelly and costume designer Sammy Sheldon, create a captivating film set in Venice. Zambarloukos manages to capture the city's spookiness and madness through extremely canted angles, such as sideways-slanted shots of piazzas and upward-gazing shots of open doorways. These visual flourishes underscore the setting's spookiness and madness, creating a world filled with secret passageways and pitch-black shadows that make viewers feel too happily lost. \"A Haunting in Venice\" is Kenneth Branagh's best Hercule Poirot movie, renowned for its respectful adaptation of Agatha Christie's Hallowe'en Party. The film is both clever and visually dense, using the latest technology to create a visually rich and clever \"old\" movie. \"A Haunting in Venice\" was shot digitally in IMAX resolution, resulting in mesmerizing hyper-clarity and a shimmering, unreal, almost otherworldly aspect. The film's tight close-ups and actors' eyes seem to be lit from within, making it rare to see movies in this style anymore. The excessive amount of detail in the film can be intoxicating.",
    "123": "\"A Haunting in Venice\" is a splendid adaptation of the incredible novel \"Hallowe'en Party\" by the legendary writer Agatha Christie, the script being adapted by Michael Green resulting in a well-crafted suspense and mystery story full of good dialogue that give emphasis to the plot. Kenneth Branagh's direction hits the spot masterfully and his performance as Hercule Poirot is magnificent, definitely the best of the three films based on works by Agatha Christie that Branagh has directed and starred in. The cast is made up of famous quality actors, highlighting the performances of Tina Fey, Camille Cottin, Kelly Reilly, Michelle Yeoh and Jude Hill, the latter demonstrating that he has a promising career as an actor. The cinematography made by Haris Zambarloukos is a visual delight that achieves a gothic setting by taking advantage of the filming locations, in addition to the work he provides between shadows and chiaroscuros achieving a gloomy result and generating a perfect Neo-Noir aesthetic. The editing work deserves to be mentioned for how excellent it is, the production design is great, the costume design is of high quality and the soundtrack composed for the film is totally effective. A film that only deserves praise.",
    "124": "Actually to be jolly? Or rather spooky I reckon? No pun intended for sure. If you liked what Kenneth Branagh has done with Poirot, you will like this one too for sure. Maybe you will like this even if you were not too keen on the other two movies. Because this does not really have a baggage - well except for Poirot the character written by Agatha Christie of course.But apart from some TV versions (which I assume almost no one has seen, I know I haven't), there is nothing to compare it to. Or something else to find way better - rightly or wrongly so. Though I understand if someone has romantic feelings about movies they have seen in their youth.This has a bit of a supernatural flair to it ... could it be there is more to life? Can Poirot finally be convinced of things that he can't explain? The movie is a fun murder mystery ... I love those ... well done Kenneth .. well done. Also true of the camera and the script/characters (the latter I reckon at least loosely based on the book - which I haven't read)",
    "125": "In what is a pretty good cast, there was one real star and it wasn't a well known actor, it was a 13 year old playing an Uber intelligent and caring kid who was funny, witty and the highlight.The rest was far better than the death on a mile setting, this felt a bit more fresh and different whereas the old poirot stuff has become quite stale. The setting was beautiful and well thought out.It wasn't massively predictable which was a nice change, it was actually sensible and was a clever little twist.I do get tired of KB, but I think it's the ludicrous plot holes that Poirot creates, these powers and control he pushes over people is just unrealistic, he has an awful record of having one murder turn to many as he's locked people into a small environment.It's ok without thinking too deeply. Fun watch.",
    "126": "As much as Kenneth Branagh playing Hercule Poirot makes me itch and gives me welt-like mosquito allergic reactions and as much as a total \"trickery\" he is as a genuine Hercule Poirot as imagined and written by the great Agatha Christie and played to near perfection by Sir David Suchet back in 1989, I have to admit that 'A haunting in Venice' is a quality production loosely based on Agatha Christie's Hallowe'en Party.Its ratings may not be high and that's because of many factors besides the good acting, nice panorama photography, set design and to some extent the music. Its flow is lethargic, it lacks punch and real thrill whereas the VFX are especially well done.If Kenneth Branagh aims to continue his Poirot \"journey\" he needs to undergo a complete revamp and understand Poirot's true soul. Everything from his look, attire, behavior and way of speaking require a magic wand, though in this movie his speaking improved by two inches and his facial expressions looked slightly better; still he needs to learn not to run or move so fast from point A to point B or to another mansion room!Screenplay/storyline/plots: 6.5Development: 7.5Realism: 6Entertainment: 6.5Acting: 7Filming/photography/cinematography: 8.5VFX: 8.5Music/score/sound: 7.5Depth: 6Logic: 5Flow: 6.5Crime/drama/horror: 6Ending: 6.",
    "127": "I found Murder on the Orient express a bit over produced, Death on the Nile a dud but as a dedicated Agatha Christie fan I thought this was worth a punt.Safe to say that this is the best of the three. KB remains a slightly reserved and insular Poirot, emphasising his loneliness rather than the quirks and ego that are ever present in the books and probably fleshed out better (and more faithfully) by David Suchet.There are always going to be comparisons, but what is clear from this third outing is that these are cinematic Poirots of our time. The camera work is always a bit flashy, the colour grading is edgy, the pilot devoid of any laughs. Like the Braborne Agatha Christie adaptations of the 70's and 80's they prove there is always a place for a cunning plot and starry cast to gather together and cast, producer and audience have fun.Special note on this one. The sound design is excellent and worth a mention. It strikes me as off that editors, designer and costume get main title credit but even now Sound Designers don't. I'll be honest and say I missed Patrick Doyle on this one as composer, but as a whole this was a good film, much darker in tone and worth a watch.",
    "128": "This movie scores for the points mentioned in Matt Zoller Seitz's review (namely its references to Welles and post-war cinema), some gorgeous visions of Venice, and an appearance by Riccardo Scamarcio (the token Italian, but a darkly, deliciously smoldering one) - but otherwise, I enjoyed little of it.It stumbles off the mark with a series of disjointed cuts and musical cues that last all of 5 seconds before skipping along to the next tonal diversion, leaving me cold. It then introduces Tina Fey, whose SNL energy poisons every scene she's in. Clearly, the filmmakers expect us to dislike her - but she made me dislike the movie, too.My desire to connect to the setting and genre was further stymied by corny, overwrought dialogue (\"listening, listening\"); a weak attempt at making up for lack of creep with excessive jump scares; and emotional energy from characters that often doesn't quite match what the context would support.I WILL give it props for a finale exposition that makes the most of, shall we say, a sophisticated complication of mens rea.Verdict: perhaps this movie is just not for me (I disliked Death On the Nile for similar reasons - so at least Branagh is consistent), but it felt like playing a video game with other players who lag a bit too much: with incomplete connective tissue, the experience is jarring, disorienting, frustrating, and hard to track with. Further refinement - with perhaps a bit less Welles and a bit more Hitchcock - would have fully realized its potential.",
    "129": "So apparently there is this group, lead by James Pritchard that is supposed to make sure Agatha Christies oeuvre is not turned into silly, useless, toneless adaptations of nothing -- oh sorry, I'm reviewing the movie already.So Poirot is still the only one in the entire film you cant empathize with - because Branagh still character plays him as the choleric, emotionless can not act, but kicks every door open, one tone mask of a person, that almost rediscovers his childhood in an apple bobbing scene, but then almost gets killed for that - and then decides, to never show any emotion for the rest of the film.Ariadne Oliver is played as a Bridget Jones \"on a constant chocolate high\" character by Tina Fey who serves two purposes throughout the movie, first to give the film any humanity and second to give the film the canvas the demographic that buys Tina Fey books as \"self empowerment\" needs to have a canvas to identify with. No one taught her method acting in a mostly method cast - so thats what you get. Tina Fey. Oh and make her Poirots best friend of course, you know - to increase Brenahs likeability and her on screen time, as the canvas the female audience will identify with. But its Tina Fay. In Venice, in the 1940s. In a horror house. In a mystery tale - explaining to the audience plotpoints, that were introduced by a childrens puppet show.Javier Bardem is played by Riccardo Scamarcio, doing his best Javier Bardem impression in the role of Poirots bodyguard. The Javier Bardem character interestingly enough is also made into the most likeable character in the movie, because he is played by an actual actor being able to express emotions with a face.Camerashots have the quality of the camera being tied to a carousel with the focus puller in place, being told \"now\" to get perfect focus halfway through the shot, on some characters face.If its a shot from frog perspective, or over the shoulder, or overhead, depends on where the carousel horse ended up at that point. Plenty of circular motion and tight perspective in those camera pans though.So to fix this, you use mashine gun frequency cuts, of course. Oh look, here is an iron mesh in a tunnel, filmed from an inch away! Perfect sharpness, on that auto focus!Music is fine.Film stock looks like digital, no character, no lenswork, and only color grading in post processing -- no depth of field, perfect focus, perfect lighting on closeups, in the darkest cellar with.lanterns being the only light - lighting HD rats, scattering on what look like crates from prop department \"sturdy and plywood\".The sound department fixed that though, and is able to give the film some character with the strangest violoncello/contrabass sonatas you have heard in film for a while. But its a horror film apparently, so it serves a purpose and \"Those children really died in here\".Sorry, I'm quoting a throw away plotline uttered by Poirots bodyguard to finish painting the scene.So apparently, this is the new and more \"edgy, kicks the door open\" with a stone face Poirot, the Briget Jones demographic likes, because he hangs out with Tina Fey in a haunted house. Because thats what younger folks nowadays buy cinema tickets for.Or so the person who murdered the Agatha Christie estate seemingly thought.",
    "130": "Film Review: A Haunting in Venice screening in cinema halls near you!!This film is the latest installment of Agatha Christie's famous sleuth Poirot's exploits. An adaptation of her 1969 detective story \"The Halloween Party\" , the action shifts from England to Italy ( Venice) where Poirot, who has now retired & wants to lead a quiet life in the world's most glamorous city , is forced by an old writer friend Ariadne Oliver to attend a seance on Halloween Eve in a haunted house.As the night progresses, Poirot is slowly sucked into the world of paranormal & sinister happenings when one of the guests is murdered. Stuck in a haunted house on a stormy night with dark secrets and nowhere to go, our legendary sleuth is back in action to get to the bottom of things and uncover the truth!!Cinematography is awesome and drone shots of Venice are really mind-blowing!! The eerie ambience created inside the house coupled with a right mix of paranormal & suspense will keep u engrossed all throughout. A rare occasion where even the great Poirot begins doubting his sanity as strange things beyond explanation start happening around him !!A must watch for all Agatha Christie fans\ndon't miss it !!!Going with 3.5/5 for this one.. adios 🙂!!#sanjuzzreviews #AHauntingInVenice #agathachristie #poirot #herculepoirot.",
    "131": "Agatha Christies Hercule Poirot is an eternal Character. Her incredible (short-) stories gave many writers and directors the opportunity to keep telling murder stories and whodunnits which come with an human touch to them that is subtle but vivid.I watched many variations of Hercule Poirot movies and series. They all deserve respect and have their unique style and \"character\". But with Kenneth Branagh Hercule Poirot entered the theatres with a fresh, but very classy style, while still honouring the original stories, his three movies created a new era of Agatha Christie remakes. Thank you Kenneth Branagh! What a joy you bring to crime and mystery lovers!In A Haunting In Venice Kennet Branagh invites us to a slightly different experience with Hercule Poirot. This Film has a uniqueness in its pace compared to the first two. But imho this third masterpiece offers a lot of what Agatha Christie and her characters used to transport, especially: Mystique.The topic of supernatural happenings, spirits, demons and the question whether there is another dimension alongside us we cannot see vividly is handled super well. The horror touch is exactly at the right rate. Not too much, but when it hits, damn what a quality of slight shockers and frightening moments! A class act in every frame and scene!Besides directing to perfection here, Branagh delivers again a great performance of this sympathic character himself.If you like Agatha Christies stories, if you like Hercule Poirot and if you like a nice, elegant approach towards supernatural happenings, this movie is right for you.And if you ever forget how human Poirot is, due to his sharp mind and sometimes cool approach of devastating situations, just remember how moved he is when he remembers his \"Katherine\".",
    "132": "IN A NUTSHELL:\nI love Sir Kenneth Branagh both in front of a behind the camera. He directs the movie, as well as stars in it, featuring that multi-layered mustache. He also wears the hat of a producer, along with Ridley Scott, Judy Hofflund, and Simon Kinberg.Supposedly, the movie is based on the novel \"Hallowe'en Party\" by Dame Agatha Christie published in 1969.While the whodunnit book takes place in England, the movie's location is Venice, Italy. Surprisingly, this is the very first time a movie adaptation has been made about the book!THINGS I LIKED:\nThe cast is fantastic and includes Sir Kenneth Branagh, Tina Fey, Camille Cottin, Riccardo Scamarcio, Kelly Reilly, Jude Hill, Jamie Dornan, Rowan Robinson, Michelle Yeoh, Emma Laird, Kyle Allen, and Ali Khan. Everyone does an excellent job.Perfectly timed for the Halloween season in the USA, the movie offers an extremely creepy setting with plenty of jumps and scares. I got to see this in the theater on opening night. While walking down the hallways in the large theater, I saw a TON of movie posters for creepy movies coming out in time for Halloween. One thing I really liked about this film is that it doesn't have all of the violence, blood, and gore of some of the upcoming scary movies.In order to get genuine scares out of the actors, the director worked with the technical department to cause things to happen without their knowing beforehand. Actor Kelly Reilly admitted that all of the scary moments in the seance scene scared the \"bejesus\" out of her.We get to see some absolutely gorgeous images of Venice. I've been there twice and love its look and feel. It's such a unique location, allowing for the cinematographer, Haris Zambarloukos, to make perfect postcard shots. The bird's-eye view of the entire city at the end of the movie is stunning, and the palazzo's interior makes for the perfect haunted house.Despite its very dark setting and story, there is still a lot of clever humor to be had.Each scene was so carefully crafted that you could see that much attention to detail was given by the director. I always admire that in a director.A clever element of this dark addition to the Hercule Poirot franchise is that he is very much rattled by what he experiences. He second-guesses himself and is faced with questions about God, Satan, and the afterlife.The clues are there but it's easy to miss them when so many other things are happening around the characters. I didn't figure out who the murderer was at all. I love how Hercule Poirot is able to catch the little details in order to solve the crime.The movie poster is unsettling.THINGS I DIDN'T LIKE:\nIf you're a fan of Agatha Christie's book, you might be a little disappointed because the film only loosely follows that story. In good news, many viewers are saying the movie is actually better than the book!Many scenes are visually dark, so try to watch this on the biggest screen you can.I like Tina Fey in comedy but wasn't sure she was perfectly cast in this role.I wish I had been able to turn on subtitles in the theater. Some of the accents made it difficult to understand what everyone was saying.Act 3 wraps up very quickly and suddenly.TIPS FOR PARENTS:\nThis will be way too scary for many kids, especially young ones.We see some dead bodies.There is some blood.We hear and see ghosts.A seance is held and many scary things happen.To see my full review, check out my YouTube channel called Movie Review Mom!",
    "133": "A Haunting in Venice is based on the Agatha Christie novel, Hallowe'en Party. It continues with the adventures of detective Hercule Poirot(Kenneth Branagh). Poirot is now retired, enjoying his downtime in Venice, Italy. Poirot's friend, author Ariadne Oliver(Tina Fey), invites Poirot to attend a seance. However, things take a dark turn when someone is murdered. Now, it is up to the world-class detective Poirot, to crack the case.A Haunting in Venice is an incredible film. Director Kenneth Branagh has given us a movie that is thrilling, full of suspense & is filled with a growing sense of dread because of its gorgeous yet haunting Venice setting. This has been captured perfectly by cinematographer, Haris Zambarloukos. You will have no idea who the murderer is, until our favorite Poirot, joins the dots for us. The all-star cast is the highlight of the film. Kyle Allen is awesome as Maxime Gerard. Kenneth Branagh is spectacular as Hercule Poirot. Camille Cottin is fantastic as Olga Seminoff. Jamie Dornan is superb as Dr. Leslie Ferrier. Jude Hill is excellent as Leopold Ferrier. Ali Khan is great as Nicholas Holland. Emma Laird is amazing as Desdemona Holland. Kelly Reilly is outstanding as Rowena Drake. Riccardo Scamarcio is good as Vitale Portfoglio. Michelle Yeoh is unforgettable as Mrs. Reynolds. A Haunting in Venice is a must watch for fans of Kenneth Branagh's Poirot movies & whodunnit fans. Watch it on the big screen & be massively entertained!",
    "134": "A very bland movie. The buildup until the seance is appealingly uncanny: slanted shots, meticulous production design, and the gloomy coloring. But the rest of the film is just insipid, with little to no captivating, unexpected, or laughable moments. For 90 minutes you watch Poirot question six suspects in order, with one or two average jump scares sprinkled atop, and just like that he identifies the murderer, end of story. Also, with the movie primarily comprised of dialogues, all the characters are whispering for dramatic effects, so you kinda have to pay attention but there's really nothing going on, which makes it extremely tiring to keep up. Personally, I love Agatha Christie, but replicating her work verbatim in 2023 where we already had other whodunit films like Knives Out and Contratiempo is just an ignorant mistake.Tina Fey's performance is terrible. Despite how bad the movie is, all the actors did their best to deliver lines and make it somewhat convincing. However, throughout the second act, I am repeatedly pulled out from the scene whenever Fey's in the frame: her eyes drift to eight directions in one blink, her tone is very contemporary American unlike others, and she's always smiling although there's a murder going on. She does not behave like an actual person from 1947, more like put in a costume and a fake set.Kenneth, just let Agatha Christie be alright? We saw your effort and perseverance but it's not working out. Just do more Nolan movies or whatever.",
    "135": "This was surprisingly spookier than I thought it would be but it was happily welcomed during this Halloween Season. It was spooky without being cheesy or goofy which is what a lot of traditional horror movies tend to lean towards. I saw it in theaters but can definitely see myself cuddling up on the couch with a hot chocolate and a blanket to watch this film in the autumn.You can tell Tina Fey isn't used to playing more serious roles but she pulled it off enough. It was definitely a surprise to see her in this film, especially as such a large character.I would love to see more Poirot in the future as Kenneth Branagh does a great job portraying him.This film was a good length too. Not too long and not too short.I'd recommend this to those who enjoy a little spook and mystery but not for anyone looking for light hearted Halloween fun.",
    "136": "Just came back from the theaters where i watched the mastmind Hercule Poirot in his 3th movie. In the last two movies i tried to discover the murderer before the dedective himself solved the case and both times failed. (I have to say; last movie had quite a diffecult plot).But today... i had a new chance to beat Hercule Poirot. You would say after watching more than 1000 movies you get the hang of it how the audience can be deceived. Sadly... i lost again. So +1 to the director! Props to everyone who did solved the murderer earlier on in the movie.I liked the theme of this 3th movie. A little bit of horror and more mystery. I honestly thought this would be a different kind of movie than the last two! Actors were great, setting is fantastic (venice.. you cant go wrong?), music is top spot and pace is good.I loved the ending.. Hercule Poirot brings back light to the dark and mystery story.. and still.. some mystery remains unsolved. But.. somehow.. i like that a little bit is unsolved; a tribute to the real Venice ghosts? Who would know..So.. get yourself tickets! A solid 8 of 10.",
    "137": "The haunting them adds a lot to what is otherwise a very tropey movie type, and an innovation that was much more fun than the weird segue opening of the Death of the Nile which tried very hard to make me interested in characters but could not care less about another rich person love story.This one kicks off with a retired Poirot in Venice, a great excuse to have some very fun shots which all had kind of a Wes Anderson feel for the precociousness, then Tina Fey delivers a séance mystery into his lap, followed by a creepy shadow puppet horror story told to a room full of children and I actually felt dread for the characters. This tension carried forward until well past the middle of the movie when it turned more towards a traditional murder mystery, but all of the characters and clues came together nicely and some fun stuff with Poirot seemingly not trusting his own perceptions closed this all out very strongly.Highly recommend!",
    "138": "'A Haunting in Venice' is the third (and maybe final?) film in the Agatha Christie series directed by Kenneth Branagh, and starring him as genius detective Hercule Poirot, after 'Murder on the Orient Express' and 'Death on the Nile'. This time, 1947 Venice is the setting, with the Italian canals and rooftops adding to the overall vibe. Poirot is coxed out of retirement by Ariadne (Fey) to come to a Halloween party and séance to disprove a medium, Reynolds (Yeoh).Obviously, someone is murdered and Poirot is back on the case. The plot is thickened, as Rowena (Reilly)'s daughter mysteriously died in the past year, and we're not sure how it's connected. There's a fine-line tread between ghosts/spirits here and Poirot's scepticism/logic. All is eventually revealed. Once the murder occurs, there are 10 suspects left in the palazzo - including a Doctor (Dornan), bodyguard (Portfoglio), ex-boyfriend Maxim (Allen) and housekeeper (Cottin) - and Poirot goes about collecting their stories and alibis.This film is shorter than previous two films, but does seem a bit scattershot for the first 30min, with lots of odd cuts and camera angles, mostly trying to put us of the scent of what's actually happening. But I did feel that Poirot felt a little tired and lacked some verve. Might just be that Branagh is now in his 60s! Since it's set in the early hours of Halloween in an old building in the 40s, there's a lot of darkness/candle-lighting, so it's sometimes hard to see what's going on. The culprit is a bit of a surprise, and the reasoning just makes sense.",
    "139": "This film commits one of my most cardinal film sins. It has a child character that acts as if they are adults. They are respected and meant to be taken seriously. Ouch. Why must films do this?No but I really enjoyed this film. I found it pretty engaging. It was a good escape. Absolutely beautiful film, some really stellar cinematography and lighting. Entertaining.There were some glaring issues. For one the beginning and end just reeked. Imagine a sandwich made with moldy bread. The beginning was slow to start and the end was rushed and a mess. To be quite Frank this film didn't know what to do with itself. The mystery and its solution was incredibly convoluted and weird. It didn't make sense and didn't feel satisfying. The characters were inconsistent and strange. Nothing felt resolved, nothing even felt proposed to resolve. There was just nothing to nibble on here. Other than great visuals and a semi intriguing plot. Intriguing enough to keep a lone boy engaged in the movie theater. Taking his mind off midterm season :) thanks movie. But not good enough for this reviewer to give props too!",
    "140": "I know I probably should start by writing a review for the first one: ''Murder on the Orient Express\", but as I watched Haunting in Venice yesterday, I think this is the one that is still most \"fresh\" in my brain.I first found out about this movie when I saw a trailer of upcoming movies in the movie theatre and my first thought was: \"that looks like a good thriller/horror set in post-war Venice. Turns out it was Agatha Christie's Poirot! I decided to start by watching Murder on the Orient Express and then Death on the Nile as I wanted to watch Haunting in Venice and just so I would have seen them all.Haunting in Venice is a lot of things, but most of all it's not what you expect in a third Poirot movie. While the overall theme stays the same: 'Inspector Poirot witnesses a murder and must uncover who did it'', this time it is set in a more supernatural atmosphere, which at times I found weird, having seen the two previous ones.The most complex character for me must have been the one of the doctor portrayed by fellow Northern Irish actor Jamie Dornan. His story was one that as mysterious and at times confusing. Who was he, what happened to him and what role does his son play in this?At times I also found it hard to understand as we were sitting in a very old movie theatre and I am one to enjoy my movies with subtitles when I have the chance to. We went to a beautiful 1920's style (refurbished but originally opened in 1923) cinema with beds, sofas and armchairs so it was definitely the right movie to watch in that setting I'd say.Even though the movie is a bit more supernatural than we are used to, I still found it very enjoyable but Death on the Nile is still my undefeated champion when it comes to my favorite Poirot adaption.Well done to Kenneth Branagh who directed, produced and starred in this movie. I hope we have a few more Poirot cases in the future!",
    "141": "While you know the likely plot and the role of the KB's Inspector - It is a very satisfying journey.It is a film worth a view on the big screen. I caught my showing in Larkspur in Marin in a remodeled theater with reclining seats. Those and a little Pinot Grigio makes viewing some much better.All the gal stars - TFey, KReilly, Ms. Cottin, Ms. Yeoh are a joy to watch. The character actors could have played cut-out roles - but they don't. KB, who produces the film, selected a cast that bring some emotional honesty to the film.The location is a fantastic add to the excitement. The film makes great use of the interior character of the residence. One can't help but wonder again at the marvel Italians created on piers in salt water. Wealth, style, capability, grandeur and mystery - all contained in the haunted residence.",
    "142": "Having seen the last 2 Kenneth Branagh Poirot movies, I was quite excited for A Haunting in Venice. Personally, I enjoyed it a lot.If you do enjoy whodunnit movies in general, you will probably like this one as well. It does contain a lot of horror elements that add to the suspense and mystery and keep you on the edge of your seat.The cinematography was very enjoyable and a great fit for this kind of movie. I was quite happy with the cast as well, especially Michelle Yeoh was wonderful.My only criticism is that I would have wished for the movie to be a bit longer and to have one more twist in store. There were several opportunities to use characters for additional plot lines or to make use of the old and haunted palace much more. While the first half of the movie was very suspenseful and creepy, the second half, containing the actual solving of the murder, ended in a somewhat anti climatic way and needed more twists and turns for the ending to be as big of a revelation as these whodunnits usually have or need.",
    "143": "To me the very first scene that Brannagh is in demonstrates perfectly the vast difference between him and Suchet playing Poirot. When Brannagh is in the camera pans to his covered his feet, then to a brush that lightly cleans the leaves. At first, I thought it was Poirot's gardener until I saw the weird mustache. If Suchet was in that scene you would know he was Poirot from the second you see the shoes. They would be pointed at extreme military precision, the legs and body quivering in hopes of finding a single speck of dust on any single leaf.....and that is the difference between the two performances. Suchet is Poirot, and Branagh merely with a strange piece of hair attached to his face. I've seen all of Suchet's episodes as Porot several times. I have no desire to see this or the others againI think the movie would have been more enjoyable (and the previous two as well) if it was just a Christie story using a generic British detective solving crimes in Europe post-WW2.",
    "144": "Seemingly hellbent on a personal mission to grow the worlds most luscious moustache at any given opportunity and here gift us more Dutch tilts than we can poke a walking cane at, British director/actor Kenneth Branagh has once more delved back into the Agatha Christie/Hercule Poirot universe for his third Poirot feature since 2017.Starting out with a bang at the box office with the star-studded Murder on the Orient Express and running out of stem with the stilted CGI infused and Covid-19 impacted Death on the Nile in 2022, Branagh here brings Christie's Halloween Party to the big screen in the form of A Haunting in Venice, a Poirot film with a difference that benefits greatly from a great setting and a campy narrative that makes this arguably the best Branagh Poirot film yet, not that that's an exactly glowing endorsement.Taking place over one fateful night in a late 40's Venice property that finds a group of party guests involved in a seance that turns deadly, leading to Poirot hot on the case of a fresh murder and using his troubled mind to break the case open, Branagh and his talented cast have a lot of fun hamming it up in a wonderfully designed production that feels a lot more lived in than the past Branagh outings and one that excels when its creator starts to have fun with a range of quirky camera moves and production tricks that do a fair bit of work to cover up the fact this film and its narrative aren't actually that exciting.What worked so well on page for many of Christie's most famed works and those featuring the infamous facial hair sporting literary icon hasn't exactly made for riveting feature film viewing and that is once more a problem with Haunting that after the initial rush and set-up early on falls into a more processional flow that closes in around Poirot and his long term author friend Ariadne Oliver (a nicely dialled back Tina Fey) as the two question guests of the seance gone wrong and we the viewers start to try and deliberate in our minds who is the most likely perpetrator of the death of Michelle Yeoh's medium Mrs. Reynolds.Along for the ride this time around is also Jamie Dornan as troubled doctor Leslie Ferrier and Kelly Reilly as grieving mother Rowena Drake, once more making Haunting another Poirot outing that has a stacked cast at its disposal but despite everyone acquitting themselves well enough there's no stand outs here in the ensemble, no one is really able to make their mark in a unique way, even if Branagh this time around does allow for Poirot to feel like more of a vulnerable and on edge human unlike his almost super-powered version in the first two films.Overall Haunting is a passable enough murder mystery with a location that feels like a character all unto itself but much like its previous ventures Branagh's film still doesn't feel like overly necessary cinema as it comes and goes without much reason to ever suggest it will be a feature spoken about in the years to come.Final Say -Thankfully a step up from the rather misguided Death on the Nile, A Haunting on Venice provides some fun and minor excitement at times but overall still feels like a rather pointless exercise that Branagh must feel is something much more.3 omnipresent Cockatoos out of 5Jordan and Eddie (The Movie Guys)",
    "145": "The 'Stache is back for an Italian murder mystery.\"A Haunting in Venice\" is the third instalment in actor/director Kenneth Branagh's love letters to acclaimed Murder/Mystery author Agatha Christie.Of course someone is dead and no one shall leave this creepy mansion till Inspector Clouseau knows who dunnit.Doh!I mean Hercules Poirot of course, it's just that Kenneth's outrageous Belgian accent put me off the scent.Everyone is a suspect including Old Friends, not that Poirot has any friends as he so often reminds us.The famous detective uses logical explanations for supernatural circumstances, but will he be convinced of the spirit world by the end of this PG 13 Horror fest?This is the first Poirot instalment in the FILM series starring, directed by and produced by Sir Kenough to be an original adaptation of a literary work written by Dame Agatha Christie and not a remake of a previous picture featuring Poirot.However, for the nitpickers it was previously adapted for television as part of series 12 of Poirot, starring David Suchet.\"A Haunting in Venice\" was actually filmed on location in Venice...none of this trickery, hokery, pokery to make it look like the sinking, waterlogged city this is the real deal.Branagh wanted to use as many physical sets as possible for filming.Kenneth Branagh also worked very closely with the technical department to cause surprises for the cast.The actors had NO warning about lights going out suddenly, or gusts of wind, slamming doors & windows etc on the sets in which they worked.\"A Haunting in Venice\" has more jump scares than a James Wan Blumhouse Production.Cheeky monkey Kenneth caused genuine confused and startled reactions from the actors who appear in this film...which is a good thing because some of them dialled in their performances.I'm looking at you Tina Fey as author Ariadne Oliver who riffs on Poirots cases for her own novels successes and is desperate for another page turner.When this Apple lover tracks him down the world famous Dick is retired and living in his own exile in post World War 2 Venice.She drags him screaming and kicking back to a fresh case to once again uncover the killer of a murder most foul.The clues are pretty obvious for anyone playing this game at home, but it's always fun to be the first in the cinema to deduct who is the murderer and shout out \"Bingo\"!Jamie Dornan as \"Dr Leslie Ferrier\" is 50 shades of bland as the former war weary Doctor dealing with PTSD.His son \"Leopold\", a 42 year old midget, (Jude Hill) is the one to watch.Jude played the lead in Branaghs semi-autobiopic, \"Belfast\".I can thoroughly recommend that entertaining Irish movie which is streaming on Foxtel.Kelly Reilly is the Doctors sultry love interest \"Rowena Drake\" and mother of the murdered child \"Alicia Drake\" (Rowan Robinson), who's spirit they try to raise at a seance conducted by \"Crouching Tiger, Hidden Dragon\" star Michelle Yeoh (\"Joyce\").She is literally everything, everywhere, all at once for only a few minutes of screen time.It's a movie front loaded with Oscar winners.\"A Haunting in Venice\" is based on the book \"Hallowe'en Party\" by Agatha Christie that was originally set in the UK, but Kenneth, cast and crew clearly needed an Italian working holiday.Who doesn't?Listen out for some classic songs after D-Day which are still relevant today after the Pandemic \"When The Lights Go On Again\" by Vera Lynn & \"In The Mood\" by Glenn Miller and his Orchestra.If you loved \"Murder On The Orient Express\" and \"Death On The Nile\" then you are in for a treat.If not the Teenage Mutant Ninja Turtles are just behind the next door at your local cinema right now.Death is just the beginning in this latest Hercule Poirot Murder, Mystery, Crime, Drama, Thriller with a dash of childish Horror.Seeing as how Agatha wrote over 30 novels about \"Hercule\" this will definitely not be your last sighting of the double moustache that defies gravity.",
    "146": "Different from the other two and surprisingly felt better than the original story on which it is loosely based on.This felt most Poirot-istique amongst the three and also more realistic. Weaved intricately amidst the backdrop of the aftermath of World War 2 with abundance of humane emotions, vulnerabilities and relationship, this also has a supernatural element to it which seemed a bit silly and off-track initially but once the truths started unfolding it made more sense.Agatha Christie's Hercule Poirot novels have always been more about the emotions and less about the actions, and this one does so well in that aspect.Pride, Jealousy, Redemption, unrequited love, Guilt and most vividly PTSD has been so well depicted.It would have been an almost perfect 4, but somehow I couldn't relate to Leopold arc, so this costs half a star.Murder on the Orient express is one of my favourite of Agatha Christie's work and I will always be a bit biased with it's adaptation. So this will be ranked 2nd amongst Kenneth Branagh's Hercule Poirot adaptations.",
    "147": "I know the title makes no sense, but bear with me.I can't really think of much to say about this movie, I thought it was pretty good and that's pretty much the extent of my thoughts.I will say that the best parts of this movie is the acting, colors, and the cinematography. I liked the camera work, even though the 0.5x. Cameras was a little weird I got used to it after a while and thought it was kinda neat.The first seance scene is by far the best in the movie, it's done extremely well and had me on the edge of my seat. The full mystery is pretty good as well, it had me guessing the whole way through.I really like how this movies makes Venice look, Venice looks really pretty in this film and I really liked the colors of the buildings, water, etc.Other than that yeah it's a worthwhile mystery movie, if you like the first to poirot movies then you will like this one too.",
    "148": "\"A Haunting in Venice\" is the third of the Kenneth Branagh directed Hercule Poirot films, starting with \"Murder on the Orient Express\" and then \"Death on the Nile.\" I haven't seen \"Orient Express\" since it originally came out in 2017 (I know, I know, I need to rewatch it at this point) but I remember not being too big a fan of it. That said, I recently watched \"Death on the Nile\" only a few weeks ago, and I absolutely fell in love with it. So, I found myself pretty excited to go see \"A Haunting in Venice,\" for a variety of reasons, with the first and foremost reason being the sheer beauty and meticulousness of Branagh's direction.Listen, if there's one thing Kenneth Branagh doesn't do it's direct boring looking movies, which is appropriate because \"A Haunting in Venice\" is dripping with style; a graceful, classical, beautiful film, \"A Haunting in Venice\" is visually stunning and constantly engaging to look at. I mean, from start to finish my eyes were glued to the screen in awe. But as anyone knows, good looks can only take a thing so far - what's most important, in people and in movies, is the substance. And there is certainly substance here.A murder mystery through and through, \"A Haunting in Venice\" kept me and my mum guessing. With many twists and turns, and multiple interesting reveals, the film lets viewers revel in its mystery with a methodical, purposeful pace. After attending a seance, Poirot experiences things he can't quite explain, and it's interesting to watch him interrogate suspects, experience so-called supernatural events, and slowly get to the bottom of what is going on - all wrapped around the claustrophobic, creepy setting of a mansion in Venice.Branagh is excellent as the titular detective, and gives a performance that you can't help but get giddy watching. With his wry, clever one-liners and masterful explanations of just what exactly is happening, and why it is happening, he's an utter joy to watch on screen; Tina Fey, Kelly Reilly, and Jamie Dornan were also standouts, each giving magnetic, layered performances.Honestly, before writing this review my rating was at an 8 out of 10, but as I was writing this review my rating jumped up to a 9 due to the sheer entertainment value that \"A Haunting in Venice\" provides. I just really enjoyed this movie - from the visuals to the performances to the mystery, everything was working for me; coupled with Branagh's classic yet kinetic direction, I honestly couldn't look away from the screen. This isn't the horror film some may expect, but it's a creepy whodunnit that is a great way to ring in the fall - especially if you're a fan of the previous two films.",
    "149": "This movie is intentionally a slow burn, odd to say considering it comes in at under 2 hours, but it is.The camera lingers on environmental shots, odd angles/focal lengths, and takes it's time to showcase pieces of the house much of the movie takes place in. It works well to set the mood for the entire movie.The cast is good, as usual Kenneth Branagh is just too over the top, but the surprise standout is the doctors son - he did very well for a child actor.This was also a very good movie to see in the theater specifically, the audio mixing made great use of 7.1 channel sound.I wouldn't call this a horror movie per se, but it is trying to be a creepy and unsettling mystery movie, and succeeds well.I'd recommend this to everyone who doesn't specifically hate mystery films."
}