{
    "0": "Spoilers below do not read!************... Why on earth did no one suggest that a medical person with surgical know how and expertise was the killer, given the expert surgical removal of the girls' vocal chords and suturing of the wound.Not the crooked sheriff with the fancy college learning.And not the medical examiner.Not any of the other cops.What was the motivation to kill the girls? Because his daughter was killed by a hit and run driver? Was the thought that his daughter was worthy, but other girls were a waste of human flesh? We can only speculate.WTH?",
    "1": "I am generous with a 9 cos i enjoyed this movie. Simple, aint no wannabe critic. It is rare to find good thrillers n horror films nowadays.\nThis movie has ample amount of tension n suspense. It started without wasting any time n at the same time it delivered developed characters n background stories.\nThe twist came as a surprise.\nThe plot may remind viewers of Nic Cage's Frozen, Renner's Wind River n Most Dangerous Game.\nThe story is about an alcoholic ex hunter who has become an animal savior n lives secluded in a sanctuary named aft his daughter who has been missing since five years. The arrival of a new sheriff brings some hope in the method of investigation but things get ugly aft a discovery of a female teen's dead body pointing to a killer who is hunting teens for sport.",
    "2": "Decent directing, excellent cinematography, but the writing needed more \"oomph\" and a more cohesive plot with less plot holes and technical issues. A good watch, but nothing spectacular. Would've been better as a short film, as the 93 min runtime with the slow pacing made this film feel much longer.",
    "3": "You can definitely tell the writer and the director were heavily influenced from the True detective series for this particular film which is a good thing imo. The visual style, thematics, and plotting aspects are executed in similar fashion as the show. The overall story is relatively run of the mill as far as the murder mystery, and seeking revenge in tracking down the killer. Still it stays interesting enough and never gets too stale with enough intensity and suspense to keep attention. The actors are all decent and keep a level of intrigue throughout. Also some very well done cinematography and fantastic scenery/settings. There are some moments that seem a tad cliché like a big reveal towards the end, but overall it does what it needs to as a basic thriller.",
    "4": "First of all comparing this to Wind River is not a useful critique. Wind River addresses the high rate at which Indigenous Women in North America/Canada go missing around exploratory mining sites.This movie was a look at individuals who are flawed and who eek out their own idea of justice, to exact revenge or protect others. It's not a box office hit but it is underrated.After 20 mins I forgot all about Jamie Lannister and Grace Shelby.I recommend watching, if you enjoy story telling and can put away preconceptions.",
    "5": "Solid 6 star film. Not great not terrible. Dragged a little here and there but was still watchable.",
    "6": "Some words I would use to describe this mess of a movie would include \"ridiculous\" \"unbelievable\" \"lazy\". Some of the NUMEROUS plot holes...1. Do cellphones not exist? The main character carries one of the the injured girls all day and night, and seriously doesn't have a cell phone call the police? And when they finally get to his house he again doesn't think to call the police?? Unbelievable!2. The main character is injured by the killers arrows and DOESN'T seek medical attention OR inform the police that the literally killer they have been looking for is on his property and has wounded him?? Instead ops to take some shots and stitch himself up? What?? Are you actually serious?3. The sheriff literally shots the main character and is allowed to return to work? ANYTIME a law enforcement officer is involved in a shooting they are IMMEDIATELY placed on leave until the incident is investigated. The fact the writers didn't know that is just plain embarrassing and lazy. And after the main character is AGAIN wounded, he AGAIN doesn't seek medical attention?? They have some doctor who we never met, and have absolutely zero connection to, and who somehow, turns out to be the killer?? Come and bandage him up? Frankly the whole situation with the sheriff shooting the main character and they him \"forgiving\" and being \"even now\" to her to turning a blind eye to him killing the killer was ridiculously and wildly unbelievably I laughed for five straight minutes.Did the writers of this movie have no shame? They ruined their credibility as writers in one fell swoop this ludicrous and embarrassing excuse for a movie. Just wow...",
    "7": "This is definitely worth a watch. I'm a very picky viewer and if a film doesn't grab me in the first 10 minutes then I'll quickly turn it off. I'm happy to report this kept be interested for the full (nearly) 90 minute run time, which is the perfect length for a picture like this IMHO.Jaime Lannister once again did not disappoint. I thoroughly enjoyed Shot Caller so I figured I'd give this a try as well and I'm glad I did. A couple decent plot twists along with good performances from all actors and a decent script held this picture together quite well.Its far from Oscar worthy, but its also slightly above straight DVD, $1 store trash bin. Just a decent little thriller that should hold your attention for 90+ minutes. I recommend it.",
    "8": "4* out of 10*First off: I mildly enjoyed watching this film and I was not bored. I am a sucker for cat-and-mouse-movies set in the wilderness. This one has an intriguing setting, some good scenery, mostly competent direction and acting and some good suspense. However, after it completely falls apart in the second half, I started to question the film - which became a very very frustrating exercise. Here is why:The film is almost a complete carbon copy of Wind River:\nRemote setting in the wilderness in a Native American reserve: Check.Lonesome hunter, who retreated from the world after losing his child: Check.Estranged ex-wife with a new man: Check.Female sheriff, who needs to prove herself: Check.Dead girl in the wild: Check.Vigilante justice: Check.Only the wintery setting and the emotional depth of that fantastic film were missing. It's a miracle, the film-makers haven't been sued yet. Well, I can forgive derivative film-making as long as it is good.Unfortunately, this film lacks any logic or coherent story-telling, which completely ruined the viewing experience. Here are most of its flaws:Why did NCW stop hunting after his daughter disappeared but he never stopped drinking, which was the reason he lost her in the first place? Don't know.Why was he already heavily drinking before his daughter disappeared? Don't know, never gets explored.Where was the killer during the last 5 years since NCW's daughter disappeared? The town doesn't' seem to have a serial killer problem. Don't know.Why can he drive, shoot, fight and basically do everything perfectly fine, when he is supposed to be wasted all the time? Don't know.How do you survive an arrow to the heart, stitch yourself up and are able to get right back on the hunt and then carry a woman through the woods for several hours straight? Don't know.Why did he have to carry her at all? She seemed to be able to walk before. Don't know.Why does he NEVER try to get help or inform the police when he sees girls being hunted in the forest and especially not after he directly encounters the killer? Don't know.Why is he sometimes a skilled stalker and hunter and sometimes behaves like a complete moron who has never set foot in the woods or held a gun? Using a shotgun in the woods or entering the killer's house without any caution and making noise. Don't' know.Annabelle Wallis with her plastic-surgery-botox-L. A.-face is completely miscast as a backwater-town-sheriff.NCW not only gets shot by an arrow to the heart. He also gets severely beaten AND shot in the guts but just keeps on going. This guy is invincible.Sheriff steps in a freaking bear-trap. Instead of having her leg amputated and/or spending several weeks in a hospital she is back on her feet walking half an hour later!!!Why do people pursuing someone always shout their names giving them the opportunity to run away (local native cop with the brother)? Don't know.What happened to the brother in the barn as a kid? Could have made for an interesting motivation for his and the sheriff's actions... Don't know, never gets explored.Wallis shoots NCW to protect who she thinks is her brother (WHY would she do that??!?). Why does she not get suspended, let alone investigated after NCW tells the police what she did?!?!!? She gets to keep her gun and to lead the investigation. Alone this flaw was enough to sink the whole film. Let alone, them reconciling and teaming up to get the killer afterwards. Well, I guess it was necessary that she owed him one, so she had to let him go after he got his unlawful vigilante revenge.Now for the finale and the reveal of the killer:The doctor of all people. It is just a cheap plot device and lazy writing, if you reveal someone as the killer who was never on the suspect list and to whom we have NO emotional connection. Completely no pay-off for the viewer.All the victims' vocal chords had been perfectly surgically removed. Why did they never investigate surgeons or medical professionals? Don't know.Why were the scars apparently old and all perfectly healed, when he killed the girls? Don't know.Why did he even silence the girls? Don't know, absolutely no connection to the killer's daughter's death.So his teenage daughter was killed by a drunk driver. Did this make him hunt drunkards? No. Why hunt teenage girls? Don't know. Would have made much more sense if he hunted NCW - who happens to be a drunk.Why did the killer save NCW's life when he knew he was on his trail? Don't know.How did the doctor become such a skilled hunter? Don't know.Why on earth did he use an atlatl? Don't know. Guess, it's a cool weapon.What was that ridiculous grass suit? Don't know. Must be almost impossible to move or see in that thing. Looks scary, I guess.Why did the neighbour lend his car to the doctor when it is shown that he obviously has his own truck? Don't know. Yeah, I do know. It's called a red herring.",
    "9": "Slow and lugubrious like a funeral procession with a by the numbers script we have all seen before - Nothing new to see here, quite a tedious & depressing sub par thriller if you can even call it that.",
    "10": "Absolutely ridiculous.Bad. Bad. Bad.-spoilers alert-\nSo a sherif shoots a civilian to cover up the assassin after reducing him, because she \"thinks\" the assassin is her brother. And even she tells him \"go\" and then chase the civilian (probably to kill him and leave no witnesses), and no one NO ONE detains the Sheriff... and she even continues running with a badge and a gun, after the civilian escaped and produced a witness statement while showing up wounded, explaining what has happened to the other officer, who already had doubts about the brother of the sheriff? And life continues back to normal...?Only in stupid \"Fantasy land\" and in this movie...",
    "11": "Solid performance from NCW, Annebele was sub-par performance, the script is horrible.\nAll the build ups were not nothing, the motive of of the killler is laughable. The title silencing, what's the point? Well, they should silence whoever wrote this.\nOne major downturn of the movie was when the Sheriff thought the suspect was her brother by guessing the guesture he made, without making sure, she shot the guy who caught him. That's one dirty cop! Better yet, she later found out opps it's not her brother and she vowed to catch the killer in front of the seriously injured girl. After all these, the writer would think the audiences are still into the movie?\nDo yourselves a favour, save the 90 mins of your life.",
    "12": "There were so many plot conveniences, unmotivated actions, plain stupid decisions, and even a few blatantly impossible inconsistencies, and unfortunately Nikolaj Coster-Waldau's (admittedly decent) performance can't save it. I was also very disappointed in Annabelle Wallis's performance, as I really liked her in Peaky Blinders. She somehow manages to sound bored while holding a killer at gunpoint.\nThe film's only other saving grace is the gorgeous scenery.",
    "13": "Nice movie. Well performed, filmed and directed. Writing needs more depth on some characters and less in others. Too much expectation created around the main guy beeing a great hunter for nothing, and the woman being sheriff just to shoot a civilian without any consecuence at all. Uhmmmm...besides that is entertainig. The constant drinking didnt added that much either because it was missused.",
    "14": "It was not enough that the small northern town of Echo Falls is one of dilapidated buildings and people eking out a hardscrabble existence. Additionally, there has been a predator taking the lives of young women in the community. One mountain man stands tall in tracking down the perpetrator.Nikolaj Coster-Waldau turns in an excellent performance as the grizzled, guilt-ridden boozer Rayburn who has never come to terms with the circumstances of how his daughter was kidnapped. A wildlife sanctuary has been named in her honor, yet Rayburn is still not willing to have a funeral for her even five years after her disappearance.Another intriguing character is Sheriff Alice Gustafson, whose judgment is clouded when she shoots Rayburn in order to protect what she believes at the time to be her brother Brooks. Alice also feels guilty for leaving the area at a time when her little brother was an orphan and raised apparently by a foster family out of hell. Eventually, Rayburn and Alice get on the same page to track down the killer whose trademark style is to dress up as Bigfoot and hunt down his victims.To put it mildly, \"The Silencing\" was a depressing film. Despite some moments of beautiful footage of the landscape, the photography was too dark, especially in the interior filming of the different buildings on the Sawbill Reservation. The action unfolded as a by-the-numbers psychopath on the loose film with a surprise revelation towards the end.While the cast was earnest in its attempt to work closely to the dramatic material, the film content was so bleak that it was difficult to discern any redeeming values in the character interactions and the requiem denouement for Gwen Swanson.",
    "15": "So yeah the movie is actually pretty engaging and its backed with an amazing backdrop and a solid performance from Nikolaj . However this movie is far from being unforgettable as it is let down by a cliched climax. The last 15-20 mins of the movie makes its feel like its just an another serial killer movie .. The movie lacked originality that at some point it had to resort to the way a serial killer movie would usually go. People who are fond of this genre could enjoy watching this movie without any expectation once ..",
    "16": "The story really moves along in the first two-thirds of the film, and the direction is not too shabby. However, the end is a let-down, and you certainly feel like you missed out. However, Nikolaj Coster-Waldau does a great job, as do most of the cast.",
    "17": "Good acting all around, good pacing, good setting, okay story. It's good enough to get a 7. I add another star for Coster-Waldau. He's a broken alcoholic a-hole, but he's carried the character with just enough to make me like him. And that's a big plus considering so many writers and directors these days don't know the importance of a likeable main protagonist. I left so many new series after a few episodes exactly because of that. Some movies suffer the same problem as well. This one doesn't.",
    "18": "Boring boring boring. Some beautiful scenery. That was about it. The sheriff was totally unlikeable. How did she get away with shooting the main guy? He himself was totally unlikeable. No redemption moment. Just thoroughly unlikeable. It was depressing and a story line that was just stupid. How did the scars on the throat look old when they were fresh. Why remove the vocal cords then kill them. Didn't make any sense as to the reasoning from the killer. He lost his daughter through a drink driver so the way he killed them made no sense. The indigenous police officer was just so annoying and cardboard cut out in his views. Give it a wide hearth if your looking for a half decent thriller.",
    "19": "The sheriff shoots you in order to protect who she thought foolishly was her brother the news gets out but still nothing happens to her and suddenly she and Nikolai weirdly becomes partners trying to find the real killer !this movie is so unrealistic and boring the same time just beneath garbage",
    "20": "The are a lot of positive things to write about The Silencing, although not everything was perfect, but the positives outweigh the negative. The story is interesting and captivating to follow. The acting is very good and that from the entire cast. Nikolaj Coster-Waldau as the leading character did a very fine job. The cinematography was also top, good editing and quality images. But the story could have been a little bit better what could have result in a higher rating. For example when somebody gets an arrow in the heart region and gets shot in the stomach, or another steps in a bear trap, and they both can walk around or even run and fight like nothing happened to them it's just not that believable and that brings the quality down. Other than that it was very enjoyable to watch, with the right amount of suspense and a nice twist that could have been more elaborated though.",
    "21": "The reviews here are being far too kind. Whilst it has an interesting premise the film just bungles along and has far too many plot holes and characters making absurd choices.The writing is pretty bad and annabelle Wallis' performance is seriously phoned in and at times - just bad. The reveal of the killer is a serious let down and the motive is just not believable at all.The scenery is nice but the cinematography is very uninspired and very low budget looking. Give this one a miss.",
    "22": "The most curious thing about this picture is why Sheriff Alice Gustafson (Annabelle Wallis) would shoot Rayburn Swanson (Nikolaj Coster-Waldau) to protect her brother (Hero Fiennes Tiffin), who at the time looked like a suspect in the abduction and murder of young teenage girls. Neighboring town law officer Karl Blackhawk (Zahn McClarnon) put her on notice of suspension (how does that work?), but then it didn't amount to anything because Alice was back on duty immediately. Something here wasn't thought out very well.Well, I don't know about that sasquatch outfit the killer was wearing. It did provide a pretty good disguise, but it looked kind of weird at the same time. If it's purpose was to scare potential victims it probably worked. The motivation for Dr. Boone (Shaun Smyth) to go out and target young women because his daughter was killed in a hit and run seemed kind of suspect to me.Was there a reason for Brooks (Tiffin) to kidnap Sam Moonblood (Gregory Odjig) and tie him up in a deserted building? If so, I didn't catch it.There seems to be a penchant for a lot of the more recent movies I've seen to be filmed with crucial scenes almost completely in the dark. Fine, if the story calls for it, but even so, how about letting the viewer see what's going on. Early in this picture, Rayburn's animal trap pit was revealed having upturned spikes upon which a large animal might be impaled. You felt that maybe this would have figured in the resolution of the story when the time came, and it does, but how many viewers would have forgotten about it when Rayburn had that final struggle with Boone . You had to remember that earlier set up, otherwise it just looked like Boone fell into a completely dark hole and didn't come out, leaving you to wonder why.",
    "23": "This is so unbelievably...\nLike how would a sheriff shoot a civilian in an attempt to cover a killers whom she suspected to be her brother... Like for real?\nThen she goes on with no investigation what so ever... The victim of the shooting as well does not press charges....\nHow is this even believable?I feel it's a waste of character.....\nCould have been better.",
    "24": "This movie is so baseless, if you're one of those who entertain themselves by watching literally anything, than I only recommend you to check this out too, lol",
    "25": "On your CCTV, you see a walking pile of grass chasing a barefoot girl through the woods right after another girl's dead body has been found. Do you call the police? Why, nooooo! You grab your rifle and don your red jacket and take off after him all by your lonesome. If I didn't pay $1.98 to rent it from Redbox, I'd stop watching now. Redbox needs to give refunds if you can't get past 30 minutes.An hour later: I just finished watching it. All who gave it high ratings....you either worked on the movie or you were paid. At any rate, you owe me for listening to you in the first place. That has to be one of the worst movies I've ever seen. How the financiers were convinced to part with a dime to make it is beyond me.",
    "26": "Rayburn's (Nikolaj Coster-Waldau ) daughter went missing 5 years ago, but not his taste for hard drink. When it is discovered teenage girls are being hunted, Rayburn wants to find the killer as much as Alice (Annabelle Wallis), the newly elected sheriff. Her brother has issues and becomes an early suspect. Victims have their vocal cords cut so we can have a title to the film. They are hunted ancient school with an atlatl.This is a mystery without a lot of characters. Alice was the interesting character, a newly elected sheriff who wants to protect her brother who has brushes with the law. This leads to an interesting unexpected scene later in the film.Guide: F-word. No sex or nudity.",
    "27": "You would figure that in this day and age movies would need something more to be approved. A true story, or based on true events, unjust conviction, innocent and found guilty. I mean there are thousands of real stories out there that are interesting, thoughtful and memorable.Why spend money, time and effort and make an average film that probably barely break even, especially in a time where the biggest bang for your buck, the theaters, are shut down?I always hope hollywood will get better at making films but they never seem to do.",
    "28": "Although the last twenty minutes of the movie is somewhat too predictable, overall this is a decent crime thriller. I would have preferred we be given more background details, especially concerning what happened before the beginning scenes of the movie.But there's a very good cast here, and there's enough mystery and suspense to keep the viewer's interest.",
    "29": "Nicholas is always a good watch. That being said, this movie had potential but there are some big holes. They really lost me when the sheriff shot Nickolai to cover for her brother, nearly killing him with a shotgun and she was able to function around town as normal. To add insult to injury, he decided to let it slide and liked to protect the sheriff. Really? Here's a big hole - the \"serial killer\" who is the town doc gone crazy after his daughter was hit by a drunk driver and, is killing girls with arrows with his initials on them. Cmon!! And there is no good connection as to why his dead daughter has caused him to kill other girls? The movie was entertaining, aside from the above and another dark and dreary small town depressing watch.....but it does hold your interest. A few tweaks and this could have been much better. The stars are for Nickolai mostly.",
    "30": "I find it pretty intense, suspenseful and engaging. I think Rayburn is captivating because of his past, and his unique role in the search for the killer. I enjoyed watching it.",
    "31": "Banal. Full of cliches and plot holes. Seems to have been put together from a 'write your own serial killer in the woods movie' kit. Suspect it was put together to cash in on an Ontario government film fund..",
    "32": "Its not a mastermind plot, but it dont have to be.\nIn fact the main plot is obvious 30 minutes into the movie.\nThe pace is okay, I am sure that some would call it slow. But I liked it.",
    "33": "Coaster-Waldau is a heavy drinking game reserve keeper whose daughter was murdered some years before. When young girls start getting hunted and killed again he and separately, sheriff Annabelle Wallis start investigating.After a dullish first half there are enough twists and turns in the plot to make this a diverting time filler, albeit the 2 leads lack any form of charisma making it difficult to empathise / get remotely excited. Gets better as it progresses but ultimately only a so so effort.",
    "34": "The movie started well, establishing an atmosphere of backwoods darkness and mystery. As it progressed, however, one unlikely clue or event after another built up to a confused and overlapping mess. It became hard to keep track of all the false leads they keep throwing at the viewer. I kept watching to the end, only out of curiosity as how they were going to resolve this confused hodgepodge they considered to be a plot. In the end the denouement was as unlikely and as farfetched as what had proceeded it. In the movie's favor is some lovely cinematography of the Northwest forests. And I would kill to own that little shack by the lake. Aside from that I would file this one under \"hot mess.\"",
    "35": "There is maybe a problem for the whole film. It is billed as a crime thriller, but it did not thrill so much, except for its final part. The story is certainly watchable but not gripping. The people not extremely interesting (even the killer turned out to be just plain odd), and we didn't find out enough about what happened to the victims to feel anything much for them. There is a tension around the climax, but nothing had built up to that stage. Director Robin Pront made another movie a few years ago which was well received (as well as several shorts), so perhaps the problem was the writing. As well as the mood of the film, there are maybe some problems with the story: for example, there a number of - potentially interesting - plot strands which don't go perfectly well together, such as a traditional weapon, and Brooks' trauma. Some characters are basically standard models from crime dramas across the western world. The lead actor has yet delivered a good performance, which helps to save the review.",
    "36": "Just finished watching this. Nikolaj Coster-Waldau was believable and some stunning scenery. However:1. Doctor is the killer after his daughter was killed by a drunk driver and left to die in the woods. So he takes vengeance by killing similar age girls?! Really?!2. They have their vocal chords surgically removed (why this doesn't automatically lead the authorities to start investigating medical professionals, I'll never know) but there is literally no explanation for it. No reasoning. You'd think given that the film is titled \"The Silencing\", there would at least be SOME form of link.3. The killer fights with the protagonist, knocks him out, attempts to kill the girl by spearing her through the stomach, only for the sheriff to arrive, think that the killer is her brother so shoots the protagonist. Then NOTHING happens to her. At all. Ever. Even if the main guys does drop all the charges later on, there is still a decent amount of time up to that where she's still on active duty like nothing happened.Found myself skipping through parts to save myself the frustration.Overall good potential and beautiful scenery, but let down severely by lazy writing.",
    "37": "The Silencing is a solid film, despite not having considerable dialogue or delving very deep.Nikolaj Coster-Waldau's certainly one of the \"Game of Thrones\" cast members capable of carrying a film. It's a little far-fetched though, someone doesn't just become a monster overnight, that and happening to see something on the cameras and happening to be in the doctor's office and being able to get there so quick. There's a missed opportunity to take it up a notch, after the minor twist, but unfortunately it's just put to the side.",
    "38": "Could have been good. Weak plot. Inconsistencies. Wallis was not a believable character.",
    "39": "I gotta admit, this was a solid film. A watchable serial killer film with a couple of nonsensical scenes but overall consistent to the end. I do enjoy that the killer was not revealed unto the very end, and that's a good sign of someone putting in the time of writing a somewhat coherent story. For me it was a one time kept my attention the whole time watch but not to be watched ever again film.",
    "40": "A bland and uninspiring script that relies on tired tropes over creativity. Disjointed and poorly execute.",
    "41": "It could be a pretty good film. Acting of Nikolaj Coster-Waldau, the background were pretty good. But... Sehriff ruined it all as a character. Boring, sexist, lack of moral.Such an irritating character. Then we've got a dull plot, which would have been more acceptable if it had included some others storylines. I mean i do not feel anything to the majority of cheracters, which had everything to get at least a small story behind them. Like why someone is drug addicted, what fell parents of kidnapped girls and so on... Rayburn Swanson was told to be always drunk, but we never see it. It appears only as a fact with no circumstances.\nThere is not much to say, just an usual film with some modern tendensions. But it has nothing inside and doesn't make feel anything.",
    "42": "Good trailer . Awful film . The main actor's x wife whose 15 yo daughter has been missing for 5 yrs and she looks all of 20 . And stupid it goes . Every time he goes to the forest his truck won't start . And the sheriff. She's cute but can't act . She sides on one cheek in her truck . The forest and the river were beautiful. If I had to live in such a town I'd kill n myself .",
    "43": "Really good! Lots of tension and twists.\nExactly what I'm looking for in movies now: No more of the same.\nA movie that I'll probably gonna watch again!",
    "44": "This film start with a female dead body floating along the river, and a man \"Rayburn\" stop two men for hunting in the wildlife sanctuary scene! As turnout, this film is to find out who is the mastermind of the killing of a series of young girls, including the daughter of Rayburn! The mastermind actually is Dr. Boone! Entire film full of boring conversation, and overuse scene! Such as, overuse of the driving scene, overuse of the aerial river scene, overuse of the searching things scene, and overuse of the watching surveillance video footage scene! Make the film unwatchable! All the action scene have blood at certain point, but overall portray by sideways! Not intense at all! Barely intense scene is, Rayburn fighting with Dr. Boone in the kitchen! At the end, Rayburn push Dr. Boone inside the animal trap, and let him rot in there! That's it! Wasting time to watch!",
    "45": "I love murder mysteries, movies that dont give away the plot to early. So this one was actually good i didnt figure it out to close to the end. The acting was 6/10 and the plot and writing was also a 6/10 thats why i gave it a 6/10 rating. I find that when a story has good character building and it really gives you good background into why things happen in the story.but it wasnt developed enough for me the Sheriff played Alice Gustafson, and the male lead Nikolaj Coster-Waldau as Rayburn Swanson did a great job. Id recommend it for a good watch nothing more then that",
    "46": "I have a few questions. Why was the cops brother dressed up exactly like the assassin and come after NCW's character? It was not explained. Dressed up exactly with the mask and everything.The cop ends up shooting NCW and there are no questions asked about it.Why did the cops brother lock that guy up in the barn? What point to the plot did that have.After getting shot in the chest with a spear and shot in the gut with a bullet, NCW recovers almost immediately from both injuries.What motive did the doctor have for killing all those girls? His daughter got hit by a drunk driver? Wouldn't the FBI have swarmed that place after all those girls mysteriously go missing?Just all kinds of plot inconsistencies. The only thing people seemed to like about the movie was the scenery and I even thought that was ugly.",
    "47": "Gets your interest early, and keeps reeling in. Actors are solid without being Cannes candidates, direction very good and the plot gets very well developed with some twists that throw your guesses out.There are several loopholes and some inconsistencies but they don't diminish the tension of it; actually, I think the script could have been better but the direction and actors make it into a very decent film.A few minutes explaining backgrounds would have been welcome tho. Honestly, it's a 7/10 but I gave the extra point to offset hate-raters that give a 1/10. Watch it and decide if it's \"the worst film he/she/it ever watched\".",
    "48": "Story pace is good and thrilling till the end ! Yeah, the main cast is all the reason to watch.. Nikolaj Coster Waldau always delivers his best, get beat up so many times, that's quite an action there.. So it's pretty enjoyable watch, not boring..Although there's some parts that can improve..",
    "49": "The movie was well worth the watch. It's a \"who done it\" type film. The suspense/action starts early and doesn't really let up. Nikolaj Coster-Waldau was a great lead and he should be doing more lead roles. His presence makes a movie more attractive in my opinion. I love Annabelle Wallis, she is so stunningly beautiful and also has a solid performance. The movie kept me guessing what was going to happen next. I was thoroughly entertained and I think you will be as well. I'm your average Joe that likes all kinds of movies and am always looking for a movie to watch at home on the couch and I always hope I pick a good one. This one lived up to my hopes :)",
    "50": "You've got to be kidding me?How could anyone give this ridiculous, written by a middle-schooler, movie anything above a 2?",
    "51": "Its kinda low budget movie , but good quality performance , some decent direction except sometimes some scenes are way to dark. .the movie has some twists and suspense , but in the end. it really killed all the twist n suspense .\n-----------------spoilers----------------i really thought the end villain would be someone in start of the movie. but it was totally out of all characters in start which make the movie has stupid ending.",
    "52": "A low budget thriller for an out of work ex-GAME OF THRONES star. Just kidding, I do like Coster-Waldau, but this sombre thriller doesn't really do much with his charisma or his talents, and it's one of those spare kind of films that you just wish had more going for it. Coster-Waldau is this reclusive guy living out in the woods who becomes involved in the hunt for a child murderer. Little plot, and that which does exist is predictable, although a fair bit of quite well shot action; it's unbelievable the punishment our hero goes through in this one.",
    "53": "C'mon people quit hiding what you don't want to show...there are a million ways the create an eerie situation besides fishing with flashlights... its just plain crap... i half expected ed asner to show up and confess to the crimes ...clearly ridiculous.",
    "54": "Silence is not golden, my friend. The movie defies logic; it may have action, but the actions make no sense. Who gets shot on a reserve and fails to report it; who finds a strange vehicle with no tags after said shooting and doesn't totally destroy it; who carries someone obviously stronger than them halfway through the forest? And that's just the first half... It just gets worse from there. What the heck, man? The critics were on point with this. The high ratings from some of the audience also defies logic... Y'all watchin' the same movie I am?",
    "55": "...about ANYONE or ANYTHING in this movie?!! That was my constant thought throughout this convoluted mess.\nBad acting was the least of its problems. Actually, I'm not even sure it was bad acting. Maybe that's just how it seems in a movie full of painfully uninteresting and pointless characters doing painfully uninteresting and pointless things. Sad. It could have been good had they stayed focused even a little to the story it was supposed to be.\nGave it four stars because I watched the entire thing. Like a bad meal that you should have sent back but ate.",
    "56": "The biggest unanswered question in the movie was why the killer was actually hunting and killing the girls? The film answers why the lead males character daughter was murdered, in a vague way but never explains the gilly suit or ancient Greek weapon...?There is also a potentially HUGE plot twist in the middle of the movie but sadly the movie reverts and virtually ignores the twist, it's not a good plot twist but it's one you won't see coming, mainly because it makes no sense. Which sums up this movie really, a lot of it makes no real sense.Is it worth watching? Sure, but it will leave you disappointed.Ultimately it's a shame as it probably could have been a great movie, it has a short runtime of only an hour and a half,perhaps if it had an extra half hour it would have been a more fulfilling movie and answered all those unanswered questions.",
    "57": "I hated this movie for being too unclear and negative. The dominant emotion is anger. And leaves us with too many questions unanswered. For example who is that girl on the picture with the culprit (could she be main actor's daughter and still alive), did they find all the bodies especially of main actor's child, why policewoman (sheriff) acted too inapropriately (unreasonably) (even if that is her son, is is still too extreme and unreasonable), why would someone perform surgery on kidnapped children if that is just to save them from drunk parents, what is really wrong with sheriff's kid and what crime has he done and is doing. But good is the environment, look, and bit experienced actors. I liked seeing scary envirnments, different jurisdictions, weapons, car tracking mystery, and that sheriff's son who looks so so so bad, pure evil",
    "58": "Very choppy, full of goofs and improbable situations. As someone else pointed out, how can a surveillance camera be pointed at the exact place to catch a shot of the killer, when the \"preserve\" is 50 acres?And, how does the sheriff keep her job after shooting Rayburn to protect her brother?Not terrible acting, but a horrible mess of a screenwriter's brain fart!Just too many things that just don't add up.A mediocre movie at best, and, I don't know how it could ever be worthy of more than a couple of stars.",
    "59": "The story is basically a who did it, which never gets old if the writing and acting are good.Solid acting, which is no surprise coming from Nickolaj. He basically carry the entire movie on his own. Not to say any other actors sucked, but alongside home they appeared just ok.I enjoyed the unfolding of the story with the couple of twists thrown in. I definitely didn't expect the one twist with the woman sheriff, nor the ending. I thought for sure it was going to be the ex wife's new beau behind it all, but he was actually the most upstanding character out of the entire movie.I thought the writers did a decent job with the character building without being too heavy handed or skimpy on the details.I honestly don't have any critiques which is funny because lately I've been hard to please and a negative Nancy at times.It's worth a watch and at least a 7. I gave it an 8 because I feel the current 6.2 rating is a bit on the low side. Lol.",
    "60": "A clone of a better movie really, Wind River is a much more interesting and better paced watch.",
    "61": "Story and cast had a great pretext. But the delivery failed. Many sub ploats were left unexplained. Poor writing in the screenplay department.I did enjoy playing the guessing game but there were far too many flaws in continuity and general direction.Like how did Rayburn survive a gun shot and yet drove all the way. Plus his car brokedown twice in the sanctuary and he does not carry a phone. How did he manage to get it back to his home office.Why in the world did doctor boone do the knuckle tricknin front of sheriff?",
    "62": "In all, this is a good film to watch. Nice cinematography, acting, props, action unfolding. Coster-Waldau gives his best, throughout the film. I noticed the casting is quite distinguishable in terms of depicting totally different yet sometimes conflicting characters. This is quite a clever choice in my humble opinion. The plot is good and adrenaline rose to the top, from some point onwards.I also liked the way two main subplots unfolding almost separately until they are combined and form one line of action. Good twists and clever story unfolding. The ending, although expected, still serves as a justified conclusion, after all that's been happening during the plot.But:There are some considerable plot mistakes. Rayburn gets pierced by a stone arrow, he sews his wound on his own using metal wire, yet right afterwards he's able to withstand batter hits and ultimately carry a girl on his shoulders for more than 10km. On a next scene, he gets to fight back and run, after he was gun shot in his belly. To make things worse, he was operated in a roadhouse, with no specialised medical/surgery equipment and, right before he is treated, he forced an intruder drop his knife, despite the blood he'd lost.A specially trained Sheriff, like Gustafson (it's mentioned so, in the beginning of the film), would have noticed the significance of a throat operation and would demand a thorough investigation, with the help of dr. Boone who, surprisingly enough, just says: \"Yeah, I'll keep that in mind\" - and leaves, after he examined the body of the first found victim. As guilty as he was, the logic thing to do is to contribute to the research, not leave. Even a rookie would have noticed the flaw in the good doctor's reaction, and would stop him from leaving the morgue.No one seems to wonder why Sheriff Gustafson fired her side arm. There are no questions asked by her fellow officers, which is kind of... awkward, to say the least. (for more info on a similar script twist properly induced, take a look on the film remake \"Insomnia\", starring Al Pacino, Hilary Swank and Robin Williams).In such a small town, everyone knows what everybody's doing. How come no one noticed dr. Boon using the old neighbour's car so many times, in so many same hours, heading to the same directions? In real life, this element alone would give away any perpetrator.I agree that this is a fictional story, and no need to adhere to strictly realistic details. But from a certain point on, it just gets funny, especially when the scenery and story reality lies on an everyday life of today, depicting similar people and habits and surroundings.Other than these few remarks, I think it certainly is worth your time.",
    "63": "A simple story told in an exciting way. A father loses his daughter, retires as a hunter and forests, with years later confronted with the murderer. Nikolaj Coster-Waldau emerge later, and make the whole thing a really small but predictable spectacle. Bigfoot as a killer, put ibto costume",
    "64": "Keep your expectations low with this one and you'll be fine. First, the setting, scenarios and cinematography are the best of this movie. Second, the script even pretty predictable and simple, has a few good twists. Last, acting from the main character is the best one.\nOn the other hand, a lot of plot holes from the script make this movie a little messy and empty.\nSo, overall just an entertaining movie. Watchable but far from great.",
    "65": "The first ten minutes sets up what could be an intriguing mystery. After that it deteriorates into a morass of plot holes and nonsense. Plus the screen writer needed to do a better job of finding out how folks live in the forest. Our protagonist has a house full of CVT monitors but didn't keep a portable generator in his truck. He gets shot by a crazy man running around in the woods but doesn't ask for help to track the Sasquatch wannabe. This is one of those movies that you start fast forwarding because you want to get the resolution but don't want to waste time getting there. I gotta go. I think the bear is back in the bird feeder. That will be a lot more interesting than this movie.",
    "66": "A very good movie both well written and well acted. It will keep you on the edge of your seat from start to finish as well as keeping you guessing.",
    "67": "Its a heart puller all right- Right from the beginning they want you to be sympathetic to one our main characters you know the guy from Game of thrones and yet his written so poorly loses his daughter almost saves a girl and than goes ahead and let her die as for the sheriff WTF",
    "68": "The concept is relatively simple and overall exciting to watch. There's some bad acting as it relates to anyone who plays a police officer, but regardless it was worth the watch",
    "69": "Glad to see Nikolaj Coster-Waldau is back. His acting is quite good in this film as well as the whole feel of this film. Good thriller with great plot twist. I didn't see the ending coming. The only con I can say is that the movie never reveals the story behind why the incisions in the victims. Don't worry, not giving away anything since its one of the first things we are presented with.I want to see more Jamie Lannister on screen. Make it happen!",
    "70": "This move is disappointing--to say the list. Hackneyed script, the revelation of the serial killer in the finale was absurd -- didn't make much sense.",
    "71": "There was so much back-and-forth and around and around that I got impatient. It was too many suspects in the movie. Once the killer was revealed, I had three big questions: really?? huh?? And what?! The person that was the killer didn't make any sense. When you watch this movie you'll know what I mean. What saved this movie was the acting. I would say, watch this movie on a day when there is nothing else available to watch.",
    "72": "We have seen this kind of movie alot!\nBut it works every time with me on different levels because the filmmakers have to put their touch on it to make it little bit different, it's not the greatest thing but it's good one, it's short very tense, scary, and dark also the movie have fantastic cinematography and great score.\nThe cast are not that great unforchantly with thier performance and don't know why, is it the script, the direction or the time!.",
    "73": "Features stars from game if thrones, Fargo and peaky blinders. Enjoyed the story, the cinematography was very good and the acting was above average. It's not an oscar winner but it's a definite excellent thriller. Will watch it again.",
    "74": "\"She was hunted\". Uh-oh. That can't be good. Hunting is for other stuff which I don't condone, like killing a wild animal for sport or misbehaving like those dudes in 1994's Surviving the Game.Anyway, 2020's The Silencing is my latest review. And yeah, I'm not quite sure what the title of this movie actually entails. I mean there's no silencers involved and well, people get loud and angry. Oh I forgot, there's a scene where a muted persona willingly writes her name in the dirt.Released in July of this year, filmed in the dark-clouded wilderness of Canada, and featuring an ending that does a 180 just for kicks and giggles, \"Silencing\" is helmed by second-time director Robin Pront. Pront divvying a twist or two with a few whip pans, thinks he's channeling his inner Jonathan Demme. In reality, he's just well, channeling.Starring an almost unrecognizable Nikolaj Coster Waldau (in looks and in accent), glorifying spears as murder weapons, and distributed by the busy bee organization that is Saban Films, The Silencing has its characters getting stabbed and shot yet miraculously recovering as they walk around unscathed. I mean it makes sense while being senseless. Otherwise the flick might cease to continue.So yeah, \"Silencing\" kept me involved for at least some of its 90-minute running time. Still, it's over-familiar with stuff like Wind River, Blood and Money, Cold Blood, and 2019's Daughter of the Wolf already making the rounds.The Silencing is about a wildlife sanctuary owner who tries to track a killer bent on preying on young girls. Said owner is an alcoholic, he's got a closed-off personality, and he takes the law into his own hands without so much as a mild indictment. As an avid movie watcher, it's been there and done that for me. \"Tranquilly\" mixed results.",
    "75": "A little slow start, but then turns into an edge of your seat thriller.",
    "76": "Interesting setting, with okay cast. Just needed a little improvement in writing.",
    "77": "We have another film.with a good premise thst fails to deliver because of bad writing.1 why was the sherrifs brother dressed as the killer ?2 why did the hero not contact the police straightaway when he was shot with an arrow?3 why would the killer target young girls and not drink drivers?The whole film felt meaningless just due yo bad writing.I could go on about the plot holes like how did the sheriff know where the camera where in area of fifty square milesWatchable but don't expect a clever suspense thriller.",
    "78": "The Silencing: A guy in a ghillie suit hunts women in the woods, using an atlatl.(spear thrower). Bodies are found, an alcoholic ex-hunter now running a nature preserve gets mixed up in a troublesome situation with a Sheriff who is looking out for her trouble magnet brother. The hunter's daughter disappeared 5 years ago and he has a lead at last. Red herrings abound with overlapping jurisdictions between the Sheriff and the Indian Tribal police. Some savage and disturbing scenes of violence, even the ghillie suit is made to appear threatening, evoking primeval; terror. The killer hunts through the woods and himself becomes the hunted in some of the best shots. Directed by Robin Pront from a screenplay by Micah Ranum. On Netflix. 7.5/10.",
    "79": "How did the female sheriff become an actress? Just terrible performance, it's embarrassing. You should choose the best actors for a role, not just give a female a sheriff role just in the name of equality.",
    "80": "Everything is nice except it's a tad bit slow at times, lacks much action.... the movie on the whole is nice and definitely worth a watch on a lazy Weekend.",
    "81": "As a character the sheriffe ruined the whole movie.. Don't watch it. I'm sure you will disappoint",
    "82": "Watch Wind River, way better. This is just a garbage knockoff ...",
    "83": "The cinematography is really good and so is the pacing and acting but by the end everything felt a bit underwhelming. Felt like there should've been a lot more story to tell.",
    "84": "One of the worst films I've seen since the last couple of Hero Fiennes films I tried to watch- which were also lazy and completely inept. Someone needs to help him chose scripts poor kid. But Jamie Lannister!?.. what's you're excuse Nikolas Coster-Waldau!? I mean we know you screwed your sister for 8 seasons of Games of Thrones so that means you're a little doolally but come ON. Bad. Beyond bad. Don't bother. The best thing was me and the hubby had so much fun commentating the entire time. We were cracking each other up. This is Mystery Science Theater GOLD all the way. Or Googlebox.",
    "85": "And I've seen some rubbish! The plot is totally unbelievable, the ending is just awful. The only redeeming feature about it is Nikolaj Coster-Waldau, but he's not a particularly convincing drunk. I don't usually leave reviews but this was so dreadful I had to warn people. If you want to watch the most unconvincing, senseless film ever, this is your one. At least it gave us something to dicuss over dinner.",
    "86": "No pun intended - why do bad people choose the individuals they choose? What makes the victims ... well exactly that: victims? Is it something they have done, is it random or something else. And does it even matter? Well this depends on the viewer and if he or she cares enough. In this case we have many story strands trying to connect to each other ... which makes this quite intriguing and suspense filled.Great acting and great twists make this movie quite good to say the least. The fact that we have a lot of things to keep track of (no pun intended), might make it a bit annoying for some though. Hopefully not - this really touches quite a few nerves ... just give it a chance if you are into thrillers.",
    "87": "This movie has a lot of strange plot twists with unbelievable reactions, etc. Plot holes are a problem. Supposedly the bad guy is removing vocal chords and hunting girls in the forest because his daughter was killed by a drink driver?!?! WTF? Also, why does the protagonist cover for the kooky sheriff who shot him? Movie is really dumb. 3 stars because they obviously tried.",
    "88": "It's worth the watch but the plot has some major flaws.",
    "89": "A solid and decent thriller - nothing new on the Western front one may be dared to quote. The cast and production is solid, the story good enough, and last but not least it is nice to watch Nikolaj Coster-Waldau again (he was the main reason why I gave The Silencing a try). Recommended if you liked Wind River (2017). Precise rate: 5.5",
    "90": "Some of the film is good but I really can't stand films when the characters make blatant and unrealistic decisions. The worst one being when the main man in the movie goes up to the killer's house with no weapon, no police back up and he isn't even vigilant whilst being in the killer's house, so the killer is able to just sneak up on him and inject him. I get it, he likely did it out of impulse or emotion, but still a lot of this film the characters just don't make smart choices. Ridiculous.",
    "91": "Solid acting in this movie but I felt like I'd seen it so many times before. Not a lot of originality here. 6/10",
    "92": "The plot built on nicely till about the middle and then it didn't, it just became senseless and then cliched. Nikolaj is the only redeeming feature of this thing. Surprisingly it is not a boring watch but rather a disappointing one.",
    "93": "I like the mystery, story-wise, albeit seems like a copy of other films; and the twist too. The cinematography is pretty darn good. Nikolaj Coster-Waldau delivers such good performance among other okay-casts. Overall, this film is good but there is still room for improvement. It's not that wow but it's watchable.",
    "94": "This 2020 thriller stars Nikolaj Coster-Waldau and Annabelle Wallis.\nCoster-Waldau (Game of Thrones) plays Rayburn, a reformed hunter who lives in the wilderness. Soon, a killer starts killing women/girls which catches Rayburn's attention because he's been searching for his missing daughter for 5 years. Wallis (The Mummy) plays a local sheriff investigating the crimes.\nThis is pretty good, Nikolaj is great in it and there's nice scenery/settings.\nGive this a view if you like crime mysteries or thrillers.",
    "95": "I can't believe that not one of the 266 reviewers noticed that the supposed crimes of the serial killer doctor in this potboiler make literally no sense. If he's killing young girls because his daughter was killed by a drunk driver, why in the world is he taking the trouble to slit their vocal cords? That little fetish was important enough to supply the title of the movie, but given his minimally convincing motivation, it makes no sense. It's never explained or even mentioned by any of the characters. WTH? Then there's the fact that the first dead body found has a COMPLETELY HEALED scar on her throat. Was this lunatic killing girls or keeping them captive until his freelance surgery had totally healed? Then there's Molly, the girl rescued by Rayburn in his animal reserve. Her scar is also completely healed, but she has apparently escaped somehow from the killer, who must have waited several months after rendering her mute to finally massacre her. How has this expert tracker somehow not been able to hunt her down? And finally there's the dead African American girl found in the killer's house, whose throat has been freshly slit. Will her wound miraculously heal even though she's deceased? Will she then rise from the dead and try to escape?Let's face it. \"The Silencing\" wasn't actually written by a human being. It was generated by a monkey randomly striking letters on a computer keyboard.",
    "96": "Nikolaj Coster-Waldau is handsome and convincing, Annabelle Wallis is a beauty, the setting is romantic and picturesque, and the atlatl - the atlatl! - is something really promising, mysterious, barbaric, ancient, deadly, bizarre, such a perfect hook. But no. All in vain. All this pathos happens to turn into the pathetic nonsense in the end. So many loose ends, so you just watch how the movie falls into pieces in front of you. Why atlatl? Why \"Silencing\" in the first place? But who cares.",
    "97": "The twists and turns in this movie make it a great watch, every character has thei4 own story and some of them are nothing like they appear to be, mostly underrated by what I can see from others but to each his or her own. Very intriguing and enjoyable.",
    "98": "Good solid performances by all involved just a good interesting afternoon thriller. Nikolaj Coster-Waldau Is a really good actor and brings his role to life. The story itself is lacking details like we never find out why the killer does what he does or anything about his reasons for the surgeries on his victims. The sheriff played by Annabelle Wallis is also a rather spotty back story though we understand her a bit more than the killer. All in all wish they had spent more effort is telling the story but it's a pretty good film.",
    "99": "Some young girls are missing and police were investigate regard it..\nSoon they find that one of the physco killer kidnap the girls and torture them in forest before kill them..\nAtlast protogonist who lost his daughter few years back find that killer...\nGood photography and screenplay..\nEasily can't predict the killer..\nMust watch movie..!",
    "100": "I only knew of Nikolaj Coster-Waldau in the lead role of this movie set in Canada and how nice it was to see what really good actors are still around without having to continually resort to Neeson, Clooney, Damon, Trejo, Elba, De Niro or any of the Baldwins! When such 'big' names as these are used in a relatively by the numbers movie, their presence only overshadows what may be (as in this case) a well directed and filmed movie. And what a change it makes to see a film that doesn't have CGI in every other scene, screaming kids and idiot adults. It has a good, punchy storyline which other than the inclusion of Native American territory and snow I can't see the obvious similarities with Wind River that some apparently can. I love the real meaty locations and the filming is vey good. Annabelle Wallis and Shaun Smyth also star.",
    "101": "It had the suspense and mystery that I was looking for. Admittedly the film takes a little while to fully get to the plot but the lead up gives us interesting pieces of info of the characters; the cast are all pretty good and do well in the rolls. The main protagonists of rayburn and alice especially. There is the payoff I was hoping at the end and the film is really just gets to the point of the story its telling and altogether makes you want to find out why these children are disappearing.",
    "102": "Great acting, mediocre plot. i saw the twist coming from like 1/4 way into the movie...ending would've been better if the killer didn't have a motive instead of the weak one we got. could've done without the red herring side plot that was simple but somehow also confusing in the manner it was presented. a few continuity errors that bothered me like why Rayburn was putting up missing posters stating that his daughter was 14...when she would now be 19 if she disappeared 5 years ago. also the midway \"reveal/twist\" would've made sense if the killer was also shown doing the same thing with their hands some other point in the movie...which would explain the confusion, but no. also the sheriff would be in jail for pulling the stunt that she did. lol",
    "103": "Not bad. Not great. Some of the acting and writing are sub par. Annabelle Wallis just can't loser her Irish accent enough to not be noticeable. Overall decent story thought not bad at all.",
    "104": "It has its moments, but in the end falls short. Acting is good, but the story is jumbled and drags.",
    "105": "Solid acting from Nichola Coster-waldu. Slow pace. The big twist underwhelming. Overall it's a half baked movie.",
    "106": "This movie truly sucked.\nTried to get in to it, but decided to take a nap.\nTime better well spent.",
    "107": "This dark drama had its moments. The acting was good, setting was great and the story was engaging. The ending falls a bit flat for me but it was still a decent film. Worth a watch.",
    "108": "While I think the last 15 minutes could have used a slightly more sinister twist to fit the rest of the movie, this is a good thriller. Action from start to nearly finish and even the finish is not bad, it is just that the rest of the film is that good. Well played characters, the kind of setting naturally perfect for creepy stuff to happen and an actual plot. It kept me hooked.",
    "109": "Awful movie with unrealistic motives by characters . Also super hard to hear them talk with the suspenseful music .",
    "110": "What a waste of time! It makes no sense whatsoever. Avoid at all cost. It is a badly written incoherent cliche ridden mess. It doesn't even deserve the time I am wasting writing this and you reading it.",
    "111": "Not too bad a drama about a hunter who gave it up apparently due to his daughter disappearing and he now runs an animal sanctuary usually with too much alcohol in his system. This character is portrayed by Nikolaj Coster-Waldau who is a strong presence and does a decent job. Beyond all of that this is also a crime film about a killer in this wilderness ending the lives of various young women, which of course is of great interest to our lead given what occurred to his daughter 5 years earlier. The hunt is on and so are the chases with the so-called leadership of a female sheriff played by Annabelle Wallis who is adequate and no more. It will hold your attention, but it is nothing special, the reveal is not all that interesting and we are left with a will he or won't he ending.",
    "112": "Ridiculous plot. Young women disappear. The sheriff thinks her brother is the criminal and shoots a man to protect her brother. The authorities don't arrest her for her crime or even make a ballistic test to see if her gun actually shot an innocent man. Not since \"Speed\" have I seen a more \"Yeah, Right\" film. The end, is laughable. The corrupt sheriff suddenly grows a pair of scruple balls and demands the wronged man, she shot, not kill the killer of his daughter. And the corrupt cop sheriff walks away.",
    "113": "Not bad...not particularly spectacular ,very simple ,overused premise...good acting brings it up. Overall enjoyable one time watch.",
    "114": "Former Game of Thrones star, can't seem to fond his mark. Could have been so much better, acting, sound,script,continuity,\nSince i am a Canadian , i can usually spot a Canadian made flick. This low budget, Canadian actors..............always seems amateur , never professional.\nWhen you look at what Australia puts out , the quality and production way way above this . Canada just seem to suck , because they always use Canadian production team",
    "115": "Great acting and a great suspense! I would watch it again.",
    "116": "But you haven't. An original take on what appears at first to be a a worn out plot. Some nice twists that may seem a bit hokey, but I like being played by a film, and this one did that. And you won't guess the ending, I promise.",
    "117": "A conservator of a nature preserve Rayburn (Nikolaj Coster-Waldau) encounters a serial killer that uses a very unusual weapon, an atlatl (a spear throwing device - I never heard of it either). This killer uses a ghillie suit for intense camouflage (used by snipers who work behind enemy lines). Rayburn, an alcoholic, gets help from the local sheriff (Annabelle Wallis) Gustafson - to a point.\nThe scenery is spectacular, the story gripping and the acting exceptional. I was captivated by every minute. Thoroughly worth watching.",
    "118": "Main character is still searching for his teenage daughter 5 years after she went missing. Now, another body is found. Several story lines twist through this movie as the characters struggle with personal demons, grief, and trying to move forward. The mystery aspect is there, but it isn't the focus of the plot so don't expect a whodunit in the traditional sense. Well acted, well directed, well paced story unfolds uniquely in the conventions of this genre of film. Well worth the watch.",
    "119": "I have questions from the writer and director of this movie. How does the main character does cleaning of his house right after he got released from the doctor when he was almost dead and was treated in an RV & dr claimed he might die if they don't take him to hospital?How come nobody has a freaking cellphone to call 911when they see an abandoned girl?How come he walk and talk and look normal after getting hit by the spear and shot by a police! How can he run in forest while the guy was chasing him?What was brook's point in this movie? Why did he kidnap that guy? Why was the guy killing girls when (her own daughter was dead) instead of truck drivers? The reasons why people did things in the movie make no sense.",
    "120": "Good cast here and a decent story, though a little dragged out with a plot that runs threadbare in spots. It's nice to see Annabelle Wallis again, even though the nose job she got during her Peaky Blinders stint is still kind of jarring to me. I liked the little hook in her original nose and with the nose job she went from being an old fashioned beauty to being just another pretty face. She didn't lose any of her ability from the surgery, so there's that at least.Good work here from Nikolaj Coster-Waldau and Zahn McClarnon. Both those men were needed in their roles to carry the thin writing of the characters. Lesser talents would have made for a poor film.",
    "121": "I love Nikolaj, besides his Jamie Lannister role he has done a couple other great movies. He's a very honest actor, very enjoyable to watch and really absorbs his roles. But this movie, whoa, what a clunker. There are big plot elements that are never explained (the girls throats), just laughable circumstances and developments, bad (or no) acting by the female lead with unexplainable things going on with her, and a TOTAL let down with the big reveal of the mystery killer. I really wanted to enjoy this but there's just no way.",
    "122": "What could have been a good storyline was lazy. Non-interesting antagonist. Entertaining, good acting from Nicolaj, but wasn't that great.",
    "123": "I dont write many reviews but felt this one is way better than the reviews, it kept me entertained right through",
    "124": "But if your not a hiker or hunter who loves the outdoors then you probably won't like it as the outdoor photography is the best of it and a fairly decent story.. enough to keep you interested for sure.",
    "125": "Wtf how do you write ✍a plot so bad and so inconsistent?!I used to think Ryan Johnson or Patty Jenkins are awful 😕.",
    "126": "Because this movie doesn't hold up. The acting reaches sub par at times but is otherwise shallow and pedantic throughout. I stand by that. Uninspiring script and just plain blah all around.Don't waste your time. It sucks.",
    "127": "I quite like the setting, the camera work and music are suitably atmospheric and Nikolaj Coster-Waldau was alright but there are so many unanswered parts of the plot that the film inevitably disappoints. The basic idea that various teenage girls go missing in a small town kind of worksbut noone seems overly concerned about it! Why does noone look closely at the removal of voiceboxes and the neat sewing up job? How does the Sheriff not get suspended for shooting an innocent man (who had already been shot with an arrow and been badly beaten up but just keeps on going)? The subplots the Sheriff's dysfunctional family background isn't given enough time for her brother's actions to totally make sense. The chances of Rayburn's 14yr old daughter walking off in the rain seems highly unlikely given that most teenagers refuse to walk anywhere let alone when its shedding it down. I could go on, cannot believe it even gets a 6.2 on here, some people's quality control needs recalibration. That's 90mins of my life I can never get back.",
    "128": "Pity the flow is so well, but does not like alot of elements mostly at the end, like why the sheriff that shoot someone does not need to be locked or why does the sheriff let him do it. The acting is done great but the text are well very classic made. Could be more exiting.",
    "129": "Could have been more, but overall very decent watch. Good acting from Nicolaj as well.",
    "130": "It's a throwback to a different time, placed in modern times.It has a realistic feel, even though there were many flaws in how people behave today.One notable feature that I liked was that it showed a more positive light on the American Indian community, which was not realistic, but entertaining.There aren't many rural places like this left in America, but when they existed, it's nice to see them dramatized.",
    "131": "Had me entregued the entire movie. Definitely worth the watch",
    "132": "This movie made no sense. The writing was really, really bad. The plot was nonsensical, the acting was poor. Everything about this movie sucks.It's also obvious that this is written by a european. Movies written by europeans but set in America are always cringe, because the europeans simply do not undestand North American culture, and it is always obvious that the movie is written by someone who has never been to north america, let alone lived there. This movie is almost as bad as that awful Three Billboards movie. Why do people on the left enjoy creating their own villains and narratives to support their political beliefs? You can't find anything to support your ideas in the real world, so you write fictional stories in which you get to be right, and make everyone who disagrees with you look mean and evil.",
    "133": "DO NOT WASTER YOUR TIME. DO NOT BE SWAYED BY THE CASTING. The movie starts out with a possibly interesting premise but at a certain point, it ceases to make sense, the characters become incredibly stupid and if you came he looking for a investigative/procedural type plot, it loses ALL credibility. It reminds me of another terribly movie called Blue Steel (1990). Like this movie, Blue Steel features a woman police officer who begins the movie looking to \"prove herself\" or \"show she can do the job\" and then proceeds to be so incompetent... Annabelle Wallis' character basically becomes a POS and should never be a police officer, when it's obvious the writer wanted her to be gray character but still somehow respected(?). At least the last half of the movie is really bad. Thankfully I watched it for free on Amazon and I'm still so annoyed that I've gone out of my way to write this review on both Amazon and here on IMDB. I've done one or the other but never both.",
    "134": "It's always interesting to see what the stars of big and beloved shows do after their characters leave (or when the show ends, sometimes in a manner that's anything but beloved... Yes, Benioff and Weiss), so a thriller with Nikolaj Coster-Waldau (Game of Thrones) and Annabelle Wallis (Peaky Blinders) was anticipated with intrigue. The setting and plot topped the cake off with a cherry. And so, \"The Silencing\" is quite the decent thriller - never reached the stars and pales considerably in front of its spiritual similars and perhaps inspirations (True Detective, Wind River etc.), but no aspect really in this movie is below the average.Nikolaj portrays Rayburn Swanson, a reformed hunter living in solitude in a wildlife sanctuary, troubled deeply by the disappearance of his daughter years ago. A deadly game of cat and mouse ensues, as he and the town Sheriff Alice (Annabelle Wallis) set out to track down a newly active serial killer who may have also kidnapped Rayburn's daughter. The story provides most of what one would expect, chases, clues, violence, investigative and other misconceptions, offering also some minor plot turns that could raise a couple eyebrows. Though serious and working on heavy themes, \"The Silencing\" lacks suspense and the atmosphere that could've been, as plot largely functions on familiar tropes and leads to a rather clichéd final act. Where the first feature screenplay by Micah Ranum doesn't realize its full potential, the performances, geographical backdrop and visual work tries their best to make up for it. I took some issue with the character of Alice, and Annabelle Wallis didn't have a whole lot to shine on, whereas Nikolaj's offering of Rayburn felt like the most fulfilled character, and acting performance within \"The Silencing\". Shot in Ontario, Canada, \"The Silencing\" utilizes the landscapes and small town's drab charms well, though this backdrop eventually plays a role smaller than I'd wish to see. Cinematography's solid if not exactly impressive, though throughout I was thinking it'd do better with a little less greys in color grading.\"The Silencing\" feels lesser than it should've been, but it's never bad or truly boring. Decent, but forgettable, lands in the middle, one of those many movies that feel disappointing for... not being disappointing. Fans of rural thrillers, devious small town shenanigans and serial killer mysteries should be able to find a kick or two in \"The Silencing\". My rating: 6/10.",
    "135": "'The Silencing' had all the things I love in a film. It had unexpected moments sprinkled throughout, a lead character I liked and wanted to be alright in the end, a whodunnit element and some twists. What more could you ask for from a thriller? This was the type of movie that was coming out every week back in the 90s, and they were all great, yet these days you're lucky if you get one every couple of months and they're not usually as good as they used to be. So when I come across one as well done as this film was it is a rare treat.Nikolaj Coster-Waldau from 'Game of Thrones' plays the lead role, and he was a remarkably good lead-man. Not only is he naturally likeable but he is also very easy to sympathise with. His character has had something awful happen to him and so he has become an alcohol and can be quite unpleasant to his ex-wife's husband for example. Sometimes these characters can be very hard to get onboard with if they're played by the wrong actor, but in this case I was happy to look past his flaws and get on-side with him.As mentioned earlier I really like a good whodunnit. They're incredibly out of fashion these days unfortunately, but 'The Silencing' is a great reminder of how well they can work in cinema. I really enjoyed this movie and would highly recommend people give it a watch.",
    "136": "Everything about this movie is \"okay\". The story, the characters, etc. are all okay. None of it is bad. But none of it is fantastic either. It does the bare minimum a good movie should do. Good acting. Good writing. Good pacing. Good filming. Good editing. From a technical, movie 101 perspective, everything is textbook and it doesn't make any huge mistakes.However, where the movie prevents itself from being very good, is in the following two things:1. Ruins one very good opportunity and turns it into a pointless plot device. Midway through, a discovery is made which raises the stakes tremendously. From that point, the film could have done something very good. But in the end it's rendered useless as the plot jumps onto something else. And the villain emerges with very unconvincing motive.2. It's a carbon-copy of a much better movie called Wind River (2017). I couldn't help but notice the similar look/feel within the first few minutes. The setting, the music and how the story opens was very similar. And much to my disappointment, the borrowing of ideas didn't stop there. The rest of the movie is practically the same. So if I could recommend one thing, is to go and watch the that other movie (Wind River) instead. Wind River is everything that this movie wishes it could be. In every department, that movie is fantastic.",
    "137": "Reformed hunter Rayburn who is living in a remote sanctuary finds himself in a deadly battle of wits against a madman whom is not only targetting Rayburn, but is also hunting young women as well. With the help of Sheriff Gustafson, Rayburn tries to find out who it is who is responsible for attacking him and the young women, but the truth may lie closer to home...The Silencing has all the right ingredients and had a lot of potential so it's a shame really to see most of it wasted in what is ultimately a rather underwhelming film. The film moves slowly and this is made worse by many of the characters who are all pretty dull and their conversations are mostly lifeless and meaningless. Rayburn again had potential to be an interesting character (with him being reformed and having a problem with alcohol which creates an odd character juxtaposition), but nothing is really done with him as a character (he's not developed or explored) and despite him allegedly being a tortured soul of sorts I could never really feel for him as a person. Annabelle Wallis is also quite a bland character with a performance to match (and I know that she can do better if she is given the appropriate opportunity).Aside from a glacial pace and a bunch of bland unintersting characters, the film is also pretty unfocused and seems to be treading along 2 different paths during the middle of the picture (for no particular reason). The direction is lackluster, the script is poor offering no real surprises and the peformances are mediocre (and that's being generous). In spite of the film advertising itself as a thriller, you'd be hard pushed to find many thrills and spills here (although it has its moments which is why I'm not rating it any lower than I have).The Silencing is far from being the worst film in existence, but it's fair to say that it is decidely bland and unremarkable.",
    "138": "Ive seen better movies on this subject/topic, and that is because there are too many inconsistencies and loud screams of ludocrisity done by the caracters in the plot. a superindependent sheriff that does the lonesome ride everywhere danger is, and the parkkeepers lack or will of communicating with police and others in dire situations, a w/t or a cell might have given some truthfulness working or not, or a simple houseline phone or better. its also hard to understand the police juristictions and the way law enforcement are dealt with, it just becomes deadwater where there are no push to be found.acting wise, and the filmographic presentation are well done, much thanks to the choice of locations and nature scenery, but the story are plotted like good old ''twin peaks'', extremely slow, and wait till next weekend to get another clue.its a film that will enerve some and make others bite nails from the nerves, the grumpy old man liked the first one third the rest is for you to decide. its a recommend anyway",
    "139": "The alcoholic owner of a wildlife sanctuary (Nikolaj Coster-Waldau) and the new Sheriff of a northern Minnesota county (Annabelle Wallis) discover evidence of someone possibly hunting girls. The former craves vengeance and the latter wants justice while questioning her troubled little brother's involvement (Hero Fiennes). Zahn McClarnon, Melanie Scrofano and Shaun Smyth are also on hand.\"The Silencing\" (2020) is a wilderness crime mystery/thriller along the lines of \"The Vanished\" (2020), but with elements of \"Kiss the Girls\" (1997). Some armchair critics are rash to point out supposed flaws, but practically everything is logically explained with a little imagination. Sure, there are movie-isms, like in the last acts of \"A Simple Plan\" (1998) and \"The Virtuoso\"\n(2021), but that's par for the course in cinema, particularly this genre.Nikolaj makes for a quality masculine protagonist and it's always a pleasure to see Annabelle Wallis. There's a surprise or two along with the formula. The fact that the melancholic story keeps you guessing is a plus, not to mention the picturesque cinematography.The movie runs 1 hour, 33 minutes, and was shot in Greater Sudbury, Ontario, which is about an hour's drive due west of North Bay.GRADE: B.",
    "140": "\"The Silence\" is a very mediocre thriller that doesn't do anything particularly well, except perhaps for Coster-Waldau's performance.The script is sort of underwritten and overwritten at the same time. There are too many characters and too many extraneous scenes. This is a thriller; it needs to be taut, without a scene wasted. It wastes many scenes, and you stop paying attention.The twists and turns were uninvolving and sometimes made little sense. There is one bizarre turn around where a previously heroic character goes bad, and then the movie seems to forget about it later. They were apparently willing to kill to protect a family member, who they believe is a serial killer?There is also a backstory for Coster-Waldau's protagonist that fails to convince. It needed to be hinted at strongly, not involved unconvincingly.",
    "141": "\"The Silencing\" is the type of thirteen-in-a-dozen action/thriller that would normally pass by me unnoticed, but I picked this one out because of the director. Robin Pront is a young prodigy director, and compatriot of mine, from Belgium. After a more than decent debut film (\"The Ardennes\") and ditto TV-series (\"Thieves from the Woods\"), this was his first adventure overseas. I don't know if \"The Silencing\" was well-received or not, but meanwhile Pront already returned to Belgium to make the awesome and tremendously successful blockbuster \"Zillion\". I'm sure he will return to the US for more films.As said, \"The Silencing\" is largely unremarkable, but that certainly doesn't mean it's bad. Quite the contrary, the script contains a handful of unexpected (albeit implausible) surprises and twists, and there's tension throughout. I read comparisons between this film and \"Wind River\", but that is obviously too much honor. Sure, there's the common (and depressing) theme of the unjust and miserable living conditions of Native Americans, but here it's merely the footnote. The main story is about a grieving father searching for the serial killer of his daughter.There's action and suspense, good performances from a largely unknown cast (unknown to me, at least) and a creepily disguised killer who uses an ingenious weapon to hunt down defenseless young girls through a wildlife reservation. How many thrillers have you seen in which the killer uses an atlatl (primitive spear)? That alone makes \"The Silencing\" worth seeing.",
    "142": "\"The Silencing\" is an Action - Thriller movie in which we watch a father trying to find the man behind the kidnap of his child while he has to deal with his addiction in alcohol. Soon he will realize that his daughter was not the only victim and he has to do his best in order to find that man.I have to admit that I did not have high expectations from this movie but I was happily surprised by it because it was not only a nice and interesting movie but it was more than this. The direction which was made by Robin Pront who is also the writer, it was very good and I believe that he did an excellent job on focusing and presenting his main characters problems, history and goals. This had as a result to make us not only relate to them but also to feel that we are a part of it, something that made his movie far more interesting. Finally, I have to say that the interpretations of both Nikolaj Coster-Waldau who played as Rayburn and Annabelle Wallis who played as Gustafson were very good. I highly recommend everyone to watch this movie because it is a nice thriller with a simple but interesting plot and some very good interpretations.",
    "143": "I need to see that girl.\nShe could be my daughter.It's always nice to see how actors from a successful television series cope in a feature film. And especially if the genre is quite different from what they played in that series. Here Nikolaj Coster-Waldau makes a decent attempt to show that he has more to offer than playing a king's son who prefers to perform gymnastic exercises with his sister between the sheets. His performance here is on a similar level to that of Jaime Lannister in \"Game of Thrones\". Convincing enough, but not exactly of exceptional quality. A role that doesn't annoy you. But every time you see his face somewhere, you have to think for a moment where you know that face from. This is also the case here in \"The Silencing\". I was like, \"Damn, where do I know this guy from?\". Only after fifteen minutes or so, I could figure it out.\"The Silencing\" itself is of the same level. Certainly not a bad movie. But also not a movie that'll blow you away. The story felt a bit incomplete to me. There were some improbabilities (not to say completely nonsensical decisions). And the denouement with the disclosure of the perpetrator and his motivation, I personally found a bit far-fetched. The film had something \"Silence of the Lambs\"-ish but then set in an extensive, forest-like nature reserve. An area managed by Rayborn Swanson (Nikolaj Coster-Waldau) that has been given the name \"Gwen Swanson sanctuary\". A reference to his daughter who has been missing for 5 years. It's a place where animals can live undisturbed and protected, far from hunters and poachers. Rayborn lives an isolated life far from the civilized world. A way to silently grief about the loss of his daughter. Usually by consuming liters of alcohol. A bit strange because that's exactly what caused that disappearance.The story gets a little bit more exciting the moment a serial killer comes into the picture. Someone who probably watched \"The Hunt\" too much. What follows, is a cat-and-mouse game with the participation of the local female sheriff Alice Gustafson (Annabelle Wallis, series-loving fans will recognize her from \"Peaky Blinders\") who herself has her hands full with the stupidities her little brother Brooks (Hero Fiennes Tiffin), a drug addict with a traumatic past.Without a doubt, this could have been a much better, coherent movie, provided the script was changed a bit. It's linked together with hooks and eyes. Full of coincidences and ridiculous twists. Decisions are made that are too ridiculous for words. Alice's surprising action at one point is understandable on the one hand. But on the other hand completely unreal. And the indifference that those involved show afterward as if nothing had ever happened, made me frown for a moment. Rayborn's paint pot trick seemed so absurd and stupid that I spontaneously burst out laughing. Not exactly applicable to a serious thriller about a serial killer.\"The Silencing\" isn't so great. A mediocre piece of movie. Actually, you could say that you've seen it all before in other movies. And much better movies too. Cinematographically it looks professional (despite the low budget) and the general mood is also good. But, when you love watching exciting flicks with nerve-racking suspense, you'll be disappointed. The only thing I can't say anything wrong about is Nikolaj Coster-Waldau's acting. Solid and constant. Just like in \"Game of Thrones\". Again a pitiful persona. But I'm sure I won't recognize him in his next feature. Once again.More reviews here: movie-freak.be",
    "144": "This is the synopsis found on IMDBA reformed hunter living in isolation on a wildlife sanctuary becomes involved in a deadly game of cat and mouse when he and the local Sheriff set out to track a vicious killer who may have kidnapped his daughter years ago.When I read in a synopsis that someone is involved in a deadly game of cat and mouse Im almost always automatically suspicious. It's a tired , over used description to make a dull film sound exciting and while I wouldn't go as far as to say The Silencing is dull , the synopsis does make it sound better than it is.Nicolaj Coster-Waldau is doing his best to cash in on his popularity after Game Of Thrones and he's not doing a bad job at all. He was great in Shot Caller and has a few films ready to be released in the next twelve months .\nHe's definitely the best thing about this movie. He's totally believable as the alcoholic father who has lost his daughter, it's just a shame that Annabelle Wallis is totally miscast as the Sheriff.\nCaked in make up , she swans around in a police uniform looking totally out of place .The action is few and far between , it's more of a character study than an action movie .\nThere are many plot holes and unanswered questions in the film but it's probably best not to question the poor decisions of the characters if you are to enjoy this . It's not unlike an adult version of Scooby Do ! You just have to guess who's going to be unmasked as the bad guy .Overall it mildly entertaining as well as lazy at times but it's probably worth watching for Coster-Waldau's performance alone .",
    "145": "The silencing tells the story of a reformed Hunter named Rayburn(Nikolaj Coster-Waldau)who owns a hunting sanctuary after losing his daughter five years ago. He's become a recluse but as soon as the body of a young girl is found. He confines in the Sheriff(Annabelle Wallis) looking into the case, matters only get worse when he notices on his security cameras young girl being pursued by a camouflage figure. This movie screams your basic premise of Cat and mouse routine but it does have it moments throughout the film but are not consistent. Rayburn characters the highlight of the movie he makes decisions that make you question his actions the whole time falls under the category cliché he pursues to try to chase a stranger off but as soon as he starts shooting and actually wounds him. He doesn't feel it necessary to call the cops. For his daughter being the main focus and drive for him' you really don't know anything about what she was like prior. There's one scene with him and his daughter the way it plays out you don't really buy it, coming to that conclusion. Sheriff Gustafson comes off as if she's going to be an interesting character without spoiling it's just just say that they find a quick way to ruin his character that you are not opened to anything she has to say for the rest of the movie. It doesn't help that for the first 30 minutes This movie feels more of a slow burner you really just get a bunch of scenes of the sheriff going around investigating which doesn't seem realistic because they're like no other cops with her. But it does keep you invested in Rayburn finding his daughter.",
    "146": "What makes The Silencing an unpleasant experience, even though the movie has such a strong premise? Read to find out.In The Silencing, we follow former hunter Rayburn, now a recluse living solely to protect the nature, a repent act for his unacceptance on his daughter missing, 5 years without answers. His life is surprisingly an acceptable mess: he is organized, but he is an alcoholic. Meanwhile, someone, for no reason, has started killing seemingly random girls on the nature area that he protects.First plot hole: the serial killer is now using Rayburn's territory to hunt down their prey. No apparent reason other than just being convenient to the plot. Rayburn protects his area with cameras and diligent searches; if the killer was using the area before - and we get back up evidence that the killer is at his doings for a while, - then Rayburn and his dog would definitely have caught evidence sooner, way sooner.In the middle of this mess, we have rookie Sheriff Gustafson trying to solve the murders. Trying is a good verb here, Gustafson is really just going around asking questions. I get it this is some detective work, but most of her exchanges are \"do you know about x? No? I'll be in touch.\" Unamusing.Now, why is this movie called The Silencing? Well, because of a very specific detail that doesn't even play a major role in the movie: the killer silences his victims, literally. The killer does this surgery to prevent their prey from speaking. And this is a mind-numbing fact because any decent policework would have worked with this fact: search for people that have a medic, surgeon, even if in animals, background. However, the investigation is focused on the fact that the killer users a freaking old-style arrow propeller.There is also this pet-peeve with Gustafson's brother, Brooks, that plays out funny. Brooks arc is just exploitation.Overall, mess of a movie that not even wraps up on Rayburn's arc. We end with an ambiguous dissatisfactory ending that doesn't resolve Rayburn's internal conflict: his alcoholism, a major flaw that led to everything this movie bases itself on.Not recommendable.",
    "147": "I have to be honest I quite enjoyed my time watching this movie. The pacing was good, main characters was a really in depth, interesting guy and it was massively entertaining.So the plot: the plot does have a few negative features (as most films do). I thought the \"twist\" was a bit underwhelming in all honesty, I felt they could have gone in a different direction or added so much more to it! I thought the side characters were a bit too bland. Served little to no purpose throughout and they just weren't interesting enough. I understand you can't add depth to a shorter movie, but they gave us nothing.However, as mentioned at the top. The main character is fantastic. Has a lot of good depth to him, he's someone you can firmly get behind and he really does a fantastic job performance wise. The pacing of the plot was also really well done! For an hour and a half film none of it felt rushed and when it ended you felt a sense of satisfaction. It's definitely a movie that keeps your attention throughout!Is this a movie that will blow you away? Probably not. However it certainly isn't a bad film. I would say 6.5 seems more justified if anything, but since I can't give that as an option I'll round up to 7. It's a nice crime thriller that really peaks your interest and keeps you entertained throughout.",
    "148": "Coster-Waldau's acting was great. May be his best performance ever. I related to his solitary life in repentence and loved the idea of Thor the dog watching the screens.As plot twists are easy to create, I pay special attention to organic developments in the story that provide us with unexpected scenes. And this movie had one such scene in the middle of it. The way four major characters handled their encounter at the cabin was notable as the momentary decision by the cop was a genuine surprise. That scene alone elevates the whole experience.Still, I'm not totally bought on the motivation and the origin story of the killer. Something's off, or at the very least missing there. Why the silencing? Have they edited out a couple of scenes?Besides, it's a small community and the long running rites of such a serial killer does not seem to compute with how the setting is pictured.Our protagonist does not have a phone, okay. But he has a radio. Why did he not call the sheriff upon noticing the prey/girl? The way he kept acting alone at times could have made sense if it was just between him and the killer, but there was the girl out there to be saved. Also, on other occasions, like his search for the black truck he marked, what motivated him to act alone?A well-to-do guy should have his own truck, right? Are we supposed to believe the killer took the extra risk of keeping up with his hobby as he drove the neighbor's car?These are all bugging questions and I'm surprised they were not eliminated before the release of the film.I don't know why they haven't made it even better (as it looks quite possible to do so) but hell, I did enjoy it, and my nit picking serves only to drop a hard 8 to this 7 I'm givin' it.",
    "149": "The SilencingI enjoyed this movie, it was in the main a simple linear pursuit movie with a few twists. Nikolaj Coster-Waldau as Rayburn was perfectly cast as the brooding revengeful father losing himself in an alcoholic oblivion of Red Wing whiskey following the disappearance of his daughter.The cinematography was great and the action sequences were shot with real drama.The whole ensemble were fully committed and worked through the plot that had a few holes we will overlook, as everything was sacrificed for the driving impetus of \"who done it\".The music was great but the real star of the movie was the natural beauty of the forest."
}