{
    "0": "Tim Allen is a marvelous comic presence. But this all belongs to the producers and creators of this film. The script allows for an explanation why Allen becomes Santa Claus. He inadvertently causes the old guy to fall off the roof and the \"clause\" in the contract forces him to take over the job. He must put on the suit. What happens after this is the integration of Allen into the Santa Claus routine. He begins to get chubby. He gets rosy cheeks. The whole nine yards. He is taken to the North Pole after learning to drive the sleigh. He gets good at distributing presents. The hang up is parental rights to his son, Charley. Judge Reinholdt is the humorless new husband of Allen's former wife. The crazier Allen appears, the more it plays into Charley being kept from his father. An elf named Bernard (who has a Bronx accent) is Allen's right hand man, and he orchestrates things the way he wants them.",
    "1": "This is one of the few movies that the Wife and I ALWAYS try to watch on Christmas Eve, it's become somewhat of our tradition. I absolutely love this movie and the \"realism\" that it adds to the Santa Claus character. I'm sure in time this movie will do as all movies do and age badly, but until then I will continue to enjoy it's fun filled romp of magic.",
    "2": "The Downer Debbie's and Negative Nathan's reviewers are hilarious. These viewers are a lot of fun at Christmas parties, not.This viewer enjoyed \"The Santa Clause\" not because it's a great movie. This viewer enjoyed it because it's a fun movie. Tim Allen's character, Scott Calvin, took a little getting used to himself becoming Santa so that's probably why he was a bit grumpy at first.TSC is a fun movie just because it's fun. Period. Watch it in the spirit it's meant to be viewed. Have fun with it. Tim played a great Santa Claus. He made it believable.",
    "3": "The Santa Clause (1994)This movie is a holiday classic. Tim Allen is really funny, and the movie is non stop entertaining and fun. This is one movie that I can watch over and over without getting bored, at any time of the year. Simply a holiday classic. Great for the family. 10/10!",
    "4": "I really liked this film, it is very funny and pleasant. Tim Allen gives a truly amusing performance as Scott Calvin, who replaces Santa after he falls off the roof. The plot is original, the script is fun, and the pace is surprisingly even. Don't expect a classic like Scrooge(1951), the first 2 Home Alone movies or It's a Wonderful Life, just expect a pleasant family Christmas film, that way the whole family is in for a good time. The film is directed with careful precision, and the characters are likable, though I did find the parents a tad too clichéd and the film a tad too overly sentimental in places. If I had a favourite character, I think it was Judy, there was something about her truly infectious smile that made me warm to her. All in all, well above average and highly recommended. 8/10 Bethany Cox",
    "5": "You are a Grinch of you don't like this movie. A true Christmas classic.",
    "6": "Really good Christmas movie. Not as good as die hard though",
    "7": "THE SANTA CLAUSE, in my opinion, is an absolutely hilarious Christmas flick! I thought that Scott (Tim Allen) was a very funny guy, although he wasn't very jolly when he was first recruited to be the new Santa. Even so, I laughed really hard when he said, \"Yeah, same to you, and that's not very ladylike,\" \"Nice teeth,\" and, \"It felt like 'AMERICA'S MOST WANTED!'\" I also laughed when he imitated cats and dogs fighting. Oh, man, those parts were funny! Before I wrap this up, I'd like to say, \"Tim Allen has scored huge!\" Now, in conclusion, if you are a fan of Tim Allen, and you haven't this absolutely hilarious Christmas flick, I highly recommend it, that is, if you haven't seen it.",
    "8": "I remember the first time I saw the trailer for The Santa Clause. It was during the previews for The Lion King. As soon as the camera panned up from the snow globe to reveal Tim Allen, all the people in the theater began to laugh. This is a great, wholesome, funny flick that grown-ups and kidlets both can enjoy. Tim Allen was perfect to play the dad who becomes Santa, and I love when he burned the roast! I also thought the actor who played Bernard the elf was very funny and stole every scene he was in. And I especially enjoyed Judge Reinhold's turn as Neal Miller. I love the scene where he finally gets the hot dog whistle he'd wanted since he was a kid! Great holiday fun!",
    "9": "This film may be one of the greatest Christmas films of all time its soo good that its soo fun to watch. Its a very rewatchable film and very enjoyable. You need to watch this film it soo good and the film has a alot of comedy. Tim Allen acts out as Buzz and now Santa.",
    "10": "With great, funny holiday flicks like \"The Christmas Story\" and \"National Lampoon's Christmas Vacation\", \"The Santa Clause\" is next on line to add laughs as the common sounds of Christmas other than jingling bells! Tim Allen is great in his movie debut as Scott, a toy salesman that owned the roof where Santa Claus fell from to his death! So in pleading cries from his young son,   Scott puts on the late jolly-old-elf's suit and instantly becomes Santa, which insues problems to him, his ex-wife and her new boyfriend (played with annoying sarcasm by Judge Reinhold) and Scott's son. That's where the real chaos starts! > \"The Santa Clause\" is a great flick to watch on Christmas Eve. True, it can get too sentimental at times (Scott and his wife are battling for custody of their son. Remember \"Kramer Vs Kramer\" and \"Over the Top\"?!). But that surely fades away thanks to Tim Allen's antics. It'll make you wonder if Santa really is that clumsy!!",
    "11": "\"The Santa Clause\" isn't laugh out loud, roll on the floor comedy; it isn't old-fashioned \"It's a Wonderful Life,\" romance. Nope. It's an original '90s style Christmas story that tugs at your heart strings, and reminds you that we were all kids once. It reminds you of those days when you dreamt of Santa... when you stood in line waiting to sit on the jolly elf's lap... your knees shaking... as you tried to memorize what you were going to ask Santa. Anyone who isn't touched by this movie should look for the little boy or girl inside, and remember the Christmas Eves when you listened for the clatter of reindeer hooves on the roof. If you have no such memories, you may not understand this movie. Thumbs up to Tim Allen and Judge Reinhold! Thanks for the happy tears!",
    "12": "I remember when I saw \"The Santa Clause\" in the theater. I liked it but I didn't know how much this movie would grow on me over the years. \"The Santa Clause\" is a very funny, very warm movie. It's the first part of a very underrated trilogy. The cast of this movie is perfect and they all do a great job. I never really gave any of Tim Allen's t.v. shows much of a chance. However, I'm a big fan of his films. Allen is very likable and very funny in \"The Santa Clause\". I'm not so sure another actor could have pulled this movie off. \"The Santa Clause\" is a great Christmas movie and I watch it every year.",
    "13": "i liked this movie ever since i was little..it was funny and it had a lot of fantasy and good acting by all the people that played in it...it had comedy, fantasy and it was just a good movie to watch for christmas, or any time of the year!",
    "14": "A passable story, we must admit, but at least it entertains a lot, and makes us enjoy a Christmas story in a familiar way, something different from what we normally see in the Films. Here is a quite entertaining and beautiful family comedy, in which the protagonist, after a terrible accident, ends up with Santa Claus throwing him from a roof, and now he must become him. History passable, obviously, and also quite predictable, hence my note, but we must recognize that it could not be done better, since the movie is simply passable and already this, does not contribute anything, except for some laughter and some drama. A Christmas film that I recommend to see as a family, and above all, to see it with young children, since it will be above all to them that it will look like an excellent film, even if it looks like a loose film to us. I recommend it.",
    "15": "Love Tim Allen as the Santa Claus. Great family Christmas movie",
    "16": "You have to believe, if you expect a Hollywood epic you're watching the wrong movie and would recommend a different movie. This is exactly the right movie for Christmas and fantasy, it's sincere and funny in all the right places. Fire up the fireplace make some popcorn curl up in front of the tv, you can't go wrong.",
    "17": "I used to watch this as a kid on Xmas eve and it brings back so many memories. 100% Christmas!!",
    "18": "I really enjoyed this movie.  It was heart-warming and fun to watch.  I remember as a child watching my favorite Christmas movies, such as the Grinch that Stole Christmas (cartoon), Miracle on 34th Street, and the classic Scrooge.  This movie was so full of fun and warm fuzzies, and PERFECT for the holiday season, that it has easily earned its way into the holiday film montage for my family.",
    "19": "Must watch each year !!!!! The best holiday movie to watch with your family",
    "20": "I just saw this movie again after a few years away. It's an entertaining film. Tim Allen is essentially Tim Taylor in a Santa suit (it's a good thing he can live forever off \"Home Improvement\" residuals because he'll never be known for his range). But he fits the bill here, as a businessman slowly being transformed into St Nick despite desperate attempts not to. The only thing about it that bugged me was the way Santa was offed in the beginning-can Santa really die from falling off a roof? And wouldn't they be just a little bummed out at the North Pole-after all, Santa just got bumped off!! It seems like that could have been handled a little better, but overall a good Christmas movie, even with an attractive kid who doesn't make you want to go screaming from the room",
    "21": "The Santa Clause is amazing! It's a great heart-felt Christmas movie with a terrific cast! The comedy is hilarious and the Christmas aspect is gorgeous.\nThe only part I didn't like was the whole police scene and the elves saving Santa. It just kinda lost me.\nThis movie is special!",
    "22": "Really good Christmas movie that hits all of the Christmas feels. Really funny heart warming movie that is perfect for all the family. Characters cast perfectly.",
    "23": "Scott Calvin (Tim Allen) is a loud mouth weasel toy executive. He's a divorced father to Charlie who doesn't particularly like him. Charlie is told that Santa doesn't exist by an older boy. Then on the night before Christmas, Santa falls off of their roof, and disappears leaving behind his suit, reindeers, and sleight. Under pressure from Charlie, Scott puts on the suit and becomes the new Santa.Tim Allen plays a lot of these Scrooge characters. It's great when he learns to be a better person. That's what we get a lot of from this movie. There is some fun as he becomes Santa over time. David Krumholtz is great as the annoyed Bernard the Elf. And the North Pole has a toy store sort of charm.The movie doesn't have any big laugh. It's more of a mild charming cute movie with a few chuckles. It's a good family movie on that level.",
    "24": "This is a pretty good Christmas classic that spawned two good sequels. I saw this when I was a little kid back in 1994. I loved it. Now that I saw it again sixteen years later, it may have lost some magic on me but I still enjoyed it immensely. Tim Allen is a good actor despite what some people say.This is about how Scott Calvin, a divorcée dad, becomes the new Santa Claus. Once he accepts his new role, he has the impossible task of telling his family.I think Tim Allen was pretty good here. I know he's not the best actor, but he's still pretty decent. I was happy to see Wendy Crewson and Judge Reinhold.Overall, this is a good Christmas tale that is wonderful to show during the holiday season. I'm going to see it and the two sequels every Christmas. I rate this film 8/10.",
    "25": "The banter between Scott (Tim Allen) and Neal (Judge Reinhold) is comical in this movie. Tim Allen does a good job taking the reigns of Santa here and his character has a nice arc. Definitely a good, solid, fun family movie, and one that is watched around the holidays in my house.Final grade: 8/10",
    "26": "Yes, Santa Claus does die in Santa Clause. It is need for the plot of Scott Calvin (Tim Allen). Scott Calvin is spending some time with his son Charlie on Christmas Eve when he hears something on the roof. It turns out to be Santa Claus whom Allen's character accidentally kills by yelling at him. Santa Claus lost his footing and fell off the roof to his death. Surprising, the movie is very okay with showing death so heartily. There is something wrong with that. There was no mention of whom the guy was, or anything. He's dead, and that's all we needed to know. Scott Calvin finds himself responsible for resuming his duties. At the North Pole, the main elf Bernard tells Scott that according to the \"Santa Clause\" law, is now required by law to take on Santa's identity. After Charlie tells his mom and child-psychologist stepfather Neil (Judge Reinhold), they're convinced that Charlie has been warped by his dad. While the movie treat Neal who takes a doubtful position on Santa's reality not into a jerk like other holiday films nor does the ex-wife is a love interest. Months do pass and Scott transforms into Santa, until court hearings decide that he's nuts and cut off his visitation rights. Another December 24 approaches and Scott must convince his employers and ex that he's not crazy, and that he is Santa Claus. The premise for \"The Santa Clause,\" written by Leo Benvenuti and Steve Rudnick and directed by John Pasquin, is a clever one, and the movie is not without real charm. The Santa Clause launched Tim Allen in the movie business, spawned two sequels, and did so much for the holidays. It had great storyline with great characters. Aided by excellent special effects, he really does look like he's changing to St. Nick. The movie has the funny romp through the misadventures of an average man trying to cope with his unexpected transformation into Santa Claus. The jokes about him changing are just as funny for adults as for kids. The movie also has depth in the relationship of father and son who love each other during custody hearing. Still some people may be disappointed that this movie overlooks the religious significance of Christmas in favor of present-giving and childhood wish-fulfillment, but the movie ends on an appropriate note of good will and reconciliation. The child actor playing Charles (Eric Lloyd) is just annoying who whines his way unconvincingly throughout the film. Still Charles was able to explain some Santa Claus questions when judged by Neil. I like how the film tackles the Santa Claus questions to the myths by an intriguing theory, handled in a throwaway line of dialogue, to explain how Santa is able to do what he can do. One thing that needs to be mention is about the presents magically appears under the tree. It's one of the biggest plot holes; every parent turns a blind eye to the extra presents under the tree. In the film, Santa is real, but the adults don't believe he is real, how can they think he's not real exactly when toys just magically show up. Sadly this is my opinion, the first and only good Tim Allen movie role besides voicing Buzz Light year in Toy Story. He could have done better, as the sequels to this are not that great. It's a great watch, but probably only good watching it once in the holidays.",
    "27": "I was the target audience for this movie when it came out, and I've just re-watched it in my thirties and it's still an absolute belter.Everything a good kids movie should be. It's unrealistic and follows no logic at all, has rubbish jokes, a couple of adult references no child would get, and loads of warm and fuzzies.Anyone who gave this a low rating clearly never made it onto the nice list, and is just a grumpy old miser with silly expectations of a children's christmas movie. (If you've watched the movie, they're a Neal)",
    "28": "Went as a child to the movies to watch this. Years later and I now watch this with my own kids. Just a lovely Christmas movie for all the family.",
    "29": "A satisfactory Christmas film.'The Santa Clause' starts off pretty strongly, with Tim Allen (Scott) showing off some quick and amusing wit. The early moments are actually the best parts in my opinion, the rest of the 97 minutes are enjoyable enough though.Allen is easily the most standout part of the film, none of the other cast members really come close at all. Eric Lloyd does an alright job as Scott's son, Charlie. The festive music is pleasant, while the sets etc. look decent - the special effects aren't incredible, but are certainly serviceable.Many better Xmas productions out there, but there's enough here to feel entertained by.",
    "30": "One of the Best Christmas Movies that I have ever seen in my life. Picking Tim Allen for the part was the best move that they have ever done. I just wish that there was more parts made with Charlie keeping the Family Business going. The one Christmas movie that me and my Family watch every year. Thank you for making it and helping us enjoy Christmas every year.",
    "31": "He plays Scott a divorced dad who's ex-wife and her boyfriend are going to be married and how they must break it to their very young son Charlie that Santa is not real.As Scott as he gets an unexpected visitor there only to leave with just a sleigh and reindeer there. Also telling Charlie Santa is not real but that it changes his mind when Scott thinking that Santa is an imposter but finds out that Santa is real and he is injured.Scott is forced to take his place or Christmas is ruined and while at it he bounds with Charlie there. Tim Allen became a movie star there.",
    "32": "***POSSIBLE SPOILERS*** \"The Santa Clause\" is a delightful, funny, and pleasant deviation from your typical \"Santa Claus\" story. Scott Calvin (Tim Allen) is a perfectly ordinary man who sells toys, dines at regular restaurants, and is incredulous about the spirit of Christmas. That is, until one magical Christmas Eve, the real Santa plummets from his roof and he is coerced into fulfilling the responsibilities as Santa Claus, an offer he simply cannot refuse. So ensues a calamitous, misadventurous night for Scott Calvin and his innocuous son Charlie, of delivering presents all around the world with exhaustion, only to conclude the evening at the North Pole, full of curious and inquisitive little elves who serve Scott and Charlie chocolate milk, dress them in royal pajamas, and stress that if Scott does not assume the role of Santa, then children throughout the world will be devastated. It can't be easy being the man in the red suit, especially when your personality doesn't satisfy the duties required. From Christmas Eve on, Scott Calvin experiences a marvelous transformation- from his appearance and appetite, to his tendencies and even language, to become a suitable Santa Claus by the following Thanksgiving, while being scoffed and threatened by \"the outside party\" (e.g. his former wife's fiancée, a psychiatrist frequently offers him \"therapy\"). For the most part, \"The Santa Clause\" is an endearing, delightful, and fruitful family comedy. There are some significant flaws, however, such as: the tone frequently going from jolly and refreshing, to depressing and melancholy, from the realms of the North Pole, to the doldrums of the adulterated society. This kind of deviation is perhaps too serious and even discouraging for an innocuous Christmas comedy- and why would everyone who disbelieved in Santa Claus be so inclined to destroy Scott Calvin, for his harmless spirit and whim? Fortunately, by the end, it seems everyone has developed a newfound spirit towards Christmas and Santa Claus, through the convenience of witnessing Santa riding to the North Pole- and all is ended well: \"A merry Christmas to all, and to all a great night!\" This is a mostly enjoyable Christmas comedy that is heartwarming, funny, and endearing, and definitely worth catching around the holidays. Some inspiring words from an elf: \"Just because you don't believe in something, doesn't mean it isn't real\". If only we could be so innocent and resigned, celebrate our imaginations and fantasies, and believe in the spirit of Christmas! *** out of ****",
    "33": "The Santa Claus is a completely original holiday movie that's both heartwarming and funny. It's a movie you can watch every single year for Christmas.",
    "34": "I had never truly understood the meaning behind the spelling of the word Clause in the title, so with all the sequels being shown after this original during Christmas I decided to watch this once again, from director John Pasquin (Jungle 2 Jungle, Miss Congeniality 2: Armed & Fabulous). Basically Scott Calvin (Tim Allen) has been divorced from ex-wife Laura (Wendy Crewson) for some time now, and though she is married to a slightly annoying Dr. Neil Miller (Beverly Hills Cop's Judge Reinhold), he still has access to his six year old son Charlie (Eric Lloyd). Still a big believer of Santa Claus, Scott doesn't want to upset Charlie, and on Christmas Eve there is an unexpected visitor, and shouting up to the man in the red suit, Scott unintentionally causes him to fall off. Charlie comes outside and sees that his Dad has seemingly killed Santa Claus, a supposed identity card confirms who he is, and there is a note saying that he should put on the coat and take over the sleigh and reindeer. So with Charlie urging him on, Scott does indeed put on the red coat and is taken from house to drop off the hundreds of presents to houses far and wide. Eventually the delivering is over and they are taken to the North Pole and the workshop of many elves, who admittedly look like children but are working very hard for next year. Lead elf Bernard (David Krumholtz) tells him that because he put on the red coat he is now taking over all responsibilities, this is the Santa Clause (a law contract or regulation, you would get one with a divorce), and he is now the new Santa Claus. So not long after returning home for the remaining year before December approaches, Charlie is still insisting to everyone that his father is Santa Claus, while Scott develops the big guy attributes, such as the white hair, a beard that won't go away and a big gut that won't be slimmed. Eventually he has truly become Santa Claus and there is nothing he can do about it, so he accepts his responsibility, and returns to the North Pole ready to steer the sleigh and reindeer. There is a point when Laura and Neil tried to stop Scott seeing Charlie, and the police get involved with finding Santa Clais, but in the end, everything settles. Also starring Larry Brandenburg as Det. Nunzio, Mary Gross as Miss Daniels, Paige Tamada as Judy the Elf, Peter Boyle as Mr. Whittle and Judith Scott as Susan Perry. I didn't realise this was the first feature film Allen starred in, a good debut as a Scrooge like working father with quite a few sarcastic comments, and it of course led him to become the voice of Toy Story's Buzz Lightyear. The story is filled with some clever Christmassy reference, many funny slapstick and sentimental moments you've come to expect from Disney, all in all, a fun for all the family seasonal fantasy comedy. Worth watching!",
    "35": "This is a movie that I enjoy because of the humor. I don't know if I should give the majority of the credit to Tim Allen or his scriptwriters because I get a good chuckle every holiday season. Some days I still wish I believed in the magic of Christmas...",
    "36": "The Santa ClausE is everything a Christmas film should be. It is certain to get you into the Christmas spirit. When thinking about the all time great Christmas films, this absolutely needs to be in the conversation. This movie might even be on the Mount Rushmore of Christmas movies. It's funny and it's not just for kids. All ages will enjoy this film. Tim Allen is great as Scott Calvin and the young actor that plays his son, Charlie is tremendous, he delivers every line very convincingly, which can sometimes be hard for child actors, but not here. The Santa ClausE will almost certainly get you into the Christmas spirit and will make you believe in Santa Claus again and again.",
    "37": "The Santa Clause films are a great and wonderful series of films that are excellent to watch around the holidays! The Santa Clause stars Tim Allen, Wendy Crewson, Judge Reinhold, Eric Lloyd, Peter Boyle, and David Krumholtz. Tim Allen is excellent in this film. He's hilarious and a very realistic character. Peter Boyle is good in this film in a brief role. Crewson and Reinhold are good in this film together. The comedy scenes are very funny and the Santa Clause special effects are very good. The music is good as well. Really every thing is fine in this film! If you are looking for a great Christmas film and if you like the cast mentioned above that I strongly recommend The Santa Clause!",
    "38": "Cynical businessman and single dad Tim Allen gets to be the new St. Nicholas after the actual Santa Claus takes a spill Christmas morning. Thin holiday confection from screenwriters Leo Benvenuti and Steve Rudnick is fairly tolerable until the desperate third act (featuring a police search for Tim's missing child). Allen, then a popular TV fixture on the hit sitcom \"Home Improvement\", easily carried his Everyman appeal onto the big screen with this sugar-coated perennial. The success of the film was not inexplicable, however the results are not particularly witty or inventive. Kids enjoyed it at the time, but of course; the humor is purely television (without the interruptions). Followed by two sequels. ** from ****",
    "39": "Scott Calvin(Tim Allen)is a depressed divorced dad that resents his ex-wife Laura(Wendy Crewson)marrying the child psychiatrist(Judge Reinhold)of his son Charlie(Eric Lloyd). After hearing a clatter on his roof, Scott startles an intruder, Santa Claus, who falls to his accidental death. Because of an unknown technical clause, he inherits the duties of Santa. Scott gains a massive amount of weight and rapidly grows a white beard and reluctantly transforms from a Scrooge to Santa Claus. This all creates a problem for young Charlie, because he knows his dad is Santa...but his step-father insists there is no Santa Claus. Sitcom star Allen makes his movie debut in this family friendly comedy. Pretty corny, but assuredly the younger the viewer the more enjoyable THE SANTA CLAUSE is. If you are not a Tim Allen fan this will fortify your opinion. Also in the cast: David Krumholtz, Mary Gross, Peter Boyle, Joshua Satok and Larry Brandenburg.",
    "40": "Wonderful Christmas film, Tim Allen is a great Santa and Charlie's faith is inspiring. Great cast great costumes CG isn't great but it's the 90's.",
    "41": "Ever since I was a little girl, The Santa Clause has been my favorite Christmas movie. Maybe I'm in the minority but I think I may have had a bit of a dad crush on Tim Allen...hahaha! I life the message of this movie and the father-son relationship between Scott and Charlie. I also love all the chaos that ensues. Perhaps it's because Christmas is my favorite holiday, but I could watch this movie any time of the year. I can never get sick of this movie and it always brings a smile to my face. With that being said, I do think that parents should be careful with children watching this movie. Maybe it's because I had an overactive imagination, but I actually took this movie very seriously. Maybe it was because of my age but when I found out the truth, I felt very hurt. This movie made me believe that a man named Scott Calvin really was Santa. I also learned to spell Santa Claus wrong because I've it. I don't remember believing that I could get a new Santa by pushing him off the roof though. Maybe that's what so special about this movie, it will remind us of our childhood hopes and dreams and make us believe in the magic of the season. Either way, I will continue to watch this movie every year no matter the season to keep the spirit of Christmas alive. 10/10",
    "42": "I hope Disney has moved on from this sort of thing. For some reason, I think they have, making a little more solid \"family films.\"This turned out to be yet another modern-day \"family film\" that had all the typical Disney features: a story based on a character who lies frequently; a number of subtle sex jokes (such as obscene telephone numbers), a snotty and unrealistic lead kid who uses an unrealistic vocabulary and is shown to be more mature than his bumbling Dad. (Intelligence, loving fathers are never found in these PC fiasco's). And, of course, we have the divorced family: the only kind Hollywood knows.Other than that, it's a nice holiday family film!",
    "43": "Did you forget to take your meds? Seriously reporting you though.Love Tim Allen and love this movie! One of my favourite christmas movies!",
    "44": "Movie is awesome, a must-see every holiday season! Good for the entire family, great storyline, great PG humour, Tim Allen delivers a great performance. The kid needs some work with his acting, but other than that, the North Pole, the magic of Santa, just classic.",
    "45": "An excellent, well thought out film that is the perfect way to kick off the holiday season. Get the family together, make some hot cocoa, and gather around the TV, and enjoy the wonder. Oh, one more thing, avoid the sequels, number two and number three are abominations!",
    "46": "i thought his movie was quite good.it's loaded with some great laughs,it's heartwarming,and it's original.Tim Allen is in fine comedic form here,way back in 1994.this is truly a movie the whole family can enjoy.the jokes are appealing to both kids and adults.my sister and both laughed quite hard more than a few times.the movie moves at a quick pace,so you don't really get to know the characters that well.but for this movie,that's OK.you get all the information you need for the story.it's also nice to see a movie like this that isn't preachy.sure there's a message,but it's subtle,and not the main focus of the film.for me,the Santa Clause is a 8/10.",
    "47": "I definitely give a few stars for nostalgia. This movie would always be playing in my house around the holidays. It checks all the boxes necessary to be a Christmas classic. Tim Allen is a crack up! A must watch if you are in the holiday spirit!",
    "48": "I have seen this movie several times, and as I am writing this I am watching it with my family once again. With a holiday movie, it's best to turn off your brain and just enjoy--and on this level, this is an excellent film.",
    "49": "The Santa Clause is all around the perfect family Holiday film. I don't mean to imply its a perfect film because it is of course silly, implausible, full of product placement (good ol' Disney), but its also sweet and fun and magical. Watching our main character's transformation into Santa is easily one of the most memorable in Christmas film history. The movie really has everything you could possibly want from a Christmas film right from square one with familiar Christmas classics, a middle aged divorced father more concerned with his career than his family, Santa, presents, North Pole, elves, magic...you name it. It is all here. There is also a ton of hidden little Easter Eggs (pardon the pun) in the film from Mickey Mouse's hidden face in the moon to elves hiding amongst the humans throughout the movie. Its a fantasy adventure comedy that kids will absolutely adore and adults can still smile even if its a guilty little pleasure. Best of all the film is full of magic and morals and is squeaky clean save few a couple of stupid fart jokes in the beginning (I hate fart jokes but they are there for better or for worse.) Tim Allen blew everyone away with his comedy on Home Improvement in the 90's and with this film he proved his chemistry could translate to the big screen. Allen really is fantastic in this movie. He goes from the selfish single Dad to Santa in all the right ways and makes the unbelievable believable. Eric Lloyd does a great job as Allen's son. He isn't amazing but this is really one of his first films and he is absolutely right for the part. The chemistry between him and Allen is perfect and fits the film. Wendy Crewson is Allen's ex-wife and she is good in the role. She doesn't get a lot of time on screen and her best scenes are towards the end when she comes around to the idea of her ex-husband being Santa Claus. Judge Reinhold is really the closest thing you get to a \"villain\" in the movie and he isn't quite that. He's a grown up who refuses to accept a concept like Santa Claus. They do make him awfully unlikable though which is unfortunate. However, he serves a purpose and mostly is there for Allen to make sarcastic jokes about. His scenes near the end when he comes around to Santa are really silly and poorly done in my opinion. David Krumholtz is sorely underused as the head elf. He is a very funny actor and I think there could have been more done with him and the relationship between him and Allen.Director John Pasquin had worked with Allen on Home Improvement and a few projects since then including his new sitcom \"Last Man Standing.\" They likely know each other very well and know the style of comedy. I'm not sure he's the optimal choice for a family Christmas film but he absolutely gets it done in the right away. Perhaps my only but would be that there could have been more character development with the supporting cast and I felt like the ending is very rushed. They spend a lot of time building up this story and then it seems as though they realized they spent too much time and have to wrap it up very quickly. Nonetheless, this is a lot of fun and you will certainly enjoy watching it and you'll smile a lot. For me, it wasn't laugh out loud funny like I expected it to be but its simple and cute. There is a lot of magic for the little ones and you can't fault them at all for making something like that. Its worthy of adding to your family Christmas film rotation every year! I'm looking forward to following this up with the two sequels, one of which I have never seen. 7/10",
    "50": "Classic film better when you get the references after watching it as an adult. My favorite Christmas film and it stays classic years later. 4 stars.nhbnb.",
    "51": "Scott Calvin is disgusted to learn that his ex and her husband have tried to break it to son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, Santa vanishes leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food.....Less of a Christmas movie and more of a starring role for Allen to make it big in Hollywood, the film mildly succeeds on both accounts, after all this is Allens second franchise with Disney, and the film profited enough to garner more sequels.But it hasn't aged well, like other classic Christmas movies and its due to the sarcastic tone and yuppie attitude Calvin has during the first act.This was boring in 1995, and watching it with my daughter seventeen years later, she was losing interest very fast.The film does redeem itself when we reach the north pole, but the adult humour and the childish tones do not bond well.It's a good film to watch one cold Christmas afternoon, Allen is a presence and the support is great. Just not brilliant enough to be a Christmas classic",
    "52": "'The Santa Clause (1994)' has its heart is in the right place but it's oddly inept, based upon a strangely nonsensical, decidedly dark core conceit and such a rushed, haphazardly constructed story. Still, it's pretty fun, to be honest, and there are quite a few laughs to be had - most of which are at the picture, rather than with it (save a couple of surprisingly funny 'Tim-Allen-isms'). It's a bizarrely entertaining watch, one that's by no means a good movie but certainly isn't a terrible one, either. 6/10",
    "53": "The Santa ClausESome SpoilersComedian Tim Allen rose out of TV land and the comedy circuit when he starred in \"The Santa ClausE\" in 1994. If I recall, it did fairly well at the box office, and carved a new name for Tim Allen as a film star.\nAllen plays Scott Calvin, a busy father to Charlie, who has been having doubts as to the existence of a certain Mr. Claus, recently. On Christmas Eve, Charlie spends the night over at Dad's house, and during the night, they have an unexpected visitor: Santa Claus. But after an unbelieving Scott scares Santa up on the roof, causing him to fall and die (or evaporate). So, Scott tries on Santa's suit for no apparent reason, and he and his son are whisked away to The North Pole, which consists of...well...a little pole sticking out of the ground with a built in security feature. After a little elf activates the pole, Charlie and Scott are sucked underground into Santa Claus' work shop, where they meet Italian Head Elf Bernard, as well as cheery, 800-year-old children called elves. Bernard explains to Scott that by putting on the suit, he has accepted the role of Santa Claus, and will be Santa Claus until he is \"Unable to do so, either by accident or design.\"\nSo, that is what starts this cheery holiday fable. We see Scott coming to facts that he is Santa, including a beard sprouting out of his face every time he shaves, and a big, fat beer gut that comes out of nowhere. Not only that, but pretty soon ex-wife Wendy Crewson is beginning to become a little worried with Scott's far-from-normal appearances, so she and new-beau Judge Reinhold try to keep Charlie away from his father...even if it means filing for, 'No-visitation-rights,\" as Crewson says.The film is a nice family treat. It is not what I would call a Christmas Classic, but it is one that I usually see every year just because I own it. Tim Allen's performance itself is worth seeing the film for. It is one of his best, other than the \"Toy Story\" films. Perhaps the fact that he hasn't really been in many other films is why I say it is one of his best performances. Anyway, he does good. There is one particular moment that is very reminiscent of Allen's humor. Scott is at a meeting with boss Peter Boyle, and new toy designs are flying by. One includes \"Turbo Tank Santa,\" which shows a picture of Santa sitting in an army tank. Scott - because he is now Santa - is outraged, and goes on about how it is just wrong to show Santa in a tank. He then imitates a woman, and says, \"Well, Timmy, I hope you've been good this year, because Santa just took out the Ferguson's house! INCOMING!\" I love that part. It is, perhaps, the finest moment of the film...All in all, `The Santa ClausE' is not one of the smartest of hippest films I've seen before, but it's pretty funny. A sweet holiday-themed film that the entire family can enjoy. It's very easy to watch.3/5 stars John Ulmer",
    "54": "Too many people reviewing this film think Tim Allen's character 'killed' Santa Claus. I didn't see it that way. Scott Calvin merely yelled up at him while Santa was on his roof making a racket and then lost his footing. You would think after hundreds of years, Santa Claus would know how to handle himself on a snowy rooftop.Anyway, that's the premise, and that's how Scott wound up taking on the role of the new Santa Claus. All in all, he didn't seem like a bad guy, which made it somewhat confusing why he was divorced; an explanation there might have helped, but didn't affect the story once it got going. The 'Rose Suchak Ladder' bit was pretty clever in the early part of the film, whoever came up with that was thinking outside the box.After some initial misgivings, Scott takes to the role of Santa Claus eagerly enough, while precariously balancing his relationship with ex-wife Laura (Wendy Crewson) and her new husband Neal (Judge Reinhold), all while attempting to maintain a solid relationship with his son Charlie (Eric Lloyd). I don't know why the script writers left Charlie out of Santa's second epic run with the sleigh and the reindeer. It seemed to me like he should have gone along for that ride too.In any event, a lot of the uncertainty that Scott Calvin had when he reluctantly began to wear the Santa suit might have been avoided if he had asked elf Bernard (David Krumholtz) about his contract's sanity clause. That's what Groucho Marx offered his brother Chico in the 1935 flick \"A Night at the Opera\". To which Chico replied - \"You can't fool me! There ain't no Sanity Claus!\"",
    "55": "I've never understood the star power of Tim Allen.  It's not that I dislike him, I just don't get the appeal.  This entry is a very 90's-hip version of the Santa Claus tale, complete with child custody and visitation issues.  Workaholic Tim gets lasso-ed into replacing the current Santa Clause on legal technicality.  I may be alone, but I thought the plot progression from there was disquieting, unpleasant and just plain bizarre. Maybe I missed the point, but I didn't think much of this film.",
    "56": "Some movies are sold on the director, others on the producer, and some purely on the actor. It makes me wonder what the actor actually puts into the movie other than their appearance. I guess though it has to do with team work: without the actors the movie will not work nor will the movie work without the director, producer, sound technicians. Why am I raving about this to this movie? Namely because this movie pushes the leading actor to promote the movie.The Santa Clause is about a man who scares Santa while he is on his roof. Santa falls off the roof, breaks his neck, and the man, Scott Calvin, must finish the job. Calvin doesn't really believe in Santa but he is pretending to to get at his son's step father, who he really doesn't like. Unfortunately for Scott, buy putting on the suit made him subject to the Santa Clause that basically turns him into Santa.This movie is about belief, pure and simple. About continuing a belief to bring joy and happiness to the kids across the world. It is about finding answers to stupid questions about continuing the beliefs, and to me it totally pagan. They are putting their faith in a fat guy that eats milk and cookies and has been corrupted down the ages to the current form.Christmas makes me sick because it is the time of peace to earth and goodwill to all people. Why should that make me sick? Namely because people only do it on this time. Pizza Hut is making pizzas for homeless kids on Christmas, that is nice, but it is only to promote them and during the rest of the year the street kids can simply go to hell. What is worse than false sentiment is sentiment used to promote oneself. Christmas brings a lot of expectation, too much unfortunately and in the end it results in a lot of pain. People not only die on Christmas but they kill themselves because the social expectations that they are looking for do not come to light.The Santa Clause continues this false sentiment because it focuses of a fictional character that does not offer any salvation. He is a character that appears only once a year to give presents to children. He is a focused person that offers no hope whatsoever, only empty joy. If you really want to find the spirit of Christmas look to that man who was born in a cave in the ancient middle east who grew up only to be nail to a cross and then returned to life. He does offer salvation.",
    "57": "Not that he owns it or something, but if you like the guy, this is definitely the work to be referenced (although Galaxy Quest ain't that bad either). Do not believe the people who say that the Santa Clause films form a great series, unless you're prepared to concede that the Beverly Hills Cop films also do. This film isn't only fresh and original, its script is extremely thick and delivers by the minute, whereas in the follow-ups you do get something here and there, but it's far in between. My favourite lines must be \"You mean, if I want to become Santa Claus, all I have to do is to push you off the roof?\" and \"Neal listens to me! - Yes, and he charges you for it.\", whereas the best thing about the Santa Clause 2 is an entirely cryptic inside joke \"You just scared me.\" (incomprehensible, if you haven't seen \"Everywhich Way but Loose\"). The music.in the first film is also way better, but I have to say that when ZZ Top \"came up\" I wondered \"Why not go all the way and play 'TV Dinners'?\" Btw., in comparison with \"Elf\", I think this wins as well, but at least that's a worthy opponent.",
    "58": "Cynical businessman and single dad Tim Allen gets to be the new St. Nicholas after the actual Santa Claus takes a spill Christmas morning. Thin holiday confection from screenwriters Leo Benvenuti and Steve Rudnick is fairly tolerable until the desperate third act (featuring a police search for Tim's missing child). Allen, then a popular TV fixture on the hit sitcom \"Home Improvement\", easily carried his Everyman appeal onto the big screen with this sugar-coated perennial. The success of the film was not inexplicable, however the results are not particularly witty or inventive. Kids enjoyed it at the time, but of course; the humor is purely television (without the interruptions). Followed by two sequels. ** from ****",
    "59": "Scott Calvin(Tim Allen)is a depressed divorced dad that resents his ex-wife Laura(Wendy Crewson)marrying the child psychiatrist(Judge Reinhold)of his son Charlie(Eric Lloyd). After hearing a clatter on his roof, Scott startles an intruder, Santa Claus, who falls to his accidental death. Because of an unknown technical clause, he inherits the duties of Santa. Scott gains a massive amount of weight and rapidly grows a white beard and reluctantly transforms from a Scrooge to Santa Claus. This all creates a problem for young Charlie, because he knows his dad is Santa...but his step-father insists there is no Santa Claus. Sitcom star Allen makes his movie debut in this family friendly comedy. Pretty corny, but assuredly the younger the viewer the more enjoyable THE SANTA CLAUSE is. If you are not a Tim Allen fan this will fortify your opinion. Also in the cast: David Krumholtz, Mary Gross, Peter Boyle, Joshua Satok and Larry Brandenburg.",
    "60": "Wonderful Christmas film, Tim Allen is a great Santa and Charlie's faith is inspiring. Great cast great costumes CG isn't great but it's the 90's.",
    "61": "Ever since I was a little girl, The Santa Clause has been my favorite Christmas movie. Maybe I'm in the minority but I think I may have had a bit of a dad crush on Tim Allen...hahaha! I life the message of this movie and the father-son relationship between Scott and Charlie. I also love all the chaos that ensues. Perhaps it's because Christmas is my favorite holiday, but I could watch this movie any time of the year. I can never get sick of this movie and it always brings a smile to my face. With that being said, I do think that parents should be careful with children watching this movie. Maybe it's because I had an overactive imagination, but I actually took this movie very seriously. Maybe it was because of my age but when I found out the truth, I felt very hurt. This movie made me believe that a man named Scott Calvin really was Santa. I also learned to spell Santa Claus wrong because I've it. I don't remember believing that I could get a new Santa by pushing him off the roof though. Maybe that's what so special about this movie, it will remind us of our childhood hopes and dreams and make us believe in the magic of the season. Either way, I will continue to watch this movie every year no matter the season to keep the spirit of Christmas alive. 10/10",
    "62": "I hope Disney has moved on from this sort of thing. For some reason, I think they have, making a little more solid \"family films.\"This turned out to be yet another modern-day \"family film\" that had all the typical Disney features: a story based on a character who lies frequently; a number of subtle sex jokes (such as obscene telephone numbers), a snotty and unrealistic lead kid who uses an unrealistic vocabulary and is shown to be more mature than his bumbling Dad. (Intelligence, loving fathers are never found in these PC fiasco's). And, of course, we have the divorced family: the only kind Hollywood knows.Other than that, it's a nice holiday family film!",
    "63": "Did you forget to take your meds? Seriously reporting you though.Love Tim Allen and love this movie! One of my favourite christmas movies!",
    "64": "Movie is awesome, a must-see every holiday season! Good for the entire family, great storyline, great PG humour, Tim Allen delivers a great performance. The kid needs some work with his acting, but other than that, the North Pole, the magic of Santa, just classic.",
    "65": "An excellent, well thought out film that is the perfect way to kick off the holiday season. Get the family together, make some hot cocoa, and gather around the TV, and enjoy the wonder. Oh, one more thing, avoid the sequels, number two and number three are abominations!",
    "66": "i thought his movie was quite good.it's loaded with some great laughs,it's heartwarming,and it's original.Tim Allen is in fine comedic form here,way back in 1994.this is truly a movie the whole family can enjoy.the jokes are appealing to both kids and adults.my sister and both laughed quite hard more than a few times.the movie moves at a quick pace,so you don't really get to know the characters that well.but for this movie,that's OK.you get all the information you need for the story.it's also nice to see a movie like this that isn't preachy.sure there's a message,but it's subtle,and not the main focus of the film.for me,the Santa Clause is a 8/10.",
    "67": "I definitely give a few stars for nostalgia. This movie would always be playing in my house around the holidays. It checks all the boxes necessary to be a Christmas classic. Tim Allen is a crack up! A must watch if you are in the holiday spirit!",
    "68": "I have seen this movie several times, and as I am writing this I am watching it with my family once again. With a holiday movie, it's best to turn off your brain and just enjoy--and on this level, this is an excellent film.",
    "69": "The Santa Clause is all around the perfect family Holiday film. I don't mean to imply its a perfect film because it is of course silly, implausible, full of product placement (good ol' Disney), but its also sweet and fun and magical. Watching our main character's transformation into Santa is easily one of the most memorable in Christmas film history. The movie really has everything you could possibly want from a Christmas film right from square one with familiar Christmas classics, a middle aged divorced father more concerned with his career than his family, Santa, presents, North Pole, elves, magic...you name it. It is all here. There is also a ton of hidden little Easter Eggs (pardon the pun) in the film from Mickey Mouse's hidden face in the moon to elves hiding amongst the humans throughout the movie. Its a fantasy adventure comedy that kids will absolutely adore and adults can still smile even if its a guilty little pleasure. Best of all the film is full of magic and morals and is squeaky clean save few a couple of stupid fart jokes in the beginning (I hate fart jokes but they are there for better or for worse.) Tim Allen blew everyone away with his comedy on Home Improvement in the 90's and with this film he proved his chemistry could translate to the big screen. Allen really is fantastic in this movie. He goes from the selfish single Dad to Santa in all the right ways and makes the unbelievable believable. Eric Lloyd does a great job as Allen's son. He isn't amazing but this is really one of his first films and he is absolutely right for the part. The chemistry between him and Allen is perfect and fits the film. Wendy Crewson is Allen's ex-wife and she is good in the role. She doesn't get a lot of time on screen and her best scenes are towards the end when she comes around to the idea of her ex-husband being Santa Claus. Judge Reinhold is really the closest thing you get to a \"villain\" in the movie and he isn't quite that. He's a grown up who refuses to accept a concept like Santa Claus. They do make him awfully unlikable though which is unfortunate. However, he serves a purpose and mostly is there for Allen to make sarcastic jokes about. His scenes near the end when he comes around to Santa are really silly and poorly done in my opinion. David Krumholtz is sorely underused as the head elf. He is a very funny actor and I think there could have been more done with him and the relationship between him and Allen.Director John Pasquin had worked with Allen on Home Improvement and a few projects since then including his new sitcom \"Last Man Standing.\" They likely know each other very well and know the style of comedy. I'm not sure he's the optimal choice for a family Christmas film but he absolutely gets it done in the right away. Perhaps my only but would be that there could have been more character development with the supporting cast and I felt like the ending is very rushed. They spend a lot of time building up this story and then it seems as though they realized they spent too much time and have to wrap it up very quickly. Nonetheless, this is a lot of fun and you will certainly enjoy watching it and you'll smile a lot. For me, it wasn't laugh out loud funny like I expected it to be but its simple and cute. There is a lot of magic for the little ones and you can't fault them at all for making something like that. Its worthy of adding to your family Christmas film rotation every year! I'm looking forward to following this up with the two sequels, one of which I have never seen. 7/10",
    "70": "Classic film better when you get the references after watching it as an adult. My favorite Christmas film and it stays classic years later. 4 stars.nhbnb.",
    "71": "Scott Calvin is disgusted to learn that his ex and her husband have tried to break it to son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, Santa vanishes leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food.....Less of a Christmas movie and more of a starring role for Allen to make it big in Hollywood, the film mildly succeeds on both accounts, after all this is Allens second franchise with Disney, and the film profited enough to garner more sequels.But it hasn't aged well, like other classic Christmas movies and its due to the sarcastic tone and yuppie attitude Calvin has during the first act.This was boring in 1995, and watching it with my daughter seventeen years later, she was losing interest very fast.The film does redeem itself when we reach the north pole, but the adult humour and the childish tones do not bond well.It's a good film to watch one cold Christmas afternoon, Allen is a presence and the support is great. Just not brilliant enough to be a Christmas classic",
    "72": "'The Santa Clause (1994)' has its heart is in the right place but it's oddly inept, based upon a strangely nonsensical, decidedly dark core conceit and such a rushed, haphazardly constructed story. Still, it's pretty fun, to be honest, and there are quite a few laughs to be had - most of which are at the picture, rather than with it (save a couple of surprisingly funny 'Tim-Allen-isms'). It's a bizarrely entertaining watch, one that's by no means a good movie but certainly isn't a terrible one, either. 6/10",
    "73": "The Santa ClausESome SpoilersComedian Tim Allen rose out of TV land and the comedy circuit when he starred in \"The Santa ClausE\" in 1994. If I recall, it did fairly well at the box office, and carved a new name for Tim Allen as a film star.\nAllen plays Scott Calvin, a busy father to Charlie, who has been having doubts as to the existence of a certain Mr. Claus, recently. On Christmas Eve, Charlie spends the night over at Dad's house, and during the night, they have an unexpected visitor: Santa Claus. But after an unbelieving Scott scares Santa up on the roof, causing him to fall and die (or evaporate). So, Scott tries on Santa's suit for no apparent reason, and he and his son are whisked away to The North Pole, which consists of...well...a little pole sticking out of the ground with a built in security feature. After a little elf activates the pole, Charlie and Scott are sucked underground into Santa Claus' work shop, where they meet Italian Head Elf Bernard, as well as cheery, 800-year-old children called elves. Bernard explains to Scott that by putting on the suit, he has accepted the role of Santa Claus, and will be Santa Claus until he is \"Unable to do so, either by accident or design.\"\nSo, that is what starts this cheery holiday fable. We see Scott coming to facts that he is Santa, including a beard sprouting out of his face every time he shaves, and a big, fat beer gut that comes out of nowhere. Not only that, but pretty soon ex-wife Wendy Crewson is beginning to become a little worried with Scott's far-from-normal appearances, so she and new-beau Judge Reinhold try to keep Charlie away from his father...even if it means filing for, 'No-visitation-rights,\" as Crewson says.The film is a nice family treat. It is not what I would call a Christmas Classic, but it is one that I usually see every year just because I own it. Tim Allen's performance itself is worth seeing the film for. It is one of his best, other than the \"Toy Story\" films. Perhaps the fact that he hasn't really been in many other films is why I say it is one of his best performances. Anyway, he does good. There is one particular moment that is very reminiscent of Allen's humor. Scott is at a meeting with boss Peter Boyle, and new toy designs are flying by. One includes \"Turbo Tank Santa,\" which shows a picture of Santa sitting in an army tank. Scott - because he is now Santa - is outraged, and goes on about how it is just wrong to show Santa in a tank. He then imitates a woman, and says, \"Well, Timmy, I hope you've been good this year, because Santa just took out the Ferguson's house! INCOMING!\" I love that part. It is, perhaps, the finest moment of the film...All in all, `The Santa ClausE' is not one of the smartest of hippest films I've seen before, but it's pretty funny. A sweet holiday-themed film that the entire family can enjoy. It's very easy to watch.3/5 stars John Ulmer",
    "74": "Too many people reviewing this film think Tim Allen's character 'killed' Santa Claus. I didn't see it that way. Scott Calvin merely yelled up at him while Santa was on his roof making a racket and then lost his footing. You would think after hundreds of years, Santa Claus would know how to handle himself on a snowy rooftop.Anyway, that's the premise, and that's how Scott wound up taking on the role of the new Santa Claus. All in all, he didn't seem like a bad guy, which made it somewhat confusing why he was divorced; an explanation there might have helped, but didn't affect the story once it got going. The 'Rose Suchak Ladder' bit was pretty clever in the early part of the film, whoever came up with that was thinking outside the box.After some initial misgivings, Scott takes to the role of Santa Claus eagerly enough, while precariously balancing his relationship with ex-wife Laura (Wendy Crewson) and her new husband Neal (Judge Reinhold), all while attempting to maintain a solid relationship with his son Charlie (Eric Lloyd). I don't know why the script writers left Charlie out of Santa's second epic run with the sleigh and the reindeer. It seemed to me like he should have gone along for that ride too.In any event, a lot of the uncertainty that Scott Calvin had when he reluctantly began to wear the Santa suit might have been avoided if he had asked elf Bernard (David Krumholtz) about his contract's sanity clause. That's what Groucho Marx offered his brother Chico in the 1935 flick \"A Night at the Opera\". To which Chico replied - \"You can't fool me! There ain't no Sanity Claus!\"",
    "75": "I've never understood the star power of Tim Allen.  It's not that I dislike him, I just don't get the appeal.  This entry is a very 90's-hip version of the Santa Claus tale, complete with child custody and visitation issues.  Workaholic Tim gets lasso-ed into replacing the current Santa Clause on legal technicality.  I may be alone, but I thought the plot progression from there was disquieting, unpleasant and just plain bizarre. Maybe I missed the point, but I didn't think much of this film.",
    "76": "Some movies are sold on the director, others on the producer, and some purely on the actor. It makes me wonder what the actor actually puts into the movie other than their appearance. I guess though it has to do with team work: without the actors the movie will not work nor will the movie work without the director, producer, sound technicians. Why am I raving about this to this movie? Namely because this movie pushes the leading actor to promote the movie.The Santa Clause is about a man who scares Santa while he is on his roof. Santa falls off the roof, breaks his neck, and the man, Scott Calvin, must finish the job. Calvin doesn't really believe in Santa but he is pretending to to get at his son's step father, who he really doesn't like. Unfortunately for Scott, buy putting on the suit made him subject to the Santa Clause that basically turns him into Santa.This movie is about belief, pure and simple. About continuing a belief to bring joy and happiness to the kids across the world. It is about finding answers to stupid questions about continuing the beliefs, and to me it totally pagan. They are putting their faith in a fat guy that eats milk and cookies and has been corrupted down the ages to the current form.Christmas makes me sick because it is the time of peace to earth and goodwill to all people. Why should that make me sick? Namely because people only do it on this time. Pizza Hut is making pizzas for homeless kids on Christmas, that is nice, but it is only to promote them and during the rest of the year the street kids can simply go to hell. What is worse than false sentiment is sentiment used to promote oneself. Christmas brings a lot of expectation, too much unfortunately and in the end it results in a lot of pain. People not only die on Christmas but they kill themselves because the social expectations that they are looking for do not come to light.The Santa Clause continues this false sentiment because it focuses of a fictional character that does not offer any salvation. He is a character that appears only once a year to give presents to children. He is a focused person that offers no hope whatsoever, only empty joy. If you really want to find the spirit of Christmas look to that man who was born in a cave in the ancient middle east who grew up only to be nail to a cross and then returned to life. He does offer salvation.",
    "77": "Not that he owns it or something, but if you like the guy, this is definitely the work to be referenced (although Galaxy Quest ain't that bad either). Do not believe the people who say that the Santa Clause films form a great series, unless you're prepared to concede that the Beverly Hills Cop films also do. This film isn't only fresh and original, its script is extremely thick and delivers by the minute, whereas in the follow-ups you do get something here and there, but it's far in between. My favourite lines must be \"You mean, if I want to become Santa Claus, all I have to do is to push you off the roof?\" and \"Neal listens to me! - Yes, and he charges you for it.\", whereas the best thing about the Santa Clause 2 is an entirely cryptic inside joke \"You just scared me.\" (incomprehensible, if you haven't seen \"Everywhich Way but Loose\"). The music.in the first film is also way better, but I have to say that when ZZ Top \"came up\" I wondered \"Why not go all the way and play 'TV Dinners'?\" Btw., in comparison with \"Elf\", I think this wins as well, but at least that's a worthy opponent.",
    "78": "This film captures all the kitschy clichés of a suburban- American Christmas in the white woods of the classic Midwest with enough of the \"Tis the Night Before Christmas\" feel to make it warm and familiar. Scott Calvin (Tim Allen) accidentally kills Santa Clause, skeptically dons the coat and the red-crushed velvet MC Hammer pants, and jumps into a jolty sleigh ride of adventure that pits him against uncontrollable weight gain, hair growth, non-believers, the local donut-eating police, and the ever-present threat of a slippery rooftop. Tim Allen was sarcastically spectacular. His wit was laced with clever adult humor that would sail above a child's head but punch hard with a more mature audience. He was foiled nicely by his capricious ex-wife (Wendy Crewson) and her Sophist spouse (Judge Reinhold) as they battled for custody of his chipmunk-cheeked son (Eric Lloyd) over the question of the existence of Santa Clause. The quick banter and barb-exchange between this trio are clever and hilarious. David Krumholtz, delivers a convincing performance as an impatient, crotchety arch elf named Bernard (Barnaby, Barrabus, etc) with the heavy responsibility of keeping the toy factory running. His Queens, New York accent, indicates he is most certainly not a North Pole native. The only real disappointment was the reindeer. Of all the money poured into special effects, the reindeer got the short end of the candy cane. They were twitchy temperamental crane puppets with flatulence. Overall, however, this movie will go down in history as an all-time Christmas classic favorite for adults and children alike.",
    "79": "The Santa Clause is a hilarious holiday movie and one of my favorites in general. Tim Allen gives a great performance as a guy who works for a toy company and becomes Santa Claus. The movie has a very original story and clever writing. Do not miss this film. Thumbs way up on this one.",
    "80": "The Santa Clause (1994): Dir: John Pasquin / Cast: Tim Allen, Eric Lloyd, Wendy Crewson, Judge Reinhold, David Krumholtz: Delightfully funny holiday film about the promise of good will. Tim Allen stars as a divorcée who stays with his son on Christmas Eve. That night there arouses such a clatter and behold on the roof was a figure in a red suit. Allen startles him and he tumbles off the roof and melts away leaving behind the suit. He puts it on upon investigating the sleigh and he and his son are whisked away. What follows is a night of delivering gifts before retiring to the North Pole. An elf informs him that he accepts Santa's duties once the suit is placed on Allen. They wake up at home but details of their adventure causes concern for the ex-wife. No explanation given regarding appearing chimneys where they never were before. Interesting plot with detail and charm directed by John Pasquin. Allen is superb in his bewilderment as he struggles with his situation as well as the enthusiasm of his son. Eric Lloyd provides the awe as his son whose belief goes into overload. Unfortunately supporting roles are a disappointment. Wendy Crewson and Judge Reinhold are flat. David Krumholtz plays head elf Bernard whose name is foiled immediately by Allen. Theme regards the idea of Santa resulting in ideas, wonder and astounding visual holiday magic. Score: 7 / 10",
    "81": "Along with Elf and Jingle All the Way, The Santa Clause is another film in a line of movies I could recommend to all families to watch on Christmas Day just after opening all those presents. From the acting to the story, everything works. Tim Allen does a great job as Scott Calvin, and Judge Reinhold is superb as Dr. Neil Miller. There's some special effects used here and there, and considering the budget and year-produced, it's slightly adequate. The characters are easy to relate to, and we really pull for Scott to have the film end in a happy ending.All in all, this is a nice film. It's completely harmless to children, the comedy works every time, and the story is very endearing and will make your child even more anxious for next year's Christmas.",
    "82": "This movie is just a commercial to sell people, mainly children, 3 things: Toys, lies and religion. It's a sentimental comedy starring a literal \"snowman\" (if you know what I mean) in order to sell your children toys, lies and religion.The movie is just generic hash, It's not funny, and it's commercialized sentimental energy could not brainwash me even when I watched this movie as a snot nosed kid.Last Words: Don't watch Christmas movies if you are weak-minded.",
    "83": "This is a family Christmas classic and it is still cheesy but it is a very fun movie to watch with your kids and I remember watching this when I was six and it is aa cult called classic The premise of somebody killing Santa Claus and taking over for him is and insanity for kids movie but I like Insane things and this movie is hilarious I love that Disney got Tim Allen to do this and if he didn't do this film I don't think he would've done Toy story but overall I give this film anywhere from a 76% to a low 84",
    "84": "There aren't many movies that can kill off Santa in the first act and constantly poke holes in the folklore the entire time while still maintaining a jolly Christmas spirit, but The Santa Clause manages to pull it off. The sweet optimism of this holiday film even balances out Tim Allen's constant sarcasm. It's a unique story which offers some fun additions to the mythology. It does get a little cheesy near the end after the E. L. F. S. arrive, and some references & visual effects make this movie a little less timeless than others, but I'm up for watching The Santa Clause every couple years or so.",
    "85": "Whats the matter with some people now a days?? Everyone's ditching the American youths hopes and wishes. There just kids, let them believe there is a Santa clause, It gives them something to look forward to. Everyone is always trying to get kids to grow up faster. Let them enjoy there childhood, they only get one. I personally though the movie was awesome and I know my kids really enjoyed it. I thought Tim Allen did a horrendous job in play jolly ol' saint nick. The effects were awesome(considering time movie was made)with getting the reindeer and the chimney effects etc...It was a great movie and everyone needs to quit crushing children's dreams. Thats why there's violence in schools.",
    "86": "This is a pleasant and enjoyable Christmas film, about a man named Scott Calvin (Tim Allen) who was miraculously recruited on Christmas Eve to take the place of Santa Claus after he disappears. What follows is a story full of fun surprises as Scott slowly transforms into Santa as he tries to take on the duties such as working at his North Pole workshop, driving the sleigh with the reindeer and delivering gifts. I especially like how Santa's helpers like his elves help Scott carry on his duties.It's a perfect Christmas movie for the entire family and one to celebrate the holiday season with - a fun story with lovable characters and charming scenes. It'll suspend your disbelief.Grade B+",
    "87": "I love this movie and do not understand why it doesn't get a higher rating. I was 29 years old when this movie was released and I thought it hit all the right notes. I expands the story of how Santa Clause continues forever and answers all the questions that kids ask. The scene where Tim Allen's character (Charles Calvin) is reading \"The Night Before Christmas\" and Charli begins asking how do reindeers fly, how does Santa get down the chimney, what if they don't have a chimney is just precious because every child has asked those questions. And Calvin's answer that sometimes you just have to believe is so appropriate. I love the magic snow globe that allows Charlie to call for his dad at anytime. I love the storyline, love getting to see the North Pole and Santas home. The only one part I felt took away from the movie a little and that was the jail rescue. But I understand they needed a little more drama for the movie to be longer. Overall this is a Fantastic Family Friendly Movie. Tim Allen is a fantastic in this movie. Anyhow, I purchased this to add to my Christmas movie collection. And watch it every year along with: It's a Wonderful Life, A Christmas Story (reminds me of my family at Christmas...I am one of six children and grew up in the 70s),Miracle on 34th Street (the original), A Christmas Carol (TNT-starring Patrick Stewart which I feel is the best version ever), How The Grinch Stolr Christmas (both animated and Ron Howard starring Jim Carrey), Charlie Brown Christmas, and ELF.",
    "88": "Tim Allen, Judge Reinhold, Wendy Crewson, Eric Lloyd, David Krumholtz and Peter Boyle star in this 1994 comedy. Scott Calvin (Allen) is a divorced dad and toy exec who is getting ready to spend Christmas Eve with his son, Charlie (Lloyd). After Santa Claus falls off his roof, Scott takes the job of Santa and he and Charlie head off to the North Pole. When arriving, Scott is told by head elf, Bernard (Krumholtz) about the \"Santa Clause,\" which means when he puts on the suit he becomes the big guy and accepts the responsibility. Scott eventually realizes that it's not a dream and he's really Santa. Crewson (The Good Son) plays his ex-wife, Laura, Reinhold (Gremlins) plays her psychiatrist husband, Neil Miller and Boyle (Young Frankenstein) plays Scott's boss. This is one of the best holiday films with a good cast, great score & neat effects. I recommend this.",
    "89": "Scott Calvin is an overworked advertiser and divorced father who doesn't always fulfill his parental obligations despite the fact that he's no longer married. One ordinary Christmas Eve, he inadvertently frightens Santa Claus off of his rooftop. He puts on Santa's coat, but by doing so he unknowingly concedes to a contract in which he'll become the new, official Santa Claus. Initially reluctant to take on the responsibility, he gradually tries to embrace the role and find his own humanity in the process. Engaging story has an unusual but clever and intriguing premise, along with a good theme and likable performances. The script has a few too many plot complications for the youngest children, but it's meaningful and entertaining. ***",
    "90": "It has been years since I watched this film. I watched it in my childhood when it was released and enjoyed it. Tim Allen is great in this beloved film. He carries it nicely and his brand of humour and style works really well. You have to overlook a lot and forgive a lot of goofs in the spirit of magic and Christmas. This is definitely one for the kids to enjoy. The best part of the film was the beginning and the fun ride Scott Calvin and his little son take as they deliver the presents. After this initial scene the film becomes very juvenile and embraces the silly and magical aspects of the season.",
    "91": "And we have another Christmas movie starring Tim Allen, The Santa Clause. This movie is probably the most family friendly Christmas film you will find out there around Christmas time. Tim Allen is very funny and enjoyable as the lead actor, and the kid is cute too. This film is fun and sweet. There are a lot of warm hearted moments, especially between Tim Allen and his son. It has a good well written script, it has good special effects, although the film doesn't use a lot of effects. The kids and the adults will both surely love this one, if not love, like. This is one of those that gets you in the Xmas spirit! If you're interested in sitting down with the entire family and enjoying this Christmas movie, ABC Family Is showing it on the night of December 2nd. You can get your Christmas off to a merry start. 7/10. Make sure to check out my review on the Santa clause 2 :)",
    "92": "This movie really captures the true spirit of Christmas. Tim Allen does a wonderful job in it, and I think he was perfect for this role, I can't imagine anyone else in it. One night during the Christmas season Santa falls off of a man's roof, and can't continue his duties, Tim Allen's character is now bestowed the duty of becoming the new Santa Claus, at first he doesn't want to do it, presumably because of all the responsibility that comes with it. but as we go on , he gradually get's used to the idea, he has a little boy that he loves very much and maybe things could be really good now that he's Santa, one problem tho the boy tells his mother that dad is Santa, and the mother doesn't believe him and things don't' go well in the beginning,, I will leave it at that,, but I just wanna say that this is a movie for all ages, and captures the true spirit of the season.",
    "93": "This isn't a movie I can take on EVERY year, but we watch it every other or every three years. Tim Allen performs marvelously as a man pulled unwillingly into the role of Santa Claus when trapped by the Santa Clause, a legally binding agreement trigged when he put on the previous Santa's (now deceased) Santa suit.North Pole scenes were creatively decorated and imagined, as were the various devices by which Santa gets into homes and manages to deliver so many toys to so many people. Kurt Russel's movie actually handled that a bit better, but that movie has a TOTALLY different slant. :-)We're fans of Santa Clause and the first sequel, but number three is just too noisy and busy for us.",
    "94": "Finally got to see this movie, only 28 years late! Tim Allen is great as the reluctant Santa Claus in this very original and heartwarming Christmas movie. A good family movie with plenty of laughs for both kids and adults that will put you in the Christmas spirit.",
    "95": "I just finished watching this moving 12/20/20 because it is in my DVD collection. I watch it every year during the Christmas holiday, and it is one of my favorite Christmas movies. The Santa Clause movie is a movie that all ages can watch together. Merry Christmas...........",
    "96": "SPOILERSAs you may know I'm only commenting on Holiday film this month. I'm going to try to comment on all the classic Holiday films. This is one of them. Anyway, this is truly an excellent film. It is definitely one of my favorite Tim Allen performances. There are quotes in this film that are very, very good. The whole film is pretty much famous. Quite frankly, I can not believe this only has a 5.9 rating. I just can not believe it.A man named Scott Calvin accidentally becomes the new Santa Claus after he kills the old Santa Claus. He goes to the North Pole and finds out that there are little Elf children working. The Head Elf tells Scott that he has eleven months before he officially becomes Santa Claus. Through the months he is getting fatter for no apparent reason, maybe it is because he eats nothing but sweets. He grows a beard. When he tries to shave it off, it grows back. He finds out he is Santa Claus. Then Scott is arrested. The police thought he had kidnapped Charlie. Scott is divorced, by the way. Then the Elves swat team group rescue him. In the end Scott deliveries presents to all the nice little children.Overall, this is, again, a fantastic Holiday film that I would recommend to anyone who wants a flick to watch over the Holidays. It is a spectacular film for kids and even adults. Although movies like A Christmas Story and Christmas Vacation are better, this film will always have a special little place in my heart. Anyway, this is a fun-filled family film that is bound to be in your favorite Holiday films of all time. It is in mine.9/10Recommended Films: Santa Claus 2.",
    "97": "This most fantastic of Christmas movies has everything to bring about some holiday cheer. Late night driving, disastrous meals, carols, early morning wake-ups, magic, cocoa and so on. It's a rather clever film, as a man must become Santa, little does he realize, this could save his relationship with his son. The great thing about this film is how it takes on the adult and child perspectives. We have a broken home dynamic, but one that is at the point of childish quips and name-calling. There are many times when Allen is more childish than Lloyd. Allen adds some biting wit, and there are plenty of jokes to keep adults happy. The saviour of his relationship with his son also becomes an even worse destroyer as his life begins to unravel. It is dark at times, but this just builds up to the heartwarming ending. It's very realistic in its approach. Nobody believes Allen, and he is labelled as mentally unfit. The film also avoids having a needless antagonist. We can perfectly understand everybody's point of view. One of my holiday favorites.",
    "98": "\"The Santa Clause\" is a very charming Christmas fantasy movie that stars one of my favorite actors/comedians - the fabulous Tim Allen! His character Scott Calvin is a marketer for a major toy company. Currently divorced - his ex-wife Laura (Wendy Crewson) now married to a psychiatrist (Judge Reinhold) - Scott has one son, a fine young man named Charlie (Eric Lloyd). On Christmas Eve, when Santa Claus falls off Scott's roof, Scott puts on Santa's suit and, in effect, unwillingly accepts a contract to take over Santa's gift-delivering duties. Over time, Scott eventually realizes that he indeed was meant to become Santa Claus.My favorite moments from \"The Santa Clause\" include the following (DO NOT read any further if you have not yet seen this film). The previous Santa (before Scott takes over) is funny when he falls off the roof. During a children's soccer game, we hear a very laughable dixieland rendition of \"Jingle Bells\". In order to impress upon Laura that he is stuck in traffic, Scott honks his horn and yells out to an imaginary driver. When Scott and Charlie first ride Santa's sleigh, Scott casually asks a neighboring truck driver if they are heading towards I-94. Scott loudly admits that he sleeps buck naked and then tries to stifle his embarrassment when a neighbor and her daughter walk by. The \"Jeopardy!\" theme is heard while Scott finishes his abundant desserts at a business lunch; afterwards, Scott is quite funny as he expresses his disdain for Santa Claus driving a tank. Two Punch & Judy puppets shriek at the sight of Scott's boxer shorts. On the manhunt for Scott/Santa, several police officers grab another Santa and slam his body against their vehicle. Scott quickly mumbles through the rest of \"The Night Before Christmas\" as Charlie falls asleep. And finally, in the most tearfully heartwarming moment in the entire piece, Scott tells Charlie how absolutely honored he is that Charlie not only believed in him but also helped MAKE him the new Santa Claus.I think children of all ages will enjoy \"The Santa Clause\", particularly the magical land of Santa's busy elves at the North Pole. True, there may be some ludicrous moments in this film (e.g., elves looking like children, yet actually being over a millennium old; houses that alter themselves to accommodate a chimney & fireplace that enable Santa to drop down), but I can overlook those. \"The Santa Clause\" is a wonderful movie that I believe was well worth the time and effort, enabling us all to embrace the Christmas spirit.",
    "99": "Having seen all 3 in the series, this is still the best one. Why couldn't Santa just have retired instead of slipping on the icy roof and \"disappearing\"? (He waves goodbye, so I guess the old Santa didn't die, after all.) Well, it seems that this started out as a \"Hollywood Films\" Disney movie which was intended to be more like a \"Christmas Vacation-style\" film with more adult humor and still has a few inappropriate lines and comments, here and there. It became \"Disneyfied\".Ultimately, this was a very good thing. (Originally, SC was to have shot Santa with a shotgun, as a rooftop burglar.) Little \"Charlie\" grew up and pretty-much \"disappeared\" after Santa Claus 3. (Not uncommon for many cute child actors.) Scott Calvin becomes the Santa replacement because of the \"Santa Clause\": He who causes the current Santa to be unable to perform his duties must take his place; and he faces numerous comic dilemmas: Santa weight gain, bushy white facial hair, disbelief by all. The cleverly-written script carries the movie along and the airborne elves at the end are very ingenious. Santa Clause 2 (which Disney didn't run on cable this year) is a bit \"off\". It's too weird. The plastic duplicate Santa has a nightmarish \"Frankenstein\" quality to it. SC courting \"Mrs. Claus\" is the only saving-grace of Santa 2. Seeing SC's kid turn into a juvenile delinquent is a real downer. Chet the Reindeer is hilarious and steals the show. So candy bars make him fat, but why the \"potty\" humor? The \"rip-off\" ending from Laurel & Hardys', \"March of the Wooden Soldiers\" shows a great lack of originality here. It's been done before-in the 1930's.Santa Clause 3 once again, steals the plot from another film. This time, it steals the \"Jack Frost\" villain from an old Rankin-Bass animated short. However, Martin Short is very good as Jack Frost. However, the out-takes over the ending credits spoil the \"magic\" of a Santa film. I really only like the first film. The original can be enjoyed and the sequels soon forgotten.Enough already, please no more Santa Clause movies. (I can see it all now: Santa Clause 4: Scott Calvin's niece takes over the role of Miss Claus after old SC has a heart attack from eating too many cookies and drinking too much hot chocolate and marshmallows. Judy the Elf becomes her companion, but because it's a Disney movie, they are only good friends.",
    "100": "My 2 year old just sat there and actually watched the whole thing, he loved the toy factory....as well as my 7 year old found the love story between son and dad wonderful.  this is a great christmas addition.  It will never take the place of \"It's a wonderful life\", but gets pretty darn close.",
    "101": "A certified Christmas classic. It's up there with some of the best, and I'd comfortably say in the top 10.Tim Allen delivers one of his top three characters as Scott Calvin, the others of course being Buzz Lightyear and Tim \"The Tool Man\" Taylor.The Christmas magic in this film is real. It really generates that feeling of Christmas spirit that not very many can. It's great to see Santa not only use his magic, but also keeps up to date on the tech of the times, like having a cookie dispenser in his sleigh!We don't get much a view outside that window where they see that polar bear, but I imagine the North Pole probably looks incredible. Just one of those scenes that makes you feel Christmas giddy.",
    "102": "superstar comedian Tim Allen shines in this Disney's magical larger than life Xmas comedy a clatter on the roof leads to a merry Xmas adventure after a disturbance Santa falls down on the job and Scots son Charlie convince him he is the real deal and try on the suit 8 reindeer navigate the pair to the north pole so with clause in his suit he has accepted the contact and over the next year Scot has a mini sized breakdown as he evolves quiet latterly into something quiet large his family and business associates come quiet concerned if he is losing his marbles but not his son he believes this well keep secret Disney reveals in this Xmas classic its surprising 7/10 1hr33mins of fun enjoy great acting by a all star cast",
    "103": "Tim Allen stars as...Santa Clause himself! He starts shaving..but long white beard won't stop! He starts going up in weight...well, he goes in puberty getting Santa Clause!The thing is; Allen plays a dad who's divorced and has his son on visit on Christmas Eve, when the night has come they suddenly hear someone on the roof. Allen scares the santa and he trips and falls, on his visit card it stands that if something happens to santa, take his clothes and take the sledd, and ride out in the night as santa, so does Allen a bit confused. Together with his son he delivers presents as santa and soon they go home..no, not to their house, but to santa's home..the North Pole. And soon he is...Santa Clause! STARS: *** 3/5",
    "104": "I'm laughing just from thinking about this movie!!!!! Anyway, Tim Allen, star of \"Home Improvement,\" hit the theaters in Christmas 1994 with Disney's live action classic \"The Santa Claus...\" uhhh, I mean \"The Santa Clause!!!!!\" (Pronounce THAT as \"The Santa Clausie!!!!!\" LOL)In it, Scott Calvin (S.C.), a toymaker, was taking care of his boy while S.C.'s ex-wife went away. He burnt a turkey, so they went to a Denny's for coffee and a burnt turkey!!!!! Later that night, after storytime, Santa came!!!!! S.C. (not Santa, Scott!!!!!) scared Santa so much that he had \"fallen off the roof\" (remember that!) and \"died!!!!!\"The boy: \"YOU KILLED HIM !!!!!\"Scott found a card that pretty much stated that Scott had to take over as Santa Claus. And so, he did.Later on, the boy had to learn lessons such as handling family problems, but still, \"The Santa Clause\" is an instant holiday classic!!!!! I've seen this at Christmastime every year and it never grows old!!!!!10 stars",
    "105": "I grew up watching this film every Christmas yes it's not the best Christmas film but it's a great modern classic. It's not a perfect film and the effects are outdated but it's a fun great family film.",
    "106": "It is a very good movie to see at Christmas; it is fun and appropriate for the whole family; I recommend it.",
    "107": "Tim Allen is back as Santa Claus after 28 years since his first 'The Santa Clause' movie. The show deals with plot holes that were never answered in the original movies, like what happened to the original Santa Claus and if he had a wife or not. Having original characters like Elizabeth Mitchell (Mrs Claus), Eric Lloyd (Calvin), Judge Reinhold (Neil) and Wendy Crewson (Laura) make it connect much easier to the past.It's a fitting touch too that Tim Allen's daughter plays Santa Claus' daughter in the show. This brings a touch of reality to the show as it's dealing with not only this possibly being Santa Claus' last time as Santa, but Tim Allen's last time playing Santa. They play safe within the boundaries of humour, using similar humour to the previous movies, but this brings a sense of familiarity.",
    "108": "The Santa Clause is an enjoyable family film for the holidays. It may not have the best written story or the most funniest humor, but what matters is the connection of Scott and his son that provides great heart into. That and it does have some good direction, even the setups of the North Pole where the elves work in. The jokes can work when it comes to scenes where Scott's reactions of transforming into Santa Claus. And the characters are solid featuring some great performances. This is a pretty good option for the holidays in case you want to celebrate with some laughs. Also, I may say this would be the only movie of the three that's worth watching before watching the miniseries on Disney Plus. I wouldn't consider the best Christmas comedy, but this is a good film to bring the spirit.",
    "109": "This is a truly magical film that will continue to enchant children and adults for years and generations to come.The simple premise is executed well and Pasquin excels in making a film that appeals to all ages.Tim Allen plays his part to perfection and has never been funnier. He captures all the heart that the film needs as well as having an excellent on screen rapport with young Eric Lloyd.All the other cast members are good in their roles with David Krumholtz being the standout.Overall a fantastic film that for me truly sums up the spirit of Christmas. Although I like the sequels that followed this film this is the true classic of the series.",
    "110": "Ever wonder, who is Santa Claus, really?  Where does he come from, how old is he?  How in the world does he squeeze down a chimney, and how does he get in if there isn't a chimney?  What's the deal here?  Well, happily, the answers to these questions and more are finally answered, as the legend of Santa Claus comes to life as never before in `The Santa Clause,' directed by John Pasquin and starring Tim Allen.  Scott Calvin (Allen) is an executive with a toy manufacturing company, he's divorced and has a young son, Charlie (Eric Lloyd), who still believes in Santa, but is at an age at which doubt is beginning to creep into the picture.  And the fact that Charlie's mom, Laura (Wendy Crewson) has a boyfriend, Dr. Neal Miller (Judge Reinhold), who is a psychiatrist, isn't helping the situation any.  Neal, it seems, is adamant about counseling Charlie in the realities of life, which of course includes the real scoop on Santa, which doesn't go over too well with Scott. \tThen on Christmas Eve, which Charlie is spending with Scott, a strange thing happens.  There's a clatter on the roof, and Scott rushes outside to investigate, where he discovers a man in a red suit clamoring about on the roof of his two-story house.  As Scott watches, the man loses his footing and falls into the snow on the front lawn.  And to Scott's amazement, it's Santa Claus!  Or at least a guy dressed up like Santa, and he's not in very good shape at the moment.  Lying there on his back, the man hands Scott a card with instructions written on it about what to do in this particular situation.  `Put on the suit,' it says, `The reindeer will know what to do.' And when Scott looks back up at the roof, what he sees concludes what Neal would probably call an SEE (Significant Emotional Experience), and though he doesn't realize it at the moment, his life is about to change forever...\tAnd with that, Pasquin goes on to tell the story of Scott Calvin's amazing odyssey, which puts a humorous, and at times poignant, spin on this contemporary and highly imaginative rendition of the Santa Claus story, which offers much more than merely a fresh face on an old tale.  The Santa angle has that universal appeal that will attract viewers initially, but what makes this story really accessible is the reality which lies beneath the fantasy.  The relationships examined in this film-- the whole situation with Scott, Charlie, Laura and Neal-- are quite common in our modern world, and that obstacle in the lives of these characters puts a necessary balance in the story that makes it more than just another Christmas fantasy.  It puts an edge on the sentimentality that would've been over-the-top had Scott, for example, been a happily married man with a text book family life. That would've been good for maybe a one hour T.V. special on a Tuesday night, whereas this story and the way it's presented is unique and lends itself well to full length motion picture status.\tWhen you think of Tim Allen, you don't necessarily think in terms of Santa Claus-- his Tim Taylor, `Home Improvement' persona is simply too far-reaching (there are, in fact, some `in' jokes sprinkled subtly throughout this film, like when Scott, in Santa's workshop, picks up a toy tool belt and holds it up to himself)-- but it actually becomes a positive here, and another part of the appeal of this film.  it establishes Scott as a real person, an average guy attempting to cope with the everyday problems of everyday life.  And it keeps the core of the story grounded, which ultimately makes the fantasy work while giving it heart.  So, in retrospect, Allen was a perfect choice for the role of Scott Calvin, and in the long run this just may turn out to be one of his most memorable roles (which is somewhat ironic, as this was Allen's big screen debut), because this is certainly the kind of film that is bound to make a lot of people's annual `holiday movies to watch' list, falling into that category of films you can watch over and over again every Christmas season, like `A Christmas Story.' `Christmas Vacation,' `A Christmas Carol' and `It's A Wonderful Life.'  All films which, though certainly diverse, have at their center the spirit of Christmas along with family values and traditions, and all told in a way that enables the viewer to readily identify with the characters and the story, which is exactly what this film does.\tEric Lloyd turns in a good performance as Charlie, making his character believable while keeping him positive despite the conflicts which surround him, and Crewson and Reinhold are solid in their respective roles, as well. But in supporting roles, the standout performances come from David Krumholtz, as Bernard, Santa's Head Elf, and Paige Tamada, who is endearing as Judy, the Little Elf.  \tRounding out the supporting cast are Peter Boyle (Mr. Whittle), Mary Gross (Miss Daniels), Larry Brandenburg (Detective Nunzio), Judith Scott (Susan), Jayne Eastwood (Judy, the Waitress) and Joyce Guy (Principal Compton).  An entertaining and ultimately uplifting movie, `The Santa Clause' is funny and enjoyable and has a lot to offer in the way of family entertainment, the kind of film adults and kids alike are going to appreciate.  And it may even make you believe in some things you hadn't even considered before-- but that's for you to figure out as you watch the movie.  And that's the magic of the movies.  I rate this one 8/10.",
    "111": "I have seen this movie several times, and as I am writing this I am watching it with my family once again. With a holiday movie, it's best to turn off your brain and just enjoy--and on this level, this is an excellent film.Because there are so many reviews for this film already, I won't go into any in-depth discussion of the plot. If you don't know the plot, read through the other posts or just read the IMDb summary. Instead, I want to talk about what I liked and didn't like about the movie. The film manages to have a truly original plot (though the same cannot be said about its sequels), Tim Allen's acting is very good (even if you aren't a fan of his TV series--which I wasn't), the little boy who played his son was terrific (a good actor for a kid and cute as can be) and the film is a lot of fun. Negatives are not severe, but I just couldn't understand putting a few cuss words in a family film (which they did) and I also think that the characters of the mom and step-dad were a bit too stupid and annoying--perhaps they were a tad too one-dimensional and clichéd. Still, a nice family film and you could do a lot worse during the holidays than to watch this!",
    "112": "TIM ALLEN provides a bunch of chuckles and good cheer as the amiable, goofy father of ERIC LLOYD who sees Santa Claus take a tumble off his roof one Christmas Eve and finds he must substitute for the \"big guy,\" taking the reindeer to the North Pole toy shop for further directions along with his young son.The script is full of one-liners that Allen tosses off with comic skill. His father role is played for laughs but also has his tender side when moments call for it. His needling of JUDGE REINHOLD about his awful sweaters becomes a running joke. So do many of the other amusing moments in a script that is both clever and highly original. ERIC LLOYD proves to be an appealing child actor as the boy who urges his father to be a substitute Santa.To get a flavor of the dialog, just take a look at the \"quotes\" from the film on the Quote page.It's handsomely produced in wonderful color to give the film its winter atmosphere (filmed in Canada).Summing up: It's worth going along for the ride. A charming Christmas fantasy with lots of amusing situations. Brisk entertainment for the masses, it inspired a couple of sequels.",
    "113": "Review:\n'The Santa Clause' is a Christmas-family-comedy film directed by John Pasquin and is the first film in the 'Santa Clause' film series,\nI haven't seen this movie is years, at least since I was a kid. I was so excited to watch this with my son. The movie was very good but did have some elements worth discussing.\nThe movie stars Tim Allen as Scott Calvin, an ordinary man who accidentally causes Santa Claus to fall from his roof on Christmas Eve. When he and his young son, Charlie (Eric Lloyd), finish St. Nick's trip and deliveries, they go to the North Pole where Scott learns that he must become the new Santa and convince those he loves that he is indeed Santa Claus.\nI love Tim Allen's type of comedy and I think he was perfectly cast at this character both as Santa Claus and Scott Calvin. He was able to portray a family man who find it hard to balance family and work life and transforms slowly into jolly Saint Nick. He really steals the show. Eric Lloyd who plays his son also does a good job and the chemistry between the two really show a lot of heart.\nThe story is great and is captures the Christmas spirit close to the end of the film, but I was very surprised by how much they talk about Santa not being real. That's the bulk of the movie really, which is fine when we get to end of the film but watching it with my son who does still believe in Santa, it kind of made me nervous.\nOverall, it is a great family friendly Christmas movie. I just wish it got toned down a bit more on the Santa not being real, but that's just a personal preference on my part. It's definitely a classic Holiday movie for all to enjoy.\n4/5",
    "114": "BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM VERY HONEST ABOUT THESE FILMS.I do not like Tim Allen as a person but I can put that aside and still enjoy this film. In this film Divorced dad Scott (Tim Allen) has custody of his son (Eric Lloyd) on Christmas Eve. After he accidentally kills a man in a Santa suit, they are magically transported to the North Pole, where an elf explains that Scott must take Santa's place before the next Christmas arrives. Scott thinks he's dreaming, but over the next several months he gains weight and grows an inexplicably white beard. Maybe that night at the North Pole wasn't a dream after all - - and maybe Scott has a lot of work to do.This film really works and works well, It is a modern tale about family and having faith in others even when they might not have it themselves! The laughs come very frequently and there is Charm to spare. I love this movie!",
    "115": "When a toy manufacturer (Tim Allen) inadvertently kills Santa (actor unknown) on Christmas Eve, he finds himself magically recruited to take his place. Tim Allen has a criminal record and Disney has a no hiring of ex-cons policy. An exception was made in this case. Odd, really. They had first considered Bill Murray and Chevy Chase, but settled on Allen. I think this may have been good. While both Chase or Murray could possibly have been better, they also both have their own notable Christmas movies, so it was time to pick a new comedian.I am not big on Tim Allen, despite liking \"Home Improvement\" and enjoying his role here for the most part. I am, however, a fan of Judge Reinhold. This film is really great, though Reinhold gets the shaft. He is more or less a background character who wears ugly sweaters. (Why he has such a strong interest in the custody of a kid that is not his is open to speculation.) Allen shines, and as far as kids movies go, this is a pretty good one. Not sure how well it jibes with other Christmas or Santa myths, but I guess kids are not smart enough to really put that all together.There could also be some debate about whether or not Santa is \"killed\". He falls off a roof, moves his hand a bit, and disappears. Now maybe this is because it would be too grim for a kids movie to have a corpse in a snow bank, but I suspect he did not actually die but simply faded away... it is left open to speculation.One nice thing about this film is how it has humor for a wide age range. While geared towards children for the most part, there is still a healthy dose of more adult humor. No outright sex or violence, but some not-too-veiled references to drug use and other things not necessarily appropriate. But this is why it worked to cast Allen, because having him be completely G-rated seems out of place.Definitely a much better Tim Allen Christmas film than \"Christmas With the Kranks\".",
    "116": "If there is such a disease as \"holiday film rapture\" then this is the title that infected me. Not just in 1994 when it was originally released, but forever. There are so many good things about this film that I would need several pages just to sufficiently list them. I can't, so I won't.\"The Santa Clause\" is the first Christmas film I ever watched that dared to explain to the \"inner child\" in me several valuable details, such as how Kris Kringle is able to get down chimneys that are way too small for the fat man to navigate, or how he is able to enter homes that have no chimneys at all. But most importantly to me, the question is finally answered (in layperson's terms) how Santa is able to visit everybody's home in a single night. Didn't you want to know that too? I certainly did!This particular saga of Santa Claus involves how Scott Calvin, a divorced father, unexpectedly assumes the significantly important job of Santa, and how this change affects his relationship with his young son, Charlie. Scott learns he is the latest in a succession of Santas, and, surprisingly, although he inherits certain magical abilities and powers, he is quite mortal. Falling off a roof could easily end his career as the big man.The Santa Clause and its two sequels are my perennial favorite holiday films. I've enjoyed them all for so many reasons, all of which come down to the fact that Tim Allen and his supporting cast create some of the most memorable holiday entertainment since Frank Capra's It's A Wonderful Life (1947). In addition to its many memorable charms, the movie actually transcends into a genuine inspiration of belief, trust, and hope, qualities, I'm sad to say, that have become fairly rare in our often dispirited, cynical world of 2021.Perhaps it is The Santa Clause's incipient themes of belief, trust, and hope that continues to pull in new fans of this wonderful film with each new generation of audiences. \"Seeing isn't believing; believing is seeing.\" How we perceive the world is governed by our belief that faith often precedes sight.",
    "117": "It gets more difficult this time each year to sit down in front of a good Christmas film, but this Disney feature from the 90's was a pleasant surprise. Tim Allen is the fast-talking salesman single parent trying to connect with his reluctant young son on Christmas Eve. Junior it seems would rather be with his mother and her new man, a confident, handsome psychiatrist with a penchant for wearing garish sweaters. The only thing that really links the boy with his dad is their shared belief in Santa Claus unlike his more modern-thinking mum and partner. Christmas Eve goes fairly disastrously between father and son, as they find themselves in a cafe amusingly populated by a host of other single dads and their kids after Tim burns the turkey before the tetchy, tired dad puts his son down to bed for the big sleep. However when they're awakened by noises on the roof, an unimaginable chain of events opens up ahead of them, not only affecting this Christmas but all their Christmases to come.For me the film pitched itself just nicely between catering to adults and children. There are plenty of good grown-up, but never crude, if you can forgive a couple of flatulence episodes, jokes and sight-gags especially as Allen's plight dawns on him, even a simple one like the police sketch-plan used to corner this new Santa prominently featuring a cop's favourite haunt, the do'nut shop, had me smiling. Sure one or two of the kids playing elves seemed to be reading their lines off cue-cards, but head elf Bernard and especially the little girl playing the worldly elf Judy are a delight.Allen himself is very good, especially when he bulks up to fill the big man's shoes (and robe and hat) and if his boy Charlie initially seems like another production-line cute, smart, mop-haired kid, even he gets some neat lines and develops a likeable personality. The special effects are nice, involving the reindeer sleigh and answering that old chestnut as to how Santa gets down chimneys without fireplaces, even if they are slightly dated by modern standards and I liked the ending for the way it didn't take the easy resolution it looked for a long time it was headed.In short, this was very enjoyable festive family entertainment, recommended Christmas viewing.",
    "118": "Some people may not call it this, but for me, \"The Santa Clause\" is a Christmas favorite. I have seen it at least ten times and it is one of my traditions to watch it at least once during every Christmas season. It's a very funny film, and Tim Allen manages to deliver some of his very best and funniest lines ever, which do not deserve to be spoiled in this comment. It's also a very original and engaging story; a divorced dad must take over the job of Santa after the real Santa falls off his roof, but first his son has to help him warm up to the idea. That being said, I admit that it's not a perfect film (ex: Tim Allen's son is kind of bratty), but for a movie like this I'm willing to settle for less than perfect. Few family films are this funny for kids and adults alike. Tim Allen makes more hilarious wisecracks here than in any other film I have seen him in. Seeing him go from a sarcastic divorced father to a loving Santa Claus is a very touching story, and the concept of a \"Santa Clause\" (a contract to become Santa) is completely original. If you haven't seen this film, watch it this Christmas. This is a real treat. I have seen it enough times to know, and I still enjoy it every year.***1/2 out of ****",
    "119": "An enjoyable little family delight, The Santa Clause may lack its spark and charm due to age, but there is still enough Christmas spirit to go around in this now holiday classic. I enjoy Tim Allen in this film, granted he overdoes it a bit, but he fully commits to the role at hand, and even provides a rather convincing transformation into Santa Claus in the film. I didn't really enjoy the performance from Eric Lloyd, or really any kid actors in the film. Several of the supporting performances also prove to be a bit annoying after a point, although it also may be the script which can also be rather repetitive. Despite these flaws, I found the film rather entertaining, and Allen's charismatic nature to tie the film together as a silly, but rather fun ride. It certainly has charm, some of it lost throughout its dated use of special effects, but enough in a general sense to make pretty much anyone smile. In the end, The Santa Clause is an enjoyable little family flick that has its fair share of problems, but ultimately proves to be just fun enough to be worth another watch.\nMy Rating: 7.75/10",
    "120": "Tim Allen plays Scott, a divorced toy executive who spends time with his son on Christmas Eve. They end up in Dennys as he burns the turkey but later that night he hears a sound. It turns out to be Santa who stumbled off the roof and died. Scott is persuaded by his son to don the Santa suit but accidentally invokes the Santa Clause. Scott is obligated to become the new Santa. A strange way to choose a new Santa, if you think about it we have a chain of accidental or unwilling Santa Claus's.So Scott with reindeer's and sleigh goes out to complete the delivery of the presents on Christmas Eve and he can magically go down chimneys and magical fireplaces appear.Things go a little Miracle on 34th Street as his son believes his dad is the real Santa. His ex-wife and her new nerdy husband who is also a psychiatrist are sceptical and fight to end Scott's visitation rights. It does not help that Scott has now put on a lot of weight and magically sprouted long grey hair and beard.The film was a big hit at the box office when it was released. It is a pleasant family film enjoyable by kids, slightly old fashioned but passable CGI effects. I thought the whole visitation rights subplot was rather silly and far fetched.",
    "121": "In European countries the annual gift-giving 'character' of Saint Nicholas is more commonly known as Sinter Klaus, a sort of colloquial term. This Sinter Klaus was changed to Santa Claus for English-speaking countries where he adopted the role of the more generic character of 'Father Christmas'. Since the dawn of Xmas Commercialism the Santa image has been used by pretty much everyone to sell their crappy products. THIS is how kids in modern society are introduced to a such a ridiculous fantasy figure. Why do any parents feed their kids this nonsensical crap? Imagination is fine. But lying to them about something that a 5-year-old should be able to see through is stupid.That said, as purely a fantasy movie, The Santa Clause is quite amusing. But maybe a bit too obnoxious to be a Xmas Classic. It was only made to cash-in on Tim Allen's Home Improvement success (and directed by a Home Improvement director) on the Disney Channel (which is even referenced rather unsubtly). I suppose it was a lucrative idea, but since I believe Tim Allen is completely talentless it's not really his own success. Santa Claus sells. Not Tim Allen. That's why all his other movies have been complete failures.Allen plays the curiously initialled Scott Calvin, a man who accidentally kills Santa on Xmas Eve. Once he puts on the dead man's jacket he becomes the new Santa and is whisked away to the North Pole. Over the next year he undergoes a transformation from ordinary guy to fat, jolly fellow with a big, white beard. Much to the shock of his ex-wife and baffled boss Peter Boyle (who would later star in the sequels as Father Time).I know that this is strictly a movie for kids but even before I reached double digits I questioned the logic behind 'Santa'. Even the movie lacks basic sense-making. Why would anyone doubt the existence of the movie character Santa Claus? Who do they think delivers free gifts to their children every year? It doesn't add up! If you show this to your kids and back up the lunatic conspiracy that this junk is real then shame on you. If you tell them that it is a load of crap and that the film is strictly make-belief then bravo!",
    "122": "This is one of the first Christmas movies with a plot about someone turning into or becoming Santa Claus. The plot is strange, but far out enough to be somewhat interesting. The clause is in the contract. This is mostly comedy in a modern fairy tale. The sets, elaborate toy and workshop displays, and camera work are some of the pluses for this film. \"The Santa Clause\" just skirts on the edge of having a Christmas message. The various cast members are OK in their roles. Tim Allen is fine as Scott Calvin, whose initials just happen to be the same as those of Santa Claus. Judge Reinhold is OK in a familiar role as a lame Dr. Neil Miller. Wendy Crewson is OK as Laura, and Eric Lloyd plays Charlie Calvin. The various kids in the roles of elves aren't convincing enough for a kid's imagination. Some films were very good that used midget actors and other small people with excellent costumes and makeup. The wise-guy persona of Bernard the Elf (played by David Krumholtz) may be an effort to make this film modern, but it loses something more – in the image and lore of the North Pole elves.The film is good for a couple of laughs and smiles. But it's not of a caliber to be in an annual holiday film collection.",
    "123": "I remember The Santa Clause from 1994 and the good vibe it generated and the money it made. But at the time I gave it a pass; my children were teenagers and didn't have much interest in kids movies. Nor did I. But this holiday season I felt like feel-good movie. Something akin to A Christmas Story, one of my all-time favorites, but one I've seen too many times. I needed a new Christmas movie and The Santa Claus seemed like a promising candidate. Wrong.Tim Allen plays Scott Calvin, a workaholic divorced parent who cannot connect with his young son. And he desperately wants to, both for his son and to offset the influence of Mom's new boyfriend. But Scott can't do anything right. Then on Christmas Eve Scott accidentally kills Santa Clause. Funny, huh? The clause in the title is not a misspelling, but refers to the legal clause that requires anyone who offs Santa to take his place. This is cleverly done, although it is a bit maudlin. Well guess what happens? Scott learns the (non-religious) meaning of Christmas, bonds with his son, discovers himselfmake that a lot maudlin. In 1994 Tim Allen was riding high with his hit TV show, Home Improvement, and in The Santa Clause he plays Tim Allen playing Tim Allen playing Santa Clause. No stretch here. And the rest of the cast is just there as a foil for Tim. And the plot, however clever, just wasn't very entertaining to this reviewer. Actually, this minority commentator didn't like The Santa Clause very much at all, and certainly can't recommend it to anyone.",
    "124": "\"The Santa Clause\" is one of the best holiday movies of the last 16 years, though of course it's not better than \"A Christmas Story\" (1983). Directed by John Pasquin and starring \"Home Improvement\" Tim Allen, \"The Santa Clause\" promises to be a moving update on a classic Christmas fable - the story of Santa Claus.The story of the jolly old fat guy in a red coat who flies around the world on Christmas Eve in his sleigh with eight reindeer is lore known to all who believe. But in an age when science and reason have been known to kill children's fantasies, Disney again proves that seeing is believing (or in the case of the film, believing is seeing). While at 21 years of age, I certainly know there's no Santa, though there is always your inner-child telling you to believe that Christmas is the season of miracles, and that is exactly what transpires in \"The Santa Clause.\"Scott Calvin (Allen), the typical, overworked (and divorced) American dad, is one such disbeliever. His job as a corporate exec high up on the ladder of a successful toy manufacturing firm has put him at odds with his young son Charlie (Eric Lloyd), ex-wife Laura (Wendy Crewson) and her new husband Neil (Judge Reinhold), who's also a disbeliever and pig-headed psychiatrist but is otherwise a nice guy. As the holidays are approaching, Scott has custody of Charlie, who would rather be with his mother and Neil, since Scott doesn't know how to cook (he sets fire to the Christmas turkey) and the two wind up spending Christmas Eve at Denny's.Through this moving and fun Christmas-time picture, the filmmakers throw in a legal side: After Scott reads \"The Night Before Christmas\" to Charlie and turns in for the night, the two are awakened to find a guy in a red suit on their roof. A mishap occurs and said gentleman on the roof slides off to his doom. Scott finds a business card in the man's suit that informs him that by putting on the coat, he has entered into a legal binding (\"The Santa Clause,\" with an \"e\" at the end, meaning the last sentence of a contract, as explained by Bernard the Elf, played by David Krumholtz) to assume the rights and responsibilities of Santa Claus.So after one hectic night of delivering presents to children around the world and visiting his North Pole home and workshop, life returns to normal for Scott and Charlie, or so it seems. Charlie has apparently become so enamored by the experience that he believes his father really is Santa Claus. To the disbelievers, Charlie is just stuck in a child's fantasy. But as the year rolls on and the holidays are once again around the corner, Scott starts growing white hair and a beard and begins putting on the pounds, and it is clear that there is some holiday magic going on. (The movie also manages to resolve two ages-old questions that have nagged us all, including how Santa shoves his big old self down chimneys and how he's able to make his nightly rounds on Christmas Eve.)For all its typical Disney kind-hearted-ness, director Pasquin and his screenwriters Leo Benvenuti and Steve Rudnick manage to effectively capture everything there is to really love about the Jolly Old Fat Guy. Allen, everybody's favorite television comedian, fills out his role as the lousy-dad Scott Calvin who is inexplicably transformed into every kid's favorite holiday hero. As Allen gains weight at an incredible pace (courtesy of a body suit), this poor sap goes from doubter to believer in no time. Lloyd is a delight too, as young Charlie and whose love for his father transcends normal father-son relationships as he accompanies him on his holiday rounds.With the holidays rapidly approaching, it's time for me to get some Christmas shopping done, and down with watching some good ol' holiday movies.10/10",
    "125": "Be warned, this review is completely subjective due to excessive watching during childhood and adulthood in Christmastime. The Santa Clause might have a lot of faults, mostly referring to plot and general effects of the movie, but in my heart this is one of the best Christmas movies out there.In The Santa Clause we meet Scott Calvin, a successful toy maker (just like Santa!) who's become a bit estranged to his son after he divorced his wife. Christmas Eve comes and both Scott and his son find that Santa fell off the roof, unwillingly Scott takes Santas clothes and flies in the sleigh with Charlie (his son)- a Christmas adventure unfolds, one that transforms Scott both physically and mentally.This movie is so fun, it has its hilarious moments that honestly work for adults as well. It has that 90s style of writing that is fun and catchy (doesn't work as well for the kids/elves dialogues though). I also like how this premise is such an inventive one on the big lore oeuvre of Santa, when I watched this as a kid I actually believed this was the truth. Or partly the truth at least! Adding to this, despite this movie's simple premise it does add a lot of details that you can find after watching it more times, and that honestly just shows that they actually cared while making this movie.The actors are great too, not so much the child actors but that's ok really, some of them are good but that's all there is to this. Tim Allen shines in the titular role of Santa, the actors know what type of movie it is so they just have fun with it!Music is alright, it's your typical Disney fare, nothing too remarkable but effective of course.Now to some of the negatives, I guess a lot of the visual aspects have aged considerably- visual effects, costumes, etc etc. But honestly I think this kinda adds to the charm of the movie, it doesn't deter from the experience for me, it's just a movie of its time really, and I don't think kids even think about it when they watch it, it's the heart behind it that counts really.It also has some weird plot holes here and there, I understand why though because it's such a short movie so I guess they had to write around many of the parts that needed perhaps some explanation. One of the most glaring examples of this is of course one of the first things you encounter in the movie, and that is the old Santa disappearing (dying?) after falling off the roof. It's so funny how none of the elves are sad when they return to the North Pole. This is something that I've really been thinking about all these times that I watched the movie.Also the kids acting, it's the typical problem of adults just not knowing how to write kids dialogues in the movie but honestly, for a film like this it's alright. I know it gave me a spur of attitude cause I wanted to be like the Charlie or one of the elves.With the high rating I gave this movie you might think I'm biased, which I am obviously but it feels wrong to give it a lower rating- it's just against what I've felt and enjoyed by watching this movie, it deserves the high rating for making all of my Christmasses special, it's an old friend that I can't wait to visit every year. Cheers, the Santa Clause!",
    "126": "In European countries the annual gift-giving 'character' of Saint Nicholas is more commonly known as Sinter Klaus, a sort of colloquial term. This Sinter Klaus was changed to Santa Claus for English-speaking countries where he adopted the role of the more generic character of 'Father Christmas'. Since the dawn of Xmas Commercialism the Santa image has been used by pretty much everyone to sell their crappy products. THIS is how kids in modern society are introduced to a such a ridiculous fantasy figure. Why do any parents feed their kids this nonsensical crap? Imagination is fine. But lying to them about something that a 5-year-old should be able to see through is stupid.That said, as purely a fantasy movie, The Santa Clause is quite amusing. But maybe a bit too obnoxious to be a Xmas Classic. It was only made to cash-in on Tim Allen's Home Improvement success (and directed by a Home Improvement director) on the Disney Channel (which is even referenced rather unsubtly). I suppose it was a lucrative idea, but since I believe Tim Allen is completely talentless it's not really his own success. Santa Claus sells. Not Tim Allen. That's why all his other movies have been complete failures.Allen plays the curiously initialled Scott Calvin, a man who accidentally kills Santa on Xmas Eve. Once he puts on the dead man's jacket he becomes the new Santa and is whisked away to the North Pole. Over the next year he undergoes a transformation from ordinary guy to fat, jolly fellow with a big, white beard. Much to the shock of his ex-wife and baffled boss Peter Boyle (who would later star in the sequels as Father Time).I know that this is strictly a movie for kids but even before I reached double digits I questioned the logic behind 'Santa'. Even the movie lacks basic sense-making. Why would anyone doubt the existence of the movie character Santa Claus? Who do they think delivers free gifts to their children every year? It doesn't add up! If you show this to your kids and back up the lunatic conspiracy that this junk is real then shame on you. If you tell them that it is a load of crap and that the film is strictly make-belief then bravo!",
    "127": "This is one of the first Christmas movies with a plot about someone turning into or becoming Santa Claus. The plot is strange, but far out enough to be somewhat interesting. The clause is in the contract. This is mostly comedy in a modern fairy tale. The sets, elaborate toy and workshop displays, and camera work are some of the pluses for this film. \"The Santa Clause\" just skirts on the edge of having a Christmas message. The various cast members are OK in their roles. Tim Allen is fine as Scott Calvin, whose initials just happen to be the same as those of Santa Claus. Judge Reinhold is OK in a familiar role as a lame Dr. Neil Miller. Wendy Crewson is OK as Laura, and Eric Lloyd plays Charlie Calvin. The various kids in the roles of elves aren't convincing enough for a kid's imagination. Some films were very good that used midget actors and other small people with excellent costumes and makeup. The wise-guy persona of Bernard the Elf (played by David Krumholtz) may be an effort to make this film modern, but it loses something more – in the image and lore of the North Pole elves.The film is good for a couple of laughs and smiles. But it's not of a caliber to be in an annual holiday film collection.",
    "128": "I remember The Santa Clause from 1994 and the good vibe it generated and the money it made. But at the time I gave it a pass; my children were teenagers and didn't have much interest in kids movies. Nor did I. But this holiday season I felt like feel-good movie. Something akin to A Christmas Story, one of my all-time favorites, but one I've seen too many times. I needed a new Christmas movie and The Santa Claus seemed like a promising candidate. Wrong.Tim Allen plays Scott Calvin, a workaholic divorced parent who cannot connect with his young son. And he desperately wants to, both for his son and to offset the influence of Mom's new boyfriend. But Scott can't do anything right. Then on Christmas Eve Scott accidentally kills Santa Clause. Funny, huh? The clause in the title is not a misspelling, but refers to the legal clause that requires anyone who offs Santa to take his place. This is cleverly done, although it is a bit maudlin. Well guess what happens? Scott learns the (non-religious) meaning of Christmas, bonds with his son, discovers himselfmake that a lot maudlin. In 1994 Tim Allen was riding high with his hit TV show, Home Improvement, and in The Santa Clause he plays Tim Allen playing Tim Allen playing Santa Clause. No stretch here. And the rest of the cast is just there as a foil for Tim. And the plot, however clever, just wasn't very entertaining to this reviewer. Actually, this minority commentator didn't like The Santa Clause very much at all, and certainly can't recommend it to anyone.",
    "129": "\"The Santa Clause\" is one of the best holiday movies of the last 16 years, though of course it's not better than \"A Christmas Story\" (1983). Directed by John Pasquin and starring \"Home Improvement\" Tim Allen, \"The Santa Clause\" promises to be a moving update on a classic Christmas fable - the story of Santa Claus.The story of the jolly old fat guy in a red coat who flies around the world on Christmas Eve in his sleigh with eight reindeer is lore known to all who believe. But in an age when science and reason have been known to kill children's fantasies, Disney again proves that seeing is believing (or in the case of the film, believing is seeing). While at 21 years of age, I certainly know there's no Santa, though there is always your inner-child telling you to believe that Christmas is the season of miracles, and that is exactly what transpires in \"The Santa Clause.\"Scott Calvin (Allen), the typical, overworked (and divorced) American dad, is one such disbeliever. His job as a corporate exec high up on the ladder of a successful toy manufacturing firm has put him at odds with his young son Charlie (Eric Lloyd), ex-wife Laura (Wendy Crewson) and her new husband Neil (Judge Reinhold), who's also a disbeliever and pig-headed psychiatrist but is otherwise a nice guy. As the holidays are approaching, Scott has custody of Charlie, who would rather be with his mother and Neil, since Scott doesn't know how to cook (he sets fire to the Christmas turkey) and the two wind up spending Christmas Eve at Denny's.Through this moving and fun Christmas-time picture, the filmmakers throw in a legal side: After Scott reads \"The Night Before Christmas\" to Charlie and turns in for the night, the two are awakened to find a guy in a red suit on their roof. A mishap occurs and said gentleman on the roof slides off to his doom. Scott finds a business card in the man's suit that informs him that by putting on the coat, he has entered into a legal binding (\"The Santa Clause,\" with an \"e\" at the end, meaning the last sentence of a contract, as explained by Bernard the Elf, played by David Krumholtz) to assume the rights and responsibilities of Santa Claus.So after one hectic night of delivering presents to children around the world and visiting his North Pole home and workshop, life returns to normal for Scott and Charlie, or so it seems. Charlie has apparently become so enamored by the experience that he believes his father really is Santa Claus. To the disbelievers, Charlie is just stuck in a child's fantasy. But as the year rolls on and the holidays are once again around the corner, Scott starts growing white hair and a beard and begins putting on the pounds, and it is clear that there is some holiday magic going on. (The movie also manages to resolve two ages-old questions that have nagged us all, including how Santa shoves his big old self down chimneys and how he's able to make his nightly rounds on Christmas Eve.)For all its typical Disney kind-hearted-ness, director Pasquin and his screenwriters Leo Benvenuti and Steve Rudnick manage to effectively capture everything there is to really love about the Jolly Old Fat Guy. Allen, everybody's favorite television comedian, fills out his role as the lousy-dad Scott Calvin who is inexplicably transformed into every kid's favorite holiday hero. As Allen gains weight at an incredible pace (courtesy of a body suit), this poor sap goes from doubter to believer in no time. Lloyd is a delight too, as young Charlie and whose love for his father transcends normal father-son relationships as he accompanies him on his holiday rounds.With the holidays rapidly approaching, it's time for me to get some Christmas shopping done, and down with watching some good ol' holiday movies.10/10",
    "130": "Be warned, this review is completely subjective due to excessive watching during childhood and adulthood in Christmastime. The Santa Clause might have a lot of faults, mostly referring to plot and general effects of the movie, but in my heart this is one of the best Christmas movies out there.In The Santa Clause we meet Scott Calvin, a successful toy maker (just like Santa!) who's become a bit estranged to his son after he divorced his wife. Christmas Eve comes and both Scott and his son find that Santa fell off the roof, unwillingly Scott takes Santas clothes and flies in the sleigh with Charlie (his son)- a Christmas adventure unfolds, one that transforms Scott both physically and mentally.This movie is so fun, it has its hilarious moments that honestly work for adults as well. It has that 90s style of writing that is fun and catchy (doesn't work as well for the kids/elves dialogues though). I also like how this premise is such an inventive one on the big lore oeuvre of Santa, when I watched this as a kid I actually believed this was the truth. Or partly the truth at least! Adding to this, despite this movie's simple premise it does add a lot of details that you can find after watching it more times, and that honestly just shows that they actually cared while making this movie.The actors are great too, not so much the child actors but that's ok really, some of them are good but that's all there is to this. Tim Allen shines in the titular role of Santa, the actors know what type of movie it is so they just have fun with it!Music is alright, it's your typical Disney fare, nothing too remarkable but effective of course.Now to some of the negatives, I guess a lot of the visual aspects have aged considerably- visual effects, costumes, etc etc. But honestly I think this kinda adds to the charm of the movie, it doesn't deter from the experience for me, it's just a movie of its time really, and I don't think kids even think about it when they watch it, it's the heart behind it that counts really.It also has some weird plot holes here and there, I understand why though because it's such a short movie so I guess they had to write around many of the parts that needed perhaps some explanation. One of the most glaring examples of this is of course one of the first things you encounter in the movie, and that is the old Santa disappearing (dying?) after falling off the roof. It's so funny how none of the elves are sad when they return to the North Pole. This is something that I've really been thinking about all these times that I watched the movie.Also the kids acting, it's the typical problem of adults just not knowing how to write kids dialogues in the movie but honestly, for a film like this it's alright. I know it gave me a spur of attitude cause I wanted to be like the Charlie or one of the elves.With the high rating I gave this movie you might think I'm biased, which I am obviously but it feels wrong to give it a lower rating- it's just against what I've felt and enjoyed by watching this movie, it deserves the high rating for making all of my Christmasses special, it's an old friend that I can't wait to visit every year. Cheers, the Santa Clause!",
    "131": "It seems this PG-rated family movie was a hit of its time, and although I never saw it in the theatre, I saw it at least once during my childhood when it came on TV, and as far as I recall, that was definitely a worthwhile first viewing. I'm not sure exactly how long it's been since then, but I have finally seen it again. Knowing that it wasn't the most highly praised Christmas movie, I didn't have super-high expectations, but thought maybe it would be mildly enjoyable. Sadly, for the most part, I didn't even find that.Scott Calvin is a divorced father whose son, Charlie comes to stay with him on Christmas Eve one year. That night, Charlie hears noise coming from the roof of the house, and goes to wake his father up! Scott then goes out to investigate, and calls up to a man on the roof, who then falls off! Although Scott doesn't believe this is actually Santa Clause at first (he stopped believing in Santa long ago), he finds instructions to continue the job from there, and he and Charlie soon start flying around from house to house in the sleigh, as Scott delivers the presents! Once finished, the father and son are taken to the North Pole, where Scott is told that since he has put the suit on, he is now Santa! The next morning, it seems like it was all just a dream to Scott, but Charlie is convinced that his father really is Santa Clause! As the following year goes by, Scott finds himself gaining weight and growing facial hair at a rapid pace! He is now convinced it's all true, but obviously not too many others would believe it, so can he trust Charlie to keep it a secret? During my most recent viewing of \"The Santa Clause\", at first, I had trouble getting into it, but around the part where Scott and Charlie are out investigating, it started to look more promising, even though the farting reindeer was uncalled for. However, starting with the North Pole, I found that it went back downhill. During the film, I laughed or smiled here and there, but not too many of the gags were memorable. Scott about to be sucked through a pipe in a house that has no chimney is a memorable and funny scene, but there are not too many others I can think of. I was also expecting to find the movie touching towards the end, but I found the moments (at least most of them) that were supposed to be like that pretty silly, with the fairly poor acting and script.I haven't seen every film starring Tim Allen, but looking through his credits, it appears that he hasn't had the greatest career in Hollywood history. While \"The Santa Clause\" has clearly been well received in comparison to some of his other films, better family Christmas flicks have been made. I'm sure there are films of this kind with equal entertainment value for kids and adults, but I can't say \"The Santa Clause\" is a very good example. It may not be strictly for kids (it would probably have a lower IMDb rating than 6.0/10 if it was), but more for kids than for adults, no doubt about that. Watching it shortly before Christmas, it didn't really put me in the spirit, which was not the case when I saw it years ago.",
    "132": "The Santa Clause (1994) is a movie I recently watched with my daughter on Disney+. The storyline follows a dad who has joint custody of his son. One Christmas Eve Santa falls off his roof, dies and leaves a card for his replacement. When the dad finds the card initially he doesn't believe the content but soon, as he starts turning into Santa, he finds it tough to balance his custody arrangement and his new job.This movie is directed by John Pasquin (Home Improvement) and stars Tim Allen (Toy Story), Judge Reinhold (Beverly Hills Cop), Wendy Crewson (Air Force One), Eric Lloyd (Jesse), Peter Boyle (Young Frankenstein) and Larry Brandenburg (Fargo).The storyline for this had more depth than you may anticipate. The coparenting storyline was really well done. The scenarios within the storyline are fun and entertaining. The CGI isn't good and is definitely dated but there's a worthwhile conclusion that makes watching the film worth it.Overall this is an above average addition to the holiday film universe but is a step down from being a classic. I'd score this a 6.5/10 and recommend seeing it once.",
    "133": "Like Miracle on 34th Styreet, Christams is just not Christmas with a viewing of The Santa Clause.Normally, I am not a big Tim Allen fan. In fact, other than this one and the sequel, I do not recall seeing any of his movies, having gotten more than enough on the few Home Improvement episodes I saw to know I didn't really like him. But, he really does a bang up job here and this is a favorite film.Judge Reinhold as Dr. Miller brings the same cutting edge humor that he had with Eddie Murphy in the Beverly Hills Cop movies. he is a riot as a psychologist.And, of course, there's Bernard (David Krumholtz), the head elf, that really makes a great comic pair with Allen.And, damn it, Judy (Paige Tamada) was just so cute!",
    "134": "Scott Calvin (Tim Allen) is a successful toy company executive who is considerably less successful as a family man. Scott's son Charlie (Eric Lloyd) is reluctant to spend Christmas with Scott with Scott surprised to learn his ex-wife, Laura (Wendy Crewson) and her new husband Dr. Neil Miller (Judge Reinhold) have told Charlie there's no Santa Claus much to Scott's frustration. Scott tries to create a nice Christmas for Charlie only for mishaps to take place. Later that night Scott is awoken by Charlie when he hears a noise on the roof. When Scott investigates he inadvertently startles a man on his roof dressed in a Santa suit causing him to fall off the roof. Upon checking the pockets of the man, all Scott can find is a card telling him to put on the suit if something happens which is shortly followed by the man disappearing leaving behind the suit. Scott further discovers a reindeer drawn sleigh on the roof of his house and following some coaxing from Charlie the two set off in the sleigh delivering the gifts in the bag. The sleigh eventually takes the two to the North Pole where Bernard the Head Elf (David Krumholtz) informs Scott that in donning the Santa Clause suit, he has become subject to the Santa Clause wherein he is the new Santa and is given until next Thanksgiving to get his affairs in order and assume his duties. Over the following year, Charlie exuberantly tells everyone that Scott is in fact Santa Clause which leads to tension between Laura, Neil, and Scott compounded by Scott adopting the physical traits of Santa Claus with a big white beard he can't get rid of and a rapid weight gain.The Santa Clause began as a spec script by writers Steve Rudnick and Leo Benvenuti and quickly became a desired commodity before being acquired by Disney label Hollywood Pictures in 1992. Various actors such as Bill Murray, Chevy Chase, and Tom Hanks were considered for the role of Scott Calvin before Hollywood Pictures decided to use the script as a vehicle for up and coming talent, Tim Allen, whose sitcom Home Improvement in its sophomore season had made Allen a household name. Directed by John Pasquin who had helmed a number of Home Improvement episodes, The Santa Clause became a sleeper hit in 1994 managing to stay in the top 3 spots for 7 weeks throughout the Holiday season and making $190 million against its $22 million budget, launching both a film series and Tim Allen to film stardom. The movie has a really strong premise, but unfortunately it often sidelines its premise with its ham handed family melodrama that's more grating than endearing.The best scenes of The Santa Clause are when Tim Allen's Scott Calvin tries to keep his Santa features under wraps to little success with some humorous scenes involving the absurd number of boxes containing the Naughty and Nice list dropped off at his home, or a scene in his company's board room where he finds himself irresistibly railing against the cynical commercialization of Christmas and the poor quality toys that are shoved at children through blitz marketing. Admittedly it's stuff we've seen before such as in the original Miracle on 34th Street, but Tim Allen's energy helps bring a modern spin on the take that makes it feel fresh. The sight gags in the film are also pretty amusing with Tim Allen's make-up and fat suit scenes such as when Scott sits on a bench in a park causes kids to line up to speak with him do work quite well.What doesn't work is the family melodrama with Charlie's belief in Santa Claus serving as a point of contention between Laura, Neil, and Scott to an absolutely ridiculous level. Admittedly when the \"physical\" manifestations start some of their concern is understandable, but the level of vitriol that comes from Charlie's steadfast belief in Santa seems ridiculously overblown and feels like it's trying to ape a similar dynamic to what was seen in the Robin Williams movie Mrs. Doubtfire, but to far less successful results. This plot also leads to an overblown climax involving Neil and Laura calling the police on Scott following an extremely boneheaded decision on Scott's part that's not all that funny and comes off as more uncomfortable (especially in how it parallels with real life custody disputes).There are some strong elements on display in The Santa Clause with Tim Allen giving a strong performance as Scott Calvin/Santa, but the humor and energy are often suffocated what feels like poorly imitated Chris Columbus melodrama from Stepmom or Mrs. Doubtfire. The Santa Clause is okay, but its premise was so rich it's a shame it didn't do more with it.",
    "135": "This is a delightful Christmas movie which my wife and I savoured on Christmas Eve, not having watched it before (and how many Christmas films can you say that about)? Like all the best Yuletide films, it requires the viewer to take a leap of faith and believe the unbelievable so that once you do that you're taken along for the ride and in this case, an entertaining and amusing ride it certainly is.Tim Allen stars as the divorced dad who feels diminished next to his ex-wife and her new man, who naturally is younger, better-looking and higher-earning, though with a taste for gaudily patterned pullovers. Even his relationship with his young son is beginning to pall, despite his best, if misguided efforts but when his rival, a myth-defying, dream-denying psychiatrist attempts to brainwash young Charlie that Santa doesn't exist, it's obvious that it's going to take something exceptional for him to turn the situation around. Cue a fateful encounter with an unexpected visitor on the roof on Christmas Eve and the fun really starts.While some of the special-effects are a little weak, in general this movie gently and neatly encapsulates the elusive Christmas spirit with a nicely judged mix of childish wonder and knowing humour for grown-ups,making it an easy film for parents and children to watch together. Neat touches abound, with pointy-eared elves turning up everywhere, running gags inserted into the narrative and some pleasing sight gags (I liked especially the cops map of the area surrounding Allen's house as they set up the Santa sting, a do-nut shop prominently highlighted for easy reference).Allen makes for a believable, under-achieving dad who eventually accepts his transformation and so wins back his son's affection. The child actor playing his son too I found refreshingly cute-free. Interestingly, the story has no real baddie to pitch them up against, unless you're going to vilify Judge Reinhold for denying Santa's existence.Watching this pleasant and amusing film certainly set our household up for this coming Christmas in what I certainly rate as one of the superior Christmas-themed films.",
    "136": "'The Santa Clause' is an undemanding, simple & sweet film, that entertains its viewer. Its amongst the better films based on the lovable Christmas legend. 'The Santa Clause' Synopsis: When a man inadvertently kills Santa on Christmas Eve, he finds himself magically recruited to take his place.We all grew up on Santa & We still live the magic of Christmas. 'The Santa Clause' celebrates the spirit of Santa. It takes us to North Pole & depicts the magic of it. Leo Benvenuti, Steve Rudnick & Karey Kirkpatrick's Screenplay is celebratory & entertaining. John Pasquin's Direction is perfect. Cinematography, Editing & Art Design, are awesome.Performance-Wise: Tim Allen is terrific as Santa Clause. He's the life of the show. Eric Lloyd is adorable. Wendy Crewson is effective. Judge Reinhold is okay. The Late/Great Peter Boyle is good in a brief role.On the whole, 'The Santa Clause' is a film that touches the core of your heart.",
    "137": "I have seen this since I was 4 years old(yeah that long)and it is quite good for a Christmas movie.Tim Allen(the guy who is famous for voicing Buzz Lightyear in the Toy Story franchise)plays Scott Clavin a man who doesn't like Christmas and is a divorced father to a boy named Charlie(Eric Lyod). One night Charlie hears Santa on the roof but when Scott goes outside and yells at him from the roof Santa falls down from the roof and dies. Scott then decides to put on the suit and he is magically transformed into Santa. At first he doesn't want to be him as he is a scrooge but he discovers that being Santa isn't as bad as he thought. Some parts are hilarious I think it was the one where all the elves try and get Scott back(or was that the sequel) anyway if you can't wait for chrismtas then check this out on RTE ONE @6:35 as the big big movie Dec 4th.Great family fun.",
    "138": "The Santa Clause is a great movie with a very well developed storyline and a good cast.I love watching this movie and the other two installments every Christmas,I enjoy them for the nostalgia purpose as I watched it constantly as a child at Christmas and it reminds me of a time when I believed in Santa Claus,and it also gets me in to the Christmas cheer.Tim Allen is without a doubt my favourite portrayal of Father Christmas,he suits the role of a man who is forced to be become Santa and really has no idea what he's suppose to do perfectly,Scott Calvin is a sweet and lovable character and I couldn't imagine anyone other than Allen playing him.The Santa Clause is a very enjoyable movie that I would definitely recommend for a family to watch at Christmas time. After trying on Santa's suit after an incident on Christmas Eve,Scott Calvin is forced to become the new Father Christmas. Best Performance: Tim Allen Worst Performance: Peter Boyle",
    "139": "Despite \"The Santa Clause\" being a holiday season institution from the 1990s, this old millennial had--for whatever reason--never seen it from beginning to end. I'm glad I finally got around to it, as I found a surprisingly potent/emotional story also filled with humor and fun.For a very basic overview, \"The Santa Clause\" tells the story of Scott Calvin (Tim Allen), a workaholic father going through a divorce over the holidays. On the one night--Christmas Eve--he gets son Charlie (Eric Lloyd), Calvin accidentally startles the real SC off the roof and inadvertently picks up the big guy's mantle! Hilarity and adventure ensue as Scott and Charlie are whisked away to the North Pole for a life-changing mission.As a baseline, \"The Santa Clause\" is a good flick because it is simply just a lot of fun. There's a lot of humor here--bolstered by Allen's hilarious quips--and a sort of cutting-edge coolness that kids-of-a-certain-age will appreciate (hip elves, North Pole tech, etc.). The production values here are quite high--not just a Disney knock-off--and it's clear that a lot of thought was put into the storytelling overall. In other words, this seems to have an expectation of \"being something\" other than just a throwaway holiday special.But what vaults \"Santa Clause\" into 9-star range is the emotion present in the film's final 15-20 minutes. Through all the fun and humor, in the end this is a movie about a child of divorce (or at very least dysfunctional parents) and how the holidays can bring some reconciliation. Every emotional moment down the stretch is 100% earned and tear-jerkingly poignant, to which I credit writers Leo Benvenuti & Steve Rudnick.Because I didn't watch this one as a kid, I don't have any nostalgia to draw from it--which makes the overall high rating even more impressive! This isn't just a film that gets watched because it reminds you of childhood--director John Pasquin crafted a full-fledged gem of a film that stands up beyond simple remembrance.",
    "140": "Well, between elves with attitude and a job offer he can't refuse, Scott seems to be suffering a little identity crisis. Let's face it, he's a bit uncomfortable within his own skin, and nothing he can do will alleviate his discomfort.This is great fun, a bit dramatic, but exhibits that beautiful Spirit of Yule many of us experience once the weather turns frosty and the fireplaces are lit.Suitable for all ages, this is a new tradition for holiday viewing once the Yule tree is lit the weekend after Thanksgiving, along with Rudolph the Red-Nosed Reindeer and the Boris Karloff version of How The Grinch Stole Christmas.All in all? We thoroughly enjoyed it and highly recommend it for anyone who loves the season of Yule.This rates a 7.4/10 from...the Fiend :.",
    "141": "This is such a 90's film & such a 90's family Christmas film & Tim Allen is such a star of that time of the 90's.I'm a 90's kid & Tim Allen was a big comedic star back then with his Home Improvement show & being Buzz Lightyear from Toy Story & Galaxy Quest & then later with Toy Story 2 & Christmas With The Kranks & many more. Tim Allen is a funny guy & is hilarious here as a father who becomes Santa Clause.Yes Tim Allen plays a father who sees his little boy on weekends & one particular weekend of Christmas eve sets in motion a series of amazing events when the real Santa falls off of his roof & Calvin (Tim Allen) becomes the new Santa & brings him closer to his son. Of course this is full of sweetness as it's a Disney family film but it's also got plenty of fun humour & snarky remarks that only Tim Allen can do the way his does it. There's a huge sense of magic & 90's Nostalgia whilst watching this Christmas comedy & it does make you smile.The production design is lovely with it's huge colourful sets & nice early 90's effects & the cool 90's fashion which i love.Tim Allen is having so much fun with his part & he is a joy to watch & his performance is full of heart & fun.I like Judge Reinhold (Gremlins) too & it's always nice to see Peter Boyle (Red Heat,The Dream Team, Everybody Loves Raymond) & the film is full of festive fun & a big heart.",
    "142": "Scott had to look after his son after his ex-wife and new husband drop him off.The night he stay over, he then accident scare Santa and he falls of the roof and he himself become Santa Claus. As his son on trip to north pole, next day where no believe the kids, was little sad that no one believe him as not that enjoyable to watch.also went to Over the top with the elves with attitude, I found a bit silly however you can say think about small elves that look kids but can be 300 years old?, those elves did not bother me.This well acted and well paced movie and some very hilarious moment in this movie and a nice ending as well. 7 out of 10",
    "143": "In a way, Tim Allen makes the perfect, unassuming guy to be whisked away in a frenzy of holiday magic, and be told that he's next in line to become the jolly dude in the red suit. Allen always has an affable, breezy carelessness to him, like he was some suburban dad on the way to pick up his kids from hockey practice one day and happened to wander onto a movie set. The filmmakers saw his bewilderment, mistook him for an actor, and he's been putting out charming, occasionally decent fare ever since. In The Santa Clause, he really does play a suburban dad, the typically divorced kind. Scott Calvin is his name (get it?;) and his life is a bit of a mess following his split up with wife Wendy Crewson. She's together with a hotshot doctor now, making him bristly. I would get a bit up in arms if my wife took up with Judge friggin Reinhold too. So he spends Christmas with his son (Eric Lloyd) accidentally burning their turkey and ending up at Denny's for their Christmas feat, with all the other recently divorced dads. Things are mopey until an outright misunderstanding causes Scott to cause the death of Santa Claus (!) and spur on his recruit,net for the job. Most of the fun of the film is Allen's good natured disbelief upon reaching the North Pole and seeing inch of real love elves. Pretty soon his waistline balloons, snowy facial hair sprouts and it becomes clear that he really is destined to be the big guy. It's a slight, lighthearted flick that's perfect for kids, with really funny work from elves played by David Krumholtz and Paige Tanada, and a small, sly appearance from Peter Boyle. Allen steals the show, though, and is wonderful. As far as the sequels go, the second is pleasant overkill, anime yet to see the third with Martin Short as Jack 'Sonic The Hedgehog' Frost. I'm in no rush. This ones a nice dose of holiday cheer, though, and being a 90's movie, still holds up today.",
    "144": "Some comedians get worse with age and popularity. I think that they begin to think they can do anything and it will be immediately accepted by everyone. WRONG!Steve Martin, Eddie Murphy and now I add to the list Tim Allen. This movie is so bad that I felt pain forcing myself to sit through it. I wanted to see Dolf Longrin show up and fire blazing hot lead at everyone who had a speaking line in the movie - Judge freakin' Rheinhold?!? How'd he get kidnapped into doing this mistake? Peter freakin' Boyle?? Does he have the same agent as Rheinhold?!? -10/+10I don't care anymore - the scale of 1 to 10 no longer exists - as of today, the scale is from -10 to +10:-10 = burn the master,0 = tolerable if you're bored to tears,+10 = see this or else you're an alien!-ZafoidPS: Paige Tamada, who played \"Judy the Elf,\" was so adorable in the small part she got I kept hoping she would show up throughout the whole movie. When she first showed up my heart immediately went out to her and I was suddenly immersed in this movie. Then unfortunately the movie kept going and the pain returned.-Big Z",
    "145": "I know what you're thinking. What?! You're giving \"The Santa Clause\" a bad review? How could you?! My question to you is, have you actually seen this movie, and thought about what it really is? Because if you did, you'd agree with me that this is a shallow, not particularly imaginative Christmas film with some bad child actors and the only reason people have some affection for it is because Tim Allen makes for a pretty good Santa Claus. The premise of the film is that Scott Calvin (Tim Allen) is a divorced father who is taking care of his son Charlie (Eric Lloyd) on Christmas Eve. When they hear a noise on the roof of their house, they discover that Santa Claus is real... but he has disappeared, leaving only his clothes behind. Charlie convinces his father to put on the red suit, hop in the flying sleigh and finish delivering the presents, not knowing that this means that by doing this, his father has agreed to become the new Santa Claus.My biggest problem with this movie is that the story's message is a really shallow one. If you look at the character of Charlie at the beginning of the movie, he doesn't like his father, doesn't want to be anywhere near him and is overall being a pain in the neck. Numerous times, he reiterates that he wants to spend as little time with his dad as possible during the holidays. When his father starts turning into Santa Claus though, all of a sudden these feelings change. This kid only begins loving his father because he is magically turned into a man that gives toys away for free. Let's look at some of the lessons or messages that we get from some of the classic holiday stories. Dr. Seuss' \"How the Grinch Stole Christmas\" teaches even cynics that Christmas is not about presents, food or decorations, but about being together with the people you love and making the best of the holiday season. \"A Christmas Carol\" proclaims that the true spirit of Christmas is having good will towards your fellow man and extending a helpful hand out of generosity, and then goes on further to show that this spirit of Christmas should not be limited to only the 25th of December, but to every day of the year. \"It's a Wonderful Life\" shows that kindness and generosity are their own reward and that even when things seem to be dire and inescapably bad, the people that love you can gather and make it all OK; that one life, even if you don't think much of it, impacts countless others in a way that you can't fathom. What is the message of \"The Santa Clause\"? If your kid doesn't warm up to you during the holiday, magically transform yourself into Saint Nicholas, and he'll change his mind. Thanks for that! Maybe I'm looking too much into this movie. I bet you're just saying that this is a light family comedy, that's it. It doesn't mean to have any kind of message or deep meaning, it's just a Christmas-themed movie. I'll admit that it's not all bad. Tim Allen as Scott Calvin is actually really good. He has the best lines, throws himself fully in both the role of the frustrated father and Santa Claus and he not only looks the part, he feels right. Tim Allen, more than everything else in the movie combined made me laugh. I attribute the fact that people have affection for this movie solely on his performance and you can tell that he's having a good time. Considering he's the main character, that goes a long way.Even with Tim Allen doing what he does, this movie is still wrought with problems. This film feels like it was written not around a legitimate idea, but around the pun in the title. There are so many things that are unexplained or that flat-out make no sense. If Santa is running around giving people presents, why do the adults not connect two and two together when they see all of those gifts come Christmas morning? Why is it that only children believe in Saint Nick? Does no one spot him and his flying sleigh going around? Is there some kind of evil cabal that conspires against everyone in the world to oppress the belief of Santa Claus? Why is Santa kept a secret anyway? Maybe we'll get the answers in the sequels. Even if you dismiss these questions, there are some facts about this movie that are undeniable. First, the child actors are not very good. It's bad enough that Charlie, Scott's son is as wooden as a rocking horse, but every elf in this movie is played by a child (Well, one or two of them might be teenagers) and none of them are particularly convincing in their roles. I also really didn't care for the inconsistencies in the elf's magical powers and the numerous scenes where they feel the need to insert technology into Santa's Sleigh. He's been using magic for like a thousand years, and all of a sudden it's no longer good enough so they have to gives the elves jet packs (which leads to some big eye-rolls for me) and put all of these electronic gadgets in the sleigh. It just rubbed me the wrong way.I know a lot of people think of \"The Santa Clause\" as a holiday classic, but it's just alright. It's just one of the endless Christmas-themed family movies that are just churned out annually that hit that soft spot for a lot of people and families have associated it with quality and the holiday ever since. The message is shallow, the acting not particularly that good and the entire plot is based off a pun. Watch it for Tim Allen, but don't forsake one of the better Christmas films in order to watch \"The Santa Clause\". (On VHS, December 19, 2014)",
    "146": "It's certainly just your typical Santa tale with strengths and flaws, but Tim Allen's progression into the large and beardy man is plenty of witty fun. Obviously, this family Christmas comedy is light and shouldn't be taken seriously, so the performances and laughs are mostly forgettable, but don't edge to lameness either.Just to be clear, the acting isn't the big part, but Allen definitely is! The Santa Clause focuses on his character's hilarious transformation into the new Santa, after the previous one falls off his roof. There's also fairly logical aspect to the film which also effectively increases its entertainment level.Families with young kids will also highly appreciate what a holiday-set comedy truly needs: decent pacing, engaging dialogue and touches of humour. The Santa Clause definitely ticks the boxes for those categories, but the approval is much larger for kids than adults. Ignoring some uninteresting moments, the speed is great, but there also could've been more humour within all the chatter. It's nowhere near passing as the greatest holiday film, but it's always worth seeing on the night before Christmas.If you liked this review, check out the full review and other reviews at aussieboyreviews.",
    "147": "_The Santa Clause_ is the most distasteful and resoundingly mediocre film I have ever seen.  The underlying premise of the movie -- the violent death of the patron saint of children, treated as goofy slapstick -- is repellent, and none of the some forty-thousand extraneous subplots the filmmakers tack on can change this.What I hate most about this film is its smarminess.  Disney Studios has the ability, and the money, to make good comedies -- for example, its recent effort _The Kid_ was witty and entertaining.  But in lowest-common denominator efforts like _The Santa Clause,_ the Studio chucks all reliance on plot, character, or invention, and relies instead on what it imagines children will find amusing.  When Tim Allen first encounters Santa's reindeer, it's a no-brainer that one of them will be flatulent; hey, kids just love flatulence jokes!  When Tim as Santa drinks a glass of milk, of course he thinks it's turning sour!  Kids just adore gross-out humor! Everything in the movie is on autopilot, including the de rigeur badguy, the lame fat jokes, the whiny kid who saves the day and crawls under your skin like a parasite, and the treacly, nauseating ending in which I guess we are supposed to learn the true meaning of Christmas.  No films anger me as much as mediocre films -- films that are not willing to take a chance.  It is amazing how this film can take such a gruesome premise and play it off as a joke -- there is not even a moment's mourning for the passing of poor St. Nicholas.  In the ideal world, Frank Capra would rise from the dead and slap the snot out of Tim Allen for making such a cruel and lukewarm holiday film.",
    "148": "The Santa Clause is a funny and original movie and a worthy addition to the library of Christmas movies. Tim Allen is the leading actor and gets better as the role becomes more ridiculous or sympathetic, depending on your perspective. The movie takes an old theme of belief in Santa Claus and gives it a 1990's setting with parents who share custody of a lovable child, played by Eric Lloyd, who is starting to question if there is a real Santa. It is an issue that most families face or postpone but try to muddle through as best they can. The fantasy of Santa becomes a reality for the boy and his divorced father on a momentous Christmas Eve. Eventually both the boy and his father embrace the reality of Santa who takes possession of their lives. This leads to a collision with the \"real\" world of adults, teachers and the working environment. The mother is played by Wendy Crewson and the step-father by Judge Reinhold, in a fine performance as a serious psychiatrist badly shaken by the behaviour of the child and his father. David Krumholtz, 16 years old at the time, shines as the head elf. The movie is for adults or youth. Children would have a distorted and confused view of the Santa persona after viewing this movie but for others it's fine holiday entertainment."
}