{
    "0": "Rebel Moon - Part One: A Child of Fire\" directed by Zack Snyder is a visual and narrative triumph, setting a new standard for fantasy films. The meticulously crafted universe, stunning visuals, and compelling characters immerse audiences in a world on the brink of chaos. The film's pacing, blending action and character development, keeps viewers on the edge, while the ensemble cast delivers stellar performances. \"Rebel Moon\" transcends the fantasy genre, exploring profound themes with a thought-provoking and emotionally resonant touch. In just 100 minutes, Zack Snyder crafts a cinematic gem that leaves audiences eagerly anticipating the next chapter in this epic saga.",
    "1": "With great music to fuel your shaky feet throughout, rebel moon delivers a mood and feel through its characters, creatures and planet veldt. Incredible acting especially from Ed Skrien and Sofia. Amazing action scenes accompanied with cinematography and great visuals. Anthony Hopkins performance also shines through with his voice alone.I'm surprised that despite being called similar to star wars its more like heavy metal meets mad-max meets 300 with a mix of game of thrones and anime. The most insane mix up of genres but rather than end up a mess its a masterpiece and now the golden standard for Sci-Fi. How did he do it? So excited for the directors-cut.",
    "2": "Rebel Moon pt. 1 is built on the backs of the juggernaut sci-fi franchises that inspired it. There isn't a single original ideal in the entire film. Zack Snyder, although I'm sure he means well, cherry picks designs, plot points and characters from nearly every sci-fi franchise to ever exist. Its an amalgamation of STAR WARS, Star Trek, Farscape, District 9, Alien, Dune, Firefly/Serenity, and The 5th Element all shoe horned into one movie. There's tons of character development missing as the team assembles throughout the film, although I assume this is included in an extended cut, because of course there is another cut adding 30 minutes of additional footage. Maybe that cut will throw out an original idea.If you're a fan of Zack Snyder's other works you'll undoubtedly like this one. However until the rest if the story is told this film is nothing short of derivative garbage.",
    "3": "Zack Snyder's Rebel Moon Part 1- A Child of Fire is a phenomenal film that introduces you to this world and the characters that inhabit it. The narrative, acting, cinematography, CGI, VFX, SFX, were all on par, but the pacing issues is definitely something that I noticed, but this can easily be fixed in the extended, rated R version of the film. But, this film is great on it's own, and it sets up what's to come in this new sci-fi (or rather science fantasy) franchise that's going to change sci-fi. Overall, 8.5-9/10 💯. Snyder delivered big and this cinematic & expanded universe is gonna be dope. I can't wait for the extended rated R version and Part 2.",
    "4": "It's as if the creative minds behind it decided to combine the artistic prowess of a snail with the audacity of a cardboard box. Yes, my friend, you heard me right. The bar for originality was set so low that it could practically be used as a limbo stick by a toddler. Those characters, oh boy, they were about as memorable as a forgotten tweet in a sea of mundane social media posts. I mean, seriously, they failed to leave even the faintest imprint on the viewer's consciousness. It's astounding how something so lackluster managed to find its way onto the screen. We deserve depth, complexity, and narratives that leave us in awe, not just a shiny facade that crumbles upon closer inspection.",
    "5": "As someone who is a huge fan of Zack Snyder's filmography when I heard he was delving back into original films again I got super excited, when I heard it was an original Sci-fi I got even MORE excited. Rebel Moon is definitely good enough, I had extremely high expectations, and it did not meet all of them, and it is a VERY different movie from what I was expecting and in some ways that's very good but in some other ways its not as good. I definitely think the story, settings, visuals, plots, side plots, performances, & characters are all fantastic. Where I think the movie could have benefitted more was if more of its limited runtime was spent with the character interactions and just how they get along with each other. It almost feels as though we are in a similar situation to when Batman V Superman came out and we only had part of a movie, but this time I feel it more with this specific one. All in all, it's worth a try, has enough huge enjoyable moments that balances the bad with it and has huge potential. Looking forward to the directors cut that hopefully fixes these issues.",
    "6": "This is just the part 1 and I can't wait for part 2\nThe scale of this movie is unbelievable and also this movie is one of the beautifulest movie I watched this year.I think Zack Snyder really really payed attention to the details in this movie and this movie was so rich in methodology and more of its history.Every character's story and s open and they can go with it beyond the limits.I really in joyed this epic movie and I do recommend to all the people across the globe to watch it and have their own opinions about it, Netflix really should be proud of what they achieved.The cast is amazing and I hope I see them in the future as well they become my favorite.",
    "7": "Giving this an 8/10 ratingZack Snyder's latest film is Akria Kurosawa's 'Seven samurai' Done in space. Following 'Battle Beyond the Stars' and the anime series 'Samurai 7', the story is given the sci fi treatment. This was going to be a Star Wars film, but happened and what is happing at Lucasfilm, it did not work out, so now Netflix have it, in cinemas now, then on TV.Do try and catch it in the cinemas, as it was filmed for it and you will miss plenty if you don't. Sofia Boutella, takes the lead, and is good at it, getting into all sorts of trouble and looks. Djimon Hounsou, Charlie Hunnam, and the great cast mix it up well, floating along the weird and wonderful universe that the film is set in. A great deal of alien creatures, the locations of the different worlds, meeting all these good and bad people, mostly bad, with lots and lots of travelling. But is it any good, yes it is, I can't wait for part two and three.",
    "8": "Ah, the bittersweet symphony of \"Rebel Moon.\" I hear you there, fellow traveler to Pandora and Tatooine. We can both appreciate Zack Snyder's stylistic flourishes - the slow-mo ballet of violence, the operatic landscapes, the characters carved from myth. But as the curtain falls on \"Part One,\" a mournful sigh escapes. This could have been a glorious space opera, a love letter to sci-fi's golden age, yet it stumbles over familiar tropes and squanders its vast potential.Snyder's fingerprints are all over the screen. The visuals are undeniable - gargantuan spaceships casting ominous shadows, crimson blades carving through darkness, desert vistas whispering forgotten empires. He paints with a grand brush, but the canvas starts to feel repetitive. We've seen the grizzled warrior with a troubled past, the damsel in distress with hidden fire, the villain who chews scenery like it's his birthright. It's a well-worn costume rack, and while Snyder drapes it with his signature flair, the threads of originality begin to fray.The plot, a familiar melody of rebellion against tyranny, starts strong but loses its harmonic richness. Characters, instead of complex chords, become predictable arpeggios. Their motivations are thinly veiled, their backstories a rushed montage. The dialogue, meant to resonate like thunder, echoes with the hollowness of recycled sci-fi cliches.What hurts most is the unrealized potential. The glimpses of a deeper world, the whispers of ancient powers, the seeds of a nuanced conflict - all wither in the harsh glare of action sequences. Snyder loves his spectacle, and \"Rebel Moon\" is awash in it, but spectacle alone can't sustain a film. We crave emotion, depth, resonance. We want to be swept away, not merely bombarded.So, as the credits roll, a bittersweet symphony resonates. We acknowledge the maestro's talent, the flashes of brilliance, the echoes of what could have been. But the lingering taste is one of missed notes, of potential left unrealized. \"Rebel Moon\" is a spectacle, no doubt, but a hollow one, leaving us yearning for the sci-fi opera that might have been.",
    "9": "The Zack Snyder fanboy cult is legion. That's fine. Every crowd likes their own kind of music.Objectively this is what Snyder produces: gritty, dark, unhappy, overly serious, tedious stuff. Most of it's crappy. But there's always cool stuff to look at. He's kind of a poor man's Villaneuve.The rabid followers can say what they want about \"The Snyder Cut\" Justice League, but the reality is there's no broad market for unrelentingly dismal sludge. Why isn't there a Judge Dredd movie coming out soon? Or another Punisher film? Dark and too serious isn't fun to spend money on. Especially when it's not all that new.I do have to laugh though, at all the media hacks that are pissing and moaning about how derivative this is. And it is. But it mostly feels that way because Snyder wrote a script for a stand alone Star Wars story and was told by Lucasfilm (or maybe it was Disney) \"thanks, but no thanks\".So he went to the streaming giant that loves to produce expensive garbage so they can cancel it before it can develop any traction. This is that script brought to life. Or death, as Netflix may have it.It's not nice to hammer on creatives. But I for one am sick and tired of the waifish 90 pound girl warrior movies that have been all the rage lately. Other than Gunpowder Milkshake (which was hilarious) it's all a bunch of BS. I don't care if Maggie Q or Daisy Ridley (both decent actresses btw) are in it or not (they aren't in this in case you're confused), it's stupid. It was bad enough when Arnold, Sly and Bruce were ignoring the laws of physics in their various franchises, but we're all a little more savvy now and wouldn't buy that stuff from them in today's market either. But maybe I'm wrong, because there are now 4 Expendables movies in existence. God save us from the people who are buying tickets to those.It's free to subscribers next week, so have at it. Can't wait to see those reviews pour in.",
    "10": "Rebel Moon: A Child of Fire\" is the first chapter of Zack Snyder's new saga. He's looking for redemption in big projects after facing tough years and scorn at his old home.The project was born over 20 years ago, even before Snyder could imagine that he would become one of the greatest directors of today. His films, like \"Dawn of the Dead\", \"Watchmen\", \"300\", \"Man of Steel\" and \"Batman vs Superman\", are still debated and admired by the public.In \"Rebel Moon\", we see the director at the peak of his creativity, creating a stunning new fantasy world, full of elements that captivate the public's gaze. This project, however, almost had another fate. Zack Snyder presented his idea to Lucasfilm before it was sold to Disney, but he didn't make it and ended up putting it in the drawer. I think this was one of the best things that happened, as he was able to gain more experience as a filmmaker and consequently enrich his new universe even more. And yes, the film draws inspiration from the same sources that led George Lucas to create \"Star Wars\". I see this as a good thing, not a bad one.The film shows everything we already know about the director: epic scenes, as every good film should have, and that Snyder knows how to do well. The fight scenes are as good as those in \"Batman vs Superman\", where the choreography team did a fantastic job. The story is well tied up, unlike what many haters say. The film doesn't suffer from part 1 syndrome and, just like \"Dune\", it's a great start to a universe, the actors are impeccable in their roles. This makes the film go by very quickly and holds the viewer's attention from beginning to end. The development of the main characters' story is very good.The execution quality of this film is something to admire. The director managed to not only make something extremely cheap, but also with an impressive special effects quality. Amid so many bad projects with exorbitant budgets, Snyder works a miracle in \"Rebel Moon\". No wonder, the film is on the list of the 20 best in special effects at the Oscars.I had the enormous pleasure of being one of the lucky ones who watched this masterpiece at the early release on December 1st at CCXP 23. I was in the front row and I could see something that will be marked: an auditorium of 3000 people cheering and applauding this film on their feet. It was a big and beautiful surprise of the year 2023, entering my list of the best films of the year.",
    "11": "Zack Snyder has described this movie as the Seven Samurai in space, and this movie proudly shows its influences on its sleeves. Like Lucas before him, Snyder borrows ideas and imagery from the classics of his day, from the magnificent seven to Excalibur and of course, Star Wars, but all done in his own signature bombastic style.The visuals and action scenes are as usual immaculate, and the universe Zack has created looks amazing, with a price tag of 80 million it still manages to look better than movies with three times the budget.The big flaw is that you can tell the movie was cut down for a shorter run time. The hour or so cut content would explore the characters more deeply and elaborate on their stories.Still, the story that did survive is great and serves to whet your appetite and pique your interest. Can't wait for part 2.",
    "12": "From the opening title sequence, I knew this was going to be an amazing film. The Stone Quarry logo has never looked better! Rebel Moon has a dreamy retro-esque/80s feel to it thanks to Snyder's unique visual style which does allow more freedom for the VFX effects. The lense effect he has created works really well for this movie and gives us some truly incredible shots.For a budget of $80M, I thought part 1 looked incredible. The worlds we visit are beautiful, they look lived in and are populated by many unique & exotic aliens. I'm really excited to see how Snyder will expand on this in the extended cut and Part 2.I'm so happy for Sofia Boutella for her first leading role, she absolutely nailed this, she is Kora and Kora is a badass!! The cast is great, they have fantastic chemistry together. But again, I just can't wait to watch the extended cut to delve deeper into these characters, to spend more time with them and discover more about who they are.The violence was impactful, the fight scenes were awesome and the slowmotion was a welcome Snyder touch. The score was absolutely incredible, Tom Holkenborg is on fire again! The technology in this universe is something really special, it went beyond my expectations! I did think RM could have been 20 minutes longer though, just to let some scenes breathe a little and maybe extend some others.The elephant in the room... Star Wars. Tbh I'm so glad this movie isn't a Star Wars story, Rebel Moon is it's own thing and it is carving it's own path. I love the influence Star Wars has had on it but it's no more than the influence of Seven Samurai & Heavy Metal and when the R Rated cut drops it will increase the divide from SW even further.Overall Rebel Moon: Part 1: A Child Of Fire is a fantastic entry into a brand new franchise with a rich universe full of interesting characters and deep lore that I am excited to explored further. Snyder has created something truly unique here and I can't wait to see what more Rebel Moon has to offer.",
    "13": "Using star wars as a reference point for rebel moon is mostly for people who's only exposure to universe building scifi lies along the SW ST binary.Rebel Moon owes much much more of its inspiration and aesthetic to the magnificent 7 kurosawa & Lord of the Rings Tolkien, arzach moebius, final fantasy (12 & 15) Nomura and Lone Sloan druillet. Just to pick the most obvious.I originally put this at the end but I'll put it here instead because I think it's important. ***\nIn rebel moon the imperium is explicitly pathetic and uncool in their cruelty and some people will struggle with that.The current big budget ecosystem wans to give us an enemy that is faceless or if not faceless then cool or at least redemeable.Rebel moon offers the imperium none of these. The imperium soldiers aren't given to us a faceless enemy, canon fodder. They're are just as human as us, with names, personalities and even small acts of mercy when they want and all the worse for it. Cruel, bitter and pathetic, they are owed and offered no redemption by their victims or the story. That is the strongest political statement a contemporary film can make about the nature of empire. Some will resent this. ***The development of our lead Kora is brilliantly done, she balances bad assery with vulnerability. Her skill are earned without exaggeration and her history has pathos without being maudlin. And she also saves her gentleman in distress while defending his honor ofc.The world of rebel moon is the real secondary lead in this film. The planets and cultures we glimpse are beautifully rendered and steeped in history and I love that we see evidence of worlds that have evolved independent of each other. The set design is *chefs kiss*, the costume design detailed, well thought out with history's as detailed as the worlds they occupy.Loved the performances with Donna Bae and Charlie Hunnam being easy standouts for all they were secondary characters. Skein as Attics Nobel our villain is sinister from the start and Hopkins work with Jimmy together with the vfx team offers one of the most sympathetic performances. In fact the vfx and makeup team did a phenomenal job. Every ship had weight, felt massive and every creature felt real. I came out falling in love with a cinematic world in a way I haven't experienced since Valerian.If you've played final fantasy, kingdom hearts, star ocean, any big scifi jrpg you'll understand the building a party format that the rebel moon plot follows, from the initiating event to the final boss battle.The big critique is that the party members aren't well fleshed out this is true but it is still very much part 1 as it says in the title so I'm not sure this is fair, it's Assessing the first 2 hirs of what is effectively a 4 hr film at minimum 6hrs extended. The more valid is the choppy pacing in the 2nd act, here the pg 13 edits made from the directors cut for a mainstream audience are more obvious and can be distracting. If I came away with one big critique is that there are parts missing and more than once felt like they were missing. I don't know that I rate the strategy of not releasing the r rated directors cut alongside the pg-13 one and no, I don't have a huge amount of faith in the Netflix release strategy department.But, did I enjoy it? Absolutely. I love scifi, love heavy metal, and most of all I love art that has a strong identity. Rebel moon knows what it is, its a self serious, grounded, large scale adventure and is all the more wonderful for it. 10/10.",
    "14": "\"Rebel Moon\" is a must-watch for any Zack Snyder fan. If you love his unique style and his ability to create visually stunning and action-packed films, you won't be disappointed. Don't let the poor critic reviews discourage you (they are shilling for Disney).Sofia Boutella's performance was truly surprising and emotionally impactful. Her portrayal of the character was nothing short of badass. She brought such depth and intensity to the role, and I was completely captivated by her on-screen presence.The score in \"Rebel Moon\" was so powerful and really added to the emotional impact of the movie. It's a shame that the film had to be cut down by Netflix. I'm really looking forward to seeing the director's cut when it comes out. I bet it'll give us even more insight into the story and characters.I totally see the potential for \"Rebel Moon\" to become a new franchise like Star Wars for our generation.",
    "15": "I had the privilege of attending the Los Angeles Premiere of \"Rebel Moon\" on December 13th and a subsequent viewing on December 15th at the Netflix Egyptian Theater in LA. This gave me a unique perspective to appreciate the depth and nuances of Zack Snyder's latest creation. Junkie XL's (Tom Holkenborg) score elevated the narrative to epic proportions. Snyder's use of slow motion, a signature element of his directorial style, adds a dramatic flair to the action scenes, though at times it can slightly overshadow the storyline's momentum. The compact 2-hour cut of the film is a tantalizing glimpse into what the extended R-rated version, coming this summer, promises to unfold. A significant aspect of \"Rebel Moon\" is its divergence from the often-made Star Wars comparisons. While there are elements that may feel familiar to fans of the space opera genre, \"Rebel Moon\" establishes its own mythology and world-building. The universe created by Snyder is not just an imitation; it's a unique, self-contained cosmos with its own lore and rules. The influence of \"Heavy Metal\", \"Excalibur\", and anime adds layers to the visual storytelling, making it a rich, textured cinematic experience. Sofia Boutella shines as Kora, bringing a magnetic presence to the screen. Ray Fisher's portrayal of Darrien Bloodaxe and Ed Skrein's embodiment of the Admiral are performances that resonate long after the film ends. The ensemble cast synergizes to bring this imaginative universe to life, each adding a distinct flavor to the narrative's tapestry. The anticipation for the extended R-rated cut, releasing this summer, is high, promising an even more detailed exploration of this rich universe. The film is a testament to Snyder's visionary filmmaking, distinguished by its unique aesthetic, compelling performances, and a score that resonates with epic grandeur. It's more than a sci-fi film; it's a bold new chapter in the genre, promising to captivate audiences with its originality and depth.",
    "16": "Here is my non-spoiler review of #RebelMoon:Did I like it?YES! I really enjoyed it.Was it what I expected?NOWhat about the critics?Absolute lunacy. There is nothing to hate about the film.Was it like Star Wars?I don't think so. I didn't see enough of a similarity. To be honest, I wanted more. So maybe Part 2 will be more Star Wars-esqWhat about the action?I expected more but there was enough to be satisfying.Will you like it?That is ultimately a question u have to ask yourself. But I suggest removing everything you think you know about the film & go in with no expectations. Ppl have described it as Dune or Star Wars/something else. But I personally didn't get those vibes.",
    "17": "A movie with a few despicable characters.The implication and the characters involved when you sit and think, they are utterly disgusting in certain scenes.That's how Snyder works.He's a counterculture specialist.His values are on every frame.This is a movie with three audiences.First and foremost?The fans.This one is for us. This one is for us! The characters on screen? They are us.Second audience? General. This has broad appeal. It talks about themes of abandonment, of found family, of wonder and technology, of sadness and death, of bounty and harvest.The third?Only the Fans and Snyder's family and friends know who the third audience is.It's on every frame of this movie.It's built into the architecture.Every shot, every action scene, every beat, every word.There is one person for whom this movie was made for. And in honour of.And we as Snyder fans know exceedingly well who it is.Just thinking about it makes me cry.For Autumn. Zack Snyder's daughter who sadly took her own life. Before his Snyder Cut came out. It forced him to abandon Justice League.The words \"For Autumn\" I can tell you now are nowhere on the film. Because it's a Netflix production for worldwide distribution.But they don't need to be there.Because any fan will be able to tell. Whether they end up loving the film or seeing pacing issues or really desiring the Fantastical R-rated cut.Something no one can ever deny, no critic no fan no general audience member, is that this is a movie dedicated to that person. The one person who can never, unfortunately, watch this film.Or any of his future films.But we as fans have always banded together to support Zack. To tell him \"we are here and you do whatever movie you want. We are here.\"And the thousands of dollars raised for AFSP is already our legacy. I donated a small amount myself. Cementing my place. But we can do more.I got no doubt in my mind this movie will be the hit of Netflix Christmas/ Festive Season."
}