{
    "0": "Every bit of it hits you with amazing childhood memories.\nWatching it as an adult, you get to notice many dirty puns between Willy Wonka and Violet's mother almost explicit lol.\nThe songs by the oompa lumpas are still pretty dull and useless though",
    "1": "Tim Burton kept saying he wanted to make a version much more faithful to the source material, which leaves me wondering why he didn't. There's the awful (and unnecessary, and counterproductive) back story showing Wonka's childhood, which is nothing more than an excuse for Burton to bring in one of his horror movie heroes from childhood (Christopher Lee) while completely killing any sense of mystery Wonka might otherwise possess.I like Johnny Depp, but his Wonka had zero warmth...and was just plain creepy and random - one minute he's snippy and/or oblivious to the kids, the next he's paternal, offering Charlie some nourishing hot chocolate because he \"looks like he could use it\" (and because it's a line from the book).Wonka in the book is a spritely little gent...neither Gene Wilder nor Johnny Depp are really much like him (much less so Depp), but Wilder's interpretation always has that twinkle in his eye - you know he's a little eccentric but he's always in control. The kids in this version are all pretty good. But Wonka himself? Yikes. Give me Gene Wilder's version over creepy Johnny Depp's Michael Jackson take any day.The Oompa-Loompa musical numbers blew. The first one, in the chocolate room, was okay. But overall, I had a hard time understanding most of the lyrics. It was all just raucous noise. Come on, Elfman, you can do better than that.Wonka telling Charlie he can't bring his family to live with him in the factory was insane. First of all, it makes Wonka look even more like a freaky pedophile; second of all - how on earth is that faithful to the book?!This is the second time in recent memory I've heard of a producer/director wooing the widow of a beloved children's book author and then she deciding that her dead husband would love this new big-screen version of his source material. Somewhere, Dr. Seuss is consoling Roald Dahl.",
    "2": "I know I'm in the minority here, but I wasn't jumping up and down about this movie. I loved the book as a child and loved the original film with Gene Wilder for its own original contributions...perhaps I'm biased. Still, I have always admired Tim Burton and Johnny Depp's work, and had been looking forward to this new interpretation of Roald Dahl's book.This film was, indeed, more true to the book than the 1971 version...the squirrel room, the jungle scene, the children leaving the factory, perhaps a little \"wiser for the wear.\" However, the character development of the 1971 version was MUCH better than here...you were actually given an opportunity to like or dislike each character, including Willy Wonka. I did think that Johnny Depp's portrayal of Wonka was more true to the book than Gene Wilder's...Willy Wonka is supposed to be quite childish and eccentric. However, I thought that this film's preoccupation with being true to the book caused it to overlook what is more important, which is to establish the intentions of each character. At least in the 1971 version, it's pretty clear what each character's intentions are...even if establishing some of these intentions requires a conspiracy involving \"Slugworth.\" And though I haven't read the book in a very long time, I do NOT remember any details being given as to Willy Wonka's childhood...I thought these were unnecessary, distracting, and a waste of time. This energy could have been better spent on the children's' character development, in my opinion. This is, after all, supposed to be a story for and about children.The oompa loompas. It's true that they are physically portrayed accurately here more so than in the 1971 version, i.e. very small people and not midgets with orange skin and green hair. However, though the songs they sing here are true to the book, they are less charismatic than those of the 1971 film and sometimes seem over the top. Also, I didn't like that they were all clones of each other...I think that was a poor choice.Finally, I was appalled with the ending...this ties in with my previous comments re: Willy Wonka's childhood. It changed the whole idea behind the story itself, which is supposed to be (from my perspective) that people can overcome their hardships to have a happy and prosperous ending, as long as they're honest, selfless, and generous. This movie changes the whole theme of the story to one that emphasizes the importance of family over any kind of material wealth or prosperity. Both are perfectly good and legitimate themes, but my reading of the book left me with an impression that Roald Dahl was more concerned with the former theme than the latter. Accordingly then, this movie did not do the book justice in the most important and fundamental way, whereas the 1971 film was able to do so despite its shortcomings.",
    "3": "Yesterday I had the pleasure of watching \"Charlie & the Chocolate Factory\" at the Wilkinson American Movie Day. And, oh boy, I was in delight! Don't expect a bleak remake of the amusing (and rather psychedelic) 1971-version. It is in every way a genuine Tim Burton-movie, stacked with beautiful imagery, wacky humor and bizarre characters, but at the same time faithful enough to the spirit of the novel. Roald Dahl would've been proud. It also features outstanding performances by the entire cast. Johnny Depp gives us a strange, almost creepy Willy Wonka, Freddie Highmore is a perfect Charlie, the Grandparents are lovable and wacky, and the five other children and their parents are amusingly irritating. And last but not least, an excellent soundtrack by Mr. Danny Elfman, reminiscent of both Edward Scissorhands and his early Oingo Boingo-days. Go see this with your parents, children, grandparents, movie buff-friends, nephews and nieces ... they will be equally delighted!",
    "4": "As i frequently watched one of the most loved Ronald Dahl's Charlie and the Chocolate Factory movie (2005 version), and I would love to give my honest and loving opinion about this wondrous, never seen anything like this before film with the famous and talented Johnny Depp. This movie is full of Burtions imagination and talent to make Ronald Daul's \"Charlie and the Chocolate Factory\" come to life with the amazing cast, this Adventure, Comedy, and family film that tells the story of A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.This film takes place in Munich, Germany, in a poor village. The main characters are Willy Wonka, Charlie Bucket, Grandpa Joe, Mrs. Bucket, Mrs. Beauregarde, Mr. Salt and Dr.Wanka. The story of this film is When Willy Wonka decides to let five children into his chocolate factory, he decides to release five golden tickets in five separate chocolate bars, causing complete mayhem. The tickets start to be found, with the fifth going to a very special boy, called Charlie Bucket. With his Grandpa, Charlie joins the rest of the children to experience the most amazing factory ever. But not everything goes to plan within the factory.Where to start with the cast......Johnny Depp did Phenomenal as Willy Wonka. And some Tim Burton films Johnny Depp and Helena Bonham Carter are in his films. Freddie Highmore did amazing playing Charlie Bucket, Johnny Depp suggested Freddie Highmore to play Charlie, which Depp has an eye for young talent in other people, and that's why I respect him. He gives young people chances to show their talent.. However, how they casted David Kelly as grandpa Joe was wise, because he bombed and did amazing in that role. Helena Bonham Carter always gets into the role so fast you can't believe who she is 100% of the time. Lastly oh my goodness how they casted Dr.Wanka..... Christopher Lee...Love that guy. Lee's Acting changes the whole atmosphere of the film.\nThings that I loved about the movie where Johnny Depp played a Mad hatter like role, but took to another whole level of acting. Johnny Depp has acted over 35 years. I think this movie gave him so much more talent in his career. Some movies make the actor/Actress have better experience or talent. I think this film is what made Depp more famous. I didn't like how they casted the boy, he just didn't have the spirit of the other, and love for acting as the other actor/Actress did.\nThe lessons I learned from this amazing film are to take care of your family is more important than anything.The best things in life are worth waiting for and be grateful for the important and simple things in life, don't focus on what you want, focus on what lies ahead of you, and if you dream it, you can make it happen. Nothing is impossible. What I think others will learn from this heartfelt family film is that one thing in the world you should be looking for is if you can dream it, you can make it happen, nothing is impossible, and lastly always look for the thing your not looking for because it might be in front of your face, and you don't know it.The group of people that would be interested in this film is Johnny Depp films, weird movies or a movie about dreaming and having that dream come true. I would recommend this movie 100% because it really hit me hard when I watched it because I started dreaming big and some of my dreams came true, and I don't focus on the bad in the world, I tried to focus on the good. The rating is PG. My final word on this film is watch it, think about, and spread what the movie message is. It is good because I have a high respect for Johnny and Tim's work. So I'm not surprised by how good Charlie and the Chocolate Factory is.I Give \"Charlie and the Chocolate Factory\" 5 stars out of 5 stars.\nFilm review: This film really touches on the subject of taking care of loved ones, and the love for chocolate. Hollywood lacks films like this anymore because movies like this one i believe that some parts depp was not acting at all, he was really feeling the emotions of the character. The love for Ronald Daul's stories over 77 years, hollywood has made films based on his books like the BFG, Witches, Fantastic Mr.Fox, Chitty Bang Bang, the movie business has always done an amazing job, but with Charlie and the Chocolate Factory they really make the story come alive with JOhnny Depp's role as Willy Wonka. Depp made me feel that he really was the character of Willy Wonka, and as the kids go through his factory. They get tempted to eat his candy, gum, and his crazy ideas in the factory, and the one thing they show in this film isc kids don't follow directions, only the smart ones or like Charlie with is grandpa, which had knowledge of the factory because he worked in the chocolate factory for s long time. I have never seen a film with different kinds of acting and costumes, and fun music. Another reason i have so high respect for this film and DEpp, he accepted the part as Willy Wonka without reading the script first, that's talent, and art in acting that is not in movies anymore.Fun Facts\n1.Deep Roy was paid $1 million dollars to play all the Oompa Loompas\n2.40 real squirrels were trained to jump on Veruca Salt\n3.Willy Wonka's Boat took 20 weeks to build\n4.Nestle provided 1,850 bars of real chocolate for the movie\n5.It took 6 months to create the model of the town\n6.The colors were muted at the start of the film on purpose\n7.The chocolate river was made with real chocolate\n8Johnny Depp was nervous about shooting in the glass elevator\n9.Gregory Peck passed away before getting the chance to play Grandpa Joe\n10.Depp suggested Freddie Highmore for the role of Charlie",
    "5": "This movie was simply awful. I am waiting for someone, anyone, to point out that Johnny Depp was just terrible. The first twenty minutes, in a grandiose fashion, leads us to a giant man named Willy Wonka who can put the world on it's toes by putting gold tickets inside five candy bars. Then when you meet Wonka, he's nothing. Johnny Depp is as pale as a sheet; I'm not referring to his white makeup and fake white teeth, but his acting. He's doing an imitation of Jim Carrey doing an imitation of Michael Jackson. His Wonka not believable at all. The kids are just bad. Rich, and bad. You get the whole Hollywood push of \"rich kids are evil, while poor kids are perfect\", meanwhile, what about the children of Hollywood actors and producers and directors, are they exempt because their parents are artists instead of capitalists? I don't get it. I just don't get it. I really don't get this at all. This movie was so terrible. The songs were horrid. One Oompa Loompa playing them all of them was cheap and lame; and the songs made me hide my head in disgust. And there is a segment where Burton pays \"tribute\" to Stanley Kubrick's \"2001\", and it's all but blasphemous to people like me who literally worship classic films. In the original, Gene Wilder was believable. He really seemed like the character. He was the character. But Depp, as usual, was simply performing. Horrible. Horrible. One of the worst movies I have ever seen. A C.G.I. overkill.",
    "6": "Roald Dahl's exhilarating children's novella is brought back to life by the best possible team imaginable! If there's anyone out there in cinema land capable of re-telling Dahl's colorful  yet macabre  story, it has got to be director Tim Burton (with his unique ability to create dark, fairy-tale like atmospheres), class actor Johnny Depp (not one character is too eccentric for himnot even Willy Wonka) and music-maestro Danny Elfman (whose typical style gives an extra magical touch to every film). With these three icons of nowadays cinema involved, the new adaptation of \"Charlie and the Chocolate Factory\" was bound to be an enormous success and definitely one of the greatest movies of the year 2005. Well, the movie didn't turn out as amazing as I hoped, but still it's a very beautiful and occasionally heart-warming experience with excellent set pieces and another highly memorable role for Depp. It's very likely that you've read the best-selling book or saw the earlier film version (starring Gene Wilder as Willy Wonka) but in case you're from another planet: Charlie Bucket, the titular character, is one of five lucky children who wins a grand tour in Willy Wonka's world famous chocolate factory. Wonka is a bit of a loner who normally never grants anyone access to his factory because there were too many competitors in the past who were out to steal his recipes. Charlie and the others enter a magical world where chocolate and other types of candy are made in the most bizarre waysand by the most bizarre kind of factory workers. The always-amazing Johnny Depp is very aware of the fact he's the star and tout of this production and he clearly is in a great shape again. His performance of Willy Wonka is very cheerful and, just as it was the case in Pirates of the Caribbean, you gladly allow him to go over the top. The young Freddie Highmore is really good as well in portraying Charlie, a boy with a limited imagination but a heart of pure gold. The screenplay contains some terrific dialogues and the (blackly tinted) humor is well spread over the whole film.And yetTim Burton and C° slightly disappointed me during some moments in the film. The many flashback (for example revolving on Wonka's supposedly traumatizing childhood) are too extended and actually quite redundant. Also, some of the character drawings are definitely underdeveloped, like Grandpa Joe for example, whom we only get to know superficially. Biggest letdown of all was the \"Oompa Loompas\"-tribe. These little people fail to convince and especially their morality-songs are overlong and pointless. Compared to the first cinematic version of the book, released in 1971, I personally find Burton's film slightly weaker. Sure the older film had those very annoying songs and Johnny Depp simply crushes the memory of Gene Wilder but yet the wholesome was more captivating and the pivot sequences in the 1971 version (like the boat-ride and Oompa-Loompa life-lessons) were a lot more sinister. And if there's one term that fully describes Roald Dahl's oeuvre, it is \"sinister\".",
    "7": "There is no way Tim Burton could make anything without some sicko slant to it (as here with a display parody of Disney's \"It's a Small, Small World\" display at Disney World melting with dolls seeming to bleed and becoming disfigured and ghoulish creatures to frighten children.What was mild dis-ease in the original comes across as full-blown sickness in this Burton-ized bastardization. I don't know what trauma he suffered as a child, if any, but he seems hell-bent (literally) on inflicting it on other children with \"Corpse Brides\", making Halloween hellish and now this.Don't allow this trash or anything else Tim Burton has anything to do with near your children. Period.",
    "8": "If you're looking for a remake of the original movie, you'll be greatly disappointed. I have no idea if it's closer to the book since I never read it, but I don't really care. Two of my friends were baked and they hated it also. Johnny Depp came no where near portraying this genuinely nutty recluse like Gene Wilder did, and the factory and oompaloompas did not have the magic, appeal or mystery of the original movie. And they removed one of the best scenes when charlie and his grandfather were floating from the fizzy lifting drink. The only really good scenes involved charlie's grandparents at home, they were really funny and I loved the one grandfather's comments about the other gold ticket winners. But in the end, i've never seen so many disappointed movie-goers.If you really want to see it, save your 10 bucks and wait for the DVD.",
    "9": "I honestly cannot see why anybody would like this rubbish over the original. Whereas the 1971 version sparkled with innocence, charm and magic, this monstrosity will leave you feeling violently ill and internally disturbed by the time the closing credits roll.Let me begin by saying I don't personally enjoy Tim Burton's style, and didn't like the dark influence he brought to this film. Depp's Wonka is perhaps the creepiest character I've ever watched in a movie. Unlike Gene Wilder's eccentric yet loving Wonka, he openly expresses his disgust and hatred towards the children. One need only watch the scene in which a shrunken Mike Teavee is nearly stabbed by a vicious-faced Oompa-Loompa, or the one in which Veruca Salt is dragged screaming into the garbage chute while Wonka pretends he cannot find the right key to let Mr. Salt into save his daughter, to understand Wonka's cruelty. In the original, Wonka seemed merely disappointed and bored during the children's accidents, and he always kept his head; he knew no harm would befall the young troublemakers. Here, we see Wonka laughing, dancing and cheering as the Oompa Loompas sing about children being turned into chocolate and eaten.The scenes of the four naughty children's punishments were incredibly disturbing, and the jokes about cannibalism just made me cringe at the stupidity of it all. Charlie Bucket, who should have been the main character, was a disappointment. Throughout most of the film he seems rather expressionless and bored, unlike the genuine and honest boy played by Peter Ostrum in the original movie. The 1971 Charlie had a dream; he wanted more than his poverty-stricken life, he strived to help his family out of tight situations, he wasn't perfect, but he was a believable character, and that's what made him so lovable; he was just like us all. This Charlie doesn't seem to care about anything; he seems perfectly happy with his life and hardly seems to care about getting a golden ticket. The other children are equally disappointing; Violet Beauregarde manages to pull off her characters fairly well, but even so she had little to work with. The songs in the original were hopeful and inspiring, such as the charming 'Candy Man,' and 'I've Got a Golden Ticket,' the heartwarming 'Cheer up Charlie,' and the magnificent 'Pure Imagination.' In this new version,the only songs we get are a cheesy welcome song in which childlike puppets explode and melt into ghoulish wraith like figures, plus the nauseating Oompa-Loompa filth. The emotional 1971 ending with Wonka, Charlie and Grandpa Goe in the elevator has been replaced with Wonka refusing the other Buckets to enter the factory, becoming a hobo, and eventually reuniting with his abusive dentist father (???) In a short review with a maximum of 1, 000 words I simply can't do justice to the badness of this movie, so I'll leave it at this: the old movie has a positive and uplifting message that will bring tears to even the coldest eye. This one crushes the viewer down into the dust while screaming its message into their face. So, unless you enjoy stupid jokes, children in despair and nauseating songs, don't waste any money on this soulless, emotionally disturbing piece of filth.",
    "10": "I thought this movie was very enjoyable and well worth the admission. Unlike some, I did not read the stupid book and do not plan on doing so. Additionally, I do not identify myself as some Wonka devotee and I am sure glad that ginning up Wonka centric criticisms is not my sole reason to live. I must admit I am personally anguishing over the fact that, unlike others, I opted out of performing some pointless comparative analysis between - book – 1971 movie - and the most recent production. The end-result of wasting one's time regurgitating some of these condemnations will simply result in high-blood-pressure, chemical imbalances and soiled diapers. OK – now wait. Once this personal anguish subsides, I will be able to continue – ahhhh – it's over, I can now continue. This movie easily stands on its own merits. Similar to most Burton/Depp ventures, \"Charlie and the Chocolate Factory\", will definitely have a number of followers (which I am a member). To some, it will become a classic. Whenever these two dynamic personalities get together, they seem to always stir up some magical tasty potion of entertainment. I thoroughly enjoyed Mr. Depp's portrayal of a bumbling, snippy Willie Wonka. His sarcastic and (apparent) clueless delivery was superb. I doubt anyone else could have pulled off this part so brilliantly. I was also pleased to see him evolve away from the very successful 'Jack Sparrow' persona and highlight his acting diversity as Wonka. And once again, Tim Burton highlighted his behind-camera brilliance. Very much like Robert Wise of-old, anything Mr. Burton turns out, is usually worth gambling on. If you are looking for fun and original entertainment – this is the movie for you. If you are looking for a remake, this is not it.",
    "11": "Ahem, where do I start? When seeing this movie the first thing that struck me was the \"exciting\" music at the beginning which reminded me a bit of Harry Potter. The opening scene was absolutely riveting, showing the wrapping of bars of chocolate. I almost fell off my sit because I was so intrigued. The beginning of the film surpassed itself in making us realize by about 2 minutes of it that it was going to be absolutely dreadful. The real fun began when we met Willy Wonka. I won't say who he reminded me of.. anyone who's seen the film would know and I don't want to spoil the pleasant surprise for those of you who haven't yet had the honour. The oompaloompa dances were possibly the worst things I have ever seen. Who choreographed them?! I want to meet this insane idiot! It literally made me want to puke. They had an eerie kind of synchronization which was so unnatural that it was scary. I admit to finding the first dance slightly amusing but by the time I'd got to the 4th I was just staring at the screen in disgust.Words of warning: Don't go and see this sad excuse for entertainment. See the original!!",
    "12": "Excellent performance from Johnny Depp. It is a great movie to watch!",
    "13": "This movie surprisingly has many comparisons to candy.It's sweet, delightful, and rich in taste.Johnny Depp also does a marvelous job as Willy Wonka himself.There's nothing that parents will have to worry about this movie.It'll make a fine and delicious treat that the whole family will devour over and over again.It's also better than the original, in my opinion.But Johnny Depp isn't the only big star in the movie.The movie itself wouldn't be as candy-coated as it is today without the performance of Freddie Highmore( August Rush), who plays Charlie Bucket.Trust me when I say that you will be in for 115 minutes of pure and delightful fun.This is one movie that even chocolate can't top.",
    "14": "I should hate this, being such a fan of the original, but to be honest I really like it. The story has been realised in a lot more of an appropriate way for the modern world. Tim Burton has yet again done a tremendous job of bringing this fantasy world to life. It's eccentric, wonderfully mad, funny and just lovable. It does a better job of bringing the original material to the screen than the original, the only problem I have is with Johnny Depp. I don't have I problem with his acting, I think it's great, I just feel he's been directed to play the role too weirdly. The \"tragic madness\" of his character doesn't sit too well with me, and I don't think all of the back-story was necessary. Aside from that it is a great film that does stand up to the original.",
    "15": "What a sad occasion. I should say at the start that Johnny Depp is one of my favorite actors of all time, and that -- until his last three films -- Tim Burton was one of my two favorite directors (the other being Terry Gilliam).I'm sure Depp will go on to make many more superb films -- but I have no desire to ever see another Tim Burton film again. This film is not only untrue to the book, most monstrously so in its ending (which I can hardly bring myself to describe) but really throughout the film in its cheap, unimaginative, eye-candy.Depp, apparently channeling a frightening mixture of Pee Wee Herman and Anthony Perkins (thus perhaps the gratuitous \"Psycho\" reference in the film?), is neither charming nor surprising; he lacks the sly warmth of Gene Wilder, who to my mind will *always* be the real Willy Wonka. His factory, resembling the assembly lines of \"Edward Scissorhands,\" but on steroids, is a vast, impersonal cavern, without a single ring of emotional truth. Sure, all the kids but Charlie are brats -- but here, Willie Wonka is one too, and though Charlie may be a good boy, he gets very few speaking lines, and he and Grandpa Joe have as few occasions for fun as do we, the viewers.During production, Burton talked about how he disliked the older version, and seemed to promise a darker version truer to Dahl's witty disdain for the the adult world. But here, everyone -- child, adult, and elderly person is insulted with visions whose \"darkness\" is not a product of melancholy, but of cynicism. There is no goodness here, no meaningful badness either. The first flashback to Wonka's dentist father (Chrisopher Lee, wonderful as ever) is a lovely touch, but the ending of the film, which demands that little Charlie somehow \"heal\" the wounded psyche of Wonka and re-unite him with his dentist dad, is the worst piece of poisoned treacle ever to leave a factory.The whole thing ought to be flushed down a garbage chute -- it's a bad nut.",
    "16": "Such a waste of good talent -- Tim Burton directing, Johnny Depp as Willy Wonka -- how could it be better? It should be great, but they ruined it. Having read and loved the book as a kid, and very much enjoying the first film version, this one doesn't cut it. It's a timeless story and didn't require \"modernizing\" -- keeping with the original story and merely updating the special effects would've been great. Willy Wonka was turned into a Michael Jackson-like character and the Oompa Loompa's were all one actor, digitally duplicated to appear as many identical characters -- the musical numbers with the Oompas were 'updated' with electronic music and Oompas attempting to disco-dance.This movie is what happens when a bunch of college kids get jobs at studios, do drugs, and dig into the movie-rights vault. Fortunately, there's always the book -- and the first film version -- if anyone could've matched Gene Wilder's performance as Willy Wonka, Johnny Depp could've, but he didn't...",
    "17": "I was actually excited to see this movie, I wasn't expecting anything, I was just intrigued to see another Tim Burton film. The pictures in the film and the factory were spectacular and mesmerizing. Without even paying attention to the story line it was clear this was a Tim Burton film, truly fantastic. But Like watching a model trying to ponder physics, the beauty is only skin deep. Where was the heart in this movie? The acting, the dialog, the people all fell short of human behavior. Small example: A child spoiled all her life only taunts her father with the resounding demand: \"I want it Daddy.\" Where's the yelling, the screams, has no one EVER SEEN a tantrum?? Additional Example: The parents seemed hardly upset with their children's misfortune. As a parent would you not run out and help your daughter if she were attacked by ANYTHING much less squirrels?!The Ompa Loompa problem: I loved them actually. Tiny, creepy, and what a great story on how they were found. They were great until they broke into a bad Britney spears song and dance. What the #*!$*#& was that?!Flashback problem: I loved johnny's character, quirky and fun. Nevertheless, the flashbacks didn't add much at all to anything. And they were executed in the WORST WAYS i've ever seen. \"sorry I was having a flashback.\" They are far better ways to have had those worked honestly.The T.V. kid: was he really so horrible? I mean yes, he was obnoxious, but it doesn't take t.v. to do that. In fact, didn't t.v. just make him smart? Is it so awful that he figured out how to find the bar with the ticket? T.V. didn't turn his mind to mush, it made him the smartest kid who was just annoying and stubborn.The ending: Horrible, horrible, horrible. I don't even want to talk about it.",
    "18": "Let's be clear: this movie is not half as good as the original. The backstory for Charlie was deleted, while a clichéd backstory for Wonka was added. Wilder's Wonka was charming and magical, Depp's Wonka was creepy and mean. The original was a movie for adults dressed up as a movie for kids, this one is strictly for the kiddies. The oompa-loompas are played by an old man (can't figure out what they were thinking). The children were zero dimensional, most of their parents had little to say, the acting was one-note at best. The only actor in the film to give a good performance is Charlie, but the script gives him little to say.Yes, I am biased because I loved the original. If you've never seen the original this movie would be easier to like. But if you love the original you will not love this one. It's inferior in every category.",
    "19": "The original Gene Wilder film is superb and original. A classic of its time, we have a saying in England \"if it ain't broke don't fix it\". Johnny Depp who is a brilliant actor gave me the creeps in this new version, I did not feel comfortable with my young children watching such a weird character. The props and sets are better than the original, but so they should be. Gene Wilder in the original film came across as an eccentric recluse, which was fine. This Tim Burton version went back into Willy Wonkers childhood, which I found confirmed the weirdness of the Willy Wonker/Johnny Depp part. The magic and charm of the original film, its script and story line should have been left along with the now carbon copied Oopa Loompa's.",
    "20": "This movie is so good we watch it every Christmas it's a family tradition fun for the whole family Johnny Depp is superb his comic timing is incredible",
    "21": "First of its important to say that I am a Roald Dahl fan, and indeed a fan of the original 1971 film Willy Wonka and the chocolate factory. What that film and the work of Roald Dahl have in common is charm, warmth, eccentricity etc. This Tim Burton film does not share in any of it. Having sat and forced myself to watch the entire film hoping something good would happen I was left feeling nothing but empty. I enjoyed most of Tim Burton's work and was rather excited about this film when it was announced, the trailers never gave away too much and I kept on hoping right up until the credits rolled. So whats so bad about it then? My first massive problem with the film is the reactions from the children through the film. Were they sedated during filming? Watch the scene where they tear down the chocolate river in the boiled sweet boat, does one of them even scream in delight? are they not amazed they are on a boat made from candy on a river of flowing chocolate? Most of the time they stand there looking like they would rather be somewhere else, how are we supposed to believe in the wonder of this amazing factory if the kids there aren't even impressed (too much blue screen work perhaps, means the poor actors had nothing to be amazed at) my second not quite as massive problem with the film is Burton's muse Johnny Depp. Perhaps their relationship is getting stale but Depp's performance as Willy Wonka was nothing but irritating; less eccentric, more pathetic. The creepy grey skin, luminous teeth, puppy dog eyes and hushed voice all add up to a character that I was bored of in the first 5 minutes after seeing him. The ridiculous back story of his childhood was totally superfluous and added nothing to the film, it's like Burton really wasn't trying 'why does wonka love candy....? hmmmm maybe his father was a wicked dentist who wouldn't let him eat it... I could get christopher lee to play him! get on to casting!' Wonka was supposed to be a man with years and years of experience behind him, a weathered eccentric not an excitable/sedated puppy point number 3 THE MUSIC, perhaps the worst score to a film I have ever heard, Danny elfman, shame on you. OK so they wanted to bring the songs up to date but jeez the music is just bad, the incidental music is bad also, its all bad.#4 the Oompa Loompa's. this really made me sad, really sad, so in the revised book they are like miniature cavemen, in the 1971 film they are crazy psychedelic dwarfs, in this film they are... one man, one dwarf, Burton employed him in 'Big Fish' he did OK there but he is so wrong for the part of an oompa loompa and why does he have to play all of them? another gimmick that I suspect Burton really didn't waste any time over coming up with, his expressionless face might have worked as a sad clown but the cheeky Oompa Loompas? I think not there were a few god points, the authenticity (minus the stupid flashbacks) I loved seeing the candy boat in all its glory, the fudge mountain , an actual glass elevator rather than the weird gold thing in the 1971 film but who really cares about all these things when not one person in the film seemed to be impressed by it, did the crew record dry run rehearsals by accident? ( by the way the original elevator of the book didn't have rockets on the side it used sky hooks and was powered by sugar but kids would just laugh at that right?) It was nice to see charlie's dad regardless of the fact he is of no importance to the film. The sets were OK but lacked any real wow factor.basically if you took burtons script chucked out all the nonsense hired a new director kept the sets and gave them a bit more wow and hired a new sound guy and told everyone to smile and have a laugh it wouldn't be that bad, but that didn't happen, mores the pity. OK so one day, say 30 years from now I will make it again its the only way I can resolve my issues with this disaster.in short if you are a roald dahl fan and like the 1971 film DO NOT WATCH THIS, honestly I regret ever seeing it",
    "22": "If the only justification for this being a great movie is that it is true to the book, then it shouldn't have been made at all. Tim Burton has successfully digitized and sterilized the Chocolate Factory universe, and in so doing has destroyed a wonderful piece of pop culture. No longer will orange-faced, green-haired Oompa Loompas populate my imagination (and nightmares). No longer will I wonder just what in the world an American boy was doing living in a ramshackle house in a nondescript Bavarian town. And no longer will I wonder what drove Gene Wilder's Wonka to be such a lovable sadist, or just exactly what drugs he popped before taking that insane boat ride. In short, the imagination of the original film is gone, replaced with a shallow, bloated, big-budget disappointment. When the film was first announced, I was ecstatic that Johnny Depp and Tim Burton would be taking it on. I thought only Johnny would have the skills to successfully reinvent the enigmatic Wonka, and only Burton (or maybe David Lynch) would be able to make the disturbing Oompa Loompa's even more disturbing. The film fails in both respects. Visually, Depp does a fantastic job of capturing the essence of Wonka. His buggy sunglasses, velvet coat and top hat were faithful both to Wilder's Wonka and the whimsical nature of the character himself. But Depp's acting and/or the material he was working with fell flat. In the few lines of dialogue that actually fit into the context of the scene, Depp's delivery was synthetic and provided no insight into the character. Perhaps this was intended, but for me it backfired. If they wanted me to loathe the character, it worked. By contrast, Gene Wilder's take left no doubt about his distaste for children - Think of his wonderful eyerolling while saying, \"No, please, stop..\" - or his true reversal when he finally finds a child of virtue - \"You did it Charlie! I knew you would!\" His performance is nuanced and genuine. Depp's is taut and plastic. Where is the playful and inventive dialogue like \"Oh, you should never, never doubt what nobody is sure about.\" and \"So much time and so little to do. Wait a minute. Strike that. Reverse it.\"?Now to the Oompa Loompa's. Those little orange buggers have been scaring the hell out of me ever since I saw the original as a child. I couldn't wait to see Burton's twisted take when the movie was announced. Then I heard that the Loompas would be played by one actor, Deep Roy, and digitally reproduced. I began to worry. My worries were well justified when I saw the film and the Oompas had become a cloned and shrunken version of Roy, with only latex jumpsuits to lend any suggestion of the bizarre. The musical numbers were equally disappointing. Glitzy, fast-paced and well choreographed, they nevertheless pale in comparison to the catchy and unforgettable originals with their \"doompa-dee-doos\" -- on a par with the \"Ohh-ee-ohhs\" of the Wizard of Oz for great movie choruses sung by guys with brightly-colored faces. In fact, I don't think there was one line in any of the new movie's songs that I actually could understand. And since the musical numbers added so much to the story in the original, I definitely felt something was missing this time. Burton has always been a master at creating otherworldly environments that incorporate just enough anachronisms and bizarre elements to keep you guessing whether the story is supposed to be set in our universe or not. He does another admirable job of it here. From the opening credits, with their depiction of a Rube Goldbergesque chocolate machine, to the imaginative nut sorting room, Burton uses his talents well to create a rich landscape. However, I think he fell short in a few spots. His take on the Augustus Gloop and Violet Beauregarde incidents is identical to the original, but with less dialogue. And the only new element in the Mike Teevee scene is the cute homage to 2001: A Space Odyssey and other cinema classics. I think a director like Burton could have gone to town, so to speak, with this material and still stayed faithful to the book. Another element of the film that I found irritating were the flashbacks to Wonka's youth and other departures from the main story, such as the origin of the Oompa Loompa's. The biographical material on Wonka not only eliminated some of the mystery surrounding the character, but it was tired and predictable to suggest that his eccentricities were the result of his troubled relationship with his father. (Gee - Their subsequent reconciliation at the end of the movie was a real shocker once this was revealed.) And how, how, how, Mr. Burton, could you tackle the subject of the vicious indigenous creatures of Loompaland without talking about those rotten Vernicious Knits!Bad remakes and needless sequels are not only poor cinema, they detract from their predecessors. Unfortunately, I think Burton's film will have just that impact on Willy Wonka and the Chocolate Factory. Perhaps I need to read the book again, something I haven't done since my childhood, to appreciate this movie for its faithfulness to Dahl's vision. Somehow, I don't think that will make me like it any better, though. After all, when we now see Homer in Simpsons episode DABF03 ask to see the Oompa Loompa because he's \"freaky\", will it strike the same chord? I think not.",
    "23": "Charlie Bucket is a very poor kid who finds Willy Wonka's golden ticket, as did four other lucky children from around the world, and he is invited to take a one day tour at Wonka's chocolate factory, which was closed to people before. In the factory, amazing things happen, as it is not an ordinary chocolate factory. Amazing atmosphere and magical candy create a fairytale made of chocolate. The performances are great, the special effects very real like and original and the music good, apart from the oomp loompa songs that are cheesy and sometimes boring. The story line is good too, not confusing, even though there are quite a few flash backs. So 7 out of 10, because it is a great movie, and not only for children.",
    "24": "Tim Burton did an amazing job staying close to the original book and Johnny Depp is the perfect Willy Wonka. People should definitely give this one a bit more credit, the original is good because it's a classic, this one is good because it's the source material of the book and in my opinion the better of the 2 movies. I give this one an A+++++++++++++++",
    "25": "As someone who is a fan of classic TV and movies, it's still surprising to me that this is my favorite movie. A wonderful performance by all the cast, and especially Johnny Depp. It's still hard for me to wrap my mind around the fact that it's him. Thoroughly enjoy this movie every time I watch it.",
    "26": "I was surprised to discover that except for the Dicken's Christmas Carol ending, this movie is actually a traditional horror flick with training wheels for elementary school kids. Johnny Depp does a delightfully maladjusted mad scientist act, supported by an entire tribe of eager Igors. As in any Spam in a Cabin flick - the victims are picked off, one by one. A special acknowledgement should go to the person or persons who did the amazing hand knit blankets, scarves and sweaters featured in the scenes with the grandparents. If you enjoyed the art direction in this one, you might enjoy the 5,000 Fingers of Professor T.",
    "27": "My wife & I went to see this today (3rd August2005); we were really looking forward to it because of all the media hype and the trailer looking great.To be honest we both love the original move with Gene Wilder (1971), I also read the book many years ago and enjoyed that as well.This version we felt was such unadulterated rubbish that we walked out after an hour.We felt that Johnny Depp was useless as the character as he came across way too young - after all it was supposed to be over 20yrs since Grandpa Joe worked there - Willy didn't look a day over 35 which would have meant that he was but a teenager when he opened the factory.Deep Roy did a good job at acting as the Oompa Loompas although the musical scenes were so crap it begs belief that Tim Burton actually wasted the money doing those scenes.I think that using a primarily British cast was a new twist! About the only things in our opinion that had improved over the 1971 version was the visual effects - these were excellent; and giving some background to some of the characters was also a good idea.Overall given that we could only bear to watch the first hour, I would say, don't waste your money - go and rent the 1971 version from the local video store.",
    "28": "The wonderfully whimsical Tim Burton was the perfect choice to bring a contemporary twist to the familiar tale of Willy Wonka. Unfortunately, it never really works as well as it should. Perhaps it's because we already know the story, or because Burton just doesn't translate as well when he's trying to be cute rather than weird. In particular, the musical numbers from the Oompa-Loompas, the strange little people who work in the chocolate factory, seem so out of place. Still, there is a lot that clicks, from the colorful scenery and characters to the apt performances from the child actors and Johnny Depp, who was well cast as the eccentric candy man. Children are bound to love it, but those expecting vintage Burton or a tongue-in-cheek nod to the original 1971 version will be disappointed.",
    "29": "Oh, this is my favorite movie. I've watched it 10,000 times already. And I'm ready to watch as much as I want. So many bright colors and delicious pictures. I thank the director for creating this film. The first time I saw him was when I was 10 and I've adored him ever since. So many funny moments, it's wow. It's very funny when a nasty girl ate gum, although she was told not to do it, and became all blue and turned into blueberries. When the fat boy reached into the river of chocolate and fell there. After that, he was pulled into himself by a pipe taking away chocolate. I was afraid that it would burst ahahaha, but thank God it didn't. However, he missed other funny moments. A girl who is used to wealth got what she deserved when she fell into a garbage bucket. It's just a pity for his dad who fell with her while saving her. Although he himself is to blame for this, because he himself spoiled and raised such a daughter. The boy who teleported eventually became very long, which was also funny. At the end of the film, I was very happy for the boy who stayed and won this factory. He deserved it, but he loves his family so much that he refused. I don't understand why he did this, because it was possible to combine or did I understand something wrong? I don't know, I'm very sorry that he dreamed about it so much, but refused. But this is ngo's choice, which means he thought it would be right, so it should be, I don't blame. I really like the animation and scenery in this movie, maybe that's why I watch so much. Although.",
    "30": "I adore this film, I was shocked to see what I would consider dreadfully low ratings for a film like this at just 6.6 on IMDB at the time of reviewing! At least the critics reviewed it well. Freddie Highmore is ideal for the lead as Charlie Bucket, polite, good humoured and well meaning. And who else to play Willy Wonka but Johnny Depp himself! Christopher Lee also plays a part, another actor I love and the rest of the cast couldn't have been better picked.Cinematography is good, acting is great, it sticks to the book's original material and I was never bored.9/10: From what I remember this trumps the 1971 original.",
    "31": "Johnny Depp does a good job of playing a weirdo, but he's too Michael Jackson-like for my liking. I thought this was cute and not bad at all. Filled with charm, innocence and drama. The colors are amazing and seem to follow the mood of the story. It's fun watching it. Its complexity begins within its characters. It's an amazing work and everything I had hoped for. From an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them. It's an important film, as well as very entertaining Unfairly dismissed by some as confusing.",
    "32": "Just like so many other remakes of great films, this is one that fails miserably on so many levels. First of all, Johnny Depp does not display near the wit nor the charisma that Gene Wlider did in the original. You actually see Willy Wonka before the big day arrives, which takes some of the mystery out of the character.None of the characters are really enjoyable like in the first film. They seem to lack any real emotion or style. The special effects are overkill for the overtone of this story. It is almost like Walt Disney meets Timothy Leary. If you are a fan of the original, steer clear of this abomination.",
    "33": "Let me begin by stating that I am a Johnny Depp fan. I generally find his performances to be excellent, and count his portrayal in \"Blow\" among my very favorite in cinema history.That said, he fails here.I don't know if it was due to improper or misguided action of the director, or if he chose his own tone and manner for the Wonka character, but Depp fails miserably in this film. Using the Roald Dahl novel as a guideline, Depp is nothing like the understated, dry-witted implacable and imperturbable Mr. Wonka. Using the original film from 1971 as a guideline, Depp can't hold a candle to Gene Wilder's performance, which, while overstated, at least resembled the character intended by Dahl when he wrote the book in the first place.Johnny seems to be going for some sort of post-abused, mentally tweaked boy-man. Some have said that the portrayal reflects Michael Jackson. If so, WHY? Wonka isn't sinister, nor does he come off as a character hiding a brutal truth, which is how Depp plays him here. Unfortunately, he becomes the focal point of the movie and the \"main\" character is kicked to the curb shortly after his introductory sequence. Following Charlie's find of the Golden Ticket, he becomes an ancillary character with few lines, and Michael Jackson takes over, and ruins the film. Really, he ruins it. I found it unenjoyable and actually began to resent Depp's every appearance with a weariness.This is no Wonka. This is Burton and Depp's idea of what Neverland would have been like if Michael Jackson chose to make chocolate there rather than exhibit exotic animals between kiddie rides.The usual Burton mosaic of backdrop works well, and the musical scenes with the Oompa Loompas are highlights, although I found myself harboring nostalgic thoughts for the original Oompas as I enjoyed these new rocked-up songs. Well done, just much, much different.A sidenote: I love that Mike Teavee challenges Wonka's notion that a candybar being teleported is a far cry from an image being transmitted. That drove me nuts when I was a little kid! Good for you for calling him out, Mike! I also love that Veruca Salt meets her match by the paws of many squirrels (as in the book) rather than being dumped down the egg hatch (as in the 1971 version of the film).Overall, I disliked Depp's portrayal so much that despite the excellent imagery and the many highlights, I won't watch this again, and recommend it only to those who are interested in comparing it to the far superior 1971 effort.",
    "34": "Well, this was my favorite movie as a kid. Everything about it is perfect in my opinion. It is perfect to captivate a kid with its fantastic effects and brilliant songs.And Johnny Depp has the best acting in this movie.",
    "35": "Although this movie stays close to the book, it's much darker than the book or the original, despite the original including a scene with a chook getting its head chopped off.Depp is a strange Wonka. He has no interest in children and only became a chocolatier as revenge to his father's abhorration of sweet things, because he was a dentist. Depp's Wonka is much darker than Wilder's portrayal, and it's one that probably caused nightmares.The Oompa Loompas are played by one person who is CGI cloned a thousand times. He's not even cute! Having the same Oompa Loompa is repetitive and annoying- some variety would've been nice. The songs they sing take the lyrics directly from the book but aren't as catchy as the original's songs. I do like the different genres of music used though.The children are just as annoying as you'd expect them to be. Freddie Highmore is wonderful as Charlie, although he doesn't come across as the centre of the movie as one might expect. The demise of each child is the highlight of each segment and really moves the film along nicely.Where the film strays from the book are the parts that annoy me the most. Violet being overly competitive seems out of place, and the subplot with Wonka and his father is silly. It has no place in the film and delays the inevitable ending, which everyone already knows. Delaying it with an out-of-place subplot is completely pointless and unnecessary.So why don't I like the movie? It's too dark. Wonka is a happy, loving, hyperactive character. Depp's Wonka meanders through his factory like a robot and the occasional amusing comment (when he's not having flashbacks to his demented childhood).Give it a miss and see the original. Better still, read the book!",
    "36": "I'm not giving this \"ones\" because I liked the first film much better, but it just fell short for me. Gene Wilder kept the Wonka edge going but Johnny Depp somehow took most of the humor out of the new version. I didn't see anything new, other than a lot of special effects (which one would expect) and the Oompa Loompas (whom I enjoyed). As is usually the case, there are efforts to update things with some of the music and some sight gags. But Depp just gets more and more weird, almost to the level of child abuse. Don't get me wrong, it's a great story, but I never was engaged. See it and make your own judgment. It certainly does have the Tim Burton touch which is always worth a shot.",
    "37": "I saw this movie in Antwerp at a sponsored movie event on the 4th of July.... I was a bit reluctant to go and watch this movie but I'm glad I did! Johnny Depp is a great Willy Wonka! I never thought that there would be a version that could match or even beat the original, but this one certainly has exceeded my expectations.... The film is hilarious, speaking as an adult, I wonder how the youth responds to this, but I rate this movie 8 out of 10 stars!For those of you expecting a copy of the original with new actors, you'll be surprised how original this version is, go and bring your entire family with you! I'm sorry for the fact that this comment looks a bit like a commercial, but I'm really enthusiastic about this flick!",
    "38": "I'm sorry I went into this film thinking that I would love it like all the critics views I read. However, this was one of the worse movies I think I've ever witnessed. It was boring & so over the top, I just couldn't get into it. Johnny Depp as always was good but the voice he used for Willy Wonka was irritating. It was to the point that at the end of the film I wanted to reach in & choke Willy Wonka just so I wouldn't have to hear the voice anymore. The coloring didn't make any sense either, he was always either green, blue or pale colored. Depended upon what scene he was in. He just looked sickly. He had absolutely no redeeming qualities whatsoever. I didn't see the need for the incredibly stupid flashbacks to his childhood. It made no sense in the picture & was irritating. The Umpahs were OK... I didn't like the singing because most the time we couldn't understand what they were singing about. I thought the kids were fairly good. I really liked this kid who played Charlie much better than the original... he was good. I've always been a fan of Tim Burton but I know he's done much better.",
    "39": "A severely underrated movie that stays faithful to the book, while adding enough to justify its existence and features an amusingly eccentric performance from Johnny Depp",
    "40": "Light years ahead of its predecessor, this film is a masterpiece. Beautiful, fun and inspired, full of beautiful scenes and beautiful songs, truly wonderful.",
    "41": "This movie was simply awful. Willy Wonka lacked the warmth, humor and wit that was shown by Gene Wilder in the original. The use of one person as the Oompa loompas comes off as cheap production, whether it was or not. The changes made, even subtle ones such as the order or events between Charlie finding the money and getting the last ticket and the introduction of the elevator just seem off. One of the most memorable moments is left out, which is the fizzy drink that makes Charlie and Uncle Joe float around.The oompa loompa sequences are horrible, the main characters fail to connect with the viewer as they did in the original.. I could go on and on but will just end by saying....This movie is proof that new technology, different actors, producers and directors do not always equal a better experience.Save your time and your money... buy and watch the original. My 5 year only daughter even prefers it over the new.",
    "42": "I had been on the edge with this. I was scared it would ruin the original one, but it didn't, mainly because this was not a remake, but a different movie. And it was a very good one too.The movie has comedy for all ages. Kids, teens, & adults can all laugh. But what makes this movie stand out above the rest is that it takes everyone on a chocolate trip that you can't resist. In fact, by the end of the movie, my mind was so crazed with chocolate that I went to the concession stand and bought two bars of candy right away and munched it down.The song of the Ommpa-loompas do not match the original, however they are very funny and very good.Depp performance is very good because he's able to perfectly act as the real villain of the whole movie without you knowing it until the very end. All along the movie you think Wonka is the hero, but in the end you realize that Wonka is actually the main villain of the movie. Depp does a brilliant job in \"hiding\" this fact.Now, I do like the 1970 movie better than this, but I think that is mainly due to the songs. Everything else in this movie was far better.8 / 10. very good movie, one you should definitely go to see in the theaters, and IMAX if you can. If you're an adult, bring a child with you. If you're a teen, bring some friends. Anyone can enjoy this movie, which is probably the main reason why its amazing.",
    "43": "This is a horrible horrible version of this movie. Where in the hell in the book does Wonka talk to his father. And the part where Wonka denies Charlie the factory because he wants to bring his family, absolutely ridiculous. Wonka is supposed to be an inspiration. Not a jerk who has a magical moment with his father. The characters are just completely screwed up. Why on earth would this remake even be considered good. My next problem Oompa Loompas. Where did this freakin idea come from. This movie may have been considered good only if you have never seen one: the original movie two: you have never read the book and three: you have never seen a johnny depp movie. All around a horrible movie. Never waste you time renting this.",
    "44": "What. What the deuce. What the diddly deuce did I watch? Tim Burton--you're married to Helena Bonham Carter. You've made several Gothic-cutesy movies which, while decidedly not my style, are not bad. Why did you have to put your cold, spidery hands on my darling Charlie and the Chocolate Factory? WHY?? Charlie's not a bad actor. His parents, although rather predictably cast, are cute in that dingy-British-zany-Tim-Burton way. The humor at first is pretty funny. I'm not in love, but I'm not screaming in agony either.And then Johnny Depp comes. And then Johnny Depp comes. And THEN JOHHNY COMES AND OH, DEAR GOD, I'M BREATHLESS WITH HORROR. He smirks. He simpers. He minces. He speaks in a soft, breathy, braindead sort of voice which seems like a really poor interpretation of Michael Jackson. He's apparently the son of a psychopathic dentist who refusd to let him eat candy--as a result of which, he grows up to be a highly effeminate, suspiciously pedophile-ish creeper who giggles for the camera and doesn't give a darn about the children with whom he's dealing. In short, he's quite possibly the worst Willy Wonka anyone could ever be, ranking right up there with the hypothetical interpretation by Kristen Stewart. Somewhere out there, Dahl is banging his head against his coffin. Personally, I'm a fan of the original. Sure, it changes a few details of the book, sure the Oompa Loompas are green and orange and creepy, sure the infamous Boat Scene is acid-trippy and psychedelic, but the heart is there. Gene Wilder, in my view, played Wonka brilliantly. He was a man of mystery, a man of twinkling eyes and dry humor and unaccountable twists and turns, a man both fearful and wonderful to behold. (By the way, Johnny: dry wit does not equate to you smiling vapidly at the children and lisping \"I don't really care\"). He's peculiar, yes, but he's also wacky and whimsical and boyish at heart, and he cares for Charlie. Perhaps Depp's portrayal cared for Charlie, but he gave the impression of said caring being entirely the wrong way. I don't understand why at the end Wonka doesn't allow Charlie to bring his family with him to the factory--that rather defeats the purpose of the book. All in all, this is a shiny new remake which emulates its main character: cold and glassy and completely dissatisfying.PS. The Oompa Loompas. SERIOUSLY?! And the music completely ruins the mood and setting.",
    "45": "I watch again again and beatiful movie for me special,epic:)",
    "46": "I'm not sure if this is a SPOILER or not, but my opinion. I was really looking forward to seeing this. I like Johnny Depp and I loved the original. I was very disappointed in this for several reasons. 1) I thought it was going to be a Part II and not a remake. Why remake something that was already great? Why not make a movie as Charlie himself grown up and running the factory. 2) Depp is quirky in a freaky, irritating kind of way, often resembling Michael Jackson in a strange way. 3) They ruined all the great songs that were in the original, with completely new, completely irritating, please turn the *@#$ off, it's killing me, kind of songs. 4) Kudos to the one guy who played ALL the oompa loompas.... again pretty strange looking and very digitized.... i like the originals much better instead of exact clone of one. 5) They changed the idea of a lot of the scenes completely... no bad/golden egg for example, no everlasting gobstoppers. 6) My kids didn't like it much either and looked kind of disturbed after the show.",
    "47": "There is no heart to this movie. I had no idea what to hope for or fear. The first 30 minutes are entertaining as they mainly focus on the Bucket family, but as soon as we step foot in the chocolate factory (not nearly as lush as one would like), the film dies. The Oompa Loompas have far too much screen time and you can't understand the lyrics to most of their songs. While Johnny Depp's Wonka is humorous in his sissy way (reminiscent of his performance in Sleepy Hollow I might add), his character \"arc\" (as tiny as it is) is not believable. The golden-ticket winner kids (with perhaps the exception of Violet) do not improve upon their predecessors. I didn't mind Burton's darker interest per say, but all in all very disappointing. The highlight of the film were the costumes by Gabriella Pescucci.",
    "48": "A kid wins a golden ticket to a factory. GOOD MOVIE.",
    "49": "First off let me say I am a huge fan of the original Charlie and the Chocolate Factory. In 1st grade my teacher read the class the book. What made the first movie such a masterpiece was Gene Wilder's excellent performance. His version of Willy was smart, witty, extravagant, and clever. The whole movie was filled with extraordinary things that Wonka had something clever to say about. The classic also taught a moral lesson and showed what happened to spoiled, gluttonous, and TV addicted kids. The reason why I despised the remake is this; Willy Wonka was not any of the things listed above, he was insane and rude. He was just making rude comments to the children the whole movie and saying things that made no sense. Another thing that bothered me is that every time the words 'parents' or 'family' is mentioned Johnny Depp looks like he is going to vomit! The story is not about a candy maker's relationship with his father, it is about a fantasy candy land! I did not go into the theater expecting the remake to be better then the original but I was hoping for it to be good since it had Tim Burton directing it and Johnny Depp playing the role of Willy Wonka. Most remakes take away things from the original and add different things. In the case of this movie it was exactly like the original only missing the cleverness, the excellent music and dance scenes, good acting, a wonderful main character, and originality. On a scale form 1  10 if the original is 8, the remake scores a 2. I would suggest not seeing it.",
    "50": "This movie version stunk! Yes, I know it was more to the book but having Johnny Depp??? Come on. Don't get me wrong, I do like Johnny Depp. He's had his share of good and bad movies but this another bad one (I don't think he can get any worse than Cry-Baby). Anyways, I do believe they could have done better for the role of Willy Wonka! Much better. You can really tell this was a Tim Burton movie. The coloring, the acting, and the sets. How about that house?? Seemed like one small touch to it and it would just fall like a deck of cards. How can Charlie really sleep with the roof open like that? (Yea, I know, it is a fantasy book) The Oompa Loompa scenes were terrible! It was interesting that the same guy played ALL of the Oompa Loompas but the dance scenes were just plain awful. Just another part which downgraded this movie. But back to the fact that he played ALL of the Oompa Loompas, would it have hurt to get more than ONE person to play the parts??!? At least in the Mel Stuart version, they got a bunch of them to play the parts and some of them couldn't speak English! OK, time for the good parts. Tough to do. I would give this movie an 8 for the special effects. The glass elevator for instance. Traveling throughout the factory and even through the town with rockets. Nice. So having the choice of the Mel Stuart version, which got away from the book a lot but good actors, or this new Tim Burton, which stuck to the book but bad choice of actors, I would still pick the Mel Stuart version in a second!! Sorry Roald Dahl!!",
    "51": "This movie was absolutely magical and incredible to me as a child. Recently re-watched it and even as an adult now, this movie still dazzles me. Johnny Depp's quirky yet deeply complex portrayal of the character was still grounded enough to make many viewers mystified and intrigued by Willy Wonka's backstory. He knows how to balance a compelling and delightful performance with an edgy twist to his character, that pushes boundaries in exactly the correct way to engage an audience. Wonderful acting from the children who seemed to enjoy every second of being in the movie and managed to authentically depict the characterization that I believe Roald Dahl intended to express through his book, as did the parents! Tim Burton's direction as always was excellent and it's amazing that he was able to stay so true to the book whilst also adding his own spin onto the story. Thoroughly enjoy this film and would recommend it, for all ages!",
    "52": "While I do think this remake has some benefits over the original with expanded backstories and the characters being more realistic everything else is a letdown. It's dark and not pretty, all the charm is completely gone and now it's quite a dark film instead.",
    "53": "Absolutely love Johnny in this film. Also, Tim and Johnny collaboration is wonderful. Such a fun film.",
    "54": "An feel good movie.. Worth watching, Johnny depp carries the whole movie his reactions Marcel... definitely worth watching with kids..",
    "55": "I haven't watched the first version supposedly mixed of \"Charlie and the Chocolate Factory\" (1971) dismissed by Roald Dahl and so I will eschew any comparison with this long-anticipated cover directed by Tim Burton. I watched it a few days ago and the first thing that comes to mind about it is that Tim Burton's version is a wonderful example of how the adaptation of a book for children for the silver screen can be transcended into a stylish, prime rendering. Anyway, when I heard that the filmmaker of gems like \"Edward Scissorhands\" (1990), \"Ed Wood\" (1994) or \"Sleepy Hollow\" (1999) planned to give a fresh cinematic rendering of Roald Dahl's work, I thought it was highly likely to be a triumph by any standards. The novel alchemy of these two authors worked wonders to deliver a \"Burtonian\" film to the core. From film to film, the filmmaker pursues his exploration of the strange with these offbeat characters who are generally outcast and the inclusion of the whimsical in the everyday life.To make the 5 little lucky children visit the coveted dream factory, Tim Burton's imagination is in full swing. It's visually a feast for the eyes with a succession of quirky, fanciful moments fraught with oddball ideas and bathing in an ocean of colors. It is pure rapture that is prevailing in the viewer's mind who is sliding in pure wonder before so many used visual, thoughtful effects and devices to deliver a solid portion of dream and escape.\"Charlie and the Chocolate Factory\" also ensures continuity with Tim Burton's precedent works because analogies can be found with several of his previous films. A town with many houses and shops gathered and at the edge of the city, a somewhat isolated, mysterious place where lives a bizarre outcast who generates fascination among the inhabitants. Doesn't it remind you of \"Edward Scissorhands\"? Moreover, the machinery system could be an echo of Edward's inventor's. Then, if the town has realist British accents in its architecture, Charlie's house seems to be built in a Gothic one and Tim Burton's taste for Gothic trend stands out once again after having come to the forefront in \"Batman\" (1989) or \"Sleepy Hollow\". The interior of the house includes amusing details: Charlie's grandparents spend most of their days in a big bed. At last, the end of the film is similar to \"Big Fish\" (2003) insofar as it showcases the lack of communication between Wille Wonka and his father and their reconciliation.To come back to the story, the audience is caught in a jaunty walk behind the walls of the chocolate factory just like the visitors and however, this state of bliss seems to be short-lived. This place has something ominous like a big haunted house from which one couldn't escape with its long corridors and spacious rooms. Something the viewer feels when the visitors are at the threshold of the firm with the mechanical dolls singing and dancing before finally being burnt. This fanciful, almost fictional world conceal doubtful, unnerving parts, beginning with Willy Wonka himself. Under his wry, laid-back appearance, this character has an eerie part of ambiguity. He is cut off from the exterior world and barely worries about the unfortunate fate of the 4 smug young imps and one can fuel doubts about their mishaps: were they premeditated? Finally, Willy Wonka has to come to terms with the demons of his past to be in peace with himself and to be a human being.Of course, as a whole, one could object that the form tends to be favored over the contents with a rather linear master plan especially with the installments concerning the four pretentious brats who are punished of their own sins but Tim Burton keeps his distance from the moralizing, stereotyped aspects of the storytelling. \"Charlie and the Chocolate Factory\" is also a tale that shelters emotion and tenderness mainly brought on by Charlie's grandfather.The cast is equal to the sum of the story and its treatment. Johnny Depp who had already acted in a so-so movie dealing with chocolate, \"Chocolat\" (2000) by Lasse Hallstrom can be once again grateful to Tim Burton to have conceived him a tailor-made role for him in which he's constantly fit in.All you have to do is to sit down and savor a well-rounded delicacy from a connoisseur in storytelling who added one more canonical contribution to a monument (a figurative sense for his filmography) that cuts a fine figure. Go on like that Mr. Burton! Would Roald Dahl have appreciated this bracing result?",
    "56": "Absolutely awful. Sorry, it's the truth.I wanted it to be good too. The original is brilliant, a timeless piece of pop culture. But what Tim Burton did to this film... OK, picture Fred Durst, Avril Lavigne, the Spice Girls, and the New Kids on the Block covering \"Sgt. Pepper's Lonely Hearts Club Band.\" Drunk. That is really how bad this film is.My biggest problem with the film is that they left out Charlie's sin. I mean, no fizzy lifting drinks? C'mon!! One of the things that humanized the original Charlie, the polite and thoughtful one amongst a pastiche of brats, is that Charlie too broke the rules, and reasonably invoked Wonka's wrath. Charlie's innate good nature eventually redeems him, Also, for Darwin's sake, cut out the music. \"PAINFUL\" is the only word I can conjure to describe it.I will admit that I have not read the Dahl novel, so I do not know if the original included all the drudgerous background on Wonka. However, the constant flow-killing flashbacks slows the pace of the movie to a crawl, and normally Depp's acting can carry any role, but this script and character rendering were just terrible. Perhaps the background information on Wonka should have been one big chunk in the beginning of the movie, because spacing it out has no build-up value at all.Also, worst voice on a Depp character, well, ever.There really was nothing to redeem this piece-of-crap moneysucker. I can't believe I actually wasted $12 to see it. Between this, \"The Stepford Wives,\" and \"Godzilla,\" I have lost all faith in the movie industry.",
    "57": "They took most of the fun and wit out of this movie compared to the 1971 version with Gene Wilder. In this one, Willy Wonka is a depressing weird loser instead of a wise prankster. He had none of the charm or appeal of Gene Wilder's Willy. All the characters were better in the 1971 movie except maybe Violet who had a little more going on this time. However her transformation into a blueberry is overdone and just looks like the computer FX it is. The oompa-loompa's are without personality and their songs are mostly unintelligible. The choreography was okay, but I couldn't help thinking, \"Those CGI guys sure did a lot of work on that.\" Stick with the '71 version. The songs alone make it far superior to this corporate computerized makeover. The 2005 version definitely won't be remembered in 30 years.",
    "58": "This is a movie to be forgotten, don't even think of seeing it. It is a disgraceful remake of one of this centuries best movies. The changes and deletions from the original detract so painfully that no present day special effects and fancy ideas can mend it. Depp, you sure made a mistake taking this part. Freddie Highmore, I wish a great future, charming on screen presence. When will Director's and Producers of today actually realise that there back-room thinking never comes to fruition on the big screen. If you want to endeavor this one right, you simply start with Gene Wilder and Peter Ostrum and bring the Wonka Factory into the Present Day, you simply cannot go wrong.",
    "59": "This movie was simply awful. Willy Wonka lacked the warmth, humor and wit that was shown by Gene Wilder in the original. The use of one person as the Oompa loompas comes off as cheap production, whether it was or not. The changes made, even subtle ones such as the order or events between Charlie finding the money and getting the last ticket and the introduction of the elevator just seem off. One of the most memorable moments is left out, which is the fizzy drink that makes Charlie and Uncle Joe float around.The oompa loompa sequences are horrible, the main characters fail to connect with the viewer as they did in the original.. I could go on and on but will just end by saying....This movie is proof that new technology, different actors, producers and directors do not always equal a better experience.Save your time and your money... buy and watch the original. My 5 year only daughter even prefers it over the new.",
    "60": "I had been on the edge with this. I was scared it would ruin the original one, but it didn't, mainly because this was not a remake, but a different movie. And it was a very good one too.The movie has comedy for all ages. Kids, teens, & adults can all laugh. But what makes this movie stand out above the rest is that it takes everyone on a chocolate trip that you can't resist. In fact, by the end of the movie, my mind was so crazed with chocolate that I went to the concession stand and bought two bars of candy right away and munched it down.The song of the Ommpa-loompas do not match the original, however they are very funny and very good.Depp performance is very good because he's able to perfectly act as the real villain of the whole movie without you knowing it until the very end. All along the movie you think Wonka is the hero, but in the end you realize that Wonka is actually the main villain of the movie. Depp does a brilliant job in \"hiding\" this fact.Now, I do like the 1970 movie better than this, but I think that is mainly due to the songs. Everything else in this movie was far better.8 / 10. very good movie, one you should definitely go to see in the theaters, and IMAX if you can. If you're an adult, bring a child with you. If you're a teen, bring some friends. Anyone can enjoy this movie, which is probably the main reason why its amazing.",
    "61": "This is a horrible horrible version of this movie. Where in the hell in the book does Wonka talk to his father. And the part where Wonka denies Charlie the factory because he wants to bring his family, absolutely ridiculous. Wonka is supposed to be an inspiration. Not a jerk who has a magical moment with his father. The characters are just completely screwed up. Why on earth would this remake even be considered good. My next problem Oompa Loompas. Where did this freakin idea come from. This movie may have been considered good only if you have never seen one: the original movie two: you have never read the book and three: you have never seen a johnny depp movie. All around a horrible movie. Never waste you time renting this.",
    "62": "What. What the deuce. What the diddly deuce did I watch? Tim Burton--you're married to Helena Bonham Carter. You've made several Gothic-cutesy movies which, while decidedly not my style, are not bad. Why did you have to put your cold, spidery hands on my darling Charlie and the Chocolate Factory? WHY?? Charlie's not a bad actor. His parents, although rather predictably cast, are cute in that dingy-British-zany-Tim-Burton way. The humor at first is pretty funny. I'm not in love, but I'm not screaming in agony either.And then Johnny Depp comes. And then Johnny Depp comes. And THEN JOHHNY COMES AND OH, DEAR GOD, I'M BREATHLESS WITH HORROR. He smirks. He simpers. He minces. He speaks in a soft, breathy, braindead sort of voice which seems like a really poor interpretation of Michael Jackson. He's apparently the son of a psychopathic dentist who refusd to let him eat candy--as a result of which, he grows up to be a highly effeminate, suspiciously pedophile-ish creeper who giggles for the camera and doesn't give a darn about the children with whom he's dealing. In short, he's quite possibly the worst Willy Wonka anyone could ever be, ranking right up there with the hypothetical interpretation by Kristen Stewart. Somewhere out there, Dahl is banging his head against his coffin. Personally, I'm a fan of the original. Sure, it changes a few details of the book, sure the Oompa Loompas are green and orange and creepy, sure the infamous Boat Scene is acid-trippy and psychedelic, but the heart is there. Gene Wilder, in my view, played Wonka brilliantly. He was a man of mystery, a man of twinkling eyes and dry humor and unaccountable twists and turns, a man both fearful and wonderful to behold. (By the way, Johnny: dry wit does not equate to you smiling vapidly at the children and lisping \"I don't really care\"). He's peculiar, yes, but he's also wacky and whimsical and boyish at heart, and he cares for Charlie. Perhaps Depp's portrayal cared for Charlie, but he gave the impression of said caring being entirely the wrong way. I don't understand why at the end Wonka doesn't allow Charlie to bring his family with him to the factory--that rather defeats the purpose of the book. All in all, this is a shiny new remake which emulates its main character: cold and glassy and completely dissatisfying.PS. The Oompa Loompas. SERIOUSLY?! And the music completely ruins the mood and setting.",
    "63": "I watch again again and beatiful movie for me special,epic:)",
    "64": "I'm not sure if this is a SPOILER or not, but my opinion. I was really looking forward to seeing this. I like Johnny Depp and I loved the original. I was very disappointed in this for several reasons. 1) I thought it was going to be a Part II and not a remake. Why remake something that was already great? Why not make a movie as Charlie himself grown up and running the factory. 2) Depp is quirky in a freaky, irritating kind of way, often resembling Michael Jackson in a strange way. 3) They ruined all the great songs that were in the original, with completely new, completely irritating, please turn the *@#$ off, it's killing me, kind of songs. 4) Kudos to the one guy who played ALL the oompa loompas.... again pretty strange looking and very digitized.... i like the originals much better instead of exact clone of one. 5) They changed the idea of a lot of the scenes completely... no bad/golden egg for example, no everlasting gobstoppers. 6) My kids didn't like it much either and looked kind of disturbed after the show.",
    "65": "There is no heart to this movie. I had no idea what to hope for or fear. The first 30 minutes are entertaining as they mainly focus on the Bucket family, but as soon as we step foot in the chocolate factory (not nearly as lush as one would like), the film dies. The Oompa Loompas have far too much screen time and you can't understand the lyrics to most of their songs. While Johnny Depp's Wonka is humorous in his sissy way (reminiscent of his performance in Sleepy Hollow I might add), his character \"arc\" (as tiny as it is) is not believable. The golden-ticket winner kids (with perhaps the exception of Violet) do not improve upon their predecessors. I didn't mind Burton's darker interest per say, but all in all very disappointing. The highlight of the film were the costumes by Gabriella Pescucci.",
    "66": "A kid wins a golden ticket to a factory. GOOD MOVIE.",
    "67": "First off let me say I am a huge fan of the original Charlie and the Chocolate Factory. In 1st grade my teacher read the class the book. What made the first movie such a masterpiece was Gene Wilder's excellent performance. His version of Willy was smart, witty, extravagant, and clever. The whole movie was filled with extraordinary things that Wonka had something clever to say about. The classic also taught a moral lesson and showed what happened to spoiled, gluttonous, and TV addicted kids. The reason why I despised the remake is this; Willy Wonka was not any of the things listed above, he was insane and rude. He was just making rude comments to the children the whole movie and saying things that made no sense. Another thing that bothered me is that every time the words 'parents' or 'family' is mentioned Johnny Depp looks like he is going to vomit! The story is not about a candy maker's relationship with his father, it is about a fantasy candy land! I did not go into the theater expecting the remake to be better then the original but I was hoping for it to be good since it had Tim Burton directing it and Johnny Depp playing the role of Willy Wonka. Most remakes take away things from the original and add different things. In the case of this movie it was exactly like the original only missing the cleverness, the excellent music and dance scenes, good acting, a wonderful main character, and originality. On a scale form 1  10 if the original is 8, the remake scores a 2. I would suggest not seeing it.",
    "68": "This movie version stunk! Yes, I know it was more to the book but having Johnny Depp??? Come on. Don't get me wrong, I do like Johnny Depp. He's had his share of good and bad movies but this another bad one (I don't think he can get any worse than Cry-Baby). Anyways, I do believe they could have done better for the role of Willy Wonka! Much better. You can really tell this was a Tim Burton movie. The coloring, the acting, and the sets. How about that house?? Seemed like one small touch to it and it would just fall like a deck of cards. How can Charlie really sleep with the roof open like that? (Yea, I know, it is a fantasy book) The Oompa Loompa scenes were terrible! It was interesting that the same guy played ALL of the Oompa Loompas but the dance scenes were just plain awful. Just another part which downgraded this movie. But back to the fact that he played ALL of the Oompa Loompas, would it have hurt to get more than ONE person to play the parts??!? At least in the Mel Stuart version, they got a bunch of them to play the parts and some of them couldn't speak English! OK, time for the good parts. Tough to do. I would give this movie an 8 for the special effects. The glass elevator for instance. Traveling throughout the factory and even through the town with rockets. Nice. So having the choice of the Mel Stuart version, which got away from the book a lot but good actors, or this new Tim Burton, which stuck to the book but bad choice of actors, I would still pick the Mel Stuart version in a second!! Sorry Roald Dahl!!",
    "69": "This movie was absolutely magical and incredible to me as a child. Recently re-watched it and even as an adult now, this movie still dazzles me. Johnny Depp's quirky yet deeply complex portrayal of the character was still grounded enough to make many viewers mystified and intrigued by Willy Wonka's backstory. He knows how to balance a compelling and delightful performance with an edgy twist to his character, that pushes boundaries in exactly the correct way to engage an audience. Wonderful acting from the children who seemed to enjoy every second of being in the movie and managed to authentically depict the characterization that I believe Roald Dahl intended to express through his book, as did the parents! Tim Burton's direction as always was excellent and it's amazing that he was able to stay so true to the book whilst also adding his own spin onto the story. Thoroughly enjoy this film and would recommend it, for all ages!",
    "70": "While I do think this remake has some benefits over the original with expanded backstories and the characters being more realistic everything else is a letdown. It's dark and not pretty, all the charm is completely gone and now it's quite a dark film instead.",
    "71": "Absolutely love Johnny in this film. Also, Tim and Johnny collaboration is wonderful. Such a fun film.",
    "72": "An feel good movie.. Worth watching, Johnny depp carries the whole movie his reactions Marcel... definitely worth watching with kids..",
    "73": "I haven't watched the first version supposedly mixed of \"Charlie and the Chocolate Factory\" (1971) dismissed by Roald Dahl and so I will eschew any comparison with this long-anticipated cover directed by Tim Burton. I watched it a few days ago and the first thing that comes to mind about it is that Tim Burton's version is a wonderful example of how the adaptation of a book for children for the silver screen can be transcended into a stylish, prime rendering. Anyway, when I heard that the filmmaker of gems like \"Edward Scissorhands\" (1990), \"Ed Wood\" (1994) or \"Sleepy Hollow\" (1999) planned to give a fresh cinematic rendering of Roald Dahl's work, I thought it was highly likely to be a triumph by any standards. The novel alchemy of these two authors worked wonders to deliver a \"Burtonian\" film to the core. From film to film, the filmmaker pursues his exploration of the strange with these offbeat characters who are generally outcast and the inclusion of the whimsical in the everyday life.To make the 5 little lucky children visit the coveted dream factory, Tim Burton's imagination is in full swing. It's visually a feast for the eyes with a succession of quirky, fanciful moments fraught with oddball ideas and bathing in an ocean of colors. It is pure rapture that is prevailing in the viewer's mind who is sliding in pure wonder before so many used visual, thoughtful effects and devices to deliver a solid portion of dream and escape.\"Charlie and the Chocolate Factory\" also ensures continuity with Tim Burton's precedent works because analogies can be found with several of his previous films. A town with many houses and shops gathered and at the edge of the city, a somewhat isolated, mysterious place where lives a bizarre outcast who generates fascination among the inhabitants. Doesn't it remind you of \"Edward Scissorhands\"? Moreover, the machinery system could be an echo of Edward's inventor's. Then, if the town has realist British accents in its architecture, Charlie's house seems to be built in a Gothic one and Tim Burton's taste for Gothic trend stands out once again after having come to the forefront in \"Batman\" (1989) or \"Sleepy Hollow\". The interior of the house includes amusing details: Charlie's grandparents spend most of their days in a big bed. At last, the end of the film is similar to \"Big Fish\" (2003) insofar as it showcases the lack of communication between Wille Wonka and his father and their reconciliation.To come back to the story, the audience is caught in a jaunty walk behind the walls of the chocolate factory just like the visitors and however, this state of bliss seems to be short-lived. This place has something ominous like a big haunted house from which one couldn't escape with its long corridors and spacious rooms. Something the viewer feels when the visitors are at the threshold of the firm with the mechanical dolls singing and dancing before finally being burnt. This fanciful, almost fictional world conceal doubtful, unnerving parts, beginning with Willy Wonka himself. Under his wry, laid-back appearance, this character has an eerie part of ambiguity. He is cut off from the exterior world and barely worries about the unfortunate fate of the 4 smug young imps and one can fuel doubts about their mishaps: were they premeditated? Finally, Willy Wonka has to come to terms with the demons of his past to be in peace with himself and to be a human being.Of course, as a whole, one could object that the form tends to be favored over the contents with a rather linear master plan especially with the installments concerning the four pretentious brats who are punished of their own sins but Tim Burton keeps his distance from the moralizing, stereotyped aspects of the storytelling. \"Charlie and the Chocolate Factory\" is also a tale that shelters emotion and tenderness mainly brought on by Charlie's grandfather.The cast is equal to the sum of the story and its treatment. Johnny Depp who had already acted in a so-so movie dealing with chocolate, \"Chocolat\" (2000) by Lasse Hallstrom can be once again grateful to Tim Burton to have conceived him a tailor-made role for him in which he's constantly fit in.All you have to do is to sit down and savor a well-rounded delicacy from a connoisseur in storytelling who added one more canonical contribution to a monument (a figurative sense for his filmography) that cuts a fine figure. Go on like that Mr. Burton! Would Roald Dahl have appreciated this bracing result?",
    "74": "Absolutely awful. Sorry, it's the truth.I wanted it to be good too. The original is brilliant, a timeless piece of pop culture. But what Tim Burton did to this film... OK, picture Fred Durst, Avril Lavigne, the Spice Girls, and the New Kids on the Block covering \"Sgt. Pepper's Lonely Hearts Club Band.\" Drunk. That is really how bad this film is.My biggest problem with the film is that they left out Charlie's sin. I mean, no fizzy lifting drinks? C'mon!! One of the things that humanized the original Charlie, the polite and thoughtful one amongst a pastiche of brats, is that Charlie too broke the rules, and reasonably invoked Wonka's wrath. Charlie's innate good nature eventually redeems him, Also, for Darwin's sake, cut out the music. \"PAINFUL\" is the only word I can conjure to describe it.I will admit that I have not read the Dahl novel, so I do not know if the original included all the drudgerous background on Wonka. However, the constant flow-killing flashbacks slows the pace of the movie to a crawl, and normally Depp's acting can carry any role, but this script and character rendering were just terrible. Perhaps the background information on Wonka should have been one big chunk in the beginning of the movie, because spacing it out has no build-up value at all.Also, worst voice on a Depp character, well, ever.There really was nothing to redeem this piece-of-crap moneysucker. I can't believe I actually wasted $12 to see it. Between this, \"The Stepford Wives,\" and \"Godzilla,\" I have lost all faith in the movie industry.",
    "75": "They took most of the fun and wit out of this movie compared to the 1971 version with Gene Wilder. In this one, Willy Wonka is a depressing weird loser instead of a wise prankster. He had none of the charm or appeal of Gene Wilder's Willy. All the characters were better in the 1971 movie except maybe Violet who had a little more going on this time. However her transformation into a blueberry is overdone and just looks like the computer FX it is. The oompa-loompa's are without personality and their songs are mostly unintelligible. The choreography was okay, but I couldn't help thinking, \"Those CGI guys sure did a lot of work on that.\" Stick with the '71 version. The songs alone make it far superior to this corporate computerized makeover. The 2005 version definitely won't be remembered in 30 years.",
    "76": "This is a movie to be forgotten, don't even think of seeing it. It is a disgraceful remake of one of this centuries best movies. The changes and deletions from the original detract so painfully that no present day special effects and fancy ideas can mend it. Depp, you sure made a mistake taking this part. Freddie Highmore, I wish a great future, charming on screen presence. When will Director's and Producers of today actually realise that there back-room thinking never comes to fruition on the big screen. If you want to endeavor this one right, you simply start with Gene Wilder and Peter Ostrum and bring the Wonka Factory into the Present Day, you simply cannot go wrong.",
    "77": "Growing up, my favorite book was, easily, \"Charlie & the Chocolate Factory\". Roald Dahl's magical tale of a young boy's adventure in the strange factory was spell-binding. Though I never had a problem with the original \"Willy Wonka\" move with Gene Wilder (despite how unfaithful it was, it was still a cute and heart-warming movie), I was doing back-flips when I heard Tim Burton, quite possibly my all-time favorite director, would helm a new version of the movie.First and foremost, Johnny Depp is perfect as Willy Wonka. What people don't really pick up from the first movie is that Wonka was intended to be, well, crazy. He was eccentric and freaky, the way he allowed the rotten children to get what they deserved and protected his factory like it was his child. Gene Wilder portrayed Wonka more like a fatherly-figure, and really was just too nice. Depp pulls out all of the stops as a new Willy Wonka, though there are times that any audience member will get just a bit freaked out.What I loved most about the movie was how faithful it was to the book. Everything that was mentioned, from the chocolate palace to the hair toffee, was taken directly from the book. I was incredibly impressed.This is definitely a movie for everyone, especially those of us who hold the original tale in our hearts. Wonka chocolate bars for all!",
    "78": "If Tim Burton's out there I just want to thank him for bringing the spirit of the book's original illustrations to the screen. He even matched the facial expressions to the drawings, especially in the case of Charlie's family. Charlie himself looks like one of the drawings, and the Bucket house is so much like the illustrations it caused me to realize that Burton is as visual as any movie director can be. (Recent editions feature the work of a different illustrator. I'm talking about the illustrations from the 1960s. The difference between the older illustrations and the newer ones is the older ones feature a lot of cross-hatching. I imagine the older illustrations are still available, especially in a hardcover, but you'll need to search the net.) I don't know how he did it, but he got the facial expressions of Charlie's family and of Mike Teavea's father down perfectly. He also absorbed Dahl's sense of humor. The opening fifteen minutes or so, in which the winners of the golden tickets are announced one by one, really get Roald Dahl's sense of the ridiculous. I think Burton's addition of Wonka's childhood story fits well, although I'll agree that the way this is resolved is not completely in Dahl's spirit. Even in the resolution, however, Burton maintains sly humor. It is well-acted by everybody. I'd like to say that Julia Winter, who plays Veruca Salt, has turned in a truly well-observed comedic performance. Depp converts the novel's jaunty, precise Wonka into a quirky one, but it works well, because, as in the novel, Wonka's endearing traits contrast with the fact that he's a tyrant. Roald Dahl gets a rap for his cynicism, and this movie softens his message a bit. Dahl is a bit like Orwell. Both of them point out that man, given power, will exploit his fellow human beings. CHARLIE AND THE CHOCOLATE FACTORY the movie is not quite as dark as the book. But it comes very, very close.",
    "79": "I was pleased to have this \"Willy Wonka\" re-make meet my expectations. Those expectations were high, at least in the visuals department. I expected a wild, colorful ride with brilliant hues and good special effects...and I was not disappointed.It was inventively fun with those great visuals and another wonderful kid playing \"Charlie.\" I doubted they could ever come up with another child as appealing and nice/wholesome as one in \"Willy Wonka\" but they found one in Freddie Highmore. He filled the bill magnificently, as did the \"brat\" kids.A different feature of this version, as opposed to the 1970 original, was that here the Oompa-Loompas were all played by just one person, a very small Indian man named Deep Roy. One of the interesting \"features\" on the DVD details how difficult that was to do and how much time Roy had to put in to do all the things he did.Johnny Depp, meanwhile, \"did\" what he always does - do a good job of playing a weird person. I get the feeling he relates easily to strange characters. He seems to play enough of them. This was the only part of the movie, frankly, where I preferred the 1970 version: the role of Willy Wonka. Yes, Depp was interesting as always but a little too weird, too Michael Jackson-like, for my tastes. I'll take Gene Wilder's take on the character.Otherwise, this re-make has it all over the original, simply because it has 35 years of technology and computer work that the original wasn't able to have. It made this re-make a real \"hoot\" to watch. Since entertainment is what the business is called, and this movie is extremely entertaining, then I have no complaints. A fun two hours!",
    "80": "I never cease to be amazed by the versatility of Johnny Depp. Whether he is a pirate or writing Peter Pan or an adventurer or a criminal, he never fails to entertain. There is nothing he hasn't done in his 45 films, or will not have done in the five films currently in production or the 15 films in pre-production. Even as the creepy Willy Wonka (Think Michael Jackson for comparison.), he was magnificent. Maybe we have to blame his father (Christopher Lee) for some of that creepiness. After all, depriving your child of Halloween candy is just mean.But, the real star of this film was Charlie (Freddie Highmore), who was the only sane child that arrived at the factory. He was surrounded by four of the most obnoxious children (and their obnoxious parents) that I have ever seen. They got what they deserved.The color, imagination, costumes, and sets were magnificent. It was such a pleasure to watch.Depp comes through again. I am not surprised.",
    "81": "I know that the 1971 musical was unfaithful to the book, but I did much prefer that version to this well-intentioned but somewhat disappointing effort from Tim Burton, the director of Batman and Edward Scissorhands, and this adaptation was in some way more unfaithful in spirit than the 1971 film. The film does have some lovely sets and inventive visuals, the boat scene is fun if not as much as in the Wilder version, a great job is done with the Veruca Salt/squirrel scene and I liked the performances of Helena Bonham Carter, David Kelly and Freddie Highmore. But I was disappointed with Johnny Depp as Willy Wonka. He just lacked the charm and grace Gene Wilder brought to the character, and I don't think Roald Dahl intended a characterisation that was more Michael Jackson than Willy Wonka. Some of the cast overact, especially the girl who plays Veruca Salt, even for the character the spiteful spoilt brat act was way overdone. I liked the music score by Danny Elfman which is filled with whimsy and appealing oddballness(I much prefer his Edward Scissorhands and Nightmare Before Christmas scores however), but the Oompa Loompa songs were rather annoying with none of the noisy melodies memorable and were shot like a music video. Tim Burton evidently tried to make the story darker, and in some respects to the book, it didn't quite work. A good example was the case of the additional character of Dr Wonka, as much as I like Christopher Lee, and he did perform well, but his character was unnecessary, and the script with some over-explanatory narration lacked the sparkle of the 1971 film consequently. The grandparents did bring some comedy, and the movie does start off well. But the unfaithfulness of the last half, meant that the whole film felt rushed and lacking in charm and magic which the Wilder had aplenty. 6/10 Bethany Cox.",
    "82": "Tim Burton's version of Roald Dahl's classic children's book, previously filmed with music in 1971 as \"Willy Wonka & the Chocolate Factory\", opens with great promise, featuring incredible art direction that mixes German Expressionism with Grimm-like fantasy (aided by Danny Elfman's atmospheric, if familiar, score). Charlie Bucket, a child of little privilege who lives with his family in a lopsided house, longs to be one of five lucky worldwide recipients of a prized Golden Ticket, an invitation to tour the candy factory of reclusive genius Willy Wonka. Burton mounts the excitement of the treasure hunt, with the tickets hidden in Wonka candy bars, with gleeful aplomb, and the satire--though a bit heavy-handed--is both trendy and amusing. Once the action moves to Wonka's foreboding factory however, and Johnny Depp takes center stage as Wonka (a would-be misplaced child of the sixties), interest wanes. All the kids and parents are well-cast, particularly Freddie Highmore as Charlie and David Kelly as his Grandpa Joe, but the computer-generated effects turn Wonka's landscape into an impenetrable den of ugly colors and outsized objects (like moving wallpaper). Burton, who expressed nothing but contempt for the previous version, does borrow pieces from that film, improving upon some areas (such as Veruca Salt's exit, with squirrels instead of geese) but falling far short on others (when Grandpa Joe and Charlie secretly unwrap a Wonka bar at night and come up empty, there's no camaraderie between the two, and no embracing of the familial theme). The musical Oompa-Loompas are a dreadful come-down from the predecessor, with songs sung in different musical styles and Burton staging each like a music video (these sequences, too, steal from the first film, yet the Oompa's message ultimately gets lost in the silliness). Depp performs with too much grotesque caricature; sure, his Wonka is out of step with the world, but his sarcasm is too modern, and is geared to get easy laughs from the audience. Screenwriter John August is more out of touch than Wonka; using nasty put-downs to separate Charlie from the other kids is a facile and lazy way of telegraphing us that these children are bad examples, and the flashbacks to Wonka's childhood (as well as a visual history of the Oompa-Loompas) does absolutely nothing but chew up time on the clock. We first see Wonka himself in a flashback based on a story from Grandpa Joe (didn't Charlie know that his grandfather once worked for Willy Wonka?), making Wonka's official entrance several minutes later a non-event. This story is difficult to film without getting gummy or preachy, but Burton was on the right track with his opening sequences. Too bad the second-half is so misbegotten (and not even ambitious, really) that all the mystery drains away like melted chocolate. *1/2 from ****",
    "83": "In a lot of ways, this is way better than the 1971 version and in a lot of other ways, this is way worse. It seems that this is supposed to be closer to the original story but those seem to be a few things and the biggest differences are completely new ideas written for this movie. The film is so, so great with Burton's storytelling finesse up until they enter the Chocolate Factory. The grandpa's connection to the factory was great. Depp's Wonka is a whole different character than Wilder's but just the change wasn't the problem. Wilder made that whole movie great while Depp just like his character made the movie awkward. It was just awkward and not funny to see him trying to be too weird and awkward all the time. Willy Wonka is not particularly likeable with most of his actions, so Wilder's version was a charming guy who ultimately does the right thing, so it worked. Here, not only he's weird and unlikeable throughout the movie, but even at the point where the previous movie ended, he doesn't do the right thing. Now, the backstory given to him just didn't feel right until the end when it is used for further change in character. Even though that part was nice, it didn't feel rightly placed. Burton doubling down on the problematic aspects doesn't help too much either. The Oompa Loompas were a bit too much and all those songs were annoying as hell. However, it also had incredible visuals throughout the movie using both practical effects and CGI, the film looks beautiful in a unique way only Burton can do.",
    "84": "This movie was supposedly meant to follow Roald Dahl classic children's book? I'm not sure what book they're following, but there's stuff in this film that would make poor Mr. Dahl gag on an Everlasting Gobstopper.This is easily the weakest work for both Tim Burton and Johnny Depp. Burton simply has no concept of the joyous celebration and positive message of the original manuscript. Instead, he delivers a mean spirited and misguided interpretation that is needlessly grim and depressing. Depp appears to be concocting a character which is a grotesque montage of The Wicked Witch of the West, Michael Jackson, and Carrot Top. He always has some psychotic expression on his face which distracts you from the main story. The Oompa Loompas (really one guy multiplied by awful CGI) are sinister looking, and their songs stink. The children vary from boring to annoying. As if this isn't bad enough, the script includes ugly back stories about Wonka that add nothing, disrupt the flow of the story, and transform a character originally written as well-intentioned but cautiously secretive into a vile, selfish, brutal freak of nature devoid of any redeeming qualities at all. The tacked on sequence about Wonka's family problems is just excruciatingly painful to sit through. A definite misfire on this one.",
    "85": "I have seen Charlie & The Chocolate Factory last night and though I usually don't care very much in giving my opinion, the journey M. Burton and his team made me cross deserves an homage. Especially with all that criticism rising around the film before it has been released.I have been a Tim Burton fan for more than a decade now; I grew up with his films. But what I have been through yesterday his really unique. I actually never thought he would offer us such a film one day. Fans of his first period, with all the lonely and desperate characters won't like it for sure. Since Mars Attacks !, and more specifically since Big Fish, Burton decided to tell things differently. His vision of the world slightly changed in every of his films : now, the rejected freak comes down to the world and stays. A world that remains frightening and weird even thought we call it \"reality\" but a world worth living in. And that's what Charlie & The Chocolate Factory is all about It all begins with a main title sequence that may be one of the main weaknesses of the film. The sequence is very entertaining and visually ambitious but they decided to go with CGI and it looks like it was a decision they made in last minute. Since the film was proudly made with \"real\" sets, \"real\" Oompas Loompas, \"real\" squirrels, the main title looks inappropriate. It's not that important but it's a Tim Burton film and we know how much he usually works on his main title. Hopefully, Danny Elfman is there with a crazy mix of the Edward Scissorhands and Spider-Man (the music when the title of the film appears gave me shivers), a true musical roller-coaster that gives a hint on what his score will sound like through the film. After that, it's just emotions. All kinds of them: laughs (many  the audience laughed almost every thirty seconds), tears of joy (we all know Charlie's gonna find that ticket but when he does, you just can't refrain your heart to beat faster), mercy (the way Burton depicts the social misery of the Bucket's family is really touching), amazement (the Wonka Factory and its many rooms is true wonder, one the most achieved design Burton ever offered us) and many mores. Very much like the book, even though it seems simple and childish, you would like to stop for a second to collect those feelings and try to analyze them but you don't have the time. It just never stops (I realize it might be a flaw for some people in fact). Burton never has been so generous in terms of human warmness.Johnny Depp proposes another inventive and completely wacky interpretation here. I won't compare with Gene Wilder since I don't know the first film very well (pretty unknown flick here in Europe) and those comparisons should stop anyway. Depp makes of Wonka a tormented and unadapted character who doesn't know much about common courtesy and doesn't really care anyway. He built up his own universe in response to his authoritarian father and he's pretty proud of it. He just doesn't want those \"weird\" (a word he likes  you've all seen the TV spots) and boring parents with their despicable children to ruin what is life is based on. Yet So Depp's Wonka is actually very moving and pathetic in his attempts to entertain his visitors. As Burton does everything he can to make you hate Augustus, Vercua, Violet and Mike at the moment you first see them, you get instantly closer to Wonka when you noticed he feels the same. In addition to that, John August's vision of Wonka's past (including an always perfect cameo by Christopher Lee) offers the character a real depth you didn't expect.Danny Elfman is also one of the main attractions of the film. While his score is already classic Burton/Elfman work with some interesting experiments (the main themes are splendid), the songs he wrote for the Oompas Loompas are just so funny. Hugh laughs in the audience for some musical choices. Those songs don't intend to stay with you for months (it would have been hard as they're based on Dahl's lyrics that doesn't allow Broadway impulses), they're just off-beat numbers playing with many references in so many styles. Oingo Boingo fans have to buy the soundtrack when it'll come out, it'll bring them back 15 years ago.What can I tell you more ? McDowell's sets are amazing, Pescucci's work is impressive as well as Rousselot's beautiful cinematography. Some Oscar Nominations should fall here.As for the ending, without revealing it, August's additions are really touching and fit perfectly to Burton's new approach. Even though the final shot tempers the \"family\" theme that he developed through the film (it's still Burton, not Disney), Burton makes you feel good because he feels good (and what I'm writing here will ring a bell when you'll see the movie). I don't know for you but after so many distressed and pessimistic films, it really moved to see that he found a certain peace. Charlie and The Chocolate Factory is a step forward in the direction he gave to his career with Big Fish. He lost his father, he became one, he's getting older and all those questions and doubts are expressed in many important and very complex images and scenes he imagined for the film. That's why I could call this film the \"Edward Scissorhands\" of his new period. Those films are very different but gave me both some very essential emotions.Thank you, M.Burton. Thank you very much",
    "86": "I liked the old WILLY WONKA film and when I heard they were going to do a remake, I was very skeptical--especially when knuckleheads on the internet kept started circulating rumors that Marilyn Manson was going to play the lead!! Fortunately, this was only a dopey rumor and I am pleased to say that I am glad they remade this film, since it sticks much closer to the book by Roald Dahl and because I liked the dark Tim Burton style. Unlike the original, this isn't as much of a musical and it has a wicked sense of humor. However, oddly, while being very dark, unlike WILLY WONKA, the film showed that the bad children were alright by the end of the film. If you never read the books, when you watch the original movie you might just think the brats died! Most of the reason the film is better is the clever script, though it didn't hurt that they were able to use modern special effects that were light-years ahead of the 1971 film. Additionally, while I liked Gene Wilder as Willy, the dark and twisted and possibly crazy Willy played by Johnny Depp was a hoot to watch. I also loved the new version of Oompa-loompas--so creepy and cool compared to the annoying orange freaks from the older film.I liked just about everything about the new film. The only part I wasn't thrilled with was the tacked on epilogue which starred Christopher Lee. While I love seeing Lee in films (except when he was in the Star Wars movies--this is best forgotten), none of this was in the book and just seemed out of place--though also a bit fun. Purists (like myself) may not like this, but most out there probably won't mind at all with this addition.Finally, I should point out that this is definitely a more adult version of the story. Young children probably should NOT watch the film--especially if they are impressionable of really, really young. However, for older kids, teen and adults, this remake is the better bet because it's funnier and quite clever and NEVER cloying or schmaltzy.",
    "87": "There is something confusing about Tim Burton's films. When a filmmaker has a weakness, shouldn't he take it upon himself to fix and improve that weakness in their following projects? This is after all, what critics are for: to offer criticism about films and explain what works and what doesn't. Sometimes the director will be ignorant and shrug off the review with a \"screw you\" attitude and other times it may be a misunderstanding of the critics. \"No mister critic, I don't care so much about plot or characters and it's really about the visuals.\" Is that Tim Burton's excuse? And if so, what's the point? Tim Burton's adaptation of Roald Dahl's Charlie and the Chocolate Factory is a visually spectacular film but it's not enough to make a good film. The story is about Charlie Bucket but then its about Willy Wonka and we forget about Charlie. There's not one cut away of Charlie's reaction while being in the factory tour. The other child characters are obnoxious as Dahl intended them to be but they have no depth. They overreact on cue when it is time for them to fall into a trap and leave the others behind. There is no build up to their selfish frustrations. Its as if they see the moment where they wish to escape and die. The last twenty minutes of the film feel rushed and we have to think fast as to how Willy Wonka was so quickly welcomed by the Bucket family.Critics can see why Tim Burton chose to film this story. It centers on \"eye candy.\" But eye candy is not interesting for a feature if there is not much else to care about. Its like having sex without love. We get dazzling images of chocolate dripping waterfalls and strange looking Oompa Loompa figures and irritating breaks of songs and dance. I especially did'nt care for the background imagery of Oprah Winfrey and Stanley Kubrick's film, 2001. These kinds of visual details ruin the imagination by reminding you what the real world is all about. There has only been one film where Tim Burton's use of storytelling and character development received critical success. That film was \"Ed Wood\". Ed Wood is the movie about the late B-movie director from the 50's who made his films from the heart without conforming to traditional narrative styles. The critics did not catch on with him and coincidentally critics have not caught on with Tim Burton' style. The film\"Ed Wood\" is the only exception. One cannot help but see the irony in this.",
    "88": "Flat, plodding, awful adaptation of Roald Dahl's extraordinary novel. Once again, Tim Burton demonstrates that he is not a storyteller; he is, in fact, a man lucky enough to be able to surround himself with very talented cinematographers, production designers and publicists. Unfortunately, he has no educated friends who are script editors.His only brilliant film, ED WOOD, is light years away from this putrid mess and was good because of the script and despite Burton.One thing Burton is incapable of doing is giving a narrative momentum. In this outing, Wonka takes his children and their guardians on a tour of his factory. We follow the group from room to room and are forced to endure cataclysmically puerile songs from cloned Oompa-Loompahs, all played by the same irritating midget.The film does not have the darker subplot of the original film and the wheelchair-like pacing drove me close to igniting the screen with the nearest blowtorch.Johnny Depp is just wrong as Wonka. He's boring, too, because he's a \"weirdo\" who knows he's a weirdo and wants everybody else to know it, too. He's like the annoying guy at a social gathering who tells everybody how crazy he is. No, Mr. Depp, your weirdo is a bore.The production design is what you'd expect for the fortune spent on this abortion and the cinematography is adequate.Only the gloriously overrated Tim Burton, who has managed to pull the wool over many people's eyes for over a decade now, could make a rich concept such as this a forgettable bore and a candidate for PND (Permanent Negative Destruction).As for screenwriter John August (scribe of the rancid BIG FISH), please throw your computer away and retire with Burton.",
    "89": "This doesn't hold a candle to the 1971 original classic. Period. Yes the special effects are superior but beyond that it is instantly forgettable. Gene Wilder had a point that this movie had none other than a much needed cash cow for this summer's weaker box office. Johnny Depp is a good actor but this role was completely wrong for him. His choices of playing Wonka as clutzy and spaced out conflicts with the fact Willy Wonka is supposed to be a mastermind of the candy business. Then of course there is the fact Depp's Wonka looks like something out of a Marilyn Manson video no parent with even half of a brain would bring their kids near. Burton's added back story of Wonka's childhood was his standard fare of misunderstood artist who just wants to feel like he fits in the universe. The brilliance of Wilder's performance was the fact he played someone who came across as a nutcase but was in fact a misunderstood genius always a step ahead of everyone else. Then there's the Oompas and their musical numbers. Oy! Half the time it's almost impossible to understand their vocals and what they're singing. I think this movie proves the general movie going public has become as catatonic in the brain as Depp's portrayal in this film. The children and their parents in this film were equally as practically lifeless. No wonder Hollywood is having trouble right now. This is so much of an insult to the 1971 classic that it leaves you wondering what classic they'll ruin next to get an all age audience back into the theatres.",
    "90": "I don't even know where to begin with how disappointed I was with this movie. Having grown up with the incredibly talented Gene Wilder as \"Willy Wonka,\" I expected my view to be tainted, but I tried to watch this film with an open mind. Nice try. Johnny Depp, who has made some wonderful movies in his own right, cannot hold a candle to Gene Wilder in this role. Whereas Wilder played Wonka as mysterious, a bit mischievous, but good-hearted, Depp played him like he had just done a serious amount of cocaine. His dislike for the children was overplayed and I was waiting for him to beat the crap out of them at any moment. Wilder's performance was more subtle and sarcastic. Depp's June Allyson hairstyle did nothing for me either. Whereas \"Willy Wonka...\" was made years before all this computer graphics crap, it seemed more real. \"Charlie...\" seemed like a film student's graduate project. Bottom line: \"Willy Wonka...\" is for adults. \"Charlie...\" is for children with a low I.Q. Some movies just don't need to be remade; in fact most don't. Look at \"Cheaper by the Dozen\" and \"Yours, Mine, and Ours.\" The people who made these movies took classic comedy and turned them into fart jokes and basic toilet humor. Doesn't anyone in Hollywood have an original idea? Or has America lost its integrity when it comes to movies? The best movies being made these days are independent films. What does that tell you?",
    "91": "Once again, we are subjected to greed and self promotion as another classic gets copied by today's filmmakers who shamelessly abandon creativity.First of all, let me get this off my massive chest. Yes, it is a REMAKE. The original was made in 1971. The arguments about the changing of the title or that it is closer to the book have no merit. It is a COPY of the 1971 classic with the SAME characters and basic storyline. Johnny Depp's performance falls so far short of Gene Wilder's and this is obvious to everyone. Wilder's wild, eccentric, poetic, unpredictable style was superior to Depp's reclusive, socially-moronic, mumbling, flashbacking attempt. Speaking of flashbacking, was that really necessary? Christopher Lee is a fantastic actor but this is wasted on one of today's ideas of having to pick through the origin of some of the best misunderstood characters in entertainment. Why oh why do people feel the need to go back in time to see Darth Vader, the Grinch, and now Wonka's child highlights when leaving it all alone is much more mysterious?The kids......2005 Charlie looks like an imp with over sized ears. Whenever I look at him I just can't get by those bat-wings! 2005 Verucca, though cute and talented, was nowhere near as bratty as the original. Making 2005 Mike Teevee a video game freak was to be in touch with the times, the original Mike was still superior. The original Violet was more obnoxious which equals better. This new one with the win-at-all-costs mentality falls short.The CG-generated Oompa Loompas were a lame joke. Mass producing that goofy looking filipino was totally lame. Though their songs were taken from the book, I thought the Augustus one was OK but I remain faithful to the original Loompa songs which were far superior, humorous and ingenious. I also remain faithful to the original 1971 movie which filled me with magic and adventure as a child.I also remain faithful to the original in terms of grading. 2005, made for the ignorant who missed the first one, is a failure. 2 out of 10 stars.",
    "92": "I went to see this film as I am a big Johnny Depp fan, but I was completely turned off by the whole thing. The pace was so slow I was almost asleep, and I kept waiting for the magical moments to happen. Alas, they never did. The opening went on for ever and a day - remember the wonderful entrance Gene Wilder makes in the original? Well, Willy Wonka's entrance here, with the stupid \"song\" of the puppets, was just dire. He actually looked embarrassed to be there. The parents of the \"lucky winners\" were one-dimensional to say the least, and although the child actors were OK they were nothing to write home about. My 11 year old son went with me to see this film, and as we came out of the theatre I was wondering what he would have to say about it (and whether I would have to pretend that I had liked it!) but the first thing he said was, \"Well, that's not the best film I've ever see. Bit of a disappointment really.\" I just felt that the director had wasted so many opportunities, not to try to emulate the first film, but to bring some fresh magic to the wonderful story. Instead, all we got was long-drawn out scenes, bad dialogue and a faintly embarrassed Johnny Depp.",
    "93": "This is not the only awful film to be made from a children's book in the last few years: Lemony Snicket and Cat in the Hat spring to mind, and certainly, the Harry Potter movies are never much better than mediocre.But Charlie and the Chocolate Factory suffers from the fact that it must be compared to the Gene Wilder version, Willy Wonka and the Chocolate Factory, which is not only superior to it in every way, but is truly a classic film.One might well ask why anyone would dare to remake a film that was written by Roald Dahl himself. A film that had beautiful, classic songs, biting humor, and a hilarious cast.The answer, of course, is money.This film was made for one reason -- to wring more money out of a Warner Brothers property. Why else remake a nearly perfect film? It's an insult to moviegoers and an affront to the many children who may never bother to watch the original now that they've seen this trash.The thing is, the Gene Wilder version is very, very funny. Its comedy still seems edgy today. And somehow, they've managed to turn it into a movie with almost no laughs. The timing is sometimes, it seems, deliberately thrown off.Johnny Depp's performance is, I think, his worst ever. It's just stupendously bad. Then again, he has basically nothing to work with, caught between plain, unfunny new dialogue, and struggling to go in the opposite direction from Gene Wilder's brilliance. I don't envy the task. But don't worry, Johnny got lots and lots of money for his troubles.The new Charlie, Freddie Highmore, was decent enough in the tearjerker Finding Neverland. But here, he's just all wrong. His one acting choice seems to be \"Smile Every Time You Say Something,\" which I last saw used by Denise Richards in Starship Troopers.On one hand, I wondered as I was watching it whether the movie would fare better with someone who'd never seen the original. But on the other, this film is so disjointed and strange, I'm not sure how anyone could follow it if they hadn't seen the first film. The Oompa Loompa \"songs,\" if you can call them that, consist of CG clones singing the same rhyming lines over and over again. There is no narrative or melodic progression to the songs -- they are as two dimensional as cardboard cutouts.Add to this bland, unimaginative mix a few ghastly changes from the earlier movie: Charlie has a father now, his family magically gets \"unpoor\" at the end by the dint of their own optimism, and Willy Wonka learns -- get ready for this one -- that families are not a bad thing.It's beyond awful. Watch the original again instead, I beg of you.",
    "94": "This is a so-so adaption of the book. However I love the first movies lovable brats! This film not even Charlie is lovable!The original movie has a heart. You liked the bratty children and Willy Wonka because were relate-able. No so in this version. The original also had a very magical spirit to it. This movie has no heart or soul! It is creepy. In the first movie The children were regular children. In this version we have \"Hollywood Children\". There is a bigger budget for this production but that was not an improvement. This movie has has \"Millions to spare\" on special effects. Since these effects are done in post production the children in this production had nothing to act to when they shot their part. So they are emotionally not involved in the scenes which harms this film! The film is over produced.(They have 1 man play all the om pa- lompas). However the best thing they did with the millions was the demise of Veruca Salt. They were able to do the squirrels (that was in the book). However I like the first movie's Veruca Salt's better.Johnny Depp plays Wonka like he is Michael Jackson. So that means he is just creepy. In The book Wonka isn't a creep! He loves children! In this movie he isn't a nice person! I am sure this movie will be a box office hit! I just hope if they do \"Charlie and great glass elevator\" they will make it with care. In fact they should let Chris Columbus direct it! Tim Burton is good in worlds of his own creation but his bizarre touch harms the overall effect of this film .Do yourself a favor buy the original film and pass on this!",
    "95": "While some may say this terrible film is more like the original book that the 1971 movie, but overall, it really isn't. My kids actually have the book and I read through it right after watching the DVD.This film may be more true to the book with some of the finer details (the original lyrics to the Oompah Loopah songs, Charlie having a living father who worked at a toothpaste factory), none of these details add anything to the story.On the other hand, the creepy, gray-skinned, androgynous Wonka is nothing like the original character in the book. He hates children (so why does he want to give the factory to one?). He can't even say the word \"parents.\" He even hates old people. There is absolutely nothing funny, amusing, or likable about him (BTW, the dialogue in the movie is purely awful). By the time there's a feeble attempt to redeem Wonka's character at the end, it's too late. And where were the childhood flashbacks of Wonka in the book? So much for \"more true to the book.\"I saw the 1971 movie as a kid, and enjoyed it. But I watched it many years later as an adult, and LOVED it. There's so many great lines in it that I missed as a six-year-old. If you read a little about the history of the making of the movie (look online), you'll find that the script at one point was originally developed more for adults than children. It's no wonder, because much of the humor is more geared for adults.Wilder plays the role of \"Wonka\" like it was made for him. Also, I believe the 1971 film story additions made for a much better story than the original book, and allowed you to see much further into the characters. Maybe I feel this way because I saw the movie before reading the book, but who can ever forget the scene near the end where Charlie shuns the opportunity for ill-gotten gains, even with his own Grandpa encouraging him to do the opposite. Wow. After seeing that, the book's ending seems kinda dull.",
    "96": "A brilliant and imaginative reinvention of a classic tale- Charlie and the Chocolate Factory (like the title) stays a lot more true to Roald Dahl's original source material and makes for a wonderfully wild and entertaining time. Growing up as a youngin- I felt deeply connected to Roald Dahl's imaginative and vibrant stories; having written such books a James and the Giant Peach, Fantastic Mr. Fox, The Witches, Matilda and so many more- but no book ever meant more to me than Charlie and the Chocolate Factory. When I saw the original film, wide-eyed and excited after reading the book a handful of times already, I felt an immense amount of disappointment and boredom. The original film's acting is dreadful, lacking of a consistent tone, broad and incredibly thin pacing, and all together just a very structurally unsound film. Thus I turned my child eyes to the work of Tim Burton with this film and immediately fell in love. It's such a beautiful adaptation from the source material, giving us the same songs used in the book, and staying incredibly accurate to the storytelling- with a few additions of course for the films runtime. All the films additions though, I really did enjoy, and provided a lot more heart to not only the film but also the character of Willy Wonka in general. The performances are all rather good, not a huge fan of the child actor playing Mike Teavee, but everyone else was perfectly cast and fun to watch- especially Johnny Depp's oddball character performance as the iconic character. The look and tone of the film exudes more of a dark energy, but I feel adds a lot to the wonder and whimsicalness of the story at hand. In the end, it may be an unpopular opinion, but I loved this film and would prefer it any day to the original adaptation.My Rating: 9.7/10.",
    "97": "Tim Burton's imagination produces, once again, images that are mesmerizing.Charlie & the Chocolate Factory is a multi-layered confection that serves simultaneously as an allegorical story for children and a pop culture cornucopia for adults.The first part of the movie concerns Charlie Buckets, a poor boy who is rich in familial love. He is one of five children who find golden tickets in their Wonka chocolate bars, allowing them to tour the Wonka factory. The other four are poster children for Spoiled Brat Syndrome.When the gates to the factory open to start the tour, it marks the second part of the film, much as Dorothy's entrance into Munchkinland. After that, the cultural references fly as fast as a glass elevator.Mr. Wonka, as played by Johnny Depp, is part Mr. Rogers, part Carol Channing, with just a smidge of Church Lady. But it's the factory--and its processes--that are the star of the film.Note the references to Shrek, Monty Python, Dr. Seuss, Busby Berkeley, Gulliver's Travels, Hair, Psycho, 2001: A Space Odyssey, Prince, The Beatles, Kiss, The Fly, The Beach Boys, and so much more. Much of it has a sixties-inspired Beatlesque style--an acid trip of psychedelic images. The actual story becomes secondary to the film's sensory stimulation. It's a visual and aural feast that is delightful. The special effects are seamless, the music inspired.",
    "98": "Witness me as I take this solemn vow: I hereby swear not to take my children to a theater and expose them to brainless pointless heartless bastardized rehashments of things I once held dear and loved, and have passes on to them in its original form to love as I have thus lining the pockets of talentless filmmakers and the Hollywood crap factories they work for thus promoting the demand for more of said substandard and unnecessary remakes.Well Well Well. Not much to be said that hasn't been said already. First of all, Tim Burton Hasn't made a good movie since Ed Wood in 1994, and I don't foresee him ever returning to his original form. The preview for \"Corpse Bride\" that accompanies Wonka just proves that. It promises to be just a rehashing of The nightmare before Christmas. The first 20 minutes or so of this movie did have promise, especially David Kelly's performance as grandpa Joe. I know everyone will be comparing this movie more to the 1971 original adaptation rather than the book, but I cant help it. The Original was timeless, this version is extremely dated (note the hip-hopped up versions of the oompa loompa songs) the Wolper film might have strayed from the novel by adding in new songs and removing Charlie's father (Dahl himself suggested this), but it didn't invent and entire subplot such as Wonka's estranged father. The film is like someones dissertation of the story, attempting to dissect the character and explain his origins, something Dahl would have never done. The film was poorly directed, relying heavily on CGI effects. As pretty as they were they did nothing to enhance the story. When I first saw Augustus, I couldn't decide weather HE was a CGI effect or an actual actor. In fact, all the kids in this movie have a sort of eerie \"plastinated\" effect, they don't look human, Like they stepped out of the Mutter museum. My biggest problem came from Johnny Depps performance. He may be slightly more true to the character in the novel, But Gene Wilder definitely played the part better. Wilder's Wonka was subtle, sardonic, romantic, evoking Shakespeare, Keats, and Oscar Wilde. Depp appears to be on dope. If Burton wanted a wonka that sounded and acted like Dave Foley from the Kids in the Hall, he should have cast he became totally obnoxious after only a few minutes on screen, and from then on it was almost painful to watch. Sad. what do you expect? This is by far the worst summer for \"movies\" in my memory. Is is any mystery why attendance is dropping off in theaters? when 7 out of 10 movies are remakes and 10 out of 10 are terrible, why not save 50 bucks and head to the video store. May I suggest David Wolper's 1971 classic \"willy wonka and the chocolate factory\" starring the incomperable Gene Wilder in the title role? your welcome.",
    "99": "Roald Dahl's delightful book of the same title gets a magical production by that wizard of wizards, Tim Burton. If ever was a man who was born to undertake the adaptation of this beloved book into a film it was Mr. Burton, a man who understands how to entertain an audience with a good story and great cinematic flair.Mr. Burton is lucky, as this film marks the fourth collaboration between him and its star, Johnny Depp. Both director and star are well attuned into what each expects from the other. The film is a triumph of creativity with a film that will satisfy children of all ages as well as grown ups. The screen play by John August serves the book and the film well.Mr. Burton has given the film a glossy look that is absolutely impossible to be distracted at any given moment. In fact, the time flew by without realizing the movie was over, leaving us craving for more.Willie Wonka, the genial chocolate maker, decides to invite five children for a tour of his famous chocolate factory. From the five that win the privilege, Charlie Bucket, the poor child with a rich family life, in spite of their poverty, is the only one we realize is going to be the winner because the other four display the worst qualities that will surely clash with their host. Charlie, the humble child shows Willie that having a loving family is a treasure that the chocolate maker hasn't got.To say that Johnny Depp is magnificent, is not saying anything at all. As Willie, Mr. Depp has a brilliant field day hosting the group, and us, through his world and his realm. Mr. Depp is an absolute delight to watch; he seems to do everything so naturally that he becomes the real Willie Wonka.As Charlie, Freddie Highmore, who had already appeared with Mr. Depp in \"Neverland\", proves again he is a young actor that is easy to like because he seems to be a natural. As his grandfather, David Kelly, is also wonderful. Freddie's parents, Noah Taylor and Helena Bonham Carter are good, and the supporting cast do an excellent job under the direction of Mr. Burton. Deep Roy, as Oompa Loompa deserves special mention as he is seen hundreds of times! Philipe Russelot, the cinematographer does wonders with his camera. The musical score is brilliant. The people behind the production technical part must be congratulated for giving the director their best into making this film, the joy it is.Let the viewer beware he is in for a magical ride thanks to Mr. Burton.",
    "100": "The 1971 Willy Wonka and the chocolate factory is one of the best kids movies of all time, Gene Wilder is wonderful, it's charming, has memorable songs, great effects and set design considering it's low budget and age and terrific performances from the child actors.\nEveryone knows that movie.The Tim Burton remake is just a bad movie. I like some of Tim Burton's movies and i think Depp is a great actor but this is a major misfire.\nDepp's Willy Wonka acts like he has mental problems, the songs are loud and obnoxious so you can't even make out what the lyrics are supposed to be and it all has that signature Tim Burton visual style which i do enjoy but it's so overdone now it's become a cliche.\nAlso the dry, sarcastic humor from the 1971 version has been replaced with annoying \"random\" and wacky nonsense and awkward silences like it's an episode of The Office or something.Avoid this dumpster fire and get your kids to watch the 1971 version, they'll love it.",
    "101": "If you love kids, don't let them watch this darkness but warn them against its cruelty; have them see the 1971 Wilder version instead: http://www.imdb.com/title/tt0067992/ though even it is regrettably dark, parental discretion & warning strongly advised. I have no desire to be negative about Johnny Depp's considerable gifts; it's rather the film's monstrous concept that's the problem, though I've no idea whether this or the 1971 Wilder version is closer to the book original. While Gene Wilder's 1971 version is a not-quite-so-dark delight, this darker version is needlessly and gratuitously cruel (not knowing which version is truer to the book original), kind of like the current vile, sadistic \"angry birds\" phenomenon that kids also don't need, as harshly as the cold, selfish, senseless world in which they're made to suffer already seeks their destruction. So much for the high price of post-Christian anti-God \"freedom\" (e.g. the hypocritical Star Trek delusions of godhood) where the imagined \"cure\" is vastly worse than the disease so grossly ignorantly and hypocritically condemned by lawless fascists, as the once great and literate civilization sinks ever lower into gross illiterate barbarism, as seen in this film, significantly surpassed by the 1971 rendition & its wonderful musical nature, seen at http://www.imdb.com/title/tt0067992/",
    "102": "Director Tim Burton has come a long way since his first job as an animator for Disney in the early 1980's. He made several animated shorts, none of which were deemed suitable for children - an early indication of Burton's dark outlook. However, his hard work and talent did not go unnoticed. His subsequent directorial work on Beetlejuice (1988), Batman (1989) and Batman Returns (1992) cemented his role as an experimental and visionary director/producer. Nobody else, therefore, was surely more suitable to adapt Dahl's much-loved novel, and nobody else was surely daring enough to attempt a re-make of Willy Wonka and the Chocolate Factory (1971, directed by Mel Stuart), that enduring classic starring Gene Wilder as Wonka.Burton's repeated use of Depp in previous films (Edward Scissorhands, Ed Wood, and Sleepy Hollow to name just three) indicated him to be an obvious and, it could be argued, perfect choice to cast as Wonka. Depp is by far the best thing about this film. His character's whole persona - the costume and body language, the tone of his voice, his pithy lines delivered in a contemptuous and yet charming manner, are all presented in such a way to add up to a well deserved challenge to Wilder's crown. But does he steal it? I'd say he doesn't. For someone that grew up with Roald Dahl's novels and film adaptations, Wilder IS Wonka. Trying to ignore my obvious bias, I believe Depp does put up a good fight, and perhaps if the parents of the four terrible children had shown more spark, or been actors of a higher calibre, his comic moments would have had much more impact.Burton's other muse, Helena Bonham Carter, is mis-cast as Charlie's mother. Her lines are delivered distractedly and with the air of someone very aware of her status in the film industry. Thankfully her role is quite minor and doesn't impact negatively upon the film. Freddie Highmore is fairly insipid, yet not offensive in his role of Charlie. The same description can be applied to David Kelley, who plays his Grandpa Joe. With the exception of Augustus Gloop, whose role is comparatively minor, the four ticket-winning children do not live up to expectations or standards set in the '71 Mel Stuart version. They simply serve to mildly irritate and disappoint, particularly Veruca and Violet. But I doubt anyone could match Julie Dawn Cole, the original Veruca.A certain amount of furore has surrounded Deep Roy, the 4ft 4\" tall actor who plays every single one of Wonka's all-singing, all-dancing Oompa Loompas. He also plays Wonka's therapist and, in a tongue-in-cheek moment, appears briefly on the closing sequence where he is revealed to be the narrator. The effects used to re-produce Roy as every single Oompa-Loompa I believe detract from the film. When viewing scenes, surely it's preferable to be absorbed and involved than to be distracted by special effects and wondering 'how/why did they do that?' Additionally, Roy's scenes are the only ones to feature music - there is no Wonka or Grandpa Joe breaking into song and dance in this adaptation. All we get here are the Oompa-Loompa's didactic lyrics, which unfortunately are drowned out by below-par sound editing.In an unprecedented move, Burton and screenwriter James August have given Wonka a history. Christopher Lee, who is sadly under-used in this film, plays his father, and we get to find out exactly why Wonka is such an enigma. I won't reveal the outcome, short of saying it's pretty unsatisfying and takes away Wonka's mystery - the very thing that makes him appealing. Claims have been made that this adaptation follows Dahl's novel much more closely than the 1971 version, of which it does - everything is followed almost to the letter. Unfortunately, the Wonka/father storyline clearly undermines any attempt the film has made to stay true to Dahl's novel - should Dahl had wished there to be a father figure, he would have included that in his book. However, certain artistic license is always taken when adapting books and plays to the big screen, and this creativity is needed to keep images and story lines fresh and to prevent any static grounding.As regards the imagery of the film, well, it's a Burton film and true to form we aren't disappointed. Typically, we enter and leave the film during gentle snow-fall. The poor Buckets' house leans pitifully to one side and almost makes you shiver when Charlie climbs into bed underneath a gaping whole in the roof. Colour is suitably hued down apart from certain scenes in the factory where the vibrant colours bring the songs and sets to life - the Chocolate Room and the Boat Ride come alive, and the Television Room almost blinds. The only fault I could find, and it is minor, is that at certain points of the Chocolate Room scene, the chocolate river where Augustus Gloop meets his untimely suction looks more like brown water than creamy chocolate. Apart from the afore-mentioned poor sound editing of the featured songs, audio here is of a top standard. Sound effects are clear, no dialogue is gone unheard and the musical score is in keeping with the tone of the film.Verdict - It's easy to be over-picky when comparing a film not only to a novel, but also to an earlier, much loved and highly-established film adaptation. However, faults notwithstanding, this is watchable fare that should appeal to all ages. Is it a classic? No.",
    "103": "Story. An adaptation of the eponymous and famous novel by the English writer Roald Dahl, or, to be more precise, a rethinking of the first film adaptation, filmed in 1971, which I have not watched or read the book. This film adaptation was staged by the famous gloomy storyteller of our time, Tim Burton, with the active participation of the magnificent Johnny Depp. I watched this picture for the last time about six years ago, and here recently I had a free evening, and my eyes fell on the disc with this picture. I reviewed it and was not disappointed, though I found a few drawbacks that had eluded me before. And here's my quick opinion - Tim Burton's Fairy Tale. Consider both the pros and cons of this tale from one of my favorite directors.\nSo the pros:\n1. Atmosphere - the picture is filled with fabulousness a little more than completely, despite the rather good looking realistic environment. This realism is misleading, albeit at first, but at the moment when the story begins to unfold, the viewer already begins to understand that there is a modern fairy tale in front of them, and ceases to pay attention to some absurdities, which could not be avoided.\n2. Cautionary story - the hero of our story is poor boy Charlie Bucket, who, having learned about the issue of five golden tickets from Mr. Wonka, the owner of the largest chocolate factory in the world, located in his hometown, dreams of visiting there. He gets it, and together with the other lucky ones, he goes to the factory, where real miracles await him. The story is instructive, because the rest of the lucky ones who got the ticket are the most disgusting qualities that are inherent in people - greed, gluttony, complacency, and so on. And Mr. Wonka is a kind of \"educator\" here, although he himself is not so good a character. Tim Burton makes fun and gives a lesson to children, as well as adults by the way, that being a bad person is not very good, and only people with a pure soul and love in their hearts are able to change this cruel world for the better. The ending is predictable and wonderful, no matter who says what. And the story calls for the same and makes fun of the vices of human nature, for which at one time the author was even strongly criticized.\n3. Music - Tim's regular composer Danny Elfman has written great music. There are compositions that are light-hearted, there are also frightening, mystical, dynamic, and indeed all this music can be listened to separately from the picture - and nothing is lost from this. Experience and seniority can not be spent on drink, as they say!\n4. Johnny Depp is Tim's \"constant muse\" who helped him create the best of his works, and I am now saying this without any exaggeration. Apart from the \"Pirates of the Caribbean\" series, it was Tim Johnny who played his best roles, and I hope he will play in the future. In addition to other actors, Johnny here holds the lion's share of the whole picture, or rather, his ingenious acting.\nSo the cons:\n1. Logical holes - you don't notice them at first, but if you look closely, they come out, like mushrooms after rain, and this is already beginning to interfere with viewing. Do not think, the script as a whole is excellent, but here are some points clearly forgotten to work out, or they were simply scored, like \"Okay! And so it will do!\".\n2. Inappropriate scenes - or rather, they are so stupid that even children will not appreciate them, let alone adults. There are few of them, but they are very unsettled.\nA little about the main characters:\n1. Charlie Bucket performed by Freddie Highmore is a kind and honest boy from a poor family, living with a sincere belief in miracles and well-mannered. Thanks to his character, he was able to get into Mr. Wonka's factory. Freddie is my age, and at such a young age he was able to convey the character of the hero, although he probably did not have to play it, maybe he was who knows! Well done anyway!\n2. Willy Wonka performed by Johnny Depp is an eccentric owner of a chocolate factory who at one point decided to invite five children to visit his brainchild, and at the end of one a real surprise awaits. Depp's Willy Wonka is an insane genius who steals every frame with his participation and makes the viewer literally stare at the screen so as not to miss the slightest emotion of Johnny. With his eccentricity, everything is not easy either, and deep in his soul there is a tragic story that is close and understandable to each of us. Johnny - bravo!\n3. Grandpa Joe performed by David Kelly - Charlie's grandfather, who worked for a long time in the factory of Mr. Wonka, whom he still admires. Thanks to his frantic energy, Charlie was able to achieve a lot. David was incomparable, and the wonderful Russian artist Alexander Lenkov also dubbed him into Russian, which adds even more charm to this character. Bravo!\nTim Burton's wife Helena Bonham Carter as Charlie's mother and the gorgeous Christopher Lee as Willie Wonka's father also starred in the film.\nI used to give the highest rating to this picture, but now I underestimate it, although not much, because the picture carries a good message in excellent scenery that cost a lot of money. The picture is still relevant, despite the fact that it was published sixteen years ago.\nAs a result, we have a great fairy tale by Tim Burton with Johnny Depp, with a great script, great music and atmosphere, but with logical holes and a couple of inappropriate moments.",
    "104": "A wonderful family movie.The main character is a boy from a poor family, who on his birthday was able to afford to buy a chocolate bar and he turned up with extraordinary luck.Other main characters are spoiled children who do not know the value of money, are ill-bred, as expected, do not listen to their elders, their instructions or just advice.The film will always be relevant, it expends important life situations, values, current problems. Thanks to this film, I understood many things for myself, I rethought a lot.This movie is suitable for the whole family to watch. When I was little, I watched it almost every day. I don't like science fiction, it's very surprising that I love this film, but it really deserves the attention of every inhabitant of our big planet.",
    "105": "Charlie and the Chocolate Factory/2005/**1/2Main Stars: Johnny Depp Freddie Highmore David Kelley Deep RoyIt wasn't a really good movie. Just because this movie follows the book by Roald Dahl more than the original movie (\"Willy Wonka and the Chocolate Factory\") doesn't mean it is better. The movie was good at the beginning but it went a bit downhill when Willy Wonka (Johnny Depp) appeared in the movie. There are a few reasons why I did and did not like this film; one of the reasons why I did not like this film was: Johnny Depp (Willy Wonka) had a very pale face and a very annoying voice in this movie. The reason why he wanted to be like this is because he intended to be like a kids' talk show host but some people predict he intended to be kind of like Michael Jackson in this movie. Even if he intended to be like Michael Jackson it would be weird anyway. Another reason is that the acting was not Oscar-caliber although Charlie (Freddie Highmore) and his Grandpa Joe (David Kelley) were good. The last reason is that this was the strangest and quirkiest movie I saw this year and I really can't explain how it was strange and quirky, it just was. The things I did like were the sets of the movie and Danny Elfman's musical score. It was also creative how the oompa-loompas' were played by the exact same person (Deep Roy). The story was kind of interesting, too. There were quite a few sets in this movie (the chocolate factory, the house, etc.) and they were all fantastic! There were a few comedy scenes but not many. In comparison, I'll have to say the original was better than this one. These are the reasons why I liked the original better than this one: Better acting (Gene Wilder as Willy Wonka, for instance), more songs, better screenplay and it was overall delightful! Original movie directed by Mel Stuart. \"Charlie and the Chocolate Factory\" directed by Tim Burton.",
    "106": "Who says that a movie can't be dark and still be for kids? Sure, the original may have sugar-coated things a bit more, but it was still just as dark and disturbing as this one was! And that's OK. Has anybody heard of the Brothers Grimm? They wrote fairy tales that were still ten times as dark as this movie, and they were for kids, and many of us read them when we were kids. Kids are savvier than we give them credit for, and honestly, I think that adults would be more put off by the disturbing imagery in \"Charlie and the Chocolate Factory\" than kids would. I saw this movie at a Friday afternoon matinée in a theater that was FULL of kids, and the reaction seemed pretty positive to me. (And as far as some of the \"hidden\" risqué jokes, I remember the same types of jokes in a lot of Disney movies from the late 80s and early 90s; it's a part of the kid's movie landscape now.) I thought it was an excellent movie, for adults or for kids. I also thought it had some touches that actually improved on the original; the set pieces were amazing, and there was more with the great glass elevator (like the book) than in the original movie, which I was pleased to see.I thought I'd go into this being bored until they got to the factory because that was how I felt about the original, but even the opening scenes with the Bucket family, and Grandpa Bucket's flashbacks to his time working at the factory, are wonderfully entertaining. The unusual imagery starts there, with the gigantic factory \"ten times as big as any other chocolate factory\", and Charlie's weird, funhouse-like shack and eccentric but loving family. I was most impressed with David Kelly as Grandpa Bucket, whose performance was all child-like wonder, and Helena Bonham-Carter and Noah Taylor were also good as Charlie's parents; and Freddie Highmore, who played Charlie, ought to have a decent career in front of him.Once they do get to the factory, though, things really take off. Johnny Depp puts in an excellent performance as Willy Wonka, not an impression of Gene Wilder AT ALL, but as usual, making the character his own. Without a doubt, he's the best thing about the movie, but the imagery is amazing too. It's exactly what you'd expect from a Tim Burton-made adaptation of the book; his trademark is all over everything, and the result is stunning. And the kids are great too, as are Deep Roy as every one of the Oompa Loompas, Missi Pyle as Violet's mother, David Kelly as Grandpa Bucket, and James Fox as Veruca Salt's father. From the start of the tour, the movie starts feeling like an acid trip, and the movie never lets go of that atmosphere. The result is amazing.The only slow parts, I think, are those dealing with Wonka's childhood (although Christopher Lee is good as his father, I just thought they were a little boring and wanted to get back to the factory when they were on) and the Oompa Loompas' musical numbers, which I didn't think had the charm of those in the original (actually, I thought the musical number with the puppets at the beginning of the tour was the best one in the movie). The ending is also just a bit overlong, but the whole package is so good that the pluses definitely outweigh the minuses. You'll enjoy this movie, especially if you're already a fan of Tim Burton's work, but also, I think, if you're a fan of the original movie or the book; however, even kids who have never been exposed to any of this will be entertained. It's often hilarious, always a visual treat, and has something to offer for everybody.",
    "107": "I don't know how in the WORLD this film received 7.5 out of 10! This was such an insult to the original \"Willie Wonka\" that it should make Gene Wilder want to spit! The plot was ridiculous, the songs were lame, the script stunk, I mean I can't figure out what Burton was on when he threw this together. I know it made a lot at the box office because everyone anticipated that it would have been as excellent as the first, but to come to this website and see that it received this many votes, who in the world are you people? It was the worst 40 minutes of my life! 40 MINUTES BECAUSE I SPENT THE REST OF THE TIME FAST FORWARDING THROUGH THE THING! I am just truly embarrassed at how sad this film was and how very boring! When I think back to the 1970's version I remember being filled with happiness and contentment, what a beautiful tale, and how very entertaining! I mean everything about it! My cousin and I can still quote the entire film and still find it HILARIOUS! Then we have this present day flop where they duplicated the ugliest midget they could find OVER 1,000 times! Talk about saving money! I realize Johnny Depp has only been in about 3 good movies in his whole career, I should have remembered that before I rented this film! Do yourself a favor and see the ORIGINAL! Never mess with excellence!",
    "108": "I have been a fan of the movie \"Willy Wonka and the Chocolate Factory\" for many years now. I have also taken great pleasure in reading the novel by Roald Dahl. After seeing previews for this film, I had doubts that a remake like this would work for me. I thought I would love the original too much to like anything about this film. Nevertheless, I was wrong about \"Charlie and the Chocolate Factory.\" I was uncertain about Johnny Depp playing Willy Wonka, not sure he had the right potential for this particular character. Depp actually played the role superbly, creating a character so over-the-top and zany that I'm sure Roald Dahl would have been pleased. Freddie Highmore plays Charlie very well also, coming across as the innocent, poor boy made manifest by the book as well as the original movie. AnnaSophia Robb also stands out to me as Violet Beauverguard. This version also restored some sections of the book not made into film in the original version, such as the story of how Willy Wonka found his Oompa-Loompas and building a chocolate castle for a rich prince. Also, this film adds a great new story that is both touching and fascinating, the story of Willy Wonka's dad (Christopher Lee), the dentist who drove him to rebel and create a chocolate factory. This is actually my favorite section of this movie. Not a perfect movie, as the original was for me. I miss many of the original songs such as \"Pure Imagination\" from that film. Nevertheless, this film did not try to copy that one but rather relied on the novel. If you're uncertain about this remake, take it from a fan of the original: this one is worth seeing.*** out of ****",
    "109": "Roald Dahl wrote countless of books, many of which I grew up reading in secondary school. There are many of his works adapted for the screen as well (The Witches, Matilda), but none so far given the Tim Burton treatment.The opening credits/scene has Burton's fingerprints all over - the imaginative sequence, the Gothic soundtrack (done by long time Burton collaborator Danny Elfman), mammoth weird looking architecture and snow filled landscapes.In the beginning, we are brought to the small world of Charlie Bucket, whose family find difficulty in making ends meet. As Wonka announces the 5 Golden Tickets (for a special visit to his factory) hidden in his chocolate bars, we are introduced to the backgrounds of the other children's family and stereotypical character, like the German glutton, the English brat, the American go-getter, and the Television (Wonka accused of mumbling) boy. And no doubt, the audience will definitely root for the time when Charlie actually gets his ticket and join the rest.Willy Wonka is the number one Chocolateer, but he certainly has issues relating to people, and I guess nobody can blame him after having his \"Secret Recipe\" hijacked by corporate espionage. We are told of Wonka's background in a series of flashbacks throughout the plot, and one of my favourites is when he journeyed and stumbled upon the Oopma Loompas.As the narrative gets predictable, it actually turned it into its advantage, as the audience expects to see some innovative room in its spectacular imaginative splendour, the set pieces in which the children get themselves into, and the performance of the little Oompa Loompa people, whose hilarious spontaneous song and dance routine will definitely leave you laughing out loud.Towards the end, after the side-splitting zaniness of the factory excursion, the theme of Family is highlighted, and nicely wraps up the movie, both for Wonka and Charlie.Johnny Depp is class, but really though, I thought his Willy Wonka actually adapted Michael Jackson's look and nuances. He managed to highlight Wonka's freakiness and child like nature to a T, and Depp has shown he has done no wrong with diverse roles in Tim Burton's visionary movies. Also remarkable is his recommendation of Freddie Highmore into the role of Charlie. If you'd remember, they worked together before in Finding Neverland, and their on screen chemistry was brought into this film as well. Many touching moments featuring Highmore will tug at your heartstrings, and I suppose besides Dakota Fanning, he's one of my favourite child actors of today.I can't rave enough of the sets created for this film, with its wonderful use of colours. And besides scoring the film's soundtrack, Danny Elfman also provided the unique sounding voice of the Oompa Loompas, and purist of the book will be glad that the lyrics for most of their performances were from Dahl himself.Although adapted from a children's book, this is one movie I'd recommend to adults as well. I guess Roald Dahl would have been proud of this effort! Bring out the Wonka bars!",
    "110": "Tim Burton misses the mark... again. Here is a story that it seems to me would be difficult to ruin: a kid's movie about magical chocolate. The movie starts off well enough. We are introduced to Charlie's family and town and learn about the Chocolate factory. The finding of Charlie's ticket to visit the factory slowly lumbers towards its inevitable conclusion. This is my first complaint that the finding of the ticket was not serendipitous but treated as if desire can influence reality (remember kids, you can win the lottery so long as if you really, really want to win). OK. So what. It's forgivable. The story moves on and we find ourselves on a tour of the factory. For a while things are fine and then with one new plot device -- the elevator -- things go completely downhill. Now effects rather than character take over the story (I don't call them special effects because it's not often anymore that they 'wow' us... they are ordinary effects). The characters also act completely unnatural during some of these scenes (i.e., the parents and Wonka just sit back and watch barely concerned as their children do dangerous things). Anyway, the movie goes on until the end. There's no point about it except the most cliché of moral lessons \"your family is important\".The kids in the theater laughed a few times (but not as much as they have the potential for). As an adult, I laughed twice. Once was at a pretty good joke, I must admit, about what's edible. The other was at something that wasn't intended to get a laugh.Oh, regarding Wonka, what a strange dude! He's got problems... real problems.",
    "111": "As per usual the team of Johnny Depp and director Tim Burton can always be counted on to deliver from the dark-side. Thus it is with this remake of Willy Wonka and the Chocolate Factory though this was actually done under its original title.Depp expands his list of quirky characters and expands his range which I think is bigger than any other player around today. His chocolate magnate Willy Wonka is a dark character, so different than Gene Wilder back in the day. His character is great, but it might have frightened a few little tykes going to a family film.The story is basically the same, young Charlie Buckets a kid from a poor and extended family where both sets of grandparents are all under one roof. He lives in a town where years ago all the human workers were given the sack from the Wonka Chocolate Factory and it became fully automated. What grief he must have gotten from organized labor can only be imagined.Anyway Wonka who's become so obsessed with being the Chocolate King he's got no family and no heirs. We're not even sure, but that he might be celibate. He's put five gold tickets in one of his millions of Wonka Bars and the lucky five kids who get them win a trip inside his factory where no one has been.Charlie turns out to be one of the five and accompanied by his grandfather and the other kids and their guardians he takes a magical tour of the place. They meet the little tribe of Oompa-Loompas who live and work in the factory.Freddie Highmore is an earnest young Charlie. I do miss Jack Albertson as the grandfather from the first film. He registers far better than David Kelly in this one.The film really is a star vehicle for Johnny Depp, more so than the first film was for Gene Wilder. You'll like it, it's like biting into that first Wonka Bar.",
    "112": "Reteaming for their fifth collaboration in 15 years. Tim Burton directs Johnny Depp in Charlie & The Chocolate Factory. I don't understand all the have this movie gets. I for one found it as enjoyable as the 1971 version. It's very silly, but visually stunning and I enjoyed a hell lot of it.I can't praise the cast enough of this movie enough here. AnnaSophia Robb as Violet Beauregarde, Julia Winter as Veruca Salt, Jordan Fry as Mike Teavee, and the boy with the funniest line In the movie Philip Wiegratz as Augustus Gloop (His delivery of said line is hilarious.) are all splendidly horrid. Then there is Freddie Highmore as Charlie Bucket. I love this kid, I think he is superb in everything I have seen him in, (check out Finding Neverland and August Rush) Burton does a great job getting great performances from his child actors. As for the adult cast David Kelly as Grandpa Joe is a delight, Helena Bonham Carter (in her first of five pairings with Depp) as Mrs. Bucket is surprisingly less cooky than one would imagine, and it's a true case of less is more. Noah Taylor is fine as Mr. Bucket. Missi Pyle is fun as the ambitious glory driven pushy mother Mrs. Beauregarde. Christopher Lee has a small role as Dr. Wilbur Wonka and Deep Roy is great as every Oompa- Loompa. Then there is Johnny Depp as Willy Wonka. Back when this was made Depp was one of my top 10 actors, but sadly there is something missing in his work since this time (with the exception of Sweeney Todd) as he seems to be lost in big budget sequels to the 'Pirates Of The Caribbean' and underwhelming movies. I was bored all the way through 'The Tourist' but I at least stayed awake. I fell asleep during 'The Rum Diary' and 'Public Enemies' (his best movie since Sweeney Todd) was a missed opportunity, Although I liked Depp's performance. There is an energy around Depp (that unless he is working with Burton) has been missing in most of his work between then and now.The film's heart comes from Highmore, a gifted young performer whose performance is very sincere, honest and unforced in a way that's rare in a child actor. Johnny Depp was so impressed with Highmore's performance when they co started in 'Finding Neverland' that he recommended that Tim Burton hire him for the role of Charlie Bucket.",
    "113": "Like many others, I grew up with Willy Wonka and The Chocolate Factory, and loved it dearly, and try as hard as you like but comparisons were always going to be inevitable. Meeting high expectations were always going to be a tall order, and in my opinion, this film has failed to meet them.Little needs to be explained about this film, as the story is as familiar now to everyone as the 3 bears. Johnny Depp as Willy Wonka takes us on a very dark and even disturbing tour of this factory, with the 5 kids accompanied by a parent/grandparent in their tale.In some ways this is a horror tale where the film is made for us to wish to see the kids get what they deserve, but this takes away from the light heartedness of the tale. The kids to me are more freakish than the original and don't seem to be given sufficient time, and Tim Burton's take seems to see his imprint want to overshadow that of Roald Dahl's.I was a little disappointed by this movie, although i don't deny the setting was wonderful, and the interpretation original, but I can't see myself wanting to ever watch it again.... and in any case why didn't they keep that wonderfully frightening boat ride as in the first movie?",
    "114": "As if the mere fact that even today's major Hollywood film-makers - Tim Burton, The Coen Brothers, Steven Spielberg, Oliver Stone - have resorted to remaking earlier successes was not alarming enough, here we also have a remake which, despite being helmed by a vastly more talented director than the original's anonymous Mel Stuart, proves to be much less appetizing (pun intended). The thing is that, while the remake has all the visual flourishes and outrageous production design synonymous with its idiosyncratic director, it is fatally compromised by the distinctly unsympathetic characterization given by Johnny Depp (ironically, my favorite actor working in films today) in the all-important role of the reclusive Willy Wonka. While I haven't read the Roald Dahl book myself, so I can't really say with any measure of accuracy which of the two characterizations - Gene Wilder's in the 1971 original or Depp's in the remake - is the closer to Dahl's conception of Wonka, it goes without saying that Wilder's is the winner here. All in all, in fact, although I didn't enjoy that film on second viewing as much as I did the first, I prefer Wilder's version in practically every department. Also, while I did get used to the bizarrely \"modern\" musical numbers as the film progressed, I don't think they were really suited to the material. The appearance of Christopher Lee as Depp¡¦s dentist father was a welcome addition, though, and in a way his scenes helped make some of Wonka's eccentricities more palatable. In conclusion, while Burton's remake of WILLY WONKA AND THE CHOCOLATE FACTORY wasn't as disastrous as his 2001 version of PLANET OF THE APES, which was decidedly his nadir, here's hoping that he gets back to concocting his own original visions before long.",
    "115": "First off, I would really like to emphasize that this movie is *not* a remake of the 1970's film. That's like saying Peter Jackson remade Ralph Bakshi's 1970's version of LOTR. It's instead a new, darker, and more cynical look at Roald Dahl's novel. Dahl's work is infamous for being darker than your average kiddy fare, so in that sense, Burton *was* being faithful to the source material. Beyond that, I honestly don't care how faithfully Burton recreated the original book because what I saw on the screen was captivating, satisfying, and definitely enjoyable. The opening sequence, complemented perfectly by Elfman's quirky soundtrack, had me eager for the rest of the film. The acting was great, including Depp's quirky and original take on Wonka and Highmore's heartbreakingly pure Charlie. I loved the overall look of the film, including the beautifully bright and colorful, yet still sterile, semi-dark, and slightly off-kilter, factory. One major change that Burton made, which seems to be a point of contention for some, is the inclusion of a back story for Wonka which brings in Christopher Lee in a delightful cameo. While the flashbacks themselves could run a little long and make the action of the movie stutter a bit, I liked the overall story and how it influenced the eventual ending, which I thoroughly enjoyed. The only complaint I really have is the lack of dialogue on the part of the children while they're in the factory. There were a few nice bits of memorable banter, but I left wishing they had had more screen time. This is especially true for Veruca, who was nowhere near whiny or demanding enough for my taste. Overall, I enjoyed the movie, but wished there had been a little more to it. Still, I understand that it's difficult to pack so very much into a short span of time. While it may not be the richest treat, \"Charlie and the Chocolate Factory\" is a solid and delicious, if a bit small, piece of dark chocolate in a shiny and eye-catching wrapper.",
    "116": "In 2005, I heard about this then-new version of Roald Dahl's \"Charlie and the Chocolate Factory\" and how Johnny Depp played Willy Wonka in it. It had been years since I had last read to book and seen the original 1971 adaptation, \"Willy Wonka & the Chocolate Factory\", but I still remembered the story very well and went to see this second big screen adaptation in the theatre. I was impressed at the time and still was months later when I saw it again on DVD. Earlier this month, I watched the 1971 film for the first time probably since the late 1990s, and thought it was an overall excellent family film. Over a week later, I watched this Tim Burton version again for the first time in several years, and thought it slightly inferior but still very good.Charlie Bucket is a young boy in a poor family, which consists of him, his two parents, and his four bedridden grandparents. His father can barely support the family by working in a toothpaste factory. Near their run-down home is a chocolate factory, run by a reclusive man named Willy Wonka, whom Charlie's Grandpa Joe used to work for. Nobody knows who currently works there, as nobody is ever seen entering or exiting the building, but world renowned candy keeps coming out of it! When it is announced that Wonka has put golden tickets into five different candy bar wrappers, which could be found anywhere in the world, and the five recipients will get a tour of his factory, chaos begins! The first four tickets are acquired by four mean-spirited kids, and since Charlie's family can hardly ever afford chocolate, it's highly unlikely that he will get one. However, after he finds money left out in the snow, he goes to buy a Wonka bar with it, and finds the fifth and final golden ticket inside! He gets to go on the tour, and takes Grandpa Joe along, but they are in for some surprises! One of the major differences between the two movie adaptations is Johnny Depp's portrayal of Willy Wonka here. It was apparently inspired by several famous children's TV hosts, and this version of the character is not one of the stronger aspects of the film, and not one of Depp's strongest performances. It cannot compare with Gene Wilder's portrayal, though it isn't exactly bad, and the character can be pretty funny at times here. Despite that one flawed performance, the cast of this 2005 version is mostly very strong. In the role of Charlie, Freddie Highmore is just as good here as Peter Ostrum is in the 1971 film. They also got talented cast members to play Charlie's family members, including David Kelly as Grandpa Joe and another common Tim Burton recast (like Depp), Helena Bonham Carter as Mrs. Bucket. Most of the cast performances are impressive, another example being Deep Roy digitally multiplied as the Oompa Loompas, who sing songs, play musical instruments, and parody various rock bands! I just didn't care much for Missi Pyle as Mrs. Beauregarde. This film has the usual dark and amazing Tim Burton visuals, and like the 1971 version, great sets were made for Willy Wonka's factory! For the most part, the story is very entertaining as well, even if the ending could have been a bit better thought out.Some say it's best not to compare the two silver screen adaptations of Roald Dahl's classic children's book, but since I've watched this one again shortly after revisiting the original after so many years, it's kind of hard for me not to. 2005's \"Charlie and the Chocolate Factory\" is unsurprisingly weaker than 1971's \"Willy Wonka & the Chocolate Factory\", and I know many fans of the first adaptation have shown great disdain for this remake, but personally, I think both of them are highly entertaining family movies, though I can understand how Johnny Depp's portrayal of the reclusive factory owner could put many viewers off. This Tim Burton film does take some liberties with the story, and I would be giving away too much if I mentioned many of them, though it also features aspects of the book not included in the 1971 version, such as Mr. Bucket being alive and working in a toothpaste factory and Grandpa Joe telling his grandson about chocolate palace in India, not that I'm saying any of this is good or bad. If you're a fan of the book, both adaptations could be a lot of fun to watch.",
    "117": "As one would expect, this modern take on Roald Dahl's story benefits greatly from advances in special effects; the look of both the bleak town and the factory interior are spectacular. I feel a bit of \"awe fatigue\" at this point, though, since $200 million films routinely strive for surprising visuals (often to the detriment of more down-to-earth qualities) and there's only so many things we can be truly surprised by.The most glaring shortcoming of this \"Chocolate Factory\" is the bizarre, off-putting performance of Johnny Depp. He is as badly miscast as Gene Wilder was in the earlier film (Willy Wonka was both very old and a dwarf), but Wilder was very likable. Depp is just strange.This one isn't a musical, so I can't really criticize it for not having songs, but I will say this: it could use some songs (besides the Oompa-Loompa musical lectures). The \"reimagined\" children are disappointing (gum-chewing and TV-watching aren't interesting enough flaws anymore so now we get hyper-competitiveness and technological precocity in their place). Veruca Salt is still a spoiled rich girl, but now she's self-aware enough to be two-faced, instead of throwing tantrums. It all makes for a long, slow tour through the factory.The Oompa-Loompas are better in some ways and not in others--their look and songs are different, but they're too \"modern\" and seem out of place. They also pull the punches--we're told before he's even gone that no harm will come to Augustus Gloop, despite his clearly deserving it. It's better that we're not sure (like in the 1970 version).All in all, this Tim Burton Vision of Dahl's story is a big, fat disappointment. The best parts of the story (like when Charlie believes the 5th ticket has been found, then gets the double surprise of the revelation of the forgery and getting his own ticket) are almost entirely skipped here. It's as if Burton doesn't want us to enjoy the story. If so, he got his way (at least with me).",
    "118": "As per usual the team of Johnny Depp and director Tim Burton can always be counted on to deliver from the dark-side. Thus it is with this remake of Willy Wonka and the Chocolate Factory though this was actually done under its original title.Depp expands his list of quirky characters and expands his range which I think is bigger than any other player around today. His chocolate magnate Willy Wonka is a dark character, so different than Gene Wilder back in the day. His character is great, but it might have frightened a few little tykes going to a family film.The story is basically the same, young Charlie Buckets a kid from a poor and extended family where both sets of grandparents are all under one roof. He lives in a town where years ago all the human workers were given the sack from the Wonka Chocolate Factory and it became fully automated. What grief he must have gotten from organized labor can only be imagined.Anyway Wonka who's become so obsessed with being the Chocolate King he's got no family and no heirs. We're not even sure, but that he might be celibate. He's put five gold tickets in one of his millions of Wonka Bars and the lucky five kids who get them win a trip inside his factory where no one has been.Charlie turns out to be one of the five and accompanied by his grandfather and the other kids and their guardians he takes a magical tour of the place. They meet the little tribe of Oompa-Loompas who live and work in the factory.Freddie Highmore is an earnest young Charlie. I do miss Jack Albertson as the grandfather from the first film. He registers far better than David Kelly in this one.The film really is a star vehicle for Johnny Depp, more so than the first film was for Gene Wilder. You'll like it, it's like biting into that first Wonka Bar.",
    "119": "Reteaming for their fifth collaboration in 15 years. Tim Burton directs Johnny Depp in Charlie & The Chocolate Factory. I don't understand all the have this movie gets. I for one found it as enjoyable as the 1971 version. It's very silly, but visually stunning and I enjoyed a hell lot of it.I can't praise the cast enough of this movie enough here. AnnaSophia Robb as Violet Beauregarde, Julia Winter as Veruca Salt, Jordan Fry as Mike Teavee, and the boy with the funniest line In the movie Philip Wiegratz as Augustus Gloop (His delivery of said line is hilarious.) are all splendidly horrid. Then there is Freddie Highmore as Charlie Bucket. I love this kid, I think he is superb in everything I have seen him in, (check out Finding Neverland and August Rush) Burton does a great job getting great performances from his child actors. As for the adult cast David Kelly as Grandpa Joe is a delight, Helena Bonham Carter (in her first of five pairings with Depp) as Mrs. Bucket is surprisingly less cooky than one would imagine, and it's a true case of less is more. Noah Taylor is fine as Mr. Bucket. Missi Pyle is fun as the ambitious glory driven pushy mother Mrs. Beauregarde. Christopher Lee has a small role as Dr. Wilbur Wonka and Deep Roy is great as every Oompa- Loompa. Then there is Johnny Depp as Willy Wonka. Back when this was made Depp was one of my top 10 actors, but sadly there is something missing in his work since this time (with the exception of Sweeney Todd) as he seems to be lost in big budget sequels to the 'Pirates Of The Caribbean' and underwhelming movies. I was bored all the way through 'The Tourist' but I at least stayed awake. I fell asleep during 'The Rum Diary' and 'Public Enemies' (his best movie since Sweeney Todd) was a missed opportunity, Although I liked Depp's performance. There is an energy around Depp (that unless he is working with Burton) has been missing in most of his work between then and now.The film's heart comes from Highmore, a gifted young performer whose performance is very sincere, honest and unforced in a way that's rare in a child actor. Johnny Depp was so impressed with Highmore's performance when they co started in 'Finding Neverland' that he recommended that Tim Burton hire him for the role of Charlie Bucket.",
    "120": "Like many others, I grew up with Willy Wonka and The Chocolate Factory, and loved it dearly, and try as hard as you like but comparisons were always going to be inevitable. Meeting high expectations were always going to be a tall order, and in my opinion, this film has failed to meet them.Little needs to be explained about this film, as the story is as familiar now to everyone as the 3 bears. Johnny Depp as Willy Wonka takes us on a very dark and even disturbing tour of this factory, with the 5 kids accompanied by a parent/grandparent in their tale.In some ways this is a horror tale where the film is made for us to wish to see the kids get what they deserve, but this takes away from the light heartedness of the tale. The kids to me are more freakish than the original and don't seem to be given sufficient time, and Tim Burton's take seems to see his imprint want to overshadow that of Roald Dahl's.I was a little disappointed by this movie, although i don't deny the setting was wonderful, and the interpretation original, but I can't see myself wanting to ever watch it again.... and in any case why didn't they keep that wonderfully frightening boat ride as in the first movie?",
    "121": "As if the mere fact that even today's major Hollywood film-makers - Tim Burton, The Coen Brothers, Steven Spielberg, Oliver Stone - have resorted to remaking earlier successes was not alarming enough, here we also have a remake which, despite being helmed by a vastly more talented director than the original's anonymous Mel Stuart, proves to be much less appetizing (pun intended). The thing is that, while the remake has all the visual flourishes and outrageous production design synonymous with its idiosyncratic director, it is fatally compromised by the distinctly unsympathetic characterization given by Johnny Depp (ironically, my favorite actor working in films today) in the all-important role of the reclusive Willy Wonka. While I haven't read the Roald Dahl book myself, so I can't really say with any measure of accuracy which of the two characterizations - Gene Wilder's in the 1971 original or Depp's in the remake - is the closer to Dahl's conception of Wonka, it goes without saying that Wilder's is the winner here. All in all, in fact, although I didn't enjoy that film on second viewing as much as I did the first, I prefer Wilder's version in practically every department. Also, while I did get used to the bizarrely \"modern\" musical numbers as the film progressed, I don't think they were really suited to the material. The appearance of Christopher Lee as Depp¡¦s dentist father was a welcome addition, though, and in a way his scenes helped make some of Wonka's eccentricities more palatable. In conclusion, while Burton's remake of WILLY WONKA AND THE CHOCOLATE FACTORY wasn't as disastrous as his 2001 version of PLANET OF THE APES, which was decidedly his nadir, here's hoping that he gets back to concocting his own original visions before long.",
    "122": "First off, I would really like to emphasize that this movie is *not* a remake of the 1970's film. That's like saying Peter Jackson remade Ralph Bakshi's 1970's version of LOTR. It's instead a new, darker, and more cynical look at Roald Dahl's novel. Dahl's work is infamous for being darker than your average kiddy fare, so in that sense, Burton *was* being faithful to the source material. Beyond that, I honestly don't care how faithfully Burton recreated the original book because what I saw on the screen was captivating, satisfying, and definitely enjoyable. The opening sequence, complemented perfectly by Elfman's quirky soundtrack, had me eager for the rest of the film. The acting was great, including Depp's quirky and original take on Wonka and Highmore's heartbreakingly pure Charlie. I loved the overall look of the film, including the beautifully bright and colorful, yet still sterile, semi-dark, and slightly off-kilter, factory. One major change that Burton made, which seems to be a point of contention for some, is the inclusion of a back story for Wonka which brings in Christopher Lee in a delightful cameo. While the flashbacks themselves could run a little long and make the action of the movie stutter a bit, I liked the overall story and how it influenced the eventual ending, which I thoroughly enjoyed. The only complaint I really have is the lack of dialogue on the part of the children while they're in the factory. There were a few nice bits of memorable banter, but I left wishing they had had more screen time. This is especially true for Veruca, who was nowhere near whiny or demanding enough for my taste. Overall, I enjoyed the movie, but wished there had been a little more to it. Still, I understand that it's difficult to pack so very much into a short span of time. While it may not be the richest treat, \"Charlie and the Chocolate Factory\" is a solid and delicious, if a bit small, piece of dark chocolate in a shiny and eye-catching wrapper.",
    "123": "In 2005, I heard about this then-new version of Roald Dahl's \"Charlie and the Chocolate Factory\" and how Johnny Depp played Willy Wonka in it. It had been years since I had last read to book and seen the original 1971 adaptation, \"Willy Wonka & the Chocolate Factory\", but I still remembered the story very well and went to see this second big screen adaptation in the theatre. I was impressed at the time and still was months later when I saw it again on DVD. Earlier this month, I watched the 1971 film for the first time probably since the late 1990s, and thought it was an overall excellent family film. Over a week later, I watched this Tim Burton version again for the first time in several years, and thought it slightly inferior but still very good.Charlie Bucket is a young boy in a poor family, which consists of him, his two parents, and his four bedridden grandparents. His father can barely support the family by working in a toothpaste factory. Near their run-down home is a chocolate factory, run by a reclusive man named Willy Wonka, whom Charlie's Grandpa Joe used to work for. Nobody knows who currently works there, as nobody is ever seen entering or exiting the building, but world renowned candy keeps coming out of it! When it is announced that Wonka has put golden tickets into five different candy bar wrappers, which could be found anywhere in the world, and the five recipients will get a tour of his factory, chaos begins! The first four tickets are acquired by four mean-spirited kids, and since Charlie's family can hardly ever afford chocolate, it's highly unlikely that he will get one. However, after he finds money left out in the snow, he goes to buy a Wonka bar with it, and finds the fifth and final golden ticket inside! He gets to go on the tour, and takes Grandpa Joe along, but they are in for some surprises! One of the major differences between the two movie adaptations is Johnny Depp's portrayal of Willy Wonka here. It was apparently inspired by several famous children's TV hosts, and this version of the character is not one of the stronger aspects of the film, and not one of Depp's strongest performances. It cannot compare with Gene Wilder's portrayal, though it isn't exactly bad, and the character can be pretty funny at times here. Despite that one flawed performance, the cast of this 2005 version is mostly very strong. In the role of Charlie, Freddie Highmore is just as good here as Peter Ostrum is in the 1971 film. They also got talented cast members to play Charlie's family members, including David Kelly as Grandpa Joe and another common Tim Burton recast (like Depp), Helena Bonham Carter as Mrs. Bucket. Most of the cast performances are impressive, another example being Deep Roy digitally multiplied as the Oompa Loompas, who sing songs, play musical instruments, and parody various rock bands! I just didn't care much for Missi Pyle as Mrs. Beauregarde. This film has the usual dark and amazing Tim Burton visuals, and like the 1971 version, great sets were made for Willy Wonka's factory! For the most part, the story is very entertaining as well, even if the ending could have been a bit better thought out.Some say it's best not to compare the two silver screen adaptations of Roald Dahl's classic children's book, but since I've watched this one again shortly after revisiting the original after so many years, it's kind of hard for me not to. 2005's \"Charlie and the Chocolate Factory\" is unsurprisingly weaker than 1971's \"Willy Wonka & the Chocolate Factory\", and I know many fans of the first adaptation have shown great disdain for this remake, but personally, I think both of them are highly entertaining family movies, though I can understand how Johnny Depp's portrayal of the reclusive factory owner could put many viewers off. This Tim Burton film does take some liberties with the story, and I would be giving away too much if I mentioned many of them, though it also features aspects of the book not included in the 1971 version, such as Mr. Bucket being alive and working in a toothpaste factory and Grandpa Joe telling his grandson about chocolate palace in India, not that I'm saying any of this is good or bad. If you're a fan of the book, both adaptations could be a lot of fun to watch.",
    "124": "As one would expect, this modern take on Roald Dahl's story benefits greatly from advances in special effects; the look of both the bleak town and the factory interior are spectacular. I feel a bit of \"awe fatigue\" at this point, though, since $200 million films routinely strive for surprising visuals (often to the detriment of more down-to-earth qualities) and there's only so many things we can be truly surprised by.The most glaring shortcoming of this \"Chocolate Factory\" is the bizarre, off-putting performance of Johnny Depp. He is as badly miscast as Gene Wilder was in the earlier film (Willy Wonka was both very old and a dwarf), but Wilder was very likable. Depp is just strange.This one isn't a musical, so I can't really criticize it for not having songs, but I will say this: it could use some songs (besides the Oompa-Loompa musical lectures). The \"reimagined\" children are disappointing (gum-chewing and TV-watching aren't interesting enough flaws anymore so now we get hyper-competitiveness and technological precocity in their place). Veruca Salt is still a spoiled rich girl, but now she's self-aware enough to be two-faced, instead of throwing tantrums. It all makes for a long, slow tour through the factory.The Oompa-Loompas are better in some ways and not in others--their look and songs are different, but they're too \"modern\" and seem out of place. They also pull the punches--we're told before he's even gone that no harm will come to Augustus Gloop, despite his clearly deserving it. It's better that we're not sure (like in the 1970 version).All in all, this Tim Burton Vision of Dahl's story is a big, fat disappointment. The best parts of the story (like when Charlie believes the 5th ticket has been found, then gets the double surprise of the revelation of the forgery and getting his own ticket) are almost entirely skipped here. It's as if Burton doesn't want us to enjoy the story. If so, he got his way (at least with me)."
}