{
    "0": "I've watched The Shift many times now and each time I've watched it I've seen another layer to the story, the sound effects, and the music. This is one of those films that is difficult to describe except, \"you should go see it for yourself to understand.\" It captures the feelings of despair I've felt during the low points in my life while providing a sense of hope based not on our surroundings but based on our choices. The most critical choice in life is if we are going to focus on ourselves and what we want verses focusing on others and our love for them. The Shift, I believe, will become a classic because it nails that truth extremely well.",
    "1": "My wife and I went to see this movie tonight and it was a beautiful love story! I love how the directors correlated the love between a man and a woman to the love between Father God and Job in the Bible! If you like love stories and thrillers this is a great movie to go take your family to! There is suspense and mystery and there are even times when you will be on the edge of your seat! It will make you wonder and question trials and tribulations that you go through in your own life! This life is tough but with the Almighty God who loves you on your side who could stop you? May the good Lord Jesus Christ bless you and your family!",
    "2": "Kristoffer Polaha and Neal McDonough are terrific. The movie really focuses on hope and endurance through faith in God. It moves fast and has lots of action and drama, yet a strong thread of fidelity and love.I have a few criticisms in the vein of \"I would have done it this way\". Clearly, these did not diminish the rating I gave.First, I would have Kevin as being more righteous (Job was righteous in his generation). Second, I would tone down the multiverse stuff (but I'm 61, so what do I know). Finally, (big spoiler alert) I would not have erased Kevin and Molly's son.I highly recommend this movie. It felt as good as anything from the major studios. It had very good effects, lots of twists, and a racially diverse cast (which, when appropriate, I am a fan off).Go see it, and take a friend.",
    "3": "I had very high expectations for this film and for the most part it completely delivered. Inspired by the book of Job, I feel like it was a unique and creative modern/futuristic retelling. I thought the cast was amazing, however, there could have been a little more character development. We didn't have enough time to begin loving the main character and his relationship with his wife. I still loved it though.I loved the setting and the darkness of the film, loved the casting, loved the quality of the film, and loved the depth of the storyline. It caused me to ponder the plot long after the movie had ended. The best thing was that it caused me to grab my Bible and look up some things from the book of Job. Well done!",
    "4": "It wasn't what I expected, but it was enjoyable and kept my attention throughout, the acting was great, the sets were well chosen and designed. You really can't know what to expect the end to be and there were many surprises/twists. Neal McDonough was perfectly cast as the Benefactor, and Kristoffer Polaha as Kevin. I am a Christian and happy to see movies taking new twists on Bible stories and applying them to current culture. This movie will definitely have you thinking throughout. Fans of science fiction will enjoy it as much as Christians, it really doesn't seem like a Christian movie until about the 2/3rds way through mark.",
    "5": "I wasn't sure what to expect when I heard about this movie. I almost didn't go to the screening; I don't see many movies in theaters anyway. I am so glad I went to see this movie in the theater. It's deep, impactful, and has stuck with me for days. I'm not necessarily a sci-fi or faith movie fan, and you don't need to be to enjoy this movie. Its faith element is very subtle. I plan to see the movie again on opening weekend in theaters with a couple of friends. The woman who plays the lead in the movie was absolutely breathtaking. If you want to see a real, heartfelt, well-made film this year, don't miss this one.",
    "6": "I really enjoyed this film for many reasons.First - a multiverse look inspired by the book of Job? That's an interesting enough concept as it is - but the add in a pretty complex love story, a solid antagonist in the Benefactor, very cool set design, and solid performances by the vast majority of the cast. It's very unique - minus one scene that I thought just looked too Matrix-y that I won't get into as a spoiler! - and it really made me think long after leaving the theater.Also-the soundtrack is really outstanding! It almost becomes a character in the film and is an exceptional addition to an already solid film.This is an unexpected gem - and you'll want to see it in theaters!",
    "7": "Neal McDonough shines as the benefactor. Liz Tabish gives the performance of her career. Kristoffer Polaha brings heart and solid lead to the love story that drives his character Kevin forward. This allegory of the biblical story of Job deals with the challenge of the darkness and evil in the world by pointing us to the moments that shine light on the goodness, beauty, and hope all around us. The intricate story weaves across the multiverse and was fun to untangle in conversation after the film.This film started out as a short film created by the first time writer/director on a shoestring budget. The final film was worth the wait!",
    "8": "I didn't know much about this movie and went because the significant other got tickets. In terms of story and suspense, this movie knocked it out of the park! Neal McDonough is perfectly cast as the \"Benefactor\" of what that is gets revealed at the end. A lot of utopian thriller movies about mankind have come out and with the exception of 1984, they've all pretty much were cliches of the same story. Where George Orwell gets his 1984 right is the mystery of the big brother. Same thing is happening here except big brother is a villain who tops all others. When I learned this is a father based movie, my opinion of it doesn't change at all. This is a well acted, carefully crafted story with solid performances by its lead actors. In fact, this thrill ride is better than a lot of overpriced Hollywood blockbusters that failed to deliver this year.",
    "9": "I was waiting for the release of this film and I was NOT disappointed. However, it is very choppy - and I thought in the beginning it would not get better, but once the movie was over, everything made sense. Yes, it is choppy and it moves back and forth within time and mutli-verses. Yet, it all comes together in a beautiful told story that makes you think long after the movie is over. Don't go in expecting it to flow like a movie you can get waste time in. Go in expecting a well-done cinematic movie that is different that what you are used to. Go in to be entertained but also to think about some of the themes and concepts they use.I know some people say it is dark - but isn't that how the world is? But it is not, it shows the light in the darkness of the world. Watch how Kevin brings light into the desperate world around him. We can all do that.",
    "10": "This film had a really good message about enduring faith and I loved the elements of alternate realities as well. With the really dark lighting and the terrifying effects, this has proved to be very spooky for an Angel Studios film and I loved that. I enjoyed the main protagonist's journey throughout the film and how it related to the Book of Job. Neal McDonough once again makes a menacing villain but this time, his antagonistic approach is more terrifying. Kristoffer Polaha and Elizabeth Tabish performed perfectly not just as their characters but also their alternate versions, which showcases their talent well. I have nothing bad to say about this movie other than that I wish it came out closer to Thanksgiving because the weather and message also felt like a Thanksgiving movie. This is worth the watch and it will give you chills!",
    "11": "Crazy good movie, you don't find movies that have this much faith building content that are this cleanly done. Gorgeous cinematography, amazing acting, story ark is a little flat in the middle . The romance was very well done ( all the women shrieked with joy in my screening) Sci-fi was fun but could have been better explained. True life principles of the challenf of this life was the best part. Are we good people with a few warts or are we bad peopl who occaisionally do good things. How should you act when you know you have weaknesesses. These themes are addressed in a very entertaining way throughout.",
    "12": "I had helped crowdfund The Shift years ago based on the short film I saw. I have been waiting and waiting to see how it ends. Totally worth the wait! The music and graphics were very intense. I loved seeing some of the actors from my favorite tv show, The Chosen, in it. Neil McDonough does an incredible job playing The Benefactor.... He does such a good job playing someone evil and creepy and he certainly achieved his goal of making me thoroughly hate Satan. Elisabeth Tabish was beautiful as Molly. Kristoffer Polaha was perfect as the main character. Even though I had to wait several years for this film to come out, it was worth the wait and I cannot wait to see it again. Highly recommend.",
    "13": "The Shift is a dark movie about the fascist surveillance state currently under construction by our psychopathic overlords. But it offers a message of hope for those awakened souls who are struggling in the darkness. If you are expecting the standard Sci Fi junk you won't find it here, because this movie has a deeper message. You have to pay attention because the plot moves along very rapidly. The Shift is the kind of movie that makes you think about the future of our species long after you've seen it, and sends the message: \"Never give up, never lose hope, for the humans spirit can never be crushed.\"",
    "14": "Having never been a big fan of sci-fi movies, I wasn't sure what to expect before watching The Shift. However, I know & respect the producers behind the film and have knowledge about the successful careers of the talented lead actors, so I went into the theater with great expectations...and I was not disappointed! In fact, after seeing it once, I am looking forward to watching it again. It's a movie that you don't just leave and forget. You exit the theater discussing it with your friends in attendance, while you process the meaning being the storyline, and recall the hidden clues and Easter eggs that you didn't catch right away! Highly recommend! I'll be back!",
    "15": "To start I'm not a huge sci-fi fan (at all)! I don't think I'm not creative enough to enjoy films made in another dimension or metaverse. But this movie, (and it's pre-cursor) made me realize the possibility that life may not be what we think it is. It also caused me to stop and think about the impact of my decisions. If a movie has that big of an impact, I think it's worth promoting.The actors were top notch. Kristoffer Polaha was amazing. Neal McDonough shined and made a leap from his days in the ridiculous \"Suits\" debacle. (My opinion may be contrary to popular belief about Suits, but I know IMDb is the right place to express it.) Liz Tabish continues to impress. And it was great to see Sean Astin as Gabriel.I love the bravery of these actors. Hollywood can be a difficult place to be an individual and go against the grain, but I applaud the entire cast. Thank you for taking the chance!",
    "16": "This movie was really well done. Great story telling, intense situations, moving drama and emotions, just captivating all around. Best of all, a deep, layered spin on faith. Strong good vs evil theme and finding yourself, becoming more self-less, and finding courage to do the right things. Don't miss how entertaining it all is, and how amazing McDonough is as a charismatic villain!I did watch it twice, and found lots of new things I missed and much more to think about, was talking about it with friends and family for a while afterwards. Everyone will find something here, fantastic love story, moving tragedy, intense action, suspense and intrigue, Sci-fi dystopian multiverse, it's a thrilling yet impactful ride. Not your 1-n-done special effects movie, although those are good too!",
    "17": "I enjoyed it, but it was a little far out, but it is a sci-fi. It was clean. No nudity or bad language that I remember. There was some screaming, extreme anger, and violence. My emotions were all over the place. It was full of ups and downs. Loved the acting from every character. Great love story in many ways. The movie was a bit slow and depressing in some parts. Maybe by design but I think the slowness went on a little too long causing my crew to start loosing interest. There were also to many unanswered questions. But all in all it was a great night out with the family. Provoked a good conversation. Go support the film and these great film makers.",
    "18": "Loved the beautiful blend of sci-fi, faith, drama, action. The emotions portrayed by the actors could be felt. Everything about it was so well done, the switches between the worlds, especially at a time mind games were being played on the main character. The acting was ao well done by all involved. Wonderful to see something on the big screen that keeps you engaged and doesnt have disgusting gore or sex scenes which are never necessary for a good movie. Cant wait to see more like this from Angel studios and Brock Heasley. Thank you for breaking the mold and getting truly great content out there.",
    "19": "I was lucky enough to get a pre-release screening of The Shift. I wasn't certain of the premise of the movie but it is definitely a modern day Job. If you look in the Book of Job in the Bible, I'm sure he felt a lot of things that Kevin, in the movie, felt. Would he ever come back to where he was originally? Why did God allow these things to happen?I enjoyed the movie. I've watched it twice and still getting new things out of it every time. Brock Hensley the writer, did an excellent job. I am so excited to see it in the theater Dec 1.I think you should go see this if you like SciFi.This film will make you look closely at your faith and how strong it is. Could your faith stand against The Benefactor?",
    "20": "This has been probably one of the best movies I've watched this year. Where you can see an actual spiritual warfare. And makes you think on the decisions we make every day.The movie has a fantastic performance of actors and actresses that are immersed in the role\nThe storyline is unique different and with multiple\nUnderstanding the characters is one of the most interesting part of the movie knowing who's in which side and why they do things but that's one of the most enjoyable part of the movie\nA modern day recreation of job, it will make you think it will make you cry, and it will make you change your perspective about life.",
    "21": "I didn't know how this movie would be, but I'm so glad I went to see it, especially in the theater. I love the actors that starred in the film and they brought their characters to life. The subject of the film was unique. There were some parts that at first were a little hard to follow but later on it became more clear. Surprisingly this movie has left me thinking and has now provided some thought provoking tools to help me cope with my understanding of people in the world. It was positively a good movie! I look forward to seeing this movie more times and look forward to seeing more from this writer/Director.",
    "22": "I enjoyed this movie. I have watched it three times. I didn't think the movie was perfect; most movies aren't perfect. The movie is almost two hours, but I was not bored. However, it was not meant to be a modern retelling of the Bible story of Job. This movie is it's own story. It is essentially a love story, but it is NOT a chick-flick. I would advise against bringing young children, as there is some violence during the movie, and young kids would probably not understand the storyline.There were some parts of the movie that I didn't understand, but this is not one of those movies that tells the entire story in an obvious way. For example, the coin Kevin spins in the beginning of the movie is a coin representing his sobriety, which he was about to throw away as he puts the beer to his lips. When Molly approaches, she also hints at her struggle with alcohol, which is later revealed and revisited in the movie.Overall, I thought the movie was very well done, especially since it was a freshman effort by Brock Heasley and Angel Studios. I look forward to seeing the future endeavors.",
    "23": "I've been waiting to see this movie in theaters for a long time. When I first saw the short film presented to Angel Studios as a potential project I had my doubts, but I really think it delivers. I was really impressed with the quality of cast and production value on a low budget. For a first time director, I'm really amazed at how well it turned out. I was worried the story would be confusing for those who hadn't followed the behind the scenes videos posted on The Shift's youtube channel. However, my two friends who saw it with me, and who didn't really know anything about it beforehand, were able to follow the plot just fine. I did think it was a little long. I think the whole cast did a great job with their parts. I hope people give it a chance and go see it in the theater. It isn't preachy. To quote another review I saw \"It is deep, beautiful, powerful, action packed, suspenseful, and intriguing all at the same time.\"",
    "24": "In this fantasy/sci-fi version of the book of Job, Angel studios really created a compelling story that both Christians and non-Christians can relate to.The acting and action sequences are on par with any of the best Hollywood produce. Neal McDonough continues to impress with his portrayal of the devil or in the case of this movie, a character named, \"The Benefactor.\"Actors Kristoffer Polaha, as the main character, Kevin Gardner, and Sean Astin, as Kevin's friend and co-conspirator, also bring some great talent to this production.There are some admittedly slower parts and in some ways the movie does struggle to bring this storyline in line with the Bible's story of Job, but it is well worth a go.",
    "25": "What a movie. It was fantastic! Unlike so many Christian movies, it wasn't über cheesy or predictable. And it does a great job of highlighting temptation, of personifying the devil on the shoulder who whispers perversions of the truth. The Devil is the ultimate deceiver, and he does that by miscommunication. So evident here, it is actually a theme of his chaos. It felt like a combination of the temptation of Adam and Eve and the Book of Job. Like any movie with multiple realities, there are things you can pick at and poke holes in, but they're not glaring and you'd have to be very nitpicky, to the point I wonder if you even want to enjoy the film. Definitely recommend!",
    "26": "All I knew before walking in was it had Kristoffer Polaha in it and it was a retelling of the book of Job. BUT it was so much more. The music, cinematography, and direction was so good. Neal did a fantastic job. Everyone involved did a great job. It has a sci-fi twist that is perfectly done. I need to see it again to find things I missed. Kris did great portraying Kevin and expressing all the emotions involved when loosing everything. Love Sean Astin. So don't want to give any spoilers away but all I can say is go see it and spread the news. So worth getting the right content out there with our time and money.",
    "27": "This is a serious thought provoker. I somewhat knew the pretext going in as a kind of a Biblical Job-Meets-Hunger Games-Meets Christmas Carol type of feel, but wasn't sure how the story would go. It was creative and very well acted by both the leads and the supporting cast. I think the best way to go in is with no expectation and just see where it hits you. So don't read much about the story. Just go see it. Great movie.I may go back to catch some of the nuances like sound, effects, and background action. There was a lot going on. I was surprised to see some great actors in the support roles, too!!",
    "28": "This movie is well, acted, well-produced, and gets you in the feels.I thought it might only touch lightly on the religious/faith themes (sort of like in M. Night Shamalyan's \"Signs\") but those themes were central to the movie. It was a Job story...why would God let a loyal follower suffer? I think this was an inspiring treatment of these faith themes.The character of the Benefactor was deeply spooky. Excellent performance.But...the sci-fi story and setting was also really compelling and had me wrapped up in the story...and I didn't feel it got resolved. What about all those people I learned to care about in the story? What happened to them? Is there any redemption of their world? I'd love some more epilogue and explanation.",
    "29": "This film is a parallel to Job from the Bible. Truth is, watching this film made me feel like I was being punished. It was that bad. I felt like I was Job. I leaned over to my wife and asked if she wanted to leave the theater. In our fifteen years of marriage I have never done that. The film was too long. Too boring. Too scattered. Didn't make sense. And lacked cohesion and rhythm. It's hard to describe how bad it was. I do like some of the messages portrayed here. But it was essentially a mix of Dr Strange, hallmark, marvel multiverse, and a Christian background. It didn't feel like a sci-fi or a romance or a drama. It didn't know what it was. So it ended up being very poor.",
    "30": "The Shift takes some unexpected twists and turns and I love how it is woven together in a story that keeps you off balance a little. You're not quite sure where this is going. It is a scifi take on the story of Job set in a futurist world or maybe I should say multi-verse. The main character is played heart wrenchingly by Kristoffer Polaha. Neal McDonough is wonderful as the Benefactor. We get to see Elizabeth Tabish (The Chosen) shine in a diferent light! She did a wonderful job as Kevin's Molly! Sean Astin's character was not what I expected, which I really liked. I love it when an actor throws you a curve! It is somewhat on the dark side, but I thoroughly enjoyed the movie.",
    "31": "Although I'm not normally a sci-fi fan, I loved The Shift! The storyline and characters were very interesting and well portrayed. It certainly keeps you on your toes with ever changing situations. The second time we saw it, we all noticed something that we missed the first time. We enjoyed it even more the second time, and plan to see it again! It's a combination of love, hope, and perseverance despite your current situation. Liz Tabish and Kristoffer Polaha are perfect for their leading roles. Neal McDonough can be downright terrifying as The Benefactor! Producers Brock Heasley and Ken Carpenter have a hit! Another great one from Angel Studios!",
    "32": "Ok, so I was hoping that this movie was going to be good by the looks of the trailers but I was sorely mistaken. I don't even know where to start. I think the movie was supposed to portray the fight between good and evil but the plot was so dumb that any moral of the story got lost by the confusing theme of the story. And the after the credits were run there was a short message given from the main actor to ask you to go to their website and buy tickets for all your friends to go see the movie. That just screams the modern day church trying to dig their hands deep in your pockets for more money in the name of religion. And I say that as a Christian myself. It's really disgraceful.",
    "33": "What an incredible movie! I was happy to see the integration of the original short film into the full length. The movie had just the right balance of Sci-Fi and realism that made it feel just right. It was filled with faith, love, resilience, and it's most redeeming was the ability to see what we cannot always see in our lives the risks that comes with following temptations. From beginning to the end of the movie we were engaged and anticipating what might happen next. The acting was great and nice to see casting from other Angel Studios productions. We have shared this movie with everyone that we know and wish it incredible success.",
    "34": "This movie is good. It's not a sequel, a prequel, a reboot, or a part of some cinematic universe. It's an original movie based on a chapter from the best selling book of all time. It's about time movie studios took the hint and began developing new content too and this movie comes along at just the right time for that. The story is compelling, deep and has profound meaning. The classic struggle between good and evil is woven throughout. The hope of the protagonist and other characters even when it appears that all hope is lost is a great message. As others have said, it really will get you to think about what is really important in life - is it material comfort or is it helping others using your God given gifts to make other's lives easier? Please see this movie, it will move you.",
    "35": "This movie is fantastic. I love how there are so many levels to unpack and so many subjects to consider and apply to my life. The words you are not worthy and you are not good enough are the words that play over and over in my head. The concept that God doesn't always rescue us is so Biblical. Kris Polaha is the best actor today. I forgot he is a Hallmark actor that leads a Bible study and truly believed he was Kevin. There is no part he can't play.If you have ever felt like God has left you or is not hearing you, this movie will remind you of the truth. We know the truth no matter what satan or any other one says. God will never leave or forsake us. Even though we don't get our way, we are loved.If you need light or hope go see this movie. You will be glad you did.",
    "36": "Tonight was the 2nd time I watched The Shift in one week. First was with 3 friends, tonight was with my husband and 3 other different friends. Tonight I left understanding more similarities in the movie and the book of Job. To be honest, I was not very enthusiastic about seeing it a second time. My feelings leaving tonight are entirely different than the first time. I left the first time confused and dark. As a believer I KNOW confusion & darkness is not from God. I left tonight with Hope. Hope and praise that Jesus saves and redeems. Looking forward to seeing it a third time with another friend. That's what community is... sharing the Message with one another.",
    "37": "The settings used in Birmingham AL for filming add nicely to the storyline. I wasn't sure if I would like it based on the trailer, but was very impressed with the finished product. The twists kept me guessing where it was going next. The most important message in this film is that whatever dark place you find yourself in, God is with you and there's always hope.Top notch cast. Neal McDonough's portrayal of satin with his self satisfied grin was perfect. And it was great seeing three top notch actors from Chosen.The violence in the film is not graphic but there's a good bit there. But it is fitting for the dark world he has been sent to.I highly recommend this film for teens and above.",
    "38": "I really enjoyed this movie. I was impressed with the depth of the movie. A friend told me to pay attention to the symbolism and layers in this movie and it really helped. I loved the action and my wife loved the romance, but what we both loved most was how it left us feeling. I loved the message of hope and that even under the hardest and most difficult circumstances we may find ourselves, we can overcome and find joy.Great acting, awesome music, crazy cool storyline woven into a multiverse. It is a film that everyone in my family loved. Movies like The Shift have brought me back to the theater.",
    "39": "Angel studios is doing such a great job. I enjoyed it all along. I also loved the scriptures. The story was quite similar to that of Job's. The actors did a great job as well. They portrayed the devil's lies exactly as they are and they also portrayed Job's faith very well. Another thing I loved is the fact they didn't make God a character here. Many movies tend to make that mistake. I just don't think we have the capacity for that. I cannot express how happy I was after I left the movie theater. It made me want to get home and read scriptures. Gob bless you all and I hope you keep this up for this and many other generations to come.",
    "40": "I felt the movie would be good and it was much better than I expected. It was so intriguing and held my interest. One of those movies where you sit on the edge of your seat. Kristoffer Polaha was excellent in this roll. I have always like him as an actor but had never seen him where he really showed his acting ability to do so many varied rolls. Liz Tabish also really showed off her great acting ability. I had only seen her in the Chosen and saw how she pulled this roll off. The movie was written so well. It made me want to see more.movies like this. Neal McDonough was also excellent. The movie really makes you think about how much faith do we really have.",
    "41": "Not sure if the folks leaving positive reviews saw the same movie as me but I found it horrible, the reference to the book of Job is far fetched, seems like a cheap sci-fi movie that threw in some bible references so the Christian would flock to see it. As I Christian I found it weird, if you read the book of Job this movie is hardly relatable. Sure he has a slight cough and loses his job and wife but that's about it, I found myself praying that the movie would just end. The movie had about 8 elderly folks in it ,I think some Churches are giving away free tickets....not sure why. I don't think I will see any more of Angel's movies!",
    "42": "This was an Excellent movie! It gripped me from the start and held my attention untill the end! It was moving, intense, and kept me engaged throughout. This is definitely a must see. The performances by Kristoffer Polaha and Neal McDonough were intense and riveting! They took me on a crazy ride and made me feel everything they were going through. I have been a fan of Kristoffer's for quite awhile now and this is his best performance! He made me forget I was watching a movie and I felt all his emotions. I recommend staying till the end to hear a message by Kris regarding paying it forward, which I did! Love that concept!",
    "43": "After waiting for many months to see this film debut, I have to say that I was not disappointed with Brock Heasley's first attempt at a screenplay. There have been several negative reviews about the story lacking depth of character development. I think that many of us had the privilege of seeing his short film and were able to see more relationship development between Molly and Kevin, but I think that the movie version does a great job of showing us Kevin's despair and why that happens. I do agree that some of the \"stormtroopers\" seem a bit much, but I think the idea is to give the feeling of being under constant pressure and control. I loved how the movie ended and it felt completely perfect.",
    "44": "I had the opportunity to preview The Shift by Angel Studios, and I can't wait to see it again in a movie theater. If you love the Chosen, this is a whole new experience that you will enjoy. The Shift is a fast-paced, science fiction thriller with lots of plot twists. You will be captivated by each scene.The PG-13 rating is appropriate for its its intensity and violence. It's the perfect movie for a youth group or adult Bible study to watch together. You might invite a friend who is questioning if God exists or where God is during challenging times. The action-packed storyline is combined with a faith-based message that you will want to discuss afterwards.",
    "45": "The Shift keeps you guessing when or ever the main character will step from the dark world he is forced to live in back to the light and joy he once remembered. An intriguing adaption of the Bible's Job that is set in modern and even futuristic times. The struggle to believe in God when there us no sign of His presence is the main point of the movie. I felt compassion and admiration for the main character as he struggled thru his challenges and obstacles.The movie does wander a bit but sticks to the storyline of choosing good over evil, with an exciting and positive conclusion. Quality acting throughout. Well done.",
    "46": "I never write reviews but felt compelled enough to write one so others don't get duped like me.This is a religious film disguised as sci fi. The \"sci fi\" in this film is a joke. If I had known what this movie was truly about I never would have watched it. I mean I have nothing against religious films or religion. But don't try and disguise this film as something it's not.The film's message is that God will put you through endless amounts of suffering, but it'll all be alright in the end if you just have faith. Smh. Honestly, I kept asking myself thoughout the movie why the guy didn't just take the deal offered by the devil. It looked like a pretty sweet gig, especially because they never bothered to explain what the catch was.0/10.",
    "47": "A faith based film that's engaging! It was beautifully written and had me crying. Actors are phenomenal. I can't think of anything better to do but go to the theater this weekend and watch a movie with a message leaving you feeling good about who you are in Christ. I was blown away. I want to see more of these types of movies in the theater. Who doesn't want to see a movie with a positive message? We are sick and tired of having to watch disgusting content from secular movies that are brainwashing, which ultimately destroys our families, our community and our personal relationship with our Creator. Most people prefer to watch movies like \"The Shift\" and to be able to enjoy it with the whole family.",
    "48": "The Shift was so much better then I expected. I was wondering what genre this movie was going to be but it seems to have a touch of many different genres. Elizabeth Tabish is such a powerful actress and will bring the emotional side out of the viewer. The Benefactor was also a very dynamic actor and you knew right away who the lead actor was dealing with. He is known by many names but \"the benefactor\" seems appropriate for the devil in this movie. This movie has a new spin on the Book of Job, a man who loses everything but his faith. I would highly recommend this movie and will be watching it again and again. Kudos to the writer and director on this movie.",
    "49": "This is a great allegory for the challenging book of Job. I'm intrigued when a writer can take scripture and transform it into a palpable format. Stories from the Old Testament, in particular, can often be challenging to understand due to the disconnect between biblical antiquity and today. Today's Society is much more visual of in how they consume or process information. I cannot speak for everyone, but, I believe this type of storytelling often entices the observer to take a deeper dive in scripture. Often people will say that the Bible is just too hard for them to understand, \"the words/language doesn't make sense to me\". Of course, teachers of the word typically instruct seekers to find a translation that speaks to them. Is it possible that film could be one of those translations?",
    "50": "I really like the premise of this movie. I love how it has sci-fi elements while still managing to tie in faith. Difficult feat, perfectly implemented. The philosophical idea of multiple realities meeting religion. Very good movie. I, myself, love to dive into the ideas of Quantum mysticism. I feel like they did a great job of showing this concept. The cinematography and the visuals were also done very well, especially given the difficulty of conveying such a topic. It did finish with a couple lingering questions but it left enough room for you to theorize the answers and have you thinking after the movie was over.",
    "51": "Loved cast and concept of movie though it could be confusing at times. Understand message that is trying to send about our destiny and how the devil is trying to tempt us and get us to choose him. Actors were great at message they were trying to relay. I would need to watch again and focus more on what is happening and the message that is trying to be received. Some of my favorite actors from the chosen and Sean Austin played excellent characters and relay the message that evil is all around us and the devil wants us and will do whatever is necessary to deceive us and possess us. Great movie!!",
    "52": "No one has a perfect life because they are Christians, but how you make it through adversity says a lot about your character. This film was refreshing and gave me such peace and positivity. Even if you don't read Bible, you will appreciate thus film. This was so well acted and directed. I highly recommend it. Neal McDonough was absolutely incredible. He is one of my favorites. You will leave with a fath boost after seeing thus. I think it will be great for everyone to see this over the holiday season. I am very much enjoying every thing coming out of Angel studios these days. I hope everyone loves it as much as my husband and I did.",
    "53": "This movie is disguised as science fiction, but in reality is a bad done regions movie that tries to show the book of Job in a futuristic ill complete structure. It is bore, lacks of originality and tries to show a messages of hope about God and what happens if one have faith to believe on him.The main problem is they lie when show the trailers, never mentioned was about religion trying to convince people about something that isn't supposed to happen in a movie.On top of being a terrible movie, the lie is not going with me, so if the producers try to convince the audience about a message, they should use another methods, not contaminate the movies with garbage.",
    "54": "I saw The Shift, starring Kristoffer Polaha-Jurassic World Dominion, Wonder Woman 1984; Neal McDonough-Yellowstone_tv, Captain America: The First Avenger; Sean Astin-Stranger Things_tv, the Lord of the Rings movies and Elizabeth Tabish-The Chosen_tv, Alita: Battle Angel.This is a religious tale that is a little different than the usual kind. You might say it's a Christians meets Sci-Fi drama where the Devil tries to persuade a good person to work for him. Kristoffer meets Elizabeth and falls madly in love with her. After dating a while, they get married and things are fine, until Kristoffer gets in a car wreck. When he wakes up in an alley, Neal is standing over him and helps him up. Neal tells Kristoffer that he shifted Kristoffer to another reality-Neal says there are multiple universes-and wants him to work for him. When asked for his name, Neal says he is goes by lots of names but Kristoffer can call him The Benefactor and that he shifts people all the time. Kristoffer just wants to get back to Elizabeth and doesn't want to work for Neal, which makes Neal send Kristoffer to a different universe. Kristoffer meets Sean on this world and they become friends. Things get a little weird here-even for a sci_fi movie-but I've seen worse. There are watches that can let a person travel between universes and even a movie theater that shows other universes-but only one person at a time can watch. About a minute or two into the end credits, Kristoffer pops up and talks a little about the movie.It's rated PG-13 for violence and has a running time of 1 hour & 55 minutes.It's not one that I would buy on DVD-once was enough-but it would be alright to stream.",
    "55": "Badly paced and borderline nonsensical. The religious allegory is muddied by the confusing sci-if integrations. Satan's whole chaos plan of shifting people around is absurd. The acting is very tv show-ish (if you know, you know). The whole premise begs WAY more questions than it answers. AND (probably least importantly, but still funnily) the main character's name is Kevin, which becomes hilarious as everyone whispers his name with reverence. Ugh.I'm a religious person, but I also like good stories and can tell a good movie when I see one. This was simply very very bad. I'd be embarrassed to watch this with a non-religious friend simply because the plot and acting are so wildly cringey.",
    "56": "The sci fi made no sense, which is no surprise as the Sci fi element of the film was just a device to blatantly hit us in the head with a Bible story. I like the message of hope and if that's all it was, it could have scored a 5. But it was so heavy handed that I felt I was in church. I've liked movies that were modern interpretations of the Bible with a message, but this one seemed like I was watching a sermon. While the acting was fine, it had that over the top evangelical feeling.Afterwards I looked it up and it was no surprise that it was made by the same people that made Sound of Freedom.",
    "57": "I was surprised by this movie. It was not what I expected. I really enjoyed this movie. I wish it was longer though. Great acting. The content was very imaginative and thought provoking. It makes you think about life and being a good person. I really enjoyed the different possibilities that the characters faced. I think it deserves a sequel or a Netflix series. Now that's a great idea. But don't change the characters! A Netflix series would enable the show to diverge into so many different angles. Plus the addition of new characters. I also thought the special message at the end was a great idea to pay it forward.",
    "58": "The Shift is a thrilling, suspenseful ride with a timeless, useful reminder that light and love win no matter how deep the darkness. I won't spoil it for the many who will enjoy this sci-fi film, but there's action, romance, drama, and great actors that transmit the pulse of this emotional thrill ride. The action/fight scenes are fine for tween age and up. It is a memorable story that will connect with many viewers' life experiences. As expected in sci-fi there are some fantastical elements (trying not to spoil it for you), which are interesting to consider if we really had them in real life. Go enjoy.",
    "59": "This movie was such a vivid reminder of why my Faith and obedience to God, power of prayer and not giving up Hope, is so important to this world we live in and its crazy ideologies. As a Husband and a Father, the film challenged me to be the best version of me, to show those around me Gods love through thick and thin. It even brought to light things in my own life that could use a tune up, and even an absolute overhaul if I'm being completely honest. I believe the actors did a great job in their roles, also a joy seeing some familiar faces. I encourage you as the reader to see this film, God does extraordinary things by using ordinary people like You and Me. I'm telling you now, you will be inspired!",
    "60": "Felt bamboozled by The Shift. I saw this on opening night. I love watching Sci-Fi movies, so I went to see *The Shift*. About 20 minutes in, I began to sense that something was off. Turns out the movie is a multiverse version of *God's Not Dead*, complete with the same lousy plots and acting we have come to expect from Angel Studios. There weren't any overt religious messages in the trailer and advertisements for the film, but the actual film is filled with that stuff. Really felt tricked on this one. No shade to you if you are into religious movies, but be forewarned if that isn't what you want to see.",
    "61": "I absolutely love Kristoffer Polaha, he is a great actor, however this movie makes me love his acting even more. Neal McDonough is outstanding as always!! Sean Astin has been a favorite since Goonies. I would watch anything with these actors and to have all three in one movie is amazing. In fact all of the acting in this movie is great. As for the movie it is a great adaptation of a modern day book of Job. Definitely worth seeing this movie in the theater!!! I love this Bible story and to see it with a modern day twist just shows how relivent the information is still today. GOD IS AWESOME!! HE LIVES!!",
    "62": "The shift gives hope. Hope is what so many lack right now. We're not far away from this movie being factual. It was a little scary, considering it is so close to what's really happening out there right underneath our nose.. I already have faith and I have hope but so many do not so I hope this movie brings a lot of hope to those that are lost and feel hopeless. I enjoyed it and so did my husband and son. I am grateful for Angel studios And the great movies that they have been making. Please support them so we continue to see truth and hopefulness.Please look up all that they have made in the last few years and if you like what you say, pay it forward it all comes back to you.",
    "63": "The Shift is such an incredible and creative movie. I really enjoyed watching it in theaters with my family. It was a wonderful love story of a modern/sci-fi retelling of the story of Job. IKristoffer Polaha and Neal McDonough played their characters excellently. I could really tell just how devoted both of them were to their roles, and the overall story.Angel Studios gifted us with yet another beautiful movie that points back to our Heavenly Father, but this time in such a unique multiverse setting. The Shift is full of action, adventure, romance, devotion, and most importantly faith in God.I definitely recommend everyone give this movie a watch!",
    "64": "I never write reviews, but after watching \"The Shift\" in theater, I'm compelled to express my enthusiasm for such a crucial film to be released in this dayinage. I found the plot riveting and it kept me on the edge of my seat. I love that the gospel and the story of Job was interwoven into all aspects of the movie. It sent shivers up my spine that some of the movie really felt like the reality we are raising our families in and the culture that is present.I felt an urgency and a passion after seeing the movie to share my experience and pay it forward with people who need to hear truth and see hope in this current culture. The answer is Jesus and a personal relationship with him.\"The Benefactor\" aka Evil one twists and tempts, but Jesus has already won. Go see this epic movie and pay it forward!!!",
    "65": "Without reading the story of Job directly, Angel Studios was once again able to tell a story that was compelling, relatable, and easy to understand even if you've never read Job. My husband and I saw this in the theater and were treated to great acting, some familiar faces on the screen, and an interpretation of Job that drew the watcher in, wondering what would happen to Kevin next and how he would face up to the benefactor. I loved that Kevin had interactions with \"friends\" similar to how Job's interactions were. These interactions really brought the characters to life and built on the story all the more.",
    "66": "Purchased two tickets side by side last night.Spoke with the wife today and apparently she wanted to go. I checked the theater and no more seats were available for the 7:40 showing in Whittier. Tell me why it was empty, only my son and I were in the theater... talk about a strange feeling!I didn't really see any trailers for this movie, but it's the true story of the actor playing the Antagonists that made me want to support this movie. Morals are such a hard thing to find in this day and age, yet this man held steadfast to his beliefs and integrity that Hollywood blackballed him for over 2years.I loved the movie, just make sure you wait to the end before you leave. I wish this film company great success!",
    "67": "Angel studios is consistently producing great faith based movies with solid performances and storytelling. I don't know why others haven't been able to do that without them being cheesy but Angel Studios has the formula. The Shift is my third movie I've seen from them and I can't wait for the next oneStellar cast and solid acting and a unique storyline that has you spellbound and not sure how it will end and even when you think you know, you're wrong, it's better.Neal McDonough Is one of my favorite favorite actors and this is by far his best roll. He takes you on a roller coaster ride of emotions and you never know what he will do next.Splendid performance and fantastic movie. I highly recommend it.",
    "68": "I am BLOWN AWAY The number of multiverse point of views The LIVE ACTION scenes were unbelievable from the guns and types of bullets to the (Shifts) them selfs were Freaking DOPE The Benefactor was the coolest villain I've seen on screen in a long time. I absolutely loved the sifi aspect and how incorporated the Word aka (Bible) it was Perfectly put together for our now age generations! It's not a religious movie it's a Fantastic representation of how us human beings Feel our life struggles the compassion the deep selfishness that's a huge reality in the choices WE MAKE! God is real so is the devil. But let me tell you no matter what in the end of this life GOD WINS EVERYTIME AMEN.",
    "69": "Wow. I am so impressed by this film. Brock Heasley hit it out of the park. It has EVERYTHING. Romance, SIFI, action, and even some humor. I got to see an early viewing and I was blown away. The actors are great and the story really draws you in. I was on the edge of my seat through the whole movie. You find yourself struggling along with the main character as he tries to get his wife back. The special effects are very good and the music is excellent. It was really well done. I wish there were more films like this one. I will be watching this again when it hits theaters on Dec 1. It is a must see.",
    "70": "Because I made a small investment in The Shift, we were able to screen it this evening. Here are our thoughts: Neal McDonough's acting was superb - worth watching more than once! The subtle disquiet on the Benefactor's face conveyed a significant message. Kristoffer Polaha's and the other actors' performances were excellent as well. The chemistry between Kevin and Molly was palpable. The storyline and action grabbed and kept our attention, except for a few stalls, and the somewhat abrupt ending. We'll have to think about it and discuss it more, but The Shift may be the highest quality Christian movie we've seen yet. Bravo!",
    "71": "This movie delivers! I like sci-fi. I like action. I like romance. And I like movies that tell a good story. This movie does all of those things! I plan to go back and watch it again next weekend because I want to feel this movie again.And the lead, Kristoffer Polaha, is tremendous. He's really magnetic to watch, I really couldn't take my eyes off of him. And I love his voice. And he's basically in every scene, and he carries this film so so well. I want more of him on the big screen - next movie Mr Polaha I'll be there!So go see the movie, it's solid, enjoyable, and you won't regret it!!!",
    "72": "The actors did an amazing job at presenting the heart of this story. What an awesome retelling of an age old story of trials and tribulations but never losing hope in the face of it all. This movie is a great reminder especially during this holiday season, hope is not wasted. Love wins no matter the outcome, love wins. This story speaks to the masses about how most of us feel, feeling lonely and hopeless. But the truth is we are not alone. So many battle with hopelessness and loneliness it is truly an epidemic, this movie is an awe-inspiring reminder that we are never alone. The main character hears lies, from a world class manipulator and liar, but demonstrates we have the power to combat lies with truth.",
    "73": "Go see the movie. It has a great foundation and story line, excellent acting from Polaha and McDonough. There are some areas that are disjointed but for me that wasn't enough to dislike the movie or score it lower. The director tries to tie things together but the characters and their actions to each other could have been more strongly defined. In the spirit of Christmas, it's a messy bow -- not as tight as it could be. But still beautiful, enjoyable and uplighting. The message of hope, love and the need for connection to a higher power/God, in a world full of despair, shone through and is worthwhile to watch.",
    "74": "The finest first Act I have ever seen in a film. The story was crafted and developed perfectly. The characters were strong from the start. The Actors were impressive. The cinematography was sharp and effective. Again, the first thirty minutes were riveting.The third Act, although somewhat predictable was adequate and pushed all the right buttons. The payoff wrap up and resolution was satisfying.The second Act will be most contested. I certainly would understand those who would have preferred to be shifted to another theater during this Act it will certainly appeal to many. With that said the films first Act is more than enough to carry a viewer to the end.",
    "75": "I am never disappointed by anything Angel Studios puts on. This was amazing! It brought tears to my eyes. I can't recommend it enough! The storyline was phenomenal and all of the actors did a fantastic job. There were twists and turns that I was not expecting, but overall, the best part was the feelings that came from watching this. The dedication to bringing God into the movie was highly evident and they did a wonderful job doing just that. I love and appreciate how much Angel Studios has dedicated their efforts to bringing their viewers closer to God. I can't wait to see what else they have in store for the future!",
    "76": "Really enjoyed the shift, will bring family to see it. From start to finish the movie was great. Didn't know anything about it just saw it in passing and decided to look at it, so glad I did. Gives a different view on believing and faith, the main character is an example of us everyday just trying to make it through life and everyday situations. I hope there are more projects from angel studios coming to theatres for everyone to enjoy. This was the right time for this movie to come out just as Christmas ii the season of giving and celebrating, I hope everyone holiday is truly blessed and happy.",
    "77": "How can the Bible and science fiction be done together? Only by the great work of these filmmakers and the grace of God. Absolutely incredible.Kevin finds himself in a world that is not his own-- he has been shifted into a different dimension. Living in a utopian world, the violence of the situation was not overly done, which was appreciated. In the movie, the portrayal of temptation and the fight against it was accurate. It was powerful to place myself in Kevin's shoes and reflect on what would I choose if I was placed in this situation. Would I be as faithful?Incredible modern rendition of the Book of Job. Thank you for this great work that relates truth in our world today.",
    "78": "I really enjoyed the movie! It had everything you want in a movie: a great story, great pacing so you're never bored and characters you can relate with. And I personally love a little sci-fi with action, and this delivers it! I fell in love with Molly. And was rooting for Kevin's as he struggled to find his way back to her! Their story really pulls you in and you can't help but feel for them.Kevin's struggle in pain really got to me. I was rooting for him the whole movie! I know it sounds funny but it was kind of like There was a touch for a minute there where I wanted to punch the \"benefactor\" right in the face! Hah!As always Angel has delivered a great movie. The acting was top-notch! I can't wait to see what's coming next!",
    "79": "The Shift is a must see amazing movie. The actors are phenomenal and the fast-paced storyline is gripping and both keep you engaged throughout the entire movie. Not a single minute passed by where my wife and I were not mesmerized by it all. I was a little concerned that there would be a certain level of chessyness in this movie, but not even a single gram of cheese. I cannot wait to see it again to possibly pickup on more details I might have missed during the first viewing. This movie is proof that excellent movie making with great content can still be done! We cannot wait to see what Brock Heasley does next!!",
    "80": "The Shift is an honest to goodness science fiction film that just happened to be in a world where God and the Devil are very real. The film is inspired by the Biblical story of Job, and somehow managed to hit the main points without being predictable or trite. I do suspect that a person who is not disposed to enjoy Christian content might get less out of the film, but a person of faith will probably enjoy it greatly. The actors are quite good and carry the film. While clearly a science fiction film, the action does not depend on special effects. The science fiction concepts are fairly well explained. I saw the screener together with some German students, and even the younger onesv whose English was less solid remained interested and enjoyed the film.",
    "81": "As an unashamed Christian, this movie moved me! We all encounter tough times in life but how we respond shows where we place our faith. This movie is a modern day spin on the book of Job.Angel studios puts out nothing but high quality films with a positive message that moves the audience and relates to life. I admire these actors for wanting to be part of a positive movement.For me, The Shift is a great depiction of how Satan tries to trip us up to loose faith in God and how selfishness is our true evil demise.My hope is that this movie will help those that don't know Jesus to seek Him and those that have lost faith will regain it!",
    "82": "A++++++++ this movie has it all. Total perspective of evil attempting to take another soul as a prize. The battle between good and evil has never been more real, and this clarifies exactly how this looks today from the book of Job it is clear that many people would fail, put in the same position, but this one man found his way, story proves to be fruitful. It is search for love and God. Try not to cry, while you watch a mirror mortal deal with the highest evil and triumph through God. Obviously, this website hates movies like this and so does critics but we the people will always triumph over big corporation.",
    "83": "The Shift is beautiful. It is intriguing and draws you in. The anger, love and frustration you feel by watching this movie is something that you will desire and never forget. This is a must see movie. I'm so excited that this will hit the theaters on the 1st of December, as it will impact your life. You MUST see this film. I adore Neal Mcdonough and his portrayal of someone that we all know so well, Liz Tabish was remarkable and the ways she draws you in is captivating. Sean Astin does not cease to amaze me in his acting brilliance, and the star Kristoffer Polaha is not in his typical element. This is a new side of him that I love. I cannot wait to see what he does next. Go see this film and then help it soar by spreading the word to your friends.",
    "84": "So much to think about in this great movie. Loved seeing cast members from The Chosen in this movie. It makes you think...it's one thing to read about the lies the devil tells us, but to see it in a modern delivery in the awesome way Neal McDonough does it...wow. Chilling. I would definitely watch this movie again. Also the friend I was with said it really got him thinking, too, and he wants to check out The Chosen as well!Just a really well done take on the battle between good & evil, and done in an intense but ultimately hopeful way. Highly recommend this film as well as others produced by this company.",
    "85": "Having only seen a trailer on the film, I was anticipating something of an immersive experience. But in previewing it, it was frankly so much more than what the trailer portrayed. I don't recall being so absorbed in a movie in quite some time. Not only is it highly entertaining, but you come away with a feeling of wanting to hold on to, and express love towards, those that you love. And while a higher power is referenced, I would not call this a religious movie, although there are faith-affirming, as well as goodness-affirming themes that inspire and give pause for reflection. Max-star rating.",
    "86": "My family and I just loved \"The Shift\" movie! This is my second time seeing it. Watching it on the big screen was so much more real life. It was like you were there in it all. I saw the original clip which I loved from the beginning and the movie was so much more. I loved the modern day comparison to Job. It was exciting, thrilling, and suspenseful! It also had those tender and heartfelt moments in it. The tears welled up in my eyes a few times. My whole family went and we all sat there on the edge of our seats wondering what was going to happen next! We all loved it! This definitely is a must see!",
    "87": "I wasn't sure what to expect when I saw it playing at my local theater. The start of the movie didn't give me insight into the story line. However, about 20 minutes in, it finally dawned on me as to where the plot was going to take me. I had my ideas, but mid-way through, I knew exactly where the basic plot line had been taken. There were several plot twists that kept me completely interested. The character development was outstanding. You wanted to believe in the actors. The acting was natural and completely believable. While it's advertised as Sci Fi, there is so much more to the plot line. It will not disappoint, especially when you realize that you know this story.",
    "88": "I have watched the shift 3 times on my phone, the first two times were not the final edit and the third time was, I can definitely say it is a winner. The only thing lacking is a sequel showing more of Kevin and also Molly helping others who are experiencing the Shift and in need of help to resist the Benefactor to find their way home. Can't wait for the DVD to add to my collection. All of the actors had a standup performance, Kevin portrayed by Kristoffer Polaha came through with a performance that played well with his relationship with Molly (Elizabeth Tabish), his struggles with the Benefactor (Neal McDonough) and supportive/non supportive friend Gabriel (Sean Astin) whom I also loved in Lord of the Rings.",
    "89": "This movie was amazing. It had my teenage daughter in tears. The movie is beautifully executes the book of Job in a way that is easier for people today especially teenagers to understand. Be the light in the darkness. This movie is a refreshing burst of kindness. The storyline highlights that no matter how dark things may in the world may seem to be there is always good to be found. Neal McDough perfectly executed his role as the benefactor. Kristoffer Polaha does an amazing job bring out the emotion of the audience in his portrayal of Kevin. Every emotion his character felt I was able to feel. This movie is a must see!",
    "90": "This is one of the best movies I've seen this year, and it hits the exact mark that it's supposed to. From top notch, believable acting to a story that is easy to follow, this one will have you fully invested. A modern telling of the story of Job that manages to keep you on the edge of your seat. You'll find yourself caring about the characters and the story itself. The story also manages to translate and make its point to anyone, despite their background or faith. While it may be much easier for a Christian to understand the story, I would still highly recommend this movie to anyone who is looking for a message or just wants to see a good movie.",
    "91": "I'm a believer and I liked the premise of staying faithful no matter what, but just like others have said, the sci-fi/multiverse part of the story could have been better explained like why was the Benefactor and his shifter minions shifting people in the first place? Since this is a fantasy why not come up with some reason such as God and Satan are competing for souls, but there are strict rules, neither can force a human to choose to worship them; and that every person has a version of themselves in the different multiverses but there is only one who is the true person and in order for Satan to \"win\" the soul ie the true person, he has to win all the versions of each individual concluding with the true soul; and Satan uses the shifting universes with his minions to help to deceive each of the true soul's other versions of self throughout the multiverses. And this would explain why the Benefactor is so desperately trying to deceive the final Kevin because if he can win the final true soul, that soul belongs to him forever. And because there are so many multiverses Satan needs the help so he has his secrect agents to get close to the marks to help with the deceiving, explaining the Gabriel character.I don't think they need to explain the shifting technology, so it's super advanced technology, if we suspend belief for the beaming up in Star Trek we can do the same for this movie.",
    "92": "A well-written story that causes you to pause and think. A new take on an age old story. So often we get caught up in life and fail to realize exactly what is going on around us. When we stop and think about others and not ourselves everything comes into true focus. This is a great movie for a believer. This is a great movie for the person who doesn't have a relationship with Christ. This is a great movie for someone struggling with life. It has much to offer for everyone. I thoroughly enjoyed the storyline and will be purchasing this for my home collection when it is released.We are more than the worst things we have done.",
    "93": "What a joke! I can't believe i was duped into paying for a religious sermon of \"Hope\" for 2 hours. Very forgettable, thank goodness!The story itself was poorly written, even putting aside the obvious in-your-face, repetitive hope message. Not even worh the Netflix time to watch this.Actors were second rate except for the \"Benefactor\" who is well known in the movie industry and carries what little life this movie could muster. Too bad his talents is associated with this poor story line. What mega church paid to get this made ?Save your money and time, not recommended to watch, even for free.",
    "94": "My husband and I went to the movies today and seen The Shift. This movie moved me so much I was crying like a baby by the end. We stayed after the credits to see the special message.The message was about paying it forward for those who struggle with finances and would like to see the movie. Right away, I paid it forward. Please if you're able, see this movie. You can go the Angel website to retrieve free tickets. I do look forward to when it's made available to purchase the digital copy. I will be buying this movie. The acting was outstanding and such a great story to follow. Blessings to all who read this review.",
    "95": "I enjoyed watching The Shift and found it both intriguing and enjoyable. Setting the premise of the story of Job into a modern, sci-fi type story provided interest and kept me wondering how the story line would really resolve.Neal McDonough was masterful in playing the role of the benefactor, and Kristoffer Polaha was great in the role of Kevin. Liz Tabish provided a sound performance as Molly.The multiverse plot line provided intrigue in never knowing when Kevin or other characters would shift. Faith was an undergirding principle without the film feeling \"preachy.\"I would have liked to have seen more of the \"tragedy\" that Kevin and Molly faced... that was a bit under-developed in my opinion.",
    "96": "My wife and I went to this movie without any preconceived notion of what it was about, so we just took it in with a curious mind. Wow; was I surprised that it was about personal faith, self worth, and meaningful relationships with deity and family.The unanticipated and amazing combination of best friend and worst enemy being the same person, or maybe even myself, gave me an opportunity for self-examination.I was frankly amazed at the meaningful daring religious messages and glad there is a place for that in todays entertainment scene.Don't hesitate to experience this soul searching film with an open mind and a willingness to learn and improve.",
    "97": "The movie plot is original, not easy to follow if you missed any detail. So buy your popcorn and soda, and go to the bathroom before you sit to watch it. The storyline is very intriguing and the ending kind of expected but unexpected at the same time. The music score, sound effects, and sci-fx are good. The acting by all the cast is really good, which helps the storyline to unfold. But if you watch the original short film, there are moments you miss its original intensity. The acting in the full-length movie is exceptional, but there's something from the original short film that's missing. Hard to explain, you have to see them both.",
    "98": "I was privileged to screen The Shift. The Shift is captivating causing me to ask questions of Kevin. Which world is his world? Was he set up by the benefactor? Will he find his wife? Will he ever get home? Who can he really trust?This brought me to ask questions of myself: What is my reality? Where is my home? Who am I choosing to be, the real, spiritual me or selfish me? Do I recognize the benefactor in my own life?Even though I know the story of Job from the Bible, I wasn't prepared for the twist(s). When it comes down to it, Kevin is finding meaning for his life through faith in Christ Jesus. His question is the same for all of us on a faith journey, when faced with difficulties, will our faith endure? I am excited to see in theaters.",
    "99": "The Shift was a lovely movie to say the least. To preface, I'm not religious, but I grew up so and am not against it. Regardless, I found this movie to be a profound testament to hope, kindness and second chances. The acting was superb, but the story took it above and beyond. The world can be a dark place, and this movie demonstrates how hope is found in the little moments, the small choices, and can drive that spark of goodness forward. I really recommend watching it with an open mind if you're not religious, and look for the core message that I think we can all learn from. Choose to be selfless in a world full of selfishness.",
    "100": "Going in I had no clue what this movie was actually about and as I watched my emotions took completely over. It was a new take on a story that is needed more today than ever. The story was gripping and kept your interest from start to finish. It was told in a way that is relatable. The acting was excellent and the storytelling amazing. I would recommend this movie to everyone. It's a 10 out of 10!!!! I would see it again!!! This movie offers hope and shows that you're not as bad as the worst part of you. That in the darkness there is light and you can make a difference. Leaving the theater it makes you want to be a better human.",
    "101": "This is a slightly odd, but captivating story of a man whose faith is put to the test by non other than an evil, devilish figure played perfectly by Neal McDonough.The acting is superb and the characters are interesting and well developed. The story is interesting as well with an element of sci-fi as the devil and some of his advocats have devices that can shift people to other realities.The protagonist Kevin Garner, played by Kristoff Polaher, has a car accident which leads to the meeting with the benefactor, or devil, who begins to tempt him with lies and false promises.i couldn't help but route for the good guy here.",
    "102": "The Shift-best Christian film yet (if we don't count The Chosen ;) ). It gives me hope for an era of film and TV that could keep up with the likes of writers like CS Lewis, translating truths and captivating hearts in this generation. Story is such a powerful medium. It's rare to have a story that is able to present a message of hope in the face of tragedy in an authentic way. Often times the pain is undercut by a positive message, but the characters of The Shift were believable, relatable,\nand authentically heroic, with the story earning its ending with thoughtful tension and leaving the campy tropes on the cutting floor. The empty tomb was a refreshing symbol throughout the movie and will undoubtably stick with viewers as they leave, planting a seed for something in the future.",
    "103": "This script was cleverly written and engaging. It forgoes the traditional CGI blitz that tends to overwhelm viewers of many modern SciFi movies, and focuses instead on the love story which is at the core of the film. Kristoffer Polaha and Liz Tabish - the two main actors in the love story have great on-screen chemistry and are very convincing. The \"Benefactor\" (Neal McDonough) is thoroughly engaging - mystifying and terrifying at the same time .This movie is NOT a simple retelling of the story of Job, but is a modern interpretation, impressing the viewer with the consequences of the choices we make.Ultimately, The Shift is carefully crafted and thoroughly entertaining. Highly recommended!",
    "104": "The Shift is a phenomenal movie. A great retelling of The Book of Job. Angel Studios is making some great movies with great writers parting with great actors. Everyone needs to see this movie and don't forget to pay it forward for someone else to see this movies as well. In life we are always being tested. We have to pray and keep God on our tongues and in our hearts. God wants to know that we can withstand what the devils try's to do to us. We must always have faith and trust God for allowing us to go through it and know that he will get us through anything. The book of Job is a true testament to our faith.",
    "105": "Amazing movie, truly moved me a d touched my heart. I have been in the main characters position, I lost everything and even in the darkest moments I still believe in God. I will not loose my faith in him. I still see the beauty of this world and all hus miracles big and small. The devil tries to deceive us but God is there, listening, watching, we are never alone. He is all powerful and His miracle will come. Keep the faith alive because His promise will be fulfilled. I'm still here because God has held me up every time I have fallen down. He sees me and just like Job, He will see me through. Amen.",
    "106": "I am not a Christian... I am of Jewish practices... This film was beautiful. I cried.,i laughed and I was worried for the character... It was so powerful. I want to watch it again. Thank you for making a movie about God and the forces that oppose Him without being peachy or heavy handed. I took my son and now I want everyone to see it. So heartfelt and wonderful. The villain is what a bad guy should be and the main character is human.... So very very human and relatable. I will see this movie again, I will find a way. Can't say enough good things about it. Thank angel studios for another great movie...",
    "107": "I didn't know what to expect before watching this film, but knew the quality of films that Angel Studio produces. \"The Shift\" did NOT disappoint! It had such an emotional and spiritual impact on me, like the movie, \"It's a Wonderful Life\". ! It teaches about powers of right and wrong, patience, selflessness, and love. It is so well done and tells a great and important story in a creative way! It will make you think and appreciate life even more! My only complaint is there were no previews, so get to the theater early because it starts right away. Thanks Angel Studios for making quality films!!",
    "108": "Wow! Yes... I cried! I wasn't sure how this would play out, but I found myself biting my nails with tears rolling down my face. This modern day version of Job was relatable, real and incredible. This was a heart pounding, heart touching ride. It makes you look for the joy, love and hope in every situation of life. If you are looking for a great family movie. Look no further. If you know your Bible, know Jesus you will appreciate every aspect of this bold movie. If you know nothing of the Bible or Jesus before seeing this movie... you will want to sit alone and say a prayer when it's over. Take your family, take your friends.... Take a stranger. But go see this movie!",
    "109": "This movie conveyed a strong message of kindness and love that is sorely needed in todays world. The story was certainly a wonderful adaptation of the story of Job. As a newcomer to the Word, I would highly recommend this movie to any and all to watch and learn! The story was wonderfully done, and contained numerous emotional highs and lows! The writing certainly draws in the viewer, and MAKES them a part of the story! The audience is drawn in almost immediately, and the audience is treated to an emotional rollercoaster. The lead is very convincing of his Faith, and his acting in this part makes the watcher examine their own faith, through the lens of their own experiences. I cannot recommend this movie highly enough to people of all ages.",
    "110": "I was absolutely impressed with what came of a crowd-funded film! It's got such an incredible message. Sure, it doesn't have the budget of a film like Titanic or Transformers, but you don't need all that when you've got solid acting, an excellent story, and a positive message to share. A few things I really enjoyed were the balance of good and evil, the residual hope you find in the main character, and his persistence to move forward despite the odds being stacked against him. The visual effects, sound quality, the score, and the acting were far better than I expected for a crowd-funded film. I watched the early screening, but plan to watch it again in theaters.",
    "111": "Just saw \"The Shift\" tonight in a theater... It was awesome! I absolutely loved it. It's based on the book of Job, but set in an dystopian Sci-fi world. The acting is top-notch (I have to give full credit to Neal McDonough & Kristoffer Polaha... Neal plays a terrifying \"Benefactor\" and Kristoffer plays a beautifully broken & flawed man). The storyline is emotional (I actually cried at least twice), the special effects are very well done, and there was a surprising amount of action sequences in this movie. I don't know why I wasn't expecting this, but it was great (viewers who like action movies will love it). I HIGHLY recommend this movie!",
    "112": "This movie is absolutely incredible.Walking into the movie theaters was interesting because there were no promotions for this movie anywhere. I believe that that is extremely important because it plays into what we saw in the film when portraying a dark, broken world.Everyone needs this movie! My husband left the movie with many questions about Job, Jesus and Satan. Curiosity and dialogue was sparked and I am beyond grateful for that! Everyone has a choice and there are eternal consequences when the path to Jesus is ignored.I hope the world especially the USA to see this movie and lean into the story because God is talking to all of us.",
    "113": "This is a well done, suspenseful drama, and love story that stands on its own merits. I know people that think \"oh another Christian movie, I'm not interested because I don't want to pay to be preached to\". It is not \"preachy\". You do not need to know any bible story to connect with the characters and cheer them on. The story is very relevant and inspiring with a couple of the key messages being \"never give up hope\" and \"do what you can to help others\". The acting and directing are very solid. The story moves at a good pace although I would have liked a couple more minutes in the beginning expanding on the main characters as it would have earmed this an extra star.",
    "114": "Love Angel Studios and their productions are the best. This is no different. They don't let us down. It is about God testing a man, after the Book of Job, who has everything he could want by stripping him of his family, friends and property, but still the man does not turn his back on his God. Neil McDonough who plays Satan is great and Kristoffer Polaha who plays Kevin equally as good. Some familiar faces from The Choosen but what a great. Overall must see movie. Please wait until the end of the credits and pay forward some tickets so that other less fortunate people can have the chance to see the movie.",
    "115": "It is interesting to see sci fi take on true biblical principles in a way that does not belittle Christianity.Its a complex story that requires patience since it goes in many different directions, but the pieces come together in an interesting way.It is not a story that jumps out at you. Attention is required. The story trusts the audience to be smart and patient enough to let the story develop. The writers do not explain the plot as if you are too simple to figure it out.We are so please that Angel Studios is bring to the world these thought provoking movies. These movies are blessings and we encourage all to support and tell all about them.",
    "116": "In a Christian country this is the first time I've ever seen scripture on the big screen and I'm a avid movie goer. It was powerful. The movie was great too. Finally the famine is breaking. It was a masterful adaptation with great acting and cinematography. It looks like this studio is just warming up and look forward to the next one. I couldn't help to see the parallels that we are dealing with at this very moment in this nation. The arts and entertainment mountain is long overdue with this type of genre. How many horror movies do we need playing in the theater at once? Please keep doing this Angel Studios.",
    "117": "Confession time: at first I did not want to see this movie, because I am usually not one for dramatic science fiction. But after learning that the story was inspired by the Bible story of Job, I do admit I grew curious.When I finally decided to see it, my eyes never left the screen. It kept my attention more than I thought it would. I laughed and I cried - BOY did I cry - tears of sorrow AND tears of joy!! Especially at the ending (which I will not reveal because where's the fun in that?).It was definitely worth the ticket, a project we'll put together from all factors that go into making a good movie.",
    "118": "I am alittle biased since I am a beleiver and look forward to seeing more positive movie messages to be cast out into this World. I loved this Biblical Job of 2023 storyline, that looks like a future America when the antichrist/ foreign power takes over. If we can all just realize that we are all human and that we will be destroyed by are on unkindness for each other. Mistakes and love are apart of human character and the sooner we realize that we all can be shifted in the right direction. Wonderful vast and storyline. Even though I could've gotten a ticket free from my Angel film app. I paid.",
    "119": "Gritty, hard hitting, in your face depiction, of the story of Job. The reality of the choices you make shifting your future situations, being played out, one after the other, in rapid fire, in two hours on the big screen is a reminder to stay grounded and steadfast in your beliefs and faith. It was great to see some favorite actors on the big screen! Well done! The benefactor was a slimy character, also very well depicted by an iconic actor. I could feel so much pain and despair coming from the story, very well told, the emotions of the characters were felt! I thought the ending was a very realistic twist. Bravo.",
    "120": "I believe this film was written and acted with one intention - to make you think. With that in mind, I think there is at least one layer of meaning some people may miss. (Kind of like 'don't judge a book by its cover.') In another review of this film, the reviewer used the word gloomy. But, do we not live in a gloomy world? Are we not surrounded by darkness? How many of us see the darkness? Isn't it well hidden behind modern day benefactors?!Quietly woven into the story or more questions - Is faith in God important? Can we pray our way out of difficult circumstances? Are we placing hope where we should place it or where we shouldn't? If we hold on to our faith in God during tough times, will we be blessed?Kristoffer Polaha did a fantastic job, as did all the other actors. Definitely worth watching. Go see this film and then go home and ponder it's many layers of meaning!",
    "121": "Yesterday, I watched a movie in theaters for the first time in nearly four years. That movie was The Shift, and the only regret I have from yesterday is that I did not pay enough.The Shift is so much better than many of the online reviews admit. It is deep, beautiful, powerful, action packed, suspenseful, and intriguing all at the same time. It is not your typical Christian movie, with all the preachy cheesy acting and low-budget constraints. This is a Hollywood-quality movie, with a cast filled with A-list actors and a crew filled with professionals.The movie isn't perfect, but its flaws are limited to some of the cuts being awkward and the CGI being better in some scenes than in others. Luckily, for most of the movie, the cinematography and special effects are just as great as the rest of the movie.Prepare to cry at the ending, as it is extremely powerful - and I've seen a lot of emotional movies, so I should know! You will not regret watching this movie; it is without a doubt the best movie Angel Studios has made yet. Don't listen to the negative Rotten Tomatoes reviews - most of which are written by atheists who hate any movie that please Him; go watch the movie yourself. Trust me; you too will leave the movie wishing you had paid more to see it.",
    "122": "Art is an invitation. Films that ask questions, that challenge us and provoke us and compel us to explore inner depths, those are the films we find ourselves contemplating and discussing long after the final credits have rolled.The Shift is one of these films.Written and directed by Brock Heasley and coming to us through Angel Studios, the production company best known for the groundbreaking television series, The Chosen, The Shift stays true to the spirit of its writer, director, and producers. It asks deep questions and makes bold decisions, pushing deep into a genre that is woefully under-represented in Christian art. While Marvel relentlessly releases film after film of cookie-cutter pablum, and the formerly beloved Star Wars franchise vomits out enough inferior recycled content to make us scream, \"enough already,\" Heasley and Angel Studios have created what will hopefully be will be the first of many original films-movies with that smaller independent touch that allow us to experience something new and engage in a dialog of issues vital to the human condition. This is an area where Science Fiction has historically been there to challenge us, yet most modern Hollywood blockbusters have abandoned that aspect while Christian films have frankly not even made an attempt.Until now.Led by outstanding performances from Neal McDonough, Kristoffer Polaha, and Elizabeth Tabish, The Shift will take you into a series of dystopian worlds, engaging in a universe-jumping ride in which the lead character, Kevin, contends with societal oppression, personal betrayal, and his most primal fears. Can Kevin find the courage and strength to fight through it all and find his way back to the woman he loves?The Shift is not a perfect film. There is a large amount of character- and world-building to be covered in 115 minutes, which leaves certain plot points and motivations underserved. While ambitious, the story could have benefited from a narrower focus. However, The Shift is highly entertaining, innovative, and thought provoking. It will engage you and challenge you. Brock Heasley and Angel Studios have created something fresh and important-a courageous, innovative, and risk-taking movie that requires a response, welcoming us into a genre and drawing us into a conversation we have too often avoided.",
    "123": "The Shift is one of the best films I have seen in a very long time. Brock Heasley created and directed a beautiful, thought provoking, leave you on the edge of your seat story with depth, hope and light. You will definitely leave the theater feeling good with a lot to think about and chew on.Kristoffer Polaha plays Kevin Garner. He brings his all to this role and leaves nothing on the table. You truly feel and experience what Kevin is going through. If you only know him from Hallmark, you are in for an amazing ride. He is one of the most versatile and talented actors around. I'm so glad that so many get the opportunity to see and experience his talent.Neal McDonough plays the Benefactor. This guy does a fantastic job at being a bad guy. This is my first time seeing him on screen and I was blown away. He brought truth to how the enemy comes in and doesn't let up.Elizabeth Tabish's portrayal of Molly Garner is stunning and beautiful.To be honest, from the leads to the extras everyone brought their A game and knocked it out of the park.This film brings so much hope and light. It's a beautiful reminder that even in our darkest moments there is still good, light, and hope to found in the world. We are not our circumstances or the \"bad\" we have done.Although this film is labeled as a Faith based Sci-fi film, and yes that element is there, it subtle and not in your face preachy. There is something in this film for everyone. We all need hope and want to feel good about the things we watch. This film definitely delivers that. It is a must see. If possible see it more than once. The more you see it the more Easter eggs you uncover and you gain a better understanding of the story.Oh one last thing. The music! Amazing! The placement of 'Oh My God' was absolutely brilliant.",
    "124": "I had the chance to preview this film. Like many Christians, we've been waiting a long time to see Christian filmmakers make good quality films. I really loved this film and I can't wait to actually see it on the big screen. It was not at all religious. Anyone could see this film and glean something if they watch with anticipation and expecting the unexpected. The first 5 minutes I was unsure where they were headed, but after that I was intrigued all the way through. It was unlike anything I've ever seen and I was continually excited about what was going to happen next. There was an allegory for sure of the story of Job, but in a very cool yet subtle way. If you're highly visual like me, you'll love the feel of the film. The cinematography drew me in, but hands down the role of Kevin, played by Kris Polaha was amazing! He blew me away. Molly, played by Elizabeth Tabish was the ultimate leading lady! The energy between her and Kevin was captured perfectly. There was a lot of emotion in the film and Kris and Elizabeth nailed every scene! I think this film will cause a person to reflect on who they would actually be if really hard, impossible things, seemingly out of your control showed up randomly. Desperation causes people to make crazy decisions. Also, I think it's one of those films that could really cause a person to look in the mirror and ask themselves, \"what am I really made of?\" You can be a victim or a victor, but you can't be both. The Shift film name is perfect for the film. We can let the world shift us or we can decide to be believe in something bigger than ourselves. It's cool, slightly sci-fi, but ultimately it's kind of a wake up call to look at what's really important? The way they take you through the narrative is so unique, but a pleasant and intriguing surprise.",
    "125": "\"THIS IS NOT MY WORLD, BUT THIS IS MY HOME.\"The Shift is written and directed Brock Heasley and follows a man named Kevin Garner (played by Kristoffer Polaha) who gets banished to a dystopian, totalitarian world and fights a mysterious stranger known as The Benefactor (played by Neal McDonough) to get back to the woman he loves.The faith-based filmmaking realm has never really touched ground with the sci-fi genre, but when I saw this trailer in front of Sound of Freedom back in July, I was hooked immediately!The film is modern sci-fi retelling of the book of Job where our lead Kevin is put into a similar situation.Some people might go into the film thinking it's an action film when that's not at all what the film is. It is a character study of our leading man Kevin Garner as he is tested by God to see if he will still have faith in him even if he's put through hell.Kristoffer Polaha does a pretty good job giving us a lead we can understand and feel for as he is basically on the brink of death everyday with only the thought of getting back to his wife keeping him going.Neal McDonough, as I predicted, chews up every scene he's in as The Benefactor and provides us with a villain that the audience can easily hate.To balance the serious story, Heasley gives us the characters of Gabriel and Russo (played by Sean Astin and John Billingsley respectively) as the comedic reliefs. I always got a chuckle when they were on screen.The idea of Satan using multiversal tech to cause conflict and chaos across the universe is so unique to me because I truly believe Satan would do something like that.There's so many small details that I love with my personal favorite being the changing of aspect ratios to tell you which universe Kevin is currently in.Brock Heasley's directorial debut doesn't overstay its welcome and leaves audiences with a memorable and groundbreaking achievement in Christian filmmaking.Angel Studios continues to lead the way of creative filmmaking as Hollywood continues to slowly kill itself with remakes and reboots. This is what audiences want and this is what we desperately need more of.",
    "126": "I saw this on a whim, knowing nothing about it, and went through a gamut of emotions while watching it.After the opening scene: OK, this is another multiverse film. Let's see if they do anything interesting with the idea.After the introduction of the Benefactor: OK, this is the creepiest villain I've seen in a long time - and possibly the most interesting.I'm familiar enough with the Bible to recognise a re-telling of the story of Job when I see it. My heart sank at this point - was this going to be a piece of religious propaganda (I'm also familiar enough with the Bible to despise religion)?Happily, my fears were not realised, as the story resolved itself with a panache and a large slice of surrealism - and the resolution was satisfying.My heat sank when there was a preachy bit mid-credits, but happily (albeit bizarrely) this turned out to be a plug for a scheme whereby the audience could buy tickets for others to see the film.The performances were good throughout - especially Neal McDonough - the pacing was tight and there were some genuinely touching moments.",
    "127": "Prior to viewing I knew the movie was based on the story of Job. The movie is broken into sections loosely representing the story of Job using short Bible passages with a sci-fi setting. If that makes you uncomfortable, go elsewhere for your entertainment - this movie isn't for everyone.I felt the actors did well and the plotline wasn't predictable. The main character was easy to cheer for and was a great example of a flawed man maintaining faith in the Lord's promise for a better tomorrow.Most of the negative comments/reviews seem to be out of irritation that the movie was so overtly religious in it's delivery while not being advertised as such. I would blame that on the studio except they are the creators of The Chosen and have been advertising a piece of jewelry representing the empty tomb which is actually in the movie... I feel they did a great job of hitting on some deep biblical principles while keeping the story exciting and new.I love to see a new studio experimenting with ways to bring a powerful moral messages to the silver screen and I look forward to watching this one again!",
    "128": "I saw this the day before the official release and at the time I felt the pacing was slow and the story line quite confusing. I left the theater (grateful to have gone with a friend who also likes discussing movies) not sure if I liked it. I didn't hate it and I got the general gist but I certainly left with mixed feelings and mulling it over.I had free tickets so I went again sooner than I planned and so glad I did. The second viewing made much more sense and I left feeling definitely liking it. Its message was great and I enjoyed the journey with a better understanding.I like it so much and I get something new every time that I've seen it a third time and plan to purchase on dvd when released. Even between viewings I find myself thinking on it and having new insights.Kristoffer Polaha, Neal McDonough, Sean Astin, and all the cast really did a great job.Also, to the reviewer who claimed they lied about the religious aspect. They didn't. It's an Angel Studios film. They always do religious aspect to films and other ads show this. Just because you saw one where it wasn't as prevalent doesn't mean they lied.",
    "129": "Come in with open mind. There are boring moments yet the message, although based in religious beliefs, contains very positive and extremely valuable teachings.This kind of education appears to be lacking in parenthood and at home which appears to be reflected in suicide rates and other perturbing symptoms in society nowadays.The storyline and characters were well delineated yet at times didn't capture in full your attention. This in turn required a little extra effort in staying focused.From the special effects it brought current technology challenges as well as present a futuristic approach to it.Overall, the balance created between sci-fi, teachings and reality is tremendous and valuable if you have an open mind and not focus on the religion but instead the storyline and teachings.Solid 8 of 10.",
    "130": "First - A message for so-called expert critics (even for a few with positive reviews) - When you come into a movie with preset biases, prejudices, or expectations, you're already not able to perform in your capacity as a critic. The right thing to do is to just abstain, if you can't put aside your own prejudices. But, seeing many of these critics just can't help themselves, we continue to see these critics getting \"ratio-ed\" and dunked on by overwhelming positive response by the general audience. Shocked they haven't taken it to heart yet. Cry harder, and then ultimately, do better.My review - Solid movie. Great additional to alternative media producers/distributors. I followed this from the original trailer and seeing it with legit actors (e.g. Neal McDonough) has been great. Is this the best plot ever? No. Is worthy enough to be on the big screen? Absolutely, especially given their $6M production budget this is great execution. Is this an exact play-by-play retelling of the Old Testament Bible story of Job? Absolutely not (and for the critics good or bad who have a problem with this--Being a little narrow don't you think?). However, it story still explores the idea of \"losing it all\" while still trying to hold onto faith and having faith things will work out in the end. Reading critic and audience reviews it seems there may be a misunderstanding of what the story is about, vs what people expect the movie to be about. Always best to walk into a movie with no expectations.Maybe slight spoiler -\nI'm having a hard time reconciling who ripped off who with the armband device between The Shift and Everything Everywhere All at Once. It's Hollywood though where I guess something leaks and someone else lifts the idea from the other. Apparently The Shift was conceived 8 years ago so who knows...Comparison with a similar movie and thoughts on watching movies with ideologies not of your own -Obviously Everything Everywhere is a much greater commercial hit and with a much more massive budget. The plots are very different so there is room to enjoy both, but the overall messaging obviously clashes with each other--Holding firmly to one's Christian Faith in the face of despair vs graceful acceptance of Nihilism. Unlike these ridiculous critics who can't help themselves but lambast a faith-based movie like the Shift with extreme prejudices oozing out, as a Christian I actually still found \"Everything Everywhere\" to be a great movie, despite my rejecting its teaching of nihilism. Critics - it's OKAY to find enjoyment in a movie despite it not connecting precisely to your particular faith (or lack thereof).8 out of 10 - Great movie I would recommend.",
    "131": "The ShiftWhat if every choice that you made opened a different reality that reflected that choice? This movie explores that interesting, but not original, concept, but adds the twist that \"The Benefactor\" has the ability to go between the realities.Enter Kevin: a man that the Benefactor has recruited from a myriad of realities to cause chaos amongst the worlds, but this time, the Kevin we meet defies him with quite disastrous results. The dystopian world Kevin finds himself stuck in challenges him in ways that are very painful to watch.What follows is very thought provoking, as what would you do if you discovered that you're the only one, of yourself, to refuse chaos? What would you do if you were defined by some poor choices in your life that you were found worthy to, again, cause chaos, and not hope?Leaving this film, I was struck by those questions, and pondered them over the last 2 days, as usually my reviews are written faster than this. Hope is something that is always there. Finding it sometimes takes faith, and perseverance but it's worth it. Hope has saved me when I thought all was lost. I recommend this film for the uplifting message that trials can be passed. You are not defined by your good or bad decisions.",
    "132": "I came to this film with high expectations, having appreciated other ANGEL Studios products for their high production values and fealty to original stories.This was a superb, if loose, retelling of the Biblical Book of Job set in a multiverse-concept reality. While I thought the film was cast superbly, with familiar faces from the ANGEL production of The Chosen, I felt there could have been more time spent on character development, particularly the three lead roles. Having familiarity with the Biblical story and a few adaptations of it for theater through the years, I still loved this film, though. The dark hopelessness of the dystopian reality was incredible. The depth of the storyline was intriguing and thought-provoking; my wife and I discussed the film for an hour or so afterward. The answer to the age-old question of a just, loving God that permits evil in the world is simple, but it isn't easy.See this film. If it prompts you to go back to the original Biblical story, so much the better.",
    "133": "I had the opportunity to screen this film before its release and I was thoroughly impressed. As a fan of the original short film, this movie delivers the closure that I was hoping for!The acting was believable, and Neal McDonough absolutely killed it as \"the benefactor!\"Additionally, there hasn't been a role Sean Austin played where he hasn't done a fantastic job as a supporting actor. One of my favs!It was also really awesome to see Liz Tabish & Paras Patel in their respective roles. Both did a fantastic job.Lastly, Kristoffer Polaha delivered an excellent portrayal of his character, Kevin. It was hard not getting emotional alongside \"Kevin\" as his story progressed.If you had any doubts that sci-fi and faith-based could go together, this movie should alleviate those concerns.",
    "134": "The Shift is one of the most beautiful and powerful movies I have ever seen in my life! The acting was perfect, the plot was very intricate and compelling, and the message was powerful!The Shift offers us a fresh perspective on how we exercise our spirituality, how we handle the challenges and the consequences of our choices in a world riddled with selfishness, evil, apathy, indifference, superficiality, self-centeredness, and narcissism.Neal McDonough was simply brilliant, powerful, strong, and menacing! The message in The Shift is so powerful and impactful that will compel you to revaluate everything you have done, every single choice you make, and how willing you are to face the consequences, regardless.Do not let the negative reviews keep you from watching a movie that can really make a difference, and help us endure all broken bones and broken hearts along the way! Go see this brilliant and inspiring movie!!",
    "135": "A religious movie about a man named Kevin who is transported into another world and uses god to get out.Honestly this movie was really not that good. I went into this movie blind, as an atheist so this is a little biased. Don't get me wrong the movie started off so interesting and had so much potential. It had a super interesting plot however, it just fell very flat. It became so focused on the religious message that the plot fell apart and just wasn't as exciting. For someone of the religion it may have been more exciting however it just fell apart.The story itself had a lot of holes too. For instance the ending doesn't completely work, the shifting has some holes in it as well. It isn't completely explained and while they do explain a lot, it still feels confusing.The soundtrack is also pretty bad. It is the most basic religious movie soundtrack and it really doesn't add that much to the movie.The acting however is very good. Every character does a good job and really puts in a lot of emotion that makes the story more bareable.In conclusion, the movie was not very good. It had such a fascinating concept that is overruled by an over religious path as well as story holes and a boring soundtrack.",
    "136": "I saw the trailer for this and thought \"that looks awful\", and I really dislike \"The Chosen\", it is garbage and not at all good from a theological standpoint and does not represent the Bible well at all. I would never show it to a believer or non-believer. The Shift. Obviously has spiritual themes, but mostly it avoids the mistakes of the chosen by creating an interesting alternate reality premise and creating a world where the Bible is basically absent, actually it's a genius premise. It's fairly well-executed, and it is an interesting twist on old biblical themes and your typical dystopian world film. I have seen a lot of a big budget spiritual thrillers, such as \"Legion\" or \"Book of Eli\", which are complete trash.Yes, this movie present alternate realities, and multiple universes, but at it's heart, it is a love story. A story about an enduring love that drives the main character, and yes faith. I felt it was maybe too subtle in it's references to Christ, they're there, but there is no gospel, at the same time, I'm okay with that. I'd rather them not have mangle the gospel and not have it in there only hint at it. I recently watched a movie that was destroyed by overly heavy handed gospel messages and bad theology, called \"Red Letters\". That movie had such a good idea that was destroyed with a heavy handed message. This movie tries to give you a message rooted in the Bible in science fiction/fantasy alternate reality, and I am willing to accept what it gives because unlike \"The Chosen\" it's not claiming it's the authentic Jesus. In fact, it's kind of the opposite, there is no Bible in this world so the one person who knows scripture can only tell others what he knows from his memories, so it can't be verbatim, kind of a convenient plot device, but it works.I found the acting to e quite good, and the story to be very touching. I thought the world building was very well done. I liked the theme as well, which is really about perseverance amidst adversity, and sacrificial living, I would say this is a very good message, and a very needed one amidst the sewage that is modern Hollywood.It's got it's flaws, it is definitely a tad confusing, and maybe a bit too convoluted for it's own good, and slightly on the long side, it mostly gels together by the end. The music was very well used, including a very apt use of the Jars of Clay song \"Oh My God\", I ever thought I'd hear that in a movie(although I have no respect for that band, they jumped the shark years ago on and left orthodox Christianity), and it works very very well. I think I can easily recommend this as a solid 7 to people who are just tired of the amoral trash coming out today.",
    "137": "In the movie, some guy says a prayer (obliterating Satan) and is then forced into hiding for it by the media/police because it's illegal in the movie and that's what Christians believe is happening in real life. They want to be victims SO BADLY that they will portray this as what will happen to Christians in the very near future.The total victimhood shown in this movie for the religious protagonist is so cringeworthy I had to walk out early rather than endure another minute of this drivel.Never again going to endure another Angel Studios movie. I should have known by the fact that they're still distributing tickets for free what kind of movie to expect. I suspect they likely had another mid-credits plea begging the audience to buy tickets online to distribute to people for free (looking at you, Sound of Freedom).Don't waste your time.",
    "138": "This movie!! I laughed, I cried, my head was spinning because it's just so amazing!!It's emotionally intriguing and psychologically stimulating, and at the same time just plan intertaining!!And it has some of the best acting I have seen in years!!!I have already bought 20 tickets to give to friends because I think they will love this movie!!If you like sci-fi you will like it if you like romantic movies you will like it if you like to be emotionally and psychologically stimulated you will like it!!!I cannot think of one thing bad to say about the movie, and the soundtrack was over the top also!!A must see!!!",
    "139": "I so wanted to like this movie.I desperately needed to see a tear jerking movie about redemption and second chances.Things are so dark in the world right now.The only silver lining is that I didn't pay anything for the ticket.I have studied the book of Job in its original Biblical Hebrew. Lemme tell you, this movie had NOTHING to do with Job with the exception of the few times it showed verses on the screen.The story made no sense. The message about doing good was so convoluted. I really wish I would've gone to the movie totally high because then maybe o would've understood what the bejeezus was going on.Imagine the worst of the Matrix sequals has a love child with any Kirk Cameron wanna be religious message movie and then takes that child and smears it with doo doo.You get the picture.",
    "140": "I have longed for a different kind of movie that can have an authentic and more gritty expression of faith in a well-executed package. One that doesn't feel heavy laden by agenda but is rich in honest human emotion. I'm so excited that Angel Studios picked up Director Brock Heasley's sci-fi/romance/allegory, The Shift Film. It's mind blowing in the \"different\" category, yet it works so well with the fresh retelling of a very old story, the biblical tale of Job.Right off the bat we see the underpinnings of that story of a good man suffering incredible loss. It's our life story, figuring out how to respond to pain and uncertainty. But this story is a wild ride as we learn the intriguing backstory of Kevin and Molly, then see their life change on a dime as Kevin has an encounter with The Benefactor. It sets off a chain of events that land Kevin in a dystopian world seemingly devoid of hope, forgotten.It's an age old story of traumatic life shifts that we continually have to deal with in our lives. And it's not a subject we explore deeply enough.The sci-fi element is intriguing, yet it is Kevin's processing, daily decisions and struggle that help him and us to see more. And what he sees, he could never have seen without experiencing this pain and darkness. In this very imperfect man's faithfulness to keep seeking the light, he experiences God in ways no one else could see or understand, and he has to learn that too! He sees the other suffering people, with new eyes as well. This is a movie that will speak to people in a very personal way. I love that this movie is written with respect for the viewer to sort it out. And I think it will be deeply impactful to many as it has been to me.One particular highlight of this movie that I found striking is the musical score, composed by Dan Haseltine and Matthew S. Nelson. I am going back to watch because you can't receive it all in one viewing. The music is appropriately chilling, tender, dark, moving and glorious. It masterfully ushers in the emotions that I felt in such a visceral way, yet doesn't dictate what those emotions are. There is one musical cue towards the end that is so compelling as we watch shared human suffering. I have never felt such unity with people so unlike myself in this music and scene. It was breathtakingly healing and beautiful for those who have open eyes, ears and hearts.Finally, the art and production quality of The Shift is so good. The cinematography is breathtaking. The casting is perfection, starting with The Benefactor! Neal McDonough may have turned in his finest performance. Kristoffer Polaha brings so much to the very complex role of Kevin. He so perfectly portrays the pain, sadness and sorrow, but he masterfully projects a child-like heart that helps us to experience the wonder and hope that he is experiencing in his pain. I think it's an important interpretation of his role. Elizabeth Tabish is smart and oh so enchanting as Molly. She makes Kevin's tenacious desire to get back to her so believable. I just wish we saw more of her. John Billingsley, in the role of Russo, is brilliant. Every single actor brings their all to their parts. So impressed.I hope The Shift will be a much needed shift in inspiring more films that are compelling and meaningful with a unifying faith element that is respectful and relatable for the beautifully diverse humans that we are.",
    "141": "While \"The Shift\" may have its challenges in terms of pacing, it's important to acknowledge the film's strengths, notably its production, direction, and acting.The production quality of \"The Shift\" is commendable. It is evident that a significant effort was put into creating a visually appealing film. The cinematography, set design, and overall visual aesthetic contribute positively to the storytelling. Such high production values are particularly noteworthy in a genre that can sometimes struggle with limited budgets and resources.The direction of the film also deserves recognition. Directing a story with such profound and complex themes as those found in the Book of Job is no easy task. The director's vision in bringing this narrative to life while maintaining a cohesive and engaging storyline is an achievement in itself. The film's direction helps to create a seamless flow, guiding the audience through the narrative's emotional and spiritual layers.Furthermore, the acting in \"The Shift\" is a standout feature. The performances are heartfelt and convincing, bringing depth to the characters and making their struggles and transformations feel genuine and relatable. Strong performances are crucial in a story like this, where the audience's connection to the characters' personal and spiritual journeys is key to the film's impact.In summary, despite the issues with pacing, \"The Shift\" shines in its production quality, direction, and acting. These elements work together to create a visually striking and emotionally engaging film, capturing the essence of its biblical inspiration and providing a meaningful experience for its audience.",
    "142": "Don't miss this one! I wasn't sure what to expect from a Christian sci-fi but OMG! This is fantastic!Intelligently written and directed by Brock Heasely. The modern day version of the book of Job told in such a way this generation will understand.The actors are totally engrossed in their roles pulling you into the story in such a way that you feel Kevin and Molly's pain. I found myself along side of Kevin as he goes through his journey.Brock Heasely knows how to tell a story. The Shift doesn't need all the high tech bells and whistles. This is good storytelling told in such a creative way it leaves you longing for more.Definitely worth seeing and discussing afterward!Not to be missed!",
    "143": "This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.This movie may not be for someone who thinks on a shallow level for entertainment.You may want to watch reruns of Marvel movies or \"Barbie\" if that's the case.The Shift which I just pre-screened, it's a \"Sci-Fi\" about a soul tempted by Satan called the \"Benefactor\" Neal McDonough who does a great job of causing chaos in the Human life experience.Likewise, Kristoffer Polaha (Kevin Garner) does a great job of responding to this \"chaos\" in a Job-like manner (Bible story).Sean Aston and Liz Tabbish really shine as the other major characters in this drama.But really all the actors work in concert perfectly to bring this intense story to life.",
    "144": "I am a Christian and I really wanted to like this film as I'm a big fan of sci-fi and want more family-friendly and faith-based films.But this movie should never have been made with the version of the script that was greenlit.It's hard enough to convert a short film (which this movie is based upon) into a feature, and unfortunately two things doomed this one: 1). They added a unnecessary multiverse concept and 2). Strayed away from the charm of the short film that focused on the character arc of Kevin.The run time was too long, the script was a mess, and by the time the film came out, the multiverse concept has been way overused in a ton of films. I was bored and literally fell asleep at one point. Lots of preachy and overdramatic dialogue (though they tried not to talk about Christ or Christian-specific themes). It wasn't really sci-fi, it was fantasy. They never explained why tech devices were needed by the \"benefactor\" (it's never really a secret that he's the devil, so no spoilers here).The cast did a good job with the material they had to work with and the production values were good, although there is a scene where you can see a character's mouth moving calling for his cat, but the sound is about 15 seconds off. But we never really got to know any of the characters very much, including Kevin. The romance didn't really develop over time and didn't seem like any chemistry. After watching it 2x, I'm still confused about a bunch of the plot points. Kevin really had no character arc, though they tried to pretend he did. He never really changed, no one in the movie really changed. No real surprises anywhere, fairly predictable plot.Should have had a ton more pre-production script development to iron out a lot of plot holes and character development weaknesses. Casting was OK, but you shouldn't have the antagonist be shorter and have a weaker voice compared to the protagonist. It's like casting Michael J. Fox as Biff Tannen and Thomas Wilson as Marty McFly in Back to the Future. The villain was never really a threat and was just gone for 5 years of the movie. The stormtrooper-like guys also were not very menacing. Who were they? They just had flashlights and high-powered guns, and like storm-troopers, not very good shots. The whole set and costume design was pretty weak. It's overall a very strange plot that leaves you scratching your head. I still don't really understand what happened at the end.It's a shame that the filmmakers and Angel in particular seem to continue to take Christian movie-goers for granted, assuming they will \"rally to support the cause\" even though Angel has tons of money in the bank after the huge success of Sound of Freedom. No longer a fan of this movie studio. I would not pay for this in the theater or even pay to rent it on streaming. Really disappointed.",
    "145": "Disclosure: I helped fund The Shift and will earn a small amount back if it does well.TL/DR: A really, really, well done and compelling Sci-Fi offering unlike any I've seen before. The overall story was great, well filmed, directed, sounds, music, effects - all great. However, as the title says \"I wanted more\"If anything is lacking it is some character development and in-between details to help build out the back story. Not that the characters were shallow, just that there's more there than the final film revealed.I know those details are there in the writing, as I saw them in the pilot-concept short for supporters. You can sense them surrounding the storyline, and characters as they come to life on screen, but I found I had to fill in the gaps from my previous exposure.All that said, the girlfriend, who is a movie buff (and a generally harsh critic of crappy films) well beyond my skill level.... She loved it just as it was and she had no previous exposure. I'm sure you will too. Cant wait to see again on the big screen!",
    "146": "Don't let the trailer deter you. Don't let a 5 second clip dictate a full movie. I'm sure some may not like it but take my word. This was probably one of my favorite movies of all time. I will see it again.Take yourself, your family or whoever but go! Pay it forward. The world needs to see this movie.The book of Job is supposed to be uncomfortable and difficult to read but this movie certainly helps understand it in a more intimate way.If we don't allow ourselves to feel uncomfortable sometimes then we all have a lot of growing to do.Thank you Angel studios. If you make all the books of the Bible like this I would be ecstatic. Thank you for this.",
    "147": "Very amazing fantasy movie for Christians, as it's all about their perceived persecution in today's political climate.In the movie, some guy says a prayer (obliterating Satan) and is then forced into hiding for it by the media/police because it's illegal in the movie and that's what Christians believe is happening in real life. They want to be victims SO BADLY that they will portray this as what will happen to Christians in the very near future.The total victimhood shown in this movie for the religious protagonist is so cringeworthy I had to walk out early rather than endure another minute of this drivel.Never again going to endure another Angel Studios movie. I should have known by the fact that they're still distributing tickets for free what kind of movie to expect. I suspect they likely had another mid-credits plea begging the audience to buy tickets online to distribute to people for free (looking at you, Sound of Freedom).Total cringe, don't waste your time.",
    "148": "Okay, so I'm looking at IMdB score and see that it is far below what I would have and have given it. Having watched the film with my wife, who didn't cringe one time or have to block her ears or vision because of offensive content, I KNOW why the critics HATE this movie: no sex or full-frontal nudity or blasphemy or f-bombs or crude sexual jokes... and the devil isn't some medieval gargoyle beast with horns and tail and razor sharp teeth! Not your typical horror film with blood and guts and body parts flung at people or the camera! And the bad guy, he seems to be a really nice, caring guy who just wants the \"best\" for you, for him, uh.Oh, and the BIGGEST NEGATIVE with the critics, whether they are honest about it or not: there's a FAITH ELEMENT, NOT in Man but in the Supreme Being and His Son! GASP! We can't HAVE that in a film that is to be taken seriously!!! NOT ON THE BIG SCREEN!!! NO WAY!!! So, we gotta find ways to tear the film down without being HONEST about it! We can't let on that we HATE GOD and His Son!So, what did I see? I saw a man struggle with his faith, his LIFE, his marriage, his job... EVERYTHING! He \"had it all\", LOST it all, tried to FIND his life and return to it. And he had to deal with selfishness versus selflessness. And he grew in the process!Not your typical sci-fi or romance movie, but a very good one! How do you put the life of an ancient historical man on the big screen in a way that appeals to most? I think they did well! I will buy this movie on DVD when its available. It will likely be an addition to films for around Easter... see the film and you might understand why.",
    "149": "The ShiftWow!!! I am lost with words.I don't know where to begin but I just want to thank my wonderful spouse Yessie for purchasing these tickets to watch this amazing movie. What a powerful message!!This movie was a bit shocking to us because two weeks ago. My spouse and I read the story of Jobs in the Bible so this was a bit surprising in a good way. Also, we can both relate with the message as we both have gone through some rough times but we never gave up on hope.We are so thankful and we will continue to do our best to serve God and continue to bless others with what we have.I really do hope that so many people get the chance to watch this movie and to Never give up on hope!!!Amen!"
}