{
    "0": "Gee, if you're going to be a Scrooge, there's no point to even watching this movie. I read the negative postings on every film I see, and it's amazing to me how much energy people put into picking apart what's intended to be a holiday entertainment. Especially these days with the advance in computer generated effects. There used to be a time when clay-mation was the rage, and how realistic was that? How about considering the message - I for one would be darned upset if there was no more magic left in the world. It's evident every time my little two year old granddaughter runs in the room and tells her gaga (that would be me), to 'sit' so we could play or watch a movie like this together. This one got around to showing 'Santy', and you have to marvel when a mere child sits enthralled by the spectacle of color and motion the way it's presented here. For a while during my adult life, there was probably a time when I didn't hear that bell, but as I get older the sound is coming back, even as my hearing diminishes. I guess you'd call it the magic of kids and Christmas together, and you can count me in when the conductor calls 'All Aboard'.",
    "1": "When I was a kid I watched this like, a million times. My native language wasn't english, so despite being a child not understanding anything, I loved the movie. It's full of christmas and spirit. I would want a train like that go by my home",
    "2": "Chris Van Allsburg best selling children's book is considered by many to be classic children's literature. The film version is an animated which benefits the story further. Tom Hanks plays the narrator, producer, and the train conductor. The animation is first rate, award winning, and breathtakingly realistic as well. Of course, this is a children's story and there are some dark moments like the girl who didn't have her ticket and the main character who found it and planned to return it to her so she doesn't get kicked off the train and the ending. Of course, I am surprised that there was negative criticism. If I had children, I would love a classic film like this about the true meaning of Christmas. The act of being the giver and the receiver is what the story is about. Let's not talk about the nativity, that's for another story. If It's good enough for Chris Van Allsburg, it's good enough for me.",
    "3": "I've read the book, the Polar Express and later on, saw the movie. I myself have always visited Santa Claus when I was a lad and so did my nephew. I did in fact did a search on the real Santa Claus. He was originally known as Saint Nicholas of Myra. A Eastern Greek Orthodox Bishop. My nephew knows very little about the origins of Santa Claus. But eventually he'll learn the truth and know the true meaning of Christmas.",
    "4": "A simple story . . . beautifully told . . . magnificently visualized.The IMAX experience was stunning.I did not expect to enjoy the story as much as I did. Simple but quite heartwarming.Although it started a bit slow, it continued to gain momentum (no train analogy intended) through its conclusion. I was not a great lover of the animation of the human characters, but the other animation, whether it be the train, the scenery, the reindeer, or the elves (are elves human?) was quite well done. Perhaps the best review I can provide is that after I watched the Polar Express, I just felt happier.",
    "5": "Clearly the reviewers who panned this wonderful film can no longer hear the ringing of the silver bell. I am reminded of the know it all kid in the film when I read these reviews. Some said it was too dark. Too dark? It was set at 5 minuets to midnight.....As I recall its dark then. Another called it ghostly; a condition true of a Christmas Carol, the film is in good company there. While I will admit that the computer motion capture in facial expressions is not as strong as it could be it did not detract from the story. Some reviewers did not like the roller-coaster effects. One even pointed out that trains can not do what this one does.....It's a dream...physics don't count. It is a sad commentary that the meaning of Christmas and belief in it's historically documented magic is so lost on those with access to the press. My review...it's good and it is best if you make up your own mind. I could hear the bell ring and I hope you can too.",
    "6": "This is really an amazing movie, taking place on christmas eve. Those people who are like \"its not realistic\" it's a christmas movie for gosh sake. Enjoy it. It gives me flashbacks of how I always used to have christmas. It's very amazing. We watch it every year!",
    "7": "This movie gets better every year we watch it, I've heard some think its creepy.Its NOT creepy you're just not used to animation this GREAT!! Its actually a work of art, and omg what a great story. Its actually a spin on the Christmas Carol go read the trivia on IMDb. Anyway Tom Hanks is phenomenal in this already Christmas classic and the animation is incredible. We're some of the VERY lucky ones who get to watch it in lustrous, astonishing, phenomenal 3d!!! I purchased ( feel like I stole it) for a whopping 19.95 and for that measly amount of money I own a hundred million dollar MASTERPIECE that needed 100s of people spending thousands of hours to make and I can watch it anytime I want for 20 bucks!! I should feel guilty I thank all involved for allowing myself and family to EXPERIENCE this work of art!!!!!!",
    "8": "\"The Polar Express\" is based on the classic picture book by Chris Van Allsburg, and brought to the screen through the magic of computer animation. The movie is a huge spectacle of wondrous imagery. All this surrounds the story of a skeptical young boy who takes a Christmas Eve ride on the Polar Express, in attempt to convince himself that Santa Claus is real. Tom Hanks is the star, providing the performance of several characters, including the stoic Conductor, who plays it strict in one instance, then endearing in the next. Much has been made of the liberties taken with the original story. This is just a case of having to stretch a simple story into feature length. But a lot of added sequences are enjoyable and breathtaking, including the snappy \"Hot Chocolate\" number. You can expect this to be a new holiday classic that will be remembered for years!",
    "9": "It's the first big attempt at motion capture all CGI animation full length movie. It is commendable of director Robert Zemeckis to attempt such a feat. It is a technological step forward. But the creepy eyes.... the creepy dead eyes.A boy is doubting the reality of Santa. A mysterious train comes to his house. He boards it and finds other kids going to the North Pole. The fact is this is not a very magical voyage. The song and dance isn't that good. There is an air of hollow fake fun in this movie. And that doesn't include the creepy eyes.... The creepy dead eyes.And I didn't really see any magic in the North Pole. It felt more like an old industrial English town. I really wanted more magic for the workshop. And then there were the creepy eyes.... the creepy dead eyes.",
    "10": "This film was a glorious explosion of the hope and Wonder that fills the memories of the Christmas of Olde. It was a well-detailed, innovative, thought-provoking piece that reminded me of the magnificence of belief in childhood ideals. The characters were well-fleshed-out and very easy to \"know\". The animation was amazingly detailed and very life-like. The musical numbers and side pieces (especially on the train roof) brought some very effective morality and life lessons to the superb computer animation, giving it that \"touch\" of humanity.We all need to hold a piece of the fragile innocence rekindled in this film near to our hearts and spread that unbridled, child-like joy in the simple things in life to remind us of the good we all carry within us.",
    "11": "It's Christmas Eve and a young boy is having doubts that Santa Claus exists. Then a magical train, the Polar Express, appears outside his house. It's destination? The North Pole. Its young passengers are going to meet Santa, but not before having some adventures along the way.An animated Christmas movie that doesn't go anywhere particularly new nor profound but is still great entertainment. Wonderfully sweet and warm in tone and filled with some great adventures, it's quite difficult to dislike.Can't fault the graphics: great and quite novel for the time. Casting is also spot-on, with Tom Hanks in several roles.",
    "12": "Several years ago on Christmas Eve, I was feeling sorry for myself being single and lonely. After attending church, I waited for a bus home in the cold snowy gloom, fearful about the safety of a past midnight commute. Suddenly a brightly lit bus pulled over with no person present but the driver. Opening the door, he cheerfully bellowed out Merry Christmas and asked me to jump on board. The musical theme from The Twilight Zone played in my head as I entered the warm light.My driver talked about himself being single and lonely, and how he had been saved by Jesus. His married co-workers did not want a Christmas route, so he gladly accepted this run as a way to share the holiday spirit by buoying mine. Although deeply engaged in expressing his thoughts, he drove expertly with care. I remained the one and only passenger. We approached my stop across the street where I live. Not yet finished with his testimony, he parked the vehicle for several minutes. Shaking hands, I alighted. The driver waved as he pulled the bus away. I stared at it fading into the dark distance.That night was my ride on The Polar Express.Thanks to the new movie with the same name, I've been able to relive my journey of faith through the eyes of other witnesses. Presented in a choice of 3D or 2D or Digital, enthralling animation virtually places you on the set, the film opening with an older man narrating his experience as a youngster on Christmas Eve in 1955. His name is never given as he represents any one of us viewers. He lies awake afraid he won't hear the sound he awaits: the sleigh bells belonging to Santa Claus. He's of that age when he's beginning to realize that Santa might just be an illusion, and he desperately needs proof of something out there beyond ordinary existence, something wonderful and inspiring. The Polar Express then arrives, the conductor announcing it will transport him to the North Pole. It struck me that it would take a humongous leap of faith for a child to board this very strange train.There's a tendency to blame modern science for the abrogation of faith. The beautiful sunrise you admire and give thanks for is said to be nothing more than gases and photons resulting from a random Big Bang. Yet questioning faith is ancient and is illustrated in the Bible itself. The story of doubting Thomas tells us he believed in the resurrection of Jesus only upon touching the mark of the nails in His hands. Paradoxically, we are asked to accept this account as Gospel when we ourselves have no hands to examine.As the train begins leaving, the lad climbs aboard. Clearly his own decision, he realizes under the surreal circumstances normal rules of logic don't apply. He joins other interesting characters, including a know-it-all kid, a sweet girl, and a protective hobo whose personality is a bit like my bus driver. Most haunting is the lonely boy from the wrong side of the tracks who you sense has been physically abused.The passengers endure trial and tribulation helping each other grow in understanding themselves and getting to their destination. The scene of the lost ticket flying through the air is profound. How that ticket winds up back on the train mirrors the miracles of real life. Skeptics can explain away the phenomenon, but like the sunrise, is it simply an accident, or is an unseen hand at work? The vast Ice Lake resembles a frozen Sea of Galilee and as in the Biblical reckoning, the faith of those on board gets them to the other side without drowning. Only our youngster remains unsure. It's all a dream, isn't it? His struggles to believe will tear at your soul.When the train finally reaches the North Pole, I grew anxious about Santa's forthcoming appearance. How could he possibly meet expectations? By comparison, Ben-Hur is the sole movie about Jesus I appreciate because His face is never shown. I think it's too difficult for human actors to portray a person who is also divine or otherwise supernatural. But the superb animation process of The Polar Express enhances actors' features, rendering the encounter of the boy with Santa so provocatively authentic that Santa has to remind us he's only a symbol of Christmas, the real Spirit being in the heart.Our hero returns home, the train departing without a trace. Was his adventure real or a dream? Viewers differ on the interpretation of the clues offered. Cynics argue it doesn't matter for either way the whole thing is a fairy tale. Well, reconsider the paradox of doubting Thomas. At the end of the day, even he was alone holding only memories of the hands he touched. Had he merely imagined the event? As with the train ticket or my bus driver, you hang onto the mystery of what happened, believing when others doubt. You may even believe the story of Thomas.I recall the words of the eminent author Ayn Rand, \"When people look back at their childhood or youth, their wistfulness comes from the memory, not of what their lives had been in those years, but of what life had then promised to be. The expectation of some undefinable splendor, of the unusual, the exciting, the great, is an attribute of youth - and the process of aging is the process of that expectation's gradual extinction.\"Do yourself a favor. Step aboard The Polar Express. You'll travel back when you were young and innocent, revisiting the hopes and dreams you have since abandoned. The intensity of your restored faith may prove overwhelming and you may weep as other grownups in theaters have. The movie posters truthfully advertise, \"This holiday season... believe\".",
    "13": "\"The Polar Express \" was an awful movie. What makes this movie worst is the hypocrisy to present itself as a innocent,s sugary and harmless tale for children about the \"true \" meaning of Christmas. I never read the book of Chris Van Allsburg in what it was inspired, but the most disappointing is that it was directed by Robert Zemeckis, the same director who made the great animated film \"Who Framed Roger Rabbit?\", an excellent movie where he proved that the animation could be appreciated for kids and adults as well, while in this movie it seems that he was victim of his own ambition and he give too much importance to give the characters impressive level of detail and \"realism\" rather than a interesting story. Everything from this movie seems to be so artificial and lifeless:Despite the \"realistic\" appearance of the characters, they look more like creepy mannequins with eyes made of glass rather than living beings.But the worst part of \"The Polar Express\" is the \"message\" in this movie, which is just vile. For example, in one scene, where one kid refuses to enter into the Polar Express, the character that looks like Tom Hanks makes a gesture like saying \"you are stupid for not accepting my offering \". There is also the scene where the diversity token girl says something like the toys were so \"warm \" and things like that. All the movie the kids keep talking about how big would be the gifts that Santa would give to them . There is even a song about that.Filled with lots of irrelevant scenes and annoying characters (Not to mention the horrible songs) the movie ends with the main character finally discovering the \"true\" meaning of Christmas (Or whatever): Guess what it is? The gifts! it is true that many Christmas movies have hidden subtexts and messages like that ,but \"The Polar Express \" it's completely shameless about celebrating materialism and greed.I don't think that \"The Polar Express\" were a very appropriate film for the kids,because if is that what the kids would learn, I don't want to think how would be our future.",
    "14": "I'm a huge fan of Chris Van Allsburg, and especially his book, \"Polar Express.\" I love Tom Hanks.I really wanted to like this movie ...Reviewers said that the motion capture technique resulted in freakishly animatronic looking characters. At first that aspect of the film did bug me, but I did get used to it.But ... I really didn't like this movie. It was too dark, and it wasn't dark because it had a few scary moments; there's more to it than that.First, what's good. \"Polar Express\" contains some stunningly lovely and/or remarkable scenes. The words on a page are seen from below the page, as if the page were transparent; wolves and eagles follow a slip of paper as it is blown about by the wind; Frank Sinatra and Bing Crosby Christmas hits play in a North Pole toy factory.All very worth seeing, worth, perhaps, the price of admission for hardcore film fans.But the movie was simply too dark and too PC for me. And it reaches too far.The PC aspect of the movie is an insertion that doesn't exist in the book. The main character is provided with a companion, an African American girl.The animatronic look of the motion capture character is unpleasantly emphasized by the animatronic characterization of this girl. The script bends over backward to make her purely good, cool, and admirable, with no negative qualities, and that effort is obvious and alienating.American audiences are grown up enough that we can accept a flawed -- i.e., human -- African American character. We don't really need a cartoon version of the character Sidney Poitier played in \"Guess Who's Coming to Dinner.\" There is a Poor White Boy character added, as well. Whoever wrote this character has no idea what it is to be poor, and treats this character with zero respect, and a great deal of condescension. The \"lesson\" this poor boy is meant to learn at the end will have self respecting poor people gagging.Finally, the movie was just too dark, with none of the redemption richer movies have been able to offer. There are scenes of perilous efforts to walk atop a moving train during a snow storm, and scenes of vulnerable children trying to cross a dangerous bridge.\"Wizard of Oz\" and other classics contain similarly scary scenes, but those films also offer deep and moving scenes of genuine empowerment and redemption. I missed such redemptive, powerful scenes in \"Polar Express.\" This film will have its audience for whom it works perfectly. It does offer scenes as stark and striking as anything from German Expressionism.What I missed were the warmth, the depth, the heart of the best of \"Wizard of Oz\" or \"The Little Princess\" ... or the Chris Van Allsburg book, \"The Polar Express.\"",
    "15": "This is understandably a great Christmas movie for kids, but the adults may get bored with it. It does star Tom Hanks, which is a draw for the audience, and he does good voice-over work. The story is about a magical train, which does interest most children and adults alike, since most of us adore trains, especially at Christmas.The animation in the film is very nicely done, in fact, it looks very similar to the art in the book of the same name. \"The Polar Express\" is a neoclassical Christmas tradition that will join the ranks with Frosty and Rudolph sooner than we think. This year, it is set to be broadcast on television for the first time, and most likely not the last.I gave the film a 9 out of 10.",
    "16": "For the first 10 minutes this film is a delight. The filmmakers and animators must have worked themselves into a frazzle to get this amount of detail and style into the film - the human characters look as if they were both rotoscoped AND computer animated, and all the inanimate or inorganic elements of the film - the landscapes, the houses, the trees, the Polar Express itself - are dazzling. If the movie had been a 22 minute 'short' (a la \"Merry Christmas, Charlie Brown\"), it would have been one of the all time classics of Christmas animation. Unfortunately, Zemeckis and company felt they needed to expand \"Polar Express\" into a feature length movie, and the source material can't hold up to the extended length.Face it, one of the great strengths of the children's book this movie adapts is the brevity and economy of its literary style - supplemented by evocative fantasy visuals that augment, not replace, the poetic resonance of the carefully chosen words. But here, the writers have to add extra plot elements, characters and dialog to the basic 'text' to extend it to feature length, and they just don't have the ability to triple the content while maintaining the magic of the original source. It's as if the Hallmark Card composers tried to expand on the works of Robert Frost - they can ape the style, but they can't get the resonance or the heart. It's well meant and agreeable, but it somehow misses the point.It's also got Eddie Deezen doing one of the voices, which is always a minus for me. Deezen is still doing voice work after 20+ years in the business, so someone must like him, but all I can say for him is that he must be dependable and reliable...because he turns in his usual sinkhole of nasal suck. Sorry Eddie, I know you need the work, and it's nothing personal, but I hate you as an actor.Tom Hanks, on the other hand, is his usual splendid self, and it's largely due to his efforts that I can enjoy the thinned out content of the various over-extended sequences. He puts so much warmth and dry humor into the various characters he voices that it almost gets this film over...if not for him, I would rate this film much lower.Another problem: after a while, it is apparent that the animators are running out of ideas. For instance, they use a reverse 'zoom' pull back crane shot shot - that pulls back from a crowd to show the spectacle of hundreds of figures from an eagle eye view - way too much. It was sensational when it was used for the first time in \"Gone With The Wind\", and it's great here the first time they use it, but after a while, you can tell they're doing it again and again because they don't know what else to do. And there are a lot of musical numbers and dance scenes (a la \"Shrek\") that work fine at first, but really don't add anything to the story or the atmosphere. My favorite - the \"Hot Chocolate\" scene - is typical; it's light hearted and kind of clever, but Disney and Pixar do this kind of thing much better, and they integrate the musical numbers into the plot better. And I hate to say it, but sometimes the art direction slips a bit and the gloriously life-like faces of the children and the train crew alarmingly devolve into the death-masks of soulless zombies. (This happens all the time in the cut-scenes for video-games). This is the peril of making computer animation as 'realistic' as possible - if every aspect of the production is not dead on, humans will look like the walking dead. This may be inevitable when you're doing a feature length animation , even when you are budgeted for 'state of the art', but it really detracts from the charm and sentimentality the movie is trying to instill.I only rate this as a \"6\", but it's a STRONG \"6\", and there is enough to enjoy about this movie (especially the railway travel and boarding sequences of the Express itself) that I will gladly watch it again with any 8 year olds in the TV room who insist on seeing it during Christmas vacation. And there are times when the visuals are gorgeous enough to make an adult 'BELIEVE' again, if only for a second.",
    "17": "When we watched this wonderful movie, we absolutely forgot where we were. The minute it starts, it gets your attention and keeps it until the very end. You enter a truly magical world.We don't celebrate Christmas, but after seeing some trailers with the chocolate being served on the train (very funny and cleverly done!) I became so curious about this movie, and even more so because I am a huge Tom Hanks fan. I just had to see it. Any film Tom Hanks is in, is great and this one is no exception.So when we sat down, I already expected this to be good, but I could never have imagined how wonderful this one and half hour journey would be! From the start to finish, everything is perfect. I didn't mind the facial expressions at all, or lack of them. The rest of the movie makes up for that minor glitch.I must say, the part in the end where Santa uses his whip to take off, well that whip reminded me of the one the Balrog had in the Fellowship of the Ring, lol! And the engineer was very funny, the children just laughed so hard when the beard was pulled of the assistant of the engineer and his scream actually became a communication with the deers blocking the railway! There is so much in this movie, comedy, sorrow, disappointment, happiness, relieve, suspense. In the end, you are left with a warm and satisfied feeling. And that's what a family movie should provide.",
    "18": "I have a small collection of Christmas movies that I can watch every year without getting bored of, and this is one of them. I love the story and the animation is just beautiful.'The Polar Express' captures the Christmas spirit as well as any Christmas film I have seen. It has a truly magical feel about it and provides endless festive adventure and excitement. The attention to detail is very impressive, so much so that it's hard to believe this film is over 10 years old.I would consider 'The Polar Express' one of my favourite Christmas movies and one that I always look forward to putting on over the festive period.",
    "19": "It is such a departure from Hanks' normal stuff, a classic of my childhood, my school would show it to us every year. The first Tom Hanks film I ever saw, though at the time I didn't know who Tom Hanks was!Definitely recommend to people with young children, or people who saw it long ago, the nostalgia is quite something.I didn't do it. I didn't do it. I didn't do it.That was a classic line people repeated again and again back in the golden years of my childhood!",
    "20": "The Polar Express delivered me all the way back to childhood and my own faith in Santa Claus at the age of five. I could not only hear the bells, I could see his sleigh in the night sky. Chris Van Allsburg is to be commended for writing an excellent fantasy and Tom Hanks for conducting the wonder tour to beat them all. The special effects are just outstanding, the story line credible and heartwarming. The characters are believable and utterly charming. The children depicted are our own. I would recommend this film to any and all who love Christmas and remember what it is to believe. The experience of watching makes you a participant, breathless to see what comes next. I can hardly wait to view it on IMAX and am taking my entire family, including seven grandchildren to the Tulsa Cinemark this season. Let's hope we see more of this quality venue in months and years to come.",
    "21": "This is one of the better Christmas movies I have seen lately. This is much better than the last one I saw, Four Christmases. I probably like this more because this is animated, features Tom Hanks, and great music is played. I loved the music for the film.This is about a hero boy who does not believe in Santa Claus. One night, The Polar Express arrives at the boy's house. When he enters the train, him and other kids are about to have fun adventures heading to the North Pole.The animation is very good. I liked how everything seemed almost believable. My favorite character is the hobo, he seems to make the hero boy feel bad about himself.As I said before, I loved the songs. I especially liked Josh Grobans, \"Believe\" Overall, this is a great Christmas classic with a great message. I rate this film 9/10.",
    "22": "People rave about this film, and despite me hoping to be able to join in the positivity I can't.I didn't like the film, and found the technology used to create the characters a bit creepy.It won't join my list of festive favourites sadly.",
    "23": "This movie is a very good movie for all ages! Whenever the Polar Express is on I watch or at least try to watch it. I always wait until the commercial to do anything that includes leaving the view of the television screen. Pretty much everybody in my family loves this movie and this is a very hard thing to happen because all of the ages in my family vary so if you have kids or if you are a kid I would say this is a very good movie for you. Whenever I see this movie I laugh a lot! The whole point of this review is that I am saying, you should most definitely see this movie, no matter if you are a kid or have kids this will be a wonderful movie for you to see!!",
    "24": "In these times, what an awesome movie to watch. Just got it in Blu-Ray and its stunning. Not just the visuals, but the story makes you want to believe in Santa again. Dont compare it to the book...its breathtaking !!",
    "25": "Many years ago we opened a Christmas present for my daughter (now out on her own) sent from my brother and sister-in-law who lived 1500 miles away. The box contained a book, The Polar Express, and a sleigh bell. I'd never heard the story, and I remember looking at the book and the bell and wondering what they were about. I probably got more out of reading The Polar Express than my daughter did at the time. When the movie came out I made the mistake of reading reviews and put off seeing it. When I did get around to a view I was pleasantly surprised. The dark aspect critics panned to me reflected magical nights in decades past, looking out my bedroom window at snow falling in the street lamplight with that sense of awe, appreciation of beauty and security that only a child can have. While The Polar Express isn't what I would have made of the book it does have for me that dreamy sense of glory and anticipation that is the mark of childhood and what I most miss of those days. Well worth seeing, in my opinion.",
    "26": "I grew up on this movie and it's always been a great movie. The animation is great for an old CRT TV of the time, but it does look a little creepy on modern panels. I really think people just like to find things to hate. Great movie, would recommend.",
    "27": "\"The Polar Express\" is often more than a little strange but in a good way. It does a great job creating a different world. It's strange world that is totally believable. The characters all look a little weird but they fit in just fine. It's a beautiful movie to look at. I wish I could see this movie again in 3d. That's the way I saw it when it first came out. \"The Polar Express\" has a lot of great moments but my favorite is when all of the elves gather for Santa's flight. It's so much fun to watch. \"The Polar Express\" does a great job leaching us to believe. It can flip back any of us on the fence.",
    "28": "A wonderful film to be recommended to all who can see beyond their on small lives and maybe still see the childhood wonder that they once had as a child. The makers chose to render the film very close to the original art work in the hardcover children's book. An interesting approach. I am stunned at the amount of comments here who really did not get the point of the film. I guess you hear the bell, or even remember what it was like at one time to hear it or you don't, but the amount of ridiculous hate reviews here on this site is ridiculous. I wonder If the times we live in have started to breed the wonder and joy of the imagination out of us all. sad. what did one person write? \" we all know that trains don't go down the middle of the street\" wow, what a sad state the world is in. see the film for yourself, a film where not everything is spelled out 100 % and it lets your imagination soar.",
    "29": "It's Christmas Eve and a young boy is having doubts that Santa Claus exists. Then a magical train, the Polar Express, appears outside his house. It's destination? The North Pole. Its young passengers are going to meet Santa, but not before having some adventures along the way.An animated Christmas movie that doesn't go anywhere particularly new nor profound but is still great entertainment. Wonderfully sweet and warm in tone and filled with some great adventures, it's quite difficult to dislike.Can't fault the graphics: great and quite novel for the time. Casting is also spot-on, with Tom Hanks in several roles.",
    "30": "Several years ago on Christmas Eve, I was feeling sorry for myself being single and lonely. After attending church, I waited for a bus home in the cold snowy gloom, fearful about the safety of a past midnight commute. Suddenly a brightly lit bus pulled over with no person present but the driver. Opening the door, he cheerfully bellowed out Merry Christmas and asked me to jump on board. The musical theme from The Twilight Zone played in my head as I entered the warm light.My driver talked about himself being single and lonely, and how he had been saved by Jesus. His married co-workers did not want a Christmas route, so he gladly accepted this run as a way to share the holiday spirit by buoying mine. Although deeply engaged in expressing his thoughts, he drove expertly with care. I remained the one and only passenger. We approached my stop across the street where I live. Not yet finished with his testimony, he parked the vehicle for several minutes. Shaking hands, I alighted. The driver waved as he pulled the bus away. I stared at it fading into the dark distance.That night was my ride on The Polar Express.Thanks to the new movie with the same name, I've been able to relive my journey of faith through the eyes of other witnesses. Presented in a choice of 3D or 2D or Digital, enthralling animation virtually places you on the set, the film opening with an older man narrating his experience as a youngster on Christmas Eve in 1955. His name is never given as he represents any one of us viewers. He lies awake afraid he won't hear the sound he awaits: the sleigh bells belonging to Santa Claus. He's of that age when he's beginning to realize that Santa might just be an illusion, and he desperately needs proof of something out there beyond ordinary existence, something wonderful and inspiring. The Polar Express then arrives, the conductor announcing it will transport him to the North Pole. It struck me that it would take a humongous leap of faith for a child to board this very strange train.There's a tendency to blame modern science for the abrogation of faith. The beautiful sunrise you admire and give thanks for is said to be nothing more than gases and photons resulting from a random Big Bang. Yet questioning faith is ancient and is illustrated in the Bible itself. The story of doubting Thomas tells us he believed in the resurrection of Jesus only upon touching the mark of the nails in His hands. Paradoxically, we are asked to accept this account as Gospel when we ourselves have no hands to examine.As the train begins leaving, the lad climbs aboard. Clearly his own decision, he realizes under the surreal circumstances normal rules of logic don't apply. He joins other interesting characters, including a know-it-all kid, a sweet girl, and a protective hobo whose personality is a bit like my bus driver. Most haunting is the lonely boy from the wrong side of the tracks who you sense has been physically abused.The passengers endure trial and tribulation helping each other grow in understanding themselves and getting to their destination. The scene of the lost ticket flying through the air is profound. How that ticket winds up back on the train mirrors the miracles of real life. Skeptics can explain away the phenomenon, but like the sunrise, is it simply an accident, or is an unseen hand at work? The vast Ice Lake resembles a frozen Sea of Galilee and as in the Biblical reckoning, the faith of those on board gets them to the other side without drowning. Only our youngster remains unsure. It's all a dream, isn't it? His struggles to believe will tear at your soul.When the train finally reaches the North Pole, I grew anxious about Santa's forthcoming appearance. How could he possibly meet expectations? By comparison, Ben-Hur is the sole movie about Jesus I appreciate because His face is never shown. I think it's too difficult for human actors to portray a person who is also divine or otherwise supernatural. But the superb animation process of The Polar Express enhances actors' features, rendering the encounter of the boy with Santa so provocatively authentic that Santa has to remind us he's only a symbol of Christmas, the real Spirit being in the heart.Our hero returns home, the train departing without a trace. Was his adventure real or a dream? Viewers differ on the interpretation of the clues offered. Cynics argue it doesn't matter for either way the whole thing is a fairy tale. Well, reconsider the paradox of doubting Thomas. At the end of the day, even he was alone holding only memories of the hands he touched. Had he merely imagined the event? As with the train ticket or my bus driver, you hang onto the mystery of what happened, believing when others doubt. You may even believe the story of Thomas.I recall the words of the eminent author Ayn Rand, \"When people look back at their childhood or youth, their wistfulness comes from the memory, not of what their lives had been in those years, but of what life had then promised to be. The expectation of some undefinable splendor, of the unusual, the exciting, the great, is an attribute of youth - and the process of aging is the process of that expectation's gradual extinction.\"Do yourself a favor. Step aboard The Polar Express. You'll travel back when you were young and innocent, revisiting the hopes and dreams you have since abandoned. The intensity of your restored faith may prove overwhelming and you may weep as other grownups in theaters have. The movie posters truthfully advertise, \"This holiday season... believe\".",
    "31": "\"The Polar Express \" was an awful movie. What makes this movie worst is the hypocrisy to present itself as a innocent,s sugary and harmless tale for children about the \"true \" meaning of Christmas. I never read the book of Chris Van Allsburg in what it was inspired, but the most disappointing is that it was directed by Robert Zemeckis, the same director who made the great animated film \"Who Framed Roger Rabbit?\", an excellent movie where he proved that the animation could be appreciated for kids and adults as well, while in this movie it seems that he was victim of his own ambition and he give too much importance to give the characters impressive level of detail and \"realism\" rather than a interesting story. Everything from this movie seems to be so artificial and lifeless:Despite the \"realistic\" appearance of the characters, they look more like creepy mannequins with eyes made of glass rather than living beings.But the worst part of \"The Polar Express\" is the \"message\" in this movie, which is just vile. For example, in one scene, where one kid refuses to enter into the Polar Express, the character that looks like Tom Hanks makes a gesture like saying \"you are stupid for not accepting my offering \". There is also the scene where the diversity token girl says something like the toys were so \"warm \" and things like that. All the movie the kids keep talking about how big would be the gifts that Santa would give to them . There is even a song about that.Filled with lots of irrelevant scenes and annoying characters (Not to mention the horrible songs) the movie ends with the main character finally discovering the \"true\" meaning of Christmas (Or whatever): Guess what it is? The gifts! it is true that many Christmas movies have hidden subtexts and messages like that ,but \"The Polar Express \" it's completely shameless about celebrating materialism and greed.I don't think that \"The Polar Express\" were a very appropriate film for the kids,because if is that what the kids would learn, I don't want to think how would be our future.",
    "32": "I'm a huge fan of Chris Van Allsburg, and especially his book, \"Polar Express.\" I love Tom Hanks.I really wanted to like this movie ...Reviewers said that the motion capture technique resulted in freakishly animatronic looking characters. At first that aspect of the film did bug me, but I did get used to it.But ... I really didn't like this movie. It was too dark, and it wasn't dark because it had a few scary moments; there's more to it than that.First, what's good. \"Polar Express\" contains some stunningly lovely and/or remarkable scenes. The words on a page are seen from below the page, as if the page were transparent; wolves and eagles follow a slip of paper as it is blown about by the wind; Frank Sinatra and Bing Crosby Christmas hits play in a North Pole toy factory.All very worth seeing, worth, perhaps, the price of admission for hardcore film fans.But the movie was simply too dark and too PC for me. And it reaches too far.The PC aspect of the movie is an insertion that doesn't exist in the book. The main character is provided with a companion, an African American girl.The animatronic look of the motion capture character is unpleasantly emphasized by the animatronic characterization of this girl. The script bends over backward to make her purely good, cool, and admirable, with no negative qualities, and that effort is obvious and alienating.American audiences are grown up enough that we can accept a flawed -- i.e., human -- African American character. We don't really need a cartoon version of the character Sidney Poitier played in \"Guess Who's Coming to Dinner.\" There is a Poor White Boy character added, as well. Whoever wrote this character has no idea what it is to be poor, and treats this character with zero respect, and a great deal of condescension. The \"lesson\" this poor boy is meant to learn at the end will have self respecting poor people gagging.Finally, the movie was just too dark, with none of the redemption richer movies have been able to offer. There are scenes of perilous efforts to walk atop a moving train during a snow storm, and scenes of vulnerable children trying to cross a dangerous bridge.\"Wizard of Oz\" and other classics contain similarly scary scenes, but those films also offer deep and moving scenes of genuine empowerment and redemption. I missed such redemptive, powerful scenes in \"Polar Express.\" This film will have its audience for whom it works perfectly. It does offer scenes as stark and striking as anything from German Expressionism.What I missed were the warmth, the depth, the heart of the best of \"Wizard of Oz\" or \"The Little Princess\" ... or the Chris Van Allsburg book, \"The Polar Express.\"",
    "33": "This is understandably a great Christmas movie for kids, but the adults may get bored with it. It does star Tom Hanks, which is a draw for the audience, and he does good voice-over work. The story is about a magical train, which does interest most children and adults alike, since most of us adore trains, especially at Christmas.The animation in the film is very nicely done, in fact, it looks very similar to the art in the book of the same name. \"The Polar Express\" is a neoclassical Christmas tradition that will join the ranks with Frosty and Rudolph sooner than we think. This year, it is set to be broadcast on television for the first time, and most likely not the last.I gave the film a 9 out of 10.",
    "34": "For the first 10 minutes this film is a delight. The filmmakers and animators must have worked themselves into a frazzle to get this amount of detail and style into the film - the human characters look as if they were both rotoscoped AND computer animated, and all the inanimate or inorganic elements of the film - the landscapes, the houses, the trees, the Polar Express itself - are dazzling. If the movie had been a 22 minute 'short' (a la \"Merry Christmas, Charlie Brown\"), it would have been one of the all time classics of Christmas animation. Unfortunately, Zemeckis and company felt they needed to expand \"Polar Express\" into a feature length movie, and the source material can't hold up to the extended length.Face it, one of the great strengths of the children's book this movie adapts is the brevity and economy of its literary style - supplemented by evocative fantasy visuals that augment, not replace, the poetic resonance of the carefully chosen words. But here, the writers have to add extra plot elements, characters and dialog to the basic 'text' to extend it to feature length, and they just don't have the ability to triple the content while maintaining the magic of the original source. It's as if the Hallmark Card composers tried to expand on the works of Robert Frost - they can ape the style, but they can't get the resonance or the heart. It's well meant and agreeable, but it somehow misses the point.It's also got Eddie Deezen doing one of the voices, which is always a minus for me. Deezen is still doing voice work after 20+ years in the business, so someone must like him, but all I can say for him is that he must be dependable and reliable...because he turns in his usual sinkhole of nasal suck. Sorry Eddie, I know you need the work, and it's nothing personal, but I hate you as an actor.Tom Hanks, on the other hand, is his usual splendid self, and it's largely due to his efforts that I can enjoy the thinned out content of the various over-extended sequences. He puts so much warmth and dry humor into the various characters he voices that it almost gets this film over...if not for him, I would rate this film much lower.Another problem: after a while, it is apparent that the animators are running out of ideas. For instance, they use a reverse 'zoom' pull back crane shot shot - that pulls back from a crowd to show the spectacle of hundreds of figures from an eagle eye view - way too much. It was sensational when it was used for the first time in \"Gone With The Wind\", and it's great here the first time they use it, but after a while, you can tell they're doing it again and again because they don't know what else to do. And there are a lot of musical numbers and dance scenes (a la \"Shrek\") that work fine at first, but really don't add anything to the story or the atmosphere. My favorite - the \"Hot Chocolate\" scene - is typical; it's light hearted and kind of clever, but Disney and Pixar do this kind of thing much better, and they integrate the musical numbers into the plot better. And I hate to say it, but sometimes the art direction slips a bit and the gloriously life-like faces of the children and the train crew alarmingly devolve into the death-masks of soulless zombies. (This happens all the time in the cut-scenes for video-games). This is the peril of making computer animation as 'realistic' as possible - if every aspect of the production is not dead on, humans will look like the walking dead. This may be inevitable when you're doing a feature length animation , even when you are budgeted for 'state of the art', but it really detracts from the charm and sentimentality the movie is trying to instill.I only rate this as a \"6\", but it's a STRONG \"6\", and there is enough to enjoy about this movie (especially the railway travel and boarding sequences of the Express itself) that I will gladly watch it again with any 8 year olds in the TV room who insist on seeing it during Christmas vacation. And there are times when the visuals are gorgeous enough to make an adult 'BELIEVE' again, if only for a second.",
    "35": "When we watched this wonderful movie, we absolutely forgot where we were. The minute it starts, it gets your attention and keeps it until the very end. You enter a truly magical world.We don't celebrate Christmas, but after seeing some trailers with the chocolate being served on the train (very funny and cleverly done!) I became so curious about this movie, and even more so because I am a huge Tom Hanks fan. I just had to see it. Any film Tom Hanks is in, is great and this one is no exception.So when we sat down, I already expected this to be good, but I could never have imagined how wonderful this one and half hour journey would be! From the start to finish, everything is perfect. I didn't mind the facial expressions at all, or lack of them. The rest of the movie makes up for that minor glitch.I must say, the part in the end where Santa uses his whip to take off, well that whip reminded me of the one the Balrog had in the Fellowship of the Ring, lol! And the engineer was very funny, the children just laughed so hard when the beard was pulled of the assistant of the engineer and his scream actually became a communication with the deers blocking the railway! There is so much in this movie, comedy, sorrow, disappointment, happiness, relieve, suspense. In the end, you are left with a warm and satisfied feeling. And that's what a family movie should provide.",
    "36": "I have a small collection of Christmas movies that I can watch every year without getting bored of, and this is one of them. I love the story and the animation is just beautiful.'The Polar Express' captures the Christmas spirit as well as any Christmas film I have seen. It has a truly magical feel about it and provides endless festive adventure and excitement. The attention to detail is very impressive, so much so that it's hard to believe this film is over 10 years old.I would consider 'The Polar Express' one of my favourite Christmas movies and one that I always look forward to putting on over the festive period.",
    "37": "It is such a departure from Hanks' normal stuff, a classic of my childhood, my school would show it to us every year. The first Tom Hanks film I ever saw, though at the time I didn't know who Tom Hanks was!Definitely recommend to people with young children, or people who saw it long ago, the nostalgia is quite something.I didn't do it. I didn't do it. I didn't do it.That was a classic line people repeated again and again back in the golden years of my childhood!",
    "38": "The Polar Express delivered me all the way back to childhood and my own faith in Santa Claus at the age of five. I could not only hear the bells, I could see his sleigh in the night sky. Chris Van Allsburg is to be commended for writing an excellent fantasy and Tom Hanks for conducting the wonder tour to beat them all. The special effects are just outstanding, the story line credible and heartwarming. The characters are believable and utterly charming. The children depicted are our own. I would recommend this film to any and all who love Christmas and remember what it is to believe. The experience of watching makes you a participant, breathless to see what comes next. I can hardly wait to view it on IMAX and am taking my entire family, including seven grandchildren to the Tulsa Cinemark this season. Let's hope we see more of this quality venue in months and years to come.",
    "39": "This is one of the better Christmas movies I have seen lately. This is much better than the last one I saw, Four Christmases. I probably like this more because this is animated, features Tom Hanks, and great music is played. I loved the music for the film.This is about a hero boy who does not believe in Santa Claus. One night, The Polar Express arrives at the boy's house. When he enters the train, him and other kids are about to have fun adventures heading to the North Pole.The animation is very good. I liked how everything seemed almost believable. My favorite character is the hobo, he seems to make the hero boy feel bad about himself.As I said before, I loved the songs. I especially liked Josh Grobans, \"Believe\" Overall, this is a great Christmas classic with a great message. I rate this film 9/10.",
    "40": "People rave about this film, and despite me hoping to be able to join in the positivity I can't.I didn't like the film, and found the technology used to create the characters a bit creepy.It won't join my list of festive favourites sadly.",
    "41": "This movie is a very good movie for all ages! Whenever the Polar Express is on I watch or at least try to watch it. I always wait until the commercial to do anything that includes leaving the view of the television screen. Pretty much everybody in my family loves this movie and this is a very hard thing to happen because all of the ages in my family vary so if you have kids or if you are a kid I would say this is a very good movie for you. Whenever I see this movie I laugh a lot! The whole point of this review is that I am saying, you should most definitely see this movie, no matter if you are a kid or have kids this will be a wonderful movie for you to see!!",
    "42": "In these times, what an awesome movie to watch. Just got it in Blu-Ray and its stunning. Not just the visuals, but the story makes you want to believe in Santa again. Dont compare it to the book...its breathtaking !!",
    "43": "Many years ago we opened a Christmas present for my daughter (now out on her own) sent from my brother and sister-in-law who lived 1500 miles away. The box contained a book, The Polar Express, and a sleigh bell. I'd never heard the story, and I remember looking at the book and the bell and wondering what they were about. I probably got more out of reading The Polar Express than my daughter did at the time. When the movie came out I made the mistake of reading reviews and put off seeing it. When I did get around to a view I was pleasantly surprised. The dark aspect critics panned to me reflected magical nights in decades past, looking out my bedroom window at snow falling in the street lamplight with that sense of awe, appreciation of beauty and security that only a child can have. While The Polar Express isn't what I would have made of the book it does have for me that dreamy sense of glory and anticipation that is the mark of childhood and what I most miss of those days. Well worth seeing, in my opinion.",
    "44": "I grew up on this movie and it's always been a great movie. The animation is great for an old CRT TV of the time, but it does look a little creepy on modern panels. I really think people just like to find things to hate. Great movie, would recommend.",
    "45": "\"The Polar Express\" is often more than a little strange but in a good way. It does a great job creating a different world. It's strange world that is totally believable. The characters all look a little weird but they fit in just fine. It's a beautiful movie to look at. I wish I could see this movie again in 3d. That's the way I saw it when it first came out. \"The Polar Express\" has a lot of great moments but my favorite is when all of the elves gather for Santa's flight. It's so much fun to watch. \"The Polar Express\" does a great job leaching us to believe. It can flip back any of us on the fence.",
    "46": "A wonderful film to be recommended to all who can see beyond their on small lives and maybe still see the childhood wonder that they once had as a child. The makers chose to render the film very close to the original art work in the hardcover children's book. An interesting approach. I am stunned at the amount of comments here who really did not get the point of the film. I guess you hear the bell, or even remember what it was like at one time to hear it or you don't, but the amount of ridiculous hate reviews here on this site is ridiculous. I wonder If the times we live in have started to breed the wonder and joy of the imagination out of us all. sad. what did one person write? \" we all know that trains don't go down the middle of the street\" wow, what a sad state the world is in. see the film for yourself, a film where not everything is spelled out 100 % and it lets your imagination soar.",
    "47": "It's imaginative. The characters have some personalities and interests. An unique take on Christmas with groundbreaking motion capture animation and an emotional story, but the animation on the humans hasn't aged well and the script is uninspired.",
    "48": "When this first came out in 2004, it was considered to be cutting edge, innovative technology but to a modern audience it looks rather plastic and artificial. What we now know as motion capture animation was then called performance capture. I remember seeing this for the first time and it was a wild ride of animation. Perhaps, because of Tom Hanks performance in multiple roles or the story of a young boy's restoration of belief in the magic of Christmas, it is still a perennial favourite, POLAR EXPRESS is still delighting audiences of all ages. I give this film a 7 (good) out of 10. {Seasonal Family Animation}",
    "49": "Transparently forced Christmas \"magic\" that can't even lean on its CG visuals for support. Despite the wide variety of gaudy, jolly ghosts, elves and Christmas nicknacks flittering about the screen, this movie has no spirit, no zeal, no life. It sure goes through the motions, producing overly-familiar shapes, sounds and colors by the shovelful, but that never translates to more real emotion than the pajama section of a Sears catalog. It's mostly a one-man show, with Tom Hanks providing voices for a good ninety percent of the cast, but he's unable to work any holiday miracles with such flat source material. The wealth of bad, empty computer graphics do the film no favors, either, somehow managing to bridge the gap between hollow marionettes and the unnerving denizens of the uncanny valley. A desperate effort to join the endless parade of holiday classics, it's a noble-minded (but incompetent) talent flush.",
    "50": "Come on, guys. This film was made at a time when these visuals were still groundbreaking. Don't complain now that they were not as far along then as they are today. Thanks to pioneering work like The Polar Express, filmmakers can now create even more beautiful things. A lack of historical perspective is a major shortcoming for the contemporary viewer... And yes, it is always a joy to watch Tom Hanks, whichever movie he's in. Now and back then.",
    "51": "Kind of charming but also kind of creepy as a kid's Christmas movie. Tom Hanks plays multiple characters. The motion capture animation has a really unique style to it and was the first totally mocap feature film, but the CGI also aged pretty poorly and it looks really unsettling. Some of the facial expressions look really poor like I'm watching a cutscene from a PS3 video game. It didn't really have a theme like most kid's movies do except \"believe in Santa Clause\" which I guess is cute for the holiday season but part of me feels like this is a real lousy message to be sending to children.I remember this movie from when I was a kid and I honestly don't think this holds up nearly as well as some of the other Christmas mainstays. You'll probably catch it on TV during the month of December, it's more of an atmosphere movie and I guess the best compliment I can give it is the sound is really good? It was nominated for a couple of Oscars in the sound categories. Good to put on in the background at a Christmas party.",
    "52": "This movie is 16 years old, and maybe its just me, but i kind of feel like the animation still holds up... Maybe its just the nostalgia lolI really love this movie, to me it perfectly encapsulates the magical feeling of early childhood Christmas memories.\nThis movie gushes warmth and Christmas magic, and i cant help but eat it up! There is absolutely nothing wrong with this movie. How dare it have a 6.6",
    "53": "One of my favorites. Not for technical performance, not for travel, message, amazing Tom Hanks or magnificent train but for Santa bell. As seed of memories and young soul As piece of lost milk glass and few cookies. As cold air of night in Christmas Eve. It is difficult to define it. A good film is an empty word. Masterpiece is exaggeration. Nice is warm but fake. Moralistic - if it is for children. But the adults needs of it. Impressive - OK. But the taste of crumbs after its end say more. A experience ? Off course! But, in fact, only a seed. Behind Christmas spirit or age. Behind definitions and verdicts. Behind opinions. Seed of a reality. Deep, large and powerful. Our reality.",
    "54": "'The Polar Express' is listed in the Guinness Book of Records for being the first all-digital capture film. The animation is awesome, but admittedly due to live action motion capture animation, so not entirely animated. I enjoy watching this film every year around Christmas time, as this is a real feel-good, high-spirited film. I love the characters and the storyline, and there are indeed a number of lessons to be learnt here. For most grown-ups, I suppose, the Christmas bell does not ring around Christmas time anymore, as before.",
    "55": "This film is simply outstanding. Surprises everywhere.One criticism: There was scant (if any) product placement, certainly not the norm in films nowadays and a fact for which I was grateful. But then right at the end I got smacked in the head with Steven Tyler, of all people. It was a very odd sensation, as if he walked into my bedroom during an intimate moment. If not for such a wonderfully buoyant story, it may have popped the warm and fuzzy bubble.I've always wondered how Santa did it, although I never expected the elves to be quite so small. I liked the caribou, they seemed very friendly.'Loved the hobo.Merry Christmas.",
    "56": "\"One thing about trains: it doesn't matter where they're going. What matters is deciding to get on\" quotes the Conductor (Voice & Motion Capture Performance from Tom Hanks). I'm sorry to say this, but I can't get aboard with this 3D CGI animation kid's movie, about a young unnamed boy (Voice by Daryl Sabara, but motion capture performance also done by Tom Hanks), having to travel to the North Pole, in order to renewed his faith in Santa Claus (Also voice and motion capture performance by Tom Hanks). The disbelief story felt a little too manipulative & force. After all, that part of the story was too extreme, it didn't match the levels of the children book of the same name by author, Chris Van Allsburg, which also happens to be the source material for this film. It's really does seem like that part of the movie, was made for some evangelical religious convicting agenda, rather than fans of the book. For example, there is a lot of padding scenes, in the movie, where a ghost (once again voice and motion capture performance by Tom Hanks) scares and shames the mostly innocent young boy into believing in Golly St. Nick; as if he was Ebenezer Scrooge, a squeezing, wrenching, grasping, scraping, clutching, covetous old moneylender from Charles Dicken's 'Christmas Carol', rather than a child who just thinking straight & coming to age. Who says, not being too naive & gullibly is a bad thing? After all, isn't teaching our children to be smart, better then, teaching them to go blindly into the night with strangers. How is that wrong!? Going with conviction, without asking any questions, is how cults are built. Even if this movie wasn't made to brain wash, anybody, the bright light god-like appearance of the Kris Kringle later in the film giving out the bell as if its first communion, doesn't help, swag the argument away. Instead, it brings the issue, even closer. It's pretty clear, by all the religious overtones, that this movie is in-fact, a faith-based movie, hidden under a capture the holiday spirit, type of vibe. Anybody that says otherwise, is truly blinded by the smoke & mirrors. It's not a Christmas movie. It's a 'Christ'-mas film. In the end, it's still highly exploited. Very unbalanced. Not only that, but the movie has way too much 3D gimmick rollercoaster style actions scenes like the Glacier Gulch sequence, that goes against, everything that Chris Van Allsburg was trying to say, in his calm, relaxing storyline of the book. The film wasn't as slow & whimsical, as it should had been, because of that. Added to that, was the amount of action sequences that was totally pointlessness. Honestly, you can cut away all of the scenes where the child struggles to find, another child, train ticket, with the ghost on the roof; you would still end up in the same place in the end. It doesn't affecting the story significantly. All of this padding, really hurts, the pacing. Its leaves too many plot-holes, such as why the conductor walk over the roof of the train instead of just walking through the train to get to the engine room or what happen to the dancing hot-chocolate waiters? In the end, the 32 pages book that can be read in less than 10 minutes, should had never been made into a full-length 100 minutes movie. It leaves too many unanswered questions. Instead, 'Polar Express' should had work better, as a short animation film. Don't get me wrong, I give the filmmakers for taking a risk, in providing the world, the first live action motion capture animation & doing a good job in the background to preserve the look of Allsburg's lovely oil pastels illustrations from the book. However, I thought, the movie would had work better with the same hand-drawn animation that 1982's short film 'the Snowman' or 2006's short movie 'Little Match Girl' had. Better yet, go live-action. Why, because this movie has fallen in the subconscious effect called the Uncanny Valley. The exaggerated caricatures of human beings in this film is highly creepy. It just doesn't look right. Sadly, director, Robert Zemeckis didn't get the memo as he would directed, two more films with that style, 2007's 'Beowulf' & 2009's 'Christmas Carol'. As for the voice acting, it was mostly alright; yet again, I can do without Tom Hanks's voicing the ghost hobo, as well, as Santa Claus. It was very jarring to see him, do multiply roles and they were way too hammy. Another character's voice that should had been cut, was the know-It-All kid (Voice by Eddie Deezen & Motion Capture by Jimmy Pinchak). His voice got a little too annoying, toward the end. As for the music. I love composer, Alan Silvestri's theme for the film, even if its suite sounds too similar to Danny Elfman's Ice Dance theme to 1991's 'Edward Scissorhand'. As for the songs; it just didn't work with me. The 'Hot Chocolate' number was an awful lazy written song with annoying repetitive lyrics and jazzy hook that comes out of nowhere. Then, there is 'When Christmas Comes to Town', a ballad duet that sounds really generic. It's highly forgettable, along with Josh Groban's 'Believe' that sounds too much of a guy reading the spoilers than singing. The only song, I kinda like, was the 'Polar Express' theme. The tune was catchy. As for the covers of classic Christmas songs. It was nice to hear them, nevertheless, I can do, without 'Rockin' on the Top of the World'; it was lackluster, and doesn't match, with the theme of timelessness. Plus, seeing Aerosmith's Steven Tyler as an elf was awkward as hell. In the end, this movie just doesn't capture the same magic of Caldecott Award winning book. It was just disappointing. Because of that, I can't recommended seeing this film. Just, check out the book, instead. Now's that worth, getting onboard for.",
    "57": "THE POLAR EXPRESS is a delightful holiday film that is a sight to behold. Robert Zemeckis directs and Tom Hanks stars in this sure-to-be-classic filmed in a technique called performance-capture animation based on real actors. A young boy finds it hard to sleep on Christmas Eve for he doesn't want to miss hearing the bells on Santa's sleigh. Right before midnight there is a thunderous roar. The sound is coming from a magnificent, magical train that is bound for the North Pole and Santa's house. Dancing waiters serving hot chocolate and a conductor(Tom Hanks), who wants the children on board to enjoy themselves, but also wants the Polar Express to stay on time. My favorite scene is the sequence where the big yellow ticket flies out of the train and returns. Hanks plays six characters and even sings. Others of note in the cast: Eddie Deezen, Peter Scolari, Nora Gaye and Leslie Zemeckis. Besides Hanks, the soundtrack features holiday tunes by Frank Sinatra, Bing Crosby, Kate Smith and the Andrews Sisters. This movie will be one of those you'll want to watch every Christmas.",
    "58": "This animated feature tells the story of a young boy whose scepticism about the existence of Father Christmas is magically restored when he is whisked off to the North Pole on the titular train of the title. Robert Zemeckis (Back to the Future trilogy/Who Framed Roger Rabbit) directs and it's a marvel of technical accomplishments. Using the Performance Capture technique, the characters sit somewhere in a purgatory where half human and half animation dwells, this is unusual and as amazing as it is at times, the children often look, well, kinda creepy! But it's the story that sells the movie, and as long as you don't mind heavy lashings of syrup in your Xmas movies, then this shouldn't disappoint. 6/10",
    "59": "Too scary to be a kids movie. Has weird musical moments. I'm sure the computer generated graphics were cutting edge in 2004 - but they did not age well. There was a lot of \"no such thing as Santa\" talk that I was not prepared for.",
    "60": "I don't know what it is about this movie, but I have to watch it Christmas Eve. Yes the animation is a little weird, early days of mo-cap is like that. But this movie is like a warm hug. It makes me smile. It's a magical Christmas journey that we all wish could have taken when we were kids. I love the pacing of this movie too, it just glides through at the right pace accompanied by a beautiful soundtrack. It makes me feel like a kid again. To me, it almost perfect.",
    "61": "The animation may not hold up quite as well 15 years later, but this one still has a lot of heart and magic behind it to make it stay in the Christmas rotation.",
    "62": "LeTs BEGIN: movie starts out with T hanks in the shower, and then the screen splits into smaller screens of tom hanks in the shower as the movie goes on. Until thousands of mini screens are shown and form the design of a wilted rose at Denny's (restaurant) on your screen. The movie lasts 75 hours (1 watch).",
    "63": "Robert Zemeckis is a film director always on the forefront of cutting edge technology. He started this trend way back in 1985 with Back to the Future. It was a film that was not merely a special effects vehicle, but a decent story of equal heart and humour. Zemeckis expanded upon this in 1988 with Who Framed Roger Rabbit, one of the first films to combine live-action with animation. And now with The Polar Express, Zemeckis takes the animated world to new heights, using revolutionary CGI effects with a new type of technology, motion-capture, to create a magical Christmas fantasy.Based on Chris Van Allsburg's short story, a young boy at Christmas is at the age when the existence of Father Christmas is in question. This boy is never named but it is his journey of self-discovery and enlightenment we are invited to observe. On Christmas Eve, a steam train appears outside the boy's house. A conductor invites him on board the Polar Express, a train bound for the North Pole.So begins our journey, and it's anything but straightforward. Perilous mountains, slippery ice-rinks, lost tickets, and crises of faith are all intertwined on board the Polar Express.The Polar Express has come in for a fair bit of criticism because of the effects used to create this film. Motion-capture is a process where real actors are required to act in front of a blue-screen while their bodies are covered in special dots to acutely mimic human behaviour. And although it doesn't always translate well to the film, it still creates a quite dazzling and beautiful motion picture.Some of the facial expressions on the characters are so eerily precise that it creates an otherworldly feeling. Something the filmmakers were probably trying to achieve. Although you can't escape the fact that there is an ever-present deadness to the characters eyes that doesn't quite sparkle with life, I suppose it's something you could get used to. But it still feels a little unnerving. The technology hasn't quite got there, but whether it can completely mimic human behaviour remains to be seen.If the effects can't quite encompass human emotion, it more than makes up for that in the set design. The Polar Express is a really quite lovely film to watch. There are marvellous little details throughout. From tiny things like the frost on the train windows, clearly defined shadows, human perspiration and freckles to grand sights such as the North Pole that appears as a magnificent city. It all quite takes one aback.Tom Hanks, who's worked with Zemeckis in the past, gets to play six different characters. The boy (but voiced by someone else), the conductor, a ghostly hobo who lives on top of the train, Father Christmas, a Scrooge puppet, and the boy's Dad.I don't think it was really that necessary for Hanks to play so many parts. In fact of the six, I only liked two. The conductor, where Hanks seems the most comfortable, and the hobo where Hanks adopts a gruffer voice.The conductor is a likable character who is so insistent the train reaches it's destination. The only bad scene for this character was a really awful music number involving break dancing espresso waiters. It's a scene not helped by Hanks' dreadful singing voice. The hobo is an interesting character because he's such a mystery. He helps to restore the boy's faith in the spirit of Christmas. He also reminds me of the Cheshire Cat from Alice in Wonderland, vanishing into thin air, but leaving certain body parts behind.But I didn't enjoy Hanks' interpretation of Father Christmas. For one thing this St Nick is anything but jolly, and is played with a considerable solemnity by Hanks that verges on the bored. The fact that the animation renders Father Christmas so flat to look at doesn't help either.The Polar Express is an admittedly episodic film. Because the source material is so thin, the filmmakers have had to stretch things out and create obstacles along the way. From derailments, caribou on the track and emergency brakes, I suppose the structure is unavoidable. But it does provide some exhilarating sequences like the roller-coaster ride through the mountains that made me feel like I was there.The children on the train are quite well defined too. The boy who doesn't believe anymore, the lonely boy, capable girl and know-it-all. They all add something, and make the journey seem not as long. The music from Alan Silvestri helps things chug along too, with a quite nice duet from the lonely boy and capable girl.The Polar Express has a lot of nice touches that even extends to the end credits with a gentle snowfall in the background. Whether or not this film will become a perennial Christmas favourite remains to be seen, but it tells a nice story about faith, and sends the message that maybe it's not the destination that's important. But the journey.",
    "64": "You don't know what do you know I am a CGI specialist, worked with it before, and when this movie came out, I was completely blown away. I never thought anything like this would ever be released to the public before in this movie the Polar express was the first one to do it, and do get me started with the movie. It is excellent look at the casting, and the graphics, and animation are great, and the movie takes you on a magical train ride through the north pole on the polar express! The way the hair was done was excellent, and the colouring was spot on, and every little detail was great! Watching this movie in 4K made it feel alive as well.9.5/10 >>> 10/10 (rounded up). Thanks for reading.",
    "65": "My favorite Christmas movie next to Elf, and the best animation next to the Incredibles. This movie makes me glad there is Christmas, and it makes me forget Christmas with the Kranks. This movie begins on Christmas eve night, as a young boy lies awake in bed eagerly waiting for Santa Claus to come, but a surprise comes by in a form of a train called the Polar Express, that will take him and a bunch of other kids to the North Pole to meet Santa. And the trip begins a night where anything can happen. This movie makes me and others feel that Christmas will never end. Tom Hanks was great as the voice of most of the characters. I can't wait till this comes out on DVD.",
    "66": "As great as I remembered! The songs, the animation. I BELIEVE this is a great movie.",
    "67": "Nor is it amazing. Not even the animation. You'll see better 3D animation on computer games several years old and better acting by the South Park characters.The same goes for the soundtrack. It rarely fits, and when it does, it isn't original.As to the acting, the part you'd think they'd correct and supplement with the animation, it is the worst part. Hanks must have felt he could just wake up and show up. As for the kids, they are no hope. About the only bright spots are the train helpers and elves.As to the story in general, it is unbelievable. This isn't a problem for fantasy in general, but given that this is an animation trying to replicate and recreate reality, it completely ruins the film, making it boring and more difficult to watch than a grade-school play.",
    "68": "Robert Zemeckis' 2004 animated fantasy features the voices of Tom Hanks and Daryl Sabara based on the book. It focuses on a young boy (Sabara) who doesn't seem to believe in Santa Claus. On Christmas Eve, he finds himself on a magical journey when he boards an express train with other children heading to the North Pole which may help change his mind. Hanks (Forrest Gump) is great as usual, he provides the facial expressions of the boy and voices of 5 other characters. There's also nice visuals, a good score and Josh Groban's song, \"Believe\" is also great. I recommend this good holiday fantasy that will make you believe.",
    "69": "It's Christmas time and I thought it was a good idea to watch a film that's considered a Christmas classic. The Polar Express does have some of that warm Christmas feeling because of the character journeys, and the wintery setting. The story was slight so the film was about the obstacles the characters face that could prevent them from visiting the North Pole and seeing Santa.The elephant in the room was the special effects. This was made when motion capture was becoming more popular and Robert Zemeckis was becoming obsessed with the technology. He tried to push the technology by going for a photo-realistic look. Unfortunately the images are dated and the film was deep in the uncanny valley. The facial and physical movements made the film seem like it was a video game cut scene. I don't know why the film didn't use live-action characters and use special effects for the set pieces like the train crossing the frozen lake.",
    "70": "not only for technique solution but for the story itself. for that delicate flavor of childhood who has, in this case, the perfect form. because it is a refreshing Christmas movie who remands the tension , the expectation, the joy of generation by generation. and who gives few smart answers to old questions. a film who translate the spirit of Christmas in a seductive manner. and that fact, more than the name of director or the amazing images are the cause to remind it as a kind of experience. because the taste of adventure it is its mark. an adventure who preserves the colors of fairy tales and the magic of an unique age. so, a splendid Zemeckis. and one of the films who reminds more than propose a key to discover the force and the miracles of a precious holiday.",
    "71": "There has been not one year, in which I haven't watched this movie on Christmas, frequently (almost always) with my family and beloved people!",
    "72": "The Polar Express really brings the holiday season magic to life. Just the visuals alone are fantastic enough to make anyone feel in the Christmas mood. I love the story, it's every child's ultimate dream on Christmas Eve. The writing is good enough, I will say that it's not quite as good as some better animated movies, but it does the job. The songs are very festive and enjoyable too, almost all being sung by children aboard the train. The characters are interesting and each one different and unique in their own way. And Tom Hanks was a great pick to voice the conductor, Santa, Dad, and the homeless man. If that isn't the most roles ever given to one before..... lol. I will say that some of the middle part of the film does tend to drag a bit, but overall it is a good well constructed movie surrounding the holiday season dreams of millions of children across the globe. If you have younger children in your family then I definitely suggest watching around Christmas time. It comes on television a good bit around then anyways. It's fun, magical, and visually breathtaking. 7/10 for The Polar Express.",
    "73": "As a kid,I believed in Santa Claus,and that he lived at the North Pole,he ran a workshop where toys were made by elves,and that he delivered those toys on a sleigh pulled by eight tiny reindeer..I believed it all,not unlike any other kid.This film sent me into a dream like state,where I am that kid from long ago,and in this dream,I was a quiet little passenger,an up close observer of all that was transpiring,and at the end,when it was all said and done,I awakened from that dream.Thank you to all who made this film and brought forth that kid me who stays hidden all too often.This movie is a Christmas treasure.",
    "74": "The crummy PC story (changed substantially from the original book) is bad enough, but the characters are so creepy-looking in the \"semi-animation\" that I can't stand to watch them for more than a few minutes at a time. This movie is genuinely scary and I can't believe that there aren't quite a few kids who have been having nightmares that are populated by these...whatever they're supposed to be. Thankfully, this movie has not started a trend in this direction and I'm spared having to watch a remake of \"Charlotte's Web, as acted by the patient population of the Home for the Criminally Zombified\".An experiment with a bad animation technique that turned out only slightly better than it deserved.Watch \"A Christmas Story\" Instead.",
    "75": "I watched this movie as a kid probably 100+ times, I will never forget this movie, it is an elegant masterpiece filled with an amazing story. This movie makes me feel a way no other movie has made me feel, it is the perfect Christmas movie and honestly I even like watching it any other time as well, the music in this is absolutely perfect, bravo to the composer. I could go on and on about how ahead of its time this movie was in almost every way, the animation was absurdly well done, besides some scenes where the characters eyes look a bit lifeless, the ups of the movie are way ahead of the downs, and there are barely any downs in the first place, perfect movie 10/10.",
    "76": "I remember reading this book or it being read to me as a child, and thinking how magical it was. To me, the Polar Express was the predecessor to the Hogwarts Express.I then saw this in IMAX 3D, which was one of, if not the first movie I saw in 3D. And this is one of the few in my opinion where 3D actually enhances the movie. There are a few scenes in particular that are visually jaw dropping or simply thrilling.It delivers on the Christmas feels with the train, North Pole, and Santa's speech and presence. Tom Hanks does an incredible job voicing several characters. The film would not be even close to what it is without Hanks, that being a certified Christmas classic.",
    "77": "A young boy is losing his faith on Santa Claus. On Christmas Eve, he boards a magical train to the North Pole with other children and has a magical adventure in the land of Santa Claus.I was quite anxious to see \"The Polar Express\", which was nominated for three Oscars, and has another three wins and twelve nominations. The animation is really very beautiful, but although being a fan of animations and cartoons, I found the infantile story highly indicated for children and Christmas lovers only. I myself was very bored after 60 minutes running time. My vote is five.Title (Brazil): \"O Expresso Polar\" (\"The Polar Express\")",
    "78": "Really surprised that WB has not made a 4K Version of this film. It would be gorgeous plus the sound would be amazing if they made a Dolby Atmos track of the film. Just really surprised at this point! Coming soon on Warner Bros 4k ultra hd release November.",
    "79": "I have avoided this movie for so long - I don't know why. So I sat down and watched it on the Disney Channel this past weekend.By the time the train finally arrived at the North Pole I was so excited to see Santa Clause I couldn't handle myself.It was well worth the wait.And I like the way Santa was bigger and taller than everyone there. That's the way he should be presented. Santa is much bigger and taller than you could ever imagine. Of course, he was taller than the elves, but also the adults at the North Pole.He had that commanding voice and spirit in his face. You just felt the love and happiness.It's funny, I'm over 40 and I still hear the bells. Do you?.................See this movie and you too might hear the bells again.",
    "80": "For the nth time watching every Christmas season, it still gets me. Wonderful story.",
    "81": "Not sure why the ratings are low. This will be a classic. One that's worth watching every year.",
    "82": "I just watched this with my kids last night. I'm sorry, but I just can't square this Santa and North Pole with a standard like that of \"Rudolph The Red-Nosed Reindeer.\" In \"Rudolph\" it was full of love and humor, forgiveness and humility. This Polar Express version is dark, authoritarian, and punitive. I also can't believe it earned a \"G\" rating with so much excessive danger and stressful suspense (train on the ice, Christmas star nearly killing an elf, etc) - my three-year old got scared and had to turn her head six times! How awful! (She kept coming back because her 6-year old brother was still watching.)In \"Polar Express\" the conductor, Santa and the elves are humorless and of a \"law and order\" mentality that is prim and schoolmarmish - this is Christmas Eve, guys! Loosen up! And what is with Santa, anyway? He clearly has a messianic complex that is fed by the uniformed cheers of thousands of sycophantic elves at the Nazi rally - er, midnight takeoff of the sleigh - when he makes his appearance. And when Santa confronts the kid who picks up the lost reindeer bell, why so impolite? The boy picks up the bell and then Santa appears out of nowhere and towers over him, and the kid turns around and is obviously scared - c'mon, it's SANTA, people! - and what does Santa do? No introductions, or \"Hello, I'm Santa, what's your name?\" Instead, he says, \"What did you say?\" in a very accusatory manner. What a jerk! But then, he runs a Bushian North Pole that has secret video monitors on every kid alive, conveniently priming tomorrow's kids for a future with no privacy. From saintly divine judgment to a petty spy: that's this Santa. Imagine Soup Nazi mates with Santa (woah), and you have this guy.So I give this 2 stars because there IS some lip service to the real message of Christmas (what, it's not about just getting stuff?) and the graphics of the train (especially the hot chocolate sequence - that is actually excellent) are good in a Fritz Lang sort of way. But if you want the spirit of Christmas, this is NOT the movie.",
    "83": "I just got done watching Polar Express\nI am particularly don't like this type of movies\nI found it overwhelming surprisingly good\nat least for a kids movie\ngreat voice acting from Tom Hanks",
    "84": "The animation of The Polar Express is superb! The story, however, was much better in the book. The elements they used to stretch out the plot didn't work for me and I wonder how much children will actually like this movie.",
    "85": "This is the movie that started off the whole thing with mixing CGI animation with motion capture software, and it's still at the top of the CGI movie totem pole. After all these years, the effects and imagery still blows me away. Employing a mix of real world physics and the unique properties of a cartoon universe, the movie shows us the scale and details of what looks like a real train, but at no time is anyone ever at risk of danger. The train slides around and crashes through ice, but it also careens down mountains at top speeds without getting swept off the train tracks. Another thing, frequently the distances and horizons keep shifting, and this is exceptionally obvious on the frozen lake whose size we see on arrival, but as the Polar Express speeds back to the tracks, the horizon keeps popping back from getting closer to much further away. I also noticed the train length and number of train cars keeps varying, and that Santa's North Pole village seems much larger than its population seems to require. They're small bloopers for a movie whose whole purpose is to stun and stir awe in the watcher. The story is simple and sweet: a boy travels to meet Santa at the North Pole and get a secret tour with two other children. It's remarkable and utterly magical, but still, I can't help but want to add in the mythology of the \"Santa Clause\" movies with Tim Allen. Maybe everything we're seeing is under the ice as in that movie and this Santa is the man in the suit before Tim Allen. Wouldn't that be cool? It's a good movie that stimulates our imagination, and \"The Polar Express\" is definitely a good movie, ranking in the top ten of my favorite holiday movies with \"A Christmas Story,\" \"Miracle on 34th Street,\" \"Harry Potter,\" \"Scrooge\" and \"The Shining.\"",
    "86": "A few months ago, I remember walking through the library looking at the movies I could review when I passed by a grandmother and her two younger grandchildren who were about four or five. As I was looking around, I remember one of kids looked in awe at \"The Polar Express\" and I couldn't help but smile. The film had always been a Christmas staple for me. I remember watching the movie almost every Christmas when I was younger loving every frame of the film. Years passed and I had stopped watching the film by then. This year though, I decided to give the film a re-watch and was happy to find out that I still loved it after all these years. \"The Polar Express\" might have some dated elements to it, but the things that have held up have held up incredibly well. Here's why I think this is one of my favorite Christmas movies.A young boy (Daryl Sabara) is starting to doubt the existence of Santa Claus. He has been yearning to hear one of the bells that is on Santa's sleigh and starts to think that it may not exist. However on Christmas Eve, a train known as the Polar Express shows up outside his house where a conductor (Tom Hanks) tells him that it's going to the North Pole and he decides to get on board meeting other kids including a young girl (Nona Gaye), a know-it-all kid (Eddie Deezen) and a lonely boy named Billy (Jimmy Bennet). Along the way, the boy goes on a magical journey involving a mysterious hobo (also Hanks), a gigantic heard of caribou, a frozen lake, and a crazy ride through the North Pole itself.Ever since the movie came out in 2004, both critics and audience members have been rather split about the movie. Where critics like Roger Ebert loved it, other critics like Peter Travis hated it. I guess I can sort of understand why people are not fans of the movie, but I really couldn't care less. I love this film and I'll try my best to defend it. Let's talk about the story first. Those that don't like the movie usually say that the movie is padded and filled with too many unnecessary scenes. For those saying that most of those scenes aren't needed, there's a reason why it was included. It was based off a picture book which if properly adapted would be only ten minutes long. The scenes they added I think are pretty exciting and have a lot creativity put into them, but the best part about it was the fact that the message of the film is able to stand tall and is faithful to the book unlike other picture book adaptations. The characters I think are also likable. Usually, I'm against character not having names, but in this case it really works mainly because you at least remember what they look like, have memorable things to say and also stand out. However, the thing that most people are pretty split about is the motion capture animation, particularly on the humans as most find it too unrealistic and sometimes creepy. In my opinion, I don't think that was what director Robert Zemeckis was going for. I highly doubt that he was trying to make the characters lifelike because the technology was, and still is, not up to date yet. Though some areas of it are dated at times, the animation was able to translate Chris Van Allsburg's beautiful animation to the screen perfectly, its backgrounds in particular. I also love the soundtrack of the film. The score by Alan Silvestri is beautiful to listen to and his songs are very catchy and memorable. I also liked the small detail they added of playing old recordings of Christmas carols in the North Pole. As far as flaws go, my only one in particular is some of the dated motion capture, but that's really about it.\"The Polar Express\" is one of my favorite Christmas movie with a fantastic story, good motion capture, memorable characters and some fantastic music to help it stand out. It's one of those Christmas movies that people will just have a soft spot for even if people disagree with you. With that said though, if you don't like the movie, I do respect your opinion. However, I will love the movie for years to come.",
    "87": "The Polar Express. Director Robert Zemeckis, I love Back to the Future, Forrest Gump, Contact, and Who Framed Roger Rabbit (NO QUESTION MARK AFTER THAT MOVIE TITLE!!). And Tom Hanks, one of my favorite actors. The reviews of this movie were almost unanimous saying that this is an instant holiday classic. Ebert & Roeper give it two ENTHUSIASTIC thumbs up! Even Ebert's written review gave it a full four stars! Wow... OK... this I gotta see! But wait... the motion capture used looks really weird. Hmm... maybe I'm NOT so interested in seeing this anymore.\"Well, you comin?\" says the train conductor to the boy in The Polar Express. The boy is reluctant at first, and the train begins on its course without him. The boy soon changes his mind and jumps aboard just in the nick of time. Now, most of you have probably decided to not jump aboard this train and wait for the TV Train or Rental Express (hee hee, I'm so witty and clever). I, on the other hand was like the boy who was skeptical at first, but jumped on to see what the fuss was all about. I just wasted $10 and two hours of my life. I can't even begin to explain the pain in my stomach. The Polar Express was so painful to sit through it's not even funny. There's no story. There's no pay off. You sit there through these series of events and you wonder \"is there any point to all this?\" It'd be one thing if the scenes were entertaining... but they're not.This movie is void of any emotion, any soul, any ounce of plausibility, and most of all: any fun. This movie is NOT FUN. And let's talk about the way these characters look for a second. Saying that it's the same technology (motion, I'm sorry, \"PERFORMANCE\" capture) used to make Gollum is a real shame because Gollum was Believable!!! Photo-realism just does not translate well in this medium. You're using animation, why not design the characters to be more expressive? Or why not just film it all with real actors? They certainly COULD have. We as people know all too well how we walk, talk, interact with things. Seeing it on the screen done unconvincingly is not impressive. Caricatures done convincingly is all the more believable, as The Incredibles has proved. The result of The Polar Express now is as if they took corpses of dead children and turned them into puppets. They're moving and talking, but where's the heart? Where's the soul? That's what we're seeing on the screen. UGH UGH UGH UGH UGH! This movie is so horrible! There's a scene early in the movie where the boy takes a girl's train ticket from her seat because she got up and left it. He wants to give it to her but you sit there going \"why??!\" Just leave it.. she's coming back! He of course loses the ticket and \"adventure\" ensues. And then there's a boy who's stuck in the back of the train all the time, and they bring him hot chocolate, but he can't come up and join the rest of the kids? And then there's this annoying \"know it all\" kid with the voice of a 35 year old. It's all so very disturbing. Oh and there's songs! One girl goes into the back of the train where the lonely kid is. He's singing a song to himself. And then she interrupts and joins in! They end the song as they're holding hands, looking into each others eyes as if they were lovers. Very awkward. I won't even go into details about the song about serving hot chocolate while waiters dance around the train. \"keep it hot keep it hot!\" The one scene where Tom Hanks slides on his knees with his arms stretched up in the air has to be one of the most memorably BAD scenes in the history of bad scenes. I have to stop now or I'll just kill myself. I need to watch something crappy to cleanse the palette. Yes... crappy is better than The Polar Express. \"The one thing about trains, it doesn't matter where you're going, what matters is deciding to get on.\"Don't get on this one. For the love of God, I have decided for you! This is just another film taken from a children's book stretched incredibly thin into movie form. It happened with the Grinch and The Cat in the Hat and those were horrible also. But who can blame them? I bet if I took the book, The Berenstein Bears' Too Much Junk Food, and turned that into a feature film, it'd probably be pretty dull also. But at least... there'd be a story and a point, which is what The Polar Express is so lacking of.",
    "88": "All-world film director Robert Zemeckis goes the animated feature route here with this highly interesting, but ultimately under-achieving little holiday picture. A young boy and a group of other children are invited to ride the titled vehicle as they all try to hold on to the belief that there really is a Santa Claus. An achingly simple and pretentious story-line with ho-hum cinematic executions almost sinks the landmark animation and articulate technological innovations. Tom Hanks tries his best by playing the voices to no fewer than five characters, but all the parts are so flat and under-developed that their three dimensional forms seem almost pedestrian. The character generation imagery is so life-like that it toes the line on being down-right spooky and even a bit disturbing. Fine effort and still a noble work, but really this had the potential to be lots more than it actually is. 4 stars out of 5.",
    "89": "The Polar Express is a 2004 motion capture film directed by Robert Zurkenkis who is over Back To The Future franchise and tells the tale of a young boy who comes across a mysterious train ran by a conductor voiced by Tom Hanks and the little boy goes off on a magical journey to see Santa Clause in the North Pole. So will the little boy go back home?Overall I thought the film was very good,the motion capture was very good as I liked how the conductor was like Tom Hanks and the animation is very similar to the Jim Carrey film A Christmas Carol that was made in 2009. The story is good but the animation is definitely the show stealer in this film.If you love motion capture films and you are a fan of Tom Hanks then check it out. I really liked it,and its perfect to watch this holiday season.",
    "90": "The Polar Express is one on my favourite Christmas book out there!!! This movie is a good take one a movie. The animation is not what you see today, probably because it was made 15 years ago. The trailer pretty much says it all. I gave it a 7 because:\n1. I would watch this again.\n2. Good story and characters.\n3. I would recommend this movie.\nThings to improve for a future Polar Express Movie:\n1. Better animation.\n2. Go off the book a little bit more than this movie did.\n3. Make it more exiting.\nAlso make a live action one.Watch this movie at Christmas time.",
    "91": "Directed by veteran Robert Zemeckis, It is a production that unveils, throughout its 100 minutes, the story of an American boy in the late 1950s. By witnessing the polar express stop at his door, the young man will have the most fantastic experience of his life. Life, something that will mark him forever and allow his belief in Christmas, not as firm as one would expect for a child, to become even more solid. Initially reticent, the young man agrees to leave on the train that takes him on a tour full of incredible adventures. Each piece of territory crossed is a different learning experience, marked by its still incipient trajectory. He fights with Scrooge, the famous evil Christmas spirit, immortalized by the literature of Charles Dickens, passes by the famous Polar Aurora, a place with the optical phenomenon due to the brightness observed in the night skies of the polar regions, due to the impact of particles of solar wind with the high atmosphere of the earth, channeled by the magnetic field of our planet, that is, an impressive visual spectacle that leaves no one indifferent.In the face of conflicts, as it is worth mentioning, the boy no longer believes in Santa Claus, the narrative becomes an allegory for the need to believe and invest in the \"so\" Christmas spirit. We check with some resistance, because the foot in reality does not allow us to surrender too much to the utopias proposed by the American cinematographic discourse. However, one of the \"tasks\" of art is precisely to allow us to clarify reality through fictional proposals, thus, the ticket to enter the world of Zemecks film is \"bought\" by all those who indulge in the charms of art. Narrative that unfolds before our eyes, a set of scenes built using visually incredible resources.Zemeckis's filmography is known for playing with the ludic, and here it is no different. The script to be well digested by the viewer needs to be seen as a story about magic and aborted beliefs. Alan Silvestri's music helps to punctuate this feeling that life in the eyes of a child is more beautiful, even if that child no longer believes in legendary figures, as is the case with the central character. In \"The Polar Express\" we have a short, simple and objective plot. The director's intention was never to create a work of art in the plot with this film, but to prove that you can rescue barbaric feelings and emotions with the Christmas theme. Now imagine Tom Hanks facing five different roles in the same film. Imagine? Something very crazy to think about, mainly because the \"motion capture\" technique (technique used to make the character Gollum from the series \"The Lord of the Rings, for example) was used, which captured all of Hanks' movements and transferred them to the computer, mixing reality and animation, fantasy and flesh and blood beings. The actor plays a boy who does not believe in the Christmas spirit, his father, a locomotive driver, a stroller and Santa Claus himself. It is a versatility never seen in the world of movie theaters.This technique was used in a magnificent way for the sake of narrative. To get an idea of what was done, all the actors in the film acted in front of an empty screen, with motion capture sensors attached throughout their bodies. The data from these sensors were passed on to computers and served as a template for the creation of the character in the film itself. As these sensors were responsible for capturing movements and facial expressions, the actors did not necessarily have to have the same body as the character. This allowed Hanks to play five different characters. And look, it was not easy to shape all of his expressions, so much so that the work lasted almost a year. The interesting thing was to see Steven Tyler, vocalist of the band Aerosmith, as Elf singing a song at the end of the film. Very funny! They managed to capture the essence of their appearance (big mouth and ears)!The film makes use of a very new advent for its time, and at least the main character is very excited. Already adults and peripheral child characters are astonishing to look at. This is thanks to the concept of Uncanny Valley, which preaches that figures that imitate human beings when they approach what man is become strange. The dialogues and interactions are quite artificial, but not as much as the attempts to make musical numbers. The waiters who serve the wagons are so tough that they look like imitations of androids. This issue is somewhat appeased by the parties involving animals running, flying and interacting with the typical things in the scenarios. Wolves and eagles represent more than just animals typical of North American fauna, and result in representatives of the work's sense of adventure. The criticisms received at the time of the launch, stoning the flesh-and-bone characters, their lackluster movement, their rubberized look and their glazed eyes, forgot the most important component of any short story: simplicity and narrative poetry.And although the visual is the only really negative point of this technique, like ignoring the perfection of Zemeckis's camera, it went through, following in the smallest details the movement of a lost golden ticket and the travellings that lead us nimbly in and out of the train, especially during the free fall on the tracks and crossing the thin ice? The option for elegant frames also stands out, and the counter-plonge, which accompanies the little boy's belief through the frozen floor, not only dignifies the moment but anticipates the arrival of Santa Claus. Meanwhile, the photograph by Don Burgess and Robert Presley is breathtaking - as shown in the image below -, and the intense gold of the train ticket or the lighting of the bonfire on the face of a Beggar, the angel presents in the vast majority of people. Christmas stories, is enough to make a beautiful Christmas story shine.At the end of the projection, we were left with the feeling that Zemeckis achieved his goal, of combining technology and magic in the same product. He, who is admittedly one of the directors who most seek to develop and perfect techniques and technologies, ends up creating a plastically flawless film, transposing to the screen with admirable perfection the engravings from Allsburg's book. Zemeckis also creates practically unimaginable plans and sequences, in a brutal effort to want to innovate. Zemeckis also loves to make references to other films. This time, he made the children's classic \"The Fantastic Chocolate Factory\", starring Gene Wilder. The ticket that gives access to the train is golden, just like in the classic movie. In addition to similarities like the big chocolate factory, the gift factory or even the driver with the funny Willy Wonka.Assuming a metalinguistic tone on purpose - the Conductor, one of the characters voiced by Tom Hanks, refers sensibly to abandoned toys - and accidentally - Ebenzer Scrooge's puppet would serve as a mold some years later for the personification of the classic character by Jim Carey, O Polar Express culminates in the detail plan of a hand bell, which is much more than the complete proof of the fantastic journey, it is the true Christmas spirit within each one of us. The inner child who screams and cries out for the sincere remembrance of his attachment to the beautiful illusion of the good old man, of the communion of gifts and brotherly love, whose sound materializes in the tinkling of the bell at the ear of the, now adult, little boy.On the other hand, it is noticeable that the biggest problem of The Polar Express is not so much its innovative and uncomfortable aspect - something crucial for a Christmas plot - and its plot, common and obvious. The protagonist is a boy who is starting to stop believing in Santa Claus. He is growing up, and with that, forgetting the magic of childhood. The events in The Polar Express take place in a very traditional and unoriginal way. There are not many news or discoveries: everything goes very smoothly, without scares or surprises. The few moments of suspense and tension soon dissipate, and normality then dictates the course of action again. The impression is that he devoted a lot of time to the appearance of the film and very little to the development of the script.The film itself looks more like a roller coaster. You will have fun watching the ups and downs of the trip, with exciting moments and action sequences where the beauty of the most magical time of the year is paramount, while others are strange and out of place, like the setting of children singing songs. At least when the final season arrives, the home of Santa Claus, the magical character is rescued with a sequence of events that show the intimacy of the elven officials, including the architecture of miniature houses since they are small. There comes a moment in the film that is surreal to imagine that a boy can walk on top of a moving train, but it does not bother you because you are already involved in the fantasy atmosphere provided by the characters.The care with the visuals of sets and costumes of the inhabitants of the magical place breaks the skepticism of the central character of The Polar Express too much, and this is certainly a film that has a lot of audacity, being a pioneer in many points that would become quite common in children's productions. And adults later on. The movement capture technique, new at the time, brings to the film the combination of \"real images\" and animation, in one of the most surprising Christmas cinematic experiences in the history of cinema. In addition, The Polar Express is a very, very beautiful and careful film with its theme, even if the story could have denser characters and conflicts to make the experience even more unforgettable. Still, it is a beautiful production about friendship and how we should, without being too deluded, cultivate our dreams, with a view to making our existence more bearable.",
    "92": "On the one hand there are many delightful moments in THE POLAR EXPRESS, not the least of which is the entire look of the film--appealing in a way that great illustrations of children's books always are to young and old. Tom Hanks and the others enter into the spirit of the whole thing with gusto--and all the performances are right on target.On the other hand, much of the film is an excuse to dazzle with roller-coaster-like rides on the express train that roars across various landscapes making wild leaps and turns, all the while thrilling us with a sense of adventure and excitement. For the very young, the ride might be a scary one, especially when the daring young hero rides atop the train during a blustery snowstorm.Things barely quiet down once the destination is reached at the North Pole. Still there are dangers lurking and the thrills continue with some amazing photographic tricks that can only be done in this new process of computer generated animation.And to add a cozier touch to the proceedings, certain famous Christmas songs are interjected at intervals to give the North Pole--and the film--a warmer glow.All in all, quite an imaginative and innovative achievement--impressive enough to assure its place among future Christmas favorites with unlimited appeal for the young in heart. The message of Christmas is lightly hinted at but when Tom Hanks as the train conductor tells the little boy, \"The true meaning of Christmas is in your heart,\" we can be assured that children everywhere will definitely \"get it\".Visually, it's a stunner. I didn't see it on the IMAX screen where I imagine it really knocks your socks off, but at a multiplex where picture and sound were impressive enough to convey just how advanced special effects technology has become. There is much artistry involved here, especially when the night scenes of the train's fast-moving travel through a blustery snowstorm capture some rich winter landscapes, including a frozen lake that threatens to demolish train and passengers before danger has passed. The camera-work is continually fascinating as is the artwork involved.A pity there couldn't have been more of a story in the children's book which is the source--but the artistic visuals are the main source of entertainment here and they are superb. The busy background score by Alan Silvestri is reminiscent of works by John Williams. Although none of the sprightly song tunes are particularly memorable, there is a wistful quality to one of the new Christmas ballads sung by the children.P.S. - I have just watched it on DVD, a year after writing the above review--and it's definitely a keeper--just as wonderful as you could want, an amazing technological achievement that should delight all ages who can still hear that bell! Tom Hanks, as the conductor, is my favorite character--brilliant job.",
    "93": "I have to say that I adored 'The Polar Express'. It was just the sort of film I needed to truly get me into the Christmas mood. The story revolves around a young boy, who is coming to an age where he is doubting Santa Claus' existence, until the Polar Express- a magical train destined for the North Pole- takes him and a group of other young children on a journey to Santa and to reaffirm their faith in Christmas.I had reservations about the use of CGI animation since I felt it really only worked for stories about cute animals but having seen the film, the CGI was the best way to capture the spirit of the film. It really wouldn't have worked as well in live action, the sense of other-worldly magic would have been lost. And as it was, the artwork was beautiful, especially the snowy mountainous scenery that the train passes through.This film took me back to my childhood and that tingly-feeling every child gets on Christmas Eve in anticipation of Santa's visit. The story was sweet and innocent without being nauseating, and I think every one of us can empathise with the boy who wants to believe in Santa but is growing away from the innocence of early childhood and faith in magic. Much like Raymond Briggs' 'The Snowman', I predict 'The Polar Express' will go down as a Christmas classic. It certainly makes a pleasant change that this year's Christmas film was actually about Christmas and I hope they make the re-release of this film an annual Christmas event.",
    "94": "This is one of the better Christmas movies I've ever watched. It's fantastic. I watched this again after ages and right after 'A boy called Christmas' which I didn't like at all. You could say that I watched this to cleanse my eyes because that movie is quite bad.It's an amazing fantasy Christmas movie with spectacular animation. Tom Hanks' animated character looks just like him. I didn't find the other characters as jarring as people claim them to be. The film's animation is so good that it's easy to overlook the \"creepy\" looking characters.The film has extremely breathtaking visuals, gripping scenes, a jolly atmosphere. It also has songs which is really fantastic and something that happens to be missing from Christmas films including'A boy called Christmas'. The moral that this movie has is also quite beautiful. So overall a really great movie to watch during Christmas. All this hate is just not justified.",
    "95": "\"Wow!\" I found myself saying this over and over as I watched this movie on DVD went it came out just before Thanksgiving of 2005. It continually amazes me how far computer animation has come in the last decade. Each time I think I've seen the most beautiful or amazing artwork, something better - like this - comes along. I couldn't believe how good this looked on my flat-screen TV. I can't imagine how good it must appear on an expensive plasma television.The visuals are just stunning, scene after scene. The sound ain't bad, either! Those not playing this on a surround system are missing an integral part of this movie and a lot of fun. The roar of train as it comes and goes, for one example, is awesome.The story is very simple but yet entertains all the way with some very adventurous scenes. There are a couple of roller coaster-type scenes which were especially fun, and actually thrilling. Normally, 100 minutes is a bit long for me to sit through an animated film but this was filled with so many amazing sights and fun action scenes that time was no problem.The only drawback I found were the kids in the story. Most of them were not anyone you could really warm up to, except for the girl and she was so overtly politically correct it was sickening and an insult to anyone's intelligence. A black girl was NOT in the book but the typically-Liberal filmmakers not only change that character but make her the only one in the film with absolutely nothing wrong with her. She's so sweet she makes Mother Teresa sound like The Grinch. None of the kids in the film, however, were brats or annoying. The only funny kid was the nerd, of course. PC baloney aside, this was fabulous entertainment. Tom Hanks did a great job voicing over five characters and I've just simply never a better-looking film than this.",
    "96": "So it was with much trepidation and even utter fear in my heart that I went to see this movie. After all, the last time I went to see a full-length adaptation of a favorite Christmas story, what I got was Ron Howard's absolutely God-awful \"The Grinch\". Having grown up with the book \"The Polar Express\" (according to my mom, I cited it as my favorite Christmas present when I was seven), I did not want to see this story bastardized in any way. Honestly, I was prepared for \"Polar Express\" to be a complete wreck. But instead It soared. Completely. What makes the film such a success is not so much even the story itself, but an execution which somehow manages to inject every frame of the film with a feeling of childlike wonder and exuberance. In addition, there are so many clever touches and details added throughout that a feeling of mystery and excitement just fills the viewer. Among these are the waiters dancing and singing while serving hot chocolate to the kids on the train (a very funny scene, as well), the factory where the presents are prepared, and a ghost-like hobo who is never really explained, but is incredibly crucial to the feel of the film. At one point, three of the children wander lost through the empty streets of Santa's North Pole town. As they wander, various old Christmas recordings are heard playing on phonographs throughout the town. The music provides a pleasant and nostalgic ambiance to the scene. It's touches like this that absolutely make the film.I'll never understand why films seem to be required to be at least 90 minutes long. I would pay money to see a 40-minute film, as long as it were good. And even if it sucked, I would have at least wasted less time. What I'm getting at is I have no idea why a 32-page picture book needed to be a 99-minute movie. What this means is that the original story is VASTLY expanded upon. However, what is added in actually fits quite well with the essence and spirit of the book. Some of it is just sheer entertainment; the train track is like a roller coaster, characters ski on top of the cars, danger lurks around every step of the journey to the North Pole (but admittedly fun danger). Other aspects further illuminate and expand upon the book's basic theme of the virtue of belief in the implausible. So I have no idea why this was made into a full-length, but in the end, I'm glad it was. It didn't even feel too long (and I think everything is too long).Much criticism has fallen on the look of the characters in the movie. I can agree to a point. While there is incredible visual detail in the faces, they usually seem void of expression. In general, a lot of the motion seems rather wooden, as well. The scenery, on the other hand, is gorgeous. Overall, the minor problems in animation (which really boil down to a matter of taste anyway) are certainly not enough to diminish what is an overwhelmingly successful movie. Score: 8/10",
    "97": "Charming and worthwhile adaptation about a timeless and marvelous Christmas story dealing with a boy boards a magical train which's driven to the North Pole and Santa Claus's home . Polar Express is an enjoyable Hollywood production , set on Christmas Eve , a wonderful and straight forward approach to the original's source material , based on a storybook written by Chris Van Allsburg who also created Zahura and Jumanji , being splendidly adopted . It is given the full Motion Capture deluxe treatment in this superior Holiday film . The production values & acting are both excellent, with just enough attractive to appeal to the tenderhearted, and with moving doses of allucinogenic adventure , thrilling events , case of the potentially frightening elements and adding sentiment ; all of them are blended into the mix, until, like a nice Christmas punch, the result appeals to all . The Christmas story tells of a boy who has reached an age when he begins to have materialistic doubts believing in Santa . The young boy is lying awake waiting for the sound of sleigh bells ringing from Santa's sleigh . The little boy receives a surprise, a steam engine's roar and whistle can be heard outside his window , he jumps from his bed and sees a train in the middle of his street , as he is visited by a strange Polar Express . A rare conductor (Tom Hanks) who displays no charity to mankind generally invites him on board to take an extraordinary trip to the outside his window . The doubting boy grabs his robe and rushes out the front North Pole with many other pajama-clad children . The little hero boy meets a group of children (voices from Nora Gaye , Eddie Deezen, Peter Scolari) . There, he gets an extraordinary gift only those who still believe in Santa can experience a nd will learn the error of his ways . To his delight, the roller-coaster ride complete his beliefs in one night giving him the opportunity to mend his thoughts to reaffirm Mr Claus .Splendid Tom Hanks who plays the train conductor of a magical express heading for the North Pole, in addition to five other parts. A marvelous recounting of a Christmas tale and Tom Hanks demonstrates once again his versatility on screen in this retelling of a surrealist, fantastic adventure that results to be a kaleidoscopic marvel . It packs spectacular set pieces , breathtaking sound effects , highly imaginative camera angles and impressive special effects ; furthermore a sensible musical score by Alan Silvestri , including a touching leitmotif . Atmospherically as a complete package it demonstrates the perfection of modern computer animation techniques . The movie is as comfortable and heartwarming as an old Christmas card .The whole concept of looking at a rapid train towards North Pole is creative in and of itself. After watching the movie, you may look at your life from the same enjoyable perspectives . Special effects add a nice little touch , but it is Tom Hanks's interaction with the various characters that really steal the show . Hanks manages to capture pure magic with his stunningly awesome portrayal of main characters , the Hero boy and the conductor , and it is definitely worth a look . It's fun and different approach to the Christmas tale with top notch effects by means of Motion Capture , a technique magnificently developed by Robert Zemeckis who will repeat in other films as Beowulf and Christmas Carol . A highly recommended film that nobody should miss it especially during Christmas time . Robert Zemeckis's Polar Express still ranks as one of the best adaptations of Christmas stories ever. This animated retelling about a doubting little boy taken on a journey of self-redemption and knowledge will appeal to Tom Hanks buffs , computer games enthusiasts and eye-candy fans .",
    "98": "I think this movie deserves a higher rating than a 6.6 on IMDb. I know its just an opinion to everyone else, but I just don't think it deserves to be ignored because \"The Polar Express\" is one of the greatest experience that I have ever seen, since when it first came out back in 2004 in IMAX 3D. My favorite part in IMAX 3D is where the train starts to go too fast, and we get this awesome experience that you are on a roller coaster ride. I felt like that I was part of that ride, and it was like \"WOW!\" Of course, I am only watching this in 2D which is fine but it will never be the same experience as what the IMAX 3D did. So, with that said, \"The Polar Express\" is about a boy who doesn't believe as he gets on a magical train known as the Polar Express as it leads up to the North Pole so he and the rest of the children are about to go see Santa Claus on Christmas Eve late at night. I don't know if the movie has a message but if it does, then I thought it is well done as we should know that seeing is believing as it for us on what we believe. The animation in this movie is spectacular, and I thought the animators did a great job on rendering these characters to make them look real. Of course, you can argue about on why Robert Zemeckis should have just shot this movie in live action instead of animating it. So, what do I know because I honestly don't know; maybe it is just for that kind of style as they are trying to make these characters to be more faithful to the book. Anyway, I thought Zemeckis does a great job on making this movie, and making this a whole lot of fun. Tom Hanks does a wonderful job to work with motion capture as he is playing each character that he is doing; it is also kind of hard on which actor or actress is voicing these characters or doing motion capture but I will leave that up to you. Nevertheless, Hanks was really good in it. The music by Alan Silvestri is very well scored, and the songs that he teamed up with Glen Ballard are pretty good too. I also don't mind if the filmmakers had to add new scenes that have nothing to do with the book, because folks, the book is short so that is probably why they had to expand the book into a movie that is over an hour an a half long. I was fine with it, and have nothing to complain about. So, enough talking about who or what is having problems with this movie, I just thought \"The Polar Express\" is a wonderful experience and would love if this was brought back into theaters, as well as showing it in IMAX 3D. I give this movie a 10 out of 10.",
    "99": "The Polar Express is a rare exercise in pure cinemagic, where everything is dreamlike and exists in a world run on the motor of whimsy. It's a beautiful looking film, with every shot so mindbogglingly detailed and every action sequence so paralyzing in its charm and excitement. I can only imagine the everlasting impact an IMAX experience would've had on me as a longtime cinema-goer.I have major sympathy for the parents of America, who year after year, are likely subjected to the lowest common denominator of family entertainment at home and at the cinema. When rating a family film, I ask the question, \"is it fun for the kids?\" and then ask, \"is it fun for the adults?\" They pay the ticket price; don't you feel they should share the enjoyment of what is being on screen and not just hope to see something resembling the beginning of a long line of end credits? Bless the fact that Pixar films have begun to take the attention of anxious kids and parents, and at least during the Christmastime in 2004, The Polar Express lurked in theaters for weeks so that the masses could be treated to the beautiful qualities imaginative cinema had to offer.I'm positive everyone knows the story to the beloved children's book, penned in 1985. On the night of Christmas Eve, a young boy, skeptical about the idea of Santa Claus, is taken on a journey after seeing an enormous train pull up to his front yard with the train conductor (one of the five characters Tom Hanks voices in the film, not including the narrator) proudly shouting, \"all abooooooard,\" before taking the young boy and several other nearby children on the ride of their life. Their destination is obviously the North Pole, where the kids can hopefully meet Santa Claus and receive a present for their good behavior this year. During the long ride, the young boy (who remains nameless, along with most of the others on board) meets a young black girl and a young boy named Billy, and the three children wind up having the ride of their life, as they not only avoid several scenes of uncertainty, but challenge the perilous conditions brought on to them by using quick and wise judgment. Not to mention, these three kids are just absolutely lovable. You're Scrooge if the children's beautiful song at the back of the train doesn't summon a tear to your eye.The film exercises our unalienable right to imagine and dream. What kind wouldn't have wanted to take a ride on The Polar Express at age eight or nine? When I was small, my town held a little \"Polar Express\" event where children go board a train and cruise through nearby towns. It was a less than memorable experience. The singing was mild, the people weren't as fun, and the rule about hot chocolate wasn't in place because it was already broken by the time we received it.If I would've seen something like The Polar Express in IMAX theaters, say, nine years ago, I would've been delighted. The kids who appreciate the most will be between seven and ten because the film gears itself to more mature children, who are still possibly clinging to that last bit of childhood innocence that is believing in Santa Claus. This picture shows that magic continues to exist long after your beliefs are over, and paints the most lavish and awe-inspiring portrait of the holidays that I have ever seen.Director Robert Zemeckis, the laudable visionary of Back to the Future, provides us with one of cinema's many landmark, this one being for the digital age. This is the first film in history to utilize the motion-capture style of animation for the entire length. Motion-capture animation is when actors are fitted for special suits and proceed to act out the motions of their character, which will be converted to digital animation using computers. In recent times, let's take for example, Mars Needs Moms, a later picture by Zemeckis that left loads to be desired, the medium was gimmicky and unnecessary. Here, it's extremely enchanting. The inherent zombification of the human characters isn't explicitly found like in other motion-capture animation films, and it provides for nothing but smoothness in the sequences when The Polar Express flies off the train tracks and on to a bed of ice. Even the scenes with Santa's sleigh, zipping and zooming past a crowd of thousands looks beautifully enhanced thanks to this medium. This is one of the most detailed and great looking films ever made.The Polar Express is a magnificent cinematic achievement in terms of look and feel. The action sequences are brilliantly staged, offering up the feeling of placement and depth instead of giving us indistinct location shots and messy editing skills. Everything is clear, broad, and vivid, and the characters are innocent and easy to love. The film has been compared to a roller coaster ride in a derogative manner, but turning that around to fit a positive connotation, the picture gives us one of the most fun cinematic rides in recent history, visually and emotionally.Voiced by: Tom Hanks. Directed by: Robert Zemeckis.",
    "100": "There is a fleeting moment in THE POLAR EXPRESS where the title vehicle passes a department store with an elaborate Christmas display in the window. Everyone is excited by the sight, especially the story's protagonist, \"Hero Boy,\" until he sees the mechanical gears that reveal the display's Santa Claus to be a machine. That's the problem with THE POLAR EXPRESS, it is a splendid, wildly inventive machine, but it keeps on reminding us that it, quite literally, lacks a human face. Based on Chris Van Allsburg's slight but textured children's book, the film attempts to capture that book's subtle, albeit dark, visual tone. And for the most part the filmmakers do a stunning job. The artwork and animation, done largely with computers, is rich and detailed and often about as close to lifelike as any animation that I have ever seen. Therefore it is ironic that the remarkably high standards the film sets with most of the animation and artwork only serves to highlight the other aspects of the art that do fail so jarringly. The train, the snow, the sweeping landscapes and even the animals such as wolves and reindeer are all so incredibly meticulous in detail and movement, that it only makes the failure of the artists to replicate the human characters all the more startling and disappointing. The human beings in the story seem trapped in a limbo, being neither quite cartoon and certainly not quite human. It is strange that the animators do an outstanding job of recreating skin texture and coloring and even the various subtleties of hair, but can't quite recreate the most revealing aspect of being human, the eyes. The mouth movements are disappointing too, but it is the eyes that are, well, just plain creepy. Like the characters in Japanese anime or the sad orphans painted on black velvet, these characters have eyes that have a cold, spookiness to them. They are a mild, if unrelenting, distraction in some scenes, but they quietly spoil many of the major moments where the film strives for an emotional intimacy. It is a serious problem when you literally don't want to look a character in the eye, especially if the character is a child. The film uses a technology called \"performance capture,\" wherein an actor actually gives a three-dimensional performance which is recorded digitally by a computer, to then be manipulated into animated art. Performance capture is an extension of CGI and, as used in films like THE LORD OF THE RINGS, further blurs the line between what is animation and what is special effects. The process seems to work fairly well as far as body movement goes; the animated characters move with genuine lifelike grace that is far superior to previous attempts, such as the animated action sequences in SPIDER-MAN or THE HULK. Indeed, a dance sequence involving a band of hyperkenetic waiters is a showstopper. But the process just does not work as far as detailing facial features. Cartoon humans from Elmer Fudd to Fred Flintstone are more simplistic, yet more human than the waxworks faces in THE POLAR EXPRESS. Their cartoonishness gives them a personality that is missing from the POLAR EXPRESS characters. I suppose that as the technology progresses, the ability to create totally believable human faces will be achieved to some credible degree. But the question is why? It's like making vanilla wafers with artificial flavoring; why seek a substitute for something natural and superior. The director of THE POLAR EXPRESS is Robert Zemeckis, a clever and skilled craftsman whose work includes the brilliant WHO FRAMED ROGER RABBIT, a film that blends real and cartoon images wonderfully. THE POLAR EXPRESS would have been so much better had they followed the lead of ROGER RABBIT and, like SKY CAPTAIN AND THE WORLD OF TOMORROW, merged high-tech trickery with the simple honesty of the human face. Repeatedly throughout THE POLAR EXPRESS, I found myself wishing certain scenes were featuring real actors; I can't think of any other time where I thought a cartoon would be better as live action. Despite its optimistic Yuletide moral about the power of believing and its child's eye view of the world, the film really isn't a kids movie. THE POLAR EXPRESS has a Twilight Zone quality to it; not unlike the many versions of A CHR1STMAS CAROL or IT'S A WONDERFUL LIFE. The film is dark, and even in its most upbeat moments the story and the storytelling are strangely subdued. Not quite brooding or grim, but far from joyful. While obviously directing the film towards children, the filmmakers don't seem to understand kids. Little things are telling, like failing to give the characters names other than generic titles, like Hero Boy, Lonely Boy, Hero Girl, Know-It-All, etc. Such a lame literary device as reducing a character to a nameless symbolic entity is lost on children; they want to know people's names. Children can't relate to nameless, faceless characters. Neither can adults for that matter. Humans have names, and for that matter so do cartoon characters.Though it is seriously flawed, THE POLAR EXPRESS is still a remarkable effort, visually stunning and ultimately even emotionally rewarding. But no amount of artistic talent can capture the simple beauty or honesty of a living child's face; it may have been folly for the filmmakers to even try.",
    "101": "It was astonishing to read the lead in review. The complaint laid forth by the critic that the director's view of the North Pole and Santa's workshop did not reflect his, too bad. Maybe the critic could do better but it's doubtful. As for the line that the Elven town looked like something out of a German city, so what? Didn't many of the concepts of Christmas begin in Germany? My family (two seniors, a twenty year old father, his 3, almost 4, year old son) loved it. The colors were brilliant. The number of elves dancing, singing, and rushing to create an entrance for Santa was outstanding. Santa, himself, proved to be exactly as he should. Intelligent, sturdy, and kind. His reindeer, just as impressive. Forgetting the North Pole and remarking on the rest of the movie, how well done! The artwork, just great. The excitement, our grandson was out of his chair and standing while holding onto the chair-back of the row in front of us. There were scenes that could have seemed somewhat scary for a youngster, he didn't find them so. He laughed several times out loud, had his eyes glued to the screen when something serious seemed to be happening, loved the entire movie. He wants the DVD for Christmas (he will have to wait a year). He also told us that he wants to see the movie once more before Christmas. Out of the mouth of a three year old, his favorite movie.How can a critic want to re-design that? All because he didn't like the city at the North Pole.? I guess he was looking for buildings made from peppermint sticks. To each his own. As for the three adults, we too were amazed. We went for our grandson. We enjoyed it so much, we applauded (as did others in the theater). It will be easy to return for a second showing. And, the DVD, this family will be buying more than one. My summary states that this was the best Christmas story ever made (put on film, actually), we think it was more than that. It surpasses other great animated films. Once purchased in a DVD format, Toy Story will be relegated to the back shelf, even during the middle of summer.",
    "102": "Don't get me wrong, I liked this movie very much. It is nice to watch around Christmas time. The film respects the book of the same name, which I think is a great one. Actually it was one of my favourites, a timeless Christmas story about the power of belief, faith and hope. Back to the film, one thing that was a definite plus was the visuals. They were phenomenal, colourful and looked as though the animators had gone to extreme lengths to make it neat. The character animation was just as impressive. The music is very good, with sparkling motifs and haunting secondary themes. The end credits song is truly beautiful. Another plus was the voice cast, Tom Hanks stands out obviously. He voices five or six characters here, and he was great as always. However, the film does take a while to get going, and the script is rather simplistic. And while the visuals were outstanding, the story while respectfully true to the book(while adding characters and changing existing ones) just isn't compelling enough, and is made up of disconnected,unexplained and sometimes rushed scenes in terms of story telling. All in all, a nice Christmas film that is well worth watching chiefly for the visuals. 7/10 Bethany Cox",
    "103": "The Polar Express is a fantastic movie with a very well developed storyline and a terrific voice cast.This and Elf are one of the most recent films that I consider a Christmas classic and happily watch every December,it is beautifully directed and the animation is absolutely stunning,there's s lovely Christmsd feeling all the way through.Tom Hanks was terrific in this film and I didn't even know he voiced so many characters ,particularily Santa Claus and the Hobo,they didn't sound a bit like him,but the Conductor was without a doubt my favourite.I do think this movie would have looked a lot better if it was live action,all the sets could have been amazing and I will admit that Robert Zemeckis's animation style is a little creepy because it's so close to real,but I will accept the way he chose to make it as it still looks great and he is my favourite director.I would highly recommend Polar Express for the whole family to watch at Christmas time. A young boy who no longer believes in Santa Claus is given the opportunity to go on a train to the North Pole on Christmas Eve to meet the man himself.",
    "104": "My favorite Christmas movie!The animation is so goodThe story is so goodSo charmingSo magicalIt's near perfect.My only issues is that is slows down for a moment a couple times and I'm having such a good time it always annoys me, I'm like let's get back to the fun!It's a must watch every December. Alone with eating pizza! I don't know why put I'm always in the mood for pizza and snuggle up while watching The Polar ExpressI need to read the book, I didn't even know it was based on a book. I recently fount that out, that the movie sucks compare to the book. If that's true... How good is the book then?! Cause the movies is the best Christmas movie ever! And I'm not even all that big in Christmas movies, just a handful that I like.",
    "105": "I try not to have expectations when I go to see films. Often, my problem is usually that I'm excited about a film's opening, and my expectations are usually high. In the case of \"The Polar Express\", my expectations were actually pretty low.Growing up, I would read and reread \"The Polar Express\", a book written and illustrated by Chris Van Allsburg, every Christmas. It still ranks as one of my favorite children's books. The story was great, the illustrations were amazing, and the book never lost its charm to me as I got older.Naturally, when I heard they were making a movie out of it, and an animated one at that, I could not help but dismiss it as a ploy for Hollywood to take a sweet, timeless children's fable, and exploit it for a cheap buck. Now that I've actually seen the movie, I can say that it was far better than I thought it would be.Director Robert Zemekis, who also co-produced and co-wrote the screenplay, managed not only to make the film look amazing, but still kept the heart and the main moral of the original book within the movie. There are a lot of parts here that were not in the book, like the train slipping on an icy lake, and the caboose disattaching from the train with some of the kids on it. However, the really important parts of the book were maintained here. The main boy in the story still wants a bell, Santa gives it to him, and . . . you can figure out the rest.I didn't expect to like many of the additional characters they added to the movie, but I thought they were all characterized very well. I liked how the conductor (Tom Hanks) actually had a personality, unlike in the book where the focus was solely on the boy. I also liked how the boy interacted with other kids on the train, especially an African-American girl (Nona Gaye) whom he befriends. There's also a really sweet song called \"Spirit of the Season\" that she sings along with a boy credited as \"Lonely Boy\". The way the song is sung, and the CGI-imaging of the night sky, are both truly spectacular.Some of the films excursions that I thought were going to be cheap plot devices actually served the film well. After all, a book that's roughly 30 pages long probably won't amount to a 2-hour movie. Still, these subplots were used in a way to not only cleverly characterize the main characters, but also to give a better dimension to the North Pole. You would never see the elves, how they transport themselves, and what the villages in Santa's North Pole look like if the film stuck straight to the book. Zemekis has consistently been very good at using computer animation to add not only to characters, but make their worlds far more elaborate and interesting.With all that said, I had some major reservations about the film. While the animation was really good in terms of set design, I hated how it made the humans look. They almost looked like zombies at times, and it was a little scary.Don't get me wrong. Motion capture animation is pretty amazing, and probably not as time consuming as regular animation. However, when the main characters are humans, and the conductor looks exactly like Tom Hanks, why not just film them? That would probably cut the $165 million budget down significantly, or at least I would imagine.Also, it really irked me that most of the children did not have names. The main character is labeled \"Hero Boy\" in the closing credits, the black girl is named \"Hero Girl\", a nerdy boy is credited as \"Know-It-All\", and so on. Why not give them names? What's the harm in naming Hero Boy something like Tommy or Jimmy? It's not hard.I also hated how the main characters are kids, yet the actors who do the voices for them are not kids. \"Hero Boy\" is actually voiced by Tom Hanks, although he actually sounds like a real kid. Same with Nona Gaye, Peter Scolari, and Eddie Deezen. While their child voices sound authentic, it seems like a lot of unnecessary work to digitally doctor their voices to make them sound like kids. Why not just (Gee, I don't know!) hire child actors to do the voices!?!?! It worked for \"A Charlie Brown Christmas\" (1965), and it can't be difficult.Tom Hanks doing the voices of six different characters felt more gimmicky to me than cutting edge. Hanks is far from the first actor to play multiple roles in a single movie, but Peter Sellers, Lee Marvin, or Eddie Murphy he is not. In the movies those actors were in as multiple characters, they disappeared into their characters so much that their multiple roles showed their acting ranges. Here, every character Hanks voices (except the boy) sounds like Hanks. You can tell that Hanks is the voice of the conductor, the hobo, the boy's father, and Santa Claus. The gimmick is so distracting that it takes you out of the movie for a few moments.While \"The Polar Express\" has its hang ups, it can and should be considered the first Christmas classic of the CGI-age. It still gets re-released into theaters every Christmas, as it has a renewed following thanks to great 3D effects that are becoming increasingly popular amongst moviegoers. It also is one of the only adaptations of a children's book that adds to its source while also maintaining its heart. My guess is that many generations will return to it year after year, and it will keep ringing just like the bell in the story.",
    "106": "For a Christmas movie- and a children movie in particular, this movie is really lacking in entertainment and likability.It's very simple to say why this movie is not entertaining enough. It's too artificial. Sure, the computer effects are beautiful looking and it's a really big achievement but it makes the movie also very artificial looking and therefor the movie has absolutely no magic feeling in it at all. Because of that very same reason, the characters are too shallow and the story itself is not involving or entertaining enough. I really don't understand why this movie had to be made entirely with the computer. The movie totally lacks human emotions because of this and the whole 'magical' feeling feels forced and fake.To be frank, I just don't see how this movie is much good as a children's movie. There is nothing to enjoy in this movie for the kids. There aren't really many jokes present and the characters that are in the movie are not really likable or easy to relate with for the kids. They even have no names. The story also has little entertainment value because it's not consistent enough and the events in the movie are just only highly unlikely and are not made to look believable at all. And in general, the movie is more creepy and dark looking than cheerful and happy. What an odd choice for a children Christmas movie. The movie relies too much on its 'magic' feeling...a feeling that is not present in the movie at all. Therefor \"The Polar Express\" is nothing more than a beautiful looking failure.The story is extremely simple and is told way too weak in the movie. Basically the story is one unlikely and even odd event after the other without them making an obvious connection. I'm also still puzzling what the message of this movie exactly was. I'm pretty sure of it that it's; Believe in Christmas. But it is never explained in the movie why. Other Christmas movies with these kind of messages also have a morale and explain why it's so beautiful to believe in Christmas and how it makes the world a better place. Not in this movie. The message of the movie is basically muddled in the effects and visual look of the movie. It also helps to make the movie a very forgettable one.And really, did Tom Hanks had to play basically every male character in the movie? I really like Tom Hanks as an actor but to be honest he is not good enough as a voice actor, in terms of putting diversity and character into the different characters through his voice. Every character he plays sounds the same and maybe because of that the movie also gets too distracting and for some confusing to watch.All of the characters in particular also aren't much special. Most of them are totally obsolete and some of the characters are also highly peculiar portrayed in the movie. For instance all of the elves aren't nice at all in the movie and they didn't exactly made a friendly impression on me. They were even a bit villainous. The way Santa Claus is presented in the movie is also totally wrong. In the movie they made him look like a sort of tribe leader that is treated as a king and is worshiped by all as if he is some sort of God. He is not a friendly, cuddly, cheerful guy at all in this movie.The musical score by Alan Silvestri also got highly annoying after a while. Basically it's the same 'magical' main theme being played over and over again.The motion capture techniques work out pretty good in the movie and also the animations themselves are really good looking most of the time. There also is some good action, so obviously the movie still has some good things to enjoy. It's of course far from the worst movie ever but also far from the most entertaining one. More was to be expected from a director like Robert Zemeckis, who before this gave us entertaining movies like \"Romancing the Stone\", \"Who Framed Roger Rabbit\" and the Back to the Future trilogy.OK maybe it's because I'm European that I don't like this movie. I mean, the whole magical feeling around Christmas and the whole Christmas spirit is not really a that big thing here. So perhaps if you're American you can still appreciate some of the elements handled in the movie, although I stick to my opinion that it's still lacking in entertainment- and a real good point.A failure of a movie that is from a technical point of view is interesting and good looking.5/10http://bobafett1138.blogspot.com/",
    "107": "If anything this is a movie you've have got to have seen in theaters because the experience is something else. But even that it's such a fantastic christmas movie. I can't really think of any other animated christmas movie that reaches the level Polar Express does. It has an engaging story, is extremely well paced, great voice acting and a fantastic soundtrack.The art direction, the fantasy of it all. There's so much fun put into this movie, not just the writing but the action moments, the scenery (like the twisting mountain which the trains goes around like a christmas tree).The animation still holds up extremely well to this day, it does start to show its age regarding the character facial animation though. But it's not distracting.All in all I'd add this movie to the ''must watch'' christmas movie list..9/10",
    "108": "It was December 24th, 1994; I was 9 years-old. I lay awake anxiously in bed, as the waking hours of Christmas Day slowly approached. My parents were sound asleep two doors down from my bedroom. A bunch of fans we had were still on (the slow setting), but in the otherwise calm darkness, I could pretty much hear everything downstairs.Now I'm still not quite sure of it, because maybe I was dreaming or my imagination was in overdrive, but I thought I heard the fireplace door in our living room open and close, and the shuffling around of a large, heavy sack. Was that what I think it was? Could be, or could it have been my over-active imagination at its most deceitful?That's kind of the dilemma that some children face around that age, when the question of whether or not there really is a Santa Claus is open for question. I'm sure lots of children have laid anxiously awake at night in bed for some sort of sign that the jolly fat guy with a beard and a bunch of flying reindeer and presents is flying around in a sleigh out there somewhere. Some may even leave milk and cookies on Christmas Eve and be surprised to find them all gone the next morning. Santa, were you here?\"The Polar Express\" stretches beyond the limits of the imagination and goes out of its dear way to prove to children that seeing is always believing. Robert Zemeckis, who directed the film, which is an adaptation of the award-winning children's book by Chris Van Allsburg, believes in the story the same way that young children do: the ideas presented match their own beliefs that there really is life at the North Pole and that Santa is always keeping a watchful eye on kids all across the globe.Even though I'm 19 now, this film reawakened my long-dormant curiosity in the subject, and I'm sure that any adult that views this movie with an open mind might feel the same. But again, the notion that there is a Santa Claus and life at the North Pole is just a childhood fantasy; I know this, and most other adults do too, but there's nothing stopping them from rekindling their youth.Still, however, this film almost brought tears to my eyes on a few occasions because it was a brilliant realization of something that I thought had been lost to me forever. This film does bring back the magic of Christmas, especially during the dark times of the 2004 world we live in today. We'd need something like this to escape into, to realize our dreams and long-forgotten fantasies about a time when innocence still ruled the world.Van Allsburg's \"The Polar Express\" is one of the best known books in children's literature, and one of the most daring in exploring a child's fantasy. In the late-night hours of Christmas Eve, Hero Boy (we never actually learn his name in the movie) lies awake in his bed, anxiously waiting for a sign - Santa Claus.And then his father says, who thinks that Hero Boy is sound asleep, \"Only an express could wake him up.\" Sure enough, what at first feels like an earthquake only proves to be a massive locomotive called the \"Polar Express,\" which roars down the snowbound street where Hero Boy lives.Not believing his eyes, he ventures out into the cold night to see what's what. The Conductor (played and voiced by Tom Hanks, in just one of six roles throughout the film, including Hero Boy), ushers him on board, where he's introduced to the other children, including Hero Girl, Know-It-All, and Lonely Boy, who is the last child they pick up on their journey.From there on, it's a rough, fast-paced journey to the North Pole, a place that Hero Boy once thought only existed in his youthful imagination. Upon arrival, the quartet of children embark on a wondrous path of excitement, fun, and belief as they explore their innermost feelings about a beloved character in their dreams.Christmas is the most beloved holiday of the year, especially for children, who wait excitedly for the morning hours to see what a year of patience has brought them underneath their heavily decorated trees; I know I used to, and still do.Whether you're 90, or 9, Christmas has a magic that never goes away because that little kid in you will always be there, eagerly waiting for that sign - that special little detail that's overlooked by others but is caught in your ever-watchful attention - that maybe, the big fat guy you've always dreamed of, is out there delivering gifts to children all over the world.10/10",
    "109": "A young boy goes to sleep on Christmas Eve, steady in his disbelief of Christmas and determined to prove it all a hoax this year. His vigil is interrupted though by the arrival outside his door of a massive steam driven locomotive, The Polar Express. Tentatively he boards it with the friendly but gruff conductor and finds himself in a carriage full of other children heading to the north pole. With the mystery of what awaits him at the back of his mind, the boy and his new friends get into a series of adventures on the rails.This is a family film designed to be watched at Christmas in front of a warm fire with a family including young children. Some reviews have forgotten this and have made a big deal out of the weaknesses inherent in it. The fact that the animation was so cutting edge seemed to also suggest that perhaps these weaknesses were because the majority of work was put on the computers and not the writers but personally I do not believe this is the case. Lets be honest though, the plot is a simple one where a boy goes to the north pole to meet Santa (maybe), that is essentially it. On the way there are several train-based adventures and lessons learned.It is quite fun though and I enjoyed the sense of wonder and adventure that it produced. OK I'm not going to watch it with a group of my peers on a Friday night but that is not the point. The simple story fills the running time really well with the journey structured around mini-adventures to good effect. The message is a little bit sentimental but again it comes with the territory I suppose. The animation is impressive though. I think the claims that real actors will be redundant within years is nonsense but then nobody really thinks this will happen  it is just a way to get publicity through headlines. What it does do though is shore up the wonder by producing some great sequences and shots that would not be possible without computer technology. The cast is mostly solid although this is the same as saying that Hanks is good since he does most of the voices but Gaye was pretty good as well.Overall then an enjoyable little fantasy that delivers a sense of wonder across the story and animation. OK it is probably only going to work while on the home turf of Christmas but this is what it is for and I didn't have a problem with it working just as it proposes to work.",
    "110": "This film obviously has flaws. A lot of people say that the faces are creepy, and though I don't think this, I get their point. The rest of the animation though is some of the best I have seen, and still holds up today marvelously.The music should be pointed out as well. It can be big and pompous, but also can warm up a quiet scene with heartwarming Christmas spirit music. It has some of my favorite Christmas music.The story is like a variation of A Christmas Carol, in which one with little faith in Christmas gets thrown into a supernatural scenario where he has a change of heart. I think it was excecuted well and leaves you feeling the quiet warmth and joy of Christmas.This film is obviously not for everyone, and if you are not a fan of this film, I can totally see why, but this film is my Christmas movie that I will gush about any season. I definetely recommend that you watch it at around 10 on Christmas Eve night. By the time the film ends the main protagonist is winding down and ready to settle in for what lies next on Christmas Day, like you would.",
    "111": "Yikes ! No Maya apocalypse to be able to watch crap like this ! this is the 2nd recent movie of Zemeckis that I found awful and I wonder where has gone the guy behind \"BTF\" or \"Roger Rabbit\"? Was it Bob Gale so ?I remember to have tried it month ago but then, I wasn't convinced by the dull and slow beginning. Now, pumped by Christmas spirit, I tried the whole bottle and it's worst !it's definitely not a Christmas tale but a reeducation camp: incredulous kids are abducted to accept the one and only truth. \"Learn\", \"Leader\", \"Believe\", that's what the camp warden says to them as a goodbye. During the trip, he asked for billets, make line and respect time! The pole looks like a huge factory, filled with anonymous slaves and Big bother is here to watch all naughty kids. Santa needs his crowd cheering like the best of dictator and it's the one movie about him in which he actually whips his deers!The production is sharp for nothing: the kids haven't characters and the story is just about going up and down, too slow or too fast on strange vehicles! If JK Rowling didn't stop Harry's adventures in the Hogwarts express, there a reason: nothing can indeed come out of a train trip! Now, you have been warned: If you look for true magic and poetry about Santa, prefer \"the nightmare before Christmas\" because here it's rather Satan Klauss !",
    "112": "I try not to have expectations when I go to see films. Often, my problem is usually that I'm excited about a film's opening, and my expectations are usually high. In the case of \"The Polar Express\", my expectations were actually pretty low.Growing up, I would read and reread \"The Polar Express\", a book written and illustrated by Chris Van Allsburg, every Christmas. It still ranks as one of my favorite children's books. The story was great, the illustrations were amazing, and the book never lost its charm to me as I got older.Naturally, when I heard they were making a movie out of it, and an animated one at that, I could not help but dismiss it as a ploy for Hollywood to take a sweet, timeless children's fable, and exploit it for a cheap buck. Now that I've actually seen the movie, I can say that it was far better than I thought it would be.Director Robert Zemekis, who also co-produced and co-wrote the screenplay, managed not only to make the film look amazing, but still kept the heart and the main moral of the original book within the movie. There are a lot of parts here that were not in the book, like the train slipping on an icy lake, and the caboose disattaching from the train with some of the kids on it. However, the really important parts of the book were maintained here. The main boy in the story still wants a bell, Santa gives it to him, and . . . you can figure out the rest.I didn't expect to like many of the additional characters they added to the movie, but I thought they were all characterized very well. I liked how the conductor (Tom Hanks) actually had a personality, unlike in the book where the focus was solely on the boy. I also liked how the boy interacted with other kids on the train, especially an African-American girl (Nona Gaye) whom he befriends. There's also a really sweet song called \"Spirit of the Season\" that she sings along with a boy credited as \"Lonely Boy\". The way the song is sung, and the CGI-imaging of the night sky, are both truly spectacular.Some of the films excursions that I thought were going to be cheap plot devices actually served the film well. After all, a book that's roughly 30 pages long probably won't amount to a 2-hour movie. Still, these subplots were used in a way to not only cleverly characterize the main characters, but also to give a better dimension to the North Pole. You would never see the elves, how they transport themselves, and what the villages in Santa's North Pole look like if the film stuck straight to the book. Zemekis has consistently been very good at using computer animation to add not only to characters, but make their worlds far more elaborate and interesting.With all that said, I had some major reservations about the film. While the animation was really good in terms of set design, I hated how it made the humans look. They almost looked like zombies at times, and it was a little scary.Don't get me wrong. Motion capture animation is pretty amazing, and probably not as time consuming as regular animation. However, when the main characters are humans, and the conductor looks exactly like Tom Hanks, why not just film them? That would probably cut the $165 million budget down significantly, or at least I would imagine.Also, it really irked me that most of the children did not have names. The main character is labeled \"Hero Boy\" in the closing credits, the black girl is named \"Hero Girl\", a nerdy boy is credited as \"Know-It-All\", and so on. Why not give them names? What's the harm in naming Hero Boy something like Tommy or Jimmy? It's not hard.I also hated how the main characters are kids, yet the actors who do the voices for them are not kids. \"Hero Boy\" is actually voiced by Tom Hanks, although he actually sounds like a real kid. Same with Nona Gaye, Peter Scolari, and Eddie Deezen. While their child voices sound authentic, it seems like a lot of unnecessary work to digitally doctor their voices to make them sound like kids. Why not just (Gee, I don't know!) hire child actors to do the voices!?!?! It worked for \"A Charlie Brown Christmas\" (1965), and it can't be difficult.Tom Hanks doing the voices of six different characters felt more gimmicky to me than cutting edge. Hanks is far from the first actor to play multiple roles in a single movie, but Peter Sellers, Lee Marvin, or Eddie Murphy he is not. In the movies those actors were in as multiple characters, they disappeared into their characters so much that their multiple roles showed their acting ranges. Here, every character Hanks voices (except the boy) sounds like Hanks. You can tell that Hanks is the voice of the conductor, the hobo, the boy's father, and Santa Claus. The gimmick is so distracting that it takes you out of the movie for a few moments.While \"The Polar Express\" has its hang ups, it can and should be considered the first Christmas classic of the CGI-age. It still gets re-released into theaters every Christmas, as it has a renewed following thanks to great 3D effects that are becoming increasingly popular amongst moviegoers. It also is one of the only adaptations of a children's book that adds to its source while also maintaining its heart. My guess is that many generations will return to it year after year, and it will keep ringing just like the bell in the story.",
    "113": "For a Christmas movie- and a children movie in particular, this movie is really lacking in entertainment and likability.It's very simple to say why this movie is not entertaining enough. It's too artificial. Sure, the computer effects are beautiful looking and it's a really big achievement but it makes the movie also very artificial looking and therefor the movie has absolutely no magic feeling in it at all. Because of that very same reason, the characters are too shallow and the story itself is not involving or entertaining enough. I really don't understand why this movie had to be made entirely with the computer. The movie totally lacks human emotions because of this and the whole 'magical' feeling feels forced and fake.To be frank, I just don't see how this movie is much good as a children's movie. There is nothing to enjoy in this movie for the kids. There aren't really many jokes present and the characters that are in the movie are not really likable or easy to relate with for the kids. They even have no names. The story also has little entertainment value because it's not consistent enough and the events in the movie are just only highly unlikely and are not made to look believable at all. And in general, the movie is more creepy and dark looking than cheerful and happy. What an odd choice for a children Christmas movie. The movie relies too much on its 'magic' feeling...a feeling that is not present in the movie at all. Therefor \"The Polar Express\" is nothing more than a beautiful looking failure.The story is extremely simple and is told way too weak in the movie. Basically the story is one unlikely and even odd event after the other without them making an obvious connection. I'm also still puzzling what the message of this movie exactly was. I'm pretty sure of it that it's; Believe in Christmas. But it is never explained in the movie why. Other Christmas movies with these kind of messages also have a morale and explain why it's so beautiful to believe in Christmas and how it makes the world a better place. Not in this movie. The message of the movie is basically muddled in the effects and visual look of the movie. It also helps to make the movie a very forgettable one.And really, did Tom Hanks had to play basically every male character in the movie? I really like Tom Hanks as an actor but to be honest he is not good enough as a voice actor, in terms of putting diversity and character into the different characters through his voice. Every character he plays sounds the same and maybe because of that the movie also gets too distracting and for some confusing to watch.All of the characters in particular also aren't much special. Most of them are totally obsolete and some of the characters are also highly peculiar portrayed in the movie. For instance all of the elves aren't nice at all in the movie and they didn't exactly made a friendly impression on me. They were even a bit villainous. The way Santa Claus is presented in the movie is also totally wrong. In the movie they made him look like a sort of tribe leader that is treated as a king and is worshiped by all as if he is some sort of God. He is not a friendly, cuddly, cheerful guy at all in this movie.The musical score by Alan Silvestri also got highly annoying after a while. Basically it's the same 'magical' main theme being played over and over again.The motion capture techniques work out pretty good in the movie and also the animations themselves are really good looking most of the time. There also is some good action, so obviously the movie still has some good things to enjoy. It's of course far from the worst movie ever but also far from the most entertaining one. More was to be expected from a director like Robert Zemeckis, who before this gave us entertaining movies like \"Romancing the Stone\", \"Who Framed Roger Rabbit\" and the Back to the Future trilogy.OK maybe it's because I'm European that I don't like this movie. I mean, the whole magical feeling around Christmas and the whole Christmas spirit is not really a that big thing here. So perhaps if you're American you can still appreciate some of the elements handled in the movie, although I stick to my opinion that it's still lacking in entertainment- and a real good point.A failure of a movie that is from a technical point of view is interesting and good looking.5/10http://bobafett1138.blogspot.com/",
    "114": "If anything this is a movie you've have got to have seen in theaters because the experience is something else. But even that it's such a fantastic christmas movie. I can't really think of any other animated christmas movie that reaches the level Polar Express does. It has an engaging story, is extremely well paced, great voice acting and a fantastic soundtrack.The art direction, the fantasy of it all. There's so much fun put into this movie, not just the writing but the action moments, the scenery (like the twisting mountain which the trains goes around like a christmas tree).The animation still holds up extremely well to this day, it does start to show its age regarding the character facial animation though. But it's not distracting.All in all I'd add this movie to the ''must watch'' christmas movie list..9/10",
    "115": "It was December 24th, 1994; I was 9 years-old. I lay awake anxiously in bed, as the waking hours of Christmas Day slowly approached. My parents were sound asleep two doors down from my bedroom. A bunch of fans we had were still on (the slow setting), but in the otherwise calm darkness, I could pretty much hear everything downstairs.Now I'm still not quite sure of it, because maybe I was dreaming or my imagination was in overdrive, but I thought I heard the fireplace door in our living room open and close, and the shuffling around of a large, heavy sack. Was that what I think it was? Could be, or could it have been my over-active imagination at its most deceitful?That's kind of the dilemma that some children face around that age, when the question of whether or not there really is a Santa Claus is open for question. I'm sure lots of children have laid anxiously awake at night in bed for some sort of sign that the jolly fat guy with a beard and a bunch of flying reindeer and presents is flying around in a sleigh out there somewhere. Some may even leave milk and cookies on Christmas Eve and be surprised to find them all gone the next morning. Santa, were you here?\"The Polar Express\" stretches beyond the limits of the imagination and goes out of its dear way to prove to children that seeing is always believing. Robert Zemeckis, who directed the film, which is an adaptation of the award-winning children's book by Chris Van Allsburg, believes in the story the same way that young children do: the ideas presented match their own beliefs that there really is life at the North Pole and that Santa is always keeping a watchful eye on kids all across the globe.Even though I'm 19 now, this film reawakened my long-dormant curiosity in the subject, and I'm sure that any adult that views this movie with an open mind might feel the same. But again, the notion that there is a Santa Claus and life at the North Pole is just a childhood fantasy; I know this, and most other adults do too, but there's nothing stopping them from rekindling their youth.Still, however, this film almost brought tears to my eyes on a few occasions because it was a brilliant realization of something that I thought had been lost to me forever. This film does bring back the magic of Christmas, especially during the dark times of the 2004 world we live in today. We'd need something like this to escape into, to realize our dreams and long-forgotten fantasies about a time when innocence still ruled the world.Van Allsburg's \"The Polar Express\" is one of the best known books in children's literature, and one of the most daring in exploring a child's fantasy. In the late-night hours of Christmas Eve, Hero Boy (we never actually learn his name in the movie) lies awake in his bed, anxiously waiting for a sign - Santa Claus.And then his father says, who thinks that Hero Boy is sound asleep, \"Only an express could wake him up.\" Sure enough, what at first feels like an earthquake only proves to be a massive locomotive called the \"Polar Express,\" which roars down the snowbound street where Hero Boy lives.Not believing his eyes, he ventures out into the cold night to see what's what. The Conductor (played and voiced by Tom Hanks, in just one of six roles throughout the film, including Hero Boy), ushers him on board, where he's introduced to the other children, including Hero Girl, Know-It-All, and Lonely Boy, who is the last child they pick up on their journey.From there on, it's a rough, fast-paced journey to the North Pole, a place that Hero Boy once thought only existed in his youthful imagination. Upon arrival, the quartet of children embark on a wondrous path of excitement, fun, and belief as they explore their innermost feelings about a beloved character in their dreams.Christmas is the most beloved holiday of the year, especially for children, who wait excitedly for the morning hours to see what a year of patience has brought them underneath their heavily decorated trees; I know I used to, and still do.Whether you're 90, or 9, Christmas has a magic that never goes away because that little kid in you will always be there, eagerly waiting for that sign - that special little detail that's overlooked by others but is caught in your ever-watchful attention - that maybe, the big fat guy you've always dreamed of, is out there delivering gifts to children all over the world.10/10",
    "116": "A young boy goes to sleep on Christmas Eve, steady in his disbelief of Christmas and determined to prove it all a hoax this year. His vigil is interrupted though by the arrival outside his door of a massive steam driven locomotive, The Polar Express. Tentatively he boards it with the friendly but gruff conductor and finds himself in a carriage full of other children heading to the north pole. With the mystery of what awaits him at the back of his mind, the boy and his new friends get into a series of adventures on the rails.This is a family film designed to be watched at Christmas in front of a warm fire with a family including young children. Some reviews have forgotten this and have made a big deal out of the weaknesses inherent in it. The fact that the animation was so cutting edge seemed to also suggest that perhaps these weaknesses were because the majority of work was put on the computers and not the writers but personally I do not believe this is the case. Lets be honest though, the plot is a simple one where a boy goes to the north pole to meet Santa (maybe), that is essentially it. On the way there are several train-based adventures and lessons learned.It is quite fun though and I enjoyed the sense of wonder and adventure that it produced. OK I'm not going to watch it with a group of my peers on a Friday night but that is not the point. The simple story fills the running time really well with the journey structured around mini-adventures to good effect. The message is a little bit sentimental but again it comes with the territory I suppose. The animation is impressive though. I think the claims that real actors will be redundant within years is nonsense but then nobody really thinks this will happen  it is just a way to get publicity through headlines. What it does do though is shore up the wonder by producing some great sequences and shots that would not be possible without computer technology. The cast is mostly solid although this is the same as saying that Hanks is good since he does most of the voices but Gaye was pretty good as well.Overall then an enjoyable little fantasy that delivers a sense of wonder across the story and animation. OK it is probably only going to work while on the home turf of Christmas but this is what it is for and I didn't have a problem with it working just as it proposes to work.",
    "117": "This film obviously has flaws. A lot of people say that the faces are creepy, and though I don't think this, I get their point. The rest of the animation though is some of the best I have seen, and still holds up today marvelously.The music should be pointed out as well. It can be big and pompous, but also can warm up a quiet scene with heartwarming Christmas spirit music. It has some of my favorite Christmas music.The story is like a variation of A Christmas Carol, in which one with little faith in Christmas gets thrown into a supernatural scenario where he has a change of heart. I think it was excecuted well and leaves you feeling the quiet warmth and joy of Christmas.This film is obviously not for everyone, and if you are not a fan of this film, I can totally see why, but this film is my Christmas movie that I will gush about any season. I definetely recommend that you watch it at around 10 on Christmas Eve night. By the time the film ends the main protagonist is winding down and ready to settle in for what lies next on Christmas Day, like you would.",
    "118": "Yikes ! No Maya apocalypse to be able to watch crap like this ! this is the 2nd recent movie of Zemeckis that I found awful and I wonder where has gone the guy behind \"BTF\" or \"Roger Rabbit\"? Was it Bob Gale so ?I remember to have tried it month ago but then, I wasn't convinced by the dull and slow beginning. Now, pumped by Christmas spirit, I tried the whole bottle and it's worst !it's definitely not a Christmas tale but a reeducation camp: incredulous kids are abducted to accept the one and only truth. \"Learn\", \"Leader\", \"Believe\", that's what the camp warden says to them as a goodbye. During the trip, he asked for billets, make line and respect time! The pole looks like a huge factory, filled with anonymous slaves and Big bother is here to watch all naughty kids. Santa needs his crowd cheering like the best of dictator and it's the one movie about him in which he actually whips his deers!The production is sharp for nothing: the kids haven't characters and the story is just about going up and down, too slow or too fast on strange vehicles! If JK Rowling didn't stop Harry's adventures in the Hogwarts express, there a reason: nothing can indeed come out of a train trip! Now, you have been warned: If you look for true magic and poetry about Santa, prefer \"the nightmare before Christmas\" because here it's rather Satan Klauss !",
    "119": "This film is about a boy, who once believed in Christmas, going on a journey on a magical train that leads him and a couple of children to the North Pole.He doesn't believe in Santa Clause anymore, since he saw the newspapers and news that Santa was a fake. He's doubting everything including the magic train and going to the North Pole. He meets some friends. The animation is great. It's used by actors and actresses playing the characters that are in the film. The movement they do is in the film. Hanks plays four different characters: The Conductor, Dad, the Boy, the Bum, and Santa Clause.This film is really entertaining. There is major peril all over the movie and when you look at it, it's so amazing to see it. You are in awe and in shock, as you see the amazing visuals. The technology is great today that you can almost do anything with it. This could also be a sad film towards the end. The train is going to the North Pole where the first person will receive their gift before any other people in the world.This is an amazing film. It might be too scary for small children but it's OK with young kids and adults. Not many people are proud of this film but they should be. This is a great piece of artwork.",
    "120": "Ambiguity. It's not something you find too often in \"children's films\". Was the train's journey through the mountains and the snow all an epic dream? The young characters of the movie often ask themselves this question too, and I'll come to my answer at the end...By 2020's standards, the computer animations of this film may seem a bit dated. No-one goes in for this style anymore. But, it was 2004 once and Robert Zemeckis is still a bit of a visionary, despite what anyone can say. Yet, The Polar Express is beautiful. Certain shots, such as the engine twirling up the cone-shaped mountain are ingrained in my memory forever. The North Pole will always look as it does here for me; those plentiful brick buildings, shining yellow windows, miscellaneous Elves living their miscellaneous lives inside... Perhaps, the film manages to harness 2004 itself by accident.Tom Hanks voices several of the adult characters in the film, and is motion-captured for \"The Hero Boy\" too. He's great, and you can tell by the mannerisms and facial expressions that it's him. My favourite of his iterations here comes in the unsettling \"Ghost of Christmas Past\". What a cool addition to the film that was.The Polar Express is action-packed too. It's actually surprising how well each set-piece is pulled off - Roller-coaster rides down sharp slopes or drifting an entire engine down a frozen lake set to crack..! The suspense is wonderful. These scenes are more effective than any in a contemporary action flick. The movie also serves as a love-letter to railroading and locomotives in general, as Robert Zemeckis is clearly a fan. \"I've wanted to do that my whole life\" the characters say, in regards to blowing the train's whistle. The same dialogue appears in Back To The Future Part III (1990). The Express itself is an iconic, living breathing machine, and the film totally does the steam-powered beast justice.I cannot praise this movie properly if neglecting to mention Alan Silvestri's musical compositions for it. Pieces can be mysterious, exhilarating, sweeping, and, at their VERY best, haunting. I think it's his best work. Particular themes actually assist in making the film very moving. And shouldn't that be the directive of any Christmas movie? To make you smile and reminisce about that spirit from a time long gone? Santa Clause isn't real, but that isn't the point, at least not for the older audiences. The point is remembering what Christmas once felt like when you were a kid. The Polar Express succeeded in doing that for me, and by the end of it, you'll want to believe again... It's absolutely impressive, emotionally.",
    "121": "I really think that given the idea this film should have been a lot better, but too much of it just doesn't click.Firstly I think the animation was really quite poor when it comes to the actual characters. Too often lips weren't moving in time with the words and facial expressions were absent. I know the film is nearly 20 years old but other films from this period were producing much better animation.The story also drags on a bit. There are too many antics surrounding a lost ticket that just get tiresome. A strange random ghost character that seems shoe-horned in for no reason. The film should have ended 10 minutes earlier than when it did. I did like the central idea however, and there are some nice moments for sure.What was really missing for me was the Christmas feeling from this film. Until the final 20 minutes or so things don't feel particularly Christmassy with this film, which seems remiss for a Christmas film.There is good voice acting however (would you expect any less from Hanks?), and there are moments of joy to be had.Overall a bit of a dud for me though.",
    "122": "\"The Polar Express\" is a magical and distinguish animated film directed by the great Robert Zemeckis.This is a different kind of animated movie because it looks almost real (mostly the characters and the sceneries). No wonder it looks so realistic because, after all, it is entirely live action using performance capture technology. As a consequence, the graphics are amazing and the movie is technically admirable. Plus, the visuals/sceneries/backgrounds are terrific, the special effects are amazing, the magic is naturally present, the Christmas carols are nice and catchy and the movie has lots of adventure, strong emotions and suspense. A formidable combination of loud sounds is another quality. Definitely approved.\"The Polar Express\" is also a remarkable film for Tom Hanks's career. He plays 5 different roles in this movie (the Hero Boy, the conductor, the Hobo, Santa Claus and the Hero Boy's father). By the way, the conductor really looks like Tom Hanks, except that the conductor has a mustache and is bald. Anyway, as I was saying, if it's already admirable to see an actor playing 5 roles, even more incredible is when that actor is Tom Hanks. Usually I find Tom Hanks a weak actor, but he is very good here.This is, without a doubt, one of the finest Christmas's films ever made. Has everything to become a classic. Remember when we all used to believe in Christmas's magic and in Jolly Old Saint Nicholas? This movie brings us back this special Christmas spirit and some of the best memories from childhood. It even makes us want to believe again and hear the soft sound of the silver bell.A curious and original detail about this motion picture it that most of the characters's names aren't mentioned, except for Billy and Sarah. I'd like to talk a bit about the characters.First of all, the Hero Boy. He wants to believe in Christmas's magic and it's admirable how he ends up believing in Santa and all of the Christmas's magic. He is a nice and interesting character.The Hero Girl also adds a lot to this movie. Not only is she a sweet character, but above all things she befriends with the Hero Boy and Billy, helping them to restore their faith on Christmas.Billy is a gloomy and shy little boy who believes that he is the little boy that Santa Claus forgot and he has serious difficulties to trust on Christmas's magic at first... but the Hero Girl and the Hero Boy help him through this journey.\"Know-it-all\" is the typical intellectual boy. He is wise, smart and intelligent, but nerdy, funny, very talkative (he speaks very quickly too), impatient and he can be a little boring at times. But even this character changes his attitudes. By the end, he becomes more calm, patient and \"humble\".The Conductor has amazing talents with the tickets. He writes words on them without even looking at them. Simply amazing!The Hobo is a mysterious and enigmatic character. He does have a great sense of humor and he is also one of the heroes in this Christmas's tale.\"The Polar Express\" isn't an absolutely perfect film. Its negative side (from my point of view) includes the two engineers who happen to be ridiculous characters. Besides, I don't see what's the point of that Aerosmith's song and Steven Tyler's presence in a Christmas story (at least it's only for a brief moment). The Santa Claus looks okay, but a little... artificial? Could be a little better. But, overall, this is a wonderful movie. It's the movie of the year 2004.This should definitely be on Top 250.",
    "123": "There is absolutely no doubt that Christmas is one of the most (if not the most) pleasing times of the year: a time to gather around with family and friends and share the holiday spirit. Arguably one of the best family-friendly features to adore the pleasant spirit of Christmas is this computer animated feature directed by visual storytelling prodigy Robert Zemeckis. Based on the classic 1985 children's book by Chris Van Allsburg, the film expands upon the popular source material with Robert Zemeckis adding brighter characters and expanding the story trajectory on a wider scale. Further ingredients added to the mixing bowl is eye-dazzling computer animation supplied with motion capture technology to bring the story in life. And the final product is an appealing holiday showcase that not only feel magical, it's fun. Set in the 1950s, this film follows the story briefly narrated by Tom Hanks of an unnamed young boy (voiced by Daryl Sabara) who's grown up doubting the existence of Santa Claus. At midnight over Christmas eve, the boy is awoken by the roaring sound of the train that comes to a screeching halt in front of his house. Wandering outside, the boy boards the train where he meets a fellow group of children including an unnamed girl (voiced by Nona Gaye), a self-doubtful boy named Billy (voiced by Jimmy Bennett), and an obnoxious chatter box kid (voiced by Eddie Deezen). Together, these children take the trip to the North Pole where they face self-discovery and learn about the true meaning of spirit.Very few filmmakers in Hollywood accomplish stellar visual storytelling as good as Robert Zemeckis, and this animated picture showcases Zemeckis operating in this cinematic grandeur at arguably his finest form yet. With a hefty hand, Zemeckis proficiently excels in both the visual and the narrative department. The astounding world of the Polar Express along with the North Pole is gracefully brought to life through exhilarating computer animation and stunning motion capture technology used to breath into the human characters. While the cast of Tom Hanks (who also voices the train conductor), Daryl Sabara, Nona Gaye, Jimmy Bennett, and Eddie Deezen provide slick voice work for the characters; the other half of the equation is made up by another cast including Josh Hutcherson who take the roles of the characters in motion capture performances. Combine the motion capture and the top-notch computer animation and you got a beautiful world sprung to life with compelling imagery (especially when watching in 3-D). In terms of storytelling, the movie brightly shines like gold. Following the story of a young boy as he is drawn into a world of self discovery and spirit of Christmas he never knew. The message he along with his newly found friends acquire on their adventure is believing against doubt and how the meaning of Christmas carries something more than just the question of whether or not Santa is real. The concluding result is vastly charming as much as it's deeply heartwarming. The atmosphere is no tearjeaker nor a cartoony comedic fare, but it is deeply riveting especially when you witness the character breaking out in a touching musical number. Don't expect any Pixar material however! The Polar Express is a delightful Christmas animated feature that boasts heartwarming entertainment for both children and adults alike. This film makes not just for a pleasant surprise but a fine pick for families to gather around and watch during the holiday. Looking for a sweet animated feature for the holidays? The Polar Express may be one you are looking for.",
    "124": "Despite its groundbreaking, impressive use of \"motion capture\" technology and its rich gloss, this is a very uninvolving movie.Its cardinal sin is its main character, the \"Hero Boy\". He's a total bore. He doesn't drive the plot. He doesn't want anything. He simply doubts the existence of Santa Claus. His juvenile cohorts are not much more interesting, either. There is a token \"black girl\" who is, of course, a font of wisdom and strength. There is also a Jewish \"Know-It-All\" who is just an irritation.Tom Hanks, for some bizarre reason, plays all the main characters. Or rather, they used his data to create them. One character, a ghost-like \"Hobo\" who rides the roof of the Polar Express, is the most intriguing, but he's creatively restrained by the film's desire to appeal to the widest possible audience in the universe.You know you are in trouble when a film's best sequence is a detour well away from the main plot. In this, that sequence involves a ticket that flies out of our hero's hand, flits about FORREST GUMP-style and is blown across several valleys and carried by various creatures across skies and snowy wastelands until it is fatefully returned to its origins.The storyline is 100% predictable and the 3-D is accomplished but unnecessary.What burns this costly turd to the ground, ultimately, is its PC nature. It plays safe with everything. Despite one or two concessions to minorities, it depicts a cloyingly middle class, white bread version of Xmas that made me want to vomit.Alan Silvestri's score shoots its dramatic wad way too early and because Zemeckis uses it so blatantly and shamelessly to make us \"feel\" things that are simply not there, it comes across as gratuitous.I really wanted to like this film. I wanted to be caught up in the magic its advertising promised. I wasn't. I was bored.Consider the difference between this and Miyazaki's SPIRITED AWAY, MY NEIGHBOR TOTORO or KIKI'S DELIVERY SERVICE. Miyazaki's films are about characters who want something first, concepts second. They take risks, they're not consciously PC and they earn every ounce of an audience's trust and involvement.The same can also be said for THE INCREDIBLES, TOY STORY and FINDING NEMO -- all great movies because their heroes want something badly.POLAR EXPRESS is a major dramatic train wreck.",
    "125": "On Christmas Eve, a doubting boy (Tom Hanks) boards a magical train that is headed to the North Pole and Santa Claus's home.So this is based on a book that looks beautiful and people love it, but is relatively short. How do you make such a short book into a full-length feature film? Normally, you either would not try, or you would try and fail. Somehow they tried and succeeded. Robert Zemeckis, you genius.They captured the spirit, they captured the artwork... and they made it fun and even a little bit exciting. Well played, everyone. And a special congratulations to Tom Hanks for not only producing the film, but doing several voices, as well. Wow.Not sure that putting Aerosmith in the film was necessary. In fact, you know, it was not... but oh well. And there seems to be this idea that the film has metaphorical imagery for God, Jesus and the Holy Spirit. I have my doubts about that. This was certainly not present in the book, and seems unnecessary in the film...",
    "126": "I didn't like the movie. It doesn't really make me feel Christmasy, nor does it have fantastic animation. The 3D characters have faces emulated after the main actors, probably the movements are also made by a face mesh that translates real actor facial expressions. So, the only things that remain to be appreciated are the story and the non-character graphics.The plot is one of those \"Seems dangerous, but it's marvelous, so it's OK\" stories. The things that happen don't really make any sense and everything seems not to have any purpose at all. In the end the children do get to the North Pole, but it is nothing compared with what happened in the train. So the movie is about the journey, not the end.Maybe it's me, but I was bored throughout the movie, and so was my wife. I watched the last half by myself. The musical bits with the dances couldn't have been more out of place. So, no, it's not a good movie. Even for the children.",
    "127": "The Polar Express (2004) is a movie I recently watched with my daughter on Amazon Prime. The storyline follows a boy who believes in Christmas when few in his family still do. On Christmas Eve he hears a train outside and decides to get on it for a trip with other kids to the North Pole where he hopes to get a glimpse at Santa Claus before he starts his toy delivery process. Every child hopes to get picked by Santa to tell him their wishes for Christmas.This movie was directed by Robert Zemeckis (Back to the Future) and contains the voices of Tom Hanks (Forest Gump), Chris Coppola (Beowulf), Nona Gaye (Crash), Michael Jeter (The Green Mile), Leslie Zemeckis (Welcome To Barwen) and Peter Scolari (Newhart).The animation for this movie is absolutely awesome. Tom Hanks was a great choice of voices as the conductor and every second on the train is magical. I loved the magic portrayed both inside and outside the train ride. There's also some great messages on the challenges children face by the household and circumstances they're born into. The Aerosmith cameo was nice and the ending was fun.Overall this is a holiday classic that is a fun family watch. I would score this an 8/10 and strongly recommend it.",
    "128": "A young man is all excited as he heads to bed on Christmas eve. His sleep is disturbed though, when his house starts to shake. He bounds to the window whereupon he sees the arrival of a great train, one he quickly discovers is heading on to the North Pole. Safely aboard he encounters other children and adventure beckons as they learn that one child will get to meet Santa Claus himself before he embarks on his global deliveries! I didn't love this film. I found the rather sharp, linear, facial animations a bit too sterile and there is way too much chatter with not enough going on. I can play chase the ticket once, but after a while that became little better than a clunky conduit for the rather episodic nature of the narrative. I'm sure that technically it is a masterpiece of CGI and human interaction, but somehow it all just left me feeling that the cheesy sentiment overwhelmed it with it's messages of teamwork and the Christmas spirit well and truly over-egged. Alan Silvestri has provided a nice score, and when the animation scenes focus on the actual train then it does liven up a bit, but sorry - for the most part I wasn't sold.",
    "129": "I'm with the Grinches on this one.I'd never heard of the book (after my time, I'd guess), so I watched the DVD without preconceptions. Okay, maybe a positive one, since Zemekis has directed some of my favorite movies.First, the technical problem: I have high hopes for CGI characters to reach truly lifelike status on screen. Unfortunately, as Polar Express shows, the technology isn't there yet. Instead, we see characters that sometimes seem lifelike, but aren't quite. It's like Pinocchio, where we think there's a real boy there, but the face is still just wood.Then there's the story, or lack of same. A boy, at the age when one teeters on the edge between belief and disbelief, takes a magical train ride to reaffirm his belief in Santa. Good for a short picture book, but far too thin for a feature film.So what we get is mostly filler. Long, boring sequences which might have been good in themselves, but here merely seem necessary to expand the length. So we watch a ticket float through several adventures in the hope that it will land somewhere and the plot will progress.I'm not sure who this film was intended to satisfy. Old timers like me will be bored. Younger children will be terrified. (You wanna see Santa? You've gotta go through pure hell first!) Somewhere in the middle, enough people liked it to bring in the big bucks.",
    "130": "What an abysmal piece of trash. This is nothing but a lame attempt to use Hanks as a vehicle to cash in on some new 'technology'. The film is a total dud. Dumb, boring, annoying, irritating...I mean everyone looks like a freakin' mannequin, but oh wait, they MOVE realistically. So amazing. Too bad the novelty wears off in what, the first minute?The train is filled with the most annoying bunch of kids you'll ever hear. There is absolutely NO PLOT whatsoever, just a train riding around with some stupid obstacle getting in the way every 5 minutes so they can show off more of that amazing new technology. Pad this out to 90 minutes and you have TPE. The movie is so beyond hurting, I mean we're forced to sit through singing and dancing waiters for what? So things can move on screen really fast and we can be even more stunned by those amazing visuals? Its like they just threw anything and everything out there to get this to feature length.Tom Hanks is as awful as ever. I mean the guy has zero range. Every movie he's the exact same no matter how hard he tries, even his voice as a conductor is unbelievable. I'm so glad this is flopping because its not a movie, its a pathetic attempt by Hanks and some computer geeks to milk people. Next time give us a movie instead of a showcase of your computer coding. One of the worst of the year.",
    "131": "It's cold above the Arctic Circle, even if you work for a robust, often maligned caregiver. Director Robert Zamekis ('Cast Away) and Tom Hanks ('Cast Away') join forces again to make an animation based on the illustrated Chris Van Allsburg children's book about a seven-year old boy who questions Santa's existence and travels by magical train to Toyland for the ocular proof.Although the art process of 'performance capture,' which transforms human movements into animation (used also for Gollum in 'Lord of the Rings') is revolutionary in its magic realism, the characters are wondrously almost real, a fact that leads me to question why have animation at all if stylization is not a value for animation. However, the roller coaster like rides and unusual camera points of view (one time it actually looks through a printed page with the letters suspended) satisfy my need for the representational and fantastic in animation. The movie is cold like the Arctic: There is a blatantly conservative message that Boy Hero (he is not named, presumably for universal application reasons), and by implication everyone else on the train and in the world, should 'believe': believe the fussy and punctual conductor, the hobo, the boy's parents, and even the elves, when they encourage him to accept Santa (sounds evangelical, doesn't it?) contrary to what his eyes have shown him in real life and what his growing analytical mind has determined. With the appointment of Condoleezza Rice as secretary of state, the Girl The obedience motif of 'Express' reminds me of the rationale for the Iraq war and John Kerry's claim about a 'plan for the future.'Beyond the theme, the art/set design disturbs me as well. While the express is beautifully drawn and moved--when it slides on the ice you know why animation can be superior to old-fashioned photography-Santa's village is patterned after a 19th-century German factory town, which feels cold and vacant, no matter how loud the elves or how benign Santa. This revisionist interpretation appeals to my Christmas-agnostic side while it looks more opposite the spirit of the myth than the myth allows, even if following the spirit of the book. It would be like setting 'The Wizard of Oz' (which 'Polar Express' resembles) in Cleveland.What I like about the film is that Boy Hero seems a tad skeptical even after the adventure. I also like A.A.Milnes' jaundiced view: 'I find it difficult to believe in Father Christmas. If he is the jolly old gentleman he is always said to be, why doesn't he behave as such? How is it that the presents go so often to the wrong people?'There's a rumored half billion dollars needed before the company turn a profit, given Zamekis and Hanks reputedly taking a third. With the rather bleak tone of the film going contrary to the prevailing spirit of the season and the softening needs of a war-weary world, I suggest the filmmakers turn quickly to world distribution and DVD sales. Otherwise, it can be very cold even in the warm California sun.",
    "132": "13 November 2004. A tribute to technology, sort of like what the 1968 New York World's Fair was like. There is a lot of dazzle and Disneyland like effects in this special effects/state of the art animation feature film. Most of the movie feels like a retro-animation harking back to the 1960s and the positive memories of childhood, the mom and pie images of our youth. The animation is again gorgeous (though threatening at the same time as to whether it will eventually replace live actors ten years from now). The dizzying spectacle, just like Disneyland rides, the audience is given an opportunity to go on a 3-D version of a two-dimension animation scene along with a one or two musical pieces right out of a Mary Poppins movie. Unlike \"The Incredibles,\" \"The Polar Express\" is more style than content, more flash than serious movie making - it is more an experience than entertainment. Tom Hank's voice is overextended and his familiar drawl creeps up in too many of his characters to feel comfortable and becomes distracting. As a conductor and hero boy are two of the best animated characters around - but as father and hobo, it's too obvious that he's the same character. An incredible Christmas treat, eye-popping candy experience, but just one more of a number of super animated feature films that are setting a new standard in animation for years to come. For one a singular moment, this is the must see family movie of Christmas, of years gone by, of magic and hope using the most up to date computer technology available. Seven out of Ten Stars.",
    "133": "I thought I'd seen most of the major Hollywood Christmas films down the years but somehow missed out on this gem, at least up until now.Like the questioning children on the train to the North Pole, I found myself thoroughly transported by an engaging story, exciting sequence of events and of course an all-tied- up-in-a-bow happy ending. The unusual nature of the super-realistic animation technique employed took a little getting used to for me but once we get on board the train, it's full steam ahead for thrills and heart-warming sentiment.Tom Hanks is just right in his main role as the genial train conductor while the late Michael Jeter in his last filmed role is effectively, if sadly ironically, cast as a helpful ghost. The detail and vivacity in the animation compensated for the too-real appearance of the characters and there's a pleasing selection of older-style Christmas songs, that is until Aerosmith singer Steven Tyler makes an unnecessary and unhelpful cameo appearance.While not the most original Christmas story ever, the time-worn tale of a growing child's wavering belief in Santa Claus eroded by maturity with even the device of a magic train transporting children to a magical land having echoes of \"Harry Potter\", nevertheless I have no hesitation in naming this amongst the best Christmas movies I've yet seen. In fact my only major regret watching it was that it wasn't the 3D version which I'll make a point of donning when I watch it again as one my Yuletide perennials next year!",
    "134": "The Polar Express as you can see from the title of my review is my all time favourite Christmas film - now they're are a lot of Christmas movies out there but there' s just something about this film that invigorates my inner child, a sense of pure wonder and belief in the magic of the festive season.Not to mention how talented the animations in this film truely are but acting icon, Tom Hanks, plays such a magnificent job as many characters in this film - and does a great job singing too.The music in this film never fails to give me instant goosebumps and to me hearing the main theme of The Polar Express is the sound of Christmas.This will always be my favourite Christmas film and I'll continue watching it every Christmas Eve from here on out!",
    "135": "This is the movie for our time: In which not Believing, even in the absence of evidence, even in the presence of evidence to the contrary, is seen as a failing, as a sign of personal limitation. A movie in which thousands of male-only elves gather Nuremberg-style in the vast brick factory town in which they are enslaved and cheeringly salute their huge radiant white master as he emerges from his palace. In which the only annoying character, the only source of even the slightest conflict or disharmony, is a big-nosed glasses-wearing wiry-haired know-it-all kid--a classic and offensive representation of The Jew. In which a character actually says, without irony, that the true spirit of Christmas is what's in your heart. It's also ridiculously badly plotted and conceived. There isn't the slightest threat at any time, there isn't even the simplest reason given for why the train has to be on time -- not even an old standard like getting the gifts to the kids to the good children on the other side of the hill. So all the chutes and ladder chases, while fun at first, and gorgeous (the runaway ticket sequence is in itself a classic, exciting piece of film-making), get screamingly boring because A: nothing bad is going to happen if the heroes fall and B: nothing good is going to happen if they succeed. The first fifteen minutes are fantastic--even kind of rapturous--because for that amount of time it works like Van Allsburg's books do: the pure wondrous delight of the images. But what follows is devoid of humor, irony, authentic wonder or compelling storytelling, and also gives us the sappiest most forgettable songs imaginable. Did the filmmakers--who have done such spectacular work on other films--fail to note that Shrek didn't go for 50's greeting card melodies--that Shrek used an oddball, relatively obscure Leonard Cohen song, sung by the ironic, out-of-the-mainstream Rufus Wainright, to back up the love montage? It says something really good about our country that Shrek, with its irreverent humor and authentic sense of wonder, is going to beat the red velvet pants off the box office of Polar Express.",
    "136": "When \"The Polar Express\" was first released in 2004, I all but refused to see it because of the motion-capture animation style I wasn't a huge fan of. When I did finally relent, I pawned it off as little more than a children's romp. But as the film continues to cement itself as a holiday season tradition, I have grown to appreciate what it brings to the table.For a very basic overview, \"The Polar Express\" follows the adventures of a young boy doubting the existence of Santa Claus. One Christmas Eve, a mysterious train destined for the North Pole pulls up in front of the boy's house and he is whisked away on a journey that may change his opinion on the holiday season forever.At heart this is indeed very much a children's movie, albeit one that uses such simple nostalgia to perfection by being holiday-themed (so adults can buy in as well). Directed by Robert Zemeckis, \"The Polar Express\" brims with enough crackling energy that it could easily be mistaken for a Spielberg romp. Not only that, but there is enough \"quirky stuff\"--like Tom Hanks inhabiting multiple roles, inventive songs, and some legitimately funny sight gags--so that one is certainly never bored.Truth be told, about the only criticism I have of the movie at this point is that once the titular locomotive reaches its destination, I felt the proceedings lack some of the propulsion (pardon the pun) of the journey. For a 15-20 minute period, it becomes more of a stay-in-place flick--not befitting of the manic energy that produces so much entertainment beforehand. Fortunately, a great ending makes such a dip a relatively minor concern.Overall, I now very much understand why \"The Polar Express\" continues to find its way to cinemas every December. It is a well-made adventure flick that also packs an emotional punch in places. There is something for everyone--from the kiddos to the adults--to enjoy during its runtime. I'm not sure it will ever make my A-1 holiday movie list, but it is an easy/fun watch on a once-a-year basis.",
    "137": "Let's just say I feel in love with The Polar Express book from Chris Van Allsburg along with his other precious titles like Jumanji, Zathura, Ben's Dream and more with colorful pictures, perfect writing and wonderful characters, they've become so popular that only three of them were made into films and this wonderful gem is one of them. I was amazed that this was being directed by Robert Zemeckis who made such great classics like the Back To The Future trilogy, Forrest Gump, and Cast Away and since he was chosen to direct such a timeless tale, he did a great job at capturing the spirit and imagination of the book in his first motion-capture animated film.I'm gonna get to the weakest points first before I could give some praise. Although, there were some great visual details to the characters faces just like the book, there was a lack of expression on them like most other motion-capture films including Simon Wells' \"Mars Needs Moms\" (which we all know bombed at the box office and caused the ImageMovers Digital company to shut down). The story, while capturing the essence and spirit of the book, was vastly expanded into an 100 minute film, but I think it was appropriate since it gave us a moral lesson about believing in what your heart is saying.With those out of the way, let's get to the strongest points. The scenery is wonderful it was exactly like the book with the lovely sight of the Hero Boy's town, the train, the mountains, the roller coaster scenes (packed with amazing danger), and the beautiful look of the north pole. The voice acting is terrific. Daryl Sabara did a great job as the Hero Boy, Tom Hanks did surprisingly fantastic as the Conductor along with the Hobo, Santa Clause and Hero Boy's father. The rest of the actors did well at their performances with a wonderful script that is faithful to the story. Since most children's films have great songs, this movies does the same thing too. \"Hot Chocolate\", \"The Polar Express\", \"When Christmas Comes To Town\", and the pop song \"Believe\" by the wonderful Josh Groban in the ending credits were such amazing songs to listen to.Although, not a masterpiece, Robert Zemeckis succeeded in making sure this Christmas gem stayed faithful to the story (with a wonderful music score from the great Alan Silvestri) as one of the best Christmas films ever made. Thumbs up from gavinthelordofthefuture.",
    "138": "Right, I think I've watched \"The Polar Express\" twice now. So I can't really claim to say that this is a recurring Christmas movie for me. I watched it once when it was initially released back in 2004 and once again 14 years later, as my son hadn't seen it.This animated movie has a very nice and enjoyable storyline to tell and a good plot to share. I must admit that this is actually a movie that can easily be watched over and over again during the Christmas season, year after year. I just don't do so myself.The CGI animation in \"The Polar Express\" is phenomenal and it all looks very realistic, yet reminding you that it is animated CGI. And that actually really adds a layer of enjoyment to the movie.Needless to say that \"The Polar Express\" enjoys having a really good cast to do the voice acting.\"The Polar Express\" is fully and wholeheartedly an animated movie that the entire family can watch and enjoy together during the Christmas season. There is something for everyone to be experienced and enjoyed here, from loveable characters to action on the roof of the train, down to cheering once the train makes it to the North Pole. Yup, definitely a movie that you should watch during the Christmas season, if you haven't already seen it.Despite it being from 2004, then \"The Polar Express\" has the timeless appeal to it. It just seems to never lose its luster and charm.",
    "139": "I'm sick of arrogant animated movies that force us into thinking they're great even though they're classless exercises in poor taste and franchise milking. Recent examples include Finding Nemo, The Incredibles and, worst of all, Shark Tale.Dreamworks seems to be the worst among all this. Their basic logic is 'Let's see what Pixar is doing and copy that'. Come on! Pixar gave us A Bugs Life so Dreamworks gave us Antz. Pixar do Finding Nemo so Dreamworks do Shark Tale. Pixar do Monsters Inc so Dreamworks do Shrek (which turned out to be quite good). But that's beside the point. There are 2 main concerns for all studios involved in making computer animated movies. The first is to make each more realistic looking than the last. I don't care about this. I don't care how fancy the computer you made the film on is. I don't care how long you spent making it.How about some actual story or dignity? None of these films have that. Sure they have some moronical done-to-death a thousand times before messages that masquerade as a stories and can easily fool a 3 year old but the one thing they all have in common is tastelessness.The second concern is the merchandising. Where the REAL money from the movie is made! I would like to say the Polar Express is different but I dread the forthcoming Polar Express toys, books, pyjamas, monopoly set, happy meal/kids club meal, rucksack, video games, legal forms, stationary sets, airships, warheads...Christ almighty in 1987 Mel Brooks was only kidding when he mentioned the Spaceballs Flamethrower (a fave with the kids) but merchandising really is going this far. Too far.If Warner can resist this temptation with The Polar Express it will give the film an everlasting integrity that immediately ranks it higher than all the other aforementioned movies.The film itself is good, if not great. It borrows heavily from Kenji Mayizawa's Night on the Galactic Railroad in regards to the constant quietness and sense of mystery (oh and the big magical train that comes out of nowhere). My only problem is with the awkward boy the story focuses on. Yes, I know he's only a computer animation but he is extremely ugly and has an inhumanly awful, constantly blank expression.He's becoming a bit of Scrooge/Grinch. He doesn't believe in Xmas anymore and is even trying to convince his little sister of the physical impossibilities of Santa being real. As he tries to sleep Xmas Eve away a massive steam trains parks outside his house. It's the Polar Express and its final destination is Santa's Workshop.The train is filled with other kids (the reasons for them being there are never defined) and led by a wise old conductor (Tom Hanks in one of many roles) who is determined to restore the boy's faith in Xmas.Robert Zemeckis' direction is mature and well-paced. There is particular attention to the sound design and narrative that no other recent animated movie has. Sound design is not all about chucking in loads of bass, a loud score and zany sound effects as a story is not just an excuse for events in the film to happen. This is something Zemeckis understands and he floods the film with warm colors, atmospheric landscapes and sense of magic that very nearly comes together but does not fully gel. There's something missing in The Polar Express that I can't put my finger on. Even Alan Silvestri's wonderful, lively and enchanting score falls a couple of notches short of brilliance. It's one of his best but it's just missing...something. Still it's far better than any other Xmas movie for the past 10 years (Bad Santa not included). Puh-lease Warner, don't sell out this film. I don't want a Polar Express toilet seat. Let this film transcend the common stock. It's already one of those special Xmas movies that you can watch every year and I'll surely buy the DVD when it comes out. But I won't buy the toilet seat.An important animated movie for sensible grown-ups and well-behaved kids. Braindead adults and hyperactive brats can go see the Incredibles. Keep them away from Polar Express, they won't enjoy.",
    "140": "How has it been 16 years since this movie came out?I still remember seeing this movie in theaters. It was the first film I had ever seen (to my knowledge) that used the motion capture technology. I was transfixed from start to finish. It was thrilling, and yet also emotional, creating emotion with characters that don't even get names to be identified with. The music has been played every year in my house since that movie came out, and it's one I've revisited multiple times on VHS, DVD and now BluRay.It's a special movie, and it's still so well animated. It tells a very simple story about the power of believing. It's a fun movie but it doesn't skip out on the heart and soul of the source material. It was largely under-appreciated at the time (of course, in 2004 Elf was still all the rage), but this is a film I genuinely believe deserves a spot alongside the greats like Home Alone, A Christmas Story, etc.",
    "141": "Amazing. I know that the typical format for a film review is to spend ample time writing about the story, the background, the making of the film and maybe even some history on the actors or the director before getting to your opinion. But in the case of The Polar Express, I wanted to save you a lot of time so that maybe you can use the extra minutes to grab a paper and check out the local play times. The Polar Express is nothing less than a stellar achievement in film-making that will instantly become a modern day Christmas classic. Based on the book of the same name by Chris Van Allsburg, the story surrounds a mysterious train that arrives on Christmas Eve to take young boys and girls to the North Pole to help him again believe in the magic of Christmas. With a screenplay written by William Broyles, Jr. and director Robert Zemeckis, the film perfectly casts powerhouse Tom Hanks in no less than five separate roles including the conductor, a hobo, a father, scrooge and even the big man, Santa himself. As a computer animated production, you may raise an eyebrow when I write that Hanks was perfectly cast, but The Polar Express incorporates a new animation technique that allows an actor to act rather than just provide a voice over. This new system has the actor dressed in a suit with strategically placed computer chips that feed back into a computer. Known as 'Performance Capture', this process can capture live action movement, odd angles and even facial expressions that are digitally aped bring us an actor's performance instead of a simple vocal range. What is most surprising is that the actor's animation works so well that you would think that it has been mastered from years and years of evolvement with the process. From every smirk on the conductors face to every hair on the young boys head you get lost in the incredible detail of the production and by the ten-minute mark you will likely completely forget that you are watching a CG-crafted film.But it is not just the actor's movement and expressions that are a crowning achievement in this Christmas classic. The special effects and sound are equally spectacular. Two scenes, one including a ticket that blows out the window and interacts with everything from an eagle to a pack of wolves before magically finding its way back into its owners hands and a visually effective scene of the train trying to outrun the breaking ice of a lake are fascinating and more exciting than any live action perils seen in such summer fare as The Day After Tomorrow. But no highly visual picture can survive without a strong story and The Polar Express stays true to the book in adapting the journey of a group of children to see Santa's lair. The movie focuses mostly on a young boy who has grown older and is at that pinnacle where he no longer truly believes in the magic of the holiday season. His adventure includes meeting a ghost-like hobo that aides him on his quest, a scary cabin car that houses toys to be recycled and three must-be-seen-on-the-big-screen-to-be-enjoyed roller coaster type scenes that are effective enough to have you leaning to the right and left as the screen follows the tracks. This is not the first time that Zemeckis and Hanks have teamed for some movie magic. They have collaborated twice before on Forrest Gump and Castaway and this newest venture makes them the quintessential go-to team in Tinseltown. So whether they work together again in the future or not, at least we can savor their latest venture. The Polar Express is one of the best films of 2004 and can stand beside It's A Wonderful Life as a seasonal classic.Amazing.www.gregsrants.com",
    "142": "Maybe seeing The Polar Express would benefit from seeing it again on a big IMAX screen like Robert Zemeckis intended (it's been playing steadily the past few years in limited holiday IMAX runs with good results). But this isn't, if memory serves me, really one of his best films. It does contain that cheerful, strange holiday spirit that's associated with many seminal works (and like Christmas Carol there is a level of much needed darkness, like with the side-character the hero boy runs into on the train who looks like he's been slumming it in coal). There's even some suspense thrown in for good measure at times, like when the polar express comes into the city, but meanwhile our main kid characters are going underground and trying to find another way out to get to all the excitement up above. And it's a daunting task from Zemeckis and Hanks to pull all this off anyway, so as a technical marvel of animation and innovation it stands right alongside Who Framed Roger Rabbit as a grand achievement. But I'd be lying if I thought it wasn't just a wee bit creepy too.The motion-capture technique which makes up the spine of the picture is sometimes stilted and a little, um, just weird for me, though maybe some kids will gravitate to it more than I. The songs are also a downer, as high-flying as they get in spots (the conductors' song on the train), seeing Steven Tyler was painful in this situation, and the sappy song thrown in at one point reminded me of the lesser songs I heard in animated movies as a kid. And yet, even with the problems I had with the Polar Express, it achieves what it sets out to do with enough confidence to make it a \"treat for the family\", as the clich goes, and may attract them even more than I or repel them even more-so. It has its moments of ingenuity, and a great chase bit on the train involving lots of ice on the tracks. That it's less than the sum of its parts isn't unimaginable either.",
    "143": "Good thing I didn't get a chance to see it in theaters, but watched it on TV for \"free\". Otherwise, it might not have been 3 stars, two of which I give for the excellent first try of realistic motion capture. No, it's true - at times I'd forget it's not a live action movie. Until they show the faces up close, that is. The third star goes for the sincere effort of making a good fantasy movie. As one of the characters put it: \"It's the thought that counts\".Now to the bad parts, one by one:1. There is hardly any plot. The whole movie is a sequence of unconnected and meaningless mishaps, which are supposed to be adventures, I guess. Take them away and you got nothing left. I couldn't shake an impression that the movie was made specifically to turn it into a theme park ride. I wonder why they didn't? Or maybe they did and I missed it? If so - lucky me.2. The real miss is that they didn't make it a live action/cartoon combo. The \"reality\" scene should have been done by live action - that's how it's supposed to be! Yes, sometimes you can break traditions, and it works, but this time it didn't.3. What is the deal with all the broken story lines? That weird hobo on the train (I do mean ON the train) - it looks like there is a damn good story about him. Who is he? Why is he the way he is, and does what he does, and thinks what he thinks? Nothing is ever explained, except for a very vague hint about ghosts, which, of course, reveals nothing interesting. I waited till the end to find out his story, but none came! We never even learn what was that present Billy was making such a big deal about. We are being teased till the end, but never find out. Why?! And what is the deal with the two main character having no names? That was the last straw.4. But the worst of all are the supposed \"messages\" of the film. I counted three: - Love Christmas more so that you can buy more presents. - Make friends so you can say \"goodbye forever\" to them. And, last but certainly not least: - You must throw away your rationality and the ability for critical thinking and succumb to a full blown delusion... for no reason, but to have a persistent auditory hallucination\".I don't think I have to explain what I think of those messages, do I?",
    "144": "I bought this one for the child in my life and we watched it together tonight. This one breaks all the boundaries of what a child's movie should be about. I could not find a moral lesson if there was one for it feeds into the materialistic wants of the season which is exactly what Christmas has come to mean to many of us. Believe in your presents, folks, it is all, it is everything. I couldn't find a story anywhere and the beginning has to be one of the creepiest ever. This weird conductor wheedling children on to a train. Right, when every child that is streetproofed would run and scream loudly if such a conductor even beckoned from a distance. The computer animation is extraordinary but wears out quickly as the characters are so downright odd. Huge eyes, dark lips and unemotional and eerily plastic hair. Ugh. Frightening scenes of heads exploding, trains out of control with children screaming in terror, a nazi-like Santa Claus surrounded by mini-Nazis all doing and running frantically, only stopping to sing a Christmas version of \"Hail to the Chief\" as he emerges from his hibernation. Singing and dancing out of nowhere with no purpose, a funny old odd fellow sitting with a fire on the roof of the train drinking his sockwater. A travesty. Avoid. 3 out of 10.",
    "145": "The Polar Express could probably be debated about for a good long time. Funny for an animated Christmas film!! Robert Zemeckis is not new to the idea of a unique film idea. I mean Zemeckis is a master director. He's the mastermind behind The Back To The Future series, three of the best films ever made. But granted this is new territory for him and yet he takes it and makes it his own. Zemeckis and superstar Tom Hanks team up again (the first time being the over rated but not bad film Castaway.) This film puts the final nail in the sign that reads \"TOM HANKS MOST TALENTED ENTERTAINER ALIVE.\" There is nothing this man can't do or make us believe or act his way into. This is no exception, animated or otherwise. The film is about a young boy who is reaching that age where you start to realize that perhaps there is no Santa Clause. He is looking into the cold hard facts of the idea of Santa Clause and he's coming up with the realization it doesn't exist. The night of Christmas Eve when everyone else has gone to bed, the young boy stumbles outside of his house and smack into an enormous steam engine. The conductor steps down and invites him onboard to The Polar Express...the train that goes to the North Pole. The boy journey's through treacherous mountains and landscape, meets some other children who become good friends, and finally arrives in The North Pole to meet with Santa Clause himself and receive the first Christmas Present of the year. Story sounds pretty straight forward doesn't it? Nothing overly unique about that? The uniqueness comes from several things. The first is the graphics. The computer animation is brilliant, stunning, beautiful, and jaw dropping. The movements of each character are just flawless and captivating, you can't take your eyes away. The voice overs are so immaculate and Tom Hanks as several different characters breathes incredibly personality into them specifically the train conductor who is a mysterious, yet fun character to enjoy. He's protective of the children but by the book running his train. The actual film making is the key here though. If this were not a Christmas film with a lesson behind it to learn it would almost be too scary for children, it would almost be downright frightful to them. These kids have a harrowing journey through the frozen tundra, there are some extremely nail biting moments. The landscape, Christmas town, and everything in this film is just hauntingly beautiful and a little scary at times. It's different than anything I've ever seen in a film. Even Santa's elves come across as strange and scary at times. I don't think there is anything wrong with this new twist on the Christmas story. Certainly scare tactics are not new to a Christmas story. Take A Christmas Carol for example, almost a horror story at times. The Grinch, and other stories like that. But this story goes even deeper into an underworld of Christmas. One of Hank's characters in the film is a train jumping hobo who helps our hero several times but only to disappear in the snow like a Ghost. It never explains who he is, why he's there or whether or not he is actually a Ghost. The musical score for the film is also beautiful although perhaps only slightly overused at times. As I first began watching the film I thought of what a wonderful achievement it would have been to see this film in live action but as it continued I realized that it's whole heart is in the animation of it. They set up Santa Clause as this hero, a larger than life persona that for the most part we have forgotten about because he has become such an icon of Christmas. The beautiful Christmas music, the original score, the animation, the incredibly story, the action and nail biting sequences, the lovely Christmas lessons learned and the amazing acting voice overs by Hanks this film is timeless and finally a classic worthy of keeping around. I will add this to my Christmas viewing list every year!!! Although short, the film is wonderful for anyone. I insist everyone sees this Christmas classic. If your children are young, be prepared for a little scare but I think they will grow to love it!! I hope this film gets some Academy attention of some sort. 9/10",
    "146": "*removes sunglasses and takes cool guy tooth pick out of mouth*Have you ever wondered what a midnight trip to the North Pole would look like? No? Neither have I. But that doesn't stop The Polar Express from attempting to capture that journey through the eyes of a young boy. As cool as I try to act, I have to admit that it is a pretty impressive journey. I know I'll catch heat from my friends for praising a G-rated animated Christmas movie starring Tom Hanks, but I'm man enough to give credit where it's warranted.The Polar Express is definitely geared more towards children. After all, the entire story is told from a young boy's perspective. The viewer is witnessing a dream inside his head; a dream that explores that pivotal moment in a child's life where he must choose to either close the door on part of his childhood, or to keep pretending that he believes in Santa Claus just so he can force his parents to continue to give him gifts from \"Santa Claus.\" I'll never forget the fateful day when my parents closed that door of my childhood themselves, resulting in half the number of Christmas gifts in the years to come. It was a sad time, one that certainly put a damper on my 18th birthday, which was less than two months away.So unlike Johnny Betts, the kids on the polar express still have a choice. Each is on his or her own personal journey, and each has a lesson to learn.The first hour of the movie is great and moves at a very fast pace as we witness the adventures that occur as the train makes its way to the North Pole. Everything on screen is just impressive to look at - the scenery, the animation, the action, the characters. I especially liked the first-person view of the train barreling down a roller coaster-esque track. Robert Zemeckis wanted to make the movie feel like an oil painting come alive, and he succeeded. Not that I'm an expert on oil paintings and what they would look like if they were given life, but I digress.The movie does slow down for the last 20-25 minutes. Once the train trip has ended and the destination is reached, the movie starts to *ahem* lose steam. Bwahaha! But hey, prior to that, it was chugging along *snicker* at a great pace. I'm sorry. I was just trying to think of some lame puns that I'm sure plenty of movie critics are using in their reviews. I'm pretty sure I succeeded.Anyway, I could have done without the little sentimental musical number where three of the kids join together to sing about \"when Christmas comes to town.\" And macho guys might start to lose interest once the children begin to learn their individual lesson. Yeah yeah, it's all sweet and good, but it's nothing original. I won't fault the filmmakers for that. A good \"moral of the story\" in a kid's movie never hurt anybody. So if you start to zone out then just pay close attention to all the fine detail, and you'll be impressed.One of the things that I found most impressive is the characterizations of the humans. The human characters benefit greatly due to a brand new system called Performance Capture. Performance Capture is a process in which the actors wear form-fitting motion capture suits, but unlike regular motion capture, Performance Capture is able to capture genuine emotions and natural expressions. Every single movement by the actor is captured, down to the flutter of an eyelid. The result is the best CG humans I've seen. The mouth movements actually look pretty good! Most CG humans look like they've got peanut butter stuck on the roof of their mouth when they talk, so this is an excellent advancement. I'm eager to watch this system develop.One of the main points in the movie, as the conductor tells the little boy, is \"it doesn't matter where the train is going. What matters is deciding to get on.\" I don't know that I agree with that. What if the train is going to Detroit's inner-city? Or even worse, what if the train is actually on its way to Hell? What small child is gonna want to take that trip? If you decide to get on then you're in trouble, and you've got the conductor to thank. Quite the disturbing message, don't you think, Mr. Zemeckis? Oh well, it's all right to look past this and enjoy this visually stunning film.*puts sunglasses back on and places toothpick back in mouth*THE GISTIf you're looking for a movie you can take the entire family to, then go see The Incredibles. If you've already seen it, then The Polar Express is a very good second option. It's a little more child-oriented than The Incredibles, and the sappy moments might slightly grate the coolest of cats, but it's an entertaining movie, and at the very least you'll enjoy the visual experience. Rating: 3.5 (out of 5)",
    "147": "The Polar Express was released in 2004. I was 6 at the time, so I would have been in Kindergarten. In first grade, we actually had a Christmas party in class, and we watched the movie in class in our pajamas and drank hot chocolate. (Which I personally don't love, but I'll have a few sips). This became a tradition in the first grade class of our school.The fact that I can still remember that 16 years later should show how special this movie is to me. I spent many December days watching this growing up. But what is it that makes it so special? I can think of a few things.First off, let's summarize the plot. The movie follows a boy named Hero Boy in the credits, we never hear his real name. He used to believe in Santa, but is skeptical now that he is older, and hears of frauds of \"real\" Santas.Enter a train on the night of Christmas Eve. The conductor(voiced by Tom Hanks) invites him on a trip- \"To the North Pole of course, this is the Polar Express!\" and he befriends 3 other kids(a spirited girl, an annoying nerd, and a shy boy who also doubts Santa's existence) Through this visit, The Boy learns how to value the Christmas spirit, and to have faith in the fat man who breaks into his house every December 25th to leave presents and eat cookies.As I mentioned, Tom Hanks stars as The Conductor. As if he wasn't talented enough, Hanks actually voices 5 other characters- The Boy(as a narrator, not the child), a hobo, a Scrooge doll that he puppets, The Father of The Boy, and Santa Claus himself.As seen from behind the scenes footage, this movie also uses a different form of animation. Instead of being computer animated, it actually used motion capture animation. Tom Hanks(among the other actors) wore a suit that captured their motions and that was edited into cartoon form.It's very impressive, also considering that the film is 17 years old. That said, some of the animation looks \"unfinished\" and some movements look clunky (witness the kids going down a slide or screaming when in danger), so while it's cool, it's not the finest animation I have seen. That is why I give The Polar Express a 9 and not a 10.While technically not a musical, The Polar Express also has some nice songs, such as The Polar Express and When Christmas Comes To Town. However, the best song is easily Hot Chocolate. (Hence the classroom tradition.) In this scene, the Conductor asks the kids if they would like refreshments, and some chefs come in to serve the hot beverage and dance for them.To this day, if someone even mentions the drink, I often can't help but go: \"Hot! Hot! Hey we got it! Hot! Hot! Oh we got it! Hot! Hot! Yeah we got it!\"Apart from memories of school I also have memories of watching it at home. For example, if you listen closely in the first few minutes, you hear that The Boy has a sister named Sarah. That was actually my now deceased sister's name. When we were kids, my sister actually would say that the boy was named Zachary- my name. Unfortunately for her, I would find out later in life that art and fact books call him Chris, named after author Chris Van Allsburg.So while The Polar Express has flawed animation, it's still a cheerful holiday family movie with great songs, fun, and a lesson about faith and hope, not just in Santa, but in anything- from God to humanity. There are few Christmas family movies I could recommend more than this one. The Polar Express is simply a magical film.",
    "148": "I liked the film, but I didn't love it. It is an interesting story with a real holiday message. The animation was well done. For me, I never got that sense of vulnerability among the characters. There are a lot of near misses instead of a true sense of humanity. I never felt that anyone was ever in any real danger, that this was all part of the gig. Still, the visual aspects are remarkable. The North Pole is quite a place. It appears that socialism is working well. It reminded me of May Day in the old Soviet Union. I know we aren't supposed to look at things that way, but do we have a right to wonder what the lives of these masses is like. They appear to be cut from some sort of proletarian mode, doing their things to complete the task. Do they get to experience the joys and wonders their visitors do? Anyway, the trip is delightful, the special effects are awesome, and the story is touching, thought I never knew why that little boy was so depressed. In the great Christmas epics, this character would be much more defined and not so needy (the Tiny Tim influence). This one does nothing to reveal himself other than things never go his way. It's certainly worth the trip just to see the incredible events.",
    "149": "A friend of mine asked me what I thought of this movie, I told her that it really wasn't that interesting, it felt like a lot of the situations in the movie that were just designed to fill up time. She told me that I probably felt that way since it's aimed for kids. I had to disagree on this one since I noticed a lot of the kids were getting restless while watching this movie.A really easy way to judge if a 'kids' movie is a good 'kids' movie is simply watching them in the theater. About 30 minutes into Polar Express I noticed that the kids around me (ranging from about 4-12) started doing more then just ask their parents basic little kid questions, they started wiggling around in their seats in that 'I'm bored' fashion little kids do. Then throw in they started asking the really confused questions since they couldn't tell visually what was going on (little kids don't really pay much attention to dialogue unless it's a really funny one liner or mixed in w/ slapstick humor)Now if you're about to jump all over me stating that this is just what little kids do, since they've got the attention spans of goldfish, I'll have to disagree. The week prior I saw The Incredibles, and the reaction of the kids in that audience was the complete opposite of what I sat thru in Polar Express. In The Incredibles the only thing I really dealt w/ was kids hoopin and hollering to all the excitement, action & slapstick going on. I don't remember any kids breaking out in tears because they started getting bored, or bothering anybody w/ goofy questions because they couldn't tell what was going on. Instead, they just sat back & had a really good time.So what have I learned from all this My general opinion of this movie fits the general opinion of the audience it was aimed towards. The movie is drawn out and boring."
}