{
    "0": "I actually enjoy this one more than the first. Love seeing some of the iconic sites of New York City, and just what it looked like in 1992.A very similar formula to the first but obviously set in NYC, so there was a lot of potential for different ideas which I felt they capitalized on. Steady laughs throughout from all the characters. The addition of Tim Curry was amazing. Joe Pesci and Daniel Stern crack me up in their roles as the Wet/Sticky Bandits.A very good sequel that delivers in pretty much every way, especially the Christmas feels.",
    "1": "\"Home Alone 2: Lost in New York\" is young Macaulay Culkin's second greatest hour in the series as Kevin McCallister, who has to learn to be a man again on the mean streets of the Big Apple after being separated from his family once more. He checks into a swank Manhattan hotel (where Donald Trump is apparently staying at too). He's pursued again by comic bad guys Harry and Marv (Joe Pesci and Daniel Stern), and director Chris Columbus and screenwriter John Hughes keep the action and laughs coming. Tim Curry also appears as a concierge who has to prove that Kevin is on his own, and Brenda Fricker is the pigeon lady who watches over Kevin's little shoulder. There is another tricks & traps showdown at the end, which keeps the slapstick and comic violence at an all-time high.8/10",
    "2": "This is one of the few times the sequel is better than the original. A classic Christmas movie. The house traps at the end are much better than the first movie too. And who doesn't love Harry and Marv?Final grade: 9/10 ya filthy animal",
    "3": "Home Alone 2 has pretty much the same plot as the first movie, but Home Alone 2 is a very good sequel. The new traps for the Wet, er... Sticky Bandits are great. Once again Joe Pesci and Daniel Stern give wonderful performances. Having Tim Curry in this was also a treat. There is a lot of enjoyment in this movie.",
    "4": "The first 2 home alone films are classics and i watch them ever year like a couple of times each a year since i was a kid and my honest opinion is that the second one is my favourite out of the 2 probably because is based in new york and as i'm not American seeing new york at Christmas is like a dream.",
    "5": "This should have been the end of the Home Alone series, seeing that the same premise and cast were used for two films but, naturally, Hollywood just can't resist trying to squeeze more money from a proved formula. I'm not one for sequels but this was one of the handful that I can enjoy time and again, not only because the original cast is in it, but because of Macaulay Culkin's comedic ability (even as a kid) and Joe Pesci's and Daniel Stern's reactions to getting their butts kicked, booby trap style. Kevin is not forgotten (like he was last time) but hops the wrong plane after he puts fresh batteries in the family camera right before he gets to the gate at the airport (his family had all the bad luck with high winds knocking out the electric - and the alarm clock - twice). He mistakes a man with the same coat as his father and after Kevin reassures a flight attendant he's on the right plane, takes his seat ... in a plane heading in the exact opposite direction the rest of his family is going (naturally, no one realizes Kevin's missing until they're in Miami and he's in NY). Who could have thought a vacant New York brownstone could be so much fun? Sure, Pesci's and Stern's characters are more banged up this time but, hey, they started it. (The adventures in the Plaza Hotel are hilarious, as well.) Anyway, this is one sequel worth the time to watch. Just don't bother with the irrelevant, contrived, and unncessary third installment of the series.",
    "6": "I like the bit where he swings that heavy thing down and it hits them in the face",
    "7": "Home Alone 2: Lost in New York was excellent & shot beautifully. It brought back everything that happened in the first film. The same actors portrayed their roles wonderfully. A TERRIFIC storyline. It has laughter throughout the movie, love, thrilling moment and also blossoming friendships. I WOULD HIGHLY RECOMMEND THIS MOVIE TO ANYONE!!!!! A++ Film.",
    "8": "This Time Kevin McCallister played once again by Macully Culkin is on a trip to Florida with his family. He follows the wrong person and ends up on a flight to New York. There The Wet Bandits Harry played by Daniel Stern and Marv played By Joe Pesci are on the loose and after Kevin.This is a better film than the first. John Hughs is a wonderful writer and has gone on to making and writing classic films such as Pretty In Pink with Jon Cryer. This is a very funny film with great casting and wonderful storyline. People dismiss this film but I love it because in the first film he is just Home Alone but in the second film HE IS IN NEW YORK! Check this movie out right away.Rated PG For Comic Action And Mild Language.2hrs/120min.****/****",
    "9": "I love this movie. It is not as good as the first movie but that isn't because it is not funnier, or it in general just isn't as entertaining. It is because it copies the first film way too much. A lot of stuff has a really low chance of happening, just like the original, and without spoiling it I will just say its very similar. Now that we are finished the bad things about this movie, lets get to the good things! This movie is the funniest film out of the Home Alone franchise, and I think most people will probably agree with me on that. Macaulay Culkin did really well, and so did everyone else in the main cast. This movie is almost as good as the original, (which is also 8/10) but I\nI wish the story was a bit more original.",
    "10": "Home Alone 2 is great! It's fun and filled with heart. The scenes with Kevin and the Pigeon Lady are sweet. The thieves and the pranks are amazing as always, and filled with a ton of laughs. And the toy store and hotel scenes are terrific and gorgeous.\nOne thing that bugged me was the mother. I was really disappointed that the mother didn't learn from the first movie, and that she didn't get mad at Buzz. Kevin honestly didn't do anything wrong except causing a scene.\nOverall, it's another must watch every year.",
    "11": "***Starring: Machauley Culkin, Joe Pesci, Daniel Stern, and Catherine O' Hara.The same boy who was accidentally left Home Alone a year ago, accidentally takes the wrong flight.  Instead of arriving in Miami with the rest of his family, he arrives in New York!  The same two robbers that failed to rob his house last time, coincidentally arrive in New York to rob another place! What a small, freakin' world.The movie has the same number of slapstick humor and the same amount of fun, so this should be a holiday treat.",
    "12": "I have seen this movie at home. I love this Christmas film. Marv and Harry are funny. I like the part when Mr. Duncan gives Kevin McCallister the turtle doves then gives it to a friend to be friends forever. Whats not funny that Buzz McCallister calls Kevin McCallister a trout snipper. When Kevin McCallister comes out Duncan's Toy Chest store then also Marv and Harry come out Duncan's Toy Chest then Harry say \"So where to next\" then Marv says \"should we go to the Central Park Zoo\" that was hilarouis. Watch this Christmas movie soon when you buy or have it for a present for Christmas then people all around the world for Christmas will love this Christmas movie.",
    "13": "Macaulay Culkin is so wonderful throughout constantly endearing and sweet at times! Many legendary quotes that never cease to get old. Crazy I was born the year Home Alone 2: Lost in New York came out. Chris Columbus has made so many gems or been part of so many lovely films; so heartwarming!",
    "14": "The first Home Alone was liked by everybody. I liked the first one but this is awesome. I like the adventure in this one, in fact this is better than Home Alone 1. Everybody thinks Home Alone 1 was better than this, but I think this is a little better. The booby traps were even better than the original, like there was one where Marv was electrocuted. I didn't think Home Alone 3 was bad, but Home Alone 4 was a complete disaster. Its strange how this can be called ''Home Alone 2'' even though kevin is not in his own house. A 6.5/10 is underrated, so I think that should be raised a little bit more. At least they had the same criminals as the first one, because 3 had different criminals. That's all I can say, so overall, this movie was a great movie.I give this a 8.5/10",
    "15": "It's still my favorite sequel. Kevin being alone in New York City before Christmas. I like the story. I've watched it more than a hundred times. I remember playing the Home Alone 2 video games on SNES and Sega Genesis. Tim Curry is hilarious as Mr. Hector in the Plaza Hotel. This film has a lot of comedy and great laughs. The first film and the sequel are still my favorite and they're the first two films on my favorite entertaining list.",
    "16": "I find this festive and Yuletide Sequel to the First Home Alone is Equally Good, Because it is very hilarious, heartwarming and it's also teaching a very good moral is Never Judge A Book By It's Cover, The Hilarious Part is Kevin McCallister's awesome traps for the Harry and Marv yet again, While the Moral Part is The Pigeon Lady's Character, Like Her Counterpart Old Man Marley, You would think that She is Scary and Threatening Woman, But That's not true, She is a Sweet, Pleasant and Kind-Hearted Woman, Who is friendly towards the Animals, She is telling her backstory Why She is lonely, Because She broke-up by her Love Interest and She felt very sad, But Luckily Kevin McCallister kindly advices her to be beloved by her friend and giving a wonderful gift that is one of the two turtle doves ornament for friendship and companionship, and She agrees, I'm giving this a 9/10 and Merry Christmas.",
    "17": "I have no idea quite why, but Home Alone 2 is my favorite movie of all time. I have the board game (made a while back), tons of books, the piano book as well which I play all year round and I've watched the movie about 80 times so far. I can recite every line and know pretty much everything bout the whole movie. There's just smoothing about this one that is so much better than the first. Perhaps it's just the whole New York scene and I think the bandits do better acting as well. I CANNOT stand Home Alone 3 though. They totally spoiled it and ruined the whole \"Home Alone\" title. The actors are terrible and the movies just plain sucks. If anyone wants to talk bout the movie with me, don't be shy.",
    "18": "Home Alone 2: Lost in New York (1992): Dir: Chris Columbus / Cast: Macaulay Culkin, Joe Pesci, Daniel Stern, Catherine O'Hara, John Heard: Recycled piece of crap that completely copies everything from the first film. Chris Columbus does nothing more than duplicate the success of the innovative first movie only this time Kevin is stranded in New York while his family is flying off somewhere else. And what are the chances of the two criminals from the first film breaking out of prison and ending up in New York? And they fall for the same stupid booby traps. Joe Pesci embarrassingly tries not to swear, and Stern is just plain juvenile in his \"sticky bandits\" bit that grows old fast. Catherine O'Hara and John Heard as Kevin's parents more or less sleepwalk through this junk. We are given that closeup realization of O'Hara where she screams, \"Kevin!\" Cutting her hair short doesn't render this anything other than a complete re-read. Macaulay Culkin was sighted as the new find when he played Kevin in Home Alone. Now it gets old and the traps are less believable this time out. The Christmas decorations are a sight to see and the atmosphere fits the mood but the screenplay is about as lazy as writing gets. We even replace the snow shovel guy from the original with an old woman covered in pigeons who will come to Kevin's aid. Watch the first film and hope that this dread gets lost in a New York sewer. Score: 2 / 10",
    "19": "Home Alone 2  Some Minor SpoilersHe's up past his bedtime in the city that never sleeps.After the tragic events of the first `Home Alone' film, a now ten-years-old Kevin McCallister is having a bit of a problem. He's been left by his family. Again. Only this time, he's not at home. He's home alonein New York City! And  wait for it  there are some reminiscent faces in this sequel that may be more than reminiscentcriminals Harry and Marv are in NYC too, and they have payback for young KevinThe original cast and crew are reunited for an all-too-familiar sequel in this star-studded comic fantasy.Macaulay Culkin is (supposedly) ten or twelve in this sequel. I can't remember. Anywho, he looks almost exactly the same as he did in the last film. Maybe that's because `Home Alone 2' was filmed barely a year after the first was released, giving Culkin little room to grow. `H:2' is basically the height of Culkin's career before he went on to star in flops such as `The Good Son' (not only a box office flop, but an awful, dull movie).\nJohn Heard and Catherine O'Hara are back as well, as Peter and Kate McCallister. Thank goodness they got them back for the sequel, otherwise, this would have been a bad movie.But the actors that I am very surprised they got back for this sequel, and both really made this movie, are Joe Pesci and Daniel Stern as Harry and Marv respectively. After Pesci and Stern's characters escape from jail, they come to New York and spot Kevin walking down the street, and instantly plan on getting revenge, all the while planning a heist of a toy store on Christmas Eve! That's where Kevin steps in and creates some all too familiar (literally the exact same as the first) booby traps to stop the thievesThis movie takes some fresh scenes  Kevin checking into an expensive hotel with his father's credit car  but never enough. Almost all the scenes are re-hashed from the original, leaving little room for new material. They even go for a sentimental bird-lady scene, much like the one with the shovel man from the first movieNevertheless, the sequel still has some good moments. Hotel owner Tim Curry walking into the hotel room and seeing the outline of a man in the shower comes to mind (Kevin has an inflatable clown his Aunt bought him in the shower to fool Curry), and I only wish they had come up with some more original booby traps at the end. That's the downfall of this film.\nWith a few more cameos than the first film (Herbert Hoover), `Home Alone 2: Lost In New York' is worth seeing, even if originality isn't its main trait. I also wish they could have brought back John Candy as a small cameo (reprising his role as Gus Polinski: Polka Band Chief) for the film, but they didn't. Oh well. There are some other good stars in this film, anyway`Saturday Night Live' skit man Rob Schneider co-stars.3/5 stars (as opposed to 4.5 for the first film)John Ulmer",
    "20": "I remember I was 10 years old in '92, I used to watch that movie at my old house where I grew up but I was sitting on the floor near the TV in the living room. Oh, yeah, my favorite part is Macaulay (Kevin McAllister) was walking around in New York when he was lost then later, he went to the toy store to buy something then these 2 bad guys found him then Macaulay (Kevin) was screaming same thing then run away from these 2 bad guys in the city of NY but it was so funny because I loved Macaulay's screaming that make me laugh so hard! I remember Macaulay as Kevin put everything for his ideas of his plan to do for these 2 bad guys but it is so funny. His brother Kieran Culkin (Fuller McAllister - Kevin's cousin) was a cute kid and wears glasses in that same movie as his brother Macaulay. I loved that movie very much since I was a little kid. That movie is the greatest and funniest one that I ever seen!",
    "21": "Saw a Re-Release of this at my local Cinema for the 30th Anniversary tonight & have of course, seen this before on VHS when I was a kid & loved then as I do now!The film sees Kevin McCallister & the family going on Holiday to Florida for Christmas! But... due to history repeating itself, they find themselves sleeping in & rushing around to get to the Airport gate on time & end up losing Kevin in the ensuing rush! It's then Kevin finds himself going on a plane to New York & basks in his freedom to have the Holiday he wants! However, the Wet Bandits Marv & Harry, have busted out of prison during a riot & once again at it with their criminal behaviour as they plan to rob the charity fund at Duncan's Toy Chest! It's now up to Kevin to foil their plan, put them through more brutal traps & save Christmas to be with his family!I found the film to be pretty good & slightly better than the original! I mean, the original is classic no doubt, but this one up the ante more & has a more involved story line! The traps are even more brutal than before & the darker tone does make things interesting! The house invasion is roughly the same albeit in a different house that isn't in lived in & being renovated! The characters are great as always, especially with Kevin, Marv & Harry!The film I will say does drag somewhat with a 1 hour & 56 minute runtime! I mean, it's not bad, but it could be shorter with better pacing! The film is feel good like & has a pretty satisfying conclusion! I'm glad they didn't make a 3rd Home Alone Film with the same family as it was would've got repetitive otherwise!Overall, it's a classic sequel to a classic original! It's slightly better than the first Home Alone & is more elaborated on with more brutal traps & action to be had along with a great change of scenery too!8/10.",
    "22": "Thinking about all the sequels of films, I genuinely feel Home Alone 2 had it bang on completely matching how great the first one was.",
    "23": "This is of course the sequel to the classic Christmas film Home Alone, and it doesn't disappoint! Taking place in new York rather than the McAllister home, it has the same characters, some similar themes and scenes to the original, but without it feeling too much like a complete copy. If you enjoyed the first film then this is definitely worth seeing as it has similar events and humour. It may feel a bit familiar but it is still filled with hilarious and sweet moments.\nKevin smiling innocentlyPlot SummaryInstead of leaving Kevin (Macauley Culkin) at home, this time Kevin gets on the wrong flight, meaning he ends up in New York whilst his family are in Florida. As Kevin says \"My family's in Florida..I'm in...New York?!\", and what could be better, especially when you have your dad's credit card! As in the first film, seeing Kevin living his best life, but this time in New York and in the posh hotel is incredibly entertaining.Of course the film has to have its villains, and the 'Wet Bandits' are back for round two, but this time as the 'Sticky Bandits\"! We'll ignore the massive coincidence that Harry (Joe Pesci) and Marv ( Daniel Stern) end up in NYC at the same time as Kevin, and then in such a big city actually meet him! Anyway, Harry and Marv are planning to rob a toy store, and for some reason boast about it to Kevin.Kevin also meets a 'Pigeon Lady' and spends a lot of time chatting to her and having a generally uplifting and heart-warming conversation about love, trust, and friendship. After this interlude from the action, Kevin sets up traps in his uncle's empty house where he plans to lure Harry and Marv. Harry and Marv endure a load of injuries, just like the first film.Meanwhile, Kevin's family did eventually realise he was missing and finally track him down to New York, where they have to then try and find his exact location!ThoughtsHome Alone 2 takes some of the best bits from the first film and changes them enough so they feel familiar but are just as funny! I prefer the first film, just because I saw it first, so when I saw this film, seeing Harry and Marv getting hurt by all the traps etc set up by Kevin felt a bit repetitive. I feel that part of the film dragged a bit and could have been made shorter.\nKevin throwing a black heavy object\nInner strengthI also liked how Kevin's family were in the film a bit more, and seeing his mum search New York to find him. The scenes with the whole family in the hotel were hilarious too, especially when the bill came through...In my opinion the rest of the film is as good as the first film. I liked the addition of the toy store, with the two doves and also as another 'scene' for Kevin to disrupt Harry and Marv's crimes. However, (and this might be an unpopular opinion), I wasn't overly bothered with the 'Pigeon lady'. I liked that she was in it, and it was nice that Kevin made her happier, but I preferred his relationship with the old man in the first film. She added to the film, but also slowed it down and made it drag on a bit, so I would have liked her incorporated in a better way (but don't ask me how as I'm not sure!)Favorite SceneAbsolutely only one contender for this, and it is of course \"Merry Christmas ya filthy animals!\" One of the scenes that was perhaps better than in the first film, and is a truly laugh out loud moment. The faces of Tim Curry as the concierge and the rest of the staff (especially when 'Cliff' is mentioned) were truly iconic.Absolutely love it.Favourite Character\nHotel staff- the bellboy, concierge, and clerk\nIncompetent but brilliantKevin is an obvious choice, because he is the film! But aside from him, I did like Hester Stone, the desk clerk. It was only a small role but she was incredibly mean, condescending, and funny! All the hotel staff were brilliant.Her faces during this conversation and her \"I'm confused\" gets me every time. As well as Kevin just being weird/clever/funny as usual!Final ThoughtsOverall, Kevin is the undisputed star of the film! I love the beginning of the film, and everything about Kevin in the hotel. I don't like the traps as much as the first film as they feel a bit forced, repetitive and like they're trying too hard to be funnier than the first film and for me it doesn't really work. the rest of the film is fab though!It is definitely worth seeing (unless you hated the first film...) as it is impossible not to find it funny! And there are some nice, deeper, quieter moments integrated into the slapstick fun, as with the first film, which makes it a little bit more than just a simple comedy.Don't get me wrong though, the comedy is the main attraction of the film!",
    "24": "New city. New traps. Same characters. Home Alone in New York is a successful sequel, almost better than the original one! It has iconic, comedic scenes again that just always make me laugh! I absolutely love the NY lady who punches Marv and Harry 😂 and the traps are more painful and bigger in this sequel, thinking how in the heck did they survive (okay, lets not think realistically about this or other in this like a hotel letting a ten year old check-in). There is nostalgia and good fun in this and Kevin is great, like all reappearing characters. The hotel staff is fun especially Tim Curry. A must rewatch also on Christmas.",
    "25": "Watch this movie on Christmas. I watched this movie about 20 times and i laugh like i watch for first time. If you missed this funny movie you have a reason to watch Home Alone 2. For some reason this is the last perfect movie from this franchise.",
    "26": "If you liked the first film at Christmas, good news, a new goofier sequel with the same cast as the first film. This time the McAllister family are going on holiday to Florida and instead of them leaving Kevin (Macaulay Culkin) at home, they bring him and he gets on the wrong plane. He accidentally goes on a plane to New York, his wish came true again. Kevin decides with the help of his good lying and Talkboy to get himself a room at the Plaza Hotel. Only problem is after a little while he is found out. But a bigger problem, the two crooks from the first film, Harry and Marv (Joe Pesci and Daniel Stern) have escaped from jail and are coincidently in New York. Another empty house filled with deadly gadgets and new goofy jokes to be seen. Also starring Catherine O'Hara as Kate McCallister, Tim Curry as Mr. Hector, Hotel Concierge and Rob Schneider as Cedrick, Hotel Luggage & Bell Man. Good!",
    "27": "I really like home alone 2: lost in New York its better than home alone its better than home alone 3 and its better than home alone 4. this film for me is one of the greatest films i've ever seen. it is the best comedy of the Ninetie's and there is no doubt about that at all. this film is a brilliant, one because of the things people get up to in it. now if it was my opinion i would give that ten stars out of ten stars and there is no doubt about that either. it is a bit better than the first one if you asked me and ten times as good as the home alone 3 and the even worse one home alone 4. not every one might think that this is brilliant but i do. i don't know if everyone else thinks what i think but like i said before different people have completely different opinions.George Age 8",
    "28": "This is the typical Hollywood effort to capitalize quickly on a financial success. It's not that there isn't some fun here, but everything seems much more contrived. Of course, the fact that Kevin is left behind again is the first contrivance. Joe Pesci and Daniel Stern are now the \"Sticky Bandits\" and are out of jail. The family is in New York and things begin to fall apart. Of course, what this is really about, is how much abuse one can inflict on the two idiots as they try to pull off a huge heist. Add the elements of their actions affecting poor children and the appearance of the bird lady in Central Park, we have efforts to pull at our heartstrings. Things ring hollow, mainly because the first movie did this well and this one didn't. There is one nice part of this movie and that is the byplay between Culkin and the irrepressible Tim Curry, the receptionist at the Plaza Hotel. I never miss anything Curry is in because he sparkles with evil joy. Watch this movie to see Curry. I have determined I will never invest on minute in Home Alone III.",
    "29": "The setting of New York City during Christmastime is fantastic. Like the original, Home Alone 2 is a nostalgic movie for me, and was the first one I saw between them. It has such an advantage in using the very same cast and crew as it's predecessor, and for this reason, they go hand-in-hand. Why then, do I think the first film is superior?Home Alone 2 doesn't work as well because it's telling the same exact story as the original. Manhattan is merely a bit of icing. That's not to say Home Alone 2 isn't loaded with the same whimsy and overall entertainment value of the first. John Hughes still delivers on the comedic goods, and the Christmas Spirit is perhaps higher here. A sequel which repeats the original's outline nearly beat for beat is ideal for a family series like Home Alone. Familiarity is always inviting. That's not the problem. The problem is as simple as, when comparing them, you have it in the back of your mind that the first movie already did all of these things. Alone; what does this sequel pull off? The atmosphere of New York City in the 90's is all well and good, and Tim Curry as Hector the Concierge of the Plaza Hotel joins Daniel Stern and Joe Pesci as one of the iconic bad guys of the franchise. There's a new running gag, where this astute businesswoman keeps smacking Marv due to miscommunications. While that's all, I think that's the point. What Home Alone 2 lacks in new stuff, it makes up for in variating the exisiting stuff, usually in the form of jokes. The in-universe sequel to the in-universe mafia picture of the original film; 'Angels With Even Filthier Souls' appears here, and just as the Pizza Boy and Marv were pranked by it in the first film, this time it's the hotel staff's turn. \"You was here last night too, wasn't ya?\". Hector's reaction to the silhouette of an inflatable clown in the shower dancing along to Uncle Frank (Gerry Bamman) singing 'Cool Jerk' is great, another callback to the first film where Kevin McAllister (Macauley Culkin) tricks the burglars into thinking his house is full of partying people. The traps are more excruciating here. That staple gun rigged doorknob has got to be my favourite. No-one else could've pulled off the slapstick better than Pesci and Stern. Generally they're more outlandish here, and their comedic timing never falters. The scene where Marv slips ice skating, before Harry informs him of their new score is a highlight. That's why I'll always commend this movie. It proved you could do, essentially, the same thing twice and still retain some of that magic. The Wet Bandits, now Sticky Bandits' plan to knock off Duncan's Toy Chest, inadvertently robbing ill children of their Christmas, adds more stakes to this sequel. Being prison escapees in this one, you also get a bit of their vendetta against Kevin McAllister. Harry may actually want to shoot the kid. It's cool and I appreciate that the film went there. These darker tones are also prevalent in a scene where Kevin wanders the streets of Manhattan at night, and sees some disturbing looking folk. He's truly 'Lost In New York' as the film's subtitle suggests. It's not underplayed at all, unlike some earlier moments. His mother running frantically through Times Square looking for him, insisting that the police officer help her is also very realistic emotionally. John Hughes remembers, that Kevin is, after all, only a little boy.When you watch Kate (Catherine O'Hara) reunite with her son again, or the Pigeon Lady (Brenda Fricker) befriend him just as Old Man Marley (Robert Blossoms) did in the original, you realise that Home Alone 2 is a replica but not a fake. It's still to me, as closely knit to the holiday season as the first movie. Both are cut from the same cloth, and together, form a bit of a family, much like the McAllister's. Therefore, Home Alone 2 is still a classic. It wasn't out to top the first, and nor did it need to... 'Lost In New York' provides ample laughs and all-around enjoyment for a couple of hours, and I wouldn't have it any other way.",
    "30": "Macaulay Culkin is still cute one year later. This time Kevin gets on the wrong plane. He goes to New York and his family to Miami. Kevin is alone in the big city. With his father's money, he books into the Plaza. He must outsmart the suspicious concierge Tim Curry. Then he runs into The Wet Bandits (Joe Pesci, Daniel Stern) once again.I'm willing to accept the Wet Bandits to return in this sequel. It makes no sense, but that's not the biggest obstacle. The biggest obstacle is the repeat of the first movie. I don't understand why they feel the need to copy. They had a fun setting in the hotel. It would be so much more interesting to have the hijinx there. Kevin pulls a funny fast one on the concierge. The movie needs more of that. Imagine if Kevin had to outsmart all three of them at the same time. That would be a much better sequel.",
    "31": "When I heard Daniel Stern speak at Lewis and Clark College in September, 2004, he explained that in the case of \"Home Alone\", everything was pretty ridiculous, but at least they only did it once; he affirmed that with the second one, they just repeated everything. He's right. \"Home Alone 2: Lost in New York\" does repeat everything. And is it really appropriate to make various and sundry injuries look funny? Personally, I don't know why they have to make sequels (for the record, there was even another sequel or two after this one; fortunately, this was the last part of the franchise that I ever saw). All that I can say is: trust Daniel Stern and avoid this movie.",
    "32": "HOME ALONE 2: LOST IN NEW YORK, to me, is an excellent Christmas flick. In my opinion, the traps that Kevin (Macaulay Culkin) set for Harry (Joe Pesci) and Marv (Daniel Stern) were even more hilarious than the first. They were also more dangerous, but not that much more dangerous. I mean, Kevin set two of the same traps that he did in the first HOME ALONE. Personally, I thought that the Plaza Hotel was, indeed, luxurious and spacious. When and if I go to New York City, I'm going to stay there, even though I know it's expensive. If there were two bumbling burglars were after me, I would be really scared. The one thing that really amazed me was that Kevin got around New York City all by himself without getting hurt. In conclusion, I highly recommend this excellent Christmas flick to all you Macaulay Culkin fans who have not seen it. When you see it, prepare to laugh and enjoy yourselves.",
    "33": "Home Alone 2: Lost in New York is an underrated MASTERPIECE that deserves to be recognized along with Home Alone 1, both films are AMAZING WONDERFUL Christmas Films that can't ever be replaced with the other later films in the franchise; HA3 & HA5: Holiday Heist were alright while HA4 & HSHA are the WORST Christmas Nightmares ever made, \"Keep Ya Sorry Asses Away from the only GOOD 2 Films I Love With All My Heart Ya Filthy Animals!\" But anyways Home Alone 2 is the BEST Christmas Sequel Ever Made and deserves love no matter how much it rehashes its Original film, you sure can beat it but you sure can't replace it!",
    "34": "First of all i'm not going to comment on the first home alone. It was a great movie in all respects. The second one though, gets pretty dry. Don't get me wrong, it had its moments, but the concepts were over done. The first plus i do have to give the movie though is how Kevin got sent to New York. Mistaking one person for another is pretty believable since he's a kid. But from that point it was pretty average. The mom screams again and Kevin is alone in new york having the time of his life. The problem is this really doesn't make a whole lot of sense. In the first one, he was like OK somethings up but at least he's in his own environment/city. In the second one a \"normal kid\" would be pretty scared since hes in a city hes unfamiliar with (Then again Kevin isn't a normal kid is he?). So once again he creates mischief which was funny on some parts (rob Schneider and the rest of the hotel staff was pretty funny) but throwing the burglaries again got kinda old. Going through the house with traps was getting pretty ridiculous. The first one had traps that were pretty harsh and you would think like alright, maybe a grown adult could keep going but in this one it was like BullS***! Getting hit in the head with a brick from that height would kill anyone (which is pretty funny if you stop and think about all the misdemeanors and felonies Kevin has committed). The problem with this sequel is the producer wanted to up the stakes and make it better than the first, unfortunately by increasing injury degree of the traps made it seem disbelivable. Another point is the bird feeding lady. So what? Kevin gives her a turtle dove, how is that really going to help her? Of course it was a family movie so she was like \"Thank you\" but seriously, he just helped a major toy corporation from getting robbed, he gets a grip load of free presents, free hotel stay but he can't seem to think that money isn't something a less fortunate individual wants right? (Which reminds me, it really tried to make taxi cab drivers or low class individuals seem dishonest, scary and basically a stereotyped image of what you see in the media.) The robbers were still there classic selves, but they seemed to be just bodies in the movie who get beat up, the movie didn't really give any new angles or character depth to them. Probably the most irritating part was when buzz was doing the whole drum thing on Kevin's head, with everyone laughing, but when Kevin retaliates they get mad at him?! Is it any wonder why he will grow up to be a misled youth. Your supposed to feel sorry for Kevin, and you do, in both movies, but this one went to extreme. He's the black sheep of the family, the one everyone picks on but the movie doesn't give a heart warming satisfaction that Kevin's family will be OK from that point on (which is probably why the producer bailed out on home alone 3 with Kevin in it). Overall the movie was average in some parts, irritating in others, funny in other parts and pretty much unrealistic in other parts of the movie.",
    "35": "This movie came out when I was 14. I love it so much, I have watched a million times in my life, and will never stop loving it!Its even better than the first, without a doubt my favorite Christmas move in the world.\nThe cast are amazing, giving us more of what we loved in the first, and its full of heart as well as being funny.Love it always!",
    "36": "Home Alone 2 has pretty much the same general plot as the first one.a few of the particulars have changed,including the location.this time Kevin is Lost in New York,while his family is somewhere else.the 2 bumbling Robbers,Marv(Daniel Stern)and Harry(Joe Pesci)return and of course meet up with Kevin and slapstick ensues.this movie is a bit longer,and i felt it took a while to get going,but once it does,it's very funny.the booby traps Kevin designs are just as elaborate and cause a lot of pain and grief for Harry and Marv,and a lot of hilarity for the audience.this movie is a bit more touching and heartwarming than the first one,and at least as funny.the only downside for me is the slow beginning.otherwise,it pretty much lives up to the first one.for me,Home Alone 2 Is an 8.5/10",
    "37": "Home Alone took everyone by surprise when it became the top money-earner of 1990. Director Chris Columbus, writer/producer John Hughes and most of the cast and production staff reunited two years later for this sequel, Home Alone 2: Lost in New York. But the cynic in one has to ask, did we really need a sequel to Home Alone?It feels like everyone has returned because they knew they had a sure-fire hit on their hands rather than any pressing concern to continue this story arc. This was Chris Columbus' first time directing a sequel, and as expected, he falls into the exact same trap that cripples many a sequel. He fails to do anything different with it.It may have traded in being left at home for the city of New York, but its still the same exact story as last time. Kevin McCallister (Macaulay Culkin, obnoxious as ever) is separated from his family at Christmas. He enjoys the freedom to do whatever he wants. Until things turn sour. The burglars are back, and just happen to be in New York as well. He sets up another mine field of home-made booby traps for them. The lonely snow-shoveller from Pt 1 has been replaced with a lonely pigeon lady. She rescues him. He gets reunited with his family.Home Alone 2 feels like a much more calculated attempt to recreate the successful elements of Home Alone. The first was not quite a holiday classic, but it was reasonably successful. Due to John Hughes' fine screenplay rather than anything on Columbus' part. Pt 2 sticks to the formula laid out by Pt 1 with an almost alarming reverence.It ticks off each situation like a check-list. And I'm afraid the fault for that lies with John Hughes. His script has none of the tiny amusements or sharp insights that propelled the first film. He's just copied his own screenplay, and grafted it onto a new setting. I think it was around this point that John Hughes sold himself out to Hollywood. Nowadays he only churns out increasingly formulaic fluff. Merely the same concept with whole different actors.Chris Columbus has also borrowed an idea or two from his debut feature, Adventures in Babysitting. The story of four kids lost on the streets of Chicago one night. That film always seemed like a missed opportunity to me. Chris Columbus is far too bland as a filmmaker. He played the whole situation too safely, and never really got the best out of it. In fact when I first saw it, I thought if it had been made by John Hughes, it could have been a much better film. I was hoping for that with Home Alone 2, but unfortunately I didn't get it.This is an even greater disappointment. Columbus' blandness coupled with Hughes' lack of imagination all adds up to a very boring film. Home Alone 2 never really ignites. It misses the natural warmth and amusing developments of the first film by a mile. There is something almost mechanical to it all. Like watching different plot points clicking into place at exact moments. But the one thing that really works against the film is Macaulay Culkin.Home Alone got a lot of mileage from young Kevin's innocent, wide-eyed view of his predicament. By this point, that innocence has all but gone. Culkin's precocity has completely taken over, and now he's just an obnoxious brat we couldn't care less about. Its impossible to feel for his plight because he's so unlikable. And having him mouth inane sentiments in a shallow attempt to make him seem wise only irritates. They lack any conviction and hollows out an already empty film.We do get a few amusements from some of the new members of the cast. Tim Curry gets a few laughs as the manager of the Plaza Hotel. In a performance seemingly modelled on Basil Fawlty, his growing suspicion of Kevin is pretty funny, even if he's a bit stupid to be suckered in by Kevin's tricks. And Dana Ivey and Rob Schneider fill out the cast nicely as the equally suspicious (and equally stupid) hotel staff.But nothing else works. There are times when Home Alone 2 thinks its being really clever, by dropping in knowing references to the first film, in a vain attempt to make you think this is not a rehash. But it is. And its not above reusing the same gags either. We even get another film that Kevin uses to dupe people with. Which also happens to be a sequel. You can almost imagine Chris Columbus and John Hughes patting themselves on the backs at times like that.Of course what people come to see the movie for is Harry and Marv (Joe Pesci & Daniel Stern) going through another of Kevin's obstacle courses. But where it proved to be the comic high point of the first film, Chris Columbus has blown it up to absurd proportions for this one. The traps in Pt 1 were at least kept within the boundaries of plausibility, but sadly Columbus has thrown all that out the window. Its amazing they're still breathing, much less walking after the things they go through this time. They even fall off the top of a building with no apparent after effects. Its at this point you realise you're watching the live-action equivalent of a Looney Tunes cartoon. Only not as funny.I don't even want to talk about the improbable, contrived happy ending. Home Alone 2 is a real stinker. Its never as funny as it likes to think it is, or as warm either. Its just a pointless sequel that only reveals a blatant calculation at the heart of the enterprise. Another bland film from the drab Chris Columbus, and the start of the sad decline of John Hughes' once proud career.",
    "38": "Best Home alone movie in my opinion.No matter how old I am, I am watching this movie every year at the Christmas time and no matter how many times i've watched this,I always lmao.",
    "39": "\"Home Alone 2: Lost in New York\" is somewhat funny and heart-warming, but it is almost exactly like the first film.  This time Culkin boards a plane for New York instead of Miami and he ends up alone in the city with crooks Joe Pesci and Daniel Stern.  The lack of creativity keeps \"Home Alone 2\" from being as good as it probably could have been.  By-the-numbers film-making. 2.5 out of 5 stars.",
    "40": "Don't get me wrong the first is a classic and it's good but I like this sequel better because I like how he's lost in New york and staying on his own in a hotel. Surely people would think Marv was trying to break into Kevin's hotel but it gets better and I think if you like the first movie you'll love this! Christmas classic!",
    "41": "In 1990, Home Alone came out to great success, so it was no surprise that, two years later, in 1992, they would go on and make a sequel. Home Alone 2: Lost In New York, was mainly a rehash of the original, only it was set in New York City, this time. It's generally considered to be respectful to the first movie and was the second biggest box-office hit of 1992. A lot of the original people from the first film, return to work on this project. Directed by Chris Columbus, and written by John Hughes, the movie tells the story of Kevin McCallister (Macaulay Culkin) whom once again, finds himself frustrated with his family to the point that once again, he finds himself, wishing he can be without them. We as the audience can't blame him, after all, his family didn't learn anything in the first film. There are still selfish jerks who really do mistreat him. Still, Kevin shouldn't be so happy to get rid of them, too. I thought, he learn that family is very important to have. Geesthis sequel really makes the whole first movie, really pointless. Anyways, instead of getting left home again, he loses track of his father at the airport, and mistakenly gets on a plane headed for New York City -- while the rest of his family fly to Miami. Now alone in the Big Apple, Kevin cons his way into a room at the Plaza Hotel and begins his usual antics. It's there, that he finds out that the two bumbling burglars that try to rob his home in the first movie, the Wet Bandits, Harry Lime (Joe Pesci) & Marv Merchants (Daniel Stern) that are now trying to rob a famous toy store. Instead, of calling the police, Kevin should had done, he set up his Uncle's abandoned house with booby traps & forced Harry & Marv to follow him. Will the Bandits get the edge or will Kevin once again, outsmart them? Watch it to find out! In my opinion, the Bandits really didn't need to go into that house, as they honestly could had stolen the money and flee. It's not like they need the camera picture. They're already wanted criminals! This movie really doesn't give us, much that's new to work with. Yes, the New York City setting is cool to see, but honestly, it could had be downtown Chicago. Half the time, it was. Most of the film are shot there, while others were shot in California. The movie recycle a lot of the old gags from the first film, but puts in the extremes. The extreme cartoony slapstick violence, the cheesy one liners, the break the fourth wall jokes, the dim-wits minds of the criminals, and Kevin's hijinks are still worth seeing one more time and very surprising, still very funny. I have to disagree with certain critics that says cartoon violence is only funny in cartoons. After all, this film is no differs to the old school stunts of Buster Keaton, Charlie Chaplin, Three Stooges and the Marx Brothers. Those films get high marks; why can this film? I wouldn't say, watch this movie on TV, because it might be deeply cut and edited. Instead, try to find the movie on DVD. Yes, this movie is a kid's movie, but parents should judge if this film is worth their kids watching, because the visual violence are very realism and has some dark humor. The movie came out when I was a kid, and even for me. I was like, how are these two criminals, even still alive? Clearly, Harry & Marv would be dead by now. Like I said in my original Home Alone review, Kevin might be a little too sadistic. God help us, when he grows ups. Still, most of the film has a lot of heart. Like the first film, Kevin meets somebody to help him, understand his family and Christmas. This time, it's a homeless bird lover woman played by Brenda Fricker whom is a pretty good actress. Most of the actors were. Joe Pesci and Daniel Stern never lose a beat. Catherine O'Hara is great as the mother role. Tim Curry is hilarious as the side villain, Mr. Hector, the Plaza hotel concierge. Still, it makes me wonder, why the real life Plaza Hotel was so willing to portray their employees as idiots. I guess Donald Trump just really wanted that cameo. Oddly enough, the directions, Trump gives Kevin are incorrect. Once again, one of the most memorable aspects of Home Alone is the score by John Williams. It's amazing to hear again. I still love the planning song. Overall: the concept was still fresh enough for a sequel and it was very enjoyable. Sadly, Hollywood made a lot of unwanted sequels like 1997's Home Alone 3, 2002's Home Alone 4, and 2012's Home Alone: The Holiday Heist that didn't have any of the original cast and crew. Indeed, they should have learn, you can mess with a lot of things, but you can't mess with kids on Christmas. In the end, those sequels were a mess, but this one still work. So AHHHHHH!!! Hooray for Home Alone 2!",
    "42": "\"Home Alone 2\" clones virtually every aspect of the original,without adding anything new or funny. The plot is basically the same except this time the movie takes place in New York and not in a house. Macaulay Culkin gives a decent performance but he can't save this movie. I suggest that anyone who wants to see this that they go rent the original, you will be much more entertained.",
    "43": "I don't like it as much as the first one but I still thoroughly enjoy it, celebrity cameo's, jokes, and a great plot in general. The Tommy gun scene was pure genius. I love the way they explain Kevin getting on the wrong plane it was very cleverly done.",
    "44": "this movie is great.it's funnier than the first one.and more entertaining than the first.it's one of the best movies i've seen of the 90's.and the second best movie from john hughes.second only to the breakfast club.like the first one this movie gets very funny at the end.i give this movie ***1/2 out of ****",
    "45": "This has got to be one of the worst pieces of c**p ever put on film. OK the first one wasn't bad, but the violence in this goes to a bugs bunny G rated level of stupidity. The robbers take a little too much from this kid. Ever heard of a gun? And come on now a 12 year old kid dressed in expensive yuppie clothes walking around central park at night and not being mugged. I don't think so. Then there's another lame happy odd stranger side plot. This is just bad.",
    "46": "My favorite part was when Kevin didn't know where the lobby was at the Plaza. Thank God there was a great leader there to point him in the right direction.",
    "47": "Writer John Hughes was a clever man. He knew that what people really want (though they may say otherwise) from a sequel is the same thing to roughly happen again, but with a twist/the ante being raised.So that's what he gives us in 'Home Alone 2' which perhaps is more 'Holiday Alone' as Kevin finds himself separated from his family in New York. Cue the Donald Trump cameo!The format from the first film is largely followed, but despite being perhaps a little overlong, it all works and is good fun. The slapstick sequences are wonderfully staged and there's a nice bit of sentimentality too.A worthy sequel to the original.",
    "48": "Great film. Great classic sequel. So exactly a year later the family gets separated during the holiday season during another family Christmas vacation. Yes.. it happens again!! This time even worse because Kevin is in New York which is far from home in Chicago and his family is in Florida! But hey this is what they needed to do in order to make a new movie! Anyway the film is great family fun\nGreat Christmas class to watch with the family. I really enjoy watching this every year with my kids and my wife. Just a good family film that everyone lovers. Definitely would recommend this to anyone who loves a great Christmas story.",
    "49": "A great holiday classic where Kevin is a bit older but still always watch it every Christmas.",
    "50": "The greatest holiday movie ever !!!! So funny and super hilarious !!!!",
    "51": "Very clever sequel to the 1990 blockbuster, with this McCallister Christmas vacation following Culkin as he wonders the Big Apple after boarding the wrong flight, only to bump into Pesci and Stern, whom have just escaped from prison and are still angry about their foiled plan from the previous year. Aside from a couple of minor characters, pretty much everyone from the first movie reprises their roles. Heard and O'Hara are still great (and still underrated) as the parents; however, it's Curry and Schneider in memorable scenes at the Plaza Hotel that make this outing an hilarious classic. John Williams expands on his score, making the soundtrack by itself worth listening to. But the film is not without its flaws: specifically, the story structure is way too similar to its predecessor, and the traps are far more irresponsible and less funny than the first. Still, if you love the original, this one will find its way onto your Holiday Watch List.***½ (out of four)",
    "52": "This is the best Christmas movie you will ever encounter. Well this is the second best Christmas movie as the original Home Alone will always be the best one, this movie is amazing, now we get to continue Kevin's adventure only this time he's gone and got on the wrong flight to New York, I thought everything about this was great, the tricks are still there even if he isn't home, this kid is a genius and Harry and Marv always fall for it!I really liked this movie, I thought it had the perfect Christmas feel to it, John Hughes is one of my favourite directors and the day we lost him we lost a part of movies forever, the way he tells stories it truly is breathtaking.Perfect peformances! Highly recommend as it is truly a heartwarming Christmas movie that you will definitely enjoy.",
    "53": "This movie and the first is something special to me. I will probably see them every year from I was 5 when and until I die. Everything else seams to change but not this.",
    "54": "This movie is so much like the first one. There is hardly any originality. Instead of being left at home, he gets lost in New York. It is the same thing, with slight variations. Same two burglars try to get him. He befriends someone he is afraid of, only this time it is a woman. They do the video-gag again (black and white movie) where they think it is a real person talking. The traps are the same more or less, with slight differences, along with a few extra ones, which are totally corny by the way. And so on and so forth. This movie is extremely predictable. Instead of a sequel, this movie should have been made as a \"Scenario B\" to the first one. It would have been good, had the first one never came out, and we wouldn't realize what a blatant rip-off it is.",
    "55": "Not as good as the original but still very enjoyable. Another timeless Christmas classic. People who moan about it being unrealistic really don't have a great imagination or outlook on life. Don't take the film too seriously and you will enjoy it. Plus it has the legend joe pesci in the film.",
    "56": "Do Harry and Marv have the best pain tolerance in the world or what??? Ouch! Anyway, this is a good time filler, but it is in no way original. It's just that the action takes place in New York. The same cast is back, and they all do a pretty good job, given the material. But HOW could these crooks survive all these awful booby traps and escape with nary a scratch, even a broken bone? I know you have to sometimes suspend belief while watching movie, but this is too much! Anyway, not a bad film, just not very original and believable. I think the McAllisters just decided to spend all their Christmases at home after this, thank goodness!",
    "57": "This is the one Home Alone sequel I can ever see anyone give a positive review for. To me I thought while quite a rehash of the first film in pretty much every way, Home Alone 2 Lost In New York provided me with what I wanted in a sequel for this franchise. The main character being once agian abandoned by his family then getting into mischief in New York by himself and eventually beating up some bad guys. The one thing that bothers me is the beginning as this film so closely follows the first in how it's done that it comes off extremely lazy. So while I did have fun and enjoy this film, I wish it didn't take so much from the first film. Overall though it's a fun film and if you are a fan of the first Home Alone, you will like the sequel.",
    "58": "I watch only this movie in christmas time and never get bored!",
    "59": "Just as great as the first movie. Warm, funny, holidays yada yada... Just perfect.",
    "60": "I generally enjoy deeper movies with more drama, but this is one of the few slapstick comedies I find true enjoyment in. It is just corny enough, silly enough, and heart-felt enough to enjoy! Everything comes together so well!",
    "61": "This movie was not only the best of the series but likely the funniest and most heart-warming comedy of the 1990s. Slapstick humour, true, but it works, and most importantly, it makes you laugh. This movie had great, creative, hilarious scenes mixed with an emotional and heartfelt story while at the same time remaining true to the elements of the original. The musical scores were fantastic, and it's pretty much a movie that anyone of any age (who isn't a biased moron) can enjoy. Anyone who still believes this movie shames the original ... or that the series itself isn't worth seeing needs to have his or her brain removed ... because it's obviously not being used correctly. Superb sequel ... superb movie in general.My rating: 9.0/10",
    "62": "Home Alone 2 is at least as big a Christmas classic as its predecessor. New York is a beautiful setting, in a movie where the plot is somewhat a little more unbeliveable. Kevin's parents are truly incompetent parents, and where should the burglars have died from the injuries that Kevin inflicts on them.",
    "63": "Now this is just as funny as the first! We have the same old hero who's still played by Macaulay Culkin during his youth, and his family's still played by most of the same people from the first!I love the story of Kevin taking the wrong flight to New York City when his family took a vacation to Florida!Kevin, Marv, and Harry were still talented just like the first movie was, and the bobby traps were just as funny as the first, like when Marv gets electrocuted and turns into a skeleton and Harry gets his head on fire once more! The pigeon lady was even just as nice as Old Man Marley was in the first movie, helping Kevin out!I even like the ending where Kevin gets busted by his dad when he yells out, \"KEVIN! YOU SPENT $960 ON ROOM SERIVCE?!\" to him, and where he hugs his mom while reuniting!Go and watch it today!",
    "64": "While this has some very entertaining moments, this is really an unnecessary sequel to the first installment of one biggest box office hits of the 1990's. In retrospective, even the first film doesn't hold up nearly 30 years later, being rather violent and cartoonish featuring a family I certainly would not want to be any part of. While this time indeed, the Macaulay Culkin character of Kevin does make it on to the plane, it's the wrong one and he ends up in the wrong City. While his family ends up being stuck in the hotel because of constant rain in Florida, Kevin makes it to sunny Manhattan where once again he encounters the nasty Crooks played by Joe Pesci and Daniel Stern. Christmas in New York is said to be magical, and it's up to Culkin to find ways of passing the time while his mother, Catherine O'Hara, strives to get there so she can find her son home she is frantic of having lost for the second time over the Christmas season.The characters play by Stern and Pesci have outworn their welcome, and this time the violence tossed at them by Culkin in an abandoned family home seems to be twice as ruthless, not that they don't deserve it. But in reality, there is no way anybody could survive any of the self defense ploys that Culkin throws at them, so that aspect of the plot line becomes quite eye-rolling as it goes far too over-the-top.That means that the film is best when it deals with the colorful characters of New York, particularly Brenda Fricker as a Central Park bird lady, Eddie Bracken as a kindly toy store owner and Tim Curry and Dana Ivey as imperious front desk clerks at the Plaza Hotel. What does become equally as irritating as Stern and Pesci is Kevin's family, especially his obnoxious older brother who creates a major disturbance at a Christmas concert Kevin has a solo in that in defending himself, Kevin causes the entire presentation to fall apart. Shots of New York around the holidays bring on a feeling of nostalgia, especially with many businesses which are no longer around as well as a nice shot of the Twin Towers less than a decade before they were destroyed. A cameo by a certain overrated celebrity turned politician is fortunately extremely fast and other than a quick \"eew\" at the sight of them is only a minor disturbance. In true Hollywood fashion, this was not the end of the saga, but the last one in my opinion worth bothering with. I used to rank this as much higher in rating, but other than a few sweet moments, including a thoughtful one involving a pair of turtle dove tree decorations, it does not hold up as well as it did on my first viewing when it first opened in theaters.",
    "65": "Utterly shameless rerun of the original, with a change of scenery to New York, less believable separation, a boring bird lady and more potentially fatal booby traps for Stern and Pesci. I found myself laughing out loud more than the first one, particularly when Stern screams in terror/pain as his face is caved in by bricks. 7/10.",
    "66": "The first Home Alone film was average but this one doesn't even live up to that. A few of the gags are funny but it devolves into rather sadistic looking slapstick again. The characters are bumbling and repetitive, the story is nonexistent and it seems more like a tourism ad for New York City to be honest.",
    "67": "For some reason we had to watch this movie in math class at the end of the year around Christmas last year in school. Don't ask me why. Honestly I'd have preferred to do algebra equations as opposed to watching this garbage. This movie has no redeeming qualities other than that the camera was on, it was in color, and in focus. It had a theatrical release (I think) and there are people who were involved in making this, and that there are people who were entertained. The acting, cinematography, and story are all terrible. This movie is boring, and I don't see why it is so popular. I guess people are entertained by a child assaulting adults and dumb parents?",
    "68": "My assumption is that they saw the numbers on the first Home Alone and just said, \"Let's run it back,\" like it was a pick up basketball game at the Y. They quite literally change nothing but the location and the scary man was now a scary lady. Everything else was virtually the same with the exception of some small tweaks. They even got up late again and were scurrying out of the house! It was a regular act of laziness on the part of Hollywood. Without even doing any homework I'm guessing it raked in a gajillion dollars--nothing like the first one, but mad money for a sequel. Yes, it was entertaining... for a rerun.",
    "69": "Loved it. It is the same plot but still funny af. Loved it as much as the 1st one, if not even more. One of the best Holiday season movies",
    "70": "This film is more violent and mean-spirited than the original. The original was cute to a point, but this one overdoes it. I read one magazine review that asked if it was too dangerous for kids, and I agree. Too mean-spirited for my tastes. If you haven't seen it...Keep it that way!* out of ****, a surprise it was even that high!",
    "71": "Wouldn't be Christmas without this. Sure, Kevin lived in a mansion and had a super large family, they took holidays in the holidays and neglected his feelings, but this was a masterpiece. They don't make them like this anymore. One of the greatest movies ever and certainly one of the top three best Xmas ones. You cannot deny home alone and this second one to be the best. We New York holds a special place in my heart I opted for this one for full marks. Set in New York left behind again. Poor parenting. Annoying kids. Joe p was excellent and some of the other actors excelled as well. Critics can say what they want they don't know what they on about most of the time.",
    "72": "The sequels after are dreadful. I wish people would quit making so many remakes after the originals unless you keep the same people and the plot going.",
    "73": "Rarely has a success-story been as unabashedly copy-pasted as in Home Alone 2. Still, it isn't the lack of creativity that makes this flick almost unwatchable: Where Home Alone balanced on a knife-edge when it came to how Kevin MacAllister downright thrashes the two antagonists, the sequel is brutally over-the-top. The film is jam-packed with violence which is presented with ostensible warmth and joy. It's discomfortable at best. The filmmakers don't seem to realize that the representations are inherently graphical, something the cheerful tone cannot redeem. On the contrary it only makes it worse, because it implies that throwing bricks at people's heads and setting them on fire can be seen as an expression of righteousness. The only things keeping this film remotely watchable is Macaulay Culkin squeezing out the last drops of his childish charm and some segments boasting a fun Tim Curry.",
    "74": "30 years ago Kevin came back and is now in NYC with the villains from the first movie as the runtime is 2 hour long. If there was an Oscar for best stunts this would had been nominated. This movie was part of every Xmas on TV long before this was on Disney+ streaming, so watch this with your family when you want some old Xmas fun for some hours on stream or VHS.",
    "75": "One of the two best Christmas movies of all time, the other being the first Home Alone. Culling is superb once again. The family is funny, and the new antics are just right.Must see7 stars",
    "76": "Like the original it has some good moments and great support from Pesci, Stern and Curry.However it suffers even more from the smugness of the original and the Culkin character moves from charming? to smartarse.Thankfully John Hughes has made much better than this",
    "77": "The original Home alone film wouldn't have had my interest if it wasn't for Daniel Stern and Joe Pesci. Now the two stars, along with Macaulay Culckin star in the sequel,Home alone 2: Lost in New York. Even with the stars of the original returning, they can't even make it work. Home alone 2 is a sequel that is ignorable for many reasons. I'll start naming them off.One of the flaws with the sequel is that there isn't much of a difference between the two films. They repeat a lot of the same things. There is a person that Kevin(Culkin) is afraid of and them he gets to know the person and realizes that she is actually a nice lady and in the end she helps him out. That happened in the original. Kevin sets up traps against the two crooks. That happened also. Another problem, like with the first one, is that the film is way too cheesy. I hate corny movies. I hate corny everything. As I said in my review for the original, Director Chris Cloumbus is the king of corny. He still holds onto that title.So what's the sequel about? Well, as the Maccalister family sets off to Florida, they try ever so hard not to forget Kevin(Played by Macaulay Culkin). In this one they don't forget him. The retard goes the wrong way and realizes once he lands in New York\"I'm in New York\". So Kevin is alone. In New York. Luckily, He is never raped or molested or mugged. But he does get in trouble with the hotel concierges(Played by Tim Curry, Rob Schneider, and Dana Ivey). And Kevin ironically runs into The Wet Bandits(Played by Joe Pesci and Daniel Stern), who have recently escaped. Home alone 2:Lost in New York has a few hilarious moments in it. Mostly thanks to Tim Curry, and watching these crooks suffer is kind of fun. But Home alone 2 is just a repeat of the original. It's also clichéd. And corny. The original is mostly special thanks to Pesci and Stern. The sequel is funny at times, but I still thinks it's a thumbs down.Home alone 2:Lost in New York:**/****",
    "78": "Home Alone 2 is pretty good, but I liked the first one better. Even though this is a great film, the originality is lost. This time around, Kevin gets left behind at the airport while the rest of the family travels to Florida. Meanwhile, Kevin gets on the wrong flight and heads to New York. While in New York City, Kevin learns that the two bandits from the first film escaped from prison and are planning to rob a toy store. Now, Kevin has to foil their plans while he is dealing with management from the hotel he's at. The formula is basically the same as the first film. There is nothing new, but I liked it anyway. Macualay Culkin is great once again as Kevin. Daniel Stern and Joe Pesci are funny as the bandits. Even Tim Curry and Brenda Fricker are decent in their roles. The music is something good to listen to with all the great Christmas songs. Overall, this is a great Christmas family film. I rate this movie 9/10.",
    "79": "Home Alone 2: Lost in New York\" is not as good as the original but it's not far off. Sure the Sticky Bandit stuff goes on a bit too long. It's also a little bit too mean. But other than that, this a funny, warm movie. John Hughes knew how to write. The sweet scenes work perfectly. The music is also very good. The movie is well acted by almost everyone. I don't watch \"Home Alone 2\" as much as I watch the original but I do visit it quite often. Honorable mention: Buzz.",
    "80": "Its funny and good,i think is better than the first movie,well done director",
    "81": "I don't admire Chris Columbus.  His work is always targeted towards the kid market, I know, but he does it in the crudest technique possible.  Since he wrote 'Gremlins' he's been in over his head, much like Joe Johnston.A larger jungle for the hooligan this time, more booby traps, more gags, another spooky adult, fewer laughs.  I'm disappointed that John Hughes would abandon his flair from the 80s for this franchise.Consider these 'Home Alone' movies as juvenile versions of 'Die Hard' in the barest sense.  Lone charismatic hero takes on dim-witted villains in tight quarters without backup.Today this plot seems unthinkable with the new airline regulations.Final Analysis = = Cinematic Dud",
    "82": "Its a good movie. Its sentimental. Its basically like Home Alone 1 but in New York.",
    "83": "Home Alone 2: Lost in New York is arguably funnier than the first one! Its really good. Most of the cast returns from the original and My opinion the team work of Joe Pesci and Daniel Stern is just not insanely hilarious but its also incredible that the two are so good together! John Williams has another amazing score here! This is a perfect movie for people to watch around Christmas and if you need a big laugh watch this as this will crack you up! I strongly recommend Home Alone 1 and Home Alone 2!",
    "84": "Just really want to up the rating on this. The problem when you really like a film, the first one for example,anything after it will never be the same experience. But watching this one alone. It is a good film, for a family. Definitely holds it ground. I prefer this over a lot of trash that been released lately. Like the latest ice age buck film, completely terrible.",
    "85": "I recently watched Home alone 2. It's a comedy. The film stars Macaulay Culkin.It's the story of a boy called Kevin McAllister being left alone, because he missed the plane where his family was. But he had his father's wallet, so he used the credit card to stay in a hotel. Then his family returned to the New York. But while they were searching him, he meets burglars the knew him before.The film is really about Kevin because he was not frightened when he found out that he was lost. He was resourceful and clever so he used everything he had to survive in the New York and defend from burglars.In my opinion, this is the gripping and very funny comedy. The acting was also great. Overall, it's really enjoyable comedy",
    "86": "I think Home Alone 2 Lost in New York is a great sequel to the first Home Alone movie! In this sequel Kevin McCallister is planning to go on a trip to Miami Florida with his family but accidentally gets separated from them at the airport and accidentally gets on a plane to New York City. Once in NYC Kevin checks himself into the Plaza Hotel but the next day his father's credit card is discovered stolen by the Concear (Tim Curry) who scares Kevin away from the hotel! Upon escaping the hotel Kevin learns that the burglars who broke into his house Harry (Joe Pesci) and Marv (Daniel Stern) have broken out of jail and are planning to rob the toy story owned by Mr. Duncan (Eddie Bracken) who Kevin visited before getting scared away from the hotel and who gave Kevin two turtle doves! With the help of some new traps and a kindly homeless Bird Woman (Brenda Fricker) Kevin traps the burglars again and sends them back to jail where they belong! Filled with wonderful new characters and a lot of laughter and humorous Home Alone 2 Lost in New York City is a great sequel the whole family can enjoy! 10 out of 10!",
    "87": "This is probably the worst of the sequels, with nothing to laugh at. The story is well told and gives you a good idea of how a boy named Kevin becomes the hero. It manages to explain events in part 1 that may have been considered plot holes. Stern stole the show for his portrayal of the burglar, I thought. From an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them. My only problem with the film was the supporting cast, but it's still okay. Some of the dialog could be better. The real centerpiece of the film is its acting.",
    "88": "Sorry fans of these films, I just don't get it. He's a stupid boy in stupid family. He gets himself lost because he is messing about. He finishes up in New York. Instead of reporting to the Police that he is lost, he decides to spend loads of his families money",
    "89": "I saw a bit of this film on TV as a kid, but didn't know it was \"Home Alone 2\". For many years, I thought maybe it was the original \"Home Alone\" I was seeing, until last year, when I finally watched that successful family Christmas movie for the first time and didn't recognize any of it. I found the original to be overrated, and couldn't understand why it was such an incredibly huge success at the box office during its theatrical run in 1990, but at least I laughed at times. It's been nearly a year since I saw that one, and I finally found a copy of \"Home Alone 2: Lost in New York\" to rent earlier this week. In my opinion, the original is a mixed blessing, slightly above average, but this 1992 sequel isn't even that. It's basically just average.This year, the McCallister family in Chicago has another Christmas trip planned, a trip to Miami, Florida. On the day of their flight, the parents, Kate and Peter, once again sleep in and have to hurry, but nobody is left at home this time. However, Kevin, who was the one left at home on the previous trip, is accidentally separated from his family at the airport in Chicago, and gets on the wrong plane! While the rest of the family go to Miami, Kevin ends up in New York City, and the others don't realize he's not with them until they have arrived at their destination! Trying to find him will not be easy, as he is not in Chicago, and his parents don't know where else he could have gone! Meanwhile, Kevin decides to make the best of the situation, and manages to rent out a hotel suite using his father's credit card. Unbeknownst to the lost boy, his old enemies, Harry and Marv, have escaped from prison, and are in the same city as him! Just like the first film, this sequel begins in the McCallister household, with more unfunny quarrelling in the family, and it's sometimes a little too mean-spirited. The part where Kevin sees his Uncle Frank in the shower is pretty lame, and it's not the only gag in the film that can be described that way. The movie continues to be very straight-faced for a long time, definitely longer than its predecessor, and never does get as funny. It often seems like they were pathetically trying to replicate the original \"Home Alone\", which doesn't help. I think I consistently kept a straight face until the part where they've arrived in Miami and Kate McCallister (still played by Catherine O'Hara) faints when she realizes Kevin isn't there. This was the first of several gags that made me smile, but O'Hara certainly doesn't do as much for this film as she did for the original \"Home Alone\". I came close to laughing for the first time when Kevin uses part of a movie to scare off hotel staff members while he escapes, but I don't think the movie gag ever gets as funny as it does in the previous film. I lightly snickered at the part where Marv falls after entering a home under renovation, not realizing there's no floor in front of him, but I never found any big laughs. In fact, there are hardly any laughs at all, and only occasional gags that made me smile.Watching this sequel made me think of the \"Home Alone 5\" joke in the short-lived mid-nineties cartoon series, \"The Critic\". I think watching \"Home Alone 2: Lost in New York\" helped me get a slightly better understanding of that spoof. This movie does show a lot of repetition after its predecessor. In both films, Kevin is accidentally abandoned by his family, he's afraid of a certain adult stranger he sees more than once but eventually gets to know them and befriends them, he puts Harry and Marv through loads of slapstick mayhem before they finally catch him, and then he is saved by his new friend. Not only is \"Home Alone 2\" not very original, it's also not very funny. After the first two films in the franchise, \"Home Alone 3\" was released in 1997, and \"Home Alone 4\" in 2002. These films both feature different casts (Macaulay Culkin was obviously too old to star in them by the time they were made), and the third one features different characters. The franchise clearly didn't go in the direction predicted in \"The Critic\", but since the two later movies both seem pretty unpopular, and are apparently worse than this mediocre second film, I really don't think I'll be watching either of them.",
    "90": "My personal favourite Xmas movie of all time. There are some truly fabulous Xmas films I will always cherish like Home Alone 1, National Lampoons, Groundhog Day, Die Hard ( yes it's a Christmas movie ;) etc etc, but Home Alone 2 Lost in New York will forever be my all time greatest. The whole nostalgia, setting in New York and magical Christmas feeling is blended perfectly together in what is virtually the same film as the 1st, but done in a slightly different way. Everybody knows what the Home Alone films are about, so I won't delve into the storyline, but it's a film I always come back to. Joe Pesci and Daniel Stern are in true fantastic form as usual. The traps are better. The humour sharper. Wonderful Christmas movie. Merry Xmas you filthy animals!!!!",
    "91": "Home Alone 2 could also be called \"More Of The Same\", but that's OK because there's enough different and the same bit is fine.I'll explain. His idiot family mislay Kevin at Christmas again - this time he is booked into a hotel where he has to bamboozle suspicious concierge Tim Curry into believing he isn't on his own. In due course he falls foul of Harry and Marv, the single minded but dim crooks from the first movie - they want revenge on him, he wants to foil their plan to rob a toy store, and the stage is set for a reply of the siege, full of slapstick violence, and taking place this time in the shell of a brownstone which is in mid-renovation. Finally there is - guess what? - a sentimental resolution.Yes, the siege is violent, but the violence is cartoon violence: although Marv and Joe are hurt, things which would in reality kill them simply leave them somewhat stunned, following which they get up and resume their single-minded pursuit of Kevin.I cast my vote, too, for the bricks and the way the sequence keeps you waiting for a variation which never comes. I also have a soft spot for the replay of the paint tins down the stairwell from the first movie, which does carry some funny variations.And, again, that's the movie's strength - it is very funny.",
    "92": "I'm confused as to why this movie has such a low rating. I have enjoyed tremendously for most of my life. I was little when this movie came out but I remember liking even as a child. I continue to watch it, even into my adult life. It never loses its charm. It is more than just a Christmas movie. The actors are fantastic. Joe Pesci does a wonderful job as does Macaulay Culkin. It is funny, clever and just overall enjoyable any time of year.**I do want to caution people to the fact that there are several drawn shots of the World Trade Center, even in the TV version. I realize that it is still a tender topic for some people.**",
    "93": "Kevin and his family are planning to go to Miami during the holiday season this time around.At the airport, Kevin becomes separated from his family and ends up on an aeroplane to New York City.Using his father's credit card, Kevin rents out a suite at the Plaza.Kevin befriends E. F. Duncan, a friendly toy store owner, and a homeless Pigeon Woman then Kevin runs into his old enemies Harry and Marv, who have escaped from prison.When Kevin discovers that Harry and Marv plan to rob Mr. Duncan's toy store on Christmas Eve, Kevin makes plans to stop them.Kevin's mother, upon realising that she and the family have become separated from Kevin, frantically tries to find Kevin.....again...It's more of the same here, but a lot more money has been thrown at it, because at the time of it's release, this movie was foolproof.And if you liked the first one, you will like this, because nothing has changed.But the film is all about the build up to the last thirty minutes, which to be honest, is the reason we all went to see this, because in all of us, there is a part where we want to see Pesci and Stern get trashed.The rest of the movie is in three parts. We have Kevin and his Hi-jinks, The bandits planning a robbery, and the family trying to get Kevin back.Simple by the numbers stuff, with a lot of sickly sugary messages which grate at times, but it's a Christmas movie, that everyone can enjoy.",
    "94": "I love HA1. It was pure Hollywood hokum, but with such an engaging script a more than capable cast and some pretty sly digs at consumerism etc it tickled just about everyone's funny bone. I especially loved Kevin's parents, who could easily have been cast as bumbling but lovable twits, were actually cast as self absorbed materialistic shallow people! In that movie the potential plot holes were deftly dealt with by bumbling cops, power outages etc. In HA2 there is none of the charm, just an inferior retread. Kevin could just have called the cops and they would have found his family in 5 minutes, yet for some strange reason this doesn't happen! How can we expect a whole roomful of cops and hotel employees to be fooled by a crummy movie soundtrack. They even have to invent a non existent audio device to explain how Kevin could do this. How about a decent plot line and script? Sorry, but the urge to make more cash with the least possible outlay won out. The pits.",
    "95": "I've never been much of a fan of the HA movies. Yes I've heard of them but I never actually bothered to watch them. But after I saw this movie it made me realise how entertaining and hysterical they are. It was just yesterday when I was watching a TV programme, I realised that this film was on next and it was then that I decided to watch it (just to not be bored.) I had my doubts about this film, not knowing what \"joy\" to expect because as I've said, I never seen any of the HA movies nor the prequel: however I was able to catch on during the first 5 minutes of the film. Let me say I was throughly proved wrong during 5 or so minutes of the film. I half expected myself to switch to a different channel, never giving this film a chance as I felt that it was just going to be another boring Christmas movie. BUT, I was so overwhelmed by this film that I set off continuing to watch it...all the way through! I just loved it, I guess it just had that Christmasy spark and adventure. And let me say, it is very rare I would watch a film all the way to the end without even switching channels and feeling bored.The plot, I admit, was typical yet it had a really big impact on the film as it gave it its surreal adventure. I really enjoyed it but I believe it was utter coincidence that a kid could board on a plane, not knowing that his family was on another flight and finally they are separated all the way across the country. It would be terrifying for me as I do not know what I would do without my family...knowing they're not in the same country as I am and I was alone! But from the movies perspective, some good things came out of it (especially when you're in the city that never sleeps!) Room service, dining, luxurious suites, credit cards..aah! Kid's lucky! And also in this movie the kid acts so calm and independent and yet he's not at all scared that his family is halfway across the country! And speaking of being scared...how could you not be?? The mom + dad didn't look so worried when they soon found out that their kid is missing. Sure...despite the fact that the mom fainted, she didn't actually show any real worry! I was surprised that her and her husband was cracking up jokes in the police office when their son could be lost anywhere around the world...! And *psst;;;;spoiler;;;;* when the mom actually found her son, she wasn't even crying of joy! Finding your son in a big dangerous city would take a miracle (well, even though it's Christmas) and the mom was just like \"Ooh, I'm so glad to see you!\"... seriously! Speaking of being serious...the films climax was one HECK of a ride! The booby traps from the kid was very creative yet amazingly harsh!! I was expecting that the two bandits were to be killed at the end of the movie as they were heavily electrocuted (you SERIOUSLY could die), pelted with stone-hard bricks,(again!) attacked by a heard of pigeons and various nuts, bolts and hammers and fallen through spaces leading to another cruel booby trap (ouch!) and yet they didn't seem to break any part of their body -- let alone be killed!Yeah, so the booby traps were (like I said) \"harsh\" and the film makes it look like it's so easy to throw bricks at someone and know they'll be just okay... and not dead!... MY ADVICE: Don't let your kids watch this, seriously acknowledge the PG rating!! But in spite of the silly action in the climax, I actually enjoyed the climax!! It was the best part in the movie and let me say it kept me on the edge of my seat! See that's the thing with Home Alone 2, the action just keeps your eyes glued to the screen! There were also some REALLY funny parts as well, like when Kevin was trying to escape from the hotel and of course, the ridiculous climax! (as I've already noted!)Pushing on to the characters, the relationship between Kevin and the pigeon lady was quite interesting. It just shows that Kevin was not alone and there was always a helping hand (which definitely came in use!*not saying any more, but you could probably work that out! sorry!*). Plus the scene where they had that talk, comprehending their feelings to one another was sweet, in comparison to the part when Kevin gave the lady a mini pigeon as a token of their friendship and saying \"I'll never forget you...\" What would make Home Alone 2 even better is if there were two stories. One of Kevin's New York Adventure and also one about the family trying to find him. Sure we definitely touched on Kevins' side but what about the family? It would sort of be good if the film was created into like a 'Finding Nemo' type story (but NOT a big drama!) so we would have both adventures...Overall it comes down to Home Alone 2 to being THE Christmas movie! I genuinely loved it, it was sweet, funny and keeps you on the edge of your seat until the very end. But seriously if you're watching this film with young kids, watch out for the climax! But other than that, I would definitely recommend it!*********/10 stars!!!Merry Christmas and a happy new year, everyone! ~Karl :D",
    "96": "Kevin once again gets left behind where the family are going on another vacation to France except for Kevin that gets on the wrong flight to New York.The story brings back a few old rivals that bump into Kevin while he's exploring the city.\"The Wet Bandits\" are wanting their revenge, however they get a beating from Kevin once again.It feels almost torture to see the bandits go through such punishment during the apartment scene. This sequel may not be as favorable to the first film but it does bring an amount of drive and energy. Some would question as to what the point is for this sequel when it has a similar base as the first film, however it does bring you back to the fuzzy warmimg moment at the end.",
    "97": "There's a familiarity with \"Home Alone 2\" that serves it well. If you want to see Stern and Pesci get hurt again, you've come to the right place. And there's serious entertainment value to be had in that respect. You wouldn't believe the squeals of laughter coming from my 8 year-old as Marv took a brick to the face. And another. And even more. Should I be worried? Nah . . .But I enjoyed this one a bit less than the original because the Kevin McAllister character is a harder pill to swallow this time around. Just seems like more of a jerk in this movie. The airport confusion that results in his being separated from his family is more contrived, and it all comes off rather cynical.",
    "98": "Every time I watching this movie It's bring back to the my childhood..",
    "99": "Essentially a beat-for-beat repeat of the first with only the 'home' swapped for a city, 'Home Alone 2: Lost In New York (1992)' suffers from a 'do-it-again-but-bigger' mentality and a slightly sillier approach but is still an endearing, funny and heart-felt flick perfect for all the family on any occasion. It's surprisingly entertaining despite its repetitive nature and features some extremely memorable set-pieces, some even sitting on par with those in the original. It isn't so much a drop in quality from its predecessor as it is an unnecessary addition, never quite as good but never much worse either. Oh, and those robbers are definitely dead now, even if they survived their last crossing with this kid. 7/10",
    "100": "Home Alone 2 captures a lot of the same magic as the original. That could be because it's basically the exact same story, but it also brings some new stuff to the table. Tim Curry is a delightful foil for Kevin's antics, and it's fun to see the cast all back together again. It may be a copycat sequel, but if the formula ain't broken, don't fix it.",
    "101": "The first Home Alone is very good indeed. The last two are just wannabes and feel like they don't belong. Home Alone 2 is my personal favourite, and I watch it about once a month. The only problem is that the jokes are basically retreads of the first movie, but believe me, they're miles better than the ones in the fourth ( which is one of the worst movies ever) This is still a very solid film, that gets slow in the second half. The performances are excellent. Macaulay Culkin brought a lot of charm to almost all the movies he's been in. Just a shame, he isn't acting any more. Joe Pesci and Daniel Stern are hilarious, as always. Catherine O'Hara and John heard are amiable as the parents, while the wonderful Tim Curry gives a hilarious performance as the Concierge. My favourite scenes were the bathroom scene in the hotel, and when the staff are held hostage by a television. Just priceless. Eddie Bracken and Brenda Fricker also make appearances, and their scenes are touching, as they are of friendship and acceptance. I absolutely adored the soundtrack too, New York looks splendid and the Plaza Hotel was incredible to look at. Brilliant movie! 9/10. Bethany Cox",
    "102": "Now I'm aware that Home Alone 2: Lost in New York is the exact same plot as the first Home Alone, and not to mention how silly it seems that these folks would leave their kid behind, but come on, this movie was all in good fun. It still has me constantly laughing 'till this day, I think if you loved the first Home Alone, I'm sure that you'll just naturally love this one as well. Not too many folks are just giving it a good chance. I mean, the Wet Bandants are back and they are just as funny as ever! I think this house that Kevin set up was actually in some ways a little more fun than the first because of the traps he was able to set. Not to mention the Plaza Hotel plot was so great and fun to watch.Kevin and his family are heading down to Florida for Christmas this year, but when Kevin gets mixed up at the air port and gets on the wrong flight, he ends up in New York. Instead of complaining or panicking, he just plain enjoys it. He goes on the ultimate tour with his father's bag of money and credit cards and cons himself into the Plaza Hotel claiming he's there with his dad. But the Wet Bandants who have now re-named themselves as the Sticky Bandants are in New York as well and are planning on stealing all the money from a toy store that is going to be given to the children's hospital. But Kevin is going to make sure that they don't mess around with the kids and has set his uncle's abandoned apartment up for a fun house of traps.Home Alone 2: Lost in New York was an absolute blast. The reason I'm giving it a ten is because I think the rating should be higher. People really need to give this movie a shot. My favorite scene is without a doubt when Marv gets hit in the face with the bricks, also, the scene where the Plaza Hotel managers are asked by Kevin's mom \"What kind of idiots do you have working here?!\"... the lady just smiles and says \"The finest in New York!\", it was just too funny! I love this movie and I'm always going to recommend it for a good watch, I think you'll enjoy it if you give it a chance.10/10",
    "103": "Too many sequels suffer from Deja Vu, and hardly any of those carbon copies improve upon the original. Home Alone 2 is a carbon copy, but it's also much better and more complex a movie than the first. In another mad rush to the airport the McCallisters make a point of remembering Kevin this time, but he gets lost in a crowd at the airport and follows a man who looks like his dad onto the wrong plane. Thirteen of the McCallisters are going to Miami for Xmas (do they never stay at home?) but Kevin is headed for the Big Apple, and he's going to have that once-in-a-lifetime vacation he's been wishing for.There's much more for Kevin to see and do in New York. He scams his way into the Plaza hotel where a suspicious Concierge (Tim Curry) gives him mighty evil looks at every encounter. He goes to Duncan's Toy Chest, the biggest toy store in town and takes many scenic photographs. Though it is a little unnerving now seeing Kevin on the roof of the World Trade Centre.But the Wet Bandits have escaped, and they have just arrived in New York with loftier ambitions and bigger heists to pull off. They even brush by Kevin a few times not knowing he's there. Typically though, once they get a hold of him the give away far too much info. Once Kevin escapes he takes matters into his own hands once more. His Aunt Georgette from the first movie is still in Paris so he uses her half-renovated home as a huge mousetrap for the bungling burglars.The booby traps this time are much more painful and nasty, so it's all the more amusing for us. Who can possibly fail to laugh at Marv getting the shock of his life when he tries to turn on the taps? If the movie were to be released now I doubt if it would be let away with a PG rating. Still, it's nothing for any parents to worry about. Unless you fear your child is going to set your head on fire with a blowtorch.Home Alone 2 has a more satisfying climax than the first. The film doesn't simply end once Harry and Marv are back in the slammer as there is more plot to it than that. Brenda Fricker has a (rather questionable) role as 'The Pigeon Lady' a woman who lives in Central Park and talks to no one-until Kevin reaches out. Plus Eddie Bracken shows up as Mr. Duncan and gives Kevin the best Christmas morning ever as a token of his appreciation.With a bigger story (okay, some of it re-used) and more characters and a better playground for Kevin, Home Alone 2 manages to be a superior sequel. While not excessively so. There's loads of fun to be had in Kevin's antics, and Tim Curry is downright brilliant as the mischievous Concierge.It's a great movie on it's own but sadly it will always be called a copycat. Watch it now from a fresh perspective and you might like it more.",
    "104": "Macaulay Culkin – one of the most famous child stars since Shirley Temple – returns as Kevin McAllister in the 1992 nostalgic and sentimental slapstick Christmas classic that has not dated since its original release.As the sequel of the highest grossing comedy of all time, Home Alone 2 is one of the biggest Christmas films of the 90s. Along with its predecessor, the story is all about Christmas. While the familiar Christmas vacation is shown as chaotic and stressful, it is the essential family element that brings us back to the films main themes of togetherness and (paradoxically) independence.Becoming separated from his family once again when leaving for a Christmas holiday, Kevin is left alone to his own devices, this time in New York City and causes chaos and mayhem when he bumps into the freshly escaped \"Wet Bandits\", who are once again, out to get him.The original cast return with Culkin in the lead, Joe Pesci and Daniel Stern as the hilariously dumb, yet slightly endearing criminals with a heart of coal and the fantastic Catherine O'Hara as the mum every child wants, played with just the right amount of fear, guilt, determination and love that is needed. Another noteworthy return is the sequel of gangster spoof Angels with Filthy Souls, Angels with Even Filthier Souls (a reminiscent construction of Angels with Dirty Faces with James Cagney.) New characters are brought to life by Tim Curry, Brenda Fricker, Eddie Bracken, Dana Ivey and a young Rob Schneider.Film critics such as Roger Ebert gave the film negative reviews and saw it as portraying violence as too cartoonish. Despite this fact, the mainstream popularity of the film saw it as a success and to most children of the 90s, the second instalment in the Home Alone series is often seen as equal in quality if not better than the first.This film has been monumental in my life. I cannot remember how I first saw it, but I know that thanks to VHS I watched it a million times. It formed my quintessential idea of New York by using Central Park, Carnegie Hall and the Plaza Hotel as central plot settings. It is as much a Christmas film as it is a New York City film and this familiar touristy promotion shows New York as being a unique \"White Christmas\" town.So in the cheery Christmas words of Johnny the Crook from Angels: Merry Christmas you filthy animaland a Happy New Year.",
    "105": "\"Home Alone 2: Lost in New York\" was apparently conceived when Macaulay Calkin said he wouldnt relocate from his NYC home to Chicago. So, whilst the Windy City (and particularly the affluent suburb of Winnetka) appears fleetingly at the start, most of the film's action takes place in the Big Apple, and that is a pretty large canvas for Kevin McAlister to work with when - shock horror - he is separated from his family, getting onto a plane to New York when the rest of the McAlister clan went to Miami, and - shock horror again - Marv and Harry, the Wet Bandits from the first film, escape from prison and find themselves there as well. Of course they run into Kevin, who threatens to ruin their latest plan to make a big buck.Showcasing pretty much every iconic New York City location, Home Alone 2 features plenty of laughs (the hotel 'Angels with Filthy Souls' scene is great), a Donald Trump cameo in the Plaza Hotel, tonnes of comedic violence and, as a counterpoint to said violence, a sentimental ending, all set to a brilliant score from the maestro John Williams. \"Somewhere in my Memory\" is an iconic piece of movie music, and never fails to make me think of my own ghosts of Christmas past. A fun slice of 90's nostalgia that is still a fun watch thirty years (!!) on.Love this. Always will.",
    "106": "When you watch this film for the first time, you can ask yourself this question \"was it useful to make a sequel to one of the most successful films made in 1990?\". The answer is obviously not. The only interest of the film is commercial. Indeed, John Hughes and Chris Colombus felt like renewing with the huge success of \"Home Alone\". Although this film was average, it was quite funny but, here, its sequel is very poor and disappointing. The film takes back too many elements from the first and as a consequence, it doesn't create surprises any more. For example, when Kevin is at the Plaza Hotel, he's watching, apparently, a detective film, and we know that the man, in the film, will kill the young lady as it was the case in Home Alone with the two men on the video. On the other hand, Kevin's weird neighbour was considered a slayer for a long time; but then Kevin found out that he was an unhappy man. In the film, a tall woman who brings up pigeons took the place of Kevin's neighbour and like this man, she's apparently threatening, but then again, like the man, she had a miserable life. So the film is deprived of originality. Moreover, the screenplay is always predictable and sometimes it's unlikely: Kevin's traps are more dangerous than in the previous film and however the two burglars don't seem to suffer a lot. At last Daniel Stern and Joe Pesci aren't very funny, Stern is even ridiculous and dumb. In 1997, a third sequel was made but with a different actor instead of Macaulay Culkin in the main role. Let's hope, there won't be a fourth.",
    "107": "MACAULAY CULKIN is back again as the little lost boy who seems to have the ability to lose his parents at airports in HOME ALONE 2: LOST IN NEW YORK. While the plot fails to be as engaging as the original, a big asset is all of the New York location photography that gives us great glimpses of the big city for an added dose of realism.It starts out pretty much the way the original did, with the family planning a Florida vacation and with Kevin pursuing all of them as they make a mad dash through the airport. This time, he doesn't deliberately stay behind--he mistakenly believes he's following a man wearing a coat similar to his father.But what's really missing are the characters that made HOME ALONE such a treat--and they aren't topped by the bird lady sequence and her friendship with the boy, nor are the bungling exploits of bad guys JOE PESCI and DANIEL STERN as funny, even though they are as clueless as ever in trying to deal with Culkin's nasty pranks.The violence employed by Culkin gets even nastier this time, which turns out to be a drawback because, after all, this isn't a cartoon where we know no one is really getting hurt.But in general, the story moves swiftly, the parents' reaction to discovering that he's lost is just as funny (as is their encounter with an official while trying to explain the situation), and the supporting cast does their best to keep things lively. Nice to see EDDIE BRACKEN as a toy store mogul in a huge toy store where a key scene takes place.Fans of HOME ALONE will no doubt appreciate this sequel, but they aren't likely to be as fond of it as the original--which had a wistful sort of charm totally lacking here. John Williams' score is a pleasing asset, once again providing a sprightly backdground that gives the film added cheer.",
    "108": "Home Alone 2 (1992)*** (out of 4) A year after the events in the previous film, 10-year-old Kevin McCallister (Macaulay Culkin) finds himself alone once again but this time in New York City. It doesn't take long for him to run into Harry and Marv (Joe Pesci, Daniel Stern) who plan on robbing a toy store for some charity cash. It's funny but growing up I always thought HOME ALONE 2 was better than the original but revisiting it after all these years has me changing my mind. I was really surprised to see how this one didn't quite hold up as well as the original and I think a lot of it has to do with some pretty big errors with the screenplay. Needless to say, the main reason for this thing being made was because the first was such a massive hit. You can expect this type of sequel to be pretty much a remake as everything funny in the first film is copied here. This includes the old gangster movie with the gun, the various knocks and beatings taken by the crooks and of course the \"true\" meaning of family. All of that stuff here is still funny but it just doesn't come close to what the original offered. The biggest problem with HOME ALONE 2 is its running time, which is just way too long for this film and after a while you're really wishing that it would hurry up and end. Still, there's no question that Culkin is just wonderful here in the role that he will always be remembered for. Both Pesci and Stern are fun as the bad guys and we get nice support from Catherine O'Hara and John Heard who have to be the worst parents in screen history. Tim Curry is also fun in his small role.",
    "109": "If I was a young child and wanted to get lost somewhere, then the Big Apple would be my first choice. Yes, Macauley Culkin is back as Kevin McCallister who ends up getting split up from his parents and finds himself lost in New York.Just like in the first film, Kevin has fun at first booking himself into a hotel (you'll find out how a young kid cons a room in the hotel) and has some fun. There's just one snag-Joe Pesci and Daniel Sterns are back as Harry and Marv and once again, young Kevin must outwit them.The plot is pretty similar to Home Alone but don't let that put you off-it just means you've got more of the same thrills and fun to enjoy. Despite being lost in the city that never sleeps, Kevin again manages to find ways to outwit the relentless burglars who take countless bumps and bruises, many of which would have killed them but that's the fun of movies.Yes, Home Alone 2 was a fantastic follow up to Home Alone and it was followed by the equally excellent Home Alone 3.",
    "110": "If you're reading this in 2021, then you should know that it was exactly 29 years ago, in the month of November, that Home Alone 2: Lost In New York was released in theaters. The most striking fact is that this movie is still artistically and cinematically relevant even today.There is very little I can say about this wonderfully entertaining sequel to Home Alone (1990) that hasn't been thoroughly covered already. The film takes place in Manhattan, and there are some wonderful shots of The Plaza Hotel, Central Park, and China Town. Home Alone 2: Lost In New York is arguably one of the leading quintessential modern day holiday films that could only come from the exceptionally gifted mind of the late writer/director/producer, John Hughes. Moreover, it's one of the very rare sequels that in my opinion is better than its predecessor!As always, no spoilers here, but I will reveal that Macaulay Culkin was paid $4.5 million to star in this movie, the largest salary ever for a child actor.",
    "111": "En route to their family vacation in Miami, the McCallisters once again lose track of 10-year-old son Kevin, this time in a rush through the airport; he boards the wrong flight and finds himself in New York City, where he checks into the Plaza using his father's credit card. Sequel to 1990's surprise hit \"Home Alone\" is once again written and produced by John Hughes, directed by Chris Columbus, and featuring mostly the same cast. Macaulay Culkin eventually runs into his former tormentors, bumbling crooks Joe Pesci and Daniel Stern, who have just busted out of prison, and this where the movie goes into retread mode. Physical slapstick routines that made audiences laugh before are recycled--and damned if viewers don't fall for it all over again. There's obviously something comforting in watching a bright, big-budget sequel to a popular family comedy that covers familiar territory (one can sit back, brain in check, and let the picture do all the work), but Hughes' scripted banter is witless, and new characters such as Tim Curry's inept, leering concierge and Brenda Fricker's Pigeon Lady are oddly lacking in humor and charm. ** from ****",
    "112": "It is one of the most difficult things for a producer and director to make a sequel to a phenomenally successful film, much less do ne better than the first. However, that is exactly what Christopher Columbus and the late John Hughes did with Home Alone 2. Of course, the plot is basically the same as the first film, and most of the time that formula would doom the sequel. But it was the small tweaks they made which made this film memorable in its own right. I think that the most important thing was setting a high spirited and naturally inquisitive and exploration minded boy loose in New York, rather than remaining at home. I don't know if kids still are wired for that kind of adventure, but I was. Thus, when I see the grin on Kevin's face as he looks out over the city I can relate. That was me as a kid. Likewise, there is his sneakiness in taking his father's wallet, and genius in the story he told the hotel desk clerk. Of course, the other hijinks of Kevin are similar to the first film but played well, and who better than Joe Pesci and Daniel Stern to reprise their roles as Kevin's unwitting victims. The other minor characters add something to this film that was not present in the first, mostly as additional foils for Kevin's bag of tricks, especially Tim Curry and Rob Schneider. But, it is Mr. Duncan and Annie, the pigeon lady that bring a the needed touches of kindness that make this a such a holiday classic.",
    "113": "How Hollywood knows handling ours feelings in this compelling story, apart being a sequel the same success formula was applied here, the casting had a improvement with news characters as Tim Curry as a snooper, Rob Schneider as tip-man and Brenda Friecker as homeless pigeons lady, without forget Eddie Bracken as a lovely the toy shop's owner, the clumsy couple Pesci-Stern in another remarkable performances, In special way Stern who has no enough brain, Culkin a fabulous wonder boy on the crest of a wave in a another flawless acting again, Columbus & Hughes replicated the usual elements to got the same level as the original, end up a smashing box office, About Culkin I would like to say about a curse that pursuit all golden children, they never got any succsses after they grow up unfortunatelly!!Resume:First watch: 1998 / How many: 3 / Source: Cable TV-DVD / Rating: 7.5",
    "114": "I give this movie the same score as the last movie mainly because it is essentially the same movie only with a new setting. Yes this time most of the action of this film takes place in a New York hotel where our hero can make grown people shiver in fear with old movies that never really existed in the first place and the same two guys are after him for revenge for what he put him through the last movie. The additions to the cast include Tim Curry as a rather arrogant hotel person, and a bag lady who will teach young Kevin (I think that is the brat's name) some sort of lesson though you think he would have learned enough lessons after his last fiasco, but then how would we have the sequel which is obviously one of those sequels they rushed to get made like they did with the \"Look Who's Talking\" first and second movie and when they rushed \"Moonraker\" after \"The Spy Who Loved Me\" and \"Batman and Robin\" after \"Batman Forever\". All those examples basically use the same blue print for there movie so you end up with essentially the same movie with a few new moving parts here and there and considering I hated the first one the change in venue did not do anything to make me like this one any more or less. So I guess that is one accomplishment the makers of this film were able to do, I did not hate it more.",
    "115": "I HAVE REVIEWED OVER 400 (C H R I S T M A S ) MOVIES AND SPECIALS.BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I AM HONEST! I REVIEW MOVIES & SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY Christmas MOVIES AS I CAN. After the Original \"Home Alone\" became the 3rd highest grossing film of all time it was just a given that there would be a sequel and 2 years after the release of \"Home Alone\" 2oth Century Fox Released \"Home Alone 2\" and it was also known as \"Home Alone 2: Christmas in the Park\"After snarky youth Kevin McCallister (Macaulay Culkin) loses track of his father at the airport, he mistakenly gets on a plane headed for New York City -- while the rest of the McCallisters fly to Florida. Now alone in the Big Apple, Kevin cons his way into a room at the Plaza Hotel and begins his usual antics. But when Kevin discovers that the Sticky Bandits (Joe Pesci, Daniel Stern) are on the loose, he struggles to stop them from robbing an elderly man's toy store just before Christmas.None of the charm that made the original so much fun is even present here. This is a sub-par sequel that had no heart and no soul. It was a money grab. Overtime the film has fallen out of public's eye. You will see the original again & again but this sequel is not worth a repeat viewing.",
    "116": "If anyone loved the first home alone, chances are they like this one just as much. and i did too. sure, Kevin is getting older, but that is nothing compared to how mad Marv and harry are. And they want revenge.So in the last movie Kevin was home alone, but Santa Claus has done him one better this year. when the family arrives at the airport, Kevin gets separated, and ends up going to new york...all alone, on his own personal vacation, which is what he wished for, but that wish soon turns into a nightmare when he has to deal with a nosy doorman, a crazy bird-loving lady, and the returning antagonists, Marv and harry, who broke out of prison.Many directors and movie makers that make a sequel to a film %90 of the time make a failure. but in this case, no one failed. the original home alone spawned 3 extra movies, this being one of them, the next one being a colossal make, the one after that a colossal failure made only for TV. the bottom line, go and see this movie, it is well worth it.don't wait for YTV to show it at Christmas. see it now. right now.9/10",
    "117": "While the original is rightly considered an all-time classic family film, the sequel is nothing more than a lazy cash-grab. It staggers me that John Hughes could just rewrite the exact same story and think it would be acceptable. The only significant difference from the original is that the main characters become even more slapstick and many scenes are just plain stupid as a result. It's a shame to see great actors like Catherine O'Hara and Joe Pesci reduced to this.Culkin is still very cute and likeable but his character is so unbelievably corny in this movie that it makes some of his scenes painful to watch. Many of his lines feel like they were taken from a cheap self-help book or a fortune cookie. His scenes with Marley in the original were moving and authentic; his scenes with Brenda Fricker aka Pigeon Lady are just forced and contrived. Speaking of Pigeon Lady, surely they could have at least tried to make her resemble an actual homeless person? She looks like a well-fed piano teacher from Surrey.I really wish I hadn't watched this movie; it's such a shame when these dreadful sequels take the gloss off a great film. It's only Culkin who prevents me giving this a basement rating.",
    "118": "A clever, sweet, and wonderfully done sequel- Home Alone 2 keeps the spirit of the first film alive with an incredibly heartwarming message, and plenty of gags to keep anyone entertained. When I was little, there was no better movie for me to watch than Home Alone 2. It didn't matter what time of year it was, it was just so much fun to watch, and I can still see why that was the case. Although I don't enjoy it as much as I did in the first grade, the film is very entertaining, and full of many laughable moments throughout. The performances are just as good as before for the most part, I feel Daniel Stern overdid it a bit with his performance this time around, though I did enjoy the supporting performances from Tim Curry as the Hotel Manager and Eddie Bracken as Mr. Duncan. The film does have a few plot holes throughout, or things that just seem a bit too forced or out of place, but luckily it makes up for it with its heartwarming ending, which is still one of my favorite conclusions to a Holiday film today. In the end, Home Alone 2 is an enjoyable little family comedy that has its issues, but proves to move far above its problems to make for yet another round of holiday cheer.My Rating: 9/10.",
    "119": "Home Alone 2: Lost In New York (1992) -Once again poor Kevin (Macauley Culkin) was the victim of bad parenting and a bullying Brother. I honestly think that Social Services should have got involved. Kate (Catherine O'Hara) and Peter McCallister (John Heard) obviously had at least one kid too many and as my Nan would have said \"Kate should have kept two legs in one stocking!\". I personally don't think that Kevin had anything to apologise for after the school performance at the beginning, as it was clear who the problem was.In fact the more I watch these 2 films, the more I have realised that Kevin was actually a sweet, witty, clever and insightful child, who was just a victim of bad circumstances and craved attention from parents that had no time for him, which lead him to be a bit of a bugger at times.In this second chapter of the Kevin McCallister saga, he was cast adrift in New York and you'd think that would mean a change in the storyline, but that was not the case and I think that it was a perfectly good way to do things and that the repetitive and recycled elements were what made the film brilliant, without actually being repetitive. It had my favourite things from the previous film, but all with a slight twist or change and much less of Kate's journey to find her son, which could have been the more boring element done twice.Instead, Kevin found new enemies in the hotel staff, played by Tim Curry, Rob Schneider and Dana Ivey and allies in Mr. Duncan (Eddie Bracken), a toy shop owner and Piers Morgan in the role of the misunderstood, but helpful pigeon lady, as he donned a poop covered old lady outfit. It was another of those things that showed Kevin's more adorable side, in the same way that he realised that 'Old Man Marley' wasn't really such a terrible man in 'Home Alone' (1990). (Actually the bird lady was superbly played by Brenda Fricker of course and I have to feel sorry for the poor lady for getting compared to Piers, which must be really offensive for her.)The wet bandits were also back and as stupid as ever, if not more so. Marv (Daniel Stern) had renamed them the sticky bandits, because leaving the taps running last time didn't work out so well for them and he had a new sticky tape thing going on. They chased Kevin down to get back at him for what he had done to them the previous Christmas, while attempting to rob Mr. Duncan's toy shop, which Kevin was having none of and therefore created another maze of chaos and danger for the bandits to endure in his Uncle Rob's house, which was under renovation and empty. I just hoped that Uncle Rob had some very good insurance.I was pretty convinced that the bungling burglars should have been dead from the injuries inflicted upon them by Kev, but it was all done for fun and entertainment, so as long as you don't think too hard about it, you'll be fine.Personally I thought that the real criminals were the staff at the Plaza. They were a prime example of people always looking for the worst and not considering that the youngest McCallister might have just been a frightened child in need of help.You could easily watch this without seeing the first and still enjoy it, but it definitely worked better as a sequel making the most out of the repeated jokes.Overall it was bloody good fun and there was probably a moral in there somewhere too?9.49.81/1000.",
    "120": "I remember so well how much we anticipated this movie. My sister and I watched its predecessor on video everyday for the whole year leading up to the release of this sequel, and we were not disappointed when we finally saw it. We thought it was the funniest movie ever made, because what little kid doesn't want to see other kids get revenge on grown-ups? It seems to me that any kid that says they don't want that in some way shape or form is lying.It's been nearly 30 years since the exciting day we saw Home Alone 2 in theaters, and until yesterday I had not seen it in many years, even though we went through a phase of watching it on video (once it came out) almost as much as we watched the first one. But then, at that age I thought bathroom humor was funny too.\nMy tastes have changed as I've grown up and I did not have high hopes for watching this movie again. How well could it possibly hold up, now that I've been exposed to so many great filmmakers and the likes of Fellini, Jaglom, Visconti and many others line my favorites list?I was pleasantly surprised. So, so, so pleasantly surprised.Much to my shock, I laughed almost as much as I did back in 1992, and not just at the slapstick. The way Kevin manipulates grown-ups to get what he wants is still hilarious because it is *almost* believable. The scene where he plays a gangster movie to trick the hotel concierge (Tim Curry) was a highlight in particular, especially now that I'm familiar with Curry and his other work. It's much too funny to spoil.Would I have liked it as much if I hadn't had fond memories of seeing it as a kid so many years ago? I really think I would've, because I (unlike many of the critics of the day) remember what it was like to be a kid, but even if I didn't, watching idiots be humiliated is fun for someone of any age. It brings out a sense of justice not only for the kids that are belittled by adults, but for any adult who hates to see morons get the upper hand.",
    "121": "I'm not sure 1990's Home Alone was crying out for a sequel, nor indeed do I think the first film was produced with that of continuing the misadventures of its young protagonist in mind. Like any scientist experimenting with chemicals and procedure in their laboratory, burrowing away at what it is they do for that elusive formula which will make them famous and, they hope, the world a better place, American director Chris Columbus toyed with this project about a kid stuck at home; his family's mad dash back to him and a pair of crooks looking to rob his mansion of a home before happening upon something with a shelf-life. The first was a sweet enough tale, this idea of a child at home alone after wishing to be as such whilst learning some home-truths about the presence of one's family and, encapsulated in the supposedly serial killing road-sweep, that life beyond one's homely walls was a little different to what one originally thought. Boom! Ideas and chemicals and experimentations forge together to create something audience's respond to, Home Alone being one of the fifteen or so highest grossing films of all time at the time, and thus a sequel is spawned. Cynicism aside, it's important to establish Home Alone 2: Lost in New York exists for the cash and solely for the cash; a filmic formula that was stumbled upon and saw people react.In truth, Home Alone conformed to that of a closed narrative structure; by which we mean his stance on things were introduced, befell a catalyst which allowed him to address his views and then came around to realise that things weren't so bad when you've got the sort of family young Kevin McCallister had and you're living in the environment that you are. The framework was established; developed and then closed and there was no room for further development. Lost in New York takes everything the first instalment did, as well as the places it took its lead, and incinerates them in a blaze of smoke within about fifteen minutes: this time, his reaction to his realising that he's all alone with time to himself away from his family is greeted with a grin rather than a grimace. He is afraid, but only of getting caught.Like number one, it's Christmas time and the greater extent of the McCallister family are going nuts over their annual festive holiday. This time it's Florida, and this time Macaulay Culkin's Kevin makes it as far as the airport departure lounge, in what is an improvement of not even getting out of his bedroom the first time round, but gets mixed up in the rush and lands himself on an airliner to New York. Feeding off what had happened back home in regards to Kevin and his managing to fall out with his family over a practical joke at a school choir pageant, access to his father's credit cards and a wad of existing cash draws him into staying at an expensive hotel and gorging himself on the surroundings rather than turn himself in. First and foremost, New York City dwarfs Kevin; a montage getting across the scale of the place in regards to this overtly street-wise youngster is encapsulated in a tracking shot away from The World Trade Centre as Kevin stands atop it.Alas, a somewhat hackneyed subplot to do with the two burglars from the first one is cooked up; Joe Pesci's Harry and Daniel Stern's Marv have escaped from prison in amidst a riot and have come to New York as if European immigrants at the start of the century seeking opportunity and fresh starts. In direct opposition to his 5-star living in the mean time, however, is chief of the hotel floor Mr. Hector (Curry), whose gurning face is the subject of a dissolve designed to sync up with that of an image of The Grinch on television. Like those aforementioned bandits from the first, he is indeed out to wreck McCallister's Chritsmas cheer upon happening upon Kevin's scheme to live a high life on his father's card and by himself..Complaints with the first film came with its tendency to place most of its eggs in the basket labelled \"final twenty minutes\", when a series of stunts and second unit sequences saw Marv and Harry smacked about by a number of booby-traps Kevin had laid for them. Here, one can practically feel Columbus nudging us in the arm and winking at us square in the face as the realisation the film is about to do what everybody responded to the first time, again. It was marginally fun the first time; here, harmless slapstick has crept up a notch to near full on body-horror: where a paint can on the bonce or a pellet gun round to the groin was once as bad as it got, one cannot help but omit gasps of surprise that Stern's character hasn't already been killed five minutes into the final act. This knowing sense about things only really mattering during these sequences is epitomised in Marv's 'knowing' reactions of \"Uh-oh!\" as something else befalls him - a laughter cue is all that's missing. The somewhat brainless and rather unnecessary sentiment of the whole thing is summarised in the reason for the final act to even happen, that of the fact the criminals have been snapped looting a store thanks to Kevin's Polaroid camera and are desperate not to be incriminated further. For whatever reason, they ditch the successful score and chase him into this dilapidated house of traps having already topped the wanted lists as escaped felons anyway. People say Kevin's intelligence in these films is too \"unrealistic\" for that of a ten year old; but with competition like this, are we all missing something?",
    "122": "Home Alone 2 isn't great but it's watchable. I think Tim Curry is who makes this film enjoyable. I like Mr. Duncan the toy store owner as well. Kevin, his family and the 2 wet thieves are about the same as the first film.My problem with the film is not enough interaction between Kevin and the thieves - that's why we watch these movies.Kevin gets himself on the wrong flight - separated at the airport. Kevin accidentally gets on the wrong plane and ends up in NYC - the same city the wet bandits escapes from prison.It's not a bad film but just not enough of the comedy between the brat and thieves as I'd like.6/10.",
    "123": "If you loved Home Alone your definitely going to love Home Alone 2.It's a bit same as last year but this time i'ts even better.This time Kevin Mcalister's (Macauley Culkins) in New York and he's got even more better tricks than last year.Harry (Joe Pesci)and Marv(Daniel Stern)have escaped prison and are in New York too.Harry and Marv are robbing a toy store this time and get caught by Kevin Mcalister again. ( Kevin takes a picture of Hary and Marv,and runs to his cousin's house where he has set the traps because his cousins have gone on vacation to Paris and is on the balcony and is followed by Harry and Marv)\"Pass the camera boy,and we'll leave.\"says Harry. \"Promise\".says Kevin.\"Across my heart and hope to die.\" (Kevin turns to get a brick but Harry and Marv start to laugh because they think it's the camera)(Kevin throws down the brick and it hits Marv)(Then he throws it again and it hit's Marv again)",
    "124": "This movie takes everything in the original, and does it better. It takes many of the exact same beats from the first movie, and does them again, which most people seem to dislike, however, I disagree. With the exception of the pigeon lady, (who is pretty good, but really does just feel like a rehash of the shovel guy) all of the repeated elements are done with variation, and are improved in quality. The fake movie in this is funnier than the one in the first, the whole \"I'm a kid and I'll have fun doing irresponsible stuff\" aspect is done better thanks to the setting. And the humor is generally better. Maybe a lot is redone in this movie, but it's a winning formula, who cares? The pacing is also drastically improved. The first Home Alone is good, and I'm not saying that the first chunk of that movie is boring, but even with the comedic and other ways entertaining aspects, it still feels like you're just waiting through the movie to get to the trap sequence. However, in Home Alone 2, it feels like every scene is entertaining, and the trap sequence is just a cherry on top. Speaking of, the trap sequence is really good in this movie too. I don't understand why so many think this is a \"rushed sequel\" when they've presumably watched the whole movie all the way through. What I'm saying is, or, my point is, Marv getting electrocuted is absolutely hilarious and is the best example of slapstick comedy I have ever seen, seriously, rewatch it and tell me this isn't a good sequel. I don't know, I'm a bad reviewer, and this review is all over the place, but just please, please rewatch this movie and really give it a chance. Really see it as a movie, don't go into it expecting to hate it, just try to enjoy it, and you will. Or maybe not, who knows. I'm rambling, this review is over.",
    "125": "NB! English is not my native language so I'm sorry if my writing is bad.This is a super funny movie. Ass the same as the first movie this is a movie full of slapstick jokes. It is a classic movie that I think everyone should watch. I get super Christmas feeling of that movie. It's such a good movie for everyone and you don't need to watch the first one to understand. The characters are superior and I like them a lot. It's a super fun and cozy Christmas movie.It is a super good movie to watch. And everyone will enjoy it, no matter the age.It is a good reminder of how important you're family are and that not everyone has it good on Christmas Eve.Although it is a great Christmas movie that everyone should see at least once in a lifetime.",
    "126": "As a general rule, sequels are supposed to expand the universe of the original film and up the stakes, making everything bigger and flashier. Home Alone 2 does just that even if the story is overly familiar. In fact, it's the exact same story. Instead of Kevin's family leaving him at home this time, they leave him on the wrong flight and he ends up in New York while they end up in Florida. In a bizarre and improbable twist of fate, he catches the eye of Harry and Marv who decide to get revenge on him for what happened in the previous film.It's clear that this movie was fast-tracked into production without enough time to really ask why this film was necessary. After all, the idea of someone's parents leaving their child once is horrifying enough, but after this second time, it makes you want to have the police get involved and take all their children away from them.The originality might be non-existent, but the cast is on fire, the jokes are funny, and everything that was lovable about the first film has been exaggerated times 100.",
    "127": "I've always loved the first HOME ALONE film, ever since I was a kid, but I deliberately put off seeing this sequel after reading the negative reviews back in the day. Watching it now, as an adult, I can see what the reviewers meant: this is an insult, or indeed a kick in the teeth, to anyone who loves the first film.Given that the original movie was a smash hit, it was inevitably that a rushed-out sequel would quickly follow. And rushed out is right; this is a mere remake of the first film, albeit with a different setting (and nobody gets \"lost\" either, despite the title). The characters are all exactly the same, the gags are the same, everything's the same. A bigger budget doesn't mean improved quality; it means that everyone was in this to grab more dollars.It feels exactly like director Chris Columbus and writer John Hughes are going through the motions here. The bumbling villains are back and have even more ridiculous motives than previously. The crazy pigeon lady replaces the crazy old guy. Even the same TV gag is played out again. Hell, even the climax takes place in a house again, so the whole New York setting turns out to be a cheat. The whole sub-plot with the stressed out parents really drags things down a lot too.HOME ALONE 2: LOST IN NEW YORK isn't a total loss as a film, even though it's a crushing disappointment. It's hard to dislike Joe Pesci and Daniel Stern, two actors giving such physical performances. Tim Curry is a fun addition to the cast too. But Macaulay Culkin's self-knowing, superior attitude is becoming annoying already (and, indeed, his Hollywood star was to quickly wane after this) and there's absolutely nothing here that hasn't been done better previously. It's a real disappointment.",
    "128": "\"Home Alone 2: Lost in New York\" is a delightful sequel that captures the spirit of its predecessor while adding new layers of humor and heart to the story. Directed by Chris Columbus, this family comedy follows the misadventures of Kevin McCallister (Macaulay Culkin) as he finds himself separated from his family once again, this time in the bustling city of New York during the holiday season.The plot of \"Home Alone 2\" takes Kevin on a wild and comical journey through the streets of New York as he outsmarts a pair of familiar burglars, Harry (Joe Pesci) and Marv (Daniel Stern), who are after him once more. Armed with his wit and resourcefulness, Kevin navigates iconic New York landmarks, encounters new friends, and sets up an elaborate plan to protect himself and thwart the burglars' evil intentions.The film successfully recaptures the magic of the original \"Home Alone\" while introducing fresh and inventive scenarios. The slapstick comedy is taken to new heights as Kevin outwits his adversaries with an array of creative and hilarious traps. The physical comedy and clever pranks provide consistent laughs throughout the film, showcasing Macaulay Culkin's comedic talent and bringing joy to viewers of all ages.\"Home Alone 2\" also explores deeper themes of forgiveness, compassion, and the power of family. Kevin's encounters with the kind-hearted toy store owner, Mr. Duncan (Eddie Bracken), and the compassionate pigeon lady (Brenda Fricker) teach him valuable lessons about empathy and the importance of human connection. These heartfelt moments add depth to the story, making it more than just a series of comedic gags.The film's setting in New York City adds a grand scale to the story, with its iconic landmarks serving as a backdrop for Kevin's adventures. The city's vibrant energy and holiday decorations create a visually stunning atmosphere that enhances the festive spirit of the film.\"Home Alone 2: Lost in New York\" is a worthy sequel that captures the essence of its predecessor while delivering a fresh and entertaining experience. With its blend of slapstick comedy, heartwarming moments, and Macaulay Culkin's charismatic performance, the film provides laughter, warmth, and holiday cheer. It's a perfect choice for families and fans of the original, ensuring a jolly and memorable movie-watching experience.",
    "129": "For the inside view of those movies, you can read my review for \"Home alone\". Here, I just want to compare this sequel to the original.I think \"variation\" would be a more accurate word than sequel, because you find exactly the same ingredients: the family feud, the fast departure, the lone mysterious figure, the wet bandits,  I can't recall a brand where such a copy happens.In addition, the spirit of Christmas is a bit lost. If New York is a wonderful town, it hasn't the warm of a suburb or a mansion.However, the movie is more fun than the first one. It's one of the few movies that make me laugh till I cry. Really! I'm just fond of the Joe Pesci whom bad temper grows bigger and bigger as the hits he takes! And the soundtrack is just awesome: the score from John Williams, close to \"Hook\" written in the same period, is an excellent example of the musical power and how can score is essential to movies (and life)! From my recent watchings, \"300\" is a great movie but doesn't enter my Pantheon because it lacks THE score. I can't even hum the main theme! That's not the case here and that's why I remember to have bought then the audiotape to listen again and again to it, the Darlene love song, the Christmas Carols! Woof: such cool memories! So it's a pleasure to make them discover to the kid, to hand on the torch",
    "130": "Comedy. A direct continuation of the mega successful \"Home Alone\", which turned out to be no worse than the original, but rather better in many ways. Well, of course, I watched this picture on TV, and for the sake of this review with pleasure I reviewed it again. Since there are three days left before the New Year, so I am properly charged with a festive mood, and here is my brief opinion - And again an unsuccessful robbery. There were both pros and cons in the picture, and now your humble servant will tell you about them. Uncover the comments and prepare the habits, well, fasten your seat belts, our train started.\nSo the pros:\n1. Script - the picture is again focused on Kevin McCallister, who again managed to lose his family. While the others flew to Florida, Kevin himself, by mistake, ended up in New York. Not only did he find himself in a huge metropolis, our old acquaintances, the thieves Harry and Marvin, also fled from places not so distant. We are again waiting for a truly epic confrontation between a petty prankster and two boobies. Re-experiences of parents, especially mothers. Fun adventures and a touching ending. Again washing away family relationships, a brief joy of loneliness and incredible melancholy from realization. The script is still simple and family friendly. It contains important and eternal values, without which a happy life is impossible.\n2. Festive atmosphere - pre-Christmas New York is beautiful, I say without irony (I even wanted to go there). Christmas trees, gifts, songs, hopes, fun - all of this is in stock and works great. Well, the music of John Williams, diluted with the famous Christmas hits, without which this holiday is very difficult to imagine.\n3. Humor - I'll say terrible - I liked everything, absolutely all the jokes terribly! Moreover, even the antics of some minor heroes did not disgust me. For a second, Tim Curry (General Secretary from the game Red Allert 3) and Rob Schneider are available here. But the cherry on top of that cake for me is Kevin's traps, especially with the gas burner. I urged so that I had to come to my senses after that. The humor here is not strained, but more elaborate than in the first part. In short, if you want to laugh heartily, then look at this particular, second part, because here it is much better with this. There is not even vulgarity, in contrast to the first part.\n4. Behavior of thieves - here they are not at all annoying with their mischief Again, the whole point is in the scenario, which was clearly worked out. Their behavior is more natural and does not cause attacks of \"Spanish\" shame. They act more harmoniously, albeit according to a well-established scheme.\nSo the cons:\n1. Traps are not all, but many are deadly. Of course, this is offset by such an unreality of tricks and tricks, but if you look meticulously, then the thieves, after falling into a couple of such traps, the horses would move with one hundred percent probability.\n2. Kevin's brain - judging by the first and second parts, Kevin is a living embodiment of Newton, Einstein, Kulibin, Korolev, Archimedes and so on, for he invents and makes traps with the imagination of John Kramer. How he does it? He's less than ten years old, isn't he? Is he a child prodigy or what? This is a cant of both the first and second parts.\n3. Thieves are substituted for traps - as in the first part, here the thieves are obviously willing to go straight into the traps, without any ulterior motive. Eh! Life has not taught anything! However, this time it looks more convincing and even without replaying the majority of the participants.\nA little about the main characters:\n1. Kevin McCallister performed by Macaulay Culkin - old Kevin was again alone, this time in a metropolis, and then it started. Kevin here is not who he was before. Now this is a cunning fox, capable of giving a bite to the goofs who did not understand anything the last time. This is a brave and determined boy, although sometimes he is cowardly, but only at the beginning. Macaulay played great here. Even without replaying it was possible! Well done!\n2. Harry, played by Joe Pesci, is the leader of the thieves' duo, who planned a big deal, until, unfortunately, they met the culprit of their troubles - the boy Kevin. It's time to deal with the problem once and for all. Joe here made me extremely happy, for he did not overact, and his untranslatable curses amused the whole picture. Bravo Joe!\n3. Marvin played by Daniel Stern - Harry's accomplice and one of the funniest characters in the entire series. He behaves like a typical goof who falls for the most obvious traps, which amuses the viewer. But Daniel is replaying here again, unfortunately. But I will praise all the same!\nWell, in the luxurious Plaza Hotel, its owner, who a few years later will become the President of the United States, Donald Trump, appeared for a few seconds.\nThe fees for this part were a little more modest, but this did not stop the greedy producers, and after a while, they rolled out the third part to the audience, where Kevin and the other heroes were not. Well, what happened in the end - I'll tell you next time.\nKevin McCallister's story ends on a high note! Bye Kevin! But at any moment, with great pleasure, we will review the first and second parts.\nNot a masterpiece, but a good and funny movie.\nAs a result, we have a good continuation about the adventures of Kevin McCallister, with a good and well-developed script, a great Christmas atmosphere, great humor and good acting.\nMy rating is 8 out of 10 and my recommendation for viewing!",
    "131": "I have a vehement dislike for sequels when it comes to films. They're often really poor in comparison to the original. But I love the second Home Alone, as I thought it has more humorous situations. The only downside is that the beginning isn't really any different from the first movie. Now the McCallisters are going to Florida for Christmas. They're such an unlikable family. Now 10-years-old, Kevin is still getting bullied by them. His older brother Buzz intentionally humiliates him during a choir performance. When they come home he apologizes, but Kevin knows it's not sincere. And then everybody's looking at him (Kevin) like he's the one who's a terrible person. He goes off on them, calling his uncle a cheapskate. I'm not in favor of kids disrespecting adults, but I also wanted to be on Kevin's side. Then again, he wouldn't make it any better, because he would say something nasty in response to what they said to him. If this was real they would need counseling. They oversleep again and have to run through the airport. Kevin isn't left behind at home, but gets separated from his family as he's trying to put batteries in a tape recorder, and gets on the wrong plane after running behind a man who he thought was his father because he happened to be wearing the same coat, so they looked identical. The plane is headed to New York City. Instead of being terrified, like most kids, he's excited to explore the city alone. It was understandable why he enjoyed going places by himself, considering how toxic his family was. He stays at a fancy hotel, where one of the employees (Tim Curry) becomes suspicious of him. He runs into the burglars who tried to break into his house two years earlier, Harry and Marv (Joe Pesci and Daniel Stern), aka the \"Wet Bandits.\" Kevin leaves the hotel and goes to his other uncle's house. He has a brownstone that's being renovated. That's where Kevin sets the booby traps for Harry and Marv. The movie is quite long, more so than the original film. So much of it takes place with Kevin's antics in the hotel, riding in a limo eating pizza, and running around the city from the \"Wet Bandits,\" that by the time they get to the part with Harry and Marv succumbing to Kevin's injury-inducing inventions, you might find yourself tired. I know I did. Plus watching the two of them get beat up by Kevin's traps is even more painful than the first movie, so I can see how some people had a problem with that. But at the same time, I do find it strange they were against the traps he created. I mean, if you have people chasing you relentlessly and wanting to kill you, I imagine you'd try to defend yourself any way possible. Of course this is a movie, and it wasn't meant to be intellectual, so you can't expect it to make complete sense. It's a funny Christmas film with a couple of heartwarming moments, particularly when Kevin is talking to a homeless woman who lives in Central Park and takes care of the pigeons. He was scared of her at first, but then he realizes she's harmless. It's a great lesson in not judging people based on their appearance. I highly recommend for anyone who has watched the first movie but not this one. I took off 1 star because it did feel long at times, but otherwise it was funny. You won't be disappointed!",
    "132": "My wife and I are just back from five days in New York and even though this movie was made 25 years ago, with so many of its landmarks unchanged, it certainly enhanced our enjoyment of the film especially as we'd somehow never seen it before.Watching it on the run-up to Christmas helped too but the fact of the matter is that the movie's highly entertaining and enjoyable anyway. I get that McCauley Culkin's goofy grin, floppy hair, big ears plus of course that scream of his might irritate some but I otherwise found all these plus his smartness and rebelliousness quite acceptable.I enjoyed the way the writer and director, knowing that this is a sequel bound to end up with the same slap-sticky, booby-trapped conclusion as its mega-successful predecessor found a clever and even credible way to separate Kevin again from his family. I loved the New York winter locations while on the acting side, I equally enjoyed the cameo as toy-store owner Mr Duncan by veteran Eddie Bracken, who starred in so many great Preston Sturges films of the 40's. John Williams also delivers a playful soundtrack in keeping with the frivolities depicted on the screen.In these and other ways, director Chris Columbus harks back to those Golden Age Hollywood days, not by coincidence is \"It's A Wonderful Life\" referenced again in one of his movies, but here too he contributes a lasting seasonal classic which I dare say will likewise be watched and enjoyed by families at Yule time down the years.",
    "133": "Not a patch on the first movie.Similar storyline.Very unbelievable that the crooks from the first movie and the kid are not only in New York at the same time but in the same area.A bit over-violent for little kids.Just one brick being thrown from a two story building and hitting someone in the head would kill them, let alone numerous bricks.Falls from a great height, being set on fire etc.. and still surviving?More cartoon-like than the first one.",
    "134": "Home Alone 2 picks up a year after the original film in which the McCallister family accidentally left young Kevin alone to battle two criminals at Christmastime. It's Christmas again, and the family have planned another vacation. They don't leave Kevin home alone this time. A mix up at the airport sends the family to France and Kevin to New York...ALONE! Luckily for Kevin, he has his father's credit card which he uses to check himself into the luxurious Grand Hotel. From that point on, Kevin must battle the hotel management staff who believe he stole the credit card he used, as well as a return from the Wet Bandits! Harry and Marv are back and Kevin has a whole new set of tricks and traps that batter the crooks yet again. I really like Home Alone 2: Lost in New York, it matches up pretty well to the first film. Macaulay Culkin does his thing as Kevin, the little boy who finds inner strength during moments of terror. Joe Pesci and Daniel Stern are hilarious again as the bumbling idiot criminals. O'Hara and Heard are back as the parents who have some funny moments as well, and Tim Curry/Rob Schneider/Dana Ivey add much to the film as the hotel staff. The abundance of characters really works for this movie, they each add an important part to it. Home Alone 2 obviously breaks away from the \"home alone\" idea. Kevin isn't at home he is in a giant city. There is however a good chunk of film time spent at an abandoned house in which Kevin sets up his attack against the 'Wet Bandits'.Home Alone 2 should be seen by everyone in my opinion. It isn't your average Christmas movie, but it does take place at that time in New York City. There are some great location shots at Rockefeller Centre and Central Park. There are also many heartwarming moments between Kevin and a homeless woman he meets in the park. I liked it a lot!8/10",
    "135": "Ah well - how can you lose or forget a child twice? The movie tries to be self referential and make fun of that fact a little, but it is still quite ... well not good, to put it lightly and not use words that may not be allowed here.Having said that, and I do realize that the first two Kevin movies (Home alone movies, in Germany they put Kevin in the title for some reason) have a lot of fans. This adds some actors to it while bringing back the Wet Bandits (or burglars or whatever Joe Pesci and one called themselves) - one of them being Tim Curry. He is really good - and he is even able to pull off the most ridiculous things off. Like the shower scene - it shouldn't work on so many levels and still because of Curry, there is some fun in there. You also have \"Deuce Bigalow\" in here himself - well I reckon he was not as famous back then, but he is doing his usual stuff, so there is that.A lot of convenient humor, a lot of explaining that still doesn't make sense and apparently a lot of people who just let things slide and are full of forgiveness for all the flaws the movie has ... good for you if you liked this too, like you did the first one. I personally would rather watch the Looney Tunes - they aren't \"real\" - well this is real or tries to be at times and then completely leaves this world for Looney Town ... also 2 hours? Way too long.",
    "136": "This is another of those sequels that... suffer(?)... from a not entirely uncommon illness, known as \"The T2 Syndrome\". Terminator 2 may not be the origin of said illness, or even the first film to fall victim of it, but it is commonly accepted as the first recorded case of it. The syndrome renders any sequel as more of a remake of the first than an actual sequel, but the quality is a variable, it can go either way(or nowhere at all). Usually, everything in the film is kicked up a notch, higher production value, more action and more entertainment... sometimes signifying a higher budget. These films are often a desperate attempt by the film-makers to re-create the success of the first without breaking new ground or showing any originality or creativity. For whatever curiosity value it may hold; Charlies Angels: Full Throttle is another victim. As a victim of this illness, the film contains scene after scene(in fact, it's put together by them, it consists entirely of them) that are mild re-writes of scenes from the first. The plot is basically the same, and at best, fairly interesting. The minor lift the film has received in content, the fact that everything is just slightly 'more' than it was in the first makes for a few entertaining scenes scattered throughout the film(good thing, because without them, the film is barely worth watching at all). Apart from the entire original cast(well, the foundation, at least; the McCallister clan is back) returning for this sequel, we are also joined by the comedic talents of Rob Schneider, Tim Curry and Dana Ivey(I know, I know, but think of how she was in the Addams Family films, seriously), which pays off big time. The pacing is fine. The acting is mostly goofy and overplayed, which I suppose is the idea. The humor works, on occasion. There is one thing I just have to say; I don't much mind the silly humor of most of the film, but at the end... when it turns to slap-stick, Looney Tunes-like humor... that was just too much. It was bad in the first, this time, it's worse. I could barely watch. I found myself turning away again and again, taking longer and longer to look back at the screen. The content disgusted me. This is coming from a man who, in the last week, has seen Dawn of the Dead, Saw and Hellraiser: Hellseeker... during which, I never turned away, or, for that matter, regretted that I hadn't. The tone is just too much in this film, during those last scenes. I don't know what disturbs me more; the fact that I, myself, as a child, enjoyed these scenes. The fact that as I write this, there are children enjoying them. Or the fact that there are grown people... not only enjoying watching them, but thinking that it's OK, that it's OK to put that in (children's) films, to tell children that it's OK. That it's responsible. That children may, or even(*shudder*) should think that. It disturbs me. Quite a lot, in fact. That aside, the film does a nice job, through cinematography and dialog, to show the world as seen by a young child... of course, that only makes aforementioned fact even worse. I only recommend this film for people studying films, so they can analyze and debate it, get into the frame of mind behind this film, understand it. Anyone else watching it should take great care to understand that it is, in fact, fiction, and has very, very little to do with reality. I wouldn't consider this proper viewing for kids, unless these are very mature and understand that it's not real. 6/10",
    "137": "\"Home Alone 2: Lost in New York\" takes place after the events of the first one as Kevin is finally going on a Christmas vacation with his family, but gets left behind again as he ends up in New York instead of going to Florida as where his family is going. Now Harry and Marv are back as they went from being the Wet Bandits to the Sticky Bandits, try to get revenge on Kevin as Kevin deals with them again as he saves Christmas and stopping them from stealing the money's charity that were suppose to be donated to the children's hospital by Ducan's Toy Chest. Okay, I'll admit that this movie is not as good as the first one but I don't think it deserves the hate it gets. I've seen sequels that are worse than \"Home Alone 2.\" Heck, I think the third and fourth are worse than the second; the fifth I did not seen and would not have any desire to give it a watch. I think, in my humble opinion, \"Home Alone 2\" is a fun sequel than any of the \"Home Alone\" sequels that got made. I thought John Hughes did a fine job with the script as well as what Chris Columbus had to do for directing it. John Williams' music is just as good as the first one, and the cast did great. Macaulay Culkin really does well as he did in the first. Even Joe Pesci and Daniel Stern both still made a great chemistry together. Of course, you got to have Tim Curry who is indeed a lot of fun. Brenda Fricker was good too, but she is just another version of Roberts Blossom from the first movie (forgot to mention that Roberts Blossom is also really good in the first one). I thought some of the slapstick in the movie were really good, but some were flat; the movie does have some fine humor, but weren't as good as the first. I really do love some of the shots in New York along with some of the Christmas scenery that are in this movie. I understand some of the similarities that were done in the first one, but it wasn't 100 percent carbon copy. You still get some things that are different. I would have mind if they have tried something new, but I do give it a pass because I was already entertained enough with this movie. I do wonder why Kevin's family is watching \"It's a Wonderful Life\" in Spanish when they are in Florida as the movie they are watching should have been in English. In the first one, the same movie they are watching is in French which makes sense because they are in Paris. However, you can make an argument if the reason they are watching \"It's a Wonderful Life\" in Spanish is that there weren't any Christmas movies to watch so they ended watching this movie in Spanish because its a Christmas movie. If its true, then I get it but that is just me. Also, not sure if I'm wrong or not that Kevin's father should have just checked on Kevin on how is he doing as they are running to catch their flight to Florida. It's your call on that. Lastly, I wish if the family would stop treating Kevin like garbage as for what they did in the first one. Should have learn their lessons. With that said, I don't think the movie deserves to be ignore because I think it deserves the attention as what the first one did; the third; fourth and fifth movies are the ones that need to be ignore. That's just my opinion on that. \"Home Alone 2: Lost in New York\" is a fun movie, but its not that bad; I still think its fun, entertaining, and still has that Christmas feeling as what made the first one so good about it. Not sure if I put this in the underrated category, but I know its not as bad as what everyone makes it out to be. I say give it a chance! I give this movie an 8 out of 10.",
    "138": "This movie does not work. Making a movie featuring over-the-top cartoon violence CAN work, but only if you never slip out of cartoon mode. A part drama/part cartoon is not going to work. You can't, for example, make a scene with a little kid having a touching conversation with a lonely homeless woman and immediately follow it up with wacky cartoon antics. When you do that, your movie stops being funny and becomes extremely disturbing.In the first \"Home Alone,\" Kevin only seemed interested in maiming the villains; in this one he is apparently trying to kill them. Case in point: the scene where he is throwing bricks at Marv's head. Not dropping them, but actually THROWING them at the guy's face. From this point on Kevin turns into some sort of demon child on par with the kid from \"Pet Sematary\" as he tries burning, electrocuting, and cracking open the skulls of his victims while shouting things like, \"Nice night for a neck injury!\" (He actually says that). The thought of a theater full of young children laughing at two men being brutally tortured for half an hour really creeps me out.The only possible reason to watch this is for Tim Curry, one of the world's greatest actors and who steals every scene he's in, but otherwise it's a waste of time.",
    "139": "I enjoyed the first movie a lot. Probably one of my favourite comedies ever along with Madagascar trilogy and Back to the future! Of course, with every successful movie, a sequel must come. Perhaps, now Home alone has 5 sequels, but only this one starts the star from the previous movie Maculay Culkin!The plot is similar to the first one: It's Christmas once again, Kevin messes up, he gets grounded, and he (almost) gets forgotten by the family. In the airport, Kevin accidentally gets himself in a different plane that flies to a city that never sleeps - New York! Why? Because he really enjoyed his new gift - a sound recorder so much, that he didn't realise that he's in the wrong plane. And his family panics again. Also Harry and Marv return to steal stuff once again.Although the plot is similar to the first one with some differences, you can't deny that it's as laugh out loud as it's predecessor. Most actors return including Joe Pesci (Harry), Daniel Stern (Marv), Catherine O'Hara (Mrs McAllister), Devin Ratray (Buzz) and more. But new actors are here too, including Brenda Fricker (the pigeon lady) and even Donald Trump is in this as a brief cameo (at least in the old copies, I don't know whether this scene is cut from the newer versions or not).The humour is well made like last time, Kevin will throw something on the thiefs or scream in a funny way when he sees something scary or even trick the hotel staff into thinking that there's a crime scene by using an old cassette of a sequel called \"Angels with even filthier souls\". New York itself looks like a huge city with skyscrapers, stores and a large plaza hotel, although in 2021 it looks different from early 1990s counterpart.If you enjoyed the first movie, then you should 100% watch the sequel. Definitely worth a watch, especially on a Christmas or new year day.",
    "140": "Well the Christmas season will be upon us soon! To help celebrate my all time favorite time of year, I have certain holiday movies. Home Alone 2: lost in New York is one of my favorites. This sequel to the 1990 hit is better than the original in many ways if you ask me. Culkin is no different here, he's just fine, like in the original. What is better/different here is the quality of comedy and the entertainment value. The first home alone certainly isn't bad, but I do feel like this one exceeds the original as far as entertainment goes. Joe Pesci and his assistant Marv (the sticky bandits) are even better/funnier here than the first time around. The action is better here, and in my opinion, the acting is better. I really loved Catherine O'Hara here too, thought she was hilarious in her role, and the dialogue her character is given really helps boost her funny, touching performance. \"The way I'm feeling no mugger/murderer would dare mess with me\". Lol bravo. John heard is fine here, his acting/character really doesn't have to be good in any way, his character is okay just kinda being there. The subplot with Kevin and the homeless woman who saves him is very sweet and touching, I really do love that they included that in the film's plot, really added a lot to it. Tim Curry is also to be applauded too for his funny performance as the Ritz hotel manager. 8/10.",
    "141": "In the film after this, perhaps little Kevin has been taken away from his ridiculously negligent parents by Child Protective Services. Or maybe he's grown up and is now a serial killer, luring people into his house of horror and sadistically torturing them.There's not a lot of cleverness to be found in this sequel, which recycles the material from the first film to cash in on its success. The script is weak, and between the sappy and precocious lines Macaulay Culkin utters and the moronic behavior from nearly every adult, the film gets lame pretty quickly. That leaves the slapstick, which is entertaining to some extent, but the violence is excessive for a feel-good Christmas/family film, even if it is modelled after the old Looney Tunes cartoons. Somehow seeing a kid hurl bricks off the roof of a building and hit a guy in the face, or turn up the voltage while he's electrocuting someone, was just less funny with real people, and those are only a couple of the moments.The film is bloated at two hours, and just feels incredibly dopey to me - all of these characters and how they act, the manipulation with the pigeon lady and the mother's redemption, the fact that there is nothing original going on, and the har-har look at all the ways we can torture Joe Pesci and Daniel Stern's characters. Obviously it's not meant to be taken seriously but I groaned when the mother got sanctimonious with the hotel staff and the police about her child's disappearance, without a shred of self-awareness. The film is watchable in the right company to laugh along at how bad it is, and I didn't despise it or anything, but it is a little depressing that this mediocre Hollywood cash grab was so successful.",
    "142": "This is another of my favorite sequels, childhood gems and an honorable mention in favorite Christmas films. I remember seeing this in the theater, to me it was one of the best times I ever had in the theater as it was just a festival of up roaring laughter. Yeah, it's true this sequel doesn't surpass the original, but I don't feel it's trying to, and yes it's not perfect but it has it where it counts because like with the original it sets itself out for what it wants to be holiday fun.What I like about the sequel is it has sort of an adventurous feel to it, as we see Kevin is out of his comfort zone and is in a fascinating but strange land. Once again there is sort of that wish fulfilment fantasy tale, as we as kids and even adults have dreamed of having that perfect Christmas vacation someplace, we want and having the time of our life our way. Like seeing Kevin ordering room service eating Triple Scooped ice cream sundae and he says one of my favorite lines, \"make it triple, I'm not driving\" wonder if any kids or adults thought about saying that whenever they ordered ice cream for room service, on a side note, would love to try that hotel's ice cream.We see Kevin once again watching a sequel (ironically) to that gangster film from the first movie. It's just hilarious as we see once again Johnny whom as usual has an explosive temper. He says another favorite quote, \"I believe you, but my Tommy Gun don't!\" damn this guy has serious anger management issues. On a side note, there were some other R rated films Kevin saw that were stacked up beside the one he is watching, shame there wasn't a scene or two to see what those films are.I really like that we get to see some of New York if not a whole lot which is one little weak point of the film. From that hotel which is a real hotel I'd someday like to find so I can visit the location of where the film was filmed. We even see him go to a place called Dunkins Toy Chest which is nice looking, though the place has no toys nor even a video game department, it looks more like a \"Hallmark\" store which is weird; Kevin should've requested \"Toys R Us\", damn I miss that place in fact toy stores in general.Music is good there is the same memorable score by John Williams and some new track one song I really like that's became a Christmas favorites are \"Christmas Tree\" (the version where Buzz didn't frak things up) and \"Distant Goodnights\" which I'll admit really has a sweet but sorrowful feel. There is one scene that is a bit of a heartstring pull as both Kevin and his mom say good night to each other from a distance, it reminds us and Kevin despite all the fun and games, he's still unhappy deep down and misses his family just as his mom feels guilt once again bears the burden of guilt and misses him.Characters are good, Kevin as usual is Kevin whom to me is the master trickster. Once again, he's on the sympathetic side as he can never seem to catch a break with his family. He once again gets punished for something he really isn't guilty of. Buzz (somedays I really hate that guy) whom as usual is being a idiot decided to play a prank on Kevin in the entire school. Personally after that stunt, if I was the director of that production I would kick Buzz out, you pull crap like that in every production you don't get to perform and seriously McCallister family stop being so leanant toward Buzz that's probably what lead him to doing stupid crap in the first place; sorry this sounded bold but I had to get that out. And once again Karma is on Kevin's side as he gets to have the time of his life.But one thing I really like that Kevin has is the Talk boy, which I thought was cool at the time, this was way before phone app tech. It's basically a tape recorder, but it has a mike and a way to manipulate your voice to sound like an anonymous voice dub. This device no doubt comes in handy for Kevin throughout the film and it would be cool if they made a \"Home Alone Talk boy\" app where we can recreate those features.Tim Curry one of my favorite actors is great as the Concierge. He's almost the subordinate villain in film, ok not really, more of just your obstacle. He's a guy that is completely uptight, really wants to run the hotel like a tight ship. But a little on the egocentric side as he really wants to bust Kevin to both keep his hotel intact but also to inflate his ego. It' s just funny the certain reaction he has toward Kevin's trick which crack me up.The Wet Bandits or Sticky Bandits whichever you prefer, as usual are themselves, they haven't changed as both are still nincompoops. I like the fact that this time they've stepped up their game as their now robbing stores instead of houses. This plan would work if it wasn't for one poison pill in the plan which they're at fault for taking which is a weak point I'll get to latter. But these guys are funny as usual, from their typical back and forth and the spills they rightfully take.The humor as usual is hilarious just spot one, from another scene with the Concierge and his company when they go to Kevin's room they are once again duped by one of Kevin's tricks as he is playing the Gangster pic loud. I won't give away what happens next you just must see it yourself it's just hilarious.\nBut of course, down to the final battle which is a physical humor/slapstick comedy fest and even more violent and painful than before. I won't give too much away on that I'll just state a couple of the traps.The first one is of course the beginning of the battle, where the robbers stupidly think Kevin will corroborate in throwing down the camera and Harry says another of my favorite lines though was common at the time, \"I cross my heart and hope to die.\" I snickered when he said that because it's like he's practically telling Kevin to take him out. And of course, Kevin throws down something toward them, lets just say his Christmas gift to Marv.Another of course is the electrocution scene which I was just laughing my head off toward, that one is sort of a live action \"Looney Tunes\" gag. Just hearing Marv's screams was just music to my ears. But we also see his skeleton as he's being shocked. Another that's sort of a Looney Tunes gag is the teeter totter which cracks me up, but it cracks me up even more the fact that Harry wasn't smart enough to get off it immediately, yeah fast one Harry.But this sequel does miss a trick or two that really holds it back a little for me, I'll just state a few. I don't like how there are some moments of stupidity that I felt could easily have been avoided in the writing. Like that mis boarding scene, I don't like how that was handled. The whole battery thing was stupid and a cheap device, seriously Kevin couldn't wait to get on board to replace his batteries. Personally, it should have been some sort of holiday rush riot where it was not just the McCallister family but every other family and group that was rushing to their planes and somehow Kevin gets lost in that crowd. Let alone the stupidity of the Robbers whom had a good plain and would have succeeded if they just left Kevin alone, which I'll admit is a plot hole.There are also a few too many coincidences, from the Robbers being in New York the same time Kevin came. Or Kevin's uncle and aunt having a place they were renovating that happens to be in New York. I do believe in coincidences, but this is just too big to swallow. Didn't like the whole gun thing with Harry and Marv, it felt out of place and out of character.The film doesn't quite bring much new to the table as it has that fundamental problems some sequels have, where it does seem just a bit like the same film in places just dressed differently make the film a tad predictable; though same could be said for certain slasher franchises out there like the \"Friday the 13th\" films but that didn't make them bad (or not all of them) so I can't complain too much on that.I honestly didn't care for the bird lady character, she not a bad character but by her nature she really a filler character that I could take or leave but all the same really there to fill in empty space and time much like Harry on \"Doctor Who\".If Kevin was suppose of have a secondary character along the way it either should have been one of the members of his family which would have been interesting, it would help shed light as to who that family member is in the multitude of members as well as provide depth on the family but may 'be further the stakes for Kevin as he not just has to protect himself but a member of his family, but it would help make the film a little different sort of like a buddy buddy film, could of also meant extra traps see this other member's tactician skills. I don't know it's a nice thought, anyway, shame it was never considered.Overall, despite being one of those mixed bag movie/sequels I still had fun with this film which really is most of the time all I can ask for sequels. \"Home Alone 2\" like any holiday vacation is worth a trip.Rating: 3 stars",
    "143": "Home Alone 2 shouldn't work, but it oddly does? It does so by keeping the spirit of the original alive by improving it and making the stakes and plot bigger and better! And here's why.Home Alone 2 follows Kevin from the first movie, except instead of being left alone at his home he instead gets alone in the city of New York (he got separated from his family in the airport), he learns how to fend himself in the big city and to encounter a familiar villain from the first film.First off the positives, the movie is much longer than the first one but doesn't feel like it- instead the length feels generous and you don't really want to leave the wintery streets of New York. Building on this critique I think it builds up an excellent atmosphere, just like in the second movie- it breathes christmas through and through. The direction is nostalgically filmed and grand for a movie like this, it looks good with effective shots. The music isn't as memorable as the first one but serves a good purpose throughout.The actors are excellent as well, delivering their best comedic timing (I mean, who doesn't love Tim Curry!?).If there are any negatives to be said well... I'd say it's the same as the first one, so many plot points are very hard to explain for this movie, for example how couldn't the family see Kevin go out of the plain when they arrive to Florida? Or didn't the mum check for her son in the plane? It all feels a bit strange but then you have to remember this is a Home Alone movie so just go with the flow. I guess it is kind of hard to write another disappearance and trying to make it make sense, because in a way the characters should have learned from the mistakes of the first movie but eh, it's better not to think too hard about it!Either way this movie succeeds as a great sequel, building up the ante and just being pure unadulterated Christmas fun. Check it out, if you have seen the first one!",
    "144": "I revisited this not-so-good sequel because of recent talk of censoring a certain cameo in it. IMDb is quite cesnsorious itself, having rejected three prior versions of this review, so I won't talk about that here.Unfortunately, the returning cast are caricatures, too, of their roles in the original \"Home Alone\" (1990), recycling just about everything for the sequel--Culkin's raised eye brows instead of winking at the camera, his enjoying his fulfilled wish for a while before whining over his missing family, making friends with scary old people, and even including a sequel to the film-within-the-film, \"Angels with Even Filthier Souls\"--but turning up the excess to the point that it's hardly funny anymore. Joe Pesci and Daniel Stern's criminals going through the same booby traps in a McCallister home that they did last time becomes an eye-rolling Looney Tunes affair, not only with Pesci's mumbling replacing cursing, but also receiving violence as though they were cartoon characters. Where's the sadistic pleasure in it if the bricks to the head, electrocutions and heads set on fire don't seem real in the slightest.Even worse is the increased family Christmas schmaltz and the blatant product placement, from the Plaza Hotel and Coca-Cola to the Talkboys they sold from this. Outside of Culkin, Pesci and Stern, the rest of the cast is an entire bore this time around--the otherwise wonderful Catherine O'Hara included. They don't even bother to be consistent with how many years it's been since the last time the McCallisters abandoned one of their children, as the parents say it was last year, but Kevin was eight then and now he says he's ten. Whether you're a censor or a spectator, best to leave this one alone.",
    "145": "Home Alone 2 (1992) is a movie my daughter and I recently watched on Disney+. The storyline follows Kevin and his family up to another Christmas vacation. As they are running through the airport the family and Kevin get split up and Kevin goes to New York and the family goes to Paris. Once again Kevin will need to fend for himself this holiday season.This movie was directed by Chris Columbus (Mrs. Doubtfire) and stars Macaulay Culkin (The Good Son), Joe Pesci (Goodfellas), Daniel Stern (City Slickers), John Heard (Big), Tim Curry (IT) and Kieran Culkin (The Cider House Rules).The music in this was awesome. Bringing so many of the original family members and original cast back was fantastic too. There were some good one liners and Culkin versus the thieves are always fun and hilarious sequences; however, they did use too many of the same themes again - replacing the shovel guy from movie 1 with the pigeon lady in movie 2, same thieves with same hijinks, and Culkin drawing up the same blueprints/plans this time in a toy store instead of a house seemed like lazy writing.Overall this is still a fun and entertaining picture just a huge step down from the first film. I would score this a 6.5-7/10 and recommend seeing it at least once.",
    "146": "Though not quite as much fun as the original, this isn't an half bad follow-up. The beginning is a little too convoluted setting the scene as this time the family go to Florida but a last minute mix-up at the airport sends \"Kevin\" (Macauley Culkin) to New York. Initially a bit apprehensive, he heads - armed with his dad's credit card - straight to the Plaza Hotel where he goes a bit bonkers with the room service and catches the attention of suspicious concierge Tim Curry. Whilst out exploring, the recently released Joe Pesci and Daniel Stern bump into him and decide to exact their revenge - not before telling him of their daring plan to rob a toy store. Of course he escapes their clutches, and quickly decides to try to thwart their thievery - as only he can. Curry is on good form here, as is just about everyone else as the slapstick hits overdrive and the paint pots, a nail gun and even an old cannon find innovative new uses. It is a good team effort, this - with plenty of gentle humour and amusing antics. Maybe just a bit too long, the joke starts to wear a bit thin but Chris Columbus has built well on the first film, with just enough variation from that one whilst essentially keeping the story the same.",
    "147": "The sequel. It's always a difficult topic. The second part after the first successful film should be no less cool, but it often happens that it is the sequels that ruin the wonderful original stories. To my great pleasure, \"Home Alone 2\" became that gorgeous sequel, about which you can always say without a shadow of a doubt that the sequel turned out to be very worthy. And this movie, like the first one, can be endlessly reviewed every Christmas and New Year.Director Chris Columbus follows the classic precepts of the sequel. He repeats the story of the first film, but complicates the plot and makes everything much bigger. It is unlikely that it will be news to anyone that the main character Kevin will be lost again. However, now he has to find himself not just alone at home, but alone in New York, one of the largest cities on the planet. And here the boy will not lose face, but thanks to a successful combination of circumstances, he will try to spend the holidays to the fullest. But old acquaintances Harry and Marv will break into his life again. Wet bandits gracefully \"mimic\" into sticky bandits, and the confrontation between them and the now ten-year-old boy will make you enjoy watching what is happening on the screen.The painting repeats its original very much. It's noticeable. But at the same time, the creators are ready to offer something special that will connect the story with the first film, as if recalling what happened a couple of years ago, but at the same time will present something unique. The film is full of good jokes, hilarious falls, bumps and other attractions, where the screen villains will get much stronger than last time. But all these repetitions look good, there is no sense of incongruity. Rather, on the contrary, I want to see Kevin defeat his rivals again and again. That's why it's a fairy tale, so that the good turns out to be stronger, and everything that happens (though sometimes deadly) was made up.Acting, as before, is on top. The trio of main characters holds up perfectly in the frame. Macaulay Culkin has grown up a little, it feels like he has become adept at acting. But Daniel Stern and Joe Pesci remained the same. These are all the same native villains, whom you empathize with more and more often, realizing how many times guys have already had to die from one trap or another. Once I even came across a video where it was calculated how many times the villains would have died for both Columbus films. In general, they would have no chance of survival.The second picture, like the first, creates an amazing Christmas atmosphere, literally full of bright green and red flowers. The abundance of colors allows you to get into the spirit of Christmas and New Year, and the setting of the story leaves no chance for the film to become an unshakable classic, which more than one generation has been reviewing every year and, hopefully, will continue.The film is full of dynamics, memorable supporting characters. What are the appearances of a whole ensemble of comedic incarnations, including Tim Curry, Rob Schneider and Dan Ivey. Their characters in the huge hotel were very funny. The others are also good.But, as before, the relationship between a mother and a young son comes to the fore. Even if they are copied, we saw the development of the characters' relationships in the first picture, in this case, it seems to me, it would not be superfluous to repeat and convey to the viewer that the most important thing in life is family. Despite all the possible hardships, it is always important to remember who the people closest to you are.\"Home Alone 2\" is a good and interesting story that is definitely worth putting on the list for viewing at least on New Year's holidays. This is a perfectly packaged (as a gift) story of family vicissitudes, interesting action and, of course, an incredible fairy tale that you want to continue to believe in.10 out of 10.",
    "148": "Home Alone 2: Lost in New York is a sequel that is almost identical in quality and plot to the first. The first film was a fresh new idea, but often misunderstood by people who weren't taking into consideration it was an exercise in childhood escapism. When you can look past its implausibility, it's a unique and amusing film for many, but different generations and different audiences will gradually differ in responses.Now we have a sequel, which right off the bat sends me into useless quibbles. He doesn't have a home in New York, so how is he home alone? This could've easily been its own stand alone film if the characters were all different and just be called the film's subtitle \"Lost in New York.\" But would it sell as well? Probably not. So bring back the three actors and we have ourselves a sequel.The plot seems to be lifted directly from the original film. Due to a severe mix-up at the airport where Kevin (Culkin) follows a man wearing the same coat as his father, he is taken on a flight to New York instead of with his family who is going to Florida for Christmas. Kevin fearlessly checks himself into a hotel, gets settled in, then realizes the criminals he beat the hell out of (Pesci and Stern) in the first film come back and now have placed him back in their cross-hairs.From there on out the plot becomes more jokes about being hit on the head and running away frantically. I give Macaulay Culkin a boatload of credit for not being one of the childhood actors like the ones on Full House where they spend a lot of their time standing still and looking cute. Culkin provides cute, boyish charm while creating eventful mishaps on screen. Just like in the first film; some antics are funny, some are redundant without being funny.We also get a strange subplot with an old woman who enjoys feeding pigeons. She has been considered the \"old creep\" in town and has been shunned by her peers. That's how Kevin feels with his big family most of the time. Their connection is slim, but acceptable. While at the same time it feels almost contrived and not a very needed subplot. It does rest the tired hit-on-the-head jokes that have been hit over our head, pun intended, during the course of the film.Home Alone 2: Lost in New York provides some nice shots of New York, some decently executed dialog, and delightful cameos like Ally Sheedy, Donald Trump, and, my favorite, Tim Curry. The only downside is you're watching the same film. It still fuels the \"childhood escapism\" tank like I mentioned before, but it does hardly anything new with it. It just rehashes a formula previously seen before. More imagination to the story could've been taken into consideration.Or maybe, just not have a sequel at all. The first was an unexpected success, it did very well in theaters, and is still played repeatedly during the holiday season. The concept of a child being left alone to fend for himself by accident is a possible thing. Unfortunately, the sequel does little to expand the idea except by removing the four walls barricading the kid in the first film and giving him a full city to work with. A lot happens in this two hours. Quite a lot of things. Plausible or not, it's beginning to get very redundant. I suggest parental counseling and a dog leash.Starring: Macaulay Culkin, Joe Pesci, and Daniel Stern. Directed by: Chris Columbus."
}