{
    "0": "A word of warning for those expecting another Gladiator or non stop action spectacle. It is not. Truly not...The bad: director Ridley Scott knows how to make action scenes look slick and impressive (and he does an excellent job again), but he is also known for being quite average at making a drama. And this movie tries (and partly fails) to combine action and drama and somehow ends up being neither one. THAT is one of the reasons I'll only rate it with 6 stars.More bad: this story has a weak \"dramatic\" middle (love story) part, which is kinda tedious. And that brings me to a storyline complaint, namely that this story is all over the place. They cram SO much events and history and different characters from different time periods into this one movie that it kinda confused and numbed me down, instead of thrilling me, as an epic should do.This movie was made for Apple streaming (release date january 2024) in the first place, but they made a shorter (butchered) version for the cinemas in order to be able to compete for the Oscars, which demands that a movie must have run in the cinemas for a couple of weeks. No cinema version, no Oscars.The original Apple streaming version lasted some 2 hours longer. Nobody is gonna sit in the cinema for over 4 hours, hence they cut this movie up and now it feels somewhat rushed, confusing and disjointed at certain moments.Not any good then? Joaquin Phoenix is the one redeeming feature. He nails it.. He makes Napoleon look like a complete joke of a man and I love Joaquin Phoenix' performance, but that unfortunately didnt compensate for the other actors being just about average and with little actor's chemistry between them.I had been warned beforehand by friends that this wasnt the spectacle or epic drama they were hoping for and unfortunately they were right. Certainly not a terrible movie, but one that is just about average.Thank you for reading my 2100 th review on Imdb.",
    "1": "Many of Ridley Scott's movies are like visual masterpieces with epic storylines. I was sort of expecting something like Gladiator. Instead, it was just \"meh\" - I probably would have quit watching if it was on TV.Joaquin Phoenix has demonstrated that he can play odd or troubled characters well, but I don't think he was a good choice for Napoleon. He made the character seem more bizarre than charismatic or leader-like. I think the strongest and most interesting character was actually Josephine (Vanessa Kirby) ... who will probably get the most traction from the movie.The story itself wasn't that interesting because it wasn't explained that well. For example, his departure from Elba island seemed to randomly happen without much explanation. The elevation to a monarch-like role also happens without much explanation. It's like you're watching snippets of a bigger, more interesting story.I become so disconnected from the story that I almost fell asleep during some of the long battle sequences.The movie would probably have been better if it captured just one pivotal event or time period ... or better yet, if it had been a miniseries. While I will still look forward to any future movie from Scott, Napoleon deserved better.",
    "2": "Im only focused on the historical aspect here ... and I only mentions a couple of out many hereIn the beginning, Napoleon abandons a battle at the Egyptian pyramids because Joséphine is unfaithful at home in Paris. It is pure fiction.Much later, when the two have divorced, he marches on Paris from his famous exile on the island of Elba, because he is jealous that the Russian Tsar Alexander is apparently taking a swing with Joséphine. From whom Napoleon, by the way, has long since divorced.It is a distortion of history of the worst kind. Joséphine dies of pneumonia in 1814. Napoleon first marches on Paris in 1815 to regain power, a wild story that could be a whole movie in itself.If you´re gonna make an expensive movie like this, get things right instead of just making romantic stuff up.",
    "3": "What a disappointment. This film is BORING. A movie with a huge budget, good actors, about a person as fascinating and complex as Bonaparte, who participated in more than 60 battles and had drama, triumphs and failures that would be enough for a few lifetimes, is... BORING! Nothing is well explained, it's unclear who is who beside Napoleon and Josephine. Several unnecessary sex scenes between the two. What's even worse is that it's unclear why the French nation would follow and worship this Napoleon as he's portrayed in this movie, because in this movie he seems a mediocre personality, without much charisma or extraordinary abilities. In addition, everything on the screen looks greyish blue, without vivid colors, and it is a bit depressing. I liked only two elements of this movie: musical score and costumes.",
    "4": "First, let me get this out of the way. If you want to watch a focused masterpiece, watch Waterloo with Rod Steiger and Christopher Plummer. It could have only been better (for me) if Steiger had a French accent. Second, if you want to watch a general scoping history of Napoleon, consider the excellent and approachable Napoleon series with Christian Clavier (with a French accent), Isabella Rossallini, John Malkovich and Gerard Depardieu. (Clavier is sometimes unfairly maligned when indeed he does a splendid job in my view.) There are other well-reputed less approachable versions, but these two are excellent.Now, as this work, let's start with Napoleon. A boyishly handsome, philosophically grounded (Napoleonic Code), egotistical, pugnacious genius, sometimes brooding sometimes loving, sometimes playing. That is, a strategically gifted, tactically trained, boyishly handsome, egotistical, passionate, lovable, fighting, moody, young genius.I am sorry, but this character requires someone like a young Brando or Pacino. Phoenix simply cannot, no-way, pull it off. Way wrong. Crazy wrong. He does not have the range. He is a great actor only in a particular type of role, a crouching villainous Caesar or a depressive Joker. A melancholic low-key whispering introverted Napoleon does not work, and some form of delusion by Scott allowed or put Phoenix into this role. I can easily get past failure of boyish good looks and the way wrong age (and Napoleon's young age is part of the story itself). But I cannot get past whispering tone and failure of charisma, passion and charm. Napoleon seduced a lot of people in a lot of ways.It's not Phoenix's fault he was miscast. Way miscast. Vanessa Kirby was fine and did her job. But, no one in this movie deserves any acting nominations. Take one common scene, being the \"Will you shoot your emperor?\" following Napoleon's escape from Elba and return to France, the other referenced Napoleons had timing, tension, and drama, here blah, nothing. Nothing! It's just bad. Really bad.Nothing in this movie taught me anything, made me think, made me feel, or moved me in any way. Terribly unengaging. Even the couple attempts at comic relief (if there would have been any tension, which was devoid) it was misplaced and failed miserably.Now, let's talk about the versions. This is the 2.5H version and there is another 4H version to be released by Apple+. Everything is a gimmick these days. Every streaming channel has one gem, but I'll suggest this work is inherently flawed by miscast Phoenix and more time to blend the scenes won't do it. In this 2.5H version, it's like a bunch of scenes without any context. We go from the French Revolution through the Reign of Terror through Napoleon's coup through Austerlitz through first defeat through Elba through return to France through Waterloo, through St. Helena. In 2.5H, even with the right actor who has engaging charisma and charm, it's too much ground. No character development whatsoever. None. Even in 4H it's like getting two bad suits for the price of one. It's just more of what's bad, which is miscast Phoenix in the titular role. I only understood the movie because I love and know the history. My wife and 86 year old father could not follow it, and my 19 year old daughter (somewhat tired from returning from college) dozed off a couple of times. No one liked the movie. And we even went out of our way to the IMAX because, well, it was Napoleon.I almost forgot to mention the emasculation of Napoleon by Josephine, the jarring politically correct now-required social normalizing casting of extras, and the ending credits that count the dead but give no context for the concomitant social reforms.Braveheart was historically all wrong, but it was still a great story with a wonderful score. This Napoleon is a bad story, and, even if Napoleon was a fictional character it was still bad. It's both a bad reflection of a real man, a grossly incomplete historical depiction, and a bad story poorly told no matter what.Napoleon was loved, hated, admired and ridiculed, by many of the same people, at different times. He was, if nothing else, one of the greatest characters in the recorded history of mankind. To try to do it all fairly, with the wrong titular actor, is silly. Really silly. Delusively silly.Sir Ridley's movie The Last Duel failed for a similar reason, and then he blames the audience. It's not the production or even perhaps the precise movie direction that is going wrong, it's that the story itself is not well-told. Perhaps it's time for him to teach his tactical craft to a young person with the right vision for the story expression.I need to watch my Waterloo DVD again to get my head back to the right flavor of Napoleon the Great, not Napoleon the Whisperer.Nothing good, new or better. A waste of my time and money.",
    "5": "The title says it all. When anyone thinks about Napolean, they automatically think of the general, the egomaniacal conquerer, military genius who glorified and unified France after the French Revolution.So going into an \"epic\" 2 hour and 40 minute movie, you would safely assume we'd get a glimpse into that twisted, genius mind, especially from an actor like Phoenix, right?Wrong. Instead we get practically a two hour, unoriginal portrait of his banal relationship with Josephine; yes, the rest of the 45 minutes are indeed battles that were good, not great. The lopsided focus on Josephine is unwarranted and unjustified, merely because we didn't learn anything new that we couldn't already assume if it only featured a half hour with their relationship on screen. Honestly, I still cannot fathom any point in that narrative decision after enduring it, as again, there were no twists or startling revelations; if the point was to just humanize Napoleon, we get it, he had a wife and dealt with her toxicity.The best part of the entire movie was the very end when the biographical title cards came up and revealed what a bloodlusting monster he really was, with the visceral explanation of the vast amount of lives he lost in his vain conquests. Back then, the world population was exponentially less than today. Three million in less than twenty years over 61 campaigns, with the Russian incursion costing three hundred plus thousand alone, seventy thousand at Waterloo. It's a shame that most of the tone of the movie not only was wasted on his love life, but moreso did not depict him as the maniacal sociopath he clearly was.On a side note, since we're delving into European French history and this piece failed to capture the period well enough, future filmmakers should hone in on the actual French Revolution. Tale of Two Cities, anyone? Nolan would crush it!4.5/10.",
    "6": "History is an undesired guest taking the backseat in Mr Scott's sprawling epic on Napoleon's life.Mr Scott's craftsmanship is such that it's undoubtedly able to offer the viewer some unique experiences. But stunning battle visuals and great performances by the lead actors don't make up for gross historical approximation.I have no doubt whatsoever that Mr Scott knows his history and, if he didn't, he surely has a fat staff of assistants to tell it to him; so what he does here (as he did already in Gladiator) is a very deliberate and blatant choice to bend historical reality to the purposes of his own art, which looks like an act of unforgivable artistic hubris.",
    "7": "Making a movie on a charismatic person like Napoleon is a huge undertaking. It requires in-depth study of his life and then choosing specific events of his life to show and connecting them to perfection. The film maker is short in time therefore it is important for the movie to be precise, fluent and with a purpose. In this movie, the director, Ridley Scott, fails to determine which points of his life he wishes to portray and consequently it results in a piece-by-piece movie which lacks cinematic flow and confuses the audience.The movie disappoints in showing the battles, only briefly does it show the battles of Toulon and Austerlitz and then a bit longer Waterloo, of course concentrating more on Wellington's genius rather than Napoleon's side of things, where there is no mention of Marshal Grouchy's failed mission to block Blucher's army from joining the battle.As great an actor as Joaquin Phoenix is, he barely succeeds in persuading the viewers that he is Napoleon. I felt like Napoleon was intentionally mimicked by the film maker to portray him as a socially awkward person who does not know his way around women, or even his soldiers who loved him so much. During the coup d'etat he is seen as a confused \"coward\" who escapes for his life and is only saved by the cleverness of his brother. But I have personally grown up around military personnel who are calm and composed in the face of adversity and prudently handle critical situations which makes it even more incredible that a military genius of Napoleon's stature would cower under pressure.Joaquin Phoenix's character lacks fundamental personal charisma which is so evident in leaders in general, and military leaders specifically. The movie fails to communicate why then the most civilized, liberal people on the planet earth during that time followed this uncharismatic, bland leader in 61 of his battles? French had already beheaded their king, and all French men were citizens with equal rights - at least only men. No other country in Europe has achieved this level of self-consciousness for human freedom at that time. There is also no mention of his civil, political, artistic achievements like the Code Napoleon or the great artists that flourished under him.Joaquin Phoenix is himself or rather he is still in his Joker character. Apparently, he didn't try enough to get into Napoleon's character. Look at Marlon Brando for example, who shines in his role as Napoleon. Joaquin is so one dimensional who seems to be asleep all the time and has no idea what he is doing while the real Napoleon was an energetic, charismatic, young, and quick individual.I tried to get over his age difference as he is too old to portray such a young person. Napoleon was 24 when Marie Antoinette was guillotined. He was 35 when he was crowned Emperor of the French. Joaquin Phoenix looks in his fifties in the whole movie. Vanessa Kirby's young age doesn't help much as Josephine was 6 years older. Vanessa Kirby plays brilliantly in her role and dominated every scene she was in as a cold, unfaithful, and then heart-broken queen.It was a brilliant opportunity wasted by the film makers. It could have been much better - as the brilliant life story is already there. The music could have been better. They should have used one of those music/sound directors Christopher Nolan uses in his movies. The cinematography was very good though. The battle scenes were filmed well. My friend pointed out that the cinematographer found his favorite angle on Vaness Kirby when they were in their private bedroom. I laughed more at this joke than at any \"funny\" moments in the movie. Overall, it is a below average movie. Don't go there with your hopes held high. I think Napoleon deserves better than this shambolic movie. Now I am not sure I will watch the director's cut. I am looking forward to a young, energetic director taking this enterprise and making a Braveheart-like movie.",
    "8": "If I knew nothing of Napoleon, I'd be utterly confused about what was happening in this film. There is no hero's journey to follow and nobody to root for.Who is Napoleon? Why is he in France? How did he get to his position? The film begins with the death of Marie Antoinette and pretty much dives right into Napoleon being in charge somehow. Why Napoleon? No idea.Early on we meet Josephine's minor son who is never seen again on screen after a one-on-one meeting with Napoleon. Why does Napoleon meet with him? Why does he grant his request? Why is he interested in Josephine? No idea.The film feels as if you're a time traveller who is moving forward to different snapshots of Napoleon's life. There's little context or explanation. Lots of battle scenes, troop movement, flag signaling and even smelting to make munitions but not a lot of context. Why is Napoleon going here or there? No idea. What is his end goal? No idea. Why do Napoleon's men have an affinity for him? No idea.There are large spans of time between scenes so suddenly Josephine's daughter is a grown adult speaking with Napoleon. No clue who she was until Napoleon mentioned Josephine being her mother. Who are all of these people? No idea. How are they connected? No idea.The film is beautifully shot. The costuming is perfection. The set design is dreamy. Nobody can say that Ridley Scott doesn't know how to make a movie or that Joaquin Phoenix isn't a fantastic actor - it's simply a poor script.",
    "9": "I feel unsatisfied walking out of that theater after three hours of melancholy and confusion. I understand every single word and every single scene, but when they connect into a whole film I don't understand anything. To start off, the costume/production design, naturalistic sceneries, the two meticulously-depicted ancient warfares --- one amid the doleful squall of Austerlitz and another atop the dampened prairie of Waterloo --- and all other technical stuff are spotless. However, there's an anxiety-inducing problem with the narrative --- the movie has no focus. No climax, no resonating themes like Oppenheimer, just one plain, linear, chronological plot; and even that we get multiple baffling time jumps throughout. The plot is so simple that everything in the film was taught in my AP World History class last year in one day, except it nibbles on some superficial details. Highlighting the relationship between Napolean and Josephine is a unique take, and I do see efforts from the two esteemed performers to capture their mutual toxicity and intricacy, but this love story has barely anything to do with the movie's main arc, Napolean's personal rise and fall. Nothing! Two basically unrelated storylines unfolding in the most bland way possible. Also adding to this insipid mess is the score, which is composed primarily of classical or really old-sounding French folk --- what happened to Radiohead from the trailer? God Ridley I don't wanna say three hours of my life is wasted but it kinda is!I didn't think it was possible but, I think Oppenheimer's winning the Oscar.",
    "10": "As many of you know, Stanley Kubrick was obsessed with Napoleon, and he wanted to make his magnum opus about him near the end of his life. He never got around to it. I would have loved to have seen that film.This film is not a total disappointment, but it's far from great. I fell in love with its visuals, and I felt as if I was in the era of the 1790's/early 1800's. Its war scenes are good. Also, I appreciate that it does not hit the three hour mark, but it felt choppy and often incomplete. For instance, when Napoleon got punished a couple of times for his defeats one might think that he cut straight from a loss to a meeting with foreign dignitaries. In actuality, things were much messier in between.I never really felt a romantic spark between him and his first wife, and I never really felt much emotion ever throughout the entirety of the film. Even his death was rather anticlimactic and weak.I would recommend this film only to French people and history buffs.",
    "11": "Just came from a full theater. At the end we got up and left in dead silence. No plot except broad strokes of history, little dialog, no passion, Phoenix seemed catatonic, and the movie was nothing more than set pieces posed to look like romantic paintings by Jacques-Louis David (who actually conveyed more emotion and spirit ). The early climax was Austerlitz, which Scott tried to stage as a replay of the destruction of the Teutonic Knights in Alexander.Nevsky. Wikipedia says maybe two of three soldiers (of thousands of casualties) died in the frozen ponds.Waterloo was equally lame, with French cavalry trying unsuccessfully to break the British Squares looking ridiculously like Plains Indians riding in circles attacking a wagon train. (Mel Brooks staged that better.) And Blucher's timely last minute arrival (which Wellington described as a \"near run thing\") had no tension and no suspense.Beautiful costumes and sets, a case of thousands, but unsatisfying either as historical spectacle or grand love affair, with Phoenix and the director both giving new meaning to the expression \"phoning it in.\"",
    "12": "During this movie, I just felt like watching a Monty Python's version of Napoleon or a BBC special based on a flyer they took on a train station about Napoleon's affairs and life troubles. Once again, Scott is making out his version of the history or the history that goes with his religion and political views. About Joaquin Phoenix's acting, it's sometimes laughable ala Eddie Redmayne on Jupiter Ascending, Halle Berry on Catwoman, or Marion Cotillard's death scene on Batman, that bad!!! Gosh, this movie is a reminder of past glories that are far gone and Mr. Scott is not deceiving me once again. He did it once with Covenant, guess who did it again? Not Britney!",
    "13": "Napoleon is one of the greatest characters in history. He came out of the ashes of the French Revolution to not only lead the country but to inspire it. People were given new hope, aspirations and above all opportunities.Bonaparte created the first meritocracy in Europe. Ordinary people rose to positions of significance in the arts, sciences and all walks of life. In his army almost all the generals came from ordinary backgrounds, whereas pre the Revolution they were aristos.Not one person who doesn't know about Napoleon will know any of this when they come out of the movie.There is nothing to give an insight to his motivation Hint, it wasn't all for Josephine. There was no politics. None of the brilliant generals who fought with him get a look in. Bernadot was invited to be king of Sweden! Talleyrand was a self serving rat, but here is a nobody.Even the election of his brothers to the thrones of other European countries is not worth a mention.Napoleon enjoyed his power. Phoenix mopes about with his usual stone face making every day seem a chore.The only good part, worth the three stars is Waterloo, which is a good battle scene, if not by any means perfect, but watching the move from line to square was satisfying.Now people will think this morose dull man was Napoleon. How could he have been? Why would the French have loved him? Why would they welcome him back.What a disappointment.",
    "14": "This was one of the worst big budget movies I have ever seen. I made it toward the later half of the movie and everyone had already walked out, I decided to also walk out. It was the first film I ever walked out on. Here is why:Napoleon opens with what is seemingly going to be a historical biography film adaptation of Napoleon's life, what you instead get is a poorly made, half attempt at a comedy. That's not an exaggeration, it really does play out like a half attempted comedy that's neither funny nor entertaining.It starts in the French Revolution, the first problems was Joaquin Phoenix. I never thought he was a bad actor, but he's bad in this movie. Not only is he a bad Napoleon, not only is he way older looking than actual Napoleon (who is supposed to be 24 at the start of the film), but it's like he didn't even wanna play the role. I don't know what he was going for here but what we got is a bumbling fool with no confidence in any regard, no sign of intelligence, no backstory, no character development, no knowledge of his life outside of his marriage, and above all no historical accuracy whatsoever.This isn't only Joaquin Phoenix's fault, it's Ridley Scott and writer David Scarpa too. Everyone failed this project.If what you were looking for is a film about the Napoleonic Wars, look elsewhere. There is almost no war in it, and what little war there was, is only little clips of warfare, and then straight back to Napoleon's marriage life. Even if you found the marriage stuff interesting about Napoleon, this still isn't the movie for you, because it's not accurate and the film makes it's point early on, but for some reason they keep going over the same ground already covered about Napoleon's love life. It get's very repetitive and quite frankly, boring.These clips of combat we get are completely disconnected from the story, it looks like it's randomly thrown in. They're also really short. If you remember, the trailer has combat in Egypt. You see all that combat in the trailer, that's it. There's no more of it. The trailer was better than the movie.As a history buff (especially history on the French Revolution/Napoleonic Wars) and a film buff, it comes off as offensive to the entire subject matter it's covering in history, offensive to the entire art form of filmmaking, and offensive to the intelligence of it's viewer.It takes nothing seriously, all these huge events regardless of your opinion is treated with disrespect.But most historical events are absent from this film. It focuses so heavily on this marriage story that you don't care about it because the film never tried to make you care, to the point where you feel shocked to see how much time has passed and how many events they skipped when you finally see a date pop up on the screen or an actual recognizable event.Or if you don't know Napoleonic history, you will be entirely lost as to what's happening because it explains nothing, it doesn't even mention why the Napoleonic Wars is happening at all. It doesn't even cover Napoleon growing as a general. Or even growing as a person. The look of Napoleon is even lazily done in this.This version of Napoleon is such a fool instead of a smart general, he makes Napoleon Dynamite look like a cool, collected, Chad.From a film making perspective, the movie is horribly made, generic to bad camera work, a bland soundtrack, HORRIBLE writing, a plot that goes nowhere.The only positives I can find is that some of the costume design is good, the sets are pretty well made, and the one scene in the trailer with the ice was cool. But I'd say watch the trailer again instead of the movie. But that's it. Those are the only good things.If you like Napoleon you won't like this, if you hate Napoleon you won't like this. If you like history you won't like this. If you don't care about history you won't like this. It's poorly made and boring for all. Find any other Napoleon focused movie and I'm sure it will be more entertaining.The trailer makes it seem like a different movie. I feel scammed, I feel lied to.A history film about the Napoleonic Wars with no history, no Napoleonic Wars, and an inaccurate Napoleon that's not fun to watch and at times straight up cringe to witness, makes this movie a solid 1. No entertainment value.",
    "15": "A battle in Toulon sets up your rise, as the rebels are soon cannonballed to size, with some help and some removed, promotions are approved, sets your trajectory to take you to the skies; the pyramid of your life is Josephine, while on manoeuvres she's quite progressive and keen, although quite barren for an Empress, and you need an heir for success, but you compensate through a mass killing machine. A spell in exile lets you gather next to water, before you gather once again to kill and slaughter, but no matter what you do, this will be your Waterloo, as all you dreams go down the pan, prisoned by water.A bit too long and not particularly engaging.",
    "16": "This is unfortunately Ridley's worst film. From the start the plot feels improvised, as if like he left the actors play and do they're own thing. He had a marquee set of actors, but non of them stand out including Joaquin Phoenix which compared with his performance in Gladiator (first Ridley's film with him) it is a long fall, anyone could have done that part. The screenplay is also clumsy, feels like some sort of documentary without a narrator. And the worst part is that Ridley's interpretation of Napoleon, he puts the main character as a ridiculous man who didn't have any merit and his accomplishments were reached by chance. The war scenes are the only parts of this movie we can rescue, where Ridley is a master. To conclude, perhaps I had too much expectations for this movie being a Ridley's fan I regret to say that didn't hit the target this time.",
    "17": "(literally struggled to stay awake)Phoenix's casting has always puzzled me; a mumbling, withdrawn actor playing a French emperor with an American accent. I didn't dislike his portrayal, but I wonder how the film would've changed if they'd cast a chameleon (e.g. Christian Bale), who could transform himself, put on an accent, and 'disappear' into the role, aided by hair and make - up.Sometimes engaging, often dull, mostly just watchable.Interestingly, Scott has said he kept this cut around 2.5 hours, as he thinks theatrical experiences longer than that start to drag, and he'll release a 4 - hour cut on streaming. I think it's a very astute evaluation of theatrical and streaming films as different art forms, which Scorsese should learn from.",
    "18": "I will admit the film had some good acting and set designs, but the total lack of any brightness in character, lighting, or mood was more like watching the funeral of a failed nobody who stumbled into his successes. No one is likeable in this slanted history of France and Europe.Some people will probably enjoy this depiction, but I felt the director was determined to shows France as corrupt and full of self-absorbed leaders.Napoleon was occasionally depicted as a good general, but mostly as a childlike presence under the humiliating thumb of his chosen woman... a nymphomaniac for everyone but her husband.The battle scenes displayed an obvious hate for western civilization, showing only the ugly side of war, blown off limbs, dead horses, ( Napoleon reaches in and pulls a cannon ball from his dead horse's chest to have it sent to his mother ) and never a moment of celebration. The movie is shot with continual bad weather, dreariness, and many non-historical events used to highlight war's cruelty and savagery. Not once was eagerness of the officers or fighting men to grow an empire, enjoy success, and show gallantry presented.There is no humor, no lightness, nothing uplifting (except one scene where Napoleon actually inspires some troops not to shoot him). It is mostly a continual drone of \"The evils of Western civilization\". I walked out of the movie twice to get snacks, knowing I wasn't missing anything of importance.The audience saw few uplifting moments, but a disregard for historical accuracy. Soldiers with muskets can't fire their weapons in the rain. No battles took place on a frozen lake. Brilliant maneuvers were absent for the most part and success was visually muted.So, this isn't a movie for history lovers or people who expect to be uplifted or impressed. Rather a slow rolling concoction of absurd events with most, if not all, the joy removed.",
    "19": "An irresponsible film about Napoleon. Sir. Scott tries to psychoanalize Napoleon with a tendency to the worst making him a clownish brute; or a joker, theryby the poor casting choice of Joaquim Phoenix. The film is almost a comedy; but at the end Scott tries to moralise listing the deaths assumingly left by Napoleon in the European battlefields. Also he tells us that Josefine basically treated Napoleon with disdain and contempt that is not historically documented. This is an Anglo film about a great Frenchman and French history that is not going to help the UK and their misguided Brexit to get back into Europe.",
    "20": "Just watched it and God Daimn it was terrible even without taking into account the historical accuracy.A more fitting name for this movie would be \"Josephine\".Literally 70% of the movie was her siting with Napoleon in silence, her being intimate with him or her cheating on him with other men and Napoleon being a complete weakling about it. There is so much time spent about Josephine that there is legit only like 3 battle scenes in the whole movie! It was very boring, at least for me.Moreover the pace of the movie is just awful. If I was someone that knows nothing about Napoleon other than he was one of the greatest conquerors of all time I would be confused as heck. On one moment Napoleon is putting down a monarchist rebellion and on the other he's being crowned Emperor. Like what? How? One moment Napoleon makes his iconic disastrous retreat from Russia and on the other he's already abdicating. By the way this means they literally skipped how Napoleon's downfall played out, like how Europe and even his Marshalls turned against him. Great.Also I felt like there was a lack of information about the world in general. Why is Napoleon fighting the Uk, Prussia, Austria and Russia? We don't know. Why did Napoleon decide to invade Russia? Your guess is as good as mine!Anyway, to finish this off, There is NO mention of Napoleon's Marshalls, NO mention of Napoleon's military strategies, NO mention of Napoleon's reforms, NO showcase of why people followed this man to battle.Basically, *NO EXPLANATION ON WHY NAPOLEON WAS ONE THE GREATEST CONQUERORS OF HIS TIME*\nyeah....that one specifically is kinda of huge deal...",
    "21": "Like many on here, I was thrilled with the trailer and couldn't wait for this movie to hit the theaters.Watching the movie, I felt disappointed, like I was sold something that wasn't real because the movie fell really flat. The I thought the acting, the costumes, and the sets were great, but my issue was with the tone, character takes, and general writingThe movie opens with the French queen being led to be executed. It was a very awful event, but the music being played is very lighthearted which creates a sense that the events in the movie aren't taken seriously. This can work for some movies, but the lighthearted tone that we see throughout doesn't work for an intense historical epicWhich takes me to the characters. I feel like the movie does a very reductionist take on them, and that the movie doesn't take either Napoleon or Josephine seriously. Josephine is portrayed as a woman with co-decency and anxiety issues, while Napoleon is portrayed as an idiot who stumbles into power and keeps seeking more power to impress a woman who never tells him that she wants power in the first place. She doesn't come off ambitious herself, and I spent much of the movie wondering what it is that she actually wants or why she even likes this man. There's a scene where he throws a fit and says that she's nothing without him, and later she says that he's nothing without her, but we don't see it. She's not whispering in his ear telling him to go after more and more, instead she spends much of the movie crying or staring moodily into a lakeThe classical philosophers and writers were all well aware of what a tyrant was and ambitious people are obsessed with leaving a legacy. Even the biggest ego maniac doesn't seize power for power's sake, rather they seize power because they see something broken in the system that *only* they can fix. In \"Gladiator,\" there's a scene where Marcus Aurelius explains to Maximus what legacy he wants to leave so that he is not remembered as a tyrant who just started wars, and why Maximus must succeed him. We never see this from Napoleon in this movie. No discussion of his philosophy or why he's doing what he's doing. Napoleon himself was complicated. He's primarily remembered as a military general, but he also reformed French laws and the Napoleonic Code is still the widespread law in the world (which, again, were not shown this in this movie). People don't rise to the level that he did without some level of social tact, charisma, and political genius-but we see nothing of that in this filmThe movie generally cuts pretty quickly and skips over a lot. One moment Napoleon is married, and the next moment he's suddenly in Egypt, with no discussion of why. One moment he insults the British ambassador (which felt like a scene from Napoleon Dynamite), and the next moment he receives an offer to become king, and the next moment he's being crowned emperor of the French by the Pope himself. Napoleon taking the crown and placing it on his own head is one of the great moments in history, yet this movie treats it very casuallyThere's also lots of anachronisms that bothered me as a history buff. In a letter to Josephine, Napoleon says that he's invading Russia with the combined armies of France, Poland, ITALY, and GERMANY. I think this is meant to evoke a comparison to Hitler, because Germany and Italy didn't exist as states back then so it would've made no sense for him to say that. Also, at Waterloo, they tell Napoleon that the Prussians are twelve miles away, even the metric system was created during the French Revolution and miles is an English system of measurement anywaysMaybe the Director's cut with the extra hour adds more, but save your money and don't see it in theaters.",
    "22": "Joaquin Phoenix and Vanessa Kirby's acting was good. That is about the only good thing I can say.The movie spends too much time on Napoleon and Josephine which was one small dimension of a great man's life. Too much on the revolution. Too little on his military genius at the battle of Austerlitz o etc. Jena and other great battles missing. Napoleon routed every army and general because he revolutionized how armies were structured and war was fought. The movie ends with how many dead. It should've ended with his body being brought back to France with honor. What about the napoleanic code that survives till today. I hope the French do justice and reclaim their history by launching a detailed Netflix series on Napoleon. Ridley should retire from making movies rather than farces like this.",
    "23": "Ridley Scott has once again proven he is washed up and should no longer direct movies. The guy tries to boil down Napoleon Bonaparte to a 2 and a half hour snoozefest. This movies is actually worse than a whiteboard with bullet points. This movie has alost no substance to it. If it were food, it would be plain ramen noodles, made with cold, unsalted water. I really hope people didn't actually pay money to watch this in theatres! They should demand a refund! Start a class action lawsuit! Something! This is one of the worst \"historical\" movies ever made! Please, do not watch this or you will actually become less.intelligent!",
    "24": "Napoleon, the legendary general with many victories throughout a series of remarkable battles with only one loss under his belt, finally gets a chance to be screened in the cinema worldwide by another legendary figure, Ridley Scott.Unfortunately, the movie ends up focusing what I did not expect to see and got a sliver of what I expected to see. Here is what I mean by that.What I expected to see\nThe development of Napoleon's victory in detailNapoleon's childhood to get to know him better as a personNapoleon's prowess and command in the battle fieldThe contributions from close comrades of NapoleonIntense and action-packed battle scenes similar to GladiatorWhat I saw instead\nShort summary of Napoleon's battles only in numbers and textsA huge chunk of Napoleon's romance with his wife, JosephineGlimpse of Napoleon's wielding a sword and gibberish commandInsignificant characters who make a mockery of NapoleonDiscontinuous and short battle scenes with a little action from NapoleonThe reason why it deserves 5 stars is because the movie depicts the 18th century environments and costumes along with atmosphere during the French revolution. Ridley Scott also does an excellent job on recreating the historic battles like the time machine by showing various tactics and formations from both France and England. Also the casting was great as everyone played their role well.However, the cons outweighs the pros of the movie, especially for taking a risk to depict the life of Napoleon within 3 hours. The trailer contains 90% battle scenes, but the movie itself contains 10% battle scenes. Therefore, not only it does not meet the expectations, but it also tarnishes what could have been one of the greatest biographical movies.",
    "25": "This was one of the worst big budget movies I have ever seen. I made it toward the later half of the movie and everyone had already walked out, I decided to also walk out. It was the first film I ever walked out on. Here is why:Napoleon opens with what is seemingly going to be a historical biography film adaptation of Napoleon's life, what you instead get is a poorly made, half attempt at a comedy. That's not an exaggeration, it really does play out like a half attempted comedy that's neither funny nor entertaining.It starts in the French Revolution, the first problems was Joaquin Phoenix. I never thought he was a bad actor, but he's bad in this movie. Not only is he a bad Napoleon, not only is he way older looking than actual Napoleon (who is supposed to be 24 at the start of the film), but it's like he didn't even wanna play the role. I don't know what he was going for here but what we got is a bumbling fool with no confidence in any regard, no sign of intelligence, no backstory, no character development, no knowledge of his life outside of his marriage, and above all no historical accuracy whatsoever.This isn't only Joaquin Phoenix's fault, it's Ridley Scott and writer David Scarpa too. Everyone failed this project.If what you were looking for is a film about the Napoleonic Wars, look elsewhere. There is almost no war in it, and what little war there was, is only little clips of warfare, and then straight back to Napoleon's marriage life. Even if you found the marriage stuff interesting about Napoleon, this still isn't the movie for you, because it's not accurate and the film makes it's point early on, but for some reason they keep going over the same ground already covered about Napoleon's love life. It get's very repetitive and quite frankly, boring.These clips of combat we get are completely disconnected from the story, it looks like it's randomly thrown in. They're also really short. If you remember, the trailer has combat in Egypt. You see all that combat in the trailer, that's it. There's no more of it. The trailer was better than the movie.As a history buff (especially history on the French Revolution/Napoleonic Wars) and a film buff, it comes off as offensive to the entire subject matter it's covering in history, offensive to the entire art form of filmmaking, and offensive to the intelligence of it's viewer.It takes nothing seriously, all these huge events regardless of your opinion is treated with disrespect.But most historical events are absent from this film. It focuses so heavily on this marriage story that you don't care about it because the film never tried to make you care, to the point where you feel shocked to see how much time has passed and how many events they skipped when you finally see a date pop up on the screen or an actual recognizable event.Or if you don't know Napoleonic history, you will be entirely lost as to what's happening because it explains nothing, it doesn't even mention why the Napoleonic Wars is happening at all. It doesn't even cover Napoleon growing as a general. Or even growing as a person. The look of Napoleon is even lazily done in this.This version of Napoleon is such a fool instead of a smart general, he makes Napoleon Dynamite look like a cool, collected, Chad.From a film making perspective, the movie is horribly made, generic to bad camera work, a bland soundtrack, HORRIBLE writing, a plot that goes nowhere.The only positives I can find is that some of the costume design is good, the sets are pretty well made, and the one scene in the trailer with the ice was cool. But I'd say watch the trailer again instead of the movie. But that's it. Those are the only good things.If you like Napoleon you won't like this, if you hate Napoleon you won't like this. If you like history you won't like this. If you don't care about history you won't like this. It's poorly made and boring for all. Find any other Napoleon focused movie and I'm sure it will be more entertaining.The trailer makes it seem like a different movie. I feel scammed, I feel lied to.A history film about the Napoleonic Wars with no history, no Napoleonic Wars, and an inaccurate Napoleon that's not fun to watch and at times straight up cringe to witness, makes this movie a solid 1. No entertainment value.",
    "26": "A battle in Toulon sets up your rise, as the rebels are soon cannonballed to size, with some help and some removed, promotions are approved, sets your trajectory to take you to the skies; the pyramid of your life is Josephine, while on manoeuvres she's quite progressive and keen, although quite barren for an Empress, and you need an heir for success, but you compensate through a mass killing machine. A spell in exile lets you gather next to water, before you gather once again to kill and slaughter, but no matter what you do, this will be your Waterloo, as all you dreams go down the pan, prisoned by water.A bit too long and not particularly engaging.",
    "27": "This is unfortunately Ridley's worst film. From the start the plot feels improvised, as if like he left the actors play and do they're own thing. He had a marquee set of actors, but non of them stand out including Joaquin Phoenix which compared with his performance in Gladiator (first Ridley's film with him) it is a long fall, anyone could have done that part. The screenplay is also clumsy, feels like some sort of documentary without a narrator. And the worst part is that Ridley's interpretation of Napoleon, he puts the main character as a ridiculous man who didn't have any merit and his accomplishments were reached by chance. The war scenes are the only parts of this movie we can rescue, where Ridley is a master. To conclude, perhaps I had too much expectations for this movie being a Ridley's fan I regret to say that didn't hit the target this time.",
    "28": "(literally struggled to stay awake)Phoenix's casting has always puzzled me; a mumbling, withdrawn actor playing a French emperor with an American accent. I didn't dislike his portrayal, but I wonder how the film would've changed if they'd cast a chameleon (e.g. Christian Bale), who could transform himself, put on an accent, and 'disappear' into the role, aided by hair and make - up.Sometimes engaging, often dull, mostly just watchable.Interestingly, Scott has said he kept this cut around 2.5 hours, as he thinks theatrical experiences longer than that start to drag, and he'll release a 4 - hour cut on streaming. I think it's a very astute evaluation of theatrical and streaming films as different art forms, which Scorsese should learn from.",
    "29": "I will admit the film had some good acting and set designs, but the total lack of any brightness in character, lighting, or mood was more like watching the funeral of a failed nobody who stumbled into his successes. No one is likeable in this slanted history of France and Europe.Some people will probably enjoy this depiction, but I felt the director was determined to shows France as corrupt and full of self-absorbed leaders.Napoleon was occasionally depicted as a good general, but mostly as a childlike presence under the humiliating thumb of his chosen woman... a nymphomaniac for everyone but her husband.The battle scenes displayed an obvious hate for western civilization, showing only the ugly side of war, blown off limbs, dead horses, ( Napoleon reaches in and pulls a cannon ball from his dead horse's chest to have it sent to his mother ) and never a moment of celebration. The movie is shot with continual bad weather, dreariness, and many non-historical events used to highlight war's cruelty and savagery. Not once was eagerness of the officers or fighting men to grow an empire, enjoy success, and show gallantry presented.There is no humor, no lightness, nothing uplifting (except one scene where Napoleon actually inspires some troops not to shoot him). It is mostly a continual drone of \"The evils of Western civilization\". I walked out of the movie twice to get snacks, knowing I wasn't missing anything of importance.The audience saw few uplifting moments, but a disregard for historical accuracy. Soldiers with muskets can't fire their weapons in the rain. No battles took place on a frozen lake. Brilliant maneuvers were absent for the most part and success was visually muted.So, this isn't a movie for history lovers or people who expect to be uplifted or impressed. Rather a slow rolling concoction of absurd events with most, if not all, the joy removed.",
    "30": "An irresponsible film about Napoleon. Sir. Scott tries to psychoanalize Napoleon with a tendency to the worst making him a clownish brute; or a joker, theryby the poor casting choice of Joaquim Phoenix. The film is almost a comedy; but at the end Scott tries to moralise listing the deaths assumingly left by Napoleon in the European battlefields. Also he tells us that Josefine basically treated Napoleon with disdain and contempt that is not historically documented. This is an Anglo film about a great Frenchman and French history that is not going to help the UK and their misguided Brexit to get back into Europe.",
    "31": "Just watched it and God Daimn it was terrible even without taking into account the historical accuracy.A more fitting name for this movie would be \"Josephine\".Literally 70% of the movie was her siting with Napoleon in silence, her being intimate with him or her cheating on him with other men and Napoleon being a complete weakling about it. There is so much time spent about Josephine that there is legit only like 3 battle scenes in the whole movie! It was very boring, at least for me.Moreover the pace of the movie is just awful. If I was someone that knows nothing about Napoleon other than he was one of the greatest conquerors of all time I would be confused as heck. On one moment Napoleon is putting down a monarchist rebellion and on the other he's being crowned Emperor. Like what? How? One moment Napoleon makes his iconic disastrous retreat from Russia and on the other he's already abdicating. By the way this means they literally skipped how Napoleon's downfall played out, like how Europe and even his Marshalls turned against him. Great.Also I felt like there was a lack of information about the world in general. Why is Napoleon fighting the Uk, Prussia, Austria and Russia? We don't know. Why did Napoleon decide to invade Russia? Your guess is as good as mine!Anyway, to finish this off, There is NO mention of Napoleon's Marshalls, NO mention of Napoleon's military strategies, NO mention of Napoleon's reforms, NO showcase of why people followed this man to battle.Basically, *NO EXPLANATION ON WHY NAPOLEON WAS ONE THE GREATEST CONQUERORS OF HIS TIME*\nyeah....that one specifically is kinda of huge deal...",
    "32": "Like many on here, I was thrilled with the trailer and couldn't wait for this movie to hit the theaters.Watching the movie, I felt disappointed, like I was sold something that wasn't real because the movie fell really flat. The I thought the acting, the costumes, and the sets were great, but my issue was with the tone, character takes, and general writingThe movie opens with the French queen being led to be executed. It was a very awful event, but the music being played is very lighthearted which creates a sense that the events in the movie aren't taken seriously. This can work for some movies, but the lighthearted tone that we see throughout doesn't work for an intense historical epicWhich takes me to the characters. I feel like the movie does a very reductionist take on them, and that the movie doesn't take either Napoleon or Josephine seriously. Josephine is portrayed as a woman with co-decency and anxiety issues, while Napoleon is portrayed as an idiot who stumbles into power and keeps seeking more power to impress a woman who never tells him that she wants power in the first place. She doesn't come off ambitious herself, and I spent much of the movie wondering what it is that she actually wants or why she even likes this man. There's a scene where he throws a fit and says that she's nothing without him, and later she says that he's nothing without her, but we don't see it. She's not whispering in his ear telling him to go after more and more, instead she spends much of the movie crying or staring moodily into a lakeThe classical philosophers and writers were all well aware of what a tyrant was and ambitious people are obsessed with leaving a legacy. Even the biggest ego maniac doesn't seize power for power's sake, rather they seize power because they see something broken in the system that *only* they can fix. In \"Gladiator,\" there's a scene where Marcus Aurelius explains to Maximus what legacy he wants to leave so that he is not remembered as a tyrant who just started wars, and why Maximus must succeed him. We never see this from Napoleon in this movie. No discussion of his philosophy or why he's doing what he's doing. Napoleon himself was complicated. He's primarily remembered as a military general, but he also reformed French laws and the Napoleonic Code is still the widespread law in the world (which, again, were not shown this in this movie). People don't rise to the level that he did without some level of social tact, charisma, and political genius-but we see nothing of that in this filmThe movie generally cuts pretty quickly and skips over a lot. One moment Napoleon is married, and the next moment he's suddenly in Egypt, with no discussion of why. One moment he insults the British ambassador (which felt like a scene from Napoleon Dynamite), and the next moment he receives an offer to become king, and the next moment he's being crowned emperor of the French by the Pope himself. Napoleon taking the crown and placing it on his own head is one of the great moments in history, yet this movie treats it very casuallyThere's also lots of anachronisms that bothered me as a history buff. In a letter to Josephine, Napoleon says that he's invading Russia with the combined armies of France, Poland, ITALY, and GERMANY. I think this is meant to evoke a comparison to Hitler, because Germany and Italy didn't exist as states back then so it would've made no sense for him to say that. Also, at Waterloo, they tell Napoleon that the Prussians are twelve miles away, even the metric system was created during the French Revolution and miles is an English system of measurement anywaysMaybe the Director's cut with the extra hour adds more, but save your money and don't see it in theaters.",
    "33": "Joaquin Phoenix and Vanessa Kirby's acting was good. That is about the only good thing I can say.The movie spends too much time on Napoleon and Josephine which was one small dimension of a great man's life. Too much on the revolution. Too little on his military genius at the battle of Austerlitz o etc. Jena and other great battles missing. Napoleon routed every army and general because he revolutionized how armies were structured and war was fought. The movie ends with how many dead. It should've ended with his body being brought back to France with honor. What about the napoleanic code that survives till today. I hope the French do justice and reclaim their history by launching a detailed Netflix series on Napoleon. Ridley should retire from making movies rather than farces like this.",
    "34": "Ridley Scott has once again proven he is washed up and should no longer direct movies. The guy tries to boil down Napoleon Bonaparte to a 2 and a half hour snoozefest. This movies is actually worse than a whiteboard with bullet points. This movie has alost no substance to it. If it were food, it would be plain ramen noodles, made with cold, unsalted water. I really hope people didn't actually pay money to watch this in theatres! They should demand a refund! Start a class action lawsuit! Something! This is one of the worst \"historical\" movies ever made! Please, do not watch this or you will actually become less.intelligent!",
    "35": "Napoleon, the legendary general with many victories throughout a series of remarkable battles with only one loss under his belt, finally gets a chance to be screened in the cinema worldwide by another legendary figure, Ridley Scott.Unfortunately, the movie ends up focusing what I did not expect to see and got a sliver of what I expected to see. Here is what I mean by that.What I expected to see\nThe development of Napoleon's victory in detailNapoleon's childhood to get to know him better as a personNapoleon's prowess and command in the battle fieldThe contributions from close comrades of NapoleonIntense and action-packed battle scenes similar to GladiatorWhat I saw instead\nShort summary of Napoleon's battles only in numbers and textsA huge chunk of Napoleon's romance with his wife, JosephineGlimpse of Napoleon's wielding a sword and gibberish commandInsignificant characters who make a mockery of NapoleonDiscontinuous and short battle scenes with a little action from NapoleonThe reason why it deserves 5 stars is because the movie depicts the 18th century environments and costumes along with atmosphere during the French revolution. Ridley Scott also does an excellent job on recreating the historic battles like the time machine by showing various tactics and formations from both France and England. Also the casting was great as everyone played their role well.However, the cons outweighs the pros of the movie, especially for taking a risk to depict the life of Napoleon within 3 hours. The trailer contains 90% battle scenes, but the movie itself contains 10% battle scenes. Therefore, not only it does not meet the expectations, but it also tarnishes what could have been one of the greatest biographical movies.",
    "36": "I was quite nervous when going into this film. You can't cover the life of Napoleon Bonaparte in two and a half hours, not even four hours *cough* directors cut *cough*It gives no real background on Napoleon, his childhood on Corsica where he was a Corsican nationalist. It doesn't cover his move to military school on France, or his North Italy campaign where he gained the true loyalty of his soldiers, and defeated Austria, on his own.Egypt is not covered in depth enough, all the Egypt scenes in the trailer is exactly what is in the film.Sweden is completely ignored throughout the whole film, and so is Spain. Spain is important as that is seen as Napoleons Vietnam. It was the first nail in the coffin for him.Flags in the film were also incorrect. The Belgian flag is there, which did not exist at that time. It was designed afterwards.Another mistake in the film, Napoleon wasn't at the execution of Marie Antoinette. And this was the first scene, with no explanation. The French revolution and Napoleons childhood, and the general way of French life under the monarchy should have been covered before this.The film also depicts Napoleon riding into battle on his horse with the rest of the cavalry, which did not happen. Also, his horse was not shot at the siege of Toulon. Napoleon was wounded by a British bayonet at Toulon, which would have made his hatred for the British in the film much clearer. Napoleon was also a bad horse-rider.Don't even get me started with Austerlitz. There was no giant frozen lake at Austerlitz. It was a series of small ponds.Napoleon and Wellesley diddnt meet face to face in real life, which is contrary to what the film says.Napoleon diddnt shoot at the pyramids in Egypt, infact, he admired Egyptian history and would have wanted to preserve them.The film also covers nothing of Saint Helena, which again, would have made for a good ending to the film.Last but not least, I really like Joaqin Phoenix as an actor, but he's edgy, which is why he made a great Joker.But Napoleon was not edgy. Infact, Napoleon was so full of himself, you could probably see his head from space. Phoenix wasn't the right actor to play Napoleon.",
    "37": "This losely strung highlight reel felt more like a jumbotron replay of his most exciting battles rather than a gripping historical recount.They focus a great deal on his relationships which does not seem to affect the rest of the film at all. As if they just needed a subplot, and this was the easiest thing to add in.Rather than put in the work to make a compelling well-told story, they go the lazy route and miss most of the details. They'd rather keep you in the dark with most of his motivations, which isn't helped by Joaquin Phoenix's bumbling performance that makes Napoleon seem like an anti-intellectual baffoon.At least an hour too long, having to watch an extended 4-hour cut would be akin to torture.",
    "38": "I am French. Napoléon is a towering and complex historical figure. I was dubious about what Ridley Scott was trying to do here, by putting 20+ years of Napoléon's sprawling career in a 2.5 hours film. My fears were proven true unfortunately.Joaquin Phoenix's Napoléon is hollow. It is not a deep dive into his character. What is shown about him could come out of the English propaganda of the period: an obscene, immoral, and frankly disgusting little man that is obsessed with dominating women and others.And the film itself? One scene to the next, with years in between. 10 minutes in the French revolution, 10 minutes as consul, 10 minutes being crowned as Emperor, 5 minutes on Austerlitz, 10 minutes on Russian campaign.It is more of a documentary and overview than a film, with the intimate parts of the movie focusing on how disgusting and obscene Napoléon is (and how superior the British are).I honestly walked it this movie expecting and hoping for something akin to what Scott did with Gladiator. A movie that isn't exactly historical at all, but at least is entertaining with a Joaquin Phoenix giving us a Commodus like performance. You get NONE OF THIS. The movie is a boring 2.5 hour movie of switching from one setpiece to another without focus and depth.It is completely similar to Scott's previous film The Last Duel, except that movie worked because it focused on a very simple plot (the rape of a woman and her husband's rivalry with another man). Here Scott is trying to fit the magnificence and importance of Napoléon's life in 2.5 hours, and it just doesn't work, it fails abysmally. And I'll be honest, I'm not much interested in the 4 hour supposed cut that Scott will release on Apple +. 2.5 hours were boring, I doubt 4 hours will make it better.Only good aspect of this movie are the visuals and costumes. And also Vanessa Kirby's standout performance as Joséphine. Other than that, it's shallow as a puddle of water and frankly insulting to the towering figure that is Napoléon, in addition to being a bore fest for those looking for Gladiator style entertainment. Ridley Scott has shamed himself massively with this movie.",
    "39": "Please lower your expectations before going to watch this historically inaccurate movie. The cinematography, costumes and the actress that portrayed Josephine are the main standouts in the film. Other than that it's not a movie that I would recommend. Granted, if you know nothing about Napoleon Bonaparte you might enjoy it for what it is. But for those who know of his history will be thoroughly disappointed. I believe the film should've been at least 3 hours 30 mins. They tried to cram too much with too little time so everything felt rushed. I really wanted to like it and I found some redeeming qualities about it but it wasn't enough for me to give it anything higher than a 1. Ridley Scott used to be a good director but now he's just somebody who used to make good movies that were actually worth watching. He should be ashamed of himself for releasing this dud.",
    "40": "I don't want to argue with historical inaccuracies, director has the right to choose the plot. But Ridley Scott disappointed this time, adding nothing to the plot nor the character development. Slow and flawed movie shows nothing special about the hero nor the events. It's even worse than the average historical dramas. I was waiting something in the Oppenheimer's level, unfortunately Napoleon is the total disappointment. In the theater you feel like you wasted 2.5 hours; even the actings of Phoenix and Kirby were worse than the average actors. Maybe the time for Scott's retirement has come, who knows...",
    "41": "I'll keep this simple as I feel like throwing up after having seeing this disaster of a \" historical epic\" . Ill focus on the battles and realism / authenticity there. Everyone else have already magnified how much it wastes time with boring drama and Josefine.Nr 1: Zero proper emphasis on battles. In a film called Napoleon. Already a waste of money from that fact alone. False advertising.Nr 2: Cringe worthy.... depiction of Waterloo. If you've seen the Waterloo from 1970... you will pull out your hair at sheer frustration when you see what they've done here. Let alone the basic depictions of the battle in Egypt and Austerlitz. It's indescribably embarassing... and you feel it, knowing the historical facts.There isn't a single historically accurate thing about any.... of these battles. It's mindboggling.Nr 3: Sniper rifle scopes on Baker rifles . X__X . Portrayed as being able to take a clean shot at well over a kilometer. Let alone Napoleons tent... being within a kilometer. More like 600 meters. This is grotesquely .... idiotic and completely absurd. Nobody on this bothered to remotely give a single damn about accurate military tactics and knowledge of Napoleonic weaponry.4: Napoleon charges the front line.... and engages in what is well zoomed out to appear as the most cringeworthy McDonalds LARP experience ever. There are so.... few troops on the map. All in thin lines, completely detached from any proper support or logic of battle line formations. With a budget of multimillions... you couldn't bother even hiring enough extras?You dont even see light infantry, Voltiguer or Chasseur support during the advance or at any point. And the cavalry charge rushes up in front of the infantry advance at Waterloo ..... engaging in a pointless failed charge at like 200 meters just to run in circles for eons. Rendering musket fire now an impossibility lest you wish friendly fire. Same idiotic part happened in the Austerlits battle. This is not... what actually happened. You're making a mockery of history. Everything is made to look completely stupid in a state that concern life and death.This is Game of Thrones Season 8.... level of CRINGE portrayal of so called \" Warfare / War strategy\"Save yourself your precious time.... and your money. And go kick back with the 1970 movie instead. Dont be fooled by the year and suspect it doesn't hold up. It's an extremely well made military epic that holds up because contrary to this McDonalds experience Ridley wants you to charge bloody 20 dollars for just to spit in your face, the 1970 film went above and beyond to show you the most spectacular portrayal of Napoleonic mass warfare to date, utilizing thousands of extras in superb uniforms with practical effects and attention to detail all around. And most importantly.... trying to be as historically accurate as possible.Something we'll never see again alike what Peter Jackson did with Lord of the Rings.You'll have to be out of your senses if you wanna sit for 4 hours on the streaming platform and watch this again with another 90 minutes of THIS QUALITY.... of historical filmmaking. NO THANKS.This isn't Kingdom of Heaven, people. This isnt the same Ridley Scott as back then. This is the Alien: Covenant Ridley.Now I'll go watch Rod Steiger portray a strong proud emperor with flaws, love in his heart and ultimately meeting his end in a spectacular battle he almost won... and let that burn out the memory of this cringeworthy incorrect display of not just Napoleon, but also of military warfare 200 years ago in general.Everyone who saw this without existing knowledge of Napoleonic warfare... is now massively dumber because of you, Ridley.Great contribution to more of this Mcdonalds era of filmmaking.",
    "42": "POSITIVES:1) Joaquin Phoenix is always a mesmerising screen presence and he is perfectly cast here. I also thought Vanessa Kirby was amazing\n2) Ridley Scott just loves a battle sequence. He is clearly, demonstrably in love with the battle sequences here. I think these are when the film is at its best. The scale is extraordinary with superb direction and cinematography. As the title of this review suggests, I wish the film focused more on the battles and the wars\n3) Apple never do anything cheaply and you could really sense that here. The film looks like it had an incredible amount of money poured into it with everything from production design, costumes etc looking state of the artNEGATIVES:1) The pacing certainly leaves a lot to be desired. There were definitely times where watching the film felt like a slog\n2) I never like it when films feel like they have to put text on screen to tell the audience what is happening or who people are, which this film does a lot\n3) I just fundamentally didn't believe or care about the relationship between Napoleon and Josephine. Phoenix and Kirby are both great individually but I didn't think they have chemistry together. They're married after only about 3 scenes together in the film and then I think the film spends far too much time on their marriage and not enough time on the wars or on Napoleon as a leader.",
    "43": "Arguably, Oscar-winning British director Ridley Scott of \"Gladiator\" fame will be remembered as a cinematic wizard whose films boasted stellar production values, robust casts, and colossal budgets. Sadly, the dramatic content in some of his movies leaves a lot to be desired. Chiefly, Scott displays his considerable flair for choreography in staging the sprawling battle scenes in \"Napoleon.\" Joaquin Phoenix, Vanessa Kirby, and Rupert Everett head a cast of thousands. Unfortunately, the blood, guts, and thunder of combat overshadow the quieter moments of the Corsican-born tactician's life. Whereas the battlefield scenes bristle with excitement, suspense, and bravado, Napoleon's life off the field of valor is far less volatile. Scott creates several 19th century combat scenes that rival Steven Spielberg's 20th century World War II epic \"Saving Private Ryan.\" For example, the horse he rides in his first foray against the British at Toulon has its chest torn open by a cannonball! The chief problem with \"Napoleon\" is Scott himself. He treats Napoleon with nothing but contempt. Since Scott is British, this should come as no surprise.Now, add the bizarre casting of Joaquin \"The Joker\" Phoenix as Bonaparte. Although a gifted actor, Phoenix generates little magnetism. The way Scott skewers Napoleon in \"Napoleon\" would be enough to make the 'Little Corporal' spin in his Parisian tomb. Mostly, the impeccably clad Phoenix neither strikes a heroic stance nor endears himself to us. As his wife and life-long confidante Josephine, Vanessa Kirby of \"Mission: Impossible - Fallout\" savors every second of screen time as she taunts and belittles Napoleon. The actress reminded me of the late Leslie Caron of \"Gigi\" because she has a mischievous personality. Anyway, Kirby dominates every scene with Phoenix in private. Meantime, Phoenix never rises from the ashes of an inscrutable performance as one of history's greatest legends. He remains a cold, aloof figure and little about him would incline us to have sympathy for him. Comparably, Rod Steiger looked more believable as Bonaparte in Sergei Bondarchuk's \"Waterloo\" (1970), a far better film whose scope and spectacle has never been surpassed.Scenarist David Scarpa, who penned the abysmal \"Day the Earth Stood Still\" remake as well as Scott's own \"All the Money in the World,\" focuses primarily on Napolean's military successes and failures. Of course, time doesn't stand still long in this 158-minute epic because Scott and Scarpa have much to cover. Presumably, Scott must have worried about not only audience fatigue but also story momentum. Since \"Napoleon\" doesn't idolize Bonaparte, he emerges as an unsavory figure who seems petulant at times. Certainly, Scott and Scarpa don't present a balanced portrait of Napoleon. They refuse to highlight some of his enduring culture endeavors, such as the Napoleonic Code that continues today. Furthermore, Napoleon's medical history has been white washed, otherwise we might feel a shred of sympathy for the tyrant. Indeed, characterization is held to a minimum in \"Napoleon.\" The only other actor who stands out, Rupert Everett of \"My Best Friend's Wedding,\" as the snobbish Duke of Wellington remains a vague figure with one decent line of dialogue. According to eminent Bonaparte biographer Andrew Roberts, when a sniper at Waterloo had Napoleon in his crosshairs sought to permission to shoot him, the Duke snapped, \"No! I'll not allow it. It is not the business of commanders to be firing upon one another!\"The battle of Austerlitz provides the most memorable fireworks. As the combined calvaries of Russia and Austria burst across a frozen river toward the French, Napoleon's artillery pulverizes the ice into slush with barrages of seething cannon balls. Comparatively, the battle of Waterloo lacks the spectacle of Austerlitz. Everybody behind the scenes who toiled on the production design, costume design, and set decoration deserve to win Oscars in all categories. Lenser Dariusz Wolski's widescreen cinematography captures the pageantry of 19th warfare. Earlier, he shot several Scott epics, including \"The Martian,\" \"Prometheus,\" and \"The Counselor.\" Ultimately, Scott glosses over two things about Napoleon which remain inseparable in anybody's mind who has admired the Emperor's portraits. First, never once does Napoleon slip his hand into his tunic to suppress a spell of indigestion. Second, Scott never depicts Napoleon's health issues. Despite a little tampering here and there with history, \"Napoleon\" qualifies as a better than average extravaganza. Now, the question remains whether the extended four hour plus Apple TV+ version of \"Napoleon\" will make amends for any of these shortcomings.",
    "44": "I'm sorry, but you're making a movie on one of the greatest military leaders in history and you don't show his battles? Few get only couple brief battle scenes in the entire movie. Battlefield was were Napoleon made his name and legacy. Movie really does a big disservice to the Legacy of Napoleon.This should've been a 8 to 10 episode long miniseries to really show who Napoleon was.Acting is great. Phoenix and Kirby are amazing in their roles. Though must be said that Phoenix is about the same age as Napoleon was when he died. But it didn't really bother me that we had almost 50 Phoenix playing 20 something Napoleon.",
    "45": "Just found out the runtime is meant to be 4 hours but I paid good money to watch a horrifically modified load of crap. This 'movie' made napoleon seem very simplistic and lucky. When I saw a 2hr run time I was skeptical, no way you can fit those achievements into 2 hours, and when so much of the movie was taken up with Josephine there wasn't a lot of room left for the interesting parts. There was no 'I am maximus' or 'are you not entertained ' moments. Scott missed great opportunities for inspiration with the march of the eagles, not enough emphasis on tactics and the grand armee. Didn't hear la Marseillaise at all, how could they not play that? Largely uninspiring until the battle at austerlitz and then skipped one of the greatest winning streaks in human history. No mention of Charles 3? No bernadotte, no Spain, no Italy. Actually with all that's missing I'm not sure the 4 hr version will be much better.Probably the best line where he mentions caesar and Alexander was delivered without seeing napoleon, missed opportunity.I would have given this a 6 because the war stuff was great but just too little. Phoenix was superb as always.I dont normally leave the theater so disappointed but with so much left out I was pretty gobsmacked. Then the list of casualties at the end was a bit strange that it didn't show french loses compared to their adversaries. If you didn't know anything about the history you would think napoleon somehow fell into being emporer and then lost most of the battles when the reality is he was a tactical revolutionary and quite possibly the greatest military commander in known history.Apologies for any auto correct im sure some got through.If you want to know more watch kings and generals - napoleonic wars on you tube. It's much better than this Hollywood shite.",
    "46": "Watched the trailer and thought the war scenes were so real and exciting! And it's about the life of that great Napoleon, so no chance not to watch! And it's also told that the story was created by Kubrick and Spinberg, wow... However, I am totally deceived by the trailer! The story is all about the life of Napoleon but it just focus on the life with Josephine and the war ( even some said this film had misled his life), too much talking and it's over 2.5 hours, so I was so bored in between. The story telling skill is so bad., the only scenes that make me exited was the war on the iced lake, and even the last war is not that great. One of the disappointments in this year.",
    "47": "This should have been Ridley Scott's Lawrence of Arabia or Gandhi. But it wasn't.This film plays like a wikipedia stub article, showing stages of Napoleon's life and battles without giving much context.I have enjoyed many performances of Joaquin Phoenix over the years but this one was so one-note and bland it took the enjoyment out of the film.Portraying Bonaparte as some slow-minded unlikeable brooding brute with erratic emotions didn't do the historic figure any favours. This was a person who inspired the masses and was a military genius. But the script didn't want to show him in any favourable light at all.Vanessa Kirby as Josephine did a good job but this relationship between her and Napoleon seldom felt happy or real-instead it was like a toxic thing where both are pushing each others buttons all the time. But never does the script the work of hinting why these people are what they are.Ridley Scott seems not to care to explain why all these events happen. Napoleon goes to Russia - ok why? Napoleon is in Egypt - why? Why anything? Why not show exactly what the stakes are in these battles or how many soldiers are taking part... I don't understand how the director doesn't care about taking the audience along for the ride. Why should we watch this? Because action? Because of this lifeless one-note portrayal of one of Europe's most influential historical figures? Because toxic relationship drama?The movie needed secondary characters desperately to accompany Bonaparte and comment on his actions, maybe even be the link from the audience to the man? His best friend just disappears from the movie, as does his brother.Or make Bonaparte more complex, even. Maybe let him have different facets to his personality?I can't see myself watching the 4 hour version of this film when it comes out. Some battle scenes looked great but the slower scenes were sometimes quite average.",
    "48": "Only Alexander the great with Colin Farrell can compete with this absolute garbage. Boring, a horribly bad portrayed Napoleon (ruined Phoenix), historically inaccurate by far, full of feminist nonsense, really.. Nothing good about it. Not engaging in any way, I suffered most especially the last hour, with no popcorns left.I really wish they stopped ruining great figures in History just for the sake of making something politically correct. At least someone could give us a warning: \"this is not a movie about Napoleon or his success, not even about the French Empire\" and then people who want to can come to the theatre and enjoy the brave brave Josephine.",
    "49": "First things first as a French person, I take into count that the way Napoleon is seen in France and why other people knows him may be a lot different.The battles :\nEverybody knows him for his meteoric rise and his fall down. I though that the movie didn't really show us the impact Napoleon has on the French people. Was a hero for them and a terror for the rest of Europe. We don't really see him working is way up (no much battle) and even when there are some, it's super fast like it only take 2 canon shots to conquer any countries..\nAlso Napoleon is known for being a strategist. Except for the battle of Austerlitz we never see how clever he was, never explain how he is going to fight..\nFinally the battle of Waterloo was way too long only to cut the most wanted moment : how Napoleon get captured !! The scene is just cut to show him well treated in a English boat..\n(The cut scene in this movie are terrible 💀)\nAlso I feel like we don't understand very much the political climate in France at that time. I'm not gonna do history class but it was more messier than that and France has enemy at all of its borders.So for me, the war aspect of his life was clearly insufficient. But well, maybe the director wanted to show us a more intimate part of his life (and why not ?) except that it's always the same schema, toxic and carnal love. Take way too much time in film, and it's finally not as interesting as I though it would be.I think he could have been really great to maybe take position in the other camp : the European one. Maybe how the politics of different country though of Napoleon and the way he conquer little by little all Europe. A more political vision.Finally, I know my point of view is very specific and I even wonder if already knowing Napoleon's life, glory and fall down was worse than not knowing anything about him..",
    "50": "It started with accents throwing me off. French people with British accents, American accents, all over the place-completely taking me out of the film. Not even Napoleon? WTH? That may seem like nitpicking, but it a huge part of the history. I'd have even taken subtitles over what was done. When watching a historical film, part of the essence is the culture and the language, and with it being so all\nOver the place, I never once found myself fully invested.I didn't care what happened. Very slow, never captured me a bit, and honestly I felt it a total waste of the Joaquin 's talent in whatever Ridley was after. I was so bummed. I couldn't even finish it. I was counting down to see this too.",
    "51": "Once I found out that there will be a movie about Napoleon starring Joaquin Phoenix, I got excited. What a great idea? It's one of the most interesting people in history, of course this would make a great movie.But once I saw the first trailer, I understood that things aren't going to be so easy. This was a Hollywood 2023 history adaptation after all. In a world where movies don't have to make sense anymore but just succeed at the box office chances for a good historical movie about such a character are low. And so we're my expectations.The scenes are overdramatized, the battles too, everything seems fake at first sight. And Napoleon shooting at the pyramids? Common....",
    "52": "First the pros: great visuals, good vfx and costumes. Cons: everything else. Its long, slow and jumps all over the timeline in history. Acting was okay except Joaquin who seemed to be in a joker hangover mode. I walked out 90 minutes into the film. You can stop reading here. Rest all is a filler to\nmeet the character limit.Cons: everything else. Its long, slow and jumps all over the timeline in history. Acting was okay except Joaquin who seemed to be in a joker hangover mode. I walked out 90 minutes into the fim. First the pros: great visuals, good vfx and costumes. Cons: everything else. Its long, slow and jumps all over the timeline in history. Acting was okay except Joaquin who seemed to be in a joker hangover mode. I walked out 90 minutes into the fim.",
    "53": "An unusual and strange film adaptation of the life of Napoleon Bonaparte. This is also unusual for director Ridley Scott, who usually stands for strong action cinema, and here he completely gets involved in dramatic dialogues and a kind of love story. He also implements this phenomenally and well. I expected more battles and more military, but what I got was a romantic film. Is this good or bad? Bad because at over two and a half hours it drags a bit. Good, because the love story is very well told and the short but crisp battle scenes are simply very convincing. The film is worth seeing, but should be viewed with different expectations from the start. A very good film in its own way. Croatia Phoenix in particular is playing phenomenally. Weird, but good.",
    "54": "Reducing such a great man to a drunken, careless and hysterical character is, in my opinion, a great insult for one of the history's greatest.Joaquin and Vanessa were amazing just like usual. I really low strong and rich their acting is. The battles also looked nice even though they weren't necessarily 100% accurate. In fact, Napoleon worked relentlessly for France and his army. He truly loved Josephine and wrote perfect poems for her. But where did all his achievements go? Code civil, changing Paris, organizing his court... nothing was really mentioned. Napoleon was film in a whole different wrong point of view.I really expected more from this movie.",
    "55": "Kind of disappointed in this movie. Had very high expectations given the cast and Ridley Scott's direction. But the pacing is not great they were not able to spend adequate time on the politics and war strategy for which he was so famed. Too much time spent on the personal relationship between him and his wife. They especially rushed his exiles and return.Not sure that Joaquin Phoenix was a good choice for Napoleon, he could not get rid of his American accent so you had the lead with an American accent and the rest of the cast with British accents, it did not gel well. The sets and costumes were great though.Overall give this a miss and wait for it to come out on a streaming platform.",
    "56": "Why would a film maker direct a historical era movie if he has no interest in that history? Ridley Scott was asked about the many inaccuracies in the movie, and he said \"Were you there?\" His response is as idiotic as it is childish. Of course there are many things that are known about the subject of this film.The movie, even ignoring the lack of accuracy, isn't very interesting. Although the movie focuses on Napoleon's relationship with Josephine, that relationship isn't very compelling. Trying to take on the entirety of Napoleon's career is probably too much to handle for a single film.There probably are a number of people who don't know much about Napoleon. After seeing this movie, those people still don't.",
    "57": "Historical drama (with some creative licence)\"Napoleon\" is an action epic that details the rise and fall of the French Emperor, the film tracks Napoleon's journey from a nothing to King.The majority of this movie seems to focus on Napoleon's volatile relationship with Josephine and her inability to provide an heir. The battle sequences are some of the best you'll ever see, so I sincerely recommend seeing this on the largest screen available.This runs to almost 3 hours but didn't seem long, Ridley Scott hasn't disappointed (again), the history wasn't accurate, but the story very well told.",
    "58": "How is it that, when only half way through, over 95% of movie-goers know it's awful ..... that talented professionals who have been creating blockbusters for decades .... DO NOT KNOW?? Don't they preview their work before release? We see how bad it is and they don't? None of them think the same thing as just one of us in the audience? I'm a huge fan of all involved in this movie, especially Joaquin, but I just shake my head. The only positive was the battle scenes. The rest is way below zero, with no chance of thawing out. I was left so confused at the end, I felt like I fell asleep and missed years of detail. In one word: forgettable.",
    "59": "I went to see this despite not really fancying it but my husband was desperate to see it. I came away having enjoyed it much more than expected.Joaquin Phoenix is brilliant although the fact that he doesn't attempt to cover up his American accent was a bit off-putting. The same goes for the many good British character actors playing French noblemen and members of parliament - it was sometimes hard to remember they were playing French people.There is a heavy focus on the enduring love of Napoleon and his Josephine, played really well by Vanessa Kirby in stunning costumes and hair design. Their love story is funny at times, but also sad and emotional.I don't like very bloody battlefield scenes - hence my reluctance to see this - but they were not too bad apart from the terrible price paid by horses which is very upsetting to see.An almost unrecognisable Rupert Everett appears towards the end as the architect of Napoleon's downfall and his subsequent exile to St. Helena.Some have said that historical inaccuracy is an issue here - and the blasting of the Pyramids surely never happened - but see the film and make up your own mind. I think Joaquin would be a worthy award winner.",
    "60": "Very disappointing. Zero story line. The battle scenes were well done cinematically but because of the lack of story you are left indifferent to the outcome. Also, wasn't the metric system fully adopted after the French Revolution? Why were all distances expressed in miles? Miles were extremely inaccurate at the time, Was that the point? The truest spoiler from my experience was my very basic understanding of the period of history. It seemed more accurate than the movie. The sex scenes contributed nothing, I did get up and walk out after the battle of Waterloo so if after that the entire story wrapped up in a wonderful package I apologize. What I did see was agonizing because I had already wanted to leave an hour before.",
    "61": "This is an extraordinary film sure it's got flaws but to me the only one is a bit boring at times otherwise so damn good! Stupendous imax for sound and beautiful scenery. I'm not entirely sure why this got some hate it's a great movie especially Joaquin's performance and holy cow Vanessa Shaw is stunning she was a great addition to everything! The war bits were excellent, set design/clothes all impressive, some of it was goofy which was unexpected, and the acting alone deserves recognition. I think it's cute how plenty of old folks go to see this I'm 31 though I enjoyed a lot of the movie my only problem is slow at times.",
    "62": "The last couple or so of the reviews here echo pretty much my feelings about the film. It is possible to make a long movie that is captivating. The Russo/American War and Peace being a spectacular example at 7 hours , which I sat through in the mid 1960's (split into two sessions). This was not in that league, not even close. It is a bumbling romance with some halfhearted battle scenes thrown in for action. The life of Napoleon was somehow lost in the whole shambles. I'm not even sure if his character was meant to be taken seriously.My main memory of the afternoon spent watching this is that the theatre was cold, the seat was a little uncomfortable and why did I stay to the end? That about sums up the experience for me. The film itself is very forgettable.",
    "63": "This film is a turkey - not just because all of Ridley Scott's films on French history have bombed, or because brooding, drug-addict playing, mouth-filled-with-gravel Joaquin Phoenix completely misplays the part of Napoleon, or because Vanessa Kirby is a medium-talent actress playing a part way above her abilities - but because the script is very evidently horrible. Ridley's editing of that script during production is itself evidence that it's horrible, and it was undoubtedly made more horrible due to the director's ill-advised intervention. The proof is in the result - rather, the lack of a cinematic-quality result. This Thanksgiving season, I'm thankful that Sergei Bonarchuk, H. A. L. Craig, Vittorio Bonicelli,\nMario Soldati, and Rod Steiger had the skill and vision to bring a pitch-perfect cinematic portrayal of Napoleon to the big screen in \"Waterloo,\" which will stand all the taller in contrast to this hellacious piece of garbage.",
    "64": "Well, sorry, but 1 out of 10 based on the trailer, as it's highly unlikely for the FRENCH to be conversing in ENGLISH all the time. What the hell is Holy Crapwood thinking, that they can accurately portray history by making everyone speak English? So, no, I would not be spending my money on this garbage, regardless who directed it, as the premise is simply wrong from the very start. They could have hired French actors and have made it a proper production, but hell no, make it another useless multi-million dollar crap-buster for the mindless masses who give a crap about reality or history. The more I think about Ridley Scott, the more I believe he's highly overrated. Alien... well, that was still H. R. Giger for me, and had not a lot to do with Ridley's talent, but then again, I may well be wrong there. Let's see what else is playing these days in the cinemas.",
    "65": "This should have been called \"Napoleon and Josephine\" because, frankly, there's too much of Josephine in it, and not nearly enough of the brilliance and personality of Bonaparte. The historical inaccuracies are manifold. I read that director Scott says that \"If you weren't there then you can **** off\". Well I was not there, but the erroneous simplification of one of history's greatest characters shows Scott wasn't there either. The battle scenes are gaining accolades, but even they shouldn't. Wrong and over simplified. If you are going to make a movie about Napoleon, his generalship should have taken centre-stage, not his domestic tussles with the Missus. A grand disappointment. An artilleryman, as Napoleon was, taking part in a cavalry charge? I don't think so! Oh, how I wish Kubrick had carried through to make his version. I give this six stars, mostly for having the courage to take on such a mighty story. Too bad it fell far short of its subject matter.",
    "66": "A terrible film, such a disappointment. It felt like no scene lasted more than a couple of minutes, chopping from one scenario to the next without offering any context, depth, character or scene development. Characters came and went from nowhere, some suddenly central to the plot and then disappearing again, others getting a caption to name check them after appearing in four or five previous scenes.Joaquin Phoenix must have been set in concrete to rehearse for this stiff and charmless performance.I had to walk out after about 80 minutes, I couldn't take any more. I wanted to leave after 20 but had to give it a chance. That was a big mistake. As was this film. A huge opportunity to make a classic, instead here's a massive turkey just before Christmas.",
    "67": "Marketing team did excellent work all those months passed ! We saw two-three epic trailers and we all thought \" this will be a masterpiece, an epic film etc etc\". And we all became fraud!This is just a love story between napoleon and josephine ! Nothing more\nBattle scenes lasts as long as the trailers! Few seconds or just a minute! All the battles is on those trailers! No other battles , really!Extremely long film without any sense ! This might be only an hour and half !Historically innacurated at all! I dont know who wrote the script but for sure they dont even read a single paper of history of Napoleon!",
    "68": "Ridley Scott directed one of the best movies ever made set during the Napoleonic Wars: unfortunately, that movie is not Napoleon but his cinematic debut, The Duellists, forty years ago.Unsurprisingly, The Duellists had a strong source material (it was based on a novel by Joseph Conrad which it often followed almost verbatim), while Napoleon has an uneven screenplay by David Scarpa.Even past the age of eighty Sir Ridley can still shoot pretty and energetic pictures but his hits and misses depend on the scripts he picks, and he hasn't always shown the best discernment.The elephant in the room is the large amount of historical inaccuracies. Even as a history buff I can forgive many of those: cutting or simplifying events for the sake of narrative, or even some overdramatization like the meeting between Napoleon and Wellington (it never happened) or Napoleon being present at Marie Antoinette's execution (he wasn't); however, stuff like Napoleon charging with his troops at Waterloo is absolute cringe, a kid's (or a lout's) idea of history.Still, the big problems here are characterization and pacing.The movie is a demythologization (some would say emasculation) of Napoleon. If you want to take this route then fair enough, but the character here fails to be consistent. I can buy a Napoleon who is an egomaniac and an overrated tactician (like in Tolstoy's War and Peace). I do not buy one who is an anxious, insecure, uncharismatic cold fish but also a stern tactical genius and an effective leader of men, one who flees from Egypt because Josephine is unfaithful but is also an unflappable military mastermind.Phoenix is a great actor and does what he can but the two sides of the character just don't gel with each other. You can't have parodic moments like Napoleon rolling down the stairs during his coup against the Directory, despondently pouting as he waits for the rain to stop at Waterloo or awkwardly climbing on a box to stand face to face with a pharaoh's mummy (with his diminutive stature becoming a not-too-subtle metaphor of his overall mediocrity)... AND THEN have him magnetically charm the French soldiers into obedience after the Elba. This gawky Napoleon would have been shot to pieces there.The other problem is pacing. A single movie about the whole life of Napoleon is in itself absurd, like making \"a movie about World War 2\". There is material in Napoleon's life for a VERY dense miniseries (which Steven Spielberg is reportedly planning).Napoleon's first wife Josephine (Vanessa Kirby) plays a huge role here but I would argue the movie has either too little or way too much of her. This needed to be either focused mostly on Napoleon's personal life or to drastically reduce the (fairly repetitive after a while) moments where Napoleon is obsessed with his wife.As it is now, it tries to tell - but rushes through - twenty very eventful years of European history and yet devotes more time to Napoleon visiting Josephine after their divorce than to his Russian campaign.It's like making a D-Day movie which keeps cutting back and forth from the Normandy landings to Hitler spending time with Eva Braun. You can have either The Longest Day or Der Untergang, not both.Still, it's not worthless. There are some interesting moments and set-pieces and, while Phoenix is saddled with a contradictory character, Kirby at least is excellent.6/10.",
    "69": "Ridley Scott's NAPOLEON feels like the highlight reel of a lengthy miniseries. Considering there's a 4-hour cut of this film, that explains it all.NAPOLEON is certainly good spectacle. The battle scenes are breathtaking. Unfortunately, it's also shallow. I know Scott has sneered at viewers criticizing the historical inaccuracies in the film, but I'm more bothered by a total lack of interesting character psychology or even coherent storytelling. Characters pop in and out, leaving little impression in their brief scenes. Relationships between characters are barely fleshed out, including that of Napoleon and Josephine, which dominates the running time. Also, potentially unpopular opinion, I thought Joaquin Phoenix's performance was a one-note bore.Perhaps the 4-hour version is a richer piece of work. As is, NAPOLEON is a let down, especially after Scott's brilliant 2021 period piece THE LAST DUEL, which had all the drama and psychological depth this movie lacked.",
    "70": "I read the reviews of Ridley Scott's 'Napoleon' and knew it was not the great film everyone anticipated. Even so, I went. And what I discovered is that it's bad in the worst kind of way; It is dull. Lifeless. A flat un-involving story about characters who are in every way unlikable. Another reviewer wrote that he / she had trouble staying awake through its 2 hours 40 minutes run-time. When I read that I laughed. Now that I have seen the film, I am laughing no longer.Napoleon Bonaparte as Emperor of France did a lot of good things; much of the country's 'Civil Code' was instituted during his reign. But this film deals only with (a) Napoleon the warrior and (b) Napoleon the husband, and fails to deliver a well-rounded character in either sense. We know he loves France but aside from living there we don't know what drives his passion. His hatred for anything not France is clear, but the reasons for this hatred are never explained. There are battles a'plenty but the reason for them is elusive. Enemies become friends. Friends become enemies. We care about none of them. Thousands die. Somehow we care nothing about them either.There is, in Napoleon, no one to root for. Making matters worse there is an uneven performance by Joaquin Phoenix. His 'later' Napoleon becomes a different character than we'd seen earlier in the film. And no, I don't think it is attributed to Napoleon's rise in power. I think it's Phoenix; his acting, his portrayal. His Napoleon is far less quirky as the film progresses (as though the actor wants out of his role), and in this way, he is far less interesting.If there's anyone about whom we do care that character would be Josephine, Napoleon's wife and Empress of France. Vanessa Kirby is ravishing in the role. A rare beauty but one with a shadow-filled past as well as future. We can understand Napoleon's undying love her but the truth is, she's not the nicest girl on the block. There's little doubt that Mr. Bonaparte would never have 'won' her, were he not the country's future leader. So, again, no one to truly root for.Ah, yes. The battle scenes. They're fine (though it seems as though a battle fought at the base of Egypt's pyramids was cut out). But I think fewer battles and more unraveling of the reasons behind those battles between France, England, Russia, Austria, and other countries might make the remaining battles more meaningful.More involving.Which, as I said, this film is definitely not.",
    "71": "Back in 2005 Ridley Scott's 144 minute version of 'Kingdom of Heaven' premiered in theatres to somewhat mixed reviews. A couple of years later the vastly superior 190 minute director's cut version finally arrived, with the general consensus that the final product was a masterclass in storytelling, directing, acting and cinematography. - without doubt the best motion picture ever made about the crusades.Almost 20 years later we are yet again treated with a compiled highlight reel of a Ridley Scott movie in the theatre, rather than a full-fledged historical epic, since it has already become official that 'Napoleon' will be released later on streaming with its entire runtime of almost four hours, which clearly is needed to flesh out many parts of the movie and fill in the emotional and historical blanks, because this - somewhat butchered cut - moves in a breakneck speed and feels too rushed.Whereas the underappreciated 1970 movie 'Waterloo' starring Rod Steiger as Napoleon Bonaparte, featuring thousands of extras, portrayed events only during the 100 days campaign in 1815, Scott's 'Napoleon' takes us through decades of various major events and battles beginning with the siege of Toulon in 1793. In this version we never really learn why Napoleon was so powerful. Why did he win the admiration of so many? It's almost as if he stumbles through greatness. He was a great politician in real life, but here he is portrayed as a childish brute? It felt like the focus was more on setpieces and his troubled relationship with Josephine, than on him as a ruthless and cunning emperor, and in the theatre cut there really isn't a lot of places where Joaquin Phoenix truly shines as an Oscar contender. Maybe the director's cut will remedy that.In spite of its shortcomings (no pun intended) 'Napoleon' is still one of the best movies I have seen this year, but I am baffled. Because if people can sit through 3+ hour box office hits like 'Avengers Endgame', 'Avatar 2' and 'Oppenheimer' - why the need to release just a very extended trailer of 'Napoleon' in the theatre, especially when everyone know that they can just wait a couple of months for it to arrive on streaming in its entirety? An attempt by Apple at a cash grab? \"You need a subscription to our streaming service to watch the whole thing\"?With that being said, I do predict some Oscar nominations here. Ridley Scott yet again proves why he is one of the best filmmakers out there. But a word of caution: If you only plan to see this once, you might consider waiting for the director's cut.",
    "72": "Ridley Scott's Napoleon is more hysterical than historical. History is like an uninvited guest in this movie. Stunning battle visuals don't make up for gross historical approximations.If you want to watch a masterpiece then see Waterloo, with Rod Steiger and Christopher Plummer. And if you want a historical enumeration then watch the Napoleon series with Christian Clavier, Isabella Rossalini, John Malkovich and Gerard Depardieu.This movie was made for Apple streaming. Then they made a butchered version for cinema to be able to compete for the Oscars. The original Apple streaming version will be at least 2 hours longer. This cut version for cinema is somewhat rushed, disjointed and, as a result, confusing.We never really learn why Napoleon was so powerful and won the admiration of so many. Here it's almost as if he stumbles through greatness. He was a great politician in reality, over here he's shown as a childish brute. The focus was more on set pieces and his relationship with Josephine.Joaquin Phoenix can play odd or troubled characters well. Here he barely succeeds in persuading the viewers that he is Napoleon. He's too old for this role (Napoleon was 24 when Marie Antoinette was guillotined) and made the character seem bizarre than a charismatic leader. Vanessa Kirby as Josephine gets more traction.The cinematography by Dariusz Wolski is of a very high order. The battle scenes are filmed well. Ridley Scott knows how to make action scenes slick and impressive. But overall it's a below average movie. Napoleon deserves better than this shambolic movie.",
    "73": "Yes, that's a real quote from Joaquin Phoenix to Ridley Scott right before they started filming. I love Joaquin Phoenix, but you can really tell that he doesn't \"get\" the character of Napoleon that he's trying to play. I honestly don't know if Phoenix even has that kind of charisma and confidence within him, but then again I don't know anything about Napoleon either. But it was just uncomfortable watching him stumble his way through the movie, often just looking clueless.The other problem with the movie is it's just plain dull and uninteresting. It really does feel like a \"highlights\" movie. For an almost 3-hour film, it has surprisingly little dialogue. The dialogue that's there isn't' that illuminating or interesting. I normally like politics and romance (which is the bulk of this story), but I would have loved to see more military and war stuff in a movie like this. Isn't Napoleon supposed to be a brilliant war leader? There's like none of that here. Except \"oh we'll do a sneak attack in the night.\"The cinematography was also really surprisingly dull. It looked super digital. The colors were so bland and washed out.Vanessa Kirby is really the best thing about the movie. And also the first battle taking over that fort, which was admittedly pretty epic. I have never seen such a thing happen to a horse in a movie, and it was wonderfully horrifying.I fully blame Ridley Scott for this dud. Hopefully Spielberg's Kubrick miniseries about Napoleon will be much better.",
    "74": "NapoleonLet's start with the good things. The battle scenes are well shot, exciting, horrifying, the excellent work one can expect from a Ridley Scott movie.Josephine was fantastic. Her situation was clearly not ideal, and the actress portrayed her in such a way that I felt more for her than anyone else in the film.Now the bad things. All of it. This movie was not good at all. It was such a disappointment. This film had major problems with the flow of the story. It was extremely disjointed. I had no understanding of what was happening as it felt like someone took an outline and only filmed the bullet points, and not the detail beneath it. There is no transition from the coup in 1799 to the coronation in 1804. There is no explanation. There is no context as to how and why this was even acceptable.And don't get me started on historical inaccuracies. The very first scene shows Marie Antoinette getting beheaded in 1789 when that amazing invention called google can tell you otherwise.Maybe I'm being a bit harsh but I've studied English and French history quite extensively and it was cringe worthy to watch. Joaquin Phoenix was also very much miscast. I felt sorry for Vanessa Kirby as she was the highlight of the film. In all honesty, this film should have been called Josephine.I do not recommend watching this unless you're just there for the well shot battle scenes. The lake scene will give you chills. This film was a huge disappointment and I felt embarrassed for the filmmakers.",
    "75": "Napoleon was the most significant man of his age and no film can explain his significance in 2.5 hours. Scott decides to focus on three specific aspects of Napoleon's life and personality to show who he thinks Napoleon was at the expense of omitting much of what makes him such a fascinating figure in history.The first aspect Scott focuses on is Napoleon the lover. Much of this film shows his infatuation and on-again off-again relationship with Josephine. Both actors handle their parts well and while there is some humor and tension, it is the least interesting part of the movie. Still, some focus is necessary as his marriage to Josephine was certainly a key aspect of his life.The second aspect is Napoleon the megalomaniac. We all know of Napoleon as the short guy who had insecurity issues. Even if there is truth to this, it is probably an overstatement, but there is no denying the massive ego of the man. In many respects his ego is understandable for all he accomplished, and Scott paints Napoleon's inflated belief in himself as the reason for his fall, particularly in his invasion of Russia. Scott does not want us the think Napoleon fights for the glory of France but rather for the glory of Napoleon.The final side of the Napoleon casts him as a butcher. Towards the end of his career we see Napoleon recklessly spending the lives of his men as he seeks to conquer for himself. The movie leaves us with a comprehensive death toll that Napoleon left in his wake, a massive number that comes as a result of his callous disregard for his own men and endless ambition.So then we are left with a Napoleon as a man who loved Josephine, who had a massive ego, and constantly warred, causing the deaths of millions. All this is true, but what of Napoleon the tactician? What of Napoleon the reformer? What of Napoleon the leader? Scott focused on the worst aspects of Napoleon to highlight while disregarding the best. I was shocked that more was not discussed and shown over the massive victories and the unprecedented tactics he employed that make him a general still studied in military academies today. He was a multifaceted man, who accomplished much good and much bad, but he comes off in this film as a little ambitious fool.The film also seems jumbled at times and jumps forward in ways that show Napoleon must be conquering and doing something right, but he goes from general, to consul, to emporer in quick ways we are not shown. He beats Austria and Russa, befriends Russia, then is back at war with them one scene later. I understand the politics, battles, and alliances are hard to follow of the ealry 19th century, but I left feeling like I learned little more about Napoleon and the France he ruled than I already knew coming in.Despite the films shortcomings, it is a genuinely effective movie and shot beautifully. The battle scenes are bloody and tense, and the costumes and sets look recreate Napoleonic France beautifully.",
    "76": "The movie's only purpose is to prove Ridley Scott's greatness by portraying Napoleon in a very degrading way. To do that Scott basically lies through the whole movie.Nothing has happened like it's in the movie. Not even the battles. In a battle we see Napoleon butchering all the austrians on ice. Never happened. We also see Napoleon to butcher unarmed civilians in Paris. Never happened. We see the russian tsar as a cool kid who defeated Napoleon. Yeah Napoleon lost many man due to famine and diseases. But the movie \"forget\" to highlight that the tsar sacrificed his own citizens just to hunger Napoleon. He burned his own cities and grain fields to make Napoleon unable to feed his men. All in all the tsar destroyed his own population to stop Napoleon. But the movie portrays him as a charming kid and Napoleon as some kind of monster...Not to mention the law and justice system Napoleon established. Code Civil brought equality to all the people in France. Half of the world adopted it. Basically it is the root of nowadays justice system. He demolished noble privileges and gave people equal rights. Not surprising the movie not even mentions these facts. It was way more important to show one more bizarre unpleasing sex scene.This movie is a disgusting attempt to discredit Napoleon. It's a selfish disgrace from an English director who must have been frustrated by France's greatest leader.",
    "77": "So here is a film about one of the greatest warlords of history, and what do you suppose it emphasizes? If your guess is the yucky \"relationship\" he had with Josephine, you're not far from the truth.Here's what this movie contains:\ndark, murky lighting throughoutNapoleon waving his arm and magic happening on the battlefieldStupid and gratuitous sex, like watching a couple of dogsLong closeups of Napoleon's face twitchingWhat it does not contain:\nA plotAn editorAny idea of why Napoleon succeeded and then failedAny meaningful and/or normal relationshipsHistorical accuracyAvoid at all costs.",
    "78": "I give this movie props for the cinematography and costumes. Other than that, it had no redeeming qualities.It was bland and boring. There was no character development. Napoleon was either a weird, whiny mama's boy or a cardboard cutout. No passion, unless you want to describe his teary-eyed annoyance with Josephine's infidelity as \"passion.\"When he talks about his love for France and the sacrifices he makes, he may as well be describing the contents of his refrigerator.My Fitbit actually registered me as being asleep for 90 minutes of this movie (I was awake, but barely).The battlefield scenes were so-so. Napoleon had the same expression throughout all of them - whether on the battlefield, or watching Moscow burn, or getting his butt kicked at Waterloo.This movie was basically a historical timeline with some battlefield scenes thrown in.",
    "79": "The historic Napoleon has a ton of source material that would translate to a very interesting movie. Sadly, the interesting source material is ignored and we have the usual \"Prometheus\" bogged down and boring movie that Ridley Scott enjoys making.Napoleon was a great innovator and strategist. None of that is portrayed in the movie. His military mind is completely ignored.Napoleon won a lot of battles. Again this is ignored. Yes, there are a few battle scenes. These scenes are very short and have zero substance to them. The battle scenes that you see in the preview is almost as long as the actual scenes in the movie.The majority of the movie is about his relationship with his wife and the scandal from her infidelity.This is a complete borefest with little substance and a complete lack of the Napoleon history.",
    "80": "This movie must have cost a fortune to make. (There is no budget listed yet here on IMDB.) You would think they could have spent a little of it on a good script. So many of the problems here stem from the bad script, which does not provide clues about what it going on.What we get is several large-scale but very unexciting battle scenes, where we watch the infantry march into suicidal battle, sometimes led by the cavalry, sometimes followed. In a movie about a fabled tactician, there is no discussion of what made him a success, what he did differently, etc.In between the battle episodes are some of the least romantic, un-erotic love scenes ever filmed. Phoenix and his leading lady have absolutely NO chemistry whatsoever. Half the time he is like a statue with her, the other half like an over-eager dog. We never get a hint of what he might see in her.I stayed through the whole 2.5 hours because I was with friends. Otherwise I would have left mid-way through, or fallen asleep - as Napoleon does several times himself during the battle scenes.I saw Oppenheimer, which is a full three hours long, three times last summer, and was riveted to it all three times. That movie was well directed. This movie didn't hold me at all, had no pacing, and was sometimes confusing even though I have studied that period of French history.Some will find fault with historical inaccuracies. There are evidently a fair number of them. But that doesn't bother me. What bothered me was that Scott and his crew never made this story come alive. Why spend all that money and all those resources on something that just is not interesting?",
    "81": "As \"Napoleon\" (2023 release from the UK; 157 min) opens, it is \"France, 1793\" and Marie-Antoinette is meeting her final fate: beheaded as Napoleon watches from the crowd. We then go to Toulon, where Napoleon takes on the French royalists who are aided by British troops... At this point we are 10 minutes into the movie.Couple of comments: this is the latest oeuvre, don't just call it a film, from director Ridley Scott, who is now a crisp 86 years young if you can believe it. Here he decides to go yet bigger and bolder than ever before, and resistance will be futile. Except there is one little problem: the story telling simply lacks in quality and history (Napoleon did not watch Marie-Antoinette's beheading, for starters). We literally have no idea where Napoleon comes from or how he ends up being in the position that he was in at that perilous time. The same is true as the movie chugs along. I can honestly say that I know exactly the same of Napoleon before and after seeing the movie. As for the battle scenes, yes they are stage impressively, no doubt about that. But that is not enough to save this movie. Joaquin Phoenix seems strangely miscast as Napoleon. Bottom line: this is a Napoleon biopic with the subtlety of a bull in a China shop, and not all that enjoyable or even memorable.\"Napoleon\" was released in theaters a few weeks back, to so-so critical and commercial acclaim. I finally saw this a few days ago. Given the enormous hype around this film, my expectations were fairly high, and I regret to say that they were not met, not even close. But for the major battle scenes, this movie would've been a complete waste of time. Of course don't take my word for it. If you have any interest in Napoleon, please check it out, in the theater while you still can or otherwise on Apple TV, and draw your own conclusion.",
    "82": "This film is both. Paul Barras, in reality a genuine rival and enemy of Napoleon and one of Napoleon's fiercest opponents within France during his rise to power (while being romantically involved with Josephine prior to her involvement with Napoleon), is almost never shown as such, while the lengthy maneuvering to get his plan for the recapture of Toulon approved, which required alliance with powerful officials separate from Barras, is never shown. Napoleon's early campaign in Italy, where he faced three powerful Austrian armies, defeated them all after ferocious fighting, and in so doing really did save Revolutionary France from destruction, is never depicted. The Battle of Marengo, when Napoleon genuinely lost a battle and only had it regained due to the timely intervention of his lieutenant Louis Desaix, killed in the battle, is never depicted. His ordering of the arrest and execution of the Duc d'Enghien, the French royal heir - one of the most-momentous decisions in Napoleon's entire career - is never depicted. These are only the most-egregious errors in this muddled morass. The battles that are depicted are portrayed without any perception of the strategic maneuvering and adaptation that preceded and defined the battles themselves. In rushing to cover the entirety of Napoleon's career in a mere feature length, the film descends into a muddled non-entity of noise, blood, and confusion. Joaquin Phoenix's atrocious performance is completely at variance with the real man Napoleon was. Rupert Everett as the Duke of Wellington delivers the only competent performance in the entire film - and that in a supporting role.",
    "83": "A new low in Scott's career, which is turning into quite a feat.It saddens me to say that the once great and adored director of instant classics (The Duelists, Alien, Gladiator, Blade Runner... he made at least 3 of my all time favorite 10 movies) keeps turning out total turds (the new Alien movies come to mind), atrocious.The Last Duel was already pretty boring and took the crown of the most stupid helmet ever depicted in a movie, EVER!! But this new monstrosity really takes the cake.Some of the worst problems:\nNapoleon (whom I do not like as a historic person, so I'm not a hurt fanboy) doesn't age and is nearly too old for the last scenes, let alone the early once. Neither actor nor make up department nor special affects make ANY effort to show the passage of time, it's ridiculous, an obviously near 50 year old Phoenix with Phoenix' very familiar near 50 year old face plays a 24 up to 45 y/o man without any distinction in between. It really takes one out of the movie.Also, so many historic lies. You read the list; the shooting of the pyramids, the meeting with Wellington ('boats', WTF?!?), him leading cavalry charges as an expert horsemen, it's appalling.How will history react to a movie about the life of Hitler in 125 years when some hack director decides that he met Churchill or FDR and was riding tanks into the battle of Kursk... will that hack then defend this crap by saying \"where you there?\", the most ignorant *and* arrogant statement towards history I've ever heard off...\nI'm not even going into this Josephine obsession, and how all the event and battles lack any introduction or context, they just happen, and Napoleon, as mentioned above, looks the same.You get it, I hate this movie and I hate the director for his arrogance for cheating us out of a decent Napoleon movie for at least another generation after this one's (I'm assuming) abysmal failure.",
    "84": "Ridley Scott's Napoleon is a high-budget cinematic exercise in \"Whatever, man, that'll do.\"\nThe film, both in terms of what it presents and how it presents, reeks of hollowness. Characters are shadows(not defined enough to even be considered parodies or mockeries of their real-life counterparts as some people like to see them), story is a shadow of a proper story( at times feeling as if written by A. I), atmosphere, with the exception of some of the battle scenes and the Russian segment, sterile and practically non existent(disasterous for Scott who is known to be one of the greatest world builders in history of the artform). Stuff just happens in the film. No significance or weight to anything or anybody... Sure, it's not all bad. The classic Ridley Scott elements are here - battles are engaging, the costumes and set designs very well-done. Something he can't help but always be good at.Overall, Ridley Scott's Napoleon feels like a simulacrum, a reduced copy of a real film, where, it seems, all life is sucked out . If I had more reverence towards the post-Gladiator Ridley Scott, I'd, perhaps, think of the film as some kind of metajoke, a self-aware self-parody, but, frankly, I think it's just a matter of the filmmaker not caring much. Just another day at work for Ridley, gotta keep working, do one thing, move on to the next one immediately, have fun, try things out, don't overthink it - this seems to be the way to go for the good ol' Ridley these days. Can't blame him, he's 85, for Christ's sake, but the movie's not good, kind of proto A. I-produced entertainment.",
    "85": "When you go to a movie about Napoleon, titled \"Napoleon\", you have certain expectations. You expect to see Napoleon, some battles and some historical events and explanation. Napoleon barely delivers such things. It is a very strange movie that makes some undeniably bad choices in terms of what it chooses to focus on. Most of the story is centered not around Napoleon, but around Josephine. She is his wife and muse and he simps hard for her. Almost everything in the movie is bent to fit around her in some way and it turns what should have been a little sideplot into the main focus of almost every single thing in this movie. It makes this 200 million dollar movie feel like a cheap romantic B-film.The battle scenes are few and far between. There's three in total and two of them are over fairly quickly. It's a shame because they're pretty decent. Waterloo takes a little longer but lacks the massive scale I was hoping to see. If you say there's 125.000 men, show me the 125.000 men. At times it felt like there were no more than 125. It really makes you wonder where all that money went.The plot in Napoleon is disjointed, rushed and all over the place. It spends way too much time showing Phoenix having dull PG-13 sex with Josephine but totally skips important events that actually matter to the story. I know there's a four hour cut and I'm sure that'll be at least somewhat better, but the way they chose to cut this one is ridiculous. It is almost three hours long and still manages to tell basically nothing about Napoleon's life, his character, his rise to power, his battle tactics and/or his fall from grace. All it tells is that he liked Josephine and France.Phoenix does okay but feels like he's trying a bit too hard to be quirky, almost Jack Sparrow-ish at times. The weird way he interacts with Josephine is offputting and he lacks any power and charisma in almost every scene. It makes it hard to believe that entire armies look up to him and would desert for him. It's not that Phoenix does bad, it's just that his type of acting doesn't feel right for the role of a powerful dictator. The rest of the cast does okay but there are no noteworthy performances. This movie might have been forced into cinemas for the oscars, but I highly doubt it'll get any.I'm not a history buff and I'll fully admit that any historical inaccuracies have certainly not bothered me. It's usually not too blatant. And it's not what made the movie bad to me. If you áre into history, my wife has assured me you'll likely notice another full layer of awfulness that most people might miss out on. Good luck.All in all, Napoleon is just a chore of a movie to get through. It has it's occassional moments, but they make up at most thirty minutes of it's runtime. The rest of it is either dull, confusing, bad or a depressing mix of all three.",
    "86": "\"Destiny has brought me this lambchop.\" Yes, that is a real line from Ridley Scott's Napoleon. The film follows Napoleon Bonaparte's rise and fall as emperor of France while also showing his rocky relationship with his wife, Empress Josephine. Marketed as an action-heavy spectacle of Napoleon's military exploits, the film surprisingly turns out to be an absurd, raunchy romcom that could have worked.Joaquin Phoenix portrays Napoleon as an insecure, mumbling man-child who happens to be very lucky in his rise to power, playing into the romcom element as, for the majority of the film, he is hilariously infatuated with Joséphine. It's no surprise that Phoenix does an outstanding job of delivering the script, as he easily slips into this interpretation of the famous conqueror. Holding up the other end of this romcom is Vanessa Kirby's Joséphine. While she wasn't given anything particularly compelling to work with regarding her dialogue, her performance is on par with Phoenix's. Phoenix is often seen projecting his insecurities onto Kirby's character as she becomes increasingly disinterested with him. These two help keep an otherwise bloated film afloat.Unfortunately, this romance, which makes up the majority of the film, is built on a flimsy foundation. In their first scene together, Napoleon awkwardly mumbles through a conversation with Joséphine. Then, immediately after, the two are married. Next, they are having extramarital affairs. All of this happens in the first thirty minutes of the film and the audience is given no time to breathe or even process what has transpired.On the comedy side, the film has a few witty remarks and some situational comedy, preying upon Napoleon's inflated ego, which is used to compensate for his many insecurities. For example, Napoleon is always in his signature uniform, hat and all, adding inches to his small stature. This becomes ridiculous as even the other military and political figures in the film aren't always in uniform. Then, here comes the strange \"destiny has brought me this lambchop\" line, which Phoenix gleefully delivered. The film is full of strange lines like this making the film feel like a parody, poking fun at Napoleon's idiosyncrasies and fragile ego.Outside of the acting, the film's production is spectacular. The costume department does a great job with the late 1700s to early 1800s setting. This is bolstered by the set design, recreating a past era in a way that feels genuine and real. Both of these elements especially coalesce in the film's action sequences. Scott delivers what was promised in the film's marketing with these action scenes sprinkled throughout the film. The action is disgusting and visceral, playing into the messaging surrounding the violent consequences of Napoleon's unchecked ego and subsequent rampage through Europe. Unfortunately, while these action scenes are very entertaining, while also presenting a thought provoking level of violence and gore, they feel meaningless. They are emotionless and have no setup or payoff; they just happen and the film does nothing to explain why they matter to our character's story. While I don't really have an issue with sacrificing historical accuracy for storytelling purposes, the action scenes are apparently very inaccurate.Perhaps the biggest failure of the film is its inability to commit to a central idea. This feels like a puzzling amalgamation, leaving me with two questions: is it a comedy poking fun at Napoleon and his marriage? Or is it a war movie exposing the carnage he created? None of these ideas are fully fleshed out and they don't seem to intersect in any way. Also, the film gives no explanation for why Napoleon is the way he is. There is no deep dive into his childhood or his psyche. The film presents him as just an insecure man with a lot of power, who yearns to be loved by his reluctant wife.Napoleon serves more as an accidental romcom and borderline parody than an epic war drama. There is hope for this film, as the four hour director's cut will be available on Apple TV+, which will hopefully resolve the theatrical cut's shortcomings, if anyone bothers to sit through it.",
    "87": "Set from 1793 through 1815 in France, the life of Napoleon Bonaparte (Joaquin Phoenix) is covered chronicling his rise to power from the chaos of the French Revolution and his relationship with Josephine (Vanessa Kirby).Napoleon is the latest film from director Ridley Scott and is a grand and audacious biopic chronicling the life and exploits of French historical figure Napoleon Bonaparte. Despite the importance of Napoleon in world history, outside of some isolated projects like 1970s Waterloo or the 2002 French miniseries Napoleon his life hasn't yet lent itself to a definitive filmed version with notable attempts by those such as Stanley Kubrick stonewalled due to various issues. Scott's take on Napoleon was announced in 2020 originally as a project for 20th Century Fox before instead being setup at Apple. With a multimillion-dollar budget, an Oscar winning lead, and a prestigious director tackling an important historical figure Napoleon is certainly a film that aspires for greatness (and awards) but unfortunately crumbles under a bevy of creative and stylistic choices that do a disservice to its central figure.If there's anything to be said about Napoleon, it's in the production design, costuming and battle scenes. From the chaotic scenes in the French Revolution to Napoleon's conquests across Europe you feel a sense of impact and weight in what's being shown and Scott certainly knows how to show it off. The period details are also to be commended with the recreation of 19th Century France well realized and the craft and construction of the cast's costumes can't be understated with Napoleon's wardrobe in particular rich in fine details that you can't help but be impressed by. Unfortunately on a story level Napoleon is a crushing disappointment. While Scott and writer David Scarpa are undeniably ambitious in attempting to recreate the entirety of Napoleon's life in cinematic form (with a longer 4 hour cut rumored to be coming to Apple TV in the near future), this results in the film feeling very unfocused and less like a character study and more like we're glimpsing the cliff notes of Napoleon's life rather than experiencing them or gaining an understanding of them in the larger context of what's going on. The movie does bring up significant historical events like the various stages of the French Revolution or Napoleon's Corsican heritage, but there's so little time spent developing those aspects the audience won't get the full impact unless they're already familiar with the historical context before hand as the movie often seems like it's expecting the audience to be familiar (to a point) with Napoleon's life while also taking frequent liberties with it. The movie also jumps around time at a rapid pace with years passing by in seconds and it really makes it feel like this material either should've been narrowed and focused or turned into a The Crown type TV series.On the acting side Joaquin Phoenix did not work for me as Napoleon. While I've seen Phoenix give some undeniably good performances in his career, his mumbly delivery, with a performance that almost feels comedic at points, and a look that just didn't match Napoleon never sucked me into thinking I was watching a character or the real Napoleon, but rather I was watching someone play a very expensive game of dress-up. Vanessa Kirby is maybe slightly better as Josephine, but she also feels hopelessly lost playing this role with the movie not really doing much to make her a multi-formed character or analyze her relationship with Napoleon and because the movie centers on this relationship between Napoleon and Josephine with these scenes often center stage it makes it known how repetitive and empty its take is on these historical figures and that's even discounting the glaring historical inaccuracies (which have no doubt dictated the less than enthused French reception). With the way Phoenix's portrayal of Napoleon is utilized and some of his lines you almost get the sense that Scott's maybe trying to make some sort of parallel between Napoleon and modern day so-called \"neo-populists\" like Donald Trump or Jair Bolsonaro, but even if that was the case the fact Scott had to bend, twist, and break the historical material to make that analogue shows how much that take doesn't work and it's a case of putting a square peg in a round hole.I was really disappointed with Napoleon while also admiring its scope, scale, and craft. If you remember 1970s and 80s historical TV miniseries, there was often a practice where they'd be heavily edited for feature films that would be distributed overseas and that's kind of what the movie feels like including the acting only with modern day actual film resources. Napoleon is a bad movie made in the best way possible, but you end up paying more attention to the craft rather than the actual content and substance (or lack thereof).",
    "88": "The rise and fa of French Emperor Napoleon Bonaparte, who's thirst for power led him to many victories and some significant losses.I struggle to associate any commonality with reviews that have called it slow and bum aching, it's a historical saga, if you have expectations of something different, you went to the wrong film.The epic I had hoped for from Ridley Scott, a great story, huge battle sequences, and a detailed exploration of Napoleon, and his complex relationship with Josephine. The perfect mix I thought, it never became overly sentimental or slushy, I thought he nailed it.Several scenes stood out in particular, for me the best of all was the battle of Austerlitz, the sheer audacity of the plan as well as the epic visuals, just phenomenal. Secondly, the siege on Moscow, again tremendous visuals, but the hollowness of the victory was cleverly executed, and of course, the battle of Waterloo, incredibly realised.The running time was spot on, I'm glad it didn't go on any longer, it felt like that right run time.I thought the production values were superb, incredibly sets, great battles, as well as amazing costumes.Joaquin Phoenix delivers an award winning performance, he is phenomenal, and brings the character to life, he's definitely someone who's conflicted, addicted to power and definitely love sick. Vanessa Kirby excellent as Josephine.Plenty of British talent on display to enjoy, the likes of Julian Rhind Tutt, Sorcha Cusack, Rupert Everett and the excellent Paul Rhys.Overall, well worth your time.8/10.",
    "89": "First of all I give it a 5 based solely on entertainment value. Historically, it's more like a 2. Regardless Hollywood is not where I go for historical accuracy so it does get somewhat of a pass. The movie was entertaining and did have interesting moments but it felt more mediocre than amazing.All that can be said is this movie was a wasted opportunity. The relationship between Napoleon and Josephine was inaccurate and bizarre. The battle scenes were ok at best and a huge disappointment at worse. Many of the battles look like they only involved a few hundred men and strangely always took place near encampments.The movie bit off more than it could chew. Napoleon's life is an epic drama so much so that they skipped entire campaigns and only included 5-10 minutes at best of others to make a 2.5 hour run time. This made the movie feel choppy and disconnected. It would have been better to have focused on only part of Napoleon's life and made sequels to cover the rest.Phoenix as Napoleon was a major disappointment or almost disaster. Perhaps this was Scott's fault but Phoenix failed on so many levels. The love scenes were weird and some of his lines bordered on silly (\"you think you are so great because you have boats!\"). This is especially bizarre considering much of the dialogue is historical record so there is little reason to deviate.Worst of all, the movie failed to convey why Napoleon was great. Why was Napoleon an exceptional battlefield commander? Why was all of Europe terrified of him? How could this man rally 17 year old farm boys to superhuman feats against overwhelming odds whenever they saw him on the battlefield? Why did France sacrifice well over a million men to their deaths and not only welcome him back from exile but give him a massive state funeral 20 years after his death and a place of honor in Paris to this day? Napoleon's life is almost so exceptional and astonishing that his story is too much for even great directors and actors to handle.Honestly if you want a much better and just as well made movie about Napoleon I highly recommend the A&E miniseries from 2002 called \"Napoleon.\" Far more accurate historically and in depth.",
    "90": "Napoleon has a lot going for it but also some stuff holding it back from greatness. Ridley Scott did a very good job directing here, with the battle scenes being some of the best ever put to screen. I especially loved the battle over the frozen water. That was really cool. The movie also captures France in that time period really well with the costumes and set design. The story does an ok job at telling the story of Napoleon's life but it doesn't feel like there's really enough there to understand who he is as a person. We needed some scenes that showed his upbringing and why he formed his ideologies. It's mostly about his political life and I didn't really have any strong feelings on him by the end. There were also multiple scenes where it felt like Napoleon was a joke and came across as kind of funny but I don't think they were supposed to come across that way. His character was kind of inconsistent. Joaquin Phoenix was ok in the role but he's had way better performances in movies like Gladiator, Her, and Joker. Vanessa Kirby as Josephine absolutely stole the show here. She was phenomenal as Josephine and I think she was the best part of the movie. Speaking of Josephine I actually really liked the romance part of the movie. I thought it was the most interesting part and I liked how the two communicated by letters. The script needed to add more depth to the characters and I feel like it would have been better suited as a tv mini series. There just wasn't enough time here to tell this story and do it justice. Overall it's an entertaining movie that has a lot of really great things in it but it's rushed script and inconsistent lead character hold it back. 6/10.",
    "91": "My feelings of this movie are very bad. I wanted to leave the movie theater because of a mix of rage and bordom .My problem was in the following. I think the main character is playing way to plant and boring I really wished. He has some charisma some fire but most of the time. He just felt like he's on antidepressants medicine.I really did not enjoy the way they did the movie when they just keep skipping forward in Napoleon's life it not really feel like we get to see any of his battles of what he did his life decisions. It's just felt like a highlight of the most interesting part but without the Deep of going into themAnd the choice they did with the colors are just horrible most of the time is just Gray and boring maybe if you're lucky, we are in the same delays of Egypt and its yellow it just it's supposed to be such a colorful time in Napoleon has the f** red colors and blue but it's just Gray most of the time. It's so sad to look at.Most of the time I just ask myself, what is this movie trying to do to make a sad story about Napoleon to show his most interesting battles to make an infused yet again relatable characters because to me none of it really worked on me most of the time. I just wanted to leave the theatre,",
    "92": "From the very opening scene, I realized something was wrong. We were in late 1700s France and a bunch of people were talking and yelling in a large hall. But I was confused. All the actors were speaking in a British-accented english. Was this London?And that was the beginning.From the great director that gave us Blade Runner, at the end, this flick turned out to be lukewarm. Nothing memorable.If you are into battle scenes, with attention to detail on weaponry of the time and tactics of warfare in the battlefield, with cavalry, infantrymen, artillery guns, then you would LOVE this film.But at the end, there seems to be very little to be told about the man and the time.By comparison, the 1970 film \"Patton\", directed by Franklin J. Schaffner, and written by Francis Ford Coppola, was a much better production and film, with a better outcome and feel for the story.",
    "93": "The historic Napoleon has a ton of source material that would translate to a very interesting movie. Sadly, the interesting source material is ignored and we have the usual \"Prometheus\" bogged down and boring movie that Ridley Scott enjoys making.Napoleon was a great innovator and strategist. None of that is portrayed in the movie. His military mind is completely ignored.Napoleon won a lot of battles. Again this is ignored. Yes, there are a few battle scenes. These scenes are very short and have zero substance to them. The battle scenes that you see in the preview is almost as long as the actual scenes in the movie.The majority of the movie is about his relationship with his wife and the scandal from her infidelity.This is a complete borefest with little substance and a complete lack of the Napoleon history.",
    "94": "This movie must have cost a fortune to make. (There is no budget listed yet here on IMDB.) You would think they could have spent a little of it on a good script. So many of the problems here stem from the bad script, which does not provide clues about what it going on.What we get is several large-scale but very unexciting battle scenes, where we watch the infantry march into suicidal battle, sometimes led by the cavalry, sometimes followed. In a movie about a fabled tactician, there is no discussion of what made him a success, what he did differently, etc.In between the battle episodes are some of the least romantic, un-erotic love scenes ever filmed. Phoenix and his leading lady have absolutely NO chemistry whatsoever. Half the time he is like a statue with her, the other half like an over-eager dog. We never get a hint of what he might see in her.I stayed through the whole 2.5 hours because I was with friends. Otherwise I would have left mid-way through, or fallen asleep - as Napoleon does several times himself during the battle scenes.I saw Oppenheimer, which is a full three hours long, three times last summer, and was riveted to it all three times. That movie was well directed. This movie didn't hold me at all, had no pacing, and was sometimes confusing even though I have studied that period of French history.Some will find fault with historical inaccuracies. There are evidently a fair number of them. But that doesn't bother me. What bothered me was that Scott and his crew never made this story come alive. Why spend all that money and all those resources on something that just is not interesting?",
    "95": "As \"Napoleon\" (2023 release from the UK; 157 min) opens, it is \"France, 1793\" and Marie-Antoinette is meeting her final fate: beheaded as Napoleon watches from the crowd. We then go to Toulon, where Napoleon takes on the French royalists who are aided by British troops... At this point we are 10 minutes into the movie.Couple of comments: this is the latest oeuvre, don't just call it a film, from director Ridley Scott, who is now a crisp 86 years young if you can believe it. Here he decides to go yet bigger and bolder than ever before, and resistance will be futile. Except there is one little problem: the story telling simply lacks in quality and history (Napoleon did not watch Marie-Antoinette's beheading, for starters). We literally have no idea where Napoleon comes from or how he ends up being in the position that he was in at that perilous time. The same is true as the movie chugs along. I can honestly say that I know exactly the same of Napoleon before and after seeing the movie. As for the battle scenes, yes they are stage impressively, no doubt about that. But that is not enough to save this movie. Joaquin Phoenix seems strangely miscast as Napoleon. Bottom line: this is a Napoleon biopic with the subtlety of a bull in a China shop, and not all that enjoyable or even memorable.\"Napoleon\" was released in theaters a few weeks back, to so-so critical and commercial acclaim. I finally saw this a few days ago. Given the enormous hype around this film, my expectations were fairly high, and I regret to say that they were not met, not even close. But for the major battle scenes, this movie would've been a complete waste of time. Of course don't take my word for it. If you have any interest in Napoleon, please check it out, in the theater while you still can or otherwise on Apple TV, and draw your own conclusion.",
    "96": "This film is both. Paul Barras, in reality a genuine rival and enemy of Napoleon and one of Napoleon's fiercest opponents within France during his rise to power (while being romantically involved with Josephine prior to her involvement with Napoleon), is almost never shown as such, while the lengthy maneuvering to get his plan for the recapture of Toulon approved, which required alliance with powerful officials separate from Barras, is never shown. Napoleon's early campaign in Italy, where he faced three powerful Austrian armies, defeated them all after ferocious fighting, and in so doing really did save Revolutionary France from destruction, is never depicted. The Battle of Marengo, when Napoleon genuinely lost a battle and only had it regained due to the timely intervention of his lieutenant Louis Desaix, killed in the battle, is never depicted. His ordering of the arrest and execution of the Duc d'Enghien, the French royal heir - one of the most-momentous decisions in Napoleon's entire career - is never depicted. These are only the most-egregious errors in this muddled morass. The battles that are depicted are portrayed without any perception of the strategic maneuvering and adaptation that preceded and defined the battles themselves. In rushing to cover the entirety of Napoleon's career in a mere feature length, the film descends into a muddled non-entity of noise, blood, and confusion. Joaquin Phoenix's atrocious performance is completely at variance with the real man Napoleon was. Rupert Everett as the Duke of Wellington delivers the only competent performance in the entire film - and that in a supporting role.",
    "97": "A new low in Scott's career, which is turning into quite a feat.It saddens me to say that the once great and adored director of instant classics (The Duelists, Alien, Gladiator, Blade Runner... he made at least 3 of my all time favorite 10 movies) keeps turning out total turds (the new Alien movies come to mind), atrocious.The Last Duel was already pretty boring and took the crown of the most stupid helmet ever depicted in a movie, EVER!! But this new monstrosity really takes the cake.Some of the worst problems:\nNapoleon (whom I do not like as a historic person, so I'm not a hurt fanboy) doesn't age and is nearly too old for the last scenes, let alone the early once. Neither actor nor make up department nor special affects make ANY effort to show the passage of time, it's ridiculous, an obviously near 50 year old Phoenix with Phoenix' very familiar near 50 year old face plays a 24 up to 45 y/o man without any distinction in between. It really takes one out of the movie.Also, so many historic lies. You read the list; the shooting of the pyramids, the meeting with Wellington ('boats', WTF?!?), him leading cavalry charges as an expert horsemen, it's appalling.How will history react to a movie about the life of Hitler in 125 years when some hack director decides that he met Churchill or FDR and was riding tanks into the battle of Kursk... will that hack then defend this crap by saying \"where you there?\", the most ignorant *and* arrogant statement towards history I've ever heard off...\nI'm not even going into this Josephine obsession, and how all the event and battles lack any introduction or context, they just happen, and Napoleon, as mentioned above, looks the same.You get it, I hate this movie and I hate the director for his arrogance for cheating us out of a decent Napoleon movie for at least another generation after this one's (I'm assuming) abysmal failure.",
    "98": "Ridley Scott's Napoleon is a high-budget cinematic exercise in \"Whatever, man, that'll do.\"\nThe film, both in terms of what it presents and how it presents, reeks of hollowness. Characters are shadows(not defined enough to even be considered parodies or mockeries of their real-life counterparts as some people like to see them), story is a shadow of a proper story( at times feeling as if written by A. I), atmosphere, with the exception of some of the battle scenes and the Russian segment, sterile and practically non existent(disasterous for Scott who is known to be one of the greatest world builders in history of the artform). Stuff just happens in the film. No significance or weight to anything or anybody... Sure, it's not all bad. The classic Ridley Scott elements are here - battles are engaging, the costumes and set designs very well-done. Something he can't help but always be good at.Overall, Ridley Scott's Napoleon feels like a simulacrum, a reduced copy of a real film, where, it seems, all life is sucked out . If I had more reverence towards the post-Gladiator Ridley Scott, I'd, perhaps, think of the film as some kind of metajoke, a self-aware self-parody, but, frankly, I think it's just a matter of the filmmaker not caring much. Just another day at work for Ridley, gotta keep working, do one thing, move on to the next one immediately, have fun, try things out, don't overthink it - this seems to be the way to go for the good ol' Ridley these days. Can't blame him, he's 85, for Christ's sake, but the movie's not good, kind of proto A. I-produced entertainment.",
    "99": "When you go to a movie about Napoleon, titled \"Napoleon\", you have certain expectations. You expect to see Napoleon, some battles and some historical events and explanation. Napoleon barely delivers such things. It is a very strange movie that makes some undeniably bad choices in terms of what it chooses to focus on. Most of the story is centered not around Napoleon, but around Josephine. She is his wife and muse and he simps hard for her. Almost everything in the movie is bent to fit around her in some way and it turns what should have been a little sideplot into the main focus of almost every single thing in this movie. It makes this 200 million dollar movie feel like a cheap romantic B-film.The battle scenes are few and far between. There's three in total and two of them are over fairly quickly. It's a shame because they're pretty decent. Waterloo takes a little longer but lacks the massive scale I was hoping to see. If you say there's 125.000 men, show me the 125.000 men. At times it felt like there were no more than 125. It really makes you wonder where all that money went.The plot in Napoleon is disjointed, rushed and all over the place. It spends way too much time showing Phoenix having dull PG-13 sex with Josephine but totally skips important events that actually matter to the story. I know there's a four hour cut and I'm sure that'll be at least somewhat better, but the way they chose to cut this one is ridiculous. It is almost three hours long and still manages to tell basically nothing about Napoleon's life, his character, his rise to power, his battle tactics and/or his fall from grace. All it tells is that he liked Josephine and France.Phoenix does okay but feels like he's trying a bit too hard to be quirky, almost Jack Sparrow-ish at times. The weird way he interacts with Josephine is offputting and he lacks any power and charisma in almost every scene. It makes it hard to believe that entire armies look up to him and would desert for him. It's not that Phoenix does bad, it's just that his type of acting doesn't feel right for the role of a powerful dictator. The rest of the cast does okay but there are no noteworthy performances. This movie might have been forced into cinemas for the oscars, but I highly doubt it'll get any.I'm not a history buff and I'll fully admit that any historical inaccuracies have certainly not bothered me. It's usually not too blatant. And it's not what made the movie bad to me. If you áre into history, my wife has assured me you'll likely notice another full layer of awfulness that most people might miss out on. Good luck.All in all, Napoleon is just a chore of a movie to get through. It has it's occassional moments, but they make up at most thirty minutes of it's runtime. The rest of it is either dull, confusing, bad or a depressing mix of all three.",
    "100": "\"Destiny has brought me this lambchop.\" Yes, that is a real line from Ridley Scott's Napoleon. The film follows Napoleon Bonaparte's rise and fall as emperor of France while also showing his rocky relationship with his wife, Empress Josephine. Marketed as an action-heavy spectacle of Napoleon's military exploits, the film surprisingly turns out to be an absurd, raunchy romcom that could have worked.Joaquin Phoenix portrays Napoleon as an insecure, mumbling man-child who happens to be very lucky in his rise to power, playing into the romcom element as, for the majority of the film, he is hilariously infatuated with Joséphine. It's no surprise that Phoenix does an outstanding job of delivering the script, as he easily slips into this interpretation of the famous conqueror. Holding up the other end of this romcom is Vanessa Kirby's Joséphine. While she wasn't given anything particularly compelling to work with regarding her dialogue, her performance is on par with Phoenix's. Phoenix is often seen projecting his insecurities onto Kirby's character as she becomes increasingly disinterested with him. These two help keep an otherwise bloated film afloat.Unfortunately, this romance, which makes up the majority of the film, is built on a flimsy foundation. In their first scene together, Napoleon awkwardly mumbles through a conversation with Joséphine. Then, immediately after, the two are married. Next, they are having extramarital affairs. All of this happens in the first thirty minutes of the film and the audience is given no time to breathe or even process what has transpired.On the comedy side, the film has a few witty remarks and some situational comedy, preying upon Napoleon's inflated ego, which is used to compensate for his many insecurities. For example, Napoleon is always in his signature uniform, hat and all, adding inches to his small stature. This becomes ridiculous as even the other military and political figures in the film aren't always in uniform. Then, here comes the strange \"destiny has brought me this lambchop\" line, which Phoenix gleefully delivered. The film is full of strange lines like this making the film feel like a parody, poking fun at Napoleon's idiosyncrasies and fragile ego.Outside of the acting, the film's production is spectacular. The costume department does a great job with the late 1700s to early 1800s setting. This is bolstered by the set design, recreating a past era in a way that feels genuine and real. Both of these elements especially coalesce in the film's action sequences. Scott delivers what was promised in the film's marketing with these action scenes sprinkled throughout the film. The action is disgusting and visceral, playing into the messaging surrounding the violent consequences of Napoleon's unchecked ego and subsequent rampage through Europe. Unfortunately, while these action scenes are very entertaining, while also presenting a thought provoking level of violence and gore, they feel meaningless. They are emotionless and have no setup or payoff; they just happen and the film does nothing to explain why they matter to our character's story. While I don't really have an issue with sacrificing historical accuracy for storytelling purposes, the action scenes are apparently very inaccurate.Perhaps the biggest failure of the film is its inability to commit to a central idea. This feels like a puzzling amalgamation, leaving me with two questions: is it a comedy poking fun at Napoleon and his marriage? Or is it a war movie exposing the carnage he created? None of these ideas are fully fleshed out and they don't seem to intersect in any way. Also, the film gives no explanation for why Napoleon is the way he is. There is no deep dive into his childhood or his psyche. The film presents him as just an insecure man with a lot of power, who yearns to be loved by his reluctant wife.Napoleon serves more as an accidental romcom and borderline parody than an epic war drama. There is hope for this film, as the four hour director's cut will be available on Apple TV+, which will hopefully resolve the theatrical cut's shortcomings, if anyone bothers to sit through it.",
    "101": "Set from 1793 through 1815 in France, the life of Napoleon Bonaparte (Joaquin Phoenix) is covered chronicling his rise to power from the chaos of the French Revolution and his relationship with Josephine (Vanessa Kirby).Napoleon is the latest film from director Ridley Scott and is a grand and audacious biopic chronicling the life and exploits of French historical figure Napoleon Bonaparte. Despite the importance of Napoleon in world history, outside of some isolated projects like 1970s Waterloo or the 2002 French miniseries Napoleon his life hasn't yet lent itself to a definitive filmed version with notable attempts by those such as Stanley Kubrick stonewalled due to various issues. Scott's take on Napoleon was announced in 2020 originally as a project for 20th Century Fox before instead being setup at Apple. With a multimillion-dollar budget, an Oscar winning lead, and a prestigious director tackling an important historical figure Napoleon is certainly a film that aspires for greatness (and awards) but unfortunately crumbles under a bevy of creative and stylistic choices that do a disservice to its central figure.If there's anything to be said about Napoleon, it's in the production design, costuming and battle scenes. From the chaotic scenes in the French Revolution to Napoleon's conquests across Europe you feel a sense of impact and weight in what's being shown and Scott certainly knows how to show it off. The period details are also to be commended with the recreation of 19th Century France well realized and the craft and construction of the cast's costumes can't be understated with Napoleon's wardrobe in particular rich in fine details that you can't help but be impressed by. Unfortunately on a story level Napoleon is a crushing disappointment. While Scott and writer David Scarpa are undeniably ambitious in attempting to recreate the entirety of Napoleon's life in cinematic form (with a longer 4 hour cut rumored to be coming to Apple TV in the near future), this results in the film feeling very unfocused and less like a character study and more like we're glimpsing the cliff notes of Napoleon's life rather than experiencing them or gaining an understanding of them in the larger context of what's going on. The movie does bring up significant historical events like the various stages of the French Revolution or Napoleon's Corsican heritage, but there's so little time spent developing those aspects the audience won't get the full impact unless they're already familiar with the historical context before hand as the movie often seems like it's expecting the audience to be familiar (to a point) with Napoleon's life while also taking frequent liberties with it. The movie also jumps around time at a rapid pace with years passing by in seconds and it really makes it feel like this material either should've been narrowed and focused or turned into a The Crown type TV series.On the acting side Joaquin Phoenix did not work for me as Napoleon. While I've seen Phoenix give some undeniably good performances in his career, his mumbly delivery, with a performance that almost feels comedic at points, and a look that just didn't match Napoleon never sucked me into thinking I was watching a character or the real Napoleon, but rather I was watching someone play a very expensive game of dress-up. Vanessa Kirby is maybe slightly better as Josephine, but she also feels hopelessly lost playing this role with the movie not really doing much to make her a multi-formed character or analyze her relationship with Napoleon and because the movie centers on this relationship between Napoleon and Josephine with these scenes often center stage it makes it known how repetitive and empty its take is on these historical figures and that's even discounting the glaring historical inaccuracies (which have no doubt dictated the less than enthused French reception). With the way Phoenix's portrayal of Napoleon is utilized and some of his lines you almost get the sense that Scott's maybe trying to make some sort of parallel between Napoleon and modern day so-called \"neo-populists\" like Donald Trump or Jair Bolsonaro, but even if that was the case the fact Scott had to bend, twist, and break the historical material to make that analogue shows how much that take doesn't work and it's a case of putting a square peg in a round hole.I was really disappointed with Napoleon while also admiring its scope, scale, and craft. If you remember 1970s and 80s historical TV miniseries, there was often a practice where they'd be heavily edited for feature films that would be distributed overseas and that's kind of what the movie feels like including the acting only with modern day actual film resources. Napoleon is a bad movie made in the best way possible, but you end up paying more attention to the craft rather than the actual content and substance (or lack thereof).",
    "102": "The rise and fa of French Emperor Napoleon Bonaparte, who's thirst for power led him to many victories and some significant losses.I struggle to associate any commonality with reviews that have called it slow and bum aching, it's a historical saga, if you have expectations of something different, you went to the wrong film.The epic I had hoped for from Ridley Scott, a great story, huge battle sequences, and a detailed exploration of Napoleon, and his complex relationship with Josephine. The perfect mix I thought, it never became overly sentimental or slushy, I thought he nailed it.Several scenes stood out in particular, for me the best of all was the battle of Austerlitz, the sheer audacity of the plan as well as the epic visuals, just phenomenal. Secondly, the siege on Moscow, again tremendous visuals, but the hollowness of the victory was cleverly executed, and of course, the battle of Waterloo, incredibly realised.The running time was spot on, I'm glad it didn't go on any longer, it felt like that right run time.I thought the production values were superb, incredibly sets, great battles, as well as amazing costumes.Joaquin Phoenix delivers an award winning performance, he is phenomenal, and brings the character to life, he's definitely someone who's conflicted, addicted to power and definitely love sick. Vanessa Kirby excellent as Josephine.Plenty of British talent on display to enjoy, the likes of Julian Rhind Tutt, Sorcha Cusack, Rupert Everett and the excellent Paul Rhys.Overall, well worth your time.8/10.",
    "103": "First of all I give it a 5 based solely on entertainment value. Historically, it's more like a 2. Regardless Hollywood is not where I go for historical accuracy so it does get somewhat of a pass. The movie was entertaining and did have interesting moments but it felt more mediocre than amazing.All that can be said is this movie was a wasted opportunity. The relationship between Napoleon and Josephine was inaccurate and bizarre. The battle scenes were ok at best and a huge disappointment at worse. Many of the battles look like they only involved a few hundred men and strangely always took place near encampments.The movie bit off more than it could chew. Napoleon's life is an epic drama so much so that they skipped entire campaigns and only included 5-10 minutes at best of others to make a 2.5 hour run time. This made the movie feel choppy and disconnected. It would have been better to have focused on only part of Napoleon's life and made sequels to cover the rest.Phoenix as Napoleon was a major disappointment or almost disaster. Perhaps this was Scott's fault but Phoenix failed on so many levels. The love scenes were weird and some of his lines bordered on silly (\"you think you are so great because you have boats!\"). This is especially bizarre considering much of the dialogue is historical record so there is little reason to deviate.Worst of all, the movie failed to convey why Napoleon was great. Why was Napoleon an exceptional battlefield commander? Why was all of Europe terrified of him? How could this man rally 17 year old farm boys to superhuman feats against overwhelming odds whenever they saw him on the battlefield? Why did France sacrifice well over a million men to their deaths and not only welcome him back from exile but give him a massive state funeral 20 years after his death and a place of honor in Paris to this day? Napoleon's life is almost so exceptional and astonishing that his story is too much for even great directors and actors to handle.Honestly if you want a much better and just as well made movie about Napoleon I highly recommend the A&E miniseries from 2002 called \"Napoleon.\" Far more accurate historically and in depth.",
    "104": "Napoleon has a lot going for it but also some stuff holding it back from greatness. Ridley Scott did a very good job directing here, with the battle scenes being some of the best ever put to screen. I especially loved the battle over the frozen water. That was really cool. The movie also captures France in that time period really well with the costumes and set design. The story does an ok job at telling the story of Napoleon's life but it doesn't feel like there's really enough there to understand who he is as a person. We needed some scenes that showed his upbringing and why he formed his ideologies. It's mostly about his political life and I didn't really have any strong feelings on him by the end. There were also multiple scenes where it felt like Napoleon was a joke and came across as kind of funny but I don't think they were supposed to come across that way. His character was kind of inconsistent. Joaquin Phoenix was ok in the role but he's had way better performances in movies like Gladiator, Her, and Joker. Vanessa Kirby as Josephine absolutely stole the show here. She was phenomenal as Josephine and I think she was the best part of the movie. Speaking of Josephine I actually really liked the romance part of the movie. I thought it was the most interesting part and I liked how the two communicated by letters. The script needed to add more depth to the characters and I feel like it would have been better suited as a tv mini series. There just wasn't enough time here to tell this story and do it justice. Overall it's an entertaining movie that has a lot of really great things in it but it's rushed script and inconsistent lead character hold it back. 6/10.",
    "105": "My feelings of this movie are very bad. I wanted to leave the movie theater because of a mix of rage and bordom .My problem was in the following. I think the main character is playing way to plant and boring I really wished. He has some charisma some fire but most of the time. He just felt like he's on antidepressants medicine.I really did not enjoy the way they did the movie when they just keep skipping forward in Napoleon's life it not really feel like we get to see any of his battles of what he did his life decisions. It's just felt like a highlight of the most interesting part but without the Deep of going into themAnd the choice they did with the colors are just horrible most of the time is just Gray and boring maybe if you're lucky, we are in the same delays of Egypt and its yellow it just it's supposed to be such a colorful time in Napoleon has the f** red colors and blue but it's just Gray most of the time. It's so sad to look at.Most of the time I just ask myself, what is this movie trying to do to make a sad story about Napoleon to show his most interesting battles to make an infused yet again relatable characters because to me none of it really worked on me most of the time. I just wanted to leave the theatre,",
    "106": "From the very opening scene, I realized something was wrong. We were in late 1700s France and a bunch of people were talking and yelling in a large hall. But I was confused. All the actors were speaking in a British-accented english. Was this London?And that was the beginning.From the great director that gave us Blade Runner, at the end, this flick turned out to be lukewarm. Nothing memorable.If you are into battle scenes, with attention to detail on weaponry of the time and tactics of warfare in the battlefield, with cavalry, infantrymen, artillery guns, then you would LOVE this film.But at the end, there seems to be very little to be told about the man and the time.By comparison, the 1970 film \"Patton\", directed by Franklin J. Schaffner, and written by Francis Ford Coppola, was a much better production and film, with a better outcome and feel for the story.",
    "107": "I read some reviews here on IMDb before seeing the movie and considered the various criticisms of the movie: it did not follow actual history closely enough, too much about Josephine in the script , etcetera , etcetera and I concluded that the people reviewing the film just did not get the movie they wanted. In other words they had preconceptions as did I. Ridley Scott, $200 million dollar budget, a credible stable of actors ; some big name talent at that AND the movie , about Napoleon, would be epic. I saw the trailers and thought the movie had to be good and looked forward to seeing it. I was, dear reader , dead wrong. The script is either rambling or worse ; incoherent such that one wonders whether the script and the pictures are from the same movie. The acting is wooden and the dialogue , as I note above , stilted. Look at my reviews , I don't give movies four stars if I bother to review them at all. Consider this one(review) a public service. This is what happens when big tech, namely Apple which has more money than it knows what to do with, throws money at a studio and director without actually considering how the finished product will turn out. Maybe much of the movie was generated by artificial intelligence, who knows? Human intelligence is in order here which requires that this movie die a quick death at the box office, I expect it will. What is epic here is how unredeemable this movie is.Apple should Stick to what it does know how to do and manufacture overpriced phones in authoritarian countries instead of green lighting a $200 million budget for a film ABOUT an authoritarian. Remember the movie, 'Less Than Zero' with Robert Downey Jr and James Spader ? This movie is , to paraphrase that title Worse Than Bad.",
    "108": "Not adventurous, not epic, not faithful to real history, very few battles and described in an imaginative and very hasty way and absolutely not corresponding to historical reality.Napoleon is silent and sulky throughout the film, even silly at times, too more silent.A very boring film, too many dialogues and silences, absurd if we consider all the events of that period.Even the images and photography are sad, all in blue/grey tones; i do save the costumes.It is just a sopa opera novel about the relationship between Napoleon and his wife.I left before the end of the film, which never happens to me.",
    "109": "Napoleon (2023)When Ridley Scott, one of my favorite directors, announced that he would be making a movie about one of history's most influential individuals, I was beyond excited. Despite seeing some negative reviews I marched into the cinema full of positivity but in the end, I walked out with a heavy degree of disappointment. I can understand a film having historical inaccuracies but here, it takes a back seat compared to the poor portrayal of the titular character and the choppy crash course nature this film decided to take.Napoleon was an educated military genius who has done monumental things in his life after rapidly advancing through military ranks. The first 40 minutes of the film felt like a poorly made PowerPoint presentation that skipped from one year to the next dedicating a couple of minutes to each life episode. By the time he got to Russia, the movie sort of stabilized its haphazard pacing by relying on excellent battle sequences to carry the weight.Josephine was an important part of his life and certainly deserved some screen time but was the film called Bonaparte family affairs? For some reason it was decided to cram Napoleon's entire life into 2.5 hours. However, instead of developing his personality or dedicating time to actually important events, it wasted time on dreary dialogues in gloomy French mansions and oinking under the table.Ironically, it's Vanessa Kirby who delivered an enjoyable performance and not Joaquin Phoenix who looked too slow and too old to play the Napoleon. He remained unchanged for decades of his life while having a constantly depressed look. Moreover, he was often made to look weak, stupid and out-of-touch instead of someone who set up order in France while garnering admiration and respect.Cinematography, costumes and battles were exceptional, as expected of Ridley Scott. Nevertheless, instead of displaying strategical prowess, it often felt like Napoleon was simply attending battles instead of passionately commanding them. It's as if 1 hour of the film was forcibly cut out by the studio interference... much like The Kingdom of Heaven, so I will be expecting the director's cut to fix some problems.Movieswithoutshmovies on Instagram for honest movie and TV reviews.",
    "110": "Napoleon has been a surprise hit, and how much ink has been spent on the film may be one reason for its success. Rarely in recent history has a film been so widely criticized for its historical inaccuracies. We didn't hear that kind of backlash for The Crown or Bridgerton, so why such disappointment in historic representation in this specific case?It seems like the backlash may be driven by a misunderstanding on the purpose of the film. Maybe it would have been served by being called \"An impression of Napoleon\" instead of \"Napoleon\" - but it doesn't quite have the same ring to it, does it? Be it as it may, when you take a character of the importance of Napoleon, it seems impossible to represent him fully or do him justice in a film, however long it may be! How do you then portray a historic character of this nature? When you think about it, our mental image of Napoleon is shaped by images in our heads, some picked from paintings, some from a broad understanding of his feats, like Austerlitz, and his errors, like his Russian campaign. Rather than strike at the truth -whatever that means- Ridley Scott's Napoleon tries to reach for the image of the character, representing in short scenes some of the main events of Napoleon's career, without trying to tie them together, and punctuating them instead with short scenes of his relationship with Josephine - not to tell a true story of their relationship either, but just to add humanity to the character, to varnish the images of his military feats with a human angle that only make the character bigger. The result feels almost like a slideshow, which I think is what ultimately frustrates some moviegoers and critics. But a very powerful one. One where the full grandeur of Napoleon as a leader comes through, not in the linearity of the story, but in the amalgamation of images crafted with extraordinary skill - the battle scenes alone are extraordinary.It's a really interesting and innovative way to film a historic character. Is it a masterpiece? Probably not. Is it one of the better films of Ridley Scott in a long time? Certainly.",
    "111": "Man, man, man... what a year for Joaquin Phoenix... \"Beau is Afraid\", despite him doing a great performance, is the most disappointing movie of the year for me, and Napoleon managed to be worse. As I'm not a historian, I won't analyze or criticize any historical inaccuracies here, only the film on its own.The beginning, where the film fastly tells the audience about the years of horror and the guillotine are genuinely good, the sound job is astonishing, and the battle scenes, from the start to the end, are absolutely epic. But unfortunately my praises about the movie end right now.Joaquin Phoenix is my favourite actor nowadays, but he's not good as Napoleon. I never saw a great leader on his performance, but a child in a soldier's body. He never passed any sense of grandiosity and leadership that his role requires. And Vanessa Kirby as Empress Josephine is disappointingly uninteresting. Napoleon's second wife (whose name I genuinely forgot) has only one scene and her only functions are marry him and give him his child. The main focus of the film is the romance between Napoleon and Josephine, and it's probably the most boring romance of the year, alongside with Foe.Ridley Scott's direction here is as childish as Joaquin's performance. The sex scenes are hilarious, this film has the stupid redemption scene I've ever seen in my life, and he seems to treat Napoleon's life like a big theater, like a big circus, where his protagonist is the clown. The cinematography is not bad essentially, but some filter choices would fit a lot better if the director was Wes Anderson. Actually, if the frames were more symmetrical, I could easily say that this was a Napoleon Bonapart satire directed by Wes Anderson, but it's not.Some people said this film is anti-France, which I strongly disagree, but a movie critic I watch said \"probably Ridley Scott used as the base for this story the kids version of the British Encyclopedia articles about Napoleon Bonaparte\". And honestly, it's hard to not believe. There are few things as disappointing as watching a 2h40min long biography about someone and feel you learned nothing about the person portrayed. I learned a lot about William Wallace watching Braveheart, I learned a lot about J. Robert Oppenheimer watching Oppenheimer, I even learned about Barbie watching Barbie!And to finish this review and completely bury this film, were we really in France? I watched Napoleon in a cinema with my uncle, and when we were leaving the session, a man in front of us said \"this movie could be in French\". He was absolutely correct, this was the most american France I've ever seen. France uses the metric system, nobody adopts a French accent, Napoleon is American and Josephine is British! And it's strange saying this as Ridley Scott 2 years ago directed a masterpiece called The Last Duel, that also takes place in France, but I never felt I was in America. Maybe these feelings in Napoleon happened because Great Britain is a character in the movie as well.I can't remember when was the last time a movie made me this sad. I think it was when I watched the previously mentioned \"Beau is Afraid\".",
    "112": "Given the negative reviews I was expecting something worse than this \"revision\" of Napoleon's history. True, many relevant events are ignored and some faked ones shown, like the bombing of the pyramids (why, oh why?) However, for those with even just a basic knowledge of the Napoleonic era it won't be difficult to follow the events, from the Toulon's siege, to the Empire and the victory of Austerlitz, up to the end with the Waterloo debacle and Saint Helen.What I found grating was the abysmal cast choice, with a total disregard to the real age of the main characters, starting with Napoleon, who was in his early twenties in Toulon and six years younger than Josephine. Did she ever look older than him? She always was, but in the movie she looks half his age. Barras, who was Josephine's lover before Napoleon, was more than 10 years older than Josephine, but in the movie he looks younger than both the Bonapartes. Robespierre died at 36, but in the movie he looks like an old man, Lord Wellington was in his mid-forties certainly not way over 60 like Everett, and so on...Besides being way too old for the part, Phoenix looks like he's sleepwalking throughout the movie, without a sparkle of the energy a young man would have had, and Napoleon certainly had. The whole love affar with Josephine was corny, their dialogues worth of a porn movie and their coupling almost grotesque.I would save the battle scenes, really impressive, especially Austerlitz (the battle didn't go exactly like that, but it was visually spectacular) and partially Waterloo, the setting and costumes were great, but that's the minimum to be expected from a seasoned professional like Scott.",
    "113": "Napoleon by Ridley Scott is a film about Napoleon Bonaparte, but it is a very fictional film, many sequences of the film do not correspond to historical reality. I didn't like the film because I would have preferred something much more historically faithful, not an almost fictional work.The cinematography of the film is spectacular but the battles depicted also did so they are very fictional.The film is very schizophrenic, it goes from one thing to another without ever delving into anything specific.A film about Napoleon(that is not the real historical Napoleon) that I honestly do not recommend.A film I don't recommend!!!!",
    "114": "Introduction:\nThe highly anticipated biopic from Sir Ridley Scott, starring Phoenix and Kirby and based on one of the greatest possible stories! The beginning of this picture is good - it looks decent and pretty dynamic. The story slightly jumps between different periods and locations, representing important characters and young Napoleon's unbelievably fast career progress (Hoakin Fenix is not so young, and it could be the elephant in the room for everyone who realizes that the protagonist was 24 during the siege of Toulon)During the initial act, the film adeptly handles the complexities of Napoleon's character, introducing pivotal moments like his relationship with Josephine or the importance of his Corsican family. However, as the plot unfolds, it becomes apparent that certain story aspects are overlooked.Plot and Historical Accuracy:\nIt's crucial to understand that historical narratives, even in natural history, have multiple interpretations, and the point that the film is not a documentary does not make life easier. Major creative decisions should be accurate, as they can affect historical and narrative aspects.The Italy campaign, a historic feat from Sardinia to Vienne, is absent, creating a narrative gap (Gargantua blackhole-sized gap). This oversight raises questions about how a general, whose latest shown actions included civilian casualties and desertion in Africa, suddenly becomes a national hero in the eyes of the people. Such transition from a zero to hero makes the protagonist's newfound status feeling unearned from the very beginning. The foundation of the story is broken.Character Motivation:\nThe second act extends into Napoleon's relationship with Josephine. However, the film takes a primitive turn by simplifying Napoleon's complex motivations as a mere result of a \"lack of mother's attention.\" This reductionist approach is to one of the most remarkable persons in history who proves it on the battlefield, in politics, and even in the kitchen! Such motives potentially fit the young protagonist, but the age gap between Joaquin Phoenix and the young Napoleon is glaring. Scorsese's CGI from The Irishman would have found a more helpful home here! Where's it when you need it?Cinematography and Visual Epic:\nRidley Scott's direction shines in the visual epic of the third act, personally for me, somehow reminiscent of \"Black Hawk Down.\" The spectacle raises the question of whether the film managed to maintain viewer interest in the story and characters leading up to this grand culmination. Looks like the director does not hide the priorities - he is here for epic battles and had enough historical French drama in \"The Last Duel.\"Conclusion:\nWhile Ridley Scott is undeniably one of cinema's great directors, choosing an English director for the Napoleon Bonaparte biopic might be comparable to assigning a film about Real Madrid to a director who is a fan of FC Barcelona. This joke comparison was inspired by the initial feedback from French critics. After all, a figure celebrated as a hero in one nation might not elicit the same sentiments universally.Second conclusion:\nIt Is NOT a CAKE!",
    "115": "I \"wanted\" to like this movie.I really did.I've been warned about the pacing issues tho.And well, they didn't lie.It doesn't matter if Scott wants to release a 4 hour version.You do not spend 200 MILLION on movie, working on it for years to then put in a wide-release in cinemas and not be content with your own product.He had no studio interference, no budget cuts, no last-minute rewrites, edits or recasts.Everything went exactly the way he wanted to do it.So why is this the final result?Hundreds of historical inaccuracies.He doesn't care for accuracy?That's ok, it's a movie, not a documentary.But what does he do with this \"creative freedom\"?Next to nothing.Hardly perceivable character arcs, atrocious pacing (seriously, it's absolutely all over the place) and lack of depth.What \"saves\" this movie to a 5/10 are Phoenix and especially Kirby, top notch technical filmmaking (not Scott's work tho but oh well) and interesting story adapted to begin with.But this could have been so much more.2023 really seems to be the year of the exciting, fresh, original and risk taking blockbusters, which all, ultimately, disappoint one way or the other.It's just sad, honestly.Even against the horrendous \"competition\" in the big budget market, all the Finchers, Scorceses and Scott's STILL, inexplicably, manage to underperform.We need new directors, new stories, new approaches, and new chances.They have run their luck.PS:\nThe weirdest aspect of all of this movie is the extremely underwhelming performing of nearly every single line spoken in the trailer.Really just, underwhelming.No other way to put it.",
    "116": "This evening I joined several others to watch Ridley Scott's new epic Napoleon. Being a well read student of Napoleonic history I have been looking forward to this for some time, although having seen one or two of the historical inaccuracies present in the trailer it did put me off, but I thought the battle scenes should be good. I was however wrong. Napoleon is a tawdry piece of effluence. The historical inaccuracies seen in the trailer are but a defecators flourish on the Mr Whippy style pile of excrement this film has become. Phoenix is plain terrible, unbelievable, childish... I thinking casting R2D2 in the role would have been more believable. The supporting cast, aside from Josephine, were instantly forgettable. Rupert Everett as Wellington was so uninspired and his one liners so full of cheese I swear he was sponsored by babybell. The score, script and acting made one think one was watching a channel 5 reconstruction of the life of Napoleon... this is probably doing them a disservice as even they of probably have read the lady bird book of Napoleons battles and perhaps had a game of Napoleon Total War before they committed pen to paper... Scott obviously thought such research was a waste of time and instead watched Black Panthers defence of Wakanda for practical tactical Napoleonic tips. Certain Waterloo bore more resemblance to some kind of trench warfare and was later inspired by Jar Jar Binx and the Gungans battle with the evil trade federation. In fact at one point I literally thought I was watching Monty Python's Batley Womensguild reenactment of the battle of pearl harbour. Suffice to say please, please, please don't watch this film if you have any interest in Napoleon or Napoleonic warfare. I don't know how much clearer I can be.Addendum: could Prussians please attack from the correct flank and perhaps acknowledge some other participators in the battle.",
    "117": "This film is simply made to try to destroy a historical, complex character, putting only the bad and accentuating it but forgetting everything that led him to be great.It lacks a script or a common thread, the trailer comes closer than the time wasted on a film without the slightest trace of history, only the lucubrations of its director (who could have dedicated the money of this film to do something with more quality).It is for the young audience with no knowledge of history who know nothing about Napoleon, to try to destroy the historical figure, in the same way that current movements judge without having the slightest idea of how the era worked, in which the characters are framed. And for that audience, the movie will become terribly boring. And for those who know history, the film will seem like a disgrace.A budget splurge one might expect from Jar Jar Abrams. It sounds sad, but Ridley Scott after this movie should think about retiring.The best are the battle scenes, of course, discounting the effect that the artillery in its effects seems more like something out of the artillery of the First World War than of the artillery of that time.But the battle scenes don't balance a lack of script and a negative respect for the character and historical fidelity. And Josephine, it's better not to talk about it, her function in the film is to remind us that we are seeing a yellow rubbish of zero historical value.",
    "118": "The movie felt very segmented and disjointed. Parts of the movie felt quite rushed and other parts were very drawn out. Did Phoenix hold back? I'm not sure. It felt like he did... that he was just reading from a script. Perhaps that was Napoleans demeanour. The American accents for the French characters was something I couldn't shake off.Also, not sure if was deliberate but in the initial scenes when Napoleon and Josephine are together, the music playing is the same as the music in the scene when Mr D'Arcy and Elizabeth Bennet declare their love for each other in the movie of Pride and Prejudice. I must be listening to too many soundtracks.The battle scenes were so graphic. I really do hope that no horses were injured in the filming... I'm trying to find online reports confirming the animals' safety but can't find anything.I think I read up on so much and watched so many reviews and interviews that I was expecting so much more.",
    "119": "I had such high hopes for this Movie. I high budget productions based around one of the most influential periods and person in world history. Sadly I was greatly disappointed.The movie is far to obsessed with the producing an heir part. Like no one wants to go watch a historical film that the first hour is just the MCs going at it. He didn't do this in Gladiator. That movie is a classic at this point...this one won't be.There was a massive lack of actual combat and war aspects. Scott talked up how modern technology would allow him to show Napoleon in action , where was it? Yes there are battles, but most of them had a small amount of screen time and no real planning or focus on the tactics that made Napoleon such a threat.Obviously if you have heard anything about this movie you already know it is not Historically accurate.Phoenix is a great actor and I generally like his works, but I felt like his personality was all over the place in this film. The age aspect was also strange. Napoleon is supposed to be in his 20s at the beginning and Phoenix just looks far to old to be passable.",
    "120": "Although it's impossible to do justice to the life of M Bonaparte in just over a couple of hours, Ridley Scott nevertheless has made a thoroughly enjoyable, satisfying piece of entertainment. It's ultra-light on history but a brilliant character study.Inevitably, by trying to cover Napoleon's whole life, you can't expect an in-depth historical look at one of the most significant 25 years in the history of the world. You're not even shown what earth-altering effects this one man had so when critics complain that this lacks history, they have a point. What it does do however is to beautifully capture the essence of Napoleon's character by focussing on his relationship with Josephine. That was one of history's most famous love stories but this is most definitely not a mushy sentimental love story but it's a love story nonetheless. A story of true love which develops between a flirty beautiful aristocrat and an ambitious soldier who was utterly hopeless with women. That's Ridley Scott's hook into this - how that genuine loving relationship affected our hero's attitudes, ambitions and destiny. \"I am nothing without you,\" he tells her and as we all know, when sadly without his muse towards the end, his world does fall apart.Joaquin Phoenix and Vanessa Kirby are both outstanding - they're not acting, they are Napoleon and Josephine and you can feel their joy and sadness as though hit were your own. As for the rest of the cast, it's difficult to say because they don't stay around long enough for you to notice. Dozens of important looking people with different big hats come and go but we don't find out why they're there and what they want. They're just walk-on cameos, for example horrible old King Louis XVIII appears for about ten seconds - Who's he? Where did he come from? Who put him in charge? But other than making this a ten part TV show or focussing on just one event, what else could Mr Scott do.Although historically shallow it is visually stunning, it holds your attention completely but if you're looking for explanations for why he was at war with this person and that person you'll be disappointed. It's also a little disappointing that the film's epitaph is the horrendous death toll associated with his reign rather than mentioning some of the good things he did. We learn nothing about his achievements, we learn nothing about how he rescued France from oblivion, his education reforms, law reforms, the invention of canned food or indeed clipping the wings of them pesky Habsburgs. Like Josephine's symbolic hairstyle and 'choker' she wears at the beginning, all these things are hinted at but they're not really part of this story. Scott lets us fill in the gaps so it helps if you know a bit of background. For example we see him in Cairo but not that he's there for 3 years effectively ruling the place and introducing street lighting and building sewerage and running water systems. But other than making this a twenty part TV show, what else could Mr Scott do.As spectacular as the bathe scenes are, they're just incidental; this is the story of a man. But you're not going to find out too much here about the character of the enigmatic M. Bonaparte and why he was so driven. Maybe it's because he was so enigmatic that it's impossible to figure out what did make him tick but this does at least give you a flavour of him and that actually makes whets your appetite to know more.",
    "121": "I went in wanting and expecting to like it but came out thinking it was a disjointed mess.I did like Joaquin Phoenix and Vanessa Kirby as Napoleon and Josephine, and the battle scenes, although sparse and lacking context, were visually impressive. Regrettably, this is where the luminosity of the film dims. The rest of the cast is never given an opportunity to perform or bring their characters to life. Most are not even mentioned by name in the dialogue. For example, Arthur Wellesley, the Duke of Wellington and the man who brought Napoleon to heel at the Battle of Waterloo, is introduced at the beginning of Act 3 with an on-screen title card-very lazy storytelling.The film vacillates between the intimate drama of Napoleon's tumultuous marriage and abrupt, though strikingly vivid, battle sequences. Yet it fails to stitch these disparate scenes into a coherent narrative. It never delves into any of the social reforms or policies that Napoleon implemented and reshaped Europe, nor does it explain the sociopolitical causes behind the battle scenes. Furthermore, it fails to show what a brilliant and charismatic leader Napoleon was or to justify why his troops were so loyal to him.The film also completely glosses over his time spent on the island of Elba. In fact, if you're not familiar with Napoleon's history, you might not even recognize that sequence of events and why his troops rallied around him to help him regain power. It was all very strange and bordered on incoherent, as if Scott, burdened by the runtime, chose to excise the soul of the story, leaving only the skeleton of historical events.The production value is great-the sets and costumes looked amazing and, despite lacking context, the battle scenes were well-shot and looked great on the big screen.Ridley Scott has mentioned in interviews that he has a 4-hour director's cut that will be released when the film goes to streaming. I'm hoping the additional runtime adds the much-needed historical context about the sociopolitical environment in Europe at the time and doesn't just pad out the runtime with more marital drama.◼TL;DR: Despite being visually impressive and the strength of its two leads, Napoleon is a jumbled mess of a story that borders on the incoherent.6.5 out of 10.",
    "122": "Napoleon is like GREATEST FILM EVERThere's this director Diddly Squat who is like MORAL LEADER OF THE UNIVERSE who takes Napoleon DOWN!So this French guy you think is somebody is really NOBODY! Who knew??And when he does Josephine from behind, thought I was gonna cry! I was like, \"This is so REAL!\"Turns out this Napoleon nobody was really BAD GUY cause if he not born there be no war and NO ONE get killed!I worships at feet of this great director man for being GUIDING LIGHT of our time!-\nAbove is literally the mindset of the filmmakers. This is the message they sent. Worst part is they actually thought they were being clever in creating this sort of drivel. This is a film that will not age well as it rings so hollow and its true intent will become even more obvious.",
    "123": "I know a lot of people will be wondering what a Stanley Kubrick version of \"Napoleon\" would be like. I suspect it wouldn't be a mumbling dead-eyed Joaquin Phoenix in the role.I've never liked Joaquin. Overrated sulker who thinks acting is being odd...all...the...time.Here, he is finally exposed as a very limited guy. He lacks the charm which would make the audience root for him. Instead, I found myself wanting him to be cuckholded. He is the lesser choice in all aspects.You also learn nothing new about any of the history behind his drive to conquer. Nothing. Not even a short joke in there somewhere.So, here we are with Ridley Scott's autumn years (I would say winter at this point) ambling around Europe confused as to what made him great to begin with. This isn't it.This is a vapid, dull paint by numbers depiction of something that could've been more epic. And that is what is most frustrating.A meandering movie.",
    "124": "It's got the budget, the cast, the set... And then it falls flat on its face. What a waste!The script and Ridley Scott as director are probably the first to blame. The script is neither here or there. With a 2.5 hour run time, the script tries to be a bit of everything and it delivers on nothing. I'm not even looking for a historically correct story, but at least give me 'a story'. Does the script takes you through the rise and fall with napoleon in his storied life? Nope. Does the script deliver on war tactics, war action, or political strategy? Nope. How about love story between Napolean and Josephine? No. At least shed some lights on Napolean's personality and what drives him through his career? Nada. There isn't a story, at all. Instead you get glimpses of his life's major milestones in fast forward.And boy oh boy, despite the strong cast, you get some really poor acting in this movie. This is, by far, the worst performance by Phoenix I've ever watched. He's primarily 'wooden' in the entire movie start to finish. It's almost as if he sleep-walks through the entire movie. There's absolutely no way you actually connect with Napolean's character at all. Kirby's Josephine isn't much better. Most of the movie you really can't understand why she acts the way she does, if she actually has feelings for Napolean, and/or when or why.All in all, a total disaster of a movie. I gave it 5 stars because the set is amazing. Lots of attention to details with costume and set. And it's also great in 2023 someone still makes a movie of a historical figure.But really, even if this was a free movie on Apple TV, I'm not sure it's worth the 2.5 hours for free.",
    "125": "Well, I was waiting for this movie for years, the History of Napoleon was, is and will be one of my favorites, along with the great historic Conquerors of this Earth, like Alexander, Cesar, Janghis Chan, Tamerlan...\nWe all remember Alexander the movie, how pathetic it was. Now came this movie to erase that and be placed among the worst historical, biographic movies of all time.Italy was surrender without fight... OMG those battles in Italy gave him the title of the best strategists of his time. Why????The battle scenes were also pathetic, without any sign of truth in it. For some 15 minutes I fell asleep and missed a good chunk of boredom. Lucky me\nWhoever wrote it, has even bothered to read a sum of Napoleon Story. In You Tube there are documentaries that been given in great detail of this story, why you American Hollywood writer did this rewrite and destroyed it?Don't waste your time, this kind of movie is better to avoid, just in case for someone will think to make such movies twice, for the sake of the rest of us.A big NO, NO, NO.",
    "126": "I'm a huge Ridley Scott fan. His world building skill, whether it's historical or sci fi, always impressed me and leaves me enthralled. This movie just did not hit the spot. It reminded me of Killers of the Flower Moon. Terrible editing, cutting, and scene organization. And way too forced. Both movies tried to shove things in your face instead of just SHOWING you. And both movies suffered from the fault of having unreliable narrators. The narrator is the most powerful weapon in a movie, if the movie does choose to have a narrator. Why is Josephine the narrator? Why did they choose to create and frame her character as highly unlikeable, with that smug grin on her face that can't help but make you dislike her? And then you choose to give that character all of the power in the movie. That's why this movie should have been called Josephine. Also, this movie portrayed Napoleon as an intellectual dummy, and never really captured his tactical excellence as a military general. The battle scene of Austerlitz was one of the worst choices I have ever seen. That was Napoleon's masterpiece and I was stuck watching slow motion freeze frames of soldiers and horses drowning in the water. Gosh, there's so much more I could say about what went wrong with this movie but I'll just cut it here.",
    "127": "I am furious. The only two stars go for the Josephine who was the highlight of the movie. But unfortunately, the movie was way too centered on her and her romance with Napoleon.So much time wasted on their love life, when the focus should have been on his genius mind, his amazing war strategies and his love for France.The public needs to understand that the French saw Napoleon (and some still do today) as providential, just like Jeanne d'Arc. He saved France, rose her to the rank of #1 in the world. The French Empire ruled half of Europe and everybody feared him. The French adored him. None of this is shown in the movie.I only see this movie as yet-another hollywood movie trying to minimize France's time of glory and digging her deeper into her time of tragedy.",
    "128": "I had heard and read from many different sources that this film was bad and historically inaccurate, but I told myself that at least I would watch it with a pinch of salt and really concentrate on the good stuff. Sadly, this film even managed to underperform my minimum expectations.First, this film is a complete and utter nonsense: the conversations are extremely unreal, dull and theatrical, and the acting is so bad that the only theory I could come up with is that it was purposefully done so. The battles are so badly done on multiple levels that I don't even know where to start. Basically, Napoleon only says \"fire,\" then you see a few cannon shots, and then he wins. This was used to the point where, in the Egyptian campaign, we only see him making one cannon shot that lands on the Pyramid, and that's all! The other embarrassing thing was seeing him lead cavalry charges. The only somewhat enjoyable battle scene is the Battle of Toulon, after that, it's downhill.Second, Napoleon is a caricature of himself. To make it clear, I understand that they wanted him to be characterized as the bad guy, but for god's sake, make a movie like Downfall and don't let a 4-year-old write your script for a 400 million dollar budget. Mommy tells Napoleon to go in his room and screw the girl that Mommy put in his bed. Seriously, that's the level we are talking about here. Why didn't they make him wear a collar and give Josephine a domina outfit? At least that would have been honest. This film is a propaganda, and a really stupid one.",
    "129": "Ridley Scott has made some undeniable masterpieces, but also a lot of films I consider to be total misfires in almost every way. But worse than that he's made a lot of films that fall into complete middle of the road territory in all the worst ways and that's unfortunately where Napoleon lands for me. For a director like Ridley Scott who can do scale like no one else matched with Joaquin Phoenix, one of the best actors on the planet, in the lead role should've amounted to much than it ultimately did.But to mention the positives first, the battle scenes are absolutely incredible. The best thing I can say about them is that I was constantly excited for the next one because of just how well Scott executed them from almost the opening scenes. There's just a sense of brutality and epic scope that we don't see enough in blockbuster cinemas nowadays throughout this entire film that I was just constantly in awe at how well Scott pulled off these scenes. The film managed to go up in quality massively for me in the 3rd act for me because of how incredible I thought the Battle of Waterloo was pulled of on screen and left me with a good after taste that stopped this movie from being a total miss for me.It's so great to see Joaquin Phoenix in another Ridley Scott movie after how amazing he was in Gladiator and it's no surprise he's great here. Vanessa Kirby is also his equal almost stealing the entire movie from him. But more often than not they were great in spite of the material they were given rather than because of it. The editing and pace is just is just so scattershot and without any sort of perspective on these fascinating events that the entire experience just feels hollow. I don't really think Scott took the time to build up the foundation of this relationship and as a result I was never 100% on board with it. It felt like the point was to make this a toxic match but instead it just felt sloppy written as does the entire film.The script crams decades of history into a 2 and a half hour runtime and not only does it feel messy but also totally without depth. As incredible as the battle scenes are, Scott never takes the time to build up to them so there's a repeated lack of stakes. Almost all of the historical context feels brushed over and I was just so consistently confused as to character motivations that I just didn't care what was happening on screen. Almost every time it feels like the script is developing an interesting sequence it just abruptly ends and moves on to the next one before it has a chance to have any impact. It doesn't really feel like there was much of an attempt to tell this story from a unique perspective and it just feels like a vague rundown of true events that were probably a lot more interesting in real life.Napoleon represents Ridley Scott as a filmmaker at his worst. It's not the worst film he's ever made but it falls so totally into the aggressively mediocre category of his career and in some ways that's much worse. Phoenix and Kirby give it their all but their talents are wasted on a shallow script that gives them nothing to work with. I appreciated the experience of seeing a movie like this on a big screen but I was just so frustrated that it was no where near as good as it could've, and really should've, been.",
    "130": "The best film critics capture the zeitgeist in what they write, so when Rex Reed completely obliterates this film in his review, he's expressing the soul of educated public opinion. And the public, contrary to what some may think, are overall more perceptive and astute now than ever in judging the quality of a theatrically released film, exactly because of the inundation of content in streaming platforms, which give abundant examples of how not to make a compelling film. Theatrical releases must meet higher standards, which is why the myriad ways in which this film fails are genuinely astounding. Choosing a 49-year-old brooding actor to play a 24-year-old enterprising artillery officer is alone one of the dumbest decisions ever made by a creator in any medium. But good acting still could have salvaged the role, and Joaquin Phoenix's acting in this picture is the opposite of good acting. His wheezing during the Battle of Toulon, creepy stare at Josephine, creepier stare at a mummy, porcine grunting, and comatose sleepwalking during the Battles of Austerlitz and Waterloo are not only completely off character in contrast to the man Napoleon Bonaparte really was, but they also actively damage the film's continuity and quality, of which there are hardly any, thanks to David Scarpa's utterly turgid, piece-of-trash script.",
    "131": "Of course the ads made this movie look like it would be about Napoleon's battles - proving they knew what we really wanted.But also in the ads, were the couple quick glimpses of a woman.Exact conversation...\nMy buddy: \"That new Napoleon looks good!\"\nMe: \"Yeah, but they hinted at a love interest. I hope the whole thing isn't about him and a chick.\"\nMy buddy: \"Yeah, that would suck.\"Fast forward to reading the reviews, and whether positive or negative, they all confirm the majority of 'a story about Napoleon' - REVOLVES AROUND A CHICK.Because whenever you study Napoleon, Lord know it's all about the chick he was nailing.Hollywood sucks.Girl world sucks.I'm done.",
    "132": "Ridley Scott had a gold mine with this movie. He picked one of the most dense and interesting periods in history, and he chose to make a movie about an awkward love story.Napoleon was a military genius, an incredible politician, an enigma, a man of culture, flawed, but overall a very interesting man. And yes he was awkward around women and was cuckolded. He won over 60 battles and passed laws that are still in place to day. He pretty much ended the feudal period in Europe. He truly loved one of the most interesting plots for a movie ever.What part of his life does this movie choose to focus on? His cuckolding by his wife, and the fact that he was bad in bed. The worst, least interesting part of the Napoleonic period.70% of the movie is me just waiting for this awkward version of Marriage Story to show a 5 minute battle scene.I am not a historical accuracy nazi either, but this movie was doomed to be a boring snooze fest from the moment the script was finished. The Joséphine Napoleon love story is not sexy, interesting or even exciting. It is just awkward and uncomfortable.This has to be Ridley Scott's worst movie. He should be ashamed, any fan of Napoleonic history please save your money and let this movie flop. Ridley Scott should retire.",
    "133": "Okay, so maaaybe this film isn't a documentary. Maybe it's not one hundred percent on the factual side.But is it rock solid in entertainment?Is it epic and grand in scale and scope?Oui, oui, and oui.This is a love letter to movies that very few directors in this day and age could pull off, nor would they even attempt such a story.And at its big heart it's a love story.Cringe, I know for some.But here it is quite beautiful and well in place.It serves the story and gives it that punch.Men have fought battles and wars have been started for far less.It may not have been Josephine's face that launched a thousand ships but you feel it here all the same.Vanessa Kirby is stunning.Joaquin Phoenix is amazing as always.What other actor in his generation could pull off Johnny Cash, The Joker and now, convincingly, Napoleon?None!Until now maybe the best Napoleons in film were in Time Bandits and Bill and Ted's.Be grateful there are movies still being made like this in 2023.It's not Marvel, or Barbie or Fast XX.It's Napoleon.And it's out of sight!",
    "134": "Napoleon is a film that traces his career from the 1st significant battle that made him noticed, until his exile and death. It also covers his relationship with Josephine, with times of love, separation, and infidelity. At over 2-1/2 hours, it seems long, but in viewing, it seems to be an attempt at an Epic, but very rushed, as various characters seem to cameo and disappear. One example is Josephine's daughter, who seemed to appear out of nowhere, whrn Josephine was supposed to be infertile. I expect a longer Director's Cut would make more sense - either with an intermission, or in 2 or 3 Parts.A lot of the life of Napoleon can be easily researched, but it seems that Ridley Scott bent history to suit his idea of drama, and not logically. At the battle of Waterloo, Napoleon's cannons could hit the jumping-off point of Wellington's troops and beyond, but when the English troops marched forward in tight formations, the cannons were silent. All this drove me to look on the internet, which is not likely Scott's intention.I saw this in 70 mm, and some battle scenes would have benefitted from seeing an IMAX screening, but this film is destined for streaming, which appears to be a waste.",
    "135": "The title of my review refers to what the creator has done in \"Napoleon\", of course.Coming from such an acclaimed director as Ridley Scott and, therefore, so highly anticipated, it is a real shame that the film came out as a load of cringeworthy garbage. The fact that it contains so many historical inaccuracies is hardly its biggest problem. The issue is that the plot is silly and incoherent, with hardly a storyline, just relatively disjointed episodes, while the directing is boring, with zero psychological or emotional depth. Almost like reading Cliff Notes of Napoleon's biography with multiple pages torn out. So you are left dumbfounded as to why the creators have taken so many liberties with history, if what they replaced it with hardly made for a superior story that one could follow and watch. I mean, \"Braveheart\" was similarly historically inaccurate movie, but it had a story and character development viewers could relate to. None of that here.Much of the time is spent on covering Napoleon's relationship with Josephine. And I am not really going to take issue with the creators' main guiding thought: that all of Napoleon's actions that shaped the course of world history, were driven by what was happening in his relationship with Josephine. I'd be ready to cut some slack for poetic license in that regard, but this relationship in the movie comes out completely vapid and insipid, interspersed with sexual episodes of embarrassingly pointless nature, I mean some really buffoonish and cringey stuff. Josephine is depicted as an aloof emotionless woman, without any of the charm and intelligence the historical character was famous for. So one is left scratching his head why would anyone, let alone Napoleon, become obsessed with her, let alone find her as the source of inspiration for his deeds. If this film has been made as a drama about a complex and tortured love relationship, it fails at it miserably. I have read that the additional features in the longer 4-hour version of \"Napoleon\" will be mainly about the his relationship with Josephine. If so, I am glad I have seen the shorter version.It also fails as a historical epic and narrative. Beyond Napoleon and Josephine, all characters are presented in such a cursory way, that you can hardly distinguish one from another. And despite the generous accompanying captions, explaining when and where things take place, you can hardly follow what is happening to the bigger picture, even if you are familiar with the history and the personalities of the Napoleonic era.In true Ridley Scott fashion, the movie is rich visually. The battle scenes are reasonably well made, but are of limited length and consequence, lack dramatic climax, and are rife with unnecessary inaccuracies. So, as good as the visual effects are, they do not redeem the movie. The storming of Toulon and the battle of Waterloo looked pretty well, but the way the movie shows Austerlitz, the Egyptian campaign, and the invasion of Russia and Moscow is downright stupid, with some more really cringey and unjustifiably ahistorical stuff there. I mean, how hard was it to build a set that showed Moscow the way it really looked, given that many of its notable buildings remain intact and given how many depictions of the city at that time there are? No, the film's creators decide to spend lots of time and money to create some screamingly fake fantasyland instead.So, I am giving this movie three points for the visual spectacle that it is, plus the outstanding performance by Joaquin Phoenix. But both are completely overshadowed by the poorly written plot and wooden directing. If you are a Napoleonic Wars history buff, save yourself the trouble of watching this movie, and wait till battle scene clips from it appear on YouTube. You will thank me for this advice.",
    "136": "When i first heard about Ridley Scott making a Napoleon movie with Joaquin Phoenix as lead actor, i was very excited. Little that i knew that this movie would not match the expectations set. First of all i would like to state that i didn't expect an historically accurate movie given the fact that it is not Ridley Scott strongest suite (see Kingdom of Heaven). There is a small measure of truth in all of his movies but they are not built as a documentary and they are not intended to be one. Nevertheless, this movie doesn't even come close to the vibe given by Kingdom of Heaven or other historical movies, from an historical point of view. I always look for a particular type of energy in movies, especially in historical ones but Napoleon in my opinion fails to deliver. This movie tries to much to contain all peculiarities of Napoleon's life but fails miserably. We see all and nothing. The feeling that i got was that we saw a fast forward version of his life but without any soul or essence. Even the battle scenes seemed dull and without soul. I think Ridley set the bar too high through his previous movies for this part. Regarding Joaquin's performance, there is not much to say. I think his interpretation was similar to a performance you would see in a stage theater. I don't know why but at some points in the movie, it felt like a low budget movie with very poor writing and very poor dialogue. I will wait for the extended version to see if my opinion changes for the best.",
    "137": "Director Ridley Scott's ambitious foray into the tumultuous life of Napoleon Bonaparte unfolds on the big screen, but unfortunately, \"Napoleon\" falls prey to a plethora of historical inaccuracies and an apparent penchant for propaganda that distorts the true essence of the historical figure.Scott, known for his visually stunning films, spares no expense in recreating the grandeur of the Napoleonic era. The costumes, set designs, and cinematography are undeniably captivating, transporting the audience back to a time of epic battles and political intrigue. However, beneath the glossy exterior lies a narrative rife with deviations from historical reality, seemingly tailored to fit Scott's own interpretation.One of the glaring issues with the film is the blatant manipulation of historical events to suit a specific narrative. Scott, in an attempt to create a more compelling story, takes creative liberties that border on the absurd. Battles are exaggerated, alliances are forged where they never existed, and pivotal moments in Napoleon's life are twisted to evoke a particular emotional response from the audience. While cinematic dramatization is expected, the extent to which Scott strays from historical accuracy raises questions about the integrity of the narrative.Moreover, the film seems to revel in portraying Napoleon in a more sympathetic light than history might warrant. The complexities of his character, including his dictatorial tendencies and controversial decisions, are downplayed or omitted entirely. This selective portrayal paints a one-dimensional picture of Napoleon, sanitizing his flaws for the sake of a more palatable hero.The script, penned by a team that appears to prioritize drama over historical fidelity, contributes to the film's descent into propaganda. Scott's Napoleon is portrayed as a visionary leader facing insurmountable odds, battling enemies both external and internal, with little regard for the nuanced political landscape of the time. This oversimplification not only does a disservice to the historical record but also undermines the intelligence of the audience.Despite its stunning visuals and a commendable effort in recreating the era, \"Napoleon\" ultimately falls short of delivering an authentic portrayal of one of history's most complex figures. Ridley Scott's propensity for narrative manipulation and historical revisionism diminishes the film's credibility, leaving audiences with an entertaining yet distorted version of Napoleon's legacy. For those seeking a more accurate and nuanced understanding of the French emperor, \"Napoleon\" may leave them yearning for a film that stays truer to the pages of history.",
    "138": "The new Epic Motion Picture NAPOLEON is the perfect example of the term \"the whole does not equal the sum of the parts\". There are some very, very good items in this film, they just don't combine to make a Motion Picture above the average.Directed by Ridley Scott (GLADIATOR), NAPOLEON tells the tale of the titular Frenchman who rises to great power only to fall to great defeat. It is a story ripe for a fascinating film, this just isn't that film.There are many, many things that work in this movie, like the performance of Oscar Winner Joaquin Phoenix (THE JOKER) as Napoleon. He plays him as an enigmatic figure who is over-compensating for a lack of...something. Bravery? Self-Confidence? Height? That's the problem, the film never delves into it, it just gives us a quirky character - strongly played by Phoenix - who is, obviously, using his power and skills as a General to cover up a flaw...whatever that is.Vanessa Kirby (Oscar Nominated for PIECES OF A WOMAN a few years back) is equally strong and enigmatic as Napoleon's Empress, Josephine. Kirby's performance is, probably, the strongest in the film as she plays Josephine as strong and independent, living by her own rules and knowing that she has the powerful Napoleon at her beck-and-call. But, again, we never really find out the person behind the facade and her scenes with Phoenix/Napoleon fall flat for there never is any really love or passion between the 2 of them, just a \"baby boy\" fawning all over Josephine and a manipulative (we think) social climber using this \"baby boy\".4x Oscar Nominee (but never a winner) Ridley Scott (GLADIATOR) knows how to produce an EPIC and he puts together some EPIC Battle Scenes and Napoleon's Emperor Inauguration scene is one to behold (which is why you should see this film on the largest screen possible) but these scenes seem isolated and separated from the rest of the film.And, there, is where the problem of the film is. We have an interesting performance by Phoenix, a strong performance by Kirby and EPIC scenes from Scott, but they all seem isolated and in their own film and never quite gel together to build any emotional connection. All seem cold, flat and calculated. There is none of the passion that Napoleon says he has for France.Go to marvel at the craft of the film, leave feeling unfulfilled, emotionally by NAPOLEON.Letter Grade: B-6 Stars (out of 10) and you can take that to the Bank(ofMarquis)",
    "139": "I would have to say that this film might be best for people who know nothing about Napoleon. Not for the liberties it takes (and those are myriad in the film), but that it is so methodical in its presentation. Starting with the narrative subtitles, explaining in broad strokes the French Revolution and identifying major players, the audience is already being told not to overly worry about subtext. And it becomes clear early on, that the intention is not to humanize Napoleon, as much as de-mythologize him, to the extent of humiliation.What is most noticeable, as might be expected in a Ridley Scott film, is that the plodding progression is nothing more than pacing for the battle set pieces. Which, while elaborate, are not entirely convincing (particularly the naval ones). Scott has claimed no CGI was used, but only VFX, but to me it still looks more like a video game than authentic.But the biggest negative has to be the attempt at a dramatic counter to the military engagements, in the love story. Certainly an integral part of this man's story, it is undermined by the fact that, despite numerous incidents of overwrought acting in their scenes together, Joaquin Phoenix and Vanessa Kirby demonstrate zero chemistry. Zero. Quite an obstacle when the thrust of the relationship is the struggle between passion and duty.Not an uninteresting film by any means. I have to say that I was engaged most of the time. Just not always for the right reasons. First of all, there are as many unintentionally funny moments as there are intentional ones. And interestingly, perhaps midway through the film, I started noticing a Kubrick-esque style of light/dark lighting of scenes, a la 'Barry Lyndon'. Nothing more to add to that, just to say that as the mind wandered from the plot, I inadvertently found technical points of interest.",
    "140": "It was a director's take on Napoleon who chose to pick the main theme of the movie the relationship between Napoleon and his wife. A weird, awkward relationship that took most of the film and was not the best choice at all.Also I think the actor that was cast for Napoleon did not fit with the real historical character.Before seeing this movie I saw a quote by Ridley Scott something like \"If you weren't there shut up, it's like I say it is\". That pretty much sums up the entire movie. Might as well been a movie about elves with a great leader Napoleon taking on other elves from various kingdoms, told by Ridley Scott with some weird and short resemblances with real history and an obsessive focus on his relationship at home, that did not do much for the rest of the movie.As a side note I think the movie not only did not make the French look great but made the English look great. The life and accomplishments of Napoleon, his unification of France and revolutionary laws and all that did not matter at all for the director. Overall the family problems of Napoleon seemed much more important than his career.I also have a lot of doubts about the way most characters behave in the movie as I really don't think people behaved like that in the 18th century, but hey, I wasn't there and Ridley Scott apparently was.",
    "141": "Pretty chaotic start, thought it was going to be a thrilling 2hrs40min ahead of me. I liked how Napoleon carried himself; it seemed believable, portraying him as still human, not entirely depicted as a mythical great man. The heavy breathing and nerves before the big fight, his emotional turmoil.However, the start felt rushed, swiftly moving on from key events, which seemed to be the overarching theme of the movie. The numerous little time jumps made it feel like a highlight reel; there was no substantial time to truly sit with any scene for a huge chunk of the movie. The scarcity of heavy dialogue reminded me of a Denis Villeneuve film too.It was surprising to see Napoleon portrayed as a \"simp\"; made me think, \"If Napoleon was a simp, why can't I be?\" lol. I thought the story was gonna to focus on Napoleon's conquests, but it revolved more around his love life. The movie was less about him and more about him and his wife, with much of their relationship based on speculation. Unfortunately, despite the actors' talent pedigree and efforts, Joaquin Phoenix and Vanessa Kirby, there was no spark or chemistry between them.The film lacked a coherent direction or central focus, making it challenging to identify its main point. You could essentially learn the story by skimming through a high school history textbook, skipping chapters even, as the movie didn't delve deep into anything. It felt surface-level and not very engaging, lacking character motivations and making it hard to invest in the characters, even someone as intriguing as Napoleon.While the battle sequences were great and grand in scale, the impressive costumes and sets didn't feel exceptional considering numerous movies set in the same time period managed to depict it well.I went in with high expectations, hoping for something close to \"Oppenheimer,\" but unfortunately, this movie fell far short. It felt overly long yet rushed due to the quick progression of events, resulting in a shallow portrayal of Napoleon's story, felt more like bullet points, and primarily focusing on him and his wife, who lacked chemistry or interest. Napoleon's story has enough depth to make a movie of him interesting, but this ended up pretty lifeless.",
    "142": "Hey look I love Ridley Scott and Phoenix, but despite my appetite to make fun of the French people Napoleon is my favorite historical figure so this was my dream movie. But unfortunately it came and went. I want to give this movie 2 stars but I have to give credit where credit is due.That credit is in the cinematography: Scott's ability to direct epics is still incredible, and the production value for this movie is incredible. But that's about it. The acting was good but a little disappointing.The movie sins come about the portrayal of Napoleon. It feels like English propaganda again the way Napoleon is portrayed as an angry cuck rather than who he really is. They might as well have made him four feet tall. The difference between this and other movies with questionable historical fact-checking is the message. The Patriot, Braveheart and Scott's own Gladiator all had notable historical inaccuracies, but those were forgiven because each of those movies was still able to capture the spirit of their subject. The Patriot was still an inspiring patriotic film that captured the feelings of Americans during their war for independence; Braveheart still captured who William Wallace was and what he meant to Scotland; and while Gladiator's tale was completely fictitious the real life characters used in the movie were still portrayed accurately. That can't be said for Napoleon. It didn't capture the spirit of the French Revolution, the intensity of the Napoleonic Wars, or Napoleon himself.",
    "143": "Okay so this was one of my most anticipated movies of the year, so it frustrates me to say that Napoleon is my biggest disappointment 2023.I watched the film on the biggest IMAX screen in the world, in Leonberg, Germany.The scale is massive, the set-pieces are unprecedented, all the designs are great, Dariusz Wolski's cinematography is sublime, the score is exquisite and of course Ridley Scott exactly knows how to direct big scale kabooms (the battle on the ice is fantastic). But what does it have to say that's actually interesting? Having one of the all time greats Joaquin Pheonix play a notorious general as a bit of an idiot and seeing Vanessa Kirby shine is enjoyable, but at least half of the movie feel lifeless and bland. Never obtaining a feel of Napoleon as a character or, more significantly, his leadership skills.I'm sure the 4 hour cut is much better, but for now it's an unfocused, random, zero build up picture with moderate payoff.To give an example for the messy structure: Napoleon meets Zar Alexander I. They share drinks, talk about their mutual hatred for great britain and how they are going to be brothers. Then cut to an unrelated scene and directly after that Napoleon reads a letter -my dearest Josephine, the Russian dude stabbed me in the back, I'm going off to conquer him-. I could literally sense the frowning in my theater. Napoleon meets Josephine; next scene: -I cannot live without you-. There's simply no time to grow those feelings, making it feel organic. No chance for the audience to get emotionally hooked on the story thanks to that unfocused scene flow.Ridley Scott's (theatrical) Napoleon sadly is an emotionless juggernaut that uses its monumental battle sequences to hide the fact that it's a complete misfire in its attempt to explore anything personal between Napoleon and Josephine.5,5/10.",
    "144": "This was one of my most expected movies of the year, I really like history and Im specially fascinated by the story of Napoleon, so I was very excited for this. I kinda doubted Phoenix was a good choice for napoleon, given that napoleon accomplished all he is remembered for at a very young age but I accepted it and thought it was to have just a good actor, but not even that was achieved with this movie. I can say, I HATE this movie, it portrays Napoleon as a stupid horny teen, all the movie is you watching Napoleon lust over his first wife Josefine, thats all. The only battle you see is the battle of Waterloo, his very last battle before being exiled. But before that nothing, you barely see any of his doing in Europe, theres no politics, no battles, no war, no side characters, no historical events, you only see his relationship, which sucks and has nothing to do with how anything happened in real life. It looks as if the director just read half of the article in wikipedio where it talks about Napoleon and his first wife and forgot to read the rest. This movie enfurates me and I hope no one actually thinks this is how napoleon actually was, because this is more like a cartoon of the man himself.",
    "145": "An epic in every sense of the word!Leaving historical accuracy aside (the pyramid bit and the fact that Napoleon's Old Guard didn't make their final assault at Waterloo in column, as it happened in real life), Ridley Scott has crafted a spectacular historical drama, the kind that he's basically patented by now. Not just the stunning battle scenes - the afore-mentioned showdown with the Duke of Wellington, plus Toulon, Bordino and the Austerlitz - but the scenes in France at coronation, at court, at parties...wherever and everywhere. It's all a whirl of colour and movement, no matter the setting. Made for being watched on the big screen!Joaquin Phoenix is fairly petulant as Napoleon, but I guess that's what comes of people treating you like a deity. Some of his finest work, Phoenix is equally good when playing Napoleon the tormented lover and Napoleon the battlefield genius. Vanessa Kirby as Josephine was also very good, and I thought Rupert Everett was brilliant as the Duke of Wellington.",
    "146": "I went to watch this movie that I waited for since decades, since the great and late Stanley Kubrick Intended to direct it. He was so involved into this gIgantic project that the legend says he read and searched for everything that Napoleon did each day of his life. EACH DAY OF HIS LIFE. But after the disaster of 1970 WATERLOO, the project falled into the hole. Now, Ridely Scott at last made it with many Kubrick's notes. I knew this film was cut: 90 minutes, and at first I did not want to see on a big screen because of that. But I wanted to see those awesome battles on a large screen. That's all. And I don't belong to this kind of \"bulk\" audiences, superficial audiences, who go and watch NAPOLEON only for the battle scenes, and who don't care at all about Josephine's stuff about her private affairs - the supposed deleted scenes - which would have lenghthened the movie for ninety minutes more. I agree that 4h 30 minutes is a VERY LONG TIME in a movie theater, with seats not always comfortable, idiots who eat, read their cell phone messages, whisper to their relatives sitting besides them, and above all BESIDES YOU...So at home, on a DVD or on a streaming platform, you are much quieter to watch 4h 30 of a film or series. You can make breaks as long as you wish.... So I belong to this second kind of audiences, who are very demanding, wishing details, deep analysis of specific matters. I don't belong to the bulk, that's why I will watch it on Apple later. ONLY the big screen \"feeling\" concerning the battles pushed me to the movie theater. I will finish by saying that Ridley Scott was lucky to make what he wished, despite producers pressure. I don't blame those Wall Street bankers and stock market financiers who know nothing in movie art, but only in making money. But they perfectly know what those idiotic - pop corn - audiences wish. If those idiots wish garbage, craps, formatted, predictable stuff, so the producers will produce garbage, craps, formatted films. They will take no risks producing artist directors who will insist to make their OWN movies, with their own dreams, guts, blood, soul.... The producers from the East Coast won't risk the financial collapse to satisfy the director's more or less madness, delusions.... If I was a producer IN LOVE with a project, but about which I knew in advance that NO ONE will never go to see it, I would not produce it. But all producers are not like this, some of them love risks, are daring. Look for instance Harvey Weinstein,, he trusted Quentin Tarantino.... And he was right. I don't think that every producer in Holllywood would have done the same.",
    "147": "I have been a huge fan of Ridley Scott as a director for a long time, since I saw \"Alien\" back in 1979. Since then he has directed several great movies such as \"Blade Runner\", \"Legend\", \"Someone to Watch over me\", \"Black Rain\", \"Thelma and Louise\", \"Gladiator\", \"Black Hawk Down\", and \"The Martian\".And I thought his film \"House of Gucci\" was the best movie of 2021.Now he's back with the epic film \"Napoleon\". The film tells the story of the famous French Emporer's rise to power and of his relationship with his wife, Josephine.There are a number of epic battle scenes that are beautifully filmed with superb cinematography, costume design, and art direction. The cinematography is by Dariusz Wolski, who was nominated for an Oscar for \"News of the World\" with Tom Hanks.Napoleon is played by Joaquin Phoenix, and he does a great job as does Vanessa Kirby as Josephine.Overall a great movie about Napoleon that is very entertaining and beautifully directed by Ridley Scott. It is two hours and thirty eight minutes long but it is never boring. Another triumph from Ridley Scott!",
    "148": "Greetings again from the darkness. Ridley Scott long ago etched his name on the list of filmmakers whose projects are nearly always interesting and deserving of a watch. After all, he has helmed such beloved classics as ALIEN (1979), BLADE RUNNER (1982), THELMA AND LOUISE (1991), and Best Picture winner GLADIATOR (2009). Returning to the historical epic genre and working from a script by his ALL THE MONEY IN THE WORLD writer, David Scarpa, Scott takes on the life and legend of Napoleon Bonaparte. Of course, that legend is a bit conflicted since Napoleon and his bicorne hat remains a hero to France, yet something less to England.With thousands of books written on Napoleon, most of us still possess only rudimentary knowledge of the man, even though we do understand his namesake 'complex'. One would think a movie that spans a quarter century and runs 2 hours and 38 minutes in length would sufficiently fill in the gaps, but unfortunately the result is a fascinating mess that wows mightily with its battle scenes, while mostly falling flat in every other area. This is especially disappointing since the film tries to juggle Napoleon's brilliance as a military leader, the muddled and complex politics of the era, and the strange obsession he held for Josephine de Beauharnais.Oscar winner Joaquin Phoenix (JOKER, 2019) stars as Napoleon, and the exceptional Vanessa Kirby (PIECES OF A WOMAN, and The White Widow in the two most recent Mission Impossible movies) co-stars as Josephine. One can't help but fear the effect had this film been made without two such talented leads. Still, at least for me, there was a cold disconnect with Napoleon and Josephine, as we never quite grasp his military leadership, nor her hold on him.Director Scott kicks off the film by showing a bound Marie Antoinette (Catherine Walker) trudge through the angry masses on her way to the guillotine in 1789. Sound effects add to sense of realism, as does the executioner's final act of display. After this chilling sequence, a young Napoleon goes on his quest for battlefield victories, military promotions, more power, and a male heir.The battle scenes are truly epic and as spectacular as any we've seen on screen. Two particular standouts are the 1793 Siege of Toulon and the 1805 battle at Austerlitz. The first shows the brutality of war and gives us a glimpse of Napoleon's renowned strategic expertise, while the second has some remarkable footage on (and under) the frozen lake. In between these two are bits from Napoleon's conquests in 1798 Egypt and The Coup of 1799. Napoleon gains power with each step, and ultimately, his battlefield wins make him a hero at home where he ultimately claims the title of Emperor. Director Scott and Director of Photography Dariusz Wolski shine in this sequence and re-create the familiar Jacques-Louis David painting of the coronation.Unable to produce a male heir, Josephine must be cast aside and divorced, although their letters to and fro make up most of the film's structure of their relationship, even after divorce. The 1812 invasion of Russia is shown, as is Napoleon's exile to the Isle of Elba, where he escapes after a year to reclaim his power in France. Of course, we do know how this ends, as the brilliant military strategist meets his literal Waterloo at the hands of the Duke of Wellington (Rupert Everett). His second exile to St. Helena concludes with his death at age 51 in 1821.Ridley Scott's director cut is rumored to be an additional two hours in length and is supposedly headed to AppleTV+ in January. Although that is an incredibly long run time, Napoleon's short up-and-down life was filled with so many events (61 battles and more than 3 million deaths) and deserves a more complete telling than what this theatrical version offers. For those historians who are quick to point out inaccuracies, the well-known grump, Ridley Scott, has made his response to you quite clearly and succinctly.Opens in theaters on November 22, 2023.",
    "149": "MMMMMM, not good!Phoenix is miscast in this movie, he stays in the ashes and there's very little fire in the performance, bored and lost, was he drunk??The story is hard to follow and I got pretty lost with the diving about like a multiverse movie where nothing is constant.The character is like some nasty child who has ADHD and is sexually incompetent. Weird characterisation of one of the greatest military comanders ever??Josephine is a confident feminist type who manipulates the messed up child into rampant sex sessions for her own fun.It's hard to follow this stuff as the point of it seems to be the point\nit's making...Napoleon was a sad, messed up loser. He also gets off on killing like John Wayne Gacey the clown killer who looked like the Joker.The music from Pride and Predujice very is weird and sits real bad with this kinda abuse based love story that thrives on war, brings a memory of that ,and its a strange thing to use in this film, it's like a pound shop dollar store film that can't be bothered to be proud of itself.It's difficult to find much with this clever dick, smarty pants alternative version of the story that is passionless and appears written under the influence of some heavy narcotic or just after a death in the family....$200m wasted? Yup."
}