{
    "0": "Good thing we don't have to deal with reality while watching this movie. Exaggeration kept increasing exponentially as the film moved on especially with the action scenes. There was shameless copying of the Hollywood character Bane from Batman movie, which was downright embarrassing. If while watching the movie you get confused as to which Shahrukh Khan is the father and son. Don't worry it's a confusion in all our minds. One with a slight makeup is the father, the other one with more digital touchup is the son. Watching a 58 year old Khan romancing does get awkward but not to worry he is still striking a pose and walking in slow motion. The main villain was decent in his role as he did not engage in overacting. Padukone was good as she portrayed a mother aptly. Sanjay Dutt looked like a last minute addition so he didn't have much of an impact. Not sure why a good actress like Sanya Malhotra accepted this blink and you will miss role. Nayanthara was ok. Should you watch this movie? If you are into flights of fantasy devoid of any reality and over the top acting than this one is for you.",
    "1": "All the hype, all the glowing reviews, all the positive word of mouth. And then I saw the movie. What a disaster. It was simply terrible. The editing was choppy and erratic, the storyline made no sense whatsoever, the writing was horrible, etc. Etc. Etc. Characters did not act in any common sense fashion, the plot was convoluted with unnecessary storylines and cameos. And really? Not to spoil anything but prisoners dancing in jail with their warden? One of the dumbest films I've seen in quite a long time. Obviously, Bollywood critics and fans have incredibly low standards for the movies. Put a big-name actor in any film, and it will get positive reviews. One of the worst movies I've seen this year.",
    "2": "***Jawan Hindi Movie Review***Starring Shah Rukh Khan in lead role directed by Atlee.Also starring Vijay Sethupathi Nayanthara, Sanya Malhotra Priya Mani Sunil Grover*** Culmination of Many Films into One***Disclaimer :If u have watched Thala Ajith Movie \" Aarambham\" , Vijay - Atlee Movies, Vijay movie \" Katthi\" , The Movies where the Hero points out the evil side of the political system, JAWAN will be a waste..But if you want to watch Jawan from the entertainment angle wherein you wanna a theatrical experience, watch SRK swag, his kick-ass action, massy elements, go for Jawan.Positivity of Jawan.1) After Pathaan, Shahrukh Khan again on a full mood action. Double role , wherein the Dad character was awesome. A never seen before avatar of SRK. SRK swag, his action proves that age is just a number for him. Atlee had fully extracted from SRK thereby using his stardom to make the people believe that Jawan is what SRK needs to do to bring the audience back, blow whistles and make box office houseful.2) Vijay Sethupathi's villanism doesn't disappoint but his accent seems to break the mood.3) Action sequences was whistle blowing. The climax action sequence especially for me had just accelerated ny mood.5) After Jailer, another terrific BGM delivery from AnirudhNegativity1) Familar Storyline. As i mentioned the film names in the disclaimer, Atlee able to edit different story lines of various hits adding the commercial elements flavour thereby making a watchable flick.2) Over Exposure of Nayanthara. Could have got better choice when selecting a heroine in a mass masala movie. Nayanthara in this proves to be a miscast.3) Except the song \" Banda Zinda Hu\" rest were below average.Overall a mass masala entertainer package movie.",
    "3": "One of the most stupid and boring movies which has no story line or any respect for any logic. Everything is just so convenient. You can hang anyone when you want to. All the prisoners are innocent and better than the outsiders. The villain carries a red pill (for painful instant death of others) and a blue pill which is his medicine, in the same box.The guys were bullet-proof vests but the commanding officer - a pretty young female goes full-sleeveless. And the same commanding officer also negotiates in the most critical cases.A girl faints right before she is to be hanged. Another person, a doctor, checks her pulse and declares she is pregnant. At least, in the older movies, a real doctor would come home.During the whole movie, I was thinking of Manoj Kumar's social-themed movies which I am not a fan of, but they were looking better. Much better. The Dhishum-Dhishum looked fake in them, but would not be there for half of the movie like this movie's action sequences each of which terminates in a slow motion.I am totally surprised why this movie is making so much money. Well, add my few dollars too. That's why.",
    "4": "Terrible film. Complete waste of time. Too many sub-plots that make the overall film incoherent. The film cannot decide what it is about - it has tried to be an action film as well as a romance film as well as a revenge film. It has used multiple filmstars in small, even unnecessary roles just to give the audience something to get excited about. The music is missable with no memorable numbers that you will find yourself humming later.If you are used to good cinema you will be thoroughly offended by this excuse of a film. If you have a taste for senseless, over the top, disjointed storytelling that commercial South Indian cinema dishes out, you might enjoy it.",
    "5": "This movie is so hyped. I was traumatized in the theater. The story was so gripping. And it had so much potential, but the action destroyed the movie. There was random non sensible stuff happening like getting shot multiple times and falling from the hellicopter into a river, then hitting the head and floating unconscious face down in the river, but making a complete recovery. If not the bullets or brain hemmorhage, the person would definitely die of drowning. A scene where the entire bandages on the body are burnt but not a single hair on him catches fire. A scene where he lights a cigarette by creating sparks with his shoe by drifting the bike and creating friction on the road with his shoe. Like what? And then puting that cigarette in the fuel tank of the bike, which does not explode till the bike is pushed towards the enemies and like a good boy the bike goes to them and explodes. There was utter from that to the movie producing all kinds of characters from marvel DC, and copied scenes from other movies. From apocalypto to moon knight, to joker, to bane, to John wick to ghost rider. They were all in the movie in the form of SRK and deepika. Seriously?",
    "6": "The story is not connected to the events. The interaction of the father and son in the exciting shot does not indicate that there is a connection or knowledge of the events as reality. Complete focus on unexplained audio noise. In the end, the movie was just a waste of time.A silly comedy and action beyond children's imagination, despite the obvious falsity in it and its distance from realistic excitement. You find it fun for children only and annoying with its sounds for adults. I consider it a failure in making suspense and excitement films, as Indian cinema excels in folklore and colors only.",
    "7": "Belive me watching this movie your theatre will went on fire mode! The 2 hrs 50 mins Jawan movie directed by Atlee starring Sharukh khan is a perfect top notch action mass movie for the Indian audience. The direction and action of Jawan are Hollywood level,the cinematography and screenplay is like the audience is sitting on a roller coaster.Despite having a long run time the movie will not feel lengthy or bored at any point of time because of its amazing twist and turns. For srk fans its a perfect treat for them! I will call this movie the best of king khan career. Its a mass family entertainer and if you are reading this review then please don't hesitate a bit and go for it ,you will not regret watching this movie.if you are a genuine movie lover than this movie is definitely for you.",
    "8": "I just wasted approx 3 hours of my life for this crap. This crap is senseless and a torture to anyone . Shahrukh Khan, please use some logic before releasing a torture cell. Do not waste your time and money . Acting by each and everyone in the movie is pathetic. SRK disappointed me a lot . I am a huge fan of him but he is a total waste in this movie.Direction from Atlee is too bad. I think he was confused while making this movie and did not know what to do. As a SRK fan, I am very disappointed in him that he is wasting his talent like this. Blind Shahrukh fans won't find my review helpful, though.",
    "9": "After Pathaan I thought that SRK is back on track but I was so wrong.The movie started off interesting with a Robin Hood storyline but got worse every minute.It jumps from one scene to another without any consistently and tried really hard to be a Zack Snyder like movie with it's slow mo and close up shots.Every character was uninteresting without being introduced properly.SRK works as a jailer in a woman prison and gets along so well with the female inmates so well that one of the female inmates starts singing with a guy's voice and then dance to the Zinda Banda song and they took the time to light up the prison as a disco.Nayanthara's character fell in love with SRK and married him after just one song Challya and didn't consider the possiblity that the marriage could of been an ambush.The old SRK doesn't remember anything but still saves his son before the interval.The action was atrocious with old men on scooters taking out big lorries. Srk threw a cigar in the motorcycle fuel tank but conveniently didn't explode until it hit the other vehicles and expected the audience to except it.SRK had a team of 6 girls and not a single one was likeable.So the amount of stupidity certainly did cross the limits.0/10.",
    "10": "Never saw a house full 7 AM show, we woke up so early to see SRK's Jawaan and it was so amazing.. best way to start the day.. a second watch is must.. ek baar se dil nahi maanega..This movie will definitely break all the records that has been made so far in Bollywood this year.. we have seen lot's of good movies this year.. but this one has become my favorite..It's always a good feeling to see your favorite actors movie on it's release day and of course the first show of the day.. you get to see the die heart fans out there in theaters and to see people cheering and wristleblowing on SRK's entry scenes was mind-boggling.",
    "11": "This is one heck of a movie with mass goosebump moments for the legendary actor Shah Rukh Khan. I don't think even Bollywood director would have thought of such moments for the king. The screenplay is racy, enough pauses are there for emotions and mind blowing action scenes and high moments.You never get bored at anytime, with Anirudh's terrific background score and songs. The screenplay is good and interestingly the heroine has a part to play in this action thriller.The comic moments works great time. Every getup is done with great attention to detail. Kudos to the makeup and VFX team. Must watch!!!",
    "12": "You can tell its directed by a South Indian but that's what make it beautiful. Insane cameos, powerful cinematography. Imo one of the best SRK action movies. The fights were engaging, little humor everywhere created very good atmosphere.After watching Pathaan where they had a very dull climax, I wasn't hyped a lot for this movie, hell barely saw the trailer but entering the cinema my views changed. Flying start, story was somewhat new but also had a lot of inspiration from previous series like Money Heist.Someone who never hates on South Indian style action, this movie provides just that but with a high budget which you can see throughout the movie.",
    "13": "The movie is a stupidity which cannot be justified nor can be watched on a OTT. After talking from an airplane, if there is anyone who can be saved that is God. The movie starts with farmer issues , then drifts away to lack of basic amenities in government hospitals, then further wanders away to corruption in Army and finally to misuse of right to vote and cash for vote . The issue of farmer suicides has already been covered in n number of movies and add to that the issue of waiver of agricultural loans was taken up . There was no story in this Atlee movie, the story was wafer thin. Horrible story which only SRK would have bankrolled. So , he produced his own movie and acted in it and gave a chance to Atlee to direct the movie.Will we ever produce a movie like' Gravity' or Oppenheimer \" or will our future generation will be watching this kind of dumb movies.There was nothing Jawan in the movie other than the title. There was no need to name this movie as Jawan rather it should have been named as VFX magic.",
    "14": "I was hopeful that this film would reignite my interest in Bollywood, but it fell short of expectations. Even the inclusion of Southern film stars couldn't salvage it. The movie was a chaotic mix of loud noise and exaggerated performances. It lacked any semblance of rationality, undermining the audience's intelligence. The soundtrack was far from appealing. As for the plot, it seemed like a patchwork of recycled ideas from both older and recent films. Exiting the theater felt like a long-awaited relief, especially given that the headache induced by the noise lingered for nearly a day. The worst part is that I watched this on IMAX. What a waste of money!",
    "15": "I will never get back my 3 hrs of life back. A very boring and over the top preaching movie with weak character development and very senseless action set pieces. Apart from discussing social issues of India there was nothing in the movie. For 3 hrs the movie couldn't develop one proper character. I personally didn't like the songs but it may be down to personal preference. Only redeeming quality was great background music and good cinematography in parts. I would have enjoyed it if it was 1 hr short probably. Vijay Sethupati was not scary enough. All female stars in the movie was shown very powerful which again should be discussed or developed in these 3 hrs of meaningless action sequences. Another average bollywood flick.",
    "16": "After a tiring/ frustrating week .. I went to watch Jawan hoping for some entertainment! And what a disappointment ! It is an extension of the southIndian movie Marsal by same Atlee, which was great however Jawan is Bollywood packaging of same plot with SRK who just doesn't fit the bill! Only Nayanthara is the saving grace..SRK tries to projects himself like Rajnikant but fails terribly to my liking.. I don't know how the reviewers said this is a superhit movie!.. I have a headache after watching this! Can be easily skipped to save time and money! Now I think pathaan was much better than this. Atlee, you can do much better than this. SRK, take a pause for a cause, and think before you act! We all should think, what we watch and most importantly what to promote.",
    "17": "Why I wrote that caption is because after watching this film, I feel all of Us The Citizen of India must watch this film. This is a mass masala movie with a very important message that makes it class movie. So people who are planning to watch this must take everyone to cinema if you care for your people. This is the real Desh Bhakti. SRK naam to suna hi hoga and Atlee ab naam suite hi rahoge delivered a Masterpiece. Yes for sure Jawan has some negative but the positives of this film takes over its negatives so well that u will take the negatives positively. Fans will surely go and watch it but this movie is for all. Do people who don't like SRK watch this and you will love him. Final Word MASTERPIECE meant for cinema experience only.",
    "18": "Just watched overhyped Jawan and suddenly felt old and depleted! It is horribe, pathetic, nightmare, torture.... I am running out of adjectives for this junk South Indian nonsense starring Shahrukh Khan! Nayan Tara wasted, great Vijay Sethupathi wasted, Sanya Malhotra wasted, most importantly my time and money wasted! Mindless, script-less stupid flashy masala with 2-3 mixed up rotten old formula, No content. Will remind you of Salman Khan's torturous movie Reddy. Shahrukh solved all important problems of India, sorry Bharat in 2 hous 45 minutes! Below average music. Irritating dose of severe mental enema. This forced marriage of Bollywood and Tollywood has produced this ugly mutated child Jawan! I feel ashamed and disgusted for watching this crap. I trusted glowing reviews from people and crtics, went to movie theater for good entertainment, and returned feeling agitated, cheated and scammed. Save your time, money and sanity.",
    "19": "Not sure what people liked in it. There is no connection either with story or character. Just like a YouTube video which keeps running in background, this movie runs same way while watching. Story is jumping here and there, so many iconic scenes are taken from other movies. I think people just went to watch srk with any other hero this would have been a flop. Mummy taken from moon knight , banes costume is taken. Srk characters looks like have multiple personality disorder which keeps on changing every 10mins. No consistency in characters. Sometime they are showing as if they are top commando and next moment crying like a baby with little pain.",
    "20": "Why these are made and with what expectation is a mystery.SRK used to be a mediocre actor. The number of movie acting experience hasn't changed that. The histrionical acting is over the top - like skmenon's review states - a culmination of Tamil hits. The acting is just as over the top. The unnatural voice modulation is sad.It is hard to tell where the hyperbolic imagination for the scenes come from. Right from the opening scene - where our hero is floating face down(!)... down a river but doesn't drown. He has a nostril up his behind naturally!Why the bunch of baddies come to the village where SRK's character is recovering and start to kill the residents - doesn't make any sense. And somehow he wakes up for the first time and ready to fight and kill all the villains - who start with guns but somehow forget they have it when SRK makes the appearance.A great movie by very low standards... SRK manages to find new depths.An example of what not to pick from Tamil & Telugu movies.",
    "21": "Too much of paid promotion for the SRK film, I was expecting atleast something new but the film has used the plots of 1980s films. Aakhiri Rasta is one of the films it has heavily borrowed from. SRK is overacting as usual. This is where Bollywood fails, nothing new to offer and audience watch movies just for their superstars. Plot should be the king but it's not the case for Bollywood fans. I got bored before interval and forced myself not to sleep during the movie. Somehow I reached the climax convincing myself that there would be a cool climax waiting. Nothing happened and I regret going to the movie. Bottom-line is it's a cliche story, same old direction, same old SRK acting which he is repeating for 30 years. Nothing great.",
    "22": "With the highly-anticipated release of 'Jawan,' starring Bollywood superstar Shah Rukh Khan, just hours away, excitement among fans has reached its zenith.Very Cheap Storyline.Screenplay is not engaging. First half was ingesting, especially interval twist. There are many irrelevant thing, no logic but enjoyable for it's stylish execution.Second half was stretched a lot, emotional but very routine formula wise presentation, which is not as impactful as Pathaan. There was many masala but if you are not a SRK fan you can not enjoy. If you are one of a neutral audience it's 3 hours torture and pain in the ass.",
    "23": "Fans should understand and provide genuine rating so that movie lovers can avoid and look out for better movies available. How can such a ridiculous movie get 7.5 rating . Screen play and action scenes are disappointing. Rating 2 star for Music only. Shahrukh Khan is tired of experimenting with different roles , rather he wants audience to see him a larger than life character which doesn't suit him at all. He should work in genre which portrays his magnificent acting skills and avoid thrash movies. Looking forward to see k quality with Dunki . A disappointed movie lover who got excited with ratings and unprofessional criric reviews. My advice would be Skip for now or wait for ott streaming.",
    "24": "Jawan is an exemplary homage to both Indian and Western action flicks that inundated the industries in the early nineties. The movie could well be on its way to replicate what Top Gun Maverick did to an ailing Hollywood, in Bollywood. Slick action sequences, paired with romance, filial affections and some amazing music makes Jawan a perfect watch. That, paired with a double dose of Shah Rukh Khan is well worth the money. All said and done, Jawan will always be remembered for Atlee's extraordinary way of giving Shah Rukh Khan a befitting tribute, proving why he's, for all reasons, 'the last of the stars'. Jawan is a big screen spectacle. Ready or not, this is a ride that's definitely worth taking.",
    "25": "Movie Jawan is a typical example of how not to spend hundreds of bucks on poor cinema watching affair. Infact to save such a hassle for commoners, OTT platforms such as Amazon Prime do release fresh movies. Villan Vijay Sir looks like he was forced to act in this movie! It is also very evident that many scenes are scripted in order to slate the songs. And the amount of make up on SRK(aazad) was unnecessary. Female lead has been portrayed to be more badass than Charlie's Angels which eventually fizzles out. The story line & plot is very weak. There is too much the director is trying to tell within 2.3 hrs of running time. Action scenes are mostly avoidable except for the one fight scene amongst the girls. Only positive is the valid message that this movie comes with - Use your vote after thorough deliberations. SRK fans can have few awwww moments. Apart from that this movie is insipid.....",
    "26": "* Grandiose Hero entry sequences( multiple)\n* Stylized violence with blood & gore\n* Some dancing music with hook steps\n* Bunch of recent social issues leading to a Message\n* Flashback/BackstoryProblems,\n* Too many disjointed stories with no connections\n* Too long to keep interest\n* Over the Top action sequence, chaotic not crisp\n* Over the top villainy in the backstories\n* Music average, except Challeya song\n* Lame attempt at addressing Misogyny\n* Sethupati wasted\n* Money Heist, Monkey King - too many inspirations\n* Sanjay Dutt cameo forced & annoying\n* SRK is no Rajnikant, cannot match the flair.",
    "27": "I couldn't believe people really liked it. Extra long, unnecessary songs, lots of loose ends its just total rubbish. First half was really bad. Second half is 5/10 but honestly what were they thinking while editing the movie. Could have been better but editors haven't done their job properly. Deepika role was way long. Nayanthara role was good but it was ruined in second half. Shahrukh please no more clean shave looks for you as you look so bad also he cannot match the south indian movie energy. It's clearly visible in the dancing songs. Honestly dont waste money by watching in cinema, just wait and it will come on OTT.",
    "28": "2023 is the year of SRK.. First Pathan and now Jawan. This is one of the best movies SRK ever done and everything about this was just perfect, from epic action to thrilling fight choreography and a hardcore BGM it rocked the threatres around the country.. SRK is really King as he is the one of the well known celebrity of this planet who saved Bollywood twice this year although this was a Pan India film instead of Pure Bollywood film.. The opening action scene is one of the most epic scene I've seen in a Indian film followed by epic Pre Interval fight scene which turned audience mad. Storywise this movie gives a good message dealing with themes of Corruption in our country, screenplay was good, BGM is highlight of this movie, action scenes were epic and the way SRK changes his looks in this movie was also shown greatly... Overall Jawan is another Blockbuster of this year which I truely enjoyed from start to finish.. It is peak Masala cinema which audience enjoyed throughout decades...\nGo watch it.. Full paisa vasool...",
    "29": "First the Pros-1) Initial start looks good first 10 mins, then derails here and there.2) Some action scene look new from Bollywood angle but nothing new. All South movies, you would have seen this kind of action somewhere.3) Presenting lead hero Sharukh Khan in different get ups but he's overacted few scenes . Also, I felt any average actor could have also performed this role as the director has presented.Cons-1) First Con is storyline which is totally Unrelatable.In one scene -\nThe kind of Govt corruption, atrocities and insensitivity shown of bank official where he pulls off the farmer dhoti naked, it can never happen in today's date considering smartphones in villages and social media presence.Even police shown present, it doesn't happen in reality.The biggest drawback is storyline In another scenes 600 prisoners having weapons and all are on hero side ( After all in all prisoners only few may be for nation cause) How all prisoners become desh bakht and support Hero- Only because they are women? Bakwaas. Such unreliable scenes was torture to watch. Matlab - Kuch bhi.2) Shahrukh tried to do different but can't relate emotionally to the character or other characters.Some scenes he's overacted, only few scene director presented him well. Even Hrithik or Saif could also have done better acting if lead hero in this movie.3) Movie somewhere becomes boring or strech of unnecessary character development.4) Vijay Sethupathi should have done something like Vikram .if in negative role.His acting good in this movie but he's been spoilt in this movie. Bad choice for him.Bollywood shouldn't put highly talented South heros like Sethupathi in negative roles but in positive lead roles like in web series Farzi.Nutshell- This movie totally relies on Director Atlee skill to present Shahrakh Khan in bit different here and there.",
    "30": "Even from trailer it looks pathetic, wonder why people are so much delighted to go and watch in theatre. Same copy content from marvel and south. Seems like a platter served and nothing original. Sharukh over smart acting makes it worst same which was seen in Pathan. Songs are even worse than movie. Saw one review where one compared the idea from Amitabh's Akhiri Rasta and it seems correct. Actions scenes are itself which will make you recall as if watching typical south movie. It's shocking how people survived the entire 3 hours in theatre and then coming out safe without having headache. Better to watch in OTT even if you dare, at least you can forward or switch it off.",
    "31": "Hi, This movie has all USP ,Atlee direction Talented Actor Vijay Sir,Nayantara , Deepika and SRK , even I went to see night show with my old age mother And father bcoz they love action after convincing then that it will joyful experience for then, After seeing so much hype postive review on social platform, Big disappointed for me the film never connected from the beginning except opening entry scence of SRK, anirudh music doesn't score this time , Vijay sethupathi character is not justified at all he is such of actor , senseless action drama deliberately filled patriotism lack of emotional connection, I guess pathan is much better than this ,SRK gots only female attension may be they change their box office number . Even a webseries action on OTT I enjoyed more than this movie , I need to go office next day movie gave me headache not refresh lmemt , the same I feel after watching OMG , but not to worry for SRK he has powerful fan based who surely make dis blockbuster, but for me and my family i bad night n headache.",
    "32": "When people say it's overhyped, I believe they just like to live in a denial. Dogs can bark, people can spout anything they like. It leaves to you, if you just believe things blindly even before witnessing it, then you're just as sad as those people. Go and watch it yourself, experience the best cinema you've ever felt in perhaps your short life. Good to go Chief! Thank you SRK, Atlee and the team who have brought to us the best cinema. Biased or unbiased, go and watch it. Life is a choice. You feel like watching it, go ahead, otherwise, go on with your life, and let us, the FANs be happy with our King Khan.",
    "33": "Please leave your brain and login at home while watching this movie. Only die hard fan of Sharukh will love it and they have given higher rating , but if you want to watch a good movie , Please spare this and watch something else. Sorry I could not stand this movie. No logic , no story , just some random action ( Very Unrealistic ) some songs and that's all. A crude fantasy that you only can imagine when very high.Only thing I find commendable in this movie is How Sharukh Khan maintained his fitness even at the age of 57, His hard work clearly shows on maintaining his physique, except that nothing is there worth mentioning or to recommend someone to watch it. Bogus movie avoid at any cost and save your money to watch something worthy.",
    "34": "When I am saying it is best action movie of Indian Cinema. I am saying it because its action coreography is best, its vfx is best,all the performan are on point,grand level cinema of big screen and its also class with mass(women empowerment message). Srk best performance till now. Vijasethupathi is always best. Nayanthara is looking cool. All the girls are on point with their performances. Songs are also of massy level. Stand out for Anirudh because i am listning his music for movies since long time and i felt vikram was his peak level but he proved me wrong he has given his best music to jawan. Atlee's direction is top notch in compare to his all previous movies. I recomend to watch it on big screen with your family,friends, girlfriends,boyfriends. Pure goosebumbs with good story libe, twists, cinematography. Go and watch it now.",
    "35": "Movies should be considered good which touch your soul, make u feel atleast something..happy,sad,angry whatever. But while watching this movie u wont feel anything, not even in one scene. Typical masala movie. Some action some romance some drama. Sadly went to theaters after watching few you tube reviewers like Diksha and Raunak who described this one among Sharukh's best but after watching understood how heavily promotion is done through you tube revewers. Hip hop song played during fighting scenes which few in you tube described as soo called best background score. Overall good onetime watch.",
    "36": "This vfx heavy movie looks hilariously out dated with some worst stunt scene the it is self has this cgi look that looks to be made by someone using there grandparents computer i didn't know hindi movies this bad in tamil movies there a lot of pratical effects and with directors like christopher nolan pushing the boadarys of what is possbile no excuse not to use pratical effects but there reason it doesn't this is inaccurate garbage i even serials do vfx better and the medical inaccuracy that are so simple to avoid shame these directors like this still bro milking this concept and heavy stereotypes like india is dirty and stuff india was on of early nation to ban plastics and force director trys to his fetish and paried with cringest stunt scenes ever i thought movies have evolved in short bad cgi weird fetish medical inaccuracy FUNNY HOW MOVIE TALKS ABOUT CORRPUTION AND FORGOT TO SEE WHERE ALL THE BUDGET Went and bruh petrol on fire does not explode shame on atlee hope never directs again plus the fetish makes this movie a tramatic experence.",
    "37": "The movie was entertaining with blend of a lot of drama, little comedy, some thrill, some suspense and a lot of action. The story was good with a good message in it, the screenplay was uneven but doesn't damages the story, the direction was good and the performances were also good. The BGM and the action scenes were great, you will love them. Also, the message the movie wanted to show was good and effective.Some scenes were rushed and some things remained unexplained but the story is shown in such a grand way that these things will not bother you that much.Overall, you should definitely give this movie a try.",
    "38": "Honestly I have no idea what the hell everyone is so hyped about. No plot at all, the action sucks, I can't even remember any songs and the editing is like it's made in tik tok. Please avoid this garbage.I fell asleep in the hall because the stakes were absolutely zero in the second half. There is no villain that can even though srk in the movie so where is the tension?Someone please tell me why the editing in the movies needs to be so jarring. There are like 100 cuts a minute. Let the shot breathe. Let me see the establishing shots and see where the characters are. Absolutely garbage movie.",
    "39": "Just as pathetic as it could be. These people take Indian audience for granted and then wonder why people go gaga over Hollywood movies.Don't waste your money, time and peace of mind over this piece of garbage.I jist fail to understand why do people keep manipulating the reviews to force others to watch these crap movies. Watch it if you like, please don't post fake appreciation and influence others to waste their time. Same thing as happened with Pathaan. Pathetic movie with unnecessary and unsolicited hype.And dear SRK - please die a hero. You are lately just undoing all the good work you had done with Swades ans Chak De. 🙏",
    "40": "The Movie is quite boring after 15 minutes. Shahrukh's look is copied from a villian of \"Teen Wolf\" TV Series named nogitsune. Even Shahrukh working as a Jawan when he is around 60 now is not up to the mark. It's not even believeable. He should opt to work as a old man now. Double role was a bit surprising but how two guys with same face can have same voice too. I think about this thing as after plastic surgery Indian serial uses this logic of same voice too. Better to watch this movie on some OTT platform rather than in Cinema hall. I regret my decision to watch it on first day. It could be better but I just wasted money.",
    "41": "I was really excited to see this movie as I've seen many South Indian movies in their original languages and I know a good South Indian movie when I see one but this one ain't it. No mister this movie has nothing new you haven't seen before. Y'all remember akshay's gabbar where the main guy is a vigilante who fights against the government's corruption and akhri rasta of amitabh Bachman where the main guy's mom has a tragedy story and he ends up taking revenge for her and bunch of movies where the father and son look alike and bunch of movies where they fight against the bad guy and y'all know who's gonna win yes that's jawan for you; nothing unique ; usually South Indian movies and I'm talking abt the non masala movies have a good plot twist and yea sure the old srk Vikram rathod is a fresh and funny character and the action is cool but you can't just have action and no story. Then you have nayanthara who seems to be a such a badass but she's just another stupid character being the head of her team did she think she's just gonna have srk waiting for her to arrest him in the train scene? All those people wearing bandages she should've known he can escape. And hell if deepika knew wrestling she could've attacked those police officer instead of killing them.",
    "42": "Being a Shahrukh fan, I regret seeing this movie on the big screen. The movie theatre was empty only 3 families. Initial part of the movie was good, but then there were too many directions the story was moving - was it about avenging his father's reputation or farmers or public hospitals or voting - I was lost. The 3 stars are purely for effects not story or direction. The success of the movie hugely lies with Pathan. Pathan was houseful when we went to see. People flocked thinking this would be on the lines like Pathan. Plus, I don't understand why all Bollywood movies are mixing South actors. If the story demands its good, but forcing the equation just to get more box office revenue makes no sense. Yes, people should vote for the right party but just not the Congress as long as the Gandhi family owns it.",
    "43": "Jawan, a film that initially showed promise, unfortunately, crumbled under its own weight. It is disheartening to witness a talented actor like Shahrukh Khan involve himself in such a disappointing project. The audience today seeks realistic movies with believable stories, and Jawan failed to deliver on that front. It can be categorized as nothing more than utter Bollywood rubbish.My recommendation would be to save your valuable time and skip this film entirely. Perhaps, when it eventually releases on Netflix, you can give it a chance if you're curious. However, I must warn you that the overall rating for Jawan stands at a mere 1 out of 10.",
    "44": "I loved the movie. The storyline, the acting, music, bgm sounds, vfx, everything was amazing. Movie highlighted many social and political issues. It showed the harsh reality of government and it's poor management. Movie gives a very strong message to it's audience that is to stand against evil. Shahrukh khan has proven he is the king of cinema. Vijay as villian once again won our hearts. You will love the acting and cameo role of sanjay dutt. The girls gang was superb. It's a must watch movie. Dialogs were heart woning and SRK delivered them with perfection. His voice changing according to the role was praise worthy.",
    "45": "I watched about half of the movie before turning off the TV. The storyline is nothing new, its been made into multiple files in the past. Instead of typical storyline, bad acting and even worse direction in the movie irks me the most. SRK is following in the footsteps of Salman Bhai. He isn't even willing to act, his acting in this film reminds me of Kabir khan from Chak de India, his manner of speech and facial expressions are the same.If I talk about direction, why do south and Bollywood movies focused so much on Glamour. Can't we just have simple introduction to characters. The action-packed begining was stupid as hell.This movie is so overhyped and definitely does not deserve 7 stars on IMDb.",
    "46": "What a movie. Superb. Bgm, song, action best .. srk and nayanthara chemistry excellent. And no one can beat srk swag.. srk one and only king.. srk career best performance and jawan pure masala entertaining movie.. this movie blust and action scene different level.. look like a Hollywood action.. nayanthara, sunil grover, Sanya Malhotra, ridhi dogra every one performance good. And vijay sethupathi best villain playing.. and zinda banda song perfectly using. And anirudh best work.. just one word say totally paisa wasool movie.. after few years srk best comeback. And you enjoyed every scene. This movie sure earning 2000cr.",
    "47": "So, firstly I've no words for the roller coster of emotions that I went through in the theatre. But this is how a superstar like Shahrukh Khan should be treated. An extremely crispy screenplay, nice and heavy script, banger BGM, important social message, performances of lifetime from all the cast, and last but not the least, MASS. The movie so good that I will watch it atleast thrice in theatres, it's rewatch value is going to be amazing I feel. Atlee and Anirudh should be praised hell a lot for this gem. And obviously the star cast I mean what do expect from SRK, Nayanthara, VS & all tthe ladies.",
    "48": "Movie could have been better but it was not as expected. I would say to not see this movie and leave it as it is. In case watch another movie and not waste time in watching this movie. Shah rush khan could have done better and he was not upto the standard. It was violent and not suitable for all the audience. I would expect it to be more better and not how it is. Acting was not up to the mark and no story at all. I would say to see other movie and not this one. No story highly violent and acting was not proper. You don't watch this movie and wate your time,instead watch a good movie and not this one thank you in advance.",
    "49": "The truth is i don't want to tell , you have to experience yourself. Movie provide you deep message as well as it is mass entertainer. Both father and son fighting for system and have never give up mentality. If you take movie as message, movie will open your eye. No fake acting ,No unusual scene .Perfectly entertain on that amount of time. If you are Shahrukh fan , you will definitely love it but if you are not shahrukh fan but is movie lover , who don't judge because of starcast and enjoy as neutral fan , this movie gives you message+ Entertainment so you can definitely watch with your mom or dad or family members, brothers or sisters or girlfriend or boyfriend or neighbors or simply go alone and watch. Movie won't bore you , you don't have time to talk with anyone rather than you enjoy movie.",
    "50": "Where is the Romance SRK? This movie felt like Rajnikant plot. It's so important to stick to your signature moves as you are known for them. In today's time zanta is expecting some realism. Desh bhakti is shown in such a comical way. Senior actors should gracefully do intense untouched roles which can show their real talent rather then pushing themselves into roles which any other guy could have delivered. I am a big fan of srk & this one is an absolute let down. He did some superb innovative roles in past which became milestone achievements.. I had to pop Saridon after watching this mindless movie. Mental horror.",
    "51": "Watched the movie with great enthusiasm and expectation from the story. It started with a momentum, but it lost its value. Then I found this movie is an absolute mix of Tamil movies like \"anniyan\" the story as well as the mask, Mersal, Vikram, Bigil, and Money Heist (N-Series). The story is inconsistent with many irritating segments.I'm wondering how could one say this is a Hollywood-level movie, Hollywood movies known for their screenplay which glues us to the seats. Also, the story will be subconsciously acceptable with the details. I don't find any of the Hollywood qualities in this movie.",
    "52": "I don't have big expectations for the Indian action movies.. I went to see this movie just for entertainment. And I was right.. the action scenes are good, but the story is traditional: A good man who wants to fix the problems in a society.. I have seen this in many other movies (Gabbar is back) but the director added here another story about a soldier whose wife was killed and lost his memory. The two stories meet each other on the second part of the movie.The movie contains typical Indian melodrama, like a son who is a copy of his father.. a man who wants to revenge.. A hero who can do anything.. even the songs are typical and have impact on the story.The movie in the second half became a salad of Action scenes.. I felt that it was too long only to add more action, and I didn't find any added value in Sanjay Dutt's role.I liked sharukh here in his role as a father.. but as a son, I felt that he was overacting.. even his look wasn't good enough..One time watch only for sharukh.. nothing else.",
    "53": "Movie is very lengthy and same old school village emotions touch with same old context of corruption and bad governance, very bad acting from everyone but Vijay Sethupati saves the day. Story line is copied from web series and movies like Money hiest, Vikram, Gabbar etc. Logic is gone over the roof, SRK screen time looks like reels from Instagram and YouTube, very bad VFX on SRK's face. Coming to direction is pretty ordinary, could have been better. Audience also was pretty much exhausted and wanted to leave early. In conclusion SRK wants to earn by making this type of movies rather giving the entertainment that audience deserves. Save your money and wait for the OTT release.",
    "54": "SRK & Atlee combination🔥🔥\nPathaan was overrated but this time srk hits the target! Story is very familiar though the presentation is what makes this movie a great entertainer! It's pure entertainer and you will come out with smiling face!The most memorable scene was Interval Block!! Man it was just BOMB🔥🔥 This is Atlee's speciality! In all his movie generally Interval> Climax! Ending could have been better, though it was not bad at all!Acting wise\nSRK - 10/10 (No doubt about that)\nVijay Setupati - 9/10\nNayantara- 7/10 (Other actress would have been better)\nRest- All ok!All in all, go & watch in theater without a second thought! This has to be felt in Cinema Hall only.",
    "55": "What a fantastic show, everything is top notch\nAction design is fabulous and great work by redchillies also Shahrukh Khan the show stealer what a great performance by him if u like pathaan then it will blow your mind and if u not liking pathaan then this is for you guys.Direction of atlee is ultimate means only he can present srk like this just woooow.Now comes to Vijay sethupati he is also like never seen before avatar.Nayanthara Deepika and other girls each and every charector was impactful\nBike scene metro scene belt scene 🔥\nNow think ek or baar dekhni padegi please go and watch it's fully entertaining.",
    "56": "A pure entertainment masala action thrill ride with amazing over the top action set-pieces that also tries to delve into some serious issues of the country ranging from farmer suicides to corrupt political system run by crony capitalists. It is also a call for the power of the ballot and the public's right and duty to question each and everyone.Jawan has the soul of rang de Basanti and a Wednesday that has been infused with cocaine and action cranked to the maximum.The side characters could have been more fleshed out and the momentum does drop a little at the start of the second half but it picks up towards the end. Enjoyed it more than Pathaan.",
    "57": "What a film...i watched on first day first show . This film is a clear entertainer . Once in a while these kinds of film made. Every one was as its peak especially SRK and Deepika and all the other actors i like all the action scenes , even it made me cry in many scenes . It is a family entertainer. Shah Rukh Khan is back with a bang . The dialogues delivery,the action sequences, the one liner ,the screen timing everything was on the right place at the right time. You wont feel bored at any place . People in the theatre couldn't stop thereselves from clapping and whistling 😗 . If i ger the chance to watch it , i would definitely go to re-watch it . Please go with ur family or friends to the theatres .i toh love it.",
    "58": "Love this Movie...The storyline is so intriguing which can't allow the audience to blink eye during running time.The message was clear and delivered. Second time after bahubali, I saw people shouting, clapping and cheering for the hero massy avatar and even cherish his presence on screen and every time a social message delivered it was accepted with claps and shouting.This movie really makes you think from the core to raise the voice with the real social aspects without losing the story grip.You will love and cherish SRK presence in massy avatar...go watch it and you will never disappoint.",
    "59": "Vikram rathore (older SRK) the swag acting action is on another level.Deepika is as usual great her chemistry with srk is very good\nVijay Sethupati is fire unique actor\nSanya is good 👍\nSanju baba cameo is ok\nSunil is good he can be villain in future\nNayanthara is amazing she did a great great job\nShahrukh is on beast mode too good\nThe movie is fantastic from the opening scene to the end it's a blockbuster movie.Anirudh music is fantastic\nAtlee has done a mind-blowing job.Movie is going to break all the records of Indian Cinema.1 time watching is not enough need to watch it atleast 2 times more\n4.5 out of 5 for Jawan movie\nA very good movie with a great message.",
    "60": "Not sure why south make such trash .. SRK could do better - bad dialogues, poor direction and mediocre music makes this movie good for masses who know no sophistication, movie making art.I think SRK and all Bollywood actors should avoid south productions like a plague ... they are not more than glorified cartoons. Not sure what world they live in and provide such word hype to their stars and movies. When their comedy is so cheap and substandard I am not sure how can I sane person could put up with it.SRK clearly look old ... used filters to make him look young but it's obviously not working.Overall - a crap movie.",
    "61": "Just watched the movie, there is no stories , SRK just hired directors, actress and produced movies , VFX is so poor , they created hype again like Pathan and same thing is happening. They bought all the social media and publishing all the reviews.I only wish if he can act and produce some good content but it's became a habit of him creating poor story less movies.He also used this movie as kind of propaganda to save his son and punished morally the IPS officer Sameer which reflects Talk to father first before talking to Son. It's shame SRK can't swallow his Sons mistake. Don't waste your time and money by seeing this kind of acting.",
    "62": "Wonderful performance by SRK. His versatility and different looks was one of the highlights of the movie. It is a best masala family entertainer. Atlee's direction surprised me. I also liked the chemistry between SRK and Nayanthara. Deepika Padukone's role was very strong and she beautifully portrayed her role. Vijay Setupati's role was okay, i think there was a little scope to work on his role, could have been better. All the supporting actors did very good job. I liked the background music, complemented the action scenes very well. Overall loved the movie. Action sequences was too good. I will watch it again.",
    "63": "Frankly speaking it is a bad movie. Excellent actor like vijaysethupati is totally wasted. Just because srk wanted to connect with the south audience taken him. He has max 45 min screen presence where he is the main antagonist. Shahruk as usual over acted. Ridhi dogra is 20 yr younger than him playing his monther is totally laughable. But cinematography is excellent. Climax is very dull even pathaan has very good climax fight scene. A neutral cinema goer will definitely not like this much but if you are a srk fan you will like it.Other actors are just fillers . It's is khichdi of several movies.",
    "64": "JAWAN MEGA BLOCKBUSTER 🔥\"Jawan\" is an electrifying rollercoaster of action and emotion that keeps you on the edge of your seat from start to finish. Shah Rukh Khan's performance is nothing short of phenomenal as he portrays a man determined to make a difference in society. The film's gripping storyline, combined with heart-pounding action sequences, makes it a must-watch for any action-thriller enthusiast. Directorial brilliance and a powerful message about rectifying societal wrongs elevate this film to a whole new level. \"Jawan\" is a thrilling ride that will leave you inspired and thoroughly entertained. Don't miss it!",
    "65": "KThe movie was amaazing the story and everything how its gone from the very vegining it was all action and amaaaazing and bever stoped the action from action to action ... but he should have focused more on the helping others and dont aim for that evil ... that time when he aimed for his cash ... and another point i didnt get it yet and its bad for his reputation when he go to marry that girl .. he did t purely liked her so what was the point ??! Other than that he was trully roben hood ... also it would have beeen much better if in the ebd the people helped him in critical situations.AIts more to the comedey side so i cant reaaaaly talk about it , but about the action and things how they happened i lost there .. they should have but some history or date much better ,,, and the music ohhhhh its from another world ,,, im as a male got shyed how are the girls ,, its a bit hard.",
    "66": "Sheer time waste, see only if you are die hard Shah Rukh fan... Inconsistent and horrible storyline... Besides fight scenes, everything else is pathetic... Whenever story tried to build something good, a dance number always ruined the party... And the songs!!! Not a single song is worth mentioning...Actors and actresses from everywhere have been included in the story so that audience from North and South both, are captured... most of them are wasted...Only saving grace is Vijay Setupathy... The 3 stars that I gave are due to him only... In this pathetic overlap of things, only Vijay's presence creates some magic..",
    "67": "Why is this movie like 3 hours long ? Atlee the director from south has nicely copied 10 different movies and merged it into one. Being Shankar director assistant also raising that issue. So it went from a heist to revenge to love to political. Director lost his screenplay along the way. Srk is way too old to be doing these roles let alone father and son as it looked more like brothers. Nayanthara walks around with a gun 80% of her scenes with no emotion and there for the songs. Deepika and priyamani roles were by far better then the half-baked role nayan got. One time watchable. It's on netflix so take your time with it . A movie good for background noise.",
    "68": "It started on a massy note(though it's nothing new which is already beaten to death' in many South movies back in 90s infact Atlee's own movies)it creates some interest and within no time it turns into routine film which is much predictable but somehow 1st half is bearable maybe moments are light. But the real mess starts in 2nd half...lol srk was worst in looks and acting he is too artificial. Atlee as usual mixed 10-12 films like sarkaru vari pata,sarkar,Shankar movies his own movies. Vijay sethupati outperformed everyone easily as expected but routine story made it too hard for him to carry. Climax is dragged fights are ok but didn't suit srk. Maybe it works in north as it's first of its kind for Bollywood but in south its fate is sealed and it's dead. Even in north who follows South movies be it in tv,YouTube or cinema will outrightly reject this.",
    "69": "Readyyyyy!!!!!!!!!!!!Wait was really worthy....here's my unpopular underrated review.....\nIt was really awesome..u can not predict what is going to happen next....u can see beautifully vfx scenes,a never done massy action in Indian cinema, full of emotions, everything was good, all actors acted really good but father SRK one did awesome acting..... a must watch film from Indian cinema. Hope it will be the year's biggest blockbuster.Atlee showed who he is...***far better than any KGF, Pushpa,RRR,PATHAAN, like movie of the century in India....thank me later😉👍.....now go book tickets to go with family.",
    "70": "Director Atlee deserves immense praise for crafting a wonderful story that keeps you engaged from start to finish. 'The movie' is exceptionally well-executed in terms of quality, cinematography, and screenplay. However, what truly steals the show is the brilliant background music by Anirudh, which adds depth and emotion to every scene.Shahrukh Khan, as always, delivers a stellar performance, reminding us why he's considered one of the best in the industry. It's puzzling to hear some negative reviews because this film absolutely won my heart. It's a superb blockbuster that shouldn't be missed.",
    "71": "It's over hyped commercial masala movie with poor no logic. Movie watchable only for SRK die hard fans and B class audience will enjoy this action packed over masala over dosed movie.There is nothing new to hail or praise this movie and all the hypes and good reviews on the movie is certainly made by the fan clubs.The story line and father son duo reminds of poor scripted Telugu movie story lines.Entertaining and supporting this type of story scripts should be avoided.Atlee should have concentrated more on the story line and should have brought some twists in the story line instead of a narrow flowing mass dight scenes and song sequence.",
    "72": "Viewers, this is a complete waste of time. So much of unnecessary violence that's just doesn't make sense. How much can someone watch this repetitively!! The plot is all over the place, transitions are bad, just not convincing. This really doesnt appeal to an intelligent audience. I should have watched equaliser 3. Viewers dont waste your hard earned money on this, its just throwing your money down the drain. You will end up with an headache after watching this. We have seen this gore in other movies too, but it makes sense, this just doesnt!! What do I say, you are at your own if you watch it.",
    "73": "SRK is the King. Movie is a Massy entertainer. BGM, Action and dialogues are top notch. Ensemble cast is amazing. The only drawback is the pacing in some scenes and the abrupt ending. But overall it's worth every penny and SRK rules in the action scenes. With every action you get goosebumps and multiple whistle blowing experience. The cinematography is really classy what would I say I mean every frame every action is just simply mind-blowing. Actually the director has done such a wonderful job in creating this masterpiece it's a thrilling adrenaline rush ride that you will definitely enjoy there's a lot of blood and balance which can be bit offsetting for kids but adults and the young adults it's going to be a full-on action packed experience. It's a makeup blockbuster.",
    "74": "It's been a really long time since I watched a Bollywood movie because of their standards degrading day by day. I got some good reviews from my friends so thought of watching this movie.I really liked the subject of this movie which is Corruption and misuse of power by people in India. The script and acting is really good.The fighting scenes are little unrealistic but overall happy to watch the movie. This movie is mixture of a harsh truth, emotions, romance, comedy and action.There were also some surprises which means that you will never get bored while watching the movie. It's a family movie for sure as there are like two scenes but not too bad for family.",
    "75": "***NO SPOILERS IN THIS REVIEW***:\nJust got out of the movie theaters and I am extremely pleased. This movie was definitely an experience. Shah Rukh Khan returns again to the big screen for another action packed film but this time he does it even bigger and better than Pathaan. The emotions, the story line, the significant subliminal messages in the film are not only intense but phenomenal. The movie was so good that I bought tickets to watch the film again next week. In my honest opinion, this film will win many awards, if not Best Film. Very impressed on how a South Indian director brought intense an intense thriller/action to the big screen. Well Done Atlee!",
    "76": "\"Jawan is a cinematic masterpiece that delivers on all fronts. Shah Rukh Khan's presence on screen is electrifying, evoking goosebumps with his exceptional performance. The chemistry between SRK and Nayanthara is pure magic, while Deepika Padukone's portrayal adds a touch of wow-factor. The supporting female cast members shine brightly, enriching the narrative. Atlee's direction proves once again why he's among the best in the industry.Anirudh's background music is top-notch, enhancing the film's emotional depth. Cinematography in Jawan is a visual treat, a true masterpiece. But what truly stands out is the inspiring story at its core, leaving audiences motivated and moved. Jawan is a must-watch, a perfect blend of talent, storytelling, and inspiration.\"",
    "77": "Must watch ...movie of this year. You should watch this movie I'm not a fan of srk at all but this time he is a true jawan ...the moral is great about politics in India , the story line is kicking, srk vs Vijay was thrilling.great performances\nincredible visuals\nstory ends in a way to set worth a new generation of marvel stories/characters\nperfect send off for the original actorsThis film is an emotional rollercoaster with some of the coolest superhero plot lines ever drawn up. It's straight up the most epic.The crowd applauded 3 times during the movie, and stood up to clap their hands after.",
    "78": "It's actually a great movie which keeps you connected. Good thriller movie which actually shows the dark side of our planet. This movie has no connection with the incident or with how rescue operation is carried out,dont expect some sensible it is a typical bhai kind of movie where everything is possible and others are helpless because tiger is still alive,the only saving grace is the action. So when you go to watch Shahrukh khan movie you don't expect good acting or even a good script or a script at all. I don't really put my reviews but seriously they consider us as fools. These kind of movies are purely made to earn money, and now we should become smarter than them and not watch this.",
    "79": "This is one of the worst movies i have ever seen. A complete letdown of what Shah Rukh Khan can do for a movie. This movie became of hit just because Shah Rukh's other movie Pathan became a big hit. I don't know how can people be such foolish that they flocked to the theatre's to watch this utter nonsense. It feels as if you are randomly watching scenes from Tamil, etc movies. Very very bad.I can go on and on but I have lost interest altogether. I am currently watching the movie and it seems this will go on forever. 45 minutes of movie is still left and i am watching it because it is now available on Netflix. Haha. This is a crap movie. All the people behind the movie are so lucky that this stupid movie became the biggest hit of Indian cinema. Haha. Can't stop laughing.",
    "80": "There is nothing new the Bollywood has to put up in their movies ...There is lot of action but yet the movie is boring ...An emotional content of anti corruption is bought in multiple ways to cover up the non sense that runs on the screen for too long .Somewhere even Srk fades while speaking the dialogues himself ...An element of over acting is displayed by double role of Sek .Female actors steal the show by good element of acting. When SRK is killing villains no one can make out who is being killed .. It needs improvisation over action and dialogues of Srk .overall at end u wait everyone is killed and you go home soon .",
    "81": "What happened to the choices of SRK when it came to choosing quality scripts and wisely reading them?Why is he doing all these movies which are just mediocre and well average?The movie seems like a mishmash of all elements taken from a heist movie plus hollywood style action sequences to make it look more like a international movie but this is a soulless movie bereft of any logic and disjointed subplots which does not to justice to the all the premier work SRK has done in his career.There is no need of songs in a movie that conveys human suffering and struggle to make ends meet for a common man.Second half is too intense and laden with too much emotions and heavy with multiple flashbacks where there are interwoven complex subplots!!Although I heap praise on the action sequences which are really masterfully crafted and the close ups are top notch.However,this is an improvement over pathaan in terms of storytelling which conveys a social message as well.This story must have been conveyed in a simple manner all too easily.BGM is somewhat tolerable although but too much action ruins the message this movie is trying to convey!!",
    "82": "The best movie I have ever seen, edge of the seat. Perfect timing of dialogues, I enjoyed this so so so much. Oh my god SRK and ATLEE, magic magic magic! You will love every angle of it, the music is amazing, action sequences are very powerful, story is so so so good. Must watch. Family entertainment superb message for the society. Need to watch it 3 times minimum, every scene is well thought of and SRK seems to have been planning for this movie since ages. Sunil Grover's acting is fantastic, even the Villain oh ho ho, such good acting, the camera shots are good. Loved the Andheri metro references and the Bhopal Gas tragedy thing, this movie needs to be declared tax free.",
    "83": "COMEBACK by the one and only true KING of Bolly Club - KING KHAN!What a movie! Thoroughly enjoyable... not a moment of slack... packed with action, comedy and romance... with SRK's sublime acting, dancing and his retro salt-pepper look, this movie offers plethora of excitement and goosebumps... this film also hits a few open wounds that are omnipresent and pressing, yet turned upon a blind eye... even all the supporting roles are fittingly played a few big names... on top of that, a cameo by Sanju baba... again, this movie will etch history because of the combination of all flavours that make a movie super duper hit! MUST WATCH!!!",
    "84": "Finally After Long waiting SRK is back , like after the Happy new year movie I was disappointed with few movies that wasn't quit at the level of King khan , I am A big fan so I always want him in amazing movie great story telling and in meaningful movies because thats what be meant for so finally here is a movie it is great the action not over animated the CG is balance and overall the movie meets the Shah Rukh s King khan standard, I watched it in Vox Cinema today and I've enjoyed it. I gives this movie a 10+ rating because the movie also got an important message to humanity special to Indian general public which is great according to me.",
    "85": "Epic Bollywood action film Jawan is utterly preposterous from start to finish. The same can be said of Hollywood films like Fast X, which happily defy the laws of physics in an effort to up the ante, but where the latest Vin Diesel movie was a joyless predictable slog, Jawan is a well-paced, consistently entertaining slice of silliness that put a big smile on my face.Shah Rukh Khan plays Azad, warden at a women's prison, who attempts to right wrongs committed by those with power and influence. Leading a group of young prisoners, each with their own unique talent, Azad holds officials and businessmen to ransom, sharing their wealth with the poor and needy. Unscrupulous arms manufacturer Kalee Gaikwad (Vijay Sethupathi) isn't happy about the modern-day Robin Hood, and attempts to make him pay for his actions...At nearly three hours long, this could easily have been an excuse for me to catch some z's, but director Atlee doesn't make having a nap an option - when the film isn't delivering ridiculous action scenes with more OTT violence and slow-motion than several John Woo movies, he's giving his viewers spectacular, colourful, impressively choreographed song and dance numbers. The only downtime was a brief interval (the first time I've seen one of those in decades).Dashing Shah Rukh Khan is a lot of fun in a dual role (he also plays Azad's father Vikram Rathore, whose path has crossed with Kalee before), there's eye candy from numerous Indian beauties (Nayanthara, Deepika Padukone, Riddhi Dogra and Priyamani), and the cinematography is awesome. As a Westerner relatively unfamiliar with Bollywood, I cannot say how this outrageously daft film compares with most other Indian action movies, but I can say that I had a good time.Now if only Vin Diesel, Jason Momoa, Michelle Rodriguez and pals would do a synchronised dance in the middle of the next F&F film, I might be more inclined to see it.",
    "86": "I think the problem lied with south Indian direction with a north Indian bollywood style, seen so many times before. My hope were high after watching Pathan, which was so much better than this movie, mostly due to some twists and turns. This didn't have anything new, apart from two SK fighting the villains and the gun not working in the end. The things I didn't like are so many: long drawn out suffering scenes, so many hangings, regular anti-corruption with nothing new, not a well-developed villain, songs that I don't even remember, locations that aren't impressive, unnecessary slow motions. I wish the movie was more exciting, since it had two Shah rukh.",
    "87": "Just finished watching the movie. Unimaginable! This is something else!First of all I would like to talk about that direction, The direction of Atlee kumar is mindblowing\nSecondly, I want to talk about the music, the music at outstanding, the background music gives me goosebumps!And I am so little to say about Shahrukh Khan I mean he's out of the world! Indeed, this is his best film till now, you can never predict the story of this movie, the full of action full of thrilling\nThere is a cameo of Sanjay Dutt, which is outstanding, he performs better than any other actor when it's come to cameo role!A must watch film not for Indian but for the world!",
    "88": "I just could not believe my eyes when i was 30 mins into this piece of trash. How many times was this story done in the 1989s in Hindi as well as South Indian movies? Why is it being repeated shamelessly in 2023? Just because it's SRK movie? Seriously? Then, another major concern is that if this is the future of Tamil-Hindi cinema collaboration, I am happy with watching selected Hindi movies only. Let me explain. Typically Tamil action movies with superstars(like Rajnikant) have each and every action scene either in slow motion or all the vehicles are running in 1.5 times to 2 times the speed, same for bikes! Doesn't stop there, it is exactly the same with dialogues, the last words of a sentence are not over and the editor keeps switching to the other person eith such a speed that even in delicate romantic scenes there is no delicacy. Till the end, it was like watching an anime movie with no respect for a cinema viewer's sensibility. No, this movie is an action movie you will say, but the rhythm of the action, dialigues and Editing is something that probably the Tamil audience is used to watching and I respect that fact. Just that the editing and rhythm is totally different from that of Hindi movies, and Hindi movie viewers are used to a certain rhythm of dialogues, movements, a certain gap between dialogues, etc etc. This Hindi movie directed by a Tamil director feels like you are watching a Tamil movie dubbed in Hindi, in each and every scene!! Throughout you get a feel you are not watching a Hindi movie at all, something is alien, something is missing. All the songs except for the end title one. Do not sound like Hindi movie songs either. If this is how the future of Tamil Hindi movies collaboration looks like, please give us a Hindi movie directed by a Hindi language understanding director only, please please!! This movie was a torture to watch. Hope you understand Hindi movie producers!! Thankyou!!",
    "89": "SRK is passionate about cinema and wants to take Indian Cinema ahead but looks like he is saddled with several people who are less passionate. How can one explain this slow motion tripe of a movie. Why so much slow motion? Because the cost is low and it serves as a tangent for low cost stunts and VFX. The only good and thrilling shots are of a Metro careening at high speed in Mumbai and mind you that is not in slow motion. There is no action set piece that is a wow, this is great. Slow motion action is cheating the audience. I am sure SRK wants to push his movies to Mission Impossible level but alas at the moment cannot do so. The next is the thin plot that has several plot holes. What about the violence? This movie is so violent that it would have been an automatic R rating in US if it had been a Hollywood movie. With a star cast of more women than men, this would be a first but when you come to individual roles, none of the women have a meaty one including Deepika Padukone. Sincerely wish, Deepika comes back to Piku days. What is she doing in this nonsense? Finally the villain played by Vijay is a caricature. He does not look at all menacing, in fact his right hand, Murad is more threatening. It is hard to say which one was more mediocre, Pathaan or Jawan. SRK needs a Rajamouli to up Indian Cinema, wish that happens soon. 2 stars for SRK's energy and passion!",
    "90": "The movie can be judged from 2 perspectives, the first one is emotional and the later is rational. Let's judge it from the second one as it is often a rare element to witness.This movie is a disaster. All the basic pillars which make up the foundation are hollow. Acting is cringe af, story & script is a copy paste donkey work done by the director. Music is average, action scenes are good but stand on baseless & senseless legs. You continuously cry inside why I purchased the ticket. Please give me a refund.In today's world where the best movies and web series from around the world are upon the tip of your thumb, this movie fails to hide its weakness. The only factor driving the whole setup is srk, similar to pathan. The moment you take srk out and put another actor in, the movie falls.Conclusion : Srk is really a cinema God. Only he is capable of driving such soul-less movies to the destination known as box office hits.",
    "91": "Sameer lodayaThe movie is amazingly driven by SRK itself as only stars like him can do thisWhat a entry of SRK simply electrifying it gives you another level of vibration he has acted marvellously in all aspects like action ,romance ,humour, wickedness which will keep you in high spirits of entertainmentLet's not discuss about content as it's typical South Indian types of high action and in super speed pace..songs were not at par..atlee has given one of his finest direction and took out the real heroism from SRKThe movie should be watched in single screen with masses where you can enjoy dances ,whistle ,shouts which gives a pure masala movie feeling.",
    "92": "I can feel the angst of the critic- killing protagonist of Chup, after watching this.I have come across so many reviews of this pertaining it to be the best action movie / biggest blockbuster/ film with relevant political messaging built in that I had expected the world.However, the film is shockingly mediocre, laughably ludicrous, devoid of logic with almost a half a dozen sleep inducing songs. It is worse than Gadar 2, which suffered from a lack of execution although it had some claims to a storyline. It has relevant political messaging but the story around it is so convoluted that it is almost a Gordian knot, to untangle.The first 45 minutes are actually the best. They are gripping and set up a tantalizing tale. However, as soon as this moves to inside a prison, it crashes and burns . It stretches credibility and becomes a parody of itself in the second half.Nayantara, Vijay Setupati don't have much to do, except to swoon and snarl, respectively.Shah Rukh has mastered the art of generating an otherworldly buzz around his mediocre productions. Once upon a time, he destroyed the Indian film industry by selling romantic dreams. He is intent on doing the same via the action route now.One of the worst of this or any other year.",
    "93": "The 8.1 rating is outrageous. I'd expect this to be closer to the negative numbers, but whatever.As always, the artless director atlee produces a hotchpotch of previous tamil movies. It literally feels like he combined the scripts of theri, mersal, and bigil, added a bunch of laughable set pieces to justify the budget, and hoped Shah Rukh Khan would save the movie. Spoiler: he doesn't. The rave reviews just show how starved North India is of quality content, or how deluded the Shah Rukh Khan fanboy is.Even the music is bad. This has to be Anirudh's WORST. Its a shocker to see how the man who gave us the Vikram, Master, and Jailer soundtracks (3 best soundtracks in Indian cinema imo) produced this uninspired garbage.The criminals Shah Rukh Khan does his heists with are incredibly irritating, and only are written for a cheap 'girl power' message (Bigil, anyone?) to boost its critical reviews.How srk picked this script is beyond me, I don't think this even qualifies as a Vijay film in terms of dumb writing.",
    "94": "Okay from the trailer I was expecting a good action thriller film but this one is one of the most terrible films I have seen all year the screenplay is inconsistant the first half of film it's tolerable but as the film went along it got unbearable Shahrukh Khan has given in one of his most stupid performance.To sum up in few words the action the choreography the cinematography everything works but the only thing that matters doesn't work that are emotions the film is devoid of it.SRK 57 is again playing a role of another SRK who is 32. Deepika Padukone 37 playing a role of SRK's mother while almost the same age Nayanthara 38 playing the role of SRK's wife, also Riddhi Dogra 38 playing the role of kaveri Amma who is like mother of SRK.Jawan isn't a movie but it's a 3 hours long advertisement of explaining the benefits of using anti ageing cream with before and after examples.",
    "95": "The characters are all over the place, the plot is wafer thin and the hype around the movie is so loud that it has drowned all those real voices that are tearing their hair apart.Riding purely on the status appeal of SRK, the movie tries to build on 90s theme. Not sure what was the Director Athlee trying to achieve but this might end up his weakest movie in the last few years.Great actors like Vijay Sethupathy and Nayantara is totally wasted. Sanya Malhotra becomes a side kick when she is currently doing lead roles and the songs are the worst from any SRK movie. It sounds like a reverse dub of South songs being literally translated to Hindi.Adults and kids slept through the movie as it become a hachet job by SRK and he started Hamming badly in the second half. After the high of Pathan, this takes him backwards and he ends up doing crappy movies.",
    "96": "'Jawan' is a terribly made film about a group of vigilantes who hold the government to ransom and then surprisingly make it do good deeds. All this is just re-treaded territory, first ignited by visionary mass director S. Shankar, and now Atlee, his former assistant director, who does his usual lazy shtick by simply rehashing the old stuff with overboiled, done-to-death, screamingly melodramatic direction - I badly wanted to exit the theatre at the 1.5 hour mark but forced myself to finish the nearly 3 hour punishment.It is painful to see storied superstar Shah Rukh Khan degenerating so badly in the later decades of his career. This artiste who toplined such excellent movies as DDLJ, Dil Se, Devdas, Asoka, Swades has stopped caring about quality from a long time and only lusts after more box office triumphs no matter how shoddy his recent films are. Notice he has long since stopped working with good directors and the few good ones he has recently worked with have been compromised by poor collaboration (Imtiaz Ali - 'Jab Harry Met Sejal').Vijay Sethupathi's acting deficiencies are severely exposed, while the performances across the board are mediocre. Good taste and cinematic quality are repeatedly butchered in 'Jawan' in the relentless hail of gunfire that drags on here - SRK meanwhile has his champion sights firmly fixed on the Rs.1000 crore box office mark. Upnworld.",
    "97": "Nowadays, the audience is ready to watch any film that has a touch of patriotism without thinking, as if such films are the identity of your patriotism. Bollywood and South makers have also understood this very well. After Pathan Gadar 2, now Jawan is also a film of the same series. This time the director has served the audience a mix of South, North and Hollywood, as some concepts have been taken from Money Heist and some from South films like Thunuvi and old movies. Whenever the film comes on the silver screen with South flavours it is entertaining and yes over too.Young Shahrukh Khan part in movie is so dull and speed breaker for movie.This movie is for Shahrukh Khan so don't think director give chance to other characters.I am also disappoint to saw hat for Shahrukh Khan director Aitlee waste Vijay Sethupathi but after all this is Bollywood movie and Shahrukh Khan is the producer.Well at the end you can watch for one time and will prove your patriotism.",
    "98": "Only good thing about this movie, stolen scenes from other movies and added together. A complete disappointment from Atlee. Never imagine Atlee will make such a disaster.Never expected much from S R K, he always copied legends. Atleast John Abraham gave some backbone to Pathaan. Anyone watching international movies can get bored right from the opening scene.N a y a n t a r a did some good acting.6 girls input is phenomenal.O v e r a l l, the movie had potential of some good plot, but A t l e e completely blown it away.Complete waste of time and M o n e y. A B s u r d songs with no link to story line.",
    "99": "Jawan- A heavy dose of social message conveyed in a succinct and powerful manner.It's out and out king khan's movie with full feast to his fans. Been ages since I saw his real depth in acting (like in Baazigar, Darr and Chak De), but glad to see king khan is back with full bang.This movie showcases his true heroism that only Atlee could bring out. From action sequences, signature style, anger, emotions, cool demeanor with a surprise package at the interval- SRK shines big and displays his stardom with a whack!Atlee hits key social points with a strong plot throughout, creatively crafting and connecting current issues that many common person can relate to.Screenplay is crazy quick and zooms past like a Tesla Plaid S.Vijay Sethupathi is simply amazing, and displays his spectacular talent in the most wicked and funny way.Nayan Taara's swag and fight sequences are clap worthy. Rest of the cast has supported well.Jawan will surely create box office records and the money will clock like a dhamaka!",
    "100": "I went in to see a mass movie featuring SRK in an unprecedented, larger-than-life role. Little did I know that I would be in for much more. Atlee has not only met but surpassed all expectations, while RCE VFX studio has set a new benchmark in Indian cinema. Despite its 160-minute runtime, the movie breezed by like a gentle gust of wind.This movie will took you to old Bollywood where it fearlessly held up a mirror to the establishment and urged the audience to demand more from those in positions of power. SRK during the 3rd act almost breaks the fourth wall and speaks to his fans, through his art. Some might think this is not what they signed up for, and it's too political however Jawan is urging you to demand excellence from your elected representatives, regardless of their affiliations..As fas as, action is concerned, not counting the last Vijay-SRK combat scene which was typical Atlee no-attempt-to-hide-cable action scene, this movie boasts action set pieces that could rival Hollywood. One car chase scene gave me vibes of Fast and Furious, while another one of Taken with its fast cuts. Additionally, a border skirmish mission scene is expertly edited with lengthy shots.Overall, this movie needs to be watched in Big Screen.",
    "101": "If you're considering watching \"Jawan,\" I'd strongly advise against it. This film, which boasts a runtime of a mind-numbing three hours, left me utterly bored and disappointed. \"Jawan\" lacks the essential elements that make a movie enjoyable, and there's not a single surprise to be found in its lengthy duration.To begin with, the movie's pacing is painfully slow. It takes an excruciatingly long time for the plot to develop, and even when it finally does, it fails to capture the audience's interest. The story meanders along, with endless scenes that seem to serve no purpose other than to fill time. It's as if the filmmakers were determined to stretch a thin plot into an epic saga, and the result is a tedious and unengaging narrative.One of the most frustrating aspects of \"Jawan\" is its lack of surprise or originality. From start to finish, the story follows a predictable and clichéd path. There are no unexpected twists or turns to keep the audience engaged, and it feels like you've seen this story a hundred times before. The characters are one-dimensional, and their actions and motivations are equally uninspired. It's a classic case of a missed opportunity to bring something fresh and exciting to the screen.The film's length is also a major issue. At three hours, \"Jawan\" overstays its welcome by a mile. It's a test of endurance to sit through such a long, uneventful movie, and by the time it finally reaches its underwhelming conclusion, you'll be left wondering why you wasted so much time on it. There are plenty of great films that manage to tell a compelling story in under two hours, so there's no excuse for subjecting the audience to this kind of marathon.The lackluster performances by the cast don't help matters either. Despite the talent of some of the actors involved, their characters are so poorly written that there's little they can do to salvage the film. It's clear that the script itself is the root of the problem, as even the most seasoned actors can't breathe life into one-dimensional and uninteresting roles.Additionally, the film's technical aspects, such as cinematography and editing, fail to make up for its narrative shortcomings. There's nothing visually stunning or innovative to grab your attention, and the editing doesn't do much to improve the pacing or flow of the story. It all feels like a missed opportunity to create a visually striking and emotionally resonant film.In conclusion, \"Jawan\" is a tedious and uninspired movie that fails to deliver on multiple fronts. Its excruciatingly slow pacing, lack of surprises, and excessive length make it a painful viewing experience. If you value your time and entertainment, I'd recommend giving \"Jawan\" a pass and seeking out a more engaging and fulfilling cinematic experience elsewhere. There are countless better options out there, and this film simply isn't worth the investment of your time.",
    "102": "When grade A talents of Bollywood meet the true blue storytellers from the South, the result is a Pan-India Blockbuster! This is exactly what Jawan is. An extraordinary massy entertainer with an absolutely tight script. Unlike other mass movies, this has an interesting story, a fluid screenplay and the usual brilliant performances of the best of the best talents in the country.If Pathan was SRK's comeback, Jawan is his second coming and guess what? It's even grander. This man appeals to not just the mass loving bachelors of this country but also the girls, women and children alike. When SRK said that he is the last true 'superstar' of Bollywood, I felt that while watching this movie.Vijay Sethupati is splendid in his role and his witty one liners will make you chuckle. At the same time he is menacing. So good job by him. The rest of the cast, the girls, Priyamani, Sanya Malhotra and the others complemented the protagonist spectacularly.The action sequences pack quite the punch and they are only elevated to another level with the BGM designed by the supremely talented Anirudh. The songs are fantastic and when Zinda Banda played, man, the theatre 'Erupted'. I couldn't get enough of this movie with just a single watch. I will be watching this absolute bonkers of a movie once again.Talking about the main girls of the movie, Deepika in her limited screen time left quite an impression on me. She looked divine and radiated the cinema hall with her presence. Absolute A stuff as I said before. Nayanthara, what to say about her. She is one of the finest leading women of Kollywood and in Jawan, she is no exception. She looked gorgeous in every scene, did action like a boss lady and delivered a knockout performance.This movie has 'class' written all over it and is in line to become the next true blue Blockbuster of 2023. The hype was real! Go without a second thought to watch Jawan.",
    "103": "I saw this first day last show in a suburban theatre with my entire family and extended family.The experience was phenomenal. The whistling, the shouting n cheering was epic.Sharukh gave a commendable performance n the lead actress is a total eye candy.Every public servant, politician and voluntary sector worker should be expected to watch this film. A lot of it is not easy viewing (the farmers n kids' plight) but the message it gives about today's society is compelling.In fact it shud be compulsory viewing for all high school students cos they r the future fellas who's gonna vote.As far for the film it is a masterpiece from my point of view. It shows you just how corrupt the medical system is and how the poor farmers are suffering.A good part of the blame is on the damn politicians. It is also another reason why it is so important to go and to vote in the upcoming elections .At worst the film might be preachy or sentimental, but at best it is the most authentic thing SRK has done since My Name Is Khan.When the press n voters bows down to the authorities, the authorities will mistreat the citizens.",
    "104": "Atlee much like his master director Shankar who made Hindustani/ Nayak/Aparichit is known to make movies that question the system. Either a vigilante fighting criminals or an underdog who fights the capitalists.Although Bigil was disappointing and Mersal was average, Theri very much exposes his vigilante mindset.In Jawan, he mixed up all his usual plots put it out on a typical template format he uses for his Vijay films but on a bigger canvas, better visuals and stunts and quick paced edit in what manifests not just a love letter to SRK but a celebration of action masala films.This is perhaps the most wholesome entertainer Hindi film industry had in almost a decade. Reminds us of the industry that gave action flicks like Sholay.Atlee did infact packaged in his usual format and with the cast and crew it does feel like a Tamil masala film but with a charismatic Shahrukh Khan in the lead.Anirudh's songs were a hit and miss with some entertaining and some just below average. But the background score was phenomenal- Anirudh excels in his usual game- elevates the action set pieces to a much higher level.Action choreography and cinematography was spot on- stunning visuals and well coordinated fights keep you engaged.Atlee wins on his Hindi directional debut - like a King, with the King.",
    "105": "Tone, Script & Story: The movie is an action thriller with intense and engaging story. The story is about how the truth of major Vikram is bought in front of the world. The villain is a rich business tycoon who plays by evil terms. One could totally relate with it and thus the viewing experience goes to another level for oneself. Thanks to writers & additionally director to present this masterpiece. The viewing experience was so intense that it bought tears to my eyes on more than one occasion.Direction, Screenplay, Cinematography: I am not that great fan of action but here action along with storyline got me jumping in my seat. The metro, the jail, the partners, the chase, the villain with all its evil was a dish served with essense.Music: Music was average. My favorite track took place in jail when the son was born (Aararaari raaro). It went so well with storyline.Acting: Everybody acted well, but the screen presence and delivery of Father was just another level. SRK looked like a hunk. He aced.Final Verdict: For me it was as if the movie was made particularly for my entertainment. I enjoyed it.",
    "106": "Om Shanti Om + Fan + Dhoom + Main Hoon Na + Chak De! IndiaIf you combine elements from each of those movies, with social causes, you will be presented with the movie Jawwan.Started off well, keeping the audience engaged, but the more i watched the movie, my iq kept dropping.There are just too many subplots to keep track off, and directors think having long action sequences with loud music in the background is what makes a movie a hit.Personally, none of the side characters performed any well, you just went to see the movie for SRK.I think the hype and love for the actor has caused people to just be overexcited by his screen precess, and they will write and applaud the movie like it's one of the best things they have watched.I left without watching the ending, but the film after intermission is just mind-numbing. Furthermore, I would rather watch any old Hindi movie that has must better emotions, acting and story line.Rocky prem kahani is a much better watch, despite being pretty bad itself.Also, the movie has too many dark themes, which is not advisable to watch for a \"pg13\" movie.SRK will continue to present such boring films because he has mastered this formula for a hit movie:Loyal fan base + add south elements to the movie + action sequences which we have seen a million times and release the movie in 8 different languages to really collect that box office numbers.I personally think Raees was srk's last good movie and one should skip this, honestly.Rather watch Billu barber if one wants to enjoy SRK screen presence.",
    "107": "What a great film with multiple social messages throughout the whole film. Shah Rukh Khan's screen presence was unbelievably classy. Anirudh's background score brought the film to another level.I felt like the film was a little rushed, everything was pushed quickly especially Nayanthara and SRK's portions (Chaleya). Yes there's definitely a lot of south movies in this film but who cares, it's a commercial masala film, you'd want to enjoy and celebrate watching this one so avoid all negative reviews and bring your family along and enjoy this perfect commercial film in theatres. Atlee has given another blockbuster film for the film industry. I also felt like the climax was too long could've straight away came to the point.Really was amazed by Atlee's team for giving a Hollywood level Cinematography and action scenes. Overall I enjoyed it very much, 8/10.",
    "108": "SRK, SRK, SRK!!!! My hero, my star, my world! I love you SRK sir! Loved loved loved you in Jawan totally!! You killed it as both father and son! So hot and handsome!!!Vijay Sethupathi sir was just amazing as always!!! He's the best villain! His scenes with SRK set the screens on fire!Nayanthara ma'am, her chemistry with SRK was just beautiful and lovely! She looked so beautiful and loved her in the action scenes! Such a fantastic actress!Music and BGM were just amazing!! Anirudh sir, killing it as always! Loved each and every song, the BGM gave me goosebumps!Atlee anna, indebted to you forever!! Thank you for showcasing SRK sir in the best massy avatar ever on screen!Go and watch Jawan in theatres only!! Don't miss it!",
    "109": "Jawan - Shah Rukh Khan's High-Octane Action Thriller.Review by M. SirajShah Rukh Khan's Jawan was the most anticipated film in Indian cinema directed by Atlee, the second hit followed by Pathan for SRK within 6 months' time, Atlee as a director put his foot stalwartly in Bollywood, fascinated the audience with his first and most exciting Paka Hindi commercial debut film which received a lot of attention for the fact that, when we heard that Bollywood Badshah Shah Rukh Khan is playing the lead in Atlee's film, every audience expected what jawan will be, and that's exactly what Atlee has given them. Jawan, told by Atlee in his style of vengeance story which has been seen many times by the audience in many ways, but Atlee style with songs, stylish dances, love, affection for our country, emotional moments, vogueish action scenes, eye-catching colourful scenes and stunning canvas made the film inimitable. Shah Rukh Khan plays dual roles, Vikram a soldier and Azad as a Robin hood in disguise whose main job is to robe the rich to help the poor, Atlee, clearly gives a strong political message, touched exclusively some social issues, including corruption, Farmer suicide, even he conveyed the true fact of Dr. Kafil Khan's subject in a reverberating manner with a female character. Atlee has made the film with the audience in mind who has given priority to the general audience and has a clear sense of what they expect from him and delivered exactly what to do to get them thrilled for whistling goosebump moments.Jawan is a very engaging film; he has done an exciting expression of a commercial storyline without allowing the audience to think too much for a single moment. Written with Shah Rukh Khan fans in mind, he precisely merged all the elements for a mass entertainer, whereas he has overcome the minor shortcomings of the script with the excellence of its visual language, starting from the introduction of SRK. He not only made the audience laugh, but he minted some emotional scenes also, Shah Rukh Khan's performance was very stylish and his looks, expressions and dialogue style were used in a very good way with some highlight's combination and emotional moments in an appealing manner. While the director succeeded in connecting the characters emotionally with the audience in the first half, in the second half, audience may not bother for the logic, SRK and Atlee wrapped the audience without even giving them time to breath. Shah Rukh khan with his pretty gym fitness, was able to capture the audience in a very rousing way and thereby move them along with the film. Even at this age, Shah Rukh Khan's energy and impact on the screen with his looks, body language and mannerisms are miraculous. Vijay Sethupathi a never before type of Villain enhanced his role seamlessly, took the audience by surprise with his easy-going acting style as usual, Nayanthara was seen for the first time in the film validating her nickname Lady Superstar with her action scenes as well as a lovely mother of a child. The visuals were gorgeous while the songs composed by Anirudh, the darling of South Indian music, drudged well to refresh the audience with energy and enthusiasm. His contribution to the film worth to be mentioned, whereas the editing is at its best to keep the two-hour film moves at a rapid pace. We can say without a doubt that Jawan is a perfect mind-blowing entertainer to be experienced only in theatre.Great work by Director Atlee who presented SRK in a superb manner how the audience wants to see him in the big screen and SRK again proved he is the King Khan.Review by M. Siraj.",
    "110": "This is the first time I'm reviewing a movie. Generally, I have a low bar for Hindi movies but this one was so flagrantly awful, stunningly incoherent, emotionally confused, and shamefully crafted that I had to leave this review.This movie makes no sense. There's not a single redeeming quality: the premise is ridiculous, the acting is comical, the characters and their decisions are bizarre, the underlying narrative is completely incoherent, and the movie sways chaotically from jokey to dramatically tragic. I can't fathom how none of the writers, producers, directors, or actors realized this as they were making this movie.There is a supposed message of the movie, which quite frankly is shallow and can simply be boiled down to \"voting and asking your government\" questions is important. No duh, is that supposed to be insightful? Regardless of the supposed \"importance\" of the message, all the other problems of the movie render it completely inert and hollow.Please do yourself a favor and vote with your money and don't watch this movie.",
    "111": "King Khan's new outing, written and directed by Atlee is about a vigilante and his 6 member women team, taking matters into their own hands to get justice. Ironically, the common guy related to every issue the gang tackles is Kaali Gaikwad. As Kaali retaliates, a ghost from the past is brought back from the dead and how does the goodie gang mete out justice while throw some speeches at the society, forms rest of the story.Atlee's screenplay is basically mishmash of all his films before and his usual signature move of lifting scenes / plot points from several others. What Jawan has is multiple flashbacks and a story fit in between them which leaves SRK to do the heavy lifting which he does with aplomb. The screenplay gets too repetitive with those flashbacks with one issue after another is tackled and even resolved in unimaginative way, only to be saved by the charismatic lead and well conceived actual sequences.The emotions look forced throughout the film and not once it feels organic. So rather pointing out the flaws in the writing, I would prefer pointing out why the film was perfect to watch on the big screen. RCE delivers big time with the grand visuals and the fan service done here is near perfect. As much as the screenplay tires you out, SRK doesn't and we get double dose of him. There's a particular chase sequence in the second half which leads upto a special cameo and this whole segment alone makes it a worthy visit to the theater.Coming to the performances, it's an all out Shah Rukh Khan show. Nayanthara gets an insipid role, she looks stunning on screen but she deserved more. The six member gang, only three of them get a flashback each so in that order, Lehar Khan as Kalki, Sanya Malhotra as Eeram and Priyamani as Lakshmi leave a mark. Among other three, Sanjeeta Bhattacharya as Helena the hacker and Girija Oak as Ishkra the artist get a solid intro shots but later they don't get much to do. Deepika Padukone in a special appearance is passable as again, she doesn't get much to do. Vijay Sethupathi as the main villain brings some humor in the climax but it is a one toned character requiring a one toned performance and in the end, it just feels that he wasn't utilized well.Anti-establishment stories need much more than overdramatic scenes stemming out of a gruesome death. One wishes, Atlee to have learned better from Shankar. If he had, then he would've been the master by now instead of failing to deliver a credible screenplay. Here's hoping for Atlee to get better with his craft. Original or not, he has it in him to tackle this genre and all he needs is to rely on his script more than the superstar he signs to be the lead.",
    "112": "The theme of Jawan is based on a \"revolution\" where oppressed souls form a lethal team and revolts against the corrupt system of the country.Jawan has its moments, but the film is average with over the top action sequences, Atlee missed the trick, If he have stick towards the drama tone, the film could have been the best film in the history of Indian Cinema, as he had Shahrukh Khan but he opted to choose the route of mass action Entertainer, which is a total miss with me as I had already watched Gabbar is Back with a little bit flavour of Aakhiri Raasta.Coming to the hysteria which Shahrukh Khan created, I find him exaggerating the Pathan phenomenon, his dialogue delivery is same with the tone of voice which irked me to the core, a deep throat to make it like aggressive. He had two characters in the film which he nailed in some parts and totally flat in other especially with Azad.Vikram Rathore was force to reckon, but I was thinking that If Salman had done the same, he would be trolled with all the \"Bhai - Verse\" memes but as he is Shahrukh Khan, he is spared.Action Choreography is good but not that spectacular as it is presented to be expected. Music kills the momentum of the film & Vijay Sethupati was under utlulized.Don't expect anything spectacular and you'll enjoy the film.",
    "113": "20 years ago this movie should have received a rating of 6. Today 3 is more than enough. Don't fall for the high ratings of the movie. Such a waste of money. They should have used their message on themselves and not wasted the money in making this movie.Some actors have performed well. The situations presented are so old fashioned and such melodrama is cringe.There are moments when you think that this movie would redeem itself but not it does not even try and keep falling into the pit it digs for itselfShankar's Indian was such a new and novel concept and worked, but not today. Actors have some their part. Everyone did really well. Shahrukh, all the girls and Vijay Sethupathy as well, but the story was such a dud. Songs are also so old fashioned and BGM is so overdone. Big fail!Definitely give it a skip.",
    "114": "Jawan is a stylish action thriller that features a star-studded cast, including Shah Rukh Khan, Nayanthara, and Vijay Sethupathi. SRK is in top form, as he delivers a powerful performance as a secret agent on a mission to save the world. The action sequences are well-choreographed and exciting, and the story is engaging and suspenseful. However, the film does suffer from some pacing issues, and the ending is a bit predictable.Here are some specific things I liked about the movie:* SRK's performance: He is clearly in great shape and he brings a lot of energy and intensity to the role. He also has great chemistry with Nayanthara.* The action sequences: They are well-choreographed and exciting, and they really showcase SRK's skills as an action star.* The visuals: The film is beautifully shot, and the action sequences are particularly impressive.Here are some things I didn't like about the movie:* The pacing: The film can be slow at times, and it takes a while for the story to get going.* The ending: It is a bit predictable and anticlimactic.Overall, I enjoyed Jawan and I would recommend it to fans of SRK and the action genre. It is a stylish and exciting film with some great performances. However, the pacing issues and the predictable ending hold it back from being a truly great film.",
    "115": "Once more, the indomitable SRK mesmerizes in \"Jawan\". From the very first scene, the narrative grips you, pulling you into a whirlwind of suspense so intense it's almost tangible. The film's pulse races in tandem with yours, effortlessly maintaining momentum throughout. Its expertly crafted screenplay ensures fluid transitions between present-day sequences and poignant flashbacks, creating an intricate tapestry that unfolds with seamless finesse.Every actor in the ensemble cast shines brightly, delivering performances that resonate deeply. Yet, even among such brilliance, the cameos by the iconic Sanjay Dutt and the ever-enigmatic Deepika Padukone stand out, leaving an indelible mark.But it's not just the performances that captivate. The film's direction is a masterclass in cinematic storytelling. Paired with a haunting background score and razor-sharp editing, it elevates \"Jawan\" to a league of its own. For aficionados of action and drama, this film isn't just a recommendation-it's an experience, a journey you wouldn't want to miss.",
    "116": "Jawan may be shot mainly in Hindi, but it is a Tamil mass film in all its essence. Atlee is known for basically copying ideas from other famous movies and making them in his own style for his favourite star. Jawan is an amalgamation of many such movies, including his own films. But the core is the man against system idea which was popularized in this particular form by director Shankar and since then it has been embraced by South Indian movies. The first half had a few interesting stuff going on but it was kinda boring me. I've heard about how Atlee dismisses normal logic from how people talk about his films like Bigil which is even more apparent here. Knowing this and being an SRK fan, I was expecting stuff in the film that defies logic. Overall it didn't affect me too much but the first half had a lot of such things that continuously happened that made it hard to enjoy it. Not using logic to be entertained is fine but the film has too much story in it and most of it doesn't have any logic. It's following too many formula-driven story ideas at once without properly integrating them. But once the interval block action sequence started the movie turned around for me. From there onwards it was a very entertaining movie and if you can watch it with a great audience it will be a great experience.But it is to be noted that, there's so much story here, but no real characters. The characters are not at all written with depth but everyone is given certain visual flairs to make it very appealing. Nayanthara's character felt so weak but the way she is presented visually through the action scenes kind of makes you forget that.Some dialogues and scenes kind of felt like a personal message from SRK which seamlessly blends with this kind of film. Maybe that's why he wanted to do such a south-style film.All in all, I thought it was an average to okay film because I am an SRK fan and enjoyed watching his action scenes and song sequences in the theatre.If Die Hard is a Christmas movie, this is an Onam movie 😇",
    "117": "Time really flew while watching Jawan. It is amazing to see Shahrukh Khan presented in a form that was never seen before. His older avatar is especially badass and steals the show. Baap baap hi hota hai! All his entries are a hoot!! There are several clap worthy and seeti maar sequences in the film.Talking about the other performances Deepika Padukone shines even in a special appearance. Nayanthara makes an assured debut in the Hindi cinema. The rest of the girls specially Sanya Malhotra is brilliant. Vijay Sethupathy has done a pretty good job as the main antagonist but expected more from him. Sunil Grover is wasted in a small role.Anirudh's background score amplifies the impact of action sequences which have been executed brilliantly. The music goes well along with the flow of the story with songs Aararaari Raaro and Zinda Banda being the pick of the lot.Apart from the technical aspects the film makes a strong statement raising several relevant issues. It was really nice to see Shahrukh raise his voice through his craft. Jawan is a tight slap to our system showing it the mirror. In one of the sequences he even talks straight to the audience urging them to use the power of their vote wisely.Kudos to the entire team 👏\nOverall Jawan is a technically sound film with the massiest SRK and an important message. The only flip side being the convenient screenplay!",
    "118": "I went to watch this movie because of the good IMDB rating. Man, why can't Shah Rukh Khan do one grounded movie that makes sense?It was just bonkers. I love SRK. And I got to watch him in action and that's all that I liked.The plot is over the top. Everything is exaggerated. Apparently life at a women's prison is extremely nurturing. And getting smashed in the face several times with a massive lock only gives you a nosebleed.And the music score was god awful. Not talking about the songs. The music accompanying the scenes... Tone changed every few seconds... It was an assault on my ears...Come on Shah Rukh jee... Do one good movie... Just one....",
    "119": "A must watch massy film which attack the system.Note:- This film is all about SRK & his different looks.SRK has played dual role, namely Vikram Rathod(father) & Azad(son). SRK is just mesmerizing with all of his looks & action scenes.Deepika Padukone as Aishwarya is wife of Vikram Rathod. Her role is small but quite effective to move the story ahead.Nayanthara as Narmada Rai is wife of Azad. She's a hijack specialist police officer of Mumbai police. She has done some good action scenes. She looks pretty in romntic scenes & angry in the hijack scenes.Vijay Sethupathy as Kali is the main antagonist. He has again proved his acting range in various scenes. He also delivers a mesmerizing performance as Kali Gaikwad. He's brutal & mercyless. He doesn't want anyone to oppose him.Sunil Grover as Irani is effective. Nobody's able to understand his mind unless he unfolds it.Priyamani(as Lakshmi), Sanya Malhotra(as Eeram), Sanjeeta Bhattacharya(as Helena), Girija Oak(as Ishkra), Lehar Khan(as Kalki) , Aliah Qureishi(as Janvi) are effective in their characters. They look good in their characters.Riddhi Dogra as Kaveri(Kaveri Amma) looks a bit weird. She's not the correct cast for this role. She looks convincing as young Kaveri. But she as aged Kaveri isn't convincing at all.The actors playing the friends of Vikram Ratod are convincing in their role.Sanjay Dutt(as Madhavan Nair) in his cameo role, leaves an impact with his acting.Music composed by Anirudh Ravichander is attractive. The music doesn't reduce the speed of the film. But it blends with the speed of the film.Songs like 'Zinda Banda' , 'Chaleya' , 'Faraatta' , 'Not Ramaiya Vastavaiya', 'Jawan title track' leaves a good impct on the film.BGM is fantastic & gives good support to the film.Action scenes are very good & looks fresh. This film has raised the bar for the action scenes.Editing team & VFX team has done a fantastic job. The VFX, CGI all are very neat & doesn't give chance for complaint.It's a must watch film for all.",
    "120": "*JAWAN (2023) -*I am sure you might have already watched it.. but if haven't yet then believe me; it's not a film, but a FESTIVAL so Celebrate it with yours. It's a MUST WATCH. A towering starcast, never seen before actions, power packed storyline, emphatic thrills and exceptionally well performances make sure you get the worth double of your spent money. It's a massively massy film and Paisa Wasool by all means.Who am I to make comments for over 1000Cr persona, the *King Of Bollywood*, the SRK and his magnum opus performance! I am out of words for him here. Nayanthara is magnificent and stylish, Vijay Sethupathi is brilliant and dangerous in his villainous character, Deepika Padukone is beautiful and elegant, Sunil Grover is fair in his small role, there's a team of 6 ladies is strong and impressive AND film has an interesting Cameo too.I am NOT going to reveal the storyline because it is such a crucial to be felt inside the theatre ONLY! It has many layers and one after another unfolds in captivating ways which keeps you mesmerized till the end. Also without mentioning any spoilers and keeping it short I would say; it's an out and out SRK's show! It's a pure Masala Film with all required spices like Huge production values, Outstanding Actions, Sensible Emotions, Excellent Music, Multi Layered Storyline, Spendid VFX, Enthralling BGM, Some Exceptional Acting, Stylish and Slick, Little Comedy and a dash of Patriotism.Film is very entertaining and has everything you are expecting; and that too in south style. Yes! Atlee's direction has given the film a southern edge. It's a complete family package and can be enjoyed with kids and elders too. There's hardly anything I observed otherwise and I would like to rate Jawan 4 / 5 (🌟🌟🌟🌟). First half of the film is better than what comes after interval, plus climax contains less thrills and magnitude as compared to what has shown till then in the film (hence I've deducted one star too for the same). As said it's a compulsory watch and would offer much more than your anticipation.*What I Liked Most? -* Shahrukh Khan in different avatars.*P. S. -* Good To Go Girls? Ready Chief!*By - NIRAJ SOLANKI..!*",
    "121": "It's an unapologetic celebration of the myth, the man, the legend that is SRK. Atlee not only shines as a director in his ability to present SRK in his 'mass-iest' avatar yet, but also in his knowledge of how to use colour,his sense of pacing a sequence kudos to some masterful editing and where to put his actors in a given frame, some topnotch cinematography.Though having exhilarating action sequences with some applause worthy VFX work, some strong, repetitive but neccesary social commentary, the heart and soul of this film has been kept grounded in its script - the films strongest yet most problematic part, let's talk about it.There is an attempt to fit a web-series worth of story in a movie, which results in the people behind the camera having to juggle it's characters, handpicking ones to give love, resulting in others getting absolutely nothing.There are moments when the script demands to sit with the charecters in a moment of silence, but it just moves right forward which results in the point being made, but not hammered home. Easy way to fix this? Take out the 25 mins worth of songs and use those valuable 25 mins to build up your charecters.Credit to the filmmakers, they are doing their best to accomodate the story in the given runtime and the decisions, the shortcuts, the sacrifices that were made are understandable, and hey we are here to see SRK and it more than delivers.",
    "122": "One of the best performance by Shah Rukh Khan. Story line is not exceptional but treatment is outstanding.Songs are good and gets blend with the story. Background music is outstanding which adds more flavour.Action sequences are well choreographed and VFX were also international standards.This movie will be considered as SRK's one of the best movie in terms of box office collection and also for the quality of the movie.Vijay setupathi in negative character is always treat to watch and no exception in this case too.Overall: An visual delight which is must watch for all the movie lovers10/10.",
    "123": "It is a Mega Blockbuster again for Shah Rukh Khan. Jawan is undoubtedly a worth-watching mass entertainer on the big screen. The movie is a package of engaging story, entertaining performances, excellent direction, and electrifying larger-than-life action sequences. Director Atlee has given the viewers a rollercoaster ride of emotions with the perfect blend of whistle-worthy dialogues and clap-worthy larger-than-life action scenes.The writers have done a great job too, the story delivers pertinent messages to society. It touches upon the corruption in the healthcare system, the bad conditions of government hospitals in our country, and the farmer suicides over the non-repayment of bank loans. The gripping screenplay is full of surprises & exciting cameos, and many scenes can leave you with teary eyes. The intermission and finale scenes are the biggest highlights of the film. The stellar star cast of Jawan won't give you any dull moment in its 169-minute long runtime.This never-before-seen avatar of Shah Rukh Khan keeps you engaged from start to end. He played his both parts perfectly and his character of Vikram Rathore will surely impress the audience. Watching SRK in high-octane action sequences is a treat for his fans. Nayanthara got a decent debut in Bollywood and she manages to leave the mark. Deepika Padukone and Sanjay Dutt's special cameo appearances were praiseworthy.Vijay Sethupathi deserved better writing for this role, but he never disappoints even with an underwritten role he delivers outstanding performance. Priyamani, Sanya Malhotra, Sanjeeta Bhattacharya, and Lehar Khan were fine in their limited supporting roles. But Sunil Grover and Riddhi Dogra were unable to leave any mark.Jawan Movie Rating:\nDirection 4/5\nActing 3.5/5\nAction 4.5/5\nStory 4/5\nScreenplay 4/5.",
    "124": "We always have I a high hope from a super star like Shah Rukh Khan. Yet still Bollywood give us another disappointment movie.1- Weak script that goes haywire as the film progresses. It goes on from becoming unrealistic at the start to downright outlandish towards the climax.2- So many flashbacks, sub-plots and songs slow down the pace of this already lengthy film.3- The talented female cast are wasted as they there are too many characters and it is primarily SRK centric film.4- Vijay Sethupathi definitely not his best performance, as a weak script let's him down.5- Sanjay Dutt's cameo I don't know what made him to be part of this movie to do it, perhaps his friendship with SRK.In short, one of the worst movies this year, unnecessarily overhyped by makers, critics, and fans.",
    "125": "Some movies don't tease us with new concepts, rather serves simple recipes, in the most explosive manner. Jawan, just like Pathaan, belongs to the latter category, although in a more massier way.Shah Rukh Khan's screen presence is magnetic, he makes you hoot and cheer, even if you aren't his ardent fan. No doubt, he's one of the biggest crowd puller in Indian cinema.Vijay Sethupathi, as usual, plays the antagonist role in his own style, with a tinge of fun angle. Nayanthara looks stylish, but she surprised with her agility in stunts, amazing. Deepika's got a predictable role, yet leaves a mark.Technically, cinematographer GK Vishnu deserves thunderous applause, really enhanced the scale of the film through his work, slick, stylish and superior. Editing by Ruben is smooth, narrative doesn't feel rushed. Stunts are designed well, especially the interval and truck chase. Production values and VFX of Red Chillies is superb. Anirudh's songs are just good, but he makes it up with BGM, keeping the proceedings alive.Writing wise, it's a simple solid straightforward story, but screenplay could have been better, especially in the second half. Dialogues by Sumit Arora are whistle-worthy.Coming to Atlee, as a writer, he did an okayish job, but his direction is top-class, presenting SRK in the most massiest avatar fans could ever imagine. There's a fine line between mass and cringe, he's one of those rare directors who knows that and delivers blockbusters.Bottom-line: If Pathaan was mass, Jawan is Baap of that.",
    "126": "Thank you so much Atlee for making this Action Rollercoaster which is full of emotions, tears and laughters.Jawan is easily Srk's career best action movie, Direction wise Atlee is way better than all Bollywood directors. Especially in this genre.Senior Srk's swag is unmatchable, Anirudh's BGM is extraordinary. All 6 girls acting was on point. Train sequence is too good but that is not the highlight of the movie there are 7-8 scenes where you can compete Jawan with action movies like The Matrix.Nayantara is Gal Gadot of indian cinema, her few scenes are batter than many Bollywood actresses whole career yes she is that good.Don't think twice experience this masterpiece in cinema asap.Thanks Srk & Atlee for this experience. All records will be shattered.",
    "127": "Just how good is Shahrukh Khan in action roles, all this while we've been calling him the undisputed King of Romance, It's time for us to acknowledge him as the King of Mass Entertainers too.The movie is your typical South Indian Style Masala Entertainer with strong political message apt for today's timesNayanthara is good, Vijay Sethupathy was surprisingly not so good. Deepika's cameo was very effective and an essential part of the movie. Amongst SRK's girls Sanya Malhotra could and should have been used moreSongs are just OK and some of them are there just for the sake of itGive it a go. It's worth your time and money.",
    "128": "It is totally boring movie, no story, typical south Indian movie. Watching this movie was a torture of 3 hours. I just enjoyed AC and popcorn and nothing else.Fact is that the movie stands nowhere near the reasonably good film making standards. Its seemed like an effort to put 100 different plot points to give people an Emotional High but everything defied logic. It is a mass entertainer hoping to ride the tide of uncalled for \"Emotional Atyachaar\". Hijacking Metro for Loan Waiver, Kidnapping Health Minister for changes in health system, Cop and villain marrying without realizing, then comes Indian Army sub-plot out of the blue and what from the hell else. Emotional scenes are over dramatized to an extent that they can be triggering for some like Suicide scene where no detail is left to the imagination, Children's death scene where they show faces of several children dying. What is happening? It was a proper south Indian masala film that hopes to cash in all the pain points of masses and SRK's star adulation. Every other minute, a masala song comes on screen. I don't understand when you are putting forward such big issues, what is the need for mindless dancing? Plots change so fast that you don't feel any sense of coherence whatsoever. Overall, I felt that it is a khichdi that had better not be served.",
    "129": "SRK's last mass film Pathaan had several shortcomings, one being a strong story . Jawan manages to resolve this issue and offers even more.Now once you complete the film, you will realise it's a mix of a few Bollywood films, imo, they are Rowdy Rathore and Satyamev Jayate. Jawan is a mix of these two films. But i will keep the overall plot under wraps in this review but if you have seen those two films, you know what's coming .The first biggest plus point of this film is the superb presentation of SRK. It's not a spoiler that SRK has played a father son double role and it's evident from the trailer. The presentation of SRK son is pretty good but the presentation of SRK dad, uffffff!!! The crowd went wild seeing SRK dad version for the first time on screen. But then again i have to say that SRK dad is actually a bit inspired by Allu Arjun's AVPL style. His dialogue delivery is just terrific!!Next are the mass action sequences. The biggest bombastic sequence was the one just before interval. Absolutely that sequence made the crowd go mad with cheering and hooting. Next in line is the highway action sequence, it's very well shot and keeps you entertained in that entire sequence. Many others are there, all are quite thrilling to witness but the ones i mentioned are the best ones.Screenplay I would say sometimes drops here and there but mostly is fast paced. Wastes no time in taking off.The film atleast has a good message to deliver to us . It has a lot of emotional moments especially in the second half and it works pretty well.Performances are quite good although I felt Sunil Grover was a bit wasted . This is a female oriented film with SRK at the center so the female leads like Nayanthara, Sanya, Priyamani etc have done a very good job.Negatives - Vijay Sethupathi!! His character neither has good dialogues and neither does his character have depth. His character is cliched and felt like makers spent only a few minutes to write his character. Songs are mid. Also one thing I notice in south director films especially the mass ones is that they don't allow many scenes to settle , it's like they want to move to the next scene in a flash of a second. Jawan too falls prey to this .Two cameos are there in the film, one which is already known and the other is hidden for you to go watch the film and discover. The known one has a sort of a long cameo actually.Overall, a highly enjoyable film that presents SRK in his massiest avatar ever and you don't want to miss it in theatre .",
    "130": "I agree that the issues this movie wanted the audience to pay attention to need to be talked about and addressed. What I do not understand about Bollywood, and by extension SRK, is why they make such masala movie given that they are perfectly capable of, and equipped to create a sensible cinema. Mindless action, too much of slo-mo, unrealistic events, unnecessary songs (terrible ones), louder background score is not the answer. Same issues can be portrayed in a sensible manner, take Article 15 as an example. Not only that, the choppiness of the movie really put me off and it made it hard to emotionally connect to the social issues portrayed by the movie. If you want the people to believe in the cause, make the movie believable! Unfortunately, these masala blends work with the audience and this blocks the way for meaningful cinema as the makers are probably scared of the losses. And then, we complain that Bollywood don't win on bigger international stage.IMO, a colossal waste of talent and resources.",
    "131": "Soon you will get it on some ott platform Netflix\nPlease save your money and time.A total waste of time and money.It did had few good shoots.But a poor story and script.Please save your self for this disappointment and over hyped movie.Not at all worth the money.Entertainment value- 0\nActions- 6/10\nComedy - 0\nActing - 3/10\nStory- 0/10\nLogic - no logic\nWait to watch it on OTTOverall a complete waste of time and movie.Use your finger and question makers of why making such a nonsensical movie.Save your money because I couldn't and now I regret.At least before interval it was going well but after interval it just becomes terrible to watch.",
    "132": "This movie is better with a Tamil actor and does not suit srk at all .The movie just jumps from scenes to scenes makes no sense at all . Wondering what's all the hype aboutLame movie.Being a srk fan I was expecting something much better . It felt like this whole movie would suit in a Tamil cinema only atmosphere with an actor like thalapathy Vijay .Srk has tried to bring change after the flop of pathaan but this didn't do good for him either .Too fast paced and does not fit in his style of work . The south actors are good in thier roles as this is what they usually do in Thier line of work !",
    "133": "A thorough entertainer. Nothing less is expected of an Atlee movie anyway. SRK is always a pleasure to watch on screen, his screen presence is outstanding. Definitely hated Vijay Sethupathi by the end of the movie, he was that convincing as a villian. Nayanthara is captivating, an exceptional actor. It's a movie about a lot of social causes still manages to capture you throughout with lots of very welcome surprises.The casting is flawless. I don't want to give any spoilers so I am not elaborating on the exemplary casting.There are a few very Bollywood moments though eg. How they diagnosed a pregnancy, you'll know what I mean when you watch the movie but even that was funny.The songs were standard Bollywood masal songs but they could've done better with the songs.If I am to describe the movie in a single sentence - I was sad the movie ended.",
    "134": "People may like the movie or not, its their choice but the fact is that the movie stands nowhere near the reasonably good film making standards. Its seemed like an effort to put 100 different plot points to give people an Emotional High but everything defied logic. It is a mass entertainer hoping to ride the tide of uncalled for \"Emotional Atyachaar\". Hijacking Metro for Loan Waiver, Kidnapping Health Minister for changes in health system, Cop and villain marrying without realizing, then comes Indian Army sub-plot out of the blue and what from the hell else. Emotional scenes are over dramatized to an extent that they can be triggering for some like Suicide scene where no detail is left to the imagination, Children's death scene where they show faces of several children dying. What is happening? It was a proper south Indian masala film that hopes to cash in all the pain points of masses and SRK's star adulation. Every other minute, a masala song comes on screen. I don't understand when you are putting forward such big issues, what is the need for mindless dancing? Plots change so fast that you don't feel any sense of coherence whatsoever. Overall, I felt that it is a khichdi that had better not be served.",
    "135": "Jawan is an entertaining film with a bit highly emotional appeal. Almost every scene has an emotion tied with it. BGM role is very strong in the film. It worked properly with the emotions. The film doesn't have the realistic appeal as a whole. Some scenes are directly copied from Hollywood films like Apocalypto, Avatar, Mad max fury road etc.. Nevertheless it delivered what it intended. And that's entertainment.You shouldn't be serious if you are watching Jawan. There are flaws but it need to be ignored to make yourself entertained. SRK charm will entertain you in all aspects. The rest of the characters are also in the same line. In some parts I too laughed. Today I understood what entertainment really means. It means accepting the flaws and be unmindful. That's what these categories of movies intends to deliver. A well made movie in that respect. Technically it's impressive. SRK is in a totally different outlook. The vibe of high octane action is real. Since I am a fan of great films still I want to appreciate the work that has put in executing this flick, so a 6/10. On a scale of 100 its a 61.",
    "136": "Shahrukh's shenanigans won't work their charm with a baseless foundation, that is Jawan.With the jubilant rush and high adrenaline, I went to the theatre for Jawan, met with a severe and jaw numbing reaction ~ is this what fans are cheering for? Critics are going gaga or all that is a subtle hint at jeering.One critic ~ at least one, should have showed the guts to call out what it is ~ a disaster of epic proportions.I wrote a reaction here on IMDB but not sure if I posted correctly or not, so here I am rewriting it. It is Sunday and I still haven't come out of the mental setback.Let us break it down - why it doesn't work.1. There are such things as continuity and theatrics. They go hand in hand and not one against the other. When people and forces fly from one corner to another of Mumbai in a matter of seconds, I realised it was a movie to keep logic in your back pocket but as the movie progressed, I realised I was wrong, it lowered the IQ of the entire theatre.2. Such promising young actors and such veterans ~ they all failed to leave a mark because the demand of the story was not convincing enough. Not one performance strikes the chords and like I said, Shahrukh's shenanigans ~ they have run its due course. A stalwart like Vijay Setupati ~ don't know why he was made to look more adorable than scary. Deepika was bright in a short presence but then her character didn't justify it. The inconsistencies were far too blatant to be overlooked. Whenever Sharukh plays the older character, the motivation and actions of the character doesn't chime right - he remains confused most of the times, only to deliver one comeback punch, which seems an extremely poor screenplay founded by even poorer writing.3. Too many things are packed into the film ~ from drama, emotions, dance, patriotism, laughter and what not but they fail to latch onto a central theme, because it is so weak. I agree it is designed for mass but it confuses the viewer.4. Music - well let us rather have a two minute silence for that.Lastly, I admire some of the genuine and realistic works some of the directors from South are coming up with and I love the screen presence of some pan India films have been achieveing lately. But - Jawan - in a right mind, is a disaster of epic proportions.Thank you for wasting three precious hours of my life.",
    "137": "This is cinema, peak entertainment. Insane theatrical & cinematic experience, got goosebumps all over. I cannot properly explain the spectrum of emotions I went through, want to live in that moment forever. It's wholesome seeing Shah Rukh Khan in this badass massy avatar, literally a dream come true. His screen presence is at an all-time high, he clearly had the time of his life. Will forever be grateful to Atlee for this. This has one of the best interval block of all time & one of the best SRK entries. So many elevation sequences, you will feel the chills. Action sequences packed a big punch and they are only elevated to another level Anirudh's BGM. SRK broke the 4th wall during his monologue to talk to the audience in his unabashedly political avatar and giving his stance, was extremely powerful. The theatres erupted during Zinda Banda & Not Ramaiya Vastavaiya and people started dancing, that was crazy. Even Imax turned into a single screen. It felt so good dancing with other SRK fans.Deepika in her limited screen time left a big impact. The way she emoted I felt her pain and she made me very emotional. Nayanthara has that aura & power and I understand why they call her lady superstar. They both were stunning. Vijay Sethupathi was very menacing. Other cast members did really well too, the girl gang were on fire. Some of the scenes made me cry, no kidding. The emotions hit right on point.To sum it all up - Anirudh did his thing, Atlee cooked his magic & SRK in his charismatic & electrifying best. Add cool characters & cast, emotions, revenge, mass action & elevation sequences, powerful music, strong social message, colourful visuals and we get this beautiful entertainment package called Jawan that captivates audiences from start to finish with proper blend of masala elements. It's a treat for SRK fans & neutrals alike.After watching thrice already, I can definitely say it has an insane repeat value and gets better & clearer with each rewatch. Will watch again. Audience is in for a nonstop cheers, whistles, claps, shouts, cheering & hooting ride, I am still having a sore throat from all that. It's not a film, it's an emotion that will make you smile and give a heartwarming feeling.",
    "138": "Jawan is biggest monstrous in 2023. Movie is absolutely electrifying in story, acting, social message, fill so bigger and large scale movie.SRK is new mass entertainer now.Basic Plot is A vigilante and his crew take on corrupt institutions in bed with a deadly arms dealer as past and present thrillingly collide.The action in Jawan is as slickly persuasive as you'd expect from a big-budget Atlee film. Drones, choppers, gatling guns; the director raids the whole inventory of Hollywood-style action blockbusters. However, what really sells these set pieces, besides some fluid jumps and kicks from Khan, are the smudges of Indianness applied to the grand canvas. I loved the idea of one of the hijackers leaving the crime scene in an auto.So, we're all set to witness history being rewritten, and it wouldn't be an overstatement to say that the film will do business in the range of 600-625 crores net in India.",
    "139": "A commercial mass masala entertainer with social message delivered through various aspects and emotions.And a big festival for SRK fans because Atlee has presented him like never before with Anirudh's powerful BGM.Lastly it has enough moments and rest of cast performance to watch with family.Don't go with negative reviews if you want to watch it just remember this thing \"Haters gonna hate but ignore baby\".Positives\nSRK performance\nEngaging from Start to end\nPowerful BGM\nSethupathi's villainous act\nNayanthara and Deepika's impactful performance\nSupporting cast emotional back storyNegative\nOnly fast screenplay.",
    "140": "This is ShahRukhKhan at his MASSIEST BEST!MASS ELEVATIONJawan has everything. From action scenes to dialogues to larger than life sequences.Message.. Emotions.. Action.Entertainment delivered King (Khan) Size..Jawan is Masala Entertainer of highest order which has Style + Substance + Action & Emotions in equal measures.Jawan is entertaining, engaging, filled with clap-worthy and seeti maar moments,extraordinary action sequences.A film made to enjoy on big screens only. Loads of SEETI-MAAR moments & enough amount of emotions and humour.It's a much watch movie for every Indian...",
    "141": "Shah rukh khan at his best, A pure Pan India movie. It has everything in it, best acting, romance, drama, comedy, action, thrill, BGM, Cinematography, Social cause, VFX, visuals, classic vibes. WHAT ELSE DO YOU NEED IN A MOVIE. THE BEST PART, HAND COMBAT ACTION IS THE KEY FACTOR.SRK HAS DONE IT AGAIN. MEGA BLOCKBUSTER.The aura, charisma and the screen presence of SRK is unmatchable.Vijay has done an outstanding fabulous role. Never seen such a Women empowering CinemaCameos are again well placed but can be more utilized and can be more justified.Climax was the weakness as being in top gear since scene 1, the expectation was at its peak but it was a well planned ending with a monolouge and social message, which seemed nice.Highly recommend. Go watch it.",
    "142": "It's an out and out Outstanding movie\nThis man has done it again\nFor haters please be positive in life please check your pockets before you show negativity to a person who has achieved everything in life. You cannot change what God has scripted for him.Be someone then do what you feel like.Jawan carries all the emotions which can be related by a common man.Its truly phenomenal to watch such a story where you can relate yourself.You see yourself in this movie and I Did.I believe instead of waiting for pirated version go watch at theatres near you.Absolutely this year belongs to shahrukh.",
    "143": "This has to be SRK's one of the finest made films whether it's Story, Direction or Acting.. All thanks to the Atlee. Movie starts with another Awestruck entry of King Khan.. and then never leaves the pace and keeps on climbing the graph & ends up creating Bollywood's greatest interval sequence of all time.. 2nd half takes turns & twists again raising social issues with a mix of action masala. This is someting SRK has never done before.Contains Bundle of special moments..SRK shines throughout and completely overshadows everyone with the help of Anirudh's top notch BGM.Nayanthara marks her sensational presence.Vijay sethupathi did what he always do.Supporting casts works well, specially all the ladies.If you love south movies then this isn't something to be missed. A complete entertainer!",
    "144": "I looked at reviews on here and this movie in my opinion deserves a 1/10.The plot leaves ... everything to be desired.The cgi and action is just outdated and downright hilarious.The only reason this movie gets hyped is because of SRK where people have a bias for liking the movie and look to praise it because of the actor.Thanks for 2 hours of my life I'll never get back.Really wanted to like it and I tried my best to give it a go but.. man what a let down.There was a real opportunity to add some nice plot pieces but the whole thing was a disjointed all over the place mess. Definitely not recommended.",
    "145": "The film \"Jawan\" appears to be a blend of some previous ones, with significant elements seemingly borrowed from the popular series \"Money Heist.\" Unfortunately, this results in a rather underwhelming cinematic experience that ultimately feels like a waste of good three hours.One of the most striking aspects of \"Jawan\" is its apparent resemblance to \"Money Heist.\" From the intricate heist plot to the quirky and often morally ambiguous characters, it's hard to ignore the parallels between the two. While inspiration from successful works can be a creative starting point, \"Jawan\" struggles to carve out its unique identity, leaving audiences with a sense of déjà vu.The central plot of \"Jawan\" revolves around a high-stakes heist, where a group of individuals with specialized skills comes together to pull off an audacious robbery. Sound familiar? It should, because this premise has been explored in various forms in countless heist movies and TV series. While there's nothing inherently wrong with revisiting a tried-and-true formula, \"Jawan\" fails to inject freshness into the narrative. Instead, it relies heavily on borrowed ideas, leading to a lack of genuine excitement or surprise.The characters in \"Jawan\" also bear a striking resemblance to those from \"Money Heist.\" The leader of the group is a charismatic and enigmatic figure who goes by the alias \"The Mastermind.\" This character archetype is not only reminiscent of the Professor from \"Money Heist\" but also lacks the depth and complexity that made the Professor such a captivating character. Similarly, the other members of the team, each with their unique skill set, feel like carbon copies of characters we've seen before in similar heist-themed stories.One of the most disappointing aspects of \"Jawan\" is its failure to capitalize on the potential of its talented cast. While the actors give competent performances, they are let down by a lackluster script that doesn't allow them to shine. The character development is minimal, leaving viewers with little reason to invest emotionally in their fates. This lack of connection with the characters makes it difficult to become truly engrossed in the unfolding heist drama.Furthermore, \"Jawan\" suffers from pacing issues that make its three-hour runtime feel excessive. The film often meanders through subplots and unnecessary scenes, stretching the narrative thin and testing the patience of the audience. In contrast, \"Money Heist\" managed to maintain a taut and gripping narrative throughout its episodes, keeping viewers on the edge of their seats.While \"Jawan\" attempts to replicate the high-stakes tension of \"Money Heist,\" it falls short in terms of execution. The heist sequences lack the meticulous planning and strategic brilliance that made \"Money Heist\" so engaging. Instead, they come across as contrived and unconvincing, undermining the film's credibility.Visually, \"Jawan\" has its moments, with some well-choreographed action sequences and stylish cinematography. However, these moments are few and far between, and they are not enough to salvage the overall viewing experience. The film's production values are solid, but they can't compensate for its lack of originality and narrative depth.In conclusion, \"Jawan\" is a disappointing attempt to capitalize on the success of \"Money Heist.\" While it borrows elements from the popular series, it fails to deliver a compelling and original narrative. The characters lack depth, the pacing is uneven, and the heist sequences lack the intricacy and tension that made \"Money Heist\" a global phenomenon. Ultimately, \"Jawan\" feels like a missed opportunity and a waste of good three hours for both fans of heist genres and general moviegoers.",
    "146": "In the end of the film, you will realise that entire time SRK saying, \" Thank you for being my fan! Jawan is a treat for all of you for being my fans.\"You might be laughing after seeing the word \"The Best\". Yes, obviously it is not the best script out there. But different looks and different roles of SRK make this film phenomenal. If you are a SRK fan, you are gonna leave the hall chanting by his name entire time. Even if you are not a fan of SRK, You will enjoy the enitire 2.50 hours any doubt.Another movie to explain how deep an actor serves with good scrips!Another movie to realise Who this guy is!Everything about this movie is soo good except the songs. Red chillies did excellent job in vfx. Atlee did great in direction. Deepika made her presence outstanding in only 20 minutes. Vijay Sethupathy and Nayantara was phenomenal with their roles. And Anirudh did his job with beast background music!\"Screen plyaing\" was the mastermind behind the success. Everything was gone so smoothly. Even the songs were enjoyable with movies!Eventually, A great script! Many social messages! Outstanding Performances specially by Daddy SRK (Vikram Rathore), Prominent Direction by Atlee and Perfect BGM by Anirudh.If possible try to watch in the theatres. Believe me you won't regret my friend. You are gon a come home singing 'Ramaiya Vastavaiya\nRamaiya Vastavaiya\" without even noticing.",
    "147": "Story & direction along with social message, action sequences, cinematography, fight scenes, dialogues, BGM, acting, VFX, screenplay, humour, comedy, dance choreography, slow motion shots everything is top notch... a must watch movie in theatres... One of the best and perfect mass entertaining bollywood movies ever.SRK, Nayanthara, Vijay - a perfect trio.A perfect 10/10.I felt the first half was far better although emotional scenes & music is better in the 2nd half along with the father SRK role which was the highlight.The main highlight of the movie is the metro hijacking sequence.Definitely the best SRK film after Chak de India.The backbone of the movie was Atlee the director and Anirudh the music director.",
    "148": "Jawan, directed by Atlee, is a must-watch for fans of Shah Rukh Khan and action-packed thrillers. The movie delves deeper into the corruption of the system and sheds light on some of the hidden facets of our daily lives. With its seamless integration of stunning CGI effects and a thought-provoking message, Jawan succeeds in captivating its audience from the very beginning.The music, composed by Anirudh Ravichander, perfectly complements the movie's theme and elevates the character of Shah Rukh Khan, who fights against injustice in society and urges people to be wiser in their voting rights in the face of societal challenges.The supporting cast does an excellent job of helping to shape the story, but it is Nayanthara who steals the show as an opposing force to Shah Rukh Khan's Azad. Their on-screen chemistry adds a captivating layer of complexity to the story, further enhancing the film's intrigue.The villain, portrayed masterfully by Vijay Sethupathi, adds tension and an element of danger as the protagonist works to overcome obstacles and achieve his goals of encouraging people to look at society without prejudice towards wealth or social class, urging us to perceive all individuals as equal human beings.Jawan is a movie that skilfully entertains and educates you about different aspects of society, making it a must-watch for all audiences. Whether you're a fan of Shah Rukh Khan or not, the film's action and thrills promise to deliver a gripping experience. Overall, Jawan is an action-packed thriller with a powerful message of social justice that promises to leave a lasting impact.",
    "149": "'Jawan' is the one of the best movie in 2023. Action, Thriller, Drama, Mystery, Adventure has all in this film. No doubt, 'Jawan' is a constantly Engaging and Entertaining film.Let's have a big round of applause to Director Atlee, for his Mind blowing Direction and also Story. He gives a social message in action relevant. He presents some sequences, which really touch your heart. Anirudh Ravichander gives proper Background Score. G. K. Vishnu's Cinematography is great.The Action of this movie has to be said separately. Some action scenes, do not let the eyelids fall.Talking about performances, Shah Rukh Khan (Vikram Rathore, Azad), Vijay Sethupathi (Kalee), Nayanthara (Narmada) are the Lead Characters in this film.Shah Rukh Khan represents seven looks, that sets it apart from other films. His acting will really impress you once again. His Fitness, Style, and Action really worth watching. Along with SRK, Vijay Sethupathi holds his place properly. He proves himself as a proper Villain in this film. His hindi speaking style is very interesting. Nayanthara portray her character very well.The Supporting Actors, Sanya Malhotra (Dr. Eeram), Priyamani (Lakshmi), Sanjeeta Bhattacharya (Helena), Lehar Khan (Kalki), Girija Oak (Ishkra), Aaliyah Qureishi (Jahnvi), Sunil Grover (Irani) and Others acts very well.In a Cameo Roll, Deepika Padukone (Aishwarya Rathore), and Sanjay Dutt (Madhavan Naik) won our hearts.-Rajma Koley."
}