{
    "0": "The Shawshank Redemption is written and directed by Frank Darabont. It is an adaptation of the Stephen King novella Rita Hayworth and Shawshank Redemption. Starring Tim Robbins and Morgan Freeman, the film portrays the story of Andy Dufresne (Robbins), a banker who is sentenced to two life sentences at Shawshank State Prison for apparently murdering his wife and her lover. Andy finds it tough going but finds solace in the friendship he forms with fellow inmate Ellis \"Red\" Redding (Freeman). While things start to pick up when the warden finds Andy a prison job more befitting his talents as a banker. However, the arrival of another inmate is going to vastly change things for all of them.There was no fanfare or bunting put out for the release of the film back in 94, with a title that didn't give much inkling to anyone about what it was about, and with Columbia Pictures unsure how to market it, Shawshank Redemption barely registered at the box office. However, come Academy Award time the film received several nominations, and although it won none, it stirred up interest in the film for its home entertainment release. The rest, as they say, is history. For the film finally found an audience that saw the film propelled to almost mythical proportions as an endearing modern day classic. Something that has delighted its fans, whilst simultaneously baffling its detractors. One thing is for sure, though, is that which ever side of the Shawshank fence you sit on, the film continues to gather new fans and simply will never go away or loose that mythical status.It's possibly the simplicity of it all that sends some haters of the film into cinematic spasms. The implausible plot and an apparent sentimental edge that makes a nonsense of prison life, are but two chief complaints from those that dislike the film with a passion. Yet when characters are this richly drawn, and so movingly performed, it strikes me as churlish to do down a human drama that's dealing in hope, friendship and faith. The sentimental aspect is indeed there, but that acts as a counterpoint to the suffering, degradation and shattering of the soul involving our protagonist. Cosy prison life you say? No chance. The need for human connection is never more needed than during incarceration, surely? And given the quite terrific performances of Robbins (never better) & Freeman (sublimely making it easy), it's the easiest thing in the world to warm to Andy and Red.Those in support aren't faring too bad either. Bob Gunton is coiled spring smarm as Warden Norton, James Whitmore is heart achingly great as the \"Birdman Of Shawshank,\" Clancy Brown is menacing as antagonist Capt. Byron Hadley, William Sadler amusing as Heywood & Mark Rolston is impressively vile as Bogs Diamond. Then there's Roger Deakins' lush cinematography as the camera gracefully glides in and out of the prison offering almost ethereal hope to our characters (yes, they are ours). The music pings in conjunction with the emotional flow of the movie too. Thomas Newman's score is mostly piano based, dovetailing neatly with Andy's state of mind, while the excellently selected soundtrack ranges from the likes of Hank Williams to the gorgeous Le Nozze di Figaro by Mozart.If you love Shawshank then it's a love that lasts a lifetime. Every viewing brings the same array of emotions - anger - revilement - happiness - sadness - inspiration and a warmth that can reduce the most hardened into misty eyed wonderment. Above all else, though, Shawshank offers hope - not just for characters in a movie - but for a better life and a better world for all of us. 10/10.",
    "1": "It is no wonder that the film has such a high rating, it is quite literally breathtaking. What can I say that hasn't said before? Not much, it's the story, the acting, the premise, but most of all, this movie is about how it makes you feel. Sometimes you watch a film, and can't remember it days later, this film loves with you, once you've seen it, you don't forget.The ultimate story of friendship, of hope, and of life, and overcoming adversity.I understand why so many class this as the best film of all time, it isn't mine, but I get it. If you haven't seen it, or haven't seen it for some time, you need to watch it, it's amazing. 10/10.",
    "2": "The best movie in history and the best ending in any entertainment business",
    "3": "In its Oscar year, Shawshank Redemption (written and directed by Frank Darabont, after the novella Rita Hayworth and the Shawshank Redemption, by Stephen King) was nominated for seven Academy Awards, and walked away with zero. Best Picture went to Forrest Gump, while Shawshank and Pulp Fiction were \"just happy to be nominated.\" Of course hindsight is 20/20, but while history looks back on Gump as a good film, Pulp and Redemption are remembered as some of the all-time best. Pulp, however, was a success from the word \"go,\" making a huge splash at Cannes and making its writer-director an American master after only two films. For Andy Dufresne and Co., success didn't come easy. Fortunately, failure wasn't a life sentence.After opening on 33 screens with take of $727,327, the $25M film fell fast from theatres and finished with a mere $28.3M. The reasons for failure are many. Firstly, the title is a clunker. While iconic to fans today, in 1994, people knew not and cared not what a 'Shawshank' was. On the DVD, Tim Robbins laughs recounting fans congratulating him on \"that 'Rickshaw' movie.\" Marketing-wise, the film's a nightmare, as 'prison drama' is a tough sell to women, and the story of love between two best friends doesn't spell winner to men. Worst of all, the movie is slow as molasses. As Desson Thomson writes for the Washington Post, \"it wanders down subplots at every opportunity and ignores an abundance of narrative exit points before settling on its finale.\" But it is these same weaknesses that make the film so strong.Firstly, its setting. The opening aerial shots of the prison are a total eye-opener. This is an amazing piece of architecture, strong and Gothic in design. Immediately, the prison becomes a character. It casts its shadow over most of the film, its tall stone walls stretching above every shot. It towers over the men it contains, blotting out all memories of the outside world. Only Andy (Robbins) holds onto hope. It's in music, it's in the sandy beaches of Zihuatanejo; \"In here's where you need it most,\" he says. \"You need it so you don't forget. Forget that there are places in the world that aren't made out of stone. That there's a - there's a - there's something inside that's yours, that they can't touch.\" Red (Morgan Freeman) doesn't think much of Andy at first, picking \"that tall glass o' milk with the silver spoon up his ass\" as the first new fish to crack. Andy says not a word, and losing his bet, Red resents him for it. But over time, as the two get to know each other, they quickly become the best of friends. This again, is one of the film's major strengths. Many movies are about love, many flicks have a side-kick to the hero, but Shawshank is the only one I can think of that looks honestly at the love between two best friends. It seems odd that Hollywood would skip this relationship time and again, when it's a feeling that weighs so much into everyone's day to day lives. Perhaps it's too sentimental to seem conventional, but Shawshank's core friendship hits all the right notes, and the film is much better for it.It's pacing is deliberate as well. As we spend the film watching the same actors, it is easy to forget that the movie's timeline spans well over 20 years. Such a huge measure of time would pass slowly in reality, and would only be amplified in prison. And it's not as if the film lacks interest in these moments. It still knows where it's going, it merely intends on taking its sweet time getting there. It pays off as well, as the tedium of prison life makes the climax that much more exhilarating. For anyone who sees it, it is a moment never to be forgotten.With themes of faith and hope, there is a definite religious subtext to be found here. Quiet, selfless and carefree, Andy is an obvious Christ figure. Warden Norton (Bob Gunton) is obviously modeled on Richard Nixon, who, in his day, was as close to a personified Satan as they come. But if you aren't looking for subtexts, the movie speaks to anyone in search of hope. It is a compelling drama, and a very moving film, perfectly written, acted and shot. They just don't come much better than this.OVERALL SCORE: 9.8/10 = A+ The Shawshank Redemption served as a message of hope to Hollywood as well. More than any film in memory, it proved there is life after box office. Besting Forrest and Fiction, it ran solely on strong word of mouth and became the hottest rented film of 1995. It currently sits at #2 in the IMDb's Top 250 Films, occasionally swapping spots with The Godfather as the top ranked film of all time -- redemption indeed. If you haven't seen it yet, what the hell are you waiting for? As Andy says, \"It comes down a simple choice, really. Either get busy living, or get busy dying.\"",
    "4": "One of the finest films made in recent years. It's a poignant story about hope. Hope gets me. That's what makes a film like this more than a movie. It tells a lesson about life. Those are the films people talk about 50 or even 100 years from you. It's also a story for freedom. Freedom from isolation, from rule, from bigotry and hate. Freeman and Robbins are majestic in their performances. Each learns from the other. Their relationship is strong and you feel that from the first moment they make contact with one another. There is also a wonderful performance from legend James Whitmore as Brooks.He shines when it is his time to go back into the world, only to find that the world grew up so fast he never even got a chance to blink. Stephen King's story is brought to the screen with great elegance and excitement. It is an extraordinary motion that people \"will\" be talking about in 50 or 100 years.",
    "5": "Shawshank Redemption is without doubt one of the best films ever made, and definitely the best film of 1994. Yes, it is better than Lion King, and I really like that too. It is not only enthralling but powerful and moving too. I will confess that I didn't understand it when I first saw it as a lot happens in the film, and I have now seen it three times. I seriously hope, that those who ignored the film when it was first released now recognise it as a great film, as it really is. The dialogue was extremely well-written, with lines that really stick in your mind. The cinematography and music are both gorgeous, and the prison itself is like a character that dominates the film. In the script, there are some true elements of Stephen King Now I admit I am not a huge king fan, and usually don't like coarse language in books. But in his books like It, which is very good, I have accepted the language represents brutality and rebellion, shown perfectly in the film with the battle of acceptance I suppose between the inmates and the superiors(like the scene with the warden yelling coarse language at the new inmates lined up in a row at the beginning.)The acting was exceptional. I am not hugely familiar with Tim Robbins, but he did a great job in a very demanding role. The best performance however, comes from Morgan Freeman as Red, who was seriously robbed of that Oscar, that he lost to Tom Hanks for Forrest Gump. Freeman reminds me very strongly, or his style of acting does, remind me of that of Sean Connery, suave yet very charismatic. Acting isn't just about your vocal range, it's about depth, which was what Freeman certainly had. In short, Freeman was brilliant in what could be his best performance. The scene where the inmates are listening to the Mozart aria over the speakers was a beautiful profound moment, and I actually cried in Brook's death scene. Very rarely do King adaptations translate-to screen well, because of the large scale of the author's books, with the exception of this and the Shining. Some like It and Dreamcatcher are genuinely memorable but have a number of flaws that prevent them from being classed as outstanding. And some, like Thinner and Tommyknockers that border on unwatchable. In conclusion Shawshank is a brilliant film, that is worthy of the credit it has been denied for so-long. 10/10 of course. Bethany Cox.",
    "6": "Two imprisoned men (Tim Robbins and Morgan Freeman) bond over a number of years, finding solace and eventual redemption through acts of common decency.Is this the greatest film of all time? IMDb would have you believe so. Despite being a box office flop (that barely recouped its budget), the film received multiple award nominations and outstanding reviews from critics for its acting, story, and realism. It has since been successful on cable television, VHS, DVD, and Blu-ray.And it deserves this praise that seems to be growing each year. Now twenty years old, the film has not aged a day, and instead seems to be getting better. This is Tim Robbins' best role, and a fine performance from the always wonderful Morgan Freeman.",
    "7": "Based on a novella by Stephen King, this is better than even THE GREEN MILE and goes to show that you don't need supernatural elements in a prison story – the setting is enough to carry a film as it is. SHAWSHANK often shows up as the \"best film of all time\" on various movie lists - including here on the IMDb - and, whilst I don't necessarily agree about that, it is a very good film indeed, near flawless in fact.Every technical element of the film is spot-on, from direction to music, editing, and acting; Morgan Freeman delivers his best ever performance whilst Tim Robbins shows us what a great character actor he is. Even better, for a genre fan like me, is seeing acting favourites like Clancy Brown, William Sadler, Brian Libby, and James Whitmore all appearing in the film together and playing more than just stock good or bad guy roles. Every actor is great here, and the script (which sticks closely to King's writing) is nigh-on perfect. Emotion, thrills, drama, and the triumph of the human spirit are all present in this movie, which is one of the greatest prison flicks ever.",
    "8": "The Shawshank Redemption has great performances, extremely well written script and story all leading to a deeply emotional climax! One of the best dramas of all time!",
    "9": "Well I guess I'm a little late to the party as far as writing down a review for this picture. I've seen it a couple of times, but that was before I became a regular contributor to the IMDb. When I first discovered this site a few years ago, \"The Godfather\" was in the Number #1 spot, and since then the films have traded places for first and second, with Shawshank maintaining the top spot most of the time. That puzzled me a bit until I watched it again tonight, and I've come away from the picture with a new found appreciation. My favorite movies tend to be the story of underdogs in some way, shape or form, and my personal Top Ten list includes titles like \"On The Waterfront\", \"To Kill a Mockingbird\" and \"One Flew Over the Cuckoo's Nest\". I may have to reconsider that list, an infrequent exercise but one I don't mind doing every now and then as situations warrant.Overall, the film is darn near perfect. I know it's pretty cliché to state it that way, but when you analyze the dialog, the characters, the directing and the tone of the movie, the picture flows flawlessly, even when it detours into side stories like Brooks Hatlen's release and new prisoner Tommy's introduction late in the picture. Every set-up, every nuance has some importance that eventually converges to symbolize Andy's quest for escape and personal redemption. Remember Brooks feeding Jake for the first time and eventually setting him free when he receives his own pardon? How about Andy playing Mozart into the prison yard while settling back with a smile of contentment on his face. The story transcends one man's confinement for a crime he didn't commit, and focuses instead on his reaction to circumstances beyond his control. Paul Newman showed us a different way to react to those kinds of conditions in 1967's \"Cool Hand Luke\", but his method was self destructive. Andy Dufresne (Tim Robbins) never loses his ability to keep his eye on the prize, even if it takes him a couple of decades to do so.But even more so, you have here the story of Ellis Boyd Redding (Morgan Freeman), a convict who sees Andy as a person, and over time, an inspiration to himself and the rest of the prisoners who call him friend. From Andy, he comes to understand that even as a prisoner, a man can live life on his own terms if he can keep his mind uncluttered by thoughts of desperation and hopelessness. Not bad for a convict who started out believing that 'hope can drive a man insane'.I really can't recommend this picture highly enough, both for it's masterful story telling and it's technical execution. The actors, even those portraying the most minor characters were seemingly born for their roles. They deliver a seamless performance that's virtually unmatched by most modern films, in a picture that hits all the right notes with an inspiring message of discipline and perseverance.",
    "10": "There's a reason this is rated the #1 . It is the same reason you simply watch this movie every time you see it on tv even if it's already half way over. It's captivating, brilliant and full of heart.",
    "11": "The Shawshank Redemption is without a doubt one of the most brilliant movies I have ever seen. Similar to The Green Mile in many respects (and better than it in almost all of them), these two movies have shown us that Stephen King is a master not only of horror but also of prose that shakes the soul and moves the heart. The plot is average, but King did great things with it in his novella that are only furthered by the direction, and the acting is so top-rate it's almost scary.Tim Robbins plays Andy Dufrane, wrongly imprisoned for 20 years for the murder of his wife. The story focuses on Andy's relationship with \"Red\" Redding (Morgan Freeman, in probably his best role) and his attempts to escape from Shawshank. Bob Gunton is positively evil and frightening as Warden Norton, and there are great performances and cameos all around; the most prominent one being Gil Bellows (late as Billy of Ally McBeal) as Tommy, a fellow inmate of Andy's who suffers under the iron will of Norton.If you haven't seen this movie, GO AND RENT IT NOW. You will not be disappointed. It is positively the best movie of the '90's, and one of my Top 3 of all time. This movie is a spectacle to move the mind, soul, and heart. 10/10",
    "12": "I have never seen such an amazing film since I saw The Shawshank Redemption. Shawshank encompasses friendships, hardships, hopes, and dreams.  And what is so great about the movie is that it moves you, it gives you hope.  Even though the circumstances between the characters and the viewers are quite different, you don't feel that far removed from what the characters are going through.It is a simple film, yet it has an everlasting message.  Frank Darabont didn't need to put any kind of outlandish special effects to get us to love this film, the narration and the acting does that for him.  Why this movie didn't win all seven Oscars is beyond me, but don't let that sway you to not see this film, let its ranking on the IMDb's top 250 list sway you, let your friends recommendation about the movie sway you.Set aside a little over two hours tonight and rent this movie.  You will finally understand what everyone is talking about and you will understand why this is my all time favorite movie.",
    "13": "None of the usual otherworld creatures that populate the works of Stephen King are to be found in The Shawshank Redemption. But the real world of that Maine prison has some bizarre rules of its own and there's a whole new reality within those walls.In the tradition of Cool Hand Luke and Birdman Of Alcatraz comes Tim Robbins who was a banker on the outside, but when he caught his wife cheating on him with a golf pro from their country club, he's convicted of putting eight bullets in them, four apiece and tried and sentenced to two consecutive life terms in Shawshank prison. Like Luke and Bob Stroud he works out his own rehabilitation and rebels against the prison system.He may be a con, but Robbins still has all his knowledge of finances and pretty soon he's made himself quite invaluable to the warden and the rest of the staff at the prison. At the same time he and the cell block scrounger Morgan Freeman develop a close personal relationship. In the end they beat the system in a most unique way.There have been some classic prison films made ever since The Big House at the dawn of the talkies. Two I've already mentioned. My favorite prison film is Robert Redford's Brubaker, but The Shawshank Redemption comes pretty close. As does The Green Mile which was also directed by Frank Darabont.Darabont got an Oscar nomination as did the film itself and as did Morgan Freeman for Best Actor. The Shawshank Redemption was in for a flock more Oscar nominations in 1994. A couple other good performances are that of James Whitmore the institutionalized con who is there for 50 years and paroled and just can't make it on the outside. He will break your heart as will Gil Bellows who plays a fresh, but rather likable young con who runs afoul of the warden.Speaking of which Bob Gunton as the warden will positively chill you with his corruption. You would have to go back all the way to the James Cagney classic, The Mayor Of Hell where Dudley Digges was the warden of boys reformatory to find a warden that is as sanctimonious and as corrupt as Gunton. This is a man who gives Bibles out to each inmate hoping that the reading of the Good Book will improve the moral fiber of the convicts. At the same time he's raking in money every which way he can and a rather special punishment is meted out to him by Robbins.The Shawshank Redemption may not have monsters and other worldly creatures that normally characterize a Stephen King story. But the world of Shawshank prison is bizarre enough for any normal person if you see this wonderfully crafted and acted film.",
    "14": "Shawshank Redemption, The (1994)**** (out of 4)An innocent man (Tim Robbins) is sent to prison on murder charges and once there he bonds with another man (Morgan Freeman) serving a life sentence. I remember seeing this when it was first released to theaters and walking out thinking it was a masterpiece but apparently others couldn't be bothered to see it since the box office results were very low and it was out of theaters in no time. Over the years the reputation of this film has grown and as I write this it's currently #1 at IMDb. I certainly wouldn't call this the greatest film ever made but it's certainly one of them. I think it's an insult to call this a prison movie because it's so much more than that. This is a film about friendship and hope. Those are two things that have played major parts in many movies but I can't think of too many films where the payoff is as large. What makes the film work so well is that director Durabont takes his time telling a story that takes place over twenty years. Another wonderful thing the director does is that he really makes the twenty years pass on a believable manor. Most films that jump time feel cheap and rushed but that's not the case here because the wonderful screenplay lets us get to know the two main character but also the supporting characters are very well written. What really brings this magic to life are the performances, which are downright brilliant and I'd argue that you can see some of the greatest ensemble acting right in this film. Robbins and Freeman are terrific together and really make for one of the most memorable friendships in movie history. The way Robbins walks and talks is perfectly done and I just love the way, as Freeman says in his narration, he walks around as if he didn't have a care in the world. Freeman gives another wonderful performance but what's really great about him is the narration he adds as he tells us the story. James Whitmore is terrific as the elderly convict and Clancy Brown and Bob Gunton make for excellent villains. I won't spoil the ending for anyone but the final twenty-minutes are at times breathtaking in their beauty and it's message of hope rings louder than most movies.",
    "15": "\"The Shawshank Redemption\" should have won Best Picture for 1994. A story of banker Andy Dufresne (Tim Robbins) getting falsely convicted of murder and sent to the hellish Shawshank prison, the movie is beyond amazing. In prison, Andy meets Ellis Boyd \"Red\" Redding (Morgan Freeman), who was imprisoned many years earlier. Red gets Andy a poster of Rita Hayworth. Over the next twenty years, Andy experiences all the horrors that one would expect in jail: beatings by the guards, rapes by other inmates, and so on. But he never gives up hope.This movie, like \"Carrie\", \"The Shining\", \"Dolores Claiborne\", \"The Green Mile\" and \"Hearts in Atlantis\", just goes to show what a great author Stephen King is. When we think of horror, we think of spooky horror, but \"The Shawshank Redemption\" is a different kind: personal horror. Pure genius. I can only hope that in the coming years, this movie is recognized as what it is: a masterpiece. I can't believe that it won no Oscars!",
    "16": "The Shawshank Redemption is to me the most powerful and emotional film ever made, dragging emotions out of you as you deeply connect with each character in different ways. A truly beautiful film, one of the greatest.",
    "17": "This is Tim Robbins best performance ever. It is a compelling heart warming drama about an innocent man(Andy Dufresbe) who is sent to prison and learns to use his intelligence to make the best of prison life. He meets a mentor in Red(Morgan Freeman) and they build a friendship that is stronger than the walls that surround them. Andy steadies a relationship with the warden that keeps him in the good eyes of the prison. Andy is full of surprises and uses his resourcefulness to not only win the friendships of his fellow prisoners, but also of the prison guards. Both Andy and Red both hold on to their dream of one day enjoying their freedom. They turn their friendship and dreams of freedom into a bond that no prison could ever take away.",
    "18": "The reason I became a member of this database is because I finally  found a movie ranking that recognized the true greatness of this movie. There  is nary a word or scene out of place in the entire thing. Every element  comes together to form an exquisite story for cinema.   I believe that one reason that this movie is under-appreciated is that  people have not seen it multiple times. On first viewing it is the story of  Andy Dufresne and his struggle to maintain hope despite his circumstances.   However, this is really a movie about Red and his struggle to find  meaning and purpose. The final segment of the movie testifies to the fact that the final resolution of the story comes about only when Red is faced with the same fearful situation as Brooks. Because of Andy, Red can find a different path-the path of freedom that is lit by hope.  Who is your Andy Dufresne?",
    "19": "An outstanding film dealing with prisons as seen by several prisoners. Many social problems are discussed here. The picture earned a well-deserved best picture Oscar nomination. It certainly should have tied with the winner, the equally good \"Forrest Gump.\"Tim Robbins and Morgan Freeman etched unforgettable performances as prisoners charged with murder. The film shows what prison life is all about. Subjects dealing with prison survival, brutality, corruption and ultimate redemption are well shown.As the corrupt, insane warden invoking religion to justify his actions, Mr. Gunton gives a worthy performance.This is a film of rare power. James Whitmore was equally memorable as a prisoner who was unable to adjust to the outside after his parole following a 50 year stint. This shows that people who have been incarcerated for such a long period, need some sort of readjustment training before they rejoin society. For Whitmore, freedom meant ultimate doom.Politics is also depicted in a negative way in this gritty film. This is a memorable viewing experience for audiences.",
    "20": "It is one of the best movies in the world that many people will join me. Watching very, very impressed. What it might be called the great stories of Stephen King anyway. Acting on cues can say is enormous. There's no posturing. Especially when Andy Dufrense incredible music that review still stands wandering on everyone's lips. Finale as you lose yourself in it is a movie you are getting into. Finals if he so exhilarating you a high-quality music. And finding that deserves really deserve. I watched this film very young age and it has taught me that the magic of cinema in a nice way. This film is one of the reasons I hate the Oscars. Will remain as the best film in more than 10 years, I believe wholeheartedly sites. Definitely one of the best films in the world.",
    "21": "**Yes, there are SPOILERS here**This film has had such an emotional impact on me, I find it hard to write comments on it.  I've read a lot of the previous comments; all those that gush and eulogise as well as those who think it's over-rated or cliched. Most have got good points to make, however the thing that I think everyone is struggling to both explain and come to terms with is just why this film is *so* loved.  Loved to the extent that for many it is an almost spiritual experience or for those of a more secular nature like myself, loved as one of the most devastatingly uplifting things that can happen to you while watching a film.So I'm not going to review it, I'm just going to struggle in my own way to explain this film.  It took me a few viewings to get why I connect with it so deeply, but here goes.Many people in this world are unhappy.  Most people in this world don't want to be unhappy.  Lots of people wish, pray and above all hope for that magic wand to wave and wash them of their fears, losses, angers and pains once and for all.  They see lots of other people seemingly in this magical state, while they suffer.  To borrow the words of another film, they're watching the bluebirds flying over the rainbow.Many unhappy people have learned that the magic wand doesn't exist. They're not destined to join the bluebirds and fairytales don't come true.  It's not that no one lives happily ever after, it's just that they're not going to. They're busy dying.In this film, or as some people have quite correctly said, this fairytale, magic wands exist.  And that magic wand is Andy Dufrense imitating Houdini. However this film is not about him.  Neither is it about the prison, the governor, the guard, the plot, the acting, the cinematography, the script, the direction or the score.It's about Red.  He is the one who has become institutionally unhappy, he's not only trapped in a prison, not only has he given up on the idea of ever leaving, not only does he have no hope, he knows that if the miracle would ever happen to him, he couldn't cope.  He's safe in his unhappiness and that security is what keeps him going.  Hope is, as Red say, dangerous.  The metaphor for a certain illness here is very clear to me and I know that a rather large number of people suffer from it.  A large proportion of those don't understand what's wrong, but they certainly can recognise a fellow sufferer.  Those who are mercifully untouched by this illness definitely don't understand what's going on in those who do.  They're too busy living.The miracle in this film is not only that Red is redeemed but that the world outside the prison isn't all warm and sandy and sunny and with excellent fishing.  Some of it is rocky and uncertain.  Fairytales don't get this far. They'd end as Red left the gates of the prison and the credits would say 'and he lived happily ever after'.  This is the only film I can currently think of where they show how to get to the living happily ever after bit from your redemption via the rocky and uncertain ground of bagging groceries at the local store.  In other words, they're not going to cheat you and tell you everything's going to be alright.This is crucial.  For two and half hours, those of us who are quite content to mooch around our own personal prisons can see an escape route quite different to Andy's mapped out on the screen.  And it's a real way out. It's hard and upsetting, but ultimately rewarding.  The high you get from finding out and knowing that is only comparable diamorphine.The trouble is, if you're already busy living, this film won't mean that much and you'll see it a little more clearly than those busy dying.  To those fortunate individuals, watch this film and understand what the rest of us are going through.So, yes, this film is a cliched fairytale and maybe as a story it isn't realistic and at second on the IMDb all time list, it is a bit over-rated. However if you could have a chart of films listing the number of lives saved, altered and improved, the Shawshank Redemption would be way out in front at number one.",
    "22": "not for a reason. but for the fine art to create a story who seems be more than fiction and who use a script, a cast and location for a puzzle who becomes part of precious memories. its themes, the tension, the moral questions, the meeting between Morgan Freeman and Tim Robbins and the result of dialogs who are truth axis of movie and wise adaptation, are bones of a splendid film. a film who reminds more than presents. values, roots of justice, beauty of original source, the end who is expression of a deep expectation of the viewer are elements who transforms The Shawshank Redemption in an experience for the viewer. short - a film who must see !",
    "23": "In 1947 Andy Dufresne is jailed for life for the murder of his wife and her lover. He is sent to Shawshank Prison where he tells his fellow inmates he is innocent but as fellow inmate 'Red' says; everybody in Shawshank is innocent. Red has already served ten years and is the guy to see if you want something smuggled into the prison. Andy asks for two things; a small rock hammer and Rita Hayworth! Soon after Red provides him with one rock hammer and a large poster featuring Rita Hayworth. Life in Shawshank is not easy; the guards are brutal and some of the inmates are worse. Andy survives though and things get better when he is able to help the meanest of the guards avoid paying tax on an inheritance; soon he is acting as accountant to the whole prison and helping the corrupt warden squirrel away large sums of money earned by prison labour. He is able to use this position to improve the life of prisoners too; a few beers for a work party, improvements to the prison library and education for some inmates. All the time Andy professes his innocence then one day after he has spent almost twenty years behind bars a young man comes to Shawshank; the man tells the story of how a cellmate at a previous prison claimed to have murdered a man and the woman he was with leaving her banker husband to take the blame. Andy believes this may finally get him out of prison but there is no way the warden will let him go; he is too useful and he knows too much that won't stop Andy though.This film, based on a Stephen King short story, is rightfully considered a classic. There are no scenes that felt unnecessary from start to finish the story moves at a good pace. We see both the good and the bad inside the prison; there are scenes of brutality but also scenes of joy such as watching the prisoners enjoy the simple pleasure of having a cold beer of a scorching day it is details like this that make the film special. There is also the joy of seeing that Andy will not break and his greatest triumph coming just as it looks as if he has finally reached breaking point. The cast does a great job; Tim Robbins is great as Andy and the always reliable Morgan Freeman is on top form as Red; theirs is one of the great portrayals of a screen friendship. It isn't just the likable characters who are well acted though; Bob Gunton is subtly unpleasant as the hypocritical Warden; quoting scripture one minute profiteering, and much worse, the next; Clancy Brown is also great as the truly unpleasant Captain Hadley; the senior guard who brutalises the inmates. After the suffering inside the finale chapter where we see Andy's escape and revenge makes this a feel-good movie despite what we've seen before. This is definitely a must see film.",
    "24": "Stephen King's novella is a damn good yarn. The narrative is always engrossing, the source elements of Andy's secret are carefully placed without exciting attention, and you are delighted when events pan out as they do.Then Darabont adapts it, and a damn good yarn becomes something special. Part of this is the adaptation - a sensitive simplification, part of it is the casting, which is pitch perfect (Morgan Freeman's Red was always an Irish redhead when I read the story - now I can't read it without seeing Morgan Freeman). And most of it, I think, is the direction.The story unfolds in unhurried fashion, with us being unsure of Andy's guilt for much of the movie, but with a gradually building sense of injustice at the way those in power in the system can treat him (and others) unfairly. The secret doesn't come at the end, but at about the three quarters mark, and brings with it a huge emotional kick. And then the story is allowed to make its own way into a gentle and perfect end.This is, without any doubt, one of the most spiritually uplifting films I have ever seen.",
    "25": "I believe that this film is the best story ever told on film, and I'm about to tell you why.Tim Robbins plays Andy Dufresne, a city banker, wrongfully convicted of murdering his wife and her lover. He is sent to Shawshank Prison in 1947 and receives a double life sentence for the crime. Andy forms an unlikely friendship with \"Red\" (Morgan Freeman), the man who knows how to get things. Andy faces many trials in prison, but forms an alliance with the wardens because he is able to use his banking experience to help the corrupt officials amass personal fortunes. The story unfolds....I was so impressed with how every single subplot was given a great deal of respect and attention from the director. The acting was world-class. I have never seen Tim Robbins act as well since, Morgan Freeman maybe (e.g. Seven). The twists were unexpected, an although this film had a familiar feel, it wasn't even slightly pretentious or cliched, it was original. The cinematography was grand and expressive. It gave a real impression of the sheer magnitude of this daunting prison.But the one thing which makes THE SHAWSHANK REDEMPTION stand above all other films, is the attention given to the story. The film depends on the story and the way in which it unravels. It's a powerful, poignant, thought-provoking, challenging film like no other. If Andy were to comment on this film, I think he might say: \"Get busy watching, or get busy dying.\" Take his advice.Thoroughly recommended.",
    "26": "My life is forever changed due to this movie.  It is a movie of hope, \"redemption\", and friendship.  It shows a deep growing friendship between two prisoners, Andy and Red.  They each are shown growing through their distinct hardships at Shawshank prison.  As time passes, hope wanes but a flame burns bright in Andy.  His hope and unrelentless nature carry over to his friend Red.As Red's long stay in prison comes to an end he sees the light at the end of the tunnel.  Andy has left it for him to see the way to freedom, and he follows it.This film parallels my life and leaves me wondering if my advice will help somebody see the light.  For some of those people time will tell.  As for now I'll be patient to wait and see.  Don't end up like Brooks, there will always be someone to help you out.  There is someone out there that cares for you.  Thank you Andy Dufresne, your hope is the flame of my life.",
    "27": "It deserves ten stars. Its beauty lies in its slow pace and genteel wit, although some may not have the patience for the slowness. But the whole premise of life inside a prison cell makes better sense when told in a calm, emotion-building, pace such as this. Otherwise, one would never get to know Tim Robbins's quiet accountant (and what makes him appear alternately shy, snobbish, and suicidal all at the same time); or Morgan Freeman's genial-but-cynical lifer- not to mention how he's \"a man who knows how to get things.\" I love what the film doesn't do: it doesn't make an issue of its two leads being different races (although one could claim that makes their friendship all the more marvelous), it doesn't pull any sensational, far-out, action punches (as films with an all-male cast often do), and it doesn't freeze its characters into types. Everyone is real and everyone is flawed- from James Whitmore's bird loving veteran to Bob Gunton's pretentious, icy, warden. But the finish (which really starts around the film's last twenty minutes) is one of the most powerful and moving things ever committed to film. Get it in either format.",
    "28": "At the heart of this extraordinary movie is a brilliant and indelible performance by Morgan Freeman as Red, the man who knows how to get things, the \"only\" guilty man at Shawshank prison. He was nominated by the Academy for Best Actor in 1995 but didn't win. (Tom Hanks won for Forrest Gump.) What Freeman does so beautifully is to slightly underplay the part so that the eternal boredom and cynicism of the lifer comes through, and yet we can see how very much alive with the warmth of life the man is despite his confinement. Someday Morgan Freeman is going to win an Academy Award and it will be in belated recognition for this performance, which I think was a little too subtle for some Academy members to fully appreciate at the time.But Freeman is not alone. Tim Robbins plays the hero of the story, banker Andy Dufresne, who has been falsely convicted of murdering his wife and her lover. Robbins has a unique quality as an actor in that he lends ever so slightly a bemused irony to the characters he plays. It is as though part of him is amused at what he is doing. I believe this is the best performance of his career, but it might be compared with his work in The Player (1992), another excellent movie, and in Mystic River (2003) for which he won an Oscar as Best Supporting Actor.It is said that every good story needs a villain, and in the Bible-quoting, Bible-thumping, massively hypocritical, sadistic Warden Samuel Norton, played perfectly by Bob Gunton, we have a doozy. I want to tell you that Norton is so evil that fundamentalist Christians actually hate this movie because of how precisely his vile character is revealed. They also hate the movie because of its depiction of violent, predatory homosexual behavior (which is the reason the movie is rated R). On the wall of his office (hiding his safe with its ill-gotten contents and duplicitous accounts) is a framed plaque of the words \"His judgment cometh and that right soon.\" The irony of these words as they apply to the men in the prison and ultimately to the warden himself is just perfect. You will take delight, I promise.Here is some other information about the movie that may interest you. As most people know, it was adapted from a novella by Stephen King entitled \"Rita Hayworth and the Shawshank Redemption.\" Rita Hayworth figures in the story because Red procures a poster of her for Andy that he pins up on the wall of his cell. The poster is a still from the film Gilda (1946) starring her and Glenn Ford. We see a clip from the black and white film as the prisoners watch, cheering and hollering when Rita Hayworth appears. If you haven't seen her, check out that old movie. She really is gorgeous and a forerunner of Marilyn Monroe, who next appears on Andy's wall in a still from The Seven Year Itch (1955). It's the famous shot of her in which her skirt is blown up to reveal her shapely legs. Following her on Andy's wall (and, by the way, these pinups figure prominently in the plot) is Rachel Welsh from One Million Years B.C. (1966). In a simple and effective device these pinups show us graphically how long Andy and Red have been pining away.Frank Darabont's direction is full of similar devices that clearly and naturally tell the story. There is Brooks (James Whitmore) who gets out after fifty years but is so institutionalized that he can't cope with life on the outside and hangs himself. Playing off of this is Red's periodic appearance before the parole board where his parole is summarily REJECTED. Watch how this plays out at the end.The cinematography by Roger Deakins is excellent. The editing superb: there's not a single dead spot in the whole movie. The difference between the good guys (Red, Andy, Brooks, etc.) and the bad guys (the warden, the guards, the \"sisters,\" etc.) is perhaps too starkly drawn, and perhaps Andy is a bit too heroic and determined beyond what might be realistic, and perhaps the \"redemption\" is a bit too miraculous in how beautifully it works out. But never mind. We love it.All in all this is a great story vividly told that will leave you with a true sense of redemption in your soul. It is not a chick flick, and that is an understatement. It is a male bonding movie about friendship and the strength of character, about going up against what is wrong and unfair and coming out on top through pure true grit and a little luck.Bottom line: one of the best ever made, currently rated #2 (behind The Godfather) at the IMDb. Don't miss it.(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
    "29": "This for me and many other people is the greatest movie of all time it has amazing directing it has amazing acting by Tim Robinson and Morgan freeman whoever says that they don't like this movie should never watch another movie again overall the greatest movie of all time.",
    "30": "What would you do, if the world came down on you, wrongly sentenced for a crime, that will take all your life's time; you're quite gentle and quite shy, don't feel the need to shout or cry, so you take it on the chin, accept the view, and settle in.Then distractions take their toll, incarceration's in control, prison guards dealing in pain, fellow cons who can't refrain; new friends help, you're not alone, surrounded by these walls of stone, movie pinups play their part, to lift spirits and keep good heart.Soon the governor fills his tills, make's the most of all your skills, he's an unforgiving kind, but there's money to be mined; you disperse what you collect, keeping covered all aspects, knowing channels have been primed, and overwhelmingly begrimed.Perpetually entertaining stuff.",
    "31": "The characters are so well developped and well interpreted by the actors that you really feel for them which makes the whole story even more compeling. The structure builts up emotionnaly like only Darabont can do it. Breathtaking!",
    "32": "I like the bit when the warden threw the rock through the poster.",
    "33": "I first saw this film, like many others, by chance and on DVD. And like others, I have since watched it over and over again. When I feel sad, it makes me feel happy, when I need hope, it gives me hope.When I want to reaffirm my very belief in life, and all it can offer, this film gives me a new sense of purpose that no other film has ever come close to doing.It soars above anything any other movie has tried to achieve in the way it touches on the true virtues of life itself. The portrayal of friendship, the devastation of loss and the maintaining of hope. Outstanding performances from the two leads and the most beautiful of narratives are the tip of the iceberg of why this film is so great. The cinematography from the very first shots of the prison are stunning and the accompanying soundtrack add to the haunting atmosphere when we first venture inside the prison walls. Thank you Mr Darabont, Mr Robins and Mr Freeman. Thank you to every one else involved. You changed my life",
    "34": "At the time of writing this comment, IMDb ranks the Shawshank Redemption as No. 2 in top 250 best movies of all time. Let me tell you that this is no exaggeration and no small feat given IMDb's strict rating criteria. Shawshank is indeed, up there amongst the best, and if you haven't seen it yet, you should make it a point to watch it, at least once sometime in your life. For it is an astonishing tale, of endurance, courage, life, and perspective, combined with a stunning score that flows so closely with the highs and lows of emotion that it could make grown men cry. No words can explain how good Shawshank really is, but let the sheer volume of good user reviews made by devotees in this website be proof enough of its greatness.",
    "35": "The first time I ever saw this movie I was just floored at how incredible it was. What wonderful casting that was done to help this amazing story be told. Stephen King has a way about creating such memorable characters. For those of you who think this movie is a \"prison movie\" you are sadly mistaken. This movie merely takes place in a prison but this story is about so much more...friendship, hope, survival and dreams! There is a reason this movie is voted #1 on the IMDb site! Not only have I enjoyed watching this movie over a hundred times but I have been lucky enough to have been in that prison numerous times doing paranormal events. My last visit out there was last weekend and I decided to also go and visit all of the filming locations! That was a real treat! All I can say is that if you have not seen this film just take the time to watch it and just take in the amazing story and the incredible performances turned in by the cast! I promise you that you won't be sorry!!!",
    "36": "I have never watched a better movie than this before",
    "37": "It's not a complex tale, but it is a tale done well that is inspirational in spite of the bleak environment.I am continually fascinated by the complexity of Andy Dufresne. (Presumably) the only innocent man in Shawshank, it is nevertheless Andy who seems to best incapsulate the guilt of his actions. Did he kill his wife? No. But I always feel as though he blames himself for her cheating, blames himself for wanting to kill her, and seems to accept his fate more than most men might.The friendship of Red and Andy is regularly regarded as one of the high points of this film, and it has always resonated with me. The innocent man (Andy) breaks all sorts of laws and plans an elaborate prison break. The guilty man (Red) pays for his crimes and is eventually released on good behavior. Both end up together on a beach in Mexico, to live out the rest of their lives in solitude, apart from society. That's always felt like the tragedy of Shawshank; criminal or not, everyone ends up the same broken man by the end.The brief moments of freedom in this film shine like nothing else, for me. The beer break on the roof, the opera played over the PA, and finally the broken boat on the shores of the Pacific: each of these moments is engineered by Andy to get a taste, a glimpse of freedom. Things that he had taken for granted before Shawshank. That scene where the men drink the beer on the roof looks like the tastiest beer I could ever imagine, almost completely because of the dark tone of the film up until that point.",
    "38": "This movie surprised me so much I watched it twice in one day the first time I saw it. Sure I hadn't just picked a movie at random, at the local DVD-shop, but I didn't expect it to be so good. After I watched it I had a look on the IMDb website and was surprised once again that i found it placed number 2 on the top 250 movies list. I wondered to myself, why didn't I know about this movie. Afterall Morgan Freeman and Tim Robbins are quite well-known actors. Frank Darabont however only just caught my attention in 1999, when 'the Green Mile' was released. Finally I came to the conclusion that it must have been either television, because it surely isn't on television often enough, or it could just be me, not knowing very much about the film-world before 1995. For in fact, everyone in my school seemed to have known 'the Shawshank Redemption' for a very long time. \"One of the best movies ever\", my best friend said, \"My favorite movie in the whole wide world\", another one of my friends. THEN WHY DIDN'T YOU TELL ME!!!! I replied. If you liked 'the Green Mile', I'm telling you now, you'll love this!!!",
    "39": "The Shawshank Redemption is undoubtedly deserves to be the highest rated movie. I watched this movie for the umpteenth time. A movie I would never ever get bored of. Written & directed by Frank Darabont, this prison drama is a simple but profoundly moving tale of hope, friendship & redemption. Cinematography exquisitely captures the monotonous daily life inside prison. The bond that grows between the two main characters is unforgettable and the score is the best I have heard. Morgan Freeman makes us feel the sadness and Tim Robbins, the faith. The more times you watch it, the more you love it, and the more you learn from it. Whatever you do, don't listen to the people who say this movie is overrated because this is one of the most inspiring and greatest film. It has everything you could possibly want in a movie. If you don't love Shawshank, chances are you are beyond redemption. It is hard to find a more proper word for the film than a masterpiece. It's in my top five movies of all time. I feel so bad about not writing a review of this masterpiece during the late nineties.",
    "40": "i watch this movie for minimum 5-6 times first to last. so every time i enjoyed as i watching it first time. its a piece of art. and we now know how to entertain with no action or fighting scenes. its a pure drama that anyone can enjoy with family in silence. so i rate this movie 10 out of 10 because of amazing screen play, acting, casting, background scoring editing etc. this is my first movie review so pardon me if i did any mistake.",
    "41": "One of the best movies ever made. Simple as that. Top 20 ever, and top 3 of the 90s. The ending is just so powerful.",
    "42": "I have long viewed the Shawshank Redemption as the most underrated film of all time.  That isn't to say that it wasn't universally acknowledged by the movie-going public as a great movie, but in terms of awards, critical acclaim, and best ever lists, this has somehow kept on losing out.  Now that I see it has the number two position, as voted by the movie-going public, on probably the most accurate best ever list in the world (AFI be damned), I am eminently pleased.  There is no way Forrest Gump should have won best picture over Shawshank.  Certainly, Forrest Gump is a charming, well-acted film, but it is nothing compared to this.  Morgan Freeman excels, and Tim Robbins turns in his best performance.  If you haven't seen this masterpiece, get up and rent it immediately.",
    "43": "Andy Defresne is a young banker who goes to pieces when he learns his wife is being unfaithful.  He gets drunk and wakes in his car, where he is picked up for the murder of his wife and her lover.  Despite his pleas of innocence, Andy is sentenced to life in prison where he is immediately introduced to the horrors of live inside.  Fellow lifer, Red, tells Andy's story of how he held hope and managed to use his banking skills to improve the conditions for himself and others.I saw this film in the cinema when it came out and, looking back, it is surprising how little fuss was made over it at the time - I was one of 15 or 20 people in the cinema when I saw it (on it's second week out!).  However time has brought it to the top of many popular lists of films and it is mainly due to a story that is based around friendship and hope that engages and eventually uplifts.If you are going to adapt a Stephen King book, the lesson from this film and others appears to be to adapt a short one.  Here the story is set up well with all the usual stuff that we expect from prison dramas, but with the key difference that these events are not the film - no the film is about Andy and Red's friendship.  These two men are great characters and I was very easily drawn into their story.  It is witty, dark and yet enjoyable all at the same time.  It is impossible not to be affected by the ending and this simple uplifting sentiment is part of the reason it has been taken in by so many viewers as one of their favourites.Of course it is a little long at times and for my personal tastes it is a little too sentimental at times although this is to be expected with any Hollywood film.  The slightly sentimental view of the prison also goes so far to ignore the idea that there would be any homosexual relationship that aren't rape and even ruling out any suggestion of racism - there is no tension or segregation in evidence here.  I won't do spoilers but the ending was too clear for me where leaving us with more questions would have been more in holding with the idea of hope that the film had traded in prior to this.  The characters work well due to some great performances.  Robbins is great as Andy and he ages and grows well - whether or not he is believable in his calm approach to the punishment he takes is another matter, but I was caught up in the film enough to get past that.  Freeman may not be the Irish guy from the book (hence the name Red) but he is excellent as the father figure - even if he appears to age very slowly in comparison to Andy.  The chemistry between the two is the key and it really works.Of course having a support cast that includes a great number of fine support actors probably helped.  People like Gunton, Sadler, Bellows and others may not always be great but here they fit the bill. Yes the characters tend to be very clichéd (the bird man, the rapists etc) but again that comes with the genre and I was able to get past these by focusing on the main relationship.  The surprise performance for me was from Clancy Brown - not the most subtle of actors (Highlander is his other famous role) but he is very good here indeed, albeit with little actual character depth.  As director Darabont has done very well, framing some great shots (that crane shot as the bus arrives for the first time) as well as a shot that has become almost iconic.  He is helped by a score that fits the sweeping sense of hope that the film brings.Overall this is an imperfect film and it is flattered by it regular high appearance on the popular `best film' lists.  However it is also a great little story that twists and turns as it is told, it has all the clichés of the genre but at it's heart it is based on friendship and a sense of hope that it is hard not to find uplifting.  For all it's faults it is a popular and moving story that seems to do the trick for the majority of those that see it.",
    "44": "After just seeing this,i have to say i think its one of the best adaptations of a Stephen King story.And one of the few films that can be called a \"moden classic\". The Plot:After the police in Maine find the bodies of a married woman and her lover,who were shot eight times.They bring in the married woman's husband.A hot-shot banker Andy Dufren(Tim\"The Mystic River\" Robbins) .Who clams that he is not guilty.At the end of the case,Andy is found guilty and given two life sentences at Shawshank prison Maine.When he is first there he is very closed off from everyone.And has fights with a prison group called \"The Sisters\".Until he tells a guard how to keep money from a will.While in there,he gets the trust of the guards and the warden and builds a strong friendship with a black marketeer named Red(played fantastically by Morgan\"The Dreamcatcher,The Se7ven\"Freeman).Things are going well,till an inmate Tommy,tells Andy,that in a prison he was in,he met the man who did the murder Andys in Shawshank for.The warden,who thinks Tommy is to much of a risk for his money business due to Andy doing all work for him),so he kills Tommy.After this,Andy decides its time he gets out of Shawshank.View on the film:The cast. This is one of the rare films,where all the cast just click into there roles.The two leads Robbins and Freeman,who give some of there best work in this film.The way they work and build there friendship in the film,that is sadly rarely seen in any movies.The supporting characters in the film do a really good job at standing out and not feeling like they are just card-board cut outs.The main one in the supporting cast that stand out is James Whitmore as Brooks.who makes a very enjoyable characters,who you feel very sad,to see go out in a very sad way.The Screenply/Direction.Wirter/director Frank\"The Green Mile\" Darabont (who made a student-film based on a King short story:The Woman in the Red Room),does a screenplay that easily improves on the short story.While Kings short story spent (i feel) a bit to much time on the exposition in his story,while Darabont makes sure to keep the set-up going at a good pace,and to tighten some of the story lines(Brooks was hardly in the short story,Tommy was not killed).But he makes sure to keep the feel of the story so they do not feel as strange add-ons to the story.The direction the Darabont does is to make sure to see the actors work build in the scenes,while doing a good job at keeping the film going at a pace that does not feel over-long (something that is rare with movies now). Final view on the film:A movie anyone can enjoy,from age 18-80!",
    "45": ".....and Ironically, it most certainly does.Bank Merchant Andy Defrene is convicted of the murder of his wife and her lover, and sentenced to life imprisonment at the titular prison. Life seems to begin to fade, but fortunately Andy befriends some of the other inmates, in particular a character known only as Red. Over time Andy finds ways to live out life with relative ease as one can expect in a prison, his body may be locked away in a cell, but his spirit can never be truly imprisoned.....There is nothing to say about this film that hasn't been said before. Its awe-inspiring, its warm, and most of all, it gives you an enormous sense of well being once the credits roll.From the opening shot of the prison, to the iconic Christ like pose in the rain, the film is chock full of religious allegory, and references the bible in several key scenes. But the film demands repeat viewings, because there is so much subliminal imagery and messages in the film.The acting is brilliant, and the warmth between Andy and Red is the heart of the film, and the chemistry between Freeman and Robbins is second to none.Its a perfectly crafted film, with effortless narrative, and it will make you smile and cry in equal measures.Yes, it should have ended when Freeman got on the bus, but nothing is too perfect is it?",
    "46": "This movie is poetry. For those of you who've ever felt the way poetry rolls off of the tongue, you'll understand what I mean when I say this.The first thing that makes this movie great is Morgan Freeman's ability to narrate the way he does. His soft, yet ruff voice provides the audience with the belief that this man has endured many years of hardships and has gained wisdom and experience through trial and error. He is a natural story teller, so his ability as a narrator is natural and smooth; not forced, like so many other actors.Tim Robbins displays his acting ability beautifully and captures the audience with an intense amount of emotion, which seems to resonate in his eyes. The genius and wisdom of the character he portrays is a fascinating thing to watch unfold, as the story lays itself out, like a poster of Rita Hayworth.To say that this movie gives the audience hope would be unfair because this movie makes the audience want to live, love, experience life for all of its pleasures and its faults. It makes one appreciate the simple things and slow down a bit, to admire that which we pass a hundred times a day, but never truly see.To describe this movie as \"great\" would be an understatement because it is so much more than that. While it is brutal and realistic, it portrays humanity at our best and our worst, providing the audience with a mirror in which to reflect what lies within. By the time the credits roll, we're left speechless...and at the same time, wanting to share this masterpiece with those we love and cherish.Everyone should see this movie at least once in a lifetime to make us appreciate everything we have. Who would have thought someone could capture humanity this way? I guess a picture really is worth a thousand words......",
    "47": "THE SHAWSHANK REDEMPTION (1994) **** Tim Robbins, Morgan Freeman, Bob Gunton,Clancy Brown, William Sadler, James Whitmore, Gil Bellows. Excellent adaptation of Stephen King's novella \"Rita Hayworth and The Shawshank Redemption\" with falsely accused of murdering his wife Robbins facing hard time in a corrupt prison and a solid friend (Freeman in an unforgettable Oscar-nominated performance of stoicism). Great acting and above the preconceived \"prison film\" genre that also breaks away from the cliché of the human spirit yet enables its elements. Nominated for several Oscars including Best Picture, Screenplay Adaptation and Director.",
    "48": "This film is easily in my top three favorite films. I return to it time and time again, still captivated! Bravo to everyone involved in this timeless production.",
    "49": "The classic can be recalled repeatedly. Andy is full of yearning for life and freedom. To get out of prison is a new life for him; and red, who has been used to prison life, has become numb. To get out of prison is death for him.",
    "50": "So worth seeing in the theater thanks to fathom events and 25th anniversary plus Stephen King turned 72 recently! I admit I've been on the fence about enjoying Shawshank Redemption for a while but seeing it in the theater and re watching after not seeing it for a long time, I cried, I laughed, felt sympathy, and was very immersed.Truly remarkable and well deserving of every good opinion even after I was on the fence about it, I love the movie a lot now; Tim Robbins embodied such a glorious character! Frank Darabont made such a crafty, dark and heart wrenching experience! Fathom events is excellent, I am glad I paid over $13 dollars to see such drama perfected film.",
    "51": "A sweet and sad story of hope. I really enjoyed this movie, it wast a fun movie but it didn't have to be. It was so excellently written and acted, I really cared for all the characters and was truly heartbroken when Brooks died. So much time was given for the characters to develop and build friendship. The ending had such a long build up and was so extremely satisfying. I love how life in prison was portrayed, it was very interesting and got me invested into the story straight away. I thought after Andy was wrongly accused that the movie would focus more on him not being guilty, but it turned away from that and being more unique. The warden was an excellent character as well, he seemed nice at the beginning but slowly became more and more villainous and it really shows when watching. The way everything links together throughout the story is amazing, I love all the connections between characters and plot. This movie is an absolute joy to watch 9/10",
    "52": "In recent years the IMDB top 250 movies has had THE GODFATHER at number 1 while THE SHAWSHANK REDEMPTION has remained at number 2 . The only exception was early in 2002 when FELLOWSHIP OF THE RING topped the chart for a couple of months then dropped down to number 2 for a couple of more months . I`ll probably make myself very unpopular for saying this but I don`t think SHAWSHANK REDEMPTION deserves to be so high !!!!!! SPOILERS !!!!!!What I don`t like about it is the amount of cliches . New prisoner arrives and finds a maggot in his food , prison cliche 37 . New prisoner gives maggot to old prisoner to feed his pet bird , prison cliche 43 . It`s revealed at the end that the prisoner who has spent so many years inside is innocent after all , prison cliche numero uno . Did anyone believe during any part of this movie that Andy Dufresne was guilty ? Neither did I . Maybe that`s why I love the American prison series OZ because all the inmates there are totally guilty . There`s other things wrong with the movie . It`s about half an hour overlong , and there`s rather unrealistic bits like the warder having someone killed after finding out Dufresne is probably innocent. Oh and how many prison friendships has there been between a black man and a white man ? Maybe that last point shouldn`t be taken as a criticism because the performances of Morgan Freeman and Tim Robbins are very good and make the movie . Neither of them give a flashy performance ( Again not a criticism ) but both are very subtle in their roles , can you imagine how different this movie would have been if we`d had Tom Cruise and Denzil Washington as the stars ? Perhaps because Freeman`s character of Red does seem to have been written as a white character he`s so good in the role . Am I alone in thinking Freeman has been the best black actor in Hollywood for the last decade because he`s more interested in exploring the character instead of playing someone who`s black ? There`s also some outstanding touches from director Frank Darabont . Witness the scene early in the film where Andy spends his first night in prison with the darkness falling upon the prisoners faces . It`s almost like the artwork of Andy Dogg as the prisoners look out onto the landing as they search for fresh prey , and there is quite a touching sequence as Red leaves prison out into the harsh outside world to the strains of Thomas Newman`s scoreI gave THE SHAWSHANK REDEMPTION eight out of ten . It is a classic feel good movie but unfortunately being a cynic I do think it`s slightly overrated by IMDB voters",
    "53": "This Is Such A Classic And One Of My Favorite Movies Always Loved Watching This Movie",
    "54": "The emotions, the plot, originality, everything tied together so well at the end - normally I criticise the way movies end, but this ending was phenomenal, not cliche at all. The brutality of the prison was well portrayed, and made me feel sorry for the characters.All the characters were believable and had depth, and none of the scenes were dramatic, but there was tension throughout the film. I'm going to stop fangirling now, but this movie is my favourite tied with the Godfather!!",
    "55": "I was reluctant to see this movie - thought it was just another prison movie - and I was certainly tired of mindless violence. I was channel surfing one evening - and stumbled across this movie. I watched a few minutes, thinking I would change channels at the first commercial. Almost 2 hours later - after seeing the end - I sat there...saying \"Wow\". That was a great movie. I have since recommended it to friends and family...it has grown in popularity due to word of mouth - and certainly deserves its spot at the top. Morgan Freeman put on a masterful performance, as did Tim Robbins. The way their friendship develops and the interplay with the other inmates - a wonderful story.If you have not watched this movie yet - put preconceived notions aside, sit down, and enjoy the journey!",
    "56": "Andy Dufresne (Robbins), a well educated banker, is wrongfully convicted of killing his wife and her lover and sentenced to life in prison at Shawshank Penitentiary. This movie follows his life as it falls apart and he succumbs to living as an inmate surrounded by hardened criminals and a strict bible thumping warden with his henchmen prison guards.Saw this movie years ago and was absolutely stunned. This film is a genuine masterpiece and probably the greatest movie ever made. Tim Robbins and Morgan Freeman are amazing and just steal the show as convicts turned best friends. The movie is perfectly paced with very real characters and emotions that are all captivating. The prison itself is very authentic and the set pieces are very realistic which captured the prison environment better than any other prison set film except for maybe Escape From Alcatraz. Even as a hard drama this movie is never slow or boring or dry it is simply just that good.",
    "57": "'The Shawshank Redemption' is the best film ever made in the history of world cinema! The Best Hollywood Film Of All-Time! A Masterpiece! A cult classic! A legendary Epic! A Film that you moves you, leaves you stunned!Performances: Tim Robbins is astounding, his careers finest after Mystic River. Morgan Freeman is masterful, his careers finest after Million Dollar Baby. Others are excellent.'The Shawshank Redemption' is cinema at its very best. My salute to this flick! A true Masterpiece! I just love this film! The most powerful film of all-time.",
    "58": "This film will stand the test of time \nAnd it will remain one of the best films ever madePlease do not remake this gem \nIt must be left alone..Superb",
    "59": "Quite deserving of such acclaim, the acting is superb, the storyline captivating, and the cinematography quite beautiful. The storyline itself was unexpected and I quite enjoyed watching it unfold. Tim Robbins is really incredible in that his character comes off so subtly. And let's be honest, how can any movie narrated by Morgan freeman be bad?",
    "60": "I enjoyed reading Stephen King's short story \"Rita Hayworth And Shawshank Redemption\" from the book \"Different Seasons\" more than watching the movie. However, it's still one of my favourite movies of all time.It has very few peers, and has to be seen. It is Awesome.",
    "61": "Don't want to say any words about this film. Just a perfect 10.",
    "62": "'The Shawshank Redemption'... hmm where do I start. 'The Shawshank Redemption' is clearly one of the greatest films ever, I find that it really can show what it would be like trapped in a tiny little prison, eventually you would only think of what's outside the prison instead of inside or you might even become attached to the prison or should I say home.What the audience really enjoy's about this movie is that you have been deceived for you believe through out most of the movie that there is noway out for poor Andy Dufresne and that he is trying to be nice to the guards for a chance of believable. After that you discover that the whole film and everything that has happened has all gone towards the escape of Andy Dufresne and the suicide of the dreadful warden. The audience has been gullible enough to believe that Andy was getting used to the prison. 'The Shawshank Redemption' is clearly not just a movie, it is also beautiful art. Every little piece of the movie was delicately put together to create pure yet daunting art.The story is about Andy Dufresne a wealthy intelligent banker who's wife is having an affair with another man. Eventually both the wife and the other man are killed while having sex, with all evidence pointing to Andy, Andy is sentenced to two life times of prison. In prison Andy does a lot of the workers at the prison's (and that include's the warden) banking. From then of the story is all about Andy in the prison and he idea's of hope and love of music.One of the most beautiful and touching moments in the movie is when Andy locks all the doors in the room that has the microphone and plays opera music of two Italian women singing opera in Italian. Morgen Freeman then say's that he had no idea what the two Italian women were singing but doesn't want to know, he just like to imagine that the words were too beautiful to be sung in English.The acting is brilliant and the directing is directed absolutely unbelievably tremendous. I praise both Morgan Freeman and Tim Robbins for a very touching movie that I will always remember.In conclusion, 'The Shawshank Redemption is one of the greatest films ever that I have ever seen, if you do not like it I will also understand that you didn't listen closer to the brilliant word that were able to come out of the actors mouth.Hope is a dangerous thing.",
    "63": "Shawshank Redemption is without a doubt the most uplifting and touching film I have ever seen. It is the only movie I've seen that has made tears of happiness come to my eyes. I would (and do) recommend this film to anyone and everyone.",
    "64": "There is no denying that this is a very good movie. The acting is great and it tells a good story. Personally, I find it a bit too long and a little too sweet for my taste, but its far from a bad film. On the other end of the spectrum I have yet to understand why this film was nominated for as many Oscars as it was and why so many people have fallen in love with it. To place it on the same level as The Godfather and several hundred other films has to be the result of different tastes.\nThis is a film that should be seen because its a good movie, not because its a great one.",
    "65": "However delightful as it is The Shawshank Redemption has no allegories and no statements to make and it brought nothing new to cinema in either style or substance.It had no revolutionary ideas or approaches it's only a very safe buddy story A damn good one but still just that. So it can impossibly be a film that will be remembered or studied, because what will it be remembered for Friendship Huh neat At the end of the day Shawshank is a good film but far from a perfect one. I'm not interested in responding to its Top 250 placement with my review as countless others have done but the fact that it has been voted into the number one slot is a reflection of how universal its appeal is it's about as likable and massmarketed as possible There's nothing here to really offend or provoke and the film doesn't take enough changes to potentially polarize audiences it plays it safe and in my opinion a bit too safe. I can't say much more than I was incredibly underwhelmed by this film .Perhaps it was that I had been told what a great film it was by all and sundry but I found it utterly average I am afraid I just didn't get what was so fantastic about the movie Every other second i was hearing violins about how this poor guy got landed in jail for a murder he didn't commit. It's stereotypical and you guys who voted 10 bought it hook, line and sinker.But what about the great twist ok the twist was good but come on like i said before was it THAT great Ask yourselves honestly, was that better than The Sixth Sense's or The Usual Suspects Also how come foreign films which are far superior to this get no credit Watch Le Samurai or La Haine or Todo Sobre Mi Madre. Far more superior\n.Don't get me wrong it was an entertaining film but not the masterpiece I was lead to believe it was SorryThe film's message of hope and redemption is way too heavy-handed, the outcome being a movie that is very simple and easy to digest but not really very interesting beyond its surface.On the other end of the spectrum I have yet to understand why this film was nominated for as many Oscars as it was and why so many people have fallen in love with it. To place it on the same level as The Godfather and several hundred other films has to be the result of different tastes. It speaks volumes that so many people who have gone through depression often reference this as one of the aids they used for comfort it's a movie that pats people on the back and gives them hope and inspiration But moving on and looking past that it is possibly one of my all-time favourite films for the feelings it leaves Sure it often jerks you for tears just a bit too purposely but this is forgivable because emotion is crucial to a prison story On top of that it never falls prey to predictable sappiness probably because of its content which is devoid of sentimental romance and instead fills you up with a tragic friendship. It is so well sewn together by a feel good narrative by Morgon Freeman that it is impossible not to enjoy this film That common misunderstanding behind, a well made film Not much can be said about the actors that hasn't been said Morgan Freeman gives one of the best performances of his career, and even though I've only seen 2 or 3 other Tim Robbins movies I'm sure the same can be said for himThough I don't agree with the multitudes of people that call this the best movie ever made it was still a very good very well made very entertaining and almost heartbreakingThis is a film that should be seen because its a good movie not because its a great one.",
    "66": "What can I say about this film that hasn't already been said? The storytelling, music, visuals, characters, emotions, themes, literally everything has been carefully thought out and done exceptionally well.My only problems with it -\nTommy just happens to know the guy who killed Andy's wife and that guy just happens confess everything to Tommy.The fact that literally know one, not even the guards during Inspection bothered to flip a poster even once for 17 whole years.",
    "67": "I still can't quite get the enormous reputation of this film. I saw it again last night and instead of clearing up the mystery, the mystery got thicker. It is enjoyable film with very good performances by Tim Robbins, Morgan Freeman, James Whitmore etc, but...the most highly rated film ever? I don't get it. The voice over alone seems to belong to a so so film. I love Morgan Freeman's voice but he's telling us what we're seeing. So, the sterling reputation damages the enjoyment of the film because one is expecting something that never, really, arrives. The most interesting aspect is Tim Robbins's psychological journey. Credible or incredible doesn't quite matter, I did go with him without asking too many questions. Morgan Freeman's humanity is contagious and inspiring, whether credible or not because I bought it. So, a masterpiece? No. Good, even very good? Yes.",
    "68": "I finally watched The Shawshank Redemption and I agree that it is an excellent film. The pacing, directing, and storyline, holds interest throughout, along with a superb supporting cast, and a very moving ending.The main character is Andy played by Tim Robbins who is imprisoned for the murder of his wife. Later on in the movie, the evidence comes out that he is truly innocent. However The Shawshank Redemption sends a powerful message that it doesn't matter whether you are innocent or not inside Shawshank penitentiary. This is because the prison is run by a sadistic and corrupt staff. In this facility, you must use all of the intellect you can, both book smarts, and street smarts to not only stay alive, but prevent yourself from going insane within the system.Andy befriends \"Red,\" a fellow inmate, played by Morgan Freeman in another great performance. He teaches Andy street smarts of survival within Shawshank's hell-hole. Andy, an experienced banker with a master ability for finance and book learning, manipulates the prison officials to get funds to set up a \"basic skills\" learning facility within the prison's library. Red helps him organize this, and HOW Andy sets up the funding is really an amazing part of the movie. Another inmate is the head librarian, known as \"Brooks,\" who delivers many amazing scenes in the movie.What is special about The Shawshank redemption is how the characters, especially Andy and Red, are able to use their inner abilities to rise above the conditions of the prison and the people who run it. There are some disturbing and violent images that show the harsh realities of prison life, such as fighting, and often getting beaten by the staff or punished for very small offenses and a lot of times for no reason at all. The Shawshank Redemption shows the abuse of power by prison authorities and how the inmates have to have the courage to rise above this abuse, because they need to do this, in order to keep living. They learn that failure to get this courage and survival skills from other inmates will destroy them. A great quote in this film is. \"you can get busy living, or you can get busy dying.\" Another interesting experience is how Red often wonders how at his advancing age he will be able to survive outside the prison if and when the parole board lets him go. An underlining message is that whether you \"get busy living or dying\" you become so accustomed to life in a controlling environment that the outside world, and the struggles, to reach it, to become physically and mentally \"free\" are an enormous challenge requiring great perseverance and the ultimate in determination.As good as this movie is, I was looking for that spark of magic that would put it at and over the top of all time classic films. However, I think that there are some outstanding prison movies that are just as good if not better than The Shawshank Redemption. Watch the Sean Penn Movie, \"Bad Boys\" for an outstanding portrayal inside and outside a juvenile prison. (Interestingly, Clancy Brown, who plays the bad officer in \"Shawshank,\" is just as good as a prison bully in \"Bad Boys.\") Another great movie is \"Midnight Express\" which is (although loosely) based on the real story of Billy Hayes who was arrested in Turkey for trying to smuggle hashish back to the USA in 1970. This is another amazing survival prison picture with an unforgettable musical score and some chilling moments.I see The Shawshank Redemption equal to, but no better than \"Midnight Express\" or \"Bad Boys.\" This is NOT a criticism of a fine movie! I am only putting The Shawshank Redemption in strikingly similar prison survival pictures that don't get the same credit that this movie does. Call this movie the greatest ever, and you have to do the same for \"Midnight Express\" or \"Bad Boys.\" All three films have the same emotional impact. Another under rated movie that you should see is \"An Innocent Man,\" which is also similar to The Shawshank Redemption but is considered only above average.The Shawshank Redemption is a great film for its time. But because of similarities to other similar prison pictures, I can't classify it as great for all time",
    "69": "I was reluctant to see this movie - thought it was just another prison movie - and I was certainly tired of mindless violence. I was channel surfing one evening - and stumbled across this movie. I watched a few minutes, thinking I would change channels at the first commercial. Almost 2 hours later - after seeing the end - I sat there...saying \"Wow\". That was a great movie. I have since recommended it to friends and family...it has grown in popularity due to word of mouth - and certainly deserves its spot at the top. Morgan Freeman put on a masterful performance, as did Tim Robbins. The way their friendship develops and the interplay with the other inmates - a wonderful story.If you have not watched this movie yet - put preconceived notions aside, sit down, and enjoy the journey!",
    "70": "Andy Dufresne (Robbins), a well educated banker, is wrongfully convicted of killing his wife and her lover and sentenced to life in prison at Shawshank Penitentiary. This movie follows his life as it falls apart and he succumbs to living as an inmate surrounded by hardened criminals and a strict bible thumping warden with his henchmen prison guards.Saw this movie years ago and was absolutely stunned. This film is a genuine masterpiece and probably the greatest movie ever made. Tim Robbins and Morgan Freeman are amazing and just steal the show as convicts turned best friends. The movie is perfectly paced with very real characters and emotions that are all captivating. The prison itself is very authentic and the set pieces are very realistic which captured the prison environment better than any other prison set film except for maybe Escape From Alcatraz. Even as a hard drama this movie is never slow or boring or dry it is simply just that good.",
    "71": "'The Shawshank Redemption' is the best film ever made in the history of world cinema! The Best Hollywood Film Of All-Time! A Masterpiece! A cult classic! A legendary Epic! A Film that you moves you, leaves you stunned!Performances: Tim Robbins is astounding, his careers finest after Mystic River. Morgan Freeman is masterful, his careers finest after Million Dollar Baby. Others are excellent.'The Shawshank Redemption' is cinema at its very best. My salute to this flick! A true Masterpiece! I just love this film! The most powerful film of all-time.",
    "72": "This film will stand the test of time \nAnd it will remain one of the best films ever madePlease do not remake this gem \nIt must be left alone..Superb",
    "73": "Quite deserving of such acclaim, the acting is superb, the storyline captivating, and the cinematography quite beautiful. The storyline itself was unexpected and I quite enjoyed watching it unfold. Tim Robbins is really incredible in that his character comes off so subtly. And let's be honest, how can any movie narrated by Morgan freeman be bad?",
    "74": "I enjoyed reading Stephen King's short story \"Rita Hayworth And Shawshank Redemption\" from the book \"Different Seasons\" more than watching the movie. However, it's still one of my favourite movies of all time.It has very few peers, and has to be seen. It is Awesome.",
    "75": "Don't want to say any words about this film. Just a perfect 10.",
    "76": "'The Shawshank Redemption'... hmm where do I start. 'The Shawshank Redemption' is clearly one of the greatest films ever, I find that it really can show what it would be like trapped in a tiny little prison, eventually you would only think of what's outside the prison instead of inside or you might even become attached to the prison or should I say home.What the audience really enjoy's about this movie is that you have been deceived for you believe through out most of the movie that there is noway out for poor Andy Dufresne and that he is trying to be nice to the guards for a chance of believable. After that you discover that the whole film and everything that has happened has all gone towards the escape of Andy Dufresne and the suicide of the dreadful warden. The audience has been gullible enough to believe that Andy was getting used to the prison. 'The Shawshank Redemption' is clearly not just a movie, it is also beautiful art. Every little piece of the movie was delicately put together to create pure yet daunting art.The story is about Andy Dufresne a wealthy intelligent banker who's wife is having an affair with another man. Eventually both the wife and the other man are killed while having sex, with all evidence pointing to Andy, Andy is sentenced to two life times of prison. In prison Andy does a lot of the workers at the prison's (and that include's the warden) banking. From then of the story is all about Andy in the prison and he idea's of hope and love of music.One of the most beautiful and touching moments in the movie is when Andy locks all the doors in the room that has the microphone and plays opera music of two Italian women singing opera in Italian. Morgen Freeman then say's that he had no idea what the two Italian women were singing but doesn't want to know, he just like to imagine that the words were too beautiful to be sung in English.The acting is brilliant and the directing is directed absolutely unbelievably tremendous. I praise both Morgan Freeman and Tim Robbins for a very touching movie that I will always remember.In conclusion, 'The Shawshank Redemption is one of the greatest films ever that I have ever seen, if you do not like it I will also understand that you didn't listen closer to the brilliant word that were able to come out of the actors mouth.Hope is a dangerous thing.",
    "77": "Shawshank Redemption is without a doubt the most uplifting and touching film I have ever seen. It is the only movie I've seen that has made tears of happiness come to my eyes. I would (and do) recommend this film to anyone and everyone.",
    "78": "There is no denying that this is a very good movie. The acting is great and it tells a good story. Personally, I find it a bit too long and a little too sweet for my taste, but its far from a bad film. On the other end of the spectrum I have yet to understand why this film was nominated for as many Oscars as it was and why so many people have fallen in love with it. To place it on the same level as The Godfather and several hundred other films has to be the result of different tastes.\nThis is a film that should be seen because its a good movie, not because its a great one.",
    "79": "However delightful as it is The Shawshank Redemption has no allegories and no statements to make and it brought nothing new to cinema in either style or substance.It had no revolutionary ideas or approaches it's only a very safe buddy story A damn good one but still just that. So it can impossibly be a film that will be remembered or studied, because what will it be remembered for Friendship Huh neat At the end of the day Shawshank is a good film but far from a perfect one. I'm not interested in responding to its Top 250 placement with my review as countless others have done but the fact that it has been voted into the number one slot is a reflection of how universal its appeal is it's about as likable and massmarketed as possible There's nothing here to really offend or provoke and the film doesn't take enough changes to potentially polarize audiences it plays it safe and in my opinion a bit too safe. I can't say much more than I was incredibly underwhelmed by this film .Perhaps it was that I had been told what a great film it was by all and sundry but I found it utterly average I am afraid I just didn't get what was so fantastic about the movie Every other second i was hearing violins about how this poor guy got landed in jail for a murder he didn't commit. It's stereotypical and you guys who voted 10 bought it hook, line and sinker.But what about the great twist ok the twist was good but come on like i said before was it THAT great Ask yourselves honestly, was that better than The Sixth Sense's or The Usual Suspects Also how come foreign films which are far superior to this get no credit Watch Le Samurai or La Haine or Todo Sobre Mi Madre. Far more superior\n.Don't get me wrong it was an entertaining film but not the masterpiece I was lead to believe it was SorryThe film's message of hope and redemption is way too heavy-handed, the outcome being a movie that is very simple and easy to digest but not really very interesting beyond its surface.On the other end of the spectrum I have yet to understand why this film was nominated for as many Oscars as it was and why so many people have fallen in love with it. To place it on the same level as The Godfather and several hundred other films has to be the result of different tastes. It speaks volumes that so many people who have gone through depression often reference this as one of the aids they used for comfort it's a movie that pats people on the back and gives them hope and inspiration But moving on and looking past that it is possibly one of my all-time favourite films for the feelings it leaves Sure it often jerks you for tears just a bit too purposely but this is forgivable because emotion is crucial to a prison story On top of that it never falls prey to predictable sappiness probably because of its content which is devoid of sentimental romance and instead fills you up with a tragic friendship. It is so well sewn together by a feel good narrative by Morgon Freeman that it is impossible not to enjoy this film That common misunderstanding behind, a well made film Not much can be said about the actors that hasn't been said Morgan Freeman gives one of the best performances of his career, and even though I've only seen 2 or 3 other Tim Robbins movies I'm sure the same can be said for himThough I don't agree with the multitudes of people that call this the best movie ever made it was still a very good very well made very entertaining and almost heartbreakingThis is a film that should be seen because its a good movie not because its a great one.",
    "80": "What can I say about this film that hasn't already been said? The storytelling, music, visuals, characters, emotions, themes, literally everything has been carefully thought out and done exceptionally well.My only problems with it -\nTommy just happens to know the guy who killed Andy's wife and that guy just happens confess everything to Tommy.The fact that literally know one, not even the guards during Inspection bothered to flip a poster even once for 17 whole years.",
    "81": "I still can't quite get the enormous reputation of this film. I saw it again last night and instead of clearing up the mystery, the mystery got thicker. It is enjoyable film with very good performances by Tim Robbins, Morgan Freeman, James Whitmore etc, but...the most highly rated film ever? I don't get it. The voice over alone seems to belong to a so so film. I love Morgan Freeman's voice but he's telling us what we're seeing. So, the sterling reputation damages the enjoyment of the film because one is expecting something that never, really, arrives. The most interesting aspect is Tim Robbins's psychological journey. Credible or incredible doesn't quite matter, I did go with him without asking too many questions. Morgan Freeman's humanity is contagious and inspiring, whether credible or not because I bought it. So, a masterpiece? No. Good, even very good? Yes.",
    "82": "I finally watched The Shawshank Redemption and I agree that it is an excellent film. The pacing, directing, and storyline, holds interest throughout, along with a superb supporting cast, and a very moving ending.The main character is Andy played by Tim Robbins who is imprisoned for the murder of his wife. Later on in the movie, the evidence comes out that he is truly innocent. However The Shawshank Redemption sends a powerful message that it doesn't matter whether you are innocent or not inside Shawshank penitentiary. This is because the prison is run by a sadistic and corrupt staff. In this facility, you must use all of the intellect you can, both book smarts, and street smarts to not only stay alive, but prevent yourself from going insane within the system.Andy befriends \"Red,\" a fellow inmate, played by Morgan Freeman in another great performance. He teaches Andy street smarts of survival within Shawshank's hell-hole. Andy, an experienced banker with a master ability for finance and book learning, manipulates the prison officials to get funds to set up a \"basic skills\" learning facility within the prison's library. Red helps him organize this, and HOW Andy sets up the funding is really an amazing part of the movie. Another inmate is the head librarian, known as \"Brooks,\" who delivers many amazing scenes in the movie.What is special about The Shawshank redemption is how the characters, especially Andy and Red, are able to use their inner abilities to rise above the conditions of the prison and the people who run it. There are some disturbing and violent images that show the harsh realities of prison life, such as fighting, and often getting beaten by the staff or punished for very small offenses and a lot of times for no reason at all. The Shawshank Redemption shows the abuse of power by prison authorities and how the inmates have to have the courage to rise above this abuse, because they need to do this, in order to keep living. They learn that failure to get this courage and survival skills from other inmates will destroy them. A great quote in this film is. \"you can get busy living, or you can get busy dying.\" Another interesting experience is how Red often wonders how at his advancing age he will be able to survive outside the prison if and when the parole board lets him go. An underlining message is that whether you \"get busy living or dying\" you become so accustomed to life in a controlling environment that the outside world, and the struggles, to reach it, to become physically and mentally \"free\" are an enormous challenge requiring great perseverance and the ultimate in determination.As good as this movie is, I was looking for that spark of magic that would put it at and over the top of all time classic films. However, I think that there are some outstanding prison movies that are just as good if not better than The Shawshank Redemption. Watch the Sean Penn Movie, \"Bad Boys\" for an outstanding portrayal inside and outside a juvenile prison. (Interestingly, Clancy Brown, who plays the bad officer in \"Shawshank,\" is just as good as a prison bully in \"Bad Boys.\") Another great movie is \"Midnight Express\" which is (although loosely) based on the real story of Billy Hayes who was arrested in Turkey for trying to smuggle hashish back to the USA in 1970. This is another amazing survival prison picture with an unforgettable musical score and some chilling moments.I see The Shawshank Redemption equal to, but no better than \"Midnight Express\" or \"Bad Boys.\" This is NOT a criticism of a fine movie! I am only putting The Shawshank Redemption in strikingly similar prison survival pictures that don't get the same credit that this movie does. Call this movie the greatest ever, and you have to do the same for \"Midnight Express\" or \"Bad Boys.\" All three films have the same emotional impact. Another under rated movie that you should see is \"An Innocent Man,\" which is also similar to The Shawshank Redemption but is considered only above average.The Shawshank Redemption is a great film for its time. But because of similarities to other similar prison pictures, I can't classify it as great for all time",
    "83": "From the director of 1990's \"Buried Alive\" comes perhaps the strongest drama of 1994. \"The Shawshank Redemption\" is emotionally fulfilling in every way, uplifting its audience again and again. Darabont's screenplay, adapted from (and expanded upon) Stephen King's short novella \"Rita Hayworth and the Shawshank Redemption\", is at once soul stirring, heart-rending and disarmingly funny. As director, Frank Darabont brings this poignant and oft times surprising (largely unpredictable thank goodness) script to the screen with the kind of loving care that only a writer/director can, ensuring that all the right elements are brought to the surface.Startling performances from Tim Robbins, Morgan Freeman and the entire support cast help make this picture a powerful production. As convicted double murderer Andy Du Fresne, Robbins portrays innocence and determination superbly. He's a man who not only strongly believes he has a future, but that it's a good one. Freeman is spot on as the world weary \"Red\", the lifer who specialises in the supply of merchandise (\"whatever you want\") to other inmates. He is gradually transformed, and always surprised, by Andy's optimism, geniality and brilliance. In support of these two leads are some very strong turns which provide an over all feast of superlative acting talents.The cinematography is superb, capturing some spectacular images of the foreboding Shawshank prison, while Thomas Newman's music is awe inspiring and must be duly recognised as a truly moving composition.\"The Shawshank Redemption\" is a long movie, though it would seem that to shorten it would mean to miss out on some powerful, if not crucial scenes. In this light, the editing team have done a marvellous job.What makes this film so effective is Darabont's brilliant script and astute direction, coupled with the strong acting and great support production. Darabont achieves all his objectives, making us laugh, cry, listen and think, he both surprises and inspires us many times. We're left in the end with an uplifting and wholly satisfying movie, which is unexpectedly memorable and magnificently rewarding. A definite triumph of the human spirit.Perhaps the conclusion could be called simplistic, but certainly not expected, and that's what makes this story so great. \"The Shawshank Redemption\" comes from nowhere to really hit you with its well written characters and even its carefully researched history. Wonderfully emotionally telling and thankfully intellectually sharp, its a pleasure that you must treat yourself to! Look for two brilliantly played characters in the form of the menacingly sinister Warden (Bob Gunton) and the despicable, ruthlessly violent Captain of the Guards (Clancy Brown).Thursday, July 27, 1995 - Waverley Pinewood Cinema\"The Shawshank Redemption\" was the surprise of 1994 from director Frank Darabont. Full of emotional highs both comic and poignant, it is by far the best prison film I've ever seen. Performances from Tim Robbins and Morgan Freeman are truly inspired, whilst a classy support cast lend strong backing. Cinematography is at times breathtaking and Thomas Newman's score is sweeping and melodic.For uplifting cinema that constantly comes form nowhere to move its audience you can't go past \"The Shawshank Redemption.\"Tuesday, April 30, 1996 - Astor Theatre",
    "84": "A film about a Stephen King story? Directed by Frank Darabont.  .  .  Who?  Starring Tim Robbins.  .  .  Wasn't he the guy from Howard the Duck?  I admit, only the sublime acting talents of Morgan Freeman took me along to see this movie.  Now the only questions I have to ask are:  Why didn't EVERYBODY go to see this movie?  and, Why didn't Morgan Freeman win the Oscar?  Tom Hanks is a fine actor but, he should never have beaten Morgan.  Once again a Stephen King short story translates to film better than his horror opus'.  Tim Robbins pulls out his finest performance to date, and, Mr Darabont take a bow.  Very rarely are you left with a large smile and warm heart at the end of a movie but, I could have danced as the camera slowly panned back from the beach.  .  .  Perfect.",
    "85": "Shawshank Redemption (1994)The short of it: I asked some students what their favorite movie was, and some of them (many of them) said, \"Shawshank Redemption,\" and I said, \"I haven't even seen it.\" And they assigned it to me as homework. I started watching, and after about twenty minutes I realized I had, in fact, seen it before.That's how memorable it was for me.I also see that Shawshank has the highest user rating of any film on IMDb. What do these other intelligent, movieloving people see that I don't? I wish I could know, but I can't except by reading their comments. And here, then, finally, is mine.First of all, I don't think it's a terrible film, despite all the picking I do. I'm trying to be analytical. But when I take one aspect and think about it independently, and compare it to other movies I like, it starts to look weak for specific reasons, which is good to know. Please don't read further if you just want a confirmation of why this is a great film. In brief, I don't think Shawshank probes, invents, or seduces aesthetically. It's just a nice story well told.First, that story. Stephen King is a successful writer, to say the least, and a really good \"wordsmith.\" His stories work with simple conflicts, and they are plot driven--one thing happens, another thing happens, a third thing is almost necessary to have happen, a twist, a turn, and always, from what I can tell, a nice wrap up. That's pretty much the plot in Shawshank. There is almost no depth to the characters--they are stereotypes, not made of foamcore maybe, but flimsy. There is the evil warden, of course. There is the thoughtful black man who everyone likes, played by Morgan Freeman (who narrates), and the thoughtful white man who doesn't like anyone (at first), played by Tim Robbins.Of course, it goes from there, but really, the \"twists\" are old ones. The plot is the framework for something I found more irritating, and that was a slightly glib tone. The story was not really \"realistic\" in any sense, though the trappings of actual prison life are all there, from rape in the back room to corruption in the front office. Maybe as a \"fable\" it can get away with its airiness, right up to the final happy ending. It might not need any grounding in reality. As a fable it would naturally avoid complexity, or even anything independently interesting. What I mean is, maybe the journey through these familiar clichés, done with a fuzzy, congenial ease, is self-satisfying on purpose. And therefore Shawshank Redemption is heartwarming and enjoyable, to use two words that are as exciting together as milk and warm.But it was this breezy tone that made it unwatchable for me. I had to fastforward through a few parts in the second half (it was my second time seeing it). It seemed that nothing happening! Nothing I hadn't seen before in other movies. It struck me not as mythic or spiritual (those are words people use) but as false, as anti-meaningful because it's obvious, familiar, comforting.The film-making? Let's tick off some basics. Editing: conventional, and downright slow. You can argue the pace was leisurely and luxurious to draw the viewer in. Or you can say it's drawn out and sluggish.Music: functional and familiar, \"movie music\" pure and simple, in its lush seduction, which is offputting once you pay attention to it directly.Script: hmmmm. The writing is not distracting or \"bad\" especially, but that's hardly a recommendation. It gets the information across. But really, read some lines, repeat a few scenes out loud. There are those now famous lines, about everyone being innocent and so on, but most of the movie doesn't crackle--even other Hollywood heartwarmers like Die Hard have more inventiveness. Isn't Shawshank presenting Hallmark sentiments?Acting: exactly what the film needed for its pace and intentions. No faulting Freeman or Robbins there.Photography: professional. If there was a movie crying out for some great filming, this is one, with a great interior to exploit and some good night scenes. But the camera work is functional, with a few moments of higher drama (the prisoner getting shot from above, the escape sequence). But look how often the scenes are just filmed \"nicely\" so that we enjoy being there. Maybe this is the idea, to be caressed and not assaulted--it's not an action adventure film, so I don't expect to be shocked. Direction: finally, the lynchpin person here needs to be accountable. Oh, I'm sure Frank Darabont doesn't mind the cult status of his movie, but he probably knows he is no auteur, but rather rode the coattails of a lot of talented craftspeople around him. But those other people all had to count on him to ask for (and deliver) something with more originality, beauty, surprise, depth, and compactness than the Shawshank we have. It's not a shame, obviously, that we have what we have, because so many people love it, really really love it. I didn't care for his other well known film either, The Green Mile, and so again, it's just what you want from your two hours of absorption.But it brings me back to where I started, which is to realize that there are all kinds of viewers, and movies to match. This one didn't go the places I need a great movie to go. It's not a bad movie, not at all. In fact, this might be a classic example of a movie being much more than the sum of its parts. But, still, even the whole strikes me as flip and easy-breezy, obvious as child's lie. It is content to be superficial, and I, personally, am not.",
    "86": "My top film. Hope is good, and it never dies.\n🌲🌲🌲",
    "87": "I have written a few reviews on IMDb and Shawshank is one of my favorite movies of all time. I don't necessarily think this movie was a 10 but an easy 9 for me. I am giving it a 10 because of the negative reviews that I read with saying they gave this movie a 1 just because others had given it a 10. As far I'm concerned it's mine to give, if I want to to give every a movie a 10, (which by the way I don't). I am just sick of people telling me that a movie can't be great because it was story driven and not character driven, maybe I like story driven movies, I certainly liked this one. So here's another 10 for you movie snobs will have to eradicate.",
    "88": "After ten years, I watched this movie again. I wanted to see whether my thoughts will change or not, because ten years ago I did not understand why this movie is at the top. Still, I think it should not be even in top 50 movies, because nothing is special. Years are passing just like a moment, I could not feel his pain or hope. In one scene, he wants something than bum it is happening. Again, for one scene his situation is so bad, than guess what happens? After just 30 seconds, he is good. So you never go top or down during this movie. My suggestion is it is better to watch this movie without the number 1 expectations.\nThe best coutes:\n\"I have to remind myself that some birds aren't meant to be caged.\" - Red",
    "89": "Truly a masterpiece of cinema.  I hope this film gets the critical recognition it deserves as the years go by.  Almost everyone i have encountered has loved this film.  How did it not win oscars galore.  Tim Robins and Morgan Freeman are simply perfect in what is essentially a love story.  A love of hope, a love of friendship and a love of life, no matter the constraints.  I LOVE THIS FILM!",
    "90": "When i watched this film i thought now whats this going to be like? After watching it i thought it was a brilliant film,fantastically acted with greats like Morgan Freeman and Tim Robbins and Bob Gunton. Very realistic and definitely one of my absolute favourites of all time. At the end it made me cry and thought about life. Every time i watch it the film brings a tear to my eye. Fantastic film and worth watching,it's really realistic film and another one of stephen king's great stories, a story of hope and many people who have watched will say the same thing - if you haven't seen this film already then watch it, it is brilliant, just brilliant!!be prepared to be moved, it's such a breathtaking journey for the whole two hours. A truly lovely magical film, my favourite of all time fantastic",
    "91": "The Shawshank Redemption is a well made, engaging and comprehensive film.It's an escape film without action, thrills or suspense, even though we're aware that he's digging off screen. It's more of a collective story than memorable moments. The characters are good and the performances solid, though not demanding as a lot of it's in the narration. Only the Brooks part's really evoking and perhaps the bit playing the record, as the tone's that of a harsh setting. The inner worry and satisfaction Andy must feel as the warden and guard are in his cell next to the poster, gives more weight to the record scene as all that work could've been for nothing if they took away everything. Though knowing they didn't find out perhaps kept his sanity while in isolation.",
    "92": "The Shawshank Redemption (1994): Dir: Frank Darbont / Cast: Tim Robbins, Morgan Freeman, James Whitmore, Bob Gunton, William Sadler: Gripping film about finding refuge in a place of despair. Tim Robbins plays banker Andy Dufresne in 1947, convicted of murdering his wife and her lover. The verdict is not the issue, but rather his familiarizing himself into routine life within prison walls. He faces the trials of violent leering inmates but forms a bond with Ellis Boyd \"Red\" Redding, played by Morgan Freeman. Redding can get things for a price and soon Andy has items smuggled into his cell. Andy finds favor when his banking comes into play and doing taxes for the corrupt Christian warden and the guards. Andy is able to improve the library but discovers a scheme by the warden that leaves him to his own devices when proof of his innocence is sabotaged. Director Frank Darabont paints the grim and depressing portrait of prison and populates it with personalities struggling to exist within. Robbins is at his best as a victim adapting and improving his circumstance before intelligence wins out. Freeman is great as the humble and resourceful Redding. James Whitmore plays aged librarian Brooks whose release leads to questions regarding freedom verses existence. Bob Gunton is effective as the ruthless warden. Redemption is freedom of mind and soul whether in prison or in opportunity. Score: 10 / 10",
    "93": "You could describe \"The Shawshank Redemption\" in a number of ways; engrossing drama, riveting character study, top-shelf prison movie. But it's nothing it not a shining example of the power of the indomitable human spirit. You root for Andy Dufresne from the very beginning as a man unfairly targeted by fate, and you want desperately for him to succeed . . . somehow. Mixed in with all of this is a well-written story about friendship, and even a little bit of revenge to sweeten the deal. As a Stephen King story, it's a classic, and a faithful screen adaptation.And that cast is impeccable.9/10",
    "94": "a film about freedom. not only because the story has as scene a prison. but for the force and grace and precise of creation freedom of actors and director, ideas and dialogs, whole script and special emotions of viewer. it is a rare film because it represents more than brilliant acting or smart script. it is a homage for basic values and eulogy to friendship. it is representation of a form of revolution who can be considered fruit of a different religious perception. it seems be perfect. and this is key to be more than a good/interesting film but an extraordinary cinema lesson. Red, Rita Hayworth poster and Andy Dufresne. that is all. at first sigh.",
    "95": "Deliberately (some might even say slowly in places) paced, \"The Shawshank Redemption\" alternates between offering a grittily realistic portrayal of life in prison and flights of fancy that make the story too unbelievable to really be accepted. There is an interesting subplot (which doesn't take up much of the movie but which does make the viewer ponder) about the difficulties of adjusting to life in the real world after extended periods of incarceration. The performances from the two leads are excellent. Morgan Freeman puts on his usual outstanding performance as \"Red\" - the wise old con through whose eyes the story is told, and Tim Robbins as Andy Dufresnce, a young banker wrongly convicted of murdering his wife and her lover who has to adjust to the nightmare of prison life. Among the supporting cast I was impressed with Bob Gunton as the Bible-spouting but corrupt Warden Norton, who uses Andy's financial expertise to enrich himself, and James Whitmore as Brooks, imprisoned for fifty years and terrified when he is finally granted parole and who, unable to adjust to life on the outside, yearns only to be back in the only home he ever knew - prison. It's an interesting twist - experience also by Red later on in the movie - that freedom can seem to be like a prison for those so accustomed to the regimentation of life in an institution.While the movie is impressive and engrossing all the way through, though, there are some weaknesses to the story that bothered me a bit. (There are some spoilers ahead.)I found it difficult to imagine prison guards from all over the State of Maine bringing their tax returns to Andy. It just didn't seem to me like something that would have happened. It also struck me as unlikely that a letter-writing campaign from one solitary prisoner (even one that lasted six years, one letter a week) would have convinced the State to fund the improvements Andy got for the prison library. I would rather expect that after a while the letters would simply start to be discarded. Andy's escape also bothered me. It was too \"easy\" - even though it took twenty years. And how did he keep that suit so spotless and unwrinkled while crawling through that dirty sewer? Mind you, the moments leading up to the discovery of his escape were among the most dramatic in the movie. The very end of the story was also clearly telegraphed some time before.Frankly speaking, I think \"The Shawshank Redemption\" is a bit over-rated here at IMDb, being ranked the second best movie of all time, but this is still a very, very good movie, and an excellent portrayal (through Andy) of the survival of the human spirit in even the toughest times. Personally, I give it a 7/10.",
    "96": "I'm trying to save you money; this is the last film title that you should consider borrowing. Renting Shawshank will cost you five bucks... just plunk down the $25 and own the title. You'll wind up going back to this gem time and time again. This is one of few movies that are truly timeless. And it's entertaining and moving, no matter how many times you view it.Forget about what others (including myself) might suggest you'll discover in \"The Shawshank Redemption;\" when you watch it, you'll identify something very personal in your own life with a scene, a character, or a moment in this uncomplicated movie. When you need hope, you'll look for Shawshank. When you want to believe in the will of overcoming even the greatest obstacles, Shawshank will uplift you in ways that you can't find in movies today. Some liken the film to some kind of spiritual awakening. Of course, some can go to a church or mosque to find enlightenment and Faith in humanity, but most places of worship are open only certain days or times. But when you need affirmation of the lasting bond of friendships that prevail over the most dire circumstances, Shawshank will give it to you. It makes grown men (like me) cry, still. I wonder whether Shawshank was truly meant for viewing in the privacy of the home, because it is a personal experience that really makes you look inward. Nominated for seven, this is the best film that never one a single Oscar. How ironic that an innocent man winds up being surrounded by the corruption of the legal system. Shawshank itself is similar to the character of Andy Dufresne. Prejudging this classic film, critics couldn't get past the title. The public followed suit, initially dismissing Shawshank, which failed in the box office just like \"It's a Wonderful Life\" and \"Citizen Kane.\" It could have just whithered away on the store shelves, like Andy Dufresne could have in his own cell. But the characters prevailed, because Andy -- And Shawshank -- stayed true. Now, these movies are right up there as the most popular films of all time. Anyone who has yet to watch Shawshank may be so jaded of movies, or the film's title, or how a 2-1/2- hour movie set inside the walls of a prison can manage to tap the soul of such a wide range of people. Shawshank has not one explosion. I wonder if it even has a single special effect or digitally- enhanced frame. But every aspect of Shawshank fit together. The acting from the top to the bit part. The musical score. The editing. The photography. The story, from opening credits to final scene. All involved, including the town of Mansfield, Ohio (where Shawshank was actually filmed) played their roles perfectly. Shawshank is a must- see, must- own title.",
    "97": "This movie is not your ordinary Hollywood flick. It has a great and deep message. This movie has a foundation and just kept on being built on from their and that foundation is hope.Other than just the message of this movie the acting was phenomenal. Tim Robbins gave one of the greatest performances ever. He was inspiring, intelligent and most of all positive. His performance just made me smile. Robbins plays Andy Dufresne who was wrongfully convicted of murdering his wife and her lover. He is gets to life sentences but yet never gives up hope. In he becomes friends with Ellis Boyd \"Red\" Redding played by Morgan Freeman. Freeman who gives the finest performance of his career has unlike Robbins lost hope. He is in deep regret of the crime that he committed. His way of deflecting the pain away is by trying to not feel anything at all. With his friendship with Andy he learns that without our hopes and dreams we have nothing. Andy also becomes friends with the rest of Red's group. James Whitmore also gave a great performance as Brooks Halten who gets out of prison parole but in the words of Red he has been \"institutionalized\". The directing by Frank Darabont was just magnificent. He kept this movie at a great steady pace along with the writing and great cinematography. He portrayed prison life in such a horrifying way, but not in terms of the physical pain but the stress and pain that wares mentally on the inmates, some of which deserve a second chance. Whatever you do, don't listen to the people who say this movie is overrated because this is one of the most inspiring and greatest movies ever. It has everything you could possibly want.",
    "98": "Misery and Stand By Me were the best adaptations up until this one, now you can add Shawshank to that list.This is simply one of the best films ever made and I know I am not the first to say that and I certainly won't be the last. The standing on the IMDb is a true barometer of that. #3 as of this date and I'm sure it could be number 1. So I'll just skip all the normal praise of the film because we all know how great it is. But let me perhaps add that what I find so fascinating about Shawshank is that Stephen King wrote it.King is one of the best writers in the world. Books like IT and the Castle Rock series are some of the greatest stories ever told. But his best adaptations are always done by the best directors. The Shining was brilliantly interpreted by Kubrick and of course the aforementioned Misery and Stand By Me are both by Rob Reiner. Now Frank Darabont comes onto the scene and makes arguably the best King film ever. He seems to understand what King wants to say and he conveys that beautifully. What makes this film one of the best ever made is the message it conveys. It is one of eternal hope. Andy Dufresne, played by Tim Robbins, has been sent to prison for a crime he did not commit. But he never loses hope. He never gives up his quest to become a free man again. His years of tenacity, patience and wits keep him not only sane, but it gives his mind and a spirit a will to live. This film has a different feel to it. There has never been anything like it before and I don't know if there will again.I'm not going to say any more about this film, it has already been said, but just suffice to say that I am glad that Forrest Gump won best picture in 94. I would have been equally glad if Pulp Fiction or Shawshank would have won. It is that good of a movie and one that will be appreciated for years to come.",
    "99": "I've lost count of the number of times I have seen this movie, but it is more than 20. It has to be one of the best movies ever made. It made me take notice Morgan Freeman and Tim Robbins like I had never noticed any actors before.I have from a very young age been a huge fan of anything Stephen King writes and had already read the short story that this movie is based on years prior to seeing this movie.Not everything Stephen King has written that gets turned into a movie comes out well, but this is as close to perfection as it gets and has everything you could ever want in a movie.Something that is outstanding is the fact that it has no real action, no special effects and no gimmicks. 99% of the movie is just men in a prison uniforms talking. Yet it absolutely hooks you almost from the beginning and has you glued to the screen to the end.For me what really makes this film one of the best is the message of eternal hope it conveys throughout. The never ever give up hope attitude of the main character so well conveyed by Tim Robbins. The ending is just spine tingling every time I see it, no matter how many times I have seen it.Brilliant, brilliant movie and a must see for everyone.",
    "100": "Whenever I talk about this movie with my friends, I do not even refer to it by title, but rather as \"The Movie\".  When I say \"The Movie\", my friends know exactly what I'm talking about.  In fact the main reason that me and my friends don't refer to it by title is because this movie is so great, that we do not feel worthy enough to say it's name in vain! I still remember the first time I saw The Shawshank Redemption.  Some friends of mine and I went to see it at one of those \"Budget Theaters\" over the summer of 1995.  None of us really knew anything about the movie, but we had heard that it was pretty good.  So, not having any real expectations, we saw it.  When the final credits rolled and the lights came on in the theater, all of us just sat there with our jaws hanging down on the floor. I turned my head towards my friend Bob and said \"That was the greatest movie I have ever seen in my entire life!\" There's really no other way I can put it in words.  Every moment of this movie captivated me and inspired me to believe in the one true thing in life...... \"HOPE\".  This movie is sad, uplifting, inspiring, harsh, cold, funny (at the right times), jaw-dropping, and heart-warming all at the same time.  I get chills every time I watch this film and this film contains the greatest ending (which takes place over the last 30 minutes or so)in movie history!  How it all just \"comes together\" is so incredible and uplifting. I should also mention the music in this movie is nearly flawless as well, and the soundtrack is a \"must buy\" for any music fan. The only bad thing about this movie is the fact that I know I will never see a better movie, no matter how many I may see.  I've seen many movies over the past few years, many excellent films.  However, every time I walk out of the theater, I turn to my friend or family member that I saw it with and I say, \"That was a great movie, but it wasn't nearly as good as 'you know what'!\"  There have been many movies over the past few years that thought would really move me or that I might one day call my \"favorite of all time\", but they've all fallen far short of \"The Shawshank Redemption\". So, if you have yet to see this movie, please run to the video store immediately.  You're guaranteed to find it in the \"employee picks\" section. And if it isn't in that section, then you should tell the employees there that there is something seriously wrong with them.  If you have seen this movie, go see it again.  If you haven't bought your own copy yet, buy one. In fact buy two, and put one in a fire-proof safe, just in case of an emergency. :o) So, you want a 1-10 rating???  I give it a 13!!!!!!",
    "101": "Can Hollywood, usually creating things for entertainment purposes only, create art?  To create something of this nature, a director must approach it in a most meticulous manner, due to the delicacy of the process.  Such a daunting task requires an extremely capable artist with an undeniable managerial capacity and an acutely developed awareness of each element of art in their films, the most prominent; music, visuals, script, and acting. These elements, each equally important, must succeed independently, yet still form a harmonious union, because this mixture determines the fate of the artist's opus.  Though already well known amongst his colleagues for his notable skills at writing and directing, Frank Darabont emerges with his feature film directorial debut, The Shawshank Redemption.  Proving himself already a master of the craft, Darabont managed to create one of the most recognizable independent releases in the history of Hollywood.  The Shawshank Redemption defines a genre, defies the odds, compels the emotions, and brings an era of artistically influential films back to Hollywood.The story begins with the trial of a young banker, Andy Dufrense, victimized by circumstantial evidence, resulting in a conviction for the murder of his wife and her lover.  After a quick conviction, Andy finds himself serving a life sentence at Shawshank prison, with no hope of parole.  He exists in this prison only in appearance, keeping his mind free from the drab walls around him.  His ability to do this results in the gaining of respect from his fellow inmates, but most of all from Ellis Redding.  Ellis, commonly referred to as Red, finds gainful use of his entrepreneurial spirit within the drab walls of Shawshank by dealing in contraband and commodities rare to the confines of prison.  Andy's demeanor and undeniable sense of hope causes Red to take a deeper look at himself, and the world around him.  Andy proves to Red and the other inmates that in the conventional walls of Shawshank prison convention will find no home in his lifestyle.By creating the film's firm foundation, the meticulously chiseled screenplay paved the way for this film's success.  Frank Darabont outdoes himself with the phenomenal adaptation of Stephen King's equally noteworthy novella, Rita Hayworth and Shawshank Redemption.  In this novella, King demonstrates that he can break free from the genre he dominates and still create a marvelous piece of modern literature.  Though the film mirrors the novella in many ways, Darabont illustrates a focused objective of improving upon the areas where the novella came up short, resulting in one of the best book to film transitions ever.While maintaining some of the poetic and moving dialogue of the novella, Darabont also proves that a film's score can generate a great deal of emotional response from its audience, as dialogue does.  He employs the cunning Thomas Newman, son of the legendary Hollywood composer, Alfred Newman.  Darabont shows recognition for the film's needs by employing Newman, who makes the gentle piano chords whisper softly to the viewer, as if a part of the scripted dialogue.  Newman lends himself to individualism and tends to drive more towards the unique in the realm of score composition.  His effort in Shawshank did not go unnoticed, as his score received an Oscar nomination in 1995.  While unique and independent, Newman's score never once intrudes on your concentration or distracts from the film.With work from vast array of talented scene designers, costume designers, composers, cinematographers, and various other Hollywood artists, the cast of The Shawshank Redemption had a strong foundation to work with.  The marvelous cast of this film will dazzle you with some of the most convincing performances you will witness in a film.  While both Tim Robbins and Morgan Freeman shine as Andy and Red, respectively, the true spectacle of acting lies within the plethora of amazing supporting actors who easily disappear into their roles.  Most noticeable of these, the veteran film star James Whitmore, who portrays the elderly Brooks Hatlen.  Brooks, a man incarcerated for an unmentioned crime for so long that he finds himself attached to the Shawshank and the daily life he has lead.  Each of these actors show a true dedication to their art, and a focused purpose in their motivations, creating a convincing setting that never once caters to anything unbelievable.With all of the aesthetic touches and attention to cinematic detail, the most beautiful part of the film lies within its thematic material, such as its focus on the human desires for the most abstract concepts, like hope and freedom.  These themes, which concern things the human spirit undoubtedly yearns for, seem so intricately woven into the plot that it easily draws its audience in to its story.  Though full of hardened criminals, your heart will go out to these men as they display the most basic of human emotions, and deliver some of the most quotable lines in a film to date.  Like a great novel, this film manages to succeed at greater things than simply entertaining an audience.  Darabont tells his story most masterfully, illustrating principles and inspiring his audience to think.  He leaves us a poignant film with a powerful message of hope, and redemption, something we all seek.This film manages to redeem Hollywood in the eyes of people who feared it long lost in a dark sea of clichés and predictability.  Darabont shows us that artists still work in the Hollywood studios and production facilities. These artists show their capability to produce art; real art that inspires you to look at the deeper aspects of life and the world around you.  The Shawshank Redemption delivers much-needed breath of fresh air for anyone who realizes the capability of film.  It proves that masters of the craft still live on this earth, and still bless us with timeless masterpieces that we will never forget.",
    "102": "One of my favorite movies ever,The Shawshank Redemption is a modern day classic as it tells the story of two inmates who become friends and find solace over the years in which this movie takes place.Based on a Stephen King novel,this movie makes us feel different watching this film than most others as this is an incredibly realistic film.Tim Robbins stars as Andy Dufresne who is convicted of murder and Morgan Freeman as Ellis Boyd \"Red\" Redding who is a fellow inmate and close friend of Dufresne and Bob Gunton as Warden Samuel Norton who is the Warden of Shawshank State Prison and is a character who has mixed feelings and emotions towards everyone around him and a character who is sometimes easy to like and at other times easy to despise.This film is easily considered one of the greatest films of all time and I definitely agree with this fact.It was nominated for seven Academy Awards including (Best Picture, Best Actor  Morgan Freeman, Best Adapted Screenplay, Best Cinematography, Best Editing, Best Original Score, and Best Sound) but didn't win any due to tough competition from the film Forrest Gump.I personally think that Tim Robbins should have been nominated for the Best Actor award as he really gave the performance of his career.Bravo to this brilliant modern day classic!",
    "103": "Could a movie be any more perfect? This movie is just absolutely stunning in so many ways. Acting perfect, storyline perfect, soundtrack perfect, emotional drama perfect, everything about this movie is perfect.When this movie first came out it did not reach the expectations that many people expected it to. But as the years went one it was nominated for seven Academy Awards and as it was available for rent everywhere more people started appreciating it and it's popularity grew. Eventually after many years in the top 5 of IMDb's top 250 movies of all time list, it hit number 1 with over one million votes.The story is about a well educated vice president of a large bank being wrongly accused of murdering his wife and her lover and is sentenced to spend life at a large prison in new England called Shawshank prison. As the years go on in his new home he makes friends, enemys and a dramatic twist at the end which became one of the most legendary scenes in movie history.I love this movie. The acting is just so passionate and their performances increases the drama and horror of life in prison. The soundtrack is one of the main reason behind the emotional drama this movie. Many scenes in this movie almost left me in tears mainly because of the soundtrack in the background which increases the emotion. The cast of this movie include Academy Awards winners Morgan Freeman and Tim Robbins. And also William Sadler, Bob Gunton and many other who made this movie what it is.Overall it is defiantly the Greatest movie ever made with passionate acting, great storyline and plenty of emotional drama about how hope overcomes fear in a beautifully crafted film about the strength of the human spirit.",
    "104": "This touching and heart warming film is the most perfect celebration of the human spirit I have seen. Andy Dufresne, wrongly convicted of murdering his wife and her lover, finds the strength not only to change himself, but to bring hope to those around him in Shawshank Prison.  This inspiring story is interwoven with a soundtrack which invokes every emotion, from haunting and chilling, to stirring and beautiful. When you go to see a movie and it touches you with its poetry, music, and its atmosphere, and leaves you with a sense of victorious satisfaction, it is a triumph.  Field of Dreams was the first movie which invoked these emotions in me.  Shawshank Redemption is even more powerful for its simplicity.  It doesn't pretend to be clean, nor could it be called a family movie.  It is brutal and violent at times, horrifying and sickening at others. However the title says it all. Redemption is what this story is all about.  And it is not necessarily redemption for the actual crimes you might have committed, but it is redemption for the way you have lived your life.  What emerges can only be called a maginificent piece of art.  This is what movies were meant to be.",
    "105": "Superbly played film set in 1946 , a bright young New England banker is convicted of the slayings of his spouse and her lover and sentenced to life at a strict State Prison . Introspective and quite Andy (Tim Robbins) gradually befriends inmates and over the next 2 decades wins the trust of prisoners and wardens but in his heart he still yearns for freedom . There he forms a peculiar friendship with Red (Morgan Freeman), the prison fixer , he experiences the brutality of prison life with a sadistic head guard (Clancy Brown), and is also mistreated and raped ; however , he adapts himself and offers financial advice to the guards and the selfish governor (Bob Gunton) , all in a shot 19 years. As two imprisoned men bond over a number of years, finding peace and redemption through acts of common help , friendship and decency . But when the proof of Andy's innocence is ripped away by those who need his services ,we learn that all is not quite what it seems at this State Penitentary , provoking a few susprises in the last two reels .\nThis is a very good and serious prison movie with thrills , emotion , exciting scenes , colour-blind relationships , hardnut camaraderie , gang opression , and violent disavowal of any homosexual implications . Prison buffs will find a lot of incidents to relish and the great spiritual resolution takes some swallowing and unexpected surprises . Adapted from the novella ¨Rita Hayworth and Shawshank redemption¨ ; the twist here is the upright starring is exceptionally bright , as his ability with accountancy leads to his handling the finances of everyone , from the humblest guard to the prison boss . Wonderful spectacle in watching time-passer while changing the bombshell actresses of the history : Rita Hayworth , Marilyn Monroe , Raquel Welch . US prison films have been making solid fares for more than sixty years and apart from slowness of pace in the second half , this one is well up to prison standards . This Frank Darabont's theatrical debut turns out to be a throwback rendition to the kind of literate , thought-provoking prison drama Hollywood used to make , such as : I am a fugitive from a chain gang , Birdman of Alcatraz and Escape from Alcatraz .Tim Robbins plays magnificently Andy , an inmate finding solace and eventual redemption , Tim provides his usual talent for playing ambiguous roles , as his notable skills are put to good use. Along with Robbins' best screen acting there are various Oscar-worthy supporting characters with special mention for Morgan Freeman as the good fixer who brings his ordinary grace to what could have been a thankless role , the veteran James Withmore as the crow-keeping librarian , the sympathetic newcomer inmate Gil Bellows ,William Sadler , Mark Rolston and the ruthless guardian Clancy Brown and , of course , the egoistic and nasty governor excellently played by Bob Gunton .It contains a colorful and evocative cinematography by Roger Deakins . And an enjoyable and really feeling musical score by Thomas Newman . In his engrossing direction debut ,Darabont avoids boring by fleeing most prison movie cliches . It results to be a pleasure of discovering a first-time filmmaker with evident respect for the intelligence of his audience , giving sensitive scenes , and brave enough to let roles details accumulate without recourse the excessively maudlin and over-sentimentality. It is a true masterpiece , being marvelously acted and perfectly paced.",
    "106": "Like many of the reviewers, I hate prison movies with all the clichés and stereotypes of innocent prisoners, nasty guards, and evil wardens; and upon first viewing, many years ago, I especially disliked being forced by this film to feel sympathy and empathy with murderers, rapists and the like.Shawshank has somehow transcended the test of time; and I believe that it has endured, not because of the great performances (which don't seem to be acting at all, but real), not because of the simple, but multi-level, story line with its twists and turns, not because of its magnificent photography, not because of its score, and not because of any individual element that went into the making of this film. (Hence, the lack of academy awards.) However, when all those elements are combined, Shawshank becomes one of those masterpieces which is greater than the sum of its parts...and this film is so much greater that in the desperation of its characters, it invokes a multitude of good emotions in the viewer...that there is divine, poetic justice and hope in this hell of a world.Shawshank has become my favorite film of all time, but it took a while. \"When your're feeling down and out, watch Shawshank!\" Raising my vote from 8/10 to 10/10 (however subjective that vote may be.)",
    "107": "*******MINOR SPOILERS AHEAD**********The story begins with the court case of Andy dufresne for the alleged murder of his wife and her lover (the first few minutes at the start captivate you from the beginning)Andy is wrongly convicted and sent to Shawshank maximum security prison set with a double life sentence.Andy finds a new companion called Red(Morgan Freeman) the man who can get things for anyone in the prison for the right price. As a person that can get things or has been known to locate things from time to time for somebody Red doesn't find it particularly odd that andy asks him if he can get him Rita Hayworth in 1949.Of course he accepts.The line that defines this great piece of cinema is \"get busy living or get busy dying\".This movie is without a doubt one of my favourites and remember always- FEAR CAN HOLD YOU PRISONER HOPE CAN SET YOU FREE!",
    "108": "Out of the three genre-defining classics released in 1994, The Shawshank Redemption was the one that ended up bearing the maximum brunt. First commercially by failing to recover its budget for it debuted in theatres together with one of cinema's greatest watershed events; Pulp Fiction. And then at Academy Awards where it was nominated for seven Oscars yet failed to win any, thanks to the sweeping show by the critics' darling, Forrest Gump.But life ever since has been very kind to this film, and both critics & viewers have embraced its uplifting story of hope & friendship with remarkable amount of respect, love & kindness. Today, The Shawshank Redemption enjoys a position that's arguably even higher than the two classics which eclipsed it back in 1994 and while it was discarded at its time of release, it is now rightly & universally acknowledged as one of the greatest films of all time.The Shawshank Redemption tells the story of Andy Dufresne, a successful banker, who is wrongfully convicted of murdering his wife & her illicit lover and is ultimately sentenced to two consecutive life terms in prison where his coping with the brutal hardships of confined life slowly earns him the respect of his fellow inmates & prison staff, including that of \"Red\" in whom Andy finds a trusted ally. The remainder of the film explores their friendship over the next two decades.Written & directed by Frank Darabont, this prison drama is a simple but profoundly moving tale of hope, friendship & redemption that'll manage to connect deeply with most of us in one way or another plus it also marks Darabont's directional debut and he couldn't have asked for a better start. All this film has is men in either prison or police uniforms talking to one another over the course of its runtime and yet it never looked dull or felt like dragging at any given moment.Cinematography exquisitely captures the monotonous daily life inside prison and provides considerable depth & realism to the era this film is set in. Every moment of despair has a shadowy appearance while moments of hope gleam with light. Editing is spectacular too as the gradual progression of Andy's life, his friendship with Red, and his determination to not give in to the four walls containing him is effectively unfolded. And Thomas Newman's score beautifully blends with the film's tone & characters' lives, and is emotionally fulfilling.Coming to the performances, Tim Robbins delivers a swashbuckling performance as Andy Dufresne, the banker wrongfully convicted for the crime he didn't commit. And if Robbins is at his best, then Morgan Freeman is even better as Red, Andy's friend who is also serving a life sentence & is notorious amongst the inmates for he can smuggle goods into the prison. Freeman also narrates the story to us at which he does an even better job. His work is grounded & can go easily unnoticed, but the character of Red is the soul of this story.There is a reason why this film still connects with so many people & why many of them have latched on to it. There is a reason why even after two decades, its legacy keeps flourishing & viewers keep returning to it despite its low entertainment value. One major reason is that even though The Shawshank Redemption is a prison drama, its story of imprisonment goes far beyond the bricks & steel rods of a jailhouse. The entire picture is a reflection of our own imprisonment in the institutions of our daily lives; institutions like work, family, society etc & living up to the expectations of each one of them.On an overall scale, The Shawshank Redemption stresses that based on the outlook of life, there are only two types of people: one who can be free even in prison while others who find themselves imprisoned even in freedom. The message it is trying to resonate is clear: Fear can hold you prisoner, Hope can set you free. And if we all give ourselves some hope, there is nothing we can't survive. Yes, it all seems preachy n everything, but then if there's ever been a motion picture that has earned this sort of right, it's The Shawshank Redemption. Strongly recommended.",
    "109": "\"Every mind has billions of ideas and each one of us do things that no one expects us to do, some of those things are visible, some not but one of those things that make our life worth living is FREEDOM\"Tim Robbins stars as Andy Dufresne, a young man who faces a long, long time in prison after he is wrongfully found guilty of murdering his wife and her lover. While inside he learns an awful lot about what a man can hold onto and let himself be put through if there is still an ounce of hope in his soul. Bottles of cool drink on a hot rooftop, a slowly building library collection, the moment of musical joy that sees Dufresne severely punished for his overstepping of the mark and many other scenes spring to mind as classic moments in a movie almost chock full of classic moments. Andy quickly gets befriended by \"Red\" (Morgan Freeman), actually the narrator of the story, both soon prove that even in the worst circumstances, within the \"hell on earth\" they can maintain human dignity and strive on their own way to freedom... Morgan Freeman is the film's secret strength, playing \"the guy who can get it for you\" with a note of welcome ambiguity. Watching him in an early scene, when a fat, new convict (fresh fish) is being beaten by cruel head guard Captain Hadley (Clancy Brown), you don't know whether Red looks so crestfallen for the victim or for the packs of cigarettes he just lost betting the guy wouldn't break before Dufresne James Whitmore was equally memorable as a prisoner who was unable to adjust to the outside after his parole following a 50 year stint. This shows that people who have been incarcerated for such a long period, need some sort of readjustment training before they rejoin society. For Whitmore, freedom meant ultimate doom, making the scene one of my all-time favorite displaying the ultimate dark side and a certain fear in freedom. Tim Robbins, Morgan Freeman along with James Whitmore etched unforgettable performances as prisoners charged with crime. The film shows what prison life is all about. Subjects dealing with prison survival, brutality, corruption and ultimate redemption are well shown. An outstanding film dealing with prisons as seen by several prisoners. Many social problems are discussed here. The picture earned a well-deserved best picture Oscar nomination. It certainly should have tied with the winner, the equally good \"Forrest Gump.\"My Rating - 10/10",
    "110": "People look for all sorts of things in movies, and you can see it in the occasional negative review that pops up for this movie.  Some viewers are looking for gritty realism in everything on the screen.  Others are action junkies.  Still others perhaps take film too seriously and reduce moviemaking to nothing more than a game of who can come up with the edgiest shot, or the niftiest angle.  For all of these, there is the very real chance that they simply will not \"get\" this film, and that's too bad -- they are missing out on a classic.At its best, film can transcend merely being a series of pictures, no matter how pretty, and can reach down and touch people.  That is where Shawshank succeeds so brilliantly.  It is not the fastest moving movie, not the edgiest, not the grittiest, it is filmed in shades of gray.  But this movie absolutely sings with human spirit, and captures an universal human theme as well as any movie has ever done.  And THAT is filmmaking at its finest.  Not a game, not eye candy -- this movie stays with you long after the credits have rolled.",
    "111": "The story of this film takes place over a twenty-year period between 1947 and 1967. Andy Dufresne, a young banker from Portland, Maine, is wrongly convicted of murdering his wife and her lover, and sentenced to life imprisonment. (\"Shawshank\" is the name of the prison where he serves his sentence). The prison is a brutal place, and Andy is frequently beaten and sexually assaulted by a gang of homosexual inmates called \"The Sisters\". Two things, however, help him to survive. One is his friendship with another convict, Red, who has a reputation for being able to acquire almost any item and, for a price, to smuggle it into the prison. The other is his financial expertise, which he puts to good use, becoming a tax and financial adviser to the prison guards and even the Warden himself. As a reward for these services, Andy is given a privileged job in the prison library and protection from molestation. To avenge their attacks on Andy, the leader of the \"Sisters\" is so badly beaten by the guards that he is crippled for life; Andy is not molested again.The Warden devises a scheme under which inmates are put to work on local construction projects. The purpose of this is ostensibly to prepare them for life after they are released, but in reality he is exploiting their free labour for his own personal profit, and using Andy's financial skills to launder the proceeds. This arrangement seems to work to Andy's advantage, because of the extra privileges he is granted, but things change when a new young prisoner named Tommy Williams is sent to Shawshank. Tommy has evidence that could secure Andy's release; a former cellmate in another prison has confessed to him that he committed the murders for which Andy was convicted. Tommy confides this secret to the Warden who, fearing that his illegal schemes will be revealed should Andy ever be released, arranges to have Tommy murdered by a corrupt guard.There is a long history of American prison films, including the likes of \"I am a Fugitive from a Chain Gang\", \"Cool Hand Luke\", \"Brubaker\" and the more recent \"The Last Castle\". (Frank Darabont was later to direct another prison film, \"The Green Mile\", based, like \"The Shawshank Redemption\" on a Stephen King story). Most of these were made with a liberal social agenda in mind, aiming to expose the harsh prison conditions and thereby inspire their reform. \"The Shawshank Redemption\" falls, to some extent, within this tradition; it is made from a basically liberal viewpoint and vividly depicts the brutality of prison life, although the fact that it is a period piece, set several decades in the past, might suggest that social issues were not the filmmakers' sole concern. Perhaps more important are the analysis of the nature of freedom and of the relationship between Andy and Red.The word \"prison\", from the French \"pris\" (\"taken\"), merely indicates a place where captives are held, and the authorities, especially in America, prefer to describe many prisons by some more positive term such as \"penitentiary\" or \"reformatory\" which implies their purpose of rehabilitating criminals. Shawshank, a prison where the Warden and guards are at least as crooked as the inmates, has precisely the opposite effect. Andy goes in innocent of any crime and comes out guilty of being an accessory to corruption and fraud. Yet, despite his involvement in the Warden's dishonesty, Andy retains a certain integrity; he refuses to give up hope and refuses to allow himself to be beaten by the system. Although he is in prison he has found a sort of freedom. A key moment comes when he defies the guards to play a Mozart aria over the prison loudspeakers for all the inmates to hear- a reminder of spiritual values even in the harshest of environments.Red faces a different problem. He fears that he has become so institutionalised that he will be unable to survive freedom, as happened to another long-term prisoner who committed suicide shortly after his release. In prison, his role as the \"fixer\" who can obtain anything, be it a packet of cigarettes, a rock hammer or a poster of Rita Hayworth, makes him the king of the inmates. (These latter two items will play an important role in the plot). On the outside he will be just another ex-con trying to make ends meet in a dead-end job. Paradoxically, he is more free in jail than he will be on the outside. I won't give away the ending, but it involves Andy repaying Red's previous kindnesses by showing him how he can be free in all senses of the word.The film was not a great box office success when first released but has since acquired a status as one of the classics of the modern American cinema; it has now supplanted \"The Godfather\" as number one on IMDb's Top 250 list. The film would perhaps not be number one on my personal list, but it is a fine one and would certainly be in my top 250, perhaps the top 100. Its two stars, Tim Robbins as Andy and Morgan Freeman as Red, are both excellent. Its initial lack of success may have had something to do with its rather clumsy title. \"Shawshank\" is not a word that will mean anything to the average person (according to one story Darabont was once asked how his \"rickshaw\" film was going) and \"redemption\", except in technical legal contexts, normally has a religious connotation. This is not an explicitly religious film; indeed, in its portrayal of Warden Norton as a sanctimonious, Bible-bashing hypocrite, it can be seen as critical of religion. Nevertheless, the word \"redemption\" is perhaps appropriate in this context, after undergoing the hell of Shawshank Andy and Red manage to find a sort of secular redemption. It may be this message of hope that accounts for the film's continuing popularity. 9/10",
    "112": "Along with Q and Pulp Fiction, Frank Darabont (The Walking Dead original writer) and his debut film got screwed by the Hollywood Powerhouse that is Tom Hanks with this now can be considered an American Classic. The fact that this film barely and I emphasize barely made it's money back in US theaters (which is usually a signal for a film to turn into a DOA when released at home) and it made such a splash, that the film is exceeding what anyone thought a simple 18 years ago. This includes some of Hollywood's best critics including EW's Owen Gleiberman who originally gave the film a B- back in late '94. Yet over time, this story of redemption, like the rise of hope this film gives from beginning to end, grows on you to the point where at the very end, you have no choice but to clap (I clapped in my basement in front of my parents and I haven't looked the same since). Darabont found a formula that worked and it shows in his future films. He made Robbins human, made Morgan Freeman's voice as American as a Big Mac and made the late great Rita Hayworth relevant again. The only regret that one should have is the fact that if it was released two years later it would've swept away the Oscars (Sorry Ralph Fiennes, The English Patient won on a weak year.)",
    "113": "Over the years many IMDb users have wondered why \"The Shawshank Redemption\" was ranked so high, and many \"wished\" that in time it would sink to a lower, more appropriate slot. Many analyses missed the mark. Following is my take on the real reason it is ranked so high, and why it will never sink much, if any. And I hope it never does.This film deals with several \"hot\" buttons in us. A cheating spouse. A husband wrongly convicted and sent to prison. Corrupt law enforcement. A prison where inmates get maimed or killed. A smart inmate who plots a brilliant escape. The corrupt warden getting his just reward. Two friends being re-united with a good life ahead of them. Combined with a good script and good cinematography. What's not to like about this story?I have seen this movie a number of times. Each time I get something new out of it that I either didn't see before, or had not made a mental connection to. I recently (year 2014) upgraded my personal copy from DVD to Blu-Ray and both the picture and sound are better.This film continues to spark the occasional argument of whether it really should be rated on IMDb as the top film of all time. I don't know exactly where \"Shawshank Redemption\" should rank on the all-time list. That is akin to comparing home run hitters or golfers from different centuries. The games are quite different, as is true in cinema. I gave this film a \"10\", and on my list it is in one of the best movies of all time, along with a number of others. At the same time, I recognize that everyone else has their own opinion. I don't really see any value in trying to decide a rank order for all time. Each film should be appreciated for what it has to offer, no more, and no less.And this one offers a lot.",
    "114": "Deservedly ranked at the top of IMDb's all-time best 250 films ever.The casting is superb: Morgan Freeman is \"Red,\" a wise observer of people and an entrepreneur inmate who's made \"connections\" so he can get contraband to other inmates for a price; he's under a life sentence for murder. Tim Robbins is \"Andy,\" a smart banker and accounting whiz who was sentenced to 2 life terms for killing his wife and her lover (which he--like most other inmates, say they're not guilty of). And Bob Gunton is \"Warden Norton\" who, when we first meet him, is touting the virtues of Bible reading and strict discipline. While, fortunately, I've had no first hand experience, \"Shawshank\" certainly gives the feel of authenticity of prison life and its society.A long movie, most of it takes place inside a semi-corrupt state penitentiary in the late 1940s. \"Red,\" in talking his thoughts out loud to himself, becomes our narrator for many developments. As the story unfolds, increasingly we come to see Andy as a person with strong personal values which he upholds in the most difficult situations. And in Andy's work for Warden Norton, we also increasingly find the warden as morally his opposite: selfish and fundamentally lacking decent moral character--all show and appearance and with no integrity, substance.In Roger Ebert's first review (of his two) of this movie, he said: \"....the film is an allegory about holding onto a sense of personal worth, despite everything....the word redemption is in the title for a reason....\" Most viewers will agree.",
    "115": "This suspense filled, dramatic movie rides high on the plain of self discovery, self worth and self preservation; if an innocent man is locked up for two decades with criminals, nothing else will he learn than to be a criminal himself. There is no better movie that I can recommend you to see than this classic Jail Break that stared one of the best supporting actors you will love to have on your side if you are in the lead role of a movie, Morgan Freeman.Shawshank Redemption was adapted from a Stephen King novella named Rita Hayworth and Shawshank Redemption. Frank Darabont secured the right to make the film from King in 1987, and he worked intensively on the screenplay for a proper adaptation of the movie, Darabont's screenplay writing earned him an Academy Award nomination, in fact the movie had seven Academy Award nominations and won none.The film tells the story of Andy Dufresne (Tim Robbins) who is a banker who got convicted for murdering his wife and her lover; he got two consecutive life sentences at Shawshank State Penitentiary. At Shawshank Andy befriends a fellow inmate, Ellis Boyd \"Red\" Redding (Morgan Freeman) Red was a contraband smuggler.Andy also developed a nice rapport with the warden and the other guards helping them with their taxes and also helping the warden in his money laundering operation.The movie boast of amazing scenery not to add an impressive cinematography, the movie growth and inclusion and exit of characters will make you feel like you are reading a book, the movie has numerous cast, and it is broken into segments each introducing new casts and each building a parallel wall that guides us to the climatic end.It didn't do well in the box office at all barely making back its production cost, but due to critic's high rating and Academy Award nomination, Golden Globe award nomination and other notable nominations, the movie did well in rental and DVD sales, it is shown regularly on Cable TV, and it has a high following.Frank Darabont who is the director and screenplay writer also made more of King's books; He directed the 1999 Tom Hanks movie The Green Mile which was a box office success compared to this. The Green Mile is another of King's books that is about a prison, and Darabont also directed the 2007 movie The Mist which is also based on a Stephen King book.Here is a DVD every home should have.www.lagsreviews.com",
    "116": "I reviewed this film recently with a specific question in mind. At this writing, this film is ranked by IMDB viewers as the second best film ever made. The SECOND BEST EVER MADE!Why? This was my question.The acting is good. Robbins and Freeman are quality craftsmen in the Caine and Hackman tradition. But these are not truly great actors and in any case, they are only asked to play appealing persons, deliberately less-dimensional than real (as opposed to believably hyper-real which is much harder).The director is a first-timer, and it shows. There is simple framing and staging here. In fact, there seems to be a deliberate strategy to be as plain as possible. And that is the core of where I think people find the appeal of this film.The story is very tight in the sense of narrative flow. All the chunks are the same size, with no fancy rhythm. There is no distracting backstory. No element has irony, not writing, acting, shooting, even the score.Now for me, I expect and demand art in my films -- that's why I register this as plain. But I think it is well liked because it is totally without pretense. It is straight and honest; people seem hungry for honesty, and this has the appearance of what they need at just the right time.Is a film great because it merely fulfills? I hope many people think not, and dream that this film moves down the list to be replaced with more intelligent efforts.",
    "117": "I was a little surprised at first to see this film ranked #1 out of all possible candidates in the IMDB user ratings. When I thought about it, though, it made more sense--this is a \"Rocky\"-type feel-good movie that doesn't really make you think and reinforces what we would all like to believe about human nature. Don't get me wrong--it's a fine film (I gave it a solid 7 out of 10), it's just not, in my view, up there with _Casablanca_ and _The Graduate_.I guess the main problem I have with _Shawshank_ is the nature of the script and characters. Think about it: is there a single person in the film who isn't a one-dimensional cardboard cut-out with very simple motivations, or a Hollywood cliche or stereotype? We have (in no particular order), a corrupt, bigoted prison warden (who is a religious hypocrite for good measure), a brutal prison guard, a man who is wrongly accused of murder, an old convict who knows all the ropes and can't live on the outside, and a convict who is murdered by the brutal guards. Now where have we seen this stuff before? Only in a few dozen movies made from the 20s to the 90s. There's really nothing new here. Probably this comes from the fact that the story is from Stephen King, who doesn't really do well with complex characters (a problem I noted as far back as _Carrie_).If you want to see a good prison picture, try _Cool Hand Luke_ (from which this movie borrows considerably). If you want an escape picture, see either _The Great Escape_ or _Papillon_, both with Steve McQueen. Or if, by some chance, you want a crime and punishment movie that really makes you think, go with the late great Stanley Kubrick's _A Clockwork Orange_.I couldn't stop thinking about the warden: doesn't he have a family? How did they feel? What are they going to do now? I realize the story is inside the prison, but I wish the movie had made better use of its characters than simply as simple-minded symbols of EVIL or VIRTUE.I'm not Mr. Cranky, I did enjoy the movie, but I enjoyed it the same way I do an Italian dinner at the Olive Garden--a well-constructed genre product with nothing special to commend it.",
    "118": "In this review I'm not going to give a plot synopsis of this film because I'm sure everybody else who has commented on it has. However, I will express the positive effect it can have on the viewer if they let it.The acting is uncommonly magnificent. Morgan Freeman delivers the greatest performance of his brilliant career as the seasoned life-serving prisoner Ellis Boyd \"Red\" Redding, Tim Robbins holds his own against Freeman as Andy, the central character, James Whitmore's portrayal of the institutionalized Brooks provides the backbone of the story, Bob Gunton is wonderful as the corrupt Warden Norton, and Clancy Brown's commanding performance as Captain Hadley, the sadistic head prison guard, almost makes him steal the show from Freeman.Frank Darabont's restrained direction of the delicate story is critical for the film to not become sentimental or clichéd, and his beautiful adaptation of the Stephen King story on which the movie is based is a real breath of fresh air. On account of Darabont, the film shows that special effects are not needed to tell a great story in film. As a 17-year-old male, I love special effects movies as much as the next person, but they get boring after a while. Plus many people forget that there was a time in cinema when the blockbuster didn't exist, when they made movies that just told great stories and gave the audience a chance to be uplifted by those stories without the creators having to resort to special effects. I applaud you for having the guts to make a non-commercial film that reminds people of that in this day and age, Mr. Darabont.SPOILER ALERT! As with all truly great films, 'The Shawshank Redemption' is full of scenes that have become entrenched in the public's collective consciousness. There's the scene where Andy plays the opera record over the loudspeaker for all the inmates in the prison, Captain Hadley bashing \"Fat @$$\" to death for crying during his first night in prison (a very powerful scene), Red giving his \"Rehabilitated?\" speech to the board of parole officials, the Warden getting his final judgement, and of course, Andy crawling to freedom through what Red in his narration calls \"500 yards of s**t-smelling foulness I can't even imagine,\", the scene which for me is perhaps the greatest movie scene of the '90s.END OF SPOILERS! I thoroughly recommend this cinematic masterpiece, which has earned its place in my humble top ten films of all time list, to anybody. Whatever gender, age, religion, nationality etc. you are and whatever language you speak, I guarantee it will change your life, or perhaps even save it. Movies like 'The Shawshank Redemption' only come along once every decade, if that. Unforgettable.10/10.",
    "119": "It's times like these that almost tempt me to grab Jigsaw off the shelf. It's been almost a month since I saw a film that was flatout bad; the worst review I've given in weeks was a 6/10 to Flightplan. This film obviously didn't break my streak.I went into it knowing next to nothing, only that IMDb has it ranked as the second best movie of all time, that it was based on a story by Stephen King, and that it took place in a prison. Needless to say, it blew me away. I wont say a thing about the plot, just so that others who've yet to see this film have a chance at the same experience as me. I will say this though: It has some of the most subtle and unexpected twists you will ever see. One in particular stands out above the rest.Not much can be said about the actors that hasn't been said. Morgan Freeman gives one of the best performances of his career, and even though I've only seen 2 or 3 other Tim Robbins movies, I'm sure the same can be said for him.Though I don't agree with the multitudes of people that call this the best movie ever made, it was still a very good, very well made, very entertaining and almost heartbreaking film.9/10",
    "120": "Storyline is really good so it's a story from Stephen King's book, how can be bad? But that's not enough to be the top rated movie of all time.But people are confused about something. That thing is this movie is not the best movie of all time, it is the highest rated movie. That makes it doesn't matter your age or gender or what genre you like, you'll like this movie. Yes, it can be your favorite movie but objectively I won't trust your opinion on movies that much.The movie has really good acting and screenplay and these are the most important things in a movie. Also Costume Design and Set Decoration is really good. But this movie average quality of Cinematography, Scores and Sound Effects. Okey maybe that scores or cinematography is not bad but we are talking about the top rated movie of all time. The Green Mile is directed by same person, Frank Darabont. And that movie has amazing Screenplay, Film Editing, Acting Cinematography, Makeups, Costumes, Art Direction and Set Decoration. All of them are really good, just scores are average. But as I sad in this movie we don't have amazing Cinematography, Film Editing, Original Scores...",
    "121": "Three words: Oh. My. God.How am i supposed to describe this absolutely fantastic and unbelievable film in words? I don't know. But I'll give it a shot. Here goes.This movie is just bloody excellent, brilliant, fantastic, unbelievable, not a thing wrong with it, shocking (in a good way), heck, pretty much every single good comment word you can think of.I mean, for gods sake, its so damn good it takes your breath away! i seriously could not speak after it! it instantly took every other film i had seen under its shadow, and that's saying something, as i have seen some pretty excellent films.There's not a single actor or actress in this movie who is crap!!! standouts are Morgan freeman, Tim Robbins, and the dude who plays brooks.I could say 1239643609260246704272628xinfinity more things good about this movie, but unfortunately I haven't got that much space, and my fingers would get sore.An absolute must see for everyone, and I'm positive that ill never see another movie better than this, and this will stay at #1 on my list forever.",
    "122": "Andy Dufresne (Tim Robbins) is a banker convicted of murdering his wife and her lover. He always professes his innocence, but is thrown into Shawshank Prison with other lifers like Red (Morgan Freeman).Director Frank Darabont has made a prison fable out of a Stephen King short story. It is well acted by Tim Robbins and Morgan Freeman. Freeman is especially important as he is the narrator and the POV of the story. It's his lyrical voice that makes this fable compelling. It could have easily been a simple prison movie that rang hollow. Freeman gave the readings depth.If there is one complaint, it is Andy's claim of innocence. It needs to be shown early on during the trial. Instead, we derived mostly from Andy's demeanor. It needs to be a big declaration at the beginning. When Tommy (Gil Bellows) tells the story, he should include one detail from the trial like the 8 bullets. That way, the audience can get an aha moment. It's a minor point, and overall this is a good prison fable.",
    "123": "If you simply see this as a straightforward storytelling prison film, then it is excellent (10/10) because it truly gets you involved in its main character. It is an extremely enjoyable and compelling experience with a heartfelt and well-acted buddy-story at its core. It delicately--and sometimes brutally--juxtaposes Andy Dufresne's (Tim Robbins) good-natured character with the harshness of prison life, projecting so much heart in doing so.However delightful as it is, The Shawshank Redemption has no allegories and no statements to make and it brought nothing new to cinema in either style or substance. It had no revolutionary ideas or approaches - it's only a very safe buddy-story. A damn good one, but still just that. So it can impossibly be a film that will be remembered or studied, because what will it be remembered for? Friendship? Huh, neat. I therefore don't think it's entirely deserving of being considered the #2 greatest film of all time on IMDb.com.But moving on and looking past that, it is possibly one of my all-time favourite films for the feelings it leaves. Sure, it often jerks you for tears just a bit too purposely, but this is forgivable because emotion is crucial to a prison story. On top of that, it never falls prey to predictable sappiness - probably because of its content which is devoid of sentimental romance and instead fills you up with a tragic friendship. It is so well-sewn together by a feel-good narrative by Morgon Freeman that it is impossible not to enjoy this film.9/10",
    "124": "Superb movie. Based on a Stephen King short story, the story of Andy Dufresne (played by Tim Robbins), sent to prison for murdering his wife and her lover. In prison he is befriended by \"Red\" Redding (Morgan Freeman) who helps him survive the harsh prison life.A beautiful, moving story. Characters are steadily and solidly developed, and you feel an empathy for the main characters. Direction by Frank Darabont is subtle, and perfect. Pacing is spot- on.Tim Robbins and Morgan Freeman are excellent in the lead roles. Freeman got a Best Actor Oscar nomination for his efforts.Well deserving of all the praise heaped upon it. Just a pity it didn't garner any Oscars, losing out, in the most part, to a far inferior movie, Forrest Gump.",
    "125": "The Shawshank Redemption came out in 1994 and was an absolute flop but found its real audience in home video, peaking as the most rented video of 1995 in the USA. A wonderful film that takes you into the prison experience of Red(Morgan Freeman) and Andy (Tim Robbins). Andy being a banker convicted of murder and Red a murderer already serving time, this movie takes you to the limits of human endurance, where the human spirit eventually prevails. The TSR takes you on an emotional journey that you will remember for a long time, thanks to the superb crafting of the film and sincere performances by the cast. The score is deep and haunting, this film is for the ages and will permenantly have a place in my heart. To me it is the best film of the 90's and quite possibly one of the best of all time.The fact that this film is sitting at No.2 is a testament to just how many people love this film, many viewers seem to have an emotional bond with the film, and I don't blame them. I only wish that I could view the film for the first time again, and experience that redeeming feeling Andy and Red experienced at the end.Ignore the hype surrounding the film and judge it on your own experience, the last half hour are especially beautiful. Watch this if you already haven't, and enjoy the masterpiece that Frank Darabont has so gracefully given us the privilege of viewing. 10/10",
    "126": "I reviewed this film recently with a specific question in mind. At this writing, this film is ranked by IMDB viewers as the second best film ever made. The SECOND BEST EVER MADE!Why? This was my question.The acting is good. Robbins and Freeman are quality craftsmen in the Caine and Hackman tradition. But these are not truly great actors and in any case, they are only asked to play appealing persons, deliberately less-dimensional than real (as opposed to believably hyper-real which is much harder).The director is a first-timer, and it shows. There is simple framing and staging here. In fact, there seems to be a deliberate strategy to be as plain as possible. And that is the core of where I think people find the appeal of this film.The story is very tight in the sense of narrative flow. All the chunks are the same size, with no fancy rhythm. There is no distracting backstory. No element has irony, not writing, acting, shooting, even the score.Now for me, I expect and demand art in my films -- that's why I register this as plain. But I think it is well liked because it is totally without pretense. It is straight and honest; people seem hungry for honesty, and this has the appearance of what they need at just the right time.Is a film great because it merely fulfills? I hope many people think not, and dream that this film moves down the list to be replaced with more intelligent efforts.",
    "127": "I was a little surprised at first to see this film ranked #1 out of all possible candidates in the IMDB user ratings. When I thought about it, though, it made more sense--this is a \"Rocky\"-type feel-good movie that doesn't really make you think and reinforces what we would all like to believe about human nature. Don't get me wrong--it's a fine film (I gave it a solid 7 out of 10), it's just not, in my view, up there with _Casablanca_ and _The Graduate_.I guess the main problem I have with _Shawshank_ is the nature of the script and characters. Think about it: is there a single person in the film who isn't a one-dimensional cardboard cut-out with very simple motivations, or a Hollywood cliche or stereotype? We have (in no particular order), a corrupt, bigoted prison warden (who is a religious hypocrite for good measure), a brutal prison guard, a man who is wrongly accused of murder, an old convict who knows all the ropes and can't live on the outside, and a convict who is murdered by the brutal guards. Now where have we seen this stuff before? Only in a few dozen movies made from the 20s to the 90s. There's really nothing new here. Probably this comes from the fact that the story is from Stephen King, who doesn't really do well with complex characters (a problem I noted as far back as _Carrie_).If you want to see a good prison picture, try _Cool Hand Luke_ (from which this movie borrows considerably). If you want an escape picture, see either _The Great Escape_ or _Papillon_, both with Steve McQueen. Or if, by some chance, you want a crime and punishment movie that really makes you think, go with the late great Stanley Kubrick's _A Clockwork Orange_.I couldn't stop thinking about the warden: doesn't he have a family? How did they feel? What are they going to do now? I realize the story is inside the prison, but I wish the movie had made better use of its characters than simply as simple-minded symbols of EVIL or VIRTUE.I'm not Mr. Cranky, I did enjoy the movie, but I enjoyed it the same way I do an Italian dinner at the Olive Garden--a well-constructed genre product with nothing special to commend it.",
    "128": "In this review I'm not going to give a plot synopsis of this film because I'm sure everybody else who has commented on it has. However, I will express the positive effect it can have on the viewer if they let it.The acting is uncommonly magnificent. Morgan Freeman delivers the greatest performance of his brilliant career as the seasoned life-serving prisoner Ellis Boyd \"Red\" Redding, Tim Robbins holds his own against Freeman as Andy, the central character, James Whitmore's portrayal of the institutionalized Brooks provides the backbone of the story, Bob Gunton is wonderful as the corrupt Warden Norton, and Clancy Brown's commanding performance as Captain Hadley, the sadistic head prison guard, almost makes him steal the show from Freeman.Frank Darabont's restrained direction of the delicate story is critical for the film to not become sentimental or clichéd, and his beautiful adaptation of the Stephen King story on which the movie is based is a real breath of fresh air. On account of Darabont, the film shows that special effects are not needed to tell a great story in film. As a 17-year-old male, I love special effects movies as much as the next person, but they get boring after a while. Plus many people forget that there was a time in cinema when the blockbuster didn't exist, when they made movies that just told great stories and gave the audience a chance to be uplifted by those stories without the creators having to resort to special effects. I applaud you for having the guts to make a non-commercial film that reminds people of that in this day and age, Mr. Darabont.SPOILER ALERT! As with all truly great films, 'The Shawshank Redemption' is full of scenes that have become entrenched in the public's collective consciousness. There's the scene where Andy plays the opera record over the loudspeaker for all the inmates in the prison, Captain Hadley bashing \"Fat @$$\" to death for crying during his first night in prison (a very powerful scene), Red giving his \"Rehabilitated?\" speech to the board of parole officials, the Warden getting his final judgement, and of course, Andy crawling to freedom through what Red in his narration calls \"500 yards of s**t-smelling foulness I can't even imagine,\", the scene which for me is perhaps the greatest movie scene of the '90s.END OF SPOILERS! I thoroughly recommend this cinematic masterpiece, which has earned its place in my humble top ten films of all time list, to anybody. Whatever gender, age, religion, nationality etc. you are and whatever language you speak, I guarantee it will change your life, or perhaps even save it. Movies like 'The Shawshank Redemption' only come along once every decade, if that. Unforgettable.10/10.",
    "129": "It's times like these that almost tempt me to grab Jigsaw off the shelf. It's been almost a month since I saw a film that was flatout bad; the worst review I've given in weeks was a 6/10 to Flightplan. This film obviously didn't break my streak.I went into it knowing next to nothing, only that IMDb has it ranked as the second best movie of all time, that it was based on a story by Stephen King, and that it took place in a prison. Needless to say, it blew me away. I wont say a thing about the plot, just so that others who've yet to see this film have a chance at the same experience as me. I will say this though: It has some of the most subtle and unexpected twists you will ever see. One in particular stands out above the rest.Not much can be said about the actors that hasn't been said. Morgan Freeman gives one of the best performances of his career, and even though I've only seen 2 or 3 other Tim Robbins movies, I'm sure the same can be said for him.Though I don't agree with the multitudes of people that call this the best movie ever made, it was still a very good, very well made, very entertaining and almost heartbreaking film.9/10",
    "130": "Storyline is really good so it's a story from Stephen King's book, how can be bad? But that's not enough to be the top rated movie of all time.But people are confused about something. That thing is this movie is not the best movie of all time, it is the highest rated movie. That makes it doesn't matter your age or gender or what genre you like, you'll like this movie. Yes, it can be your favorite movie but objectively I won't trust your opinion on movies that much.The movie has really good acting and screenplay and these are the most important things in a movie. Also Costume Design and Set Decoration is really good. But this movie average quality of Cinematography, Scores and Sound Effects. Okey maybe that scores or cinematography is not bad but we are talking about the top rated movie of all time. The Green Mile is directed by same person, Frank Darabont. And that movie has amazing Screenplay, Film Editing, Acting Cinematography, Makeups, Costumes, Art Direction and Set Decoration. All of them are really good, just scores are average. But as I sad in this movie we don't have amazing Cinematography, Film Editing, Original Scores...",
    "131": "Three words: Oh. My. God.How am i supposed to describe this absolutely fantastic and unbelievable film in words? I don't know. But I'll give it a shot. Here goes.This movie is just bloody excellent, brilliant, fantastic, unbelievable, not a thing wrong with it, shocking (in a good way), heck, pretty much every single good comment word you can think of.I mean, for gods sake, its so damn good it takes your breath away! i seriously could not speak after it! it instantly took every other film i had seen under its shadow, and that's saying something, as i have seen some pretty excellent films.There's not a single actor or actress in this movie who is crap!!! standouts are Morgan freeman, Tim Robbins, and the dude who plays brooks.I could say 1239643609260246704272628xinfinity more things good about this movie, but unfortunately I haven't got that much space, and my fingers would get sore.An absolute must see for everyone, and I'm positive that ill never see another movie better than this, and this will stay at #1 on my list forever.",
    "132": "Andy Dufresne (Tim Robbins) is a banker convicted of murdering his wife and her lover. He always professes his innocence, but is thrown into Shawshank Prison with other lifers like Red (Morgan Freeman).Director Frank Darabont has made a prison fable out of a Stephen King short story. It is well acted by Tim Robbins and Morgan Freeman. Freeman is especially important as he is the narrator and the POV of the story. It's his lyrical voice that makes this fable compelling. It could have easily been a simple prison movie that rang hollow. Freeman gave the readings depth.If there is one complaint, it is Andy's claim of innocence. It needs to be shown early on during the trial. Instead, we derived mostly from Andy's demeanor. It needs to be a big declaration at the beginning. When Tommy (Gil Bellows) tells the story, he should include one detail from the trial like the 8 bullets. That way, the audience can get an aha moment. It's a minor point, and overall this is a good prison fable.",
    "133": "If you simply see this as a straightforward storytelling prison film, then it is excellent (10/10) because it truly gets you involved in its main character. It is an extremely enjoyable and compelling experience with a heartfelt and well-acted buddy-story at its core. It delicately--and sometimes brutally--juxtaposes Andy Dufresne's (Tim Robbins) good-natured character with the harshness of prison life, projecting so much heart in doing so.However delightful as it is, The Shawshank Redemption has no allegories and no statements to make and it brought nothing new to cinema in either style or substance. It had no revolutionary ideas or approaches - it's only a very safe buddy-story. A damn good one, but still just that. So it can impossibly be a film that will be remembered or studied, because what will it be remembered for? Friendship? Huh, neat. I therefore don't think it's entirely deserving of being considered the #2 greatest film of all time on IMDb.com.But moving on and looking past that, it is possibly one of my all-time favourite films for the feelings it leaves. Sure, it often jerks you for tears just a bit too purposely, but this is forgivable because emotion is crucial to a prison story. On top of that, it never falls prey to predictable sappiness - probably because of its content which is devoid of sentimental romance and instead fills you up with a tragic friendship. It is so well-sewn together by a feel-good narrative by Morgon Freeman that it is impossible not to enjoy this film.9/10",
    "134": "Superb movie. Based on a Stephen King short story, the story of Andy Dufresne (played by Tim Robbins), sent to prison for murdering his wife and her lover. In prison he is befriended by \"Red\" Redding (Morgan Freeman) who helps him survive the harsh prison life.A beautiful, moving story. Characters are steadily and solidly developed, and you feel an empathy for the main characters. Direction by Frank Darabont is subtle, and perfect. Pacing is spot- on.Tim Robbins and Morgan Freeman are excellent in the lead roles. Freeman got a Best Actor Oscar nomination for his efforts.Well deserving of all the praise heaped upon it. Just a pity it didn't garner any Oscars, losing out, in the most part, to a far inferior movie, Forrest Gump.",
    "135": "The Shawshank Redemption came out in 1994 and was an absolute flop but found its real audience in home video, peaking as the most rented video of 1995 in the USA. A wonderful film that takes you into the prison experience of Red(Morgan Freeman) and Andy (Tim Robbins). Andy being a banker convicted of murder and Red a murderer already serving time, this movie takes you to the limits of human endurance, where the human spirit eventually prevails. The TSR takes you on an emotional journey that you will remember for a long time, thanks to the superb crafting of the film and sincere performances by the cast. The score is deep and haunting, this film is for the ages and will permenantly have a place in my heart. To me it is the best film of the 90's and quite possibly one of the best of all time.The fact that this film is sitting at No.2 is a testament to just how many people love this film, many viewers seem to have an emotional bond with the film, and I don't blame them. I only wish that I could view the film for the first time again, and experience that redeeming feeling Andy and Red experienced at the end.Ignore the hype surrounding the film and judge it on your own experience, the last half hour are especially beautiful. Watch this if you already haven't, and enjoy the masterpiece that Frank Darabont has so gracefully given us the privilege of viewing. 10/10",
    "136": "What can I say about this movie that hasn't already been said? It's a prison movie, yes, but it is so much more than that. First, let me divvy out kudos to those who deserve it: Stephen King for writing this magnum opus, Frank Darabont for his stellar directing, Tim Robbins for the job he did and, of course, Morgan Freeman for knocking the ball out of the park one this movie.This was a movie that could be loved and felt by men and women alike. It was about losses and gains, hope and despondence, injustice and rectitude, and definitely about friendship. Prison just happened to be the backdrop of this film but it could have easily been anyplace. The prison setting played a critical role and was interwoven into the overall story but it wasn't the story. The story was so much more and the movie did so well in pulling you in and making you care. You couldn't help but loathe the warden and his right-hand-man. You couldn't help but like Andy and Red. You couldn't help but want the happy ending.Absolutely, Shawshank Redemption is a masterpiece. It didn't get the awards it deserved, but like the Utah Jazz in the late 90's playing the Bulls, Shawshank Redemption faced tough competition. Although, it is getting its recognition here and it deserves the high praise.",
    "137": "The redeeming feature of this film is that it was made in innocence. Darabont had no idea he was making anything profound.  And he wasn't.  This is a film about a prisoner who ... well, I can't give away the plot, for it's much better to come to the screen in ignorance; but anyone who thinks that this is a story about how Andy `finds out the truth about himself', or is in any way `redeemed', is grasping at straws.  These elements play so little role in the overall structure that we might as well ignore them.I have a theory: so many people have told Darabont that `The Shawshank Redemption' was a profound life-changing experience that he believed them, and then SET OUT to make another `profound, life changing experience' with `The Green Mile', with predictably ghastly results.  I haven't seen `The Green Mile' yet, so I can't be sure.Don't get me wrong.  A great movie needn't be profound, and the film which I think is the best ever made isn't profound, either - it contains no comment at all on the Nature of Human Existence or anything of that kind.  Still, `The Shawshank Redemption' isn't even great.  It's a very good story very well told.  Lucky we get such nice photography, rather than having to put up with Stephen King's prose every step of the way ...  Also, Tim Robbins has the lead role.  (Lucky, again, that it wasn't Tom Hanks - now THERE'S a frightening thought.)  Nobody can do the bewildered but intelligent innocent so well as he can.  Fans make such extravagant claims about this movie, but I don't think it makes such extravagant claims about itself, which is why it works so well.",
    "138": "Out of the fertile mind of American author Steven King, comes the incredible prison story called \"The Shawshank Redemption.\" It is the story of a young banker named Andy Dufresne (Tim Robbins) who has been falsely convicted of murdering his wife and her lover. Sent to the notorious Shawshank, Dufresne, is subjected to the standard abuses every prisoner faces. During the ensuing years however, he is further subjected to additional punishment by the \"Sisters\" who enjoy torturing what they call 'fresh fish.' Still Andy tries to survive each day of his sentence as best he can. Being extremely agile at his banking craft, he overhears Captain Byron T. Hadley (Clancy Brown) complain of his personal financial problems. This single incident allows Andy to take advantage of his dire situation and become useful once again. Over the years, he becomes friends with fellow convict Ellis \"Red\" Redding who is adroitly played by veteran actor, Morgan Freeman. When warden Samuel Norton (Bob Gunton) learns of Dufresnes' financial ability, he immediately takes advantage of it. This arrangement presents many financial opportunities for the brutal warden and the meticulous and patience prisoner. Both can benefit from the outcome. The warden intends to retire richer and Hope is the only benefit Andy ascribes to. Be he has he has more talent than the warden suspects. With additional characters actors like William Sadler as Heywood, Gil Bellows as Tommy, Mark Rolston as Bogs and legendary James Whitmore who lends a superior performance as Brooks Hatlen, this film is destined as a classic for the enjoyment of every audience. ****",
    "139": "As I said in the summary, there are too many reviews for this movie and it's among the best movies of all time. So, why I wanted to review it? Because this movie touched me so deeply and I found it so great and powerful that I have to say my opinion at all costs. This is out of my system, now I can go to the review.THE SHAWSHANK REDEMPTION is a masterpiece and only a idiot wouldn't watch it (or hate it). Everything in this movie is perfect: the dialogue is clever and well written, with many great lines (included also in the narration by Morgan Freeman), the cinematography is great, the soundtrack is among the best that were ever heard in 1990s movies, and the performances are very strong and heartfelt. Tim Robbins and Morgan Freeman give their best performances in their careers. Robbins is hard to empathize with at the beginning, but more the movie goes on more you come to like him. Freeman also narrates the movie, and here is suave, easy to empathize with and likeable (as in all his other movies). And also the supporting players in the movie are good, including James Whitmore in one of his final roles as Brooks Hatlen.My favourite scene apart the tear-jerking ending? The scene of the inmates listening to the Mozart aria through the speakers. So, you don't have to like prison dramas for liking this movie. Yes it's depressing and sad in points - but is also perfectly and cleverly written and acted, and deserves all the praises that received. A movie that has to be seen at least once, and if you don't love it I suggest you to go to a psychiatrist!",
    "140": "It was the film that never seemed to have a break cut out for it. Adapted from a Steven King short story (usually a sure sign of success), yet a disappointment at the box office. Nominated for seven Oscars, yet emerging with no wins. But, hope sprung eternal, and, as life began to imitate art, like its central characters, the film The Shawshank Redemption overcame such initial adversity to become one of the most revered and cherished films of all time. Director/screenwriter Frank Darabont, working from Steven King's short story 'Rita Hayworth and the Shawshank Redemption' brings the tale to life in a superbly powerful and emotionally flooring fashion. Darabont's script executes the incredibly difficult task of speaking directly to the human spirit, with its tale of passion and dedication overcoming captivity and adversity. Few modern films are bold enough to tackle such shamelessly inspirational themes as Shawshank's without coming across as painfully clichéd, but Darabont's airtight script, chock full of timeless lines, and steady, careful directing are enough to raise the film above such concerns, instead marking a film of which the emotional magnitude is seldom paralleled. From Roger Deakins' sweeping, operatic cinematography, to Thomas Newman's truly beautiful and inspiring musical score, to the dank, gritty realism of Shawshank prison itself, the film's consistent quality on all fronts is truly stunning. It is easy to see a story such as this easily falling flat with an inferior cast taking on the material, but Darabont's incredibly gifted and memorable cast is truly up to the challenge, taking a wonderful story and making it truly timeless. Tim Robbins truly brings unconventional convict Andy Dufresne to life, never without a passionate twinkle in his eye, even in his most beaten down and hopeless of scenes. Rather than typical leading man grandstanding, Robbins is wise enough to remain subtle and detached throughout, making the role all the more mysterious and endearing as a result. The inspired casting of Morgan Freeman as fellow inmate 'Red' resulted not only in a series of sumptuous voiceovers by one of the most melodious voices in Hollywood, but also in a genuinely heartwarming supporting character, with Freeman building a career of playing similar 'wise mentor figures' off his performance. The supporting cast being comprised mainly of relative unknowns strengthens the believability of their characters, leading the audience to see them as their character and not as the star behind the role. Bob Gunton is chillingly effective as the hate-inspiring prison warden, infusing more menace into his reedy voice and deadpan stare than any scenery chewing antagonist could capture. Character actor Clancy Brown also crafts another simple but effective antagonistic role as the captain of the guards. Gil Bellows is a strong presence as a rebellious inmate, and James Whitmore is charming and lovable as aged prison librarian Brooks. Overall, The Shawshank Redemption is an astonishing accomplishment, addressing shamelessly uplifting themes in a fashion which is sentimental, but never sappy, larger than life, but never melodramatic. In many ways the film feels like a throwback to the days of classic cinema where directors strove to make films which made their audiences happy, but Darabont easily dodges contemporary scorn by unabashedly and honestly pitching the film towards the human spirit, and firmly establishing it as a timeless classic with its impeccable package of flooring technical work, screen writing and acting. Far from being a simple \"prison drama\", the sheer emotional voyage of The Shawshank Redemption is enough to drain any viewer, both crushing their spirits then euphorically raising them in a truly peerless fashion. While Red may declare hope to be a dangerous thing, it's Darabont's fearless tackling of the tricky subject which really sets Shawshank free. -10/10",
    "141": "I will never forget the first time I watched \"The Shawshank Redemption\", with my father. Both of us were fans of prison and male-bonding movies, and choose the film only expecting to watch a solid drama. Needless to say that, when the last line was delivered and the TV screen painted the walls with a beautiful blue, the feeling that we had just watched something exceptional instantly cut through our hearts, and before the second viewing, we would regularly mention how great that film \"with the poster\" was.Then I would never miss it whenever I found it on TV, and after each viewing, it unveiled one unsuspected element of its unique appeal. I guess if it doesn't justify, at least it explains why this movie that didn't do well in the theaters, had a better success on VHS, TV and DVD before it would ultimately dethrone \"The Godfather\" from the first place on IMDb Top 250. And it's only justice if \"The Shawshank Redemption\", the least spectacular of the four Best Picture nominees in the glorious 1994, made by a relatively unknown director, a movie with an appeasing and appealing patience, took its time to grow on people and did it pretty well, as if it applied its own philosophy, patiently but determinedly. This is the strength of \"The Shawshank Redemption\", its ability to tell a story that spans a long period of time without trying to get to the so-called essential, the simplest things take their full meanings, the smallest details have their share of importance. And think about it, in a prison where everyone wears the same outfits, where the days are regulated by the same routine, all you can do is to make a life out of this routine, make a place, to get closer to your own definition of 'having a life'. And as we penetrate the impressive walls of Shawshank, from the first vertiginous panoramic shot, we're literally submerged by the solemn austerity of the location, conveying a very hostile feel. These characteristics are perfectly incarnated by the figure of the Warden Samuel Norton, who's like the male alter-ego of Nurse Ratched from \"One Flew Over the Cuckoo's Nest\". And the comparison with Forman's film isn't fortuitous as Shawshank intends to domesticate its occupants to the same limits of mechanical alienation, to the point that the only thing left to the inmates is to control their only valuable treasure: time, by getting busy, finding their own reason-to-be, like the veteran Brooks (James Whitmore) was the man with the books, Red, remarkably played by Morgan Freeman, was the man who could get you things.In a very intelligent move from the script, the hero of the film, the laconic Andy Dufresne, an upper-class banker, played in all nuance by Tim Robbins, is condemned to a life sentence at Shawshank, for the murder of his wife and her lover. And nothing indicates if he is innocent or guilty and I wondered if any certitude would have conditioned my appreciation of the character. I think it was necessary for us to have a reasonable doubt about his innocence in order to let his character progressively grow on us until we believe by ourselves that he was indeed the victim of unfortunate circumstances, the same feeling that grew in the heart of Red before becoming his best friend. Morgan Freeman is the pillar of the film while Tim Robbins is its free spirit, both allow us in a remarkable complementarity to dream of abstract notions like hope and freedom while being practical and 'busy' in the same time. And again, their friendship is a slow process that takes its time to progress and reaches a pivotal point when Andy was allowed to put his banker's casket again and feels that prison didn't deprive him from his 'social quality'. Shawshank is not slow but more a patience-demanding film with a sense of decency in the way it trusts our intelligence. And the film's motto, on which relies its philosophical core is \"Get busy living or get busy dying\". Now, two things occur to me while writing these lines, a heart-breaking sequence about the inmate Brooks who was freed after 50 years of detention, and who realized he was institutionalized. A notion explained by Red: when the infamous wall that scared you so much becomes your personal guiding light while outside, it's all dark and your time is deconstructed. Brooks couldn't live outside Shawshank so there was no other way he could live. The second thing is the sad passing of Steve Jobs today. And as I was reading his famous Stanford speech, I couldn't help but make a connection with the beautiful message of Darabont's film, an invitation to dream, to escape from any sort of walls or obstacles put in your life and heart with as many dreams as you can fulfill, a notion illustrated by the beautiful scene when Andy put some classical music on the microphone, so the prisoners could for once elevate themselves and having an ephemeral moment of pure freedom, this is the triumph of human spirit, this understanding of the value of life is \"The Shawshank Redemption\"In the same vein than \"One Flew Over the Cuckoo's Nest\", \"Shawshank\" is a constant encouragement to fight the system and use time for the best, for whatever constitutes our dreams, being men again, able to enjoy, to feel, to give a meaning to our lives. In other words, hope, hope that things can get better despite the adversity. To quote Steve Jobs : \"Courage is the discovery that you may not win, and trying when you know you can lose.\" This is the true intelligence of life, what makes it worth living.\"The Shawshank Redemption\" a powerful adaptation of Stephen King's novel is one of the greatest American films: a powerful story of courage, perseverance, hope and ultimately, friendship and humanity.",
    "142": "Despair or determination; crying or fighting; obedience or inner freedom; resignation or patience; fear or hope...difficult choices in life make us all more powerful human beings. Experience makes us richer; hardship makes us stronger, friendship makes us better. Although we may be deprived of everything, only our own choices may truly deprive us of human dignity... These words ring the bell for the majority of people; yet, seldom do they appear so unique, so real and so concrete as in this wonderful film...Based on the novella by Stephen King RITA HAYWORTH AND SHAWSHANK REDEMPTION, the story appears to be unlike any other movie, unlike any other adaptation of Stephen King's stories onto screen, unlike most productions of the world cinema. Why? I think that every viewer has to answer this question oneself. What I am going to do in this review is not look at why it is so powerful, why it is so unique but rather focus on a certain aspect that, in a way, refers to this question. What absorbed me to the very core of my emotions and feelings is the main plot of Andy (Tim Robbins), the banker wrongfully convicted of murdering his wife and her lover and sentenced to Shawshank prison where brutality and wretchedness really reign. At the spot where for many people, life actually ends, for Andy a new tedious struggle begins. Quickly befriended by \"Red\" (Morgan Freeman), actually the narrator of the story, both soon prove that even in the worst circumstances, within the \"hell on earth\" they can maintain human dignity and strive on their own way to freedom...Here, let me refer to Roger Ebert's words who nicely described the character of Andy: he says that \"Andy turns out to be a surprise to everyone in Shawshank, because within him is such a powerful reservoir of determination and strength that nothing seems to break him.\" Indeed, salvation lies within discipline for him...self-discipline...Except for some other plots, including the touching yet tragic story of Tommy Williams (Gil Bellows) and of the sympathetic librarian Brooks Hatlen (James Whitmore), it is Andy and Red who supply us with the most unforgettable moments in the movie. It is, as a matter of fact, the story of their friendship, their dreams expressed at the wall of despair. They maintain hope around themselves and within the viewers. Here, a very powerful aspect of Red is his narration...our thoughts are directed towards his thoughts, towards his reflections and his perception of the events, his - the prisoner's. Swear words take on power to convey meanings and harshness becomes reality. Here, it is important to mention the inevitable brutality in the film. Thanks to the fact it is perceived by Red, it never appears to be unendurable or harmful for the emotions of the viewer. We, as observers, truly know what world we are led to...yet, there is no loss of hope!The unforgettable scenes seem to evoke the most powerful associations and expectations that lie within us concerning the visual and sensual experience. With Thomas Newman's terrific music score consisting of dark piano music, we are supplied with intense emotions and effective thrill. Except for the symbolic and almost cult scene when Andy escapes the prison (mind you the almost claustrophobic effect), one cannot skip \"The Letter Duet\" scene when the excerpt of Mozart's \"The Marriage of Figaro\" is being played. The prison life stops for a while being awestruck by the glimpse of harmony, by the blissful moment of magnificence. At this moment, I was breathless and really second the powerful line: \"Music makes you free!\" The performances are awesome and the depiction of characters is executed in an extraordinary way. There are no clichés which is a great merit of the film and where many films of the genre fall into that trap. Although there were many actors who had been cast for the role of Red, I think that no one would have done the job as well as Morgan Freeman. He is perfect in the role combining a certain quality of patience and distance with the emotional struggle for personal rights. Ironically, he portrays a re-socialized character...in fact, richer inside than any \"corrupted decency.\" Tim Robbins also does a terrific job as Andy with all his features mentioned before. And Bob Gunton as a true villain, the boss of this hell of Shawshank will long remain in memory.To sum it up, I agree with short but meaningful words said by Roger Ebert: \"THE SHAWSHANK REDEMPTION is a movie about time, patience and harmony...\" I would even add that it is the film about true life where people are really themselves, to the most extent themselves. There, within the harshest reality... Because only there, we truly behave according to our rules. There, we make choices even if everything that surrounds us seems to yell: \"Salvation lies within blind discipline and fundamental Bible!\" A redemptive masterpiece, a masterful redemption...desperate Brooks was here...and so was Red...yet, he brought a new dawn for dreams, a new dawn for friendship... Will he succeed?",
    "143": "THE SHAWSHANK REDEMPTION is a kind of morality tale that is definitely one of Stephen King's more restrained kind of stories, dealing mostly with a character study of two individuals sharing imprisonment and the consequences that await them when the tale ends.TIM ROBBINS is a man wrongly convicted of murder and serving a long prison term while MORGAN FREEMAN (who plays the narrator with great dignity) describes himself as \"the only guilty man in Shawshank.\" The hardships of prison life are captured in brief scenes that make the viewer wish that Robbins will find a way of escape. Along the way, he is gang raped by prisoners and treated harshly by a brutal warden and some of his spirit seems to vanish. But Robbins is quietly effective as a prisoner who makes a good adjustment when he takes charge of the prison library and sees to it that there's a wider selection of books than the kind of potboilers that King is noted for writing. A touch of irony here, no? The closing scenes are a bit of a stretch and a reminder of just who wrote this prison tale--but still, they make an impact because of all that happens before.It's a bittersweet story, a sort of horrific fairy-tale of what might have happened, but the viewer will be caught up in the story because of the tremendously skillful story-telling magic of Stephen King and director Frank Darabont who also wrote the screenplay.",
    "144": "\"Hope is a good thing, maybe the best thing.\"said Andy.I've been told a couple of times this movie is a must-watch before I die. A movie with almost all actors, and in a prison, is a bit masculine to me. Yet I occasionally read it on Wikipedia and also saw that in Netflix by chance, I gave it a go.On the ground of some personal experience I could feel how Andy feels. This movie is about persisting faith of oneself and of life, even for those serving lifetime sentence.\"Get busy livin' or get busy dyin'\" is the best quote. If you are in search of a powerhouse movie, this would be the choice.I am from Hong Kong, I would also recommend \"The Greed of a Man\" (a Hong Kong drama) and \"Itaewon Class\"( a South Korea drama). The male lead achieved their lifetime goal spending long enough time like Andy. We all know they are fictions, but so what? Just learn the message.",
    "145": "Almost as interesting as this tale of men behind bars is the enduring popularity it has enjoyed since being released on video following its poor box office. The reason is fairly clear to see: for all its dark setting, the film is about hope and how hope can set you free. We all have hope, and we all feel imprisoned – whether it's by a dead-end job, a loveless relationship, an out-of-shape body – and it's only the hope that things will somehow improve (even if, unlike Andy Dufresne, we do precious little to help things along) that keeps us going. The Shawshank Redemption validates this blind, irrational hope while simultaneously reinforcing it. This is the film's strength, and it uses it to good advantage. Tim Robbins and Morgan Freeman make believable if unlikely friends – at the beginning of their friendship one lacks hope of any kind while the other is unable to express his feelings, a flaw he later realises is indirectly the reason he finds himself behind bars. By the end of the film both have changed – and both are released.The film makes use of every genre cliché you can think of: the sadistic guard, the corrupt warden – fifty years ago, Hollywood wardens were mostly beneficial characters, but they seem to have lost their way lately – the bull queers, the fish out of water with no chance of survival, etc, and although this isn't necessarily a weakness, it's familiarity means the overlong running time drags on occasion as we're faced with all too familiar situations. And while there are malevolent prisoners present in the form of the bull queers who wander around looking for 'fresh fish' and vulnerable inmates to rape, all other prisoners are a kind of homogeneous mass, a decent enough bunch with few unique characteristics and no malice or resentment towards a society that has effectively discarded them.The irony of the film is that the good guys are the ones behind bars – as Dufresne wryly comments, he had to come to prison to become a criminal – while those ostensibly representing justice and law are violent braggarts and bible-bashing hypocrites. Their come-uppance, when it finally arrives, is wholly deserved, and there are few films that engineer a turning of the tables as wholly complete as the one engineered here by Dufresne – another reason for its phenomenal popularity: we all know, or have known, someone like the warden (although perhaps not as extreme), smug and self-serving, who deserves their come-uppance.Darabont wanted the film to end with Red giving his little 'I hope' bit while the bus he's travelling on disappears over the horizon, and it's a shame the studio didn't let him have his way. That ending on the beach looks exactly like what it is – a tacked on ending to keep the men in suits happy. Andy Dufresne, with his uncompromising sense of purpose, would surely have held firm under their pressure",
    "146": "Frank Darabont directed this superb adaptation of the Stephen King novella that stars Tim Robbins as Andy Dufresne, a young banker who was wrongfully convicted for the murders of his wife and her boyfriend. Upon arrival at Shawshank prison in Maine, he keeps to himself mostly, causing no trouble, though does befriend long-time inmate \"Red' Redding(played by Morgan Freeman) who teaches him the ropes of prison life, though the unwanted attentions of degenerate inmates pushes poor Andy to the edge of despair, until his financial skills as a banker prove most useful to both the corrupt Captain of the guards(played by Clancy Brown) and corrupt warden(played by Bob Gunton) until Andy hits upon a most clever escape plan... Now legendary film that sits atop the IMDb best film list is indeed a worthy film(though not my pick!) Still, done with remarkable skill on every filmmaking level. Could be viewed as an allegory of Christianity, but is indeed an uplifting story of friendship and the human spirit. Supporting characters(except for the one played by James Whitmore) aren't that appealing, but aren't intended to be either! Perfect ending as well.",
    "147": "Based on ratings by users, I can see why this film is rated number 1 on IMDb.A film about Andy Dufresne (Tim Robbins), who claims he was falsely imprisoned. He decides to adjust to life while incarcerated, and befriends a number of his fellow inmates, including Ellis Boyd Redding (Morgan Freeman). Andy establishes respect among his cohorts and even the prison guards by doing a number of things in improving life in the prison, including expanding a library and helping people do taxes. The men's friendships grow over the years as try to find, as the IMDb plot puts it, \"solace and eventual redemption through acts of common decency.\" This movie is on the longer side, being over two hours long. However, the many elements in this film do not drag, making this movie an intriguing and exciting feature. The plot and subplots were solid, blending together well, and the cast of characters gave a strong, dramatic and memorable performance. There were action, humor, drama, tragedy and hope all mixed in, providing you a very entertaining film.There are far too many aspects of this film to be mentioned all at once in this review. Therefore, you will have to see and follow this movie for yourself to appreciate it. It is certainly worthy of its seven Oscar nominations, including Best Picture (Forrest Gump won that year). A must-see for anybody.Grade A"
}