{
    "0": "Wish is a funny, perhaps unfortunate title for this movie. When its trailer came out, and people commented on how its \"storybook illustrations come to life\" visual style looked more like unfinished 3D animation than moving drawings, you bet there were puns aplenty about how this is just \"Spider-Verse from Wish\" -- or, more aptly, \"Puss in Boots: The Last Wish from Wish\" but that one sounds a bit clunky.Indeed, for all the talk of how Wish would be a grand return for Disney Fairy Talesâ„¢ that also, I guess to commemorate Disney's centennial, would somehow \"personify\" the wishing star we see in many of their films, the reception wasn't exactly across-the-board ecstatic. On top of how weird the animation looked to people -- which is odd since we know Disney can nail 2D-looking 3D, as with 2013's The Paperman -- several critics remarked on how a lot of the post-2010 Disney movies (Pixar, too) reduce themselves to \"Pick a culture to explore; make generational trauma the villain\" and, more importantly, have interchangeable adorkable/awkward/\"quirky\" female protagonists that oft sound more like Millennial YouTubers than fairy tale heroines.Ever since Tangled, the new \"princesses\" have tried to replicate the vibe of Mandy Moore's Rapunzel on some level. Wish also exemplifies that weird trend of post-Tangled Disney/Pixar films of having one-word titles that don't sound very whimsical or exciting. (Kudos to DALLEE 3: It tends to get this right when generating fake posters for \"Pixar's *INSERT HISTORICAL ATROCITY HERE*\".) If they ever adapt H. C. Andersen's The Princess and the Pea, mark my words that it'll just be named Pea.The plot: The ruler of the Mediterranean kingdom of Rosas, King Magnifico, has the magical ability to keep the \"wishes\" of the populace in his custody to grant/return as he sees fit; each citizen has to give theirs up as they come of age. His new apprentice, Asha, senses that evil is afoot and discovers that she is able to make wishes irrespective of the king's approval, turning towards the stars and even summoning a sentient wishing star named... Star. And yes, the plushie should be in stores now.Ariana DeBose, Chris Pine, and Alan Tudyk, who naturally plays the comic animal sidekick, are all fairly funny in their roles from time to time and I may even have vibed with one of the songs. Sadly, my verdict mirrors the one that everyone else seems to have: I will not be remembering this movie in a few weeks, beyond the myriad jokes at its expense.I suppose the Wish situation might partly be explained by the awakening that's been happening all throughout 2023, where mainstream movies get to be truly good and artful again, and so people realize that Disney's films may not be all that interesting -- and, moreover, may not be worth defending under pretenses of activism. We are more aware than ever that options exist. Even if you truly refuse to bring back 2D animation and opt to meet people halfway by making a sort of 2D-3D hybrid, we can find more seamless attempts in such movies as Klaus (which is also a better call-back to older Disney designs than this is) and, like I said, the Spider-Verse films.I do think people act a bit dismissive toward the picture, and there are things to appreciate in it -- particularly its storybook opening sequence that mimics the typography of the one from Snow White; other images recall the likes of Pinocchio, Peter Pan, Pocahontas, etc. Alas, I think the best version of the movie was lost to another timeline where less corporate meddling took place. (Did I mention that the songs were written, not by someone with experience in musicals, but by a person who's written songs for Justin Bieber?)We should also give Wish this, however: It made droves of people, be they fans (the thinking, non-zealous kind) or film critics, truly appreciate what this studio used to give us, especially during the Disney Renaissance -- from the superior emotional resonance of the songs to the heavy stakes and grandiloquent visuals (most notably in Beauty and the Beast, The Lion King, and The Hunchback of Notre Dame), not to mention the variety of the 2D-animated styles compared to now, when most of the movies look like they inhabit pretty much the same universe.If you want a true celebration of Disney's magic over the past century 'til now, I'd rather you check out the Disney+ short Once Upon A Studio (which I managed to enjoy despite being reminded not two days later of what Disney has become, as they announced another slew of remakes, even one of effing Frozen). Asha, the latest addition to the world of Disney princesses, joining hands with Snow White, the first-ever of the princesses, is significantly more poetic and moving than anything in Wish.",
    "1": "Every element of this movie feels like it was generated by a lackluster AI program.The heroine has no apparent drive or motivations outside of the immediate plot, and has the same cute but generic \"adorkable\" vibe as Rapunzel, Anna, Moana, and Mirabel. She's enough of a cypher to let anyone put themselves in her place.The villain is a blandly handsome king whose motivations boil down to \"worship me\" and \"more power.\" He lacks the complexity of Frollo or Gothel, and the charisma of Scar or Ursula. He's empty enough that you can imagine him as an analogue for whatever politician you dislike.The supporting cast was a pile of generic stock characters. Ably enough acted, but utterly forgettable. None were developed enough to be interesting.The music is lively, but instantly forgettable. After Frozen, Tangled, and Moana, my kids sang garbled toddler versions of the songs on the ride home. After Wish? Nothing. Not even a hum.The art was interesting. The watercolor-ish style worked for the backgrounds, and captured some of the feel of classic Disney films. But the characters seemed crudely pasted atop the background. More than any recent Disney film, you could FEEL the computers behind the animation.The plot was uninspired. There were a handful of places where the writers could have taken different paths, and asked interesting questions about the nature of power and responsibility, but they abandoned them in favor of a one-dimensional and utterly predictable story.Even the worst flops in the Disney archives had something going for them. Brother Bear was beautiful, Home on the Range was funny, and Dinosaur was a technological leap forward. Wish has nothing. Was it terrible? No. Was it memorable? Definitely not. Will anyone bother to see it more than once? I doubt it.",
    "2": "First few minutes I was interested. The idea of everyone having a wish seems dangerous. So I sympathized with the villain. I expected the struggle to grant everyone's wishes would lead to undesired outcome that the girl would have to fix. In doing so becoming the villain herself as her selfishness would have brought disaster and I thought the king would be proved right and the girl's selfishness would lead to the king sacrificing himself to save everyone. Teaching the girl a lesson about stealing and maintain order. It would have been a good twist if the initial villain ended up being the good guy after all and the girls action would make her the villain. Then there could have been a redemption arc for her in the final act. The Star could have been some type of neutral being that ended up becoming evil due to all the negative wishes overpowering the good wishes. Then there could have been that one pure heart wish that overpowered all the bad wishes and restoring the stars position to either neutral or good. The premise was there. It could have been so good. But none of that happened.In this movie the girl is perfect she cannot do any wrong. She has no hero's journey. Everyone in the story is perfect except the main villain and he wouldn't have been corrupted if not for the girls actions. What she did to him was basically entrapment. I lesson I got from this movie is stealing is ok if it's for family. No one is capable of making bad wishes. Which is not true. If I was or anyone had the power to grant wishes we too would be worried about handing out wishes like candy. I think any one with common sense would know how dangerous that can be. What ever happened to the old school Disney movies That had consequences for your actions. Those were some real lessons. The queens actions in the end are criminal. The king never imprisoned any one. He never robbed them of their freedom but she did. She basically sentenced him to die. For guarding wishes.The star thing was cute tho. That thing is going to sell merchandise. The animation was good. The songs won't be classics. They're forgettable. The only characters that have good design are the king and the star.",
    "3": "Disney Disney Disney... they could've made the \"Disney 100 movie\" be an unfinished idea from Walt himself, but sadly went the boring profitable route. The animation is so bad, it's not a cool 3D-2D like Arcane or Puss-In-Boots. Like why did they make this. The humor is weird. It's not kiddy but it just doesn't have an age range, so expect every age range to not find it funny. I wish I knew who this movie was made for, to every age group it's a forgettable movie. And it's sad to think even with disneys 100 year anniversary they chose money over story. I tried not to mention any spoilers but I wish I never watched it.",
    "4": "Yet another disappointment. Not a bad movie, but surely not a good one either. Even kids at the cinema were bored and almost none laughed throughout the movie, except just a handful of times. The plot was literally what you see on the trailer, there is no twist, nothing exciting to keep you interested, it was as bare bones as it could get. Nothing stood out, from the characters to the songs, it was from those movies you forget you watched after a month! It had too many references to old Disney movies, which got tiring after a while and the plot was rushed. I have no words, Disney was known for having great stories for the entire family to gather and enjoy, but now it's just generic and boring. I think it's time for Bob Iger to retire.",
    "5": "I have personally never in my entire life groaned as many times as I did watching this movie. The plot is so mushy and undercooked, all the Disney references didn't feel magical, and the music actually sucks.The movie doesn't care about actually making a story. It takes the formula of classic movies and then just places it in the movie just because. There's a ton of elements and parts of the movie that have little to no time to flesh it out. I legit didn't know who any of Asha's best friends were yet the movie wanted the betrayal scene to feel super massive. But it didn't feel like one, I just sat there and went \"Huh? What? He had plot significance?\" That was my reaction to a lot of the movie.My second reaction was \"UUUGH!\" It feels like the people behind the scenes cared more about the audience going \"oh hey it's (insert Disney movie)!\" instead of going \"Oh my gosh! What's gonna happen next in this movie?\" Every time I saw a Disney reference or a \"hidden\" Mickey, I was cringing on the inside. It wasn't smart. It was annoying.Speaking of annoying, I had a mild dislike for Asha. There's an excellent video online about the \"adorkable\" Disney princesses. Asha feels like how gen z kids picture millennials but cranked to 100. Every time she was rambling like \"Oh I'm sorry. I'm so annoying and I care too much! Am I annoying? Probably\" I wanted to stop watching the movie immediately cause I was just actually getting annoyed by it.",
    "6": "I'd avoid \"Wish\" in theaters and just wait for it to hit Disney+ in a couple of months. This movie is surprisingly rough for a Disney Thanksgiving release. The songs, jokes, and story all feel like they were written by ChatGPT. The lyrics don't make sense and seem like an AI prompt, the music is as bland as can be, and they plop characters in your face without any introduction and expect us to find them funny or endearing b/c they resemble other Disney characters. They try to do all these call backs to other Disney animated films since its \"Disney 100\" and it just ends up being strange and unsettling.The animation feels unfinished and awkward too. They linger on shots way longer than they need to, and the comedic timing is non existent. Disney feels like it's losing its magic.",
    "7": "*If you see this movie, STAY till the end, the end credits and the tag are delightful*Storyline\nThe best part of this movie were the Easter eggs and references to classic Disney movies. I wish they had just leaned in and milked this, instead of wasting screen time trying to show us how \"quirky\" the main character is supposed to be, as if it even mattered to the story. The storyline was overall kinda boring.Worldview\nA point in this movie's favor is that the sorcer overtly practicing witchcraft *is* the bad guy. However, the message of \"hope\" (and they did a whole song about this!) is that we are all (talking animals included) stardust, and that's why we look to the stars and our hearts to guide us. Fake deep new age nonsense.Animation\nI like that they *tried* to do something unique with the art style. The painted storybook texturing had the potential to be so beautiful, but they really didn't take it far enough, so a lot of the visuals came across as work in progress 3D animation.Music\nThere were some nice musical moments, but overall very meh. I'm tired of the \"let's overexplain by clumsily cramming a bunch of words into a musical number and trying to make it sound like rap\" style that Lin Manuel Miranda likes. He didn't do the music, but it's clear who the song writers were trying to emulate in a couple of songs.After seeing this movie once, I don't feel like I need to see it again. I'm sad to say it met my expectations.",
    "8": "This movie was alright but Disney holds themselves to high expectations, so I expected more. Movie had a quick pace so it was hard to really be invested in the issues or characters. At times the other references to Disney felt like the movie was trying too hard. Songs were somewhat catchy but compared to movies like Frozen, Moana and others this just doesn't stack up. There was also no twist or turns and everything was pretty predictable and obvious. I will say the villain was not someone who was just misunderstood, he was truly taking a key piece of people for selfish gain and I hated him immediately, so they have that going for them.",
    "9": "Took my family to this and it was just \"ok\". More of the typical new Disney style. No family is allowed to be the same race, music was mediocre with nothing memorable, character freedom more important than the actual plot. The back story was incomplete as was the story resolution. Had hoped for a lot more as the trailers had promise but agenda just really gets in the way of telling a good fun or entertaining story.The call outs to every other Disney movie in existence was overdone and often just annoying. Won't see again. Saw two other movies this week both were significantly more entertaining.",
    "10": "Disney had a great story, with a beautiful message to share; Don't depend on anyone else to make your wishes and dreams come true, you can make them happen.This premise alone beautifully encompasses Disney's origins. The talent was great and despite the complaints, the retro animation style was very well done. Unfortunately, these are the strongest aspects of this movie.Most of the songs felt forced and weak, but that isn't what prevented this movie from being absolutely brilliant. The problem? Disney was so focused on paying homage to past movies, and inserting easter eggs throughout the movie, they forgot to take care of the story and give it the attention it deserves. Magnifico went bad way to quickly, and it felt the purpose of this was to emulate all the past villains. There were strange animal character inclusions whose sole purpose appeared to pay homage to past characters. There were character references inserted throughout that felt misplaced and actually interfered with the pace of the movie. The star also seemed a little misplaced at times; a little \"TV cartoon\" for a movie and was, at times, distracting.They should have just told the story in the beautiful way Disney is known for. They final scene with Saba was all that was needed to pay homage to Walt's legacy and celebrate 100 years.Did I like the movie? Yes. Did I love it? No, and that is a shame, because it should have been so easy to love.",
    "11": "Disney just doesn't have it anymore. They need a massive reboot and re-direction. The story was weak, the songs were not catchy, the characters were boring. It was basically an excuse for Disney to toss in some Easter eggs of bygone classics that everyone loved. If this was their attempt to showcase a 100th anniversary, it was extremely disappointing. We took 15 people to the movie on Thanksgiving evening. One person of the 15 said they enjoyed it. A few fell asleep and the rest of our family felt as I did. In short- don't waste your time with Wish. The entire movie I kept wishing that I hadn't come to this movie!",
    "12": "To give this movie a \"1\" or a \"3\" is ridiculous. Maybe you should ask yourself whether you should be going to an animated kids movie if you find them so offensive or boring. The movie is not great by any means but it has a good message, entertaining action, and decent music. It is not scary for young kids. It also pays homage to many great Disney films of the past. It's not particularly groundbreaking but not every Disney movie will be. The kids in the audience, mine included, loved it. And let's be clear, that's what really matters. Not grown adults whining about how Disney movies use to be better...",
    "13": "Check my review track record, I am a very harsh grader, but today Disney got this one right! They have temporarily redeemed themselves. My wife and daughter (who requested this movie) LOVED it. Im not going to breakdown the story or the antagonist or protagonists journeys through their respective paths of light and darkness but it was well told.....and the villain flexes his stuff letting you know any fight will be a challenge (this is critical in any hero's journey). The ending was magical.....kind of an origin story of sorts. Would definitely watch a sequel if it goes where you will think it should go.From start to finish it was a joy. It wasn't preachy, it wasn't morally on high. It was a normal back to the basics movie for kids and families. I will definetly be buying this for a rewatch once streaming comes out, my kid can watch good movies at least 30 times or more.",
    "14": "Where has the Disney of old gone? I know this is a children's movie; but when you compare this to Hercules, Mulan & other projects from the studio we love... this falls flat.The music is good but feels forced and made before the movie. (Also enough with the Hamilton rap musical style number. - it's been done 100x & is beyond played out)The main character is fine but the supporting cast is nothing more than memes and callouts.Have fun waiting 45min it's for any sort of call to adventure.My biggest problem with the whole movie was the villain. He has this mysterious past in this tapestry hinting at why he's made bad decisions trying to do good. However this is never explored as Disney is just interested in toppling another Patriarchy.The callouts a meta-ness of the movie are cringe. Considering this is the movie to celebrate 100 years I am embarrassed for Disney.",
    "15": "For a few years now Disney has done remakes. And to be honest I have no problem with that. Because I did really enjoy \"The Little Mermaid\" and The lion king , Beauty and the beast and Aladdin. But I have been wanting an original story from Disney because I know they can do it. I know they have the imagination and the money for it. When I heard about this movie I was unsure but when seeing the first trailer I got very happy very quickly because this movie has the heart of a good story. I also liked that the Villain was really evil. He got into his magic really good. Plus I thought he was really cute even for a bad buy. I hope in the future Disney will do more Original movie Musical stories in the future.",
    "16": "Wish has a lot of plot holes and inconsistencies. I thought it was very lazy for Disney's standards.The visual style feels like it was trying to copy off movies like Spiderverse with a more cartoony look, but instead it looks like it was unfinished.This movie felt like a game of \"how many Disney references can we put into a film\". If that your thing, you might like it I guess. Very weak villain with lack of backstory. Good plot but lacks elements for an intriguing execution. The big reveal at the end felt very forced.Might have been good as a short but not a full movie. A lot missing and very bland.",
    "17": "If they one or two maybe it was at least be good it just mediocre. The animation is only good at night I have mostly no problems but the background animation is trash it looks like a panting. The Postives first King Maginfico the villain is the best part of the movie he is entertaining and good enough for this movie but to other Disney villains he is just okay he is better than miss bellwether and Hans but not that good to be like scar,the evil queen,or and even Judge Claude frollo.they wasted 200 million dollars on this movie and other characters like okay or I didn't care the goat was annoying and the plot was messy goodbye everyone gotta watch a old good Disney movie and this movie is a disappointment to Disney.",
    "18": "I honestly felt like I was watching a knock-off of Frozen, Tangled, and for some reason Shrek. This wasn't the worst movie I've ever seen, but it was not great. The kids liked it but they liked Trolls 3 better. The songs were not catchy, the animation was very lacking, and the characters themselves all fell flat and felt boring.Personally, the best part for me was the Easter eggs. Some are more obvious than others.The storyline is full of plot holes, but it is a feel-good film. I would recommend waiting for stream to watch this. And I'm glad I didn't pay for the 3D, I don't even see how this would have been any good in 3D.",
    "19": "People are missing the point of this movie, and politics in our current climate are getting in the way of what definitely is a wonderful tribute to 100 years of Disney, the movie is everything you can ask of a Disney movie, full of great music and wonder to spare, great animation and great vocalization by its great cast, with Ariana Debose the perfect choice to lead the blissful tale.Great song score that matches the greatness of Frozen, Encanto, Moana and other recent great Disney movies.This movie is underserving of its poor critical reception and poor box office performance, it is up there with most of great Disney works.",
    "20": "This movie seriously looks like it has been fully AI generated with the low quality animation, patchy backgrounds, and bad character designs. When did all animated movie characters start to have the exact same faces? Everything from the music, trailer, cookie cutter themes, token characters, and sloppily put together lyrics, Wish screams low budget and rushed. It's actually laughable that Disney would release THIS monstrosity as the movie celebrating its 100th anniversary. Quality Disney movies are dead, and it looks like we will only have the classics to look back on as the peak of all things Disney.",
    "21": "The critics got it wrong on this one. While yes it has beats and elements we've seen before, Wish puts a new spin on the classic Disney elements. The soundtrack is amazing, the singing and instrumentation are all top notch and it's a soundtrack you are likely to put on your phone. The animation is a great mix of 3D and some 2D elements where from afar it can look like a painting. For Disney fans it has all the elements you are looking for such as an over the top fun villain, cute fun side characters, amazing music and a good message. Wish has homages to classic Disney and fans will pick it up but it's not what carries the movie. Recommend seeing it, especially if you have kids.",
    "22": "I might be one of the few people who genuinely likes the movie. I say this as someone who is not a Disney pixie duster shill nor am I someone who blatantly despises anything Disney puts out and is willing to tear to shreds to stick it to a big corporation.I am simply someone who grew up watching and loves Disney movies and while I do lampoon a lot of what modern Disney has put out and recoil at the controversies the company gets into on what appears to be a weekly basis, I don't wish for the company I used to love to fail this badly and that's why I gave this movie a chance. I told myself I would never support a live action Disney remake as I feel that remaking their classic animation library is creative bankruptcy so when this was announced, I was very interested in it.The movie is good, and I know that will sound like I'm being paid to say so, I'm not and if I were I'd have rated this higher. I would say it's a victim of bad marketing, overblown hate and the symptom of a growing culture war festering in Hollywood and entertainment as a whole.The positives of the film for starters are that the music and soundtrack are phenomenal. I know some will say the music feels AI generated, but in my opinion, I loved them, especially At All Costs and This Wish. There were a few that did feel mid, but overall, the music is well done. The voice acting performances were stellar, Ariana DeBose and Chris Pine steal the spotlight whenever their characters were on screen and my god did it help this story a lot.The story and characters are serviceable, it's the very definition of \"safe\" which is not what the centennial anniversary movie should be, but I'd rather this type of movie over the other preachy and condescending content that's being pumped out by Marvel, Star Wars, Pixar etc. For once the comedy was genuinely funny at least to me and each moment felt well timed and appropriate, it wasn't immersion breaking in my view.Asha is a decent protagonist/heroine who has genuine love for her people and her family and friends. Her seven friends are also quirky in their own ways but don't become annoying at all, her talking goat, Valentino is not overused and as much as I rag on the King, he was quite entertaining. The Queen was alright, she was kinda meh. The star is the cutest character and just the sweetest thing.Good news for those wondering, there are no political or modern-day social messages in this film as far as I'm aware. A lot of misinformation is being spread around the internet about the premise of this movie in a rather hyperbolic manner, and I would say it's a bit disingenuous. Just because a movie has a black female lead and an ethnically diverse cast of characters doesn't make it bad by default considering the plot has explained why so many groups of people migrated to the kingdom.That being said the negatives are a bit mixed in that regard.Asha's character has been mischaracterized a lot in the marketing as well as King Magnifico's. She doesn't seek to grant everyone's wishes like some communist activist, she just wants the King to give back the wishes he deems not worthy to be granted, allowing those who do want their wishes realized to work for it on their own. She has very selfless motives and wants better for everyone in her kingdom and she admits she made a mistake and fixes it as best she can. She's by no means a Mary Sue, and she has flaws that are understandable given her naivete and youth.Likewise, with Magnifico, he's probably the one character that feels a bit rushed and forced into the villain role. I've disliked how many twist villains or redeemed misunderstood baddies we've gotten in recent years, but I feel this villain almost overcorrects that and gives us what we want but lacks the charm that the others gave us. We know characters like Ursula, Maleficent, Captain Hook, Hades etc. Were charming and campy in their own ways and the films they were in were not afraid to show us how devious they were and relished it to an almost absurd degree which is what a lot of people expect. We knew they were suspicious and untrustworthy from the get-go, whereas the King's arc feels mishandled.The problem with King Magnifico is that he feels a bit too realistic compared to them, and his descent into villainy feels forced to accommodate for that role. He's painted in a way that makes you feel sympathetic towards his goals, but towards the end when he goes off the deep end, he just becomes a completely different character altogether. Forbidden magic corruption aside it feels jarring when it should have been a gradual descent. Not only that, but he also comes off more monstrous and irredeemable than someone who's just unrealistically campy or over the top, his actions feel incongruous with how he was initially portrayed, and he's defeated way too easily for me to see him as a genuine threat.The animation is also really muddy in the beginning, the blending of 3D and 2D art doesn't mesh well at times, but when you get into the story you almost forget it. It's not a bad looking film by any means, but I think they should have gone back to 2D animation for the 100-year film as opposed to this weird hybrid animation that feels like it's copying Spider verse.I appreciate the movie for not overstaying it's welcome and it's at a good time length, and yet the pacing was rather fast. One moment characters will be talking and the next we get bombarded with three song numbers back-to-back, more talking and a few minutes later more singing which feels a bit jarring.I also believe the absence of romance wasn't needed in this film despite what most people would say it not being a fairytale without romance. I believe if the movie had a romantic subplot, it would have felt tacked on, forced and honestly superfluous. It can work in another story, but just not this one and that's okay, not every Disney story needs to have someone making bedroom eyes to another person to be considered a good story.My last critique of the film is the ending. The King literally absorbs so much wish magic and the star itself and yet with the power of song and rallying the people, Asha is able to defeat the king when the people create new wishes, despite him being nigh unstoppable. It felt a bit anticlimactic, but again it wasn't that bad. It does fumble with the idea of him being a powerful magician when he's this easily defeated by a girl with barely any magic in her and singing.Despite all of my critiques, the movie is decent, but it's not amazing. I will say it does not deserve the overblown hate it gets, the movie isn't groundbreaking, it just is a safe Disney movie you can see with your family. Some might view the ending as Disney retconning their entire movie catalogue, but even then, that's a complete stretch in my opinion and most of it is unfounded, but again I won't put it past them to pull some shenanigans.I personally recommend it if you want something cute, wholesome and fluffy. It may not be a masterpiece, but it's not the big bad monster it's being painted to be.",
    "23": "An island kingdom features its inhabitants happily surrendering their dearest wishes (which they then forget) to the compassionate curation of sorcerer king Magnifico (red flag name, there). 17 year old Asha, auditioning to become the king's apprentice, discovers he has no intention of ever allowing the majority of wishes to be granted. She makes a wish (18 is the age at which people give up their wishes), and a wishing star comes down and proceeds to create havoc, resulting in Magnifico giving in to paranoia and megalomania.This Disney CGI feature looks great. It clearly draws a great deal of visual inspiration from the world of Shrek (Asha is obviously a close family relation of Rapunzel as they have exactly the same mouth) and there are countless nods to other Disney properties, ranging from affectionate homages to outright ripoffs (hands up those who watched the escaping wishes and went, \"Oh! The lanterns from Tangled!\" I thought so).Chris Pine'# voice characterisation of Magnifico, starting out well-meaning but conceited, declining to outright evil, is excellent, and the other voice work is good. And then...The songs are forgettable. And the delivery and/or sound mixing often means that you can't make out the words anyway. Also, frankly, they aren't necessary. The best Dusney songs move the plot along: these don't. They're just... there.But the biggest flaw with this film is the story, which hasn't been fully thought through. I have no problem with the magical mechanics of it, but does everyone only ever have one wish in their life? How does that work? And the wishes we see all seem to be the tiniest bit pedestrian. The central conceit of the movie failed to have me believing in it, and I'm pretty good at believing the unbelievable.This one was a bit disappointing.",
    "24": "Not sure why people are being so hard on Disney lately. It's honestly strange that so many are bothered by their attempt at diversity.The reviews for \"Wish\" were terrible and went so far as to accuse Disney of using AI to write it. I am so glad I didn't listen and took my kid to see it.The film was great. Are there some clumpy dialog and song lyrics? Sure. But the story and characters are engaging, the villain is great, the animal sidekicks are adorable and the film is very fast-paced. There's a lot to love here. Honestly, a mediocre Disney film is a lot better than a good film from other studios. It's time people give Disney a break and start to appreciate the love and effort that go into their films.I hope more people go to see \"Wish\" and make it the success it deserves to be.",
    "25": "I WISH I had spent my time and money on a more fulfilling cinematic experience. Despite its intriguing premise, the execution falls flat, resulting in a lackluster and forgettable movie-going experience.One of the main issues I have with this movie is it's predictable and cliched plot. The narrative follows a tired formula that has been recycled and countless other films, failing to offer anything new or original. It's as if the filmmakers pick the plot from the bottom of the recycling bin and dusted it off, hoping the audience wouldn't notice the lack of creativity.The lead actress's attempt at portraying a complex character comes across as wooden and unconvincing, leaving the audience detached from any emotional investment in the story.",
    "26": "We had hope at least for a little entertaining. My girls were only bored and annoyed by the music. I wonder how somebody invest money, time and energy in something like this. The story is completely absurd. The characters have nothing and everytime somebody started to sing we just wanted to push the fast forward button.Not even the animation was ok. Something must happen. Many speak about Disney big problems, but everywhere is the quality so poor. I don't want to give up on cinema, because I still enjoy going tp the theater. Please do something to keep the interest of the people. I'm with Christopher Nolan. I don't want to stream everything!",
    "27": "I took my five year old grand daughter to see this movie. I can say we both have found this movie to be very slow moving. Not much for you to get excited about here. Walt Disney has gone down hill making children's movies. But I can say that it was not the worst they ever made.It was hard to figure out the characters ethnicity they were playing. Could not tell by hair or clothing. I assume Persian or Greece? We both did like the music and songs that the characters sang.For me I found the best part was the credits shown at the end. I liked that they showed all the Disney characters sparkled in gold one at a time.",
    "28": "I don't know why everyone is so negative About the movie. I loved it. It was original, sweet and the story was really nice. And i loved the easter eggs.There is a lot of humor and i laughed out loud a lot of times.But the only thing i didn't like were the songs. They are not that bad, but not catchy at all. With every Disney movie I love to listen the songs on spotify, but with this movie I don't want to. I mean, they can sing and its alright, but with Disney you want to sing along and these songs aren't really good for sing along.But overall its a really nice movie. Just go and watch for yourself.",
    "29": "\"Wish\" is a film that, without being excellent, turns out to be entertaining and worthy of celebrating Disney's 100th anniversary. The script provides a positive message and gives tribute scenes to Disney animated classics. The animation technique is a mix between current and past, the computer generated animation is well done and there are some backgrounds done with the old school hand animation technique, both mixed together masterfully. The musical themes begin with a soulless song but the next ones manage to stand out in lyrics and musical arrangements. The production achieved a good result but could have gone further. A simple but effective film.",
    "30": "As an avid Disney fan who watches nearly every release title, I can say this was a bit disappointing. My expectations from the trailer were not too large but this felt too much like a combination of too many Disney films into one film with a more shallow plot. While I can't say I can relate to main characters in other films, such as Elsa, Ariel, or Mulan, I can say at least the motivation behind what drove them was clear. The main character in this was not strong enough to deliver the concept, and it felt like a carbon copy of previous titles. The villain was essentially just a combination of Maleficent and Jafar, his name was Magnifico as well so even the name was close. The concept of the conflict additionally was a bit weak and not delivered in the most effective way. Asha is incredible at singing as per usual and I am a huge space/star fan so I gave an up vote for those things. I will say for kids this will be a fun film, it just doesn't hold any rewatch value.",
    "31": "There are several positives for this film and the first is every single scene is visually stunning. The animators did an excellent job and it gives off a perfect fairytale impression which is exactly what Disney ordered. Second, the songs were beautiful, the lead was the perfect Disney lead with a powerful musical voice and there was a nice mix of different genres so the musicians clearly had fun. Thirdly, the characters were likable, unique and fun. Star and the Queen in particular were my stand outs and again they were all animated beautifully. The one downside? The plot didn't match up and the story felt unfinished. If you told me the original script was scrapped and this was quickly put together a month before release I would believe you. The story felt aimless and vague and sadly, is a pretty big flaw. So if you want a movie with a great ending impression or take home message, this isn't the movie for you. However if you want a nicely animated short film with good music, then this is right up your street.",
    "32": "Boring schlock that disney wants you to watch just so you can see the really HUGE reveal that all the characters actually tie into the disney cinematic universe, and guess what, its BOOOOORIIINNNGGG wish looks like an unrendered film and is not faithful to its \"2d style\" roots. The main character is unlikable, the villain is boring and is 3 different people throughout the movie (he just randomly gets more evil there is no progression) when I went to wish there was no one else in the theatre, no children wanted to see this, and it feels like a disney product that will never be remembered until one day someone digs through a bargain bin in 2034 and says \"remember wish\" and they're friend will reply \"no\"",
    "33": "I don't hate this movie, but I did leave the theater wanting a little bit more. I do like the art style of this movie, it's a nice change from the past decade of Disney films. It's also nice to see a runtime of only an hour and a half. The music is mostly forgettable. The song \"This Wish\" is the clear highlight, and the creators knew it too since it is the only song to get played twice.My main problem is with the writing. The story is much more basic than what we have come to expect. A king is power hungry, and our protagonist must overthrow him and restore peace in the kingdom. Wish has a narrative more reminiscent of some of the more classic Disney films. I don't mind the simple narrative; I think the issue is the characters are so poorly written that the whole journey feels hollow. This movie basically has two characters, Asha and Magnifico. Everyone else might as well not exist. Even the motivations and values of the two main characters are poorly defined. It is so hard to get invested in a movie with poorly written, ill-defined characters.That being said, there is still enough good here to keep me from writing this off entirely. I can think of many worse ways to spend an hour and a half.",
    "34": "I went to watch the movie with my kids. My 8 yo loved it.my 10 yo fell asleep. I wanted to fall asleep too. The movie was boring, underwhelming and honestly who wrote the plot?The design was nice but I have watched Disney movies 20+ years ago with better design. But the plot was pretty much non-existent.A king who keeps the wishes for no apparent reason and then decides to use them in combination with dark magic. The group of friends who have nothing in common or any bonding whatsoever. Zero character development, zero plot. I did not laugh at any point of the movie. I was just sitting there wondering how they thought that this movie could celebrate 100 years Disney.It is plain. It is for sure not forgettable because it is so plain that nothing actually happened in the movie.I just do not recommend this. It is not worth spending money on.",
    "35": "Beautiful movie. I was actually in goosebumps and tears during many of the scenes. The animation is amazing. Very good animation with powerful score. My bf took me to see this today and I ate shrooms beforehand and the special effects of this had me laughing and in tears so much. Don't think a Disney movie moved me this much since Alladin! This is a new Disney classic,and Asha is a great heroine while Magnifico a sorta creepy villain. I love the detail of the animation as I was peaking. Very intense and thought it also reminded me of Don Bluth's stuff. Lol!! Great 100 anniversary movie that gave me goosebumps throughout =)",
    "36": "I had reservations at first, but ultimately this movie ended up exceeding my expectations. I'll admit that they weren't too high to begin with, but it didn't take long for this movie to change my heart. I wish they would've marketed this better because I shouldn't have doubted this movie. It has a great message that I fear is going to completely go over a lot of people's heads, but if it's for you, you'll get it.The animation was different but didn't take from the story which captured your interest and peeked your curiosity. The characters were ALL likable or redeemable and each served a purpose to the story. I think it's well worth the watch and I enjoyed catching all the Easter eggs of various Disney movies and characters.",
    "37": "The animation is absolutely gorgeous and stunning. So is the character design, I was so excited that there was going to be another brown princess on the screen. But the storyline...it lacked so much. The characters didn't feel like they had much depth to them besides just from being there. No one seemed to have any relationship, especially in Asha's friend group. The songs were a mess of, \"Oh hey, this sentence could rhyme here too!\" And what was up with the talking trees and animals singing scene?? Which lyrical and script writer came up with that?? Especially the goat. Disney, you really missed your chance here.",
    "38": "Wish is Disney's 62nd Disney animated film after Strange World and features the voice talents of Ariana De Boise(West Side Story),Chris Pine(Wonder Woman),Victor Garber(Titanic)and Alan Tudyk (DodgeBall). Directed by Chris Buck(Frozen and Tarzan) and Fawn Veerasunthorn(in her feature debut) and written by Jennifer Lee(Frozen),with music by Julie Michaels(who sung Slaughter Race for Ralph Breaks The Internet),the story follows a 17 year old girl named Asha(DeBoise) who's an apprentice for the King Magnifico(Pine) who grants wishes. However when he goes out of control due to the powers the wishes contain,its up to Asha,her pet goat Valentino(Tudyk) and a wishing star to save her people and stop Magnifico.Will Asha save the day?.Overall I thought it was a good film. The animation style mirrors Sofia The First and the music was grand but it wasn't as good as Tangled or even Frozen. The voice cast was good too yet like Tangled and Frozen I knew who voiced who especially the villian who is obviously styled on Chris Pine. Speaking of the villian the song wasn't even that evil enough. It was more like Friend Like Me from the 1992 classic Aladdin.Also there is alot of Easter Eggs from past and present Disney films e.g. The opening mirrors the 30s 40s,and 50s Disney princess films,the book that Magnifico had was modelled after Hocus Pocus but with the sun from Tangled.If you like Disenchanted (with the whole be careful what you wish for),and Frozen then you'll love this film. In my honest opinion it was better than Strange World,Encanto and Raya and The Last Dragon.",
    "39": "This film is audacious. It not only bases its title on \"When You Wish Upon a Star,\" the ultimate Disney anthem (among many), it *delivers the goods.* It is a fairy tale of the best Disney sort. A young woman and her 7 grumpy, sneezy, bashful, etc. Friends , with the help of a bit of cosmic magic, stand against a seemingly benevolent wizard-king. They do not triumph. They lose badly. And the fun goes on from there.Excellently written and performed, with capable direction and brisk editing to 90ish minutes, the movie blows by like stardust in your hair and eyes.Do not miss your chance to Wish.",
    "40": "The message and premise of the movie are solid - people need to follow their dreams always works for Disney, and the idea of someone hoarding those dreams while pretending to care is genuinely a wonderful idea.Where it really falls apart is the storytelling arc. They do a storybook intro setting up this very positive world led by a caring king, but then after one basic question by a 17 year old in the first act (30 seconds after they finish a duet about dreams), the king totally turns and reveals himself (how has he kept a kingdom together for decades if one question did this?).It was just way too quick of a turn for the first few minutes of world building to make sense instead of making you say \"huh?\" - either from minute one they need to let you in one the idea something was wrong OR they needed to build him up as at first being \"careful\" for the first hour (and give her the assistant job) and then have it slowly fall apart when he won't grant some really important wish. But instead they did neither.Ultimately It seems like they didn't know what the story should be (probably because they were so focused on Disney references) so it ended up being hacked together in not great ways. A lot of the people involved in frozen were involved in this one. It suffered from similar problems with Hans giving aww shucks smiles in act one before becoming a bad guy. (This is because, as a lot of people know, Elsa was originally written as closer to the Villian and they already had material I guess... so were stuck with a nonsequitur heal turn in the fjnal act).Frozen was able to make up for those flaws with incredible songs sung by broadways stars and an initial five minutes of world/story building that make you care deeply for all the leads. But this movie didn't have those things, again because they seemed more interested in making Disney references (storybook opening, multiplane camera look) than doing that initial world building in an emotionally impactful way.",
    "41": "It is about believing in wishes. And that it is about a teen girl named Asha who wants to have her wish with the grandfather, who would turn 100 years old to be granted but also be the King's apprentice. As she lives with her grandfather and grandmother.But the king, handsome but arrogant and spoiled in trying to allowing her to be the apprentice. Only to show his very true colors and that she tries to explain to her grandparents. But they brush her off.While she tries to figure out how to make his wish come true and that she meets a powered star named of course \"Star!\" And granted wishes that the King feels threatened by.Trying to find Asha and her grandparents and having.the employees who work at the castle for the King and Queen, as he feels that Asha is working with them and that she is but at first, must keep it a secret.But one of them decides to spill the beans in the promise over in getting a promotion. The employees now are fugitives along with Asha and her grandparents, and she and Star must tell of the King's plan or else they would be their crimes.Even his own wife the Queen,has her own doubts. But trying to grant the wishes over in those including her own grandfather and imprisoning the king will be the two keys to allow them to live in peace and be granted wishes.Ignore the reviews, enjoy this as kids at heart.",
    "42": "I saw a lot of review's of this movie being sort of mix to bad but i think its so good i mean yeah its not tangled or anything before it but its not terrible it has great vibes and good animation its not as big as something for 100th bday for disney but pretty enjoyble its a great watch u won't regret it a bit !!!!!!!!!!!!!!!!!! Oh btw it has a lot of cute easter eggs and beautiful water colored backgroud it truely has something to go for its not for everybody sometimes it gets childish but everything about it is awsome plus the music is amazing and the mix of 2D and 3D frrrr works i give it a 10.",
    "43": "It just frustrates me that Disney is no longer a magical word. In the last decade, their movies and production have been nothing more than garbage. They don't care anymore ðŸ˜©\nI hope they bounce back, but there is no light at the end of the tunnel.The artists, graphic designers, cartoonists, animators, etc, are doing a fantastic job. I wish they would let them direct the movie instead of these useless. The short film was better than the whole movie.The Hollywood industry is not in good shape right now. But that is not an excuse for this lousy work.Perhaps they could stop messing with their legacy and start fresh with a new approach to find a new path for their future.",
    "44": "I understand one of the modern Disney movies, it does not inspire what fairy tales in the past, I want to know tribute to original fairy tales, so they have failed, I said sometimes I want to inspire real fairy tales.I am curious to other structures or perspectives in the story, I find the story incredible, but I want to know where the original book, I need true story and where in the place. I am a folklorist who experience all fairy tales in my studio.Without a doubt, it asks you to follow fairy tales for new films to the endless future, always remember the ancestor and owe respect to past fairy tales.",
    "45": "I want to preface this by saying I'm not a hater - I love Disney. I'm a Disney Renaissance kid, so the magic of these films are near and dear to my heart. But bad writing is bad writing.As soon as Asha opened her mouth I disliked - I'm tired of these copy-paste Disney heroines. When Rapunzel was the first quirky Disney heroine in 2010, it was amazing! It was new and exciting to see a Disney princess/female protagonist who wasn't perfect, but eccentric, clumsy, and awkward. But the same trick gets old when you see it over and over again. Asha had absolutely no distinctive characteristics, nothing about her was unique or even interesting. But Asha wasn't the only character in this film who I wish were different.Her sidekick goat, Valentino, had no distinctive personality either. He was no nagging yet caring Sebastian, he was no mischievous yet reliable Abu, he wasn't anything. If you asked me to describe Valentino with a word, I couldn't. I would just say, \"he was there.\" Nobody in the theater I was in laughed at any of his lines. His comic relief was barely a relief. I think Star, WHO HAD NO LINES, was a stronger character than the goat. And that's not because Star was an integral part of the plot - it's because Star had a cohesive character design. Star was whimsical, silly, caring, energetic, etc. Valentino was certainly not the GOAT of goats.The villain, Magnifico, was evil throughout the film, he got more evil as it progressed. He's deeply narcissistic, and he even has a song where he gaslights the people of Rosas, \"this is the thanks I get?\" But again, he just didn't feel unique or distinctive to me as a villain. What bothers me even more about Magnifico, though, is that I felt there was an enormous missed writing opportunity.In the very beginning of the film, he briefly mentions this burnt tapestry and was like, oh this tragic thing happened to me, it's (supposedly?) an integral part of my character - AND THEN IT WAS NEVER DEVELOPED! \"Hey, our villain has this tragic backstory, there's a burnt tapestry on the wall about it!\" Okay and? So what happens? Will there be a flashback? Will his trauma somehow be healed throughout the story and he'll return everyone's wishes, or grant everyone's wishes? Why mention the tapestry of trauma at all if it doesn't help develop the plot or complete a character arc? Imagine how emotional it could've been if towards the end of the film, with TEARS IN HIS EYES and REMORSE, he talks about how he just wanted to protect the people and their wishes. If the writers just wanted him to come in and go out as a villain (Gaston, Clayton, Maleficient) that's fine, it's fine. But then why bring up the tapestry of trauma? Beginning of the film: this is a complicated and dynamic villain/ Ending of the film: psych.I also found the \"forest/star song\" to be another missed opportunity. I understand in musical productions like Disney films and Broadway, the songs are plot devices. They can give us information, they can move the story along. But I felt that the forest song's message - \"we're all stars\" - didn't come across very well. I was so surprised by mushrooms and forest critters \"coming to life\" that I couldn't even tune into to the lyrics of the song. The message of the song - we're all stars - NEEDS to be communicated to the audience because it's how the conflict of the story is resolved.The people harness the star power within themselves to take back their wishes and kingdom. But I just felt this information could've been more effectively communicated as dialogue, \"our kingdom has this old legend...\" or, \"my father once told me....\" Like how about the FATHER tells Asha about this star power in a sentimental FLASHBACK? It's hard to hear the very important information being told to us if there's a million distracting things happening! Be Our Guest could have a million billion beautiful things simultaneously happening on the screen because the song isn't communicating any important information, it's okay that it was a spectacle, same with Under the Sea. But the forest/star song tells the audience how the conflict will be resolved. And if you miss that, then when it happens at the end of the story, it feels very unexpected...sudden, random.I also hate to say this, but I didn't love the traditional 2D with the 3D. I just felt that it didn't look good. I know other recent films or television shows have used the two mediums together successfully and seamlessly, but in Wish, it just never looked good.The queen turning against her evil king-husband also could've been developed better. What was her motive for turning against him? She saw he turned evil and she just...had enough? Okay, but was she conflicted about turning against him? Was it hard for her to do it? Just feels like another missed writing opportunity and another weak, unremarkable character.The songs were mostly unmemorable.The baggy-eyed friend who betrayed Asha shouldn't have come back at the end and asked for forgiveness either - and then to BE forgiven?! What does that teach children? Be forgiving - even to people who literally BETRAY YOU by turning you in to a psychotic, evil king who will do gosh-only-knows what to you?! He should've been left in the forest with the rabbits!I appreciate the film's fundamental message - make your own wishes come true, don't depend on someone else to make your wishes come true, and even...reclaim your individual power and then collectively overthrow tyrannical rulers - I'm so down with all of that, it's a fantastic premise for a story. But the execution of it, the story telling? It left me wishing for much more.",
    "46": "Not sure why everyone is hating on this. Super cute story line; lots of hidden references to other Disney movies; the music was different but it was inspiring and uplifting. The characters were clever, humerous, and again contained some great references to other movies. The animation was beautiful with the storybook-like shading. Some nice minor plot twists. I was hoping to learn more about a certain character's background. I could see where it would have taken a step higher with cell animation. The star and the talking goat were cute, funny, and not, as I was afraid, cheesy. I would go see it again!",
    "47": "My kids had been eagerly waiting to watch this new Disney movie for a while. It falls so short of what you'd expect when comparing it to other releases like Encanto and Frozen. They were both bored within minutes and checking the time to see how much longer was left.The movie itself has no real structure to the story. The songs are extremely poor, the lyrics don't fit the music and don't really make any sense. The queen instantly turns on her husband with no reasoning or explanation to her change of heart. You build absolutely no rapport with any of the characters including the main heroine.I'd say it is more like one of the cheap animated movies you'd expect to find on Netflix. Don't waste your time, just watch it when it comes out on Disney+. I think most people would struggle to watch it all the way through.",
    "48": "Tonight was family movie night and we all went to see Disney's Wish. No spoilers here but this was a truly great movie. I have seen some people complain about this film for ridiculous reasons and that is what any complaints about this movie are, ridiculou . The film was full of 100 years of nods to all of Disney's animation styles as well as the films. The characters were adorable and all need to be plush characters. The story itself was solid and had a classic Disney style. The music was excellent, you could hear the audience singing along with the movie and the soundtrack rivaled Encanto too!",
    "49": "So I watched it in the movie house yesterday and It all started with a teenager who wished for a star and then they both planed to get the wishes for the people back from an evil king who wanted to take their wishes. Then the people and Asha sang to free the wish and put King Magnifico in a tiny cup and take him to the dongon where is sinks. So 5 minutes later everyone got their wishes back and they all lived happily ever after. Mickey has everyone's favorite character in all to years. People has their own wishes and their own dreams. I liked the beautiful moments in those parts the beginning and to the end.",
    "50": "Disney Movie '' Wish '' is a blend of all the well known Disney movies and it more often than not nods towards popular scenes and dialogues from them.However, and even though there was potential, the movie is a hot mess. The art is wierd, as it is a blend of 3D animation along with the old art, which, in theory, was interesting, but the result wasn't aesthetically pleasing.Also, the story was boring. It had too many loose ends, too many songs, which weren't even good to begin with, and it was too predictable and eye rolling. The characters weren't that inspiring either. The only good part of the movie was probably the star which was adorable.So, overall, three out of ten.",
    "51": "Wish is a film that manages to be simple and magnificent, I can imagine that Wall Disney would be proud of the homages to their fairy tales. This movie is for all Disney fans. From the film's trailer it seems generic and boring but when you watch it, you are surprised by so much magic and excitement. It's a film to laugh and get emotional, it managed to steal some tears. Asha, Star, Valentino and especially King MagnÃ­fico are incredible and charismatic. I loved the King MagnÃ­fico, he's like a classic Disney villain.the film is full of references to Disney films. I loved it and if you love fairy tales, you will too.",
    "52": "What do you expect out of a concept about granting wishes? Now, I will say that when watching the film, I noticed that there is something there with the villain and his need for controlling who gets to have a wish and who can't. But even that was barely done with. The resolution to this sucked. Seriously, a crowd singing a random song was all you can come up with?The characters are all pretty flat. Asha is your typical bubbly, goofy Disney heroine and her try-hard quirks felt more cringy than endearing. The seven friends are one-note and clearly a rip off of the seven dwarfs. And... all the other characters were just forgettable. I would say Luma, Goat, and Magnifico were okay. Luma and the goat had some funny lines, Luma especially itself had a fun and cute personality, Magnifico has a decent song and the over-the-top characteristic we come to expect from Disney films, but even I felt like they could've done more to develop his character. He doesn't come off as sympathetic or three-dimensional in any way, just your average Disney villain who wants power kind of guy. And... this is nitpicky, but I also wish he sang his song at the end of the film. It was uttered, so why not just sing it as a last hurrah?None of the songs were memorable in any way. I would say the main Wish song and This is the Thanks I Get? (which also had one of the few entertaining scenes as we see Asha, Luma, and Goat sneaking around in the background while Luma is trying to cause trouble) are the only decent songs in the film, but even they aren't the best that Disney has done and aren't particularly catchy.Most of the humor was cringy. I don't remember hardly any of it. One was even a gross out joke. There were several times I remember chuckling, but tthen again, I don't remember most of them. I would say the one butt joke they had was actually funny, and that's something I rarely say, just because it didn't feel out of left field.And oh my god, don't get me started on the references. If you thought the Mario movie was nostalgia baiting, at least give that one credit because the references made sense. Here, the references and easter eggs come out of nowhere.I don't even think kids would even care much for this unless they're into classic fairy-tale Disney films. I certainly wasn't as a kid and none of the kids in my theater seemed like they were laughing or enjoying themselves either. And I definitely wouldn't recommend this to those over the preteen age, where they're starting to grow out of \"baby\" films.The only real highlight I can give this film is the animation, which has a refreshing style compared to other Disney films, yet still feels like a classic fairy tale Disney film. I do think they could've done a better job with the 2D-3D blend though, there were some times, like the tears that felt off for me for some reason.They didn't even play a short before this film, at least my theater didn't. I was thinking they were going to play Once Upon a Studio, but they didn't. Just why?Wish gets 5.4 bells out of 10.",
    "53": "Three stars are dedicated to the amazing art and decent music. However, the story itself was so bad I felt inclined to write a review. Perhaps my perspective is skewed due to my high expectations. I feel as it the story meant to take one direction (what I hoped it should have been) but ended up being rushed and changed.They inserted the plot point of the villian pointing to a painting and saying \"I must never let that happen again\" then never developed it further. The story felt inconsistent overall, with events occuring just to move the story forward, rather than actually mattering. For example, the apprentice interview, Asha's weakness being that she cares too much, the painting scene, and the king's backstory at the beginning.Here is how I felt the story should have been:In the past, the king wanted to grant everyone's wishes to make everyone happy. However, it ended up a disaster because of conflicting wishes/ones that harm others. So in present day, he is very hesitant to grant wishes and just holds on to them to relieve people of the pain of unachieved wishes.Then the beginning scene with Asha discovering what the king is doing happens. She disagrees with not granting wishes and has the whole sequence where she meets Star.Then together with Star, she releases and grants the wishes. However, instead of everyone being happy, the disaster the king witnessed in the past occurs again. Thus developing the whole \"my weakness is that I care too much\" thing. Asha cared too much that it ended in a disaster.The king tries to fix it, but the magic is beyond him. So he teaches Asha magic and they ungrant the wishes together. This develops the whole apprentice interview thing.At the end, they realize that neither granting wishes nor taking them away from people is the right call.Then the story ends the same way where people's dreams are guided and they work together to make airplanes and stuff.",
    "54": "'Wish' was an entertaining movie that recognizes the classics of the company while creating its own narrative for story progression. The pacing of the movie felt appropriate for its narrative to continue and the villain connected back to pure evil characters from before, though perhaps tame in comparison to them. The musical pieces of the movie were memorable and a majority of the songs sung were enjoyable as well as catchy to listen to.However, the movie often references classic Disney movies to a point it becomes repetitive and drawn out. Though the film successful acts as an homage to the fantastical theme previous films possessed, and while it is nice to see older movies be recognized, these references and homages risked overshadowing the stand alone nature 'Wish' possessed. A section in the movie that involved talking creatures did feel drawn out, though it seems appropriate placement in a disney film.However, the protagonist and antagonist are interesting characters that are written greatly, but could have been expanded on more to establish a character background. While the movie does give reason for these characters actions, the reasoning feels lackluster and forced onto the audience as fact rather than giving a thorough explanation. Ultimately, the film was entertaining and an enjoyable film. On a scale of 'Actively Rewatch', 'Background Noise', or 'Change Channels', this film was enjoyable enough to Actively Rewatch.",
    "55": "So when I first walked out of the theater I was actually very suprised of how pretty ok the movie was.The movie has a ok pacing, I think there could of been more moments to flesh out characters but it's fine. This movie is better than most Disney movies and is a pretty decent way to celebrate the 100 year anniversary of Disney. I think the premise of the shooting star was very well executed and I think the villain did a pretty good role for a villain even if it's not the as memorable as the 90s Disney villians. I think the main character Asha is a Meh character but she is very likable and has a pretty good I want song. While most of songs are average, there are some highlights with the Villians song and Ashas I want song. While there are issues with the pacing and it's somewhat off anaimation, it has a pretty good plot, decent characters and ok songs to make up a movie that is enjoyable, but is lacking some off the Disney charm from back then.",
    "56": "Seriously! What's the deal with these reviews? Wish was an incredible way to celebrate the 100th anniversary of Disney, an entire CENTURY of magic on this planet! Please beware the spoilers in this review. So, Asha discovers that King Magnifico was actually the bad guy hoarding every single wish, and she was determined to stop this whole mess. I liked when Valentino talked and was being the best sidekick, same goes for Star, who doesn't have a gender (which is fine), and Star was very curious, heroic, cute and funny. I love all the references they've put in the movie with some of the main characters in Asha's family being like the 7 dwarfs, I even loved the villain callbacks that Magnifico made during his wrath when he crushed the wishes. And the ending credits were fun, seeing all the character constellations like Chicken Little, Bolt, Aladar, Yzma, Mirabel, Wreck-it Ralph, etc. I was bummed they couldn't fit Meet the Robinsons in the credits there, like maybe Lewis, Wilbur, or Bowler Hat Guy? Anyhoo, Wish is definitely the GOAT, better than Strange World (which I did like honestly but this one's better). If you haven't seen it, go watch it. Screw the reviews and go watch it.Thank you, Disney, for a century of memories we will never forget, for infinity and beyond!",
    "57": "This movie was everything we needed for disneys 100th anniversary. The whole point of disneys movement and beginning was about dreams and making those dreams a reality which is the whole plot for this movie! Every movie that has ever been has things you could mark it down for but that shouldn't affect the movie as a whole. It made me laugh, it made me smile, it made me feel. All Disney movies have at least one reference to another within them but this movie really portrayed the anniversary in the best way. The amount of references were amazing! Peter Pan, Cinderella, Snow White, Mary poppins, etc etc etc. This was the rebirth of Disney that we needed the dream coming back to life to awaken that love within children and for adults to find again within themselves.",
    "58": "This movie was beautiful to me! It fulfilled my checklist and gets bonus points for the cameos in the movie. The animation was great, it had a fun and enjoyable songs all throughout the movie, it had a Disney villian (in my mind) who was very just fueled off pure evil and selfishness, and this movie had very fun characters.Like I said before there were cameos (spoilers) all throughout the movie in disguise of characters like Asha's friends who were the seven dwarves. Plus if you really want to see your favorite Disney characters stay and watch the credits! But my favorite is that it was a true Disney story and its not something that brings in and over flows it with modern day problems! Overall it is a very enjoyable film and a great way to celebrate Disneys Anniversary. Also, (SPOILERS) I like how the Disney company got to be a character in the movie!",
    "59": "A beautiful testament to Disney's 100 years. The animation is different yes, but it's delightfully clever with the background of each seen looking like it's from a storybook. The songs are excellent, the story (whilst predictable as you'd expect from a Disney story) is still very engaging and Chris Pine works wonders. The many, many nods to Disney classics are also so clever and lovely to pick out. It almost feels like \"the origin of Disney\". I'm a massive film fan and thus, the first to criticise or find fault but honestly, what a wonderful film and perfect celebration of Disney's 100 years. Here's to the next 100 years.",
    "60": "This can be among bottom worst movies from Disney ðŸŒThe idea can be great but they missed the opportunity to make it good. Illogically simple character development (none), no layer, no real conflict. We laugh a lot though, at the movie, how non-sense it felt at some moments.They could have made the characters learn lessons, go through a trial and fail journey, realize that no one truly understand the meaning of wishes until the end. The villain turned bad too quickly, with no back bone to why, the girl learned no lesson, the people take 0 time to recognize. And singing is their ultimate way to overcome anything.You can see how they try to repeat the success of Frozen with the characters and plots, but it is far from anything Frozen brought to the scene. This movie shows how Disney undermines its audience. LAME.Very very disappointed!",
    "61": "Not sure why there are negative reviews. This movie embodies classical Disney with story and music. The characters were excellent and developed well enough to create that connectedness factor with the audience. Arana Debose and Chris Pine both deserve the utmost respect for bringing their characters to life. The music was specific and with a purpose. I loved the fact that they released it ahead of the movie. My daughter was much more into the songs since she knew half the words already. I love this animation style as well. Overall, no complaints. My daughter and I thoroughly enjoyed this and Asha has quickly become her new Disney fave.",
    "62": "The importance of wishes in the world is a good thing and this Disney film reminds us just how great the world is when we have wishes that give us hope. It's a film that's good fun and put a smile on my face when it was over. But the bad guy in this flick was a little too obvious and kind of funny. Perhaps Disney needs to take a step back and put more effort into showing us something we haven't seen before. That's a wish but has no expiration date. The star is the MVP of the film. The heroine, on the other hand, could have had more moments to shine. Her voice and persona are fitting to this story and we need more plucky protagonists like her. Recommended if your need some light Disney fun.",
    "63": "I throughly enjoyed this movie. I thought the story was great and heartwarming (with the highlight being a good villain which has been missing in some of the more recent films). I loved the little Easter eggs from past Disney movies and while the songs are a bit different they're kinda catchy. The animation style was interesting and took a second to get use to but honestly quite refreshing for them to switch it up a bit. Definitely doesn't deserve all of the hate that it has been getting so far. Yes maybe it's different and not the same as classic Disney films but that doesn't mean it's not a good film. It's definitely worth the watch, I'd say to give it a chance.",
    "64": "While I appreciate the effort invested in the film, I found the departure from conventional character archetypes to be a challenging aspect of the viewing experience. The inversion of traditional hero-villain dynamics, with the perceived villains assuming heroic roles, posed a narrative challenge for me. This unexpected twist, while daring, left me with a sense of disconnection and disrupted the expected storytelling conventions. Moreover, the characterization of the female lead as a stubborn individual with a seemingly unrestrained demeanor was a departure from typical portrayals. While I recognize the intent to challenge stereotypes, I perceived the character as somewhat one-dimensional. A more nuanced approach could have provided a richer and more relatable portrayal, allowing for a greater depth of connection with the audience.",
    "65": "Okay, it's movie review time! I have no word to describe it, but Disney Wish that...was... WONDROUUSSSS!! This is the greatest main theater event i've ever experienced. The musical numbers make me sing along and lots of funny scenes but I can't spoil it. This is by far the best ever i'm gonna cherish for my life! Congratulations to Chris Bucks and the entire Disney Animation Studios crew for making this centennial movie possible. You guys should check out for yourself. Disney wish is now in theaters everywhere! I recommend you to watch this movie! 100 out of 100!Here's to the next 100 years of wonder\n#disneyanimation #moviereview #disneywish #wishmovie #MainEvent #Disney100 #openingnight #iwasthere.",
    "66": "Wish was absolutely brilliant and remarkable. I've been waiting for this kind of movie since I was a kid. Every Disney movie I saw was very different but it had really good dialogue and storytelling. Wish was more exciting than ever before. The story taking place in a new world was something new to me . But Asha was one of the best characters. The main villain was by far so incredible. He has the same powers as maleficent and the queen from Snow White . The wishing Star was like the genie from Aladdin . But he had a really good way of making me laugh and how wishes can make a difference. The songs were so beautiful and the song when you wish upon a star from Pinocchio always makes me smile and cry at the same time.Disney congratulations on a job well done making wish . The end credits with all the Disney characters from my grandparents times Snow White 1937 , Pinocchio 1940 , dumbo 1941 , ichabob and Mr toad , and other Disney movies changed history for 100 years.I hope wish wins an Oscar.",
    "67": "It's hard to begin. As much as I appreciate Disney for making it to their 100th anniversary, after watching this movie, I find it hard to imagine they will survive another century. This movie is yet another lackluster delivery; however, compared to the earlier Disney movies released in the past 1-2 years, it is subjectively worse. The music leaves much to be desired. The story logistically is a mess. And the characters seem more like knock offs of previous Disney characters that it is hard to see them as their own entities. To be fair, this is a critique that I hope Disney takes note of. Because if they do not, I do not see their future line-up surviving past the nostalgia of the brand name.BASIC PLOT:\nAs a young boy, Magnifico (Chris Pine) was disheartened to see that many people were unable to fulfill their greatest desire. He wanted to help these people actualize their dreams. And as such, he studied sorcery, learning how to wield and grant wishes. He eventually founded the Kingdom of Rosas with his wife and invited everyone to join him and his vision. The only stipulation that was forced upon immigrants was that they needed to give their deepest wish to King Magnifico so he could safeguard them in the palace. If they were lucky, the wish could come true. But if not, they would just have to wait and hope. Asha (Ariana DeBose), our protagonist, applies to be the king's apprentice. During the interview, she learns that King Magnifico has no desire to grant everyone's wishes. She tells him it is better for him to return the wishes to the citizens so they could actualize their wishes on their own, but King Magnifico refuses-creating the central conflict of the story.Positives:\nThe story book format introduction detailing King Magnifico's rise to power was reminiscent of older Disney movies. The animation made a good use of describing the character world, and the animation was spotless here.While arguing with the King, Asha made a decent point. If the King has no desire to grant all wishes, why not return them to the people? The movie never explains why returning wishes is good or bad, so Asha could have won the argument.The wishing star was the best supporting character in the film. It was adorable and cute. On a marketing perspective, I can see a plushie doll being well liked by the kids.Negatives (because there weren't much positives):\nThe largest drawback to the film was the villain. And as such, it deserves it's own section which can be seen below in the review.There was absolutely NO character development for Asha. Neither was there a lesson learned or a setback she faced. One of the reasons older Disney princesses were so well loved is because of how they faced adversity. Cinderella's kindness to her animal friends helped her escape the closet her stepmother trapped her in. Ariel's vivacious personality helped her stand out in front of Eric even though she had lost her voice. Mulan's ingenuity and quick thinking helped her create the avalanche to help them win the fight when they were on the brink of a loss. However, Asha faced none of that which makes her much more forgettable compared to her former counterparts.Beyond character development, I also genuinely disliked Asha as a whole. As others have said before, she embodies the same quirky/cuteness as Rapunzel and Anna, making it difficult to establish an identity of her own. Beyond that, her biggest flaw is that she is too kind. That could have been a great character flaw to explore if she accidentally grants a wish that causes severe repercussions. However, without that conflict, her flaw becomes baseless and unnecessary. Moving on, her insistence to release all the wishes to the people, despite failing to realize the potential consequences of her actions, makes her come off more brattish and stubborn than brave and compassionate. Overall, it was difficult to connect with Asha.The supporting characters did not get enough screen time. Asha had 7 best friends that were occasionally brought to the screen, and they were highly reminiscent of the 7 dwarves. So much so that it was hard to see her friends as individual, new characters specific to the Wish universe. Valentino (Alan Tudyk), Asha's pet goat, was an irritating addition that offered little to the story. I'd rather they remove Valentino entirely from the plot and instead offer more screen time and personality to the Wishing Star.The animation was a complete let down in the movie. The artwork was fine, but the mix of 2D and 3D was done very poorly. Most of the time, the movie gave a \"poor CGI\" effect as it looked like the 3D characters were \"stuck on\" to a 2D picture. The film was largely in shades of blues and purples, and I wish they explored other color palettes. Perhaps give Asha a pink/red colored dress to off set the blues elsewhere in the background.Many of Disney's former soundtracks have ended up on my playlist; however, this movie will be an exception. I wasn't able to enjoy the vibe nor the lyrics of the songs. And I felt there were too many songs which detracted from the storytelling. Though Lin-Manuel Miranda is impeccable at his craft, I don't mind Disney exploring other options and people. Where I have a problem is they invited pop artists instead of those specialized in crafting music for musicals and stage plays. If Disney is planning a stage musical, they should highly consider re-vamping the songs.THE VILLAIN:Upon hearing that Wish would have a villain, I was excited. The dearth of villains in recent years has produced lackluster movies compared to the Renaissance Era which had movies supported with great, memorable villains. Given the 100th anniversary, I was hoping they were turning towards their villains again. However, after seeing Magnifico, I'd rather see stories about generational trauma and battling inner conflicts.Magnifico is a terrible villain.Villains usually have motivations that propel them into committing acts of treachery. Take Scar who is willing to kill Mufasa to become king, Shan Yu who wages a war against the Emperor to take over land, or Wicked Stepmother who was ready to banish Snow White to fulfill her vanity. They all seek something they lack at the moment. Power, clout, vanity, etc. But Magnifico is unlike them in that he has it all.He is the founder, the King of Rosas. His people genuinely respect him at the beginning of the film. There is no mention of civil unrest, conflict, or even dissidents. The only conflict he faces is a teenage girl who questions him for hoarding wishes, and he wasn't even able to adequately provide a defense. Magnifico is not a villain. He is just weak and narcissistic. You could argue the stepmother of Snow White is similar since she borders on the same vanity, but there was a mirror that was feeding her the point of conflict. Here, it's just Magnifico.There's no need for him to become any stronger. He just needs to shut the protagonist up. Perhaps say that he needs to collect the wishes so he can harness the power to grant other people their wishes. Or, if he wants to go with the explanation of \"Well, your grandfather's music can lead to civil unrest because it can lead to creativity and rebellion;\" he could provide supporting evidence of the world he lived in prior to Rosas where song was the eventual cause of destruction. The film could have explored his fear of granting too much to create a similar world in which he escaped. But no, none of that. It makes the movie more juvenile than it has to be.For the detractors that say, \"It's a kid's movie, shut up!\" I beg to differ. The Renaissance Era had movies aimed at children; yet, adults enjoyed them as well as the movies explored complex relationships between characters. Kids were entertained by the music, animation, and liveliness of the characters, while the adults were entertained by the deeper morality and message in the movie. In a world where we can explore content beyond our borders, the studio should revert to basic themes/morals that can be enjoyed by all instead of a select group of people-whether it may be kids vs adults or something else.A better story could have been:Though peace and stability reigned the Kingdom of Rosas, Magnifico's son desperately craved for power and he was disheartened to see that townsfolk wished for his father to live forever. So, he explores his own sorcery and calls upon a wishing star; but instead of coming to him, the wishing star is found by Asha who diverts the King's son's plans to overtake the throne.Nonetheless, the movie is not memorable. However, it paints a good picture of what's to come regarding Disney. We have the likes of Live Action Snow White, Live Action Moana, Frozen 3 with a potential Frozen 4, Zootopia 2... all movies cashing in on a previously successful domains. So for that reason, Wish is a pretty good reminder to the audience. The company is stuck in the past, don't expect for changes in their future anytime soon.",
    "68": "The 100th anniversary of Walt Disney Pictures was obviously a big deal in 2023, so naturally they needed a film to celebrate its centennial, 100 years of magic, and so came this computer-animated movie with a style to look like the studio's signature traditional hand-drawn animation, directed by Chris Buck (Tarzan, Surf's Up, Frozen) and animator Fawn Veerasunthorn. Basically, many years ago, the Kingdom of Rosas was founded by King Magnifico (Chris Pine) and his wife Queen Amaya (Angelique Cabral) on an island in the Mediterranean Sea. Magnifico studied magic and sorcery, gaining the ability to grant the wishes and desires of his subjects, with many people settling and expanding its buildings. When each resident of the kingdom reaches the age of eighteen, a ceremony is held where they give up their wish to Magnifico, who keeps them sealed in his observatory. Once a month, Magnifico selects the wish of one of the residents to be granted before the city at a ceremonial event. Seventeen-year-old Asha (West Side Story's Ariana DeBose) is preparing for her interview with Magnifico for the opportunity to become his apprentice. Her best friend Dahlia (Jennifer Kumiyama), runs the castle bakery alongside their six friends Simon (Evan Peters), Gabo (Harvey GuillÃ©n), Bazeema (Della Saba), Safi (Ramy Youssef), Dario (Jon Rudnitsky), and Hal (Niko Vargas), advises Asha to be honest about her weaknesses. It is also the 100th birthday of Asha's grandfather Sabino (Victor Garber), she hopes after waiting so many years he will finally have his wish granted. Asha is nervous during the interview, but Magnifico is charming and happy to show her all the dreams he has collected over time. It is going well until Asha requests for Sabino's wish to be granted; to play music and sing to the people to inspire them. But Magnifico declines because the wish holds a potential threat to his power. Asha realises that there are several wishes collected over time that will never be granted for the same reason. It is revealed that Magnifico seals up the wishes of the citizens but never returns them to their owners. This means that the population is easily handled and free of aspirations, and therefore they depend upon Magnifico. A heated argument ensues between them as she questions his methods, Magnifico refuses to accept her apprenticeship or to grant any of the wishes of her family. At the wish-granting ceremony that evening, he grants a simple wish to another citizen leaving Asha devastated. She tries to convince her family that Magnifico has deceived the kingdom, but they refuse to believe her. Asha is distraught by these things and flees; she stops and rests on the branch of a tree, and she makes a wish on a star. To her surprise, the star comes down from the sky in the form of an anthropomorphic being. The star, which she names Star, spreads its magic throughout the forest, giving Asha's pet goat Valentino (Alan Tudyk) the ability to talk, along with many forest animals. This inspires Asha to return to the kingdom and have Star help her to retrieve her family's wishes. Star's presence is sensed by everyone in the kingdom, including Magnifico who realises that there is a threat to his power. As Magnifico's subjects begin to doubt his way of ruling, and to maintain his position of power, despite the pleas of Amaya, he uses a book containing forbidden dark magic Asha retrieves Sabino's wish, and he is overjoyed to be able to remember it. But Magnifico, who has been corrupted by the dark magic, arrives to arrest them, realising that Asha is responsible for summoning Star. He intends to use the magic of the fallen star and the collected wishes to increase his own powers. Sabino and Sakina flee, while Asha, Star, and Valentino stay behind to free citizens' wishes. It is revealed that Asha's friend Simon told Magnifico about her wishing on a star because he hoped his wish, to become a knight, would be granted. Magnifico grants his wish but enchants him to become his henchman to capture Asha. Asha rallies her other friends, Dahlia, Bazeema, Dario, Gabo, Hal, and Safi. They are joined by Amaya, after discovering the corruption from the dark magic. Asha's friends infiltrate Magnifico's study, and the observatory roof is opened to free the wishes. Asha tries to distract Magnifico, but it is Simon disguised as him to trick her. Magnifico returns to the castle tower, absorbing the power of every wish and trapping Star. Asha tries to stop him but is easily overpowered and Magnifico covers the sky in clouds so no citizens can wish on a star. Asha will not give up hope and starts to sing to encourage and rally the citizens to regain their hopes and dreams. The strength of their collective desire to change Rosa's future eventually overpowers Magnifico, and he is trapped inside the mirror of his staff, which is taken to be locked away. The citizens have their wishes returned to their hearts and they have a newfound appreciation of pursuing them. Amaya as the sole ruler of Rosas helps her citizens make their wishes come true on their own. Asha and her friends forgive Simon for his actions. Star gifts Asha with a magic wand before returning to the night sky. The end credits feature characters from all the studio's feature animated films: Snow White and the Seven Dwarfs, Pinocchio, Fantasia, Dumbo, Bambi, The Adventures of Ichabod and Mr. Toad, Cinderella, Alice in Wonderland, Peter Pan, Lady and the Tramp, Sleeping Beauty, One Hundred and One Dalmatians, The Sword in the Stone, The Jungle Book, The Aristocats, Robin Hood, The Adventures of Winnie-the-Pooh, The Fox and the Hound, Basil the Great Mouse Detective, Oliver & Company, The Little Mermaid, Beauty and the Beast, Aladdin, The Lion King, Pocahontas, The Hunchback of Notre Dame, Hercules, Mulan, Tarzan, Fantasia 2000, Dinosaur, The Emperor's New Groove, Atlantis: The Lost Empire, Lilo & Stitch, Treasure Planet, Brother Bear, Home on the Range, Chicken Little, Bolt, The Princess and the Frog, Tangled, Wreck-It Ralph, Frozen, Big Hero 6, Zootropolis (Zootopia), Moana, Raya and the Last Dragon, Encanto, and Strange World. Also starring Keone Young as Mountain Climber, Lucas Sigler as Bunny and Baby Mushroom, Holland Watkins as Mouse and Mountain Climber Wife, Woody Buck as Stag, EfÃ© as Ship Captain, Nicole Lynn Evans as Mountain Climber's Wife, Heather Matarazzo as Flying Woman, and Nasim Pedrad as Sania. The story attempts to tie together a major theme across Disney films of wishes coming true and can be seen as an origin story for the wishing star. The speaking and singing voices of Pine and DeBose are fine, and the animation style is relatively good, while \"This Wish\" and \"This Is the Thanks I Get?!\" are alright songs. Unfortunately, this turns out to be one of the least magical films in the studio's back catalogue, the problems being that the plot is underdeveloped, the songs are hardly memorable, and it feels both predictable and bland, no wonder it failed at the box office. I appreciate that Disney wanted to make something to celebrate the big occasion, the kids might have a little fun, but this is a disappointing and almost forgettable animated musical fantasy. Okay!",
    "69": "My daughter and I loved this movie!The music was amazing. The animation style felt very familiar within the Disney universe but was unique at the same time. I can't quite explain it but it was like a 3D animation style with a 2D animation \"theme.\"We loved the characters, but couldn't decide if Valentino or Star was our favorite.It was fun to see all the references to other Disney films. I won't say more about that as I don't want to include spoilers.If you love all things Disney, I think you will enjoy this movie. Definitely recommend this film for Disney mega fans or familles with younger children.",
    "70": "To begin my review, I was so eager to see Walt Disney Animation Studios' latest animated flick Wish. Unlike the past animated films in their library that I was so excited for, this one is different as it celebrates the centennial anniversary of the studio as a whole! I've heard about the mixed and average reviews that have plagued this movie and I say that it didn't change my views about it in the least. The CG animation style and quality are completely different compared to their previous CGI films since it's resembling the techniques used in films Into the Spider-Verse and Puss in Boots: The Last Wish, but it had quite a story that I was already left fascinated by about the theory of wishes being used by other means.The story goes about Princess Asha, a 17-year-old girl with hopes and dreams in the Kingdom of Rosas of becoming an apprentice to its ruler King Magnifico. Once a year, he gathers people's wishes and makes one of them come true for one lucky individual. However, she soon realizes that with every wish he collects, he sees them merely as ideas and only grants ones he finds useful. With this knowledge, Asha and her friends sought to set things right for them and their home.The voice talents of Academy Award-winner Ariana DeBose and costar Chris Pine gave wonderful performances in both speaking and song as the lead heroine and villain respectively. King Magnifico is best described as a combination of past Disney villain tropes such as the narcissism of Gaston, the power mad demeanor of Jafar, and Doctor Facilier's trickster charisma. I was already mesmerized by Asha's breathtaking song \"This Wish\" and \"Knowing What I Know Now\" the moment she began to sing alongside her friends. The former being a beautiful anthem that encompasses her cause.There are several references and easter eggs to Disney's animated classics thrown all around in this movie. One notable example being Snow White as the most obvious and raises the question on a theory about this movie and past Disney animated films being in the same universe. While these excerpts all play well for nostalgia, others claiming that it's \"no substitute for proper storytelling,\" or is a \"cut-and-paste\" of Disney tropes and elements. I saw the contrary in it as it seems to serve as a culmination of what has transpired over the years for the studio. As for the theory I mentioned earlier. It had me thinking that since Magnifico takes his subjects wishes and keeps them for himself by not granting any of them fearing they would overrun his kingdom, it doesn't necessarily mean their hopes and dreams should be seen as bad.And I have to mention voice actor Alan Tudyk, who voices Asha's goat companion Valentino. Ever since Wreck-It Ralph in 2012, he essentially became Disney's good luck charm as Pixar once had with John Ratzenberger. He really proved to be a standout when Valentino suddenly gains the ability to speak. There's potential in Wish to get any recognition during awards season judging by the impressive visuals and breathtaking songs used here. The entire movie and studio itself are hardly perfect given its ups and downs for decades (notably the 2020s has history repeating itself for Disney since the 2000s), but I say there's plenty of magic left in there. In this case, the songs are the redeeming quality for it. And it shows there's still that small glimmer of hope. I think it should be given a chance as Wish definitely deserves better praise. I have no regrets in watching it.Moral: It's in everyone's nature to pursue what they believe in, but what's also important is being true to themselves.",
    "71": "Disney always made movies for everyone, they just happened to be family friendly movies. This is the first Disney animated movie that I think is aimed at only children. The paper thin plot, goofy songs, and toilet humor shows that it's for kids. Now I think that young kids will enjoy this movie but you probably won't I think that this movie shows how obsessed Disney has become with creating franchises. They want to make their next Toy Story or Frozen only. As a result their movies have become painfully safe and formulaic. Wish does nothing wrong and checks all the boxes. This movie is supposed to be their first attempt at the 2D/3D animation style but it looks it's just regular 3D but unfinished. They need a Genndy Tartakovsky, Jorge Gutierrez, or Guillermo Del Toro type of creative visionary at WDAS. This movie is safe, corporate, and worst of all its forgettable.",
    "72": "I saw Wish, starring the voices of Ariana DeBose-Schmigadoon!_tv, West Side Story_2021; Chris Pine-Dungeons & Dragons: Honor Among Thieves, the Star Trek movies; Alan Tudyk-Resident Alien_tv, Doom Patrol_tv and Victor Garber-DC's Legends of Tomorrow_tv, Alias_tv.This is a Disney animated movie that is a great addition to there sparse library of movies and to celebrate their 100 years of doing business, they have scattered lots of Easter eggs throughout the film. Chris voices the King of a small island country that he rules over with an iron fist under the pretense of being a nice guy. Chris is a sorcerer that takes his people's wishes from them when they turn 18 years old and keeps them in his castle, to be distributed at his whim-which isn't very often-to an honored person. Ariana voices one of his subjects that applies to be his sorcerer's apprentice but changes her mind after she sees the real Chris. Victor voices Ariana's 100 year old grandpa and Alan voices Ariana's pet goat. Ariana wishes on a star and gets a visit from a little flying wishing star that wants to help Ariana set things right with Chris. As the end credits start, there are drawings of famous Disney characters-Snow White, Bambi, Lion King, etc,-along the side of the screen and after the end of the credits is a quick scene with a character singing and playing the song When You Wish Upon a Star.It's rated PG for mild action and violence and has a running time of 1 hour & 35 minutes.This is a good family film for the kids and adults-for the Easter eggs-and would be a good one to stream.",
    "73": "Well maybe not classic. It reminds me of that late 80s mid 90s era when the animation hits were coming out annually, but you can't forget the series of films that began with Snow White back in the1930s. Wish sure didn't. This movie felt like it was trying to make a Disney-verse defending so many of their animated movies and it feels like I just saw the origin story of two classic supporting characters from classic Disney movies.Not into musicals but I prefer them\nanimated. There was one song I liked other than the constant tune of wish upon a star going through the movie. Not sure if the song \"what I know now\" (if that's the name of the song) is going to hit like \"Let it Go\" from Frozen, but I'm willing to rock it like the kids did with Frozen.Pure excellence if you like Disney animated movies.",
    "74": "Well, I watched this cartoon on December 1 at the cinema. To begin with, I didnt understand why this cartoon was criticized so much. When the movie started I.. still didn't understand why it was being criticized. To be honest absolutely all music scenes of the movie were not bad, but they started to get annoying after 3 music scenes in 30 minutes. (All music scenes actually very nice and rhythmic. So, u won't feel awkward!) the main character Asha wanted to fulfill her grandfather's wish for his 100th birthday. For this, she goes to King Magnifico (which later will become a bad character after the song. Oh, and again how unexpected.) A wish is the biggest dream that people wanted to fulfill, and only a king can fulfill their wish. The king refuses to fulfill the wish, and Asha sets out on her own to fulfill the wish of her beloved grandfather.. and this is where the problems of the film itself begin. For some reason, the king went crazy and stole all the wishes, after Asha stole the grandfather's wish and she fulfilled it. In the film, there is a goat for something, but it does not play any role there. Just a funny goat that you should laugh at. In general, the film has funny scenes, little tension. The best character is the king, with his unexpected and strange actions. His charisma and rage were perfectly conveyed. There are about 6 music scenes in the movie and they are all not bad. If you don't dwell on the banal and obvious problem of the film from the beginning of the film, do not dwell on what is happening there and why. The animation was good, I personally like the style that was set in this cartoon. Well, u can watch the movie, but I must admit that it's not the best cartoon and has its problems.",
    "75": "It looks like the love of a \"Disney movie\" just wasn't there.Inconsistent animation styles between people and building scenarios. Bad and \"non-sticky\" melodies (there was not a single song to remember like on Moana or Frozen)\nThe argument happens too fast, it looks like it was chopped off to make it happen in 90 minutes so they can sell more tickets per day.There was no memorable character to rely on. Like with Coco, here, there wasn't that feeling to love a character or empathize.This movie had too much room for improvement. I saw the intention to place some Easter eggs about other classics Disney movies, but it was simply not well executed. By the end, perhaps, they could say the king became the wizard in the mirror of Snow White, that would be a nice twist.",
    "76": "So, I just got back from seeing Wish at the time reading this, and I honestly don't get the hate, I really enjoyed this film. It was fun and amazing, and was overall a fun time. Here are my thoughts and feelings for the movie.Now, before I get on with my review, I just wanna say that if you don't like this movie, that's okay, you're allowed to have that opinion, these are just my thoughts and feelings on the movie, so keep that in mind.So first off, my favorite part of the movie was the villain. Magnifico is such a good villain in my opinion that he might be in my top 3 favorite villains of all time. Two things I look for in an antagonist is whether or not they're fun to watch and how much of a threat they are, are Magnifico checks both boxes. It was really fun seeing him go crazy with his now found powers in the final act of the movie, and he felt really intimidating at times, like the scene where he shows up at Asha's house and quite literally crushes her mother's hopes and dreams right in front of her, making him more powerful, which is another thing I like about him. He's so evil that he gets power literally crushing people's dreams, which is really enjoyable to watch.Next up, the music. The soundtrack is just good in my opinion. While all the songs are good, most of them are pretty forgetful, but the ones that slap really slap. Songs like \"This is the thanks I get\", \"This Wish\", and \"Knowing What I know now\" are amazing and I'll definitely be blasting those numerous times, however some of the other sings just don't sound very intresting or have already been done before the exact same in other Disney films. For example, the first song of the movie, \"Welcome to Roasas\" sounds very bland and.has already been done in numerous other Disney films. The song is basically just Asha singing about the town's traditions and hyping the place up, which has already been done in other films, like \"Encanto\" with \"The Family Madrigal\", now i'm not saying they can't do that same type of song, but they don't do anything unique with the song so it just feels really meh.Next up, the characters. Apart from Magnifico and Asha, the other characters are just kind of boring. So Asha has a group of friends that help her with taking back all of people's wishes and returning them to their rightful owners so they can go out and achieve their dreams on their own (which i'll get to later), but they all aren't really that intresting. The only ones I really remember is the one that wears glasses and is always angry, and the sleepy guy because he shows the consequences of loosing your wish and because he ends up selling out Asha to King Magnifico, and even then I barely remember their names. The main characters also aren't safe from being somewhat boring. So apart from Asha, the other main characters are a goat named Valentino and a star literally called Star. For the most part, Star is okay. He's basically Disney's attempt to sell merch, but he's alright. He's cute and is a key part in the story, but Valentino... not so much. Valentino really doesn't do much notable in the story and he's not that funny either. Don't get me wrong he's still fun to watch, but he's a pretty weak comic relief character.Next up, the animation. Now, I normally don't judge Disney films on animation since ya know, it's Disney you should expect good animation, but since this animations goes for something completely different, I thought i'd mention it. So when the animation was first revealed, a lot of people thought it looked cheap and unfinished, but I thought it looked fine. Yes, it doesn't look as good as other Disney movies but still looks great. This film basically does the whole Spider-Verse artstyle, but in it's own way by combining 3D with 2D. A lot of people wish they just stuck to 2D, but I feel this animation combination works for this movie since it's their 100th anniversary film, so it's like its honoring their 2D and 3D animated projects, which I enjoyed and I would love to see more Disney films in this artstyle.In conclusion, Wish is a great movie and has an amazing villain, a good message about going out and achieving your dream, a great blend of Disney's 2D and 3D animated films, and a couple of powerful songs, but falls in flat in the rest of the soundtrack and has some pretty bland characters. Overall I'd give it a 7/10, I really enjoyed it and I feel it's a worthy film to wrap up Disney's 100th anniversary. Thanks for reading!",
    "77": "As a super Disney Fan I am always worried that I will not enjoy their newest films as they are hit and miss. Wish was no exception plus with the expectation of it being the film that is released during Disneys 100th anniversary year.However, as a massive Disney Fan, this film lives up to its \"100 years in the making\" the amount of references is incredible.Don't listen to the negative reviews if you enjoy Disney even a little bit.The story is simple, fun and meaningful. The music and songs are what you would expect from a Disney film. The voice cast is exceptional and hilarious.Only spoiler, but not really. Stay for the end credits and past them x.",
    "78": "As stated in the title, the songs were pretty good and enjoyable, but ultimately felt entirely out of place and did nothing to move the plot forward. There's literally a scene in the movie where they sing about the fact that they need to expose the evil ruler, but during the song they are doing nothing but dancing around and waving objects through the air. We don't see any plans being made or objects being constructed, nothing to show they were actually doing anything to reach their goal. Ultimately, it felt pointless.It's disappointing to see such a lack of creativity out of Disney. The idea for the plot was fine, but it feels like it lacked proper writing to make the story interesting. The King was exposed as the bad guy in the first 10 minutes. No build-up or any anticipation at all. I can hardly even call that a \"spoiler\".Fine for young kids I suppose, but as an adult I can't imagine ever wanting to revisit this one. 5/10.",
    "79": "Looks like it was made in a rush. I can't even remember any of the songs from this movie, and the rendering is normal, can't believe this is made by Disney.I mean the concept of 'wishes' is great. But the movie is so short that all the things just come up so quickly before the mood of the last scene has been absorbed by the audience, the next one comes, this makes this movie even more childish. Why do they believe in the king in the first place? Why do they change their mind just because asha's word?This is so not 100th anniversary. Why not bring Zootopia2 or Encanto2 as 100th anniversary?",
    "80": "This movie had many negative critics before it even released, but as a black girl I was really looking forward to it as after Tiana, I was finally getting another black queen! Asha was amazing and relatable, I loved the movie, despite what people think. I didn't enjoy a Disney movie like this since Vaiana/Zootopia (excluding sequels like Frozen). The soundtrack was a magic experience for my ears, and it was visually so beautiful. The characters were so endearing, and I could relate to that one introverted girl in her friend group haha. I laughed a lot, I missed fairy tales like I used to watch in my childhood. I cried at the credits seeing all my childhood heroes (Rapunzel!!). Anyways, really an amazing movie for me, I hope to see more like this in the future, I missed Disney's magic and I found it today in theatres, the villain was great too but I wish we saw his background.Definitely going to watch it again.",
    "81": "It's probably not the best movie from Disney of the recent years but it is a very enjoyable movie. It's funny , nostalgic and the drawing style very interesting. We had a good time as a family and personally think the 1 star ratings are very harsh. The story was simple, songs were cute and it feel like a nice hommage to the classics .If you have young kids I definitely recommend seeing that movie and you will have a good time. You can even enjoy trying to find all the classic Easter eggs, I know i did !I would like to see more of that style in the coming years it was quite refreshing to see.",
    "82": "Some viewers seem overly critical of Disney's Wish Movie, but I believe it's unfair to judge it harshly. Personally, I find solace in movies like this, using them as an escape from life's pressures. While it's not a masterpiece, I appreciate the character depth and the world it presents. Wish brought me joy and fulfilled its story well, with commendable music. However, the protagonist and her pet goat lacked a bit of depth and humor, leaving some moments lacking. Nonetheless, the antagonist, the king, was excellently portrayed. Wish might not resonate with those immersed in self-pity, but it's an enjoyable watch overall.",
    "83": "I recently saw Wish, and why it did so poorly in the box office I'll never know. I admit that it wasn't one of Disney's best animated features, but it wasn't one of its worst ones either. I enjoyed the characters, the songs, and the animation. It was no \"Beauty and the Beast\", but it was not as bad as \"Strange World\" either. I might not go out of my way to see it again, but I still thought that it was pretty good. I think that your children might enjoy it anyway. So on a scale from one to ten, I would give Disney's Wish a seven. It might not make a profit, but the Mouse House had slumps before.",
    "84": "Exceeded my expectation a little bit considering the overwhelmingly poor sentiment from all around me. Wish as a movie has a plot that is fitting to commemorate the 100th anniversary of Disney, an easy, cookie-cutter Disney-esque animation. The story is also more geared towards slightly more mature audience, so I'm sure it loses the focus of younger demographic. Nevertheless, the story was more inspiring than many other recent Disney films as it showcases simple human triumph and the will to defeat evil at all cost. In some ways, it is a reversal of many other animations where the premise far exceeds the quality of the film itself, in this case the story is just better than everything else. Case in point, the character design, costumes and setting of the city may be the worst I've ever seen in any Disney films, it was completely forgettable.PS: the Disney short in the beginning was amazing.",
    "85": "Has Disney made anything that was good in the last decade? Answer is no. This is no exception. Terrible music, terrible animation and terrible story. Not only does all of that take away from the film, it also alienates most if not all religions. Disney has really fallen in a short time. Every movie a bomb, ticking off the majority of visitors to their parks and completely leaving their base movie audience. If I had it over I would have saved my money and not seen this film. As a film maker myself I feel this movie is disingenuous and an insult to so many people. Yes you make movies for yourself, but you also are supposed to make movies that entertain and enlighten your audience. This movie does neither.",
    "86": "Watch it and judge for yourself. If you're a real Disney fan you will appreciate what Wish does. It will make you smile and feel good. The nod to the old style of Disney movies along with old characters being included wasn't a bad thing. Those reviewers that don't care for this aren't Disney fans...just Disney trolls. I hope you enjoy this movie as much as I did...whether by yourself, on a date, or with your kids!Since I don't have anything else to add but need more characters I'll just say...when you wish upon a star, makes no difference who you are. Anything your heart desires will come to you!",
    "87": "The negative reviews on this movie are very confusing. I'm starting to wonder if we saw the same movie. It embodied classic Disney movies but with new flair.The music was excellent and I suspect that I will be singing these songs in my car for months, if not years, to come. I'm always afraid that I will be cringing at a new Disney song but I immediately enjoyed these and they are catchy.Asha is beautiful and has a wonderful singing voice. Star made me so happy, great character! There are a ton of Disney easter eggs throughout the movie. Overall it was a great movie and I can't wait to watch it again.",
    "88": "I had high hopes for this movie. But I was so disappointed. The music is forgettable. The storyline is basic and, yep, forgettable. I absolutely wanted to love it. It had all the makings of a Disney classic. But I was just left wanting. I think kids will love it. Some may find it a bit boring. I think it's worth seeing to find out for yourself whether you like it. For me, it felt like a mashup (scenery wise) of Emperors New Groove and (character wise) Pocahontas.There were TONNES of references to other Disney classics and even the end credits had drawings of characters from various Disney classics.Generally an OK movie, but nothing special. I just WISH they could've been bolder with this movie.",
    "89": "As a 100th anniversary celebration, this was seriously below par, given Disney's recent, dreary output, I'm not sure what I was expecting, but this was woeful.It felt as though they'd borrowed bits of Disney classics, and bolted them together as a kind of eco friendly Frankenstein. It doesn't manage to spark into life, arguably the most forgettable Disney characters to date.I've read several comments about the animation, and plenty seem to applaud the style, quality and colours, let me be honest, this sucks, the most basic and unimaginative animation I think I've seen, to me it looks unfinished, did they get it out in a rush, or were there budget cuts, this isn't Disney standard, let alone a Centenary special.I genuinely fear for Disney, everything they're touching seems to be going to pot, they need a major shake up, Snow White doesn't look like a classic, where do Disney go from this?Woeful.4/10.",
    "90": "In the past few years, I haven't really been big with Disney's recent animated movies as while I did like \"Soul\" and \"Raya and the Last Dragon\", the other works like \"Luca, Encanto, Lightyear, Strange World, Elemental and Turning Red\" I wasn't really big on. \"Wish\", being the 100th Anniversary for Disney, manages to be bland and boring at its best.Throughout, the animation is solid as there are some good colors, solid structures and designs. There are some good musical instrumental backgrounds as well. I do appreciate that the story isn't based on a sequel, remake or something that already exists and Disney tries to introduce new characters and settings. But the issue is that the narrative is way too familiar from other stories and it lacks the creativity, energy and charm of the good old Disney princess movies which makes it pretty difficult to fully engage with emotionally or to care for. The lack of energy and bland style causes the characters to not be investing as well since none of the characters were engaging or interesting at all. However, the voice performances from the cast members are pretty good. Ariana DeBose and Chris Pine both provided really good voice performances. Including Alan Tudyk as Tudyk is great as usual with his voice works.The animation, as I mentioned, it's solid as the design models, colors, and movements are pretty good. With the animation using a mix of computer and watercolor, there are some really nice moments but admittedly, there were some animated movements or looks that felt odd, bland and slightly distracting. The dialogue is pretty clunky, the direction was boring, and the singing or musical moments, despite one or two songs being not too bad, the singing and song-writing wasn't good as some of the sound felt like it was written from AI. Like some of the voice and singing sound effects were pretty off. And as a whole, it was mostly boring.For this being the 100th Anniversary movie for Disney, it's quite embarrassing since there could have been any other movie that could have been pretty fun and all but it seemed Disney decided to go with the bland route.Overall, children and families will be entertained but this one is definitely one of Disney's weaker movies.",
    "91": "There was once a time not so long ago, when the word 'Disney' in an animated project meant so much; a great storytelling experience was guaranteed and a masterpiece was always possible. But as of late, each Disney project has come to feel like a rehash of every other Disney project; slowly killing any amount of excitement one might have looking forward to each new project.Wish is no different and is as every bit forgettable and uninspiring as people are accusing it of being. If there's anything worth remembering though, it would have to be the watercolor-esque art style, but not even that justifies the movie's existence. Wish lacks depth and is painfully a face-value movie. It has a Disney-protagonist, a Disney-antagonist, a Disney-merch mascot, some Disney-music, and well yea, that's about it.The question though, is if kids would enjoy it. After all, that's who the movie is primarily aimed at. And the answer might be 'yes', but probably at a level no different than how they might enjoy say Cocomelon or something. There's nothing magical that might stand out and nothing that might inspire. It's yet another Disney showcase of good animation with less than nothing else to accommodate.",
    "92": "Who would have known that, of all organizations in the world, Disney would be the one to forget that nothing matters more than love? After all those years hammering the message into our heads, they have forgotten it themselves! And that is one of the many issues with Wish. There's no love interest, and we, the audience, lose interest.Maybe we shouldn't. Maybe we should appreciate that love for your grandpa and your mom is enough, and that friendship with your buddies is equally important as passionate love. Or maybe Disney could make peace with love. When a young person loves another, it doesn't necessarily mean that they need to let go of their personality, ambitions, ideals or for that matter, wishes. Love can be, usually is, a good thing.Making an emotional story without love is not impossible, but it's hard. And the ingredients are not there in Wish. In the absence of love, humor can help. But the secondary characters in Wish, Valentino the goat or the mute lucky star, are not very good, and not funny at all. The music could help, but the songs aren't all that memorable. And the main characters, while decent, can't quite carry the story. Asha, a mix of Moana, Elsa and Pocahontas, is okay but she seems to lack a clear purpose that is believable, and we never really care much about her. Magnifico, the villain, may be the best character, but he feels so much like a rehash of other villains before him, that we struggle to see him as a character in his own right.Left without emotion, without humor, without great music, the film doubles down on weaponry, raising the stakes on the use of dark magic with every scene to try and keep the audience awake. But it's not enough. I dozed off a few times.My advice to Disney: make love, not war.",
    "93": "This movie was boring af. The first song is pretty and I appreciated the chalky animation that appears inspired by the Puss in Boots sequel. Beyond that I was bored to tears.The plot is beat-by-beat, the villain is pure formula & paper-thin, and they don't invest in any running gags or in enriching any side characters. It's as if they had to reach a deadline so put in the minimal effort necessary to get it finished, which left us with a hollow movie devoid of any magic, held together only by its mind-numbingly predictable narrative.I feel bad for those who worked hard on this film because this could have been a good movie if the studio just took the time to fill it with personality and character. Instead, Wish is a pretty lifeless addition to the Disney canon.Note: Apparently there has been a hate-train trashing this film trending all over TikTok. It is why my niece already had a well-formulated opinion on the film at Thanksgiving dinner without having even seen it. Sadly, the thoughts she echoed were pretty spot-on, so she just saved me the trouble of warning her against it.",
    "94": "What a disappointment to see yet another lackluster movie from Disney animation. I don't know why Disney animators can't create another Lion King or Little Mermaid or other engaging, fun movie. I remember taking my young kids to the annual Disney blockbuster movie - they were all excellent. But current creative staff aren't that creative and are making movies that nobody wants to see.The story is very generic and the songs, by pop singer-songwriter Julia Michaels and Benjamin Rice, are rather uninspiring. But I have to admit that DeBose and Pine performed the generic songs well. The only time Wish shines bright is when it dares to get a little bit odd. Asha wishes on a star for everyone in Rosas to get their wish (so that they can work toward making them come true for themselves), and a plump, wiggly and mischievous star pops out of the sky and pays her a visit, sprinkling stardust on plants and inanimate objects, bringing them to dancing, singing life.The real test was that my grandkids were bored instead of being inspired. Disney needs to get another group of animators who can go back to making fun, imaginative again.",
    "95": "I saw this with my boyfriend tonight because it was discount tuesday at the movies and we both enjoy a good Disney flick. While there are some cute moments, overall it just wasn't that great of a film. The plot was weak, didn't have a lot of likable characters, villain is kind of random, humor didn't land, the songs were meh for the most part, and the payoff just wasn't there. I didn't care for the overused \"im so awkward and quirky\" trope on the main character. Also, while I typically love Disney songs, a lot of the songs/lyrics felt super verbose. I read one review that said the songs sounded like they were generated using AI, and while I don't know if that's necessarily true, I can definitely see what they mean. Kids will like it, it's a decent family movie, but it's not anything I need to watch twice. In my opinion, Disney has set a pretty high standard with its past films (Ratatouille, Tangled, Cars, the list goes on and on) and this one doesn't even come close to that standard. Onward is way better than Wish, maybe check that one out instead if you haven't already and are in the mood for a Disney movie. Just my opinion! My bf and I both give this one a 6.5/10.",
    "96": "Disney's 100th celebration falls flat with \"Wish,\" a film that struggles to maintain its own identity in the beloved Disney animated canon.Unfortunately the problem with the film is the story is so underdeveloped and poorly executed. There are no stakes and the end result is a muddled theme, uneven pacing, and boring, flat characters. The film attempts to pay homage to older Disney classics and all the ingredients are there: lovable characters, a menacing, tongue-in cheek villain, cute animal sidekicks, and interesting concepts; but instead of \"showing\" the character beats like older films, we are \"told\" the story through bland dialogue and little action. Asha joins Disney's recent line of uninspiring \"adorkable\" female protagonists, with no defining motivations or character growth. This quirky, clumsy character archetype for Disney princesses has been recycled for the past decade with Rapunzel, Anna, Moana, and Mirabel. The animation and sound don't fair better, with bland, pop-y music that feels like filler and a combination of animation styles that look unpolished. There is no \"Be Our Guest,\" \"Part of your World,\" \"Let it Go\" or \"We Don't Talk about Bruno\".It's laughable that one of the lyrics to the song \"I'm a Star\" in the movie is \"in this universe we are all shareholders.\" Wish remains harmless entertainment for families but is a painful reminder of what this film sets out to do: please investors. This film is a rushed, soulless, by the numbers paint-job with no innovation in storytelling or animation. A massive disappointment to Disney's legacy and a poor excuse for their 100th animated film.",
    "97": "I think a lot of the hate for this movie is overblown. It's not the best thing Disney has done but it's far from the worst.Getting the negatives out of the way: despite the fairy tale setting, all the characters talk and act very modern. The second song (\"At All Costs\") really feels like they went Jukebox Musical for a bit as it's only tangentially connected with what's happening on screen. In fact all the songs have the weird quality that, while they sound good in themselves, they don't feel like they're from the same movie. For celebrating Disney's 100 years, I wish they'd included at least some traditional animation.But here's why I can't hate this film: I love the subtext of it. It's all about rebellion against stifling authority. And how the combined strength of the many can overcome even the most powerful evils. The defeat of the villain was one of my favorite moments of Disney in years. I just wish the movie lead up to it better.Perhaps it being the 100th anniversary movie put to many demands on it. So many little references to past movies went over my head while watching it. Even the obvious one of each of Asha's friends being a reference to one of the seven dwarfs. Maybe if they'd let the film be its own thing and not a celebration of all that had come before it would have been better.I recommend it. But don't set your expectations too high.",
    "98": "So what I believe Disney was doing with Wish was to tell kids not to spend their time wishing away their lives by consuming Disney products and movies. When you place your hopes and dreams into the hands of a power greater than you, such as corporate Disney, you become a slave to what they want serving only to make them more powerful and you weaker.It's a bizarrely subversive hit on themselves and done in such a way as to not make it interesting or fun enough for repeat viewing or to sell toys which is an additional hit on their shareholders who will be seeing massive intentional losses for the 8th movie in a row. This fits the current counter cultural rebels who have been running Disney behind the scenes for the last 3-4 years making sure nothing that comes out is a hit or at the very least moves products off of shelves.Is South Park right? I feel like they may know a lot more about what is really going on at Disney than anyone else at this point.You can probably just skip this one and just know that Disney is currently trying to blow up the mold of \"Wish Capitalism\" and remove itself from being such a huge part of generations of families. It's like the efforts to take control of oil companies just to run them into the ground at a huge loss but for the benefit of future generations. That is what Wish depicts in fairytale format.Disney over the last decade will at some point be a fascinating case study in American Consumer Culture and Counter Revolutionary Thought, and with this latest move I think Wish is setting itself up as the perfect teaching example.Wish is really brilliant but not in a way that families are going to want to watch - which in itself is the real point of the movie.",
    "99": "LIKES:The Animation\n-Disney knows how to make things flow, a studio that can capitalize on their swollen budget and invest in making such engaging movements.-Anatomical accuracy is captured well, animals moving about with correct form, only straying to human dimensions in a small amount when necessary.-It flows and moves in a poetic style, with a dynamic energy to match the magic being cast in this movie. And the color that goes with it starts to feel like something out of Fantasia in terms of splendor and flow.-All in all, the animation still continues to prove Disney's elite level of making the unreal come to life in a way, and give us a treat for the eyes.The Voice Work\n-Animation relies on voice actors to bring characters to life, and our crew has managed to bring a cornucopia of talent that helps this feat.-Tudyk is still as fun as ever. His versatility is incredible, this time making a baby goat with a smooth velvety voice his primary objective. He accomplished much with his direction, delivering some great lines to appeal to many ages.-Pine sounds like, well Pine. His voice is perfect for the illustrious king, very poignant, charming, exciting, and yet still holding hints of rough nature. He pretty much is playing a generic Disney role and doesn't quite have the flair, but also is no slouch.-DeRose as Asha is great. A modern princess take, with a sensational voice that shows control over emotion, pitch, and delivery, I liked the work she granted the latest princess.The Design\n-It's an odd style, but I liked the blend of 2d and 3d animation styles into this hybrid granting an almost cell-shaded game like approach.-It holds the smooth movements of computer, but the color and energy of the original 2-D style and I think it accomplishes much for the presentations this movie chose.-Is it weird? Yes! In a way though, it works, as a sort of catch all to help make things pop for all the styles integrated into this movie.The Music Songs Themselves... Mostly\n-Disney has proven they can make a big soundtrack with songs that top the charts in sales. Wish is another success, to some degree, in my book.-A style that feels one part rock opera and another part theatrical stage show, the movie has plenty of that composer feel to it and perhaps the more unique aspect of the film.-Ballads are powerful and expressive of their dreams, catchy and yet beautiful at the same time. While other songs hold more engagement with their visual numbers than the song alone.-The product is another collection of good numbers that may be more of the focus and goal than the story itself, but one in which avid Disney music lovers will fall and repeat for years to come.The Inspiration\n-Perhaps heavier than other films, Wish is packed with a lot of things to teach the lessons to motivate the audience to do great things.-The story itself is a bit preachy on this, trying to rub it in my face the importance of dreams and how to make them come true.-However, I appreciate the lesson, despite the presentation, and found that some of the other character arcs at least tried to tie to this and help push the story.-Add in the theatrical music and the animated drawing holding such powerful control of emotions, and I felt they accomplished the inspirational tone they were seeking.Star:\n-The ultimate merchandising in this movie, the cute little character is my favorite one of the film.-For not saying anything, the little guy has a lot of heart and character, his emoting by far some of the cutest aspects I've seen in a while and somehow the most diverse of the group.-He does so much with his little form, knitting, pranking, and somehow inspiring himself, he is an adorable movie wrapped in a small bundle, one to surely be exploited by the House of Mouse.The Easter Eggs\n-The movie is a big homage to the history of the studio, and well... it's probably the biggest focus of this movie, or at least bigger than they imagined.-Disney lovers are going to love finding all the references and inspiration in this movie, cameos galore sprinkled throughout for one to see, or in many cases listen, to what the writers wished to acknowledge.-Even the credits pay homage to the magic of the studios and what came before, a stunning finish with a song that helps add the ambience to fans like me who love the cartoons released over the 100 years.-And the End Credit scene holds a weighted tribute to the man who started it all, and while not necessarily the most mind blowing, it does soothe the heart and soul.DISLIKES:The Characters So Auxiliary\n-Outside of the goat and the star, most of the rest of the characters are rather plain, boring, and a dull reference and cultural card than anything else.-Most of the characters have a gimmick, but often used in the singing and comedic roles, with little else.-Given characters like Pumba, Mrs. Potts, and the Dwarves, you would think they can accomplish more than spitting out one-liners and a some very limited action moments that hold little weight.-Such a shame given the strong work that Disney was known for doing so long ago.Story\n-Outside of the inspiration, the story really doesn't hold any magic for me either.-A rather bland story of unoriginal tales, the unique factor is mediocre and just lacking the splendor the animation has.-I found the tale rushed, full of the bland challenges and weak development that really felt robbed like the wishes of the kingdom.-So much potential, but so lost to the music and hidden references that what we got was a quick, almost novella story that will be good for those with small attention spans.-Such a shame.Placement Of Music\n-Another gimmick feeling aspect, the music is again good, passionate, and magical, but the placement feels a very modern motif.-Previous films found the ideal place to put a song, or use it to convey thoughts, feelings, and storytelling that fans have dissected for years.-Wish felt like Frozen in a sense, lots of songs in one movie, weaker and filling space, seeming just odd to break out into song and dance. A little more tact might have made the song even more impressiveJokes Are Mediocre And Kiddish\n-What happened to the double entendre jokes, the clever puns and misunderstandings, or even the well-executed insults?-Wish has none of that for me. More so forced emotional delivery, kiddy emphasis on butts and spit, and sounding like a social media stars trying to quote a scene like the character and failing.-Only a few jokes escaped this style, but for the most part, I felt a lot of influencer vibes in the writing, which just isn't my style given the track record of this movie.Weaker Antagonist\n-This was sad given again the potential of Disney villains.-Maleficent, Scar, Gaston, and Rattigan, these and more had design, class, skills, and backing that made them so much fun to fight in the movies and games.-But Magnifico, outside of the design to look like his actor, is kind of lame. He's cunning sure, but that's it. No major groundbreaking moves, a rather tame use of his powers, and even a boring climactic fight did little to make him memorable.-It's not he's a bad character, just again, rushed and forgettable, lost in the flood of things crammed into about 80 minutes of actual movie.Overall Forgettable\n-The movie is unfortunately not the magnificent production this company promoted for the 100th anniversary.-It's a movie that feels too full of stuff, gimmicks, music, and references superseding the story and flow, to make a rather lacking film.-I see many of my friends enjoying this who are die hard Disney fans, young kids that are like them, or just all about singing songs and finding homage touching.-But for me, it needed more time, more planning, a better story and better use of these ideas to balance into the story and fully cast the Disney spell they can do.THE VERDICT:\nI'm sure you can guess, but Wish did not have the magic I had hoped it would have. While the animation and design are beautiful, and the voice acting helps bring some fun, the movie is really more about finding the hidden gems than actually telling that Disney feeling story. A rushed mess of mediocrity with weaker side characters, a boring antagonist and paying too many cards without planning, it feels like storytelling remains a tertiary objective for the House of Mouse.. At least the music, no matter how oddly placed, was able to maximize the inspiration and give you the hope that dreams can come true, just in time for the holiday season. Is this a go for the theater? In a way yes, the sound system does wonders for the music, and 3D could be fun as you ride the nostalgia with a star in the lead. But story and majestic wise... well... that might be best left for a home viewing.My scores are:\nAnimation/Adventure/Comedy: 6.5-7.0\nMovie Overall: 6.0.",
    "100": "In Wish, Disney honors their tradition, and at the same time adds a new movie to their catalogue of animated films. Wish is a nice movie, but lacks what makes Disney animated movies so special.In Wish, young Asha wishes on a star, and gets more than she bargained for when a star comes down to help her in her quest to defeat the evil king Magnifico.The greatest advantage the movie has is its gorgeous animation, the brushstrokes painted beautifully on the screen. It is a wondrous blend of hand-drawn animation and 3d animation, a la Spider-Man: Into the Spider-verse. I hope we get many more films animated in this style, as it is very relaxing and nice to look at.If only the story matched the visuals... An overly simple story lacks anything of substance. And yes, I'm taking into account that this is a kids movie. I sympathized with the villain (who did not begin the movie evil) in the beginning of the film, only for him to suddenly turn evil out of no where. The film also suffers from a horrifying over dependence on magic. The songs are very good, but they all sound about the same, which isn't a problem in the movie, but I can't imagine the music in this movie selling many CDs. I do have to give the voice actors some credit though. They didn't do anything award worthy, but they did an excellent job.That being said, while I watched this movie, I enjoyed it. The only reason I went to see it was to take my nephews. Disney has a rich history of making the greatest animated classics of all time. They have a proven formula that works, and I hope they either return to it in the future, or try something else besides Wish. It's a decent movie, but there's nothing memorable about it, and I don't expect it will be long before it is forgotten.",
    "101": "Disney's newest feature animated film celebrates their 100th-year anniversary! A lot of people have been criticizing this movie upon its release, saying it's overly generic and not as original as hoped for in celebrating 100 years of the Walt Disney Company. However, I think it's very good! Yes, there are some cookie-cutter and generic elements in the film, but it's not entirely a carbon copy of previous Disney films.The antagonist in this movie is revealed rather quickly; even from the very beginning, you know who the bad guy is and have a sense of how it will unfold. But I wouldn't say it's entirely unoriginal, as I've been hearing from many people. True, there are typical Disney songs with castles, kings, queens, and people making wishes upon a star, but I believe people have been overly critical due to recent disappointments with how the company has been managing things.Yes, I agree Disney hasn't been doing so well lately, but I don't think this movie is a bad addition to their tremendously successful catalog. I believe this movie truly holds the essence of emphasizing the importance of having wishes in your life but, more importantly, taking the necessary steps for your dreams to come true.There's been a lot of discussion about Disney's increased diversity in their cast nowadays, but I think it was a good fit for the new film. There were parts of this movie that honestly made me very emotional and pleased with its meaning and message because I've struggled in life to keep my dreams alive and well.Sure, there are talking animals and other Disney-esque elements thrown in, but the movie's meaning is what truly matters, and I think that's what people have been forgetting. I highly recommend people see this movie and not heed all the negativity. It's a good, clean, wholesome, and emotional family film that kids and everyone will enjoy, with meaningful and important messages about being honest with your dreams and never giving up on what you truly wish to become and more! Definitely check it out this holiday season!",
    "102": "Wish is a new animated film directed and partly written by Chris Buck and Fawn Veerasunthorn. Chris Buck has directed previous animations such as Frozen. This is only her first directorial work for Fawn Veerasunthorn, but she does have experience as a writer.Asha (voice of Ariana DeBosa) lives in the kingdom of Magnifico (voice of Chris Pine). As leader of his empire, he collects the dreams and wishes of the people and promises that he can make one of them come true.If Asha makes a wish when she sees a shooting star, this star will make her wish come true. With this star at her side, she tries to show the rest of the people that Magnifico is not an honest leader. His magical powers, which he uses to grant their wishes, are not the correct and only way to make wishes come true.With this film, Disney animation tries to celebrate its hundred years of existence and working on animated films. Despite this reason, unfortunately they have not created a special or unique animated film. This film quickly reminds you of many other films that Disney animation has made over the past hundred years. This film itself has little uniqueness. The film may be fun for younger audiences who are not yet familiar with Disney animated films, but older viewers who would go along with them may not enjoy this film as much.The animation style also tries to come across as if it comes from older animation, to celebrate the centenary. Apart from some creative animation, it unfortunately doesn't feel that special. The film can therefore seem somewhat standard or even boring. Most characters also come across as somewhat standard or even somewhat lifeless. Due to the large group of characters, most of them are given few opportunities to really stand out in the film. Asha's character is the most prominent because she is the main character of the film. Furthermore, Magnifico manages to steal the show as the more corrupt leader, because Chris Pine knows how to provide good voice acting. Alan Tudyk manages to provide some comic moments as a talking goat, but not enough to really make it something special. In other animation or other films he manages to provide more comic voice acting.",
    "103": "\"When You Wish Upon a Star\" is a Walt Disney company theme song, first heard in the 1940 animated classic \"Pinocchio.\" It became the company theme song in the 1950s and has been featured in the studio's motion-picture logo since the early 1980s. Steven Spielberg added fairy dust to the song's mythology when he mentioned playing it over the final moments of \"Close Encounters of the Third Kind.\" For Disney, \"When You Wish Upon a Star\" is more than an anthem; it's a symbol of corporate magic and the company's values. Disney's new animated musical, \"Wish,\" is a folk tale about wishes and their connection to stars. The movie is a theme park-ready illustration of Disney's 100th anniversary, as it self-consciously packs 85 years of animated magic into a portable Disney fable. The movie is a blend of pop history and Easter eggs, making it a symbol of the company's focus on itself. The movie's success may be seen as a summation, pastiche, or a Disney fable that launches the next Disney century or is stuck in the last one. The movie's success may be seen as a symbol of Disney's commitment to its own brand and its ability to create a unique and memorable experience for audiences. \"Wish\" is a Disney animated film that is particularly appealing to young children, as it is set in the magical kingdom of Rosas, a tropical island. The residents of the island have a wish, which they give to King Magnifico, a devilishly handsome sorcerer who rules the island and their dreams. When a wish is given to Magnifico, it becomes free and unremembered. The story explores the concept of wishes and their consequences, with the protagonist living without their wish, leaving their soul untroubled. The film is visually pleasing and eminently watchable, with a plot that is both mildly touching and slightly strange. The film is a delightful slice of enchanted product with a slightly strange plot. \"Wish\" is a film that explores the concept of wishes, a deep part of one's identity. The story follows 17-year-old Asha, a spunky idealist who learns that a wish is a symbol of her identity. She applies to become the emperor's apprentice and meets Magnifico, a coiffed goateed smoothie. Asha questions the \"Your wish is mine until I decide to give it back to you\" concept, which reveals Magnifico's true nature. He is a kind leader until his authority is questioned, revealing his inner authoritarian nature. The film is a metaphor for the era of corporate entertainment, where individual dreams are replaced by collective fantasy. The film is a ruthless corporate overlord crossed with Maleficent, and the first Disney villain with serious hair product use. \"Wish\" is a Disney animated film that follows Asha, a young girl who makes a powerful wish that lights up the night sky and makes every citizen of Rosas glow with warmth. The wish is a glowing yellow star named Star, who has real magic. Asha uses her pet goat, Valentino, as her magic wand to take on Magnifico, a demonic figure with extraordinary power. The movie revolves around Asha and her angelic Star vs. Magnifico and his green phosphorescent demonic light, with the fate of the island residents and their wishes hanging in the balance. The film, co-written by Jennifer Lee and executive produced by Allison Moore, is a more muted palette of blue, green, gray, pink, and lavender, creating a pleasing storybook texture. Chris Pine's punchy performance as Magnifico turns him into a volubly self-satisfied narcissist-dictator is a standout performance. The film is a testament to the power of imagination and the power of imagination in bringing stories to life.",
    "104": "People must be desperate to WISH for a good movie from Disney these days. It isn't here. Extremely shallow plot and story and truly cringe songwriting. The writers couldn't even bother to make anything rhyme when shoehorning in their messaging. Nothing to do with the actors, color and what not (don't even start), and all to do with poor writing. It's like Disney put a gun to someone's head and demanded a movie be created based on the \"When you wish upon a star\" Disney theme. If we find out in the news later that that someone likely will be found dead on the floor and that the script was actually AI-generated, I wouldn't be surprised at all. Disney is reaching new lows. Truly.As mentioned by many others, the plot is crazy thin, there is no inner struggle, no mistakes made, no heroes journey, no villain having any sort of depth. On the last note, they actually teased the villain having some sort of back story and justification, but almost as soon as they introduced some of his history and fears, it was swept away reminiscent to a proverbial rug pull straight into shallow villainy. How awesome would it have been if we could be somewhat torn and sympathetic to the idea that some wishes actually can be damaging to others/dangerous, as the movie insinuates for maybe 5 seconds before casting aside? Wow this could have been a decent story, but Disney chose to walk on eggshells. They can't please anyone these days so we must all be triple wrapped in cellophane and styrofoam and forced to watch a \"safe\" movie. They truly lost their touch. It's unfortunate (just in this one instance :D) that my kids really wanted to see this movie so I indulged them. Shame on them! (and me!) lol.",
    "105": "Not sure why the reviews are so low. This is another instant classic for Disney.The story structure was fresh yet nostalgic and highlights the importance of working hard to achieve your wishes. It was executed in an innovative and inventive new structure by utilizing a group of characters in its storytelling rather than just one or two main characters.The 2D/3D hybrid stylization of the sets and characters was unique and something I'd love to see more of from Disney, who very rarely makes changes to their animation and design style.The music has been stuck in my head for the last week since I saw it. Bringing in an outside singer/songwriter is something that Disney hasn't done in a while. Julia Michaels absolutely brought her best to this soundtrack.Honestly, I've found myself struggling to make it through Disney's last few animated features. However, I can't go an hour without thinking about when I'll get the chance to see Wish again. This film is right up there with Frozen, Beauty & The Beast, and the Lion King for me.",
    "106": "As a culmination of celebrating a hundred years of one the biggest studios ever, Wish doesn't compete with the classics it's constantly referencing. It is a really fun animated adventure that has all the greatest hits of a Disney animated movie whilst trying something new visually. Also it's just quite funny to see a Disney movie so clearly about unionising.Ariana DeBose is a phenomenal singer and in between ballads she brings a lot of endearing awkwardness and determination to Asha. Chris Pine revels in playing a proper Disney villain. No redeeming qualities, constantly sinking lower complimented by a great song that allows him to use an asset that's so rarely utilised.Chris Buck and Fawn Veerasunthorn greatest creative swing is the new animation style. It's probably the weakest out of all the recent ones that responded to Spider-verse but its storybook come to life approach still has lots of beauty to it whilst maintaining hints of the previous 3-D animation that dominated for so long.Like the rest of the film, the songs here are good without ever living up to the classics, they don't even really compete with something a lot more recent like Encanto. There's a couple that are pretty forgettable and three that are definitely a lot stronger so overall it's a majority positive success rate.",
    "107": "WishWho would have thought that a little cartoon studio founded by two Disney brothers would evolve as it has. 100 years later, a very heartfelt homage was made, and that homage is a film, fittingly, called Wish. I had the fortune of seeing it early, on Mickey and Minnie's 95th birthday, and the film started with a cute 1 minute or so birthday card to Mickey.Side note: I have Steamboat Willie playing on the TV while writing this.Regarding the film itself, Wish brings back the fairy tale book being opened; something I have always loved about the older films. But that wasn't the only thing that I started to notice. I will not spoil anything specific, but this is no ordinary film. Watch every detail. Listen to every note. Don't look away for even a second. This entire film was purposefully crafted for a release during the Disney 100 celebration, and it shows.This has replaced all other Disney creations as my favorite film of their entire catalog, but when you see it, you will understand why. I'm bouncing around my chair trying to portray my excitement and emotional response to the film without giving anything specific away. 100 years of animators, writers, directors, editors, voice actors, creative talent, all the people who dreamed it and then did it, this was a beautiful way to honor them.First see Once Upon a Studio on Disney+. Trust me.Go see Wish. Bring Kleenex. And stay until the credits are over.I know I wished upon a star tonight. And I have the strength and courage to shine as bright as that star.",
    "108": "Giving this an 9/10 ratingDid preview and Q&A with directors Chris Buck, Fawn Veerasunthorn, songwriter Julia Michaels, voice actor Ariana DeBose, producers Peter Del Vecho, Juan Pablo Reyes Lancaster Jones and writer/executive producer Jennifer Lee. They had a lot to say, after the film on stage.You must see this film in the cinema, first of, the picture is full wide screen, so it will lose all impact on tv for sure, it it the most beautiful looking film of the year, best looking animation too. This is Disney back on form. And it's 100 years so it had to be good, and it is.Ariana DeBose as Asha is pretty much perfect, and her songs, like all of them, really work well, Chris Pine must of loved this role as he pours his lungs out, as does Alan Tudyk, who is just plain good and multi talented. The whole cast must of worked hard and had fun too.Audio and visual, are spot on, the character designs and set pieces, the look and feel is new, and yet hark back to the old and are a stunning water colour look. Nothing feels done for the sake of it, it's the right length of time, very crisp, lots of laughs too.Will be seeing this at least another two or three times. It's simply brilliant,",
    "109": "I hate this movie with a burning passion. I would rather watch my 7 year old cousins puppet show about climate change and it's effect on the kitty-corns (unicorns that are also cats). The songs make my ears bleed, and the visuals make my eyes bleed. I recently had a tooth taken out, which took about 30 minutes, and it was extremely painful. I would rather go through that 40 times again than watch this pure garbage for a second more. What I find ridiculous is that people have been pleading with Disney to go back to 2D animation, since those movies are so much more interesting and engaging, but nope. What are they gaining from not listening to their fans? If you still think Wish is good, listen to.\"Friends on the Other Side\"from The Princess and the Frog, then listen to \"This is the Thanks I Get\" from Wish. Now listen to \"Mother Knows Best\" from Tangled. Then, \"Poor Unfortunate Souls\" from The Little Mermaid. Three of these villain songs are absolute masterpieces, and one is pure brain rot. Can you guess which? I think you can, if you're over the age of 6. I could go on about how much this movie sucks, but I have a life, so yeah.",
    "110": "Wow. Just wow. This was a wonderful movie that I enjoyed from beginning to end, and I have to say LOVED.I will definitely be watching this one again when it releases on Disney+ in December.Asha is charming, cute, and funny, and she takes the story to new heights.Valentino is hilarious, and I nearly cracked up in the theater when he said, \"I'm only three weeks old.\"\nMagnifico was fun to watch as you could see him turning more and more evil as the movie went on.Dahlia? She was hilarious and charming, Gabo was so funny, and Amaya...\nWell let's just say her happy ending is not what I expected at all!If I could change one thing about this movie, it would be that Magnifico turned good and was forgiven, because he was just a nice person who was tempted by dark magic.See Wish in theaters today.",
    "111": "To start off, I have to say this rating is getting a boost for the following reasons:No sexuality\nNo politics\nNo ideologiesThe story is very predictable for an adult, but the way everything gets resolved isn't. Because there is magic, you're expecting something magical, which is not \"technically\" the case.Our heroine is a good person trying to do good for others for non selfish reasons.Our antagonist is a very typical trying to do the wrong things for the right reasons and eventually is seduced by power.And in the end, what trumps evil is a very basic human need that we sometimes give up.All in all it was a great movie with a good moral to the story and the music was great.",
    "112": "First, I want to say that I am not a bot, and I really do not care what some people say. I thought \"Wish\" was a great Disney film. Too bad I had heard it performed poorly at the box office, especially on the studio's 100th anniversary. At least the story is original; of course, it sets the origin of wishing on a star. Again, this is the first review I've ever written about an animated movie that was made in 2023.The story takes place in a kingdom where the sorcerer King Magnifico grants wishes to the citizens. Asha, the protagonist, hopes to become the king's apprentice and fulfill her grandfather's wish. However, she discovers King Magnifico is not who he seems and obliterates their memories, making them apathetic. Frustrated that her family wasn't convinced about the king's deceit, Asha makes a desperate wish to the heavens, summoning an actual star, which to me looked almost like the little star character from The Care Bears. I wouldn't tell you any more, of course, as there would be spoilers.There are too many references that are true, but I love this movie from start to finish, and as I usually mention in my reviews, I don't have a favorite scene. Also, I'm not even sure which character I like best at the moment-Asha, perhaps. All things considered, I still believe that this is a fantastic animated movie for Disney's 100th anniversary. And let us hope that the studio will emerge from their \"box-office slum.\"",
    "113": "(SUMMARY)\nI was forced to watch Disney's Wish on Thanksgiving w/ my family at my local AMC movie theater. Seeing it once was enough. I definitely wouldn't have seen it on my own. Honestly, it's just a \"nothing\" movie. It's not good, but it's not bad either. It's overly simplistic, hollow, & above all, safe. There's no real character growth, nothing really gets done/accomplished, & there isn't a good message or key takeaway. It's just a forgettable movie that feels like it was made specifically to occupy toddlers/children & not a movie for families of all ages.( + POSITIVES)\n1) New I. P. -- A new original I. P. w/ a sort of newish story. Disney has been creatively bankrupt & stuck simply doing live-action remakes, so it's a good thing to see them branching out & trying something new!2) 2D Art/Animation -- I'm happy that they attempted to recreate that magical 2D Art & Animation Style of Disney's Renaissance Era.( - NEGATIVES)\n1) Lack of Care & Quality -- It permeates every single stage & aspect of this movie. You can clearly tell that Disney cut corners, cut costs, & didn't care about producing & delivering a high-quality product that they are proud of. They could have attempted to push the bar & try to deliver something bigger & better, but they didn't.2) Missing Opening Short -- Given that this movie was meant to be THE thing celebrating 100 Years of Animation, it would have been smart to take a page out of Pixar & include an animated short at the beginning of the movie. Oh...I don't know...like their \"Once Upon a Studio\" Short?3) Art & Animation Style -- Wish comes across like the studio couldn't decide on the style they actually wanted to go w/, so they went w/ a hybrid 2D/3D style that just looks ...off. The watercolor backgrounds make the end product look like it was made to be on a Disney Junior tv show catering to 1-5-year-olds. The locals, backgrounds, colors, lighting, imagery, etc. Just seem a bit dull & washed out when compared to Disney's other recent animated I. P. like Encanto & Moana, or even older I. P. like Treasure Planet or The Lion King.4) Music & Songs -- Credit where due, the vocalists are good! However, Wish is trying less to emulate masterful orchestral scores & award-winning musical theater numbers of old, & more Top Pop 100. Additionally, the movie's song lyrics were clearly created by AI & the attempt at rhyming is terrible!5) The \"Princess,\" Asha -- Unfortunately, Asha's a bland, boring, & forgettable cookie-cutter \"princess.\" She follows the same Adorkable & Quirky archetype as Rapunzel, Anna, Moana, & Mirabelle (although they had reasons for being that way). Her dress/costume is unsellable.6) Who's actually the Hero/Villian? -- The \"Villain,\" King Magnifico, comes across not only as pragmatic, but the films actual lead. This only further hits home when you consider his charismatic personality, his early rationale, actions, & goals, despite being portrayed as \"evil\". While on the other hand the \"Hero,\" Asha, actually comes across as the villain of the story based on her ignorance & end-goal. Furthermore, it seems two different teams worked on King Magnifico.7) Animal Supporting Characters -- ...Valentino. That he even talked at all & it was a VA casting mismatch. He was far too much (in a bad way). From his dialogue lines, his comedy, & his baby costume. \"Star\" was just a discount Lumos from the Mario Nintendo franchise.8) Side/Background Characters -- Unremarkable & forgettable. Especially Asha's seven friends.9) The Magic System -- Magic needs a story for how & why it exists in any given franchise or universe, along w/ a set of rules governing how & why that magic is used. Wish's magic is far too open, vague, & nondescript.10) Comedy -- It was boring, childish, & fell flat.11) Easter Eggs -- I don't think the team working on this movie understands the term \"Easter Egg.\" It's meant to be a subtle nod to past works through hidden details & meanings that an audience probably won't see or get the first time they watch the movie. But in Wish, these \"Easter Eggs\" are flat-out thrown in the audience's faces or blatantly pointed out & told to the audience.12) Bad Ending -- The ending was...not good. The \"villain\" was literally defeated by singing. The Queen, who supposedly loves her husband, just throws him away in jail without a care or second thought. It was like the team working on this movie was also just done with everything & no longer cared.13) Bad/Missing Message -- First, Wish has already been done before & done better with Pinocchio & Aladdin. Second, it teaches the wrong things. The truth is that not all wishes deserve to be heard & granted. Some people wish for benevolent (unselfish/positive/helpful) things, & others wish for malevolent (selfish/negative/hurtful) things. Furthermore, some wishes are meant to be self-obtained through hard work & dedication, as when we finally obtain them, they mean that much more to us.",
    "114": "Personally, as someone who was looking forward to this film for weeks, I'm so disappointed. Its another one of those movies where the concepts and ideas are so interesting, cool and unique, but the execution was terrible. The idea of a wishing star come to life is so interesting, but it barely causes many conflicts in the movie. Asha, who interestingly feels so reminiscent of other princesses but has no real character arc or journey, like the other famous Disney princesses. The side characters are just there, and Gabo was irritating me throughout the film\nTheres nothing notable about most of it. Not good, not bad, thoroughly average. I liked some songs and thats about the only positive I can give it\nI agree with the audience that it should have been a cautionary tale on what would happen if all the wishes were granted, but instead what we get is so bland, generic and soulless with a predictable villain takeAnd for a 100th year anniversary, It had the potential to become a cult classic, but just ends up being disappointing and not good enough.",
    "115": "Animation movies is by far my favourite gender and I never miss any at the cinema.I have genuinely never shivered from cringe watching an animation Disney movie, until I watched \"Wish\"What is this movie's message? What's the relation of the characters? Why was it made? Why didn't I reflect on the story or learned from it?I miss the times when Disney movies made you understand a profound life lesson. Or to be a better person like the main characters growth in their journey. The movie that made you regret blinking. And as a child, used by your parents to remind you how to act and behave with others.It's all gone. This is extremely sad.",
    "116": "After 100 years of producing revolutionary and timeless animated content for the whole world to see, Walt Disney Animation Studios has now released their 62nd feature film Wish. Intended to be somewhat of a mythos behind the famous wishing star popularized by the studio's national anthem, the film was initially hyped up as a gorgeous tribute to the company's 100th year of stardom. Unfortunately, not only has it been failing at the box office, but critics and audiences are not so warm to it as other Disney features in recent years. So where exactly did the film miss the mark despite its initial promise?Set in a Mediterranean kingdom of Rosas, the film tells the story on a 17-year-old girl named Asha who pleas to the stars in desperation. This causes a living, magic star to fall from the sky that ends up attracting the wicked attention of Rosas' evil ruler Magnifico. At its heart, Wish seems to be a throwback to Disney's roots of emulating a classic fairy tale, complete with a Broadway approach to its music. Not to mention, the film's main theme of wishing for your hopes and dreams to come true is exactly what the Disney company was built on, and there is a genuine battle between good and evil thanks to the presence of Magnifico alone. That being said, despite making a divine character out of a wishing star, there isn't much luster to the magic that the film builds up beyond talking animals and colorful whimsy. One would think a lot of magnificent imagery would come to life in a film like this, and yet it plays itself too safe with what should have had a lot more imagination on display. If there's one thing to wish for regarding the movie, it's for one last possible concise rewrite.As far as the characters go, Asha is easily the most believable character in the film thanks to her sincere aspirations for wishes to come true, even if the adorkable Disney female lead has long overstayed its welcome. While Magnifico is a delightful presence thanks to Chris Pine's gleefully charismatic performance, his initial motivations to protect wishes for his own sake ends up taking a bizarrely dark turn out of nowhere. What could have been a genuinely thought provoking antagonist ends up becoming power hungry for the sake of it. That all said and done, nobody else is worth mentioning, as Asha's friends are merely stock side characters that progress the plot because it feels like the script told them to, and Magnifico's wife Amaya's role in the film is so predictable that it feels like it came out of nowhere. Also, just because Alan Tudyk is in your Disney movie does not mean he's going to deliver funny dialogue, especially for an obnoxious goat with horribly out of place commentary. Nobody in this film is downright hatable, but outside of the leads, you may find it hard to gain much substance out of them.What's interesting to note about the music is that the film features musical numbers by modern singer / songwriters Julia Michaels, Benjamin Rice and JP Saxe to compose the songs, and it really shows in that the soundtrack seems to go for a trendy pop song approach as opposed to standard musical theater. While these people are talented in their own right, their aesthetic was not the right fit for the traditional story this film is attempting to tell, and they are most evident in Magnifico's solo number This is the Thanks I Get?, Asha's personal piece This Wish and At All Costs. The best song in the whole film might be the reprisal for This Wish since it does unify everyone together to bring the main message home, and the melodies are beautiful enough in their own right. It's really saying how weak the songs are when they feel like lower tier versions of better songs we've heard in other Disney films, down to the opening number Welcome to Rosas making one wish they were watching Encanto instead. Why Disney didn't just get their top tier songwriters from the past is beyond me.Now despite some pretty disappointing elements at play, the film is not completely mediocre since it at least has its heart in the right place. Of course it should go without saying that the Disney studio should have pushed for this film to be hand-drawn at all costs, but the attempt at a watercolor style art direction does actually work in its favor. Thanks to the hard work of the animation crew, the typical CG Disney look is elevated with a fairly stylized touch that makes the picture come to life as a moving fairy tale. The effects are simply breathtaking and there is a lot of solid choreography on display, even if some of it is trying too hard to replicate the snappy beats of Lin Manuel Miranda's contributions to Disney animation. Also, David Metzger's score truly captures the beauty and intensity of the entire story far better than the plot ever had a chance to do so. If there's anything to take home from the film outside of its serious flaws, at least there was a lot of passion put into the film at a time when the studio was and is still facing creative turmoil, regardless if it's merely visual or story wise.So in the end, Wish is an average affair that doesn't quite live up to the mouse house's 100th anniversary, but it certainly didn't need to be either. On top of the far better tribute Once Upon a Studio, there are a lot more reasons to celebrate the company's century long presence. No matter how good, bad or meh the product may be, this year could not be a better time to wish upon a star. Wish may not live on to be one of the more memorable Disney films in later years, but it will at least mark somewhat of a historical landmark when the oldest animation studio still running hit its triumphant pique.",
    "117": "This movie is a great example of everything that is wrong with not just Disney, but the entertainment industry as a whole.The emphasis is now on pleasing the minority with box ticking over quality writing and characterisation.Wish is a terrible film, cobbled together with a seriously warped idea of what is good and bad as well as a blatant advert for the merch that is based on this movie, much of it on sale long before the movie's release so people will spend money before realising what a forgettable dud the actual movie is.I will no longer waste money going to the theatre or pay for streaming on any movie under the Disney banner, which includes Marvel, Star Wars and Pixar as recent experiences have shown this era is much worse than the Disney era of the 70s and 80s until The Little Mermaid paved the way for a second golden era of Disney animation.I can't even bother relating any of the plot as it is a 100% box ticker pleaser, but, the problem is most of us find box ticking entertainment boring and lazy. And, quite frankly, the quality of the actual animation is atrocious and distracting. I've seen better quality animation on YouTube made by students.Avoid.",
    "118": "Basically a rehash of Snow White wrapped up in a Disney commercial.It has a great song! It's has beautiful animation! Asha's voice is great and Chris Pine is a good villain.It's has all the pieces but it just doesn't add up.The story has no heart and is vague. No real background info. Nothing interesting or new. Besides the main song, all the others fell flat.And although Asha's song is great, her personality is nothing special. She's a young woman who loves her family; and a little quirky. Like a copy cat Mirabel or Rapunzel.Nothing special about her really. Which is a shame.Felt like a low budget Disney channel special with a HUGE promotional budget for some reason.Hey Disney: it's seems like your best movies are the least promoted. Stop shoving mediocre content down our throats and support other stories like Elemental and Encanto.",
    "119": "First of all the whole movie it's self has no catchy songs and I had no attachment to any of the characters. The comedy in this movie is cheesy and not really funny. Asha (the protagonist) has the exact same quirky annoying personality as all the other leading female protagonist recently and Disney just needs to give characters unique personality's. All of the characters in the movie I found annoying and un likable. Throughout the whole plot I had no interest to keep watching there wasn't really an interesting plot. Alll the songs were terrible. Disney was trying to hard to make them cool and modern songs but ultimately they just sucked. Also I feel Disney was trying so hard to promote itself by using the correct color theme and made a few Disney references in the film. Finally, i have nothing wrong with lead confident independent female roles but that's all Disney is giving us lately. I get that Disney doesn't want the princess to be dependent on men but they don't have to make it like that. They can make the confident and independent princess and tie in a love story because some of the best Disney movies have love in them. Anyway i hope Disney can learn from this movie and possibly improve and make the movie everyone has been asking for.",
    "120": "Wish tells the story of Asha(Ariana DeBose). Asha makes a wish upon a star & gets an answer beyond her wildest imagination. A chaotic but well-intentioned star, joins her from the sky, in response to her wish.Wish is a good film. However, directors Chris Buck & Fawn Veerasunthorn should have given us a masterpiece, since Disney has completed hundred years, as a studio. The story is very generic & though there are fun Easter eggs referencing all of Disney's previous movies, it doesn't have the unforgettable quality of Disney films like, The Lion King(1994), Tarzan(1999), Wreck-It Ralph(2012) & Frozen(2013), just to name a few. The humor is a bit hit-and-miss. The emotional scenes are on point. The animation is breathtaking & comes to life in 3D. Some songs are good, while others are average. The vocal performances are the highlight of the movie. Ariana DeBose is spectacular as Asha. Chris Pine is outstanding as Magnifico. Alan Tudyk is impressive as Valentino. The supporting cast is excellent. Wish is worth a watch for Disney fans. Just don't expect a perfect film & it should be a fun watch for the whole family.",
    "121": "Just Got out of a Wish Screening.Man, I love this Film, it's a Beautiful Story and The Writing and Execution of the Writing was Excellent. It's a Perfect Film (For Me Anyway) -Potential Gripes people will have a Problem with -1. \"Ashas' Friends are not Fleshed out Characters\", to me this is fine, they didn't need to be Fleshed out, to me the Story was all about Asha, Magnifico and the Oppression of Rosas.2. \"That Tragedy that Magnifico Speaks of is never mentioned again\", to me this didn't need to be expanded upon. In my opinion, it served as some Background Noise for why the Kingdom of Rosas was Founded.ðŸ’• I Love this Film, it has a Story of a Ruler who Has Ultimate Power but Really he's Oppressing the People of Rosas by them thinking that one day they would actually get their Wish Granted and that's just not the case. He put them into Spiritual Slavery with the Vast Majority of their Hopes and Dreams Being Crushed by never Fulfilling Them.And Even in the End Fight, that Manifests when he has the People of Rosas Tied up into Physical Slavery with the Green Things Holding them in Place.ðŸ’šIf you notice, he also has the Wishes Encased in this Blue Ball ðŸ”® when the Wishes are free, they have this See through Blue Look. To me, this means Their Wishes were Held Captive.ðŸ’­ðŸ’˜ Yes, there is a Point that the people of Rosas don't want to work for their Dream Because it's too hard, they basically want a Free Handout BUT the Bottom Line is, this King Magnifico is for the very most part (excuse the pun) Selling People a Dream.ðŸŽ¨ Also, I liked the Art style of the Film and I also liked Some of the Songs.The Plight of Rosas -1. ðŸ‘‘ King Magnifico, who founded the Kingdom of Rosas, is the One Person in Rosas who can Grant Wishes.2. ðŸ‘ª The Population of Rosas seem to Trust Magnifico and are all Waiting for their Wish to be Granted by a Mass Ceremony Held, for 1 Wish for 1 Person to be Granted each Ceremony.3. ðŸ˜› We come to find out that Magnifico will only Grant Wishes that aren't in anyway a Threat to His Kingdom, his Motivations aren't necessarily Evil but he isn't about Looking Out for other people. He has a way of ruling his Kingdom that unfortunately isn't that of a Benevolent Leader.4. âœ¨Then we have Asha, who like everybody else, thinks Magnifico is a Great Leader, but once she finds out the Truth of the Matter, in a Great Song, she Wishes Upon a Star â­ that Her Father Taught Her that everyone is Connected to the Stars. This Star has Special Powers and Assists Asha with Different Things.5. ðŸ˜  Magnifico is Alerted to this Strange Light that Appears in the Sky. He takes this as a Sign. And asks the Population of Rosas to tell him if they hear anything of this Strange Light. The Population agrees but they also start to Question Magnifico.6. ðŸ“’ Magnifico Eventually starts to Get Desperate. His Wife Warns Him about Using the Forbidden Magic Book.7. ðŸ’šâ­ In the Final Showdown, Magnifico Gains even More power than the Forbidden Magic Book because of an Added Power in his Green Magic ðŸ’šâ­8. I won't spoil the Ending. ðŸ˜‰9. In Summary, what Magnifico started with Rosas was always going to be a Dilemma, and in turn, it almost turned into an absolute Disaster.ðŸŒ Overall, it was A Beautiful Story âœ¨",
    "122": "As someone who grew up with Disney back at the 90's, I was extremely hyped to see this centennial anniversary film after Once Upon A Studio. Once I saw it though, it came across as disappointing than magical. Not saying it's awful or anything, but considering Disney has been around for a century creating mostly good content, this could've been so much better.The story had a good concept about wishes becoming reality and could've provided an emotional core, but the majority of the movie relies too much on references from the past Disney films (which I won't go into full detail) instead of having it's own identity. Which is exactly why Puss in Boots: The Last Wish did a way better job with it's own concept of the wishing star because it fleshed out not only Puss's character arc about overcoming his fear of death, but the side characters as well.The pacing is weirdly inconsistent considering it's 95 minute runtime which results in scenes that haven't been set up properly and the editing is choppy. Then, there's the biggest problem with the movie. The musical numbers and they left a lot to be desired. The instrumental score is OK for the most part and the singing is good from everyone involved, but the lyrics were so hackneyed and don't rhyme at all.That being said, there are some good things I liked in this movie. The references, while too self-reliant, are cute enough, the voice acting including Ariana DeBose, Alan Tudyk, and Chris Pine brought some charm to their otherwise one-dimensional shallow character roles, there are some dumb moments that did make me laugh and as I said before, the singing in the musical numbers is so good. The best part, however, is the animation and it's so unique as a centennial anniversary movie. It's blend of CGI animation and watercolor animation makes it all look beautiful especially with the character designs and backgrounds.Overall, Wish could've made for a magical experience and a great anniversary movie, but instead it came across as disappointing and lazy in terms of it's execution. It's only watchable just for the animation, but to those who want a better anniversary, go watch Once Upon A Studio. 5/10.",
    "123": "I could forgive the questionable sensibilities that went into making Wish if it were entertaining, but it rarely is. I liked the aesthetic of the film, how it was designed to look exactly like a book of fairy tales. I also liked the color palette and its emphasis on pastel blues and purples. Unfortunately, everything about the movie underwhelms. The songs are mediocre at best. As the plucky Disney heroine, Asha has no journey or defining characteristics. Magnifico's motivations are murky and his descent into megalomania is puzzling. The omnipresent callbacks to other Disney animated films don't pay off because they're rarely used as the basis for jokes. For example, if you're going to have magic mushrooms ala Alice in Wonderland, they should say or do something funny. Ariana DeBose is fine as Asha, but she could sing the phone book and be entertaining. Chris Pine does what he can with Magnifico, but he's facing the same insurmountable hurdle as every other voice actor in this film. All of the characters are one-dimensional and uninteresting. This movie should serve as exhibit A for Disney to not greenlight movies that are obviously underdeveloped, or at the very least stop cannibalizing their own legacy. Not Recommended.Detroitcineaste dot net.",
    "124": "Wish feels like an amalgam of a few different Disney movies and I mean that in no good way. The script just feels so basic and without any kind of real voice that the film feels like a poor imitation of Disney at its best without capturing any of its magic.Ariana DeBois as Asha is a really likeable and endearing character, I loved the talking goat (even if talking animals are another cliche this movie exploits) and I really loved the storybook style animation. While I don't think I'll be humming any of them a week from now, I pretty much liked all of the musical numbers which were extremely well performed. I thought the fact that Chris Pine's villain was so cartoonishly evil was a bit charming but the character as a whole just felt really underdeveloped. There's the seed of an interesting origin for him but it's never built upon and since the whole wish concept as a whole feels so underdeveloped I wouldn't really say I was that interested in any of his actions either.But he's only one out of a whole cast full of forgettable characters. The writing here is really poor and the word that comes to mind when describing it is lazy especially in the character department. They just seem to flip flop in their traits and motivation whenever the story needs some kind of progression. There are so many plot contrivances and conveniences that it actually started to really annoy me and made my eyes roll. There's a whole magic star character that acts purely as a Deux Ex Machina whose actual entrance into the story is never properly explained. The plot is chock full of things we've so in so many other Disney movies and the 3rd act climaxes with yet another \"we have to work together\" moment we've seen a 100 times before.A recurring problems I've had with Disney and Pixar films is the fact that they never seem to take their time. So often their plot beats just seem sped through so quickly for fear of losing the child audience's attention. I've noticed this a lot in their modern work but even in the films of theirs I grew up watching. Wish had this problem to a degree in that the actual story and conflict are set up are so rushed through but after the 1st act the whole thing just grinds to a halt. There's no real sense of stakes or momentum I just found it so boring as a result.The natural counter argument to all this is that this film is catered towards kids but I don't think there's any valid point in that argument. The reason I love so many of Disney's animated movies is in part because of childhood nostalgia but more than that it was realising how intelligent and well written they were when I watched them through adult eyes. Wish doesn't have any clever or interesting execution of it's themes. There's a good message about the need to follow your dreams and desires but it's buried in the derivative slog that Wish is as a viewing experience. I'm sure plenty kids will enjoy it and many of them will look back on it with nostalgia but even if I'd seen it at that age I can't imagine any part of it aging well for me.",
    "125": "My wife and I watched Wish (2023) in 3D at the theaters last night. The storyline follows a young lady whose father has passed away, and she now resides with her mom and 100-year-old grandfather. In their town, everyone is allowed to make one wish which is stored in the kingdom, and once a year, the king grants one person's wish. The young lady endeavors to convince the king to grant her dying grandfather's one wish. When met with resistance from the king, she decides to take matters into her own hands.Co-directed by Chris Buck (Frozen) and Fawn Veerasunthorn (directorial debut), the movie features the voices of Ariana DeBose (West Side Story), Chris Pine (Star Trek), Alan Tudyk (Rogue One), Victor Garber (The Flash), and Evan Peters (Dahmer).While my wife and I thoroughly enjoyed Wish last night, we found the film a bit uneven. The storyline, with its potential, great characters, and interesting circumstances, left me wishing for a darker villain and more dire circumstances to heighten the level of desperation. The society and backdrop are somewhat underdeveloped. However, the animation, songs, and 3D effects were top-notch. The baby goat steals the show with a solid 10/10 performance - I could watch an entire movie centered around him.In conclusion, Wish felt like a blend of Frozen and The Emperor's New Groove in many ways, though it didn't quite reach the same level. I would give it a score of 6/10 and strongly recommend it.",
    "126": "Absolutely! Here's a rephrased, more detailed version:Amidst the collective yearning for a cinematic marvel, the latest offering from Disney has left audiences fervently desiring a more substantive and engaging experience. The narrative presented feels as shallow as a whisper, lacking the intricate depth expected from such a renowned studio. This cinematic endeavor, while adorned with vibrant colors and proficient performances, tragically succumbs to the weight of its own uninspired storytelling.The overarching storyline, akin to a mirage in a desert, lacks the substance to satiate the thirst for a compelling narrative. The craftsmanship behind the songs, a hallmark of Disney's past, sadly falls short, lacking the lyrical finesse and cohesion expected, thereby rendering them cringe-worthy in their execution. It seems the writers, in their pursuit of messaging, disregarded the art of lyrical harmony, leaving audiences bereft of the enchantment synonymous with Disney melodies.Remarkably, the issue does not lie within the realm of performances or visual allure but rather in the script's deficiencies. It's as if Disney orchestrated a mandate to fashion a film solely around the thematic essence of \"When You Wish Upon a Star,\" neglecting the critical facets essential for a resonating cinematic journey.Critically noted is the lack of a robust narrative arc, where the absence of inner conflict, character fallibility, and a multifaceted antagonist diminishes the potential for an immersive storytelling experience. Although glimpses of depth in the villain's backstory tantalize audiences, these fleeting moments are swiftly relegated to the periphery, denying viewers the opportunity to grapple with the complexities of morality and consequence.The potential for a compelling exploration of the collateral damage inherent in wishes is, regrettably, only fleetingly teased, leaving audiences yearning for a more profound examination of this thought-provoking theme. Alas, this promising avenue is abruptly abandoned, contributing to a sense of missed opportunity within the narrative's confines.Regrettably, this cinematic endeavor treads cautiously, perhaps excessively so, avoiding the risk of provocation or contemplation. Disney, a purveyor of wonder and imagination, seems to have relinquished its intrepid spirit in favor of a perceived 'safe' narrative, inadvertently stifling the potential for thought-provoking discourse.Despite this cinematic misstep, the allure of the Disney brand remains steadfast. However, the palpable disappointment stemming from this endeavor remains a stark reminder of the studio's fallibility. As an ardent supporter of their creations, it's disheartening to witness this departure from their customary brilliance.In a gesture of familial indulgence, I acquiesced to my children's eagerness to witness this cinematic offering, only to find myself echoing the sentiments of many others-disappointed, yet hopeful for a return to the hallmark excellence Disney is renowned for.",
    "127": "Set in the beautiful kingdom of Rosas, I found Wish to be an enchanting and fascinating movie with amazing singing and really funny characters!Asha (Ariana DeBose) lives in Rosas where a sorcerer king named Magnifico (Chris Pine), and a queen named Amaya (Angelique Cabral) rule. Asha also has a cute sidekick, a goat named Valentino (Alan Tudyk). Magnifico has a special power which is the ability to grant wishes. Young Asha makes a wish so powerful that it's answered by a cosmic force, a ball of boundless energy called Star. With Star's help, Asha is able to save her kingdom from the evil king and prove that magic things can happen.Rosas is a beautifully animated town where people always have fun. However, the setting sometimes looks rather flat, uncharacteristic of the lively Disney animation I am l so used to. Sometimes the secondary characters look like they are all wearing the same clothes and they don't have much impact to the story. Ariana DeBose's singing is so spectacular; you can hear the power and the emotion in her voice. Chris Pine is a great voice actor for Magnifico because you can hear the difference between when Magnifico is the good king vs when he plays the \"Evil sorcerer.\" Alan Tudyk is really funny and is perfect for the role of Valentino! The little Star is super cute and lively, making me laugh out loud! Wish was especially made for the 100th anniversary of Disney Studios and meets KIDSFIRST! Criteria. I loved the interesting story and the many great songs. Disney is also launching a new Wish Together campaign with their decade's long partnership with Make-a-Wish Foundation with the release of this movie.The film reminds us to never give up following our passion because when we do, we lose the light inside ourselves and we forget what we are living for. When somebody pushes us down, that is the time that we have to do our best to stand up to them because we have the light and power within each of us. We also are reminded that we are always stronger when we stand together. When Asha is defeated by Magnifico, she starts singing a powerful song which moves everyone to sing with her and they defeat Magnifico together.I give Wish 4 out of 5 stars and recommend it for ages 8 to18, plus adults. It is available in theaters now. By Avani M., KIDS FIRST!",
    "128": ".........another miss from the critics? Yes. Another victim of their overindulgence. To be fair, they never said it was bad, they're claiming that the movie offered too little, that a compelling plot took a backseat to fan service. The same criticism Mario received.The animation style is stunning; it was matte and gave off old Disney vibes. The dialogue flowed and didn't seem forced; the humor was passing & effective, the villain was the cartoonish type, the type fans were hankering for. But the star is Ariana Debose; this girl shines on the screen as an actress and compel with her voice in animation.The songs were exactly what I wanted: not the old Disney-style, but actual poppy insightful songs; Julia Michaels scored big. I'm A Star is a favorite of mine, maybe cause I'm a nerd. The way these animated \"everything\" were answering Asha's question as to how can Star do what he does. Remember how early in the universe there were only starts, these then exploded to supernovas that catapult matter in the universe, that condenses into planets and everything on it. So you and I are practically star, there's your answer, Asha.Great family value.",
    "129": "Its ultimately an average movie. Terrible by disney standards, but by fine by standalone standards. The animation is pretty meh, even when disney tries it they still dont get how to make animated movies with stylized art styles. The 3d models look unfinished, theres several shots in the film where theres a noticable lack of shadows, and also the 3d character models just clash with the 2d backgrounds. They just dont look close enough to actually give the illusiong that theyre actually there. Also the story is pretty forced, a lot of the conflict doesnt have much to justify it, the villain just does things for little to no motivation. Theres hardly anything at stake here and you dont have much of a reason to care about what happens to the characters. Now the movie does have its upsides at least, most of the songs were well made with good ryhm to it, and since this movie exists to celibrate disneys 100th anniversary they added a bunch of little references to their pervious (and also better) works.Overall its ok, if you want to see a movie just to have an excuse to have a fun time at the theater itll do the job. But its nothing too special.",
    "130": "The movie begins with about twelve minutes of straight exposition about the magical kingdom the heroine lives in and its benevolent magical king, and how when you're 18, the King takes your dream from you and then randomly grants subjects those wishes, which they've forgotten. This put me on guard. Children's movies should start out simply: there's a baby deer born in the forest, or an ogre everyone wishes to kill. If the story teller wishes to elaborate, or play with our assumptions, that's all part of the game, and even small children recognize these tropes, like the five-year-old daughter of friends. We were at a performance of TTWELFTH NIGHT, and when Beatrice and Benedict start arguing, she turned to her parents and asked \"They fall in love, don't they?\"Kids understand these things, despite the confusion of people who think that Elmer Fudd trying to shoot Bugs Bunny would cause me to shoot my brother. I understood the difference between a cartoon rabbit and my brother, and we fought constantly, which my parents understood. This is why we had no fire arms in the house, and knives were kept out of our reach.I seem to digress, but I do not. On discovering that the King has no intention of granting her aged grandfather's wish because it is too vague and might easily be dangerous, she immediately concludes the King is Evil, and wishes on a star, which comes down and grants wishes totally at random. Animals -- particularly her pet goat -- and flowers speak. The King asks his loyal subjects for helping finding out who did this. They ask for a little clarity, so he goes to his library, opens some Evil Magical Books, and, well, you know how this will turn out.WISH is probably the most lazily written children's fairy tale I have encountered in the movies. The jokes are variations on other Disney cartoon features, the songs are all strident anthems about the characters' feelings, and all the male characters are evil, ancient, or emotionally compromised and hence useless. Is it necessary to make men the villains in the name of Feminine Empowerment? Is all male authority corrupt, while women are always kind and helpful?No. I think Disney is simply telling the story they believe their audience wishes to hear. I have no doubt that the parents and guardians of many small children think things like this are what their children should hear, but it is neither the story I wanted to hear when I was a child, nor did it teach me anything useful: that the world is a dangerous place, and you need to be wary, but help can come from unexpected directions, and it's not a miracle or magic. It's just people.",
    "131": "This movie was AMAZING! Everyone complained we haven't gotten a solid badguy...well here he is! Magnifico was an original badguy we've all been waiting for.Yes, there could have been some things that were better, but no movie will ever be perfect.Some things I didn't like:\n1. CON: I feel like they were trying to \"represent\" all of her friends and it ended up being a mess. They're all different ethnicities and it seemed forced. And another thing, why is Asha the \"prettiest\" out of the friend group? Seemed kinda eh to me.2: PRO It really made a good friend group. They were all funny and represented the 7 dwarves which was unique IMO.1. CON: There are no GOOD heartfelt moments. If we would have seen her dad in the first part, MAYBE it would have helped. She's saving her people and not a specific person so it's kind of bland.2. PRO: Asha is a very strong minded person. Even though she is awkward, she speaks up for herself and doesn't let anything get past her unlike some other Disney characters in the past.The songs are AMAZING. The least one I liked with the first one \"Welcome to Rosas\". That one is more of a filler song. \"I'm a star\" is also a filler, but it's fun, just more on the bottom of my favorites.I absolutely loved \"This is the Thanks I get\" \"This Wish\" and \"At all Costs(the most underrated song imo)\"\nThe song I loved the most was \"Knowing what I know now\" that one gave me SHIVERS!! They did super well on that one.I give the movie 9/10. Honestly if the friend group was different I think I'd give it a 10. I don't like when they force stuff like that in these newer movies.",
    "132": "Wish, a movie about a magic kingdom where there is a king who is magic and grants wishes, is a movie made to celebrate the 100th anniversary of disney. The film is overall pretty funny leaving nice laughs for the whole family, however it feels lackluster and has a weak story as well as feeling the same as every other Disney movie.The movie overall has a good animation with fun scenes and fun Easter eggs relating to other movies made. However the movie alone, is not significant at all. It is extremely fast paced and feels like every other movie ever made. It has characters similar to EVERY MOVIE, similar music, which wasn't catchy at all, just generic Disney. Compare the music from the movie to the soundtrack in Encanto or some other similar Disney movie and it just isn't anything special.Overall the movie was not that great. Sure it is fun enough and is a good kids movie but it really doesn't feel special.",
    "133": "I AM SO TIRED OF SEEING SO MUCH HATE ON THIS FILM. I finally took my three-year-old son to see it this afternoon, and while the animation took a little getting used to, it still left me in tears. It had plenty of Easter eggs from movies over the last 100 years, and it was beautiful. I stated the animation took some used to getting to because it did. Certain parts did feel a little rushed and incomplete, but it was still beautiful and entertaining. I have read review after review dissing this film. I can tell you why... PEOPLE ON HERE EXCEPTED TOO DAMN MUCH. This film gave just the right amount of everything. If you were to walk-in with the mindset of a child, rather than a bitterhearted grown up, you would have seen it in a different light and maybe actually enjoyed it. I don't write reviews often UNLESS I am upset or moved enough to do so. Wish was beautiful and unlike all you wannabe critics, even Roger Ebert said it was a classic Disney film. Granted it is not the most spectacular of compliments but at least he was classy about it. Anyway, I loved it and would see it again. People on here are just setting expectations way too damn high.",
    "134": "Before you ask, yes, I am aware that this is a children's movie... but that's no excuse to make something not so great. And this is from someone who thinks filmmaking is an art form.I went into Disney's 100th anniversary movie with fairly low expectations and felt rather curious to see if it's any good... it wasn't imo. Nothing made me laugh or smile, but nothing made me angry or frustrated...Instead, I felt nothing. Does this mean I hate the movie? No. It's just generic stuff that just didn't entertain me. The songs (especially the lyrics) weren't that good; for example, This Is The Thanks I Get is something I don't count as a villain song, but is a guilty pleasure of mine, because it is a bit catchy.The animation had potential, but it kind of looked... off. I don't know, it's mainly the character designs, etc (the 2D worked amazingly with Once Upon A Studio).The story didn't do much for me, the characters were... \"eh\" (although King Magnifico is the best part), the goat wasn't funny... yeah, that's how I can describe it.Wish is a \"nothing\" movie and a disappointment to a 100 year anniversary film, but if you love it, then I'm glad you did. I simply didn't...Disney may have tried, but I wish it could've been better.",
    "135": "Honest review here (Yes I'm not a bot. I'm a very real person). Starting off for the first 20-30,mins of the movie I found myself thinking \"What am I even watching\", but to my surprise I liked it more and more as time went on. I found I liked this movie quite a bit after about an hour or so after I had left the theatre, it's one of those movies that gets better with time. Is this going to be that movie that captures hold of your attention from the title drop to the credits? No it is not but that's ok, I'd rather have a movie that starts out slow and boring and ends great compared to the other way. I'll admit the first few songs I was annoyed with and didn't think they were any good but I was actually loving them later on, the later songs are much better in my opinion. Is this the best Disney movie (Mulan 1998) ever? No. Is this the worst Disney movie (Home on the range 2004) ever? Major no, this is closer to the good movies than it is to the bottom in my view. This honestly isn't a bad movie, I don't know what all the 1-3 star reviews are for, that's Chicken Little territory and trust me this movie is 10x better than that dumpster fire. Give this movie a fair chance and you will be surprised, take my advice and opinion for what it's worth, about 10 cents. I liked it. Definitely worth a watch.",
    "136": "I was expecting Disney released a great movie for their 100 years anniversary but this is considered one of the worst animation movie Disney ever released.At first, I didn't believed on the movie reviewers said on Tiktok and other social medias, but when I watched it, yes, it was bad.The movie is quite fast paced, bad plot and writing. All the characters have no emotion, annoying and I feel so bored when watching this movie at cinema.This movie feels so bland and uninspired.Another thing is the soundtrack of this movie. It's really hurt my ears, non-catchy and forgettable songs. There's nothing special or good about the songs.I've come to realisation that Disney already lost their magic. There's no magic when I watched this movie. It feels like this movie is written by AI instead of human.Absolutely disappointed.",
    "137": "With her grandpa hitting his hundredth birthday, the precocious young \"Asha\" hopes that the King, keeper of all of the wishes made by the islanders in their idyllic home, will agree to make his long-forgotten dream come true. Coincidentally, he is also looking for a special assistant and she is up for the job! A chance to kill two birds with one stone sees her in the royal presence and in the course of her pitch, she jumps the gun and implores the king to grant her grandfather's wish. His prevarication causes us all to begin to smell a rat - is the benevolent king really all he seems to be? She leaves disappointed and in desperation makes a wish of her own - but on a star, this time. It decides to leave the heavens and come and help her on her quest to release all the trapped wishes and free the kingdom from it's increasingly menacing monarch... It's an OK animation this, but the story is really quite thin with characters that don't much ignite the imagination - except, perhaps, the goat \"Valentino\" who has easily the best of what little comedy there is in the rather earnest script. The creatively entitled \"The Wish\" is the standard power ballad amongst the really quite unremarkable soundtrack that you just know is desperate to get to Leigh Harline's Disney theme tune \"When You Wish Upon a Star\" at the end. It's an amalgam of a few stories and will probably keep the youngsters entertained first time around. There's not a great deal for the grown ups, though, and I'm not sure it will be remembered for long into this animator's second century.",
    "138": "Disney's newest animated film, made to commemorate the company's 100th anniversary, is a charming film that reminds its audience what makes Disney so special - and that Wish doesn't have that magic. The film is definitely enjoyable, but not the landmark it's trying to be. It seems to exist only to remind you of better Disney animated movies. Its whole story is based on Disney easter eggs that - while fun - make the film feel hollow. And I didn't even hate the movie, it's not terrible by any means and is actually quite likeable - I just wish it was more. I wish I could have come out saying we have a new Disney classic, with gorgeous animation, loveable characters, and memorable songs. Truthfully, I don't think we got any of that with Wish. I never felt any heart as the movie was lacking the emotional resonance that Disney Animation is best known for. It has the plot of a classic Disney fairytale and none of the soul. The story was predictable and the characters all seemed to be developed based on traits of other popular Disney characters. Again, it's not a bad movie per se, but the film's arbitrary world-building, unappealing animation, and bland protagonist make this a forgettable watch.Usually, I can come out of a Disney movie and at least say the animation was gorgeous... but here... I didn't love it. I thought the combination of the 3D CGI animation of recent Disney movies with the more classic, hand-drawn, watercolour style was an interesting idea that just didn't work. And yes, it did look like you were entering a storybook at times but at others it just looked...iffy. I get what they were going for, with an optimistic attempt to uncover innovation with tradition, and I appreciate the risk. Yet, it yields a flickering result. They should have just either continued with the 3D style (which usually looks gorgeous) or gone back to the old style of their classic films completely, as this hybrid style felt a little cheap and gimmicky.And the songs... while they aren't bad (\"This Wish\" is quite excellent) they are nowhere near the caliber of other Disney musical songs. Why? Well because Disney hired someone who had never written a musical before... they hired a pop artist. In some cases this would work... but personally, I think it would have turned out better if they brought in the Frozen songwriters or even Lin-Manuel Miranda who killed it with Moana and Encanto. Artists who know how to structure a musical and write songs that convey so much story, character, and emotion in just a few lines. As an example... I bet we all know the songs \"Let it Go\" or \"You're Welcome\"... but I doubt anyone will be singing \"This Wish\", or \"This is the Thanks I Get\" years down the line.Still, it's an enjoyable, charming movie! I cannot understate that! Despite all its flaws, it's still infectiously likeable... just not loveable. It is not a terrible movie by any means, just not a fantastic one! Ariana DeBose's stunning voice and Chris Pine's wicked performance give it necessary life and its tale of societal resistance against a selfish ruler is admirable. But it's just not as fresh or exciting as it wishes to be. Those easter eggs were fun though... it definitely is one of the most \"Disney\" movies ever made.",
    "139": "Had this film been made by another animation studio I'm sure people would be a little more accepting. Unfortunately for a film marking such an important milestone not just in Disney's history but in the history of movies, the film doesn't quite hit the mark.It's difficult to exactly define the problem. It's nicely animated, has a typical Disney cute animal (the goat Valentino) and a fairly easy to follow story. However with the exception of a couple of songs, none of the music is terribly memorable and will be forgotten quite quickly, unlike Disneys previous animated film, Encanto from just two years previously. Also the heroine. Asha, is physically reminiscent of the character of Pocahontas from the 1995 Disney animated film of the same name.The animation is pretty standard as is the script, with moments of humour spread throughout. But something is lacking that prevents the film from being memorable. Everything is so by the numbers as if a tick box check list was used. The script isn't sharp enough, the songs don't shine and even Chris Pine's voicing of the villain tries hard to keep the film alive but its not enough. Perhaps its because the film lacks surprises or truly memorable moments or perhaps its trying too hard to be self referential to the Disney legacy.I was going to say that if this was say, a Dreamworks film then this would be more acceptable but even Dreamworks can come up with mini masterpieces like this years Puss in Boots: The Last Wish, a film that manages to be both more original and witty than this.The Disney company, including Pixar and Marvel, have been knocking out some lacklustre films over the past couple of years, in fact too many. To make it worse they have also been expensive to make and the public have been indifferent about them leaving them to flounder at the box office. This is going to be yet another $200 million film that may barely scrape back its outlay. The aforementioned Puss in Boots sequel cost about half the budget of this film and was a better film. Encanto was less expensive than this film and had the benefit of great songs and a stronger story that allowed for repeated viewing. Disney have got to realise that throwing money at a production is no guarantee it will turn out to be great. Maybe they should try making a film with a reduced budget but a script that has fresh ideas and more wit and humour than we have here. It gives me no pleasure in saying that but on the evidence on display here is one of concern. The film is not a disaster but this is no classic either, just very average.",
    "140": "This film ultimately felt like a cheap swipe at previous Disney films- it's littered with shallow callbacks and jokes that just miss the mark. It feels too preoccupied at times of harkening back to what disney once was instead of attempting to be something new with the old spirit.The animation style attempted to harmoniously join the old 2D watercolor with the new 3D rigs, but unfortunately simply looked unfinished and borderline ameture, especially when compared with projects such as Spider Verse, Mitchells vs the Machines, and Arcane, which successfully blend the two mediums in a much more professional way.The songs were clearly written with the intent of being played on the radio or as standalone music videos, and didn't match the pacing or attempted style of the film at all, and violently juxtaposed the orchestral score which jarred the audience out of the immersion each time they were introduced.The writing and characters felt lazy and unfinished, with Asha's motives and personality being very predictable, as they are almost identical with the heroines before her (Anna, Rapunzel, Mirabel, Moana). Magnifico is a definite villain, which is fun to see, but he is also a large caricature of the villains before him. He is a frankensteined mix of the Animated villain of the past, but with none of their edge or flair. He is an average and forgettable adversary, especially when compared with his predecessors.Pine and DeBose's performances were good, and the dynamic of Asha's friend group was fun to see, despite the fact that each of her friends seemed like they'd make a far more interesting protagonist than her. Both were often balms for the otherwise lackluster and disappointing film.But however underwhelmed I was from an analytical standpoint, I can see how this film with its bright colours and in-your-face message of self love would be enjoyable for children, just not perhaps the parents watching. This is a real downgrade from Disney's previous works which were enjoyed by both adults and children alike.A film for kids, not the whole family.",
    "141": "This was the perfect movie to honor the legacy of Disney films. I don't understand these low ratings and poor reviews. It makes me wonder if these people actually saw the movie. The jokes were funny, the songs were catchy, and the characters were likable. My only complaint is the movie wasn't long enough. I wanted more! Please see the movie for yourself and make your own judgement.Some thoughts from a Disney super fan...the animation style resembled Disney's style from early on. The animation was truly beautiful and some of the best they've done in recent years. I also loved their nod to the classics by placing hidden easter eggs throughout the film. Some are more obvious than others, but it was fun to try and spot them as I was watching.Wish is beautiful and comes with a great story and message. Do yourself a favor and take the time to see this movie!",
    "142": "Over the course of the year, the Disney 100 anniversary has been in full swing. This film is the peak of this celebration, with everything building to its release. A lot of careful thought was put into this movie with intentional references to many of the Disney classics. These small easter eggs are fun for both kids and adults to find scattered throughout the film.While there is a lot to love about \"Wish\", the best part of this movie is the music. The soundtrack is full of powerful songs written by Grammy-nominated songwriter Julia Michaels. \"This Wish\" has quickly become a favorite in our house, with my daughters singing it on repeat.Disney has been at the forefront of cutting-edge animation since their first release. Unfortunately, the animation in this film is a bit half-baked and seems cheap. There were moments where the movie felt like a Disney Channel cartoon (i.e., \"Sofia the First\" or \"Elena of Avalor\") rather than a centennial celebration.While the lead character, Asha, has a strong identity and purpose, the rest of the characters fall flat. The scenes with her group of friends are uninteresting and their attempts at humor do not land. Even the animal sidekick, a goat named Valentino, is forgettable and unamusing.\"Wish\" does an admirable job at paying homage to the 61 Disney movies that came before it. While it does not quite live up to the high expectations, the movie is a fun adventure for the whole family. Asha is a powerful protagonist, the music is top-tier and the climactic third act does not disappoint.Best Character: Asha\nBest Scene: The Reprise\nBest Song: \"This Wish\". Honorable mention to \"At All Costs\"Written for the Gunnison Gazette.",
    "143": "Tbh, I do not get the amount of hate for this movie. It's a pretty decent movie, actually better than a few other Disney animation movies released this past few years.The animation style was bad at first (especially the transition and the fast pacing of the storyline made it weird) but eventually fine with it as progressed. The original songs are not instant hits but grew on me the more I tuned into them.Both King Magnifico & Asha were great and compelling characters. Love Magnifico but he's not a good representation of a great villain for me. Lacks motivation and focus. Asha was relatable and very reminiscent of the Rapunzel. Meanwhile, the side characters were just meh, unnecessary for the plotting.The scripts/writings were indeed bad but not as severe as portrayed by others. The world-building was amazing. The mascots were cute but won't be memorable in a long time. Full of unnecessary easter eggs/references. The scores were amazing.Great movie for streaming and great voice castings. Perfect for children and young audiences. Recommended.",
    "144": "Tbh i do not get the amount of the hates for this movie. Its a p pretty decent movie, actually better than few other disney animation movies released this past few years.The animation style was bad at first (especially the transition and the fast pacing of the storyline made it weird) but eventually fine with it as progress. The original songs are not instant hits but totally grew on me the more i tune into it.Both King Magnifico & Asha were really great and compelling characters. Love Magnifico but he's not a good representation of a great villain for me. Lacks motivation and focus. Asha was relatable and very reminiscene of the rapunzel. Meanwhile, theside characters were just meh, totally unnecessary for the poltting.The scripts/writings were indeed bad but not as severe as potrayed by others. The world building was amazing. The mascots were cute but wont be memorable in a long time. Full with unnecessary easter eggs/referrences. The scores were amazing.Great movie for streaming and great voice castings. Perfect for childrens and young audiences. Recommended.",
    "145": "While this is another worthy disney animation flick which follows the classic disney traditional animation formula still it lacks the magic the older classic films had like snowhite, cinderella and others.First of all the majority of the songs used in this film are average at best and disappointing and that is a huge minor for the film.Excluding the main song which also we hear at the end of the film when all they stand together to defeat the evil king which was a nice song indeed all other songs are a failure and forgettable.Apart from that we get no serious reasons why the king acts the way he does.He is just evil out of nowhere.Plot is very simple and they should do better with that.Also there's no love story no prince no nothing.Still......u will enjoy the film it has great special effects (200 millions the budget) and it uses the usual disney formula a rehash of snowhite some might say but with lesser magic in it.Maybe that was one reason the movie was a flop in it's opening weekend in USA with just 30 millions and with that huge budget disney may lose many millions if the film won't recover soon.Anyhow if u love the older disney films u should check this too. It's worth your time but certainly is not one of disney's best efforts.Grade // B-",
    "146": "Wish was everything I've been wishing for from Disney.Was is a perfect film no nor a masterpiece but what it was. Was good old fashioned Disney entertainment.People who give negative reviews about wish are just setting the bar too high and expecting too much.I went in cautiously optimistic and I had a blast.I won't spoil anything major here but I can say it has a compelling villain and a strong protagonist.The songs weren't brilliant but they were very catchy and the animation style was stunning and enchanting.I've longed for a proper Disney animated musical like we used to get and this film made me feel very nostalgic for those movies.We get the story book opening and ending.We get the classic main protagonist I want song.We get talking, singing and dancing animals.We get a compelling and dare I say sexy villain.What more can you want, really wish is Disney pure and simple.A great way to celebrate their one hundredth anniversary.If you just want to sit back and forget about your troubles and have fun.Then this is the movie for you.",
    "147": "I'll start with the good. I didn't think the music was bad. The vocal performances were great. There were some good songs and I really loved \"Knowing what I know now.\"I enjoyed the animation, especially the use of colors to depict interior motives and changes of the characters. The design of the characters and the settings were really pretty.There were some funny parts with the characters and the characters were enjoyable and somewhat relatable.My two year old was locked in the whole time and so that is an added bonus.Now the things I struggled with. I felt all the characters needed a lot more development. I never felt like I knew any of them beyond what they delivered in their lines. We barely got to know any back stories and I felt the characters arcs had very minimal effort put into them.The writing was funny at times, but for the most part it fell very flat to me, I don't think it was the acting. It just felt like they wrote the dialogue and interactions to be very face value and didn't try to have any deeper meaning to it.The whole story felt incredibly rushed. As if someone said you have a good story here, let's just produce it into a movie and leave it at that. The pace of the film went very fast and like I said before the characters needed a lot more development.I think what makes Pixar so great in the past is the powerful emotions they're able to convey with the characters and their experiences in the story, and I didn't get much of that in this story.All in all my daughter enjoyed it and that's important, so I give it a 6/10.",
    "148": "I went into the theater completely unmoved by any trailer or marketing made in effort to promote this movie. I had no preconceptions-- no real expectations. I had seen no spoilers except those offered by the trailers. Besides this being Disney's big 100 year movie, and that a lot seemed to riding on it, I knew almost nothing about it. That's all to say: my mind wasn't made up when I watched it.It's a classic Disney concept of a homemade fairytale.I actually really enjoyed it. The characters and the songs were great-- the story was good. The premise was good. The bottom line is that I thought it was enjoyable.I won't pretend that this movie was perfect, but not a lot of movies are. The pacing was lacking; there were scenes that made my husband and I wonder what made them keep it-- but I had a good time. Isn't that what matters? Going to the movies and having a good time?I've seen bad reviews and bad criticism after watching Wish-- some I believe is completely unwarranted. It's not Frozen-- its not very close. It's not the best movie Disney has ever made but it sure isn't even close to being the worst. It made my husband cry. The kid behind us said it was the best movie he had ever seen. What I'm trying to say is just give it a shot. Go into it and if you don't like it, that's fine. Just don't decide you hate it before you see it.",
    "149": "I'd like to start off by saying this movie was quite bad for disneys 100 years anniversary movie but that's not to say that it was necessarily bad for a Disney movie. The animation was certainly unique and honestly looked quite cool. Visually, the whole thing was quite pleasing even if sometimes everything felt a bit choppy. It certainly suited the movie.King magnifico. I definitely liked king magnifico as a character. His character design itself was pretty character and would have been great as a side character. I didn't like king magnifico as a main antagonist. Disney is really leaning into the good intentions wrong execution style of villian, which isn't necessarily a bad thing but it shouldn't be used for every movie. They need a villian that's purely selfish and evil and stuff. Like I don't think they've killed a villian in 13 years.This movie reeked of writers strike. The plot was extremely predictable and a lot of the script itself wasn't great. Most characters were pretty insufferable especially the stereotypical talking animal was so much worse than usual. When the soundtrack came out a lot of people were complaining about \"the thanks I get\" and while I thought it was pretty good I can see why. Two reasons. Firstly I 100 percent believe that ai had a part in the script of this movie because i refuse to believe a human put desperate time require desperate measures in a song. Secondly the lin manuel mirandafication of disney. Lin manuel miranda has had a really big impact on the musical industry and you can clearly an attempt to replicate his distinct style in this movie. And with the exception of one or two songs it fails miserably. But Arianna de bose sang her little heart out and I'm glad for that.Overall this movie definitely wasn't as bad as people say and I probably would recommend it but like Jesus christ it was lazy especially for as monumental as it should have been. 7/10."
}