{
    "0": "Seen this classic so many times and never ceases to get old. With a bunch of great scenery, adorableness, original vibes, and comedy! Macaulay Culkin shined so much, he deserved the millions earned for his role. I love how Joe Pesci went from Scorsese films where he swore so much where as in this he had to bite his tongue. John Hughe was a gifted writer that helmed some gems!",
    "1": "Oh, come on, IMDb users. How could this film get only a 6.5? Yes, it's a kid's movie, but I know plenty of adults(not including myself) who loved this film. It touches our hearts, and tickles our funny bones. Not to mention I think in one way or another we could relate to it. That's why it remains a classic Christmas comedy.Home Alone is not only one of the highest box office successes of all time, but it deserves more praise. Mac showed a talent that very little child stars have now-a-days. He brought in a great comedy about a boy who accidentally is left home alone when his family goes on vacation and takes on two burglars.Yeah, it's quit unrealistic about the burglars, but honestly, this is a terrific family film. Joe Pesci and Daniel Stern are the perfect comedy duo of two idiots who can't rob the place because a 8 year old child has out witted them and set some clever and very funny traps around the house.Please give this movie a chance, it's just terrific and I guarantee nothing but great laughs for you and the whole family.10/10",
    "2": "\"Home Alone\" is a hilarious film about a young boy (Macaulay Culkin) who is accidently left home during the Christmas holidays after the rest of his family goes to Europe.  At first Culkin loves the situation, but soon he is scared to death when he learns that burglars Joe Pesci and Daniel Stern are targeting his house.  However, Culkin is pretty smart for an eight-year-old and he has plans for them when they attack.  Chris Columbus' direction is smart and so is the over-achieving screenplay.  This film has a little bit of something for everyone and the fact that the backdrop is the Christmas holidays, only makes it that much more special.  All the performers do well and in the end the film also does.  4 stars out of 5.",
    "3": "But don't forget about the presence of Stern and Pesci as bumbling comedic antagonists as Culkin is Kevin. As he is sent to his room after his jerk of a brother blames him for a mistake.And that Kevin is left behind after the family were trying to make it to France there. But at first he loves having the house to himself, eats pizza, and does things that he would not have to do.But when he misses his family there. After an old man played by the late Roberts Blossom there is meant to be scary but in reality he is a kind old man just misunderstood there.He has to protect the house while trying to get his family back home. Really a good start in MacCulay Culkin's career.",
    "4": "Angels with Filthy Souls...when I first saw Home Alone I thought this black and white gangster movie that inspires Kevin was a real movie!! But I recently found out it wasn't, and much effort into making the clip as authentic as possible. Vanity Fair did a great write-up of the making of Angels of Filthy Souls in the article \"Inside the Making of ​ Home Alone​'s Fake Gangster Movie\" by Darryn King, which was published online on 22 Dec '15.Sure, Home Alone may not fit into the traditional canon (no girl wistfully wishing for a house on 34th Street) but it's one of my favorite Christmas movies next to Die Hard of course. In a way, Home Alone and Die Hard share similar themes of survival against the vicious criminals, with the hero using his wits and ingenuity to fight back and ensure the crooks get their just desserts.",
    "5": "I like the bit when he slaps on aftershave and then screams.",
    "6": "The first 2 movies will always be my favourite just like for most people these movies never get old still love watching them even today",
    "7": "I watch this movie when it's not even winter or Christmas, it's just such an enjoyable film to watch and if you don't at least appreciate it you do not understand the art of film. The highest grossing movie of 1990, and at the time the third highest grossing movie of all time, this movie had a lot of potential. But it was slammed by critics, although audiences seemed to enjoy it, and those exact same critics hating on it back then call it a \"Christmas classic\" nowadays.If you didn't know and have been living under a rock for a large percentage of your life, Home Alone is a story about a kid who hates his parents and always thinks they're out to get him and make him seem like the bad guy when he's really not. We see Kevin get discriminated by his family and everyone else around him and can't stand seeing him get tortured by his family. This movie is so damn quotable, nearly every line Kevin says I say on a daily basis, \"When I grow up and get married I'm living alone, you hear me?! I'm living alone, I'm living alone!!\"\nKevin wishes his family would disappear and we're sort of on the same path as him, the next day he sleeps in and completely forgets the family's trip to France which leads to, \"I made my family disappear\". What is so terrific about Joe Pesci's performance were his restrictions, he wasn't in a Martin Scorsese movie where he could say all the swear words under the blue moon, he was in a family movie which meant he could not swear and the exact same year Home Alone came out 2 months after Goodfellas, which shows how diverse Joe Pesci is.Is there anything I can say about this movie that hasn't already been said? It's a holiday classic, it's my favourite winter themed movie, my favourite Christmas movie, and my favourite performance from a child actor until Hugo came around. Grade: A+",
    "8": "This type of family comedy truthfully works better if you are grown up with the stooges.  Because this film has a climactic scene with more slapstick than most can take.  I can though.  But if you think this is strictly a kids film, parents will like it too I bet. The plot follows a kid (Macaulay Kulkin) who gets left behind in a Chicago suburb while his family leaves for Paris.  And though the house is all his, 2 burglars (Joe Pesci and Daniel Stern who give the best on-screen duo of 1990) want the house.  But not without the climax.  While most of the film is unbelievable (both good and bad), most of the film should keep families in good spirits, unless parents don't enjoy seeing Pesci getting his head on fire and Stern screaming like a girl.  Funny, even if it's not John Hughes' (writer/producer here) best.  B+",
    "9": "Home Alone is arguably one of the funniest movies ever! Its really good. The cast is very good! It was sweet to see John Candy in it! The team work of Joe Pesci and Daniel Stern is just not insanely hilarious but its also incredible that the two are so good together and I like how their scenes of punishment is followed right after the other! I think John Heard looks like Bruce Willis! I like Catherine O'Hara, she is a fine actress! Look for Larry Hankin and Roberts Blossom! John Williams has another great score here!This is a perfect movie for people to watch around Christmas and if you need a big laugh watch this as it will crack you up! Also, I strongly recommend Home Alone 2! It arguably funnier then this plus Time Curry, Brenda Fricker, and Rod Sell appears in it! Both movies are strongly recommended!",
    "10": "Christmas favourite, every year! Good acting, storyline, funny and heart warming",
    "11": "This is one of my favourite films but I have read that a new version is to be filmed in early 2020. NOooooooooo! It does not need to be remade. It stands the test of time and is as funny now as it was on its release.",
    "12": "Home Alone was made by the last half-hour of that movie. Not that the rest of the movie wasn't good, it's just that the end was so spectacular. Till this day the most memorable parts of the movie are the traps Kevin (Macaulay Culkin) set for the thieves. They were ingenious, effective, hilarious, and timeless. My daughter laughed at the same things I laughed at 29 years ago.",
    "13": "Home Alone (1990) Rating: 8/10It might be dumb and corny, but I've actually liked this highly entertaining flick. The plot's unbelievable, but who cares: it's funny! Macaulay Culkin plays 8 year-old Kevin, a misunderstood kid who lives in a big ass house with his family. They're about to leave for Paris, where they're gonna spend Christmas. About 20 people are running around the house, frenetically preparing for the trip. Kevin's mad at everyone, because no one pays attention to him, unless it's to yell at him. Hence, Kevin goes to sleep wishing that his whole family would disappear, and the next morning, they do! The thing is that they somehow woke up late, left home in a hurry, and hey, they forget Lil Kev! At first, he's happy as a monkey, but after a while, things get messy. Two dumbass robbers are planning to rob his house, but Kev ain't gonna let them!Okay, I know, this is one stupid story, but it's developed into a wonderful family film, as enjoyable as it is warmhearted. Mac Culkin is awesome in the lead. He really carries the film: he's got style, he's funny and he's even a good actor! Too bad his personal life screwed up, because he had the talent to become a grown-up movie star. The idiotic criminals are also really cool, because they cast good actors instead of some Ernest-style lame-o over-actors. Oscar-winner Joe Pesci and Daniel Stern (the narrator on The Wonder Years) are hilarious, but they also bring a bit more depth to what could have been cardboard characters. Pesci plays an aggressive thug, and anyone who's seen him in a Scorsese film knows how good he is at it. Stern plays a total dufus, and he's also really convincing at it. The film's humor might seem dumb, but hey, it's funny. John Hughes' screenplay has Kevin protecting his home by turning the thieves into human Wile E. Coyotes, and like the cartoon, it made me laugh. The gags might be old, but they're played with inventiveness, and the acting is always right. I just love this film, and you will too if you look beyond the fact that it's a family film.",
    "14": "If you like a really good family film at Christmas, then there's a big difference, there is no family in this film (or at least for most of it). The McCallister family are preparing a Christmas holiday to Paris. The night before they leave the youngest child of the family causes trouble and is sent to bed early. He wishes that the family would disappear. The next morning, the family leave and realise when they are in Paris that they have forgot one thing, Kevin (Golden Globe nominated Macaulay Culkin)! Kevin now has all the fun that he wants. Only problem is that two crooks Harry and Marv (Joe Pesci and Daniel Stern) are trying to get into the large house to loot it. This is just wonderful for goofy live action gags, kids entertainment and Christmas fun. Also starring John Heard as Peter McCallister, Roberts Blossom as Marley and Catherine O'Hara as Kate McCallister. It was nominated for the Oscars for Best Music for John Williams and Best Song for \"Somewhere in My Memory\", it won the British Comedy Award for Best Comedy Film, and it was nominated the Golden Globe for Best Motion Picture - Comedy/Musical. It was number 22 on The 100 Greatest Family Films, and it was number 17 on The 100 Greatest Christmas Moments. Very good!",
    "15": "I'm a young adult, and not a huge fan of the kids movies these days. Some people would classify this as a kids movie, but I think it's more of a classic. I grew up seeing this on TV every winter, and it's still one of my favorites. The sequels are awful, as are most sequels...but the original Home Alone is fantastic. I STILL laugh when I watch it. It's really one of those \"feel good\" movies, the kind that make you want to cuddle up on the couch with family and relax and enjoy it.If you haven't seen it yet, you're missing out on a great Christmas movie. Heck, it's even great for a rainy day. Watch it, you'll love it! I wish it were on more often!",
    "16": "Always mentioned in the Top 1 or 2 Christmas films of all time, Home Alone is not only hilarious and still highly rewatchable after thirty years, but it's easy to forget this film was carried effortlessly by then ten year old Macauley Culkin. Stern and Pesci are brilliant and O'Hara beautifully subtle as the polar opposite to Moira Schitt. Sensational 9/10.",
    "17": "Home Alone has a rather thin plot but makes up for it with all that cartoon-like violence. Joe Pesci and Daniel Stern give wonderful performances and are the best thing in this movie. Macaulay Culkin is an okay actor, nothing special, but okay. Home Alone is best watched during the holidays. That is when it can be most enjoyed.",
    "18": "Home Alone is a nostalgic film for me, having watched it religiously when I was a young kid growing up. Roger Ebert gave this film a 2.5 out of 4. He calls the film unrealistic and says that it goes in another direction from the original premise.Home Alone plays on the scary scenario every kid fears at some point in their life. Kevin McCallister (Macaulay Culkin) is forgotten at home in Chicago when his family rushes off to the airport for their trip to Paris. Soon after, Kevin is visited by home invaders Marv (Daniel Stern) and Harry (Joe Pesci) and it's up to him to stop them.Ebert complains that this film deviates from the main premise and simply brings in stunt doubles and fills the film with wacky traps that would otherwise cost the McCallister's tens of thousands of dollars to accomplish what Kevin does. While this is not far from the true, you're supposed to suspend some disbelief when watching this.I enjoy Home Alone because an 8-year old handles two grown up burglars. I don't enjoy watching people getting hurt, but I think in this case, there is an exception. The moral of the story is that even when you're young, you can still be responsible and handle your home from being invaded. It shows that it's wrong to rob people and that even children can be heroes.However, I find that the sequel is much better than this and it's due to the far superior story setup. Kevin being left home alone was a great initial start and opening up to the opportunity of a follow up story.To review this film without the mention of Macaulay's acting is a crime. Macaulay portrays Kevin with amazing talent and it's great for the simple fact that the 90s weren't really big for their child actors as far as I can remember. Macaulay is able to hit all ends of the acting spectrum showing being scared, showing emotion, and showing confidence and hilarious comedic relief, too. He was a great actor and I was sad to only see a few of his films before he retired.Another great point about Home Alone being a cult classic is the musical score provided by legendary John Williams. He gives the film the final emotional touch that allows us to forever remember Home Alone as being a classic film and never forget Macaulay's performance. Somewhere in My Memory has always been a favourite track of mine by Williams and it's just a great piece of music on top of a great film.This film is a classic for me, and I would never say that this isn't a wonderful film, despite being a tad bit unrealistic. But, the fact is, most films exaggerate and force you to suspend disbelief. Don't allow for this film not to be a favourite because you don't think this sort of thing could happen.",
    "19": "Well... there's 5, but there's only one Home Alone series, and no matter how many movies try to copy the idea, none of them will ever come close to the original Home Alone. This is one of the most enjoyable, fun movies ever made, and will continue to be for years to come.'Home Alone' is such an iconic Christmas movie and there isn't a year goes by without it appearing on our televisions over the festive period. It is such a crowd-pleaser, a movie that can be enjoyed by anyone, regardless of age and movie preference. Frankly, if you don't like 'Home Alone', there must be something wrong with you!Merry Christmas ya filthy animals!",
    "20": "If you attended dental school in 1989 you likely watched this cautionary tale that was required viewing for aspiring dentists. Then-American Dental Association president R. Malcolm Overbey contracted with legendary screenwriter John Hughes to create the best dental-centric work of art ever seen. After word of mouth (no dental pun intended) spread until 20th Century Fox snatched up the rights, the rest became holiday history.The film opens by highlighting the maxillofacial 24k styling of one Mr. Harry (Joe Pesci) in cop costume, his bling blinking in the gleam of the McCallister home and its high-class furnishings. Next a bullying montage features the prominent orthodontics of another McCallister who derides star Kevin (Macaulay Culkin) by stating \"You're what the French call les incompetents.\"Attempting to educate future dentists by showing them that despite their soon-to-be-acquired riches and mansions they must still control their bratty kids, the picture continues the dental hijinks by having lone wolf (in the house cavities built) Kevin's first concern (after the shock of losing his family subsides) being that he cannot locate his toothbrush.Kevin decides (wisely, per the ADA) to risk both kidnapping and police capture in order to purchase a new toothbrush. Almost home free, Kevin asks the million dollar question despite the substantial risk: \"Is this toothbrush approved by the American Dental Association?\"While Kevin's brutal series of psychotic traps ensnares damp bandits Harry and Marv (Daniel Stern) in the most depraved torture chamber since Corbin Bernsen's portrayal of The Dentist, the ultimate coup de grace is Old Man Marley's snow shovel to the grill. However, it was one of Kevin's earlier hazards that knocked out Harry's gold tooth, leading to a shocking twist that was a precursor to the Sixth Sense some years later.While the sexist among us may have assumed Peter McCallister (John Heard) was the rich dentist responsible for the family wealth, it was clearly his wife Kate (Catherine O'Hara) who had to be the millionaire mouth doctor. After all, no self-respecting dentist would have held a gold tooth found on the floor up to his mouth.10/10",
    "21": "When this movie came out 30 years ago on this date of review, it faced little competition in the form of Rocky V, an awful sequel that failed to recoup its budget like the last Rocky movie five years ago. Home Alone is pure family fun and is a hard PG rated movie about a 10 year old kid who is home alone for the holidays because he forgot to go with his family on a flight to New York for family dinner. Mischief ensues as two thieves disguised as repairmen try to steal Kevin's thunder. Macaulay Culkin has his breakthrough moment as Kevin and the cast and crew make it a true classic. During his career, this was John Hughes' biggest movie ever and Chris Columbus produced it long before he made money off of Harry Potter et al. The music by John Williams is classic. The movie became so popular at the box office and at home that a sequel, Lost in New York, came out two years after the first one came out and grossed a bit less than the other one. Then a third one without Culkin came out to diminishing box office returns in 1997 and the fourth and fifth and final movies debuted on home video, with a reboot coming to Disney Plus after Disney bought Fox from the Murdoch family (movie studio and cable entertainment assets) in 2017.",
    "22": "Home Alone is probably the best American New Year's film. Yes, he is childish, and he has a simple plot and jokes. But it has already become a classic mandatory for viewing on New Year's holidays. A great story, served as a childhood adventure.",
    "23": "Home Alone was/STILL IS A WONDERFUL MOVIE!!! It's PERFECT TO WATCH THROUGH THE HOLIDAY SEASON!!! This movie DID NOT DISAPPOINT!!! It has a GREAT CAST and a great storyline. It has laughter throughout the movie, love, and thrilling moments as well!!!! A+++ Film",
    "24": "Whenever I watch this movie I go back to my childhood :')",
    "25": "Home alone where do I begin? This is my childhood Christmas movie right in front of die hard. This movie is amazing from hilarious moments to other emotional times if you by some chance of bad luck haven't seen this I recommend you do!The thought of forgetting your child going on holiday should be dreadful bit this family classic makes you forget the bad and be just wowed at the great story go on watch it:)",
    "26": "Every 90's child has watched this. And if you haven't you had no childhood.",
    "27": "This movie type you just have to watch every year on Christmas, its a very cozy and feel good movie, its always nice to watch it with your family, get some hot chocolate, and some hot fudge brownies. The plot is very smooth and you just enjoy it throughout, nobody could of played Kevin like Maculay Kulkin. This movie is very fun, funny and a well rounded movie.",
    "28": "This movie is a Christmas classic for sure. I remember watching this as a kid and thinking how awesome it would be to be left alone for a few days... too bad my family never forgot about me. I feel like all the main actors are really good in this and the two robbers still make me laugh after all these years. I also have to credit my love for this film to John Williams and his beautiful score. The only reason I don't give it a 5 because Kevin did get on my nerves with some of the screaming (that's how I know I am getting older).",
    "29": "A masterpiece. I adore this movie and I adore this movie and I adore it and that's it.",
    "30": "I don't know why I avoided this film. It's a John Hughes classic film in his style of American suburbia. Macaulay Culkin has the startling role as Kevin McAllister in suburban Chicago town in a beautiful home. He plays the child precociously and with vulnerability at eight years old. After he is banished to the attic, he is forgotten the next day after his parents fly to Paris, France for a family holiday. There were fifteen in all. The scene where they are racing to the plane would be unrealistic today. Kevin believes his family left him alone. With two burglars played by Daniel Stern and Joe Pesci, Kevin learns of their plot to burglarize his home as the silver tuna. Kevin's mother realized that she forgot him at home. Worried and desperate, she would do anything to reunite with them. There are noticeable Chicago actors like Ann Whitney and Alan Wilder in minor roles. Of course, there is John Candy in a small role as well. The cast did an excellent job with their roles. The film wasn't expected to be such a hit at the box office. You can watch this film repeatedly and still enjoy it like other John Hughes films.",
    "31": "Home Alone is a good family film. I enjoyed it. I saw the film with about 500 young children and it was an overwhelming experience. Although I didn't think the film was as funny as they did, I had a great time listening to them laugh. Kids will laugh more than adults will, but I think that's what this film is aiming to do.",
    "32": "This has got to be one of the best Christmas movies ever made. The story is simple yet unique. The acting is not academy award worthy, but Macaulay Cullkin has just enough charisma to carry the film, and of course Joe Pesci is great. Then you add John Williams score, and the whole thing gets elevated to another level. It has aged a little, but it is still enjoyable to watch today. If you're looking for a movie to put you in the holiday spirit, look no further than Home Alone.The sequel is pretty good too. A lot of rehashing, but it's still a good companion piece.",
    "33": "30 years on and its still one of the best Christmas movies out there. Lots of laughs but plenty of life lessons too. Just fab!",
    "34": "It's a very good Christmas Movie for families to enjoy. Definitely worth watching masterpiece",
    "35": "Well watching this movie can't stop laughting one of the best commedy ever made :D",
    "36": "This movie is old, is exaggerated and is lots of fun, that's why I like it. The 2 thiefs are really great as characters. Watching this every Christmas is always a good time and laugh. I don't know how many times I watched that pizza scene.",
    "37": "This film is a very funny story about a boy which was left in the house alone. This movie is for a family. I liked it so much!! Watched it 10 or more times but everytime it is interesting. Watch it on christmas time!!!",
    "38": "Christmas isn't complete without watching this cartoon like adventure.",
    "39": "This is defintely one of the best Christmas movies of all time. Everything works so well. This was my first watch and i loved it.",
    "40": "the great virtue - its simplicity. a story who escapes from surprises, inspired use of clichés, the role of life for the young Culkin and family humor in a fascinating style. short - one of the dreams of each child, the great fear of each parent. and the danger. few lovely scenes, so beautiful than defines the film as perfect, the gags, the resistance against bad guys, the chaos behind the trip, the competition between brothers are prepares for admirable meetings. a Christmas film. but a real special one. because it is one of great occasions for rediscover the beauty and joy and force of life. as an unique form of miracle.",
    "41": "Favourite christmas movie. Everybody watches this movie every Christmas!!",
    "42": "A classic feel good movie.The kid held the house down.I just hate seeing this movie during the pagan winter solstice season. EVERY bloody year this show is on TV. Should give it a 3 for the over done replay. Its replay makes me dislike the movie.",
    "43": "Home Alone is a familiar movie from childhood. I was surprised how good that still is. I last saw this movie about 15 years ago. Home Alone is still as fun as it was then before unlike some other movies of childhood.\nA main character is Kevin MacCallister (Culkin) who is a wild boy of a large family. He is accidentally left home when the rest of the family has gone to Paris for the christmas vacation. Two other important characters are Harry (Pesci) and Marv (Stern) who are criminals. The are going to rob valuable goods of houses which are empty during Christmas. They don't know Kevin is still at home. Kevin protects home from the burglars while these try to rob his family's house too. Movie contains some emotional moments along comedic scenes.\nCulkin, Pesci and Stern are very good in this movie. I think this is the best Christmas movie I have ever seen.\n10/10",
    "44": "Never gets old. The music, the cast, the atmosphere. One of the best films to watch for the holidays",
    "45": "I had often heard people talking about this film, sometimes described as a bad one, sometimes described as a kind of must-see. So I watched it this year and am, actually, positively surprised or at least it wasn't as bad as I sometimes heard. Poor little Kevin is left alone at his home, his family have forgotten him on flight to Paris to celebrate Christmas. But while enjoying the being all alone, some shrewd burglars make his street unsafe...Yes, it is sometimes chaotic and illogical and reminds, as some critics say, in cartoons that wouldn't work in a real film. Yet, Kevin acts like a creative and inventive boy to defend his family's house. It is funny and you should have seen it once.",
    "46": "this movie has to be one of my all-time favorites: Columbus proofed himself as a director in this one, and so did Culkin as an actor. I also liked the performances by Pesci and Stern as the two clumsy robbers. This movie is great from beginning to end and, unfortunately, the last great one from Hughes.         But this movie gets a well deserved 8 (the sequel gets the same rating).",
    "47": "Didn't you watch this movie?One of the details that made my childhood beautiful.Russian language movies on VHS were released in Azerbaijan and my uncle bought it for me, I was astounded. Wonderful. This movie is shown on TV every new year. It's already one of the New Year's classics.Even my great grandmother watched this movie.",
    "48": "This film is gripping and the acting is perfect. Home alone is in my opinion best film at X-mas. I really enjoy watching this film. It´s the best family comedy which I have ever seen. The story is about young boy. His name is Kevin. He is small but he is big trouble-maker. In this film he did a lot of crazy, good and bad things, which you will see when you watch this great film. I think the main character (Kevin) was created for this role! He was really good actor. In this film you can see how Kevin did a traps for two guys, who want to rob his house. It is really entertaining. In film there are some stunts, which are real. There were no stunt-man or stunt-woman. The characters perfomed stunts themselves. That´s crazy! Characters: Kevin are brave, impressive and wily and bandits are thoughtless, bad, sharp. And one interesting thing about this film is that at the end one of the guys tries to bit Kevin to his forefinger and he bit him for real and after shooting Kevin has a real scar. So at the end I must say that it was a great film and you must watch this. Thank you for reading.",
    "49": "Home Alone(1990) is a mediocre movie with an uneasy amount of cartoonish violence.  The problem with the film is the characters do things that most people would not normally do.  Joe Pesci is wasted in this movie as he gives the only interesting performance of the entire movie.  One sad thing about this movie is that this may be the only film that Macaulay Culkin will be known mainly for.  Its a fine film for the holidays but not as an overall viewing experience.",
    "50": "Rambunctious comedy features Culkin (in a star-making performance) as a troublesome but clever and precocious eight-year-old child whose quarrelsome, dysfunctional family inadvertently leaves him behind after they leave town for the Christmas holiday. He makes the most of his situation by doing all the things he couldn't do without his family's permission, but unexpectedly finds himself defending his Chi-town home from local wet bandits Pesci and Stern. This is able to provide some poignant messages about the importance of family and friendship, but is most likely to be remembered for its hilarious slapstick, goofy bad guys, and a very appealing young star. ***",
    "51": "Kevin McCallister (Macaulay Culkin) is the youngest of a large family. They are preparing to go to Paris for Christmas. The power goes out overnight, and none of the clocks work. The family rushes to get on the plane and leave little Kevin behind. The Wet Bandits, Harry Lyme (Joe Pesci) and Marv Merchants (Daniel Stern), come to town to rob the McCallister home only to battle Kevin and his home made traps.Director Chris Columbus and writer John Hughes team up to create one of the most iconic comedies of its era. It's in no small part due to the iconic scene of Macaulay Culkin slapping his face and Scream. Take it away, it's a rather crass juvenile kiddie movie. I'm not complaining, just explaining. Expect a lot of slapstick stupidity with the annoying Wet Bandits.",
    "52": "I was two years old when Home Alone came out in 1990. I grew up watching this as a kid and I still like the film to this day. Christmas is coming and I watch it whenever the holidays are coming. Joe Pesci and Daniel Stern are hilarious as Harry and Marv. The greatest comedy duo of the early 1990's. Kevin's traps are awesome and funny. I laugh when Harry and Marv get hit. Kevin's the smartest 8-year-old kid and he always wins by beating up Harry and Marv. Everyone needed a good laugh and I'm one of them. There are touching moments and hilarious moments.",
    "53": "Like many other people of my vintage, HOME ALONE has been a staple of the holidays for as long as I can remember. The story is essentially a kid's fantasy: not just staying home alone and getting to play by one's own rules for a while, but also inflicting comical pain upon very obvious bad guys. The Christmas-y mise en scene and clever use of low camera angles complete this nostalgic, feel-good comedy's sense of festive atmosphere.As an adult, the contrivances that cause the plot to occur are more apparent, of course. And the slapstick climax is shockingly violent-- it never occurred to me just how brain-damaged or DEAD the Wet Bandits would be. However, none of these things bother me in the least. Maybe it's nostalgia. Maybe the movie's strengths are so potent as to cancel anything else out. I don't know. All I know is the movie still makes me laugh in my 20s as much as it did when I was a child.",
    "54": "A christmas classic since the moment it was released. Great comedy, sweet and funny. Never getting old.",
    "55": "This film is a masterpiece in its own genre. It has a message for parents about their children and it is very funny and sweet. This film is a big part of my childhood memories. I can not give it a low grade.",
    "56": "Home Alone is a very funny Christmas classic of the early 1990's. I thought that this film would be good, but it's much better than that. The story is about a young child whose family leaves him at home when they all go to Paris. Two dim-witted burglars realize that as well. They planned on robbing the house with no one in their way. Little did they know that Kevin would be the hero of the household. The acting in this film is good especially the robbers played by Joe Pesci and Daniel Stern. They were the funniest part of the film. I also like the music in this film then again I always liked John Williams' music. The only thing a little wrong is the violence. A PG-13 rating would have been more suitable. Otherwise, this is perfect. I rate this film a 10/10.",
    "57": "A boy stay alone in his home after his parents went to out of station..sanetime 2 burglars came to house for steal something in house..\nFight between a boy and those thieves is rest of the movie..!!Must watch for comedy movie lovers..!!",
    "58": "When I heard Daniel Stern speak at Lewis & Clark College in September, 2004, about his USO tour in Iraq, he said that while \"Home Alone\" had a bunch of silly gags, at least it only had them once; the sequel just repeated everything. When you think about it, that makes sense. This movie was funny the first time (I certainly loved it when I saw it in the theaters), but not much after that. I gotta ask: what happened to John Hughes? In the '80s, he made movies like \"The Breakfast Club\", \"Ferris Bueller's Day Off\", and \"Planes, Trains & Automobiles\"; in the '90s, he got into dropping things on people's heads (think \"Home Alone\" and \"Baby's Day Out\"). Oh well, life goes on. And for the record, Daniel Stern also said that when he was in Iraq, some Iraqi children recognized him from this movie; that made him understand the reach of American culture.",
    "59": "Home Alone is one of those Christmas films that pop up every year. It's many people's favourite modern Christmas film too. I just didn't like it.It couldn't cope with the overly sentimental subplot about the neighbour, the cartoon humour was too dark for my liking and as ever I found Macaulay Culkin annoying.It has its moments, don't get me wrong, but would I rate this as the best Christmas film of all time as others have- no! So good luck to you if you're dusting off the DVD and enjoying it with nostalgia. I'll instead watch 'The Santa Clause', a real modern classic.",
    "60": "To balance out all the crud!!! Do not worry if you do not want to have a housefull o f children~!!!! Help those who are already here. Mr. Culkin turned out pretty cute! Love Granny.PS: Chris Columbus we love you!!!",
    "61": "A must watch every Christmas for everyone. I know most adults who love this film. Yes its unrealistic but you take it for what it is, a timeless christmas classic.",
    "62": "If I had to pick a movie that was a smash that did absolutely nothing for me Home Alone would be at the top of the list. Oh, I'm not saying the movie was awful. But overated yes and after all these years, I still don't get the appeal.I'm an adult but was fairly young when this came out-and I love all types of movies. This movie's premise bothered me, seeing a kid get terrorized by robbers,even in a comedic sense, was not my cup of tea and I spent most of the movie feeling sorry for the poor kid who got left behind and wishing the movie would end. Yes, Mcauley Culkin was cute-but aside from that, I don't think Home Alone rates more then a 5.5 maybe a 6. I have definetly seen better kid movies, family movies etc. It was hyped so much and so sickeningly sappy, the most I could say about it is that it's a \"cute\" little movie.",
    "63": "I'd wager that out of 100 people at LEAST 99 people would like this movie. It's funny, timeless, and actually has a plot, unlike a lot of kids movies. It's a must see for your Christmas season!",
    "64": "Incredible movie. Best in class. Christmas movies at their very best. Culkin is great. The antics he pulls are a must see. Storyline goes by in a flash but so fun.Must see!!!7 stars",
    "65": "Home Alone is a simple concept, but one of genius. A small boy (Kevin, played by Macaulay Culkin, accidentally left behind by his family as they depart on Christmas vacation, finds himself in the family home which is about to be burgled by a pair of crooks. However, the little lad is full of innovative ideas for fighting off their depredations, and the crooks themselves are woefully inept.This idea comes out, in practice, as a chunk of set-up and a slushily sentimental coda which bracket the centrepiece - the assault and defence on the McAllister house, which is played as a live action Tom And Jerry cartoon.Sentimentality is appropriate for a Christmas movie (and in any event it is good to see Catherine O'Hara, often in overstated comedic roles, playing with a softer edge). Besides, a dose of saccharine is a small price to pay for the wildly funny slapstick violence inflicted by Kevin on the hopelessly outclassed Harry (Joe Pesci) and Marv (Daniel Stern). Both actors play with a broadness which is not only just right, but also absolutely necessary. And young Macaulay Culkin's Kevin is an engaging combination of resourcefulness, malice, and vulnerability.A hugely enjoyable family movie.",
    "66": "Home Alone was one of the funniest film released in 1990 and is still a Christmas classic to me , tweleve years later. Macaualy Culkin became a star with this film and Joe Pesci showed more acting talent om this film. The ending in the film is one of the funniest and when I have kids I'll show them this treasured classic.",
    "67": "The music, the booby traps, the dysfunctional family memories during Christmas..This movie will make you laugh so hard you'll be rolling in the aisles!Perfect for viewing with the entire family.Be nice to your loved ones!",
    "68": "I absolutely loved it! The movie was very funny and entertaining. I always watch this movie around Christmas. It's my favourite Christmas movie. The sequel is also one of my favourites. It saddens me that they never made a 3rd movie with the same characters.",
    "69": "I just watched \"Home Alone\" for the first time in years and I did not enjoy it as much as I thought I would. This was such a big film when it came out and was well received by most but now it just doesn't feel on that level to me. It seems just ok, nothing great. The plot can be plodding at times and there is a good deal of negativity mixed in between some nice moments such as the scene in the church. And seeing the burglars get hurt wasn't satisfying or funny to me now but just cringeworthy. Really there were few laughs the entire film. I'm not sure if this discrepancy in perception is due to my aging or the world changing, but there it is. I will give it a 6/10 and that may be somewhat generous.",
    "70": "Home Alone is amazing from beginning to end! Between watching Kevin and the Wet Bandits, to watching his mother trying to get home to him, there's never a dull moment. The jokes are hilarious, the acting is on point, and the music is great! Macaulay Culkin does a terrific job as acting like a mature young boy. Watching him shop, watch the movie, and set up the traps are all entertaining.\nDefinitely a must watch every year!",
    "71": "Is it perfect? No. But it is the most fun movie you can watch at Christmas. The soundtrack is absolutely top drawer, the cast is spot on, and everything just works. Magnificent.",
    "72": "Kevin McCallister is part of a huge family including his big brother Buzz and his uncle Frank and he feels that everyone is against him because his parents don't like his behavior and he gets sent up to the attic and wishes he never had to see his family again.Kevin is accidentally left home alone while his family is on vacation and of course he is very happy about making his family disappear but now he has to defend himself and his house from two burglars.This is a funny and well directed movie with great preformances and it will never get old.",
    "73": "It is recommended because it is excellent, because it has excellent history, excellent script and is a movie for the whole family and because the performances are the best of all. Excellent Christmas movie and masterpiece by Chris Columbus.Excellent movie, I loved the performance of Macaulay Culkin the best, Joe Pesci and Daniel Stern also, the best performance of all, I wonder what happened to Macaulay Culkin ? Home Alone is a movie to see as a family, a movie to watch at Christmas. I loved. 10 points. And the man with the excellent shovel. As I said the best performance of all, the part that Kevin puts the tarantula to the thief Marv (Daniel Stern) killed me with laughter and the face that Joe Pesci puts on when he leaves in the police car made me laugh. Safety pin. Very recommended. I suppose everyone saw it, the one who did not see it, I recommend it, you can see it. It is a film suitable for all audiences. The McCalister family goes on vacation to France, they leave Kevin (Macaulay Culkin) alone at home, Kevin learns to fend for himself and even protect himself, cheat him and confront some thieves who come to Harry's house (Joe Pesci) and Marv (Daniel Stern) are two thieves who intend to raid all the closed houses in their neighborhood. When his mother realizes that he forgot about him, he makes a trip back to Chicago to recover his son. It's fun, entertaining, comical, dramatic and also for the Christmas season.",
    "74": "\"Home Alone\" is one of those movies that gets better every time I see it. I've always been a fan ( I saw it when it first came out at MovieWorld in Douglaston, NY.) but each year I find myself enjoying it more and more. I laugh at new jokes every time I watch \"Home Alone\". That's no neat trick. Macaulay Culkin should have won an Oscar. He's terrific. I keep forgetting how small he is until the Wet Bandits hang him on the coat rack towards the end. He's a little boy. Yet, he carries a whole movie. It's amazing. The scene that puts \"Home Alone\" in the classic movie category is the church scene. It's one of the Top Ten greatest scenes of all time. It's all about forgiveness. It always is. Merry Christmas.",
    "75": "This is one of the best movie I've watched in my whole life... This just took me back to my childhood.. I love the theme too, how broken family get join is just amazing.",
    "76": "Everyone knows this Christmas Classic, the original Home Alone tells a story about a kid who gets left home accidentally by his family who leave to go on holiday.Of course, Macaulay Culkin (McCallister) decides that he wants to make the most out of this opportunity and does the stuff his family never lets him do.\nHowever, this all changes with his chance run-in with the \"Wet Bandits\", two burglars that are out on Christmas robbing houses.Joe Pesci makes this movie great with his original personality, Daniel Stern adds the humour to the dynamic duo.All in all, definitely recommended for a family.",
    "77": "Home Alone. Kevin! Probably one of the best Christmas movies ever. It's a great comedy and Kevin's words to think about, as well as snow, a tree and Christmas!",
    "78": "Warm, hilarious, lovely and absolutely perfect for the winter holidays season. Just sitting around, with a couple of snacks, lights on and wrapped into your favorite blanket. Heaven.",
    "79": "2nd only to Home Alone 2, this movie is good for all ages. It's one of the few Christmas traditions that hits just as hard in July as it does in December. It's a must watch, must remember, and must repeat. Quotable after quotable the film gains momentum with every minute until the disgracing of villains in the grand finale.",
    "80": "John Hughes was sent by God to warm our hearts. I love this movie. Perfect in every way. Great cast, great story, lots of comedy and heart. Seriously if you hate this movie you must be a sad human being. It's not great art, but it was never meant to be.",
    "81": "A fun family film for the holidays. Macaulay Culkin stars as a young, inadvertently left behind at Christmas when his parents go on holiday, who foils some inept housebreakers, played delightfully by Daniel Stern and Joe Pesci. From the great John Hughes, this one is still nice to pop into the VCR at times just to ask yourself, \"What ever happened to that handsome little kid?\" Catherine O'Hara, John Heard and John Candy co-star.",
    "82": "I grew up watching this movie and the 2nd one. It's not just that this movie is very nostalgic for me but it's a classic that has managed to still be an amazing hilarious movie decades later. Macaulay culkin and all the rest of the cast were perfect and spot on!I watch it most Christmases. Really adds to the Christmas feel!",
    "83": "Now, don't get me wrong, this movie is a classic for a reason. It's highly entertaining, and Macaulay Culkin does as good an acting job as any child actor can be expected to, especially when he's carrying the whole film.HOWEVER: The treatment of Kevin by his family has not aged well. At the beginning of the film, his parents stand idly by while his uncle, brother and cousins verbally abuse him, angrily calling him a \"little jerk\" and a \"disease\" for doing nothing that was even that bad. This will not sit well with modern audiences, who will rightly say that if someone called their child that, they would bi*chslap them and kick them out of their house. The issue was not even addressed in the movie, the parents did nothing to defend him, and thus verbal abuse of small children was normalized, given that it's such a popular movie. I would otherwise give it ten stars, but this really stuck in my craw.",
    "84": "This has to be up there with the best Christmas films out there, scrap that just the best films in general. Brilliant idea with great comedy and some great acting. As family movies go this is a must watch with out a doubt.",
    "85": "Mackauly Culkin played the perfect role of Kevin McCallister in this genre defining Christmas comedy. It is full of the iconic gags and heartfelt story that everyone has grown to love over the years. Every Christmas it is tradition that I'll sit down and watch Home Alone and laugh every time. Kevin was comedic genius in the movie with Joe Peschi and the other actor I can't remember as Harry and Marv, the wet bandits.The McCallister house is an iconic location when it comes to Christmas movies with memorable and quirky characters such as Buzz, Kevin's brother as well as Kevin's parents which Kevin hates for some reason.When Kevin is left alone at home though, he has the house to himself and hilarious folly ensues. Kevin acting is great as the movie goes on. And the movie has a very heartwarming ending",
    "86": "This film starts off well with a relatable young boy Kevin who is picked on by his family and left behind on holiday. His antics at home are funny but it devolves once he has to lay traps for the burglars. Slapstick comedy only works up to a point. Beyond this, it seems more sadistic than funny. Kevin seems like a serial killer in the making.",
    "87": "Home Alone is a bonafied classic Christmas movie. It has good slapstick humor, good acting, good stunts and a semi believable story. There is a plot hole in relation to why the pizza boy did not call the police when he thought he was shot after. The movie could have ended right there. But a classic it is, and always enjoyable to look up to for Christmas.",
    "88": "Home Alone is one of my favorite movies,it is a classic, Maculy Culkin is so awesome in this film, I love love this movie a great movie for the family to watch together",
    "89": "Mediocre attempt at a comedy. Will probably appeal to kids but not to anyone else.Fairly basic, slapsticky plot. Some of the methods the kid uses to protect his home are quite clever, but that's about the only positive aspect of this movie.What an irritating kid. The back-chatty replies to his parents, the general cockiness. Can see why kids would like this, and why adults shouldn't...Unfortunately, it spawned several sequels, and launched the career of Macaulay Culkin...",
    "90": "No this movie is not perfect. Lots of inconsistencies, plot holes and production errors but I don't care. I watch the two original Home Alone movies with my family every Christmas and we laugh harder with each passing year... And a few tears thrown in here and there because it tends to get emotional at times and the score by John Williams perfectly captures the mood. I will love Home Alone till the day I die and I don't know a single soul who doesn't appreciate it. Doesn't matter if you're 7 or 75, everyone can watch this and have a blast! Nothing I would love more than a sequel with the original cast for a final reunion.This is the definition of a timeless classic!",
    "91": "I cannot begin to tell you the love and appreciation I have for this movie. I've watched it every Christmas (sometimes multiple times) since I was like 8. But this is the first time where I really get to see how unbelievably well made this film is.First and foremost Macauley Culkin gives my favourite child performance of all time. His comedic ability is insanely impressive especially since he was so young when this movie was made. His ability to deliver comedic dialogue is perfect but also his physical acting ability was insanely good.Joe Pesci and Daniel Stern have some of the best on screen comedic chemistry ever. They're ability to play off of each other is amazing. Even when the two are doing their own scene they are phenomenal.The plot is highly entertaining and realistic. The idea of a kid being left at home by himself has probably happened many many times. So when you put that idea into a movie and add the aspect of that house being robbed, it creates a movie that is attention grabbing.The sequence at the end of the movie is another example of the comedic intelligence this movie has. All of the slap stick humour is perfect and is realistic.Old man Marley is another reason why this movie is so great. We see this side plot of Kevin being scared of him develop into a very important character scene for Kevin. Not to mention it leads to a very heartwarming scene at the end.Home Alone has some of the best comedic intelligence ever seen on the big screen. With a cast full of phenomenal comedic actors Home Alone provides for a highly entertaining movie that the whole family can enjoy.9/10.",
    "92": "one of the best comedies of \"90's. for the inspired use of clichés, for the fireworks of imaginations, for one of the most remarkable children actors of our time, for the delicacy of last part, for the powerful flavor of Christmas, family spirit, childhood. it is more than a movie but a kind of experience for its public . this status defines it with profound precision. because it is one of films who, after years, preserves, in perfect form, the image of a period, the traces of \"80's , the social change of \"90's, the manner to discover and understand the world, the courageous work to transform it. a comedy, of course. but not only one. maybe, useful support to remember an age. and its beautiful colors.",
    "93": "I just watched 'Home Alone' for the first time in years and I did not enjoy it as much as I thought I would. This was such a big film when it came out and was well received by most but now it just doesn't feel on that level to me. It seems just ok, nothing great. The plot can be plodding at times and there is a good deal of negativity mixed in between some nice moments such as the scene in the church. And seeing the burglars get hurt wasn't satisfying or funny to me now but just cringeworthy. Really there were few laughs the entire film. I'm not sure if this discrepancy in perception is due to my aging or the world changing, but there it is. I will give it a 6/10 and that may be somewhat generous.",
    "94": "This movie made me very warm. A little boy is fighting thieves. He is act smartly,so drive back thieves. I felt a warm heart of family. I was impressed last scene. It made me cry. There are my favorite scene. The house was decorated beautifully with Christmas ornaments. It really beautiful. I like very much it. Actually I like Christmas ornaments. My family like Christmas ornaments too. So my house do it. Moreover, the music of this movie is also wonderful. I can heal it even by music. This movie made me think of winter. When the winter of every year comes in Japan, it broadcasts. It is a very popular in Japan movie. All children and adults was loved.",
    "95": "I know this is a \"triple F\" and \"triple C\": feel-good fun family and classic Christmas comedy... so you'll forgive me to be a triple ass and introduce this review with a downer opening. Here it goes.We're in 2017, John Candy is comedy legend (sadly of the dead sort) since the mid-90's, John Hughes died in the same untimely fashion eight years ago, followed by Robert \"Old Man Marley\" Blossoms two years later and John Heard, the father with such a lovable face, has died this summer. Sorry to go on this eulogy but even Roger Ebert and Gene SIskel who gave two thumbs down to the movie because of its implausible narrative and sadistic treatment of the villains, are also gone. This is just to show how this 1990 classic is already surrounded by an aura of nostalgic sadness.Of course, Chris Columbus, Joe Pesci and Daniel Stern are alive and much alive but look at Macaulay Culkin, another sad example of the devastating effects of child stardom, although he's probably richer than I but he didn't exactly follow the 'Natalie Portman' path, not even the Anna Chlumsky one. Whenever I see him on the screen, I can't help but think of how this cute little face has turned to, but there are so many sad things about the lives that contributed to the movie that it almost plays like a sort of shelter for laughs, a time capsule for December 1990 or the whole early 90's, where we can comfortably enjoy Christmas in the lovable and cozy McCallister house and forget about the real stuff, the time of a movie.It's funny that there's so much escapism in such an enclosed movie.Besides, watching \"Home Alone\" again in 2017 allows us to appreciate a time where even a good old-fashioned comedy could hit the box-office jackpot and be the highest grossing movie. No superheroes, no Transformers, no magical superpowers, the (r)evolution was on march, sure, but it didn't take much at that time to draw audience to the theaters, what counted was a simple concept and an appealing main character. The concept here is simply terrific: what would happen if a boy was left alone in his home? and during Christmas holidays at that, and when the kid is played by such an adorable and talented kid as Macaulay Culkin, half the work is done. There's also an interesting implication, every kid would love to be alone in such a big home (granted he's got enough to eat or buy food) but how about when it happens at the very time where you count on the presence of adults.... even for selfish reasons.I concede that John Hughes didn't really try to make an existential plot out of the concept, and picked the easy way, which was a confrontation between the boys and bad guys... but what bad guys! As Hitchcock said, a film is as good as the villain and Joe Pesci and Daniel Stern form a very interesting variation of 'Laurel and Hardy', 'George and Lenny', 'George and Junior' or 'Pinky and the Brain', the interaction between the two burglars while not reinventing the wheel, is the perfect foil to little Kevin's quick wits, agility and ability to come up with the most ingenuous devices in order to 'defend his home'. I think it's safe to consider that the film was already a winner once they got the concept, the kid and the villain. The rest was just a sort of icing on the cake, what kind of booby traps to install in the house, how to make it 'impossible' for the parents to reach their kid or for him to get help, and of course the 'spirit'... otherwise it wouldn't be a Christmas movie.So of course, it's going to be implausible, with such a title as \"Home Alone\", you either have a comedy or a horror/thriller and if the movie had to be 'realistic', it wouldn't have taken more than three hours (movie time) to get Kevin out of the house and arrest the burglars. But we wouldn't have a movie either, we wouldn't have the 'Playboy' scene, the after-shave moment inspiring the iconic recreation of the 'Edvard Munch' painting with Kevin's trademark scream, whose only match was Marvin's shrill arachnophobia reaction. The film is a Christmas classic because it has filled that over-the-top category, if you want a movie that recreates the fun of Christmas in a realistic way, you have the no-less iconic \"A Christmas Story\", but the concept of \"Home Alone\" could only work with that level of slapstick. AndCulkin's performance is so good it even conveys a sort of edgy attitude, he's not your typical kid either, but he's still convincing enough as a kid.It's not just a matter of suspension of disbelief, but of \"let it go\" for the sake of innocent fun, of course, watching this right now reveals some baffling contrivances we couldn't spot where the film came out, yes, we know the supposedly shovel murderer isn't a bad guy, we know Kevin relies a lot on the assistance of luck and perfect timing, we know it will all come down to the powerful family reunion and Catherine O'Hara provides the emotional arc of the film. Yes, it's true Marv and Harry aren't so bad they really deserve all the hurtful stuff that happen to them, and Kevin's scream can get annoying at times, but the film is closer to a live-action cartoon than a realistic comedy.And there is no way for \"Home Alone\" not to make it in any Top 10 of classic Xmas movies, but maybe I'm biased because it was totally the kind of movies we used to watch countless times as kids to the point I always identified Tchaikovski's \"Nutcracker\" music as the 'Home Alone' theme.",
    "96": "It's a classic comedy movie that is absolutely fantastic. Obviously the users that rated it 9 minus just don't like comedys.All I can say is that I was surely laughing all the timee.if you haven't watched just do💗",
    "97": "Some see this holiday film - directed by Chris Columbus and written and produced by John Hughes - as a seasonal favorite. I see it as a story of bad parenting, exacerbated by the fact that they allowed the same situation to happen a year later, and a child driven to cruelty by the way he has been raised.The entire horrifying McCallister family is leaving Chicago for Christmas in Paris. Peter (John Heard) and Kate's (Catherine O'Hara) youngest son Kevin (Macaulay Culkin) is constantly being berated by the entire extended family and ends up having to spend the night in the attic, at which point he tells his mother that he wishes the entire family would disappear. That night, the power goes out, the family nearly misses their flight and Kevin is left home.Have you ever been in a midwest attic in winter? It's no place for a child to sleep.Now Kevin must deal with the Wet Bandits - Harry (Joe Pesci) and Marv (Daniel Stern) - as well as connect Old Man Marley (Roberts Blossom, who was Ezra Cobb in Deranged, a role that's referenced by how all the kids think he was a serial killer) with his family and his mom must get back home to see her son on Christmas, aided by Gus Polinski (John Candy) and the Kenosha Kickers, the polka kings of the midwest.Candy did his scenes as a favor and shot all of them in 23 hours, improvising everything, including his tale of leaving one of his kids at a funeral home. Candy was already a big star yet he was only paid $414 for his part, one that kind of makes the movie for me, while this movie made $474 million dollars.I think it's funny that Pesci hated being in this movie. He kept telling the crew that his dialogue was not of a quality commensurate with his acting ability and he disliked the early calls - Culkin could not work after ten p.m. - which kept him from playing golf. He also hated that he couldn't swear on set.Throughout the movie, Kevin annihilates Harry and Marv, which left Culkin with a scar in a scene and gave Pesci burns to his scalp. Columbus said of these scenes, \"Every time the stunt guys did one of those stunts it wasn't funny. We'd watch it, and I would just pray that the guys were alive.\"I really think that the attacks on the Wet Bandits are so brutal that there's no way they would survive.Is that your holiday fun?Maybe I was too old for this, as my wife loves watching it. I just never could get into the fact that Kevin comes from a rich family that can barely take care of him, he frequently magically fixes the lives of old near homeless people and then crushes the dreams of the lower class who have had to resort to crime to survive. I mean, the second movie literally has Kevin interact with Trump and bully the staff of a hotel because he has his father's credit card. I have no sympathy or worry for him.",
    "98": "I saw this movie years ago when i was a child. and as child i couldn't describe how it was amazing to me. the play of those two thieve was amazing and couldn't be more hateful of them.and also the play of the kid was great.",
    "99": "'Home Alone' has succeeded in establishing itself as a Christmas tradition, spawning off three sequels (including a made-for-television flop), and a whole franchise in and of it.Macaulay Culkin plays Kevin McCallister, the average American child. He has an attitude almost expected of a Chris Columbus film from the eighties. He lives with a large family, which, right now, being around Christmas time, is about quadrupled, flooded by relatives' children, all of whom pick on poor, poor Kevin (sympathy long lost later into the film).One day Kevin wakes up from his sleep to find his wish has come true: his parents (John Heard and Catherine O'Hara) have disappeared. Enthralled by this, he proceeds to do everything and anything he was not allowed to do before, including eating ice cream in the morning, watching violent gangster films, jumping on the bed, wrecking his brother's room, and having some fun with a BB gun. Unfortunately for Kevin, his parents have not just disappeared - they have accidentally left him at home before going to Paris!Trouble really starts when two pesky burglars, Harry Lime (Joe Pesci) and Marv Merchants (Daniel Stern), decide that their next burglary will be at the McCallister residence. Little do they know Kevin is more than prepared, arming the house with an array of booby-traps that would impress top spies in the American government.John Hughes, writer/director/producer of my favorite comedy, 'Planes, Trains and Automobiles,' wrote this film, and it is no wonder. It is just like Hughes' humor. It mixes emotion, belly laughs and a warm-hearted ending all into one little bundle called a movie. John Hughes' films, in my experience, are usually very good, mainly because he approaches films at a very classic level. He doesn't resort to crude, kid jokes, like 'The Master of Disguise' or 'The Tuxedo,' to name a few recent flops. He almost always levels everything out perfectly in his scripts, and nothing is different here. Also, he places Kevin and co. in a large brick home in a large neighborhood in Chicago; a home that very much resembles those in 'Planes.' and 'Uncle Buck' (I would not be surprised if it is the same home).As for the acting.Macaulay Culkin is not at his best here. His best performance would have to be in an earlier John Hughes film named 'Uncle Buck,' where he had more of a cute charm than an acting charm. Here, he could barely act his way out of a plastic bag. Fortunately, with great performances by John Heard, Catherine O'Hara, Pesci and Stern, his bad acting is long forgotten by the time we become absorbed into the film.John Heard and Catherine O'Hara bring Kevin's parents to life. They seem almost complete opposites. Kevin's father, Peter (Heard), is very calm and laidback. His mother, Kate (O'Hara) is extremely nervous almost all the time, fretting throughout the film. She is aggravated very easily and, like all mothers, her instinctive nature to care for her child is what drives her to the point she goes to in the film.And then there's Pesci and Stern. My favorite lot of the film. They perfectly blend humor, pain and aggravation to the film.Pesci's character Harry is very strict, easily agitated and picks on Marv for a great many things. Marv, the stereotypical 'tall, stupid one,' is completely stupid. He does things that would make a hamster blush. Yet he is the character I have found many like the most, mainly because he is so stupid you have to feel sorry for him. Stern brings a great trait to the character of Marv, and I am very pleased he got the part. It's a hard choice to decide which baddie is better, so I just say I like them both the same.All in all, 'Home Alone' is probably the best Christmas movie to rise out of the film industry in the last twenty years. It seamlessly blends humor, pain, emotion, human instinct and some great booby-traps all into one little bundle. This film has stood the test of time greatly.4.5/5 stars -",
    "100": "The overwhelming success of 'Home Alone' (it spawned two sequels), is enough to guarantee that most people will love this story of a family that departs for Paris on the Christmas holidays, mistakenly leaving an eight-year old boy to fend for himself. And fend he does, when burglars threaten to break in unless he can rig enough booby-traps to keep them out.That's the simple plot in a nutshell. Macaulay Culkin seems to have no problem carrying most of the film with a wide variety of looks, gestures and expressions--but for my money it's Daniel Stern and Joe Pesci who get the main laughs as the bumbling burglars intent on outwitting the kid's traps.\nOthers in the cast don't have as much to do but do well enough by their roles, particularly Catherine O'Hara and John Heard as the parents who only discover on the plane that Kevin is missing. The laughs are steady, the color photography is great and the slight story is probably every boy's fantasy of what it might be like to be left home alone. Add to that the holiday flavor of Christmas and a pleasant musical score by John Williams and you have the makings of a classic. The proof is in the pudding--they must have done something right!!",
    "101": "Home Alone is one of the best slapstick comedies I have ever seen.The comedy is top-notch, the slapstick is fantastic.It's not just that, the direction, editing, and pacing are immaculate.And obviously Macaulay Culkin, Joe Pesci, and Daniel Stern are phenomenal here, I can't imagine them being played by anyone else, they are just perfect.Some of these edits wouldn't be in films like this today.But this movie is also delightful, dare I say even a little heartwarming, it's the perfect Christmas movie to watch every year.I'm gonna give Home Alone an A+.",
    "102": "In the Eighties, John Hughes churned out a handful of movies and scored many, many hits. Quite rightly, as most of them were seriously funny - I'm DEFINITELY not referring to Curly Sue, so relax! In one particular scene from Uncle Buck, Macaulay Culkin interrogates a babysitter through the letterbox to make sure she's not a baddie. This inspired Hughes to write a whole new movie. Who would have known that this and its sequel would go on to become two of the biggest hits of all time? Both Hughes and Chris Columbus seem to prefer setting their movies during the holiday season (Gremlins, Planes, Trains & Automobiles, Christmas Vacation) and manage to pull them off without too much sentiment, or sickening amounts of gooey love.There are two reasons why Home Alone was such a big success. The first is that it's about a kid who outsmarts grown-ups, something that happens every day, only there's a worldwide conspiracy of silence. This movie yells it out loud and clear. The second is John Williams's magical score, which elevates the movie way above slapstick family fare to something more serious and regarded. It was nominated for an Academy Award, along with the Christmas carol Somewhere In My Memory, but lost to John Barry's Dances with Wolves. Damn! In a mad rush to the airport one morning, the MacCallister family forget one little thing...Kevin (Culkin). He is an eight-year-old kid who wants nothing better than a peaceful Christmas and some time to himself. It's hard for him to get this when living in a house with seven other people(the exact same house from Planes, Trains And Automobiles, don't you know0. With the rest of the MacCallisters in Paris, Kevin runs wild doing whatever he wants, eating whatever he wants and watching whatever TV show he wants.But there's one major problem. The Wet Bandits, Harry (Joe Pesci) and Marv (Daniel Stern), are on the prowl and have knocked off every other house in Kevin's street. His is next. And seeing that he's man-of-the-house now, he HAS to defend it.Using whatever tools are at his disposal (rusty nails, blow torches, Micro Machines) he sets up a labyrinth of booby traps, so that the Wets can't break in. Their idiot-proof determination proves to be their downfall, as they are tortured and torn-up upon entering Kevin's domain.Although this is not the only point of the film, there is an important message that family is what really matters to a child, or to anyone, and having them home for the holidays is better than wandering a huge house all by yourself.There are some movies that work best at Christmas and this is one of them. I'm not saying that in a couple of decades it will be the new It's A Wonderful Life, but it will be remembered fondly at the very least.Don't be a Scrooge. It's Christmastime. Go rush to check out Home Alone.",
    "103": "I absolutely love the first two Home Alone movies, the third one is adequate but the fourth movie is just dreadful and makes me vomit because of what it did to two underrated gems and a little -below-average follow up. Macaulay Culkin is wonderful as Kevin. In this and Home Alone 2, which is my personal favourite, he is cute and self-assured. Alex D Linz gives a spirited performance in Home Alone 3, but Michael Weinburg just doesn't do anything with the script(which was terrible), other than whine in the fourth film. Anyway back to Home Alone. Joe Pesci and Daniel Stern steal the film, with their goofiness and charm that was evidently missed in the last two instalments. Matching them, is the late great John Candy, and here he is wonderful. Candy has starred in movies like Uncle Buck and Planes, Trains and Automobiles, both of which are hilarious. Home Alone just broadens the comedic talent, that Candy certainly had. The film looks beautiful, with very good direction, and best of all great visual jokes and traps, as well as a fun and sometimes touching script. My problem is why is the rating for both Home Alone and Home 2 so low, when almost everyone I know consider them as holiday classics? All in all, a funny, touching and underrated film, that could have been a little shorter(only by one or two minutes). 9/10 Bethany Cox",
    "104": "My all time favorite film. Macaulay Culkin did superbly as a child actor, but as he grew up, he simply disappeared into oblivion. His last good film being Ritchie Rich (1994), live-action film adaptation of the Harvey Comics comic book character Richie Rich.So from his highest grossing film Home Alone to Richie Rich is only a 4 year reign. In this film we have the pairing of two talented actors in Joe Pesci and Daniel Stern(I REALLY LIKE THE WAY THIS GUY ACTS & HIS SENSE OF HUMOR!!!). They are a pair of burglars Harry Lyme (Pesci) and Marv Merchants (Stern), specializing in housebreaking when the occupants are off on holiday. This time its on Christmas. The McCallister's have planned a trip to Paris. Meanwhile Harry has his sights set on the McCallister House.However things don't necessarily go as planned... Kevin has been forgotten at home and the McCallister's realize this too late. Now Kevin is all alone against a duo of hardened(?), professional(?) crooks. 2 vs. 1 is not a fair fight(or so you think...).What happens next is why this film has become the most grossing American comedy film of 1990. I WON'T reveal what happens next, so either go see it at a Cinema you like or watch it on DVD/CABLE or ONLINE or buy the DVD either at a DVD store or online. This film has a decent sequel: Home Alone 2: Lost in New York which follows the further mishaps in the life of Kevin.Other Macaulay Culkin films worth seeing/having: Uncle Buck, The Good Son, My Girl, Getting Even with Dad, and Richie Rich.",
    "105": "This is one of my favorite movies of all time as well as one of my favorite Christmas films.It's also another one of my childhood gems, it's was just so much fun for so many reasons but also heartfelt at the same time. I really like the plotline as it's sort of a wishfulment fantasy being the man or woman of the house and just having complete freedom to do whatever you want and make your own rules.There is so much to like, from the production value, which is great, really like how the traps were set up and conducted. Even the music is great, from some soundtrack bits but it's really the score by one of my favorite composers John Williams which makes it the most memorable. From that theme song which is one of my favorite themes of all time, as it has both a Christmas tune but at the same time a sense of foreboding as it reminds us as fun and cheerful as the film is there is still trouble in paradise. But another tune which is \"All of my Memories\" is just beautiful and perfectly reflects the theme of the film.I really like the characters, from the Wet Bandits Harry and Marv played well by Joe Pechi and Daniel Stern. Both your classic comic duo much like Abbot and Costello and any other you can think about, both are so much fun as both are pretty much numb skulls.Well Harry is more the smart one of the bunch as it seems like he the only one that really supplies the brain power of their schemes. However, this guy is no genius as his Achilles heel is that he's arrogant thinking he's so clever and listens too much to his own greed which we know both these things can make people stupid or do some stupid crap.Marv is pretty much Harry's flunky as he's dumb. But what makes him really funny is how he's a bit of a man child sometimes, like having these delusions of grangur in being one of the most famous criminals in history by leaving the water running as their calling card as \"The Wet Bandits\", despite the fact he clearly needs a reality check as he's just increased their chances of getting caught and identified. But I really love some of his lines, he's got some great lines, one of my favorites \"he sounded like a snake\" I know a small line but it's funny on two counts.But of course, my favorite character is the main protagonist Kevin McCallister played well by Macaulay Culkin. I really like that he's not some stereotypical annoying all smiles kid. Kevin really felt like a real kid whom is a relatable character as some of what he's gone though is some of the things that we may have experienced a time or two in our lives when we were kids.It's interesting what kind of household he lives in which must be the busiest household I've ever seen as it seems populated with twenty plus people. I remember whenever I watch the film, I always wonder who that person or the other in the family is. I honestly wouldn't mind if they made some sort of TV program (on a premium channel) called \"The McCallister's\" where we could see Kevin and the rest of the family years later, get to know the rest of them and see what shanagans they get into. If not there's always a licensed comic book, follow up; and if one or both these happened it would be the true third sequel. Well, it's a nice thought anyway.Alright back to Kevin, he's charismatic, has some of the best lines in the film. My favorite from him is \"This is it, don't get scared now\" yeah that's the kind of line I use whenever there is a final battle in certain Horror movies or survival horror video games. The film is almost at times like a one man play sometimes as in most scenes Kevin has only himself to talk to, but he does it so well because he's got a lot of interesting things to say.I really love how smart he is, this guy you could say could almost be a genius as he's a tactician, from building those elaborate traps. However, he is still naive like a child which increases the relatability factor as we've been through that. Like one of my favorite scenes is seeing Kevin dig though Buzz's trunk and he first looks though a Playboy magazine and says one really funny line that cracked me up \"No clothes on anyone sickening\", yeah that what most of us and myself felt at Kevin's age.However, the one thing about him that makes him the most enduring is he is highly sympathetic. He has a big family but he is the only one that is the most underappreciated, doesn't really get much attention nor help when he needs and asks for it, none of the breaks and for some fraked up reason seems to be the target of ridicule for most family members, seriously what the frak is everyone's problem.Like in one scene he is trying to ask some people to help him pack a suitcase as he's never done it before, which is understandable because he's still really little which means there are a lot of things, he's never done himself before. But of course no one is or wants to help him do it, seriously not one member could take five to ten minutes of their life to show/help him pack, it wouldn't of killed them instead they act like they have more important things to do which they don't.The worst of all is Buzz, this is a guy you sort of love to hate as he's kind of funny or even just plain hate as he really presses a wrong button with you. What I really don't like about the guy is that he's is just so full of crap; from that story he tells both Kevin and another brother about a neighbor you just see as he's telling that he has a crap eating grin on his face, so you know the story is bull crap just to get cheap amusement. And another which was eating Kevin's Cheese Pizza on purpose and insulting Kevin once more, thinking he's so funny which pushes Kevin over the edge.I really love that Kevin retaliated, I'd do the same thing any bully that ever takes away my Cheese Pizza or even video game playing are going to meet Goku and Vegetta (my left and right fists); I know that sounds bold but human right need to be defended.Sadly, Kevin unfortunately get punished for something that wasn't his fault, let alone doesn't even have dinner. But the last part of that scene are really sad when instead of the mom talking and exercising understanding with Kevin to hear what really happened, she just retorts in a mocking and insulting tone, which I thought was uncool, I guess she forgot the old saying \"if you have nothing nice to say, don't say anything at all\" At that moment I just knew that was the final straw and Karma was about to come down on the family hard.There are so many great and memorable scenes and moments throughout the film, so there is hardly a dull moment.One of my favorite scenes no doubt is when Kevin is watching a gangster pic and of course he's eating probably the biggest ice cream sundae I've ever seen, man I can never eat that many scoops. That film he watches is great, I honestly thought that was a real movie but no it's not. This is something as kids we always dreamed about which was to see Rated R films without restrictions.I just love the exaggerated nature of the film as we see the lead gangster Johnny solve his dilemma with a Tommy Gun (yeah that does work every time in those pics) and he just says one of my favorite movie quotes that cracked me up, \"Keep the change you filthy animal.\" But I really like Kevin's reaction to that film as he's closing his eyes despite the fact there is no gore or squib effects. But for a kid his age that would be considered graphically violent and not something he's totally used to seeing. And this joke with the gangster movie gets funnier as we see it used in two different scenes in two different ways.And of course, there is the famous big battle near the end of the film which is in my book one of my favorite battles of all time. It's basically a home invasion battle which I think is cool because it's sort of like a strategy game battle, since the battle takes place on your own turf it makes you the general, giving you plenty of opportunities to tactically take out invaders whichever area they occupy. But of course, it's pretty much a slap stick/ physical comedy fest as we see the Wet Bandits constantly getting hurt by Kevin's traps and miraculously surviving, this was just hilarity at it's best, it made me laugh till it hurt.I'll just say a couple of my favorites as I don't want to give too much away, from the first scene seeing Kevin use the BB gun on both robbers, it's just funny how Harry reacts to the pain and he is just saying a bunch of gibberish in frustration.Another of course is the nail trap, it's funny because of just the delayed reaction as it pain doesn't even register until a little latter and I just laughed along the way.However, despite all the fun of the film this film has heart as the revolving theme is about appreciating family. There is one scene I found sad when Kevin is looking at a family whom is home for the holiday's enjoying Christmas, he has a sad look on his face, which I'll admit put a tear in my eye. That scene shows what Kevin truly wanted which was simply to have Christmas with his family. Or even some bits with the family feeling guilt over the loss of Kevin from the mom evaluating her own parenting and a member or two not enjoying their time in Paris as they know in their hearts it's not a real vacation as their family is incomplete.This just makes the pay off even sweeter, I'll just say both Kevin and the Macalister's get what they want for Christmas. No one is ever alone for the holidays as long as there are still people that love you.Rating: 4 stars",
    "106": "An eight year old boy is left home alone at Christmas when his family leave for a France vacation, not realizing he isn't on the plane with them. Two crooks attempt to rob the family home, and it is up to Kevin to protect the place! Home Alone is one of my all time favourite Christmas movies, I couldn't get enough of it as a kid growing up. There was something powerful as a child seeing another child around the same age face the bad guys and be able to defeat them. Home Alone is basically about a family that leaves for vacation, but in the rush of getting out on time they forget that young Kevin McCallister was not with them on their way to the airport. So while they take off for Paris, Kevin wakes up to find that he is all alone in this gigantic house. It's all fun and games at first for Kevin, until he discovers that a pair of thieves plan on robbing his house thinking that the place is empty. Whiz kid Kevin sets up a number of booby traps and set ups that severely injure the bandits. Examples include one of the thieves named Harry getting his head set on fire, the other Marv gets hit in the head with an iron. These kind of stunts could kill a person in real life, but the magic of movies allows the bandits to shake it off and continue their mischief.The acting in Home Alone is top notch! Macaulay Culkin is brilliant as Kevin McCallister, the scared yet empowered young boy who takes on the \"Wet Bandits\". Those bandits are played by Joe Pesci and Daniel Stern who add so much to the film with their performance. And you get some good screen time from stars such as Catherine O'Hara, John Heard and even John Candy. The traps that Kevin sets are smart and witty, and the location shots are perfect for the tricks he has planned for Harry and Marv.All in all Home Alone is a classic film not only for Christmastime, but all year round. This should be seen by everyone at least once.8/10",
    "107": "If you're reading this in 2021, then you should know that it was exactly 31 years ago, in the month of November, that Home Alone was released in theaters. That striking fact alone is quite revealing, particularly because this film hasn't \"aged\" at all and is still artistically and cinematically relevant even today.There is very little I say about this absurdly entertaining film that likely hasn't been thoroughly covered already. Home Alone is arguably the quintessential modern day holiday film that could only come from the exceptionally gifted mind of the late writer/director/producer, John Hughes. .I purchased the Family Fun Edition DVD for the generous wealth of \"extras\" which include a camera interview with child star Macaulay Culkin, loads of deleted scenes, featurettes, a handful of games, and even a optional commentary track with the director, Chris Columbus, and the featured star, Macaulay Culkin.As always, no spoilers here, but I will reveal that in \"real life\" co-star Daniel Stern has morbid arachnophobia (fear of spiders).",
    "108": "\"Home Alone\" is one of the most popular movies from the early 90's. Its success was phenomenal and it also made Macaulay Culkin a superstar.The plot is quite original and surreal: a child who is home alone and capable of making the bandits's lives miserable? Sure, it's an impossible story, but who cares? Far from being a perfect movie, it is however okay and fun to watch, entertaining and contains slapstick humor too although I don't like some of the language used. Our story takes place in Chicago at Christmas time, which makes this a Christmas film. In fact, the movie has lots of Christmas decorations, lights, snow and many other details which create the feeling and magic so characteristic of Christmas. To accent the Christmas atmosphere even more, there are a cup of nice Christmas carols such as \"Rockin' Around the Christmas Tree\" (performed by Brenda Lee), \"You're a mean one, Mr. Grinch\", \"White Christmas\", \"Carol of the Bells\", \"Oh Holly Night\" and \"Have Yourself a Merry Little Christmas\" and some brilliant instrumental musics.Kevin McCallister is the hero of the story. He's not just any kid, he's a very smart one. He also knows all about the intentions of the \"wet bandits\" Harry and Marv and prepares them lots of unexpected \"surprises\". Their lives won't be easy with Kevin defending his house. Sure, they are the villains and as such they get what they deserve, but they do suffer a lot too. We almost feel sorry for them.The \"wet bandits\" were nicknamed like that by Marv because their \"calling card\" (according to him) was to let the water running in every houses they robbed. That said, both \"wet bandits\" are hilarious. Harry is more cranky, while Marv is the most stupid of the two (although both are stupid) and maybe that's why people tend to sympathize more with him. Marv's stupidity also makes him the funniest of the two. Marv is the typical tall and clumsy guy with no brain, a bit like Averell Dalton from the Lucky Luke comics.The movie has lots of funny moments. The funniest for me is when Harry and Marv pretend to be Santa Claus and his elf and the way Harry speaks in that scene, followed by the even funnier part when Kevin fires at Harry's pants. Whenever Kevin fools the bandits in a try to make them believe the whole family is at home when Kevin is all alone is funny too. For some reason, I also find funny whenever Kevin screams maniacally (particularly when he says he's not afraid anymore and sees Old Marley and screams out loud.The scenes which Kevin fools and scares the Little Nero's Pizza boy and Marv with the gangster film \"Angels with Filthy Souls\" are hilarious, but in the case of the Pizza boy it is unfair for him. There was no need to scare the hell out of him - he was just delivering pizza and wasn't after Kevin.Old Marley is an interesting character. I always felt sorry for him because of the lies Buzz tells about him. And the man never did anything bad to anyone. Buzz is a jerk and Uncle Frank is even worse. Buzz is mean for Kevin and Uncle Frank openly dislikes Kevin. When Uncle Frank tells Kevin «Look what you did, you little jerk!», Kevin's parents should tell him something like «Frank, stay out of this and shut up!».The church is magnificent. It's one of the biggest and most beautiful churches I've ever seen in a movie. Macaulay Culkin is terrific as the clever kid Kevin McCallister. Joe Pesci and Daniel Stern are awesome as the \"wet bandits\" and Roberts Blossom is great as the character Old Marley. It's also delightful to see John Candy as Gus Polinski, the «Polka King of the Midwest».",
    "109": "There is no film to put beside Home Alone by way of comparison. It is a film genre of it's own. I read and hear reviews of this movie that express disgust and horror and I picture John Hughes chuckling. This was the intent, it was meant to upset the status quo and in \"politically correct\" times that we live in, isn't it a small surprise to see this film come to the forefront again? This is a movie that will freak out the uptight for as long as it exists in any media. It was meant to. As much as \"Clockwork Orange\" talked about \"ultraviolence\" this movie is all about ultra-bad pranks. We can numb ourselves to sex and violence but Home Alone is a movie you just will never get used to. There will be something in this movie that will get to you. As a last resort to make sure everyone is offended before you leave the theatre, John includes the always discussed paint can scene. No reason for this scene, except to make sure he gets you and also to make sure you leave talking about it. Obviously filmed on a budget, and using Hughe's stock cast, this is a movie simply about a young kid whose parents forget him while they go on vacation. All the characters are bizarre in one way or another. This movie reminds me of \"Rocky Horror Picture Show\" in that everyone in the film has something odd about them and both movies joyfully celebrate these uniquenesses. Not a movie to buy for Mom on Mother's Day... but worth seeing just to say you did.",
    "110": "This an absurd storyline. Hollywood loves to show movies in which kids are smarter than adults, for some reason. Also, we are expected to believe a big family can go all the way to the airport and then fly to France before finding out one of their kids was left at home??! I don't think so. I know a lot of big families and this would never-in-a-million years happen.However, it's just a movie, and it isn't real and you can't take any of it seriously. Thus, the idea is to go along with the wild premise and enjoy the antics that follow....and there are plenty of those!A share of the credit for the big success of this film should go to God, who made Maccaulay Culkin's face. Without it, I doubt this would have been anywhere near the hit is was, but Culkin's \"cuteness\" helps makes you root for him and his facial expressions provide a lot of laughs. He turned out to be a fine child actor.The two guys (Joe Pesci and Daniel Stern) that play incompetent crooks are funny and some of the humor is clever, although slapstick \"rules\" in this film.There are some really nice messages in here, such as \"families suck,\" says the kid. Oh, well, some think this film did, too. I am not a big fan of it, but I did enjoy it along with most other people. I thought the sequel was better, though.",
    "111": "I saw and loved HOME ALONE as a kid, particularly enjoying all the 'home invasion' traps that Kevin McCallister set up for the bad guys. Watching it nowadays, I'm surprised to see that this sequence only takes up the last quarter of the movie; before then there's a surprisingly complex storyline with some good sub-plots to keep it moving nicely along.That this also turns out to be a classic film which has lost none of its warmth and magic is the biggest surprise. Yes, Macaulay Culkin is more than a little annoying when you watch him as an adult - in fact, I remember him being annoying when I watched him as a kid - but you can forgive him because he's endearing nonetheless. Of the supporting cast, the ones who particularly shine are Joe Pesci (channelling some of that GOODFELLAS energy), Daniel Stern, and Roberts Blossom (DERANGED).The film was written by John Hughes, so the expected sentimentality is here, but somehow it never becomes too cloying - you can live with it, because there's plenty of good stuff elsewhere. That home invasion stuff is still superbly directed, surprisingly violent, and very funny, and there's so much ingenuity packed into the running time that this is a film impossible to dislike. In fact, I still love it.",
    "112": "I HAVE REVIEWED OVER 400 (C H R I S T M A S ) MOVIES AND SPECIALS.BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I AM HONEST! I REVIEW MOVIES & SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY Christmas MOVIES AS I CAN. Maybe the most successful \"Christmas Movie\" of all time and it's easy to understand why. The film made Macaulay Culkin a household name and the biggest child star since Shirley Temple. In this film a child get left behind on accident in his Chicago home while his family has flown off for Christmas.This film takes place in Chicago, the McCallister family is preparing for a Christmas vacation in Paris. On the night before their departure, the entire family gathers at Peter and Kate's home, where their son, Kevin, is ridiculed by his siblings and cousins. After a scuffle with his older brother, Buzz, Kevin is sent to the third floor of the house, where he wishes that his family would disappear. During the night, heavy winds cause damage to power lines, which causes the alarm clocks to reset; consequently, the family oversleeps. In the confusion and rush to get to the airport in time to catch their flight, Kevin is accidentally left behind.Later, Kevin wakes up to find the house empty and, thinking his wish has come true, is overjoyed with his new-found freedom. However, Kevin's joy turns to fear as he encounters his next door neighbor, \"Old Man\" Marley, who is rumored to have murdered his family with a snow shovel in 1958; he also encounters the \"Wet Bandits\", Harry and Marv, a pair of burglars who have been breaking into other vacant houses in the neighborhood and have targeted the McCallisters' house. Kevin initially manages to keep them away by making the house look as if the family is home, but they eventually realize the deception.This film is one of the best Christmas movies however at first it is a little slow on the set-up.",
    "113": "How could this film get only a 6.5?Yes, it's a kid's movie, but I know plenty of adults(not including myself) who loved this film. It touches our hearts, and tickles our funny bones. Not to mention I think in one way or another we could relate to it. That's why it remains a classic Christmas comedy.Home Alone is not only one of the highest box office successes of all time, but it deserves more praise. Mac showed a talent that very little child stars have now-a-days. He brought in a great comedy about a boy who accidentally is left home alone when his family goes on vacation and takes on two burglars.Yeah, it's quit unrealistic about the burglars, but honestly, this is a terrific family film. Joe Pesci and Daniel Stern are the perfect comedy duo of two idiots who can't rob the place because a 8 year old child has out witted them and set some clever and very funny traps around the house.",
    "114": "First off, I would like to say that John Hughes has fallen in ability since Planes, Trains, and Automobiles.  This movie is a shining example of that. My sister saw it when it was first released in 1990 and told me that \"it sucked\", she was in third grade.  I didn't see it until last week and can almost agree with that, but not totally.  As far as so-called 'Holiday movies' go, Die Hard and Gremlins will remain my pop culture mainstay.Home Alone racks up plot holes faster than the Wet Bandits fall down.  They are so dumb that they make the Three Stooges look like the Untouchables.  To think that Joe Pesci belittles himself into a role like this is beyond my belief.  Being outsmarted by an eight-year-old is not the best thing to include on his film resume.  The film would have ended a good 30 minutes earlier if Kevin had acted like a normal kid and don't the smart thing instead of being a defensive snot.Chris Columbus has always had a fascination with kiddie comedies and this is not his best effort.  Thankfully he is not so much in the pursuit of money (as with Harry Potter) as he is with the pursuit of political correctness. It's not surprising that the script it Hughes' work, there are so many of his little touches throughout.If I can say one good thing about this movie, it's the music.  John Williams KNOWS how to write music and this movie is a perfect example.  The film certainly has a nice Christmas ring that contrasts with the ever cloudy skies.Overall, there are good movies for the holidays and good movies for kids. This one might fit their bill, but everyone else will find it to be a watch-checker after a while.  2 out of 5 stars.",
    "115": "I honestly cannot believe it has been 30 years since Home Alone came out and still to this day I love watching it.Home Alone follow Kevin McCallister, an 8 year old kid, who accidentally gets left home alone by his family as they go on a trip to Paris. Whilst being home alone, Kevin has to protect his home from a pair of burglars named Harry and Marv.This is a very special film to me and most likely to a lot of people. I remember watching this in school and at home all the time as a child. It's one of those films that I could watch on loop without ever getting bored and it's one of my favourites to watch during the Christmas season.The script by John Hughes is as hilarious as it is heartwarming. There is so much fun to be had with a concept like this and, sure enough, it's hilarious but Hughes balances out the humour with scenes that warm your heart as we see Kevin's character develop when he begins to understand the importance of family. To be fair, you do have to suspend your disbelief with the cartoonish violence and corny nature of the film but those aspects don't really bother me because of the amount of fun I have watching Home Alone.It's not an easy job to carry a film especially for a child but Macaulay Culkin manages it with ease. He makes Kevin so likeable and we root for him the entire time. It's a great child performance. The best part of the film are the burglars played exceptionally well by Joe Pesci and Daniel Stern. These two make this film a laugh riot and their chemistry with one another is simply magical. Pesci and Stern are so entertaining to watch that there's no way I'll ever forget their characters.I don't think I'll ever forget Home Alone. It had such a big impact on my childhood and it's one of those feel-good movies that puts a smile on my face each time I watch it. It's perfect for Christmas and one which the whole family can enjoy.",
    "116": "Home Alone (1990)*** (out of 4)Blockbuster dealing with eight-year-old Kevin McCallister (Macaulay Culkin) who after a fight with his family wishes that he never has to see them again. The next day Kevin wakes up with his family no where to be found. He believes that his hopes have been answered but soon he's having to deal with a couple burglars (Joe Pesci, Daniel Stern) who have their eyes on his house.If you were around in 1990 then you will remember the tremendous success that HOME ALONE had with critics, fans and at the box office. To say the film was a landmark would be an understatement because the film was a huge hit and has gained plenty of fans over the years. After twenty-six years I think it's safe to say that the film is a new classic. While the film isn't perfect it's certainly a lot of fun and perfectly captures the manic spirit of Christmas time.What makes the film work so well is that it's a perfect child fantasy. I'm sure many kids have wished that they were the boss, the keeper of the house and that the adults would just go away. This film works perfectly fulfilling that fantasy but of course there's the more touching moments thrown in for good measure. What makes the film a classic are the battles between the kid and the burglars. Culkin, Pesci and Stern would all become household names after this film and it's easy to see why.Culkin is absolutely adorable as the brat kid who finds himself home alone and doing battle against his fears as well as the two bad guys. The violence in the film is in the same field as The Three Stooges and it works perfectly well. Not only does the violence work but it's perfectly sold by Pesci and Stern who are terrific and easily steal the film as Harry and Marv. The two of them have perfect chemistry together and they really make for a great comic team.The supporting cast is very good with the likes of John Heard, Roberts Blossom, Catherine O'Hara and John Candy all doing fine work. Another major plus is the score from John Williams as well as an all-around great charm. The film contains some great laughs throughout and I think after all these years it's fair to call it a classic.",
    "117": "The first time I saw this film was when I was a child and it pleased me a lot because I only saw its comic side. I saw it recently and it disappointed me although the story is original: during Christmas holidays, the McCallister family decided to celebrate Christmas at Paris, unfortunately they forgot one of their children. First of all, Kevin is elated but he realizes that two thieves want to burgle his house. In order to get rid of them, he puts in several traps; the thieves are under arrested and Kevin finds again his family. If I had to choose one adjective to judge this film, it would be the term: conventional. Several sides of the film are showing it. For example, Kevin's family seem to ignore and despise him and consequently he feels rejected and outraged and ,at the end, his family and especially his mother discovers how much she loves him, moreover, they say that Kevin's neighbour is a killer and he's got a wicked reputation but Kevin finds out that he's not a murderer and he had an unhappy life. Not only is the film conventional but the screenplay is sometimes predictable : when Kevin finds out that is \"home alone\" he wants to have fun as much as he can, and finer feelings are often put forward . Nevertheless, Daniel Stern and Joe Pesci, the two thieves are very entertaining and the sequence where they have to endure Kevin's traps is very funny. At last, I think that this film was especially made for children and young teenagers and it was useless to make it follow by two poor sequels.",
    "118": "It's that time of year again, the time of year when it is acceptable to binge on Christmas films. The first one I watched this year was Home Alone. It is a classic for me, certainly a child hood favourite!The story is a very simple one; Kevin McCallister (Macaulay Culkin) is accidentally left at Home over the Christmas as his whole family fly to Paris. They board the plane without realising that they have left one of their Children home alone! Two small time robbers are also in the area, looking to break into houses, they target the McCallister household as they believe they are all away for the Christmas holidays. It is now up to Kevin to protect his house from the burglars by setting up traps and playing pranks, some of which are absolutely brilliant! The two Robbers; Marv & Harry, played by Daniel Stern & Joe Pesci, give fantastic performances. They portray the classic dumb & dumber routine. Harry thinks he is the brains and sees himself as the leader & Marv plays the really stupid, gullible one who falls for much more simple traps. The on screen chemistry between these two and the relationship they have is fantastic, it comes across very realistic and hilarious.Macaulay Culkin was 9 or 10 when Home Alone was filmed and given such a big role with this much screen time must have been a big challenge but he walked it and gave a very convincing performance. The Home Alone films are pretty much all he has been known for, which is a shame really, he had a few other films but none are as well-known and successful as these. Of course this isn't the most realistic films and it does have massive plot holes and ridiculous scenarios, but who cares. It's fun! It's Christmassy & It's got great characters with some truly hilarious moments.Overall, Home Alone is a very fun movie; I have the relation to it as it was always on at Christmas when I was a child. But even if this isn't the case, I'm sure many adults who are new to this will love it just the same as us who have fond memories of watching it as a child!8/10",
    "119": "Home Alone (1990) is a movie my daughter and I recently watched together on Disney+. The storyline follows a family that gets together for the holidays for a trip to Europe. In the morning of the trip it gets so busy with family, neighbors and friends that they accidentally leave without the youngest child, Kevin. Kevin will need to survive the holidays on his own which includes creepy neighbors, cooking for himself...and thieves...This movie is directed by Chris Columbus (Harry Potter and the Sorcerer's Stone) and stars Macaulay Culkin (The Good Son), Joe Pesci (Goodfellas), Daniel Stern (City Slickers), John Heard (Big), Catherine O'Hara (Beetlejuice) and John Candy (The Great Outdoors).There is so much that is outstanding about this movie. There is a great set-up of the family dynamic and how busy it is. The gangster movie throughout the film was perfectly selected. The circumstances are fun to watch. Caulkin executes his role to perfection, like Peter Billingsly as Ralphie in Christmas Story. The robbery scenes are cinematic gold and make you laugh every time you see them no matter how many times you've seen them. There's also some fantastic cameos in this as well.Overall this is a 90's Christmas Story that is timeless and will forever be one of the great Christmas classics. This is an easy 10/10 and a must see.",
    "120": "This is one of the most popular Christmas movies ever. Name me at least one person who doesn't even know about Home alone, let alone haven't seen it. This movie is just fun. It's about Kevin McAllister (Maculay Culkin) who isn't exactly an angel in his family, a lot of relatives think that he's naughty, messing around during dinner time and getting time outs. But on the day his family leaves to their Paris vacation, they accidentally leave Kevin Home alone (hence the name) and he can finally do what he wants. But they are also Marv and Harry, burglars who enjoy stealing stuff on holidays. At this point, Kevin has to face his fears and protect his home. The traps that the little boy created are funny. My favorite scene is the \"Angels with filthy souls\" one. Where he pranked the pizza delivery guy and Marv with Harry by using an old 30-40s gangster movie audio where a man tells if they don't leave he will shoot on a count of 3. That was so hillarious! The acting is great from everyone, not just Culkin, but also Joe Pesci (Harry), Catherine O'Hara (Mrs McAllister), Daniel Stern (Marv), Devin Ratray (Buzz) and others. Also I like that mysterious old man named Marley who is rumoured to have lots of crimes in his hands according to the older brother Buzz, but he's just a lonely neighbour and not a criminal to be scared of.I just love Home alone and it's a perfect choice for a Christmas movie for both children and adults! It was super successful and made 5! Sequels, but only one has Culkin, the rest have other young actors, who I doubt will overdo his talent. Definitely a must watch for a winter/Christmas/New year atmosphere!",
    "121": "A Chicago family go to Paris for Christmas and accidentally leave their youngest son behind to fend for himself against a pair burglars.When I first saw the trailer for Home Alone, I was curious but unwilling to suspend my disbelief of John Hughes' concept enough to watch it in a movie theatre. After renting the video tape, I regretted my earlier decision because I wholeheartedly accepted what happens to Kevin McCallister. This is partly because everything you are shown in the set up to his predicament is wonderfully cinematic, particularly the family dynamics and all the little moments that connect to things that come later.We then witness Kevin's character steamroll his way through an arc, transforming him from a chaotic and sometimes frightened child, through to responsible homemaker, valued confidant and finally to become the king and defender of his castle. Anyone who questions a child actor's ability to carry a film should take note that Macaulay Culkin with a pitch perfect script proved it can be done spectacularly well.The performances of all cast members playing the McCallister family are brilliant, bouncing off each other wonderfully. Memorable cameos come every other scene with the likes of Ralph Foody, John Candy and other supporting characters adding more layers of humour.The other stars of the film are Joe Pesci and Daniel Stern as a criminal incarnation of Laurel and Hardy. They have epic screen chemistry and their slapstick sequences, with the help of some fabulous stunt performers, are what make the film something to be treasured and rewatched.John Williams elevates it further with a classic soundtrack that oozes kinetic mayhem, warmth and Christmas spirit.For those interested in production design, Home Alone is a virtual 'how to guide' for a Christmas themed movie on a low budget. Almost every scene and character is a perfectly coordinated shade of red and green.The ending is a bit overly sentimental for my usual liking, but at Christmas who wants anything other than something to make them laugh and smile.I have gained a greater respect for the cinematic craft on display since finding out it can hold my two year old daughter's attention for the duration.",
    "122": "This is just one movie that I cannot stand.  I am not wild about movies that are mainly about kids who get the best of adults, and this definitely fits the bill as one of those movies.  What really gets me, is this kid would not have gotten into all the trouble he did if he wasn't such a brat.  The family is trying to organize this big trip with all these other relatives, and all the their younger son can do is whine and complain.  \"I don't want to sleep with that kid\", \"I have to have my pizza a certain way\", stuff like that...and he is supposed to be the kid we are pulling for?  We get to see him left alone and do all the things kids do when they are left alone. Watch black and white old movies.  Yes, and this kid is such a wimp that a black and white mobster pick scares him.  Though he uses it so wisely later in the movie (yeah right, that would work).  This kid somehow outsmarts the two thieves even though earlier one of them is smart enough to impersonate a police officer and check all the security of the houses in the neighborhood. I guess his intelligence went down a notch or two.  Then there are the many clever traps that usually consist of someone getting hit in the groin area...ha ha ha!  It is always so funny to see someone get hit there and writhe in agony.  All in all this is just one bad movie that I did not care for at all.  I just wish the kid got into some kind of trouble for all the problems he caused.",
    "123": "This is an odd one; I can't tell you how many times I've seen this film, yet every time is like the first. It just makes no lasting impression, and I'm always left feeling kind of cheated. The real problem here is that the only truly entertaining thing in the film(not the only funny, mind you) are the scenes of Kevin scaring off the burglars and the finale(which I won't write here, in case anyone reading this review hasn't seen the film yet). That's it. The rest of the film, sure, there are funny scenes, lines and such... but no real entertainment. The scenes of Kevin by himself, in the house, doing adult stuff are cute, but once you're over the age of ten, you won't really find them entertaining or funny... maybe you won't even see the charm I'm certain I must have seen in the scenes when I was younger. So what are we left with? Plenty of humor, some of which actually works and a few scenes of entertainment. About ten minutes of actual entertainment scattered over just over 100 minutes of film. That's just not enough. The plot is decent, but derivative and unoriginal. The characters are cardboard cutouts. The acting is fine, but no one is particularly impressive. John Williams' score is pretty good. What really bugs me about this film is the portrayal of violence as fun, and OK as long as it's against criminals. This is a film for children; is it really a good idea to show violence like that? To make it fun... and OK? I recommend this film only to people who are too smart to copy it... and it helps if you have a childish sense of humor. 6/10",
    "124": "Some movies are made strictly for adults. Others will bore the heck out of us \"seasoned\" viewers and appeal only to children. Luckily, this movie is made for everyone!For a basic plot summary, \"Home Alone\" sees young Kevin McCalister (Macaulay Culkin) waking up a few days before Christmas in a completely empty house, his extremely large and rather disorganized family having left him behind on their trip overseas. While the family tries to get back home, Kevin must outwit a pair of two-bit thieves (played by Joe Pesci and Daniel Stern) who want nothing more than to loot his home.What really makes this film special is the wide appeal of the humor. One could literally sit down with the entire family (from young to old) and watch this movie, and everyone would be laughing all the way through. From young Kevin's attempts at \"holding down the fort\", to the bumbling burglars played brilliantly by two veteran actors, this is the type of movie that you will be quoting long after the TV is turned off.Thus, I highly recommend \"Home Alone\" to quite literally anyone, especially during the Christmas season. If you have a list of \"Must-See\" holiday movies, this one should be right next to Frosty, \"Wonderful Life\", and claymation Rudolph!",
    "125": "Home Alone (1) (1990) -There was a time when I found this film to be really quite annoying, but I have come to love it over the years and it is most definitely included on my watch list for every Christmas.The film was full of great characters and silly situations that were so extreme that they can only be funny.I actually thought that Kevin was a bit dumped upon and the fact that his parents left him at home on his own, shows their lack of time for him, so it's no wonder that he acted up occasionally. If I were the parents, I think I would have stopped having kids after Buzz was born, because - What a nasty child he was?Weirdly, I think the film had some moral content as well as being a laugh-fest of slapstick shenanigans, as Kevin defended his home against two inept burglars and learned to be more mature and not to judge his neighbour based on rumours. He was quite a smart kid and had the potential to be lovely, with his naivety and innocence, if someone would have just given him the time of day. He was a scared little boy, who did the best in a bad situation, that wasn't really his fault.There were some lovely touches included, comically and with emotional depth and a clever mind must have come up with the execution of Kevin's house defence plans.The soundtrack was also superb, full of classics and incidental music that have become part of our culture.Could you defend your house in the same situation?950.91/1000.",
    "126": "When it comes to enjoying that jolly time of year, there are several movies that must be viewed or else it just isn't Christmas. One of those is 1990's \"Home Alone\". Written and produced by the late, great John Hughes and directed by Chris Columbus, it follows the story of young Kevin McCallister (Played by Macaulay Culkin, arguably the best child actor since Shirley Temple) who's constantly picked on and looked down upon by his large, extended family but especially by his older and much hated brother, Buzz (Devin Ratray in what has to be his best role). On the eve of the big family vacation, Kevin lashes out and gets sent to the attic by his impatient mom (The talented and ravishing Catherine O'Hara) and right then Kevin makes the prophetic wish of never seeing his family again. Little does he know, his wish is about to come true when due to a convenient power outage, his parents' alarm clocks fails to go off and the result is sheer holiday hell as everybody scrambles like there's no tomorrow to catch that flight. Everybody that is, except little Kevin who's forgotten by everyone and as the title says, is left home alone. Shock turns to happiness as Kevin realizes his wish has come true.But it's not all fun and games as two naughty burglars Harry and Marv (Joe Pesci and Daniel Stern who give a wonderful performance together as the two bumbling thieves) are on the rampage in Kevin's neighborhood. Rather than running away like most kids might do, Kevin decides to fight back using his creativity and some simple but potentially bone shattering traps. It all might sound like a simple holiday comedy to be watched and then put away, but there's something more to the film that keeps me and many others coming back year after year. To be sure, the physical comedy of Harry and Marv getting their asses handed to them by Kevin's traps is nothing short of a laugh riot (Traps include anything from heated door handles to slippery steps).But the film also manages to include a lot of heart as Kevin slowly but surely begins to realize that family is what the holidays are all about and without them it's pretty lonely, a lesson he learns first hand by the at first feared but then loved neighborhood recluse, Old Man Marley (the late, great character actor Robert Blossom). John Williams score to this is undoubtedly one of his best as it is both grand and yet not overbearing in the least. On the contrary, it manages to invoke the spirit of Christmas in all of us while giving us the chills because of its beauty. And of course, who can forget the performance of Macaulay Culkin since the film rests on his shoulders more than anything else. With his mischievous grin and resourcefulness, we just can't help but love his character and root for him all the way through the film. I should also mention that the movie includes a small but very memorable performance by the legendary John Candy (Try not to laugh at the conversation he has with Kevin's mom in the back of the van!). \"Home Alone\" is one of those films that no matter how many times you might see it, it just never gets old. The movie is a time capsule in many ways because it somehow captured not only the holiday spirit but also the magic of the time it was made in, the 90's, a time where not only were the movies better but so was everything else. It is for that reason that movie will live on forever and ever, much like the spirit of Christmas itself. So without further adieu, I urge you to watch this modern classic and if you're ever going on big trip with the family, make sure that you have all your children! Also starring John Heard and a host of other memorable actors. Merry Christmas everyone!!!!!!!",
    "127": "A movie that very much came to define the decade it started. Home Alone is a cheesy, lighthearted, popcorny action-comedy-drama. And a really good Christmas movie to boot. Kinda like Die Hard.We all know the story, I trust. Kid gets left behind during the holidays and then has to defend his house against a couple of bumbling burglars. Traps are involved. Traps to make the Looney Tunes proud.And it works, it really works. But I would argue that the reason this film has stayed with people and the reason we still watch it, is because the director Chris Columbus injected in so much Christmas spirit that you'll be stuffed to the brim with it. This is a colourful movie with beautiful sets and enough Christmas lights to provide for an international airfield. It has Christmas songs, Christmas classics on TV. It has a great tree, great morals, and it's just to very Christmassy.At the center of this is Kevin, played by Macaulay Culkin. A wide-eyes, precocious little brat that manages to pull off the almost impossible feat of acting realistically childlike - you know, like a sociopathic, greedy little monster - but still coming off as sympathetic. And sure, in his heart he's a good kid, but the reason we like him is because he's so cheerfully blood hungry. And because he honestly and purely loves Christmas.Is it an odd movie when you think about it? Yeah, a bit. Is it a bit painful to watch all those traps as an adult with a working knowledge of physics? Yes, oh very much so. Is it still a ton of fun? Absolutely.",
    "128": "I had never seen this and got the opportunity recently when the child in my life begged to rent it as she had heard wonderful things about it.I expected fluff, a simplistic plot and two hours of enduring the smarmy child actor Macauley Culkin. Not too bad a trade off so that the child would enjoy a movie she wanted to see.Oh dear. Halfway through it I looked at her and said what would you rate this one out of 10? 5, was the response. We are expected to believe that an 8 year old who cannot tie his own shoelaces comes up with incredible booby traps for some burglars who want to rob the house (rigging lines between trees, heating up door knobs to name very few out of many). One with a master's in engineering would not be able to figure out most of them.But the very worst features were these dim-bulb parents who sit in first class while their children go unsupervised in economy on a flight to Paris (9 hours, people!)who cannot fire up a brain cell between them in Paris to get the police, Children's Aid, emergency services (they never have friends and relatives in Hollywoodland)to go to the house and get the child.How hard is it to count your children when you have only three??? The child has not been streetproofed and does not know to call 911 either. And on and on.It is one of the most appalling movies I have ever seen. At the end the child and I agreed, 4 out of 10.The old man (Roberts Blossom) was sweet and Catherine O'Hara, whom I normally admire, is right up there with horror moms of all time.",
    "129": "Take a cheeky eight-year-old, put him in a situation he has to slapstick his way out of with the kind of antics most cartoon characters wouldn't survive, and what you have is one of the most wildly popular, commercially successful comedies of all time.  And when it's over, though most likely you'll have had a good time, you'll be tempted to ask the question:  Why? Because `Home Alone,' directed by Chris Columbus and written by John Hughes, is mediocre at best, though it does have it's moments.  It's a matter of the filmmakers being very astute, perhaps, and wisely mixing in a potpourri of elements with universal appeal and touching upon that common nerve they calculated would give just about anyone in the audience something to which they could relate.  And they were right.  Kids, Christmas, family, vacation, independence, a scary situation; it's all in here.  But, interestingly enough, it lacks the sentimental value that would seemingly have made this a movie one could truly embrace.  As it is, it's engaging fare, but somehow manages to keep the viewer at arm's length.  Then again, maybe that's even part of the appeal; it may be that audiences at this particular time and place were more comfortable just watching without having to invest anything of themselves in order to have a good time.\tThis was, after all, 1990, and this film played to a generation weaned on more than a decade of Saturday Night Live, whose keen sense of biting satire and parody definitely had an influence on the mind-set of audiences everywhere.  And is that a bad thing?  No, absolutely not.  It merely points up one possible reason why a film centered around an eight-year-old with a somewhat derisive attitude could be so wholeheartedly received.  Also, it may be that the second half of the film, with it's over-the-top slapstick, is what made the final impression on the audience.  And this IS funny stuff; and it's going to get to even those who usually prefer humor that doesn't involve slapstick, because it's so well done.  Again, credit the filmmakers with having their fingers on the pulse of our culture and standards at the time.  But you also have to give credit to Joe Pesci and Daniel Stern who bring the `Wet Bandits,' Harry and Marv,  to life, and know how to put across this kind of comedy, which is no easy task.\tThe story itself is simple:  The extended McCallister family sets off for a Christmas vacation in Paris, and inadvertently, Kevin (Macaulay Culkin) gets left behind.  Left alone.  At home.  Where, rising to the occasion beyond anything even the most prodigious teenager could manage, he discovers the thrill of being independent and thwarts a pair of bungling burglars in the balance.  Meanwhile, mom and dad (Catherine O'Hara as Kate, John Heard as Peter) go out of their minds when they get to Paris and discover what has happened.  If only they knew what an ingenious and imaginative son they had...\tCulkin is certainly a cute kid, but can he act?  Well, the jury is still out on that one.  It's hard to say, since the dialogue he is given is so ridiculously above that of an eight-year-old, and the situations he encounters are so far-fetched, that there is no real frame of reference by which to consider it objectively.  His timing and rhythm are lacking, however, that much is clear.  His responses-- or, if you will, the punch lines he delivers-- are always a beat behind what they should be.  And it robs the humor of the spontaneity that would have made it funnier, even hilarious.  As it is, the only real laughs come from Kevin's assault on the Wet Bandits, and there are plenty to be had there.\tPesci and Stern become the real stars of the show as they play out their slapstick antics, which are truly deserving of the laughs they generate. Their expressions of incredulity in the face of the violence that is visited upon them is what makes this movie.  Everything else merely sets the stage for Harry and Marv's descent into the maelstrom.  And what Pesci and Stern do here should not be taken for granted, nor taken lightly artistically.  To put this kind of humor across takes some real talent on the part of consummate professionals, and Pesci and Stern certainly deliver it.  Their secret?  They play it straight, which keeps the silliness out of it.  Had they played it strictly as farce, it simply wouldn't have had the same impact; but by playing to the characters in the situation, rather than to a situation involving characters, it works.  And, once again, chalk up another one for Columbus and Hughes, who really know how to deliver this kind of material.\tThe only truly poignant moment in the film involves Kevin's encounter with a mysterious neighbor, `Old Man Marley,' played wonderfully by character actor/poet Roberts Blossom.  The revelation of his secret earlier in the film sets up the purest moment of the ending, and though it is brief, it's inspired and adds a much needed perspective to the story.\tThe supporting cast includes Devin Ratray (Buzz), Angela Goethals (Linnie), Gerry Bamman (Uncle Frank), Hillary Wolf (Aunt Leslie), Ralph Foody (Gangster Johnny), Billie Bird (Irene), Bill Erwin (Ed) and John Candy, memorable in the role of Gus Polinski, the Polka Band shuttle Chief. Considering the ratio between this movie's substance and the success it still enjoys today, `Home Alone' is something of an anomaly in the history of the genre.  it lacks insight, yet delivers some real belly laughs.  It lacks a single character the audience can truly embrace, yet is accepted overwhelmingly as is.  It lacks inspiration, yet is an inspired film in the way it is crafted and delivered.  It's one you're probably going to like and enjoy, but upon reflection may wonder, `Why.'  And the answer?  Who can say. Go figure.  It's the magic of the movies.  6/10.",
    "130": "Eight year old Kevin McCallister (Macaulay Culkin, in his appealing break through lead performance) is frustrated enough with his family to \"wish them away\". And he gets this wish, sort of, when the entire family - parents, siblings, aunt & uncle & cousins included - is in such a rush to get to the airport in time for a trip to Paris that they leave him behind. At first, he has great fun with his temporary freedom and independence, but will eventually have to save his house from being burgled by a bumbling pair of oafs, Harry and Marv, played by Joe Pesci and Daniel Stern. This he does by staging an elaborate series of booby traps.\"Home Alone\" is a pretty charming little family comedy that does have quite a bit of heart to go along with all of the farce and slapstick. This material is indeed pretty funny, with Pesci and Stern playing their slow witted lowlife criminals for all that they're worth; some of their facial expressions and reactions are just hysterical. Some of it may be a bit much, and may not jibe that well with the more serious portions of the movie, but it's doubtful many kids watching are going to care that much.It does, in the end, make a very good case for the need for family, how we're perfectly capable of taking our loved ones for granted, how to deal with one's fears and do some growing up, and in the case of Old Man Marley (the excellent veteran Roberts Blossom), how it's never too late to mend relationships. The wonderful scene between Culkin and Blossom in the church where they make a connection is indeed the best moment in the entire picture. Kevin's been administered (erroneous) warnings about the old man's supposedly sordid past, and is understandably afraid of him, and realizes how one shouldn't be too quick to believe that sort of thing.Lovely funny woman Catherine O'Hara also does extremely well in the role of the mother willing to do anything that's humanly possible in order to atone for what she feels is an unforgivably stupid mistake. It's truly a treat to see her reunited with 'SCTV' co-star John Candy, who's as engaging as ever in his cameo role as polka star Gus Polinski. John Williams supplies an expectantly catchy score and touching song (both Oscar nominated, with song lyrics by Leslie Bricusse).Good fun overall, with a bright wrap- up, it's not surprising that the movie would have been such an enormous hit over 20 years ago, and it continues to entertain today.Seven out of 10.",
    "131": "My response to this movie is strictly prejudiced. For all it violence and lack of verisimilitude, I get a kick out it ever time I see it. If one can't get past the fact that the Wile E. Coyote element is in here (where no one ever seems to get hurt, no matter what), you aren't going to have much fun. With that caveat, the movie is a bit of a hoot. McCauley Culkin came to stardom in this (it's too bad his life became unsettled after this). Watching Joe Pesci and Daniel Stern, the ever optimistic though doomed villains, continue to fight a losing cause against an eight year old is the stuff cartoons are made of. Their mugging as they try one thing after another, only to be thwarted, is great fun. The subplot of the mother hooking up with a polka band, led by the inimitable John Candy, adds an element of joy. There is also the relationship that grows with a frightening man next door who has been tabbed a murderer by the insensitivity of the neighborhood kids. This man is estranged from his son and has lapsed into a sad existence. This raises this up from just a kid movie to one with a bit more substance. Anyway, don't take it to seriously and one may have a bit of fun at the holidays.",
    "132": "I guess back in 1990, if you left your eight year old son home alone for almost a week, children services wouldn't get involved. My, how times have changed. Now, you leave your kid alone for five minutes and children services and the media grill you on the five o'clock news! However, Home Alone had a good premise I suppose; a boy defending his home against burglars over Christmas break.What could possibly go wrong? Almost everything that could possibly happen, that's what! MacCaulay Culkin plays Kevin McAllister, who gets left home alone. That's when the antics start. Chris Columbus did a great job directing the film from a story by John Hughes.Joe Pesci and Daniel Stern costar as the bad guys who call themselves the 'wet bandits'; a duo who bumble and burglarize. In the end though, good wins out over evil. And Kevin is reuinted with his family.",
    "133": "If you don't like Home Alone then you're either a robot or a zombie. Home Alone was one of the best comedies of 1990.Macauley Culkin plays Kevin McAllister who as the title suggests, is left home alone when his family goes on a trip. At first, he enjoys life as he gets the run of the house but soon starts to miss his family. Then things get worse as two bumbling burglars played by Daniel Sterns and Joe Pesci target his house...Although I was an adult when I watched this film, I could still see why Kevin McAllister appealed to kids around the world. What child hasn't wished they could spend some time alone in their house free to stay up and do what they want? There are some fun scenes throughout especially one when the pizza delivery man comes calling.The burglars are very well played by Daniel Sterns and Joe Pesci (both as clumsy as each other). At first, Kevin fools them making them believe he is not home alone but they soon become wise to his act and break in...that is when the fun starts as Kevin uses dozens of household items to fight them. Everything from irons (which he uses to hit their heads) to christmas decorations with sharp ends which Daniel Sterns steps on.It's hard not to thoroughly enjoy a film like this, especially as it appeals to all of us (adults and children) who have wished we could just have the house to ourself and do what we please. This is a great film which I thoroughly recommend and it was followed by two great sequels.",
    "134": "Home Alone is really the movie that refuses to die. It's a guarantee that, from November 1 to December 25, no matter where you live in the world, there's always a channel airing this movie. It's earned the disdain of some (as a result of overexposure) and the delight of others, particularly child star Macaulay Culkin, for whom this film is still a steady source of guaranteed income.There's just something about Home Alone that makes it particularly special. It has a color palette that just feels like Christmas, with a score that has everything you need for the quintessential \"sound\" of Christmas.Macaulay Culkin brilliantly carries this film as young Kevin McCallister in a performance that will forever be regarded as one of the best from a child actor. After wishing his parents would \"just disappear,\" Kevin wakes up to find that, in the hustle of getting to the airport for their vacation on time after sleeping in, he was left behind. Now the \"man of the house,\" Kevin needs to protect the house and survive on his own. Of course, being a slapstick comedy, hijinks (in the form of Daniel Stern and Joe Pesci) ensue.One thing Home Alone does really well is deliver a ton of heart. Culkin knows exactly what is needed to pull off the emotional power of the scenes. You can watch this film and genuinely feel the loneliness and desire he has to be with his family; the regret he feels for the things he said to them. And, as Christmas day gets closer and the family does all they can to get home with him, you can't help but get a tear in your eye.It's one of those rare, perfectly-balanced movies that can make you laugh, cry and feel uplifted all at once, and with an impressive supporting cast around Culkin. There's definitely a reason why this film is so highly regarded, and it's one that will outlive all of us. Truly, a timeless Christmas classic.",
    "135": "Everybody tries hard, but \"Home Alone\" doesn't work nearly as well as its popularity suggests. Macaulay Culkin became a household name starring as Kevin McCallister, a precocious eight-year-old accidentally left behind when his family heads out on a holiday vacation. If fending for himself weren't enough, Kevin must also contend with two bumbling burglars (Joe Pesci and Daniel Stern), who have targeted the family home.I first saw \"Home Alone\" when I was 10 years old. I didn't find it at all funny then, and its genius still eludes me. The alleged \"humor\" that everyone seems to love stems mainly from a series of violent booby traps Kevin sets up to stop the bad guys. Among the deterrents the burglars so wittingly fall for is a red-hot doorknob. Looks painful, but hardly funny. The film tries to handle such physical abuse like an old Road Runner cartoon, but when the action involves real people instead of an animated coyote, something is lost.Yet \"Home Alone\" isn't a total disaster. The performances are great and the story is at times quite charming, particularly the subplot involving the supposedly scary old neighborhood man. Interestingly, the sequel -- \"Home Alone 2: Lost in New York\" -- marked a notable improvement.",
    "136": "I can only watch this movie if I fast forward past the scenes with Kevins family. His parents are ignorant uncaring people as are his cousins who are the ugliest meanest kids ever. His Uncle is a lowly POS mooching ahole as is his bullying foul mouthed toad of an older brother. I hated all of them and wished the plane the were on would crash . There is one scene where the POS Uncle tells his wife to steal the silverware they are given on the plane .I mean what a scumbag.The best parts of the movie are when Kevin and the 2 bumbling crooks Marv and Harry are onscreen. There's also a scene with the older neighbor in a church that is really tender and heartfelt. Even after the family returns at the end of the movie, they still show little concern or sympathy for Kevin after leaving him alone- they are selfish mean spirited people who just walk away and leave Kevin by himself again . 7/10 - I take away 3 stars for the awful family .",
    "137": "\"Home Alone\" went on the become a box office sensation when first released in late 1990. It stayed at the top of the box office as the #1 film for its first 12 weeks of release. Quite impressive. Kids of all ages just loved this movie about a little 8-year-old boy who gets accidentally left home all by himself after his family rushes off to spend Christmas in France. Macaulay Culkin is terrific as Kevin, the boy left home alone. He pretty much is the whole show here. His charisma and presence help make \"Home Alone\" as good as it is. However, this movie is not a classic. If it wasn't for the ridiculously crazy climax this movie would have been better. Of course the climax is the part that made everybody laugh out loud, when the kid takes on those inept burglars by setting up booby traps that are just too far-fetched to be believable. This part still makes me laugh, but I just can't believe that an 8-year-old could dream up of stuff like that. And writer-producer John Hughes would inject this style of slapstick humor into alot of his following movies (including \"Baby's Day Out\", \"Curly Sue\", and of course the two \"Home Alone\" sequels). The slapstick violence is at times a bit too much, but it doesn't go too far (though the first sequel \"Home Alone 2: Lost in New York\" did get more violent in its slapstick comedy). Director Chris Columbus had his first smash hit with \"Home Alone\". He followed this with \"Home Alone 2\", \"Mrs. Doubtfire\", and most recently \"Harry Potter and the Sorcerer's Stone\". Columbus knows that he can work beautifully with kids, and \"Home Alone\" is where he got his start. He makes Culkin look as good as he is. The supporting cast is fine (Catherine O'Hara and John Heard are good as Culkin's parents; Joe Pesci and Daniel Stern are wonderfully bumbling as the clumsy burglars), and Hughes script has some wonderfully heartfelt touches. \"Home Alone\" may not be the best comedy movie ever made, but it's still a good one. I'll take \"Home Alone\" over Hughes idiotic \"Baby's Day Out\" anytime.*** (out of four)",
    "138": "Comedy. On the eve of the New Year and Christmas, which will come very, very soon, I decided to recall a series of paintings about the petty prankster Kevin McCallister. And let's start with the first part, of course, whose box office success turned all this disgrace into a series. I can't say that this picture of my childhood, but I definitely managed to watch it, being a small spinner, since this movie was often played on TV, and now it is shown on Channel One EVERY New Year's holidays, forgetting about other films. Anyway. I like this picture, and here's my brief opinion - Unsuccessful robbery. Well, now I ask you not to load the catapults with stale tomatoes, because I intend to tell you not only about the advantages of this Christmas comedy, but also about the disadvantages that I managed to find only now, after many revisions. Then let your humble servant proceed.\nSo the pros:\n1. The story told - well, you already know it without me from A to B, but still. The picture tells the story of the boy Kevin, who, in a hurry, was left by his parents at home. Kevin is at first happy, because the family is far from angelic. But then a problem emerges - they want to rob the house. The hero has no choice but to use improvised means to protect his home from encroachment. Kevin, literally before our eyes, is transforming from a coward and a capricious kid into an intelligent, calculating, courageous and independent boy, and also a defender. In addition to his history, there is also a secondary one, which is no less interesting and gives emotions. The ending is predictable, well-known and moral. After all, the family is much more important than money, no matter how hard they try to refute it. The story may be simple and unpretentious, but catchy. What else do you need for a good Christmas comedy?\n2. Atmosphere - the impending holiday reminds of itself literally from every teapot, from every dialogue, from almost every shot, and this is good. Well, and it was not without music, because there are famous Christmas hits and excellent compositions by John Williams, who was responsible for it. Anxiety, loneliness, philosophy, naivety, fear, joy - all these emotions are present here.\n3. Humor - if you do not take one moment (we will talk about it in the minuses), then jokes and funny moments are successful here and even still work. I laughed with pleasure again before writing this review. They are unpretentious, sometimes harsh, but they cause a sincere smile even after so many years. This is exactly a comedy, where there is something to laugh at.\nSo the cons:\n1. Replaying - both Kevin and the thieves are terribly replaying. I didn't notice this before, but then it seemed to dawn on me. Okay Kevin, kid, but Joe Pesci and Daniel Stern? What's wrong with them? Adult people, accomplished actors, behave unnaturally in the frame. I understand that in the script they are goofs, but why does it look so creepy? Humor aside, it looks like a silly farce, nothing more. Although no, Macaulay previously acted in films, so he will not give a ride. Why is Kevin so creepy? The acting is visible only in the second half of the picture.\n2. Successful traps - more precisely, how well the thieves are substituted under them. They see that it is dangerous, but they go. They see that it is flying, but they stand still. Again, it looks fake. My God, even in the Hong Kong action films of John Woo, opponents were more convincingly exposed to the bullets of the main characters.\nA little about the main characters:\n1. Kevin McCallister performed by Macaulay Culkin is a capricious child and the youngest in a large family who is tired of his family. Having gone through a series of events, he realizes the value of relatives and friends, despite their unbearable nature. Macaulay played the main character well, although he often overestimated it. Well done!\n2. Harry, played by Joe Pesci, is the leader of thieves and, in combination, is a dunce who was able to cheat on a child. Sly, stubborn, and causing danger and a smile, for it causes genuine laughter when it falls into traps. Joe! I will praise you, even in spite of your monstrous overplay. Well done!\n2. Marvin played by Daniel Stern - Harry's silly partner, substituting for the most obvious pitfalls. Cowardly, but funny puffs up his eyes and causes laughter, falling into traps. Daniel has a similar story. I will praise, despite the replay. Well done!\nI don't consider this picture a masterpiece, but I'm not at all opposed to revising it for New Year or Christmas.\nWell, next time we have Kevin's adventures in New York.\nAs a result, we have a good Christmas comedy about the adventures of Kevin McCallister, with a good script, great music and atmosphere and good acting work (albeit with a replay).\nMy rating is 8 out of 10 and my recommendation for viewing!",
    "139": "Too bad for John Hughes, my favorite writer of the 80s.  His first offering of the 90s was this blockbuster, not a bad film, but one that started him on an unfortunate trend.  The storyline is ingenuis if you're trying to lure kids to see it, and releasing it during the holiday season made it an easy option for parents who wanted something PG rated for the little ones.  It concerns Culkin being left behind by his family during a mad dash to the airport.  When he awakens to an empty house, he stays unrealisticly calm. Most kids would probably be scared on their own, but he's unphased and makes the best of it, eating junk, jumping on his folks bed and staying up late watching R rated films.  His family finally notices him missing halfway to Paris and mom O'Hara takes the rest of the films running time to get back to him.  In the middle of living it up, Culkin discovers that a pair of hairbrained burglars plan on robbing his house.  He's ready for them, arming the entire home with an array of painful traps and devices.  Up until this point the film was slightly amusing, as Culkin, though not a great kid actor, was cute to watch go thru his little adventures.  But Hughes, writing genius that he is, waited till the end to hatch his goldmine idea that he knew kids would eat up.  Youngsters,  most of which who don't understand prolonged pain and find it funny, lapped up the cartoonish injuries heaped upon Pesci and Stern.  Watching as an adult, though, it just makes you uncomfortable, watching men scream in pain scene after scene. Hughes tries to cancel out the violence with a sappy happy ending, but it does nothing to erase the damage done by the unpleasantness.  And as said earlier, because of the 800 million dollar success of the film, Hughes would mire himself in a clone mode for the entire decade of the nineties! Constantly remaking this formula with even worse results each time.  It all went to show that even your best success cannot be the best thing for you, and all we can hope is that real John Hughes who we loved in the 80s will come home again.",
    "140": "While watching Home Alone it became so plainly obvious (to me) to see just why Macaulay Culkin would never, ever survive his transition from being a child star into anything that even resembled that of a successful actor as an adult. Never. And, it's true. He wouldn't. 'Cause, believe me, he didn't.The writing was so clearly written on the wall for Culkin. And it was quite plainly evident even here in Home Alone. I mean, just like child star Shirley Temple, all of Macaulay's appeal and charm rested solely on the pre-packaged concept of her/him being perceived as that little tyke who was just the sweetest of all the \"cutie-pies\" imaginable.Like, let's face it, it takes real talent (as well as a certain amount of cuteness, of course) to make it as an adult actor. It does. And talent is something that Culkin seemed to possess so very-very little of (and it showed) once he had grown out of that darling, little \"baby\" phase of his.So, unless you're a child, yourself, or an adult who's easily amused by implausible nonsense, then Home Alone's story is just gonna leave you mighty high and dry - 'Cause, hey, other than being completely childish, there sure ain't much joy, merriment, or laughter going on in this one. No way.",
    "141": "\"Home Alone\", directed by Chris Columbus from a screenplay by '80s golden boy John Hughes, has pleased millions of people, and is a not-unintentional holiday perennial as well, taking place as it does during the Christmas season. It is a film that operates at a level at which any sort of professional criticism is no longer helpful. Youngster is (improbably) left behind after his large family packs up and leaves for the airport to vacation in Paris; he fends off two inept burglars while mom makes her way back home. Macaulay Culkin plays the main character, Kevin, but there really is no character; Culkin succeeds in the role strictly by playing up his inherent precociousness--most often directly to the camera--while we admire his spunk and resourcefulness (both unrealistic for easy laughs). The picture looks immaculate, sparkly and shined to a fare-thee-well. Often times, just the reassurance that what we're watching is a big, expensive bauble made solely for our enjoyment is enough to keep the masses happy. The holiday trimmings trigger nostalgia in adults and joy for children, while the thieves (Joe Pesci and Daniel Stern, both over-the-top) aren't scary, mean or nasty--just lovable, irascible losers who can't topple our pint-sized hero no matter how hard they try...and oh how the audience wants them to keep trying! Followed by two sequels in 1992 and 1997. ** from ****",
    "142": "A heavily dysfunctional family are going away for the Christmas holidays. They accidentally leave 8 year old Kevin (the annoying Macauley Culkin) alone at home. Other than doing what a normal kid would do (go to a neighbor or call the police) he decides to stay at home all alone. Two burglars (Joe Pesci and Daniel Stern--both who deserve better) try to break in. Culkin manages to single-handedly set up elaborate bobby traps to stop them.What a violent sick piece of garbage! I caught this is a theatre back in 1990. I saw it after a long week at work and expected a mindless fun PG movie. I was horrified by what I got. For starters the story was impossible. Leaving behind an 8 year old kid by mistake??? Come on! Also the whole family is heavily dysfunctional and not at all funny. Culkin manages to set up elaborate traps and stuff that no 8 year old could ever do. When Pesci and Stern show up the movie goes from stupid and unbelievable to extremely violent. These poor guys repeatedly get burnt and hit repeatedly on the head and face again and again--and it's all played for laughs! I was sickened by the level of violence in this film. How did this get a PG rating???? Also violence against people is NOT funny. It got to the point that I was rooting for the burglars. Aside from all this it just simply isn't funny. Sick, stupid and unbelievable yes--but NOT funny.The acting is as bad as you'd expect. Culkin is annoying from the start. Not cute at all--you want the little brat to get it badly. Stern and Pesci do what they can with nothing roles. Still, I realize I'm not the audience for this. In the theatre I saw it with was full of families with their kids. During the violence all the adults sat there horrified while all the little kids were screaming (literally) with laughter. A few parents dragged their kids out of there--I wish I had joined them. This was (inexplicably) a huge hit and led to the thankfully brief career of Culkin. Avoid this like the plague and definitely do NOT let small kids see it. A 1.",
    "143": "This film is one of the all-time great holiday films, probably ranking a distant second behind A Christmas Story. I remember when ten years ago I saw Home Alone at the theater I said you have a instant classic. I guess my prediction was right, I know when I hear many people talk about a film for years that the popularity is overwhelming and also it must have sent a good message to people. Home Alone continues to get many airings just the other day I watched this classic on HBO. The ingredients for success in the form of the writing from John Hughes really made this film so enjoyable, and you know how good John Hughes delivers a sweet and likeable film. The story is crazy but also funny as Macaulay Culkin as a precarious 8-year-old who accidentally is left behind by his vacationing family, in the meantime Culkin must battle a twosome of goofy and inept burglars wonderfully depicted by Joe Pesci and Daniel Stern. I must say that Joe Pesci is a great actor not only is he seriously funny but he is just plain and simply the best at anything he does! Qualify Pesci as a very underrated actor. And Culkin enjoys the adventure of a lifetime filled with many laughs and giggles to crack you up! It just goes to show you many times an individual can have the most fun when left alone. No matter how many times you have seen Home Alone watch this classic every holiday season it's a film to enjoy for a lifetime.",
    "144": "It's safe to say I think that Home Alone, along with movies like The Goonies and Ghostbusters is going to be on of those for people of a certain generation as a must go to when it comes to sheer nostalgia. It's notable that it catapulted then 10 year old MacCaulay Culkin to international stardom, and brings back fond memories for people like myself who remember going to see it at the cinema as a kid. As it comes that bit closer to hitting the thirty year anniversary of it's release, it's still lost none of it's appeal and has thus far stood the test of time. All this said, and in all fairness I can't say it's a brilliant movie and given it's premise, your enjoyment of it will probably depend on how much you're willing to suspend disbelief. This is after all about a an eight year old named Kevin who's criticised by the fellow childhood members of his family for not being able to pack his own suitcase (their family is travelling to Paris for Xmas) and yet proves remarkably resourceful when fending off the movies antagonists; the burglars Harry and Marv played with hilarious brilliance by Joe Pesci and Daniel Stern. Written by John Hughes who sadly passed away several years ago (as incidentally did actor John Heard who plays Kevin's father in the movie), he makes good use of it's basic premise, with young Kevin attempting to temporarily adjust to finding himself on his own and without any parental supervision. Fun moments include him being questioned by a suspicious checkout operator while he's grocery shopping, and tricking Harry and Marv in to thinking his house is still operating by constructing a fake party using cardboard cutouts. It's certainly one of Hughes most inventive movies as a writer, despite how far fetched it is. The now legendary final act is a masterclass of slapstick comedy and you'd be hard pressed not to find yourself rolling on the floor with laughter.Of course with this being a Hughes movie, or just any family comedy of this nature there's going to be some life lessons learned for our plucky young hero by the end of it. Thankfully however it's beautifully handled and while predictably sentimental, it never becomes cringe-inducing. MacCaulay Culkin brings innocent charm to the role of Kevin, and displays natural comic timing. He also handles the transition from obnoxious brat to lovable sympathetic young scamp effectively well. The rest of the supporting cast which includes Catherine O'Hara, the late Roberts Blossom and the late great John Candy (making a relatively brief appearance) are all on top form. No doubt this is a film that will be well remembered for years to come even with it's glaring flaws, you can't deny it's charm and I defy anyone not have a lump in their throat in it's moving final moments.",
    "145": "Review:\n'Home Alone' is a comedy film directed by Chris Columbus.\nIf you were to ask a room full of people what movie they watch the most around the Holiday's, the majority would say 'Home Alone'. This is such a fun tale from writer John Hughes, and it brings some suspense to Christmas while keeping it child friendly.\nThe story follows eight-year-old Kevin McCallister (Macaulay Culkin) who is mistakenly left behind when his family flies to Paris for their Christmas vacation. Kevin initially relishes being home alone, but he soon has to contend with two burglars: Harry Lyme (Joe Pesci) and Marv Merchants (Daniel Stern), who are known as the \"Wet Bandits\".\nMacaulay Culkin is a standout in this movie not only because he is in almost every scene, but his acting was very good. He was nominated for the Golden Globe Award for Best Actor in a Musical or Comedy after all. He really holds his own among all the adults in the film and it isn't slim picks when you have Joe Pesci, John Heard and Catherine O'Hara.\nIt's quite unrealistic about how dumb the burglars are, but honestly, this is a terrific family film. Joe Pesci and Daniel Stern are a great comedy duo of two idiots who can't rob the place because a child has out witted them and set some clever and very funny traps around the house.\nOverall, aside from its unrealistic plot, the movie is fun and very entertaining. It's a movie my family watches multiple times throughout the year and it never gets old.\n4.5/5",
    "146": "Basically a live-action Wile E. Coyote / Roadrunner Christmas, with a few humanist subplots thrown in for good measure. John Hughes comedies have often struggled to indulge the author's wackier side without stumbling too far into the realm of slapstick, and Home Alone never really finds that balance. There's a lot of effective material here - the sweet old neighbor's redemption story; Kevin's first steps toward independence; his mother's frantic, airport-skipping quest to get home - but those deeper themes feel too scattered, obvious second (or third) fiddles to the more bombastic third-act fireworks.The production also feels loose and cheap, rife with overdone performances, blunt direction and easy, convenient physical gags. Macaulay Culkin's acting in the lead is borderline unbearable, and the cache of gimmicks and booby traps that fuel his story often asks far too much of the audience. As I mentioned above, growth is a major part of his character arc, but right from the start, most of his word choices and the breadth of his worldly knowledge seems highly suspect for the pampered youngest son of a large, well-off suburban family. Joe Pesci and Daniel Stern pick up some slack as a duo of over-amplified burglar stereotypes, played with a wink and a nudge at just the right moments, and Catherine O'Hara shines in a rare straight role as the flustered mother an ocean away from her youngest child.Straightforward and light for the majority of its run time, the film works best when it remembers to pluck the heartstrings with a few season-specific character moments and subplots. Still, it's all too detached from reality, with a strange habit of glorifying and celebrating its frequent scenes of grisly, wince-inducing violence.",
    "147": "\"Home Alone\" is a Comedy - Family movie in which we watch an eight-year old child protecting his home from two thieves after finding out he was left alone. His family went to Paris during Christmas vacation and he is home alone.I liked this movie very much and I have watched many times especially during Christmas. It has a simple, nice and very interesting plot that contained plenty of suspense and many comedy moments. The direction which was made by Chris Columbus was amazing and he did an excellent job on the way he presented his main characters along with the plot. The interpretation of Macaulay Culkin who played as Kevin McCallister was simply amazing and he made the difference. Some other interpretations that have to be mentioned were Joe Pesci's who played as Harry and Daniel Stern's who played as Marv, and their combination worked very well and had this beautiful result. All in all, I have to say that \"Home Alone\" is an amazing comedy Christmas movie and I highly recommend everyone to watch it because it's simply hilarious and I am sure you will enjoy it.",
    "148": "Another amusing Christmas heist flick ripping off \"Die Hard\" (1988), as others have pointed out already--complete with family problems, a protagonist practically breaking the fourth wall by cracking jokes alone, and bleeding feet--\"Home Alone\" is a lot funnier than I remembered it being. The cast is great. Joe Pesci and Daniel Stern mug it up. Catherine O'Hara is always good, even if her full comedic talents are underutilized here relative to her parts in Christopher Guest mockumentaries or the TV series \"Schitt's Creek.\" Besides, her character is the only member of the family who really seems to care that they forgot a child across the Atlantic Ocean and then some. Roberts Blossom should talk more in this one, because his manner of lip smacking in between short phrases is ASMR triggering. John Candy on another holiday road trip--this time talking about abandoning his little one with a corpse at a funeral parlor. And, of course, Macaulay Culkin. Boy, that kid was famous--probably hasn't been a child movie star that big since and, besides Shirley Temple and Jackie Coogan, before.Besides breaking fourth walls with the raise of eyebrows, his Kevin enjoys time to himself, eats and watches trash, sleds down staircases, cares about hygiene and keeps a tidy home when not destroying his brother's room or mutilating criminals, shows interest in his hobby of using stuff around the house for an elaborate home security system, and screams into the void every once in a while. I mean, he's got life figured out. Granted, he gets whiny about missing his family after only a couple days, but he's only eight years old, so I suppose that may be forgiven. It's just a fun film. The early hectic family scenes, including the rush to the airport, make this enjoyable from the start, and the film-within-the-film parodying \"Angels with Dirty Faces\" (1938) is a gas, as well. To top it off, they got John Williams to do the score."
}