{
    "0": "Yes, it's derivative, and yes, if you have even moderate familiarity with movies from the last few decades you will think \"The Talented Mr. Ripley\" fairly early during its runtime. However, for the most part, I enjoyed it. Barry Keoghan never disappoints me. Whether he is playing a suicidal dullard in \"The Banshees of Inisherin\" or a psychotic mastermind in this movie (and many other roles in between), he is always brilliant.For me, unfortunately its third act is probably its most memorable feature because it requires an enormous suspension of disbelief. Rosamund's Elspeth character invites Keoghan's Oliver character into her home yet again even though his history there is unbelievably dubious. She claimed that she felt guilty about his exile, but one wonders about her motives. Was she trying to have sex with him at that point? Rosamund Pike is an ageless, gorgeous woman, and her character had endless wealth--she didn't need an average-looking poor guy in her life. Also, why did she sign away her fortune to him so quickly? Was she not suspicious about her sudden illness with him in her life again? The butler, who observes everything obsessively, remained a presence there. Even if Elspeth took leave of her senses, wouldn't he intercede? The third act defies any sort of logic.But again, it was worth watching.",
    "1": "Emerald Fennell is a very very posh person. She's from extraordinary wealth. To take nothing away from her achievements as a filmmaker (Promising Young Woman was a terrific, difficult watch and rightly lauded) - but going in knowing that and then coming out the other side of this morally disturbing parable, it's a troubling setting and one that irks me.The two most obvious antagonists are the type of people you'd typically be rooting for in a film about rich vs poor, and the fact it's turned on its head doesn't feel like an innovative step - it feels like the exact opposite. It feels like someone from enormous privilege trying to redress the balance, almost like a propaganda piece.It's beautifully shot. It's really well acted. It's a solidly entertaining (if broadly unoriginal) little film, but as someone NOT from the world of Saltburn - it left a sour taste.",
    "2": "There's a lot to enjoy in this movie. It's well-paced, beautifully presented in terms of production design and cinematography, Barry Keoghan in dazzling in the leading role, and he is well supported by, among others, Jacob Elordi. Archie Madekwe, Alison Oliver and Richard E. Grant. Rosamund Pike, putting her essential chilliness to good use, is surprisingly amusing. But there are few other surprises as we tread through the familiar world of the English upper class and its pampered progeny. Taking a sort of semi-critical stance, writer-director Emerald Fennell summons up the memory of a number of films that examine the British class system. Kind Hearts and Coronets, The Servant, The Go-Between, The Hireling...I even caught a whiff of the very obsure American film Black Flowers for the Bride. I can't work out whether or not Ms Fennell thought she was on to something new. If she did think so, she was clearly mistaken.",
    "3": "It is a mistake to only compare this film with \"The Talented Mr Ripley\", when the obvious source is \"Kind Hearts and Coronets\" starring Dennis Price and a tour-de-force from that acting genius, Alec Guinness. Murdering your way to the top of an aristocratic family in the way that Emerald Fennell has constructed it, is very twenty-first century because of the ending but it does not make snese. And that is the problem for me. The reviewing of previous events from a different perspective implies a cynicism and motive that does not fit the main character. So when it is presented, astute members of the audience are not going to view it as a twist but are more likely to think \"Hang on a minute, what about when....???\" So whose fault is that? Scriptwriter and director are the immediate culprits and here they are the one and only Emerald Fennell. Her Oscar for the \"Promising Young Woman\" may have been justified. I don't think she's going to get anything for this one unless the \"Razzies\" are stuck for choice.Just a note about Barry Keoghan and his performance . I wish I was a fly on the wall when his agent convinced him to a) be stark-naked and pretend to \"screw\" through the freshly-dug grave of a main character to highlight his obssession with said character and b) pretend to lick the porcelain floor of the bath where that obssession has just masturbated, (\"Saw\" franchise please take note, if you want to push the boundaries of revulsion, check if Fennell is doing anything). As for Keoghan's agent.praise indeed because he must be the model for \"Entourage's\" Ari Gold !!",
    "4": "If you're a film major you probably loved this movie. So much symbolism and it takes unexpected turns. But its \"shocking\" moments are so odd that ruin what could have otherwise been a good story. I'm sure some of these 10 out 10 ratings will call on the message of mental illness as thought provoking or other flowery symbolism that is unlike the typical hollywood movie. But I would avoid this if you are an average filmgoer. Especially those that just wants to see a movie that is entertaining and unique without leaving you feel like you just watched some screen writers most dismayed plot just to be edgy.There were a couple truly disgusting scenes of perversion that added no value to the story. Not to mention the holes in the plot. Holes like why would he go through the lengths that he took to infiltrate and take down the family members one by one? Oh, because he loved Felix so much....right. We find out that he set out to befriend Felix from the very start, but why? This would have made more sense if there was an actual motive other than he was unbalanced and just wanted to be loved. Save your time and money.",
    "5": "This was awful. The characters were one dimensional, and it kept going long after the film felt \"done\". Whilst Oliver is obviously the bad guy, they could have still given him a smidge of likeability (eg Patrick Bateman) but literally there's nothing to like about him.Let's be honest, the film should end when Felix meets Olivers parents, there's no way he'd be allowed back in Saltburn after that. It then rushes through the 3rd act where the body count stacks up so quickly it doesn't have time to be impactful. The grave scene was utterly ridiculous, I felt embarrassed for everyone involved in the making of that scene, but yeah somehow it got made.Respect to the Music Supervisor though, some great choices including Bloc Party & Tomcraft. The 00s truly the last truly decent decade of music and cinema.",
    "6": "\"Talented Mr. Ripley\" in reverse.I feel we are suppose to get a lesson here, but none is to be given. Perhaps is to be aware of poor social climbers who exhibit intelligence. I know WAY too many people like that. Which could be the message in itself. The idea of being popular runs a little too dark when a chance meeting between Felix (a rich Gatsby-esque character played by Jacob Elordi) and Oliver (a socially awkward, possibly autistic, bright literary genius) at Oxford.There are a few things that will rub you the wrong way. Yes, it's suppose to be a dark comedy. I think Rosamund Pike, who plays Felix's mother is the only one who understands that the key to dark comedy is to be a bit over the top. Richard E. Grant plays the Dad who, unfortunately doesn't get the big eyed meltdown until the end. The other things you will either love or hate....\nThere is no reason for ANYONE to like Oliver. Ever. Barry Keoghan plays him great, but it isn't like he flips a switch and becomes charismatic. In fact, he just becomes a weirdo saying charismatic things. Perhaps that's the intention. The family is so devoid of emotion that any genuine sign of it gains acceptance. Again, I never felt that.There is absolutely NO reason for Oliver to know that Felix would be so generous as to ingratiate him into his family by a flat tire ruse. The conceit of this entire film relies on the idea that Oliver is a grifter preying on this family and that someone would be kind enough to take him in. He sees what he wants, then has the shameless nature of approaching each one to gain favor. Honestly, one of the worse flip of the switch is when Oliver observes the sister of the household and seduces her (after a few words--saying she's a nympho doesn't make it so).Any way, Rosamund Pike is the only good thing about this flick. Jacob Elordi is also really good at embodying the rich snob with a heart. The rest is a bit mediocre. If you've seen these types of identity starved sociopath movies, you'll know what you're watching.",
    "7": "A scholarship leads to things you can't afford, where your castoff clothes are simply not Oxford, Billy Nomates and a bore, until Felix opens a door, that you walk through to be no longer ignored. You have a twang that doesn't fit in these new circles, a tongue that likes to explore certain portals, there is pity for your plight, for a life that's full of blight, but you take it on the chin, with snorts and gurgles. But the past is always lurking round the corner, and in turn you then become a constant mourner, karaoke writes the score, before you take to the dancefloor, with a finale that has left, mayhem and trauma.Barry Keoghan's always brilliant.",
    "8": "He is just \"a human boy\".Emerald Fennell's \"Saltburn\" is an unforgettable, irresistible cinematic experience showcasing Barry Keoghan in his prime. Barry Keoghan gave not only his best but a career defining performance that will be remembered for years to come. The final scene of him will be seared in my brain for the foreseeable future (might even be forever). I adore Emerald Fennell's signature style, and after her directorial debut \"Promising Young Woman\" in 2020, I was eager to see what she comes up with next. \"Saltburn\" absolutely delivered the thrills, laughs, weirdness, sexiness, eeriness, and stylish personality that the first film encompasses but double downs on it tenfold. It is a very British psychological thriller with plenty of charm, youthful energy, and originality. The early 2000s aesthetic is lush and on point. I truly believe that this film utilizes the so-called 'eat the rich' narrative perfectly, and is easily the best film of that genre. The film is kind of a cross between Jordan Peele's \"Get Out\" and Mike White's \"The White Lotus\". I need the film's soundtrack like yesterday. I have nothing but undying respect, gratitude, and praise for filmmaker Emerald Fennell. \"Saltburn\" is one of the best films of the year. Bravo to all involved, especially Emerald Fennell and Barry Keoghan.*At one point in the movie, Felix (Jacob Elordi) says what everyone is thinking: \"I'm so effing hot.\" If Jacob Elordi showed even the slightest interest in me, I too would be driven mad with love.Final verdict: 10/10.",
    "9": "Sucks you in is an understatement, and possibly a double entendre. Darkly comedic, and a treat for the eyes. You will be absolutely transfixed by Barry Keoghan. Every moment feels tense, rich, and dangerous. Seeing it in a theater full of Olds and Uptights was hilaaaarious.I just saw it hours ago, and if this movie was available for me to play again right now at home I would put it on again. And if another advance screening happens before it's out I'm going again. You will think about this movie for days.Between Promising Young Woman and this, Emerald Fennell has become don't miss cinema for me.",
    "10": "I love Emerald Fennell, so I was especially looking forward to this movie. Granted it doesn't start out badly. Starting with a talking head interview type monologue and then merging into the \"scholarship student\" thrown into upper crust society, homoerotic outsider looking yearningly towards his object of desire we've seen in so many Merchant Ivory movies. And the. It sits there for 30 minutes or so. Not moving. Then we're brought to the elitist estate with the big windows and mirrors and grounds with a maze (don't get lost, is the marketing tagline). The object of desire (and heir apparent) gives his summer friend an irreverent tour of the place. And then you realize they will sleep in adjoining rooms that share a bathroom (if that's OK) and we thing, well, this might be interesting. But no. We spend the next hour learning. Banalities about this family. But not even banal enough for us to begin to hate them. They're just sad. We know this story. There's some Teorema like encounters with different members of the (sometimes extended) family (some of you will get it) that might have also been interesting had they been explored. But no. When people start dying you think it's going to FINALLY get interesting. But no. It's handled with the same banality of the rest of the movie. And the payoff (with gratuitous nudity) you figured out about 30 minutes before. We want it to be about revenge, unrequited love (I can't have you so no one can), ambition, need for family. But it turns out to be just about greed. But even that payoff feels shortchanged.",
    "11": "The trope is a tired one. Poor friend jealous of rich friend and thus finds a way to force themselves into a disturbing level. You've seen 'talented mr. Ripley' so this film won't shock you with its plot, but getting there is all kinds of unnecessary. When you're at an industry screening and people are groaning in disgust, you've gone too far. I will give props for the twist at the end as this movie is being 'told' but it's not really worth the squirming to sit through to find out. Emerald fennel is just kind of sick honestly. 'Promising young woman' was disturbing and you won't find solace in this either.",
    "12": "Lush cinematography, a variegated musical score, a tight ensemble cast, and strong psychosexual themes makes this movie quite the cosmic ride! Emerald Fennell with new indie film, Saltburn, does a great job, here. The story centers and is narrated by Oliver Quick, played masterfully by Barry Keoghan, who attends Oxford on a scholarship in the mid-2000's and befriends, Felix Catton, a handsome, rich, elite played by Jacob Elordi, who invites Oliver to his palatial residence, Saltburn, to wile away the lazy days of summer and mingle with his eccentric family. This movie has some jarring scenes, to put it mildly, and may repel some and titillate others. Everyone who I was with in attendance tonight were totally drawn into the Catton's world and many clapped after the movie was over. Another movie that may continue with a cult following??? Only time will tell. All I can say is go see it, take it in or spit it out and make your own judgments! Brava, Ms. Fennell for another brilliant work with fine acting and direction!",
    "13": "I almost walked out on this movie and that doesn't happen often. Saltburn is not a movie of depth and substance. The character development is below minimal. If you're happy to watch a shallow movie then sure, watch Saltburn. Dialogues are cringey and way over the top towards unbelievable. The only saving grace is the beautiful scenery and stage set ups.The pace did pick up at the end, and there were some interesting scenes - however it felt like the director was getting desperate to save the movie and pulling out all sorts of last ditch efforts to leave an impression. Still, it did not make it bearable and the only impression I was left with was - what a waste of my night.",
    "14": "Imagine 'talented mr ripley' and 'call me by your name' got drunk one night,had an unwanted baby and they called it 'saltburn'. The cast is mostly great but some characters were so fake and dull (the math genius and Venetia). The movie tried to have an artistic vision but it doesn't go further than being a rip off of the great 'talented mr ripley'. Conversations are fake,forced,and repetitive (Farleigh's constant reminder to Ollie about his life). They wanted to create this posh british lifestyle but so many elements are either missing or misplaced. Unfortunately,it's a disappointment. A bit longer than it should be.",
    "15": "A strange one. Oliver (Barry Keoghan who looks like a young John Hurt) is attending Oxford University in the UK. He's shy and withdrawn. Then he meets outgoing, charasmatic Felix (Jacob Eldordi) and they become friends. Felix invites Oliver to spend the summer at his huge estate with him and his family. However his family is heavily dysfunctional and things get out of control. It all leads to an incredible twist ending that I didn't see coming. It's well-made and the acting is good. However it's slow-moving and the thick accents render some of the dialogue unintelligible. Still I give it a marginal recommendation.",
    "16": "Do not waste your money on Saltburn. Instead watch Moliere's Tartuffe at a theatre, or read the case of the French aristocratic family scammed by Thierry Tilly - which are obvious borrowings in this unoriginal mish-mash of a film. This reminds of what Laura Neal did in bad writing to finale 'Killing Eve'. It betrays the audience, is badly written, and poorly made - it talks down to the audience and mocks any investigative law enforcement. Visually it looks good, but it is a silly romp that does not satisfy, the characters are two-dimensional, and the occasional insight is swiftly blunted. There is no brilliance here - only an overpaid, overrated maker either losing it, or saying 'F... You' to cinema-goers. Don't waste your time. Filmed at Shotover Park fits - for a lazy shot in the dark that fails cinema.",
    "17": "A movie where the audience screams \" No! No! Ewwww!\" is clearly getting a reaction. Saltburn is sexy, funny and a shocking at times. It pulls you in with beautiful people and even more beautiful scenery and then starts to reveal that it is a much different movie than you expected. If you have a problen with depictions of body fluids this might not be your film. If you can stomach it then you're in for some sticky fun.It also is a nice slice of milenium nostalgia with a great sound track The last scene of the movie has a perfect song choice and leaves you feeling a bit confused as you're still processing what you've seen while you want to dance out of the theater.",
    "18": "Wow. I have watched the film four times and each time I love it more! I loved Emerald's 'Promising Young Woman' a couple years back so I have been excited since this film was announced. This film will take you places you didn't know you could go. An absolute thrill ride with an ending you don't want to miss. The camera work was stunning. Barry Keoghan and Rosamund Pike were both standouts and I'm so happy to see their golden globe nominations! The rest of the cast was also stellar. I loved Carey Mulligan's cameo scenes. She is absolutely incredible. This film is a wild, crazy, bonkers ride and I am here for it! I hope this film performs well that the Oscars. Easily in my top 3 favorite films of this year, possibly even number 1. (And I watch a lot of movies- 103 in theatres alone in 2023 as of 12/16/23). Those who are easily disturbed may not enjoy it but the film did what it intended to do. Excellent.",
    "19": "I had greater expectations of this film given the combined talent of the cast. There are some very good actors in it but I suppose if the plot is no good there is nothing much they can do to elevate to watchable. Quick frankly it is barely watchable. Some really bizarre events occur that are neither funny nor scary. Just bewildering as for most of the film there is seemingly no real story or plot just interactions between some rather superficial characters. None of the characters including the leads are likeable. The plot is explained at the end but to be honest it's not worth watching to find out.",
    "20": "Saltburn moves along at a good pace, rather stylish and hip as it creates some anticipation for where it may be going. It develops a bit of mystery but we never understand the motivation for the protagonist character. Not much depth for the various character, so can't get invested in them. Several scenes are designed to depict ridiculous opulence and wealth, so as to contribute to why the main character has disdain for this, yet we don't ever feel this disdain.As the end approaches it becomes predictable while it quickly and conveniently fills in the holes of whatever mysteries it tried to create. Overall, Saltburn lacks substance and hence I was left feeling with the lack of meaning for whatever message the film is trying to depict.",
    "21": "Do you not see this the so called movie 50% of it is basically soft core Porn it's 45% of it is poorly acted out in horribly conveyed scenes and only 5% of it is actually watchable.I decided to leave the theater after I witnessed necrophilia being committed on screen I decided to sit through the sex scene with the main character performing oral sex on lady during her period I decided to sit through the cum licking scene of the bath drain but necrophilia is where I draw the line.These seans were disgusting in their own right they were also several minutes long each and all of them were completely disgusting uncut it had no other audio than the heavy breathing or moning from the actors.The only good reviews I've seen for this so called the film or about how it's got a female director which should have nothing to do with the overall quality in my opinion or how it's captivating and you can't take your eyes of the screen I agree with that in the way that you cannot take your eyes off of a car accident.",
    "22": "I saw Saltburn, starring Barry Keoghan-The Green Knight, Dunkirk; Jacob Elordi-Priscilla, Deep Water; Rosamund Pike-Gone Girl, Die Another Day and Carey Mulligan-Promising Young Woman, Inside Llewyn Davis.This is an intriguing story about the differences between the rich and poor. Barry plays a smart young man-but just scraping by in the financial area-entering his first year at Oxford University. He meets and befriends Jacob, a fellow student who is also an aristocrat. Barry studies hard and gets good grades while Jacob likes to party and depend on his father's money to get by. When summer break comes along, Jacob invites Barry to come stay with him and his family at their estate in the countryside. Saltburn is the name of the estate. Rosamund plays Jacob's mother, who being a little eccentric-as is the whole family-welcomes Barry with open arms. Carey is another person that is staying at Saltburn, and yes, she is eccentric too. The film is a little slow in parts but gets more interesting when the aristocrats start partying. They even dress in tuxedos for dinner, which Barry has to borrow one, to fit in. There are some twists and turns you may not see coming. I can imagine that you will not soon forget the bath tub scene-or the graveyard one, either.It's rated R for violence, language, drug use and sexual content-including graphic nudity-and has a running time of 2 hours & 7 minutes.It would be a good one to stream.",
    "23": "Let's get this out of the way and I really hope Barry got paid the big bucks for this as some of the scenes on show here were let's say R rated...uncomfortable moments for most in the cinema as the odd hands went over the eyes.As a fellow Irish man it's great to see Barry in another lead role following his triumph last year in the Banshees of Inisherin.He plays poor Oliver looking to make his play in the rich man's world in magnificent and manipulative style filled by lies and deceit. Makes a fantastic movie with several characters providing a really good comedic effect with old money personality traits across the absolutely enormous estate that is Saltburn.I sense a nomination for this one....",
    "24": "Such a banger if a film . Had watched the trailer but deliberately did not read any reviews . Barry keoghan is one of the main actors who I think is fantastic and such a top class new talent. Richard e. Grant as well was great. A real mixture of giggles, shocks twists and turns which I never saw coming. A few gasps and hands over the eyes moments . I don't want to give any spoilers as I think it ruins the experience of the film . Set in a beautiful mansion house with fantastic scenery and filming . I would watch this again just to see if I pick anything up I missed the first time . Top class film , acting and plot.",
    "25": "Yes it mimics BR but without any of the class and character. The actors are by and large just props trying their best in a film that is too deep and unnecessarily pretentious. An art house film that fails in every area with too much swearing, smoking and homo erotic nudity. Why bother I ask myself. A real let down but in the hands of another director it could have been good with more focus and less dark side which gave nothing to people like me. Think of all the money on the budget though. A complete waste of 2 hours, shame.None of the characters seem to claim the attention, somewhat distracted and aware they are acting which is a fail in my eyes. More realism and less acting up?",
    "26": "The first problem that strikes you with this movie is that the so-called students portrayed are all well over 30 years old in real life. And they all look it. In reality they should be in their late teens/early 20s, not in or approaching their mid-30s.There was no plot to speak of, just a rambling series of incidents that had little to no point. Nothing ever really developed into anything worthwhile, and I think we can see the director/writer/producer (all one and the same) wanted to self-indulge at the audiences expense. I could think of many better ways to spend my time and money.Nothing that happens seems remotely credible, realistic, or even interesting unless you are a voyeur.",
    "27": "Acting is pretty great, cinematography was pretty great too, but story is all over the place. The movie is filled with scenes meant to shock so you'll go, wow, so edgy, so daring, so brave; but end up just being gross. It's like when a comic says a bunch of wild stuff, but isn't funny....you walk away feeling like you've just been assaulted.I saw that some people said it was a rip off of Talented Mr. Ripley. It absolutely is, my god it is. A disjointed mess of a rip off, but a rip off none the less. I don't really understand the high score for this movie unless it was reviewed solely by the wiener loving cinephiles. If that's the case, then this movie delivers in spades.",
    "28": "Salt burn did not hold together for me and i thought the cringy moments which were extreme and frequent were gratuitous. There seemed to be no sequence or lead up to the twists and turns of the main character. It's as if the filmmaker had an idea but didn't have a deep enough understanding if human psychology to really draw me in and pull it off. Suddenly he was doing something i could barely watch.... and i just didn't believe it. It's was gorgeous, but it seemed all surface. I compared it to The Talented Mr Ripely. A far better film that leads up slowly. Giving us hints and and insight into Leonardo Di Caprio character Thus film did none of that. Frankly i really did not like this film i gave it 4 stars for the visuals and some good acting.",
    "29": "It was attractive to look at and acting was very good but that's all. It left me feeling sick and uncomfortable and I really didn't see the point in the gross sex scenes. If the point was to shock then it did that but i wasn't impressed. I don't know why anyone would enjoy this film. Almost all the characters were horrible and Vacuous and it was a waste of my time. I saw it with my 15yr old daughter who has seen a lot of scary adult themed films. She also thought it was gross. I judge a film on whether I would want to see it again and I absolutely would not. I'd like it removed from my memory.",
    "30": "Not much story to this crazy, unimaginative, and blatant ripoff of The Talented Mr. Ripley. The cast are not fully fleshed out characters and don't seem to know what to do with themselves. The truly outstanding actor here is Barry Keoghan who does an outstanding job of bringing Oliver alive with such a striking performance. The rest of the characters are stereotypes and under developed. Carey Mulligan is totally wasted here in a part that is just stupid and does nothing more than let you in on how utterly ridiculous and superficial the Catton family is. The cinematography was well done and added to the atmosphere of the movie but the story was so poorly put together I'm surprised that the movie got made.",
    "31": "Brideshead Revisited by Evelyn Waugh is one of my favorite novels, and I've seen both the 2008 film as well as the 1980s BBC mini-series, so I immediately recognized Saltburn was Brideshead \"updated\" for the 21st century just from seeing the trailers. I waited for it to come on streaming because I was curious but not optimistic. While stylish and peppered with memorable 2000s music for Millennials in the first half of the film, the second half of the film is just gross on purpose. Something about a bathtub drain, I actually had to turn down the volume on my device because I didn't want to hear the nasty slurping sounds of some dork tonguing a dirty plumbing pipe, and it just gets worse not ten minutes later with the clueless virgin Oliver taking advantage of Felix's emotionally unstable sister Venetia hours after a tete-a-tete with her narcissistic mother.Saltburn tries too hard and just ends up playing victim to a sub-generation of people who have mistaken shock value for something intelligent to say. In the original Brideshead Revisited, complex moral questions are visited and there's an emphasis on something other than sex (though it is a racy book for the early 20th century era it was published). Also, Felix is no match for the charismatic and childishly fey Lord Sebastian Flyte.Don't be in a rush to see this one.",
    "32": "A unique journey with familiar feelings. The terrific coupling of Barry Keoghan and Jacob Elordi reminded me of The Talenbted Mr, Ripley and specially Colin Firth and Hart Bochner in Apartment Zero.The sexual suspense of their relationship remains in the longing stages. Not even a kiss. When Barry Keoghan arrives to Saltburn for a visit we know that he means a visit to Jacob Elordi, I know because we long for that visit myself. Jacob Elordi is a star. I haven't seen Euphoria, yet, so, Jacob Elordi was a total surprise to me. His beauty has depth, he's never superficial. Look at him taking his friend for a tour of Saltburn. Superb. They visit themselves and visit each other and I was with them all the way. Another plus, Rosamund Pike and Richard E Grant as the parents, sharp and hilarious. Yep. Go visit, you won't forget it.",
    "33": "Okay so I thought most of the movie was odd some parts a little humorous. Like more of a dry dark whit. The parents were the funny ones. Some parts seemed unnecessary and strange(bathtub) or maybe as the story progressed we needed to know just how demented everyone is haha. Then there are some parts that you're like... What??? Like I thought 56 minutes in was going to be the weirdest part, ummm no I was wrong, at one hour 45 minutes in, yeah I'm gonna say that part takes the cake! Then the following scene, Alison Carver(Venetia) was amazing!! She did a fabulous job. Truthfully one of the reasons I didn't like this more was Barry Keoghan(Oliver) for me he just wasn't charming enough for his role. I don't know, just something never clicked with me. He just couldn't pull off the savviness his character should've had. Then we have the finale, the last few minutes actually changed how I felt. Great ending, they left nothing to the imagination. It's not going to be for everyone but if you like a character study that's got some crazy $hit in it, well this is probably for you.",
    "34": "There are many scenes in Saltburn that are unnecessary and lead one to believe that the writer thought they were creating one thing but the audience was seeing another. The big reveal toward the end reveals nothing and is unnecessary. The dialog is great. Keoghan is an actor I always admire and here, he and all the actors are marvelous. After\nA Promising Young Woman, I understand why everyone wanted to work with Fennell. Unfortunately her story is outlandish and what was potentially another masterwork becomes a disappointment as soon as the characters stop driving the story and the story is forced upon the characters. This is a disappointment. To watch it and then say, \"Bummer\". I suggest giving it a watch, many like this movie as I can tell by the 7.5 rating. I wish it all would have worked, I bet Fennell does too. So much was good but this is ultimately a big letdown.",
    "35": "Literally, and without a doubt, the worst movie I have ever, ever seen! It starts out slow and gets even more slow, and the plot line just gets worse and worse and worse. A serious waste of talent here, and such a waste of time. I wish I would have left in the first ten minutes which I could barely get through as it was painfully slow and uneventfully boring!Do not waste your time or money on seeing this beyond awful film!There is absolutely no sense to the plot, it is merely a jamble of themes thrown together - and nothing makes sense in this film. After the first extremely boring half hour, the visuals and the scenery improved, however, the story and the plot never improves!",
    "36": "POSITIVES:1) The performances are all brilliant, in the sense that you pretty much hate everybody and that is seemingly what the film wants. I did, however, think Jacob Elordi was a particular standout due to completely hiding his natural Australian accent and through his ability to make Felix into what I felt was by far the most likeable character of the film\n2) The film is hilarious in the first half. The audience I saw it with gave choruses of laughter constantly throughout the first half of the film and I really wasn't expecting it to be so funny so that was a pleasant surprise\n3) The twist that Oliver has been lying the whole time and planned everything to turn out the way it did certainly surprised me. I thought he was going to turn evil but I thought it was going to be caused by the events of the film, rather than the events actually being orchestrated by him the whole time. That final scene of him will also be very memorable for a long time to come\n4) The film looks and sounds spectacular. The cinematography, production design, choice of aspect ratio, score etc were all superbNEGATIVES:1) Barry Keoghan's scouse accent was pretty terrible and honestly distracting for a lot of the film. Why couldn't Oliver just be Irish?2) The film didn't quite stick the landing for me. I think it would've been better if the multiple deaths that occur were scattered throughout the film, rather than them all happening in the last half an hour or so as the film rushes towards a conclusion. Oliver goes from being cast out by Felix to owning all of Saltburn in what seems like far too short a space of time\n3) I enjoyed the film very much on a surface level but I didn't really feel like the film said much of note or had much of a message. The themes around posh people who come from old money being rude and spoilt, or about how the quest for money and power can corrupt people, are all quite generic and things we've seen a lot in other films before.",
    "37": "This is a complex movie, with perhaps too many moving parts, although one gets to know the main characters well. And a lot of it is about the British class system. Felix and Oliver are at Oxford, but from quite different backgrounds. Oliver is quite smart and well read. After Oliver does Felix a very important favor, he is invited to spend the summer at the family estate with Felix. And this is no small house. And there are quite a few people staying there, family and hanger-ons. And some are written much better than others. There are some clever lines: \"Have to go to London. Funeral. Pamela. She would do anything for attention.\" Oliver has a birthday during the summer, and says he can't go have it with family. So they throw a massive birthday party for him. This gets one to about the 3rd Act, and this is perhaps the most disturbing part of the movie, and one will not look at Oliver the same again. And the role of Oliver is done very well. The movie could have used a trim, as some of the scenes do not contribute that much to the movie.",
    "38": "Quite a riveting experience that is well directed/written by Emerald Fennel which did the film Promising Young Woman which also had some morbid aspects like Saltburn. The film is charming and delightful with several great surprises I understand the praise very well. Barry Keogahn is an exceptional actor throughout, anything he's been in was worth seeing! I'm not sure if Saltburn will be part of nominations but it should be for set design along with astonishing performances. Anyone that sees Saltburn should be aware it's very weird in several scenes. There's plenty of charm, lush, beauty, and a bit of twisted vibes.",
    "39": "I will admit, I went into this movie blind. I had no idea what it was about and no expectations. The first hour was extremely slow and boring. The acting was ok, the characters weren't realistic at all. It got pretty nasty, not sure why it wasn't rated NC-17. My biggest issue with this movie is why it was so slow and boring. For some reason, they decided to wait until the very end, to put in all the pertinent scenes. Nobody wants to see a movie where everything important that happens during the story is left out, for the last 5min. This was really bad. Like I said, the acting was ok, but it was not a good movie.",
    "40": "No not for all. Doesn't want to be. I thank you for it! What beauty and yes, what ugliness. Wealth and lack. Rich color, light, shadow and sound. Images of excess and endulgence, of emptiness and want. A visual journey I am happy I was able to go on. It wasn't always easy, but it was exciting, shocking, a little twisted, uh yeah, and quite beautiful. Surprising yet at times it was boring like the lives on screen. Beautiful people, surrounded by beautiful things, and yet ugliness was always there. The actors were perfect. Jacob Elordi and Barry Keoghan especially convincing, great performances. Barry's dance at the end was the perfect digestif after such an indulgent and excessive feast.",
    "41": "This film starts off well with a good cast and interesting premise. As things darken and begin to twist it handles things well with some OTT. Characterisation but still remains entertaining. Unfortunately once the main reveal happens it then continues to hit the viewer over the head with a hammer constantly and the ending and subsequent explanation seemed twice as long as it needed to be and brutally patronising. Shame, with more sublety was promising and worked like a decent enough horror / class commentary film. Not a film you are likely to forget, just not for all the right reasons. Weak female and secondary characters didn't help, although the main character is pretty androgynous. The sister ( or one of the servants) could have been so much more interesting and been a good saviour near the end. Not sure why we needed the last scene and if this is a class commentary, what about the servants at the end? After watching with a friend who hadn't seen Withnail and I, decided it to be a much better proposition.",
    "42": "By chance, a free afternoon and so I went to see 'Saltburn' only having seen the trailer. How pleased I was! So much work has gone into this production that it's hard to point at the best elements. If I had to pick it would be the scriptwriting accompanied with the punchy editing that had me laughing out loud. The acting is bang on. Jacob Elordi's portrayal of an aristocratic university student was so real that I'm amazed to read he is Australian. Rosamund Pike's character was amusing, but Rosamund didn't quite cut the age of a matriarch. The locations were blinding. The lighting all throughout was well crafted. I enjoyed the the storyline and the shocking quirkiness of the personalities especially the principal character.",
    "43": "'' Saltburn '' is a movie about an Oxford University student from a simigly poor background who is invited to stay at his aristocratic friend's place for the summer.The movie is a dark academia story that takes a lot from the '' The Talented Mr. Ripley '', which I appreciated a lot, as I was thinking that it will be another film about rich people indulging into their every whim and fancy. So, the twist was most welcomed, as we see Ollie gaslighting and manipulating everyone around him, going deeper and deeper into his dark obsession. However, the film makers took it a bit too far when it came to shocking the audience and having the message cross through, as some of them were simply gross not socking and they really didn't add anything special to the story.The story itself was enjoyable, moreover, but the film tended to present everything in montage, hence it lost its momentum.Still, the performances were great, Rosamund Pike simply hillarious, and the cinematography impressive.",
    "44": "What makes Saltburn most effective in the first two-thirds are the characters, with well-rounded performances given by Barry Keoghan and the aristocratic family he admires, specifically Alison Oliver and Jacob Elordi. His interactions with family members show envy and desire begin to blur, and you wonder about the characters' underlying motives. The dynamic between Felix (Jacob Elordi) and Oliver (Barry Keoghan) is most evident of this, with queer subtext that made me anticipate where the film was going with their relationship.Then, in the last act, the movie falls flat on its face. It becomes bloated and drawn-on, and the character development that drew me in amounts to nothing. In an effort to feel clever and subvert audience expectations, Emerald Fennell writes in a \"twist\" that undoes most of what was interesting about the film. As a result, its message is muddled and ultimately without substance. Killing off nearly all of your good characters to set up a boring James Bond villain-esque monologue where the main character reveals he *planned* all of this is so so lazy and ridiculous. Not only does it raise many questions of logic but it solidifies that the film has nothing interesting to say, and will ultimately be remembered for a few bold scenes rather than its quality.In Fennell's other film, she pulls the same frustrating move. A movie that attempts interesting social commentary has its initial quality degraded by her need to surprise audiences, rather than write an effective ending. It makes me feel like she always begins writing screenplays before considering how they'll end.Saltburn is not a boring film, and it makes up for some of what it lacks with great performances, beautiful cinematography, and engaging scenes. I just can't help but feel disappointed that a film so interesting at the start becomes so shallow.",
    "45": "Literally it was a breathtaking movie!! And the plot was so unexpected!! The ending is so shocking - it didn't spill anything to us until the last minute when all of the truths just start to be revealed altogether...too much for me to take in and can only be shocked again and again ...Oliver is a real evil...horrible!! Since trailer and the first 1.5 hours made me assume Oliver is the victim ...but who knows he turned out to be the big boss...and the way he dresses after all the horrible things he has done, the expression on his face starts to look so different , totally made him an another person. The filming ( the way of photographing) is so arty and enjoyable ( not including the violet scene) and soundtrack is sick! Everything is sick ! This is the best movie that I have ever seen in cinema this year and I might want to see it again!!",
    "46": "SPOILER ALERT:A day after watching this and still feeling creeped out. Yes, I could see the similarities w/ The Talented Mr. Ripley, but that realization didn't kick in until about 1/2 way through this dreadfully dark monster movie.At first I feared for \"Oliver.\" Many scenes wherein he played the victim so well, he certainly had me fooled. Then came the infamous bathtub drain scene. I feel nauseous just thinking about it.Honestly not sure I'd recommend this movie to anyone I know. Although I loved each and everyone one of the actors and even fell in love with \"Felix\" myself, I just can't shake this feeling of wishing I'd never seen this film in the first place. That's how mean and ugly and awful it felt/still feels to me. I guess that's what it was meant to do? To mess with our heads?That one person could wreak so much havoc and get away with it is distressing. Reminds me of the old time movie \"The Bad Seed.\"As one other reviewer put it, too: There's a suspension of disbelief. When the credits were running, I couldn't help wondering where \"Duncan,\" the butler got to . . . He didn't protect his employers after all his many years in their service? He didn't suspect or care to save poor \"Elspeth\" from her horrific demise? Did he, in fact, hate them all all along and hence stood back, relishing their comeuppance?I wish I could shake the awful feeling of doom that overtook me, while watching \"Saltburn.\" \"Oliver\" has really wrecked my peace of mind.",
    "47": "This is one of the most interesting, artistic, deeply terrifying, funniest black comedies, and well made films I've ever seen, and likely that has ever been made, and I would never recommend it to anyone or watch it again, and once was one too many times. About 4 times I considered standing up and leaving the theatre, it was extremely and overly gratuitous, nihilistic, hateful, and I got the impression it was made entirely for the screenwriter to express some deep pit of hatred and degeneracy that was just festering in some pit in their heart, with no regard for watchability, and entertainment, and I respect that immensely. The necrophilic overtones were as unsettling as they were unnecessary, and I respect that immensely. The just pure unrequited hollowness and hatred of the protagonist was terrifying, and I respect that immensely. One of the greatest works of art I've ever experienced in my life, and I can see no reason that it should be or that it should even exist. 10/10, I wish I hadn't seen it.",
    "48": "Interesting and perhaps accurate depiction of the British aristocratic class. Great performances by Rosamund Pike (as always) and Barry Keoghan. The parents were hilariously self absorbed and there was quite a bit of humor throughout. I agree with another reviewer's comparison to the Talented Mr. Ripley as that occurred to me as well as Oliver revealed his chameleon like nature. The movie definitely became more intriguing toward the end as you began to see additional layers of Oliver's character. My reaction to quite a number of scenes was \"how bizarre\" (the bath water and graveyard scenes are several examples) but as Oliver is a psychopath I guess it provided a deeper insight into the depth of his depravity. His mental condition became more obvious over time so the first scene was perhaps more shocking. This movie is not everyone's cup of tea but should be enjoyable to those who enjoy offbeat movies.",
    "49": "I'd seen the trailer in the cinema numerous times, it looked interesting, Mark Kermode made it even more intriguing, and being produced, written, and directed by Emerald Fennell (Promising Young Woman) and having some good names in the cast I was definitely up for it. Basically, set in 2006, scholarship student Oliver Quick (Barry Keoghan) begins attending Oxford University. He struggles to fit in and lacks upper-class sensibilities and the same privileges that many students have from their wealthy parents. He does have conversations with Michael Gavey (Ewan Mitchell) who wants to be his friend, but then Oliver notices affluent and popular student Felix Catton (Jacob Elordi). He eventually strikes up a friendship with Felix after helping him when his bicycle wheel has a puncture. Felix invites Oliver to join him and his group of friends for a drink in the pub, leaving Michael who dislikes Felix. Felix is empathetic to Oliver's stories, including his parents having substance abuse problems and mental health issues. Felix makes a consistent effort to include him despite disapproval from his other Oxford friends, including his American cousin Farleigh Start (Gran Turismo's Archie Madekwe). Their friendship grows over the course of the year, but Felix becomes annoyed with Oliver's constant presence, and they have a small spat. One night, Oliver learns that his father has died and shows up distraught at Felix's door. Felix comforts him, and knowing that he has nowhere to go, invites him to spend the summer at his family's large estate, Saltburn. At Saltburn, Oliver is introduced to Felix's parents, Sir James (Richard E. Grant) and Lady Elspeth (Rosamund Pike), and his sister Venetia (Alison Oliver). Also staying at Saltburn are Farleigh and family friend Poor Dear Pamela (Carey Mulligan). Oliver quickly wins over Felix's family, who are sympathetic to his situation and amused by his lack of social graces. Elspeth is fascinated by him as they bond together, and he grows increasingly comfortable at Saltburn. For a few nights, Oliver sees Venetia in a drunken state wandering the grounds. One night, he meets with her in the house garden, and after some conversation performs oral sex on her. Farleigh witnessed this and goads Oliver about telling Felix about it. When confronted by Felix, Oliver lies that it was Venetia who initiated the act, and he immediately cuts her out from the family. Meanwhile, Oliver's obsession with Felix grows stronger. One night, he watches Felix masturbate in the bath, and he drinks the bath water and licks the plug after Felix leaves. Tensions between Oliver and Farleigh reach breaking point when during a karaoke party they have a flirtatious moment, and Farleigh tricks Oliver into performing \"Rent\" by Pet Shop Boys in front of the family. Later that night, Oliver goes into Farleigh's room, gives him a handjob while also threatening him. The next morning, Farleigh is forced to leave Saltburn after it is said that he was trying to steal valuables from the house. Later, while Oliver is with Felix and Elspeth, she casually mentions that Pamela has died, apparently committing suicide. As the summer draws to a close, Elspeth and James plan an elaborate party to celebrate Oliver's birthday. The morning of the party, Felix surprises Oliver after organising to visit his estranged mother Paula (Dorothy Atkinson), answering a call from her on his phone. Oliver resists, but Felix insists that he try to repair their relationship. However, arriving at his mother's house, Oliver's background stories have been fabricated: his father Jeff (Shaun Dooley) is alive, and his parents live in a respectable upper-middle-class suburb. Felix is angered by Oliver's deception and wants him to leave Saltburn after the party. During the extravagant celebrations, Oliver encounters Farleigh, who reminds him that he will always be an outsider to their lifestyle. Hundreds of guests are there to sing \"Happy Birthday to You\" but it is apparent many can't remember Oliver's name. Desperate to reconcile with Felix, Oliver follows him into Saltburn's large hedge maze. He interrupts Felix having sex with a female guest who runs away, he feels hurt and confusion over Oliver's actions. Oliver tries to reason and perhaps flirt with him, but ultimately Felix rejects him and says he needs professional help. The next morning, Felix is found dead in the middle of the maze. During a tense family lunch, Oliver mentions that the night before Farleigh was taking and handing out drugs, implying a possible connection to Felix's death. James banishes Farleigh from Saltburn and cuts off all his financial support. After Felix's funeral, the Cattons question Oliver's presence, despite this, Elspeth insists that he may stay at Saltburn. Oliver mourns Felix desperately, returning to his grave, taking off his trousers and underwear, and penetrating the soil. One night, Venetia is in the bath distraught and inebriated. She accuses Oliver of disintegrating her family. He tries to seduce her again, but she is disturbed by his behaviour and rebuffs him. The following morning, Venetia is found dead in the bath, apparently suicide after slitting her wrists. James, despondent and suspicious of Oliver's continuing presence at Saltburn, asks him to leave. Oliver repeatedly insists that he cannot leave Elspeth in her hysterical state. But James realises Oliver is manipulative and furiously bribes him to disappear and never contact them again. Years later, Oliver is in a caf reading a newspaper with an article that James has died. There, he has a chance encounter with Elspeth who is delighted to see him. She insists that he return with her to Saltburn, having not been there in some time herself. They spend several months together, but Elspeth suddenly falls fatally ill. Elspeth is in hospital on life support, and Oliver is there recounting all his actions. He reveals he had been responsible for all the tragedies that took place at Saltburn. Oliver deliberately punctured Felix's bike tyre in order to meet him, he poisoned Felix in the hedge maze after final rejection, he subtly manipulated Venetia into cutting and killing herself, and he fabricated the email that led to Farleigh leaving the estate. Finally, it is revealed that he planned his reacquaintance with Elspeth and that she subsequently left all the financial assets to him, including ownership of Saltburn. After all his confessions, Oliver forcefully removes the tube supplying oxygen for Elspeth, killing her. Now officially the owner of Saltburn and the Catton fortune, Oliver dances naked around the mansion to \"Murder on the Dancefloor\" by Sophie Ellis-Bextor, and the death stones with all family names are displayed on a sideboard. Also starring Paul Rhys as Duncan the butler, Reece Shearsmith as Professor Ware, Lolly Adefope as Lady Daphne, Sadie Soverall as Annabel, and Millie Kent as India. Keoghan is compelling as the awkward young man who lingers in the mansion, Elordi plays the charming obnoxious rich boy well, Pike steals all her scenes with her great one-liners, Grant is reliable as always, Madekwe is good at being hateful, and Mulligan's cameo is welcome. What starts as a crush and wanting to fit in with the rich people goes in a dark direction you don't expect, it follows a familiar format where the wealthy eccentric characters are all unlikeable, it is funny when it needs to be, amusingly cringey and uncomfortable in moments, and the twists work relatively well, and the final scene and song choice is genius, it is certainly a memorable and worthwhile black comedy psychological thriller. Very good!",
    "50": "Very much enjoyed this movie. Gorgeous cinematography. Rosamond Pike's performance was divine. Some fun twists. Some gasp-worthy moments. A lot of eye candy. Carey Mulligan was lovely to see here. Barry Keoghan gave an amazing performance, and I think we all enjoyed his dance scene, thank you for that Emerald Fennell. The dry wit of the movie really set the tone and carried through consistently. It's the type of movie you wake up the next morning thinking about (and not just because everyone is so hot). Everyone involved in the final lunch scene deserves an award. Probably don't take your mum or nan with you to this one. I definitely recommend it.",
    "51": "I am writing this review nearly immediately after watching Saltburn, so it's hard to fully put into words the cacophony of emotions that I am feeling right now. I am shocked. I am in absolute awe. This surpassed any expectation I had developed, and I went into this with high expectations. Saltburn is the second full-length film from Promising Young Woman director Emerald Fennel; the two movies couldn't be more different. This surpasses Promising Young Woman in essentially every way. Saltburn is nothing short of a masterpiece.Saltburn follows Oliver Quick (Barry Keoghan) a shy yet intelligent student attending Oxford university. When he meets popular, eccentric, and incredibly wealthy Felix Catton (Jacob Elordi), they instantly become very close friends. However, when a personal tragedy strikes Oliver, Felix decides to invite Oliver to join him at his summer estate, Saltburn. I'm going to stop myself here, because I feel like by spoiling the movie any further, I would be doing a great injustice.The movie is visually spectacular, and could arguably be one of the, if not the single most visually pleasing movies ever. Every shot is a work of art, both pushing stylistic limitations, and being heavily reminiscent of classic Kubrickian cinematography. The visual storytelling is astonishing, capable of portraying emotions and character arcs seamlessly, while also not being overly self-indulgent in the heavy symbolism. That isn't to say that symbolism isn't heavily present throughout the film, because it very much is. However, despite what at first might seem to be a rather surface level satire of wealth and power, there is a far deeper layer that portrays ambition, love, and the human condition flawlessly. But, back to cinematography. Ignoring symbolism and visual storytelling (which, again, is hard to do), every frame is perfection. One shot in particular, which features the main character standing in front of a rose bush outside a window smoking a cigarette may very well be the most gorgeous shot of all time.Overall, Saltburn is one of the most ambitious, uncomfortable, horrific, shocking, weird, funny, tragic, and fresh movies ever. I absolutely loved it. 98/100. Also, content warning. WTF was the bathtub scene.",
    "52": "There are a lot of things to love about this movie: visually gorgeous, great ensemble acting and a standout performance by the lead, wonderfully retro direction that gave scenes plenty of time, and more. But one thing distracted me over and over - I've seen it all before in The Talented Mr. Ripley. Sure, some specific incidents are new to this version, but the overall theme, mood, and delivery matches practically scene for scene. Theree is a lot to really like in Saltburn, and I hope no one's review here will deter anyone from seeing the mesmerizing performance of Barry Keoghan (The Banshees of Inisherin). His final scene is crazily over the top, but everything before is beautifully crafted and subtly executed. He's someone to keep an eye on.",
    "53": ". . . is the source of All Evil, as Robbing Hood once observed. Viewers' first sight of SALT-BURN immediately dictates that only a myriad consisting of thousands and thousands of separate Crimes against Humanity could have resulted in the construction of this creepy old mansion lording it over an immense estate. SALT-BURN confirms that inherited wealth produces some of the worse threats to Society, as generations of profiteering on the misery of their Fellow Man leaves the hopelessly harmful heirs as incorrigible cesspools of imbecility, incapable of being a positive influence for the Greater Good. Ruthless wannabe Oliver represents every so-called \"self-made\" wealth hoarder in Real Life, pathologically lying and callously murdering his way to the top of a money mountain. EVERY famous rich dude on the Forbes Liquidation List or on the front page is at least as Evil as Oliver, which is why we're constantly bombarded with innumerable reports on the vile sects habits of these totally warped miscreants. SALT-BURN's main fault is depicting its high-fluting scrum in a too attractive light.",
    "54": "She's a mischief maker, that Emerald Fennell.Last year, the versatile English actress, writer and director won a bunch of awards, including an Oscar for writing \"Promising Young Woman.\" It was a wry tale of gender vengeance featuring Carey Mulligan as a med school dropout who finds brilliant ways of settling scores with the perpetrators of a gang rape of her classmate. Actually, her target was more like men in general.Now Fennell's back with \"Saltburn,\" another diabolical tale of settling scores that dances precariously on the line between black comedy and horror show. It's brilliantly written, dangerously sensual, sumptuous to watch, and thoroughly unsettling - that's the point.Barry Keoghan stars as Oliver Quick, a bright young Oxford student often at the mercy or the butt of the joke for wealthy, legacy classmates like snobby Farleigh Start (Archie Madekwe). Seemingly comfortable enough in the role of nerdy outcast in his scholarship wardrobe, his fortunes change when he is befriended by classmate Felix Catton (Jacob Elordi). Felix is everything that Oliver isn't - obscenely wealthy, charismatic beyond belief, catnip for any woman in sight, utterly assured in every moment.The friendship begins with an act of giving on Oliver's part, but is that enough to explain Felix's endless generosity in return? They're hardly equals, but the rich son of nobility keeps acting as though they are.Are friends just playthings for Felix? Is their improbable relationship love, or lust, or what?We suspect we're going to find out ... but we're not sure we want to.The enigmas mount after Felix invites Oliver to his family's opulent estate - Saltburn - for the summer.In endless corridors lined with original art and folio editions of Shakespeare, Oliver is greeted by the family, a decadent bunch for sure. When he first meets Felix's father, Sir James Catton (Richard E. Grant), he's giggling like an eighth grader watching a video of \"Superbad.\"\nSir James is in the library with his loquacious wife Elspeth (a terrific Rosamund Pike), who calls everyone \"darling,\" but can barely wait for them to leave the room to start talking about them. Her first such target, played by Carey Mulligan, is identified in the credits as Poor Dear Pamela. The coterie includes daughter Venetia (Alison Oliver), pouty and blond, Oliver's first seduction just waiting to happen.Farleigh Start, Oliver's nemesis from Oxford, is here, too. He's a cousin, his status something between family member and freeloader. Symbiotic relationships - people using, or misusing, or toying with or otherwise exploiting each other - are as close as the Cattons can come to family ties, as they while away the summer in alcohol and swimming spots and one debauchery after another.Beginning with Keoghan, last seen earning an supporting-actor Oscar nomination for \"The Banshees of Inisherin,\" the performances are wicked and delicious.Underpinning them all is the peculiar bond between Oliver and Felix. Oliver talks to the camera periodically - a device director Fennell uses to frame the narrative - seeking the distinction between loving and being in love. But we suspect that neither he nor we are getting to the sordid depths of the matter.Fennell as a smart, stylish filmmaker, whether it comes to probing psyches or orchestrating amazing tracking shots, going from room to room or building to building, sometimes with scores of extras in the background. She is a master of ambiguity, not tying up loose ends but rather letting questions of character linger.The fact that she has a devilish sense of humor is another plus ... or drawback if you don't have the stomach for \"Saltburn's\" eat-the-rich school of comedy.",
    "55": "I don't know what this movie is saying. Nothing new was my first thought; shades of Brideshead, Ripley, Teorema, and the Penny Dreadful. Not to mention scenes from the Harry Potter movies. Add to that gratuitous bad sex scenes, unrealistic (and inaccurate) Oxford settings and a script tending towards clich. Seldom has a movie had no likeable characters in it but then there's very little character development shown. I read that the director suggested it was about obsessive love; well, maybe, but what does it say that's new? And it is definitely not an entertaining or comfortable watch. Finally the depiction of the maths geek is way off - arithmetic is not the same as mathematics!",
    "56": "This is a film not for everyone but if you like your class based satire with lashings of jet black humour and sinister undertones its one to watch. I LOVED it. I had to stifle my laughter at times just like I did with Yorgos Lanthimos' The Killing of a Sacred Deer, also starring the ubiquitously brilliant Barry Keoghan. He's quickly becoming one of my favourite actors and it's great to see him in a lead role of a major movie. Similarly excellent turns from Rosalyn Pike and Richard E Grant, and look out for a cameo from Carey Mulligan who starred in the director's last (first?) film Promising Young Woman, which was equally sinister. Most notable is a quietly hilarious piece of acting from Grant when he quips about the simplicity of karaoke. It's genius. The film is a must watch again 8.5 out of ten.",
    "57": "Entertaining enough but typical of the netflix funded films (this is actually Amazon but same style), big budget for actors and filming, lower budget for the script. Characters act inconsistently just to suit the plot and, when ideas run short, throw in a few OTT sex scenes... these are always good for getting newspaper inches and maybe the youth of today like them?Has been compared to Mr Ripley and similar basic storyline but lacks the jeopardy of that film and consistency of plot.All in all, worth a look but the OTT sex scenes may make it an uncomfortable watch with your mum or for a first date.....",
    "58": "I am 45 minutes into this horrific, gross motion picture which so far has nothing going for it. How I can write another 400 words about it is beyond me but somehow I will have to keep going.How Amazon could finance anything like this is beyond me. There can't be very many good scripts out there to select from. I have worked in the film industry for many years and I can only say this story is a complete bore.The direction is absolutely shocking and the acting not much better. Now an hour into it but heavens above, over another hour to go.I am sure the appeal to this film must be to no brainers under 30. Well I have reached the word total so all I can do now is see if this gets published.",
    "59": "The cast, acting, writing, and cinematography are all superb in this film. I honestly didn't want the movie to end. This is definitely a movie that I plan to revisit again. What an absolutely wild and fun ride. I know it's not likely but boy would I like to see a sequel to this movie because the end left me wanting more without a doubt. A prequel would be even better and definitely within the realm of possibility. At any rate, I highly recommend this film and encourage everyone to form your own opinion and check it out. Personally, I give it a 10 out of 10. Oh and one more noteworthy area to mention is the great soundtrack!",
    "60": "With the annoyingly daft font of the opening credits I was concerned this film was going to be a major disappointment. I needn't have worried. It is excellent - one of those rare films you see that makes you think at the end 'f me that was great'. Without spoilers, Barry Keoghan is such a perfect fit for the character. Most actors (particularly the really big Hollywood names) are doing the job without any special qualities or skill, but just happen to look 'good'. BK knocks them into mediocrity. The supporting cast are good; a special mention for Rosamund Pike who plays her character deliciously. The film keeps you guessing as to what it's all about, but in an intriguing and entertaining way. All is explained at the end with a delicious reveal. The odd 4:3 aspect ratio is weird and somewhat of an arty affectation that is unnecessary, but the film itself is just so good it doesn't bother you. Soundtrack is great too. All in all, the best film I have seen in a long time, hats off to writer and director Emerald Fennell.",
    "61": "I can say it took me some time to work through how to process this movie. It was intoxicating and full of twists and turns. Up until the very last minute I was still not sure what was coming next.It definitely a take on power and control and what some will do to have everything they want. The main character, is likable and kinda pathetic, you feel for his social awkwardness and his story. When he makes it in with the \"cool kids\" he gets to have the vacation of his life. Saltburn, where all they do is lounge, have fun and party.This wild twists will make you want to rewatch and piece it all together!",
    "62": "This was a crazy train; very true to what we would expect (and want) from this author. I can't say I like it more than PYW, but it's hecka close. This OG cast was beyond, and the newbies were all perfectly cast. I typically hate feeling so awkward watching a movie but could not tear myself away from this film. It's extreme bougie, in its truest sense - which was fun. The opulence was strangely understated - but vulgar at the same time. This was my first introduction to Barry and I will now enjoy searching for his movies. Quite the powerhouse. He feels like a subtle tsunami that comes when it's darkest.",
    "63": "Very interesting portrayal of a sociopathy that aspires to the upper crust, and concocts a pretty good plan to get there. It includes several adjustments on the fly when it looks like he's about to lose it all but he manages to adapt and overcome with guile and patience. The family members are very eccentric to say the least and it makes this elaborate grift a bit easier to execute . But do know that they were all very talented and were very strong in their individual scenes. A perfect supporting cast. There are hints from The Talented Mr. Ripley but it is one movie that stands out on its own. Good to see Rosamund Pike again. Very easy to watch.",
    "64": "An interesting film and apparently divisive according to one critic and not-as-good-as Promising Young Women according to another (which I must now watch again).I went into Saltburn having only seen the trailer (which I normally try and avoid) and not having any preconceptions. It was thoroughly entertaining!The cast and performances are all tremendous and add to what is an enthralling and in some ways an unusual story. It runs with a consistently good pace, revealing many surprises (some of them almost making me want to look away), with lots of humour. It also oozes style and substance, which for me was central to the poor-meets-rich story that unfolds. Finally, the entire story arc, the structure, and the direction were all just about perfect, makng it seem a lot shorter than it actually was.",
    "65": "This film is amazing but not for the faint hearted from the phenomenal cinematography to the diabolical characters this film is worth a watch. Anyone saying it's a copy or derivative doesn't know anything about the film industry. I went into the film with a strong idea of the plot from the trailers however this film blew my ideas out of the water. The ending is guessable because you knew a twist was coming but the very strong script keeps you invested in the film. The scenes are done very well so you never see to much but they are still very much implied and you know what's happening. Pike and Grants characters however small made this film amazing.",
    "66": "Maybe it was the good bits i fell asleep through but this film is a stinker.Trying to hard to shock and not hard enough to make remotely realistic or interesting. The grounds of the estate are well captured so that gets my 3 out of ten. The party scene is just plain silly and the last 30 minutes just didnt need to happen. The two main leads did a good job . Grant as the father was wooden when he could have been so much more. The randoms at the house just didnt need to be in the story and the staff were caricatures of themselves.Needless to say I was extremely disappointed with this film and i just did not see the need for it.",
    "67": "I found this film unpleasant, entitled, and horrifying. I honestly can't understand the high ratings. The characters are stereotypes, two dimensional and totally unlikeable, but maybe that's the point. The best part was the last 10 minutes because that was when it was ending. The cinematography is good and the soundtrack isn't bad. It was just such a cynical, pointless and empty film, with nothing original to say, and if I had paid to see it at the cinema I'd have wanted a refund. All the actors are better than this. They didn't deserve to be in this turkey. Find a better way to spend nearly two hours!",
    "68": "Saltburn may strike some as clich with its juxtaposing classes exercise, but the real hook in this film is in its sublime thriller chops and excellent character reveals. Rosalind Pike is awesome ! Barry Keoghan turns in another amazing role. Richard E Grant is in his reliable and gut wrenching prime. Supporting actors playing Venetia and Felix are mesmerizing and serve up surprises right when they are expected to.Saltburn is a psychological thriller dressed as a class warfare flick. Keoghan's skill at portraying a slightly neuro divergent psychopath is stellar.These were the best two hours spent watching films in a long time!",
    "69": "The trailer doesn't do this film justice. It was probably one of the most enjoyable films I've seen in theaters for some time. The plot was cleverly woven and delicately but depravedly amusing. Yes you do get a sense that not everything is as it seems, but you're taken along for the ride in a way that makes this film a guilt pleasure. Filled to brim with hedonism, lust, betrayal and sin. Barry Keoghan is delightfully strange, and does a great job of playing the deceitful interloper. While the ending is not entirely a surprise, the story doesn't disappoint and is filled with enough tension and awkwardness to cultivate raw reactions. Some scenes were definitely too long and unnecessary but overall I really enjoyed Saltburn.",
    "70": "Saltburn is a deliciously entertaining and insanely conceived film. All the main cast, especially Barry Keoghan, Rosamund Pike and Jacob Elordi, are outstanding and perfectly casted. Barry Keoghan is fearless and gave the performance of his career. Jacob Elordi, as photographed by cinematographer Linus Sandgren, has never looked more captivating, and played the role of Felix with effortless ease. Who needs special effects when you have Jacob Elordi and Barry Keoghan. The film is about desire, and has so many \"oh did they just go there\" moments, is a gorgeous and memorable movie experience. One of the most enjoyable film I have seen in years.",
    "71": "Some dialogue and plot deficiencies in the film are noticeable. Especially in the second episode, the story progress slows down a bit and may bore the viewers. It is also a point of criticism that there is a feeling that the motivations of some characters are not sufficiently explained.It is possible to say that the film was successful in terms of direction and cinematography. The dark and mysterious atmosphere of the town of Saltburn is skillfully reflected. The use of camera and location choices also made the film more impressive. In addition, the music accompanying the film further deepened the atmosphere of the story.Saltburn can be considered a movie that offers an enjoyable experience for those who love thrillers. However, given some story shortcomings and ambiguities in character motivations, the film could have been handled with greater depth.",
    "72": "What a trip, visually. The color, camera work, settings...really something to see. First time around, this will grab you and won't let go. Until the end. Maybe. I'm still thinking about it, though not sure if it's as deep as it seems. Emerald Fennell sure can direct actors and her tech crew is beyond top-level. Much of the time, this looks like an instant cult film--there is that much in it to keep you re-watching and talking about it. Barry Keoghan is perfect---really, who could have been better? He's got the right look for the character--attractive, but not Elordi-level....that keeps the initial tension firmly in place all the time. *No Spoilers*, just saying that there is more in this than meets the eye. So stick with it, if you think this is just another \"let's be weird for two hours\" type of thing. It's not. If nothing else, it's so brilliant to look at, and listen to, with great dialog. Funny as hell---has Carey Mulligan ever been more amusing? With Richard E. Grant, Rosamund Pike, Paul Rhys (as Duncan the butler) and Mr. Elordi, all in top form. A must-see.",
    "73": "There are probably only two camps when it comes to this movie. Some will celebrate it (and misunderstand it), others will reject it because they find it undemanding and confusing. I belong to the second category. Maybe I'm too old and have seen enough movies to be able to say that the plot of Saltburn isn't really new. I also know Absolutely Fabulous, so I can see quite clearly that Rosamunde Pike seems to have stolen from Jennifer Saunders. Her dialog, her tone of voice, everything is reminiscent of Edwina Monsoon, Saunders' character. Apart from that, this comedy is not a comedy at all, but mixes satire with drama, is rarely funny, but mostly you wait for the supposedly too obscene scenes, only to realize that they are more likely the result of good marketing around the film. Yes, they are unusual, but they fit well with the character of the main character, a narcissist who thinks he has fallen for someone, but whose real goal is something completely different. You eventually realize that this Oliver is not the victim he claims to be, but an exceedingly clever fellow who has the entire aristocracy in his pocket. Emereld Fennell's direction is addicted to beautiful images on the one hand, but on the other we see party scenes like something out of a bad Spanish TV series. Everything just doesn't want to fit together. In the end, I'm ashamed that I stuck it out. It's not worth it in the end.",
    "74": "What a great movie I just watched. Wow. They still make those.This movie is awesome. Some sex. Some vilains. Some disgusting. Some disgusting sex! (Yeah!) in the best castle environment you could think of. Women unfortunately have a secondary role here. Patriarchy is king here. I would love to be a boy born in this family. Be a prince. Call it a day. I loved how each feminin character (woman) is portrayed by a dysfunctional human. The girls in this movie are stupid and the guys were super-stars. Fun to say but feels different for a 2023 movie. Finally.I strongly recommend. I loved this movie.",
    "75": "Why is it the devil always seems to say the same story again and again, simple he wants to keep you here in his little world, tied around his finger. Saltburn is yet another twist told by the devil, saltburn represents escape from God and becoming your own god full of lusts and sins of the flesh while rejecting what is true, as the trailer says \"i don't think i'll ever go home again\" so too does this represent satan and his departure from Heaven to form his own false view full of pain and suffering, death and destruction all while heading down a path of corruption, he takes what is good and corrupts it and paints it as nice and shiny so when you eat the poison apple you don't feel so bad and you forget that you've been tricked into accepting a lesser view of paradise. Satan will promise you the whole world to convince you that God isn't real, he isn't worth it and he doesn't care about you, but in reality the one that doesn't care about you is the one that has a hold on you in this world of his and continuously feeds you poison to keep you trapped in his construct. Helluva Boss, Hazbin Hotel, Alice in wonderland these are all shows with the same message you're in a construct separated from God and you don't even know it, take the blue pill and continue to stay in this delusion, trapped in this broken world under satans non-stop propaganda machine, take the red pill and accept jesus christ, that he died on the cross, was buried, and on the third day rose again. You accept he's done this for you and you shall not perish but have everlasting life, you'll break free from satans deception, take the red pill and reconcile yourself with God so you can finally escape this false reality that keeps you entangled in this lie.",
    "76": "I just came out and felt compelled to write something - this is original, funny, fresh, wild and just so damn entertaining!!! Emerald Fennell is the ultimate writer - director! While it's out there for some people - that's also what makes it just a brilliant cinema experience. Try to avoid all spoilers and then google the soundtrack straight after! Rosamund Pike and Carey Mulligan are a RIOT!!! Give them more comedy parts immediately!Some of the scenes are so out there I had to almost cover my face but the thrill of it is what makes it just fun to watch!!!Probably the only film I've seen this year that I can't wait to rewatch!!",
    "77": "Truly awful. Why did they bother? Miss Marple would have solved it within seconds, as did we. A dull pastiche of Brideshead crossed with some Downton nonsense and The Talented Mr Ripley. Far too long. Would have been worth one of those hour-long tv whodunits. Awful. As for the acting, well, lack of it. It must have been cobbled together in an afternoon. The characters aren't just wooden they are balsa wood and the ones who are known just play themselves. Some grim stately pile will have made a few bob for letting the gilm crew in, so at least it paid for the grass to be mown. Poor form having to explain what was such an obvious plot. Hey ho.",
    "78": "You could be tempted to call this film Ripley 2.0 and indeed it had shades of that. I would argue this is far better. We all have that guilty pleasure of rooting for someone we know we shouldn't be rooting for. Oliver is certainly that character. As the story develops you realise the many layers of duplicity he has within him, but still I wanted him to win. Maybe that's just my prejudice against the rich and elite classes. A real triumph from Emerald Fennell with this own though. Casting was perfect and each character so believable, I felt I've actually met a few of them. The mis-en-scene was an absolute delight. Please do see this film.",
    "79": "I want to restate THIS IS A GREAT FILM, in all aspects .... story, script, casting, directing, acting, cinematography, soundtrack and shocking ending. It really has it all and as such would have deserved a higher score, but for the unnecessary shock factor scenes that actually just made me feel uncomfortable and took me out of the whole viewing experience.Even for me, an extremely broad minded viewer who has watched and appreciated some very severe scenes in many films, certain parts in this movie went just slightly too far.The bathroom scene where Oliver spies on Felix pleasuring himself in the bath was clearly important to show that Oliver's love for Felix was far more than just as a friend or hero worship, BUT the lingering closeup of Oliver licking and sucking the bath water as it drains away was absolutely and totally unnecessary. It gave the viewer no additional insight into the story or characters and was purely added to shock and make the viewer feel awkward and uncomfortable.An even worse example was at Felix's funeral, when Oliver is left alone to show his grief. For me this was one of the most important scenes in the entire film. It clearly demonstrated Oliver's sole destroying loss of his greatest friend and someone he loved more than anyone or anything else. Made even more heartbreaking by the fact that you now realise Oliver had felt no option other than to kill Felix, as Felix was no longer going to have anything to do with him and would force him out of Saltburn. As he lay distraught on Felix's grave I actually began to shed a tear as it was so beautifully filmed. Then from nowhere he takes all his clothes off and appears to attempt to have sex with Felix on top of his grave. A GREAT SCENE AND ALL EMOTION TOTALLY DESTROYED !!!I understand certain films need to shock and borderline disgust the viewer momentarily, such as the horrific and gruesome Saw traps, which actually adds something to these scenes in that type of film, but in an excellent drama such as this I was genuinely taken out of the movie and any emotions, rather than being drawn even further into it. Very much like an unnecessary pit stop in a race, where you then have get yourself back in and rebuild momentum again.Writer's and director's should be horrified that these over the top and unnecessary shock sequences actually detract from the whole movie watching experience. It's not funny or clever to trick the ticket paying customers with this type of cheap and unnecessary shock factor !!!",
    "80": "Beautifully shot and wonderfully acted movie. Some intriguing twists and turns, some I saw coming but not all. Very dark at times with some scenes that some may find disturbing or difficult to watch. This movie has it all!Barry Keoghan puts in yet another stellar & highly convincing performance that leaves you aching with sadness for his plight and his need to be loved ....SPOILERS\n.... but all is perhaps not quite what it seems and just who are the real victims? The rich, gluttonous, self obsessed or the seemingly poor lonely, unwanted, (somewhat creepy) and unusual Oliver Quick?Strong performances from Rosamund Pike, Richard E Grant, Carey Muligan and Paul Ryan as Duncan the butler is a delight!",
    "81": "Many films leave you saying, \"If only they had taken it further,\" and this is certainly not one of them. One cannot help but notice the gothic bloody homage to Bram Stoker's Dracula (you will know the scene I am referring to). And that castle dance of a finale is the icing on the cake to this unique and boundary-crushing movie.Every single performance from the characters is mesmerizing, even when there is a slow and subtle buildup.Emerald Fennell is quickly becoming a favorite director: unafraid to take risks, a flair for beauty, and the willingness to take you places you've never been before cinematically.",
    "82": "The latest iteration of Mr. Ripley, this time successful in his scheme to steal the identities and social power of others.Though acted with passion by all the actors, the film falls short of any real complexity and depth; the characters serve only as one-dimensional chess pieces; the several relationships are at best forced and stereotyped, and so is the description of that aristocratic world; some scenes, with all their metaphoric intent, verge on the ridiculous and kitsch for the purpose of pure entertaining: the protagonist licking the bathtub where his obsession (Felix) had just ejaculated; the creepy sexual conquests by the main character with members, completely unjustified if not because we have to assume he is irresistible; so irresistible is the charm that the whole aristocratic family is tricked by, as if they are some sort of naive, vulnerable bunch of idiots; then -be ready- the tired symbolism of a labyrinth (really!) with a cartoonish statue of a demon in the center, worthy of a B- horror movie. Predictable and literal, this concoction is saved, as said, by the effort of the actors, who infuse the various characters with layered and effective performances. Also, why was Carey Mulligan cast there? And that freaking wig?!?",
    "83": "This film ia way so good. Emerald Fennell's class-obsessed film is a deliciously twisty tale of grotesque overprivilege. Barry Keoghan and Jacob Elordi lead a gung-ho cast, which includes Carey Mulligan and Richard E Grant, who is having the time of his life. What ensues is a heady midsummer's nightmare at Felix's family home in the eponymous estate: a gargantuan manor where secrets line the many, many walls and every beautiful thing hides horrible truths and even more lies. It would be easy to dismiss it as an all-too familiar affair for Fennell, who graduated Oxford in 2007 and rarely shies away from her affluent upbringing - but Saltburn is so delicious in its twists, the gorgeously lensed disasters and endless farces, that it's impossible to ignore the work of a truly gifted and haywire filmmaker.",
    "84": "Saltburn as a collection of shots, scenes and beautiful colours is a masterpiece. From the castle to the outfits and to the lighting this movie does well to avoid the modern trend of muted colours and \"ultra realist\" images.The plot whilst initially shocking and spectacular leaves a little more to be desired at times with many of the movies key scenes having little hinting or leadup. This is to be most critical however as. I would still laud it to be strong in all dimensions.The acting is too excellent with Barry Koeghan and Rosamund Pike producing the finest performances. This movie is a must watch for avid moviegoersThe red curtain scene is absolutely the most powerful and the ultimate culmination of every secret and lie told between everyone in saltburn.",
    "85": "I watched this at the cinema and the audience reaction said it all - lots of laughter, squirming in seats, ooohs and aghhs, gasps and noooooooo's!! I like to see a film thta makes the trip to the cinema worthwhile, Saltburn certainly ticks this box. It is playful, mischievous, shocking, well cast, (you will love to hate some of the characters and may even wish to love others), great cinematography (looks good on screen :-) ) One moment you are languishing in the opulence of the sumptuous surroundings and the next you wish to be beamed out of there. Such a good film and money very well spent, I may even go back for deserts!",
    "86": "So it's a film where the central character is a psychopath and, like with Ripley, at least in the first book, not a particularly charismatic one. But it's not a suspense film like The Talented ...etc or Psycho because, unless I was being obtuse, you don't really get a hint ,until somewhere into the last quarter about what's going on. It is quite witty. Felix states that some of his ancestors were sources for Evelyn Waugh and it's clear that Felix's ancestral home and family bear a distinct (though in some cases inverted) comparison to the Marchmains. It would make more sense, as a drama, I think if they let us in on the plot a bit earlier.",
    "87": "I finally was able to watch Saltburn (2023) today. Yes, this is somewhat of a neo-Gothic tale, set in a sprawling family manor, full of gloomy atmosphere, odd characters, and it definitely kept me guessing for most of the way through. And I don't want to include any major spoilers here, but this one is far less of an Ann Radcliffe Gothic and so much more a Patricia Highsmith thriller (you'll see what I mean when the ending approaches). I'm rating this six on a scale of ten, mainly for the outstanding acting, incredibly beautiful sets, and stellar camera work, while subtracting a few stars because the ending felt just a tiny bit too unsatisfying to me, as there was the distinct feeling that I've visited this story before (see my allusion to Patricia Highsmith above, cough, cough, The Talented Mr. Ripley). All negative criticism aside, I'm happy to see more films such as this and hope that future filmmakers will keep making efforts along these same lines.",
    "88": "A big disappointment. The last third or so.The film makes no sense to me.I have no idea how Felix dies. Was he murdered? Suicide?Apparently, neither the family nor the authorities much care.What? Oliver always dreamed of being the lord of a manor?Yet , he keeps insisting that he loved Felix.At no point do we see Felix do or say anything negative about Oliver, except when he finds out that Oliver has been lying about his parents and upbringing.Iffrom the beginning it had been established that Oliver resented his new friend's wealth and popularity with girls , the story might make some sense.Despite the setting- OMG are we back at Bridesdhead?- and an extendeded look at how the 1% live, it left me puzzled and disappointed.I am glad that I did not pay. I thought I was to see Poor Things. I felt like one instead.",
    "89": "This movie is. Something else. Maybe I'm just the exact right age and taste level but I cannot love emerald fennel more. She kills it. Rosamund Pike is at her best. I want to be her character when I grow up. Barry Keoghan is so attractive and so spot on despite being just a tiny short boy. They accentuate the height differences a lot and it makes the whole scenario make sense. Honestly, you'd think that Jacob Elordi would be the sexy guy in this film and he is. But you don't really see it explicitly. As sexy as this is, there is virtually zero nudity until full frontal at the very end. Everyone is attractive. Don't watch with mom & dad.",
    "90": "Dark and twisted story line and it keeps you guessing what the reality really is throughout the entire movie. After an extremely dull and disappointing Maestro and a Highly produced Oppenheimer, this movie hit right. Just enough beauty, incredible acting, and creative engaging storyline to make this one the best movies that I have seen in a while. Some reviews talk about the over the top scenes, but there is a reason for that. It lends to the complex character that you're following and trying to figure out. The story and the characters are all flawed; It's twisted and it is so good! 100% It should stand out and get recognized during award season. Finally, a movie that is unique and worth talking about.",
    "91": "I saw quite a few review saying how gross and extreme this is, so I thought I would hate this. After watching this on Prime, I don't think it's actually 'that' shocking.Like, sure, there are many 'eww' scenes in there, but all the controversial scenes are done intentionally that way to provoke emotions and serve a purpose in the narrative.Barry Keoghan's portrayal of Oliver Quick was impressive, with his creepy demeanor and unsettling vibe capturing the character well.The visual style of the film is notably interesting. It starts off with this sort of dreamy quality and then slowly turns into a nightmare. This shift in tone was not only visually interesting but also felt very symbolic of the story's progression.",
    "92": "This movie has personality, and keeps you on the edge of your seat throughout. Surprisingly hilarious at points with classic dry British humour, and very uncomfortable at others. Brilliant performances all around, especially by Barry Keoghan who made me uncomfortable whenever he came on screen (which I'm sure was intentional). This is complemented by fascinating character personalities - each with their own positive attributes and flaws. Full of difficult themes, yet somehow covered with levity. The typically gothic English settings of Oxford and Saltburn complement the disconcerting story. Will be watching again. Expect to be left somewhat shocked.",
    "93": "Scouser student Oliver (Barry Keoghan, who is not English but Irish) arrives at Oxford University where he sticks out like a sore thumb (\"he's a scholarship boy and buys his clothes from Oxfam\" sniffs one plummy-voiced deb). Despite this he attracts the attention of Home Counties aristocrat Felix (Jacob Elordi, who is not English but Australian/Spanish) who takes him to his family's country pile - the titular stately home - where Oliver meets Felix's family of stereotypical English aristos: vague mother, mad father, nymphomanic sister, American cousin (Archie Madekwe, who is not American but English/Nigerian/Swiss). At first even more out-of-place than he was at Oxford, Oliver quickly becomes used to life at Saltburn. But for how long will he be welcome there?Watching this at the 2023 London Film Festival, I found it reminded me of various other films: the obvious one is 'The Talented Mr Ripley' (1999), but there are also aspects of 'Wild Things' (1998) and 'The Riot Club' (2014). Despite this, 'Saltburn' does stand on its own two feet, principally because Oliver's motives are ambiguous and, unlike 'Ripley', there is a vein of comedy throughout (sometimes unintentionally: a scene of Oliver drinking bathwater into which Felix has just ejaculated had the audience falling about, but I am not sure that was the intention of writer/director/producer Emerald Fennell!) I also appreciated that Fennell avoids the reverse-discrimination trap of making rich folk exclusively nasty but instead shows that - hey! - aristocrats have feelings too! Felix, especially, is sympathetically-drawn. If I have any criticism it is that at over two hours the film is over-long - after the birthday party sequence it seems the film has reached a natural conclusion, although there is, it turns out, good reason for it to carry on... perhaps a few of the mid-way scenes could have been cut.The supporting players are gifted with enjoyable parts - standouts are Carey Mulligan as a drug-addled socialite and Paul Rhys (who, thirty years ago, would have been a natural to play Oliver) as a straight-laced butler. Those actors essaying accents not their own do a good job - Elordi's rich-boy drawl, in particular, is convincing. And as for leading man Keoghan - the lengthy sequence during which he dances nude to 'Murder on the Dance Floor' is likely to be one of the most-discussed scenes of the film.",
    "94": "Emerald Fennell leaps over any potential sophomore slumps with Saltburn, an immensely twisted tale of obsession and excess that's black comedy eventually goes into much darker territory. It's bold, provocative and just so funny, buoyed by a cast who completely understand the assignment and deliver glorious results.Barry Keoghan gives a fearless performance, bearing all in more ways than one. His character is so fascinating, initially an audience surrogate that could've felt overly safe but his constant weaving in and out of control is a real highlight, making him so much more interesting and flawed.Jacob Elordi is enchanting, he's so kind without a single care in the world and one of the few seemingly nice people in Saltburn though not without his own self obsessed flaws. Rosamund Pike and Richard E. Grant dial it up to eleven and get some of the best laughs.Emerald Fennell and cinematographer Linus Sandgren craft a gorgeous film of vivid saturation and striking imagery (some of which cannot be unseen). Equally strong is Fennell's screenplay which is hilarious, almost every scene has at least one memorable joke or biting line of dialogue.",
    "95": "Oliver Quick becomes captivated by fellow student at Oxford, Felix. When Felix tells Oliver that his father has died, Felix invites Oliver back to his family home, the grand mansion estate of Saltburn.Imagine coming from a humble background, and being dropped into a world of luxury and abundance, where aristocrats live their lives detached from reality.This had me captivated from start to finish, truly one of the most unique and original films that I've seen for some time.The trailer captivated me, I had high expectations, if I'm honest, it exceeded my expectations. The writing oozed quality, great story, with some magnificent characters.At times it's bizarre, amusing, sexy and intriguing, and at times it's just plain weird. It simmers away for the most part, until the last fifteen minutes or so, when it transformation with a jaw dropping twist.Beautifully filmed, it looks amazing, some of the camera work is exquisite, and that building is simply glorious.The acting is first rate, Rosamund Pike, Richard E Grant and Carey Mulligan are all spot on, Barry Keoghan however, his performance deserves awards, that dance!! Won't forget that in a hurry.Loved it, and didn't want it to end.9/10.",
    "96": "SaltburnNow this was an interesting film. It's a mind game. It's manipulation. And it's nefarious. Be prepared to squirm Be prepared to gasp. Be prepared to say \"oh dear God\" a few times. The movie follows a very shy and quiet Oxford student on his quest to fit in. After a school year, he is invited to join his new friend at his family's enormous castle where we definitely see him in a fish out of water situation.Then things... happen. Oh boy do they happen. This is all I'm going to say but be prepared for a wild ride, and don't be squeamish. I enjoyed this, but it really deserves its R rating. It's very adult and highlights the depths human beings can go, regardless of material wealth.You know I love to find the human experience presented, possibly with a lesson in mental health awareness. Oh God no. Perhaps there is awareness, but there is no lesson.Rosamund Pike does steal the show. Her one liners are absolutely hilarious.Enjoy the ride.",
    "97": "My Review - Saltburn\nMy Rating 9/10\nIn selected Cinemas nowSaltburn is the latest movie from the brilliant creative writer, director , producer and actress Emerald Fennell since her 2020 triumphant movie essay on vengeance Promising Young Woman which starred her friend Carey Mulligan.Carey Mulligan only plays a cameo role in Saltburn but what a brilliant cameo role it is of Poor Dear Pamela the unwanted dysfunctional house guest.Carey Mulligan in an interview with Margo Robbie a co producer of Saltburn said that the role Emerald Fennell originally offered her was not the one she ended up playing. On reading the script Carey Mulligan said she decided that she wanted to play poor dear Pamela and Emerald agreed to her request .I'm only assuming the other role offered to her was that of Lady Elspeth Catton played in the movie to perfection by Oscar nominee Rosamund Pike.This movie in fact has four Oscar nominees in the cast Richard E. Grant, Barry Keoghan, Carey Mulligan and Rosamund Pike.It's no wonder to me that Emerald Fennell it's creator has received numerous accolades, including an Academy Award, two British Academy Film Awards, one Screen Actors Guild Award, and nominations for three Primetime Emmy Awards and three Golden Globe Awards.One reviewer described this movie as a Promising Young Man takes a seedy turn as it follows a young university student who becomes infatuated with his aristocratic schoolmate and his wealthy but eccentric family.My only regret with this movie is the fact that Emerald Fennell chose the 1.33:1 aspect ratio , her reason being that it gives the impression of \"peeping in.\"\nThe magnificent cinematography by Linus Sandgren in my opinion deserves the full anamorphic 2.39:1 widescreen aspect.I call this movie an Art House black comedy thriller if I had to describe it in a few words I think I would say it's Brideshead Revisited with the style of Peter Greenaway the avant- garde director of famous 1980's movies like The Draughtsman's Contract , Drowning by Numbers and The Cook, the Thief, His Wife & Her Lover .This wonderful movie for me was a complete surprise and is now in my top 5 films of 2023 . It may not the be finest of the year but certainly the most original and entertaining in my opinion.Not everyone will share my view but I adore clever screenplays about the psychology and obsessional aspects of the human mind especially when tinged with black humour.I couldn't help thinking of Evelyn Waugh's Brideshead Revisited while watching Saltburn so after seeing the movie I wasn't surprised to read that Emerald Fennell recommended Jacob Elordi the Brisbane born handsome actor read Brideshead Revisited to prepare for this important role in his career .In complete contrast Jacob will be playing Elvis Presley in the forthcoming movie Pricilla based on the early relationship of Pricilla Beaulieu and Elvis .In Saltburn Jacob Elordi plays the pivotal character of everyone's affection Felix Catton the son and heir of Sir James Catton played with delicious detachment by Richard E Grant and Elspeth Catton perfectly cast with the glamorous Rosamund Pike .Rosamund Pike has never looked as glamorous in a movie her gowns and all the costumes designed by Sophie Canale who was assistant costume designer on Bridgerton are outstanding especially in the spectacular fancy dress masquerade birthday party scene in honour of the family interloper Oliver Quick also played to perfection by the Academy Award nominated Irish supporting actor Barry Keoghan in The Banshees of Inisherin Barry Keoghan.Barry Keoghan's character Oliver Quick is the cuckoo in this nest of privilege , an intelligent young man from a middle class family studying at Oxford not because of family wealth but on a scholarship .His character appears benign at first but gradually develops into a complex and devilishly ambitious assault on the upper class family whose hospitality and wealth turns his Summer of love into a quest of betrayal.The movie begins with Oliver's narrative explaining his obsessional affection for the charismatic Felix Catton whose life ,family and popularity starkly contrasts Oliver's nerdy dullness . Oliver through a set of careful manoeuvres manages to enter the world of Felix Catton and his aristocratic eccentric family.Similar to Brideshead Felix invites Oliver to spend the Summer at his family's ancestral home Saltbush where he is welcomed by the glamorous matriarch Elspeth .No spoilers everyone should experience this amazing movie with fresh eyes preferably on a cinema screen as it may look very boxy on a television screen.As mentioned the sets and location shooting are stunning and feature the historic cobbled Radcliffe Square in Oxford and its walled surroundings and colleges.The stately home that Emerald Fennell chose as Saltburn is Drayton House in Northamptonshire and has never been used for filming before and may never be used again\nI haven't mentioned many of the brilliant ensemble cast but the two standouts for me were Archie Madekwe as the young border at Saltburn Farleigh Start who sees through Oliver Quick and becomes an object of jealousy.Also the beautiful but troubled daughter of the household Annabelle played by Sadie Soverall all the performances including the supercilious scene stealing Butler played by Paul Rhys are wonderful.I'd love to spend a day in Emerald Fennels mind the characters that inhabit it in the stories she creates in Killing Eve ,Promising Young Woman and now Saltburn I find fascinating.",
    "98": "I was quite nervous when I saw this. I was expecting a sort of hybrid of \"Another Country\" meets \"Brideshead Revisited\" as the story of \"Ollie\" (Barry Keoghan) and his aristocratic pal \"Felix\" (Jacob Elordi) unfolds. Both are at Oxford university, but the former man is very much a poor relation of his well-heeled contemporaries. One afternoon, though, he comes to the aid of \"Felix\" lending him his bike, and what now ensues is a friendship that sees the two gradually start to bond and for the latter to invite his new friend to his eponymous stately pile as a guest of his mother (Rosamund Pike) and father (Richard E. Grant). Tagging along throughout this experience is the slightly malevolent and jealous \"Farleigh\" (Archie Madekwe) as their summer vacillates from the hedonistic and enjoyable to the ghastly and tragic. It's a bit of a slow starter, but once we arrive at the ancestral pile the story starts to gather pace and \"Ollie\" proves to be quite adept at navigating - even manipulating - the frequently quite treacherous environment in which he finds himself. It is definitely too dialogue heavy, but Keoghan is good here and there is quite an effectively building degree of menace as we start to realise that maybe things aren't all quite what they seem. I found Madekwe also rather good as the odious hanger-on (only a posher one) and Carey Mulligan walks quite a characterful tightrope too. The photography and aesthetic of the film along with Anthony Willis's score all add a degree of richness to a story that isn't as derivative as I feared. I can't think it's a film I will remember in a few years, but it is well worth a watch as Mr Keoghan continues on his journey to what must be greater success.",
    "99": "Sometimes I thought Saltburn had more bravura in the \"I Want the Ultimate GOTHIC Horror/Mansion Look\" direction department going on rather than a legitimately clever script (or that it thinks it has a more clever plot than it does), and at other times I thought the script had incredible lines for these very good actors and maybe the film was over-directed.... like, okay, we get it, Fennell, you want to make the most Bronte thing that the Brontes never could.It is, visually, mostly boldly realized as a piece of hard-R pop provocation that works more than it doesn't, despite its ending changing some perameters with the leads initial ambitions that are tough to swallow. I don't think it is that deep, whether it was trying to dig into thorny Class stuff (it's a more Personal-Obsessive chronicle than that) when practically everyone is a vampire or not, save, tellingly, for who Oliver actually comes from. Frankly, knowing it was inspired by Talented Mr Ripley going in did no favors by comparison (with a bit of, aside from coincidentally \"You\" season 4, Teorema oddly enough), like at a festival with nothing to go on this might have got to me a little more.However, even with the obvious influences and one particularly glaring story problem - or just with logic involving a cell phone (you know, genius manipulator kid, you can block a phone number or just turn it off) - this is a glorious showcase for Barry Keoghan to (again!) be an intensely, leering, uncomfortable and yet always in his way natural creepy little confusingly-big shlonged weirdo; he and (second time this month post Priscilla an alluring) Elordi have excellent chemistry, and I can't stress enough that, with actors, in particular a scene-stealing Allison Oliver as the f'd-up sister, Fennell has as strong a grasp on her caat and like how far to let Pike and Grant go and when to reel them in (that scene with the checkbook is wonderful).If you want meaty acting, this definitely has that (a new category: Acting Over Substance?), and when it tries to be funny it largely is, and while it doesn't stand out as one of the best of the year it is an entertaining film moment to moment. If you were expecting another round of sociological buckshot in your brain, it doesn't have as much substantive things to say as Promising Young Woman did.Dare I say it now... whatever you got planned for Joker, Barry: bring it.",
    "100": "Just Got out of a Packed Saltburn Screening.WARNING  - This Film Has Multiple Nasty Moments . There were Multiple Gasps and Audible \"oh god\" moments from the Audience Quick Side Note - I have no Problems with this Script and Twist, but looking back, it's just not executed very well due to the lack of development, actions and dialogue prior to the Closing of the Film.So, Positives First -1.  The Gothic Production Design was Outstanding, Coupled with the Cinematography, Some Great Camera Work and there were Several Gorgeous Shots. That Scene with Barry Keoghans' Character(Oliver) Walking Towards Venetia and it had almost a Blue Tint to it was Outstanding. That Particular Scene had this Strong Gothic Vibe to it.2.  The Performances were Good Across the Board, Barry Keoghan, Jacob Elordi, Alison Oliver, Archie Madekwe, Richard E Grant, all Good. Rosamund Pike was Exceptionally Good.3.  Many of the Comedic Moments worked and had parts of the audience laughing and 1 particular Joke Got a Belly Laugh out of the Audience \"It was all too Wet\" - by Rosamund Pike 4. I loved the Funeral Scene with the \"Butler Knows who did it, Stare from afar\" Scene. (The Writer did a little spin on the Butler did it)On to the NegativesNegatives -1. One of the Main Problems I have with this Film, is I didn't really buy Barry Keoghans' Character(Oliver) being Infatuated(in a normal way, not the Gross out Stuff) with Jacob Elordis' Character(Felix). It just didn't come across on screen that way.2. But you're probably saying, \"But, he never really loved him anyway, so who cares?\" Ok, so he hated him right? So why is he Drinking His Juice out of the Bathtub and Laying (and that's Putting it nicely) on top of his Grave? So is Oliver Mentally ill? But he seemed to have come from a somewhat stable household. 3. Another big Problem with the film is that, what is Olivers Motivation? Did he want the Money & Lifestyle? Did he want to Punish this Family? What Exactly did he want? The Plotline does need subtlety yes, but for this particular point, it needs to have a motivation. By the End, The Film doesn't really Convey this. It's all Confusion. 4. The Supposed Danger of Oliver Having an Affair with Rosamund Pikes' character(Elsbeth) was not there at all. A compliment here and there is not enough. On top of that, they could of done more with this angle.5. Moreover, the way in which Oliver Embedded himself into the Family, wasn't done that well.6. For me, when a Certain Character Dies and the Subsequent Scenes after His Death. The Film Just sort of fell apart (for me). It went from Build, Build, Build, \"Ok this is Ok, were building towards something\", then the Death Happens and then some scenes happen and then I thought to myself \"Sigh, the films Level just went down 1 or 2 Levels\"7.  Near The Very Ending with the Montage \"of Events\" was just not the way to Do That. Don't Give us everything in the Span of 5 Minutes. The Writer of this Film needed to keep those points more Subtle and ambiguous, so we can think about it after we've left the Cinema and say \"oh yeah, that's why he did this & that.....\"Overall, I Loved the Production Design and Cinematography but Some of the Character Development and Motivations were Lacking and the Plotline lacked Subtlety when it needed it, and also Lacked Emphasis when it needed it.",
    "101": "It is 2006, and scholarship student Oliver Quick has just arrived at Oxford. He doesn't fit in with the upper-class atmosphere and has no acquaintances. After befriending Felix Catton, a popular and wealthy fellow student, however, Oliver finally seems to find his place at the University. Invited to the Catton family home- Saltburn- for the summer holidays, Oliver is thrust into the dark heart of the blue bloods. Nothing is as it seems though, as the idyllic vacation transforms into one from hell itself.Written and directed by Emerald Fennell, 'Saltburn' is an initially intriguing, though ultimately irritatingly derivative, predictable psychological comic-horror. Fennell's narrative begins with promise. In the first act, you aren't sure who to trust, nor where the story is heading. However, after the action moves to the manor house, Saltburn, things devolve into a messy and obvious retread of ideas that have been expressed more eloquently in previous films, be they 'The Talented Mr. Ripley, 'Teorema' or 'The Servant.'Those films examined themes such as class difference, obsessiveness, personality and manipulation with aplomb and ingenuity. Fennell appears content to skirt around the edges of these themes, never going into them with depth. Nor are the characters in her narrative provided with any kind of motivation for their actions. One, in particular, acts in a violent vacuum of self-obsession and jealously- but why? What made this character the way they are? Fennel never bothers to tell us, seeming satisfied to leave audiences in the dark.Moreover, her characterization is largely based on stereotypes and cliches. Oliver is essentially just a less charismatic, Scouse Tom Ripley, with darkness beneath a thin veneer of awkward shyness. Felix is exactly like Ripley's object of obsession, Dickie Greenleaf, while his eccentric family are people we've seen before in countless films which mock the aristocracy- 'The Ruling Class' among them. Familiar and lacking in depth, Fennell's characters aren't particularly interesting, nor is her narrative particularly original. Further, while her dialogue is frequently funny, it can also be pretentious- particularly during Oliver's intermittent narration.Throughout the film, Fennell handles the material with great deference- too much, one might argue. She lets uncomfortable scenes linger interminably, seeming to think this imbues them with some kind of raw power. The ending, featuring full-frontal nudity- reminiscent of the music video to Liam Gallagher's 'Once,' starring a thankfully clothed Eric Cantona- seems self-indulgent and, shall we say, cocky. Furthermore, a twist in the last act is neither surprising nor effective, while also sending the film into the realm of fantasy; so completely does it abandon real-world logic.Conversely, Linus Sandgren's glossy cinematography is striking. Sandgren makes excellent use of colours and unconventional shots and angles, heightening the suspense of the narrative, as well as compounding the decadence of the Catton family. He employs a ratio of 1.33:1, giving the film a top-heavy, boxed-in look, making locations feel daunting. It is work full of contrast- although, a cynical critic might suggest an over-reliance on cliched visual metaphors, such as reflections, or the obvious juxtaposition of characters wearing devil horns and angel wings.However, Sandgren's visuals generally come as a boon to proceedings, as does Suzie Davies' rich production design. Textured and detailed, her work fosters a vivid, immersive atmosphere, which Sophie Canale's costume design and Charlotte Dirickx's set decoration compounds. In addition, Anthony Willis's score is stirring. His original pieces are seedy and evocative, while songs used throughout- perhaps most notably Sophie Ellis-Bextor's 'Murder On The Dancefloor'- complement the narrative.Barry Keoghan stars as Oliver, alongside Jacob Elordi as Felix, Alison Oliver as Felix's sister Venetia and Rosamund Pike as Felix's mother Elspeth. Keoghan is a fascinating actor, who plays strange characters with verve and intelligence. Here, however, he gives an inconsistent performance. When playing Oliver as a weird, insular personality, he shines; though when he has to display his dominant side Keoghan lacks conviction and doesn't convince- an oddly played, oddly written night-time scene with Venetia being clearest evidence of this.Elordi does much more assured work, despite the fact that the character is just a 2006 version of the aforementioned Greenleaf. He impresses though, overcoming the scant characterisation of the role. Oliver is excellent, underplaying the complexities of her character, while Pike steals the show as the eccentric Elspeth. Richard E. Grant also stars, as Felix's father, but is criminally under-utilised, while Archie Madekwe's grating performance as Felix's cousin is smug and one-note.In conclusion, Emerald Fennell's 'Saltburn' is a film trying to provoke, though isn't as challenging nor original as its creator thinks it is. Though it is funny from time to time, and the first act is intriguing and suspenseful; the film is ultimately an uneven, predictable and derivative affair. While the cinematography is striking and the score atmospheric, the performance of star Barry Keoghan is inconsistent. Although Rosamund Pike is a delight, the film around her is not worthy of her talents, nor can she save it completely. Not to rub salt in the wound, but this film doesn't burn as brightly as it could have.",
    "102": "Saltburn, directed by Emerald Fennell (who brought us the excellent A Promising Young Woman), is a psychological thriller drama that attempts to navigate the maze-like world of the English aristocracy, but unfortunately, it loses its way. The film stars Barry Keoghan as Oliver Quick, a scholarship student at Oxford University, and Jacob Elordi as Felix Catton, a charming aristocrat who invites Oliver to spend a summer at his family's sprawling estate, Saltburn.Saltburn is set in the mid-2000s, a period marked by some economic and cultural decadence. It attempts to explore the clash of social classes, moral vacuity, and the seductions of wealth. However, the film's historical and cultural context feels superficial, failing to delve more deeply into the societal dynamics of the time. Despite being promising, the plot suffers from predictability and a lack of subtlety. The film tries to play with the idea of these enormous bastions of privilege and power as unique breeding grounds for strangeness, but it doesn't quite hit the mark. Forced and repetitive dialogues, which frequently feel artificial and contrived, further weaken the narrative.Despite having talented actors portraying them, the characters lack depth. Oliver, played by Keoghan, is a hateful, lustful, and envious character, but his portrayal is flat and uncomplicated. Felix, played by Elordi, is a character who comes from a life of blatant privilege, but his flimsy compassion does not seem real.Although Fennell's direction is bold, it lacks the dexterity required to make this intricate story come to life. The film's pacing is erratic; certain scenes seem rushed, while others drag on needlessly. The movie's soundtrack seems haphazard and does not improve the story. The movie also occasionally goes a bit too far in terms of taste and may have you cringing.The cinematography and production design are perhaps the film's strongest points. The grandeur of Saltburn, the sprawling estate, is captured beautifully, and the film does a commendable job of creating a lived-in feeling that feels glamorous and filthy at the same time. These artistic components, however, are insufficient to make up for the film's weak narrative.Saltburn is a film that promises much but delivers little. Despite its grand setting and talented cast, it fails to provide a compelling narrative or engaging characters. It's a film that tries to be a critique of the English aristocracy and a psychological thriller but falls short on both counts. While it may appeal to some viewers for its aesthetic appeal, it's a film that, unfortunately, doesn't live up to its potential. It's not a film I'd recommend.",
    "103": "Greetings again from the darkness. Emerald Fennell won an Oscar for her original screenplay of her dark and divisive debut feature film, PROMISING YOUNG WOMAN (2020). She's back as writer-director of her second feature film, and it's every bit as dark, and even more scathing in its takedown of the rich and entitled. We are also treated to yet another awkwardly disturbed character for the growing resume of Barry Keoghan.Oliver Quick (Keoghan) is a newly arrived student of the Class of 2006 at Oxford, and it's clear from the first moment that he doesn't really fit in, whether it's his clothes, not smoking, his uneasiness with his tutor, or his social ineptness. He becomes transfixed on the BMOC, Felix Catton (Jacob Elordi, fresh off his turn as Elvis in PRISCILLA). Felix is tall, handsome, charming, and rich. Life comes easy for him, and students are drawn to him - both male and female. He's a modern-day aristocrat, and one day Oliver helps him out of a jam. This leads to a bonding, or more like worlds colliding. The first act is devoted to the development of this unexpected friendship, and leads to Felix inviting Oliver to spend the summer at his family estate ... Saltburn.Saltburn is nothing short of a magnificent castle. Felix's eccentric family includes Farleigh (Archie Madekwe, GRAN TURISMO), an adopted \"cousin\" fellow Oxfor student who sees all but would never blow this gig; Venetia (Alison Oliver), the total mess of a daughter and sister; Poor Dear Pamela (Carey Mulligan), the total mess of a houseguest who has overstayed her welcome; Sir James Catton (Richard E Grant), the childlike father; and Espeth Catton (Rosamund Pike), the former model drama queen passive-aggressive mother. It's a motley crew that puts 'The Royal Tenenbaums' to shame for entitlement.As the summer progresses, we see Oliver in action as he weasels his way into the good graces of some, while creating leverage over others. His non-descript looks, quiet demeanor, and background story lead some to protect him at the same time others distrust him. As viewers, it's obvious to us that something isn't right with Oliver, yet director Fennell and Keoghan's performance keeps us hopeful that things won't become too skewed. Those hopes are dashed once we see Keoghan's first bathtub scene (and subsequent disturbing moments), and Fennell serves up multiple references to his mouth in letting us know it's not to be trusted.The third act goes full dark in a deliciously wicked manner with Fennell and Oscar winning cinematographer Linus Sandgren (LA LA LAND) creating an Old World style within a contemporary world. The film is perfectly cast with Elordi quite magnetic as Felix, the not-so-obscure object of Oliver's desire. Madekwe is spot on as the turf-protecting Farleigh, and Grant and Pike make the perfectly mismatched couple of privilege. Alison Oliver delivers the film's best scene with her bathtub monologue, while Keoghan nails the creepy Oliver (in line with his roles in THE BANSHEES OF INISHERIN, THE KILLING OF A SACRED DEER, and THE BATMAN. He has become the go-to psychopath. He even combines humor and horror for his happy naked castle dance in this film that has THE TALENTED MR RIPLEY (1999) as its most obvious comparison. Ms. Fennell strikes another blow against the entitled elite, although we do wish she hadn't spelled out everything to end the film ... a bit of mystique would have worked.Opening in theaters on November 22, 2023.",
    "104": "They say write what you know. What I know is this is perhaps the most ironic film I've ever seen. Many people may not know the director Emerald Fennell comes from a very wealthy family, went to private school her entire life (including Oxford), and got her start due to those private school connections. To watch her send up upper class privilege as grotesque and distorted is bizarre in its own right but even more bizzare is she is selling her satire for money.The movie itself feels like a giant trope, more characature than human and almost cliche in its representation of money as all encompassing and all corrupting. My only theory is this film is mainly an apology from Fennell, trying to convince us she's one of the \"good\" privileged people for sending up the world she was raised in. But then I remember she's enriching herself by making this film, selling privilege to beget more privilege.If there was an award for ironic film of the year, this would win hands down.",
    "105": "I liked Emerald Fennell's first feature, A Promising Young Woman, although it was a little left field and a touch disturbing. In this movie, she ramps up the disturbing with many scenes of repulsive behaviour which feel way too gratuitous - if the British aristocracy is really like this, the country is screwed.The plot is essentially that of A Talented Mr Ripley but the script is nowhere near as good and the narrative is often disjointed and at times boring. The directorial style is dark and gothic, but a bit inconsistent - some scenes are too long, some are pointless and the whole movie could have been 20-30 minutes shorter.There's occasional humour but it's offset by the depravity, which is really overdone. The acting is excellent however - Barry Keoghan plays the main character to perfection as an allegedly poor and lonely soul at Oxford who is desperate for the friendship of the handsome, popular and rich son of an eccentric aristocrat family. Rosamund Pike is also superb as the matriarch. A cameo by Carey Mulligan however is a complete waste of her talents.The plot twist towards the end was somewhat predictable so hardly a shock for a movie trying to sporadically shock you with depraved behaviour mixed in with efforts to parody the British upper class - but with not much class.If you like pretentious Arthouse films designed to shock the senses and you don't mind the disjointed script, then this movie might well be for you. But if you prefer to be allowed to concentrate on the unfolding tale of immorality without the shock and awe, then TTMR is a far better movie.",
    "106": "It doesn't take long to realist that there is nothing particularly original in the plot of this movie. More or less from the outset it promises to be a more debauched, British version of The Talented Mr Ripley, and ultimately it never strays too far from that tag.Having thus tempered expectations, there is enough in the first hour or so of this film to offer some encouragement that the film could at least be watchable.Our protagonist Oliver (Barry Keoghan) is a scholarship boy at Oxford. Initially ostracised from the in-crowd by his lack of wealth or social grace, he works his way into the orbit of the charming, dashing and rich Felix (Jacob Elordi), and is ultimately invited to the titular family home. There he is introduced to the bizarre world of the British aristocracy and the idiosyncratic characters that populate it.Having established this fish-out-of-water narrative, and despite the sterling efforts of its cast, the plot then begins to drift. We are offered glimpses of what might have been - the relationship between Oliver and Felix's sister Venetia (Alison Oliver), in particular, briefly offers opportunity for real interest and intrigue - but the film eschews these in favour of a far more well-worn and unchallenging path.As a consequence, the second half of the film - which is written to be rich in twists, reveals and shocks - becomes bland, predictable and - frankly - boring.There are strong performances throughout the film - Rosamund Pike, as Felix's mother, is particularly engaging and amusing, and attempts admirably to carry much of the second half of the film. Jacob Elordi, though slightly unconvincing as a British aristocrat, looks nevertheless to have a bright future ahead of him. Richard E. Grant, as Felix's father, is good value as well, even if his character is a little one-dimensional.And there are interesting characters who are never properly explored. Pamela (Carey Mulligan) is a guest at Saltburn who has overstayed her welcome, but is discarded as swiftly as she is introduced. Farleigh (Archie Madekwe) is Oliver's rival for Felix's attention and funding, and provides a character that is well-drawn, well-performed and interesting, but again disappears from view in the latter stages of the film. This is particularly disappointing as Archie Madekwe does a great job of balancing his character's contradictions: intellectual but belligerent, confident but desperate, charming but hostile.The final result has some strong moments and some good performances, but ultimately fails to develop into a worthy film. At 2 hours and 7 minutes in length, it feels at least half an hour too long, and I confess it was ultimately a relief to finally be able to leave the cinema.",
    "107": "Quick review: I loved Emerald Phannell's debut film 'Promising Young Woman'. It was hard to believe it was a debut feature. I hadn't even heard she was doing a follow-up film until suddenly I was watching it as the Secret Screening at Fantastic Fest. Needless to say it blew me away. This was a terrific film experience.I think the thing I love most about Phannell's work is the attention and care she gives to every character. There are no throwaway character's in these movies. Everyone has a purpose and every character is fascinating in their own way.When that's the case it can be hard to single out a particularly good character/performance, and really everyone here was worthy of mention, but in particular I have to bring up Rosamund Pike. She stole every scene she was in. Also Barry Keoghan is fast becoming the best actor working today. He is captivating to watch here.'Saltburn' was such a pleasant surprise. I loved every minute of it and would highly recommend it. Be warned though: this film is not afraid to go to some shocking places. 10/10.",
    "108": "For starters, I appreciate Director Emerald Fennell being able to offer some strange, unhinged and unique decisions with the direction, writing and setting as Fennell provided some pretty good directing throughout that helped capture the movie's tone and setting. All of the production designs are gorgeous throughout, especially with the costumes and structures as it was very colorful with the 1:33:1 aspect ratio feeling purposeful. All of the performances are pretty great, especially Barry Keoghan as Keoghan continues to impress me with his performing abilities since Dunkirk. Alongside with the rest of the cast members as Rosamund Pike, Jacob Elordi, Richard E. Grant and so forth are really good as well and their performances were strong as well. The soundtrack is also really catchy.On the narrative, I did find the narrative's concept to be interesting as the concept explores interesting themes of wealth, sexuality, and class about the characters and settings that does get pretty unhinged and insane. Unfortunately, despite liking some of the writing, the narrative does get uneven since some of the writing aspects were predictable and certain moments feeling way too similar to \"Kind Hearts and Coronets, The Talented Mr. Ripley or The Servant\". Especially the third act and twist which while I am not sure it was intentional, the third act pretty much falls apart and I found the twist to not be really shocking and it being predictable. For the characters, while I understand the purposes for the characters' personalities and decisions, I found the characters to be a mix of some interesting and uninteresting as the uninteresting ones felt annoying. Including the editing as the editing is surprisingly, pretty rough.The dialogue is solid with some a bit silly and the color presentation is good. There are uses of dark humor, satire and quite a lot of horny moments throughout and while some of the satire and humor worked, not all worked as some of the dark humor, satire and horniest comes off a bit full of itself.I wanted to really love this movie because the style, writing and genre is something I like. I really love the concept, direction, camerawork, and performances but I was left wanting more than since the movie feels slightly sloppy and kind of full of itself. Overall, ambitious and had a strong first act but I didn't love it as I wanted too. This might end up becoming a possible cult movie someday. I probably would check this one out again someday to see if my perspective has changed later on.For now. It's a 6/10.",
    "109": "This film strings us a long for ages before giving us an explanation that doesn't make sense, transparently covered over with a series of writerly fudges and bodges. Even before that, the story is, as others here indicate, a shallow, pale shadow retread of the narrative strategies of at least a half dozen vastly superior predecessors. It's sort of ironic given that the main one of these, The Talented Mr. Ripley, is all about being a pale shadow of an admired other. But I'd also like to give a nod to a lesser-known likely source, the unjustly neglected Little Stranger, the creepy power of which everyone should experience. It basically does almost exactly the same thing this story does, but replete with all the logic, deep feeling and significance this lacks.Feeling and meaning appear not to have been the true point here anyway, all story elements being only really present as weak justification for the edgy stylings. This kind of post-rationalised grooviness is a cardinal storytelling sin in my view, but not necessarily a capital crime. If I wasn't convinced, I was still fairly well seduced. There are lush, grainy, fashion-shoot-style visuals, the very satisfying decision to use academy aspect ratio, and a lot of only slightly overplayed ghoulish country house fun, none of which should be underestimated or undervalued. When it comes to making a movie look this good, it's not even that many are called. Very few even seem to think of it.There is even something that seems strongly felt and meaningful and it is genuinely great: the upper-class auteur, apparently able at times to write what she knows from life and not just other stories, gives us the most acidly accurate depictions I think I've ever seen of British toffs, all chilly, daffy, emotionally stunted, faintly horrifying absurdity. This gives rise to some unmissable dark jokes, and I'm glad I saw this just for those and for Richard E. Grant and, especially, Rosamund Pike's delivery of them, even if the insultingly dashed-off, error-strewn maths of the plot still left a really bad taste. Let's hope in the future Fennel finds a better vessel for her incisive observational and comedic skills - as well as her acute sense of style.",
    "110": "Well made. Barry does it again.Its unsettling a times but its made well enough that you're able to appreciate it as an art form.Cinematography, sound track, editing, script.. its all top notch for the story and script.I dont have any complaints about this fill.Barry is very believable and you're never forced to suspend your disbelief when you watch his films.You have to know youre getting yourself into something unexpected and bizarre. Something that takes you out of your comfort zone and into a sort of hypnotic twilight zone.You don't like the character but you hate him either.But it sends chills up your spine to imagine that people like this exist.",
    "111": "Sometimes you come across a filmmaker whose works you just don't like. And now, after two features in, I can honestly say that about writer-director Emerald Fennell. I didn't care much for her debut outing, \"Promising Young Woman\" (2020), and I can say the same (and more) about her follow-up effort, \"Saltburn.\" This alleged thriller about a seemingly awkward but quietly sinister Oxford student (Barry Keoghan) who ingratiates himself into a family of wealthy English aristocrats features a story and characters about whom, quite frankly, I couldn't care less. (Think \"The Killing of a Sacred Deer\" (2017) with a cast of eccentric old money cronies and a wolf in sheep's clothing.) This assemblage of utterly reprehensible characters living utterly reprehensible lives and zealously adhering to utterly reprehensible values fails to endanger viewer empathy, interest or even connection. Much of the narrative is predictable and glacially paced, incorporates sequences that are included for little more than forced shock value, features monodimensional and blatantly obvious (almost trite) character development, and frequently stumbles in attempts at humor that are wedged in largely for the sake of convenience or calculatedly timed comic relief. It's the kind of picture that prompts regular looks at one's watch to see how much more one must endure and delivers welcome sighs of relief when the end finally comes. What's more, given the combined talent pool for this production, it's a genuine shame to see the likes of Rosamund Pike, Carey Mulligan and Richard E. Grant relegated to supporting roles in which their abilities are sorely underused. And then there's the excessively hammy performance of Keoghan, who's quite obviously (and knowingly) acting and not disappearing into the bona fide portrayal of a character. In all, this offering feels like a picture that tries awfully hard to see how much it can get away with, especially when seeking to invoke dropped jaws among audience members, much as this director's cinematic predecessor attempted to do. Save your money, and don't waste your time on this vastly overrated release from a vastly overrated filmmaker.",
    "112": "There are some genuine laughs in this movie but they are long forgotten by the time it finally stumbled to an endIt's like someone watched The Master and The Talented Mister Ripley and thought 'I can do that.' Well no, you can'tIt's got this ghastly one dimensional view of what it must be like to have a scholarship to Oxford, but then gets the year wrong by about a centuryIt's fully of hateful characters that look about 10 years too old for the parts they are playing. Yes yes people will say that's the point but there is an art to making a hateful character sympathetic that this wannabe Morse episode simply cannot grasp (it's also pretentiously shot in 4:3 which amplified the made for TV vibe)By the end I had really grown to hate it, the last time I got that angry in a cinema at a movie long outstaying its welcome was the Avatar sequelIt's not the worst film I have seen this year but it comes damn close.",
    "113": "Evidently the jinx of the \"sophomore slump\" held no claim over Emerald Fennell, Britain's new filmmaking auteur and cinematic wunderkind. In only her second movie, the popular writer-director has already soared past expectations, delivering a film which not only far surpasses the success of her debut Promising Young Woman (which was excellent), but which succeeds so well in all its ambitions that it just might belong in the conversation for genre classic. It certainly ranks quite high among my personal favorites for films of its kind.In my opinion, Saltburn is a masterpiece. A purely singular, cinematic tour-de-force, with an abundance of style, all put to use in service of a story that is both attractive and engrossing, while never ceasing to be entertaining. It's the kind of film that sears itself in your memory with it's brazenness-to say nothing of the level of prurience that permeates some of the more salacious/depraved bits. I know that sounds like it could be a negative, but believe me, it definitely works in this film's favor; keeping the tone both erotically charged as well as deeply unsettling. In fact, the whole film is astoundingly well-balanced, maintaining a sly confidence in itself which makes it all the more entrancing despite (because of?) it taking things to such extremes. Occasionally you might feel like recoiling, but you'll remain unable to look away.Since the film only released wide several weeks ago, I'll refrain from saying much about plot specifics in this review (nothing beyond superficial comparison anyway), as I'd hate to spoil anyone from having the same incredible experience I had going in blind. This is an opportunity that hopefully most people will be afforded, owing to the stellar marketing for the film which somehow managed to build intrigue without revealing hardly anything about the story (take note studio heads, this is how it should be done!). It's an especially blessed achievement in this case, as this is a film with a deviously good script and it'd be a shame to miss out on its myriad surprises.Additionally, with Saltburn, Emerald Fennell has not only gifted us fans of crime/mystery stories with a modern genre masterpiece, she has also given us the best Ripley movie without Tom Ripley. Indeed, the film evokes a superlative, verging on definitive, homage to the famous amoral hedonist with a knack for escaping consequences, and I would honestly be shocked to find out Fennell wasn't a Highsmith fan. At times this script feels almost like a re-imagining of The Talented Mr. Ripley for the millennial generation; albeit one cleverly tailored to the sensibilities and sexual fluidity of the Euphoria crowd. The use of hyper-stylized cinematography, as well as the film's decidedly \"in vogue\" choice of music, also evoke the style of that series to a degree. That said, Jacob Elordi playing against type as the rich aristocrat Felix Catton (ostensibly a spoiled playboy, but whose surprising sensitive side may reveal him to be an actual decent person) subverts those expectations in the best way.Whatever the reality behind her inspiration, this film is in no way a mere imitation of another work. Instead, Fennell more than proves her mettle as a writer/director capable of executing her unique ideas with extreme precision. Frankly, she couldn't seem more at home in the genre, and despite a concept that on the surface may appear to be aiming at mere homage, Fennell spares no time proving that notion false; taking a deceptively original approach to a tried and true theme, and running with it to intoxicating effect.Saltburn is an utterly enthralling mystery, with an impressively sustained blend of familiarity and unpredictability. The script is brimming with witty dialogue, wickedly dark humor, compelling social commentary on class division, and no shortage of clever twists. All in all, this makes for a fiercely captivating affair from start to finish. So much so, in fact, that when the many disparate threads finally start to come together in the final act, the result is harrowing and nothing short of extraordinary!This is filmmaking of the highest order from someone who is quickly becoming one of the most interesting artists working today. If it wasn't such a crowded year I would say Fennell was a shoe-in for another best original screenplay nom. Although then again, when considering the uncomfortable nature of certain moments in the film, it may be a stretch to think the academy is ready to vote for something this far out. I hope they're not all too close-minded to recognize Fennell's talent though, and this at least ends up getting some (well-deserved) awards attention. In any case, if she's able to keep up the momentum then her work will soon be impossible to ignore, no matter how dark/insane she decides to go with her next project. Personally, I'd love to see her re-team with Keoghan/Mulligan and try her hand at a full-on horror flick!Anyways, beyond the film's critical reception, what perhaps will be most interesting is seeing the overall response it gets from general audiences. I'd imagine they won't be expecting just how shocking certain aspects of the story are, and all those forming their expectations based on her first film (like I did) are likely to be caught off guard by a handful of these scenes (if not outright turned off). The film never felt in any way exploitative or pretentious to me though. On the contrary, I felt like the balance and tone that it struck were basically flawless. Even if a small number of viewers do find it too offensive, that will probably just add to the allure of the film. Ultimately, the purity of conviction shown by the creative team in taking things as far as they did clearly panned out.Suffice it to say, I've never seen anything quite like this film, and I was completely blown away. In fact, for me, it rather handily beats out Oppenheimer, Beau is Afraid, and Killers of the Flower Moon as the best of the year, and I'd go so far as to call it a film destined to be discussed, analyzed, argued over, and admired by cinephiles of every kind for years to come.Finally, I'd be remiss not to mention the film's true Oscar potential, and that's Barry Keoghan. His raw performance as the socially awkward, yet smart and deeply enigmatic loner Oliver Quick is so brilliantly nuanced, mysterious, and disturbing that I can all but guarantee it will \"make your blood run cold.\" Barry is absolutely the underdog to look out for come award season, and this film proves, decisively, that he was the perfect choice to take up the mantle of the Joker.Rating: 10/10.....Edited to add - I can't believe I forgot to praise the film's amazing use of MGMT's \"Time to Pretend\" in one of its early montages! I've been waiting forever for someone to re-tap the potential of the song, and its use here might be the best of any song since Pixies' \"Where is my Mind?\" at the end of Fight Club.",
    "114": "For me, this movie redefines the word \"unwatchable\".The movie is about two university students, who come from different worlds. One who is rich, popular, and charming, the other who is poor, shy, and awkward. They become friends.That they become friends is the most believable part of the story.What happens afterwards is a poorly executed ripoff of other movies, but ridiculous in scope, and devoid of reality. It will leave audiences feeling underwhelmed and disappointed - both in the movie and themselves for having wasted their time and money on this \"film\".I saw this as a sneak preview, where it was hyped as \"the most buzzed about movie of the year\". After watching it, I realized \"buzzed\" does not necessarily mean good. It is being buzzed about, as it will be remembered as one of the worst movies of 2023.",
    "115": "I'm in utter shock at how good Saltburn turned out to be. I was looking forward to it but I didn't expect to be top 5 of the year (maybe even top 10 of the decade) for me. That's only because I really liked Promising Young Woman but I wasn't totally blown away by it. It had so many great concepts and moments but some of the execution was a bit lacking for me. But I can confidently say Emerald Fennell elevated her craft in every single way for her second movie.This script is almost completely air tight. I was intrigued from almost the first frame and it never let me go from there. Fennell's been very open about the influence of The Talent Mr Ripley on this film and it's very apparent but she absolutely does her own thing with it. It doesn't always feel like it's going in a specific direction but I was always excited to see where it was going.This character, played perfectly in what I think is Barry Keoghan's best performance, is so interesting and I never quite knew how to feel about him in all the best ways. Fennell builds up his connection with Jacob Elordi so well and there's such a specific chemistry between the 2 of them that was riveting to watch and they took Elrodi's character in a direction I didn't expect but absolutely loved.I won't go as far as to say that I didn't predict any of the twists or turns. There were some reveals that I did see coming but it all comes down to execution and every single beat and plot revelation of this script felt earned from a character perspective and took everything to a satisfying conclusion. I've already mentioned the Mr Ripley inspiration but there's a little Knives Out in there, some illusions to Parasite, hints to Get Out and even The Shining.That's not to say Fennell is being derivative here because this film absolutely feels like her vision through and through and it's so impressive just how many tones she managed to blend seamlessly. My only real issue with the script, and really the film overall, is Fennell's need to occasionally over explain things. There's a lot of backstory to these characters but the means in which she delivers the exposition around them can feel forced and like the scene just has to stop to fill in their history. Certain scenes towards the end makes these moments more understandable in retrospect but it still felt clunky in the moment.The technical prowess on display was astounding. Based off the trailers, I wasn't sure if I was going to like the unique aspect ratio this film employs but it ended up working perfectly for me. It gave a sense of intimacy to everything and it let me get more immersed into the character interactions and even the broader landscape shots as well. The camerawork Fennell pulls of here is insane, there are so many impressive one takes and it has without a doubt one of the most unique final shots I've seen in a movie in a long time. The cinematography is also jaw dropping, it's Roger Deakins level stuff for me and it honestly made my jaw drop more than once. If it doesn't get nominated for, let alone win, the Oscar I'll be outraged.Saltburn is such an experience of a movie that I can't help but in awe of what Emerald Fennell pulled off. It's constantly intriguing, tension filled and investing despite the truly horrible acts done by the characters. It's visually stunning with some of the best performances I've seen from most of these actors. It hasn't left my mind in the day since I saw it and it just feels like the kind of movie we don't see enough of. Amazon are absolutely killing it this year with Air and now this and they need to keep putting these kinds of movies in theatres. After this, I can't wait to see what Emerald Fennell does next because if she puts out another film of this quality she'll be well on her way to being one of the best directors working right now.",
    "116": "I went into this movie after reading a few of the reviews here calling this movie \"shocking\" and \"disturbing\" and \"will leave you gasping in disbelief\". Did I watch a completely different movie, because all I got were some mildly gross scenes with bodily functions, and a cliched \"rich people are awful\" script that tried really hard to be clever and unique but ended up being derivative of much better movies of its ilk. Honestly, I was expecting so much more debauchery and a much more jaw-dropping experience, but if people really thought that this movie was anything of the sort, you really need to watch more movies. Perhaps the cinema of South Korea can teach you how \"shocking\" movies can really get. *rolls eyes*I will say this, while directorial style and the script were....amusing, to say the least, the cinematography and the acting were all top notch. There is some serious talent in this film, and every single actor played their character with such undeniable skill, that you really started to hate each and every one of them by the end of the movie. All except Oliver. Good ol' Ollie....Seriously, if there was one person that could have carried this film on his own, it was Barry Keoghan. Man, what an actor. Not only is he the best eye candy in the entire movie (wait until the end, he is literally a dream boat from every angle imaginable), his acting was above and beyond anything that I expected from this movie and made me an instant fan. The fact that he can play such a seemingly innocent character and change up so easily is a true testament to his ability, and I truly believe that he deserves to be a gotdamn STAR. This movie would not have been the same without him, and whoever cast him in the role knew exactly what they were doing. Kudos to the casting director and kudos to the actual director for knowing just what we all wanted to see.In the end, the movie went exactly where I knew it was going to go. It didn't shock or surprise me, it barely made me gag, but it did get quite a few chuckles out of me. Overall, it's an extremely solid and well made film that relied to heavily on its messaging and not enough on its story. I'm just glad that no \"woke\" nonsense was injected anywhere. I avoid Western movies like the plague due to the ideology, so it was refreshing seeing something not be made insufferable by having that toxic nonsense vomited all over it.",
    "117": "Rating: 7.6\nOverall, a bold attempt at a grand movie in Emerald Fennell's sophomore effort as she really builds the grand world of Saltburn through cinematography and production design and gets a lot out of her actors (especially Barry Keoghan and Jacob Elordi), but, in the end, is held back by having too many continuity issues/loose ends and going overboard with the more grotesque scenes.Decent to Pretty Good Direction (Controlled her scenes well on a macro-scale as she used the cinematography and the sets to tell how grandiose Saltburn was (and the dichotomy of how closed off everyone was because of it); Did a pretty good job on a micro scale as the one-on-one scenes were good (especially the ones between Keoghan and Elordi) but the group scenes were not that well executed; the storytelling is overall decent as the overarching story is encapsulated well but the movement between plot points is not as fluid as it could be (with there being some easily spotted continuity issues); Some scenes felt very elongated for no reason and were just really meant to shock rather than have any substance), Good to Very Good Acting (Very Good from Barry Keoghan (Really captures the persona of this demented hero well as he shows the lengths the protagonist will go to get what he wants), Very Good from Jacob Elordi (Really uses his charisma and looks to help propel his performance as he really takes control of all the scenes he is in to act as this heavenly god that the main character is trying to chase), Good to Very Good from Rosamund Pike (Plays the dull/out-of-touch character well and has that elitist British tone that helps with her character), Good to Very Good from Richard E. Grant (Similiar to Pike in that he plays a dull/out-of-touch character well), Good from Alison Oliver (Has a lot of moments that are good as her character's emotional instability helps portray a young adolescent), Good from Archie Madekwe (Plays his character well and has good chemistry being at odds with Keoghan), Good from Carey Mulligan (More of a cameo appearance but does a good job in letting her presence be known), Good from the rest of the cast (Each actor plays their role well as they work off of the main cast)), Pretty Bad Story (The overarching story is interesting and has a lot of mystery to it as the director slowly peels at what is actually going on; the storytelling is not the best as there are a lot of continuity errors (like Superbad being played on DVD before it is even out in theaters) and is not that clear at points; the characters were written well and have their clear purpose in the story (with the mystery of the lead character helping drive the story forward); There were just the right amount of plot points (it just felt like some of the overall scenes could have been cut down a bit); the movie does not tie everything up well (and this hurts the story as it is not meant to really have things left open to interpretation)), Decent to Pretty Good Screenplay (The dialogue flowed very well and felt like it was of the time and the place; the symbolism is somewhat there but it does not help with portraying the message; the foreshadowing was good as it helped with showing who the main character really is (and was not that predictable)), Pretty Good Score/Good Soundtrack (really helped with setting the time), Incredible Cinematography (Really felt very grand and helped with showing how big and lost you can be in Saltburn), Bad Sound (The dialogue was not mixed well as a lot of times it was unclear what they were saying or the music was too loud that the dialogue just felt inaudible), Decent Editing (Overall was good and helped with showing how grand Saltburn was and how small the subjects were inside it; some of the scenes felt just unnecessarily long and could have been cut to provide the same effect (especially for the more grotesque scenes)), Great Production Design (The sets in Saltburn were just so grand and illustrious that they helped with showing the wealth the family had; the college sets were all very stunning as they helped show the history of the school; the party (and aftermath) was designed very well to just show how many people were there), Plot Structure was good as the points were laid out well and each overall component helped build to the next one (it is just inside of these components it did not feel like the story progressed well between scenes)runtime could have been cut down by making some of the scenes sorter as it would not have that much effect on the story (shaving maybe 5-10 minutes), Pacing was fine as it did not feel like it was too fast or slow, Climax was decently executed as it is presented in a very shocking way (but the more you think about it the more holes you see in the continuity), Tone was very similar to a coming-of-age mixed with a thriller and High-class British themes as this helps show the world the main character is living in, Saw a premiere at Austin Film Festival; the grotesque scenes were a bold choice but it does not pay off that well as it just makes the audience feel uneasy than actually showing how deranged some of the actions and characters were.",
    "118": "'Saltburn (2023)' is an incredibly horny movie. It's easily one of the most bisexual films I've seen at the cinema, with a down-bad lead who seemingly wants to have sex with everyone he meets and cinematography that frames the characters as if any of them could start making out with one another at any given moment. Seriously, it's as if the camera operators themselves want to get in on the action. Pretty much every major player - Jacob Elordi's Felix, in particular - is shot with a sweaty sexuality that lends them an almost ethereal allure. It's like they're actively trying to seduce you through the screen, which the picture itself is attempting in its own way. The female gaze doesn't really exist, but if it did it would look like this; I finally know something about what it must feel like for a straight woman to watch, well, practically anything with a 'sexy' female character in it. At a certain point, the sexual tension snaps with a series of unashamedly shocking, near gross-out gags involving various bodily fluids and unexpected sex acts. The audience I was watching this with were audibly squirming in their seats at some of the more outrageous moments, and perhaps rightfully so. These are undoubtedly the moments which have caused many people to declare the back half of this \"really weird\", and they do kind of come out of nowhere - if not in their inclusion then in their perceived depravity. However, I don't think the second half of the flick is any less successful than the first, and it actually feels like a fairly natural progression of the plot. It's unorthodox, sure, and it starts to sew the first seeds in your mind that maybe the protagonist isn't quite as innocent as he first appears. The general subversiveness of the story does go quite a long way in keeping you invested, as you're never quite sure what's going to happen next or what the characters are actually thinking (or if they're even thinking at all). There's something off about everything at Saltburn from the moment it's introduced, and the flick builds this underlying sense of suspense that kind of sneaks up on you. Even if its ultimate reveal is handled fairly clumsily, most of the narrative is compelling enough to mostly justify the 130-minute runtime. It helps that the performances are all rock solid, including some expectedly fantastic work from Barry Keoghan, and that the writing keenly balances dark absurdism with disturbing satire. The cinematography has an appealing almost polaroid - or perhaps 8mm home movie - feel thanks to its 4:3 framing and notable film grain. The film is comprised almost exclusively of interestingly framed, often downright beautiful shots that frequently make perfect use of silhouette and satisfyingly unconventional composition. It's all edited together in a notably excellent fashion, featuring some bracingly vibrant montages that make use of repeated motifs to recontextualise previously seen material. It's a really well-made movie overall, and its narrative is more consistent than a lot of people seem to think. It does get ever-so-slightly repetitive in its midsection and some of its first act could arguably be trimmed, but it's a consistently engaging and darkly funny / funnily dark experience for most of its duration. The ending is a little inelegant, the theming isn't particularly deep and some of its more outlandish moments feel crafted almost solely for shock value, but this is a solid and unconventional feature that almost defies genre and is all the better for it.",
    "119": "Burn, Barry, burn, Disco Infernos.All the way through this, or at least for the first two-thirds, I wondered deeply if this was a true story. It was dry, but captivating and I knew this was leading somewhere. It had to. Those were my thoughts anyways. If it didn't, I was still satisfied with how real/enthralling everything felt.Poor Oliver. Poor, poor Oliver Quick with a scholarship at Oxford. He meets Felix Catton, his crush and while straight, Felix still develops a deep connection with Oliver. So much so, Oliver's invited back to the Catton's mansion (castle?) a place so large, they named this movie after it. There, they'll party, learn about each other and live a life Oliver never had growing up. You could say, this was Oliver's Twist. And speaking of turnarounds...I don't think the Catton's will ever be the same...It's a long movie, slowly paced and you'll have to get though this for a great finale. You might see it coming, like I did/anticipated throughout. Believe that was the point, hence being touted as a thriller. It's worth it, but I wish it had been a little more subtle and not contain the same, infamous exposition to explain everything like in Psycho. I got it long before that.Luckily, everyone was committed, the sets/locations rocked and cinematography was grand. Plus, I do love characters who are always 3-5 chess moves ahead of everyone else. A very warm recommendation.Welcome to Saltburn. Stay awhile. Indefinitely, if the mood suits you.***Final Thoughts: I try not to watch trailers, but I did see this one a few times and wow, they made me believe I was supposed to know what this was. I've never heard of this before and they do advertise this like it's a hundred-year-old, Oxford-required read.",
    "120": "I just saw Emerald Fennell's latest movie, \"Saltburn,\" and wow, it's an absolute knockout! A modern Great Gatsby! This film's visual richness & script brilliantly satirizes Oxford/British wealth and extravagance while uncovering the depths of its characters in a way that's just captivating. It's like watching a train wreck you can't turn away from, with each scene revealing more about what's really going on.The acting is across the board truly top-notch - absolutely one of the best ensemble performances I've seen this year.Rosamund Pike is phenomenal, and Alison Oliver shines bright. Carey Mulligan's cameo? Simply unforgettable. And Barry Keoghan? He's outdone himself, delivering a performance that's bound to get Oscar buzz.What really struck me was how the film takes themes that might seem repulsive on the surface and turns them into a mesmerizing display of artistry. The aesthetics, acting, and writing all come together perfectly, making even the most grotesque scenes somehow relatable. That bathtub scene? It had me feeling a mix of emotions I still can't quite explain.The tone of the movie is dark but compelling, with every cast member bringing their A-game. And the score? Absolutely majestic. Fennell has outdone herself with this one. After this and \"Promising Young Woman,\" I'm convinced I'll watch anything she directs.I'm also betting on Oscar nominations for Production Design and Costume Design. And a special shoutout for including \"Murder on the Dancefloor\" in the soundtrack - that song was my jam in elementary school!The movie is a rollercoaster of emotions - it's funny, dark, twisted, and utterly captivating. I found myself laughing, gasping, and even shrieking alongside everyone else in the theater. Fennell's unique and inventive approach really shines, making \"Saltburn\" a film that begs for multiple viewings. As a movie lover, I left the cinema completely amazed and satisfied. For anyone who loves cinema, this is a must-watch. Emerald Fennell has really cooked up something special with \"Saltburn.\"",
    "121": "Saltburn is a crazed caricature. Absurdist to the nth degree. It's punctuated with the allure of witty, pithy dialogue and outrageous characters, but the plot doesn't pull its weight through to any real finality. The shock-value is cranked up to the maximum, an overplayed hand; with only anticlimax to show for it. The payoff never arrives as the film slowly meanders to the credits. Saltburn desperately wants to rile and provoke, to be talked about. But it struggles to justify the point of its own existence in the midst of its attention-seeking rhetoric. It tries so hard to be idiosyncratic that it becomes overexposed and errs to state the obvious.The film's director, Emerald Fennell, hails from the same upper classes she targets. We are offered her insider's take; her ace in the hole that populates the script with hilariously classist opines. Fennell satirically imagines both halves of society; one half envious, pining, self-conscious, and scheming, the other half decadent, proud, sneering, and detached. But nothing said here hasn't been said elsewhere in the \"eat-the-rich\" discussion. This is a story of the haves and the want-mores. It's also quite clearly derivative from the likes of Mr. Ripley, etcetera.Saltburn's cast is a strong point, with standout performances from Barry Keoghan, Jacob Elordi, Rosamund Pike, and Richard E. Grant. But Keoghan's character is ultimately a maniac without a cause.",
    "122": "Saltburn: A black comedy/psychological thriller which slides into the slipstream of horror. 2006, Barry Keoghan plays Oliver Quick, a working class lad from a grim background who makes it to Oxford University on a scholarship. He ifeels unable to fit in with the In Crowd but one day does a favour for the popular, aristocratic Felix Catton (Jacob Elordi). This gets him (literally) a seat at the table with the society he longs to join. When Oliver's father dies, Felix invites him to his stately home, Saltburn for the Summer. The Catton family are ghastly, Felix hears them gossiping about his family, when he is presented to them they feign love and interest. Everything is so shallow about them though the father. Richard E. Grant is quite manic in his role, constantly grinning. Felix's mother (Rosamund Pike) also pretends to care about people but only for appearances sake. His sister Venetia (Alison Oliver) suffers from bulimia but appears to interest Oliver. Things morph from a comedy of manners to a dark horror comedy as Oliver shows hidden depths. Some really disturbing scenes which are leavened by the blackest of black comedy. A Dickensian tale mixed with Brideshead Revisited, a dash of Ripping Yarns with a soupcon of The Talented Mr Ripley. A film you will mull over long after the final credits have rolled. Written, Directed and Produced by Emerald Fennell. 8.5/10.",
    "123": "Not since \"The Talented Mr. Ripley\" have I seen a film that keeps you guessing and turns the tables on the central character and your expectations of him.Somewhere between homoeroticism and pure jealous, class greed, has a film so intertwined its pathos into a psychological turnabout that leaves us breathless at the end.Not since Hitchcock have I seen this kind of plot twist that kept me on the edge of my seat.Keoghan is fantastic in the lead role, as is Pike and the other supporting players, including the actor who plays Felix.British class system gets its comeuppance at the expense of the respect we have initially for the protagonist. And yet some of the scenes are chilling, especially a certain lunch scene after the demise of a central character.Fennel should receive recognition for writing this film, whose story is do much more original than the typical Hollywood films we are seeing.Kudos all around!",
    "124": "This might be the first time I almost left the theater, not because it was boring or bad but because I was truly uncomfortable. This film starts off well paced and had my attention from the start. The first act is quite pleasant, however when we get to Saltburn is when things get quite bizarre. I will not spoil any major plot details but a depiction of oral sex while a female is on her period is the first scene I had to turn away from, and that arguably is not the most uncomfortable scene.The first act for me is the best part of the movie, the main characters are being fleshed out and we're getting an insight to who we think they are. However, when things start to get twisted and there's a big reveal there doesn't seem to be any explanation. There also doesn't seem to be justification for various scenes that are frankly disgusting. I am all for shock and jaw dropping scenes but if there isn't any substance or meaning behind it and it's just for the sake of shock value then it's lazy. There are good twists and there are good ideas with brilliant actors however various ideas didn't seem to be fully thought out or fully explained to the audience.",
    "125": "Set in the early 2000s, Oliver Quick (Barry Keoghan) is a working-class student on scholarship to Oxford where he often finds himself isolated due to the cultural divide between him and the other attending students. After befriending wealthy student Felix Catton (Jacob Elordi), Oliver is invited to spend the Summer at Felix's family estate Saltburn where he meets the eccentric Catton family consisting of Sir James (Richard E. Grant) and Lady Elspeth (Rosmund Pike), Felix's siter Venetia (Alison Oliver), and their cousin Farleigh (Archie Madekwe) who makes no secret of his disdain for Oliver. Over the course of the Summer, Oliver ingrains himself into the lifestyle of the Cattons until darker revelations reveal themselves and send ripples throughout the Catton family and estate.Saltburn is this sophomore feature of Emerald Fennell who previously made a name for herself with 2020's Promising Young Woman. Taking inspiration from country house set stories, Fennell creates some characters who are despicable but also oddly compelling in a story that takes its time in setup before building to a strong and memorable finish.In terms of acting, Saltburn is a fantastic showcase for an ensemble cast with not only the Catton family made up of status conscious snobs whose atrocious attitudes are either worn on their sleeves or hidden behind a transparent veil of empty sympathy. All of the characters have some flaw be it in a tenuous grasp on status as is the case with Farleigh, a hunger for validation in the case of Venetia, or in Felix's tendency to pick-up lower class \"strays\". Barry Keoghan is absolutely fantastic in the role of Oliver Quick and what starts out as a seemingly innocuous observer into this world of opulence and wealth is soon revealed to be a rich multi-layered portrayal that becomes increasingly absorbing minute by minute as Keoghan has to act out certain grotesque or off-putting scenes that would be a challenge for most actors.In terms of the writing, Saltburn initially seems like it's trying to position itself as an \"eat the rich\" type story in the vein of The Menu or Glass Onion, but while that element is there I'd say the movie has more in common with the works of Patricia Highsmith in how it becomes a psychological game of wits as filtered through this satirical drama in a countryside house. I can't give too much away but the movie builds an uneasy voyeuristic atmosphere that culminates in a devious and wicked ending. The movie won't be for everyone as there are sequences that are difficult to watch due to how uncomfortable they are (even if they are well acted), and scenes involving a bathtub or late night rendezvous in the garden will definitely not be for the squeamish.While Saltburn took its time in setting up its story, I was ultimately satisfied with the route it took and the payoff it built up to. The movie features excellent acting across the board especially from its lead Barry Keoghan who creates one of the most memorably off-putting protagonists I've seen in some time.",
    "126": "Saltburn is a stylish and provocative experience that gives Emerald Fennell another gem of a film in her directorial resume.There are a number of reasons why this film is so good, primarily the electrically captivating performance of Barry Keoghan. His performance is crucial to making this film work due to the complexity of his character, and he thoroughly nails it. His chemistry with the equally brilliant Jacob Elordi is genius and creates so much tension and energy which is thrilling to watch. A host of terrifically colourful supporting performances from the likes of Richard E. Grant and Rosamund Pike complete a dream of a cast.Of course, a good performance is built on a good script, and the actors have great material to work with. The screenplay weaves its way through social commentary and satire to explorations of love and lust and loss. There's a lot in this film but it always feels authentic and grounded while somehow maintaining this tongue in cheek and surreal vibe. It's a strange balance that was struck perfectly.Stylistically this film is just outrageously good. Every stylistic choice is utter perfection, from the noughties pop songs to the costumes and set design. There isn't much more to say on this point, it's just a gorgeous film to absorb visually.Now the only thing that really doesn't sit right with me is certain elements of the story. There's definitely a touch of style over substance in parts, and I do think the wheels come off a little bit towards the end. As a result the runtime does feel a tad bloated and the pacing drags as a result.This is but a small blemish on an otherwise stellar film which is brimming with tension and drama and oozes style from every frame.",
    "127": "I know Emerald Fennell's last film, Promising Young Woman, was somewhat divisive, but it was one of my favourites of 2020. To me, Saltburn shows that film was no fluke, and I think it's going to end up one of my favourites of 2023. That being said, I'm sure it's also going to be divisive, if it hasn't already been divisive (I stayed away from discourse before seeing it for myself).The first half is often hilarious and sometimes quietly unsettling, and then the second half drops most of the comedy and becomes one of the most uncomfortable films I've seen in a while. I think this also might have the greatest ending of 2023 - part of me used to think Killers of the Flower Moon held that title, but Saltburn's now a competitor.Maybe I should've seen some of the plot turns coming, but Saltburn played me like a fiddle. I thought it was one thing, and then it was that thing for a bit, and then it finally kind of became something else entirely. Fennell's shown herself to be a good director so far (and Saltburn has more memorable visuals than Promising Young Woman), but with both her films, I think she's shown herself to simply be an amazing storyteller/writer. Both films are phenomenally paced, uncomfortably real at times, and unpredictable. She's also good with needle drops, most of them at least kind of ironic.And while Barry Keoghan has given several memorable performances so far (at least), Saltburn is the one where he genuinely cements himself as one of the best young actors working today. This is an amazing performance, and playing such a complex/unique character, too. I know Cillian Murphy will probably win all the Best Lead Actor awards for Oppenheimer this year, but I think Keoghan's more deserving. This is a \"star is born\" type performance - he's incredible.",
    "128": "Seeing \"Saltburn\" in theatres is a mistake. While the lush visuals, stellar sound design, and euphoric soundtrack may, at first, trick you into thinking you made a good decision watching this on the silver screen, there's something else you must take into consideration: the reaction of the audience that you see it with.In all my years of moviegoing, never have I heard such outright and utter shock at a myriad of scenes and sequences that \"Saltburn\" decides to show to its audience; from a moonlit-backdropped romp between two maybe, maybe not lovers, to a scene that has been now aptly dubbed The Bathtub Scene, \"Saltburn\" seeks to simultaneously disgust and arouse its viewers. And you know what? It worked for me.\"Saltburn\" is genuinely daring, complete with scenes that have never before - and never will - grace cinemas again. Eroticism stays thick in the air, enveloping audiences in a rich tapestry of sensuality that explores intense homosexual tension, heterosexual encounters characterized by a dynamic that teeters on the edge of dominance and submission, and fleeting romantic liaisons that blur the boundary of enthusiastic consent. All of it can be challenging for some viewers to watch, but it's also surprisingly sexy, even with certain qualities that can be called nauseating, manipulative, or abnormal. And for some, this can will deter them from enjoying or even watching this movie in the first place, but for others, these elements will prove to be highlights, especially in the case of \"Saltburn's\" overall plot line.Wildly original and hypnotically captivating for the first 85% of the running time, \"Saltburn\" suddenly loses steam and creativity as it devolves into a rehash of a very specific 90's film for the final 15% of the movie. This is disappointing, especially as \"Saltburn\" goes out of its way to be nothing but something you have never seen before, at least at first. That said, its ultimate derivative nature is certainly overlooked by the sheer originality at play when it comes to how the story is told. The specifics mentioned above should clue you in a little bit as to the kind of movie that \"Saltburn\" is, as should the meticulous attention to detail in every aspect, both in front of and behind the camera. Yes, the movie is gorgeous to look at and listen to, with a special mention to the beautiful, purposeful editing. All of the acting is also top notch with shameless and brave performances that truly draw the viewer into the sick world that \"Saltburn\" portrays; Barry Keoghan and Jacob Elordi must be mentioned here, as they are the heart and soul of this movie, and boy do they carry the film wonderfully.So yes, \"Saltburn\" may not be the most original movie, but it is mesmerizing in every respect, unafraid to invite its audience to places they've never been before. And while the ultimate destination may not be as satisfying as you'd have hoped, the journey is certainly worth your time.",
    "129": "Saltburn blew me away, easily making it to my top 5 of the year. In a cinematic triumph that eclipses even Promising Young Woman, Emerald Fennell elevates her artistic prowess to unprecedented levels, crafting a mesmerizing narrative inspired by The Talented Mr. Ripley. The magnetic performances of Barry Keoghan and Jacob Elordi create an irresistible tension, guiding the audience through a labyrinth of unexpected twists, each revelation earned with masterful precision.Barry Keoghan's performance stands as the centerpiece of the film, a tour de force that, when coupled with Elordi's compelling portrayal, ensures an unrelenting grip on the viewer. The seamless fusion of sex, humor, and spine-tingling shocks propels Saltburn into the realm of a cinematic rollercoaster, an experience that captivates and resonates. The visual splendor of the film further underscores its brilliance.Saltburn isn't merely a feast for the eyes; it's a testament to Emerald Fennell's directorial talent. With this cinematic gem, she firmly establishes herself as a director not to be overlooked, offering a wild ride experience for lovers of the silver screen. As the echoes of strong audience reactions reverberate, Saltburn emerges as a cinematic must-watch, inviting those who appreciate unconventional fun to embark on this unforgettable journey.",
    "130": "Saltburn is a 2023 black comedy psychological thriller film written, directed, and produced by Emerald Fennell. The film stars Barry Keoghan, Jacob Elordi, Rosamund Pike, Richard E. Grant, Alison Oliver, Archie Madekwe, and Carey Mulligan. Keoghan plays a university student who becomes obsessed with Jacob Elordi, who is extremely wealthy as well as being good looking. Soon Keoghan worms his way into Eloridi's life and then even into the family home (Saltburn). The film is well-directed, and the acting is great all around. Richard E. Grant and Rosamund Pike shine as Eloridi's somewhat batty parents. And Keoghan, although a bit old for the role, manages to be convincing as a college student. Elordi exudes charm and one could imagine him as super rich with a feeling of noblige oblige to help a needy student like Keoghan. The rest of the cast is very good as well. As for the story, it is twisted, and the director/writer enjoys making fun of the super-rich with all of their foibles. If you liked \"The Talented Mr. Ripley\", you would probably enjoy this one. I rate this one an 8/10; I deducted a couple of points for sound quality (some of the dialog is difficult to discern) and an ending where the writer felt the need to explain everything, rather than leave it your own imagination.",
    "131": "Well that was a journey , no spoilers here as always however if you want to know the genre I'd say it's a psychological horror , no gore but very cerebralIt's easy to see where the writer got her inspiration, not only from her own education but from other movies such as The talented mr ripely , a touch of Peter Greenaway , Equus , entertaining mr Sloane , brideshead revisted , Rasputin , vampire films, psycho & the real life story of Jeremy BamberOllie is a very complicated character and I don't think you ever get to know him fully but I don't think you'd want to - but the character development was great and it's a truth to never underestimate the quiet ones !So the themes here were class , wealth , false friendship , possession , jealousy, mental illness , fantasyThe set was amazing and standout character goes to the sinister butler , Rosamund Pike seems to base her character on Joanna Lumney with that typical british upper class stiff upper lip to continue playing violin while the titanic sinksThere were definitely some uncomfortable scenes to watch but this was a film worth seeing I expected to like it more but some of the scenes were hard to watch nothing is off the menu !Go see7/10 Pad. A.",
    "132": "And you wonder why some \"things\", \"elements\", \"humans\" and \"situations\" in the world are the way they are!A semi-disgusting fictional tale of a movie where the screenplay and acting are so \"on point\" that you end up either loving or hating it.Judging is for \"judges\" and you may think hard ('Saltburn' made it easy for you) as to why sociopaths and psychopaths roam the earth?! As long as you breath air, fuel and combustion to such behavior, make a grandor of it, you are an accomplice to the act.Screenplay/storyline/plots: 2.5Development: 7.5Realism: 7Entertainment: 3Acting: 6.5Filming/photography/cinematography: 8VFX: 8Music/score/sound: 7Depth: 4.5Logic: 2.5Flow: 2Comedy/drama/thriller: 3.5Ending: 1.",
    "133": "Completely unhinged in all the right ways. Emerald Fennell delivers a masterful film that will subvert your expectations.It's also beautifully shot. I also loved some of the symbolism and clues. Like Venetia spilling wine all over herself not only was a callback to an earlier scene where she gets something red all over herself but it also sets up a scene later on.The whole cast is great. I know Jacob Elordi is getting a lot of attention for the film and he is good but I think Barry Keoghan is fantastic in this. There's such a wide array he has to display. Rosamund Pike is also a highlight in the small role she has.If you're looking for a movie on the evils of wealth and what you would do for it, I think this a great film to watch. It's not always an easy watch, there are moments where things get uncomfortable. The film is kind of wild and really goes there. But, it's just a really well told story. A bit of a dark comedy with a little mystery/thriller thrown in. I think the best film of 2023 so far, honestly.",
    "134": "In 2020, Emerald Fennell burst onto the feature movie scene with Promising Young Woman which she wrote, directed and produced and would eventually win her an Oscar for her original screenplay. The movie was a thought provoking dark thriller that left me thinking how this filmmaker, who is relatively new to the world of feature length movies, could back up such a great movie. Well, she's done it with Saltburn, her latest triumph that is one part The Talented Mr Ripley mixed with Rebecca and a dash of Dead Poets Society.Another comedic but dark, charismatic but intriguing story of Oliver Quick (Barry Keoghan), an Oxford university student that befriends Felix Catton (Jacob Elordi) a fellow student who is charming and wealthy and seemingly the opposite to Oliver Quick. The two quickly form a close bond that is reminiscent of The Talented Mr Ripley. Keoghan and Elordi balance each other superbly and bring great chemistry to the screen that you almost don't notice the somewhat awkward height difference between the two. Jacob Elordi's seemingly effortless charisma is juxtaposed perfectly against Barry Keoghan's portrayal of his awkward and lonely classmate.Keoghan and Elordi are supported by a great ensemble including Oscar nominees Rosamund Pike, Richard E. Grant and Carey Mulligan as well as newcomers Archie Madekwe and Alison Oliver. Their engaging performances all set against the backdrop of their stunning palatial home of Saltburn. There is not a single bad acting performance in this film. All the main cast, and many of the supporting roles, play their part brilliantly but Rosamund Pike steals every scene she's in as Felix's matriarchal mother, Elspeth Catton.Throughout the film there are scenes that are breathtakingly shot, dialogue that leaves you in stitches and as the story continues, you get taken on a rollercoaster ride and you feel basically every emotion possible including some scenes that made the person sitting next to me say 'What the @%&#\".Barry Keoghan was a strong contender in last year's awards season with his breakthrough performance in The Banshees of Inisherin, and he backs it up with an even more riveting and complex performance that is sure to see his name mentioned in this year's awards races as well. Jacob Elordi puts in a solid performance as is perfectly cast in his role and doesn't seem out of place amongst other acting heavyweights. It wouldn't be surprising if many of the supporting cast are mentioned during awards season, particularly Rosamund Pike and Alison Oliver, who gives an amazing performance of Felix's sister.This beautiful and haunting movie experience was only made better by watching it in the beautiful St George's cinema at the Sun Theatre in Yarraville. The historic art deco surroundings are the perfect setting in which to watch this movie that you almost felt like you were in Saltburn in person to witness the story.Overall, Emerald Fennell delivers another amazing, charming, haunting and thought provoking rollercoaster ride of emotion and, although some aspects of the story could be seen as predictable, the way it is delivered is in a fresh way with stellar performances, that you will leave the cinema, happy that you paid the price of admission. Definitely an experience that has to be seen on the big screen!",
    "135": "Okay so I've see this movie twice because the first time I was so just \"??????\" that I couldn't totally grasp everything but happened. It's that bizarre. And turns out I liked it even better the second time!This is the kind of movie that makes you so unbelievably uncomfortable because you're forced to watch scenes that you'd normally want to fast-forward through, situations that other movies skip to leave up to your imagination, and boy are they are jaw-on-the-ground unhinged. Made for an entertaining two hours.I really enjoyed the storytelling, filming style, soundtrack, and main cast. Barry Keoghan and Jacob Elordi are AMAZING together - their characters have so much chemistry it's unreal, and the people you think you'll hate at the beginning are the ones you love by the end and vice versa. I felt like some characters/conversations weren't necessary but no major complaints overall. I definitely recommend giving the movie a try if you don't mind leaving the theater wondering \"WTF did I just watch\" and then thinking of nothing else for a week after. Because it really will do that to you.Also, pro tip: don't watch this with anyone who you don't mind feeling awkward with. Because trust me, it gets awkward. If you see it I hope you enjoy it as much as I did... or at the very least are as entertained as I was!",
    "136": "If you think \"Brideshead Revisited\" by way of \"The Talented Mr. Ripley\" you will certainly be on the right road to \"Saltburn\" which is the title of Emerald Fennell's very dark comedy...and therein lies the problem; we have been here before though to be fair to Fennell perhaps not quite as perversely as this. It is the story of Oliver, seemingly from a broken home and fresh up at Oxford on a scholarship, who casts his eyes over the unapproachably gorgeous Felix, (Jacob Elordi, soon to be seen as Elvis in \"Priscilla\"), and says to himself, 'I want him' or at least, 'I want what he's got'. When he tells Felix he can't face going home for the summer Felix invites him to spend it with his obnoxiously eccentric family at Saltburn.So far, so familiar but all isn't as it seems with Oliver, played magnificently by Barry Keoghan and cast at last as the main actor. For starters, there's another house guest at Saltburn, (Archie Madekwe as Farleigh, a petulant little snob who has it in for Oliver), but then Oliver isn't quite as backward as he lets on to be. Mooching nicely between satirical dark comedy and outright thriller material \"Saltburn\" looks, for about three quarters of its length, like it mightn't be going anywhere special; just another movie redeemed by Keoghan's acting but then Fennell gives us and the film that ninety degree turn we have been waiting for but didn't see coming so the final half hour is one nasty, brilliant hoot.Not only that, but the film's actual ending is the best I've seen this year and ten out of ten to both Fennell and Keoghan for pulling it off. If only we could have had more of this earlier on. All the performances are fine, of course. Fennell, being an actress herself, clearly knows how to bring out the best in her cast. Elordi hasn't just got the looks but the acting chops to go with them. As ever Rosamund Pike as the superficial sweetness and light\nmother steals all her scenes and there's a terrific cameo from Carey Mulligan as another house guest but again it's Keoghan's film from first to last; he might just be the best actor of his generation.",
    "137": "I have been eagerly awaiting the release of Saltburn and for once I was not disappointed.Oxford University students of different classes are thrown together in a tour de force of excess , snobbery and jealously.It really is quite something.Introduced into a hedonistic upper class world, the viewer cannot help but feel a sense of terrible foreboding as down at heal Oli accepts an invitation to the stately pile of Saltburn. There to spend the summer with fellow student , the uber-cool and babe magnet Felix.Whether this is a display of generosity and friendship, a baited trap for the unwary, the promise of hedonistic parties or homoerotic temptation, hangs in the air.Cue the excellent supporting cast of the family. It could be said that they all act their pants off in one form or another.Rosamund Pike displays a cutting wit as the mother of Felix, with laugh out loud moments and an eccentricity of naivety , vanity and vulnerability all thrown into one. She really is excellent.Richard E Grant also shines as the head of the family Sir James, with his childish glee in simple pleasures but then so do all of the cast without exception.There are some simply astounding and mouth dropping set pieces, where the camera lingers and follows what Oli gets up to in extended cuts.The whole film is beautifully shot and has heart, twists and yet also has the power to make the viewer extremely uncomfortable.This is an exceptional film and I feel destined to become a classic.",
    "138": "Unexpectedly theatrical and with substance - like gothic thrilling vice laden modern Shakespeare. This is a film about consumption, the weakness and naivety of arrogance, and a complex first love emotion rolling obsession/jealousy/narcissism into one driving force.There are three acts for me: Oxford, Saltburn, & madness.The first act didn't work for me till the second act kicked in. I was worried about a overly-parody-fied and caricatured script. Whilst I recognised the feelings and experiences of Oliver at Oxford, the people were too larger than life and the early laughs didn't land properly for me. Laughing at silly posh young people or uber geeks just wasn't my thing. Some of the cruelty and snobbery played out well though.The second act puts the first into perspective. The first act which shows an alienated and floundering Oliver gain acceptance from a dislikeable group through the actually sane, kind-ish and likeable Felix sets up for the second act. More unlikeable rich people consuming each other and tossing people away like toys. But Oliver has Felix now and has picked up skills in getting things his way, seduction and sweet talking. But the acting from everyone at Saltburn estate is spot on - I properly laughed at Rosamund pikes and Richard e grants moments. Even though they are all spoilt, sheltered, unwittingly arrogant and judgemental - these characters you like, you see their vulnerabilities and insecurities - you have fun when they have fun.Things start looking beautiful in the second act. Sometimes distractingly so. The light play, framing, and camera work are stunning. You feel you are in the throws of first love in the best summer of your life. Sometimes this was at odds with the drama or tension in the story.Final act madness. The sympathy built up for the family now leads into the thrilling dramatic unwinding. The consumers become the consumed. Arrogance and haughty ideas of invincibility led to weakness and fractures.This isn't an overly cohesive film for me, but I think that's intentional as mis direction. Clues for the real story are laid throughout and I had guessed the ending about two thirds of the way in. I really enjoyed the moments of summer headiness, where everyone is enjoying each other's company. Sometimes the inter-character drama and tensions was too much for me - almost descending into reality tv pettiness. I think thats intentional to show the unsympathetic side of the upper class and olivers push back - I just don't think it needed so much.The pacing and focus was a little off for me at times. The film was full of symbolism and clever lines but it almost felt too full sometimes. Like vacillating rapidly between moods. There was a moment where I was full of tears at portrayal of grief when others were laughing - very interesting but it left me feeling a bit all Over the place. But excited!The score and the setting and sterling acting efforts lift the film up into a grand feeling vision. I was a little disappointed that the tone of the trailers wasn't present in the film at all (bloc party song teaser trailer was amazing) . But the score takes this to a different place - British, establishment, old money, young love, hubris and longing - great score.The film is exciting and there are unexpected moments and some choices too. I enjoyed watching this a lot and am excited for more films. There's a lot to enjoy here. Barry keoghans metamorphosis through the film is really really thrilling. Reliving 2006 is fun too - wish just a bit more was done with the music and feeling of that time. Some duff moments for me too so a 7.Recommend.",
    "139": "Nothing can prepare you for Saltburn. After the brilliant Promising Young Woman, Emerald Fennell stuns once again with the dark and immensely twisted Saltburn; a stylish film on class, wealth, and our own immoral and perverted desires to obtain it. This is one messed up, horny film that will leave you both sickened and stunned. Think The Talented Mr. Ripley meets the first 30 minutes of Babylon. It's twisted and a bit of a slow burn, but ultimately enchanting. It's bold, unpredictable, provocative, and just so funny, buoyed by a cast who completely understood the assignment and delivered glorious results.Barry Keoghan is fearless in Saltburn, bearing it all in more ways than one. He's always been such a gifted actor, but you've never seen him quite like this before! His character is fascinating, with his constant weaving in and out of control a real highlight, making him so much more interesting and flawed than the audience surrogate he starts out as. Jacob Elordi is stunning. Rosamund Pike and Richard E. Grant dial it up to eleven and get some of the best laughs, stealing every scene they are in.Emerald Fennell and cinematographer Linus Sandgren craft a gorgeous film of vivid saturation and striking imagery (some of which cannot be unseen). Equally strong is Fennell's screenplay which is hilarious, almost every scene has at least one memorable joke or biting line of dialogue. The only critique I might have is that there isn't much to chew on; the film doesn't have too much to say and isn't too deep. But my god, is it ever a fun romp!Saltburn had me captivated from start to finish, truly one of the most unique and original films that I've seen in some time. At times it's bizarre, amusing, sexy, and intriguing, and at times it's just plain weird. It's a slow, sensual burn with a jaw-dropping finale. I can't believe what I just watched, and yet I love it in some messed-up way! It definitely isn't for everyone, but I loved it! I'm simply a fan of bold filmmaking, and this movie is BOLD! I'm so glad something this original and wild exists in the world. I can for sure say I haven't seen anything like Saltburn before - and won't be forgetting it anytime soon!That final shot!!!(See it with a crowd... just to see the reactions... it's one hell of a ride!)",
    "140": "SALTBURN (2023) Amazon Prime Video. Writer-Director Emerald Fennell's follow-up to the provocative PROMISING YOUNG WOMAN begins with a bit of misdirection as its setting is tony Oxford University in England. It's shot on 35mm film and adopts a classic 1:33 aspect ratio for emphasis. Oliver Quick (Barry Keoghan) is a new student just trying to fit in. The 'in' crowd orbits around Felix Catton (Jacob Elordi who played Elvis in the recent PRISCILLA) and Oliver soon sets his sights on ingratiating himself with him. Thing is, Oliver is a commoner and Felix very much part of the ruling class, but through guile and cunning, he manages to ingratiate himself with the handsome and magnetic aristocrat to the point where he's invited to stay with Felix' family during break.It's at Saltburn, the Catton home, where Fennell's more astringent streak truly takes hold. Richard E. Grant (Sir Richard) and Rosamund Pike (Elspeth) are the idle rich parents. Carey Mulligan plays a hanger on. Alison Oliver is Felix' very needy and nervous sister Venetia, and Archie Madekwe is Farleigh, another Oxford student invited to stay for the summer. Fennell takes this motley stew of characters and lets the outrageousness fly (fair warning: things get icky).SALTBURN begins as a tale of unrequited admiration (if not formal love) and then moves towards class satire, but it's never truly credible. Everything is far too drawn out and the ambition extends further than the film is capable of selling. The performances are fine. Keogan sells the - sad sack with intelligence - bit quite well. Pike is an imperial marvel and Grant is a good match. The screenplay tries so hard to dot every \"I\" and cross every \"T\" that by doing so, it makes all the improbabilities all the more apparent (something which also befell PROMISING YOUNG WOMAN). The satire becomes more exhausting than sharper by the end. More damning, it has very little to add to the timeworn critique of the upper class that is a British cinema staple.",
    "141": "In typical British fashion, it's superbly written and shot. While you might think much of it is over the top, it's also nuanced in that \"English Way,\" where you're only eccentric if you're not eccentric, especially in the upper crust, which is where this film is baked.The performances are also nuanced, and brilliant, and effortlessly so. It's not even worth talking about, they're so good.Perhaps the strongest currents in this film's ambitious set of objectives, is in its quite blurred lines in who is predator, and whom is plaything. In how it depicts the inner, and often darker, truth of people who've lost touch with the grimier, but truer, reality you'll find in the lower rent pubs. And how being emotionless, due to the necessity of social \"appearance\" overriding the shredded heart, is one's only out in the darkest of moments. Avoidance as self-preservation.The prey is likeliest to find its own humanity within, while the predator is not.Alas, it wants you to take a good long long at yourself, as well. Do that, and you'll find satisfaction if you're honest, and disquiet if you're not.",
    "142": "No matter how much you think you're prepared for this film, you will not expect how it turns out. And for the most part that's a great thing, but there are some scenes that make me think what on earth was going on in Mrs. Fennell's brain.I liked the fact that the satire itself went in a different direction - while the film was advertised as an 'eat-the-rich' thriller like The Menu or Triangle of Sadness from last year, it didn't end up going in that direction. And it's right that it didn't - Fennell herself is part of that said group that should be eaten, so if she was poking fun at her own class then the satire just doesn't work as effectively. Instead, it veers towards American Psycho in that respect - there is a specific class that isn't discussed too much (there it's the yuppy culture, here it's the middle class who takes issue with being underrepresented to increase their status and popularity). It's a class that hasn't had too much critique in films but still continues to wreck havoc in the Oxbridge sphere, so I'm glad it's been given some attention.The performances were first-class, Barry Keoghan can do no wrong, he certainly had to go far outside of his comfort zone for this role. Jacob Elordi plays a character you hate to love, the sort of person who runs the cliques in Oxbridge but you want the approval of. Some of the lines he says to Keoghan's characters are scarily real since he is so unaware of life outside the Oxbridge bubble. In fact the whole first 30 minutes is an incredibly accurate depiction of the Oxbridge experience, even if it is from 2006. It goes to show that representation of all classes and regions is still very weak and requires work.The main downfall of this movie are some scenes which are so bizarre and unnecessary. I understand the obscenity to portray different sides to characters, but some of them drag on for so long and it just makes me think that it would've been so uncomfortable for the actors. Hopefully they got paid a lot for it. That said, I think the final scene was absolutely cracking. It reminded me a bit of Midsommar in the sense that I was meant to be filled with hatred, but I empathised with the character so much that I was having fun. Which makes you consider who you look up to. Food for thought.",
    "143": "BrilliantI want to start by saying the movie is really good there are one or two things that I think could be dropped but other than that it's really really good.The story is about Oliver who is attending college in Oxford and he isn't the most popular person until he meets Felix. There seems to be an instant desire between Oliver towards Felix and after Oliver shares his hard life and his current circumstances with Felix, Felix decides to bring him home to Saltburn where he lives, an extremely wealthy family. After that it all gets a bit, funky.Overall, I got a lot of enjoyment out of the movie. I think there is some incredible visuals. I think the music is fantastic. The original music and the soundtrack is really good.The acting from everybody is superb. I think Barry did a great job and is the stand out of the movie for me, but also another one would be the parents of Felix.There are some shocking things, it's a very explicit movie without showing too much. It is leaning to lustful, with SHOCKING scenes. The bath scene is not as shocking as some make out.A tad slow towards the end, other than that 0 complains, go see it, 8/10.",
    "144": "Going to see a film about a seemingly working class northern lad infiltrating the lives of an exceedingly wealthy aristocratic family, I have to say I went in expecting it to be very heavy on the social commentary. I was basically sat there waiting for the twist where it turns out Felix and his family are the embodiment of pure evil. And I must say, without giving too much away, that I found it refreshing that the film managed to take quite a cliched premise and do something a bit different with it.I generally found it to be really entertaining, and would definitely recommend seeing it, however I did have a couple of issues with it. Firstly, and for an expansion on this I would recommend reading the New Yorker's review of the film, I thought that there was much more of Oliver's story that could have been told - we are left entirely unclear as to how he has become the way he is, and I think some exploration of this could have been interesting. Secondly, there are some shocking scenes in there. I mean really shocking - almost to the extent where I think they are more there just for the sake of how outrageous they are than for any development of character or plot.Overall though, it's a great watch and may I add a final shoutout for the soundtrack which I thought was fantastic - though it's quite scary for me to think that Bloc Party and Arcade Fire are now fitting for a \"period\" film!",
    "145": "I admit I didn't really know much going into this, and coming out still not exactly sure what I just watched. I'm all for stylistic, if not strange films. But this movie tonally was all over the place and not really sure if its intent was successful with me either. I suspect a lot of walkouts out of boredom or just wtf disgust. Personally I feel this movie needed to fully commit to the depravity or intensity to be great. Part of the issue is what many others mentioned, it's that we've seen this story many times before. And to me it's the second act that was far superior but wasn't really a surprise. The run time was too long and I didn't really care enough about anyone, I think skip the filler especially the school scenes and dive deeper into fleshing out the main players, so by final act it's an impact.Visually it was like A&F and Sofia Coppola had a love child...with dashes of NWR's Neon Demon (a plus for me). However, it was very veryyyy British and very specific to early 2000s particularly in song choices. Almost a bit too niche for me and it needed a bit more dark humor or cleverness to keep me hooked. Odd aspect ratio that didn't work and the sexuality was well...just there. Refreshing to see female gaze but sorry it just didn't work to full effect, not taking anything away for overall strong acting. I just wish a lot of these actors had a bit more to play with especially Jacob Elordi. I wish he and the lead actor had stronger motivations so the events actually provoked a reaction, I fear the only thing that did were the sex/nude scenes. I'm not even sure why Carey Mulligan was there who made so much more sense in the director's first effort. I didn't hate it but I must say it's not a film for everyone. I suspect some walk outs for various reasons.",
    "146": "Saltburn is the second feature film directed by Emerald Fennell, her first being 2020's Promising Young Women which I am yet to see but let's just say after watching this film I'll be looking to watch that one pretty shortly. The film stars Barry Keoghan as Oliver Quick who when we first meet him is just starting university at Oxford and due to being from a seemingly impoverished Liverpudlian suburb he's finding it hard to make friends (I feel his pain). That is until he helps out Felix Catton (Jacob Elordi) who's one of the more popular pupils. Felix welcomes Oliver into his friend group and eventually his home during which time Oliver develops what can only be described as an Infatuation for Felix. Felix is from an incredibly wealthy family who also welcome Oliver into their mansion (Saltburn) but that's when things start to go awry.As I mentioned before I haven't seen Fennells directorial debut and so knew little about her style going into this film. The only thing I even knew about this film was what I saw in the trailer. I had the sense that it would be quite a stylish artsy film which it is however I had no idea where the story was going to go and I was very pleasantly surprised. The film is very much a slow burn but it's never boring, I found myself entranced by the performances of the entire cast throughout. Keoghan in particular gives one of the best acting performances I've seen this year and I hope he gets the recognition he deserves for such a stand out performance. The film takes around 80 minutes to set the scene as it were but once it does I was on the edge of my seat almost like a murder mystery trying to predict what was going to happen next and how the film might end. The film has twists and turns throughout which I didn't expect and by the end I could never have predicted that the film would conclude in the way that it did. This film was a real hidden gem for me and is without a doubt worth a watch. It should be said however that there are some squeamish moments, whilst it's not a horror film if you're of a nervous disposition then maybe give this one a miss.A genuinely gripping drama by a director and cast who undoubtedly have massive careers ahead of them.Rating: 8/10.",
    "147": "Most reviewers make comparisons, and, as we all know, - comparisons are odious. Coming at this film without seeing \"comparable\" films I enjoyed it.I liked the plot twists, adored the humour, loved the visuals, a jolly good romp.For fun I looked up the sex and nudity score which apparently is \"severe\", well if someone had actually had sex with a dead male's body ( it never happened, get a grip ) and if a man dancing with no clothes on terrifies you then yes, it may be severe. Quite frankly the ratio of women's tits to men's penises in films is way too uneven for my liking, so a naked man dancing I simply thought was lovely.I didn't realise the accent was supposed to be Liverpudlian, it wasn't really much good, but it didn't spoil the film. Agree wholeheartedly with pacing of the last 20 minutes, a little sad that it was so choppy, but the bathtub scene was delightfully squicky!",
    "148": "Watched for the first time on December 1st 2023\nFormat: Regular Theatre\nMy rating is 7.5/10Synopsis: A student at Oxford University finds himself drawn into the world of a charming and aristocratic classmate, who invites him to his eccentric family's sprawling estate for a summer never to be forgotten. (Source: IMDb)\nSaltburn is a great original story directed and written by Emerald Fennell that is a mix between gore, weird, funny, cold, and very very disgusting at times. The film takes audience members into a very long weird journey to 'Saltburn'.When a film uses a 4:3 aspect ratio, it usually is a risky choice that must have an interesting result. Well, in this film, it truly was an on point choice. It really helped in delivering that feeling and experience of being trapped in this journey among the characters. As well as having to experience the weirdly situations that the characters fall into. The 4:3 aspect ration helped very well in tense scenes where there was stress and tightness among characters.This links with the visually stunning cinematography that helped in delivering some amazing still shots and frames that may seem like they are paintings. Im fact this film is inspired by so many paintings. Finally, an intreating choice that was made was having dim lighting in almost every shit even if it was shot in daylight. One intreating indoor scene had the sun lighting hitting the red curtains in that room that turned the whole walls of the room and all the chvaracters' faces, red. Which foreshadowed so many things in that scene. The 4:3 aspect ratio, the cinematography & camera movements, the art inspiration, and the lighting choices were all elements that helped in portraying and capturing the final results of a visually stunning picture.It was intreating to realize that in some scenes, and specifically those that include a tense moment, included no music score being played in the background. This created an even more tense feeling as the focus was entirely on the dialogue and the picture that is being portrayed. On the other hand, when there was music playing, in the background in tense scenes, it is noticeable that it was getting louder as the scene progresses.As always, Barry Keoghan presents yet another weird character alongside an incredible acting performance. He presents the coldness his character has. However, Jacob Elordi presented something that unfortunately isn't new. Same 'naughty boy' character that we saw in Euphoria, in Kissing Booth and now in Saltburn. Archie Madekwe is the true surprise of the year. With his amazing performance in Gran Turismo (2023), he is now in yet another great performance that he nailed it. Not to mention the great yet short runtime performance of the parents played the great Richard Grant and Rosamund Pike.A film that is so weird and not for everyone at all. Yet, its incredible filmmaking elements cannot be denied as stunning choices.Despite the plot twists and the direction of where the story is heading to, it was easy to predict and to expect. This is something that made me personally not surprised whenever a 'shocking' event happened in the film. This is something that lowered my enjoyment of the story a bit and made just sitting and waiting for an event to happen rather than being surprised that it happened.",
    "149": "One of those films where you're never bored! This flows twist after twist, with constrant thrills and realisations.The movie starts as if it is a coming of age movie about a troubled youth in a new world, suddenly suggests a possible romance movie, and ends up being an absolutely mind-blowing story full of plot twists ,which leaves us questioning just about every story and character we have encountered along the way.Nothing you think you know is really true.. lots of surprises!!This keeps the movie alive, full of thrills and is very engaging even between this excitement.Would recommend to almost anyone. Some sexual scenes and disturbing ideas are disaplyed but this adds more and more to the plot twists. There are also some snide comments and laughs along the way.A film that just really gets you wondering how money doesn't always come with happiness, and if we can really trust anyone at all!"
}