{
    "0": "SILENT NIGHT (2023) ** Joel Kinnaman, Catalina Sandino Moreno, Kid Cudi. John Woo's disappointing action revenge flick with Kinnaman seeking vengeance on gangbangers who accidentally killed his son on Christmas has so much potential but is squandered in its hole-laden script by Robert Archer Lynn (i.e. Namely the sadly misused talent of Sandino Moreno as the spouse who basically just passively cries while her husband for months on end is holed up in their basement preparing for war). While Kinnaman's character is literally silenced due to his being shot in the throat renders him mute and his impressive implosive performance can't make up for the pedestrian trope-laden story (i.e. The police not doing their job). A few decent set pieces sadly cannot make up for a half-baked update on DEATH WISH and its ilk.",
    "1": "I hate to say, I'm overall disappointed. I really wanted to enjoy this but it fell flat for me. I figured John Woo going back to straight up action will be a treat. Instead of using the idea of a dialogueless action flick as an interesting device he creates a very drab story that is less than appealing. He makes little effort in trying interesting ways to propel the story within the confines he set up. It's like he never watched a silent movie and saw how you can tell a compelling story with minimal dialogue. He just leans on lame cliches. Also there's too many logocal errors, even for an action movie. And Joel Kinnaman, who I normally like, makes a less than appealing protagonist. Even without speaking his character seems annoying. An unfortunate misfire from something that had a lot of potential.",
    "2": "This movie is probably not going to satisfy a lot of people who would rather watch a movie with few million dollars in budget and loads of CGI work. Yes you might have seen a similar movie about revenge and sadness, but everyone griefs differently, so don't listen to haters and moaners.It is definitely not a movie you'd watch with kids under 15 (plus/minus 2) years old.For a movie that doesn't rely on heavy and deep conversations, this one gets the point across and delivers more than you would expect. It shows a person's will to make peace with themselves and not give up until they reach their goal.Watch it with an open mind, and enjoy the movie with not much of distractions of talking.",
    "3": "\"Silent Night\" is the new action revenge thriller from Hong Kong action legend, John Woo. At 77 years old, he hasn't lost touch with the genre and delivers his style of operatic kinetic action sequences that don't displease. However, the action sequences and Joel Kinnaman's performance is the only thing good about the movie. Predictable is one thing, but the movie is the same action movie we have seen before with a revenge aspect.Set at Christmas time, Brian (Joel Kinnaman,) and his wife Saya (Catalina Sandino Moreno,) lose their only son to a stray bullet after two rival gangs shoot from cars at each other in their neighbourhood. Brian chases them down, and he's shot in the throat. The title, \"Silent Night,\" Is because it's a silent movie with almost no dialogue, and that is where the film's biggest problems lie. Brian not speaking adds something different to the film as he uses facial expressions to convey feelings or the situations he finds himself in.Brian chases the gang members down and he is shot in the throat by Playa (Harold Torres,) a typical gang member with tattoos on his face. He shoots Brian, who recovers in the hospital, losing his ability to speak and discovering that his son has died. When he returns home, he hits the bottle and becomes engrained with revenge. He marks on the calendar the day he is going after the gang members while his wife watches him drink like a fish and lose himself, not knowing what to do or how to help him.Nobody speaks a word in the film. The only dialogue is from radio transmissions from Police chatter and that's it. Characters get punched, struck by a car or they scream when they are shot. There are some scenes of text between Brian and his wife but this doesn't further the plot because we know what kind of movie this is. A means to an end. There is an emotional story here but everyone is useless along with the gang who are going to get violently blown away by running right into the bullets.Brian is so filled with revenge. Joel Kinneman plays this well. Method acting in the mirror trying to scream, and you see the rage. He armours his car, learns to use a knife and becomes efficient at using handguns. He plans a date on the calendar when he is going after them. In the meantime, he becomes cold towards his wife, conducts surveillance on the gang leader responsible and hands the case to a cop, Detective Vassal (Kid Cudi) who is useless because his silence takes away from the idea that Brian was shot in the throat and can't talk but this guy can talk. How his character unfolds is one of the dumbest aspects of the movie.In the second act of the movie, I figured out the ending, and I was correct. You know that moment where it just clicks because you have seen it before, and where can the story go after this? There is no second story for a character like this.Brian sinks deeper into mania until one year passes, and he loads up every gun he has and puts on a bulletproof vest. His plan is to kill them all and he executes it almost flawlessly. But when you see Playa and his dumb girlfriend, he keeps on heroin, dancing, it just drags because it's all sound and noise. Saya sees she can't help anymore and the tight close-ups of her tears there make you feel for their situation. It is heartbreaking to see but when Brian is about to become a one-man army, how are we supposed to feel when he is simply another vigilante?First, he uses a car to spin around the thugs and shoots them all, al la \"John Wick,\" and then he appears on a motorcycle and shoots his way inside. Playa sends more of his goons after him and the idea of the grieving father is here, but because we don't hear anything from anyone, it's hard to convince feelings towards the characters, especially the dumb cop. He blasts his way through Playa's Batman-like skyscraper leading to the staircase sequence and eventually to Playa.\"Silent Night\" has great action sequences, but we have seen this before. Joel Kinneman is great, and the story is tragic and violent, but at the heart of it is vengeance which is used as an excuse for bullets to fly and cars to crash in glorious fashion. There is an emotional message about fatherhood here, and when tragedy strikes, what do you do? \"Death Sentence\" by Kevin Bacon conveyed this message much better, and I thought a lot about it while watching this movie because it's very similar right down to the story, but that was a better movie.5/10.",
    "4": "Silent NightAs the previews revealed, this is the standard story of: family is taken or killed, man swears revenge, man gets revenge in a beautiful video game-like blood bath.What makes this film different is that he cannot talk. In fact, there is very little dialogue at all in the entire movie, and that was such a different spin on this. There's lots of things blowing up, lots of scowling, lots of blood everywhere, and my personal favorite: man get shot multiple times yet in the span of less than a year turns into a ripped bodybuilder with perfect athletic ability. But little talking, and not much background music other than what the characters are playing on their radios.I loved it even with its predictability only because of said lack of dialogue. I give it more thumbs up than I would have simply because of that. I marked this with spoilers because I didn't realize that more than our main character would be silent.",
    "5": "I saw Silent Night, starring Joel Kinnaman-the Suicide Squad movies, RoboCop_2014; Catalina Sandino Moreno-Barbarians, The Bridge_tv; Kid Cudi-House Party_2023, Need For Speed and Harold Torres-Memory, Run Coyote Run_tv.This movie is directed by John Woo and takes place on Christmas Eve. So, like Die Hard, it IS a Christmas movie-Ho, Ho, Ho. Joel plays a man that is playing in his front yard with his 7 year old son on Christmas Eve when his son is caught in the cross fire of 2 gangs shooting at each other. While Catalina, Joel's wife, cradles their dead son, Joel gives chase on foot and gets left for dead when he is shot several times-once in the throat-and looses his voice from the incident. Kid plays the policeman assigned the case and Harold is the gang leader that did the shooting. After Joel's release from the hospital, he grieves and then decides to get his revenge, one year later-he marks his calendar saying Kill them all on Christmas Eve. He spends the year by doing all the action star regiments; getting in physical shape, learning to shoot a gun and learning how to use a knife and of course, he learns how to drive a souped up car with reinforced armor plating. If you like John Woo movies, you should enjoy this one. If you think there is too much talking in action movies, you should really like this one, because there is not a single line of dialogue in the whole film. That's right, you have dialogue free violence.It's rated R for strong bloody violence, drug use and language-I know, you are wondering how there could be language with no dialogue. It's all by graffiti, text or radio transmissions-and has a running time of 1 hour & 44 minutes.I enjoyed it and would buy it on DVD.",
    "6": "Despite a large bulk is silent the action is exceptional and quite sad in the first half yet so worth it at least in my opinion. It's like as if John Woo got ideas from John Wick films and his own genius action style which is fire! Joel Kinaman is an impressive manly actor that is enjoyable in anything he's part of. It's wild how there's barely much dialogue mostly swift sounds, essential talking when needed, music, and epic flow of action. Silent Night might get much appreciation but at least John Woo is still a legend in his craft at such an old age that's always outstanding to me when older folks make great work - no matter what anyone thinks it's worth it for action fans.",
    "7": "Joel Kinnaman (The Suicide Squad, Sympathy For The Devil) is a madman out for revenge in this silent action thriller called Silent Night... Also starring Catalina Sandino Moreno, Kid Cudi and Harold Torres... It's from John Woo, the director of movies like The Killer (1989), Face/Off (1997), Broken Arrow (1996) and Hard Target (1993) who is a master of films, and he is finally back with a bang! It's an explosive Christmas themed action film with no dialogue, loads of action, violence, battle sequences, car chases, stunts and a beautiful score from Marco Beltrami... Silent Night is a movie that is up there with Die Hard, Violent Night and other action films that will be awesome to see every year during Christmas time... It's definitely a must see for action fans...",
    "8": "I have followed John Woo's career through the decades and was looking forward to seeing this film. And at its premiere in Buenos Aires, in its first performance, I was one of the lucky ones who saw this work of art. Woo has given us some of the best action films of all time when he worked with his actor fetish, the great Chow Yun Fat. In this case Woo returns to work in the US to deliver a film that is a challenge; Can you tell a story without dialogue? Normally an action story requires defining a situation, drawing the characters, showing their motivations.... But it is a huge challenge to do it simply by relying on acting and music. It is a fantastic film with wonderful moments. It's not Hard Boiled or The Killer; With this I say that you will not find extreme moments but you will find beauty, action and emotion that will penetrate your heart and leave a mark. With the right preparation and attitude, this film is a transformative experience.",
    "9": "4 out of 5 stars.Silent Night is a good action thriller film that brings John Woos directing style back. And he delivers with a revenge action thriller. The action sequences delivers. The gun shoot out scenes are thrilling. And best with his style. Joel Kinnaman delivers with his performance. The film also has barely any dialogue to none at all. Which still works. Weird in some scenes as other characters do not speak. Understand with Joel Kinnaman as he gets shot at his throat which he cant speak at all. The action delivers. The music score is good that works with the tone and direction. May not be Woos best film but it is a good comeback.",
    "10": "This was just so depressing with zero levity. They really hammer home the sadness. I laughed out loud at how ridiculous a few things were. There were a few points where I was like \"Yes. John Woo!\" But mostly I was just struck with profound sadness. The trailer makes it look fun. It's not fun. There is zero fun.I do love Joel Kinneman. He does a great job with zero dialogue.I cannot recommend anyone see this movie. Especially anyone with small children. I left the theater and my husband said it looked like I'd \"been through something\". And here I am, hours later, still peeved about how upsetting this movie was.",
    "11": "2023 movie season finished in perfection with this film. Silent Night was perfect. When I first heard it was coming out I thought it was a revamp of the horror film from the eighties. Lol.\"Revenge is a dish best served cold ....\" - KhanThis film touched on allot of topics that we all suffer during grief. He acted on how we feel on grief and major losses.We gave it a 10/10, across the board. IMDb gave it a 6.4!! Why?!!! It was perfectly done. No lines said, just screaming and texting. The action sequences were John Woo perfection, I wanted more action and gore. It deserved more gore. The wife's scenes were rough. They separated, not divorced. You can feel the grief and the pain. It was amazingly written that he prepared for 8 months. I cheered him on all the action scenes. Every time he felt out of it. He kept playing that music box thing to keep his motivation going.Perfection Perfection!!! I'll watch it again, maybe we missed something. Lol.",
    "12": ". . . and nothing evokes the bittersweet tear-jerking poignancy like model trains and music boxes. SILENT NIGHT is chock full of both, offering viewers a gunned-down toddler's bedroom featuring an eternal Thomas the Tank Engine railroad which outlives the grieving father, as well as a battery-powered Lionel train set which Dad wraps up Christmas Eve, then unwraps and constructs around Junior's headstone prior to wiping out all the tattooed population of Los Angeles. Ever present till his dying moment is Junior's favorite music box, a simple affair playing a brief bar of haunting melody. Unlike THANKSGIVING, SILENT NIGHT (2023) is a tasteful holiday film.",
    "13": "This is one of the worst movies I've seen all year. Mind numbingly boring, absolutely no dialogue. No one talks the whole movie even characters who can talk don't talk. Main character gets stabbed shot a whole bunch of times but keeps going. Cop gets shot twice in the chest but keeps going. If you have an IQ of 5 maybe you'll find this movie enjoyable. I don't know why the studio made this movie, it's hard to believe they paid all this money to produce complete trash. I'm not a writer but I know for a fact I could write a better script than this. It's unfortunate I do like the main actor in other films.",
    "14": "You will probably see reviews stating this movie has no dialog. That's not entirely true. There is dialog heard over the radio. And there is a line spoken by someone who has been gagged. But on the whole it's pretty much true that there is no dialog, and that's a good thing in my opinion.Early in the movie the main character loses his voice by having been shot in the neck. Rather than show what it's like for someone to try to live in a world of speaking people without being able to speak yourself, the movie simply goes with no dialog. Dialog is not actually necessary. Everything you need to know is clear from what happens visually.Early in the movie you see a single red balloon floating up in the air. You figure that's symbolic of something but you don't know what at first - maybe something corny.After a few scenes, it becomes clear it's because the main character's son was killed by stray gunfire by gang members. The balloon scene is repeated, this time with the context in place.The rest of the movie is about the main character plotting his revenge. He first prepares himself, doing appropriate calisthenics, gun practice and practice driving. This all, of course, foreshadows what is to come in the rest of the movie.Lots of believable gun shot scenes as well as chase scenes, not as over-the-top as in the Fast and Furious franchise.In my opinion, this is one of the best films of the year.",
    "15": "\"Silent Night\" is one of the most fun theater experiences I've had all year.I saw this movie opening night and didn't realize until the night before that the film contained no dialogue. I was wary at first, but the lack of dialogue actually enhances the film.We follow Godlock (played by Joel Kinnaman), a silent hero left for dead and out for blood, hellbent on finding and killing the gang that murdered his young son on Christmas day. Wading through marriage problems, alcoholism, and depression, he decides to dedicate the next year to strengthening his body, honing his combat, and training with weapons.Christmas eve is when the blood begins to flow. He suits up and kills every member of the gang, ending with an epic shootout against the gang boss with the assistance of a friendly rogue cop, played by Kid Cudi.The most evocative part of the movie comes when Godlock finally kills the boss, but dies in the process. As we see him smile and reminisce about memories of his son, only to later be laid to rest with him, leaving a note to his wife apologizing and affirming his love for her despite his distance since their son's death. I like that this ending is a subversion of expectation, choosing to portray the character realistically rather than turning him into some untouchable Hollywood hero.Overall, the action is the typical ballet-like bloodbath we want from a Woo movie. This is a movie for those who like the bullets hot, the blood pumping, and some classic white-knuckle action.",
    "16": "John Woo. People say he's a great action director, I've never felt that way. This movie is badly paced, absolutely laugh out loud funny when it's trying to be serious Becuase for some reason no characters speak. The action is dull to such a degree it's almost impressive. The car chases are clearly shot so slowly that the intense high revving engine sounds turn it into a bad cartoon. It's shot absolutely terribly, with some awful digital zoom moments that fill the screen with low rez garbage. So much slow mo and none of it was needed. Want to see a non dramatic shot slowed down for no reason then this is the movie for you!Joel Kinneman is good and remotes well. The other actors try to make it make sense that they don't talk but there's only so much they can do.John Woo can't shoot action, or story.",
    "17": "Watched this on a whim, loved it, the action was fantastic, plot was good, very simple film to watch, dont think too much, just enjoy the ride, last part of the film was amazing! Have no idea how some people are rating it low, end the ending was really nice.Highly recommend.Watched this on a whim, loved it, the action was fantastic, plot was good, very simple film to watch, dont think too much, just enjoy the ride, last part of the film was amazing! Have no idea how some people are rating it low, end the ending was really nice.Highly recommend this film to anyone who likes action films etc.",
    "18": "I've seen one Woo movie I think-Hard Target decent Van Damme movie. Its hard too imagine a studio financing an action movie with no dialogue. Guess maybe budget was low no big names in it. Really fascinating how the face,on screen texting,action itself,created a mood where talking wasn't necessary. Of course main actor carried the movie. Very expressive face. Never seen an experiment like it but for most part it worked. I could definitely see the John Wick influence on Woo. About the last 30 minutes just gets a little ridiculous lol. Bad guy dancing with his chick with hundred lit light fixtures above them. Sometimes you gotta suspend disbelief like unless your an MMA fighter Noone can take abuse main guy goes thru. Anyway glad I seen it. Someone tried something different unique.",
    "19": "My wife and I got brunch and drank a little too much to drive home so we decided to watch this while sobering up. I wish I just drove home drunk. It's terrible and borderline unwatchable. 1 hour of tense music with zero action and no talking before anything happens.He just casually drives into some big gang war with bullets flying all over the place and kills 10 people the gets out of his car and stands around while everyone is still shooting and doesn't even get shot at.Terrible plot. Terrible writing. Directing. Everything about this movie is awful. I'm still in the theaters and there's about 30 minutes left but I've had zero enjoyment so far.",
    "20": "I've never written a review for this site but felt compelled to do so after seeing how many great reviews this movie received. These reviews are obviously plants because no one in the right mind could say this was anywhere to close or even average.First off, there is almost no action in the entire film. What you see in the trailer is the entirety of the action. The story is a simple revenge one yet, spends an hour and a half focused on the main character's training and preparation. Whereas every other sensible movie would devote maybe a montage of a few minutes to this, Silent Night spends the entire movie on it. All the action is literally in the last 10 minutes, and any moment of action is often interrupted until the next moment of action a few minutes later. There's no continuous action scene. That's why I say what you see in the trailer is all the action there is.The first 30 minutes of the film are spent on the character grieving the loss of his son. 30 MINUTES!!! There's absolutely nothing happening during this time. The movie keeps beating a dead horse over and over and over, and once that's done, they spend an hour on the character training, over and over and over. You literally get to almost the end of the film before anything happens. I kept watching the time on my phone to see how much time had passed.This doesn't feel like a John Woo film at all. I refuse to believe he did it as it contains none of his style. No doves, no dual-wielding pistols until very late and very short, no extended action scenes, no flair.The movie was obviously shelved for a long time as the main character uses a 2022 calendar to plan his attack. This movie was probably meant to release last year but people realized how bad it was.I can't say how disappointed and frustrated I was by this film. I was super excited to see a John Woo action film in theatres, to see the master back in action, as the trailer mentioned. But it was pure false advertisement.",
    "21": "My wife and I saw the movie tonight going in with high expectations, but we were let down by this movie big time.The story setup took about 30 minutes. There is no talking. We get the gist of the story within the first 10 minutes of the movie. After you thoroughly get filled in on the background, you get to watch 30 minutes on how to work out, fire guns, and stab someone effectively. If you make it this far, you will be able to enjoy roughly 30 minutes of mediocre action. It has some very cheesy scenes that make it mediocre for me.Watch the movie at home if you must. After you understand the plot, skip ahead until the action scenes. You'll be glad you did.",
    "22": "After seeing the trailer, it looks promising and lot to offer, but to my surprise it's literally a \"silent\" film no\nVerbal communications, which find me extremely boring that it made me slept almost the duration of the film, having the thought it's a nonstop action film from start to finish. In fact, I get those non verbal communication by their acting and soundtrack or music injected, but it doesn't gave genuine justification of all the characters showed, to the point you might just keep guessing or build your own story, which I find it intriguing. Plot for me is all over, no clear establishment of scenes, most of the time you'll find depressing, and at times feel\nAngry watching it, as it defeats the purpose of enjoying the film as a whole. If I were you, I'll pass on this one.",
    "23": "This was one of the best movies I've seen in a long time. I don't cry easily- one of my biggest issues- but my eyes were watering watching this move. Even thinking about it now makes my heart hurt.Of course this is a difficult topic- for a grieving father going through the sudden loss of such a young child is never easy. That be it- grief of any kind. Joel is so expressive despite not speaking the whole movie. Seeing the look in his eyes when he's thinking of his son made my heart break just a little bit more.I'm not trying to drive people away by saying that it's sad- I just mean it was such a strong point for the movie. I don't think I've ever cried at a movie before until this. And somehow, it was pleasurable. It's sad because it's real. And maybe people haven't killed over 10 people because of the loss of their kid, but his emotions make you feel like you could maybe do the same thing.The ending scene really messed me up in the best way. The set design is insane. Such a gorgeous scene. It's a perfect 'life flashing before my eyes' scene without making it seem like a repeate of every other movie out there. He looked relived. It was bittersweet.I could rant about this movie forever. I can't wait to rewatch this movie. I'll be thinking about it for the next lifetime.",
    "24": "Not only is the protagonist mute, but no one else in the film says a word. This might work if the cinematography, fight choreography, soundtrack, plot, and themes were stronger. But they aren't.This is your run-of-the-mill story about a parent training for a brief period of time to take on a vicious gang in a revenge mission. If you've seen one you've seen them all. The first half drags as we jump between long shots of the father and mother mourning their loss (silently) and the actual incident that killed their son (long and drawn out). Finally we get to the rampage, but the choreography isn't strong enough to make up for the utterly dull first half.",
    "25": "My comments regarding this movie are as Silent as the movie itself.There is no vocal script, something not seen since the silent era.The acting was abysmal, kinsman will most likely get a razzy award for this movie, as his acting in altered carbon, or Robocop could be considered his better work.The only house of cards here, is how quickly Silent Night falls apart. The trailer, and their is only one, which is totally misleading, which brings me to the title of this review.Just ask for your money back or credit to beekeeper, because this movie aside from a few action sequences really fell on its face ... took a bullet to the jugular.",
    "26": "This movie is complete garbage. I expected so much more from the director John Woo and leading role Joel Kinneman. 2023's biggest flop of the year. Keep in mind, John Woo directed Mission Impossible 2 back in 2002 and here we are 20 years later with this disappointment of a movie. The best part about the movie is that nobody speaks which tells you a lot about what to expect. Terrible writing and atrocious acting is something I never thought I'd write in a movie review with Joel Kinneman but here we are. This is what happens when the Writers Guild goes on strike and you have some random baboon writing your script. As most movies nowadays, the previews are the best parts of the movie. Stay home and wait for it to release on some streaming service platform. John Woo, just retire if you're going to make trash movies like this.",
    "27": "I went in hoping for a perfectly-stylish, revenge-driven John Woo film, and got exactly that.The lack of dialogue didn't even feel like a gimmick; to me, it enhanced the despair, grief, rage, and all the stark brutality. Many times, an action movie is rendered corny by its hammy dialogue. No such issues here.Some reviewers have commented on the movie being profoundly sad, due to both the child dying, and the protagonist presumably dying in the end. I'll just say that his final act poetically softens that blow, in my eyes.I'll say that Silent Night does take a little while to get going, but when it does, it's exactly what you'd ask for from a Woo movie: action, creativity, and signature flair..",
    "28": "A good performance from Joel Kinnaman. Great action scenes as well. But the movie tends to be overly depressing most of the time. But what really brings the whole film down is that John Woo abandons his signature dove shots, but puts a parakeet in instead. It's an obvious attempt to try and throw the audience off, as if to say \"Nobody puts Woo in a box.\". Well, it didn't work John. We all know what kind of filmmaker you are. You're a birb man and doves are your muse. Do not fight your nature. The the doves flow freely. It's what you want. It's what we want. Do better. Be yourself.1 parakeet. Zero doves. 1/10 stars.",
    "29": "I'll preface this review by saying it wasn't bad but it wasn't great either. But if you line violence filled films you'll like this oneThe story is very basic and not really well paced in the beginning. The arc of the main catcher is pretty meh. I just didn't feel connected to toss story that much. But the action scenes were great and well choreographed. There's plenty of slow mo which OS pretty typical for a John Woo film.The lack of dialogue does hurt the film. Very few films have been able to pull of a film worth next to no dialogue from the main character. You need powerful supporting characters and's this film didn't have it. The main actor OSS great but he's not an emotional actor so he's alil out of his element imo.",
    "30": "As a fan of both action films and revenge tales I can say this movie is an injustice to both. A dialogue choice by the director which was meant to be clever made it hard to connect to the main characters and made the pacing of the first 35 minutes almost unbearable. The main training montage which was intended to be hardcore and inspirational came across as laughable and cringeworthy. The few moments where good fight choreography and beautiful violence poked through we're not enough to overcome the abysmal acting and nerve straining soundtrack/audio devices. This is a movie that is not worth watching on cable while laid up in a hospital bed. It's honestly that bad. If you go forth anyway, at least I did my best to warn you.",
    "31": "Maybe I'm just not familiar with John Woo movies, but I was sadly disappointed at the a lack action, considering the commercial highlights. The focus was far too much on the families loss, and very little on the action, and I was kind of wishing the movie was over from the start.Also found it hyper focused on some moments that just didn't add to the movie at all. (Ie. The gang leader shooting up his girlfriend on heroin). I just didn't see the point in some of these moments as they really didn't add anything in the end. Maybe my problem was simply the complete lack of dialogue.All in all, if it popped up on the TV one night, I probably wouldn't use my time to watch it.",
    "32": "This movie is billed as action packed. It is not. It likely caters for a portion of the audience who enjoy film-making and some of John Woo's technical prowess.Unfortunately this doesn't make for a good movie to watch. The Action sequences are good, no doubt.To unlock these scenes you have to first engage in a character story, so sad and aimless, that you have no energy left for the enjoyable final quarter of the movie.I left the cinema feeling down trodden and unsatisfied. A warning for people who have been through tough mental health issues or the loss of a child should be included as the director insisted on pushing the point to a level excessive for a movie billed as mainstream.",
    "33": "The basic premise is man has a family, man looses child to gang shootout, man gets shot in the throat, man sinks into despair, man vows revenge . All this happens without him being able to speak.I was looking forward to this movie, as John Woo has made some great films. Unfortunately his return to the action movie genre doesn't have the same impact as his previous endeavours. The counterpoint between loud action and silent preparations might have been good if the storyline had been a bit more...well... more. It felt like a B-movie where they couldn't get too creative due to financial constraints.",
    "34": "Unfortunately, this movie doesn't manage to create any Christmas references at all. Anyone expecting action in the style of \"Violent Night\" will be bitterly disappointed here. In the first 45 minutes you get the impression that you are watching a more special and non-mainstream/standard action movie. But this positive impression vanishes completely in the second half of the movie, which follows one action sequence after another. There is not one creative kill, just dull shootouts. The movie has one special feature that carries it, especially in the first half, which is why I still found it \"okay\" overall.",
    "35": "I was hoping to like this movie but it never really got going. It's a revenge movie but doesn't really have much of an actual detailed storyline to it. Plenty of shooting and stabbing action but in the end you really don't care about any of the characters and whether or not they live or die. If you're expecting something like Deathwish, John Wick, etc don't waste your time. They could have done a lot more in the hero part of the story and make you really want to root for the grieving father but even there you never really get to that point. I tried...I really did but I just left the theater disappointed in this film and have no interest in recommending it to anyone else.",
    "36": "I didn't realize how much action movies have changed since the 90's until I watched Silent Night. It follows along in typical John Woo fashion but with better visual effects. A lot of single shot kills that you say to yourself \"he's going to pop back up\" while watching. It's definitely not the next Die Hard that sparks debate over whether or not it's a Christmas movie. It won't be a film that you put into your annual Christmas rotation but it's worth a watch if your not expecting too much. The first few minutes get you excited with some real action then expect about 40 minutes of drawn out story at time filler.",
    "37": "Unfortunately as the title states this film lands face first. A true dud of a film despite legendary action director John Woo. Joel's performance was just okay in this film. I literally yawned in the opening set up of the storyline despite the situation the character is in to make him do what he does. In an ironic twist in terms of \"John Wick style\" action being that John Woo is a legend this effort painfully tries to be a bad John Wick style film. Halfway in the film I walked out because my head was going to explode from all the cliche nonsense. But congrats to everyone who worked on the film.",
    "38": "Other than the sequence at the beginning, there was no action until an hour in. The training montage was 30-40 minutes when it should have been 10-15. The pacing was just off, so I hope they didn't cut out any action scenes.The movie was dialogue free, which was fine, but maybe they should have explored more about the characters. It wasn't exactly Christmas John Wick like I was hoping for.It was just tragedy turns man into PTSD- overwhelmed killing machine, it was both too real to life and not realistic enough. From the protagonist's perspective it was very single minded, which makes sense because he can't stop making the bad guys pay. But there was too many looks into his mind that shows us that he is just sad and traumatized inside.",
    "39": "Step into a visual marvel with meticulous attention to detail in every frame. Breathtaking landscapes and meticulously designed sets create an immersive experience. The film's innovative cinematography and seamless integration of special effects contribute to its status as a visual masterpiece. Aesthetic choices, from color palettes to shot compositions, elevate it beyond mere storytelling, captivating audiences with a mesmerizing and unforgettable visual feast. The filmmakers strike a delicate balance, presenting nuanced perspectives that challenge preconceptions. Beyond its narrative, the film becomes a catalyst for reflection on the broader implications of the depicted issues, making it a powerful and socially relevant cinematic experience.",
    "40": "The movie for the most part is silent, makes you want to get up and leave. The first 3/4 of the movie is dead, slow boring and not worth the money it cost to see the movie.The last 1/4 of the movie you finally get some action; the action is slow paced. For those of you expecting action like you would find in Taken, John Wick, Jason Bourne or any action packed film do not waste the time or money on the movie; you will be greatly disappointed.Now if you want to see a movie in silence or a movie that will make you understand what a deaf person feels when watching a movie... this movie is for you.",
    "41": "This movie is complete garbage. I expected so much more from the director John Woo and leading role Joel Kinneman. 2023's biggest flop of the year. Keep in mind, John Woo directed Mission Impossible 2 back in 2002 and here we are 20 years later with this disappointment of a movie. The best part about the movie is that nobody speaks which tells you a lot about what to expect. Terrible writing and atrocious acting is something I never thought I'd write in a movie review with Joel Kinneman but here we are. This is what happens when the Writers Guild goes on strike and you have some random baboon writing your script. As most movies nowadays, the previews are the best parts of the movie. Stay home and wait for it to release on some streaming service platform. John Woo, just retire if you're going to make trash movies like this.",
    "42": "I went in hoping for a perfectly-stylish, revenge-driven John Woo film, and got exactly that.The lack of dialogue didn't even feel like a gimmick; to me, it enhanced the despair, grief, rage, and all the stark brutality. Many times, an action movie is rendered corny by its hammy dialogue. No such issues here.Some reviewers have commented on the movie being profoundly sad, due to both the child dying, and the protagonist presumably dying in the end. I'll just say that his final act poetically softens that blow, in my eyes.I'll say that Silent Night does take a little while to get going, but when it does, it's exactly what you'd ask for from a Woo movie: action, creativity, and signature flair..",
    "43": "A good performance from Joel Kinnaman. Great action scenes as well. But the movie tends to be overly depressing most of the time. But what really brings the whole film down is that John Woo abandons his signature dove shots, but puts a parakeet in instead. It's an obvious attempt to try and throw the audience off, as if to say \"Nobody puts Woo in a box.\". Well, it didn't work John. We all know what kind of filmmaker you are. You're a birb man and doves are your muse. Do not fight your nature. The the doves flow freely. It's what you want. It's what we want. Do better. Be yourself.1 parakeet. Zero doves. 1/10 stars.",
    "44": "I'll preface this review by saying it wasn't bad but it wasn't great either. But if you line violence filled films you'll like this oneThe story is very basic and not really well paced in the beginning. The arc of the main catcher is pretty meh. I just didn't feel connected to toss story that much. But the action scenes were great and well choreographed. There's plenty of slow mo which OS pretty typical for a John Woo film.The lack of dialogue does hurt the film. Very few films have been able to pull of a film worth next to no dialogue from the main character. You need powerful supporting characters and's this film didn't have it. The main actor OSS great but he's not an emotional actor so he's alil out of his element imo.",
    "45": "As a fan of both action films and revenge tales I can say this movie is an injustice to both. A dialogue choice by the director which was meant to be clever made it hard to connect to the main characters and made the pacing of the first 35 minutes almost unbearable. The main training montage which was intended to be hardcore and inspirational came across as laughable and cringeworthy. The few moments where good fight choreography and beautiful violence poked through we're not enough to overcome the abysmal acting and nerve straining soundtrack/audio devices. This is a movie that is not worth watching on cable while laid up in a hospital bed. It's honestly that bad. If you go forth anyway, at least I did my best to warn you.",
    "46": "Maybe I'm just not familiar with John Woo movies, but I was sadly disappointed at the a lack action, considering the commercial highlights. The focus was far too much on the families loss, and very little on the action, and I was kind of wishing the movie was over from the start.Also found it hyper focused on some moments that just didn't add to the movie at all. (Ie. The gang leader shooting up his girlfriend on heroin). I just didn't see the point in some of these moments as they really didn't add anything in the end. Maybe my problem was simply the complete lack of dialogue.All in all, if it popped up on the TV one night, I probably wouldn't use my time to watch it.",
    "47": "This movie is billed as action packed. It is not. It likely caters for a portion of the audience who enjoy film-making and some of John Woo's technical prowess.Unfortunately this doesn't make for a good movie to watch. The Action sequences are good, no doubt.To unlock these scenes you have to first engage in a character story, so sad and aimless, that you have no energy left for the enjoyable final quarter of the movie.I left the cinema feeling down trodden and unsatisfied. A warning for people who have been through tough mental health issues or the loss of a child should be included as the director insisted on pushing the point to a level excessive for a movie billed as mainstream.",
    "48": "The basic premise is man has a family, man looses child to gang shootout, man gets shot in the throat, man sinks into despair, man vows revenge . All this happens without him being able to speak.I was looking forward to this movie, as John Woo has made some great films. Unfortunately his return to the action movie genre doesn't have the same impact as his previous endeavours. The counterpoint between loud action and silent preparations might have been good if the storyline had been a bit more...well... more. It felt like a B-movie where they couldn't get too creative due to financial constraints.",
    "49": "Unfortunately, this movie doesn't manage to create any Christmas references at all. Anyone expecting action in the style of \"Violent Night\" will be bitterly disappointed here. In the first 45 minutes you get the impression that you are watching a more special and non-mainstream/standard action movie. But this positive impression vanishes completely in the second half of the movie, which follows one action sequence after another. There is not one creative kill, just dull shootouts. The movie has one special feature that carries it, especially in the first half, which is why I still found it \"okay\" overall.",
    "50": "I was hoping to like this movie but it never really got going. It's a revenge movie but doesn't really have much of an actual detailed storyline to it. Plenty of shooting and stabbing action but in the end you really don't care about any of the characters and whether or not they live or die. If you're expecting something like Deathwish, John Wick, etc don't waste your time. They could have done a lot more in the hero part of the story and make you really want to root for the grieving father but even there you never really get to that point. I tried...I really did but I just left the theater disappointed in this film and have no interest in recommending it to anyone else.",
    "51": "I didn't realize how much action movies have changed since the 90's until I watched Silent Night. It follows along in typical John Woo fashion but with better visual effects. A lot of single shot kills that you say to yourself \"he's going to pop back up\" while watching. It's definitely not the next Die Hard that sparks debate over whether or not it's a Christmas movie. It won't be a film that you put into your annual Christmas rotation but it's worth a watch if your not expecting too much. The first few minutes get you excited with some real action then expect about 40 minutes of drawn out story at time filler.",
    "52": "Unfortunately as the title states this film lands face first. A true dud of a film despite legendary action director John Woo. Joel's performance was just okay in this film. I literally yawned in the opening set up of the storyline despite the situation the character is in to make him do what he does. In an ironic twist in terms of \"John Wick style\" action being that John Woo is a legend this effort painfully tries to be a bad John Wick style film. Halfway in the film I walked out because my head was going to explode from all the cliche nonsense. But congrats to everyone who worked on the film.",
    "53": "Other than the sequence at the beginning, there was no action until an hour in. The training montage was 30-40 minutes when it should have been 10-15. The pacing was just off, so I hope they didn't cut out any action scenes.The movie was dialogue free, which was fine, but maybe they should have explored more about the characters. It wasn't exactly Christmas John Wick like I was hoping for.It was just tragedy turns man into PTSD- overwhelmed killing machine, it was both too real to life and not realistic enough. From the protagonist's perspective it was very single minded, which makes sense because he can't stop making the bad guys pay. But there was too many looks into his mind that shows us that he is just sad and traumatized inside.",
    "54": "Step into a visual marvel with meticulous attention to detail in every frame. Breathtaking landscapes and meticulously designed sets create an immersive experience. The film's innovative cinematography and seamless integration of special effects contribute to its status as a visual masterpiece. Aesthetic choices, from color palettes to shot compositions, elevate it beyond mere storytelling, captivating audiences with a mesmerizing and unforgettable visual feast. The filmmakers strike a delicate balance, presenting nuanced perspectives that challenge preconceptions. Beyond its narrative, the film becomes a catalyst for reflection on the broader implications of the depicted issues, making it a powerful and socially relevant cinematic experience.",
    "55": "The movie for the most part is silent, makes you want to get up and leave. The first 3/4 of the movie is dead, slow boring and not worth the money it cost to see the movie.The last 1/4 of the movie you finally get some action; the action is slow paced. For those of you expecting action like you would find in Taken, John Wick, Jason Bourne or any action packed film do not waste the time or money on the movie; you will be greatly disappointed.Now if you want to see a movie in silence or a movie that will make you understand what a deaf person feels when watching a movie... this movie is for you.",
    "56": "John Woo's Violent, Silent Night is a Bold Experiment That Works. While John Woo's new film, which hits theaters December 1st, has many elements that embody the reasons international action film fans idolize him, it has one character trait that is distinct from other Woo films. In fact, it is unique from all modern, full length movies. That feature is that the film has no dialogue. When I use the phrase \"no dialogue\" it is not hyperbolic to mean limited dialogue. There is, literally, no dialogue, at all.While this bold cinematic experiment could have been disastrous, it was not. In fact, it is critical to the film's appeal. This unique perspective, actually, elevates this film to a higher art form, without ever losing the raw grit and violent, action thrills that are at its core. The film's success lies in the fact that it is so well made, and the acting is so thoughtfully constructed, that the audience never longs for what does not even seem to be missing-spoken words. After viewing this one I had to remind myself that there was no dialogue. That is a tribute to the solid storytelling throughout Silent Night.Joel Kinnaman stars in, and does much of the heavy lifting, in this one. Kinnaman, a relative unknown to American movie audiences, is the fulcrum around which the entire weight of the film rests. His stellar ability to solidly convey to the audience his angst and despair over the murder of his son, and his laser pointed focus in avenging his death without words is what propels the film from an ordinary action film to an extraordinary one. This is a solid performance that happens to be in an action film, and not in spite of it.Catalina Sandino Moreno does an equally powerful job balancing the emotions of being the mother of a murdered son, who can not seem to break through the forcefield which is surrounding her husband's emotional descent. Moreno is the heart of the film, for sure.John Woo is known for his masterful Direction of action sequences. His, The Killer (1989), is considered one of the best action films of the 20th Century. This film builds on his distinguished body of work with jaw dropping vehicular chase scenes, chaotic shootouts, and visceral hand to hand exchanges. These are filmed with magnetic precision, and the elimination of shaky-cam effects, leading to a riveting result.While the film has the traditional martial arts theme of revenge, Kinnaman's lack of the conventional training of John Wick, Taken's Bryan Miller, and Nobody's Hutch Mansell is an asset to the film. His attempt to elevate his physical body and fighting skills to be able to obliterate his enemies is part of the film's brutal realism. This one is extremely violent, but it is all part of the roller coaster ride. He is a man driven by a singular cause, and we feel his pain.The entire supporting cast here does an admirable job of telling their part of the story. They are very good. The villains are, certainly, a little over the top here, but that makes their demise so much more satisfying.Marco Beltrani's musical score is as much a character in the film as any member of the cast. Music in movies is an important element of the storytelling; however, not all scores have the same level of importance. Perhaps, because of the lack of dialogue here, the score is vital and it does its job effectively.The real question on my mind as I left the NYC screening was, \"Like Die Hard, will people be debating whether Silent Night is, actually, a Christmas movie for years to come.\" While I am not sure of the answer to that question, I do know that John Woo's, Silent Night, is a winner. This Lionsgate release is greater than the sum of its parts. It is one of the best action films of the year, and I highly recommend it.",
    "57": "Director John Woo got famous for his fabulous action visuals in the nineties. This picture still looks the part, but that is about the only positive I can find...The bad: the action only starts after 50 minutes. Besides an action packed opening scene of a few minutes nothing happens during the first 50 minutes.Is the action any good then? Well yes and no. As I said, it looks great visually, but the action choreography is a bit lame, because gangsters get shot and stabbed and just keep on figthing as if nothing has even touched them. Pretty lame.More bad: the leading actor hasnt got any charisma. He looks like a dork, a nerd. And although there is supposedly one big and bad crime guy who is the ultimate evil, he aint impressing me either.I hoped for a fun filled action packed gangster movie. It was a dread to watch though...",
    "58": "John Woo makes it look so easy that you pounder why so many people get it wrong. With less than a paragraph being uttered in this movie Woo got to express Action and drama and it was excellent.This movie says something about Joel Kinnaman's skill as an actor perfectly pulling off the role of a grieving father thirsty for revenge without having to use words to tell you that's what's going on.Also tells you something about Kid Cudi's talent as a thespian. He was on point.Very refreshing watching a movie that relies so heavy on visuals after all, I went to see a movie. If i wanted to listen to a story the internet is filled with podcast to do that.Welcome back John Woo!!!",
    "59": "First and foremost, this movie will not be for everyone simply because it is mostly dialogue-free. Truly silent, minus a few bits of radio chatter and music with action sound effects. This is what sets it apart from other revenge flicks, though, and part of the reason why it is fresh, but also a little problematic. It has to get to the action as quickly as it can, but needs to fill the run time, so has a shaky first half, albeit a very rewarding second half.Many movies, especially from the past 10 years, start twenty minutes later than movies used to begin. Character building is lost because we are thrown into the action. For this to truly work, on a quick popcorn movie, the film would have to be just over an hour. Since we are over that theoretical minimum of 90 minutes, there's a chunk of slow-moving scenes at the start. We get hit over the head with the reasoning behind the vengeance, and it's done in a slow, no dialogue way. Once you get past this, then you can settle in for some very good action scenes! Luckily these action scenes are rewarding enough to deal with a frustratingly unlikeable hero and a shallow supporting cast.I could definitely see rewatching this, but only for the practical action that is very well directed. Some people may not get far enough into the movie appreciate some John Woo thrills, but if you give it 30 minutes (or chapter skips), then it's very worth your time.",
    "60": "I saw this movie for free and still wish I had not.Every trailer that I saw for this movie alluded to this being an action packed revenge saga. However, you get a taste of action within the first 7 minutes or so and then you have to wait approximately 60 minutes for your next dose and even then, during the last half-hour, you get maybe 15 minutes of action. So, out of 104 minutes you get 22 minutes of action.I do not like being lied to about the type of movie I am going to see and you probably would not like that either so I am trying to help you out here. What I would like to see is this movies gross drop off of a clip next weekend because of their deceptive practices.The soundtrack was garbage and forgetable (those songs I do remember were trash and those I don't ... well I guess I forgot).You want to know what else is forgetable? The antagonist. The detective. The wife. The son. Heck, this whole film is forgetable.",
    "61": "John Woo is a filmmaker I admittedly haven't seen a tonne of work from, but he undeniably has a vision for action sequences. That is what he is known for and he has stuck to that throughout most of his career in the business. Face/Off and Hard Boiled are awesome action films, so if I ever get the chance, I'll check out his latest. Well, Silent Night is his latest American effort and I must say, he hasn't lost his touch with action. With that said though, it was just okay overall. It has a lot of promise and some great ideas, but something bogged it down for me. Here are my thoughts.After a gang accidentally kills the son of a couple just trying to live a happy life, the husband, Godlock (Joel Kinnaman) decides to go after them. He ends up shot in the neck, preventing him from ever speaking a word again. His mission then becomes to train his body to take on this gang and kill them all. The unique aspect of this film is the fact that it is told entirely without dialogue. Not a single one of the characters speaks one word. I enjoyed that aspect, but I do wish it was utilized more than just having nobody speak. Nothing was interesting past the point of just not having him talk. It was clear that Woo just wanted to focus on the action and that was worth the price of admission.There wasn't a lot of originality in terms of the action set pieces, but it was all very well-choreographed. From a standout fight that takes place in a house, to a great stairwell scene, the action held my attention. With that said, the good aspects of this film are bogged down by the sappy nature of the backstory. The way his past with his child is presented is kind of cheesy at first and there is a specific moment towards the end of the film that almost made me chuckle when it was clear the film was trying to be very emotional. The schmaltz of it all overtook the film and ruined a few moments.Joel Kinnaman is an actor I like very much and his performance here is quite solid, but I'm not sure he was given enough to do, other than either be incredibly angry or sad. It's a very thin story and screenplay and the final product shows that. Still, if you enjoy action, there is enough here to satisfy viewers. The absent dialogue is a great idea, but this type of film needed some in my opinion. Silent Night is a little too cheesy at times, but I still think it's worth a watch if you are already interested. Now playing in theatres, there are worse options to watch than this one.",
    "62": "Silent Night is a new action film directed by John Woo, director of Broken Arrow and Face/Off.When a father (Joel Kinnaman) and his son accidentally become victims of a criminal gang shooting on Christmas Eve, the son is affected. The father goes after the criminals, but is also shot and his vocal cords are activated.He can no longer talk, but he wants revenge. So he begins to train himself to take impossible Christmas revenge on the gang members who took his son and his voice away.With Silent Night, John Woo makes a directorial comeback after 20 years, because he has no longer controlled American action films since his 2003 film Paycheck. John Woo has often made his private action films unique in special ways. He now tries to do the same again by using almost no real dialogue in this film, apart from some background dialogue from music and news radio.Joel Kinnaman has to work more with facial expressions and body postures to act. He does this well, but if there had been a little more dialogue at the beginning of the film, the story could have been a bit clearer. Due to the lack of speech, the film can sometimes remain unclear. Catalina Sandino Moreno plays his wife and mother of the child who died. She knows how to portray a good, supporting role. Unfortunately, she fades into the background halfway through the film, during the father's revenge campaign. Kid Cudi plays a cop in the film who tries to investigate the attack on the father and son, but he still comes across as more in another film. If they had left his character out of the movie, the movie could have been a bit shorter and clearer.The story remains a standard revenge action film, in which characters, for personal reasons, want to take revenge on people who have harmed or taken something away from them. This film is somewhat reminiscent of John Wick's Deadpool, only with less humor or similar action.There are entertaining action scenes in this film, but unfortunately they are not that special and not at all for a Jon Woo action comeback. The action scenes do have some creative moments with good visual effects. Unfortunately, not all of the effects even look significant. Some explosions seem less realistic. The blood that characters get during the action scenes also sometimes looks more like fake CGI blood than it looks real.",
    "63": "Can you make an awesome Gun-Fu flick but have nobody talk? Absolutely. And who else to do it but the legendary Hong Kong Action Guru John Woo. I went into the film blind, and oddly enough I had watched John Woo's magnum opus, Hard Boiled, for the millionth time about a week ago and while thematically, it is significantly different, I still liked it. I grew up as a child watching the relentless Hong Kong classics on VHS in the 90's, and while some may soon be saying it didn't reach those heights. I don't think it was supposed to it.This was a quite interesting experiment of combining character study and an explosive Gun-Fu action flick. I must say, it worked much better than I anticipated it would. This was a wholly unique movie in a sea of the same old boring action movies (insert 500 movies in the last 5 years). In fact, the trailers before the film were literally the stale Jason Statham, solo action hero BS that this film amazing breaks free from to provide a fun and special experience. The action was not quite Hard Boiled extremes, but it was well choreographed. The acting was good enough to convey a story with no words. Thumbs up, fun movie for a change, the movie landscape seems to be changing.People should also remember how frequently John Woo has commented on many of things I have a feeling younger folks, or folks new to his work, will soon complain about. He acknowledges that nobody reloads their weapons because it \"interrupts the flow of the action\", the enemy couldn't hit water if they fell out of a boat (people shooting 2 feet away from each other and hitting nothing). There needs to be a suspension of disbelief for Woo films, and there have been for decades, just relax, and enjoy the violence.While I am getting sick of CGI car accidents (I saw that in another different movie very recently but can't remember), and the digital blood and wish there would be a return to the classic use of practical effects. I miss the 90's and all its paper/debris flying, squib orgies, and people actually hitting each other. But this film does have the classic practical effects to a large degree and while the digital effects would be my only complaint. I REALLY liked this and would recommend.",
    "64": "A drive-by shooting just before christmas, ends up with Brian losing his son and even getting shot in his throat, losing his voice. It becomes yet another open case, with the gang remaining untouched. Surviving the ordeal, takes a toll on Brian and Saya, as he gets distant from her by drinking and sulking over the loss. Soon, he realizes that seeking revenge is the way to honour his son and starts training as well as researching about the gang. He marks the date, exactly 1 year from the incident, to kill them all. How Brian succeeds in executing his mission forms the explosive final act.John Woo is finally back to Hollywood and it was indeed a fun comeback. The entire gimmick behind minimal dialogues, none for Brian as well as the baddies works for an extent to make the treatment unique. The narrative is as predictable as it can get and it's a straight forward revenge story. There is no action during the first and second act, completely focusing on grieving and prepping to exact the revenge. It is the final act that thoroughly pays off with non stop action. Though the film doesn't have anything to standout wrt writing, John Woo makes up for it with his direction.",
    "65": "Hated this film, most tedious action movie ever. It oversells the opening credits death of his son. While I understand it's the crux of the motivation, we get 30 minutes of his suffering before he decides to do a thing. Feels emotionally manipulative, wringing every last drop of milk from the tragedy to the point where it can't be called a fun action film in the least. The entire film is dialogue free, which works for him since he loses his voice, but becomes a big, dumb gimmick as every character in the film is given an excuse not to speak. One is gagged, one cries and texts the entire film, one is simply quiet and stoic and the rest grunt and groan to fill the gaping void. So finally, after a long cliched montage of him body building and gun training (and why he needs to be extra ripped I don't understand, but I'll buy it). He has a year to plan the perfect revenge and what does he do? Drives up, makes a lot of noise, makes every mistake imaginable & is constantly getting beat up and luck saves him every single time. Bad guys aim for his bullet proof vest over and over again, they give him long cool looks instead of just shooting him as he loudly makes himself an eye sore in every situation, never using even the smallest amount of stealth. He decides not to shoot a woman who just unambiguously just shot at him to kill him, which obviously doesn't go well for him. He tells the bad guys he's coming for him and is surprised that they best him. The lead bad guy decides to dance with his girl for like 10 minutes in slow motion as he is killing all his guys in what is possibly the most over decorated art direction ever in a movie... his lair looks like a groovy Los Angeles art installation or something meow wolf would dream up, hardly a gang member's decorating style. He sees his son in things and plays with his toys over and over stopping the action in its tracks. And finally, why are all the gang members cliches from 1990's movies? Why are they squatting and squaring off in abandoned ruins of buildings? Don't they have anywhere better to be? This movie was a boring, ridiculous, mess. John Woo tried his best to make it interesting visually, but the hyper style that worked in films like Face/Off never stops and makes it feel even more dramatically over the top.",
    "66": "\"Not even a peep, action speaks louder than words, this ends tonight\"-- this is a silent movie with a musical track and sound effects like the old black and white movies, there is no dialogue, no subtitles and no dilogue words Hybrid bottomless pit of grief / John Wick killing Machine Film Subtle Grotesque off kilter Action Drama. A Must See for Film Aficionados Artisans, An A+ Awesome Filmmaker's Film! Raw and Ripe and Vicious!Happy and Gritty Urban Suburban planets collide in the streety, alley way, white picket universe Indicated by Cinemetographer Sharone Meir with depressed grief turned into hardcore revenge rage. Soundless crying culminating in Explosive warzones The \"1st Act\" The silence accentuates all those grief moments in between where there are no words, the helplessness of being inconsolable, a starving hungry quiet that nothing can fill\nThe \"2nd Act\" the overpowering berserk brutal savagery and violence is off the chain craziness. The main actors solidly pull off exactly what they need to escalate the narrative: Joel Kinnaman - average every day bloke; Harold Torres - lickety split fire; Catalina Sandino Moreno - searching empathyDirector John Woo updated version -- was inspired by the also silent 1956 Best Original Screenplay Academy Award short film \"Le Ballon Rouge\" = The Red Balloon by Albert Lamourisse a comedydrama -- demonstrates his skillfullness prowess in portraying the sublime to the rabid. Written by Robert Archer Lynn whose task was a psychological feat to show rational and irrational violence and aggression are inspired and innate in humans. Beautiful done. Speechless. Music by Marco Beltrami paces through segues to full orchestration thumping. Finally, if you can sit through \"suck-all-the-air-out-of-the-room\" grief AND gory strong bloody violent combat, only then you will enjoy this film and in real life you're a reliable human, if you can't tolerate either? Just skip this film. You need both sides of the brain and heart hardware/software to understand the polarities.People's main negative about a film called silent night....is that there is no talking,,, the trailer makes it very clear what this action epicness is. And it is awesome, now if you went in expecting a dang Tyler perry drama Plat, you will be disappointed, but otherwise you should love it, john wick fell into John woo's grieving father's revenge story script. And it works very well. Reminds me a lot of crank as well, another franchise that deserved a sequel. Hopefully people support it so maybe we can get more like it. I love we are getting more holiday themed movie's that are not just corny comedys or dramas that you forget as soon as your done watching it, never to be watched again, but movie's like this, the recent Thanksgiving, krampus, and further back trick r treat, are awesome holiday movie's that can be watched over and over. Speaking of sequels, those last 2 definitely need them.Brilliant movie and like nothing I've ever experienced. Action scenes were spot on and the emotion was strong without any dialogue. Great work by John Woo and the incredible actors.6/5 making things accurate.11/10 this is what you should have done.",
    "67": "I respect John Woo's decision to try to make a film with no dialog and the story to be expressed through his imagery rather than a script. The problem is, however, that his imagery is not strong enough to hold my attention for as long as the film demanded, and the film's plot was also paper thin.A lot of scenes come off as awkward, and unnatural because the characters should be talking, but for some inexplicable reason are not. I was starting to wonder if I had missed a scene where everybody gets shot in the neck, and not just the main character? It was ridiculous! Even when the wife is grieving with him and he goes all insane, throwing things and raging, she just stares at him and says nothing. Same with Kid Cudi's character. A lot of his screentime is just him staring at some photos or into a room without saying anything. Made the film almost unbearable to watch.The plot itself was ripped right out of Death Sentence, which was also a ripoff of Death Wish. I'm thinking Hollywood needs either better ideas, or better filmmakers. I don't mind a reused idea, but reuse it with purpose, to expand or better the previous product. Neither happened here.I also want to touch on how cheap the film looked. I'm not sure what the budget was, but surely they could have done better than this. The vast majority of the film is shot frenetically, so it's hard to see the action most of the time. It's also shot in some pretty low light, also making it difficult to see anything. The cinematography is what should draw people into this movie, considering that it probably didn't even have a script, and they couldn't even pull that off.Overall, this film is a mess and a shame. Such a simple premise and you make one of the most boring and irritating action films I think I've ever seen. I'm going to rewatch Face/Off to make me forget this film ever happened.0.5 shots in the neck out of 5.",
    "68": "As a John Woo fan I really thought this was going to be his comeback. The concept was so cool, and the trailer looked so good. I genuinely felt like this had so much potential and I was so excited to see it realized. I kept imagine how intense sequences of pure action must be without any interruption of dialogue. I kept imagining the unique focus on the visuals and sounds to replace the work of the dialogue. Mr. Robot pulled off a thrilling episode with no dialogue, so surely this movie could've too. Truly there was so much that could've been done and this would've been a classic. Unfortunately that trailer literally showed the best moments, and not much was done with the concept.All they really had to do was follow the John Wick blueprint but focus more on the visual storytelling and give it a unique angle with the mute protagonist on top of the lack of dialogue that could've made this movie so much more tense. Unfortunately, the lack of dialogue detracts from the characterization and feels forced in many scenes. I feel like there could've been a lot more done with the protagonist who's very well performed, but not well written. I question his willingness to go on shooting sprees when his son was killed by a stray bullet. There is nothing really done with the protagonist suddenly becoming mute, and the drama with his wife has no real development. The mandatory set up for the emotional beats to hit are executed in such a boring and cliche way and takes up what feels like half the film. Every scene with the son felt so repetitive, and like it was begging you to care with the music, but I really didn't. It almost became cheesy, especially at the end. There's this cop character that's just... there, I guess. There's no personality given to the villains except it keeps cutting to the main villain drugging and shagging this random girl...When we finally get to the action John Woo does deliver, but it's not his best work, and doesn't redeem such a thin story. There's moments of Woo's brilliance shining through what are mostly just pretty good action sequences by today's standards. A lot of the car scenes weren't the best either. The action has its moments and the visuals are often cool, but even then there are some odd directorial choices like overuse of slow-mo and some odd editing choices. I always just felt like there's this great action scene coming, and some parts were, but other parts were off. What's worse is that much of the action feels completely unbelievable and just dumb with the protagonist, of course, getting along through luck and pure incompetence from the villains. The last 2 confrontations in this movie are what really tanked it for me to call it bad. It's just plain ridiculous and unsatisfying how they unfold. Genuinely feels like some AI choreography, unreal, and it's so stupid character wise.With all this being said I still mostly enjoyed the movie thanks to some good action and visuals, but I felt like it was more due to the goodwill I have for John Woo, like I owe him for his older awesome films. This was overall a disappointing film and such a waste of the concept. I hope someone else tries something like this again and does better. I don't want to be too hard on Mr. Woo though. Please John Woo, you are better than this, and we still love you!(4/10)",
    "69": "LIKES:Fast Paced Mostly:\n-The movie does little to doctor up the story, instead jumping into the meat of what this movie is about: Revenge Self Induced.-The movie gets to the three stages rapidly, trying to pack the most of the adrenaline into the 100 minutes and do it with the splendor Woo likes to bring.-And if that's what you want... this is an A+, as the pace gives you enough to piece things together, without getting stuck in the meander of stuffy dialogue and clich moments.The Emotion\n-Despite saying little to no words, Silent Night conveys the turmoil of loss extraordinarily well and the emotions of anger and seeking self-justice.-Each scene has this amazing etiquette to it, the angles of the shot, the music/sound editing, and the conveyance of the facial expression speak it all\n-And as the night proceeds, the movie only further helps with that purging, watching as each blast starts to convey a different set of character meets that just tell a narrative that has some heft to it.-And some of the shots for nonviolent handling, powerful works of cinema that do so little to do so much.Camerawork:\n-I've already said it makes good of the emotion, but there is some other props to the work of our camera team accomplished with this film.-For one thing, it has a great visual element, this art that is very abstract, but yet direct, twisting it to being just that odd element that works to tell the narrative.-Training montages hold more than the 80s machoism, but hold fervor and character willpower. Build up to piecing together the plan holds Oceans like quality, but yet is simplistic and the visuals giving you that thousand word approach for efficiency.-And once the action starts, I can say it hits just about every box in terms of action, kills, carnage, and that justice driven shot that sums things up so well. All with stable camera work to give you the experience without the mess.The Action:\n-It's big, it's bold, it's bloody, and it's the promise of the trailers.-Silent Night has moments that again show how a good director makes those moments that make you say expletives or at least oh Wow.-Gun play, knife work, and some fisticuffs fly as the savagery of the movie unleashes into a fight that has edge, dynamics, and stakes that are exciting to see. Fun moves that blend modern day with video game style moves, a sort of gang busting cowboy at times.-Combined with that emotional cinematography, it helps elevate the fight past the usual bland punches that most action movies take when they aren't action.-Fantastic and the heart of the movie, Silent Night's third act is exactly the climactic experience you want to the buildup that this movie was designing. Loved it.-And even more impressive, is that unlike some action heroes, you take damage you keep it, only further adding that realistic measure to give a little more excitement to the film.-It misses few beats, and the character tale through the violence... works on some level that pulls it all together.DISLIKES:The Story Is Meh\n-There is emotion, and there is relevance, but that's about all this simplistic tale has to go for it.-Where John Wick accomplishes this to a better degree, Silent Night is more of a visual direction story to live through with little thought, which may work for those wanting adrenaline.-Yet the directions they chose in the beginning could have used a little more, some engaging characters, some discussions, something to help add that spark for inclusion.-Fortunately the action helps distract from this but still there was more that could have been done for me.The opening is a tad slow and repetitive:\n-You'll get the vision of grief, remorse, and trauma, but perhaps a tad too much for my liking.-Seeing these moments of mourning start out fine, but they get very lengthy, see it happen a lot for nearly one hour and at times get a tad creepy.-Again, it's a bold artistic statement, but this added a lot of bloating at the beginning, and could have been done a little less time manner to improve in my ability.-Or you know integrated in a manner that didn't get too odd or distracting.Character Integration:\n-It's really a story about the silent protagonist alone, and that works, but for the fact of integrating Kid Cudi into the mix and modeling him a key player\n-Silent Night kind of stinks in terms of building up most of the characters, suing only the attitude, the shots, and some simple story elements to make it work. You have little attachment to them, even the mom and that was a shame given the potential.-It could have used more planning and magic, but again, for most it won't be an issue when you are in the midst of gun play.The Violence:\n-Another warning than dislike, the violence is again to the level where sensitive beings need to stay away.-It's gory and realistic, gun shots and knife wounds deep and close up to unleash the true injury that comes with it.-Sure, there is excitement, but its vicious, paints the walls with red saturation, and can be very disturbing if you aren't prepared.-A tad excessive? Yeah, near the end especially, but still within reason for most members going to see this film.THE VERDICT:\n-Silent Night is pretty much a unique twist on a Christmas action film, that holds Woo's style with cinema making and the typical adrenaline fuel of the genre. A pace that is quick, this movie uses the bare minimum to tell the story and get into the motivational montages of fighting and training to get you into the film. It's simplicity is both genius and limiting, but for the most part this action film is ready to unleash madness with strong visuals, great choreography, and a realistic edge that helps keeps things engaging. Such fight scenes prove the right directors can still make good pieces in terms of action stunts, fighting, and the splendor that they can be. However, the movie lacks a fleshed out story, it lacks character usage, and is really just a spectacle of violence that though fulfilling is not the most engaging piece to come to mind. I had fun with it, but there are still better pieces that balance both story and the flair of action. It certainly delivers on the element of the trailers, but again caution to those sensitive to violence and trauma being repeated a tad too much. Thus, my scores are:Action: 7.5-8.0\nMovie overall: 6.0.",
    "70": "\"Kill them all.\" Brian (Joel Kinneman)John Woo's reputation for stylized violence is well deserved if only for his new revenge thriller, Silent Night. His slow motion mixed with a nervously moving camera, piercing closeups, stunning wounds, and imaginative car chases that seem real are just a few of his signature shots. His Cantonese hits like The Killer and Hard Boiled established him as an auteur of blood violence par excellence. That he is not reluctant to be sentimental gives most of his thrillers an extra measure of charm in the presence of mayhem.Woo's Hollywood masterpieces like Face /Off and Mission Impossible II remind his devotees how 20 years have not diminished his ability to carry off astonishing stunts and car chases better than Steve McQueen's. His bird motif, which he has used before with white doves, adds an artistic flare not usual with bloodbaths.In this new thriller with almost no dialogue (maybe 10 swear words is all I could hear), Woo outstrips Wick and Equalizer for profound anger with a need for revenge propelling Brian ( Joel Kinnaman), shot in the throat by a gang that killed his son (Anthony Giulietti), is now a mute father who has lost his only child to that stray gangland bullet. \"Kill them all\" he writes on his calendar for the next anniversary, Christmas Eve.Neither he nor Woo needs words; the silence is bracing and ominous, and I'm a word guy with an insatiable appetite for good dialogue-- not needed here. His pans smoothly bring back a happy family life, sequences that even I welcomed in place of sentimental word tripe too often softening traditional revenge films.Woo is smart enough to enlist our sympathy with a child born to melt the audience and a wife/mother (Catalina Sandino Moreno) so engaging and loving as to make the body count (less than Wick but more than Equalizer) seem acceptable and desirable. Words? Not needed.Few other revenge films have such a hard-nosed ending as well. Woo courts the dismay of fellow violent filmmakers by engaging our sympathy for the bereaved parents and nothing for any of the villains, even a young woman wielding a machine gun.Although David Fincher's recent The Killer shows how intense-but- minimalist action can be powerful, Woo wins the revenge race with barely a word.",
    "71": "Whoever they had put the trailer together for this movie is who they should had make this movie because the trailer is way more interesting.This movie is a huge disappointment from beginning to end. Nothing in this movie makes sense and nobody talks at all in this movie.The movie starts off strong but immediately looses steam after the first 10 minutes. For the next 30-40 minutes the main character walks around the house drinking all day and looking up fighting videos on YouTube so that he can train to take on all the baddies.The next half of the movie is just straight up stupid action sequences that make no sense and are so sloppy. I wanted to like them and I really tried but the first half of the movie drained everything from me out of pure boredom that I could not get back in it.The ending of the movie is also pathetic and just mind blowing how a legendary director put this out.Just save your money and stay far away from this movie. Watch Violent Night instead if you want a good anti holiday action movie.I saw this movie for free and it still was not even worth it.",
    "72": "During Christmas, family man Brian Godlock (Joel Kinnaman) loses his son Taylor (Anthony Giulietti) as the result of stray gunfire during a gang war. Brian is left mute when gang leader Playa (Harold Torres) shoots him in the throat when Brian tries to confront them very much leaving him as he and his wife Soya (Catalina Sandino Morena) struggle to continue on in the wake of the tragedy. Eventually Brian spends the intervening months training and planning to take down the entire gang on Christmas Eve.Silent Night is the new action film from Hong Kong director John Woo and marks the director's first Western produced action film since 2003's Paycheck with Woo primarily focused on Wuxia films and historical epics in the intervening years (save for the exception of 2017's Manhunt). Produced entirely without dialogue and featuring a more serious take on the material than Woo is traditionally known for, Silent Night won't quite be the revisit to the Woo style of action that fans know from A Better Tomorrow 1+2, Hardboiled, or Face/Off, but as a technical exercise it's exhilarating and well made.To start off, Silent Night is undeniably impressive as an exercise in pure visual storytelling. While Silent Night's premise and script feature many of the hallmarks of the tried-and-true vigilante subgenre of action films, the style and craft that comes from conveying the story and emotions through pantomime is brutally effective and much of the credit can be placed on Joel Kinnaman whose performance is as painful as it is intense. Despite being an action film, Silent Night takes its time before we action begin the action proper and the first 40 minutes or so are mostly focused on Brian's breakdown that eventually leads to him rebuilding himself into a single-minded vehicle of vengeance. Silent Night has the distinction of featuring one of the best training/planning montages I can recall of recent memory and it's elevated by Joel Kinnaman's performance who radiates an intense energy that becomes terrifying in some cases. Once we get to the action, it's as brutal as it is well-staged as Woo plays off the fact Brian isn't trained in combat and there's quite a few times where he stumbles and makes mistakes and when the punches, shots, or stabs impact you feel them. Admittedly some parts of the movie could've been refined as despite Woo playing the material more grounded in comparison to his past work, some of Brian's flashback sequences are so over the top in how they're portrayed they feel like they'd be more at home in something like Face/Off rather than this more gritty film. The movie also features Scott Mescudi (aka Kid Cudi) as Detective Dennis Vassel and I didn't really understand why he was in the movie as he doesn't really serve much purpose except to showcase Woo's trademark \"duel wielding pistols\" that feels really out of place and like it was put in more as fan service than for any legitimate reason.Silent Night certainly delivers on brutally violent action spectacle with a heathy dosage of holiday iconography, but if you're expecting a traditional John Woo movie with an ironic Holiday backdrop you're not going to get that so clear your expectations of any comparisons to Hardboiled or Face/Off levels of over the top. If however you're looking for a solidly brutal and well-acted revenge thriller with well-staged action: here it is!",
    "73": "Well, I do like what John Woo did different by making an action movie with ZERO dialogue and nice cinemtography, this movie was awful. I am not someone who expects movies to be realistic. Because lets face it, if that were true, I would never see 99% of the movies that have been made. My mom will tell you i usually like bad movies. But i still feel that main plot points of a movie need to make some sense. And I just found too many things in this movie that didn't.First, I will start off with the fact that these career gang members have the accuracy of a two-year-old with a Nerf gun. In the beginning of the film, there is a scene, that you can see in the trailer, that involves two rival gangs driving in cars and shooting at each other. Despite the fact that these cars are within 2 feet of each other and all of these big bad guys have automatic weapons, neither side hits each other for miles. Then, in the last act of the movie that is the big shootout in the building, again that you can see in the movie's trailer, these lifetime criminals run up on the guy and don't get a bullet off before this homebody dad shoots them? You have got to be kidding me! Harry Potter had better accuracy in \"Guns Akimbo\".My other problem is with the main character himself. The movie plays up how he spends nine months preparing to exact revenge and kill all the gang members with fight training from youtube, target practice and working out. Yet the first fight he gets in he gets his ass kicked horribly. If I were him, I would get all the money back I paid for the gun club because the training did absolutely nothing. The only reason he can kill any of them is because the gang members have the accuracy of a magic eight ball. Joel is a scrawny dad and yet this tough gang can't kill him? He's not John Wick. And the only thing that has been on his mind all this time is revenge. How come whenever he killed somebody he looked upset about it?Lastly, while I do get that emotion plays a big part in this movie because there is no dialogue, those scenes were repetitive and very long. Half of them were unnecessary and just a drag.The plot line to this movie is not unique at all. In fact, it was like a Tubi version of Death Wish, The Punisher, Death Sentence, etc.. That combined with the ridiculous so-called gang members is why I dislike and was very disappointed in this film.",
    "74": "No dialogue in the movie. This is somewhat cool and unique at first. Until it constantly hits you over the head and becomes awkward. I think dialogue would have elevated this movie. The wife, the detective, random strangers interacting Joel Kinnaman through words. Instead it is 'clever' shortcuts and text messages that fill the void of talking.The action is great. The standard underdog to hero journey.The beginning where the backstory gets established drags on a bit. And by bit I mean for a good chunk of the movie. Given that the film is nicely edited and using clever stand-ins instead of dialogue, I'm surprised they go with a heavy layer of backstory exposition for a huge chapter of the movie. That being said, it is not bad the execution.The law enforcement in this movie , let's just say you will have to suspend disbelief.The Christmas theme is a bit ridiculous in hindsight and doesn't really make sense. But in terms of shoehorning an action flick just in time for Christmas it seems to make sense.Joel Kinnaman is a fantastic actor, and is fun to watch.The second half reminded me of Dredd 2012. With all its bullets flying, seeking for justice, and ultimate conclusion.Overall I'd say give it a watch, it's not a bad movie for 2023. And it has the balls to do something different which one has to commend.",
    "75": "Or maybe it isn't? No pun intended - and sort of the only dialog of the movie too. Only one spoken directly by one of the main characters that is. It is a bit weird to have everyone mostly staring and expressing every emotion by ... well way of looks.That said, John Woo wanted it that way and this movie really asks you to suspend your disbelief! It is not just the missing dialog (it is not a silent movie - it is anything but that - effects wise), but what happens .. as in the action and stunt department. How our \"hero\" acts and reacts to things.You are not supposed to hold it against him - don't try this at home of course. And while this is a tour de Force for Joel, you may wonder about the female role (his wife) in this. Not much to do - she does her best with the little she is supposed to be doing.The action is amazing (Woo adding car stunts to his vita - I reckon he hired a really good person for this - an expert so to speak). It's been a while since I saw a Woo movie - I remember there being melodrama involved. And after an action heavy beginning, we do slow down and have half an hour or more of ... well story time. Bit of time hopping (what happened before and all that) ... something that even though the actors try their best, might be the weak spot of the movie. Yes it is needed for motivational purposes and planting, seeding and all that ... still it may feel way too long.But the reward is around the corner ... in form of some very fine action scenes. Of course you cannot be squeamish! The movie has a high amount of violence and a lot of blood on display. Not Woos best, but a welcome back of sorts ... if you are into that form of thing ... some comical (accidental?) moments included ...",
    "76": "I think people will either love or hate the concept of no dialogue. I personally loved it. It's one of the more unique action movies I've seen in recent years. If it had dialogue, it wouldn't have been as memorable. The story is told visually, through strong acting, a fitting musical score and of course the impactful and violent action and John Woo's expert direction.The acting from Joel Kinnaman is top notch. He really conveys a lot of emotion with his scenes with out saying a word and you really feel for his character and the pain he is going through. The direction from John Woo is amazing, he proves why he is one of the best action directors of all time. The action is violent, and hard hitting and expertly crafted and shot. Story is simple and straightforward , something you've seen so many times in an action movie, which is why the no dialogue makes it unique.Overall, a future cult and Christmas action classic. One of the best of 2023 and will go down as one of the best in this decade. A unique, artful and surprisingly emotional and high impact action movie. A must watch for fans and glad I watched it in cinema.7.5/10.",
    "77": "Makes you realize just how economically John Wick used its runtime: about two-thirds of this is preparing for the action, then getting to the action and being slightly disappointed by it. Don't get me wrong, it still outshines a lot of its contemporaries - but that's a low bar to clear. The viscerality is there, but it's no The Raid; the vehicle combat is no Fury Road; the stairway oner is no Atomic Blonde; and I could keep going. Forgive the comparative nature of the analysis, but this does nothing we haven't seen before (outside of the dialogueless gimmick that frankly was a terrible decision) which would be fine if the supposed 'master of action' actually lived up to his name here. I have yet to properly dive into Woo's filmography, so I hope Silent Night ends up a stain on an otherwise perfectly clean blanket.Cherry on top is the conservative fantasy of a man going on his sigma male grind, thereby losing any meaningful human connection, but ultimately it's all worth it because he went on a rampage against a bunch of gang members. Felt very sad indeed when they played stock sound effects of a kid laughing during all the flashbacks.",
    "78": "John Woo is a great director of action and he proves that with Silent Night. Fists and bullets fly all over the place in this picture. On top of that the film cleverly operates almost like a silent movie. The only voices heard are on radios or TV, there is no dialogue. This conceit is pulled off effortlessly.But with that all said, I still found this movie to be tedious. Maybe it's my old age speaking but the days when I can watch a film where one man can shoot dozen upon dozen of people while they some how manage to miss him are over. Every first shot this man makes hits his target but almost every bit of returned fire manages to go nowhere near him. Add to this our hero knowing where to put up surveillance for LA' s Most Wanted but for some reason the cops don't is too stupid by half.Speaking of the bad guys, while I admit I'm no expert on street gangs I'm going to guess that when they doing their illegal business in their HQ it's not with the windows wide open where anybody can look in.This is a stupid movie. But hey, sometimes, a stupid movie can be fun. But for me, Silent Night was not fun.",
    "79": "If you like to watch a leading actor suck at acting, even with no dialogue, but a film packed full of gratuitous and good action sequences, this is the movie for you! Cliche from beginning to end, felt like I've seen it before.. it's John Wick lite.. lead actor couldn't even act without dialogue.. Woo needs to change his position to stunt coordinator and not director..Dad's son dies, dad immediately tries to avenge son, dad gets his ass handed to him, dad lands in hospital for a lengthy visit. Wife/ mom supports, works, even while grieving and when husband wakes from his vengeance coma he becomes a short lived alcoholic and then trains via YouTube to be a gang exterminator. Wife leaves dad.. she needs to live life and work to take care of herself... Dad doesn't work the whole year leading up to his vengeance day.. he single-handedly brings a whole gang down because the local gang task force seems to only have one person working for said task force.. was this suppose to be comedy also? This disjointed storyline lasted 104 minutes but could have been told in a short 20-30 minute short. This was an action filled turd of a movie.",
    "80": "The plot heavily reminds me of Peppermint, where a woman basically did the same stuff. Family gets killed, police don't do anything, she disappears off to train herself then comes back to go on an insane killing spree. It's literally the plot. Gangs were even Latino.The action scenes were overdramatized so that was fun. However, I wish they got shot more often, there was stormtrooper aiming going on. But fights get better later on. I loved how bloody it was yet it wasn't gruesome enough to make you uncomfortable unless you're squeamish.The movie does go out of its way to spend time building this would and showcasing how much gang related stuff is going on. I kinda loved that no word was spoken for a good chunk of the start. There were some small issues, like why'd you leave your car unlocked, windows down in a neighborhood with high crime?Loved that the fights seemed real later on, the hand to hand combat scenes better than the shoot outs at the start. The movie starts out slow, but it's building up to what you'd anticipate is an action packed third act. And my god is it worth the wait, kinda. I wasn't entirely blown away, still felt like it took too long to get there. And the fact that it's a Peppermint(2018) copycat didn't impress me so much.",
    "81": "I would start describing this movie as a no-frills, action packed, fun to watch production. Silent Night is a well put together movie, the one that delivers on his promise: brain switch to off, engagement switch to on. Our hero is , as the title suggests (but you only really realize it after you saw the movie) silent after the inciting incident. Yet , through a very basic plot, good acting and a well written script, you are still fully able to grasp his evolution, motivation and anger, an anger so profound it ends up further complicating the life of our protagonist who, however, is deeply determined to take revenge over the unjust loss of his young child.The movie follows pretty much a very basic three act story structure, with act one and two (the loss of his child, his sense of helplesness and newfound motivation and preparation) taking about half the runtime (to exactly the point where you start craving for some action) and the remaining half of the movie is gun blazing action that leaves you oddly satisfied.Photography is good, not reaching the levels of John Wick 4 but nonetheless enjoyable. Stunts are well executed if not a little too unrealistic at times, but nothing you cannot easily go over considering the type of film. Action sequence are not as precise and well choreographed as John Wick, but on the other hand the story, despite being very easy, lets you get in touch a bit more with the Hero as he has to develop into a killing machine, since he has no specific skills to begin with, which makes for a good moment.If you like this sort of action movie, go see it. I have enjoyed it as it has delivered on his promise: a fun night at the movies with friends.",
    "82": "Painfully stupid, albeit fitting for the time we're living in.I can almost hear the original pitch. This movie has a GIMMICK. Almost no one speaks a word of dialogue through the entire film. Does it work? NOPE. NOT AT ALL. Because film makers believe the audience is incredibly stupid, now more than ever. And without character motivations carefully explained through words all that is left to do is make every single action that appears on screen cartoonish beyond belief. I kid you not, what appears on screen in this film also works as a perfect parody of modern action movies. This film can be hilarious if you choose to view it from that perspective. I laughed out loud a lot.I am giving it 3 stars because it is filmed competently. Visually appealing, well edited, well choreographed action. But without believable situations and characters to care about it all falls flat.And, for the love of all things good, WIND UP MUSIC BOXES MUST BE BANNED FROM CINEMA FROM THIS POINT FORWARD.",
    "83": "Average death wish vibe, been long haven't seen a John woo quite while. Is hard to recommend this one cause it doesn't have that signature gun fu that he started. Since the Wick franchise took flight, most action directors have been struggling to make something new with there stunts.I think John Woo need to go back to the king fu era of motion pictures to get it right, is not anybody fault that the film seem random.Superheroes genre is taking most the mojo of action films, that feel is gonna be extinct.So taBy far the best action ye get for your buck is Netflix\nExtraction 2.Thank you.",
    "84": "Yes! It's been a while, but John Woo is back with a bang. The man still knows how to make an action movie and it shows. This feels good, reminded me of the 80s and 90s action style. The bad guys are basically just there to line up and get taken out. Hard. It looks stylish and violent at the same time.Sure, this flick doesn't bring anything new to the table, we've seen it all before. Many times even. But this one is definitely highly entertaining and above average.One thing though, whithout giving away too much, our main character (very well played by Joel Kinnaman) loses his voice in the beginning of the movie. This could've led to some interesting and tense moments during the movie, but it doesn't. It seems more like an excuse to create a cool, tough and silent \"hero\", which I consider a missed opportunity. How good would it have been if at some stage he desperately needed his voice to rescue someone or even himself from a dire situation, but was unable to produce a single word? None of that though. Like I said; missed opportunity.Nonetheless, I'm more than happy John Woo is back on the scene and hopefully more will follow.If you like action/revenge movies and are looking to be entertained without having to dig too deep into your emotions, definitely give this one a shot. 7 out of 10.",
    "85": "The plot heavily reminds me of Peppermint, where a woman basically did the same stuff. Family gets killed, police don't do anything, she disappears off to train herself then comes back to go on an insane killing spree. It's literally the plot. Gangs were even Latino.The action scenes were overdramatized so that was fun. However, I wish they got shot more often, there was stormtrooper aiming going on. But fights get better later on. I loved how bloody it was yet it wasn't gruesome enough to make you uncomfortable unless you're squeamish.The movie does go out of its way to spend time building this would and showcasing how much gang related stuff is going on. I kinda loved that no word was spoken for a good chunk of the start. There were some small issues, like why'd you leave your car unlocked, windows down in a neighborhood with high crime?Loved that the fights seemed real later on, the hand to hand combat scenes better than the shoot outs at the start. The movie starts out slow, but it's building up to what you'd anticipate is an action packed third act. And my god is it worth the wait, kinda. I wasn't entirely blown away, still felt like it took too long to get there. And the fact that it's a Peppermint(2018) copycat didn't impress me so much.",
    "86": "I would start describing this movie as a no-frills, action packed, fun to watch production. Silent Night is a well put together movie, the one that delivers on his promise: brain switch to off, engagement switch to on. Our hero is , as the title suggests (but you only really realize it after you saw the movie) silent after the inciting incident. Yet , through a very basic plot, good acting and a well written script, you are still fully able to grasp his evolution, motivation and anger, an anger so profound it ends up further complicating the life of our protagonist who, however, is deeply determined to take revenge over the unjust loss of his young child.The movie follows pretty much a very basic three act story structure, with act one and two (the loss of his child, his sense of helplesness and newfound motivation and preparation) taking about half the runtime (to exactly the point where you start craving for some action) and the remaining half of the movie is gun blazing action that leaves you oddly satisfied.Photography is good, not reaching the levels of John Wick 4 but nonetheless enjoyable. Stunts are well executed if not a little too unrealistic at times, but nothing you cannot easily go over considering the type of film. Action sequence are not as precise and well choreographed as John Wick, but on the other hand the story, despite being very easy, lets you get in touch a bit more with the Hero as he has to develop into a killing machine, since he has no specific skills to begin with, which makes for a good moment.If you like this sort of action movie, go see it. I have enjoyed it as it has delivered on his promise: a fun night at the movies with friends.",
    "87": "Painfully stupid, albeit fitting for the time we're living in.I can almost hear the original pitch. This movie has a GIMMICK. Almost no one speaks a word of dialogue through the entire film. Does it work? NOPE. NOT AT ALL. Because film makers believe the audience is incredibly stupid, now more than ever. And without character motivations carefully explained through words all that is left to do is make every single action that appears on screen cartoonish beyond belief. I kid you not, what appears on screen in this film also works as a perfect parody of modern action movies. This film can be hilarious if you choose to view it from that perspective. I laughed out loud a lot.I am giving it 3 stars because it is filmed competently. Visually appealing, well edited, well choreographed action. But without believable situations and characters to care about it all falls flat.And, for the love of all things good, WIND UP MUSIC BOXES MUST BE BANNED FROM CINEMA FROM THIS POINT FORWARD.",
    "88": "Average death wish vibe, been long haven't seen a John woo quite while. Is hard to recommend this one cause it doesn't have that signature gun fu that he started. Since the Wick franchise took flight, most action directors have been struggling to make something new with there stunts.I think John Woo need to go back to the king fu era of motion pictures to get it right, is not anybody fault that the film seem random.Superheroes genre is taking most the mojo of action films, that feel is gonna be extinct.So taBy far the best action ye get for your buck is Netflix\nExtraction 2.Thank you.",
    "89": "Yes! It's been a while, but John Woo is back with a bang. The man still knows how to make an action movie and it shows. This feels good, reminded me of the 80s and 90s action style. The bad guys are basically just there to line up and get taken out. Hard. It looks stylish and violent at the same time.Sure, this flick doesn't bring anything new to the table, we've seen it all before. Many times even. But this one is definitely highly entertaining and above average.One thing though, whithout giving away too much, our main character (very well played by Joel Kinnaman) loses his voice in the beginning of the movie. This could've led to some interesting and tense moments during the movie, but it doesn't. It seems more like an excuse to create a cool, tough and silent \"hero\", which I consider a missed opportunity. How good would it have been if at some stage he desperately needed his voice to rescue someone or even himself from a dire situation, but was unable to produce a single word? None of that though. Like I said; missed opportunity.Nonetheless, I'm more than happy John Woo is back on the scene and hopefully more will follow.If you like action/revenge movies and are looking to be entertained without having to dig too deep into your emotions, definitely give this one a shot. 7 out of 10."
}