{
    "0": "So I was lucky enough to snag some TIFF peoples choice awards tickets and saw a showing of this film and... I have a lot of thoughts. It's an insanely thought provoking movie of the treatment of black stories in Hollywood and in novelizations, but it also talks about the categorization of Black People in the Caucasian perspective. I thought the actual direction and acting were very good throughout the film (not Oscar worthy but good), but i found the actual screenplay to not go as deep as it needed to, nor did it try too hard with the substance when it comes in context to the shapement of Black voices in a Caucasian-driven hollywood. It was a good movie, don't get me wrong- but the two other programs i saw at TIFF i thought were far superior.",
    "1": "This film is absolutely first class, their was a real moment of comedy genius, art of silence at its purest that just hit with perfection. I found myself laughing about this one moment throughout the whole film, through the credits and even on the train home, wile writing this review I am still giggling. This film is both light and dark in the style of Ricky Gervais \"After Life\" which so many films recently are trying to replicate, with little hitting the mark, but American Fiction does, real laugh out loud dark comedy, accompanied with that toe curling awkwardness that will make you squirm in your seats and wish you had a duvet to pull over your eyes. I imagine I will still be laughing about this film for a very long time.",
    "2": "#AmericanFiction was an emotional roller coaster from the very beginning of the movie. So full of laughter to the point where it almost hurt it had so many funny moments! The movie looked interesting from the trailer, but when I saw it last night in a packed theater the laughter was absolutely contagious. It was possibly the best \"theatrical - community\" experiences I've experienced of any movie. Kudos to Cord Jefferson, his producing team and the cast led by Jeffery Wright (the best performance of his career). Don't miss seeing this movie in theaters! You will laugh your ass off, even if you don't get along with youyr family or friends your brought with you.",
    "3": "This was a great watch. The movie is equal parts heartwarming, heartbreaking, surprising, and funny. There are a couple of clever, meta moments that were a real treat. The acting is outstanding. Sterling K Brown in particular was very fun to watch in this role. I loved the little bits of business he incorporated into his scenes like shooting a snot rocket while his brother loads luggage into the car. I think everyone can find something to relate to here, whether it's family drama or thinking about how to be a whole person in a capitalist world that only wants the useful, marketable pieces of us.",
    "4": "Not only did this movie grab me within the first 30 seconds I was drawn by Monk(Jeffery Wright) character as soon as he spoke. The characters are believable. The satire of black literature is put on full display. This movie have real life tosses and turns. It is so relatable so powerfulI. When you watch it you see real struggles everyday families face. From lost of a parent, to financial struggles of a family to take care of loved ones. I watch many movies and never before have I been drawn to a movie wondering what's gonna happen next. Is a life changing movie for me. Thank you AMC for the preview.",
    "5": "I got the chance to watch this movie for a mystery movie and I have to say this was a very funny and heartwarming movie. The relationship between the two brothers was even funnier but the value of family was what I got from this movie. The main character is a riot and you may watch some parts and be like what did they say but you will laugh with this movie. It does not get preachy but it will make you think how some people may view others when it comes to certain movies or shows, let's be honest white people will never understand what it is like to be a black person who is smart and gifted. You need to see this movie.",
    "6": "I was looking forward to this. It's as funny as I anticipated and didn't disappoint. I loved the humor, like the way Issa Rae talked about her book, then proceeding to read it. I remember how much and how often the theatre broke out in laughter.It's a story of a black writer who is tired of society's tend to stereotypes so he writes a crappy novel with intention of purely just trolling, but people eat it up and it becomes a best seller. I think in a way, the movie itself is like that; it tries to divert away from what you'd typically expect from a black story, that sounds weird... from a story based on black characters lol. It reminded me of \"The Photograph (2020),\" an okay romance movie (with Issa Rae too) that I liked because of its portrayal of a love story between two Black individuals, where the essence of romance took center stage instead being overly focused on their race or any associated struggles.Loved how it was directed, the subtle yet not so subtle instances of race even though Thelonious. The social commentary was done really well and did not need to be shoved down your face to be effective. The characters are very easy to get invested in, even the ones that are short lived. I've only seen Jeffery Wright in supporting roles but he really nails his performance as a lead here which was great.It's a film that balances deep emotions with humor, a difficult feat to achieve. Loved how there's a lot going on without the movie feeling overly crowded. It seamlessly combines satire and social commentary with a compelling family drama, and surprisingly, they harmonize flawlessly. Despite not being fast-paced, the film feels tightly packed, dedicating time to explore both themes thoroughly. Moreover, the quick-witted dialogue adds an extra layer of brilliance. Undoubtedly, this stands out as one of my favorite films of the year. The anticipation I had for it was met, and it truly stands as a unique movie.",
    "7": "Cord Jefferson's American Fiction is a satire about an African American novelist who criticizes the industry that restricts Black storytelling to trauma and poverty narratives. The film is a response to the rise of social movements like #BlackLivesMatters and #OscarsSoWhite, which often focus on traumatic violence and provide white liberals with an outlet to empathize with suffering. However, making a movie as a response to industry limitations can limit the movie's intention. Cord Jefferson, a TV writer on Succession and Master of None, delivers a superb feature debut, filled with snappy banter and gags, with a masterful ensemble cast including Jeffrey Wright, Sterling K Brown, and Tracee Ellis Ross. Jefferson adapts Percival Everett's 2001 novel Erasure into a thorny existential character drama about a writer who feels unseen but never makes himself vulnerable enough for people to truly see him. Thelonious \"Monk\" Ellison is the professor who pulls a Bamboozled by cynically writing a novel filled with pandering cliches and tropes about Black struggle that salivating white gatekeepers line up to make it a sensational hit. The success does little to alter Monk's disgruntled and bewildered state.Jefferson's film is wisely critical of Monk and society the author is railing against. There is a strain of self-hate in the character, who is regularly ridiculed for his taste for white wine and white women. Monk copes with micro-aggressions in the office and on the street while insisting in the most blatant self-delusional ways that he doesn't believe in race. When Monk sees a best-selling novel called We's Lives in Da Ghetto celebrated by the literary establishment for its Precious-like storytelling, he attends a panel where the author Sintara Golden, played generously by Issa Rae, is code-switching to entertain her mostly white audience. On a lark, Monk writes his own hood novel under a pseudonym, which would snuggly fit into the 50 Cent movie Get Rich or Die Tryin'. The movie almost gets away from Jefferson during outrageously funny moments, as actors like Adam Brody play up the industry's ignorance and craven exploitation of marginalized voices to the point of parody. The festival audience was howling, likely because few feel implicated in such interactions. \"American Fiction\" is a satire directed by Cord Jefferson, based on Percival Everett's novel, Erasure. The film explores the dilemma of making entertainment that criticizes it, as it can easily fall prey to its own pitfalls. The film is grounded by the family melodrama and warm interactions between Monk and his siblings, allowing the Black characters to escape the world's perception of them. The film follows Thelonious \"Monk\" Ellison, a struggling writer who becomes fed up with \"lesser\" books that pander to white people through stereotypical hood narratives. Monk decides to write a fake book, initially titled \"My Pafology\" and later re-titled the F word,\" which is so stereotyped that it mirrors the corrupt tastes of the white literary establishment. Despite expecting the novel to fail spectacularly, it becomes a raging success, leading to a major book deal and a movie option.",
    "8": "I thought this movie absolutely soared with brilliance up until the last two minutes, when it crashed with a thud. This was a real heartbreaker because up until that ending, I thought I was watching a masterpiece. It reminded me of when I was a kid reading a Superman comic book and being really absorbed in the story, only to find at the end that the whole story was something Lois Lane dreamed after she ate ice cream and pickles. Basically, the story is about a black college professor and novelist whose work is ignored because it isn't \"black\" enough, meaning it's not about drug addicts, pregnant teenagers and racist cops. As a joke he writes the kind of book that publishers want under a pseudonym. The book becomes a smash hit. He'd like to just stop the whole hoax, but his mother is stricken with Alzheimer's and needs round-the-clock care, which is extremely expensive. He needs the money. Up until the dud ending, this is a wry and sly work of social commentary that I thoroughly enjoyed. It's still worth seeing, but could have been so much more. The script is intelligent and compelling (up until that awful ending). Acting, direction, and technical elements are all first rate. Jeffrey Wright as the professor, gives a standout performance in the kind of role we virtually never see in a movie. Also excellent are Leslie Uggams as his mother, Myra Lucretia Taylor as their maid, John Ortiz as his agent, and Erika Alexander as his girlfriend. Actually, the whole cast is great. Because of the ideas involved, I'd say the movie is worth seeing. But be prepared for a disappointing ending.",
    "9": "Rating: 8.6\nOverall, a very good effort in Cord Jefferson's directorial debut as Jeffery Wright's performance and very good comedy writing/direction propel the movie into something very funny yet profound with its social commentary.Very Good Direction (Controls everything very well on a macro and micro scale as he uses comedy and social issues to propel the story forward; gets a lot out of his actors as the comedic moments feel very genuine and the dramatic moments feel very meaningful), Good to Very Good Acting (Great from Jeffrey Wright (Really controls every scene he is in as he plays the line between Comedy and Drama very well (excelling in both areas as he shows off his experience)), Good from Tracee Ellis Ross (Makes an impact with her scenes with Wright as she plays off of him very well to help show the relationship the protagonist has with his family), Good from Issa Rae (Holds her own well as her comedic timing is good and works well at building tension between her and Wright), Good to Very Good from Sterling K. Brown (Has a lot of charisma in his performance as he uses his over-the-top comedic style mixed with dramatic experience to make his presence known in the scenes he is in), Good from the rest of the cast (Everyone does their job well and contributes to providing humorous moments and moving the story forward)), Very Good Story (Uses the source material very well to create a very contemporary story about how far virtue-signaling has gone in today's culture; uses many different story elements to help play both sides of the comedy-drama; Does a good job at building the character of Monk as you can see the conflict he has with career/family/race; the story progresses very well as each element of the plot is built upon till the very end (with the meta-narrative structure playing a big role throughout to mimic how the original novel was written)), Very Good to Great Screenplay (The dialogue is very good as it just feels very natural and helps keep the story interesting; the jokes were very well written as they are appropriate in showing how Monk thinks about the whole experience (with a lot of it coming from the scenes where he is pretending to be the convict); the symbolism is really prevalent as it helps with delivering the message of being against virtue-signaling and pigeon-holding racing into thinking they talk about certain topics; the foreshadowing is very unexpected as it really stems away from the traditional narrative structure to not have that many cliches), Pretty Good Score (Very Jazzy and helps set the personality of the protagonist), Good Cinematography, Good Sound, Good Editing, Plot Structure was well laid out as every element was prevalent and these elements flow between each other; the metanarrative elements do break the plot flow sometimes but in a good way as it helps with showing how the protagonist is really thinking about the situations he is in, Pacing was good as it followed the general pacing of a comedy; the runtime was good as there really was nothing that could have been added or cut, Climax was good as it showed the culmination of how far Monk went with the character (and has some elements that make it not so predictable to enhance the comedy of the moment), Tone was more in line with a comedy than a drama (with the dramatic elements feeling being more lighthearted than that it should've been), Saw a premiere at Austin Film Fest.",
    "10": "I got to see it with AMC screen unseen, and being that it's a mystery movie I didn't know what to expect. It immediately grabbed my attention. The writer sitting on a panel with no crowd while in the next room an author with a book about her \"black experience\" gets all the attention and standing ovation. Later he went into the book store and his fiction novel is under African American studies and not in fiction like the aforementioned author was.After his family has a tragedy, he leans into the genre and writes a novel that isn't like the rest. His publisher is skeptic at best but does agree to send it out, all while he has a budding interest with a neighbor who has actually read one of his books.His mom is getting sicker and his brother isn't helpful but good news the publisher has great news! They bought the new book- even if it was written as a \"joke.\"Does he decide to \"sell out\" or stick to his virtues?Definitely worth a watch! Makes you uncomfortable in all the best ways!",
    "11": "The book this film is based on was published in 2001, yet, as AMERICAN FICTION points out with wit and weary melancholy, here we are in 2023 with nothing much changed as far as mass-marketing of African-American identity. The script is sprightly, with interweaving narratives and metanarratives, with the central character writing a story within a story, which soon develops into a film within a film. That sounds as though it might be pretentiously arty, but it isn't at all. It's often very funny. But because there is a central story of great poignancy, led tenderly by Leslie Uggams, as the protagonist's mother, and Myra. Lucretia Taylor as her longtime help and friend, the movie as a whole is less daunting, and therefore perhaps less challanging, then a piece by, say, Charlie Kauffman, who might have been much more astringent with the same material. So, less austere than it might have been, but intelligent all the same, compassionate and entertaining. The cast is excellent throughout. Jeffery Wright, who is a wonderful actor, really ought to get an Oscar nomination for his work in the central role, but the Academy never recognises fine acting in anything other than Grand movies. This is simply a good movie.",
    "12": "American FictionIf alphabetical order hadn't put it at the top of the cheat sheets I consult for Oscar predictions, I might never have seen \"American Fiction.\"\nIt would have been my loss. A huge one.Not painted on the large cinematic canvases of its likely Best Picture competitors like \"Oppenheimer,\" \"Barbie,\" \"Killers of the Flower Moon\" or \"Poor Things,\" director-co-writer Cord Jefferson's wise comedy scores its bull's-eyes on a life-size target, somewhere between the heart and the brain. The writing is brilliantly original, coming at well-worn black racial themes with eyes so fresh, you feel like you're seeing the subject for the first time.Jeffrey Wright carries the film, showing a side of himself often missing from past powerhouse dramatic performances. He's lovable ... despite the fact that his character doesn't know how to be. His Thelonius Ellison - you can call him \"Monk\" - is a prickly, Harvard-educated California university literature professor, author of several novels that no one, other than adoring academic critics, read.Earning its audacious title, \"American Fiction's\" plot is as well crafted as its metaphors. Before it's finished, black stereotypes and tone-deaf white efforts to embrace them have fallen under its satirical scalpel. So have the worlds of academia, publishing and Hollywood moviemaking. Its humor is smart and sly. It's no coincidence that Monk shares his last name with author Ralph Ellison, whose \"Invisible Man\" helped usher in the black American literary renaissance of the '50s and '60s.While its satire is spot on, at its heart the movie is really about family. Turns out Monk isn't the only \"doctor\" in his family. His sister Lisa (Tracee Ellis Ross) and brother Cliff (Sterling K. Brown) are physicians. The Ellisons are upscale enough to have a beach house as well as their big family home where matriarch Agnes (Leslie Uggams) is in the early stages of Alzheimer's\nAll that brain power doesn't make them any less dysfunctional than other families. They just have wittier things to say about it.After Monk is drawn back to his family roots in Boston, his writing career takes an unexpected turn. What starts as a prank protest of \"authentic\" portrayals of black people in mainstream culture - notably by overnight-sensation black novelist Sintara Golden (Issa Rae) - inadvertently transforms Monk into a caricature himself. Which, to his dismay, is the path to the literary glory he has spent his life chasing.\"The dumber I behave, the richer I get,\" he complains to his agent (John Ortiz). (This isn't a spoiler - it's in the trailer.)\nConsidering how intelligent the script is, it's ironic that a single word plays a crucial, and hilarious, role summing things up. You know the word - the one that begins with \"F.\"\nWatching \"American Fiction\" is richly rewarding, punctuated by laugh-out-loud moments steeped in real affection for its gently flawed characters. It has already picked up wins at early film festivals; expect plenty more nominations all around its cast and creators as awards season cranks into high gear.Its rich vein of empathy and compassion make for magnificent fiction. It truly is a work of literature as much as genius filmmaking.Watching it, I found myself uttering out loud, that word I mentioned above.For me it wasn't a curse at all, but a spontaneous expression of admiration, awe and pure joy.",
    "13": "Greetings again from the darkness. From one who watches too many movies every year, I'm amazed this film is the work of a director making his feature film directorial debut. Writer-director Cord Jefferson was one of the lead writers for the excellent series \"Master of None\", and he has adapted the 2001 novel \"Erasure\" by Percival Everett for the big screen. It's a brilliant satire and commentary on a society that has twisted things to the point where no one knows what to say or how to say it.The film opens with a college professor pushing back on a student's overly emotional reaction to his use of a certain word in class. What strikes us in the scene is that the professor is black and the student is white. The confrontation costs Thelonious \"Monk\" Ellison (the always great Jeffrey Wright) his job at a New England university, and perfectly sets the stage for the rest of the story - much of which centers on Monk's incredulity at the progression of events around him.Without a steady teaching paycheck, Monk heads to his see his agent Arthur (well-known character actor John Ortiz), who informs that his most recent intellectual book has no market, and suggests he write something a bit more mainstream. Monk heads to the Boston book festival and hears author Sintara Golden (comedian Issa Rae, BARBIE) in a public reading of a particularly stereotypical excerpt from her latest best-seller, purported to telling \"black stories, our stories\". Monk simply can't believe there is an audience for this or that it passes for black representation.On a lark, Monk sits down to crank out a \"black\" story by a black writer. He does so as a joke, and is shocked, and a bit annoyed, that a publisher comes back with a huge offer. The negotiations with the publisher are hilarious. We see two white professionals desperate to offer a cool black book, yet so afraid to say the wrong thing (something offensive), that they inexplicably agree to Monk's terms ... changing the title to an unpublishable curse word. As a bonus, Monk has published the book under the pseudonym Stagg R. Lee (a takeoff on the classic Lloyd Price song). The publishing deal requires Monk to assume the identity of a wanted fugitive as part of the backstory for marketing purposes. When the movie offer rolls in, Monk is again beside himself, and states, \"the dumber I act, the richer I get.\"\nWhile all this is going on, Monk is also facing some struggles in his personal life with his mother (80 year old Leslie Uggams, \"Roots\") who is struggling with dementia, his financially-strapped sister Lisa (Tracee Ellis Ross, Diana's daughter, THE HIGH NOTE, 2020), and brother Cliff (Sterling K Brown, WAVES, 2019, \"This is Us\") whose recent divorce was caused by his revealing his preference for a gay lifestyle. All of this for a family whose dad committed suicide years ago. In the midst of all the family and professional drama, Monk strikes up a relationship with Coraline (Erika Alexander, GET OUT, 2017), a neighbor across the street, though he can't bring himself to come clean with this latest publishing scheme.The best comedies have something to say, and the best satires are often quite cynical as they expose the absurdity of our world. Monk is dumbfounded at many of the same things that dumbfound us, and this peaks at his meeting with an aptly named movie producer, Wiley Valdespino (played by Adam Brody, READY OR NOT, 2019). Myra Lucretia Taylor (THE BIG SICK, 2017) has a supporting role as the housekeeper, and there are too many terrific scenes to count. One of the best is a debate between Monk and Sintara, and the writing is priceless and brilliant. An intelligent man like Monk cannot wrap his head around the fact that black books pandering to white readers who are trying to follow the rules is the new path to success. Filmmaker Cord Jefferson delivers the message (warning?) in a smart, funny movie featuring a wonderful lead performance by Jeffrey Wright.Opening in theaters nationwide on December 22, 2023.",
    "14": "Viewers will gravitate to different sections of this story because of how rich it is in text, yet also because of how unique it is in execution. Jeffrey Wright, who's normally seen as an enjoyable supporting actor, takes the helm of this film and leads it convincingly. His character's repeated desire to be seen and validated is opposite from the crafty, suspenseful roles that I'm used to seeing from Wright, which became more impressive as the character's vulnerabilities started to flesh out. The film asks an important question that seems to be embedded within the larger scope of social commentary. \"Why do you do what you do? And, why do you feel the way you feel based on what you do?\" There's a psychological battle between doing something because it's \"good\" vs. Doing something because it provides opportunities, and then there's the sliver of possibility to intertwine the two of them. The family dynamic is the emotional crux of this story, showcasing moments that are abruptly raw and realistic while using connection as the focal point of transformation in Wright's character arc. The story is sharp, clever, and aware of the message that it's trying to share. In comparison to films with similar intentions, \"American Fiction\" leans heavily on the satirical tone to explore race and identity while visibly using comedy to approach the subject as universally as possible."
}