{
    "0": "Contains massive spoilersFrom start to finish you feel the intensity of the characters. The beginning you build such a strong bond with the family and feel the closeness of brothers that truly love each other. With each passing of a brother you feel worse and worse for the family. The strong knit family becomes devastated by what brought them the closest together. The industry shows how cruel and unforgiving it can be. In a short time you feel connected to each character wanting the best for all of them. All the acting was well done and it ended in a beautiful way that brings the audience close to tears! A true masterpiece.",
    "1": "Beautifully acted, directed, this movie was just heartbreaking yet beautiful! The entire cast was amazing, Efron, White, James, Dickenson and Mcallany are brilliant. The cinematography is beautiful, the wrestling scenes were very realistic and intense. The brotherhood portrayed by the guys seemed so genuine and heartfelt, you really believe they are true brothers. You really feel for them, and the through the pain and tragedy. This is definitely a must see, a story of an American family dynasty that truly needed to be told. It truly is one of the best pictures of the year! In the midst of the tragedy, there's also triumph!",
    "2": "I cannot begin to describe how accurate Zac's portrayal of Kevin is. I knew the brothers in the early 80's. This is a heart wrenching account that delivers every high and low of their lives.The performances are nuanced, with an unexpected depth. This is not a feel good movie. The ending is actually the beginning and that is beautiful. Lily James is stupendous and mesmerizing as Pam, and I simply cannot express my awe of Zac's performance. He deserves an Oscar.Just know that this story is as close to a documentary as it can possibly be. It was beautiful seeing the actual footage from various match ups. Thank you for making this.",
    "3": "If you don't know anything about the Von Erich family, watching this movie will certainly feel like a made up story but sadly this is one movie where there isn't enough of a runtime to fit every tragedy that occurred in this family.Zac Efron leads this movie and he does an incredible job portraying the second oldest brother in the Von Erich clan, Kevin. Zac shows just how much of a burden it is to carry your Father's ambitions and not letting him down, even if it means body and mind and family.The Iron Claw shows being strong isn't everything, we need to handle our mental health and communicate.",
    "4": "I grew up watching the Von Erichs on TV. I know the timelines pretty well. So, watching this movie left a lot to be desired.On the good side- the actor playing David was spot on. He looked, sounded, and moved like David did. The actor playing Fritz was also a good likeness, and captured the passion, if not the reality, of Fritz towards wrestling. The actress who played Pam was very good, though the accuracy isn't really a big deal, since Pam isn't a celebrity. Same for Doris, played with very few lines by the usually reliable\nMaura Tierney. Mike is also portrayed well, if not physically accurate.Sadly, that's all the good. Kerry got really shafted in being portrayed by an actor so short, he should have played Chris (who was omitted entirely!) Zac Effron plays Kevin like he was a brain-damaged simpleton.The Freebirds and Harley Race looked good, but were barely used, the timelines are all screwed up (many months passed between Kerry winning the NWA title, and the motorcycle accident) (Mike died years after David, but the baby didn't age like that) (Kerry and David were both married and had children, David losing a baby that ended his first marriage.)\nThis would have been much better as a series on Amazon or Netflix, to give the time to really develop the characters.",
    "5": "There's probably no other family in the world of professional wrestling that has endured more pain and sorrow than the Von Erichs of Texas. You might actually extend that dubious distinction to just about any family anywhere. Patriarch Fritz Von Erich (real name John 'Jack' Adkisson) was a big-name star during the Fifties and Sixties, feared for his famous signature finishing move, 'The Iron Claw'. Five of his sons followed his footsteps into a wrestling career with varying degrees of success, or lack thereof. The only one left alive is Kevin, who at a young age, was never explained the death of his six-year-old brother Jackie, the first of the Von Erich children to die an unnatural death by electric shock and drowning.This movie was a whole lot better than I expected it to be. Personally, I lost interest in professional wrestling around the mid-1980's, just around the time the older Von Erichs were making their mark in the field. I knew father Fritz Von Erich to be a dangerous competitor during his era of the Fifties and Sixties, and when in the movie, he complains of not getting the recognition he needed to be elevated to World Heavyweight Champion, one might consider it was his grating personality as an aggressive self-promoter that stood in the way. Holt McCallany was a good choice for Fritz, who he resembled quite closely.Having not followed the entertainment sport for almost forty years now, the chronology of events in this movie challenged me at times, but it was all there. Except for one nagging omission, that being one Von Erich brother missing from the narrative. For the sake of keeping the story constrained within a budget, director Sean Durkin opted to make Mike Von Erich (Stanley Simons) a composite figure of his real-life counterpart and yet another brother, Chris. Had Chris been included, the emotional overload would have been even more grueling, as Chris also committed suicide by gunshot two years before Kerry, portrayed by Jeremy Allen White. Following Chris's suicide, Fritz and Doris Von Erich (Maura Tierney) divorced after three months, an event omitted from the story.Befitting the family's tragic history, the movie's final scene with Kevin (Zac Efron) hugging his two young sons and sorrowfully stating that he's no longer a brother is enough to bring a tear to one's eye. A closing frame of Kevin's present day family of four children and thirteen grandchildren doesn't offer the fact that his two sons, Kevin and David, are currently professional wrestlers themselves. One would certainly hope that the curse of the Von Erichs doesn't extend to the present generation.P. S. - If you would like to go directly to the source, look up the first season episode of \"Dark Side of the Ring: The Last of the Von Erichs\". In it, Kevin Von Erich takes the viewer through the circumstances surrounding the death of each of his brothers. Be prepared for the present-day Kevin, the episode was filmed in 2019. He's a gaunt and almost frail looking individual with a subdued and composed manner when speaking about his father and brothers.",
    "6": "This film played out almost as if they expected everyone to know the true story, but me, i never looked into it, so many scenes cut to the next scene leaving you wondering what EXACTLY led to the next scene and the consequences. This could literally be Part 2 of That Mickey Rourke Wrestler film...it's drama, depressing, but not much wrestling action...but the story itself is more important than just watching wrestling matches...but the matches in this movie bore me...they were all under 1 minute it seemed...but who cares...the bigger picture is the story and impact...and by the end, i cried for about 30 seconds, had tears, but honestly i will probably understand the story more if i watch a 30 minute epsiode on the family...or a 1 hour documentary...this was a mature A24 film, it's like Rocky Balboa, but more sad and it's actually a TRUE story. Overall? Perfectly fine film! 8/10.",
    "7": "I spent 15 years around the pro wrestling business, from 1981 till 1996, and spent my share of time around World Class Wrestling. For decades, I've imagined a movie about the Von Erichs that could live up to their legend and their tragedies.I had high hopes for The Iron Claw, but I left the theater disappointed. I wanted a home run. It's not a swing and a miss; more like a foul tip into the stands.I wanted to love this movie, but I just can't -- it doesn't know whether it's telling Kevin's story or the family's story. It ignores one of the Von Erich brothers entirely: Chris, who also committed suicide. In a movie about brothers and tragedy, how can you leave out a brother and a tragedy?The Texas Stadium event, at which Kerry won the NWA World title from Ric Flair in memory of David (I was there), was an incredibly emotional day; fans were openly weeping when Kerry won the belt. It was a cornerstone of their in-ring legend, like Live Aid was a cornerstone of Freddie Mercury's career, but it's practically glossed over here.I also found the pacing disturbing. It was slow moving, spending too much time on situations that didn't help the audience get invested in the characters as much as they could have. There was no dynamic range -- a tone is established early, then maintained for two hours. The emotional rollercoaster of their lives seems reduced to emotional cruise control.Wrestling fans will probably be disturbed that David is pretty much the only Von Erich brother who looks like the actual Von Erich (Kerry looks like Marty Jannety; Kevin looks like Pete Rose). Ric Flair's interview elicited groans of disgust from the wrestling fans in the theater, though Harley Race and the Freebirds seemed to be pretty on point. The actual wrestling action itself is quite well done, and Holt McCallany is a terrific Fritz Von Erich.There were occasional hints of the excellent film that might have been. The best example: Kerry meeting his brothers in the afterlife, one of the few scenes that succeeded in carrying real emotional impact. Given the family's story, \"few\" should have been \"many\" in that previous sentence. Knowing the real story as well as I do, I saw missed opportunities all over the screen.All that said, I have yet to speak with anyone who has seen The Iron Claw who knows nothing of the story of the Von Erichs and little about pro wrestling. I can't help but wonder how the movie comes across to them. I suppose I'll find out in a week or two when I come back to this page and read user reviews.",
    "8": "If you go into this movie thinking you know the story, well you are probably right. \"The Iron Claw\" doesn't hide anything. It depicts the life of Kevin Von Erich and how he believes that his brothers and family are affected by the infamous \"Von Erich curse.\" Kevin (Zac Efron) spends his life navigating through the trials and tribulations of his life as a professional wrestler. Everything from winning big matches to be upstaged by others in the ring; the movie depicts how these events affect Kevin and the rest of the Von Erich family. The Iron Claw holds nothing back and paints a grim picture of how hard the pro wrestling lifestyle can be on your mind, body, and soul.I do applaud the movie for quickly dismissing the idea of the \"Von Erich Curse.\" The truth is that the Von Erich brothers and family were truly affected by a rash of poor decisions and a rugged lifestyle as a wrestling family. The drinking, partying, injuries, and poor mental health are all too common in and out of the ring. I believe the movie attempts to portray the deaths of each of the Von Erich brothers in a subtle way. To add, Zac Efron does a great job of portraying the surviving brother who fights the notion that all men should be raised to be strong, silent, and emotionless lime him. The choice to step away from the ring rewards him generously.In summary, I am a wrestling fan who spent some my formulative years growing up around the business. From helping to set up the ring, to working the snack bar, I got to be part of a bigger family. But as the movie depicts, the pro wrestling life isn't for everyone. If you lace up those boots you better prepare for the worst and hope for the best. For everyone wants to be champion. But at what cost?",
    "9": "I Never knew who these brother were until I heard Zac Efron was going to take on the lead role I am a huge fan of him for obvious reasons. This is a great film about a family who dealt with so much tragedy and loss. Zac killed the role physically and emotionally Jeremy Allen White was fantastic as well He's a fabulous actor. The entire ensemble was perfect I cried and felt everything the actors felt at all times. Any film that can take you on that type of emotional rollercoaster deserves to be talked about and definately experienced. There is a part of the film and I won't ruin it for anyone but it tore my heart in 2. It's beautiful and sad all at the same time. A must watch!",
    "10": "I saw The Iron Claw, starring Zac Efron-Firestarter_2022, Dirty Grandpa; Lily James-Pam & Tommy_tv, Baby Driver; Holt McCallany-Nightmare Alley, Jack Reacher: Never Go Back and Jeremy Allen White-The Bear_tv, Shameless_tv.This movie is based on the true story about the Von Erich family. If you are not a wrestling fan, the Von Erichs were a family of wrestlers that were big in the 1980's, especially in Texas. Holt was the father, Fritz. Zac plays Kevin and Jeremy is one of his brothers, Kerry. The Iron Claw was one of their signature moves, where they would use their hand on their opponents' head to make them submit. FYI: Zac and Jeremy got in really good wrestling shape for the part. All together, there were 6 sons in the family but there were accidents and suicides that reduced their numbers drastically and caused people to say that there was a curse on the family. Lily plays Zac's wife, who doesn't believe in the curse. The movie covers many things, including the domineering Holt trying to push his sons into getting the heavy weight title belt that has eluded the family for years. But tragedy keeps taking the sons and by the time the father passed away in 1997, there was only one son left alive. Was there a Von Erich curse? Who knows, but it is an interesting movie.It's rated R for language, suicide, drug use and sexual content-including partial nudity-and has a running time of 2 hours & 10 minutes.I remember watching them wrestle when I was growing up and I really enjoyed this film. If you are a wrestling fan, you should really like this one. I would buy it on DVD.",
    "11": "I looked forward to this film for months! It started off strong but then it seemed to draaaag. (Several in our group dozed off a few times) The flow was all over the place and it seemed to lack any decent structure. The writing was mediocre at best for such an interesting story of the wrestling family. The casting was spot on for some (Fritz, David, Harley) and way off for others ( Kerry, Flair), and Zac was built more than the others and didn't look like Kevin at all.The film seemed to lack that punch and the score wasn't used well. Like another user stated, this would have made an excellent Netflix series, instead.PS: Still can't believe they miscast Kerry so bad.",
    "12": "This is one of the greatest wrestling movies ever made. Certainly the greatest true wrestling story ever made.This is one of the greatest sports movies ever made.But you need to know nothing about wrestling nor of this famous wrestling family to absorb the absolute impact that this movie will have on you inside the theater.This carries the same weight, pound for pound, as the fabulous Elvis movie did a year or so ago.This movie also magnificently captures that wonderful and amazing era of life before the internet and social media.Where real feats of strength, endurance and physical athleticism had to be either witnessed in person and seen with one's own eyes, or on some small screen somewhere.Legends were made inside a ring in tiny arenas and gymnasiums on this country's soil. And their images were then plastered on paper in magazines that covered the racks at the local drug store or grocery store.And it was every bit as influential as anything that one could possibly find on their phones today.This is an unbelievable and incredible tale.Everyone should know the Von Erichs.They will after seeing this.",
    "13": "Let me preface this by saying I am not a fan of pro wrestling at all. I actually think it's kind of silly but this film is great regardlessAs always A24 delivers another great film. The acting is amazing. The story and dialogue are great. Everything about this film is awesome. It is a bit sad though. But coming in, I knew it was gonna be sad because I knew a little bit about the Von Erics from my dad who loves pro wrestling.Zac Efron does an amazing job as the lead in this film. The co stars that played his family do a great job as well. Zac Efron and pretty much every major character has an amazing arc and a lot of development. They also have very good chemistry on screen.Story wise it is a very good story, but very sad at the same time. It does have the benefit of being based off of a truly amazing story of a family of athletes. The dialogue is very well written. The story goes very smoothly.The production value was good. I've come to expect a good production value when it comes to A24 films. The cinematography isn't as crazy or unique as a normal A24 film but they still do a good job regardless.Overall, it's worth the time and money you spend.",
    "14": "I am not a wrestling fan but this was great!It's an interesting character study of a movie about the Von Erich family with strong direction from Sean Durkin, an interesting narrative with great themes and emotions, and great performances from all the cast members. I am not very familiar with the Von Erich backstory but the movie does a pretty good job on examining the characters and setting with strong directing from Durkin which helped bring the atmosphere and setting to the heights. The writing is the typical biographical structure but it is well-executed because of interesting themes and concepts explored and Durkin's direction. Many of the performances from the cast were pretty great as Zac Efron, Jeremy Allen White, Harris Dickinson and everyone else does a great job on their performances. Holt McCallany as Fritz Von Erich does a great job on portraying how awful of a father Von Erich was.Many of the characters are interesting as the conflicting dynamics between the family, wrestling games, and relationships are interesting and pretty emotional at times. Alongside with the dialogue as well. There are some certain soundtrack choices that were a bit odd and there are some pacing moments that could have improved. I wouldn't this is my all time favorite A24 flick but it's another good one!",
    "15": "I went into this film not knowing anything about the Von Erich family. I thought this would be a typical sports movie centered around wrestling. Fortunately, this film was more than that. It touched on many topics like brotherhood, father son dynamics and grief. This film was way more tragic than anything I could have thought of and what makes it crazy is that it's all true.The acting was very good in this film and all the relationships were believable except for how quickly Kevin and Pam got together.All of the actors playing the brothers had great chemistry. The motives and decisions of all the characters were well executed. The wrestling scenes were well done even though this film was less about wrestling and more about the family.While I enjoyed this film, I did feel that it could have been longer. Some of the events felt rushed and crammed together. More major wrestling events should have been added to show some of the wrestling politics. The wives in the film played very minimal roles in the film and it was hard to believe that they weren't more involved in real life.With that said this was still a gripping and memorable film that deserves to be watched.",
    "16": "I knew that this was based on a true story and I'd watched one trailer before going into it. Aside from that, I went into this movie completely blind; I'm not a wrestling fan and I didn't research anything about the Von Erichs before seeing this.This film is so tragic that I found myself astounded by the fact that it was based on a true story. It feels like something out of a Greek tragedy or Stephen King novel. Unfortunately, it's neither: this is the story of an obsessive and unfeeling man who forced his failed dreams onto each of his sons ... and the catastrophes it caused...\nEveryone who talks about \"The Iron Claw\" is going to rave about how great of a job Zac Efron and Jeremy Allen White are in this (and don't get me wrong, they're PHENOMENAL), but I was especially blown away by Harris Dickinson's portrayal of David Von Erich; he carried every scene he was in with a larger-than-life, yet supportive persona.\"The Iron Claw\" is more than good enough to earn a couple of Oscar nominations next year ... but based on the recently released shortlist and strong competition, I doubt it's going to make it.Regardless, I still recommend this unbelievable and emotional movie. I hope I'll get the chance to see it again before it leave theaters...",
    "17": "The Von Erich's were always this odd story I heard when I was a kid. The wrestling family that kicked off what is now the professional wrestling dynasty. They were the superstars that also saddled with one of the darkest most bizarre curse. If you think about the tragedy of Chris Benoit, someone would always bring up the Von Erich's.The story is centered around Kevin Von Erich (Zac Efron), mostly because the tale can only be told through his window. A Texas family whose father Fritz (Holt McCallany) desperately wanted to be at the top of the game. He molded his sons to follow in his footsteps. Cold and focused, he is the father of that era that most today would consider abusive. Back then, to get greatness, sacrifice must be endured. In this case, the early wild death of the eldest brother Jack (who is never really addressed completely) since he was a baby when he passed from an electrocution accident. From that point on, the family presses forward.There is a dark cloud that hangs over the family, yet no one completely addresses it directly. The Von Erich curse seemed to be a real thing. And as a youngster, I always waited for the next Von Erich to die a weird death. Grim as it may seem.The brothers wake up and eat, drink and breathe wrestling. But there is a hierarchy. Broken down by the Fritz. The brothers are meant to compete with each other for the approval of Dad.There is also David (Harris Dickinson) and Kerry (Jeremy Allan White) but not mentioned...a brother Chris. I only knew Kerry, since he made it to the WWF.This at-the-fringe federation of wrestlers were in the NWA, which I always considered the low-rent of wrestling, as if there were such a thing.Kevin marries Pam (Lily James) who is really the most normal of the gang. The mother. Doris (Maura Tierney) seems to be just trying to placate Fritz but also focus on God.I truly miss this type of filmmaking. It is a story of family and tragedy and how they cope with it. Which sometimes I wish they showed more of that and less of the wrestling. This movie's emotional core stuck with me. Though, there are moments that drag, when you think about how awful events followed this family, you are left wondering how they were able to move forward.The answer isn't very clear. These are the moments I wish focused more on Kevin's resilience. Instead, we see he truly believes the family curse. And that would be enough. Perhaps the emotionally absent mother answers the question of pain and loss. There is a great moment when all the death occurs, Mom doesn't know how to cope. Because of her faith, you read the thought bubble which is asking God \"why am I being tested\" a brilliant move by director Sean Durkin NOT to have her say this outloud.One thing that may trouble some viewers is the Fritz's dialogue. At first, I considered it horrible acting. Then it occurred to me. He has been a showboat to audiences most his life. It isn't too far of a stretch that he knows no other way to communicate. He is a tough guy who relies on his sons to be equally as tough. Though he isn't that way at first, he downshifts into it with the success of the family.There's so much to unpack here.Mass kudos to Zac Efron. A brilliant piece of acting which should get him an Oscar nom (perhaps the Academy will never take him seriously...they should). In spite of his stoic mannerisms, Efron still exudes thought processes. In this case, tough guys aren't suppose to cry. But we cry for him.Wonderful work. This is a must to see in theaters. A small screen will not show the subtle performances.",
    "18": "Rating: 7.9\nOverall, a captivating story that is told through very good writing and great editing as the audience witnesses the rise and fall of the Von Erich family, but it is held back from being a must-watch by its stiff direction and lack of chemistry within the cast (though the singular performances of Zac Efron, Jeremy Allen White, and Holt McCallany did make the movie entertaining).Decent Direction (Good on a Macroscale as it helps build the wrestling world; not the best on a microscale as the interpersonal 1-on-1 scenes had a lot of stiffness; The storytelling was good as it really is entertaining/captivating to see what happens next the way the director builds up the story; the direction of actors was really dependent on the scenes (it was good in solo scenes but hit some limits and felt rough when it came to scenes that required more than one person as each character felt like they were acting in a silo)), Pretty Good Acting (Very Good from Zac Efron (Really holds his own as his transformative performance commands the movie as he carries the weight of this traumatic story on his shoulders (though there are some limitations when it comes to working with the other actors)), Good from Jeremy Allen White (Really brings his energy to the performance and works well with other actors in the cast (though there are moments where he is stiff)), Pretty Good to Good from Harris Dickinson (Does a good job in the wrestling moments but is not given that much to shine outside of it), Pretty Good from Maura Tierney (Does well with what she was given but does not have that much time to show off), Good from Holt McCallany (Carries out this one-dimensional character very well as he embodies what it means to be a father that pushes his family to the limit (though there is some stiffness when it came to working with the other actors), Pretty Bad from Lily James (Really is stiff in the beginning and not the best scene partner to Zac Efron (though does get better as the movie goes on), not her best performance as I've seen her perform better), Decent from the rest of the cast (There were some performances that were better than others, but there just felt like a lot of stiffness and lack of chemistry in the cast (except for the brothers))), Very Good Story (The concept was really good as it was really interesting to see the different characters in the family and how wrestling (and their father) pushed them to the limit; the movie was mostly factual as they did a good job in highlighting most of the main points while subtly glossing over some of the minor details (there is more an issue that there is just so much that happened in real life that they had to cut stuff out (like how there was another brother who took his own life); The story construction was really good as the movie was very entertaining for the most part since each element of the story helped build the overall narrative (though it does kinda falter a bit in the final 20 minutes); the flow between sequences is good as the movie does a good job at building scenes on each other to keep the story going; the character writing was pretty good as you get a good sense of each character, but besides Kevin, you don't know the depth of each character's struggle (and even though it is handled well, I would have liked to have seen more about how tainted the boys' relationship was with their father)), Very Good Screenplay (The dialogue was pretty simple (which was intentional given the subject matter and the characters); the use of humor was pretty good as it made the brothers' bond feel more realistic; the movie builds tension well as the use of different techniques coupled with the writing brings the audience on the edge of their seats; the symbolism is somewhat there (but as much as you would most likely see from a biopic); the foreshadowing was really good as there were many callbacks throughout the movie as the writing laid the groundwork for what was going to unravel towards the end), Good Score (Used well to create tension)/ Very Good (Used very well to help set the tone/time period), Good Cinematography (Used very well as it felt polished in the more dramatic scenes, but felt gritty with its one take single cam shots used for the wrestling scenes), Pretty Good to Good Sound (Good for the most part as it helped bring to life the wrestling scenes and building tension (though there were some hiccups in the movie)), Great Editing (A lot of the scenes were edited so seamlessly it helped with telling the story and keeping the movie captivating (with the best being the coin-flip shot and the Tom Sawyer wrestling montage)), Great Makeup (Their hairstyles were a focal point for many of the character's looks as it helped them look more like their real counterpart), Good to Very Good Costumes (Helped set the time period and illustrate the wrestling scenes), Plot Structure was laid out well as there is ample time in both the exposition and the rising action to build the story forward and tell the tale of the Von Erichs (but the climax and resolution were not the best), Pacing was good as it kept a steady pace for the most part (though it slows down a good amount towards the end), Climax was pretty anticlimactic (especially with one specific scene that felt out of place) as the movie kinda falls off with 20 minutes to go; the runtime could have been shorter if the ending was cut a bit, Tone was a mix of the obsessed artist trope (Black Swan, Whiplash, and The Wrestler) with the tone of The Bikeriders to set the time period and feel.",
    "19": "My 30 year old son and I went to see this movie. He has been a wrestling fan since he was 6 years old and those matches on TV gave him many years of enjoyment. So, we were really looking forward to seeing this movie. All in all, it's a very interesting story told in a boring, slow, and very deliberate manner, so much so that it becomes almost annoying. You can not fault the actors and actresses - they are all quite good and give natural, realistic performances. The problems are mostly the script and the direction.I was not familiar with the details of this family's story, so there were a couple of reveals that were surprising, however, I did doze off a couple of times during the first hour and my son nudged me awake. When I opened my eyes, the same scene was STILL going on, so I don't think I missed anything.Things picked up during the last 30 minutes and the ending is very, very moving, but it just wasn't enough to make this movie a memorable one.",
    "20": "I knew nothing about this family going in and that made this story all the more shocking and made me really sympathuze with Kevin and all that he goes through. It might just be how I was feeling today but this movie made me care so deeply about these brothers and their bonds that I ended up sobbing through half of the movie.I don't want to spoil anything (and I won't truly spoil anything) but if you don't want to know anything else, don't read on.Be prepared. This movie is full of trauma and heartbreak and if you're a sensitive viewer, you might want to look up trigger warnings. For the most part, this story is a tragedy, something I didn't know going in and felt blindsided by. I wasn't upset about it, this was just a way different movie than what I thought I was going to see because j didn't know anything about this family. So just a heads up to be prepared and maybe bring some tissues. If you don't mind sad movies, please give this a watch. It truly is a beautiful one, especially the last 3 scenes.",
    "21": "This movie is a love letter and brutal reminder that family and brotherhood is the most important thing one is blessed with.I was born into a 2 child family. While my sister provided much love and comfort, there is something special about having a brother. I found brotherhood in other fellas as I grew up. Nothing compares to having the masculine camaraderie and a guy to lean on.This film captures this in a non-traditional way. Not using war, bar-fights, and violence to show masculinity. The violence in this film is all in dramatization (pro wrestling) and self-inflicted violence of neglect. Instead, this film captures the essence of the pain found after focusing on trivial things beyond family, when all along the family right beneath your nose is truly what you needed all along. It's only realized once it's too late.If you have a brother, in blood or in life, this is a film for you.",
    "22": "Greetings again from the darkness. Tragedy. Destiny. Curse. Those last two may be a matter of perspective or opinion, but without a doubt, that first one fits, and is actually mandatory when discussing the infamous wrestling family known as the Von Erichs. I was fortunate to attend the world premiere of writer-director Sean Durkin's movie at the historic Texas Theater in the Oak Cliff community of Dallas, Texas. While it's a movie worth celebrating, it had to be an emotional evening for Kevin Von Erich, who attended with members of his family, as did most of the main cast, the director, and some crew members.Jack Adkisson took on the professional wrestling name of Fritz Von Erich, and became well known as a German villain within the squared circle. Tragically (there's that word), five of his six sons preceded him in death (three by suicide). The film's opening scene shows Fritz (played well by Holt McCallany, \"Mindhunters\") using his titular iron claw to win a match. Afterwards, he meets his wife (Maura Tierney) and a couple of their young sons in the car and promises that life will get better once he's the World Champion. Of course, that day never comes, and having felt he was cheated out of his chance, Fritz uses that chip to raise and train his boys that being the toughest and fastest means nothing can hurt you. How untrue that becomes.A bulked up and ripped Zac Efron plays Kevin, Jeremy Allen White (\"The Bear\", \"Shameless\") is Kerry, Harris Dickinson (TRIANGLE OF SADNESS, 2022) is David, and Stanley Simons plays Mike. One brother died at age six from an accident, and filmmaker Durkin chooses to ignore brother Chris in order to keep the focus on the known wrestlers. Kerry was a competitive discus thrower denied a shot at a gold medal when President Carter announced the 1980 Moscow Olympic boycott, and soon after, joined the family business. Mike was the sensitive brother much better suited to pursuing his music than joining his spandex clad brawny brothers in the ring, which he did under duress from dear old dad.This may appear to be just another sports movie, but I'd argue that it has more in common with FIELD OF DREAMS (1989) as a peek into male sentiment and emotions ... this one centered on brotherly love and a desire to please dad. Fritz may now be viewed as a throwback father on a mission of manic masculinity and machismo, but he's played as a man who believes he is doing right by his family ... even though he readily admitted which son was his favorite, and prefacing it with the pecking order can change based on success.Durkin does show us the progression of wrestling careers, including the ongoing rivalry with wrestling icon Ric Flair, but it's the personal relationships that matter most here. Lily James (YESTERDAY, 2019) provides a spark of charm and likability as Pam, who ultimately marries Kevin (they have been together since 1980). Classic rock songs fill the soundtrack as the brothers wrestle and wrangle through the 1980's. All of the actors deliver nice work, though it's Zak Efron who carries much of the film's weight, and does so exceedingly well. With MARTHA MARCY MAY MARLENE (2011) and THE NEST (2020), Sean Durkin seems to have an affinity for haunting stories, and proves more than willing here to take head-on the Von Erich curse and corresponding tragedies.Opens in theaters nationally beginning December 22, 2023.",
    "23": "Growing up in the 80's many of my Saturday afternoon's were filled watching \"World Class Championship Wrestling\" on TV and I enjoyed it and loved it as it was made by the Von Erich family. Thankfully director Sean Durkin had the courage to make a big screen bio type film on the world of wrestling with his focus being the dynasty of the Von Erich family. Watching this brought back memories.The film starting in the early days of wrestling legend Fritz Von Erich(well done by Holt McCallany) who was the big bad mean wrestler with his signature iron claw in Texas. Only soon the business expands with him running it, and soon one by one his family of boys begin to wrestle. Shown are the rise and struggles of Kevin(in a wonderful and super turn from Zac Efron), David(Harris Dickinson) and Kerry(\"Shameless\" and \"The Bear's\" great Jeremy Allen White). And Fritz pushes each hard with his in ring training and tough love as he wants each to be champion, and shown are title matches with legendary Ric Flair and Harley Race. Along the way dependence and pain and emotional issues are found tragedy strikes first with David and then later with Kerry after he becomes champion and the most popular of the wrestling family.If you grew up in the 80's and remember and watched and were a big fan of wrestling then this film \"The Iron Claw\" is a must see showing love and determination of family who rose to stardom only to be dealt emotional pain and tough raw sorrow thru much tragedy. So glad Durkin made this movie."
}