{
    "0": "Granted, this film is not going to appeal to people who have never been fans of any games featuring the titular brothers. But given the fact that these filmmakers were tasked with making a movie that caters to a fan base that spans four decades and thus have a myriad of tastes and expectations, they did a pretty good job. In fact, a slightly better job than I was expecting.The voice cast was the subject of much controversy, and I thought that for the most part it was actually spot-on. A couple of characters were horribly miscast in my opinion, but in particular Jack Black as Bowser and Charlie Day as Luigi shine as perfectly encapsulating the spirit of the characters.Platforming elements from the games was very efficiently worked into the action sequences, and some of them were quite thrilling. This is easily Illumination's most visually stunning film, and a massive step up from every one of their other films since the first Despicable Me.As for the plot, it's just the plot of every Mario game. And for the most part, that's all it needs to be. Every beat plays out almost exactly like you'd expect it to, with a couple subversions pleasantly thrown in there.The messiest parts of the movie, if I'm going to get critical, are the dialogue (which is often quite stupid) and the characters. They just try to deal with too many of them, and although four or five characters are strongly introduced with background and desires, almost none of these introductions actually amount to a payoff, and even when there is a payoff, it's haphazardly thrown together for a rushed ending.Although I think 85-90 minutes is actually the perfect length for an animated film normally, this one could've benefitted from an extra 10-20 minutes to flesh out these points a bit more. We move so quickly from location to location that there's never any time to breathe or get invested.But that's my adult perspective. I had a pretty breezy, fun, and heartwarming time, though I would've liked more meat on the script.My theater was PACKED, and probably 75% young children, and they all seemed to have the time of their lives. Your kids will probably love it, and you will probably more than tolerate it.",
    "1": "Video games have long been plagued by subpar adaptions of their materials, but on their second attempt, the Mario Bros save the day. Being on par with the likes of Sonic and Detective Pikachu, this film hits all the fun beats you would want from a Mario film. Including plenty of fun moments for fans of the expansive franchise, this also stays completely understandable and entertaining for anyone who checks it out. With some interesting voice acting choices, no one took you out of the film and everyone felt like great choices for this vibrant world. Wishing that it stood out more or took on more intriguing choices, I was still walking away happy and hopeful for the future of this franchise and the possibilities to come.",
    "2": "First off this movie is for kids and fans of Nintendo and the Mario franchise. I still think an adult who isnt a fan could still enjoy it but this movie is so full of fan service that it will have you smiling the whole time. The voice acting I was skeptical but they all work and work well too. Jack Black is the star here. I love how they kept the story simple like all of the games. Truly felt like a video game on screen. This movie felt like a beautifully animated amusement park ride. The audio in the movie was amazing too. The sounds and the score with reimagined iconic music was perfect. Some of the songs in the movie felt unnecessary but they worked. I think they should've bumped the run time to 105-120 min. 90 min felt too short as it goes by quick. I havent had this much wholesome fun at the movies in a long time. If youre a fan you HAVE to see it.",
    "3": "I think for what this movie sets out to do, Super Mario Bros. Movie pretty much ticks the boxes of an entertaining, reference fan-service heavy movie. A lot of the jokes are basic sure, but it's just impressive that there is some competency to a Video Game Movie. Sometimes simple and straightforward is the best way to go. Not high art or anything, but it ticks off almost everything for what Mario should be at least. Voice acting wasn't as bad as I thought, and Jack Black was the highlight as expected. Yeah, not gonna win any big awards but judge it for what it is, and yeah by Video Game Movie standards it's one of the best ones easily if you ask me.6.5/10.",
    "4": "Mario (Chris Pratt) and Luigi (Charlie Day) are struggling Brooklyn brother plumbers. When the city's sewer goes haywire, Mario sees an opportunity for heroic fame. Instead, they get sucked into an alternate world. The brothers get separated. Mario joins Princess Peach (Anya Taylor-Joy) to recruit the Kong army in their fight against the evil turtle Bowser (Jack Black). Luigi gets captured.It's brightly colored. It's energetic. It's got the characters. There's the game play. The story is fairly simple. It's pretty much what I expected. I wish there is more heart to it. The brothers could have been that, but they get separated pretty quickly. I played some of the games over the years and this will probably appeal to the fans. It's got all the brightly colored chaos for the kids. It's less so for everybody else.",
    "5": "I am someone who is not swayed by \"critics\" or rotten tomato scores. I didn't even really have any expectations going into this movie. As someone who grew up playing Super Mario Bros, Super Mario World etc., I was really just going to see this movie based on nostalgia and it does deliver on nostalgia. The visuals are stunning, and while everyone has their reservations about Chris Pratt the voice acting is perfect (except one for one elderly character). While many have said this movie moves quickly or \"too fast\", I would say it has great pacing and never leaves you bored. While it is not a perfect film it leaves little to be desired. It is everything you want from an animated Super Mario Movie.",
    "6": "After meeting Chris Pratt at the Santa Barbara film festival I'm very amazed of how remarkable Chris played Mario for the first. I remember playing Mario kart double dash on GameCube 20 years ago with my sister during Christmas Day and I absolutely loved the game . Universal and Nintendo did a great job making this movie for kids and adults who played the video game since the 80s 90s 2000s to now . The Mario movie was absolutely awesome and very creative from the video game . Chris was absolutely hilarious as Mario . Jack black as bowser was the best for the film. His voice was a mixture of Vader which I find so outstanding. Chris who voiced Mario did a fantastic job. He used the characters voice very carefully. The sounds were just like the video game. And i think that was absolutely awesome. The story taking place in New York to the mushroom kingdom is brilliant. Princess peach was the best part of the movie . She had a good way of showing bowser she will not marry a turtle . And toad was the best part of the movie . The rest of the characters including donkey Kong voiced by Seth rogen was so awesome. I hope in the next Mario movie yoshi finds Mario and Luigi and becomes they're pet.",
    "7": "Took my kids for a special sky screening and boy were we excited! At first I was rather skeptical thinking this film won't do any justice to the games. However, I was wrong! This film met our expectation and beyond. I think I enjoyed this film more than my kids. From the moment the film starts it is enjoyable. Good sense of humour and a lot of nice scenes. A lot of laughable moments. Apart from the film being too short it still met my expectations. As a 39 year old who played all the Mario games since childhood, this bought back a lot of fond memories of sleepless nights of playing the Mario games. A must watch film whether you have kids or not.",
    "8": "Some people are taking this movie too seriously. This movie is just supposed to be fun and colorful and not to be taken like a tarantino movie or something. Of course the plot could be improved a bit here and there but it's actually a really fun and entertaining movie when you just enjoy the ride. If you're a big fan of Mario you will absolutely love this movie 100%. I felt like a little kid again when i saw all the characters and easter eggs in every scene. The animation was insanely well done and i believe they could've made the movie a bit longer to expand on the world a bit more and get to know each character more but that's about it.",
    "9": "If you only watch the movie with the intention of having fun, you will certainly have a good experience with Mario. However the plot is quite bland and the movie runs at a very fast pace between one scene and another, hampering the progress of the story.Also, if you haven't played the Mario games, you'll fail immeasurably to pick up the game references that are scattered throughout the movie, and there are many of them. For anyone who's a Mario fan, this movie is literally fan service and it's no wonder why they're giving it a 10.For me, this movie doesn't lived up to the hype, but for a Mario fan, it certainly did.",
    "10": "This movie is so much damn fun and I absolutely loved everything about it. The composing in this movie is some of the best I've ever heard and it fit so well in the movie. The voice acting was pretty good too and I didn't think Chris Pratt would be any good as Mario but he was actually pretty good but Jack Black stole the show as Bowser as he absolutely killed his role. Charlie Day was great too as Luigi as he was probably my 2nd favorite in the movie. The only problem I have with this movie is it felt so quick and I wish it was longer and it's only 90 minutes. Other than that this movie is just a ton of fun and worth the watch.",
    "11": "As a Mario fan myself it was a very enjoyable and fun action packed movie. While watching I just couldn't wipe the smile off my face. Jack black did an amazing job with voice acting bowser. Everyone did a great job and while I do agree Chris Pratt could have been better i got use to it really quick and im sure pretty much everyone else will too and besides, the Italian accent in the games is great but definitely not meant for a 80 minute movie. The plot is very simple which is good however because a Mario story shouldn't be complex at all and the people at illumination definitely know how the games should be. Speaking of that, you can tell the people behind this movie put a lot of heart into it. Definitely give this a strong recommendation if you like Mario or have childhood memories with Mario in any way or just wanna watch an enjoyable family movie.",
    "12": "**Possible Spoilers**30 years since 1993's fever dream live-action nightmare, The Super Mario Bros. Movie rights the wrongs of the last one; though it's certainly not a perfect movie, it's perfectly fine for what it is, and as family entertainment goes I've seen far worse than it. And with the gorgeous animation, the faithfulness to the games and the music, Chris Pratt and co. Do their best with the same old 'Mario comes to save Peach' storyline being worn thin at this point.Sure the film's problems can be dissected to the nth degree on YouTube retrospectives talking about the movie, but it is what it is and it works where other blockbuster fan-service vehicles have failed (like Terminator: Dark Fate, Ghostbusters 2016 or The Lion King 2019). And Mario (at least Nintendo) has the potential to become a cinematic powerhouse that defies the 'bad' press and reviews (they're more mixed for the movie).The film is basically feature-length comfort food more than anything else; and considering it's a family film that's pretty harmless, I'd say it's done its job more than well. Certainly better than Illumination's other more recent films I'd say.The Super Mario Bros. Movie is the safest kind of cinema, and maybe some people should accept what they see; but not everyone has to. Besides, fun is fun. 3.5/5 stars.P. S. Could this film lead to other stuff like Zelda hitting the big screen? Or maybe even Metroid? Who knows?",
    "13": "The animation was superb and eye-popping. Illumination really stepping up their game. Unfortunately the movie was a bland, witless and flagrantly pandering production with a weak and dull direction and screenplay. I didn't liked most of the mediocre VA performances and in my opinion Chris Pratt as Mario was an unfortunate miscast. The standout and probably the best performance was Anya Taylor-Joy as Princess Peach.The movie was a monotonous mess from the beginning to the end. Shoehorned pop songs were a distraction and also an embarrassment (You guys ain't James Gunn). The ending had too much cringe and it was an unsatisfying conclusion to a tasteless fan service.",
    "14": "I went to see the highly anticipated Super Mario Bros movie tonight with my mum, whom was my gaming buddy back in my childhood days. We'd spend hours playing Mario All-Stars on my dad's SNES, and later on we played on our Mario edition Wii.As a gamer, this movie was a promiseland I wish I could stay in forever. Admittedly, I was sceptical about Chris Pratt voicing everyone's favourite Italian plumber, but he did a superb job and he deserves a lot of praise for his dedication to the role. From learning about power-ups, to fighting against Donkey Kong, and to racing along the infamous Rainbow Road with all the drifts we've all performed countless times on MK8 and its predecessors, this movie is a huge dose of nostalgia for millennials, and a nice introduction for the younger generations.My hat goes off to Mr Jack Black for his awesome job bringing the big, bad Bowser to life on the silver screen. He was the primary reason I wanted to go and see this movie so badly, and he did exceedingly well.",
    "15": "I love Mario, and I enjoyed this movie, and so did my 7y/o. But with that out of the way I'll be honest - this movie is quite bad, as movies go. The story is barely present, every scene leads into the next with very little plot or agency - things just happen, characters just need things, that place is suddenly a karting city, that other place has an elevator leading up to a castle straight up a cliffface. The script is probably just screams and the a few catchphrases. It's all held together by nostalgia baiting, references and pandering, wrapped in Minions slapstick. It is all barely coherent. There is also a thing to be said about the music which was murdering classic tunes, some of which is just shockingly bad.Is it a Mario movie? Sure. Is it a fun Mario product for the whole family? Yup. Is it a good movie? No, not really, in fact I'd give it a 6 if I am honest; not awful, but that's about it. So if you are 8 or a Mario fan - sure, you are likely to have a blast. But if you're just a person looking for a fun animation movie wholy uninvested in Mario? Nah, you can probably pass on this.",
    "16": "I spent hours of my life playing Mario Bros. On the Nintendo way back in the day. I came into this movie expecting to wallow in the nostalgia of it.However, after an admittedly hilarious opening scene, I realized quickly that this movie was going to be a cynical cash grab banking on people exactly like me not caring whether the movie was good or not as long as we got our Mario fix. Well no, not good enough. Would it have been too much to ask that the film be both a loving homage to a popular game an an actually good movie at the same time? Apparently so, because this movie devolves into crappy chaos by the time it's over.Grade: C-",
    "17": "I'm a Nintendo fan for life. From my SNES in the 90s to my current switch, Mario, Pokemon, and Zelda have been staples. But I'm not reviewing a video game. This is a movie, and I'm a screenwriter. Here are my thoughts:The entire story was loosely stitched together around how to force the Mario (and Luigi) into scenarios that reference familiar gameplay, from the classic obstacle courses, to rainbow road, DK country, Luigi's mansion, etc. Until they get to the boss battle.As a game: great. You have the controller in your hands. And every time you score coins, collect inventory, beat levels, etc. You get a little dopamine hit.Movies aren't about that. I'm not necessarily saying the Mario IP can't work as a movie, but the writer didn't focus much on adapting it into a movie. Fan service is necessary when adapting something that comes with a fanbase, but it should not be prioritized over the story. This movie was 90% fan service and as a result, Mario and Luigi turned into plot-driven characters who were as passive as two sticks in a river (of sewage).Their ineptitude as plumbers could have set their journey like a buddy cop movie where they have to prove themselves, save the day, and change the hearts of their disgruntled city, but those early scenes of them fumbling only served visual gags with zero consequences and until they moved on to something else.Oh, and all the boss battle required was the invincible star. As gamers, we know how that works but in telling a story, it's a total cop out that kills the tension and makes defeating Bowser too easy. They literally could've sat in place and waited for Bowser to arrive and did the same thing, rendering the entire middle section pointless.Illumination isn't great when it comes to story. I'm convinced they're more about what cute/silly characters they can sell merch for. Regardless of if you voted this 1 star or 7.4 (where it's at now as I write this), I think we can all agree, it's not a 10.",
    "18": "The story was simple, but worked wonders with the excellent characters that perfectly reflected their game counterparts. They even had unique aspects given to them that helped them stand out in all the right ways. The action was phenomenal with great depth and detail that shows how much work was put into this. There were so many nods and references to other classic Nintendo properties that you'd want to go back to find them all. And Charles Martinet is in this with a small but great role. But with all that said, it does mess up its flow with some of the music. Definitely not the original score though, since it mixes the classic music with an epic and emotional tone. But the copyrighted music Illumination probably payed a third of their budget for felt out of place in this film and took me out of the experience a couple times. Other than that, it's an amazing that I'll gladly watch again.",
    "19": "As a Super Mario fan myself, I was hyping this movie up for quite a while. So was it worth that hype? Yes and no. The references, animation, voice acting, and world building are incredible. But, there's a lot of filler and the plot isn't that good either. Despite that, I still really enjoyed it. Though admittedly kinda unnecessary, I really enjoyed watching the Mario Kart section. Same with the Luigi stuff, especially the \"you just got Luigi'd\" line. Though there are some other problems like Toad not really being funny, and this movie is kinda boring sometimes, but it's mostly pretty entertaining. So overall, solid 7/10 movie, must watch for Mario fans but it may not be for everyone else. If you want a Mario film that's an actual masterpiece, go watch Cute Mario Bros The Third Movie. It's not really based on the series, but besides that it's incredible.",
    "20": "This movie wasn't bad, it wasn't good either though, it was just alright. Everything about it was alright. Whole the story itself felt pretty weak I feel a lot of people sat there and said I know that character or wow what a cool Easter egg, and thats why people enjoyed it so much. The movie itself sacrifices a lot of good storytelling to focus on these Easter eggs and nostalgia. A lot of the characters are really underdeveloped and I was so unmotivated to root for either of the Mario brothers. And idk who decide to cast Chris pratt as Mario but it felt so strange but Jack black definitely hard carried as bowser. 6.8/10.",
    "21": "Completely unmemorable. I didn't hate anything in the movie and even kind of enjoyed some of the funnier moments (Jack Black as Boswer steals every scene he's in) but it was so unoriginal and so formulaic it felt like a cliff notes of a plot rather than an actual plot. I'm still in the parking lot of the theater and I'm struggling to remember anything about the movie. Just the epitome of mediocre.I think it's also about time we stop hiring famous actors to play animated characters just because they're famous actors. Some of the actors do great in this, but there was absolutely nothing about Pratt's performance that justified him being cast.",
    "22": "There's an awful lot of fan service in The Super Mario Bros. Movie: long-time Nintendo players will certainly have their hands full trying to spot all of the easter eggs. I'm thinking that the writers of the film thought this enough, because they certainly didn't bother coming up with a decent plot. I can see a lot of adults finding the predictable storyline and weak humour tiresome; easily pleased youngsters will no doubt enjoy the rapid pace, crazy characters and colourful graphics, but I imagine a large percentage of those hidden references to games gone by won't mean much to anyone under the age of ten.It's a shame because the film looks great, the different Super Mario worlds brought to dazzling life in a welter of colourful CGI animation that is undeniably impressive. I only wish that as much care and attention had gone into crafting a script worthy of the creative visuals.5.5/10, rounded down to 5 for the 'happy' ending in which Mario's actions result in the destruction of most of Brooklyn, presumably with a death toll running into the tens of thousands. Wahoo -- that's a not so great!",
    "23": "There are some very minor spoilers ahead, i just want to say that this movie exceeded my expectations! The Critic score should not be taken seriously it's nowhere near a bad nor average movie. There are some things that i didn't like about it but overall i left the theaters with a smile.The Visuals are probably the best Illumination Studios has ever done, very smooth and gorgeous to look at. The human characters like Mario, Luigi and Peach's faces look different from their videogame counterparts and kind of weird at first but you will get used to them and at least their clothing match but on the other hand the animals and creatures from the Mushroom Kingdom like the Koopas, Donkey Kong and Bowser all look very accurate and detailed.The Voice Acting, Sorry but Mario does NOT sound like Mario, at all in this movie! I'm not a fan of Chriss Pratt's acting as Mario. Luigi sounds better but not accurate either, Peach is good i guess and Donkey Kong sounds like Seth Rogen...Yay... Bowser however, gets a straight 10/10 Jack Black actually tried to sound like Bowser and he should be cast again as Bowser in future movies. Long time Mario fans will be surprised to know that Charles Martinet is also in the movie, but not as Mario... The character he got to act for is such a waste and not even worth mentioning to be honest.The Story is not your typical Mario videogame story, it's actually baffling at first how literal they took the Mario \"origin\" story of him being a New York plumber. The movie starts going in the wrong direction but as the movie goes on it becomes better and better and ultimately it worked in the end. The pacing is very fast there is no real character development except for Luigi and maybe Mario but there's just too many relevant characters and not enough time to flesh them out. At least they all have defined personalities.Overall, it's not an Amazing movie but definitely a fun and good first outing by Nintendo and Illumination, it's full of Mario references and just good fan service like a Mario movie should be. Here's hoping future Mario movies!!And 8 but giving it a 10 to even out the hater trolls.",
    "24": "Graphics were fine, nothing spectacular. Bowser was only interesting when he was being menacing and any other time he was just stupid. Mario and Luigi had no connection. Peach was meant to be a strong and empowering female, but lack any depth. Toad was really bad. King was ok but Seth's stupid laugh was exhausting. Basically, besides the Nintendo references, there's not much to this movie. It just moves from one action scene to another with some stupid offset comedy between scenes. I was expecting something similar to Wreck it Ralph in style, heart and storyline. But by the end of it, it just feels empty and my kids didn't like it either.",
    "25": "It is a cute movie that does have some great references to most of not all Mario and Donkey Kong games. It was fun if you ignored the fact that the changed a lot of the elements that make Mario. Mario generally rescues Peach, not Luigi. Didn't follow any of the cannon story of Mario. Pratt is not the voice we love. Did they choose to state he was faking the voice all these years because Pratt couldn't do Mario the whole time? To loose a great voice actor over a subpar movie because you needed a name to drive up revenue was not the answer. It was just step for cheap lines. Jack Black was a welcome addition.",
    "26": "Can't help but feel like a massively missed opportunity for such a massive IP. While a lot of elements are added in from various games over the years, the script is simply flat and uninspiring, while fails to really showcase the wondrous world of the Super Mario Universe. However, I do understand that the film is a serious undertaking, attempting to introduce a somewhat dated character to a new generation of viewers who may or may not know much about them, but I think a better balance could have been done to appease both type of fans. The music score is definitely a highlight of the overall film, and I think that says a lot about the overall quality.",
    "27": "Pros: it looks nice and sounds OK. The creative department showed obvious care in the making.Cons: the \"story\" is an absolute garbage, the aim was to cram as many 'memberries from the games into the 92 min runtime as possible, with a connecting tissue that is as complicated as a wedge. The pacing is also all over the place; I checked twice my watch to see how much time's left, and parents all around did the same. From a Super Mario BROTHERS movie Luigi is absent in about 80% of the movie, Mario has more screentime from which half the time is being outdone by Peach and degraded to a side character in his own movie.This flick cannot even tie the shoelace of Puss in the boots: The last wish, and is easily one of the worst movie Illumination produced so far.",
    "28": "This Movie was actually really good. It was really well written,The fast paced action scenes were well done like the final battle in Brooklyn. I love the visuals and animation. It's really accurate to modern games and also has references to Previous Mario games and other games made by Nintendo. The soundtrack was really catchy (That even got My all time favorite 80's song Take on Me in the movie and It was playing in the Kong Kingdom scene) Some scenes made me laugh (We don't even need Toilet humor to make people laugh) Charles martinez who voiced Mario and Luigi even was in the movie and the most surprising thing was we get to see Mario and Luigi's Family. I honestly do not see any flaws in the movie not gonna lie. Overall a really great video game movie and the one who broke the video game curse the most.",
    "29": "This movie, about The Super Mario Bros on their journey through the Mushroom Kingdom, is the perfect Mario movie I never thought I could experience!I almost can't describe how enjoyable this was. So many characters and elements joined this incredible journey, and my attention was caught the entire time. I really loved the style and the way this movie was executed. Much was going on, but many things also gave enough time to let us enjoy, be happy and/or laugh about it. And speaking of laughing, I did it many times. The humor was just right! The Lumalee was unexpected hilarious, though!The story was kind of simple, predictable and straight forward, but that's how the Mario games are, aren't they? An interesting thing is that most of this movie was actually kind of about what we usually don't see from the characters in-between the main scenes from the games. We usually only see or hear the same moments or lines from each game, but this movie brought even more detailed personalities and backstories to the characters that really made some depth to the story. The best of all is that this part was done in a fantastic way. It didn't ruin anything! There were also a lot of fan services, but who doesn't love that when you're a big Mario fan? Super Mario Bros. (1985), Donkey Kong (1981) and Mario Kart 8 (2014) were just some parts of the huge amount of Easter Eggs. My favorite part was probably the Mario Kart sequence! There was so much to take in!Even though neither of the well-known characters were voiced by the original actors, the new actors did an incredible job by continuing to make these characters present their original personalities, and bring on the love for the audience. A great casting!The animation and its details and lighting were just insanely impressive! The most recent Mario games have great graphics, but it was both strange and amazing to see these characters in this amazing-looking world by Illumination Entertainment. Everything looked so original and good, and it was just like being inside games in a realistic way. It felt so alive! I also appreciated that there were surprisingly many, epic scenes that really gave some cool and awesome moments in a cinematic way!My props also go to composer Brian Tyler who created, reused and mixed many familiar melodies from many of the games that brought so much nostalgia and good feelings to the experience. There is no Mario without Mario soundtracks!This is my inner child's dream come true, and I'm forever happy that this movie came to life in a perfect way. So much could have gone wrong, but directors Michael Jelenic and Aaron Horvath made this successful in every way, and therefore, this is my favorite animation movie of all time!",
    "30": "It's barely even a movie, given it functions mostly as a big, long ad for Nintendo products (Mario games, in this case). It has that lovely Illuminationâ„¢ style of humor throughout it all, the stunning shallow writing we've all grown to love from them, and the immaculate character development we certainly expect to be blown away by. It's awful, really. There are so many plot points that make zero sense and function merely as a way of getting the film moving without really adding anything to the story, it all feels infinitely pointless and hollow.At least the world they built is pretty, that's the one positive.",
    "31": "A 90 minute game of \"spot the reference\" wherein all of the references pertain exclusively to a single 30 year running video game series that will appeal to absolutely nobody outside of young children with no attention spans and adults who've played literally every single entry in the series...so it's a good thing I've played literally every Mario game, multiple times.But aside from spotting some of the hilariously subtle Easter eggs peppered throughout the movie, and identifying which games they came from, yeah, it's bad. I know defenders of this thing will only respond to criticisms of thin characterization pointing out the characters in the games are thin too, however, the games are content to leave their characters entirely undeveloped, and instead just giving them broad personality traits conveyed through facial expressions and body language, and I can envision a Mario movie in which non-characters with heavily animated personalities can be successful, however, instead of opting not to develop the characters at all, illumination instead under-develops them, which to me is significantly worse. At one point we're given a random emotional beat from Donkey Kong where he wants to be seen as somebody who does more than smash things, a beat that is given no buildup and no legwork is put in in order to place that beat into a broader character arc. We're teased with an origin story for Princess Peach that never pays off. Mario and Luigi are given inadequacy complexes brought on by fears their father is disappointed in them that gets dropped throughout the entire second act before resurfacing very suddenly in the third act. And the list goes on.Had illumination merely wanted to replicate the excitement of the games by throwing us directly into an abstract action comedy romp using the mushroom kingdom as their toy box, I'd have been perfectly satisfied with that, however, instead we're given a litany of half baked characters sporting either set-ups with no pay-offs, or pay-offs with no setup.",
    "32": "This movie is simply just another example of a movie studio, trying to make a few bucks. They try to capitalize on the popularity of the video game, but failed to understand what it takes to actually make a movie. There is no character exposition or world building. It is just one video game reference after another in an attempt to hold your attention without realizing that there really is no plot. Granted, I never played the video game to any degree, but I shouldn't have to to be able to enjoy a movie about it. It wasn't a bad movie, but it was a very good one either. A little bit more thought and work could've made it a decent film.",
    "33": "I try to review this from lens of a kid and as a kids film. It's a bad kids movie. It moves too fast. Fails to develop the characters in any meaningful way. The plot is lost and convoluted. Princess Peach looks weird. Cross-eyed. It tries too hard to fit too many video game components into the movie instead of focusing on the story. Chris Pratt's voice as Mario is BAD. Mario himself is easily the worst part of the movie. Some kudos to Jack Black's Bowser and the turtle kingdom elements which are the best part of this film - but it could the used a lot more. The animation in this film is good - so four out of ten stars for that.",
    "34": "This is the most generic, predictable, bland movie I've seen. It has the most simplest and AI done story. Basically, the loser is a protagonist, but is no longer a loser by accomplishing something. That is the most basic done so many times before story I've seen. The models are fine, but the characters move in a generic, basic, so good it's bad way. The music although decent, is just basically a not-so special AI orchestral cover with random themes shoved in, and inappropriate use of licensed songs. The good qualities are the Peaches song and Charlie Day as Luigi. Barbie is the complete opposite of this movie. It does have a story with actual good humor, great acting, and likable characters.",
    "35": "The Super Mario Bros. Movie was amazing! We needed this movie! The computer-generated imagery animation was amazing! And surprisingly, Chris Pratt did an amazing job on voicing Mario in this movie! And I also found out Chris Pratt is voicing Garfield for the 2024 Garfield Movie, so hopefully he does a good job on voicing Garfield! I honestly get entertained by both Mario and Garfield! Before this movie was announced, I've never imagined Nintendo and Illumination would make an incredible movie like this! It would honestly be funny if Mario met the Minions from Despicable Me because it's an Illumination movie, but something like that wouldn't have to happen because this movie is all about Mario, not Despicable Me. Thanks for this movie!",
    "36": "The story isn't deep? It's for CHILDREN!!! It's a Mario movie for crying out loud. It's not FOR you. It's made for children to enjoy but has plenty of references and nostalgia so that parents can sit along and not wanna blow their brains out being dragged to a child's movie.It doesn't need a deep plot for it to be good for what it is. It actually takes the damsel in distress trope of (all) the Mario games and flips it on the head; Luigi is the one captured and Peach is a badass.The worry about Chris Pratt that people had was for naught. He sounds great and it makes sense for the context of the film. All the cast does a great job. If I didn't know Peach was played by Anya Taylor-Joy I would never have guessed. Same for Keegan-Michael Key as Toad. Charlie Day, Seth Rogen and Jack Black are instantly recognisable but that isn't a knock. Their voices fit really well. Especially Jack Black as Bowser. I can't imagine anyone else doing as good a job with the character.The action pieces are super fun, the jokes mostly landed which surprised me, and the film is stunning. Every shot is beautiful. You really buy into their world.The references to the Mario games and just video games in general are perfect and virtually infinite. From sound effects, to the score, to tiny details in the background. It seems there's something every other 30 seconds to have a cheeky smirk at, to think \"I got that\".My main criticism is the pacing. Often today, I find too many scenes to drag on or seem out of place. This isn't it's problem. The opposite intact. I felt like it blasts you over and over with new information. You never get much of a chance to settle and fully admire the joke or the action in the scene.The ending of the film too also reminded me a lot of the second Sonic movie, but that's just the nature of how these adaptions need to be.My other main criticism would be the lack of heart the film as compared to say the Sonic movies. But again, I'm not necessarily the film's target audience. So it's not too big of a complaint.Overall me, my partner and my 4 year old son (dressed as Mario I may add) had a blast with this in the cinema and absolutely look forward to more in the future.And all this comes from a Sega kid who never understood the appeal of Mario until this past Christmas when my son got a Nintendo Switch.",
    "37": "I went into the theater fully prepared to like the Super Mario Brothers movie (although reading some of the middling reviews from MetaCritic tempered my expectations somewhat) and I walked away with a resounding feeling of 'meh'.This movie has what I would describe as a breakneck pace, bouncing between mediocre comedy, mediocre action scenes and soulless character moments. All the while sprinkling in iconic tracks from the video games alongside jukebox favorites which do not work at all; playing 'Take on Me' immediately after the Mario Kart theme gave me whiplash, as with a lot of this movie.",
    "38": "Nintendo is very protective of their copyrights and characters, including the game publisher's favorite portly plumber, Mario. If you ask anyone, they could tell you why. In the wave of Nintendo mania, the 80s and 90s were littered with sub-par products to capitalize on their success in the video game market. Things like the oft-lampooned 1993 Mario Bros film and the memetic CD-i games are just a few of the lapses in good judgment the company displayed during this time. Frankly, I don't blame them for playing it close to the chest when it comes to their properties.The Super Mario Bros. Movie is a direct reflection of that hesitance to branch out. It is a product to advertise before all else. Nintendo gave this to Illumination because they knew they were the people for the job. They knew they could produce the most generic, yet profitable \"product loaf\" imaginable. They likely gave the studio three criteria when making the movie: fill it with references, make their theme park look good, and stay in line. Anything else (memorable moments, good story, character development) were all tertiary or not a concern in the slightest. I don't doubt Miyamoto was heading this in the slightest, as any attempt to push Mario into even a slightly new direction or give characters any dimensions at all is thwarted by him.The voice-acting is Hollywood A/B-listers as the main cast instead of real voice actors. Again. What, was SUPER MARIO not enough to sell the movie? Some of the performances are better than others, but it all just sounds so bland. Some of them don't even try to do a voice (Anya Taylor-Joy, Seth Rogan). It really is a shame they don't get people who can actually say lines in a booth properly for these animated \"film products,\" but if that's what they think they need to do to get people in the seats, then whatever. It's far from the worst thing about the movie.The movie's greatest flaws, by far, are its writing and pacing. There were a few moments in this that were genuinely cringe-inducing. It pulls the movie down from pretty average 5/10 kids fare to downright awful. I'm not even exclusively referring to the references they embarrassingly try to mangle into dialogue. There are parts where two characters are just talking to each other that are so stilted and unnatural, that it makes me think this was written in an afternoon without even as much as a cursory look-through. That said, the references are just as unbearable in this. Lines like \"your princess is in another castle\" and \"it's on like Donkey Kong\" made my skin crawl. And they're all said with that smug \"wink-wink, that one's for the REAL fans\" tone. Gives me a headache. I promise you that the guy who wrote Big Mommas: Like Father, Like Son and Minions: The Rise of Gru doesn't care about Mario Bros. I don't really mind the nods to the games (what else do you do with a Mario movie in 2023, after all), but I can't help but see this as a cynical way to drive interest in the 30-to-50-year-old manchild demographic. Consume product, fellow Mario fans.When it's not making surface-level references to the games or other Mario media, the movie rushes through its set-pieces like it's literally racing towards a finish line. The way they blitz through Peach's hack-writer-mandated sad backstory in less than a minute made me actually laugh out loud. The only laugh I had during the movie. They don't even stop to let the new, whimsical surroundings of the Mushroom Kingdom sink in. Mario adjusts so well to his new surroundings that you forget that he's a plumber from Brooklyn in a fantastical new world. Doesn't help that every 10 minutes there's a pop song playing to take you out of it. Another check mark checked off the animated kids film product list.All in all, the Super Mario Bros. Movie relies too heavily on references to distract from its terrible script and boring characters. Aside from a few good orchestral renditions of the classic OST, a handful of okay voice performances, and passable animation, there isn't anything here for you unless you're 10 or you have a shelf of Mario memorabilia and an overpriced Mario Lego set on your shelf. If \"it's a kids movie\" and \"it isn't supposed to be that deep\" are your only defenses for this \"movie,\" might I suggest playing a Mario game instead? They might lack a good story, but at least those are fun.",
    "39": "Since we waited all those Years For a Mario Movie, This one is An Amazing Surprise, Heck Even Chris Pratt Does an Amazing Job voicing Mario that He did an impression of Walker Boone or The Late Lou Albano voice From the old TV Shows, Luigi has the Best voiced by Charlie day and Peach She blew my Mind and Very awesome that she can do anything, I can't wait to see what Nintendo Movies Has to Offer in store for us I don't care about critics Saying it's bad, All the fans and All of us will Enjoy The Movie No matter What, I'm happy it's a Great Movie that broke 30 years of cursed video game movies!",
    "40": "Simple story, great animation. All I wanted from a Super Mario movie was a big nostalgia hit, a fun, funny and beautiful movie, this hits all the notes I expected!! It's amazing to be fully immersed in the Mario world. All the voice acting is on Par, Chris Pratt as mario really didn't bother me at all.Yeah the story is simple but iv never played a mario game for it's cutting edge story, for me they done well to fill in the movie with excitement and fun despite its weak story. It had all the parts of Mario we've all grown to love. It's a great start and I really can't wait for a Nintendo universe and a sequel to this movie!!",
    "41": "The Super Mario Bros movie might be the worst video game to movie adaptation I've ever seen in my life, it is legitimately terrible, even as a massive fan of the games, I left this movie just wondering why I wasted my time.They got everything, and I mean everything wrong, since when would Mario team up with donkey Kong? Why would bowser play piano in any way, shape, or form? (That was the only good part of the film), who thought it was a good idea to have Chris Pratt voice probably the most iconic video game character of all time?Back to that, Chris Pratt was legitimately horrible in this role and I didn't laugh even once, heavily being carried by Jack black and the peaches love song.F.",
    "42": "Major reserves heading into this, but I can honestly say it wasn't bad.Some questionable choices for the voice actors. Chris Pratt was actually okay. Jack Black was great. I would not have chosen Seth Rogan as Donkey Kong. He was good as Pumbaa, but as DK he was just Seth Rogan. Anya Taylor-Joy was fine as Peach, but of course they couldn't make her the damsel in distress. That's like so yesterday.Story line was decent. You got doses of Mario and Luigi through the years in many parts throughout the film, whether it was 'Luigi's Mansion', 'Mario Kart', or simply the older Super Mario games.Saw it with my 5 year old and he had a blast, so at the end of the day, mission accomplished.",
    "43": "So i just saw the movie in the cinema and i need to say that im pretty disappointed. The movie just give a lot of references to all the mario games and others nintendo games ( mario kart, donkey kong.). But i need to say that i still dont understand that they made Brooklyn and made Mario and Luigi lived there: why? Wasnt supposed to be more easier to make us dive into the Mario world directly: i found that choice really off topic and dont bring anything except a waste of time and to know Mario parents dont really interested me at all. I mean the animation was really gorgeous and the animation work pretty well but i feel that movie was an interesting experience visually but the plot and the quest that didnt really find it interesting to be honest and was not necessary. And to see them talk take me time to dive into the movie. I found the comedy moments ok. It was not really funny but the comedy is still there for people who interested in this. We have basically a movie who give a multiple references without really keep out of their comfort zone like usually with nintendo games. It was ok but i just liked it mothing more and nothing less. An interesting visuals and animations but nothing more. A movie to see with the family for sure.",
    "44": "This movie was a lot of fun. My 9 year old and I loved it.The animation was superb, the story was very entertaining, and there were moments my mouth was open and I was leaning forward in awe. I may be hyping it up more than it actually is, but I want to have more movies like this.Starting with the animation, very detailed and carefully done. You could see the detail in the fabric of all the clothing, especially the shy guys. There's a sequence where they're traveling under the city of Brooklyn and the water was so realistic. I loved when they got to the \"Mario Kart\" portion because they did not skimp on the details.The story was excellent. They started Mario and Luigi off with humble beginnings and even included their family. There was an actual build up to the adventure which helped buy into the story. Though it did not stick necessarily to the traditional Princess Peach needing rescuing from Bowser, Mario was still his own hero and rose above the put downs being placed on him by Bowser and others. What gave me chills was at the end when Luigi helped Mario and they teamed up to beat Bowser. It was very heartfelt and epic.Though Princess Peach wasn't the traditional damsel in distress, it was evident none of this would have resolved without Mario. Princess Peach was still the apple of Mario's eye, but his brother was also very important to him.Lots of little Easter eggs (I think the Game Cube ring tone may have been my favorite).Two end credit scenes, but really hoping they do more that is at this level.",
    "45": "Great movie to bring the kids to; no chance of an uncomfortable conversation afterwards that you weren't ready or planning for. I really enjoy the depressed star and cat suit scenes. Jack Black blew me away, Chris Pratt was okay, Seth Rogan was terrible. I hate that these studios feel the need to put celebrities in kids cartoons; typically these narcissistic idiots blab on interviews or social media and turn people off from watching their movie. Just give me one famous actor or actress with a unique voice as an easter egg for me to figure out; none of my childhood cartoons had famous voice actors.",
    "46": "You get the slurry that is churned out of the literal conveyor belt that is Hollywood Studios these days and the latest variant of distilled rancid gutterleavings is this movie.Spoilers incoming because I need to have them.The only thing Illumination got right in this movie is the bright colours and character designs, everything else outside of that is dross. We start with an insult to the 80s cartoon and it only gets worse from there.Story makes no sense - why would Bowser keep people alive after capturing them? The only one he ever did was Princess Toadstool and that was for kidnap and ransom purposes. There's no point to Luigi and the variety of other characters being held in cages other than to do the issue this movie is full of.References.I don't go to a movie to say 'oh yeah, I know what that means' I go for a story and there isn't one here.Musical Numbers that of course would be in there because of course there's going to be, in a MARIO MOVIE. When was the last time you thought of Mario and singing? Never. But certain people are in this so of course there's going to be times where he just needs to break out into impromptu vocals that aren't needed.Like I said at the start the only thing this movie has going for it is the visuals as they're massively on-point, its bright, colourful and works with the idea of Mario games and is more than anything just an advert for all the various Mario related games at once and who needs an advert for a Mario game, the name recognition has more scope than the Pope these days.",
    "47": "Was assuming that I would just zone out and relax as my 13 and 10 year old grandsons took in the film. But, actually, I found it quite engaging with a clear narrative drive and clever nod towards the tropes of the Nintendo world (most of which I was only vaguely familiar with). We watched in 3D which was ok, giving the scenes some depth, but there were no 'coming out of the screen at you' moments which was a shame. The soundtrack is a bit lazy - really, you want to use 'Holding out for a hero' that's been used a million times before and 'Mr Blue Sky' (?!!) - but at least we got Beastie Boys, though you do feel they could've dug deeper for some less well used tracks. So decent entertainment for under 16s and, given atrocities like Trolls, I'm perplexed as to why the critics turned on this animation rather than some of the others.",
    "48": "If you are not a big fan of Mario, then you won't like this movie very much, there isn't much story and the dialogue is very childish, but if like me you are a huge super Mario fan then you will love this movie, the amazing cast did not disappoint, the cinematography was great, the story wasn't bad and the movie was just very good in general, it was the perfect super mario bros movie.I've been looking forward to this movie since before it was announced and I had some very high expectations, and they did not disappoint, it was the perfect fans service film for a super mario bros fan. 8.5 out of 10.",
    "49": "Overall it's just fine but I can hardly say I went into a film called; \"The Super Mario Bros Movie\" expecting anything other than a light, fun time and I think it's fair to say it gave that too me. The music choices really grated on my nerves after a while and the voice acting is definitely hit and miss, I also think the film could've benefited from being about 10/15 minutes longer since the story just feels so rushed through. But despite that the animation is gorgeous, the world is well realised, it's got a lot of entertaining sequences and I don't really think anyone is going to come out of this feeling like they didn't get what was sold to them. It's hardly the deepest or most ambitious animated movie I've seen but it'll definitely appeal to kids and I think I definitely would've loved it if I'd seen it at that age.",
    "50": "Finally a movie that's just entertaining, no hidden messages no agendas, just watch, enjoy. Everything about this movie is enjoyable, classic story telling, graphics are great, story flows, follows the old. People probably don't remember Super Mario Brothers 2 but you could play as Peach, Toad etc as well.In this day and age we need more movies like thisGreat voice acting, reality is we didn't hear Mario's voice for the first time till much later, so the Italian vs not doesn't mean much to me or anyone else looking to be entertained which is what the purpose of Hollywood is, entertainment10/10 hope Hollywood does more like this.",
    "51": "Did not have much expectations from the movie, however the movie was actually very good. For fans of Mario you will find several instances of nostalgia and references from the game. If you just want to follow the script it does elicit a few laughs and is great fun to watch with family and kids. Overall a totally enjoyable experience with many characters from the game and adventures for Mario and Luigi to take on. Grab some popcorn and enjoy the movie with family. It is fun, entertaining and has a decent story line. Don't expect a Pixar or a Disney and this movie stands on it's own. Enjoy it and have fun.",
    "52": "Well, there was a movie from back in the 90s that attempted to bring the Mario Bros to the big screen, and basically failed. I remember loving that film, but looking back of it, and in light of this one, I sort of wonder why. Anyway, I couldn't help but compare the two films, though I have to say that I really didn't consider this one all that great. However, one thing I do have to mention is that they did go much further out of their way to link it with the game, including having Mario jump all over the place, and also the pipes that suck him through to other parts of the realm.Anyway, the story is about how this guy, Bowser, wants to marry the princess of Mushroom land. He has managed to get his hand on this power up, a star, and sends his island of lava in her direction. Meanwhile, the Mario Bros, two out of luck Brooklyn plumbers (Luigi is a bit of a clutz mind you) are trying to start out on their own, only to be sucked through a pipe into this land.The problem is that I'm actually not all that familiar with the world of Super Mario Bros. Well, okay, I do know that Donkey Kong and Mario do exist in the same world (and I believe that the classic arcade game Donkey Kong was actually the first Mario Bros game, and they certainly do pay homage to these old games). I guess that is one thing that the previous film didn't do, and that is bring Donkey Kong into the picture.One thing that I found interesting was that they eventually landed up in Brooklyn, which I don't know if it ever happens in the games, but then again I'm not really all that familiar with the games so I honestly cannot say whether this is the case or not. Anyway, as for the film, I personally can't really say that it is one of those films that I would consider the greatest. Actually, I sort of considered to be, well, somewhat dull. However, I know my brother enjoyed it, so I guess that is what counts.",
    "53": "I grew up on Nintendo and understood the Easter eggs throughout the entire film. If you kids of the '80s grew up on Nintendo, then you gotta check this movie out. I even got to meet Charles Martinet, back in 2018 at a video game expo. This is nothing like the 1993 Super Mario Bros. Movie, which was released by Disney under the Hollywood Pictures banner. This movie was released by Universal Pictures in partnership with Nintendo. What's even better is that you got a star-studded voice cast. Jack Black did a good job voicing King Koopa. Keegan Michael Key as Toad, Seth Rogen as Donkey Kong, Anya Taylor-Joy as Peach, Charlie Day as Luigi and Chris Pratt as Mario.",
    "54": "The Super Mario Bros. Movie is a 5 out of 5 star movie that will delight and dazzle fans of the video game franchise and newcomers alike. It is a colorful and vibrant animated adventure that follows Mario and Luigi, two plumbers from Brooklyn, who are transported to the Mushroom Kingdom, where they join forces with Princess Peach and Toad to stop Bowser from taking over the world. The film is full of humor, action, and nostalgia, featuring an all-star voice cast led by Chris Pratt as Mario, Anya Taylor-Joy as Peach, Charlie Day as Luigi, Jack Black as Bowser, and Seth Rogen as Donkey Kong. The film pays homage to the games, while also creating a compelling origin story for the brothers. It is a fun and heartwarming film that celebrates one of the most beloved and influential video game series of all time.",
    "55": "The movie was so fun!!! The entire family truly enjoyed it since we all used to play the game back in the 90s!!! The animation was just spectacular and the cast delivered an amazing performance!! Loved Chris Pratt and Charlie Day as Mario and Luigi!! Their voice acting brought so much heart and emotion to the characters, which was much needed to these characters! They both just nailed it!!!Same goes for the rest of the cast who all captured the characters well. Keegan Michael Key, Anya Taylor Joy and Jack Black were fantastic!! Loved the soundtrack and music too! I hope they expand the universe to more movies!!! Definitely watching it again!",
    "56": "If you are looking for something deep and life-changing, then \"The Super Mario Bros. Movie\" is not for you. If you are looking for mindless fun and some amazing animation, then this movie is DEFINITELY for you!The story is essentially like watching an insanely beautiful walk-though of a game made up of bits and pieces of all the Mario Brothers games. No surprises...except when it comes to the animation, which is amazing to see and makes this a great film for the big screen.Considering the many existing reviews, I won't say a lot more other than it's loads of fun and should work for anyone just wanting a good time.",
    "57": "I loved the movie a lot it's so well made in every aspect, it's the ultimate Mario movie. So much fun besides some frustrations, I was delighted to sit next to a beautiful woman that was very sweet to me. The music is excellent, colors were glossy greatness, story flowed well, and entertainment remained excellent throughout!The only annoyance I had was how the screen was black for awhile to the point where I had to tell an employee before I did I tried something to a guy walking in with drinks to see if he asked he was a complete moron about it and he said I don't work here; that made no sense someone can be concerned without working there thankfully I went to an actual employee cause they didn't even know it had an error that auditorium has had that before with Ant-Man: In the Quantum mania.",
    "58": "It was perfect. It was silly, and it wasn't \"mature\" but it was great. Honestly felt like a fever dream ðŸ˜‚ and a certain song... All the characters were done brilliantly, (and by that I mean they are just like the game) people who thought the VA's that we're chosen we're bad for the role, they ended up perfect! The characters that stood out to me were Donkey Kong and Bowser. Being a life long Mario fan I was really impressed. It was done perfectly, the visuals were beautiful. Jack Blacks performance was amazing. The story was not \"complex\" but it doesn't need to be. It's just a great movie you can sit and enjoy without having to think. I loved it! 10/10 movie, and the perfect adaptation! Fit for fans of ALL ages!",
    "59": "It's just gorgeous , the plot is really good , it gives out many references to the game and it's pretty nostalgic , the visual stimuli is pretty good , so watching it in 3D like I did is definitely recommend, I found it hilarious at times and I had such a great time with my friends in the theater , the graphics are perfect and the voice actors did an amazing job , it's also pretty well-paced , and the characters are all really funny and interesting , if you are an adult who wants to live some nostalgia or if you got a kid , you'd definitely have to give it a try , you won't be wasting your time .",
    "60": "I have always been a fan of the Super Mario video games. I grew up playing them. I was sort of disappointed after watching this film adaptation. It did not make complete sense. The storyline was off and needed to be improved. It was all over the place. The cast selection was fine. They did not fully connect to their respective characters. There was not much originality with this film adaptation. All of the viewers who grew up playing the Mario video games would have had high expectations with this film. I felt that this was a real disappointment and a letdown to everyone who is a fan of these video games.",
    "61": "This movie is absolutely awful. The storyline sucks. Wait. What storyline? The whole movie is just awful. This is honestly right down there with sausage party. I can't believe that anyone would pay to see this movie. The only cool hidden nostalgia/Easter eggs is the little rid bits of music and sound effects hidden within the movie. If you're not paying attention, you'd miss it. But then again, there is nothing worth paying attention to in this movie so you probably won't miss the cool music (at times). This. Movie. Is. Just. Plain. Awful. It's not even worth streaming anywhere for free. Don't waste your time.",
    "62": "You ever get that feeling in your chest when you watch a movie that's that great? When you watch a movie and you get tears of joy, not only because of the film itself, which was great btw, but when it also makes you feel nostalgic? That's this movie. Take if from an early 90's kid who started in the gaming community with classics on the SNES and Super Mario World. If were one of those kids back then, and you enjoy that good feeling of nostalgia, then spare an hour and 30 minutes of your life watching this beautiful masterpiece. You won't feel disappointed watching this movie. Jack Black actually enjoyed his role of Bowser too. :'D.",
    "63": "The super Mario Brothers is a film aimed at kids or anybody who still has the nostalgia for the video games they played around the 90s. What I found particularly good within the realms of this movie was how visually stunning it was combined with it playing homage to the games in a variety of scenes emulating the typical Mario old school camera angles. With a bit of Donkey Kong alongside some Super Mario Kart action this hit home on all accounts in trying to bring to life all things Mario on the big screen! Admittedly I don't think this type of movie will have the same impact once it becomes available on some of the streaming apps. The stand out moment for me was the battle Mario would have to encounter in order to get the help of the kings army, the encounter with none other than Donkey Kong.The story is pretty basic, still, considering this is video game material, who'd really expect something with layers upon layers of depth? No pun intended this one does \"exactly what it says on the tin\" and it succeeds in focusing on what it is, rather than trying to be something it isn't. Another memorable moment to accompany the battle was early on for me, I was somewhat flabbergast by the level of detail in the sewer and the rain splashing away reflections that looked ultra real taking computer graphics up a notch in my book. The brothers start out as plumbers wanting to get their name out to the world and not be seen as a joke; all they want is to be taken seriously. The pacing is fast as we are soon bolted into an entirely different world below Brooklyn down through...Of course a tube, then millions of green tubes. Just like the game right? The world us gamers will be familiar with within the Nintendo that sees talking mushrooms, power ups and of course endless attempts to complete an obstacle course.The main obstacle though for this animated feature length to hit the heights of say a 'Toy Story' or a 'Wreck It Ralph' is the lack of sophistication required to keep the older adult member engaged. At its core it's very simplistic, not allowing itself to expand to the wit or humour others have prior to it, without the adult humour jokes, it must solely focus on creating relatable emotion or empathy that everybody can relate to. Despicable me, had a character that was appealing to the older audience whilst catering to the younger with his cute minion amongst minions. This isn't a major problem as I think it's target audience consisting of kids will respond with joy. So success, success, we've done it! We've done it! But to take it a little further into acclaimed animated feature length history, to finish the race in first place on the podium, it really did need just a little more! The story of Princess Peach no longer being the damsel in distress seemed fitting.The voice actors all appeared to do a good job for me as well as the direction and classic retro Mario video game tune. The singing of (Jack Blacks) Bowser felt more than a little out of place to me, maybe Jack just fancied a little sing song again. As long as we're together.",
    "64": "The Super Mario Bros. Movie was the best FAMILY movie in a decade! With no political agenda or ideology added to it! With the bright colors and the storyline of saving the Princess's realm, the nostalgic returns, and the easter eggs, this was a great movie.My childhood video game dreams of a movie - all showed up in a great film. The voice acting was great, and the bright visuals and the Easter Egg-infused music made this movie great!I told my wife as we were waiting for the after-credits that this was my kid's \"E. T.,\"; which is the very best part. They will remember seeing this movie in the theater!",
    "65": "Finally I've gotten the chance to watch this movie and it didn't disappoint at all. The voice cast was great. The animation is gorgeous and this was a fun filled comedy for all to see. Two plumbers trying to start a business are accidentally sent into a world and are separated from each other. Luigi is captured and its up to Mario to save both princess peach and his brother. With the help of toad, donkey Kong and others they try to defeat Bowser. I loved the story. This movie made over a billion dollars and I just hope we get more!! This movie brought me back to my childhood and it was a blast. Definitely check it out.Timothy Treakle.",
    "66": "\"The Super Mario Bros. Movie\" is a co-production between Japan and the United States from 2023, so this is a really new movie and the Japanese component stems of course from the Nintendo background as this company is even one of the producers here, which you don't see too often with movies, not even animated movies, but it is pretty much a given here as this is all about Mario, one of the most famous video game characters of all time. But before I get to the story and characters, I wanna say that it is also a good thing because after all Nintendo created him and his wonderful worlds back in the day. In the end, the language is not important anyway, as you can watch it in your native language simply as you don't see actors then having different voices than their own. At minimally over 1.5 hours this is not a long film at all and I say that completely without judgment as I feel it is not crucial how long a film is if we connect it to the question if a film is worth seeing and good or even great. Here the running time felt okay I would say. There are three directors here and just one writer, which is something you don't see too often. Two of the directors come from the \"Teen Titans Go!\" franchise and have collaborated there already and that would be Horvath and Jelenic, who are both from California, even if their names don't sound like it. The third is Pierre Leduc, who interestingly enough started his career with Mickey Mouse almost 30 years ago and then rose to fame mostly thanks to all the Despicable Me films and spin-offs. This is where Illumination as a production company also comes into play. Same is true for Matthew Fogel, who launched his career with a Martin Lawrence drag comedy, then went on to Lego before he finally worked on a Minions movie and now he is with Mario. Quite a journey. Especially the jump from said drag movie to Lego after a break of almost ten years seems extraordinary.If we look at the voice actors, the American ones, it is roughly who you would expect. I mean it's literally people who could also play these characters in a live action scenario I suppose. Chris Pratt I started disliking quickly after Parks and Rec, so not too big on this choice. He is so overexposed. Anya Taylor-Joy is still kinda alright, but I had other problems with her character here. Charlie Day, well \"Always Sunny\" never really did a lot for me if I'm honest and he may have been a key reason. Jack Black I cannot really say too much negative about, he is okay and finally Seth Rogen I don't like a lot either, but him voicing Donkey Kong is maybe the most obvious choice here. Keagan-Michael Key for Toadstool? Interesting. No judgment there. The minor character, even the protagonists' parents, got voiced be actors that are totally unknown really and many of them have Italian(-American) backgrounds, which is definitely not a coincidence. But overall I am not too big on the voice cast here as you have understood already now I guess and this was also one reason why I decided to go for the German dub. There the actors were alright. One of the better aspects and the film's problems and also biggest strengths were elsewhere. One strength for me is the retro background. Mario is literally my youth in terms of video games and I am sure this is true for millions, if not billions of other video game fans and people who watched this film. I mean it even reached the top spot on the imdb popularity meter, so this shows I am not the only one. The overall rating for this film is fairly solid, but critics did not like it a lot, so it probably will not make an impact come awards season 2023/2024. The release date is maybe not helping a lot either. But they probably wanted to get it out still before summer when people don't really go to the movies that much anymore. Well, people except me I should say. But that is another story.I will just talk about what I liked most about this movie. Of course, the biggest thing is seeing all these beloved characters. It helps so much if you know them and I myself was always more of a Luigi guy than a Mario guy, but both are cool. You can add Toad, Donkey Kong, Bowser, the Koopas, but also the smaller characters like Bowser's closest assistant there who had magical abilities with which he could rule himself basically or also those ghosts, like the one really big one at the wedding or Donkey Kong's father (who I thought was his grandpa in the game or uncle, but anyway). With the latter, even if he was not a crucial character, I was still baffled that he was part of this movie (I almost wrote \"game\") as his connection with Mario is literally not existent and the Donkey Kong version as the protagonist of his own games and not merely the antagonist from the very old video games was something I did not expect, but it was a pleasant surprise. I could go on and on about many other characters, but I will leave it at that. Another brief inclusion I quite liked was the idea of the challenge the princess had for Mario as it simply included a lot from the video games or that skeleton turtle that Luigi runs into and thinks he defeated it was cool too because I remember myself how annoying it was when they were just a pile of bones, but got resurrected right away. I wish they could have kept going with these direct references to the video game(s) until the very end. But sadly, they did not. There is some Mario Kart racing included here, which is also cool and loved the game so much, but this was already something were I felt this could have been handled better and in a more nostalgic fashion, but it was no such thing sadly. It all went a bit downhill from there and felt written and directed in a way to mostly please and satisfy those who are not too familiar with the video games. The references get fewer and fewer as the film goes on and approaches the end. Pity. I was willing to give it a 4/5 or 8/10 after the first 40 minutes still, but eventually I just can't and I say this is a good film, but not a great one and at the same time a missed opportunity.Another problem I personally had with this movie was the inclusion of Princess Peach. Of course, she had to be in the film, but she is almost a co-lead and that is way too much. She even jumps around like a massive heroine when the truth is she was not once a playable character in the games. As far as I know. So why was she so defining in here? I assume the filmmakers were scared maybe that people would criticize them for not coming up with any powerful female characters? I think it's pathetic. She is literally hardly in the games at all and all we know about her is that Bowser abducted her or so if we find out anything. In a way, there is a parallel here too, but Bowser wants to marry her. He is also pretty jealous, but luckily they kept the love story between her and Mario short or basically non-existent. Only Toad thinks there may be something. But yeah, we even find out about the princess' youth and how she ended up there with the toads. This was not needed. The wise Toad was still cool. Also not needed was the story about Donkey Kong and especially Mario's lack of approval from their fathers. Which in a way turned them into friends. They tried to go for depth when all they should have done was go for a gigantic fun movie. I enjoyed the three seconds much more when we see Donkey Kong lie in his hammock and eat a banana than any of this emotional pseudo depth that was done away with in the end within seconds when Mario's father watches his son deal with Bowser. Interesting reference, however, that turtles are not one but evil in our world. In fact, they are among the most awesome creatures out there I dare say. From my perspective at least. So here and there, there is stuff to enjoy again and most of it was linked to the question what I remember the most from the video games.That slightly strange creature with an emo touch that was also Bowser's prisoner in a cage did not do too much for me, so it felt a bit off that they brought it back for the closing credits too to show us its saxophone talent for whatever reason. But yeah, other than that the music was great. The best aspects were the tunes that came directly from the video games. The songs used otherwise were really nice too and truly famous, even if I am not sure if they fit the film that well. I'd say that they maybe didn't. Take the Bonnie Tyler song for example. I mean it's a great number, but in the context it was included, I would give it a nay, even if it was not so bad that I had to laugh like others in the audience did when it came to another song choice. But well, it is Illumination and I am also not a huge fan of the Minions films (I prefer the \"Despicable Me\" movies), so it makes sense they took the wrong route there. I also would have done without the Minions depiction in the opening of the film because come on, leave them out, this is all about Mario, even if you try to make a clumsy connection with Minion Kart or whatever that was. The scene where Mario showed us his superpowers and what happens when he consumes mushrooms and is able to fly could also have been handled better. It was mostly the moment when he had to go up against Donkey Kong and beat him, so that the army of apes would fight with them. I was not won over by this either. In the end, the film was really nice early on, but eventually leaves a lot to be desired. Scenes like Bowser playing the piano were simply not funny and did not have connections to the games, so they should have ditched them. Stuff like Donkey Kong throwing a barrel after Mario on one occasion cut the cake so much more and they did not even have to invent this from scratch. Which means that where they invented, the film did not go right. I still hope there will be a sequel and that it will be better. There's still a lot to offer that has not been included here like Wario, Fire Flowers and Yoshi. Cautious thumbs-up for this first film.",
    "67": "All I can say is if you are a Mario and Nintendo fan you will love every second of this move and even if your not it's and amazing way to introduce yourself into the Mario world.The attention to detail is fantastic and the music is expertly composed with so many nods to all the Mario games and accompanying game franchises within Nintendo's world.I will return to the cinema multiple times to see this film as many times as possible.Thank you illumination for creating the movie I hoped for, you have made a long-standing Nintendo fan extremely happy and can't wait to see where the Mario Bros will go next.",
    "68": "Brooklyn plumber brothers Mario and Luigi are just about to get stuck in to what appears to be a broken water main when they find themselves whisked off to a realm where a) the laws of physics are no more than an amusing notion, and b) thuggish moster ape/turtle/lizard thingie Bowser is about to invade the idyllic mushroom real of Pricess Peach in order to get her to marry him. Mario has to try to recruit the Donkey Kong army to help while searching for Luigi.My poor hand/ete coordination meant that I mostly just watched my kids playing computer games, but my recollections suggest that this film, while having its own story, is pretty faithful to the orginal naterial in terms of looks and feel, and that is surely a large part of its raison d' etre - let's bring in the 40-year olds who played through the various Mario Bros games, and let-'s load the movie up with nostalgia. And that's exactly what they've done.But this is generated by Chris Meladandri's Illuminations (the company behind the Minions) so they know how to be funny, well-crafter, thoughtful, colourful, action-packed, just enough drama and jeopardy, and with a good helping of heart. And this is all those things, too.The voice casr is stellar and on good form. The visuals are faithful to the games, cinema standard, wonderfully animated, and well worth seeing in 3DAll in all - Wahoo!",
    "69": "I'm convinced that these directors have never played a Mario game. There are inconsistencies in this movie that I will go over a bit here, but if you would like more detail, I will make sure to include it in a YouTube video.Firstly, they got the most crucial plot element wrong. Peach is the one that is supposed to be kidnapped! Not Luigi! One could argue that they are trying to flesh out Peach's character, but why is this movie called Super Mario Bros when the bros are not even together 80% of the movie!Whose idea was it to cast Chris Pratt as Mario and Charlie Day as Luigi? They sound nothing like the video games and every time they spoke I wanted to facepalm. It's so off it's not funny. Why does an ice flower freeze Bowser when it doesn't not affect him or any of the other Koopas on the video game?? Seriously, get out your 3DS, Switch, Wii U or whatever and try to freeze Bowser during a boss battle on the game. IT DOES NOTHING!!!Why is the origin of these two off? Remember in the original game, Cranky, the original DK kidnapped Pauline and Mario (Jumpman) had to save her? Yeah, that didn't happen. Also, when Donkey Kong first appeared, why did they play the DK Rap? They could have played the Donkey Kong Country SNES title theme remastered! Then I would have cheered.Bowser singing on the piano was cringeworthy, and I don't care how much you want to make it epic, an invincibility star only lasts 13 seconds tops, not two minutes. Oh, and those surprise cameos from Charles Martinet. He plays a character who looks like the original Mario. It just reminds me of Uncharted on how they got the original actor just to waste them in a cameo.I can't wait till they make a sequel and cast Kaitlin Olson as Daisy, Jordan Peele as Toadsworth and Brie Larson as Rosalina. It'll be epic it tell you!!",
    "70": "I saw The Super Mario Bros. Movie, starring the voices of Chris Pratt-the Guardians of the Galaxy movies, The Magnificent Seven_2016; Charlie Day-Fist Fight, the Horrible Bosses movies; Anya Taylor_Joy-Peaky Blinders_tv, The Witch and Jack Black-Jumanji: The Next Level, Tropic Thunder.This is a movie based on a video game and as I have mentioned before, I didn't play a lot of them growing up-I know about some of them but I just didn't play them. There has been some talk about the casting-Chris as Mario in particular because he is not Italian-but I can only tell you about my experience. Chris/Mario and Charlie/Luigi are brothers that work as plumbers in Brooklyn. After a freak accident, Chris & Charlie get sucked into a Mushroom Kingdom where they discover Anya/Princess Peaches is in battle with Jack/Bowser, who wants to destroy the Mushroom Kingdom and marry Anya as an afterthought. Chris and Charlie join the fight and there are lots of Easter Eggs for all the fans of the original games-at least that's what I've heard, including eating certain mushrooms that will give a person extra power, car races on Rainbow bridges, Donkey Kong and I'm sure a lot others that I don't even know about. There is a scene just as the end credits start and another one after the movie is finished.It's rated \"PG\" for action and mild violence and has a running time of 1 hour & 32 minutes.Although it's not one that I would buy on DVD, I'm sure fans will love it more than I did and it would be a good one to stream.",
    "71": "Whatever you do... Do NOT listen to any of these stupid movie critics, as a huge nintendo fan, this movie was freaking awesome! The story is built amazingly and the characters are very well developed such as mario and luigi and their brotherly relationship that is very limited. This movie was fire and no matter what fan you are, this movie tops almost every other movie out so far this year!Again, do not listen to movie critics for all they want is for great animated movies to be pushed down while they give companies like Disney full blown 9.5/10... most of the time they are filthy lies and you should take an actual audience advice, nit these liars.",
    "72": "I've played only the original Super Mario and that's about it so I wasn't really all that familiar with Donkey Kong, Mario Kart and even I can say that this movie is 10/10 - hands down!The cinematography, action, music and the overall experience was amazing and we finally have a fair rival to Despicable me.Genuinely, I don't think that (some) people cannot see past the whole Mario Character (he was great, don't get me wrong!) as this is so much more than just nostalgic one-off movie for the fan base.I have no doubt in my mind that this is only the beginning the Mario franchise and there's many more to come!",
    "73": "Since the creation of Super Mario Brothers franchise, the story of Mario was simple. A big enemy to be defeated in order to save the princess.This time, Mario is a regular human that travels to another world and have to save his brother Luigi from a big enemy. Nothing changed significantly. However, everything is oversimplified or is not explained at all. Mario never question why he is on another world. Peach never question the fact that a human could travel to that world. Even Mario's family live their lives as Mario and Luigi didn't disappear.In my opinion, the screenplay writers were more upset about adding more references to the movie more than creating a solid argument. Even they skipped Mario's characters arc at all. He is the same person after the Mushroom kingdom.I really enjoyed the movie, but I think that Illumination have to upgrade its writers. They showed that is possible to compete with Disney on animation quality, but a good idea or IP is not good enough to support a hole script.",
    "74": "I loved every minute of this movie. It was everything it promised to be, and everything you'd expect. Funny throughout, cartoonish and goofy, nostalgia filled, action packed and a beautiful looking movie. Seeing my childhood come to life through all of the easter eggs and game-incorporations was amazing. It reminded me of so many memories and little things I forgot from the world of Super Mario. It leans on nostalgia to stake its claim but - when your a Super Mario movie, you can afford to do that. The animation was great as expected and the classic soundtrack remixes and alterations were great, accompanied by some well known music hits. I enjoyed traversing and navigating the mushroom kingdom, jungle, rainbow road and more, and it was so refreshing seeing the successful expansion of these small game maps - and the universe as a whole. I really liked how Mario and Luigi's backstory is shown and how they dont live in the mushroom kingdom - they stumble across it. I thought this was such a great was to craft a real story out of the games. I can happily say I wasn't let down by a single facet of the movie - it landed for me. This movie is not though provoking, deep or anything more than surface fun - and it never tries to be! You have to rate a movie based on what its objectives, goals and genre are, and if it succeeded in them. You can't go expecting fight club or apocalypse now out of every movie. For what this simple movie sets out to do - I think it nailed it, in every way.In terms of dislikes I guess I would have preferred if the ending never takes us back to Brooklyn. When Mario gets launched back there I was a tad disappointed as I felt it took me out of the fictional and beautifully crafted magic land. It felt a bit avengers like as bowsers ship shows up in our world and mayhem ensues on the streets of Brooklyn. I wish taking down bowser was self contained in the fictional world, and wasn't mixed in with the real.Overall, The Super Mario Bros Movie delivered on everything I wanted - Action, music, world building, character background, nostalgia, easter eggs, true to the games, and humor. I was smiling the entire time.",
    "75": "A videogame movie masterpiece that wont leave you bored even for a second. This is not your monocle wearing \"film\", its a family popcorn flick through and through. If you grew up with Nintendo or know anything about the core Nintendo franchises you're gonna love this movie to bits. Drawing inspirations from the core franchises, Sprinkling in enough references, paying proper homage all the while going new and interesting directions with the plot, is a testament to how most videogame movies should be made. Perfect set of cast, absolute zero complaints, heck I wanna praise Chris Pratt & Jack Black so much for absolutely NAILING it! Absolutely no complaints on the movie, could it have been better? I cant think of ways to make it any better.",
    "76": "Illumination could have completely phoned it on on this film, as an animated movie starring Nintendo's most beloved characters was pretty well guaranteed to make bank. I'm impressed with how much care and respect actually went into this film. Fans of Mario and Co. Will appreciate all of the clever references and amusing jokes left for those of us older fans. Meanwhile, kids alike will eat up the colorful visuals and funny gags.The story is light, as you might expect, but it's more than serviceable. The 90 minute runtime means the film never lets its foot off the gas. Pratt's voice isn't as distracting as I worried it might be, while Charlie Day and Jack Black steal the show with their brilliant casting. They definitely updated Peach with a splash of #GirlPower, but it's still Mario and Luigi's movie at its heart. Throw in some enticing after credits scenes and we have the makings of a full-blown mega-hit franchise.",
    "77": "To put it simple; this is not a movie. This is merely a collection of CGI-ads for a bunch of Nintendo games, tied together with an extremely nonsensical, forced and forgettable story . So forgettable, you forget it as you're watching it. It's pretty much like the writer just had a checklist of games and references he wanted to include and then just shoehorned some sloppy padding in-between.Usually a successful animated movie bring an appeal to both young and old with it's comedy and charm, but this movie have non. This is just a bunch of \"Remember this? And this? It's Mario Kart! And now it's Super Mario Bros! And now it's Donkey Kong! And now....\"So if you're looking for a movie that just references a bunch of Nintendo games, this is for you. If you're looking for a good and fun movie, this isn't it.",
    "78": "A light fun filled movie with not much plot twists. A great watch if you want to chill and have some fun. I am not an OG gamer or such and didn't nolay Mario much. Also, I am not much familiar with most Nintendo games. Still the movie was a great experience. The animation and music is great. The Parkour, runs and karting are done well and it feels exciting to watch these moments. The story is pretty much simple story of bowser wanting peach and also to rule the world. The Mario brothers trying to make a living getting trapped in an alternate world with talking mushroom and other fictitious beings is a nice concept. All the characters that comes and all the kingdoms we see are also well written and animated which makes it a very good experience to watch.",
    "79": "While Illumination isn't known for making the strongest animated movies, The Super Mario Bros Movie is by far their best so far, rivaled only by the original Despicable Me. The animation in the movie was superb, the voice actors all did a surprisingly good job (especially Jack Black, who did really well as a hammy comedic villain), and, while it isn't a laugh riot or anything, there was still some good jokes that made me laugh. The references to the Mario games (which I won't spoil here for you to find on your own) are well integrated, and while some are a tad forced, it was still really cool to see these things return. All in all, it was a really fun time, and I'd recommend this to any Mario fan, or just someone who's looking for a fun animated movie.",
    "80": "After re-watching this its clear this is just a fun movie without all of the normal preachy over the top holly wood narrative stuff (starts with the letter \"W\" and rhymes with \"Poke\") that has been ruining movies for the last 10 years.Its great to see how they build in bits from the game like actual kart racing too. The voice actors got some flack from some B lister actor who starred in the terrible 90's Mario movie, but the complaints have bounced off like Mario on a Mushroom.Peach seems a bit more \"feminist\" shall we say and not exactly the traditional damsel in distress we expect, but otherwise this is a fun movie well worth a watch.",
    "81": "The Super Mario Bros. Movie 2023 is a movie that I won't be able to remember in a week. The movie is average at best but mostly for super fans and little kids.The relationships had me disappointed the most. Most are just one dimensional and the princess is yet another mary sue character.in a sea of mary sues in todays media. The original mario was simple but the stakes were higher. Mario goes to save the princess. How the writers failed in making this on par is beyond me.In what world is it so easy to see the royal family by chance. The royal family must be doing a s**tty job in defending the kingdom.For whatever reason the toads decided to make peach a princess. She looked different and was mysteriously skilled at everything but they did not question if she was a spy.The princess leaves the faith of the kingdom in mario to secure a foreign army, someone she doesn't know very well. What happened to her own army and defences? Did she have a backup plan for when mario failed?Mario having to complete the obstacle course before adventuring out is dumb. Almost as if power ups are conveniently placed in the world for the plot and that the princess knew that he'd be challenged.Also,why was mario even asked to duel instead of the princess??It felt like I was in a zoo being showcased all the mario characters in a dumb children's playThe mario games, in essence, is an adventure. This movie wasn't about the adventure but about the destination with some parkour.I liked the mario game as a kid but I wasn't a super fan. So if the writing isn't good, what's the point?",
    "82": "I've got to say that whoever edited the trailers did Chris Pratt dirty, he actually sounds pretty good in the movie. While he only really brings out the classic voice for a commercial gag in the beginning he replicates Martinet pretty well, and the New York accent he uses for the movie sounds good as well. Most of the cast does a pretty good job as well, with Jack Black obviously stealing the show, but Anya Taylor-Joy's performance was actually pretty disappointing as it felt pretty wooden. Seth Rogen was by far the worst though, he just sounds like himself, annoying laugh and all.The story was pretty standard but I really didn't mind it too much, with the comedy either actually being pretty funny or just cringe. There was way too much licensed music though, if they actually played the \"wake up in the morning feeling like P Diddy\" song it honestly wouldn't be too out of place.",
    "83": "It was refreshing to be able to take my kids to a movie and not have \"the message\" or some agenda shoved down their throats. It was just good light-hearted fun. Laughed out loud at times. My kids all loved it and said they can't wait for the next one to come out. Especially with the after credit scene.Disney has made it clear that they are more interested in pushing their \"values\" on young children and now Universal has filled the void left by Disney.I thought the voice acting was really good. The animation was outstanding and there is stuff for all ages to enjoy. If your looking for a good time out with the fam, you won't regret seeing Mario.",
    "84": "I wish that we had gotten The Super Mario Bros. Movie back in 1993 instead of the live-action dumpster fire we were given. This would have been a dream come true back then because it's a fun & faithful recreation of the NES games I grew up on. However, it's obvious that this movie was made for kids. It's not as humorous as I had hoped it would be and there are a few shortcomings I can't really overlook as an adult. And I don't think the rising generation will appreciate this adaptation like I would have because the games are so old. It's a great video game adaptation that arrived just a little too late.",
    "85": "This is a movie that feels like a love letter to all the Nintendo fans out there, even if they don't necessarily play Mario anymore. The film delivers a fun and enjoyable experience for viewers by faithfully adapting every aspect of the game into the movie, including the Mario Kart and Donkey Kong franchises. The movie is packed with non-stop action and fast-paced storytelling, leaving little room for some of the more significant elements that fans might have wanted to see. It may not be able to fulfill every fan's wishes, but it's understandable and sets up for a sequel, as there is a post-credits scene.But for general audiences who are not familiar with Mario enough, this might be a movie that is difficult to understand. There may be questions like why does it have to be like this? Why do it this way? Why is the world so strange? This is because the story hardly explains in detail for us to know how the world is. Even though the story is simple and has nothing much. But if you don't think too much, it's an easy and enjoyable movie to watch, with the lovable characters in the style of the works from the studio that made Despicable Me.",
    "86": "Sometimes you come across a movie that takes no risks. It's light on story, avoids character development, and focuses on getting to the next scene as easily as possible. Mario Bros. Doesn't have any inherent plot holes or issues, but it tends to leave you in a state of just being a viewer rather than participating in the movie. In the end, it's not bad per se, but comes off as flat and lifeless.The positives are all agreed upon by anyone who likes it, because the positives stand out by not being able to be compared against anything else. People have fun with the action. They love the Easter eggs. And the composed music is good. The action is done well, but without much dramatic weight, only carry the movie so far. Easter eggs don't nor should have any bearing on how good the ovoid is. The music was well incorporated, minus the pop songs that truly don't work.It's not good enough to play things easy, and rely on fans to spot visual Easter eggs, to call the movie good. It's average at best mostly because it was watchable and didn't have any outright flaws. It just didn't take chances that could've ended up becoming flaws. Even if you had a good time watching it, there's not enough value to see it again. If you're a fan, check it out. If not, you won't miss a thing by skipping it.",
    "87": "As a purely fluff piece - it's fun, bright spirited, and enjoyable for families. A movie that has all of the elements you'd want represented from Super Mario bros video games, and as a bonus, it also showcases Mario cart and donkey kong junior. The animation is strong, the worlds are exactly like the video games and truly fun moments for kids. The runtime is great and the movie moves along without pause.AND I expect better, higher quality movie making.The voice acting in this movie is so lazy. Chris Pratt is forgettable-anyone could have done better voicing such a beloved character. Princess Peach is the same - voice acting is boring and fairly emotionless. The worst voice acting belongs to Seth's terrible Donkey Kong junior - not a single attempt to make an actual character voice, just Seth's normal voice slapped on Donkey Kong. Toad's voice acting is also meatless and without any real jokes.The script is mostly empty and there is little to no attempt at character motivation, organic character decision making - for example, why Princess Peach tells Mario he can come with her to save her kingdom. Almost every opportunity to make a joke is skipped. None of the characters have stated goals aside from King Koppa.And saddest of all to me, there is no attempt to create backstory or give context to these beloved worlds and characters.",
    "88": "5 out of 5 stars.The Super Mario Bros movie is an awesome animated adventure film that is one of the best adaptation of a video game series. It has everything you can ask for. Its like an open world of nintendo game series like Donkey Kong making an appearance.The film is fast paced. The plot is good. It has a story about the bros. The film features a lot of easter eggs that can hint for more movies. The action sequences are awesome. Bowser is an awesome villain. The animation is beautifully done and stunning. The voice talent is also great.One of the best sequences involving a mario kart chase on a rainbow road is insane. Fans and kids will love the series and love how everything is put together in this film. Overall, i love everything about the film. I can not wait for more.",
    "89": "First of all: This is A MOVIE FOR KIDS, it's not for grown ups, don't be a 30-something or 40-something years old and expect to see the best movie of your lifetime. It's not gonna happen, it's a kids movie.When I was a kid I saw the old Hopkins-Leguizamo movie... OMG, it was horrible. I get it, we didn't have CGI back then, but an animated movie like this one would have been amazing. Waaaay better than that... garbage of a film.This new one explores all the common elements of the franchise, beautifully crafted world with attention to details. My 7 year old girl LOVED IT. I was kinda bored, but she loved it, this rating is for her, that's what's important, it's a movie for kids, they should rate it.There are a lot of man-childs on the internet criticizing it. Don't listen to them. If you have a kid who loves Mario just take them, no doubt about it. If you're a nostalgic grown up, you're not going to have a bad time, but it's not what you expect, there are like 1 or 2 \"grown up jokes\", that's it, it's not like those disney movies that have a lot of hints for grown ups, this one doesn't, it's a KIDS MOVIE as it should be.I get that grown ups need to be entertained, but it shouldn't be the rule, the most important thing is that kids love it.",
    "90": "The headline basically tells the story. This is not a good movie. Anyone who claim this is a great fantastic movie probably have some issues. But this is neither as horrible as I see some people argue. This is just a middle-of-the-road sometimes funny decently entertaining movie with bad music and very lazy writing.The good is that this is decently fun, even funny a few times. And if you are a fan of the games, especially Mario Cart, you will smile through many scenes. The voice acting is great, and if you are a simple kid you are likely going to love this. Sadly there ends the good stuff.The bad starts with the story, or rather lack thereof. Because it is as simplistic as the games which is both a strength and a weakness, but mostly a weakness because this movie offers nothing. It is actually kinda soulless and cliche. The music is mostly atrocious. Just put on Mario Cart music on bad speakers and you basically have this movie. But what really bothers me though is that the lack of story and very simplistic writing which feels so lazy. No one really cared. They only wanted to make a fast paced Super Mario Movie with as many callbacks and in-house jokes as possible, and that is it. There is no deeper meaning, nothing new, no real character development, nothing worth noting. Also most of the fun stuff you already saw in the trailer, it is not much else. So lazily done.Sure you might have fun watching this, because it is not a bad movie, but will you remember this a few weeks from now? Will this be a classic? Do you want to see more? The answers to those questions is a big \"No\".In the end I give this a 5/10. If you have kids you think you might like this or you are high and want to get away from reality for a while, perhaps go see this. For the rest of you this will be a Meh at best.",
    "91": "There was an uproar when Chris Pratt was announced as the voice of Mario. Personally, I don't hate Pratt (although I don't love him, by any means) but it was a disconcerting sign that The Super Mario Brothers Movie might be taking the typical Illumination Studios route of throwing a big-name cast on top of an uninspired script. Now that I've seen the movie, were those fears justified? Yes. Yes they were.I'm not, by most definitions, a \"fan\". Especially by current definitions, which require you to Stan anything you even remotely like to the point of issuing death threats against anyone who dares to speak ill of it. If I like things, I like them for personal reasons, not to tie my identity to them or to take part in some screaming mob. I don't tend to get hyped for, and subsequently disappointed by, the latest big-budget movie. Worst case scenario: I'll forget about it a year from now.But I was cautiously optimistic for the Super Mario Brothers Movie. I'm not a gamer, but like many of my generation I have a lifelong association with Mario. My first video game console was an NES. In high school I played Mario Party and Super Mario Kart for hours on end with my friends. Recently I completed Super Mario 3D World on Switch--probably the first video game I've played all the way through in at least a decade. I guess you could say the franchise is important to me.Beyond the actual games themselves, I like the universe Nintendo has created for Mario. It's colorful and comforting and fun. I like the gentle characters, the imaginative game mechanics, the simple storylines and low-key conflicts. If I ever got an urge to write fan fiction, I'd probably set it in the Marioverse. It might not be great, but it would be sincere and nostalgic and full of the joy that the games have given me. Super Mario Bros., by contrast, feels like it was made by a team that never played a single Nintendo video game, much less understands what is appealing about them.Everything about this is boring. The story is rote and chock full of confusing decisions. The characterizations are flat and dull. The action sequences move so fast, with so little impact, that none of them really matter. The animation is...well, fine I guess, but I'm not giving anybody credit for simply NOT ruining the visually-pleasant environment that game designers have been building upon for forty years.The screenplay--as per usual in such cases--is the culprit. It's the standard kids-movie template with nothing in the way of heart or wonder. Just a bunch of famous people talking fast and pretending that's an inherently funny thing. Every animation studio apart from Pixar is terrified of sincerity these days, so SMB takes the typical approach of being its own episode of Cinemasins by having the characters constantly lampshade every bizarre aspect of the Marioverse that the games have simply taken for granted over the years: \"Okay, so these bricks float in the air, that's normal.\" \"Whoa, a talking mushroom, I guess that's not weird or anything.\" I think studio executives have this idea that they need to pander to the adults in the audience with these constant self-referential quips or else we'll spend the entire movie laughing at how little sense it makes, but guess what, Hollywood: not every adult is a detached YouTuber who cynically combs through genre movies to crow about \"plot holes\". Some of us just want to invest in a fantastical world without reservation. Some of us want to go on an earnest adventure without a jaded peanut gallery continually cracking wise and undercutting everything that makes a magical realm special. Can you imagine how insufferable Peter Jackson's Lord of the Rings trilogy would be if every other line was Aragorn being like, \"Okay, an evil wizard made a ring that turns people invisible. Random!\" Then he leads a a ghost army and Galadriel shows up for no reason other than to deliver an aside like, \"Well, THAT happened.\" Raise one eyebrow to show how unflappable and nonchalant she is. Then she does kung-fu or something because STRONG FEMALE CHARACTER (who will be completely marginalized in the third act so the men can save the day).So yeah, all the usual criticisms. A talented cast with nothing interesting to do. A shallow story that has no meaning and serves no purpose except to link together a bunch of pre-existing things you already know you like. A sense of humor that plays into the modern \"alternative\" comedy tradition of standing outside of things and ironically observing them rather than participating and having genuine feelings about things. A stupid and obvious soundtrack with thirty-plus-year-old pop songs. (That's especially egregious when Mario games have amassed possibly the most iconic musical library of all time. Does the tired training montage really benefit from the made-famous-again-by-Shrek-2 Bonnie Tyler hit \"I Need a Hero\" when it could be using, I don't know, ANY Koji Kondo track?) A movie that chooses to keep apologizing for its own existence rather than having any fun whatsoever.That live-action adaptation just keeps looking better and better.",
    "92": "As I started to write this review, I was told I was being too harsh on this movie. I was told to think of it more as a video game playing out on screen, to just have fun with it. And frankly, I have a different perspective, as I will get into. But it just reminds me of the beauty of film; the subjectivity of all our opinions. We can all go into the same movie, and all come out with a variety of different opinions, thoughts, and interpretations. Mine isn't the right one, it is just my opinion. But let me just say, it's a fact that audiences are going to enjoy the heck out of The Super Mario Bros. Movie! My proof? The audience I saw it with went nuts for it, there was lots of cheering and clapping, and a round of applause at the end (reactions I haven't seen since Spider-Man: No Way Home). But while everyone else was clapping at the end, I was sitting there thinking to myself: \"That's it?\"Before you try and guess where this is going, NO I did not hate this movie. I enjoyed myself the whole time and loved so many moments in it. I have played Mario games all my life, especially lots of Mario Kart, so seeing these iconic characters and locations on screen was a blast. There were so many references that made me smile, and I even loved how cues from the music in the games were used in the score here. The whole movie has many great moments, from the Mario Kart scene to the Donkey Kong vs Mario fight, to the training scene in the Mushroom Kingdom that plays out exactly like me trying to play the games (a real struggle). But your liking or disliking of this movie really comes down to how far these Mario-isms go for you. The plot is simple, hollow even. The Illumination style doesn't help. But the Nintendo stuff is exactly what you want. So if you are a fan of Mario, you'll have a good time! If not, this movie probably isn't for you, you'll probably come out of it confused about why so many people are loving it. Me? I think I've established myself as very mixed.And yeah, some of you are going to say I'm being too harsh on this movie. Trust me, I don't want to be, nor do I think I am. I did love the Mario stuff, I just really would've liked an actual script next time... it plays more like a demo of the world of Mario. The movie is still really cute and perfect for kids, it does a great job of capturing the spirit of the games and the excitement of the set pieces, it is just a pretty hollow script that barely operates as a narrative feature. Mario, Luigi, Peach, and Toad are all very blank slate characters (although this is perhaps at the request of Nintendo, maybe they didn't want overly specific versions of these marquee characters). Really, I think most of my issues stem from the Illumination side of things. This movie has all the same qualities as any other Illumination film, from Minions to The Secret Life of Pets: it's got 20 gags (or references) per minute and really moves fast through story and character moments - it feels like a movie speed run. I would've liked it to slow down more, explore more of the world and get more time with the characters. It also had some humor that didn't work for me, but seemed to work for people around me (singing Bowser wasn't my favorite). But frankly, I really can't fault the movie for all this, it did what every other Illumination film does. So it's easier for me just to accept that maybe Illumination's style isn't for me. I prefer the Pixar or DreamWorks style, or if we're talking about this type of movie, I prefer The LEGO Movie or the two Sonic films as those were both very good stories with thematic elements while honoring their source material (and being very charming films too!)The voice cast was actually decent! I don't always love Illumination's insistence on hiring big-name actors over voice actors, but it worked here for the most part. Jack Black was awesome as Bowser, same goes for Anya Taylor-Joy as Peach, and the rest of the cast was pretty good too! But here's the big question: how was Chris Pratt's Mario voice? And the answer - it was fine. He did well for what they had him do, although I didn't love that this Mario had a Brooklyn accent over the classic Italian one. I thought it worked for the most part, but I still would have preferred they just use the original Mario voice.I can be critical all I want. I could mention how the needle drops were too much, I could go on about the lack of plot, I could complain about how I wished it was longer, but I don't want to. Because as a Mario fan, I loved so many moments here. I was smiling throughout the film. Sure, some things didn't always work, but I had a good time, as did everyone else in my showing. Kids will go nuts for it, it's a great family film. It's so joyful and energetic and feels like a fun adaptation of the Mario games. Plus the animation is fantastic! It's pretty cute, and will be very re-watchable. The movie is by no means perfect, but families looking for a good movie will find one with The Super Mario Bros. Movie! And of course, this will be perfect for any Mario fan!Now, time to go play some Mario Kart!",
    "93": "The complete absence of care.Mario & Luigi are treated like objects. Cliche one liners. No time to breathe. Only panic attacks. Bullying each other. Doing what they're told. Rush rush.Mario is not permitted to possess discipline, courage, imagination, heart, backbone, standards, have value in society and be proud. He hides, has anxiety, and wins by chance.Villains are worshipped. Allowed the breathe. Parade. Be the victim.All scenes have the single most cliche music possible.The start of the film puts you in a panic and blows your synapses using panic music, one-second cuts, and the sense of doom. It's also shot to put you on the side of the villain - before there is even a victim introduced yet. What are you supposed to think? Doom is exciting, interesting, and worth watching?The villains aren't shot with a backstory except for \"shock & awe\". Even in lord of the rings, villains were shot as slaves.Why make the film?",
    "94": "Is This a Big Joke?The Trailer Made it Look Like this Film had Great World Building and Characters and Story. This Film has None of that.Let's Get the Good out the Way First1. When Mario and Luigi Were Together at the Start of the Movie, it had a Much better Feel to it. But they are only together at the Start for around 10-15 Minutes.2. The Animation Style looks Great and the Water Animation looks Amazing at Times.Problems i Had with This Movie -1. The World Building and Character Development is Pretty Much Non Existent.2. The Story is Basic as Hell3. Because of the Abovementioned Point 1 and Point 2, the Movie Has a Feel that is Flat as Hell. It's Just a Bunch of Scenes.4. This Humour Wouldn't Make a 4 Year Old Laugh.5. Most of the Scenes Have no Feel, Energy or Motivation to Them. Except for the Princess Peach Training Mario Scene, The Donkey Kong Vs Mario Scene. And the Bowser Ship Entering Brooklyn Slow Motion scene Visually Looked Good.Overall, This Film was Nothing Like the Trailer made it seem like it Would be. This Film is a Complete Waste of Time.",
    "95": "In 1993, the live-action Super Mario Bros movie was such a travesty that it took three decades for Nintendo to dip its toes back into those waters. As such, 2023's \"Super Mario Bros Movie\" was highly anticipated but also wildly speculative in terms of what the final product might look like. The result: an absolutely smashing success from Illumination-a clinic in how to adapt a video game property for both the intended child audience and the nostalgic/legacy crowd!For a very basic overview, this movie tells the story of the titular Italian brother duo. At film's open, Mario (Chris Pratt) & Luigi (Charlie Day) are down-on-their-luck plumbers just trying to stay in business. But when an opportunity arises to save Brooklyn, they are mysteriously whisked away into the Mushroom Kingdom, where the evil Bowser (Jack Black) threatens the realm of Princess Peach (Anya Taylor-Joy) and Toadlings (notably Peach's closest assistant voiced by Keegan-Michael Key). Teaming up with Mario in this wild-and-wooly landscape, Peach must form an alliance with the Kongs-especially the warrior Donkey (Seth Rogan)-to stop the Koopa invasion.Adapting a property in which the user controls the experience-like video games-is always tricky for the big screen. Why would an individual want to watch a story about Mario & Co. When he/she could play it, right? Well, writer Matthew Fogel and directors Aaron Horvath & Michael Jelenic largely skirt this issue by leaning heavily on two mainstays:First, \"The Super Mario Bros Movie\" is made squarely for children. It is at that stage of life in which the Mario crew is often discovered, so this is 100% the right choice. In that sense, it plays like a Disney or Pixar flick with simply a more action/adventure bend to it. Does it mean that Bowser is often played for laughs? Yep. Do things get a little goofy at times? Certainly. But that is exactly how it should be in a Mario movie, as largely that is what the entire enterprise is based on-childhood fun! If you have young children who may not yet be familiar with-or just growing accustomed to-the Mario universe characters, this flick will almost certainly delight them!Just as importantly, \"The Super Mario Bros Movie\" does not short change the decades-long fans (like myself) who grew up with all this in the 1980s & 90s. Every scene or music cue here is imbued with at least some sort of significance to the broader Mario universe. Background \"Easter Egg\" references abound to the point that eagle-eyed viewers may find themselves distracted by the main plot in looking for them! Because so many warm-and-fuzzy, nostalgic memories are tied up in retro video game properties, seeing a \"Punch-Out CafÃ©\" or the iconic Duck Hunt mallard puts the viewer in a wonderful headspace to enjoy this experience.Truth be told, I didn't know what to expect as I settled into my theater seat. But as the credits rolled an hour and a half (perfect runtime for this fare!) later, I couldn't recall smiling for that long continuously at another movie in a long, long time. The children around me were enchanted by all of it and knowing laughs/gasps were exhaled at all the \"insider references\". I rarely have the desire to re-watch a theatrical release immediately upon finishing viewing #1, but this is the exception in which I could see it all again tomorrow and still have the same smile throughout!So, if you grew up playing Mario games-see this now! If you want to introduce your children to the Mario characters-take them to this now! Also, make sure to stay to the very end of the credits, in which some potential sequel-bait is teased tremendously. All in all, \"The Super Mario Bros Movie\" is a theatrical experience I will not soon forget.",
    "96": "Was excited about this one, the trailer look hilarious but it just didn't deliver.It felt like they didn't even hire a writer, the plot was extremely weak filled with plot holes and unnecessary adventures.looking at it it was a fan service movie, hitting everything fans would love to see but ultimately not a good movie.Sometimes video games shouldn't be made into movies. There was zero humor, all the best lines were in the trailer and it wasent just funny. The kids liked it a little but one of them just feel sleep.Illumination does great animation but lately they are lacking in the story side, nothing wrong with the design or animation but the humor just didn't work and they really need to hire better writers. It seems that they keep recycling the same humor as their previous movies.5/10 for the pretty animation, otherwise boring movie.",
    "97": "I always try to be genuine when it comes to the Big N. Certain years in Nintendo history stand out to me; 2009, 2013, 2017, and now currently one of the best years of Nintendo yet... 2023.I will criticize Nintendo when Nintendo deserve it and praise Nintendo when they deserve it too. This has to be the most self-aware film ever. The film knows exactly who it is representing.If you love Mario, you'll love this film. The animation is beautiful art, the music and soundtrack are fantastic, the whole thing has been handled with immense care. This movie is a love letter and thank you to Super Mario fans.Ignore the critics. They give bad movies good reviews a lot too you know. Peach is a boss and the movie is great.Nintendo wins again. I really felt the love and care, and everyone trying their best w this film. 10/10!!",
    "98": "This film is no 'original' idea like Despicable me...... it's not meant to be!!!It's simply a Mario film for the fans and sticks with all game themes beautifully (again, as it should be).Voices are perfectly cast....esp bowser (Jack Black).The plot was simple and totally expected. As it should have been! The game features transferred to the movie perfectly. Adult puns and jokes in there as well as ones the kids will get.Cheeky, little, cute Post Scene Credit (which as Marvel fans we know to hang around to see if there was one).Our seven year old son thought it was amazing and he only knows Mario Kart in the gaming world. So it's appealing all round for adults (nostalgia) for kids (pure fun).",
    "99": "This was a movie that I was intrigued about when I heard it was being made. I grew up with the Super Mario Brothers video game for the regular Nintendo. Getting Mario 3 was a big deal and I remember playing the game with my sister, cousins and even my father. The Mario games have been part of my life at different times. Jaime and I watched this on a Sunday morning for something light.The crux of this movie is that Bowser (voiced by Jack Black) takes the super star from the Penguin King (Khary Payton) to impress Princess Peach (Anya Taylor-Joy). A flooding event leads Mario (Chris Pratt) and his brother Luigi (Charlie Day) into another world. The brothers are separated. Mario meets up with the princess to save him and her world.What makes this the best to me is all the references to the Mario games ranging from the original to kart. It seems like they even incorporate Super Mario RPG as well as the Donkey Kong Games. I wasn't sure how well this would work, but I think they do a great balance of references with doing their own things. It did well at the box office and of course, is set up for a sequel. I'd watch it.Now I do know there was a bit of a backlash in having Pratt voice the titular character, since he isn't Italian. There are those that also felt it was a slap in the face of Charles Martinet, who brought such life to the character with Super Mario 64. I didn't mind it. They don't go over the top and I just like Pratt. The best voice though is making Luigi neurotic with Day. I liked seeing Taylor-Joy along with Black, Payton, Martinet, Keegan-Michael Key, Seth Rogen, and Fred Armisen. The voice talent is just amazing across the board here.This is also well-made. I'm glad that we have a combination of new school animation while giving a feel of what I grew up on. Again, paying homage to the games with locations is a plus. I also like that a couple times they follow the action like a side-scrolling 2D game. That made me smile. I like the music. They reference multiple songs across games, which is great. I think they did a great job with taking something as beloved as what we get here. It truly is a feat. If you're a Mario fan, shut off your brain and go for the ride. It is worth it.My Rating: 8 out of 10.",
    "100": "This movie was a lot of fun compare to the video game phenomenon! And it's not that bad if you want to talk about other video game films that was made over the years. Universal Pictures and Nintendo games did a pretty good job making this movie happen for the fans.Chris Pratt, Charlie Day, Anya Taylor Joy, Seth Rogen, and Jack Black did a solid job with there voice performances, I mean I guess I can't complain about the accents of Mario and Luigi, but to me I think it was a pretty good idea once you get use to there acting skills. And I gotta admit, it was pretty better than the original version that was made in 1993.What I really liked about this movie, is how they actually added many different cool video game references once you compare to other Super Mario Nintendo games. After all, Super Mario Bros. Movie is such an enjoyable video game movie ever made, and it'll feel like your playing Super Mario Bros games all over again!LET'S A GO!!!",
    "101": "This movie is a mario fans dream movie, with many Easter eggs from all the games to the plot being something different than the same save the princess plot. It shocked me how good this film is and deserves to be the best video game movie of all time. Though it was quite fast paced which made it a nine out of ten for me. But thats the only bad thing about it. Besides chris pratt mario. With the funny jokes and references to other games, this truly is a fantastic movie which i highly recommend to people who read this to go watch. You will not be disappointed by this film. Nintendo fans would enjoy this more since there's more understanding on whats going on with non nintendo gamers not knowing the references in the movie. With the best part being the fact they finally showed us where the blue shell came from. When the blue shelled koopa used it on Mario and donkey kong to stop them. Overall, a amazing experience that i will never forget. This is a really wholesome movie to me, how much detail and story that was crammed into a 92 minute movie. Some parts even made me cry just from being so nostalgic to me. I was there with the series when i got my hands on a DS and Wii back when i was young, the memories i made playing those mario games came back through this movie. Thats why its this good, the childhood memories of playing on your DS and Wii games that are Mario games really make this movie more fun to watch and understand. Like how Mario and Luigi throughout their whole life, people telling them they won't succeed. But show them that when there together, nothing is impossible. And felt that connection with my own brother since i was always being picked on when i was small but he was there to protect me like how when young Luigi was building a castle out of bricks and another kid destroys it and Mario comes help him. Thats why this movie is great. It has some really good backstory elements sprinkled in there. The super Mario bros movie is something you don't want to miss out on.",
    "102": "I have been a huge 'Mario' fan pretty much all my life, from a little kid until now, I still eagerly anticipate the release of the new games, I think 'Super Mario Odyssey' is a gaming masterpiece, so needless to say, I was immensely curious about this movie considering the original 'Mario' film still lives in infamy for being so terrible, and the fact this film was being made by one of my least favourite animation studios, Illumination, the people responsible for unleashing the Minions onto the world. My expectations were rock-bottom, but then the trailers started releasing and......it looked good, nothing groundbreaking, but I thought it would be along the lines of last year's second 'Sonic' film. I suddenly became really excited for a passable family film with great references and pretty solid humour.....which is still significantly better than Illumination's current output.Unfortunately, I found the 'Mario' movie to be a gargantuan disappointment, both critically and as a fan.The film's premise is very simple, when Mario and his brother Luigi get sucked into the Mushroom Kingdom and get separated, Mario works with the land's Princess, Princess Peach and a mushroom guy called Toad, to rescue his brother and save the land from the evil Bowser who seeks to rule it.This premise, is very similar to the video games it's based on, but unlike last year's 'Sonic' which uses the games' bare-bones story and expands upon it with classic story beats, while infusing pre-established series lore (I.e., Chaos Emeralds, Knuckles), the 'Mario' movie instead chooses to keep the plot as bare-bones as the games, now, this isn't inherently bad, though a bland story can be draining to watch for an hour and a half, but if the film's humour and characters are good enough it can be entertaining, however, this is another instance in which the film fails.The film's humour is disappointing....despite a few instances of genuinely funny interactions, mostly coming from Jack Black's lovelorn Bowser, a vast majority of the gags are very Illumination, they're the kind of jokes that a long-distant uncle might make, or a teacher, just the blandest, most generic instances of comedy....like a Sunday comic strip from the 1940s that send kids and parents looking for an easy laugh off, but lack any real thought or craft, at least, though, there are not fart jokes, a mainstay in Illumination's filmography.The characters are very bland too, every character is slotted neatly into an archetype and is not allowed to leave that for second to show even the slightest degree of depth, the characters are, in fact, giving more depth in certain video games, such as the 'Luigi's Mansion' or the 'Paper Mario' series, this results in barely any eternal conflict for the characters, which, on top of a bland story makes the film drag on even more. All of this topped off with pacing that moves faster than a bullet bill, which makes everything feel like a sugar-induced fever dream and, some characters who are shockingly missing, even from brief cameos.The writing is truly abysmal: the film's narrative isn't compelling in the slightest, the emotional stakes fall flat on their face, it doesn't feel at all like the characters go on a journey, everything feels empty and generic. There isn't a soul here, everything feels mass-produced.There are some positives though, the animation is really good, particularly the background animation and character design, the characters animation could have been a bit more expressive at points in my option. The score, too, was really great, the orchestral remixes of the games' iconic music is heavenly, the voice acting is surprisingly solid, Jack Black, Charlie Day, Chris Pratt and Keegan Micheal-Key are top-notch with their delivery, though, as much as I enjoy Anya Taylor-Joy as an actor, she currently anyway, isn't the best voice actor, her delivery never felt authentic to me, and, of course there are some great references, even some non-Mario ones which greatly pleased a Nintendo nerd like me.Overall, the 'Mario' movie was a disappointing experience for me, I went in expecting nothing more than a fun time with a few good jokes akin to 'Sonic 2', but instead I got a sugary pile of slop, that I can't see anyone under the age of 10 enjoying.",
    "103": "This is gonna be one of my shorter reviews, since the movie isn't bad, neither great.The voice acting was surprinsingly good. Keegan-Michael Key, Charlie Day, and Anna Taylor-Joy were my favourites. Chris Pratt as Mario worked pretty well, since this is a new take on the plumber.The visuals were good: colorful enviorements, beautiful effects and entertaining action.T\nBut the main problem with the movie is it's lenght. In 80 minutes, you don't get that much out of it. It feels like they had a script for a 2 hour movie , but it was shortened to not bore the kids in the audience and to save some cash.The movie features a lot of locations, but it's pretty lackluster in it's world building since we barely spend any time in those. The dialogue is extremely limited and the scenes go by so fast, that many times, they become somewhat irrelevant to the plot. Since the characters got out of a sticky situation with so much ease, it fails to make you care about anything. How am I supposed to care for Mario since he defeats his enemies with so much ease. Same with Peach: she just gets into sticky situations, but a few seconds later she just gets out of it with the help of some deus ex machina crap.There's no set up, no polished character arcs, there's no pay-off, no forshadowing, almost anything.The characters are flat, boring, and lacking in personality. Their relationships don't feel authentic, cause they barely spend any time together. The movie is so short that they spend like 30 minutes togehter (in the best case scenario, sometimes it can be less than 10 minutes) and at the end you're expected to feel like they formed some great friendship, to feel that they have chemistry and things in common beyond: their humans, they want to defeat the same villain.Also it has a lot of Mario Stuff I guess....The reception for this movie was kinda pathetic. It was either pretentious critics, acting like this movie killed cinema or some trash, or a bunch of manchildren who need everyone to agree with them \"What did you expect from a Mario Movie?\". From the Mario Movie. You would expect... a movie: a story with conflicts that pay off. Likeable characters and immersive world-building. It's a movie; of course I expect to me more complex than the Mario Games.I honestly didn't k=connect with the movie. I was just waiting for it to end. I didn't even intend to watch it until the internet decided that this is some ground breaking divisive movie. It's not. Maybe it's gonna leave a big impact on the industry, since in made over a billion dollars, but I highly doubt I'm gonna remember this movie once The Flash or the FNAF movie will come out, and people will move on to the next big shiny thing.With both terrible and good stuff, the movie is OK: a low-key waste of time, with mildly entertaining scenes and bright colors. I don't see anyone outside of Mario Fans and Families getting that out of this.",
    "104": "Filled with a litany of references to all things Mario, this vibrant animated adaptation is sure to please fans of its source video-game series. 'The Super Mario Bros. Movie (2023)' really is perhaps everything you'd want from a video-game adaptation, displaying a deep reverence for its inspiration while interweaving its homages - both aesthetic and narrative - directly into the story it wants to tell. As an adaptation, this is perhaps unrivalled; as a movie, I've seen far better. The story is really weak, a barely-there A-to-B that feels designed purely to get from set-piece to set-piece and doesn't any take time to stop and smell the roses. It's like the narrative only exists to cram as many Easter eggs and references as possible into the movie's relatively slim frame. It isn't the most natural way of exploring its world and it means that its characters are rather perfunctory in the grand scheme of things. The relentless pacing doesn't translate to a gripping experience, either. To be honest, the flick just sort of happens in front of you. It's not bad, just not particularly good. The visuals are its clear highlight, with atmospheric cinematography and lively animation that puts the rest of Illumination's lineup to shame, and the voice acting is mostly strong across the board (Christ Pratt is still an odd choice as the lead, though). Ultimately, I'm a little torn on the experience. On one hand, it's a breezy and aesthetically pleasing adventure that undeniably captures the spirit of its inspiration, but, on the other, it isn't compelling in the slightest and is very basic when it comes to its narrative. It's a pretty strong adaptation, but a fairly weak movie. It's fine.",
    "105": "I was born in the late 80s. So I had a first-hand perspective of being a quintessential 90s kid as far as Nintendo & their Mario releases were concerned.I used to wake up before 6am to watch the Mario animated series airing alongside the Zelda & Donkey Kong shows.I used to play & beat the first 3 games & their consecutive Mario World games & other spin-offs. I even like the original Live-Action Mario film a lot still to this day, despite it's varying degree of separation.This new film I obviously then had to see on the big screen and I honestly got to say I wish I had saved my money and took a nap instead.Don't get me wrong, I can't hate it, and I won't. It started out so good, with so much potential. And I just feel by the end, it wasn't anything special.The voice-acting, on nearly all fronts actually took me out of it, and continued to distract me while the movie became one more noisy eruption rampaging through every scene, after another. Toad & Peach were tolerable in their roles. But I couldn't take the voice-acting seriously for Mario, Luigi, & Bowser, Dk, etc.By the end the noisy nostalgia quickly became almost unbearable and although the fan-service was locked in place, it wasn't enough for me to really care.This film, particularly towards the end, felt like one for the kids, & true meta nerds, don't get me wrong, but it was just missing good pacing in my opinion, and the voice-acting, I'm sorry to say, butchered what could have been a masterpiece.The visuals somewhat worked, but the chaotic and rushed story was like a Wizard of Oz acid trip that I actually quite wanted a lot more out of. The stakes weren't high for a Mario movie, the voice-acting was bad... if there's a sequel, I just hope it's a-better.I can just proclaim that I'm happy that many fans are able to disagree with me and look past any & all perceived weaknesses.I will just hold closer to the games.",
    "106": "It's been three decades since I've watched the live-action film in 1993 and it became a major flop. Almost 30 years. Not to mention that there was an animated film that was in 1986 but it was only in Japan. The fans wanted another film or an animated reboot. Now in 2023, it finally happened. This animated film is even better than the live-action version. This is the true film that the Nintendo fans wanted to see. My brother and I just came back from watching the movie and we enjoyed it very much. The action sequences were amazing and phenomenal. They blend very well with the animation. There were funny moments and emotional parts that made me want to cry. I liked the story and plot of the movie. In most of the games that we played, Mario and Luigi would rescue Peach from Bowser. They switch it so Mario has to rescue his brother with the help from Peach. There were two sides of the film's story. One side shows that Mario cares for Luigi. And the other side is that Luigi has a chance to shine for himself. Peach is very brave and confident in this film and it was interesting. There were games that Peach and Toad joined Mario and Luigi in adventures.The animation is fantastic and spectacular. Even the characters as well. Illumination worked very well to design and draw the animation so I'm giving kudos to them. The movie had all the references and easter eggs from the games that I played throughout the years. I'm glad that the movie included the musical themes from all the games and even the sound effects. I'm giving credit to Koji Kondo for his brilliant work of composing the themes. Brian Tyler is a good choice to compose the entire soundtrack to the movie. He did plenty of composing for the Marvel Cinematic Universe.We know that Charles Martinet voiced Mario and Luigi throughout the years but the directors casted Chris Pratt. They thought that Chris was the best actor to voice Mario because of his roles of animated films like The Lego Movie or Disney/Pixar's Onward. Chris did not try to voice Mario like from the games. That's probably what the directors wanted him to say and do. They probably know about the voice that Martinet did over the years. Charles Martinet is in this movie as only other voices. If they casted Charles Martinet to voice both Mario and Luigi, then it would be too much for him in the voicing booth. My brother and I were skeptical about Chris Pratt being the voice of Mario but when we watched him in action he was not that bad. Chris did on and off as Mario and being himself. Chris did sort of had a Brooklyn accent. It is just like the DIC cartoons from the late 1980's and early 1990's. I kept in mind when I was watching the film it was just like watching those cartoons again. So I was okay with Chris being the voice of Mario. Charlie Day is great as the voice of Luigi. Jack Black really nailed his role of voicing Bowser; he was definitely the perfect role for the cast and he made his voice very intimidating just like in one of the games. Seth Rogen is hilarious as Donkey Kong. Anya is beautiful as the princess. Keegan is awesome as Toad. Kevin Michael Richardson nailed his role of voicing Kamek. I know Kevin from other voice actor roles. Overall, I did not mind about the voice cast. What matters to me is seeing this animated movie and the characters in action.I've noticed that the movie is about an hour and not that long. The whole production should have thought about putting more plots into the story, but Illumination does not make their movies for about two hours long. It is okay for my brother and me because this was worth the wait to see it. This animated movie does honor the legacy of the entire Nintendo franchise. There are Nintendo fans who are young or old that waited to see this movie and enjoy it in theaters. This is also a movie for families to enjoy watching because it does feel like a family movie. That's what Illumination does. So, if you're a fan, watch the movie and enjoy it. I cannot wait for other future sequels or spin-offs. Who knows? Probably there will be more. I rate this movie 10 stars (â­) and giving it two thumbs up. ðŸ‘ðŸ‘",
    "107": "In my review of HBO's The Last of Us, I wrote that we've entered a golden age of the once-cursed category of \"video game adaptations\". A favored explanation for why movies and shows based on games seem to get better is that, well, a lot of the titles that get adapted are already trying to be pretty cinematic, ergo it's easier to translate the characterizations and drama to the screen. (Some parts of the aforementioned Last of Us are shot-for-shot recreations of the game's cutscenes.)But this doesn't account for the hype around adaptations of things like Sonic the Hedgehog and now Super Mario Bros., which were always more about gameplay than story -- especially when they were brand new. We play Mario's games because we want to jump on blocks, drive karts around, and crush turts; not for intricate plotting or enthralling cutscenes. So why is it that everyone had high hopes for the new Mario feature?Well, one big factor is how faithful it looks. The last time we saw the eponymous Italian plumber star in a big-screen release, we got the murky 1993 film where King Koopa was just Dennis Hopper with a knobbly bald cap and none of the creatures looked right (which is to say nothing of the relationship that the Mario brothers -- who were also \"father and adoptive son\" and possibly something more -- seemed to have in that one).The new movie, for the most part, looks unabashedly identical to the games (minus Mario's shrunken keister, the most derided video-game-movie design choice since Sonic's human teeth in 2020). It doesn't stray away from the feel of them just to make it \"work better as a movie\" or whatever (it does make some changes, obviously, but none so bad as, say, giving Angry Birds a backstory involving refugee allegories, interventionist themes, and somehow also clowns). Even that one rap song -- which would normally stick out as a desperate, wannabe-hip, probably studio-imposed addendum -- is actually lifted from a DIC Entertainment/Saban Productions Mario cartoon that many veteran gamers grew up with. There's sincerity to the project.Of course, there are some things that seem like they came from a focus group meeting rather than a creative mind, like the faint girlboss-ification of Princess Peach (Anya Taylor-Joy) and Mario being played by Chris Pratt doing his best Chris Pratt. Now, Pratt isn't a bad voice actor, and boy does he put his heart into that \"wahoo\", but nothing here justifies him being cast instead of, I dunno, Charles Martinet (who does have a cameo).Still, nobody really stands out as a flat-out poor casting choice -- Charlie Day is entertaining as Luigi, Jack Black is heaps of fun as Bowser/King Koopa, Seth Rogen works as Donkey Kong, even Keegan-Michael Key works well as Toad, the lil' mushroom guy. My problems with the movie are to do with its comedy, its rushed pacing, and its unremarkable visuals.This is Illumination Entertainment so it's foolish to expect anything above \"technically well-rendered\" and \"inoffensively cute\", but one feels that Mario deserves better. And we, as connoisseurs of animation, should probably demand more in an age that has given us the likes of Puss in Boots, Arcane, and Into the Spider-Verse, all of them exemplifying energetic 3D animation that looks like it lept from the realm of 2D -- an effect that baffles even my VFX-programmer dad, especially how it's achieved in Puss in Boots, with its anime-esque battles.But most impressive about Puss -- and its effect on filmgoers -- was that it made everyone excited at the prospect of another Shrek movie. Yes, it actually made people want MORE of something for once. And by people, I mean actual people; not social media bots that feign excitement at Disney's zillionth \"live-action remake\" announcement, nor their cognitive equals that run interchangeable Disney fan pages. Even more relevant is Arcane, which is certainly one of the biggest contributors to the consensus \"video game adaptations are cool now\". That was Mario's competition here, not the 1993 attempt. Something that almost exclusively excites fanboys feels like a step back.Will this movie re-sour the idea of video game movies? Not at all. But it likely won't make moviegoers hunger for more Nintendo films the way that Puss made us hype up Shrek 5, either. We'll see. I still observe some of the aforementioned hype, but it seems to be dying down (when it came out, we had our laughs about its low Tomatometer score, as we were urged to take it with a grain of salt since this is the website where Cuties has a \"Fresh\" rating, but even non-critics have begun to doll out negative reviews).My verdict will have to be that it's just a nice little kiddie movie, albeit one that will likely be forgotten by children and manchildren alike. What was I saying? Anyways, did you see those trailers for Spider-Verse 2 and the new Ninja Turtles? Pretty cool, right? I'll see if there are tickets yet!",
    "108": "When I was a kid I remember anticipating the new Super Mario Bros movie... boy what a letdown that was. So this new one had to be good right?I'm watching it with my family, staring at the screen, and feeling nothing through most of the run time. Just bright colors and movement. The problem was. The screenplay is just cliff notes with fan service. The movie should have stuck with the brothers and traveled throughout the mushroom kingdom and other worlds and save the princess. Simple right? But A lot of the time It felt busy and empty simultaneously. Maybe I'm being too hard on a kid's movie? Why should I complain? It's not the 90s Mario movie, right?Wasted potential, that's how I felt. The movie never really took off for me. It didn't have those wow moments that it could have easily had. No surprises, just safe commercial entertainment.Pros:\nThe visuals and music are top-notch. As a big fan of the games, these elements hit home.Jack Black's Bowser was the best part of the movie. When he is onscreen it's a joy to watch. Luigi and Toad are also very good. There are a few moments toward the end that are exciting too. When the Mario Bros are together, they work... however.Cons:\nThe bros being separated for most of the movie was one of the biggest mistakes of the film. You get an entertaining Luigi and do absolutely nothing with him. Donkey Kong could've been completely removed as he brought nothing. There was a little too much Mario Kart. Princess Peach was fine but again there was too much of her and we really don't get to know her. For most of the movie, it felt like it was on autopilot and they had a checklist of items that they had to go through. There needed more quiet moments to let the audience breathe in this magical world. It felt less like an adventure/journey and more like Super Mario highlights.Overall, it comes down to the screenplay, which could have told an interesting tale of these Bros' adventure to save the mushroom kingdom, but when you don't really care about the characters and get a movie that takes too many warp zones to the end. You end up with this half-baked film.4/10.",
    "109": "Super Mario Brothers (2023) is a story about two brothers, who have just started a plumbing business (after quitting working for a competing plumbing company) and must work together with the inhabitants of a newfound realm, in order to save the universe.Whoever thinks that Super Mario brothers had a thin plot was NOT paying attention. Mario goes on what can be described as the hero's journey. Luigi learns to trust his brother (while finding his individual strength). Princess Peach must put her diplomacy and years of combat training to use, in order to save her kingdom, found family, and friends. Donkey Kong learns the importance of humility and friendship. The supporting and (even) background characters were well-placed and well-setup. The movie sets up a possible sequel, in which Mario and Luigi (and the rest will grow even more).This movie packed a great many morals into one story. Such morals include: the importance of family (siblings, father's love, found family, etc...), earned trust, the importance of training and other preparation, doing and eating things that are good for us (even if we do not like them), friendship, perseverance, importance of being able to handle romantic rejection, teamwork, humility, forgiveness, importance of mechanical training, etc...Pros - plot, animation, world mechanics are displayed and told well enough (for anyone new to the Mario world), characters, soundtrack, references were not forced, clean, not \"meta,\" good morals, (part of the first part of the plot reminded me of the 1993 movie)Con - a few of the big mushrooms looked like their red parts were made out of clothThis movie was very well done. I give it 10.5/11.",
    "110": "This movie was quite a letdown for me. I went in with high hopes, expecting a fun romp with characters I've known and loved for decades, and an enjoyable story to match - something akin to the first Lego Movie some years ago.Unfortunately, the entire movie is like watching a 90 minute commercial / highlight reel. There is basically no story to speak of - it's just 90 minutes of Mario doing Mario things, with some silly jokes thrown in here and there. It will certainly entertain kids - and that's ultimately the point I guess. I was just hoping for something that would also be an entertaining story for long time fans like myself - like the Lego Movie was - this definitely misses that mark and is not something I'd ever want to watch again, nor would I care to see a sequel.The animation is beautiful, some of the jokes do land, the clever references are fun to spot, and the casting is actually not as bad as people feared - Chris Pratt is fine. Not great, but fine. Jack Black, Charlie Day, and Keegan-Michael Key are all quite good in their roles - most of the rest of the supporting cast is also decent, with Seth Rogan and Fred Armisen being the only truly poor casting decisions.Your kids will probably love it - but there's little chance adults will do more than tolerate it.",
    "111": "I grew up playing various Mario games on the DS and Wii, alongside watching \"The Super Mario Bros. Super Show!\", the anime film adaptation and yes, even the hilariously god awful live-action film. The games, films, and shows about Mario and Luigi were part of my childhood and I was curious to see where this one was going. After seeing it, there were fun moments but it was kind of underwhelming.The animation models and color, sound design, and effects are absolutely gorgeous as the colors and style really captures the essence of the world and personality. The character model\ndesigns are really good, particularly Bowser, Princess Peach and Donkey Kong and the soundtrack added is also really catchy. The action scenes like the fight with Mario and Donkey Kong and the kart racing sequence were well-executed and perfectly captures the tone and accuracy of the games. The animation was made from Illumination whom I am not fond of at all but here, they knocked it out of the park and I think it's some of their best animation so far. Throughout, the sound designs were also pretty good.The narrative is okay. I appreciate the narrative and setting remaining faithful to the source material, but I kind of wished the narrative could have expanded and explored itself a little more. I understand it's bare bones because it's for younger viewers and fans but there are so many fun concepts and stories about the Super Mario World that I thought could have been implemented. Surprisingly, the voice performances were a mix of good and kind of bad. Jack Black, Anya-Taylor Joy and Keegan-Michael Key were excellent as their voice performances helped to make their characters interesting and fun. On the other hand, Chris Pratt's voice performance felt wooden and didn't fit the personality of Mario and Seth Rogen and Charlie Day's voice performances were pretty annoying which made it a little difficult to believe a single word from them.The characters remain the same classic characters we enjoy watching and I do appreciate the writers not completely butchering them. The dialogue moments were a little rough, the soundtrack was kind of repetitive, and the humor wasn't great as some were clever but most were pretty bad as if they were written from a SML or SMG4 video. There were many Mario related easter eggs throughout and some were cleverly used but it ended up feeling repetitive as if they are just references rather than to utilize them cleverly. However, the film still manages to not be boring as there were some pretty fun moments.Overall, I appreciate the studio for respecting the source material and it was never boring. But I'd rather stick to watching the original television show.",
    "112": "Nobody ever played the Mario Bros. Video games for the story. People play the games for some good simple fun. And there is nothing wrong with some mindless entertainment. So, when Nintendo announced that they were teaming up with Illumination to make this movie happen, it seemed like a solid match. Illumination seems to specialize in mindless films. Stuff like \"Minions\" and \"Secret Life of Pets\" are not exactly accused of being too high brow. And this movie, is exactly what you'd expect from a company like Illumination, telling a story like Mario.How did the movie fare in execution? Well, the animation is good. All movements are fluid, and the character designs are both faithful to the source and a suitable step up in detail quality.The music is also good. At least when it is doing unique movie spins on classic Nintendo music. When it is doing some tired pop song it feels out of place. The \"Peaches\" song is pretty sweet. And while I'm on that point, Jack Black is great at Bowser, no notes. He is both parts intimidating and funny.The other voice actors do...fine. Nothing spectacular but nothing awful. With the exception of Fred Armisen does not fit at all for Cranky Kong.The movie has a handful of jokes that work, but for the most part they could have used a power up. The movie goes at a breakneck pace, never giving their audience time to breath. The idea being that if the story goes fast enough, none of the children will get bored. But from my experience, I watched the film with 3 kids, ranging from 4-10, and they were checked out by about the hour mark. So, from my experience, the movie didn't even deliver for its target demographic.I mentioned that no one plays Mario for the story. Well, that is the difference between a video game and a movie. A video game can be mindless fun, because the player is the one going on the journey. The movie does not have that same luxury. What has helped Mario be the top of the video game world for all these decades is the fact that his video games are revolutionary. \"Super Mario Bros.\" or \"Super Mario 64\" were both huge leaps forward in the industry. This Mario Bros. Movie does nothing game changing. It follows the same formula of so many other kids' movies. Some fun, but when this game is over, I don't want to press to continue.",
    "113": "I had an absolute blast with this movie.It is 1hr and a half and feels like 40 minutes, time blows by as there is no real dragged out moments, we get back stories for different people and they are literally perfect timing.The whole accent thing with Chris Pratt being mario surrounded this movie and it's hard to see anyone being annoyed by it, it's addressed and it's funny, and it sounds good, all of the voice actors were good, I thought Mario and Luigi were fantastic, Jack Black as bowser was so good, in my opinion the best and had some of the funniest scenes, also Seth Rogan as Donkey King was very good.I don't really have anything to complain about. It's a kids movie that I feel all ages will enjoy, LOTS of jokes and about 90% of them I found funny and did laugh out loud a few times.I would have liked a bit more Toad, other than that yea I can't think of what I didn't like hahahha The movie is a good 7.5 but I'm rounding it to an 8 :) That may actually be it, another watch maybe, always a good sign I know I'll watch again just after seeing it.",
    "114": "The short version of this review is that it's just about everything a Mario film could be. The long version? Read the review to find out.I'll start with the story. It's a very simple plot. Mario & Luigi fall into the Mushroom Kingdom. Luigi is captured by Bowser and Mario has to rescue him. What you saw in the trailers for this film is exactly what you get. Something simple. Despite this, the film still has depth to it. I'd say a lot of the depth comes from the chemistry between Mario & Luigi as well as Mario's clear growing feelings for Peach. If you're going into this expecting it to be the next Godfather or LEGO Movie. Don't. Temper your expectations. This does not have an Oscar worthy plot. But that is a point for the film simply because most mainline Mario games had never been heavy on the plot.Next, we'll talk about the most controversial aspect. The casting. I'll start with Chris Pratt. As somebody who was vehemently defending him leading up to the film, I was genuinely surprised by his performance. His take on Mario is really really good. Keep in mind. This is NOT the Charles Martinet version of Mario. And it doesn't try to be. This is another version of Mario. Like Lou Albano or Walker Boone. And it works really well for the film. At worst, most people will view his performance as \"okay.\" At best, most people will view his performance as \"really good.\" But it is not bad. He is not dull in the slightest in the film. The trailers did not do him justice.Now the rest of the cast as short bullet points since I don't want the characters to be too bloated.Charlie Day as Luigi: He sounded really good. He was always perfect casting for Luigi and this movie really reaffirms that.Anya-Taylor Joy as Princess Peach: She sounded really good as well. A lot of people were concerned about how Peach being an action hero would take away from her soft and kindred personality. But that is absolutely still intact. It's just another side of her we've only ever seen in spin-offs.Jack Black as Bowser: Best cast member in the film. Sometimes he'll slip into sounding like Jack Black, but that does not affect his performance in the slightest. He still sounds incredible and is clearly eating this role up.Keegan-Michael Key as Toad: He sounded really good. The voice is definitely a Toad voice, but it works for a movie. Nobody is gonna wanna listen to the ear stabber that video game Toad is for an hour and half.Kevin Michael Richardson as Kamek: As somebody who's known for doing really deep voices usually, this performance as Kamek is literally pitch perfect. What little dialogue he has is actually incredible and I couldn't think of a better voice for Kamek in this film.Seth Rogen as Donkey Kong: Seth Rogen is good in this film. I think his voice actually really suits Donkey Kong, but I do believe that some people will be put off by the fact that this is just Seth Rogen.Fred Armisen as Cranky Kong: If I had to choose a weak link in the cast, it is Fred Armisen. He's not bad, but he could be much better.Sebastian Maniscalco as Spike: He wasn't in the movie much, but his voice fits Spike really well for the take they go for in this film.All the supporting actors also do really well for what they're given and Charles Martinet's Cameos in the film are just beautiful and an exciting thing to hear.Objective Broad Conclusion: This film is really a fun family movie. Not everyone is gonna be as into this film as Mario fans will be. But this is still a rather fun time if you're not a Mario fan. 7/10Objective Mario Fan Conclusion: From a video game movie adaptation standpoint, this has set a standard for what they should be. This was a really really good film that is almost everything a Mario Movie should be. Some Mario fans will be put off by Chris Pratt. But at worst, his performance is passable. 8/10Subjective Personal Conclusion: This film is perfect in almost every sense of the word and is my all time favorite film. 10/10.",
    "115": "The Super Mario Bros. Movie (2023) is a movie my wife and I saw in theaters last night in 4D. The storyline follows two entrepreneur brothers who recently opened their plumbing business in Brooklyn, New York. When a water main breaks in the city they come to the rescue to save the city and establish their brand. In the process they are sucked into a warp and find themselves split apart and whisked off to a world where an evil tyrant named Bowser plans to conquer the world and kidnap the Princess. One brother, Luigi, is dropped on Bowsers doorstep and taken prisoner. The other brother, Mario, lands on the Princess' doorstep. The princess teaches Mario the ways of her world and he joins her in a mission to save the world and rescue his brother.This movie is codirected by Aaron Horvath and Michael Jelenic, who collaborated on Teen Titans Go!, and contains the voices of Chris Pratt (Guardians of the Galaxy), Anya Taylor-Joy (The Witch), Charlie Day (It's Always Sunny in Philadelphia), Jack Black (School of Rock), Keegan-Michael Key (The Predator) and Seth Rogen (Superbad).This movie is pure nostalgic gold and a tremendous depiction of the Mario Brothers Universe. There are so many of the legendary Mario brothers characters and villains in this and some subtle references to the old school NES universe. The dialogue is well written and there's some great lessons in here about friendship, family and giving people the benefit of the doubt. The animation is outstanding and the way the storyline unfolds is magic. Each character is perfectly depicted and this is another movie that as the events unfold you wish it would never end.Overall, this is a fun animated gem that the entire family will enjoy. I would score this a 9/10 and strongly recommend it.",
    "116": "I can't believe it. Nintendo made the same mistake once again. Mario games have always been kinda mediocre on the story department, but there've been a few good ones. One thing that never misses the mark is gameplay. Videogames are a very different media, but nintendo has been known for been very protective of their IPs. This makes it extremely frustrating to see this movie fails so horribly.I'm not joking when I say it feels like a remake of the old Mario movie. That one movie that made Nintendo abandon completely the movie industry. Sadly, they gave too much freedom to the creators of this film. A company known for pumping out mediocre films and disgusting amounts of sequels and spin off to their IPs.Even as a kids movie it fails at delivering, focusing more on pop culture and bostalgia instead of appealing to kids. And been a \"kids movie\" doesn't justify at all how awful this is.Nintendo coulda partnered with dreamworks, paramount or any other company, but no, they chose itumination. Probably the cheaper one.I feel so cheated.",
    "117": "The Super Mario Bros. Movie is the perfect video-game to movie adaptation! There's lots of laughs for all ages and loads of references to the Mario Games for all fans. I enjoy this animated movie because it gives the iconic characters we all know and love the movie adaptation that they all deserve.In this movie, we learn the origin story of our favorite video-game brothers, Mario and Luigi. Mario (Chris Pratt) and Luigi (Charlie Day) are just your average brothers living and working in Brooklyn as plumbers, but when they find a warp pipe in the sewer, they get transported to the magical land where Toads, Yoshi's and Koopa Troopas roam. Along the way, Luigi gets captured by the evil Bowser (Jack Black) and with the help of Princess Peach (Anya Taylor-Joy), Mario is forced to 'level up' and fight Bowser before he conquers the world.There's no need to play the video games to like this movie, but existing fans of the franchise will especially love it because of all the Easter eggs and familiar songs. This is such an imaginative story with characters and themes from some of my favorite games in the franchise - Mario Kart, Super Mario Bros. And Donkey Kong. I love how this has elements of the classic games but also new twists, like how Princess Peach in this movie isn't like your normal Princess Peach in need of rescuing, because she can save herself and is very skillful at doing so. I also love how relatable the brothers are as they are from our world. We've been seeing a lot of high quality animation from Illumination recently, and this movie follows the trend. The animation is cheerful and lively and the quality is top-notch. Jack Black, as Bowser, is absolutely perfect in this role. His versatile voice makes for an almost manic Bowser - scary, evil, quirky and laughable - and he can flip the two like a light switch. Chris Pratt as Mario and Charlie Day as Luigi have a lot of chemistry and seem like very close brothers. Collectively, they are relatable and help us sympathize with the plot even more.The messages of The Super Mario Bros. Movie are that family is the most powerful thing in the world (real and virtual) and when working together, you can accomplish anything.I give The Super Mario Bros. Movie 4 of 5 stars and recommend it for ages 8 to 18, plus adults. Players of any Mario games will enjoy this. It comes out in theaters April 5, 2023. By Katherine S., KIDS FIRST!",
    "118": "The title says it all. And it's definetily not only made for kids. Plenty of laughs for Adults too. My favorites: Luma got me cracking with her terribly twisted mind and dirty Bowser is really, really obsessed with peaches.The story is a flat as you expect from a Mario movie, but that's ok. The runtime felt short, or better said: left me wanting for more. Nintendo just scratched the surface of what they could do with the Mario cinematic world.The visuals are stunning. I didn't have any expectations but it just feels like you can touch the fabric of the characters.The voices are fine. It felt natural, like it should, except for the ape king who really sounded too young for his age.Guaranteed a great family time. You will like it, especially if you know the super mario games.",
    "119": "I am obviously the minority for this movie.So, hear me out or pfft the whole review.Jack Black is the only actor in this line up suited and talented for this style character work.Peaches has by far the worst voice characterization and felt like the casting director's criteria was blonde hairDonkey kong is Seth Rogen-as Seth RogenAnimation beautiful and colorfulMovement through the story line and scenes was awkward, dialogue cliche and boring2 different occasion Bowser uses pain as a means to intimidate1st scene pulling mustache hair while Luigi yells oww and to stopSecond slams hands in piano and says pain is the best teacher. For sure bad guy stuff, but really does nothing for the plot and for a kids film, based on a beloved video game?Just an obvious bad taste for a kids movie.Voice actors was the most confusing part in the end. It's a kids movie so really plot thickening is not their strong suit, but this felt like the original cast got strep and someone had some famous friends who could step in\nWhen really, if the whole movie was dubbed over by Jack Black it would be worth a watch again.",
    "120": "I know, it's probably too much to expect a Mario movie to be anything more than okay at best, but I was still disappointed in it.Taking inspiration from the 90s Mario movie and having Mario come from another world was not a good idea. It's lazy writing which requires very minimal effort to fit the protagonists into the story. It's an overdone trope and this movie did nothing to make it interesting. The story as a whole would be a lot better and more engaging if they didn't have this element at all. Just because Mario, Luigi, and Peach are not Toads, it doesn't mean they have to be from another dimension.The story was also very rushed. I get that it's a cartoon, but you can at least try to have slightly realistic interactions between the characters. They just say a few words and then they become best friends.Peach is my next complaint. I'm getting rather tired of the \"perfect\" woman trope. Peach has zero flaws and is better at everyone at everything. She has zero personality besides being awesome at everything. This is also bad writing.Bowser wasn't too much better. They try to add in a few lines in the final conflict about how he has apparently been suffering his whole life and his only way to be happy was to be with Peach, but there was nothing beforehand to expound on this. His only motivation is just that he is going to marry the princess and blow up the Mushroom Kingdom. It wouldn't have taken that much work or screen time to fix this problem.I guess every character is pretty one-dimensional, now that I'm thinking about it.The whole point of this movie was the have a barely coherent story, just enough to hold together an endless slew of Mario game references. It really was a constant barrage of \"Hey, look at this thing you recognize!\" Some people might have been gushing over it all, but that isn't enough to make it a good movie for me. Actually, I find it more annoying than anything else.I am also very confused about the choice in soundtrack. The cinema score versions of Mario theme songs was understandable, if poorly executed, but why the 80s songs? It didn't fit the movie at all.In terms of the voice acting, I didn't mind any of it except for Seth Rogan as DK, but that's just because I don't like Seth Rogan. I don't care if Mario doesn't have an Italian accent. If he actually talked like Mario did in the games, it would get annoying really fast. Plus, it's an American movie, so American accents are to be expected.Am I being too critical about a kids movie adaptation of a videogame series for kids? Maybe. But I enjoyed the Mario games well enough and would have liked a respectful movie adaptation instead of this formulaic nostalgia bate.",
    "121": "Let me tell you to begin with that I was not particularly hyped by the announcement of this film, that being said and now that I have seen it, I can tell you: You would have been right to be hyped by this movie, because it's amazing!If you dreamed of the perfect Mario movie, you currently have it in your cinema, if like me you grew up with Nintendo's Mario Bros universe, you will be delighted to find a very good animated film full of references to the mario lisence that will make you smile like a kid for an hour and a half.Several people criticize the movie for reasons that I don't understand, it's a mario movie with what that implies: A simple scenario but super fun and amusing.Mario games have always had a very similar plot and that never made them a bad game.Don't be guided by the bitter reviews of very bitter people, let your child's soul guide you and enjoy this ode to the Mario universe :)PS: I think that this film, although openly filled with references to mario video games, is also suitable for children who do not know this universe extremely well but who will never cease to marvel at this film just like you, in short the ideal film to share a good time with your offspring.",
    "122": "Overall it's an okay movie, but not really much more than that. Could only rate it a 5/10, which is a shame really as I expected so much more from this movie. After giving it some thoughts I decided there are two reasons why the rating is lower than expected. The first one is the voices of the characters. With the exception of the highly depressing fire-spark sitting in its cage (or whatever it was), the voices seem mostly a rather bad choice. Think this might be related to the fact that the movie is trying to stay too politically correct by not stereotyping Italians, although really... serving pasta with mushroom sauce. Mario and Luigi should have had real super-strong Italian accents (Izze me di MA-rioooo fromme di Pizzaaaaaasss). The second reason is the lack of humour, the humour from for example a Shrek movie. Clearly Mariobros is not suitable for small children, and hence should have adapted itself to a much more mature audience. It kind of felt as flat as a Ghibli movie without the artistic feeling that Ghibli movies typically have. Maybe it's a Japan related culture thing, but honestly they should have hired some Brits to add some more spark to it. So, the movie wasn't bad, but it certainly wasn't great either. Anyways, that's my two pennies worth.",
    "123": "\"Mamma Mia.\" Mario (voice of Chris Pratt)That is the best line I could come up with, or at least the one so often used as to be memorable from The Mario Super Bros. Movie. It also points out the lack of good lines about Italians in Brooklyn because writer Matthew Fogel uses it so much. Yep, I'm disappointed this animation, ballyhooed by way of Nintendo's smash-game franchise, is not more creative or more quiet or more human centered.Humanitarian as opposed to punches and blasts, punctuated by the oldest possible cliches with characters thrown around and barely smudged. Too much pushing around and not enough original verbal combat.The titular brother plumbers enter the bowels of the earth through the sewers to save Brooklyn from flooding. Along the way they are thrust into the Mushroom Kingdom with the usual suspects of bad guys and a beauteous princess, this time a real peach, Peach (Anya Taylor-Joy), after saving her from marrying Illumination Studios' version of a bad beast, Bowser (Jack Black), leader of the Koopas, who intends to take over the Mushroom Kingdom.Besides the rampant formulaic story line, directors Aaron Horvath et al. Concentrate on the common theme of sticking together to survive. But then that is nothing new on all genre fronts.The Mario Bros. Movie is generic kids' stuff, so fast as to keep the hyper crowd calm and adults wondering how this loudly-colored animation brimming with cliches and barely memorable lines could have set the record for opening animations and yet not even come close in quality to its own franchise classics such as Despicable Me, Sing, or Minions.Could be we have forgotten Toy Story's greatness, or there's nothing out there at this dry season after Oscar. So much Italian good humor missed for the sake of loud noises and explosions. Not a classic but entertaining enough for kids at a low time for movies.",
    "124": "Animation 10/10\nVoice Acting 9/10\nStory 5/10Overall 7/10Excellent animation. I would not have minded a live action movie. But given the story and what happened. It made more sense to make it with the videogame franchise in mind.The voice acting was phenomenal. I did not know who they were until after the movie finished. But it did make more sense why some characters were a certain way.The story was the same Super Mario formula. Which is not a bad thing. But it added nothing new. Even with the theme songs it made for a cute production.Speaking of music, there was a pretty cool rock-themed ditty.",
    "125": "Yes. Yes. Yes.Thank you.We as a fanbase have suffered for so long with terrible video game movies. We gained some hope with the pretty awesome Sonic movies. But The Super Mario Bros. Movie feels like an arrival. I love this movie.As an adult, the only PG animated movies I usually go for are the funny ones. My favorites are most of the movies from these franchises: Despicable Me, Lego/Batman, and The Incredibles. What do they have in common? Beautiful visuals, cool action and they're hilarious, even for adults.The Super Mario Bros. Movie fits right in with these series. I was laughing throughout. A few scenes had me cracking up to the point I thought I was being too loud. The visuals look great and so accurate to the game, exactly how I would want them to look. And the action scenes all had me smiling.But how good of an adaptation is it? I've played 30+ Mario games going all the way back to the NES when I was a kid. And I was ecstatic at the amount of things I noticed from various games throughout the franchise's history. I recognized so many items, characters, musical cues, sound effects, etc. The story doesn't seem to follow a specific game. But it's exactly something I would expect to see in a Mario chapter, with various ideas pulled from different games.They absolutely knocked it out of the park with the casting across the board. So many of the choices feel 100% perfect. Like, of course they chose him, who else would it be?I had such a fun time with this movie. If you like the movies I mentioned above, I think you will too, even if you're not a Mario fan. Although the Mario fans are in for a treat.I can't help but feel joy. Please let this be a turning point for video game movies. The possibilities are endless.P. S. I said this in a group chat before the movie: \"I'm so nervous about the Mario movie. You realize the success of this movie could hugely impact possibilities for future Metroid and Zelda movies.\"Hopefully it makes enough money because this NEEDS to happen. Of course I would prefer a much more serious and darker take, preferably live-action with a talented writer and director. Bring back Anya Taylor-Joy as Samus, plzzzzzzzzzzzzzzzz.(3 viewings, opening Tuesday midnight UltraScreen 4/4/2023, UltraScreen 4/19/2023, EMX 5/3/2023)",
    "126": "The Super Mario Bros. Movie is a movie we where expecting since 2021 and we have waited to long. I was very excited and could not wait for this movie to come. I watched it, piece by piece, and I think this was a great movie. The story is basically about The Mario Brothers, Mario and Luigi, that get sucked into a different univers and of course, they have to stop Bowser before he take over the world. Here are the good and the bad sides of the movie:\nOf course, this is a family-friendly movie, so it was a lot of childish humor that I didn't like so much. But I do not mean it is bad, either, it is just not my style of humor. From the good sides, it is a nice, simple story that kids will understand, also great animation, it looked not like a normal Illumination animation definitely. It was way better. Most of the voice-actors where great, like Chris Pratt (As Mario) and Bowser (Jack Black). They had the perfect voice and I couldn't imagine someone else to play their role. The conclusion is: If you have kids in your family, go and watch that movie, or if you are a big Mario-fan, you should watch it as well. My final rating is 8/10 (Very Good).",
    "127": "This is purely a fan servicing checklist of fan expectations, it's a project that wants to tap into the huge popularity of the Super Mario Bros franchise without a clear plan of how to port the videogame into a fully-fledged movie. In fact, granted, it's a difficult task to undertake, and this attempt hasn't hit the mark exactly - although clearly some fun has been has along the way. So, why is it hard to get Mario on the big screen? Super Mario Bros was/is mainly a sidescroller, dialogue is sparse, it has a limited range of NPC characters, and the previous film in the nineties completely flopped, as an indication that thirty years later a reattempt (probably) shouldn't be made. Not to mention I, and I'm sure many others, have always viewed the plumbing duo as abstract characters in an abstract world, originally seen through a small screen on a retro device, not the biggest screen possible for a retail audience. That being said, I think people love Mario too much to care about this being \"good,\" many people just want to consume Mario content in as many forms of media as possible.However, making the titular brothers human removes them from their near mutism and occasional \"wahoos,\" as seen in the videogames. They were characters rooted in an idiosyncratically oddball platforming world with a simple, objective-based plotline to prop things up. This movie reverses that - taking them away from the linear platforming and attempting to cobble together a forgettable plot for the sake of cinema profit.There's a decent range of Nintendo universe characters in the mix, but they don't do much besides make their (often brief) appearances to service the fans. Even Luigi doesn't do much, spending much of the film out of the limelight; possibly the film's biggest blunder. The film frantically flicks through a catalogue of nostalgic references in its allotted runtime. Princess Peach seems lonely her kingdom of toad citizens, lending to her unconvincing origin story. This is but one of the many ways the videogame poorly translates to the big screen.As a kids film this works, as a family movie (inclusive of adults), it doesn't work. There isn't multilayered comedic nuance, as seen in Shrek (2001), and there isn't a memorable plotline. It's just 80-minute runtime of a Mario promo for the next generation.6.1/10.",
    "128": "Amazing. I came in expecting the worst.I could not stop smiling and laughing the whooole way through!The writing is great, jokes are on point, the animation is fantastic, art direction is great! Voice acting is superb. Every character is really done well.Bowser is actually scary and crazy. Hats off to everyone who took part in this film.The music is fantastic! You recognise each song and it's done in a modern way. All the sound design. From mysterybox popping, to jumping onto ennemies. The attention to detail between games and the film is unique.People who rate films 1/10 do not deserve to watch them.The amount of work that is put in in each little bit, be respectful please.",
    "129": "'The Super Mario Bros. Movie' (2023) is fun. Fans and casuals of the Mario franchise will certainly be entertained with the dazzling visuals and countless Easter Eggs and references to all sorts of games/media from Mario and Nintendo. But if you've never played a Mario game you might feel a little out of place as the film is based around these references to the games people have grown up with.The animation is amazing and the visuals give it such as a cinematic feel its just dazzling at times. Enough for you to wish the film was longer so you can watch the Mushroom Kingdom live in action. Unfortunately the story is pretty simple and fast-pace, but still entertaining. The voice acting is better than what people were expecting from the voice-actor reveal. Jack Black as Bowser is for sure the highlight.The film is definitely worth watching for anyone who has played a Mario game as you will quickly have enough fun to just spot the countless references throughout the film. Newbies may feel awkward but the visuals are good enough to keep you or more likely a kid entertained.ALSO, watch till the very end for some great mid-credits and post-credits scenes!",
    "130": "The much-anticipated Super Mario Bros Movie is a delightful and enjoyable film that despite its shortcomings, is a fun little experience for all ages.On a visual level the film is a vibrant, colourful and energetic spectacle. The world of the Mushroom Kingdom is brought to life in a way that pays homage to the original games while also adding a modern twist. The character designs are faithful to their video game counterparts, and the attention to detail is truly commendable. The film is also has a great load of visual references and easter eggs that will surely delight dedicated fans. The little visual secrets you see on screen are really enjoyable and fun if you have ever played a Mario mainline game.The audio references in the movie are also rather fun. The original music from the video games is woven into the film's score. Each familiar tune is given a cinematic change. However if you listen closely you can hear the original scores in there which I really like. The soundtrack overall in this movie however isn't as good as I'm making it seem. This is because despite the fact there are many original tunes in the movie, there are many hit songs that are played throughout some action scenes that I feel don't need to be there. For movie all about Super Mario and co. I would have preferred they used stuff already established in Mario games and original songs. There are some of this and although Bonnie Tyler doesn't ruin the movie, it kinda takes you out of the moment at hand and doesn't feel very fitting for this Mario movie.It is a very good family film. The humor is light-hearted and fun, with plenty of slapstick moments that will make both children happy. The story (while simple) is engaging and filled with positive messages about teamwork, bravery and friendship. The characters, from the heroic Mario and Luigi to the villainous Bowser, are all well respected from the source material. This is a huge positive as not only lifelong fans but also children still playing the games to this day will recognise everything in the movie. A very good watch for anyone of any age looking for a quick fun movie.Despite its many strengths, the film is not without its flaws. As a movie carrying the Super Mario Bros name, there's a level of expectation attached to it. While the film does a good job of honoring its source material, some may feel that it doesn't fully capture the magic of the games. By this I mean you will not leave feeling fully satisfied as a Mario lover I do believe. Now that being said I am no longer a child and am not a mega fan of Mario. However I did play many of the games as a kid and always felt that something was missing whilst watching the movie. The final few scenes in particular were a letdown. The climax felt rushed and the resolution seemed poor. The film seemed to lose its momentum towards the end, leaving a somewhat poor taste after an otherwise nice ride. I also disliked Seth Rogan voice acting Donkey Kong as you can only hear him in the apes voice and although the voice does fit to a certain extent, if you know who the voice is it cannot be unheard. Every other voice actor did well and although I knew most of the main casts voice actors, I didn't (unlike Rogan) hear their voice throughout. They all sounded like they belonged. I can understand for younger audiences however they would not mind Seth at all voicing Donkey Kong.I think the overall story is solid. It wasn't quite as good as movies of a similar elk for me such as the recent Sonic The Hedgehog movies. But it was easily enough to pad out the runtime. The CGI was brilliantly done for a completely animated feature. Nothing felt poorly animated and I never wished for more in this department. They did a great job of making the Human characters look like they belong in the Mario franchise and not uncanny at all. The animation and visual effects was extremely good and a huge positive for the film.Overall, the movie is a fun journey through one of gaming's most beloved franchises. It's a film that will surely delight any fan of the Mario games, young or old. Despite its flaws, it's a movie that I would recommend to anyone who's a fan of Super Mario or anyone who enjoys a good, family-friendly adventure.7/10.",
    "131": "This Super Mario Bros movie is an absolute thrill ride that will leave you breathless and grinning from ear to ear. As a hardcore fan of the franchise, I was blown away by the incredible combination of nostalgia and cutting-edge animation that the filmmakers have expertly woven together.From the moment the movie starts, you are transported to the magical world of the Mushroom Kingdom. And let me tell you, the animation is truly a work of art. The colors are so vibrant and the movements so smooth that it feels like you're watching a live-action movie. The attention to detail is jaw-dropping, with every character and creature lovingly rendered in stunning detail.But the animation is just the tip of the iceberg. The soundtrack is an absolute masterpiece, with iconic tunes that will have you tapping your feet and humming along. The music perfectly captures the spirit of the Super Mario Bros franchise and adds an extra layer of enjoyment to an already breathtaking experience.I can't stress enough how much I loved this movie. It's a perfect blend of nostalgia and modern storytelling that will leave you feeling like a kid again. From the amazing action sequences to the heartwarming character moments, this movie has it all. It's a true tribute to the beloved video game franchise that has captured the hearts of millions of fansDo yourself a favour, if you're a fan of Super Mario Bros, or just a lover of great movies, you simply have to see this film. It's a masterpiece that deserves all the accolades it's sure to receive. So grab your popcorn, sit back, and enjoy the ride. This is one movie you won't want to miss!",
    "132": "Let me say that this film isn't a masterpiece or a cinematic achievement in filmmaking, but aside from this, its great. If you are looking for a fun film to switch off your brain and enjoy it with your kids and family, The Super Mario Bros. Movie is a good idea and a must watchThe story of the movie is quite basic, just like the games. Nothing more, nothing less. The vouce acting is better than I expected, Jack Black is phonomenal as his given role as Bowser.The movie is quite fast-paced though, it sometimes moves from scene to scene quite quickly and dosen't give the popcorn-munching audience lots of time to breathe. I prefer this over the Sonic movies, but the Sonic films have better pacing. Aside from the voice acting and giving the characters personalities, the film could have had slightly better character development.",
    "133": "I like the artsy look on the film. It's certainly is a well polished film. And the fact it stays true to the source material is great too. The Characters are all charming and likeable, with the otherwise solid but nowhere near perfect movie. And don't let the massive talent fall you, it's an average movie. That I'm sure your kids will enjoy, you as an adult will be moderately entertained from time-to-time but that's about it.However talking about the flauesent design and look of the film. The Soundtrack is also superb. I was shocked! And its also good because they use the song and the theme tune from the original cartoons. The colours all make it a pleasant watch. With some great ideas inside the film just like the soundtrack. A-HA theme tune plays too, and that's a feel good banger. That song gives some much needed elevation in the story.Some more good ideas is how they played the scenes that were mostly in the trailers, in the start of the movie. So we Don't get a predictable final sequence which is great. I like how they split Mario and Luigi into different worlds. One the dark zone. With a great starting action-sequence that will put you on the edge of your seat. However Mario is on a nice world. Where nothing bad will happen. I liked the onscreen chemistry the cast had. And the ability to make me laugh as much as I did. Some Hillarious scenes. Great Action Sequences too. The fight between The Monkey and Mario had me laughing so hard! It was so funny how he could smash Mario. And the determination that Mario had was perfect, as he showed real strength and courage.However all those positives being said, I think the film was far too loud it became a tad overbearing by the end. I had it on the lowest volume possible, and it was still a racket. The Movie needed to be smoother with the sound. Because it's all well and good having a story, and nice effects with a likeable cast but you need to also find the right balance of sound. I think as short as the movie was, I feel like they should of dwelled more with the Character arcs, because there is wayyy to many jokes in this film. And the characters whilst are likeable, don't have much personality. Another thing is, it's overstuffed. There's too much going on, all inside a 1hr 36 minute film. They could have slowed down and had a Pause â¸, there that's better! Instead it was way to quick. Point is the characters or atleast some are one note. My verdict.Verdict,6.5/10 Better pacing, quiter sound that would of meshed better with the movie would of worked better, overall a solid movie though.",
    "134": "The Super Mario Bros. Movie is a new animated film adaptation of the famous Super Mario video games. The film is directed by Aaron Horvath and Michael Jelenic, who co-created the animated TV series Teen Titans Go! Have worked.The plumber brothers Mario (voice of Chris Pratt) and Luigi (voice of Charlie Day) end up separated from each other in the Mushroom Kingdom from Brooklyn. Here, Mario must help Princess Peach (voice of Anya Taylor-Joy) in her fight against Bowser (voice of Jack Black), who has captured Luigi.Since the first live-action film adaptation of the popular Nintendo video game characters, which was not so well received, Nintendo has left behind further official film adaptations of their characters. After the success of filming other video games such as the Sonic the Hedgehog movies, Nintendo is now trying again in an attempt to successfully film their video game characters as well.Together with film studios Universal Pictures and the Illumination animation film, they have now made a good film adaptation of the popular video game characters. They have nicely filled the film with recognizable references to elements from the video games such as well-known characters, environments and sounds from the games. Both older and younger viewers can recognize many of these things. The recognizable images are now only in the style of how other Illumination animation films look like the Minions films. Composer Brian Tyler also further filled the film with a fitting soundtrack filled with tunes from the video games.The story has also remained a bit on the simple side, so it is not special for older viewers. The film is a bit more fun for younger viewers, who are also familiar with the Nintendo video game characters. However, there are a few dark moments in the film, which can be a bit scary for young children.Apart from some self-mockery and further comedy by playfully using things from the Nintendo game world, the film itself is not as comical as it could have been. Most comedy is still more intended for younger viewers.The voice acting is voiced by the film cast in appropriate ways, but unfortunately most of them do little special with their roles. The fact that the Italian Mario and Luigi are voiced by American actors more in a New York style did not go down well with fans at first, who are used to hearing Italian accents with the characters. Fortunately, Chris Pratt and Charlie Day know how to make the voices of the characters their own. Who has put a lot of time and energy into his voice acting is Jack Black. He knows how to give Bowser a suitable deep voice, but also knows how to play with the voice nicely. So much so that he manages to fit a song into the film.",
    "135": "This is definitely mostly targeted towards kids, in that aspect it does a tremendous job. It quickly paces along from set piece to set piece, while referencing the many games in the series, a great introduction to new comers and a fun watch for fans.Ultimately it doesn't have layers upon layers as to appeal to an older audience, and the animation isn't spectacular. There is a lot of bright colors, funny quirks and fast paced clips and cuts. The voice of Luigi is great and sounds exactly like you would expect, while I was a bit worried about Chris Pratt as Mario, his voice grew on me and it wasn't as distracting as I feared. Jack Black as bowser was absolutely outstanding doing an amazing job capturing the quirky and \"funny\" side, balancing that withIt does bring references that nintendo lovers and fans of the Mario franchise, and the cast of characters that are closely connected to the franchise. While the movie isn't revolutionary in any way, it's a fun time especially for kids, that passes along at an astronomical pace.",
    "136": "No pun intended - and I know that this does rub some people the wrong way. Especially the people who are big fans of the 90s movie - with John Leguizamo ... the actor being one of the biggest fans and defenders. His co-star from that movie felt differently all along. But whether you're with John or Bob (Hoskins), try to be open minded ... like the open world this sort of plays in. Or open universe ... and judging by the impact this made at the box office, I'd say most were able to enjoy this.Good for everyone that was able to - me included I reckon. And yes if you really want to, you can rip this to pieces. Something you can do with almost everything of course. But if you dive into the world it created ... well it is made with love. And yes \"it is me a mario\" ... may not fly as well as it did back in the day ... but it also didn't matter that the main character was not Italian for this movie ... and let's be real: neither was John or Bob from the original movie (or whatever you want to call it).The animation is good, the jokes work and for fans of the game(s): you'll have a lot to cheer for. During the movie and after it (mid credit and after credit scenes). The voice work is also good - I may not have the biggest knowledge when it comes to the games, but I do know certain things. Which I reckon is true for most who watched this in cinemas ... the makers seem to knew how to tap into that. And the in jokes work ... again you can be snarky about it, but why not just sit back and enjoy the madness ... it is more fun! No pun intended here either ...",
    "137": "Everything about \"The Super Mario Bros. Movie\" feels just right. This is how you respectfully treat one of the most famous franchises in history. There are several references to many of the great games that were released by Nintendo through the decades. I played many Super Mario titles during my childhood and teenage years and for me this was way better than I imagined. The story is simple, yet compelling and entertaining at the same time. The animation style is gorgeous. The locations and the soundtrack are stunning and evoked many memories. The characters are amazing and they are portrayed wonderfully by an amazing cast. I loved Jack Black's Bowser, Chris Pratt and Anya Taylor-Jones made justice to Mario and Princess Peach. I think that this is one of the few movies in recent years that truly managed to unite different generations together. When the credits rolled, the whole audience clapped, I never experienced something like this ever in all my years as a movie goer. I really do not want to say much more, as I do not want to spoil anything about the plot. If you are a fan of the franchise, just go to the cinema. These are well spent money.",
    "138": "(Minus 2 stars for the dog.) It was bothering the Bros. By trying to maul them. Why else was it acting like that?This review was made July 3rd 2023.What was this movie about?: it's another multiverse/matrix movie. The Bros are teleported into another universe where they take on a giant tortoise.Story and production overview: Peach is not the sweet, petite character that we are use to. In this she is no push over.So why does she need Mario?The animation is spotless.Voiceovers is a head scratcher. Not sure why they couldn't get a real Italian or the original Mario voice actor. Instead they stuck with STAR-Lord... Get it? Because Mario chases stars and the voice actor played Stsr-Lord.Anyways...The story is good enough for children, adults and fanboys.It's not an annoying film despite the dog scene.Genre: animation, children's, fantasy, video gameDuration: 1 hour and 30 minVillian: Bowser as a physical threat is good. He's powerful but his motives simpySoundtrack: It's cool.Overall: A very fun film. It's redeemed himself after that hash first Mario film. Though I can't believe it took them over 20 years to get Mario right after hundreds of the same cliche games.I just didn't like how they made Luigi into a weakling. It's humiliating.Highlight: Dog falling out of the window.. . Mario getting the mini mushroom.Villian: Bowser. He's a childish, simp Villian. When he Songs he reminds me of Chef.What can be learned? Well this is a children's movie. (fanboy movie too). It's sad realizing children are known targets of dog attacks and here we have a dog attempting to maul The Bros. That's not cool. That scene could give attack victims traumatic panick attacks.Verdict: Solid movie. Pure fun minus the dog scene. Makes you forget about the 93 film.",
    "139": "First off too many people expect a Mario film to be the way THEY want it to be. When have we had the exact same Mario games repeatedly? There's always a difference somewhere.This is a different medium of media for Mario than what we are used to and it done things the Hollywood way, but I would say it felt like Nintendo had their hands in this a lot.It's a film about the Super Mario Bros. Let's not complicate things and throw around lore and \"this wasn't accurate as per the games\" etc. This is a fun film. Kids will love, adults will love it.If you are a huge fan of Mario park your expectations at the door and enjoy this version for what it was intended to be.If you aren't a huge fan of Mario or you don't have an opinion on Mario I'd argue you could still enjoy this movie very much. It's funny, has great pacing, the Easter eggs are there if you want them, but it does soft touch hand holding for those who may not be familiar with the IP.I think it was a great balance between entry level and enjoyable for hardcore fans (who don't take themselves too seriously).Penguinz0 review sums it up the best (he doesn't include spoilers per se but hints at a lot).",
    "140": "If you are a massive Mario fan and have played the Mario games this is 100% the movie for you!There are so many amazing Easter eggs in this movie that really brought me back to my childhood days playing the Mario games.The characters in this movie were awesome and the cast/voice selection for them were perfect.I really didn't know what to expect when coming in to see this movie, I sort of had my doubts but it exceeded my expectation and now all I want to do is play Mario.I really don't understand some of the bad reviews I would highly recommend seeing this movie.Let's goooo! Ahwoohoooooooo!",
    "141": "I remember watching the original mario film in the mid nineties and loving it however upon rewatching it 25 years later it's not as epic as I remembered. I'm not sure if it was sonic that inspired this or if they planned on a movie but it feels surprising an IP as popular as Mario has taken this long, I have to wonder if others have been attempted but Nintendo weren't keen, either way it's about time.What was very smart was this film not going down the traditional mario story because if it had, this movie would have been hated by this generation as a man saving a woman would be seen as a no no and tradition is no excuse, so mixing the story up was a smart move. The story overall was decent, nothing particularly special but I don't think many kids films have epic stories, as long as they make sense and flow then it's good enough.I'm unsure why huge names are needed in these kinda films, seems such a waste of money, but they seem to do it anyway, I guess they can entice fans in but personally I'm not convinced they were the right voices for the roles, Luigi in particular but overall nothing too disappointing.Lastly overall was a really good film, they held certain characters back for an obvious sequel and the 2 credit scenes indicated the one main missing character will be a big part of number 2 and I'm guessing it'll probably be wario based evil.",
    "142": "After the Mario Movie grossed $1 Billion in under the span of a month, I'm tired of people saying positive things about the movie while the negative reviewers get defecated on because our reviews are our opinion that they don't like.\"The Super Mario Bros. Movie\" was horrible, and I wish it was never made market in the box office to success.On Twitter, user pointed out that the Mario movie plagiarized almost every bit of a plot from the Angry Birds movie.Now for the casting, Chris Pratt was awful by doing his Italian voice, in fact, it was so bad that they made the plumbing commercial with the awful voice just to make fun of the fans who hated his voice. Chris Pratt said, \"I understand that the people don't want someone to come along and destroy a popular character, because it's a cash grab\". In response from John Leguizamo who boycott the movie says \"Like I was groundbreaking and, they stopped the groundbreaking\" because of the movie's exclusion of Latino characters.So for the catchphrase, the voices were too drunk like, Mario saying \"It's-a-me\" in slow motion, the old wahoo voice was heard in the movie trailer, same with Charles Martinet who also said that. Also, the scene while at the rainbow road, I pointed out that there's a catchphrase which sounds similar to the pigeon's laugh in the 2019 animated film called \"Spies in Disguise\" which stars Will Smith, and Tom Holland.",
    "143": "The Super Mario Bros. Movie is based on the Super Mario Bros video game franchise. Brothers Mario(Chris Pratt) & Luigi(Charlie Day) are in the plumbing business. One day, they are accidentally transported into a fantastical world, where they must try to rescue a captured princess.The Super Mario Bros. Movie is fantastic. Directors Aaron Horvath & Michael Jelenic have given us a film, that honors the source material, while also being hilarious, action-packed & leaving its own impact on the Super Mario legacy. There are so many set pieces in the movie, that made me feel super nostalgic of when I used to play all the various video games in the Super Mario franchise & this is its strongpoint. The animation is flawless. The 3D is duck-worthy. Chris Pratt is impressive as Mario. Pratt just sounds more like himself, than the iconic Mario voice fans know & love. Anya Taylor-Joy is spectacular as Princess Peach. Charlie Day is awesome as Luigi. Jack Black is the star of the show, as Bowser. Black gives us another outstanding vocal performance, after his iconic voiceover as Po in the Kung Fu Panda franchise. Keegan-Michael Key is superb as Toad. Seth Rogen is hysterical as Donkey Kong. The supporting cast is excellent. The Super Mario Bros. Movie is a must watch for fans of the Super Mario video games. Watch it & have an absolute whale of a time!",
    "144": "This is a movie all kids and adults alike who are fans of the original game and all of the other Nintendo games dealing with Mario will love.Mario and Luigi are introduced as just average guys who dumped their life savings into their plumbing business. No one, including their parents and their family believes in them. They don't believe in their success or their ability to achieve. So, they have to set out to prove them all wrong.An opportunity presents itself when Brooklyn starts to flood. They set out to save the city but end up getting sucked into what we know and love as the games we played as children.The world building and graphics are amazing when they first get sucked into mushroom land. We get introduced to Peach and Toad and get to see you some amazing gameplay as if we were in the game itself (mushroom power-ups included). However, Luigi gets separated from Mario and captured by Koopa while Mario introduces himself to Princess Peach to get her help to save Luigi from Koopa. This is where I almost gave the movie 8 out of 10 because Princess Peach is presented as one of the most powerful and brave characters in the movie. There's absolutely nothing wrong with this, as Princess Peach and Mario have a great chemistry together. I do like her character a whole lot. In the original game she gets captured by Koopa but we don't know too much else about her character from the games so by all means make her a powerful character. Anya Taylor Joy does an amazing job voicing Princess Peach.The movie makes up for it later on and shows that Mario has potential to be the greatest and becomes the savior we all know and love. Chris Pratt does an amazing job voicing the character as well. In fact all of the characters did such a great job including Jack Black as Bowser!Overall, the story is solid, the World building is amazing and nostalgic yet novel. We're introduced to so many characters we love including Donkey Kong and a portion of the movie is reminiscent of Mario Kart. All I can say is that I loved it all and I recommend any Mario lover to watch it.",
    "145": "Flat, visual noise.Fundamentally incurious. Potentially injurious.The mystique generated by the characters in the games is here raked over and presented haphazardly by hacks.A hobbled attempt to explain a long and random evolution of characters who were never meant to be narratised fails. Doing it well is near impossible when you insist on EVERY LITTLE BIT OF LORE, from the last forty years being shoehorned into 90 minutes.Makes little sense, shamelessly leans on member berries to stimulate older viewers but offers nothing else.I feel sad for the animators who did a sterling job, but to no end as this movie has no soul.",
    "146": "This is an interesting film to think about because when you look at it one way it is a movie CLEARLY made for fans of the Super Mario franchise, the Nintendo franchise. There are references and callbacks that are QUITE often in the film to over 40 years of Super Mario gaming history. I would say that if you didn't grow up being a fan of Video Games or Nintendo, then you will have a hard time to understanding this movie. BUT, there is still some amazing storytelling being presented through the soundtrack that is (Italian Plumber's kiss). There's amazing storytelling told through the art design and camera work. The character designs and the designs of the world's had so much detail and thought. You can tell that they didn't want to miss a beat with that. The Voice acting in my opinion worked very well. This is the first time we see a Mario on screen, and Chris Pratt did a great job for making the voice his own. Everyone did a great job.Like I said, you either have to take this movie for what it is, or you don't. It's a Great Kid's movie, Mario Movie, Nintendo Movie, Video Game Movie. As A Movie Movie, that's a matter of opinion. Everyone will have a different experience with this movie. But as someone who has grown up a Die Hard Mario fan, I enjoyed this movie, and it more than put a smile on my face. Well done Nintendo, and Illumination.P. S.-I'm ready for your Zelda and Metroid movie now. :)",
    "147": "Directed by Aaron Horvath, Michael Jelenic, Pierre Leduc, and Fabien Polack. A runtime of one hour and thirty-two minutes. With a PG rating.\"Mario\" voiced by Chris Pratt and his brother \"Luigi\" voiced by Charlie Day recently left their jobs to start their own plumbing business. After trying to fix a major leak in Brooklyn they stumble on a hidden portal. Accidentally gets sucked in, and splits them up. Taking \"Mario\" to \"Mushroom Kingdom\" and \"Luigi\" to \"Bowser\" voiced by Jack Black and his kingdom.In this new world \"Mario\" meets \"Toad\" voiced by Keegan-Michael Key. \"Toad\" introduces \"Mario\" to \"Princess Peach\" voiced by Anya Taylor-Joy. If anyone can help him she can.Already in a panic because \"Bowser\" is on the move leaving a path of destruction. It will take all hands on deck. With some potential help from \"Cranky Kong\" voiced by Fred Armies, and \"Donkey Kong\" voiced by Seth Rogen. All \"Kongs\" and allies are welcome.They'll need it to stop \"Bowser\" and his \"Koppas\". Along with his wizard \"Kamek\" voiced by Kevin Michael Richardson for \"Mario\" to get \"Luigi\" back. Watch this classic \"Nintendo\" video game turned into a film.\"The Super Mario Bros. Movie\" was awesome. I loved every minute of it. If you didn't know this isn't their first attempt at a film. They made a live-action film back in 1993 with Bob Haskins and John Leguizamo. As a kid, I thought it was a little silly but I enjoyed watching it back then. Now trying to go back and watch it, it's pretty bad.John Leguizamo felt slighted about the new film. He felt like fans thought his '93 version was nostalgic. John planned on boycotting this one because of a lack of diversity. Which I don't know I agree with. When it comes to \"Mario\" and \"Luigi\" they weren't diverse at all. \"Mario\" accent was also terrible. Other than that I think the cast was very diverse in my opinion.The cast was spot on. Chris Pratt as \"Mario\" voice was a little off but as the film went along it was hard to notice it. Just here and there. I loved Anya Taylor-Joy as \"Princess Peach\". Seth Rogen voicing \"Donkey Kong\" had me cracking up, especially when he would laugh. Jack Black as \"Bowser\" stole the show. They let Jack Black be his authentic self. His song \"Peaches\" was hilarious and amazing. I liked it so much that I downloaded it.I loved the fact that this film was jam-packed but everyone still got their time to shine. Whether it was a major role or a cameo I felt like every pivotal or none pivotal character was seen. It was hilarious, fun, and entertaining. They did right by this esteemed video game franchise.They had multiple big scenes that paid homage to \"Super Mario Bros.\", \"Smash Bros.\", and \"Mario Kart\". You felt like you were playing on a massive screen and all you needed was a Nintendo 64, Game Cube, or for my newbies a Switch controller to get busy with.They squeezed a lot in a very short time. The kids enjoyed it and they had plenty of stuff that adults would find funny as well. Plus everyone no matter their age can relate to playing some version of this game. This is the beginning. I expect multiple sequels from this. This is Nintendo's baby. They wouldn't make it if it wasn't done right. Now it's the highest-grossing animated film ever.After watching the \"Tetris\" film and now this. I need to see a \"Nintendo\" origin film. It's time. Another video game franchise, done right. So far \"Last of Us\" and \"Mario\" are the only two. I took my daughter, bring your whole family. All are welcome. I give it five mor fires ðŸ”¥ðŸ”¥ðŸ”¥ðŸ”¥ðŸ”¥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#TheSuperMarioBrosMovie.",
    "148": "This movie should win oscars. I'm not even jokes. The CGI / animation is beautiful. It looks just as good as the new Mario games but it is a movie. I loved to play Super Mario 64 when I was a child so watching this movie is kind of a dream come true. I've not even finished watching it but I had to stop and write a review because it is so good. If you are a fan of any of the Super Mario games then you should watch this because it is great. I think you could probably enjoy it even if you don't know the games but it is better if you do. They have thrown in lots of stuff for the fans, like sometimes when Mario is running around they shift the camera to angles where it looks like you are playing a Mario game. They have all the main characters and places and stuff you could want from the Mario games. I generally don't expect much at all from movies these days but this one is really really good. My favourite thing is Mario and Luigi;s brother dynamic, it makes me wish I had a brother like that and we could cosplay as Mario and Luigi. All the actors are great but Charlie Day as Luigi is my favourite. I'm a huge fan of it's always sunny so it's a nice weird surprise to see him play Luigi. This is a really great film and it deserves to be very successful and it really should win oscars especially for the visuals / cgi you won't see a better looking movie this year that's a guarantee and Princess Peach is a hot piece of ass.",
    "149": "As a 42yr old guy who's been playing Nintendo since he was about 9 that was amazing!!I didn't stop grinning all the way through that!!The Easter eggs, the music, the fan service...epic!!It's pretty obvious it's not gonna win any Oscars and the plot isn't going to be too heavy...its a kids film after all...but it does enough to keep you entertained and giddy as a school kid!In my eyes you couldn't ask for anything better and I hope there's a sequel not to far down the line and maybe one which can branch off in to other directions and open up a Nintendo Universe, who knows!!If you're a fan of Nintendo you gotta go see this!!Proper loved it!"
}