{
    "0": "I liked it. It's a nice old-fashioned (flawlessly 70's styled) slasher horror-flick, with a fairly original premise. As in any comparable horror movie the motives for the killings are pretty farfetched, but who cares, when they are pictured so relentlessley gruesome, the gore here is definitely not for the tender-hearted. Another strong point is how the movie very gradually builds up the tension, this is a real slow burner, the apprehension of looming doom is palpable throughout the movie. This is helped by a strong direction, a very clever and inventive editing, and some great photography, see for instance the scene of one of the girls swimming in the lake, while... well, I won't give it away, but it's beautiful and hair-raisingly scary at the same time!Add to all this some very funny dialogues and goings-on at the start, and you're in for a well made, old-school horror flick, maybe not life-changing but absolutely entertaining for those who can apprciate this kind of movie (like me!).",
    "1": "My expectations were quite high for this film ... After watching it , I just don't understand what's all the hype is about ? To call it mediocre is to make a compliment ! Slow , predictable , not very clever horror , which is not even a horror , just an unrealistic portrayal of mayhem based on sex... Highly not recommended !",
    "2": "5/10 - while it was nice to see Brittany Snow on the big screen again after the Pitch Perfect movies and it continued Jenna Ortega's Hollywood takeover, this utterly bizarre, inconsistent, and incomplete attempt at a \"sexy slasher\" starts off strong but a few moments aside, becomes utterly laughable in the last 45 minutes.",
    "3": "Don't get the positive reviews, basic acting, boring plot and genuinely pointless, the story was just so dated and predictable.The kills\nOh go into this basement\nWhy can't we see the hand\nOh a distraction\nThree random holes in a wallSo many stupid predictable lazy outcomes. It was just a tragic mess that was slow, dull and lazy.",
    "4": "While I knew this film was presented as a slasher film going in, I had better expectations given it was an A24 Studios film. Despite some of the famous names in the cast, I wouldn't consider it good. Probably my least favorite from the A24 films. The film is made in the cinematography style of classic 1970s slasher films, but it holds back on the brutality with the females. I really wished A24 was above PC culture.True 70s slasher/horror films were very brutal with both genders but not this one except perhaps with the old woman/zomb-et at the end.I was hoping at least a slightly smarter screenplay given it is A24, but disappointingly no. Mia Goth was probably the only likable character in the film. But I feel the special effects people overdid the prosthetics with the old couple. They resemble zombie monsters far more than the elderly. They could have placed a real elderly couple in there instead. Yes, the film does have some gore and blood but its predominately a very tame film. The worst of it all is a disembowel cow hit by a truck on the highway. It's not even part of the main story and we also see the aftermath of the accident.I don't feel the film deserves to be elevated because of the technical production. Authentic 1970s low budget B films were not technically sophisticated in camera work and lighting. The fancy lighting and best cinematographers of the time were reserved for mainstream big studio films and not low budget horror. With today's pre-fab software plugins templates for adobe software, copying the style wasn't an Einstein endeavor. Had this film been made by any other no name production studio, it would have been relegated into another Netflix Original category and not given accolades. The recent Netflix Texas Chainsaw original from 2022 is just as good a film as this one minus the famous actors.",
    "5": "In 1979 a bunch of young filmmakers set out to rural Teaxas to film a porno film. They rent a cabin in the middle of nowhere from an old guy. They begin filming but the old guy and his wife have other plans. Soon the young people are fighting for their lives.This is a very odd film. It's a solid hour before any horror kicks in but when it does it's VERY bloody, gruesome and pretty sick. However it is well-done, the acting is good and there is plenty of female and male frontal nudity. Also I love how the opening and closing credits look like they came off an old porno flick! Worth a look but the buildup to the blood and guts is kind of slow.",
    "6": "Not really a jump scare sort of deal and like if you read the little description about the movie it has all the spoilers in it already.First point, I thought it was really funny when kid Cudi was standing in the door frame and you could only see his shadowSecondly For a movie about making a porno, there were adequate number boobs shown.And the prosthetics used to make the main actor look older we're great. In all worth a watch like most things above 5 starsLittle note to IMDB -Not only do I not want to write a 500 word essay I also would not like reading other peoples 500 word essays. Make it like 200 easy.",
    "7": "Instead of getting a horror movie of the 70's, you watch a group of junkies going to make a porn movie on a farm, which turns out to be nothing but a long drawn out build-up, before they get wiped out but one. Some people call it a slow burner, but they're wrong, it doesn't even get lit.",
    "8": "... there'd be plenty of flesh and gore and comical carnage to see, with disfigured torsos, extreme loss of blood flow, and attempts to escape but not being able to quite flee.... and it would be better than this.",
    "9": "People rating this 9 and 10. Did we watch the same movie? Its a hilariously bad slasher. Just the premise of it is enough to stay away from it. 6 adults get terrorized and murdered by a couple 90 year olds that can barely move. Yeah you read that right. Imagine not knocking out a 90 year old that moves with the speed of a turtle. Waste of time.",
    "10": "I can't with movies full of characters that just walk around without any instinct doing the absolute dumbest things they could possibly choose before they're murdered. It's literally the whole movie. The 'action and gore' is actually pretty tame. The sex is explicit. The characters are idiots.",
    "11": "The movie is ok. The acting is very good. But the old couple don´t seem believable. I don´t get all the raving reviews. I wish I had watched something else.",
    "12": "A very stylish rendition of original porn leading to some brilliant horror set in 1979 that is well written and fun to watch! X is surprising in all the right ways and very weird reminds me of M. Nights The Visit just more extreme. I was surprised to see Sam Levinson's name in the credits I love him and his projects! Ti West created something special, I've seen a couple of his films he seems to gear towards disturbed older folks which is quite effective.",
    "13": "It isn't a porno movie, it isn't an erotic movie, it isn't an horror or suspenceful movie.It isn't anything, but a total waste of time.Takes too long for anything to finally happen and when it does, it is totally predictable.What a terrible waste of time watching sex clichés, exagerated old age stereotypes and a complete lack of suspence, horror or anything worthwile.Why even bother wasting money or time filming this?",
    "14": "A verrrrry slow first hour, then murder with slow, silly mistakes. Overall good low-budget production but without payoff unless you like murder without sense and little story.",
    "15": "An hour into the movie before anything of note happens.Then the next 40 minutes where a little bit happensLacklustre story using all the old horror tropes whilst actually making them worseThe guy cannot do horror stories, aspires to be Wes Craven but ends up more like Wesley Crusher.I wonder how much of the advertising budget was spent on paying people to leave glowing reviews.",
    "16": "This is a technically well-made movie. It's a slow burn but I was never bored. I was enjoying it and curious to see what comes next. Until it got weird. And gross. This is coming from someone who watches tons of horror and gore. That wasn't the problem. The gore is one of the movie's best qualities.But the direction they take with some of the \"horror\" late in the movie is off-putting. I understand what they are going for. I understand that's the point. And the point does come across. It still doesn't change how I felt. Which was unsettled, not scared.Some people might like that type of \"horror\" (like Gabe from The Office lol). I am not one of those people. It's unfortunate because it's a good setup that just doesn't land for me. (1 viewing, opening night 3/17/2022)",
    "17": "A man looking for a get rich quick scheme decides to make a porn film on a Texas ranch in the video days of 1979. The place is owned by a creepy old couple who look like ma and pa kettle. The old lady is both horny and violent and a scene with geriatric peop!e getting busy is downright bizarre. The leads are fine but X is only an average horror movie.",
    "18": "6 people go to an old couple's farmhouse and all but one get killed by them just because the old woman wanted to have sex and her man couldn't do it himself due to heart problems. That's it. That's the whole friggin movie!!!!! I just wasted 1 and half hours of my life jezzuzzz!!!!! Shame on a24 !!!",
    "19": "This was a 7.3 with 15k voters when I first looked, a 7 when I watched and it's been dropping steadily. I just went through all 300+ reviews, hitting yes and no as it pertained to each. I'm guessing most if not all of the sparkling reviews, of which there are a ton, are fake.At least 30 minutes was of nothing happening, with long, slow, boring shots. It was barely interesting and towards the end became repugnant and repelling. The old man effects just looked dumb. The fact that this has so many 7-10 ratings and all the fake reviews is just sad. I watched because I liked West's Cabin Fever 2 and The Sacrament; this was nowhere near as good.",
    "20": "The movie is not a 1, but it DEFINITELY is NOT a 7.3, which is the score at the time of this review. Not to mention a 96% at ROTTEN TOMATOES...yes 96% LOL!!Yes, this is a typical Ti West movie (which I did not know until after I saw it). Now it makes PERFECT sense why its so horrible. His movies are always CRAP.THANK GOD I did not see this in the theater. THANK GOD I did not pay for this. I would have been really upset. But even for free I still feel like I paid something for it...like my time.1/10 Another HORRIBLE TI WEST \"film\"",
    "21": "This movie was just a bunch crap strung together with random scenes meant to try to make it seem better than it is.The first half of the movie nothing happens (6 people make a porno) and is entirely unrelated to the second half.There's a musical interlude for no reason. I can only guess it's there because Brittany Snow, from Pitch Perfect is in it and she wanted a chance to sing.Then, 2 old people, who can barely seem to move, end up slaughtering everyone, for basically no reason. I guess they're just supposed to be crazy insane. (not a spoiler as it's in the trailer)I liked It Follows. I can't say I liked Color Out of Space but it at least liked that it was trying something different. I didn't like Brightburn. I loved Green Room. I hated this movie!",
    "22": "'The House of the Devil' is one of my favorite horror movies in the last couple decades, but since then Ti West has made continuously awful movies. I really wanted to like this but the premise is pretty lame, and once the motive is revealed about the antagonists, I seriously thought I was getting trolled. I almost walked out of the theater a couple times but hoped the ending would pay off or introduce an interesting twist. Nothing.I can't wrap my head around this high ratings and reviews.",
    "23": "A decent slasher, but does not deserve a 96% rating on RT. The kills felt conveniently cheap and honestly everything was underwhelming. I was hoping to to feel paranoid or scared, but didn't feel much of anything. Spent most of the movie hoping it would get better or surprise me a little but we've seen this all before.",
    "24": "X (2022) ***1/2 Mia Goth, Jenny Ortega, Brittany Snow, Kid Cudi, Martin Henderson, Owen Campbell, Stephen Ure. Filmmaker Ti West's valentine to '70s horror works its grind house magic with a foreboding tale about a group of friends circa 1979 who embark on a road trip to film a porno and get more than they bargained for while setting up shop on a creepy elderly couple's Texas farm in the middle of nowhere. The genre tropes are all there - the tension, eerie camera shots (thanks to cinematographer Eliot Rockett), grungy atmosphere (production designer Tom Hammock has a field day), a spooky sound design (by Graham Reznick) and genuinely unsettling make-up (designed with craft and skill by a team led by Michael Kenna). A fine ensemble with a surprising double role for Goth (as the lead actress with stardom in her eyes and the more than she seems old lady) keeps you glued to the screen with each moment of dread.",
    "25": "In 1979 a group of people rent a cabin to make an adult film in rural Texas. The owner is less than pleased and has issues of his own with his wife.The film is over-hyped. It does have two creepy looking old people who look like something out of Texas Chainsaw. The soundtrack was top rate, as is anything that includes Mungo Jerry. It also has the throwback nudity many horror films have started to avoid. This film reminded me of \"Bread Crumbs.\"Guide: F-word, sex, nudity (Mia Goth, Brittany Snow)",
    "26": "It's funny, I like porn. I like slasher movies. But when this movie put the two together, well, it's not like the person who first decided to put peanut butter and chocolate together, that person was a frickin' genius.For one thing, it's not exactly cutting edge. Pretty much every slasher movie in the 1980's have a certain element of soft core porn in them anyway. As for the 1970's look and shooting style. Again not overly impressed. To have actors who look like they could be from the seventies, the feather hair, the clothes, but the more I think about it, it feels like it's because of movies made in the 1970's that I think people looked and acted and talked that way than because they really are from the 1970's.The point is there wasn't one character I was particularly interested in. They all seemed to be cliches of cliches, the blond, the Linda Lovelace wannabe, the guy with the gasoline pump in his pocket. And most of that seemed to be cribbed from movies like Boogie Nights (not to mention When Harry met Sally), they're not just doing porn, they're doing art movies and of course they have their own little world in which they look out for each other, they're like a family with a little church mouse too.Again it's one of those movies where as soon as a character disappears for more than two minutes, I completely forget they were even in the movie. Oh yeah, I forgot about the one in the cellar, how's her hand again? What happened to the blond, she still alive, oh yeah, there she is sleeping.Which is the point, first they do the porn stuff and then they do the killing stuff, one by one, off the go. Which as another reviewer mentioned, I guessed absolutely every way they were going to be killed. Not even one was a surprise. The only thing I messed up on was the order in which they were killed. After the first guy got killed, I figured it would probably be the blond, boy, girl, boy, girl. But no, they killed all the guys first. Which really makes me wonder about this world, whatever happened to ladies first?As for the one who survived, yeah, pretty much figured if any of them were going to survive, it would be her. Only problem is I have no idea why she did survive. I mean, she is exactly the same as all the rest, not one thing different, so I can't for the life of me figure out why she lived. Not that I really cared except in a mildly disappointed way.But of course that leads to the reason behind the killing. I've seen some pretty bad reasons but I honestly can't think of one more stupid. It appears to be because granny ain't gettin' any. That's it. My first thought was well, maybe she should bake a few more pies then, find a hobby. Then I thought, well, it's kind of ironic, they're making a porno movie and it never occurs to the old lady to take matters into her own hands, sort to speak, maybe do it the way porn intended. I suppose in the 1970's they didn't have quite the same technical advances but they live on a farm, it can't be that hard to figure it out.Of course none was more interesting than wondering why she didn't ask if she could join in. I mean, the movie was called the Farmer's Daughters, and they already made room for the church mouse to join in, so they could have called it the Farmer's Daughters, plus one, and Granny. They were trying to make an art movie, well it don't get any more artistic than that. The great thing is it would have shown what cheap hypocrites they all were. Yes, they have one big scene where they talk about the hypocrisy of prudes and religious folk. Ok, well open minded people that they supposedly are, I would have loved to have seen old granny show up ready to get down to business, ready for her close ups. My guess is their open minds would have closed pretty darn fast, about as fast as they're knees.",
    "27": "Average acting with an extremely predictable story. Was hoping for more but the writers apparently thought viewers wanted the same old boring crap that's been done countless times.",
    "28": "It's a trope that slashers have some aspect of sex in them, sure, but the entire first hour of this pos is just the result of a horny director who wanteed to make porn but also wants to pretend they're making a legit movie to their friends. So they filmed bad porn and then tacked 40 mins of slasher on the end.A solid hour of just \"look she STILL has her tits out\" and \"let's have another group discussion about the morals of dating a porn star,\" followed by a kill scene set to the most cliched song to ever be in a kill scene.I get that there's some stupid nonsensical lookalike story going on with a girl and the old woman, but every time she moves in tense moments and a big rubber mask is bending in unnatural ways it pulls you right out of the immersion.The pacing is all over the place. Some scenes just go on for way too long for basically no additional payoff. Like yes, the killer is obviously emotional, but I got that from the first 10 stabs, and the next 20 just had me waiting for it to be over. Some scenes are way too blunt, having a person wander into an area and get killed in about 1 min flat.There's very little imagination in the kill scenes, which may have flown in the decade it's set, but we've had decades of slashers and can expect a bit more these days than someone blatantly holding a knife behind their back stabbing someone. I really hope nobody lost any sleep trying to write that scene.",
    "29": "I only gave it 1 star because it's supposed to be a horror genre but i couldn't stop laughing at how funny it was and also how bad it was also. You seriously have to be wrong in the head to come up with plots like this of two ugly old as anything pensioners having sex. And to think they've filmed or started filming part 2 of this rubbish.",
    "30": "Just curious how feeble grandpa and grandma eliminate almost the entire porn movie production crew in the 70s? Alright, there are twisted old folks for sure, evil people do not grow old graciously, but how would they accomplish that when they just immediately drop dead and collapse by having heart attack and hip fracture as seen in the finale? Glad I've finished the movie in 15 min, hope you will do the same. Be warned.",
    "31": "OK, is this movie a cross between Boogie Nights and Texas Chainsaw Massacre? Let's find out.It must be noted that I'm watching this at 4pm with the sun still up. (Does one have to watch a movie at night to add to the effectiveness of the creepy nature?)\nMovie starts off with a Sawyer homestead crime scene where sheriff Danny Glover combs the aftermath. He then steps right into a scene ripped right from \"Just Cause\" as the religious TV mumbles out some preacher rhetoric. \"Sheriff? You ought to take a look at this,\" informs the second in charge. Yeah, let the sheriff see it but don't show the audience. That's some Alfred Hitchcock leave-it-up-to-the-imagination stuff right there.This Wayne clown is doing his hardest to look and sound like Matthew McConaughy as is this movie's similarity to the Texas Chainsaw Massacre.Isn't this the same gas station as that recent Texas Chainsaw Massacre on Netflix?Won't surprise me if they pick up a hitchhiker next.Wow, this movie's biting so many scenes from Texas Chainsaw it's not funny. This Maxine character is even wearing Pam's red short shorts. It's also the same front door, same staircase. Is Leatherface hiding back there somewhere? You can pay homage to a movie but not steal directly from it.So, what are they gonna steal from next - the boat in the river scene from \"I Spit on Your Grave?\" Oh, it's \"Lake Placid,\" my mistake.This Maxine chick looks a lot like the blonde from Abba in the face. Especially around the eyes with the blue eye shadow.I'm still undecided if this old man looks like Robert Duvall, Uncle Leo, Willie Nelson or that hunchback thing from Rocky Horror.The possessive cameraman in the movie, who looks like Jarod Leto by the way, his curious girlfriend cheats on him and he cries like a baby before becoming the first victim in the movie. It's real cheap of this movie to steal Halloween's Blue Oyster Cult song. Another low blow.At certain times and angles this looks like the Evil Dead cabin as well.I wonder if that's Johnny Knoxville under those old people's body suits?I love in Hollywood movies how they exaggerate people flying through the air when it comes to shotguns, (Lethal Weapon.) A shotgun may dislocate your shoulder but it won't project you four feet backwards through the air. I saw a boar once take 3 shots from a boom stick and it stood its ground.For the record this modern movie did not capture the essence of the seventies, no sir. Not in the slightest. Modern day entertainment ain't leaving its mark on history. They're disposable throw away rubbish you only watch once and are then quickly forgotten.The recent Texas Chainsaw Massacre on Netflix was filmed in Bulgaria. This knockoff \"X Massacre\" clone was filmed in New Zealand. The state of Texas is being poorly misrepresented as of late.What's the matter Hollywood can't you film on real site locations anymore due to it being too expensive?A cast of porn actors, and film crew, travel out into the countryside of New Zealand where they pay fifty bucks for a cabin to film R-rated porn.The 2 geriatric hick homeowners of the land of fluffy clouds detest their inner city ways from the get-go and make this known causing a gulf of distrust. They resent them making love on their grounds and seek retribution because of jealousy and age bracket.By film's end you feel nothing, and hey, that's today's modern entertainment for ya.",
    "32": "\"X\" follows a group of young actors and filmmakers in 1979 who rent out a guest home on an elderly couple's Texas farm to covertly shoot a smut film. However, things go awry when their hosts prove to be demented and dangerous.This feature from writer-director Ti West (who wrote and directed two solid indie horror films in the 2010s--\"The House of the Devil\" and \"The Innkeepers\") is undoubtedly his most accomplished work to date. While it has all the standard machinations of your typical slasher film, the premise is unique, and the stylistic choices here are effective and inspired by the past in a way that does not feel gimmicky or cheap.While the first half burns slowly, it is peppered with a number of subtle creepy moments that foreshadow the pandemonium that is to come. The cast does a fantastic job, with Mia Goth making for a very memorable lead; the supporting performances by Brittany Snow, Martin Henderson, Scott Mescudi, and Jenna Ortega are all equally smart and nicely telegraphed. Adding to the ambiance is an eerie western-meets-choral score by folk/goth rock songstress Chelsea Wolfe to really round things out.Above all, the film is a true love letter to the works of Tobe Hooper. That it draws on Hooper's seminal \"The Texas Chainsaw Massacre\" almost goes without saying, but it also pays homage to his lesser-known followup feature \"Eaten Alive\" in more ways than one. Themes of personal autonomy, youth, longing, and regret are neatly folded into the screenplay, serving as springboards for the central conflict that drives the carnage, while Hooper's visual influence bleeds through it all.Homage aside, what is perhaps most refreshing about \"X\" is that it uses its touchstones wisely, working the slasher formula with intelligence but not veering into self-reflexive territory. In an era where hyper self-awareness has become a diegetic mainstay in horror films, \"X\" opts to check its pretensions at the door. What is surprising is that, in doing so, it still manages to operate as a smart, slick slasher flick. Even more than that, it is simply a rollicking good time. 9/10.",
    "33": "I had high hopes of the latest Ti West movie but it turned out to be a bit of a damp squib. Not scary in the slightest neither is it funny or sexy. West's trade mark gore has been toned down perhaps to get a wider audience but the movie fails to make up for that in other ways. I just couldn't care less about the characters, a bunch of sexual degenerates making a porno and the constant references to Christianity by way of a TV evangelist is just lazy writing. On the plus side I guess X could be viewed as a morality tale, bad stuff happens to those who do bad things but is that enough? No it isn't. Distinctly average ( at best ).",
    "34": "No Spoilers.Let's be honest here. This movie was total and complete garbage.It was like they tried to take Texas Chain Saw Massacre, The Evil Dead Remake, The Visit, and throw in some porn to make this crap fest....\nBoring, no plot, no character development....Half of these reviews have to be from braindead millennials and generation Z kids. I have seen thousands and thousands of horror movies; this one was in the top 10 WORST.....",
    "35": "Are y'all serious?? Maybe you could be generous and say 3/10 for acting and production and that's it. Story is a 1/10, at best. I just watched the sam predictable slasher movie I've seen 1000 times before, there was nothing different that stood out in this one-besides how slow it burned til the last 40 or so minutes. What kind of a joke are the ratings/reviews including the critics reviews? I usually love A24 movies but wtf??? Don't waste your time...wtf did I really just watch?",
    "36": "This movie is utter trash. Started off great and then go weird and slow quick. How the hell is this 95 by the critics on Rotten Tomatoes. Bad acting, bad plot, bad everything. Don't waste your time and money.",
    "37": "This isn't like Ti West's other films. It's tasteless garbage with a few good scenes scattered throughout that end up being meaningless when the film descended into complete nonsense and shock value.",
    "38": "I expected a lot more from this movie. It felt a lot like a reboot of the Texas Chainsaw Massacre. Too many similarities and the overall story is hardly believable. Disappointed as Ti West has made some good movies before. This is not one of them.",
    "39": "This movie starts off slow and never picks up. It's not a horror film so much as a boring film. If you like other peoples fats then is is a movie for you. The people act dumb. They way the people die is funny. The CGI and makeup is terrible. How can anyone rate this movie higher then a 2 is beyond me. This is one of the worst horror films ever.",
    "40": "The acting was ok, certainly better than the slasher films of the 90s.But the story line was deficient, no real aim and when you find out what's going on it just falls flat. There were so many plot devices available that should have been used to create the atmosphere of a horror but were used sparingly. No creative buildup with the alligators (once and done), the barns where one stood on a nail then well not much. Even the religious overtone wasn't used to amp up the feeling of impending doom. It just played out on a TV, this has been done much better.There also wasn't much for slasher fans really. The blood and gore felt like it was on a serious budget and sparingly used.A 4 because the actors were good, just badly written.",
    "41": "Do not believe the hype around this movie, I loved most of A24 films ventures. This was a dud.Mia Goth was great, she always is, But the film itself was really uninteresting, it takes too long for any actual murders to occur, and what comes before really isn't all that interesting, I appreciate slow burn but this one was more of a slow fizzle.The gore is also super overhyped.. what movie did the others watch?A guy gets his neck stabbed repeatedly, and a girls finger is cut with a knife and then a woman's head is ran over by a wheel.. idk, wasn't that gory lol.I like Ti's other films too, so I was surprised to dislike this one so much.. but I really did.",
    "42": "The movie starts well with giving seventies vibe. The concept seems innovative and interesting. Though its bit slow in begining it builds creepy feel. However, in second half it just feels like the director wants to get rid of the characters. The death of characters is stupid and incoherent. It feels as if the director just wanted to finish off the movie and go home. So a good concept but poorly executed.",
    "43": "No idea why this film has rave reviews? It's so boring.Nothing happens for the first hour and then the characters start getting picked off, one by one, for no reason whatsoever, in really cliché ways.The \"villains\" are laughable; some weird old couple with bad make up.The script is pretty much boredom with a bit of sex here and there.It just crawls along, telling an absolute nothing story about '70s porn actors, and then the old couple decide to start taking them all out in really stupid ways.Don't get the acclaim surrounding this flick at all?Really boring horror. Definitely don't recommend.",
    "44": "A fairly uninventive horror movie with predictable jump scares and run of the mill slasher movie gore/kills. It seemed like this could have been better, given the premise, had they been a bit more inventive and maybe delved into the old couple's backstory a bit more.Also, the old couple should have not been quite so old.... using older actors that could pull off the roles without a tremendous amount of really fake looking \"old person\" makeup and prosthetics (lead Mia Goth plays a dual role, also portraying the old woman in the aforementioned terrible makeup).",
    "45": "So it's a horror movie about a bunch of people setting out to make a pornographic movie in some remote location in Texas. I'm not sure I can come up with 600 words for a film that is lackluster when it comes to porn and is just a nonsensical slasher film, but to be honest, I don't think after all the horror and/or slasher movies I've seen since the 70's on that any can really be effective anymore. Yes, it's bloody, but been there, seen that. Mia Goth does deserve some mention as she's by far the best thing in the cast in two roles, but the rest are all forgettable. I do not understand the critical reception this received. .",
    "46": "There was nothing new in this movie. The story was a mixture of several slasher movies and no new element was present in the story. You can't feel any intensity or any thrill in the story. There was not even a single scene where you would shout or think what's gonna happen next. The performances by the cast members were also weak due to which you can't connect with them. Overall, it was an average slasher and a wasted opportunity.Now, it's prequel Pearl has also released which I don't know why is made. No one asked for it and I don't think anyone's interested in knowing psycho's origin story.",
    "47": "This movie takes way too long to spark at all. And I say spark for a reason. There are no good kills in this film at all. This should have been rated PG if it weren't for the sex. The old age makeup was pretty bad and I am guessing that's why those characters were shot mostly in the dark. This was a big yawn fest for me.",
    "48": "I was drawn to this film as it seemed like a novel horror film which I've been longing for.But really? The old woman's face looked like one of those latex masks you'd find at, I don't know, Party City, or Spirit Halloween.I was hoping for something unique regarding this rather odd old couple but really they just envied the youth and their hypersexualism.Most of this film consists of bland, subrate, partially censored adult film content and that's really all this is.I thought going in that the adult film stuff was just a front for something special, but no, that's really all this film is. Yes, the lone survivor girl (oh, how original - yes it's the girl in the poster smh) turns out to be the daughter of the religious preaching nutter on the tele -- But, may I ask, who cares??? It's just a stupid film to be blunt.",
    "49": "This movie was weird for the sake of being weird. On top of which it was exceedingly slow. The kills were fine but anticlimactic and mostly jump scares. I love Ari Aster movies like Midsommar and Hereditary and it feels like an insult to compare them to this.",
    "50": "Slow and boring, add weird too.I don't know what else to say. The picture resembles Texas Chain Saw, but there is nothing scary or fun. Just slow and weird random death.",
    "51": "If you like naked skin, and crocodiles eating pornstars, at a farm of desolation, inhabited by grizzly and grim old knackwursts thats just awaiting death around the corner. How this herdy gerdy silky skinned b-horror movie end, i sall not tell other than blood and gore and some classic burlesque moviemaking youll get.A lowbudget horror, some scare jumps, very classic to the genre, and will for sure make some turn their face away from the screen.but not the grumpy old man,, who found much of the darkfilming too stresssfilled to handle. Therefore just a small recomment for mr and mrs average.",
    "52": "What this movie has in blood and guts it lacks in almost every other way. The story and acting fall apart right away and as much as I wanted to hate watch it I was left so bored while I waited for the next death scene. Nothing interesting here and nothing new. Would not recommend.",
    "53": "When people say it's nostalgic to 80's movies they arnt wrong.It's just like a terrible 80's movie that's focused on all the wrong things.I'm never one to complain about gore or adult situations in movies, but this movie does everything as trashy as humanly possible to the point it makes it hard to finish the movie.I would rather watch piranha 3D on repeat for the rest of my life than watch this movie one more time.",
    "54": "I don't understand how this movie has been rated so highly. It has zero redeeming qualities and was thoroughly unenjoyable. Spent 1hr and 49 mins waiting for it to be over. Would not recommend.",
    "55": "I was laughing at how ridiculous it is. How did this even make it to production. Cheesy and very low budget. Don't waste your money, it's a joke. The sex scenes are stupid and not even that R.",
    "56": "So we're supposed to believe a couple old people who can barely move are able to kill these young healthy people?I found this movie boring and predictable, even thou it was ridiculous idea.",
    "57": "I have many issues with this film, and I will be addressing them all in bulletin points.The plotThe groundwork that was laid for this film was cool, but it did nothing for anything. This movie revolves around a. Murder scenes b. Sex scenes..... that's it. If there's a story, it has not been told.The character developmentIt is so hard to care about any of these characters with the ways that they are portrayed. I would appreciate it more if it were obvious that the cast were supposed to be grey area characters. But they lack any substance of anything. We are told that the main women want to be stars. But why? Where's the motivation? I want to know why they are there and how they got there. Context can make a world of difference, and there is none. And even at the end, nothing is resolved. Is the character that Mia Goth plays still going to be a drug addict? Sure, she survived, but is she going to live beyond that?The messageThere isn't one. That's all I had to say, let's move on.The climaxOr lack thereof, I should say. Once this movie begins its murder rampage, it doesn't pause but it makes less and less sense. It gets so wrapped up in the ways that the characters have sex and get killed that it leaves no room for any suspense, any details, or character building. I still have no clue what the true climax was and when it was supposed to have started. I guess it is when Mia Goth (who I can't remember her character's name or any of the others' because they spent so little time on it) is in the main house and the rest of the cast members die. But it is so short-lived and creates no satisfaction.ClichésSo many of them. I could guess the way the characters died before it even happened.Where's the twist?I sat this whole movie through, expecting a twist. There's always one in the horror movies these days. I picked through all the details of the film, looked at every picture in their frames, and started guessing and trying to work out how it would end. And then a twist never came. They're just some old, whack-job couple I guess? Weird. Not much motivation for their ways either, other than the old lady's jealousy.-The resolution\nUmm... I'm sorry, but the old man randomly having a heart attack in the hallway and dying is the LAZIEST way I have ever seen someone die in a horror/thriller. The script writers were so obsessed with the deaths and gore, but for this guy? Nahhh, that was suddenly too much. Dies silently and peacefully in the hallway of a heart attack. And wow, the old lady dying is almost as lazy. She gets blown back by firing a rifle, which cripples (?) her and she gets her head ran over by Miss Goth.-The whole stupid car keys part\nThe old lady steals the car keys... only for her to easily tell Mia where there are in the home (not even hidden or ON HER where they would've been the safest from being re-claimed by the group) after she realizes her husband has died. Could've just left that whole plot device out and everything would've been the same in the story. I'm going to also add that it is very flimsy storytelling that this evil old couple a. Died so easily without a fight and b. That the lady told Mia where the keys were JUST because he died. Is she suddenly no longer afraid of going to prison? Or that this girl she wants so badly will escape?TL;DR - This movie focuses so heavily on gore and sex that it loses all capability of telling a story or creating realistic characters.",
    "58": "Advance 'word' on this was good. Not sure whose word it was but they're wrong. X is mostly dull with some soft-core scenes, a musical interlude, bad make-up, crappy acting and precious few scares. Still waiting for a horror movie that lives up to its advance hype.",
    "59": "So, I've came back from seeing this film & wasn't surprised as I sort of knew what was going to happen. I didn't see any previews so I sort of walked in blind while only knowing the name & brief story about this film.The film sees a group of adults in 1979 going off to rural Texas, Austin, 1979, to film a an adult film at a farm homestead & paying an elderly couple for them to rent out their cabin as a shooting location. But things take a dark turn as the couple seem to take a bizarre & creepy interest in what the young adults are doing.I found the film to be pretty great. It's well shot & well written. The story is creepy as with the message about jealousy & envy. The deaths are typical of any slasher of course, albeit the lake scene with the crocodile was pretty ace. It's gory as & has a great 70's/80's horror slasher feel to it which is great in itself. The eye candy is something else & there's some funny but disturbing parts also.The film did have some pacing issues though & took a while to get to the gory parts, the eye candy made up for it of course, but I did feel a lot of scenes dragged far too long than needed to be which sort of frustrated me a little. It's long for what it is at 101 minutes (1 hour 41 minutes).Overall, it's pretty neat slasher & as gory as the name suggests. It does take a while to get going, drags a lot, but the pay off in the final act is worth it.7/10.",
    "60": "I expected much more since most reviews are glowing. Nothing more than a slasher with a ridiculous story (like most slashers) and the tempo was so sloooooooow.",
    "61": "I was intereste in seeing this mvie and it was a huge shock. Half the movie is like sft coe porn an the rest is judt bad acting and sme total ridiculus deaths, Ever sigle one I crrect predcted withut seeing even a trailer of the mvie. The ending was absymal and the entire movie was a waste f time. I will never watch it again and wuldn\"t recommebd it.",
    "62": "Pro tip: start the movie at about 55 minutes in and then it might be watchable. The main problem with this film is that TCM has already been made. As well as TCM 2,3, remake, prequel, reboot, and about 200 other better similar movies that the film makers obviously considered reverential. Too bad because I feel that, with the proper direction, it could have been a decent entry into the genre.",
    "63": "The reviews here have me curious. I might download it at home later and look at the end but I couldn't sit there any longer. I kept giving it a chance and just give it a little bit more a little bit more and I finally got fed up with its weird stupid thing it was doing. Some movie just meandering all over the place and not going anywhere interesting.",
    "64": "There are a lot of good qualities possessed by X. The cinematography, the atmospheric vibe, interesting cast, witty dialogue, and a story you can get into. Basically a modern version of Texas Chainsaw Massacre with superior moviemaking skills. However, while I DO rate this film as better than the Texas Chainsaw Massacre, it still falls short. It could've been better with a better set of villains. The old couple just lacked any sense of credibility. All they served to do was gross us out with their desire to get naked all the time!!! At least Leatherface was a credible and scary villain.Still it is definitely a movie to check out.",
    "65": "Ya... don't bother...This movie had zero redeeming qualities... sorry- it was just bad... wish I could have gotten my money back... I've gotta be more choosy about what I go to see on a cheap Tuesday movie night- some shows aren't even worth the $5...!",
    "66": "I was excited about this movie because I love horror and it had good reviews. I don't understand. I definitely turned it off a little halfway through. It's super slow and I wanted a horror movie and not a porn.",
    "67": "I couldn't tell if half the movie was a joke or if it was legit supposed to be scary , it's none of the above , the actors all have half ass lines , there is no back story on how they know each other , other then coming out of a strip club , they don't say why exactly they are going to that area to film the movie , the little description says they were \"caught \" filming the movie when it's more like the old lady is creepily watching them which , there are a few scenes that I guess are supposed to be suspenseful but are just so random and weird , the whole thing was boring , not scary or even slightly scary, the deaths are campy and obvious on what is going to happen,",
    "68": "Fully hated it.Vapid characters, imbecilic dialogue, uninteresting deaths, no plot twists, no surprises, a poor man's Matthew McConaughey. Not even Mia Goth could save it. I really have no idea what A24 was thinking picking this one up. Maybe just because conceptually they knew a horror movie about porn actors would bring an audience no matter what?Honestly the only thing I liked about it was the fact that Mia Goth also played the creepy old horny woman. That was the single redeeming value of the movie. For someone so goddess-like to effectively play someone so hellish and decrepit - that's an accomplishment, but otherwise, this is an absolute garbage movie.",
    "69": "The film started good and it is a fairly interesting story with some good characters among the bunch. I did however find the old couple a bit too unrealistic in what happens later on. It was kind of weird. But the acting was really good so it's an ok film.",
    "70": "Good acting some nice kills ,sex, boobs and nothing more. Don't see how this has a RT score of 96 it's quite long and boring .I was waiting for something big to happen nothing really just alot of blasphamy and jump scares nothing really memorable.",
    "71": "The x should have another meaning, don't watch it. Just rewatch the old 80 movie horror or the texas massacre remake 2003 and 2006. They film it so blurry that you can't even concentrate on it.",
    "72": "I really don't know how to rate this one, I mean I loved the retro 70's style slasher concept, but to have an elderly nympho/rapist/psycho/murdering woman as the antagonist just didn't bode well with me. Not from a theatrical standpoint but from a physical standpoint. Plus, in all honesty, all of the victims would have survived only if her husband would have given her some, she was pretty satisfied after he did. I don't know, I liked the style but the premise just didn't sit well with me.",
    "73": "Who, who is leaving reviews on here giving this movie 7s, 8s, and higher? I was fooled by the decently high score on this page and decided to check the movie out. The premise is fair although pretty long. Then 1 hour into it the \"horror\" element actually starts and... it's the most bland, generic and uninteresting kind of horror. No thrills whatsoever, no kind of interesting plot device going on, no reason for this story to exist at all. Just senseless gore and murder. All of the cast gets killed, then the bad guys die too, and the \"final chick\" survives and escapes. Textbook definition of uninspired horror.",
    "74": "Nothing special, nothing great, but better than nothing. Enjoyed the jump scares. The alligator was pretty well done but why was it there? Things are getting weird and no one has a problem with the shotgun? It didn't put me to sleep but it wasn't far off. I did check the time more than a couple of times. Overall mediocre is the best I can give it.",
    "75": "From the outset I predicted every moment in this film way before it happened. Each death could be seen coming a mile away.Whilst the acting was good, the script and story just felt very low grade and obvious.I honestly don't understand the hype on this one.",
    "76": "...by extremely fake-looking 90-year-olds who can barely move and nonetheless are able to drag corpses and even hang them. Yes, that is what this movie is about.Boring as Hell. It takes forever for the horror to arrive, and then it is not even well done.Whoever gave this movie more than 1 star was paid to do it.",
    "77": "A24 movies continue to disappoint me. I thought that this film would be more like M. Night Shyamalan's The Visit but it was more like Motel Hell.I did appreciate the retro vibe to the film but the 'free love' mentality did not fit in with the time period in which the film was to have taken place.It was a 'slow burn' but the climax (the last 10 minutes of the movie) was not worth it. I enjoyed it, especially how they tied in a television show to one of the main character's arc but the 90 minutes before that were just filler.",
    "78": "\"It is possible to make a good dirty movie.\" Well, apparently not. X is a bad dirty movie because it's slow-paced, boring, and unoriginal. It seems like they had a vague idea for a plot to establish the setting, then shrugged and said, \"I don't know. Then the killer starts killing people or whatever.\" I kept waiting for the movie to start, if that makes sense. When are we going to get to know the plot? The characters? What is happening and why? What is the point of this movie?This is like if a 1st-year film student saw Texas Chainsaw Massacre and wanted to remake it, but only had a budget of 5 grand.",
    "79": "This movie was ok.I was excited to see the film but was let down by the two main villains (old ppl) wearing prosthetic make up. It completely broke the immersion for me and became un-scary and just laughable.The old ppl were so slow at killing i was wondering how they would hobble around to the next kill. And the kills were no creative and so generic. I expected what was found in the cellar at the beginning of the movie to be much more than it was. No pay off. I felt cheated.",
    "80": "Borring.......................................................................boring.Don't waste your time\nDon't waste your time\nDon't waste your time\nDon't waste your time\nDon't waste your time\nDon't waste your time.",
    "81": "In style of older classics, like Texas chainsaw, comes this 2020s modern horror. You can love it or hate it, this movie is not so popular without a reason - and you've already seen it, or at least you will.Even though I gave it the highest score, it has flaws, in terms of story in general... it's a bit underwhelming. But actors are all great, style is outstanding... horror movie lovers will enjoy it for that alone. In the last few years there aren't a lot of horror movies that deserve classic status, maybe around dozen since the beginning of 2020s. This one is among those.",
    "82": "Great throwback to an incredible era of simple good gore and guts. This one has a little bit of all the good classic horror movies rolled into one. Takes a little time to take off but gets you there. I was impressed.",
    "83": "This movie is nothing new. It's just Friday the 13th but they change Jason with a couple of senior citizens. It's such a let down knowing this movie came from studio that brought us Hereditary, Midsummer, The Witch, etc. It's for a one time viewing only, and people are gonna forget about it.",
    "84": "Seriously who has been watching this nonsense, 2/10 at best and that's being generous, it's really really bad, got good reviews because of the nudity.",
    "85": "Despite a good amount of gore, and some nude elders (no full frontal), X fails to shock. Every death happens so quickly no one has a chance to say ouch. It has the look of other A24 movies, bold compositions and strong colors, but behind that there's not much going on. There were gators established early on (in one of the most annoyingly A24 shots of the movie), built up some, and eventually misused in a very vanilla death scene near the end. X could have been fun if they didn't try to appear sophisticated, and took some cues from the type of film that it's about. Why in a movie about porn do we not see one (living) piece of genetalia? Seems disrespectful to me.",
    "86": "When will they ever learn that these types of movies should never be made?X is more or less a expensive adult swim movie that from what I have seen I already knew it was going to be terrible from the moment I first lay eyes on itThere is no sense to watch this movie unless you are desperate for entertainment I for one am not that desperate.It is a total ripped off of other horror movies with acting so poor that it makes you wonder who in their right mind would write this junk?X is just a movie that I wish I could erase from my mind of the clips I saw at work.I wouldn't watch this movie if it was free.I give X an 1 out of 10.",
    "87": "So funny how I posted a true review about this movie the first day it came out and now it is magically gone because I told the truth! This movie SUCKED!!!! What a waste of time, thankfully I watched it for free. So you know you will see nude fake looking old ppl going at it in bed, and yes, it was as disgusting as it sounds! Sad part is I like Snow and Ortega is so hot to me! Yummmmm! It's all good all the ppl that did like it must have got my review deleted some how. I wish I had never watched this and I would never recommend this to anyone I know! I always h8 when ppl leave 1 stars but HEY! If the shoe fits!",
    "88": "X was a nice surprise to me - we get some good actors, a solid production, some gore, and the coloring is similar to the 70s analog cam style. The scenes about producing a porn movie are funny, and add some flavor to that having sex get killed theme. For sure X does not invent the wheel new but for all those guys and gals who like horror movies a la Texas Chainsaw Massacre (you know, those blood-thirsty Hillbillies and their kin), this one is a solid dish - in that constant flow of mediocre to bad (not the good bad kind) movies, almost a shining star.",
    "89": "I usually like most horror movies. This one was slow and highly predictable. Ie: there wasn't anything about this story that makes it stand out from the rest.I did like the chosen actors though.",
    "90": "I created an account because of the BS reviews all over this piece of garbage. Don't waste your time, it's boring as hell and thinks it's being edgy the whole time.",
    "91": "The movie starts out pretty good, but then sinks to disgusting and gross. This is like walking into a public toilet that hasn't been cleaned or flushed for ten years. There is horror and then there is sick, perverted, sadistic, and demented trash. This film is clearly made to disturb as to attract attention and make money. The curious will want to see this, but don't eat before seeing this or bring a barf bag.",
    "92": "5/10 because it kept me just about entertained throughout, but especially towards the end, it became downright bizarre and difficult to watch.Too many silly moments littered throughout the story, especially towards the end. I also didn't understand the camera guy's girlfriend deciding to become involved in the film... It made no sense whatsoever to me. Just to give the guy an excuse to go outside on his own I suppose, and get killed by psycho grandma (whose make up looked terrible if we're being honest).Don't waste your money.",
    "93": "You're a lot berate horror movies out there but this is not one of them this is another crummy horror movie that people gave a 6.9 rating to which it does not deserve it does not even deserve a 1. 9 I don't know where these reviews are coming from maybe there family or friends but this movie doesn't deserve more than one star it's garbage if you don't believe me watch it waste your time waste your money and that love tell you I told you so.",
    "94": "Great start but gets messy after 20-30min into the movie. The motive of the killers are RIDICULOUS its like a teenager wrote the construct and character development of the script. The film starts great but even the directorial work gets worse by the minute and bad editing towards the end.The film could be better if the director/screenwriter/producer would have put more effort into this. This is like an early and rushed script got the green light even though it wasnt production material.Its not even a \"horror\" movie, more like a psycho slasher film school something with a bigger budget.Not recommended.",
    "95": "I really gave this movie a good chance. Before I spun up the DVD, from my public library, I read a number of seemingly positive user reviews. It seemed worth the time.Well it wasn't, at least not for me. First off, it felt dirty to see Brittany Snow nude. I first saw her in \"American Dreams\" 20 years ago, when she was still a teenager, and I suppose I'll always see her as a cute, innocent teenager.Second, the characters are sleazy, the story is sleazy, the cinematography is unattractive. So that just didn't leave much to like. So I admit, I didn't get through all of it, I just couldn't take it anymore. There were so many other, more pleasant, things I could do, like bang my head against the brick wall outside.The movie has a decent IMDb rating, so there must be viewers who like this sort of movie, I just can't imagine who they are.",
    "96": "I don't really get it. To be honest with you, I think it could have used a bit more work. I think the \"buildup\" (to which I will say there really was none) to the kills was very anticlimactic. I mean...pearl and Howard just start killin the people. And for what? Because she saw them messing around? I mean I think I would have been a bit more happier if there was some strange things going on, like personal belongings going missing, or the characters getting uneasy that they're being watched. Personally, I needed a bit more of a buildup. But other people seem to really like it and I will give it the benefit of the doubt that the gore was pretty good, but other than that I will stand by this and say it could have used more work. Take it how you will. Should you give it a shot? Sure! Because maybe you will like it, everyone is different, this is only just thoughts, definitely wasn't my movie though.",
    "97": "It was just ok. I watched twice to make sure I could give it a fair review. I was shocked Brittany Snow showed her boobs, she's usually the \"good girl\".I was surprised she did it for a mediocre movie. Some of the kills were decent and pretty gory. The alligator looks so CGI I couldn't even take that scene serious.It's not the worst movie out there but it's pretty boring. I would not watch again.",
    "98": "I really enjoyed this, I thought I would at first, then half way through I thought I wouldn't and then some stuff happened and I changed my mind. Lots of gore, tonnes of sex (which I guess we expected?!) no twists or anything, but it was still an entertaining film.I tend to enjoy modern slashers set in the 70s/80s/90s etc purely for the lack of technology to make things easier for victims 🤣Anyway, this was on my watch list for a while and the acting was great, it was entertaining the entire way through and had some great little slashy bits all through it. Wasn't sure who was going to make it out alive, if anyone!",
    "99": "In early 2022, Jenna Ortega came to my attention when she played one of the people sought by the killer in that year's installation in the \"Scream\" franchise. Later in the year, she played the title role in the miniseries \"Wednesday\".But she was in another production last year, also with a spooky element. Ti West's \"X\" depicts the production of a porno movie in rural Texas, with things starting to go awry. It's not any sort of great movie; some of the scenes are typical slasher stuff. Nonetheless, it's enjoyable, and that's what matters with these movies. I now hope to see its sequel, called \"Pearl\".In conclusion, X marks the spot!",
    "100": "I was expecting more of this. The beginning was some what promising, but soon I realized how much this movie pretends to be artsy without any actual substance. Dumb main characters running around, Mia Goth being Yet Again a cheap airhead, like she mostly is in her roles. The \"villains\" aren't introduced well enough and they remain very distant. The story is cookie cutter Final Girl without any actually redeeming qualities, the main character doesn't learn anything nor is she likable. If there is supposed to be some kind of commentary on conservative religion nuts versus bohemian nrop stars, the message doesn't get through. I need to stop watching Mia Goth movies, they are rarely even decent. Well at least she doesn't pee in any one's face here.",
    "101": "Slow and stop!! I was looking forward to seeing this and the disappointment was unreal!! The only reason I gave three stars was the violence was pretty good. Trust me, your time is more valuable than this movie!!!",
    "102": "Such a great set up with great tension built for it all to be wasted. It had so so much potential as well as style but decided to go with a boring simple last half of the movie. Not the worst film but won't be watching again. Laughable ending too!!",
    "103": "Now, this movie didn't really have a lot going for it from the outset. Slow, predictable plot and with acting that felt awkward in how they tried to get a 70's feeling going.Jenna Ortega stands out as the least talented by far - whenever she is on screen its' as if nails going down on chalkboard - she has zero screen presence and two facial expressions. Ugh, I hope we're done with her now.Overall, a mess. Give this one a miss.",
    "104": "I'm struggling to come to terms with how on earth so many people giving this 8-9-10/10. You must have not watched the same movie I did. It wasn't god awful but it sure as hell wasn't above a 5. Would have given it a 5, but since y'all are gonna dramatically overrate I gotta give it a 3 to help balance things out a bit.",
    "105": "Consider the law of diminishing returns: X is the best slasher that I've seen all year, last year, the year before and probably for the rest of this year.It may also be the law of the desert island in that it may be the only slasher in years that approaches the blood-soaked heaven of 1978-1981, yet were it released then, would I feel the same way?And after seeing tweet after tweet about how debauched and filthy and sexed-up this movie was, did we see the same film? Or am I really the \"affable pervert\" that Grindhouse Releasing said I was and I've become too desensitized? Or, probably more true, has this generation become more puritanical and repressed than we were?Probably most importantly, I decided to just shut up and enjoy the movie.What I came away with was a film that actually gave me that uncomfortable and awesome feeling of \"I wonder what's next\" and a worry for each of its characters.Back in 1979, a group of young filmmakers set out to make a dirty film in rural Texas, learning nothing from another Texas-shot slasher. And when their elderly hosts discover what's happening, the cast find themselves in a way different movie.Reading that description, I felt sure that I would dislike this movie, but then again, this was Ti West, who somehow took a very basic story in The House of the Devil and made something great and lasting.I've been burned by an A24 trailer before. Come on, we all have. But again, I decided to shut up and watch the movie.And I'm glad that I did.Maxine Minx (Mia Goth, Nymphomaniac) dreams of being an adult film star and people knowing her name. This brings her to deepest, darkest New Zealand, err Texas, along with her producer/boyfriend/suitcase pimp Wayne (Martin Henderson), director RJ (Owen Campbell), his assistant/girlfriend Lorraine (Jenna Ortega, Scream) and two co-stars, Bobby-Lynne (Brittany Snow, the Perfect Pitch movies) and Jackson Hole (Kid Cudi!). As they go deeper into the rural world, we're reminded - of course - of that aforementioned Texas film, what with the van that propels them and the farmhouse they end up in.RJ has a goal. Just because it's porn doesn't mean that it can't be art, he says, almost like a non-burnt out Gary Graver. Wayne knows something more important: porno chic died because middle America is stil too afraid to go to a porno theater and still blushes when they buy a skin mag. But if they can have that movie in the safety of their home? He's ahead of the video era, Caballero and VCA before they'd even realized what was next. The themes of this movie are desire and age battling hand in hand and the fact that the new type of entertainment they're making is based on the oldest joke there is - The Farmer's Daughters - points to the intelligence of this endeavor.Meanwhile, there's Howard (Stephen Ure) and Pearl (also Mia Goth, we'll get to that shortly), the elderly couple who owns the land. Howard barks at everyone while Pearly stays in the shadows, except for the moment where she invites Maxine in for lemonade, a remembrance of youth, some jealousy and a rebuffed sexual December to May advance.That afternoon, Pearl watches Maxine and Jackson at work and begs Howard to make love to her one more time, but while the spirit and the emotional heart are willing, the flesh and the physical heart are weak.That night, Lorraine surprises everyone by asking if she can be in the film. RJ tries to use art as the reason why the script can't be changed; she defeats his argument and he watches her make love through the eye of his camera. That night, he leaves everyone behind but runs into Pearl and that's where - nearly an hour into the film - \"Don't Fear the Reaper\" plays and we're reminded of exactly what kind of movie we're in for.The end of the film surprised me. I should have seen it coming, but the repeated dialogue, the divine intervention and Greek chorus of televangelists all came together in a way that I had no idea was going to occur. Seriously, that preacher gives Estus Pirkle a run for his money.I also had no idea that Goth spent ten hours a day in makeup for the dual role, which she'll take up again in Pearl, a prequel that was shot at the same time as this movie.Even the soundtrack works, written by Tyler Bates and Chelsea Wolfe, who covers Fred Fisher's \"Oui, Oui, Marie.\" What doesn't, however, is the moment where Snow and Kudi sing \"Landslide,\" as we've already established the closeness of the actors and this seems only in the movie to have them remind us they also do music.As bad as 2022's Texas Chainsaw Massacre is, this is good. It feels closer to Eaten Alive, another Hooper film, what with the alligator scene - I winced when someone claimed this movie had a scene that echoed Alligator - and I love how the final girl is the least chaste character in the movie, continually doing drugs and putting herself first.Here's to more horror being committed to only being inspired by the past instead of wallowing within it, pushing itself to new heights. I was worried if West would ever come close to House again; my fears were unnecessary.",
    "106": "I am very unbiased when it comes to movie reviews, and I typically try to see the good in movies, but this movie just did not connect with me. I love horror movies, but I don't know what in the world this is. The plot follows a group of porn producers and actresses trying to become stars. They rent a cabin on an old man's farmland, and they are caught in the act, resulting in violent acts. That sounds great, sounds like all the making for a good/great horror movie. The plot twist in this is ridiculous, and not in a good way. My wife and I literally looked at each other and laughed. By the end of the movie, it was the first time I have ever felt and audibly said that the movie was a waste of my time. I see everyone saying how great it was, and because of this I gave it a second view, and I can say with 100% confidence that this is the worst movie I've ever seen, and I watched Cats.",
    "107": "This movie is trash. No reason for any of the killings. All of the characters are dumber than a box of rocks. They all get overpowered by sore elderly people (somehow). It's terrible. It has one of the worst plots I've ever seen. I've never come so close to walking out of a movie, but I stayed hoping that something would reveal itself to make it not so off-putting. I mean...I love the studio, and the film maker isn't completely trash, in fact I feel like he's coming into his own as a film maker (pun intended,) but is this film needed? I feel like I've seen this story about a dozen times in the last ten or twenty years. Just to be fair, can someone help me understand what's good about it? Besides production design, acting yadda yadda, credit where it's due. The deaths in this were very predictable, and the set up to each one very lackluster. The plot and character also seems very underwhelming. It's a slasher yeah, but unlike Scream 2022, I didn't care about the characters at all. Help me understand the praise please, me and my friends thought this was a subpar horror flick. I was genuinely surprised to see all the love it's been getting.",
    "108": "Ti West's movie really should have been called \"E\" for elevated. It sets itself up as a smart take on the slasher films of the 70s and early 80s. As a bonus, the film within a film has the filmmakers making an 'elevated' porn flick (as a bonus, actor Owen Campbell who plays the \"Director\" even looks a bit like Director Tobe Hooper).Quite consciously taking it's set up from Tobe Hooper's 1974 TEXAS CHAINSAW MASSACRE, X has a group of randy pornographers renting a farmhouse from an elderly couple in the middle of nowhere in Texas (actually New Zealand). Writer-Director West's main idea here is to set up a contrast between the XXX filmmakers and the bible thumping civilians of the area. It's not an uninteresting idea, which, of course, plays off the the puritanical cliche in the slasher films of yore where the most sexually active characters are the most likely to g et killed off. In addition to MASSACRE, West includes nods to FRIDAY THE 13TH, Hooper's EATEN ALIVE and a very specific one to HALLOWEEN. X is set about 5 years after MASSACRE so that it can include a brief exchange about how home video will change the porno industry (adult films were already available on VHS for about 3 years).The movie is very well directed, with savvy use of cross-cutting between the porn film in the making and the terrors that await the group. Mia Goth (in a dual role; actually a triple if you stay after the credits) and Brittany Snow are the two pornstars to be and each dive in with relish. Kid Cudi is the cocky stud, while Martin Henderson is solid as the confidant Producer. Jenna Ortega is the \"crew\" all by her lonesome (she manages to keep her clothes on - must have a better agent). Stephen Ure is the ornery old man who rents out his guest house.As good as the filmmaking is, X ends up feeling too studied. The pacing is lugubrious even if it picks up towards the very end. Once the massacre begins (if not by power tools) it still ends up being fairly typical of the films it's commenting on, regardless of how well executed and 'elevated' it thinks it is. It's also too drawn out to satisfy some gore-hounds and once the blood starts flowing, probably too gross for the internet scribes dreaming of doing extended online essays dissecting it for it's elevated intellect. There are a couple of twists, but they aren't sufficient enough to compensate for the predictability.In the end, it's not as clever as West thinks it is, and despite some good Directing chops and acting, it's simply too self-conscious to be much of a fun thrill ride.",
    "109": "I didn't know what to expect going into this movie. Some reviews said it was porn with some horror, some said it was a slasher B movie. Some said decent acting and a good gore fest.It was all of the above, though I'd say less porn, there are some nude/sex scenes but they're really not the heart of the movie. The gore is well done, the acting is very good I think, and the overall slasher aspect is reasonable, though it could have been a little more creative.Saying all of that none of it is what I'll remember this movie for. What really struck me in this movie was the portrayal of age and how it affects people and their relationships, I actually felt really sad for some of the characters in this movie, and that isn't usually how I'd expect to feel watching a slasher. It really did feel like the writers, directors,. And actors were trying to remind us of something whilst also making a decent slasher. I think it's to value our youth, and our lives as much as we can. I don't want to say much more as I don't want to spoil the movie. Needless to say if you're looking for a decent movie to check out I'd recommend giving this a go. It will entertain you and also make you think a little about the problems others have.",
    "110": "An interesting slow burn, but without enough to make it stand against the countless other slasher films, X is a fine film and another tribute to the iconic genre that made horror so popular in the first place. Granted, I do enjoy myself a slasher film from time to time- I'm quite fond of films like Nightmare on Elm Street and My Bloody Valentine, but where X faults among the others is through using a rather familiar formula without any true unique purpose. Throughout the film the characters often talk about an X factor, something that makes Mia Goth's character special and starworthy- but unlike its mentionings- this film just doesn't have that. The acting is really good, I love the underrated Mia Goth as always- as well as Brittany Snow, Martin Henderson, and even Kid Cudi did a rather impressive job. The cinematography is fantastic and perfectly fits the amitpshere and tone the film is going for. The music is enjoyable and tense, and its pacing can be a bit slow at times, but does allow for an interesting point of view. Its main problem lies solely in its script, which revolves largely around a smut film production- but takes too many elements and formulaic tendencies from other horror films like Evil Dead, Friday the 13th, The Visit and most obviously Texas Chainsaw Massacre to really stand out on its own and become its own thing. In the end, its not a bad watch, I wouldn't watch it again, but I certainly didn't mind watching it. It isn't the most memorable, but I certainly don't have any disdain for it. It just could have been more, especially given the talent involved, but ironically it settled for less.My Rating: 5.8/10.",
    "111": "After reading the plot, I expected to see a generic slasher movie, however, what I got was a boring artsy-wannabe flick, which takes itself way too seriously and ends up being devoid of soul or any kind of entertainment.After 1 HOUR of extremely slow and tedious build-up you get presented by the most pathetic horror movie villains I have seen in my entire life. Scree-writer must have a serious phobia of frail old people, because that's the only way you'll find any kind of thrills in this movie.With a pretentious façade, one might think that such a movie would at least be devoid of clichés, but they are all there - loud sound jump scares, extremely dumb victims, completely unrealistic kills, which you see coming a mile away, and one of the most pathetic endings to the slasher movie ever.Just go rewatch Texas Chainsaw Massacre - both originals and remakes are a million times more entertaining than this boring mess.",
    "112": "Paying homage to the slashers of yesteryear is nothing new, but Ti West's new movie X makes it feel fresh. He does this by primarily bringing attention to the sex parts of the genre and exploring what sex means. This is, after all, in part about a crew of people attempting to make a porno. But the sex angle goes beyond just cheap titillation. It is at the heart of the film, and West seems to be most interested in what the experience means, whether it's for love, a way to recapture youth, or getting the most out of life while one is still capable of experiencing the act.Beyond all this, though, is a fun, classically styled slasher that is equal parts titillation and slasher mayhem. Some may find the amount of nudity and sex, and heck the subject matter itself, distasteful, but for slasher fans, this will remind you of much of the early years of the genre. A lot has been made about how this is so heavily inspired by Texas Chainsaw Massacre and it's easy to see why. The majority of the film revolves around the singular location, an old farm seemingly in the middle of nowhere, Texas, ripe for plenty of slasher fun. Ti doesn't skimp on the red stuff either. While nothing gets too outlandishly creative, we do get some brutal kills with often gory results.It helps that characters are written well and likable. Despite the sleazy material they're attempting to create, they don't feel shallow or sleazy themselves. They believe in their work and the reasons for making it. While it may have been nice to get a little more depth out of them, they clearly have history and there are things hinted at that never get much development, they're at least a decent crowd of folks who are fun to be around. As for the villains, they're not quite as out there or mysterious as the trailer would lead you to believe. In fact, they're pretty grounded, but never the less creepy and tension is maintained consistently once the violence starts.If you know what the film's about, you have a pretty good idea of what to expect. It does take some unusual turns, but for me that only added to just how much the film stood on it's own. It certainly feels like a fresh entry into the slasher genre, something the genre needs. Ti West continues to make a name for himself as someone to watch out for. Have fun with this sexy, bloody good time.",
    "113": "X (2022) is a recent horror from Ti West that feels like a homage to THE TEXAS CHAIN SAW MASSACRE complete with '70s trappings and grindhouse feel. The story is about the actors and crew of a low budget porn shoot heading to a remote cabin owned by a couple of oldsters. All goes well until nightfall, when murderous intentions arise and things soon turn into a night of terror. I hadn't liked West's CABIN FEVER 2 or HOUSE OF THE DEVIL and didn't expect to like this either, and - surprise! - I hated it.It's not a slow burner (for a change) but it is void of horror content, or any interesting content at all really. For the first hour nothing happens apart from time-wasting with annoying characters, bad dialogue, and endless sex scenes that smack of padding. In the last 45 minutes it becomes a fairly gory but unconvincing slasher, with bad makeup and more cliches than you can shake a stick at. It's the film's senselessness that really got to me, like the female crew member who suddenly decides she wants to star in the shoot. Yeah, okay, that would happen.",
    "114": "\"X\" is a very bloody, and satisfying horror film from A24 that is able to pack enough scary moments, while also talking it's time to develop its characters.The good in this movie right off the bat is the performances. Everyone in the movie is great. The standouts here are Mia Goth and Jenna Ortega. These two were great. The movie also has a really strong message about sex and what it really means for these people. It's a very strong message and it works. The gore here is also great. It's a very bloody movie and the final 40 minutes are amazing. It's also a very good looking movie. It's very well shot and there's a lot of creepiness to it. And finally I actually felt that the villains in this movie were actually very well portrayed. They were given a somewhat tragic issue, and it really added a lot to them.Now I do have a few negatives. The first being that I do wish there was a little more crazy moments. I wish the movie had just a little more bloody moments. I also felt that the first act, while good, was a little too slow paced. I wish it do move a lot faster. And finally there are some things aren't fully explained towards the end.Overall \"X\" is a very bloody good time with great acting, great direction, and some truly bloody moments.",
    "115": "Ti West is back - I have to admit since we had a pandemic I didn't really think or realize he was gone. Something I only heard from others that this is his \"comeback\" piece. Again not how I view it, but nevermind that, enjoy this horror movie that also has a sexual tone to it ... and quite a lot of innuendo.The sex is not just there to titilate of course (although I was more than surprised to see Brittany Snow show what she is blessed with), no it serves the story and especially one of the many themes we have here. There is a discussion about being young, living life to the fullest or at least to an extent that makes one happy. Before you get old and have too many regrets. Young vs old is something you could say. But the less you know going in, the better you will be able to receive.The acting is good and not just from the clearly younger people in old age makeup (look at in the credits who is playing the woman if you have not realized it while you were watching). Effects are top notch, though not for the faint hearted ... you cannot be too squeamish.Go in this ride, that while a serious slasher, is not with a touch (or more) of dark humor. And if you read some innuendo in what I just wrote ... well you may not be entirely wrong about coming ... to that conclusion.",
    "116": "Nothing like I expected it to be.I was aware that there was a pornographic element, but I think it focused too much on that.I was expecting them to get caught mid-scene...and then spend the remainder of the film running away from an unknown killer, that picks them all off one-by-one.But the killing doesn't start until well into the 2nd act...and from that point onwards, the film just drags. It's also really dark, so it's hard to tell what's going on a lot of the time.The killings are boring and unoriginal.The cast are dull and lacklustre.The cinematography is basic and the sound is terrible - especially the weird sound they play for the jump scares.Hated this and now I hate all the people involved.Absolute wasters!",
    "117": "I was about to go see Pearl then read that it's based on X in the synopsis so I thought I should view this first. And the fact that a second movie was released so soon after it's first gave me hope. It's not as good as I expected but I don't think it could have been that much better. My concept of horror is a movie that's supposed to scare you and this really doesn't; it's becoming more common for movies to throw in a couple gory scenes and death then labeling it horror. Can't call it a thriller either 'cause it didn't have me at the edge of my seat. The premise is pretty original I'll give it that but it's just not scary. Should be executed better. It's slow paced so it feels like it's building up to something and when it comes it's all over pretty quickly and I never really felt any tension in the life or death scenes. I didn't care for any of the characters either. More effort was put into the adult movie being made than put into actually frightening you.The directors artistic abilities are there, trying to have the same feel as old slasher movies from the 70's. It's pretty forgettable and horror movies shouldn't be, they should make you wanna sleep with the light on. If anything the only reason I'll have trouble sleeping at night is getting the image of two grotesquely old people have sex. When the credits rolled I was trying to recall what made me think this was going to be good.",
    "118": "After being involved in some great modern horror films such as Hereditary (2018) and Saint Maud (2019), A24's latest film is an immature mess that feels more like an exercise in superfluity than it is a meaningful narrative.Set in 1979, X follows six Americans as they arrive at an isolated farmhouse for a weekend, intent on shooting a porno. Hosted by an unsettling, elderly couple, things soon turn into a full-blown bloodbath.Obviously inspired by Tobe Hooper's classic, The Texas Chainsaw Massacre (1974), writer-director Ti West ensured that X was full of slasher tropes, adding little originality to an already saturated genre. Where it does succeed is creating characters with some personality. Mia Goth's Maxine is noticeably unstable but tries to believe that she is a star. Bobby-Lynne, played well by Brittany Snow, comes across as the more witty, experienced porn actor. Jackson (Kid Cudi) is a Vietnam veteran, while Wayne (Martin Henderson) and RJ (Owen Campbell) provide the overseeing eyes to the pornographic production. Finishing off the cast, Jenny Ortega plays the outsider of the group, Lorraine.Lacking believable or serious motives, the killers in the film were nonetheless unique, providing some creepiness and mystery. However, this soon subsides as we learn their quite ludicrous reasons for their murderous streak. They will certainly not be remembered as iconic horror characters.From the beginning, the film uses themes of religion to juxtapose the vices taking place. The TV in the house shows a programme of a preacher discussing sin, which is repeated throughout the film. As well as this, a well-crafted shot of Lorraine taking off her cross while giving in to the temptation of being involved in the pornographic film hints at what could have been further developed. Unfortunately, the theme is only touched upon within the hour-forty-five runtime, in what seems a missed opportunity to flesh out the barren story.This slasher focuses too much on numerous scenes of nudity in the first half of the film which then mostly moves aside to allow for excessive gore. The extended sex scenes are used in place of well-written dialogue and provide little else than what you would expect. It seems as if Ti West had more of an interest in indulging in some sort of manic sex-gore film than providing any substance to this horror show. And while the gore was well executed with some great effects on display, they are at times over the top and not for the faint of heart.The editing of the film was unique, but rather out of place. Alongside this, X lacked adequate direction, with suspense in short supply and predictability with every kill. The film did not use perspective enough and could have created further tension within scenes by narrowing the viewer's vision and creating a more personal point of view.Without a strong plot, X fails to create a memorable story and instead focuses on showing something more akin to a pornographic film and a gore-fest. The killers were boring and the kills felt formulaic. Decently written characters could not make up for some of the bizarre dialogue and while gore was in abundance suspense was not.",
    "119": "X (2022) is a movie my wife and I caught in theatres tonight. The storyline follows a production crew who rents an old house from a very old couple in the middle of nowhere in Texas to film a porno. As they make an outstanding porno hoping to change the industry forever they get some visitors looking to fulfill their own fantasies.This movie is directed by Ti West (The House of the Devil) and stars Mia Goth (Suspiria), Jenna Ortega (Scream), Brittany Snow (Pitch Perfect), Kid Cudi (Don't Look Up), Martin Henderson (The Ring) and Owen Campbell (My Heart Can't Beat Unless You Tell it To).I love everything about this movie, how can you not like a slasher porno movie? The storyline is excellent and unfolds perfectly. This is a rare unique slasher film that horror fans have been clamoring for. I really liked the characters, the twists and turns and the full circle ending. The cast was perfectly selected. The cinematography and camera angles are out of this world, as is the use of lighting, sounds and the soundtrack. The kill scenes, gore and blood splatter are on point. The jump scares are perfectly executed and very well done with no cheese.This movie gives horror fans everything they want in a horror movie. I could watch this 100 times. I would score this a 10/10.",
    "120": "They don't make em like this anymore. Good old-school slasher-horror flicks from the 70's and 80's. Writer, producer, director and editor Ti West was stellar in every department in this exceptionally well put together film. The cinematography was top shelf - all genres considered, and his directing was just as great. Even the score and soundtrack was the best I've heard in a very long time. All casting and performances were excellent, especially the lovely Jenna Ortega, and Mia Goth in her dual roles as Maxine Minx and granny Pearl. Kid Cudi also had some good fun being cast as Jackson Hole. The gore, prosthetics and special effects were on point. There were even some surprisingly unexpected jump-scares where you wouldn't expect them - all due to simplistic yet creative filmmaking techniques. The writing had a nice flow to it with continuity and decent pacing, so the 105 min runtime passed by comfortably. There really isn't much to negatively critique in this little gem, except I wished for more narrative and sub-plots. It's a must-see if you're a fan of this genre, and a well deserved 9/10 from me.",
    "121": "Ti West is an incredibly astute visual director, and with X, he continues to show this. He turns this farmhouse into one of the most hellish nightmares imaginable, where there is no place that is truly safe.That being said, West has never impressed me with his writing before. His earlier films have very little detail put into the characters and themes-they're all concept and little substance. Thankfully that's changed with this one. This is probably West's most character-filled film.Every single character in this story is incredibly flawed, yet still retains a shred of sympathetic humanity. The protagonists live too much in the moment with no regard for future consequences, while the film's villains yearn for a bygone era of their lives and harbor envy toward those who have what they have lost. Each group represents an untenable human desire, and it adds a layer of melancholy to the terror that unfolds.It's not a perfect film; like pretty much all slasher films, there are some characters who exist just to get killed off in predictable fashion, and some death scenes come off as rather anticlimactic.Additionally, because every character kind of sucks as a person, there's a two-edged sword in that none of them are particularly likeable and I didn't get attached to them in the way I think West wanted me to.Still, this is quite a wild, effectively uncomfortable ride, and a far smarter one than I was expecting.",
    "122": "The movie has ample amt of tension n suspense.The gore is Fulci level but the cinematography is Bava level.Ti West deserves accolades. Terrific direction, especially the camera angles n the lighting. He succeeded in creating oodles of tension n suspense.The babes are attractive n the there's plenty of nudity n good sex scenes.One very ugly sex scene too involving old geezers.It is heavily influenced by Hooper's Texas Chainsaw Massacre, Hooper's Eaten Alive, Friday the 13th, etc.The locations are haunting n so is the music.I always craved for a crocodile action scene in a horror movie n this one came as a wish fulfilled.I saw Dead 7 few months ago n it has a skull/head crushing scene via a vehicle done in a very gory way.This movie has beaten that scene.This movie will be definitely enjoyed by horror movies fans of the 70s n 80s n by fans of the New French Extremity.",
    "123": "Whilst I appreciate the way this was shot which gave it a 70s grindhouse horror feels, I was bored. I can't remember the last time I checked my watch so many times throughout a movie.First hour is an incredibly slow burn of the characters shooting a porn movie, that hour isn't used for character development or anything that is important to the movie. The horror part is the final 45 minutes.Whilst there were a few good kill scenes it didn't save the movie. Paired with some lousy acting which was partly intentional giving the theme of the movie the only good performance coming from Mia Goth.With a muddled twist at the end I came out shaking my head. Not a terrible movie but not one that I'd recommend to my horror movie friends and no doubt I won't remember it in 6 months.I'm guessing the higher reviews are based on artist efforts rather than the story itself and the movie as a whole. I was looking forward to a great horror movie based on reviews but was sadly disappointed.",
    "124": "While the premise of this movie seemed promising at the start, the end result is less than mediocre.The acting feels extremely unnatural. Every step and every move is scripted, almost like watching a video game. Not to mention the fake southern accents.The directing is as generic as you can expect from a movie that wants to be 70s slasher so badly with too many jump squares and no actual proper suspense. The editing seems pretentious and wannabe edgy with the weird split second cuts back and forth, but in the end it's just very annoying.Overall, the movie is just very predictable and doesn't bring anything new. Characters still make the same stupid decisions that get them into trouble, but that also makes it less scary, because you know you wouldn't be as dumb as them.",
    "125": "As much as I enjoy horror movies and slasher flicks, then I had not heard about this 2022 movie titled \"X\" from writer and director Ti West. Needless to say that I had to sit down and watch it as I stumbled upon it. But I didn't know what I was in for here, so I had no expectations.First of all, I will say that Ti West definitely managed to put together a classic slasher horror movie, yet at the same time managing to put enough of a bizarre twist on it to make it stand out. So if you enjoy the horror genre, then you should definitely take the time to sit down and watch \"X\" if you get the opportunity.The storyline told in \"X\" was fairly straight forward, and it was very much akin to the horror movies of the 1980s. So that was definitely something that appealed to me. It was a good story, despite it being somewhat generic at times. But still, Ti West managed to thrown in enough curve balls to thrown off the audience every now and again.I wasn't familiar with the cast in the movie, but they certainly had put together a good cast ensemble. There was a good mix of talents in the movie, and it was fun to watch the people get taken out one by one as the story progressed.Visually then \"X\" was actually fairly good. Sure, this was not an over the top special effects movie, but there was enough blood and gore to keep a seasoned gorehound such as myself happy. The effects looked realistic and that served the movie quite well.The only things that bothered me about \"X\" was the obsession on showing prolonged sex scenes and such. It wasn't really necessary to further the storyline of the movie, and it just felt like it sleazed up the movie unnecessarily.I was genuinely entertained by \"X\" and it turned out to be a rather nice surprise of a movie. This is certainly a horror movie that I will recommend for fans of the 1980s slasher flicks.My rating of \"X\" lands on a six out of ten stars.",
    "126": "6.5/10I don't know what I'm missing, but it wasn't as terrific a film as I was hoping it would. I thought I'd be at the edge of my seat being terrified, and grasping for breath as I waited for what would happen next. Alas, it didn't. It had its moments when things got slightly creepy and I felt uncomfortable. Only a moment or two had me holding my breath until the scene ended, but I was never truly scared. More so just weirded out.The story itself wasn't great, but fit into the context for which it was set. The cinematography was half decent using shadows to hold onto tension. The score helped add onto the tension as well. The acting wasn't fulfilling and didn't give a lot of chemistry.Overall, if I could go back and skip this film I would. In the end it was just a middle of the road slasher. It wasn't cheesy, but it's definitely not the outstanding film I thought I was going to see.I hope this review helps you make a choice on this film. Until next time.... Enjoy the show!",
    "127": "I had been so excited to see this movie.... And now I don't know why!I also have no idea why such a well known Brittany Snow even agreed to be in this pile of garbage!The first half was so slow paced and I got bored.Every kill was predictable and has been done a million times over.Zero originality, zero character development, and zero tension.The only two good things about this movie was the popcorn and when it ended!!AVOID!!!",
    "128": "Well, I read a lot of good reviews about this film and the rating here was like 7.5 when I first checked, so I decided to watch it, expecting it would be great or at least good, but f me, it's awful. I was legitimately surprised by how bad it is, no kidding. I mean, the acting is ok, but the plot... My God. All the killing happens with no reason at all, everything is so meaningless. It actually starts well but from the middle to the end it's just bad, and I mean really bad. I don't wanna sound like I'm hating too much without reason but I genuinely don't understand how people can give it an 8 or a 9 rating.I don't remember the last time I was this misled by a rating from here. From the rating and everything that I read elsewhere I was definitely expecting something much, much better. I give a 3 just for the \"good\" start, but for me it's like a horror film for kids and teenagers that just want to see meaningless deaths, blood and gore. I'm sorry if you already saw and liked it but it's just my honest opinion, and I'm just writing this review so I can save at least one person from being misled just like I was.",
    "129": "Ok, just got out of the theater and here's my thoughts.The good: The acting is very good, all the actresses seemed pretty game for what they had to endure, and the men were suitably fragile with their masculinity to make them easy targets for the creepy elderly couple. The film was definitely smutty enough with lots of nudity and sexuality, of which some was a turn on and some was incredibly disgusting and made me feel sick. There was some terrific comedic moments sprinkled in here and there. The gore and kills were plentiful enough and don't hold back. Although, they are more in the last third of the film, which I'll come back to. The motive for the kills was very creepy and extremely repulsive. The 70's aesthetic was spot on. And we finally have a final girl I felt I could root for, which it's been a while for that.The bad: The film took it's time getting to the fun stuff. Very slow and unsurprising, in a very cliche way, like we've seen this set-up before in several other horror movies. It honestly didn't start sparking my attention until about the last third of the film. I was also kind of expecting some kind of monster movie with the way the film was advertised, and there is no monster to speak of. I was expecting something akin to Jeepers Creepers when it came to who the grannie is and got none of that. Just some messed up old couple who were messed up. Was definitely expecting more of a slasher than what it was, which was again messed up old people doing weird, messed up things to these kids who are making a porno on their property. Some of the editing was good at first but entirely overused, such as the flashing between scenes. Way too much of that. My final bad thing was that fact that Brittany Snow sang a song that was randomly put in the film. It felt completely out of place with the rest of the material and it dragged the pacing down even further than it already was. I'm almost positive it was the only way she was going to agree to do a nude scene for this movie.Overall: All in all, it wasn't a bad film. Although it had cliched scenes here and there, and started out at a snail's pace, the plotline was definitely something I hadn't seen before and the focus of what movie was made here was pretty clear. Even if I felt the movie was misadvertised and marketed wrong. By the end of the movie, the title started making a lot more sense. If this movie had been released at the time period it was set it, 1979, it would have been rated X and probably be on a few lists in some countries. I enjoyed it for what it was.I would recommend it if you're a fan of 70's style exploitation films or horror films. If not, you probably won't have a great time and you will definitely be repulsed by the final third of the film.",
    "130": "The GoodVery well shot.Surprisingly well acted.Gratuitous sex scenes.Likable characters.The BadSLOW!!! Takes too long to get to the few good scenes.No story development whatsoever.Random actions with no real explanations.Crappy resolution to the tension it develops.VERY little character empathy. I couldnt wait for bad things to happen to ALL of them.I have to admit, Im not only disappointed but actually a little angry.This film had promise. Despite the fact that the story takes 45 minutes to get interesting, the actors were surprisingly good, their characters were likable.By the times the actions starts I found myself asking, \"Oh no. Is this all there is?\" No real backstory. No explanation of character motivations.After 70 minutes of watching this frustrating waste, I found myself hoping everyone in the movie dies.The scene where Mia Goth is swimming in a lake and an alligator silently stalks her is a perfect example of what is wrong with this movie. It is a beautifully shot and tense scene where the alligator follows her as she swims to shore. When it seems that that gator is just about to chomp her, Mia gets out of the water and the scene is over.A well shot, well acted nothing burger. Not even the gore and hot sex scenes can save this one. It's a shame.",
    "131": "X: A Slasher film which is self referential in much the same as the recent Scream and Texas Chainsaw Massacre were. Like them it's leavened with a strain of dark humour. It's 1979, six people set off to make an adult movie, the producer Wayne is determined to break into the emerging home video market and make his girlfriend Maxine into a star. The director, RJ, who wants to make an avant garde porn flick is joined by his uneasy girlfriend Lorraine on sound. Bobby and Jackson are two adult film actors. Arriving at the farmhouse location they are met by a crazy old man, Howard, wielding a shotgun, this combined with an old woman, Pearl, eerily staring out a window should have sent the alarm bells ringing. Wayne sweet talks the old man with money. The old geezer is suspicious of them but thinks they're just vacationing in his guesthouse. The filming commences but soon things go awry. This is a mixture of American Gothic, Wrong Turn and Deliverance with extremely violent and downright disturbing moments. One scene in particular features Pearl, slashing away, red lit by car lights, Don't Fear The Reaper playing on the radio is masterly. Indeed the film appears to pay homage to classic slasher films rather than being a pastiche. While the violence is extreme, there seems to be an inevitability to it once Pearl meets Maxine, dreams of her own lost youth and beauty and is jealous. There are a few plot twists, the old couple in particular harbour one or two little secrets. An unintentionally entertaining Fundamentalist Preacher is ranting in the background on TV in many scenes. Mia Goth is great as both Maxine and Pearl, with emerging Scream Queen Jenna Ortega as Lorraine. Written & Directed by Ti West. 8/10.",
    "132": "Honestly, the least original film I have seen. We get it, you wanted to make The Texas Chainsaw Massacre, but you didn't. Move along, make something new. Come up with a new idea. This isn't it. It's been done so many times. I am personally tired of it.There was nothing refreshing about this film. It was irritating. Mia Goth is annoying. I watched X before Pearl, wanting to give her another go. I don't know why I bothered.I am truly hoping her saving grace will be working with a new director, especially Brandon Cronenberg in Infinity Pool, because she needs to cut and run from Ti West as soon as possible.I hope Cronenberg brings out what is inside of her and gets rid of all that over the top acting from the Maxine and Pearl character. I think Mia Goth is more than capable of it. So fingers crossed for Infinity Pool.Back to X. Like I said, there was nothing new here. It wasn't shocking. The sex isn't explicit.. why on earth are people saying that? The gore was not even decent.",
    "133": "When a group of pornographers head out to an old farm to film a more artsy porn movie they find themselves in a not so safe area.I throughly enjoyed this film and was impressed by how much it reminded me of classic slashers. It has a really well done slow burn where during the first half you get introduced to these characters while some getting a creepy feeling throughout. Then the second half rolls around and the horror truly begins.They did a really good job with the horror. The consistent sense of fear was really well done mainly because of the amazing cinematography at work. When the killing actually begins it has a lot of gore and some well timed jump scares. I thought it was unique how they involved the porn in the horror, I thought it was creative and something I haven't seen before.The acting across the board was great. This film had Jenna Ortega who is becoming more and more of a well known actress and she shows why in this film. Mia Goth did a great job as well along with Martin Henderson, Brittany Snow and Kid Cudi.There is one really good theme of growing old in this film and it explores how the older you become the less you can do. Having that element in a horror really enhances the film.In terms of gripes it is a horror film so you're gonna get your dumb victims it's inevitable. As well there were certain plot points that didn't make a lot of sense but I think that might just be me misunderstanding.Overall X is a creative horror film. With great performances, great cinematography, and great horror X is going to be a movie I remember.9/10.",
    "134": "I've come to think of film production company A24 as The Asylum of art-house films. Where The Asylum focuses on producing low-budget, direct-to-video films that use film titles and scripts very similar to those of current blockbusters in order to lure customers (shouts out to Wikipedia for that beautifully succinct synopsis), A24 also produces movies that - on first glance - look very similar to generic genre films; you don't have to look very far to find the proof of that. Films like \"Hereditary,\" \"Midsommar,\" and \"It Comes At Night\" all had trailers that marketed the films as scary movies that appealed to mass audiences. Those with some semblance of familiarity of A24's track record would know that the above mentioned films would have more up their sleeve, while others may find themselves taken by surprise by how \"different\" the movies are when compared to more mainstream fare. \"X\" is no different. With a trailer that, while stylistic, advertises itself as nothing more than just another slasher, \"X\" entices customers with an accurate premise, only to pull the rug from out under them once they are seated in the theatre.What I like most about A24 is its conviction to add an insane level of quality to what should be nothing more than a disposable Saturday night watch. \"X\" advertises itself as a grimy, bloody, slasher movie - and it is - but it's one that prides itself on its high production value. \"X\" is a slasher that actually cares about its story and its characters; remarkably, it is a horror film that works just as well when it's purely being a drama. Following a crew of filmmakers who are decidedly set on making an \"artistic\" adult movie, \"X\" is intent on character-building. With all the greed, jealousy, and lustfulness that you might expect from a group of young adults who enjoy making love with each other on camera for money, I was pleasantly surprised that I started to enjoy this movie purely on its own storytelling merits, before the real horror even began.With eye-candy all around in the form of Mia Goth, Jenna Ortega, and Brittany Snow (as well as Kid Cudi, Martin Henderson, and Owen Campbell - if you're into that sort of thing), what impressed me most about \"X\" is that, not only did director Ti West pack his movie full of people who can actually act, but he also has crafted characters that are fully fleshed out and feel like real people. Unlike your typical slasher, here characters actually make smart decisions and are not just stupid for the sake of being stupid. And this works twofold by drawing viewers into the story before the horror begins, and then amplifying it once it does.With ample care being taken in character, script, plot, and production value (and not to mention the rocking soundtrack), you can only imagine how much care was also taken in the kills. Yes, Ti West will be sure to gross you out here, because there is blood, guts, and gore aplenty, and all of it wrapped around a unique visual flair and editing style that ups the entertainment value and differentiates this movie from other slashers. There is creativity here, with people dying in unpredictable and uncomfortable ways; I definitely found myself cringing at many of the deaths. So if you enjoy bloody violence, you'll definitely find a lot to like here.If I had any complaints about this movie, which I do, it's that I found the tension building to be slightly lacking. You see, I quite enjoy slashers that have long, drawn out scenes of people trying to escape their murderers (\"Scream,\" for example), and this movie didn't really have that. While I understand why exactly \"X\" could not have such scenes, it did make the killings slightly lackluster - as in, character goes to place, then they swiftly get killed in said place, and end scene. While the kills themselves are creative, there is a lack of creativity in the build up to those kills. Similarly, I did find the motivation of the killer(s) to be somewhat unclear. I mean, I understand why they were doing what they were doing, but I don't really think the motivation was all that believable. Also, I found the ending to be rather abrupt and not very climactic or fulfilling. All of that said, \"X\" remained to be extremely entertaining.\"X\" won't be for everyone - when the movie ended, a middle-aged man turned to his date and said, \"That was the weirdest movie I have ever seen.\" A couple sat next to me, and basically sprinted out of the theatre as soon as the credits rolled. However, its almost maddening attention to quality and detail elevates it above other, similar, slasher movies, making this one very memorable horror film.",
    "135": "If you enjoy reading my Spoiler-Free thoughts, please follow my blog to read my full review :)\"X pays homage to 70/80s classic slashers while simultaneously tackling important themes related to sexual pleasure/freedom, age, and self-acceptance in a deeper and more intelligent screenplay than meets the eye.Ti West (In a Valley of Violence) returns six years after his last feature film with a clear vision of a story that mixes uninhibited pornography with the purest gore that can be found on the big screen, all wrapped up in a constantly captivating narrative and insane third act.Mia Goth (Emma) shines tremendously with an imperceptible dual role that transforms a technically interesting movie into something truly impressive - makeup, visual/practical effects, and score deserve much praise.As hilarious as it is terrifying, it will be hard to forget, regardless of where the viewer falls on the opinion spectrum.\"Rating: B+",
    "136": "I love Ti West. His segment in the first vhs movie, second honeymoon, is by far my favorite segment. And I love The Sacrament as well. The Sacrament is better than this movie, for sure, but this is still one of Ti Wests better offerings. ..but wait, how can we compare such a big budget film with the rest of his indie level films? Because this movie is more of a top tier indie film rather than a blockbuster. It's cool that it's A24 and that definitely suits Ti West as he returns to form, but honestly this ain't no Hereditary or Midsommar. It ain't The Witch or The Lighthouse. It's a new type of beast for A24 overall with it being I thiiink their second slasher film release?Some good things about this movie is that it has that Ti West traditional minimalist approach and if you like his work, you will dig this. Another thing that's good was the whole gator aspect of it, with creepy threats lurking below the swampy surface all the while. The actors were definitely good but it's also hard to really say they were bad considering they all didn't get as much screen time as I had hoped. Brittany Snow spoke quite a bit through out but Kid Cudis character didn't say a whole lot. Also, Owen Cambell was especially good in a role that almost mirrored Lou Taylor Puccis character in the Evil Dead remake. Yeah, kinda a rip off, but who's to say two movies can't have the same type of characters? The kills were good enough, with a few of them being pretty extreme but not in like an over the top way. It's all done in fair taste.Now, something about this movie was missing.. I saw this in the theaters and personally I prefer watching new movies like this at home but I just couldn't wait to see wests newest work. I feel like the theater screen takes away from the crispness of a quality TV screen. Also, there is a little too little that goes on here and the porn scenes are wonky. I can see where West was headed but maybe the turn out isn't as good as people would have thought it'd be. Nonetheless, I did like it. I will buy it on 4k. And I will like it more on a second viewing as per usual.Until then,\nYours truly.",
    "137": "X caught my eye when the trailer came out. The Texas Chainsaw camera shots and vibe got me curious. Unfortunately, the film didn't live up to the trailer.I'm guessing Ti West was paying homage to Tobe Hooper as there are nods to his work--obviously Texas Chainsaw but also Eaten Alive. There's also a nod to Psycho where the movie takes a hard left halfway through. For me this is where the film goes wrong. The first hour is about the main characters making a skin flick and has more in common with Boogie Nights then anything else. The last 40+ minutes is by the numbers murder in the dark with the characters being killed off in order of importance.The problem for me is none of the component parts of the film go together. The slasher aspect doesn't mesh with the porn film aspect. There isn't a clear theme to the film. The characters aren't particularly likeable so I don't care. Maxine's storyline is poorly defined. The kills lack tension and suspense. There's lots of homage paid to so many films but at the expense of telling it's own story. At the end of the day, there's a lot going on here but none it goes together to tell a tense or entertaining film.",
    "138": "\"Is it possible to make a good dirty movie? \" is the question that director Ti West poses in this vintage-style backwoods slasher pic.The story focuses on a hustler from Houston, who brings his young fiancé to a remote town in the bible belt, where he plans to shoot a series of interracial porn videos featuring her, a local stripper and Vietnam vet.His plan being to make his belle a star.West filters the above question through the character of the cameraman, who seeks to shoot the raunchy films like a more classy and respectable form of cinema.This all takes place in a flashback...with the intro revealing to us, that at some point...things took a very dark and violent turn.The group rents out a dilapidated old farmhouse- built during the revolutionary war- on a strange old man's property.But doesn't really bring him up to speed on their planned activities.When it all plays out...it feels like West was going for a backwoods slasher gore film with a bit of a giallo vibe.But it lacks the mystery that a good giallo film has entirely...as it is just way too predictable.Albeit creepily so.You can tell he is going for the shock value that films like TCM and Wolf Creek possess.But despite attempts to be lurid, it comes off way too tame.Leaving you waiting for that Bruno Dumont moment at the end...which never comes to fruition.So you can't help but feel like \"ugh\".As it comes off much too fake and lame.The \"old face\" costumes certainly didn't help on this front.They should've just cast some real, creepy looking, old people instead.Cause, in the end, there's a whole lot of atmosphere, but not a whole lot else.So the high expectations they build up in the beginning just go straight out the window.Going back to the question posed near the beginning...the answer is yes...but you're going to have to ask someone like Gaspar Noe or Pasolini.Not West.Because, wheras I do like his style...this one is a bit of a fail.It could have, and should have been better.The only redeeming quality I see in it, is that West writes his relationship with Mia Goth into it (in regards to him making her into a household name as \"his\" star).That is actually pretty cool.But that's about all it has going for it, in my opinion.3.5 out of 10.",
    "139": "This movie, while better than most of the standard horror schlock being produced by Hollywood in recent years, at least is a throwback to the classic 1970s horror era. But it falls woefully short of actually being a good movie in its own right.Its filmed in a nice style, with high class camera work and does a good job recalling the era, with classic 1970s cars and an era appropriate gasoline station, and other nostalgic items present from the 1970s, but after a promising start, the rest of the film takes place in a boring remote rural house setting. This is much more a black comedy than a proper horror movie, and it has zero suspense.The actors try their best, but aren't given anything to work with, with bad dialogue, and no character development. The movie is also very slow paced, and when things do start happening, its too late, and even then, the action is pretty dull and forgettable.It gets points for being a cut above many really bad horror films lately, but it would be a much better use of one's time to actually go watch a classic 1970s horror movie instead.",
    "140": "In 1979, in Texas, the porn film producer Wayne (Martin Henderson) hires an old house in a small farm in the countryside to make the porn \"The Farmer's Daughter\". He travels by van with the porn actresses Maxine (Mia Goth) and Bobby-Lynne (Brittany Snow); the black porn actor Jackson (Scott Mescudi); and the filmmaker RJ (Owen Campbell) and his girlfriend Lorraine (Jenna Ortega), who is the responsible for the sound. When they arrive, the owner Howard (Stephen Ure) is a neurotic veteran of war but he shows the farmhouse to Wayne, his cast and crew, but he does not know the real intention of Wayne. They shot scenes of the film but out of the blue, the deranged old wife of Howard, Pearl, sees one sex scenes and her sex drive is affected. Soon she begins a crime spree, killing the guests.\"X\" is an overhyped exploitation-slasher movie by Ti West. On 14 December 2022, I received and email from IMDb entitled \"Best of 2022: Top Movies and TV Shows\" and \"X\" is listed as Number 10. This reference increases the disappointment of the viewer since it is a small low-budget film and rip-off \"The Texas Chainsaw Massacre\" and other slashers associated to an adult movie. My vote is five.Title (Brazil): \"X - A Marca da Morte\" (\"X- The Mark of the Death\")",
    "141": "It's 1979 conservative rural Texas. A group of young people has rented a farm house to film an arthouse porn film. The farm owner does not like the young group. He and his disturbed wife form a creepy couple.Filmmaker Ti West is marrying a softcore porn flick with Texas Chainsaw horror. The porn part is a bit boring although it does arrive at a very interesting conflict. Maybe Ti should get to the conflict sooner and let that ride for awhile. I am a little surprised by goody Brittany Snow playing a sexually-forward porn actress. My brain almost refused to recognize her at first. The horror part is a lot of waiting around. The movie keeps teasing it with the Texas Chainsaw style. It's still pretty good with some great sexual creepiness. On the other hand, I do not appreciate dumb victims. I really hated Wayne wearing nothing but tighty-whities and no shoes. That's really stupid. I also hated Lorraine's last scene. I get it but that's also stupid. Stupid victims are sometimes part of the package in horrors. I just wouldn't mind getting less of it.",
    "142": "LIKES:Moves:\nMost of the films in A24's repertoire is not paced to my personal liking, dragged out displays of horror that try to \"elevate\" the horror genre and get you appreciating other factors. This one though does not suffer from that pace, instead just diving right into the antics and trying to get to the heart of the movie without delay. This moving pace was a nice change for me, and fits with what I believe the goal of this film was, and keeping the horror element fun and enjoyable for the most part. X will keep horror fans very entertained and may enjoy not having to ponder all the meander that is often thrown into the mix.The Laughs:\nWhether it's intentional or not, X's writer and direction are indeed accomplishing some laughs in this film. The premise of the film is enough to get you chuckling, young filmmakers in the 70s hoping to make adult films, already setting grounds for humorous funs. West accomplishes this very well, his methods to filming the scenes, writing the quips, and forcing the dialogue to feel very adult like one of my favorite parts of the movie. There are other bouts of banter and error in logic making this movie very fun, and those darker comedy moments surprisingly lighten up the rest of the film, especially the justification of making good adult films that aren't just smut. Nice work there.Feels Like a Slasher Film:\nThe genre of slashers has been famous for years now, and A24 somehow gets the feeling right, but adds a blend of modern and traditional pain that works very well together. X's jump scares are very reminiscent of Jason and Ghost Face's antics, using cheesy timing, poor logic of characters, and conveniently placed devices and timing to issue the punishment. All of the characters feel very welcome in these types of roles, with very few having redeeming qualities to actually care about, focusing on the slasher element. It makes for a very cheesy horror that slashers have been known for, and yet there is a little essence of terror mixed into it as well.Throw in how ridiculous half of these kills occur, and again you get that element that horror guys love.The Twist:\nThere is one element of the movie that is a bit of a mystery device to the film and trying to connect it to the movie in some big way. Sometimes this device is merely an atmosphere device as we have seen A24 do, but surprisingly there is a nice twist to connect that tool to the current plot. While it does not blow us all away, West gets props for a double use of this device that can be difficult to accomplish.The Acting:\nHorror movies seldom rock the boat of acting, often reducing the characters to very minor and selfish characters. However, this time, that direction and the actors accomplishing it are worthy of fantastic nods to what they played and portrayed in this movie. Mia Goth wins for most diversity in more ways than one, with her character Maxine having an edge and deeper side that gradually starts to rear its head by the end of the movie. She does all her roles well, and though I hated part of her character, how Goth executed those roles was awesome. Ortega has elevated herself once again for me, as she continues to rise up from her Stuck in the Middle Days. A character with a lot more extremes in her performance, she manages to take these moments to the full extent and still remain a believable and less annoying character compared to others. As for Snow, it's Zoey from Pitch Perfect getting kicked into an R rated film. Her humor and sass are indeed stereotypical of these roles, but somehow it works for me in this film, including the little songstress mode coming out as well. The guys are also noted for their skills in acting, with Kid Cudi accomplishing the balanced role of stoner and lover, with a little more depth that gets exploited. Henderson accomplishes a Matthew McConaughey imitation quite well, and is the forced ringleader that again is annoying, but works in the theme of the movie. And Campbell, well he hits the nerd role well, and I had only hoped for a little more use of that nerd ingenuity than what they did to help separate him out from the other rag tag group.The Cinematography;\nA24 may be controversial on a lot of things, but I have to agree they know how to shoot a movie. X is no exception to the beautiful work of West's vision, with a very foreboding nature always following the moment of the movie. He does manage to make you feel as if you have fallen back in time to the end of the 70s and beginning of the 80s. West then takes the feeling of both horror and an adult film, blends them together, and somehow makes us feel we are actually in the lens of the camera for much of the filming process. As the horror settles in, he then goes on to evolve the presentation into something dark and foreboding, taking the mind breaking horror and fusing it with shadow and carnage that this movie is going for in the grand design. Each angle, each play of the scenery, and every close up serves a purpose to paying homage to the tropes of the slasher film, capturing the carnage in the best light possible. This may be the best part of the movie for most and is truly a nod for the creativity he brings.Dislikes:Plot Gaps:\nThis is more so reflecting how the story does not feel complete, with a lot of missing pieces sticking out for what A24 is known to fill. X has a lot of characters that have underlying moments and breaks that we want to explore, but the runtime and other elements overshadow those investigations. What's worse, is more so the complete background and explanation of why the characters the way they are, and how they even began to behave the way they do. Given how A24 always adds reasons behind the bizarre characters they create, you would think there would be more, but alas it remains a mystery and does not stand on its own as well. Staying after the credits may reveal the plan to rectify this, but I can't say these characters were the most in-depth creations of the studio.The Characters Are Annoying:\nWhile not achieving Zola levels, X's cast is for the most part very annoying for a reviewer like me. Sure, this makes them perfect for the horror genre, but some of the moments are a little too much for me and a little tiring in not seeing them evolve past their shallow levels. It's again not the worst for me, but I can say I've liked other characters better over the ones we got in this installment.The Gore:\nA24 is not shy to making their movies hard to watch, and this film is no different in how they paint the walls with the disturbing level of gore and blood. While again not the most disturbing element to this movie or most of their movies, X has the moments of sickening death and torture that are not my cup of tea. Not really tasteful, this film throws caution to the wind and sinks its teeth into the psychotic obsession of mauling that is not for those with weak constitutions. Some of these moments may turn your stomach, and at times felt a little unnecessary if I'm being honest. I know you are to go in expecting these things, but you always hope for a little less gore and more balance towards something bigger. Not the case my friends.Disturbing Moments That Aren't About Blood.It's A24 studios and sex, you can probably guess where I'm going with this. My least favorite thing about this film does indeed have to do with the disgusting moments that this studio loves to show us, almost as if it is a calling card for their productions. It starts with showing genitalia and uncouth sex, though at least for once it involves people, we would be okay seeing doing the act. That all changes though, as some rather gross and uncomfortable moments turn into disturbing ones that are hard to unsee, which I did not enjoy or find funny in the boundaries they crossed. Then, like all their movies, they take it one step too far, and the obsession with nudity goes into levels I don't want to see, but they rub in the face. The result is again unnecessary and disgusting stuff that adds little to the movie and something I wish they would stop, and yet they won't seek the counseling they need.The VERDICT:If you are an A24 fan, this movie is finding home in their vaults for the wickedly disturbing and unique spins on the tried-and-true series. X is a movie that gets nods for so much creative direction, fusing the worlds of 70s, horror, and porn to this homage that somehow makes things work. The acting works well to fit all these folds, and the looks of the characters helps bring the atmosphere to full light in the way they present their characters. However, it is the cinematography that is the crowning achievement with this film for me, and I enjoyed the crazy level of techniques used to capture the horror elements. However, A24 still has not achieved perfections, diving into extremes I don't enjoy bathing in that they seem to love continuing. The gore and plot holes are one thing, but it's those other disturbing actions, primarily with nudity, that are the real yuck factor for me and take away from the film rather than add. Thus, my scores for this installment are:Horror: 7.0\nMovie Overall: 7.0.",
    "143": "Ti West's throwback to seventies slashers, perhaps most notably 'The Texas Chain Saw Massacre (1974)', is a wonderful slice of slow-burning horror that not only emulates its inspirations almost impeccably, but also sits alongside them as one of the most accomplished entries in its genre. 'X (2022)' is throughly entertaining, a vital and enthralling experience that has a surprising amount of depth to it. It has quite a lot to say about its genre and the usual subtextual underpinnings that accompany it, operating as a deconstruction of these elements while also indulging in them. It includes the same trappings as many of its peers, milking them for their mostly surface pleasures, but it puts its own spin on them and therefore works on a much deeper level. Its characters are surprisingly well-rounded and compelling, especially its distinct antagonist (which is probably why she got her own prequel mere months after her debut). Pearl and the protagonist, Maxine, are two sides of the same coin, the past and the future face to face. When they look at each other, they only see themselves: one sees what she used to be, the other what she may become. It isn't an accident that both are played by the excellent Mia Goth. This jealously and fear drives both of them to extremes and it's an interesting dynamic to explore. As is the sexual frustration of the villain, which acts not only as a distinct motivation but also a clever commentary on the puritanical 'sex equals death' mentality that underlies many (mostly Reagan-era) slashers. I won't delve into the themes any more than that, as they truly are surprisingly in-depth and are delightful to discover for yourself, but I will reiterate that they're arguably what makes the piece as successful as it is and are genuinely great. Of course, the film succeeds in other areas as well. Its first half is dedicated to establishing its characters and setting. Because it constantly sews the seeds of suspense, it never feels like it's simply spinning its wheels; in fact, it's genuinely enjoyable even before its inevitable carnage occurs. That carnage is brutal, gooey and visceral, alarming in its frankness and convincing in its execution. It's appropriately violent, soaked in sticky blood and tangible viscera, and it really hammers home the intensity of the fantastic final act. Because the characters are so generally compelling (and brought to life with aplomb), their deaths leave a noticeable hole in the narrative. You never cheer for them to meet their end, so the finale is far more cruel than cathartic. Still, it's undeniably full of genre joy and is fun in its own macabre way. Overall, this is a fantastic slasher that works as both a throwback and a bonafide entry in its genre. It has a strong atmosphere, some delightfully gruesome gore, a subtle sense of irony, a tight grip on theme, an interesting cast of characters, and a noticeably accomplished aesthetic. Its sly self-awareness doesn't undercut its general sincerity, so it never feels smug or so concerned with satire that it forgets to work on its own terms. It's really great.",
    "144": "Arriving at an isolated farmhouse, the cast and crew of an adult film begin to go about their shoot which alerts the homeowners to their sleazy goings-on and begins to take to graphic means to stop the degenerate filmmakers from doing their film and forces them to try to get away from the farm.There was quite a lot to like with this one. One of the better features here is from the solid background of everyone which gets this going rather nicely. The fine work of the cast and crew of the film, humanizing them with their own dreams and desires that range from the realistic to the full-on dreams that can be achieved at some point with work, sets them up to be a rather likable bunch. That becomes quite fun when added alongside the characterization of the older couple who are given just as much as the film crew which includes some deep touches on sexuality and passion among the elderly that borders on heart-wrenching when initially broached yet turns decidedly sinister as time goes on in the company of the film shoot seeing the enhanced sexuality displayed. This plays a major role in the film's central theme in its demented take on sexuality which proves to be quite fun. As we've already been given quite a lot of input into the wife's mindset by her constant peeping on their activities around the barn and the conversations with her husband, the idea here is firmly established regarding her long-repressed sexual desires needing to be released regardless of her age or physical composition. After seeing that living vicariously through them while they make the film doesn't work, those urges finding a release in the form of a graphic violent outburst is all the more plausible making for a vicious turn off this sexuality-filled premise. The other positive feature here is the aforementioned turn towards the violent and vicious as the third act goes completely off the rails in the best way possible. Not only is the slashing quite enjoyable as it ranges from the graphic surprise encounters that work due to no one expecting them to become confrontational to the inclusion of a crocodile living in the nearby lake that has a solid sequence, and finally working around into a full-on display of sensuality that is just as squirm-inducing as the rest of the material involving the slashing. Filled with some great gore effects and an overall slick sense of style matching the chaos of the situation rather well which makes this one of the finer genre entries overall. There isn't much to dislike here, but it does have some minor flaws. One of the biggest issues is the rather bizarre turn this takes introducing the concept of the couple holding previous victims hostage. This is brought up incredibly late in the film and seems to come about without any build-up and just dropped into the film which tends to highlight the issue of how it would've gone down without being noticed by now. As well, there's also a strange bit involving the strange decision to feature the characters so blatantly unaware of what's happening that they just ignore everything without leaving the location which is entirely unrealistic and keeps them in danger for no reason, which are the issues keeping this one down.Rated R: Graphic Violence, Graphic Language, Full Nudity, several sex scenes, and drug use.",
    "145": "First of all, I couldn't be a bigger fan of The Innkeepers. So, X is horror + 70's porn + Ti West. Qualified as a no-brainer at the time.There were a number of things I couldn't get past in this movie, and I'm assuming they were intentionally done. Every twist, and every kill, has a \"tell\" or a series of tells. It's a device that makes the storyline transparent, and very, very predictable (Ok, there was ONE kill that made me jump). I'm not sure why this decision was made, because it saps every ounce of tension that this movie, frankly, may or may not have had. What a baffling Metascore. Further proof critics wouldn't know a good horror movie if it split their head open with an axe.Plenty of distractions here (not the good kind). The two elderly people are clearly over makeup-ed, to, uh, cover the fact their actually young actors. Hey, the woman even resembles an actress in this film (yes, he put in a \"tell\" for that, too!). How about an intrusive pop soundtrack? God, I hate these. All the best classic horror have original scores. Oh, let's give the chick from Pitch Perfect her own little showcase, too. I mean, give me a break. He goes wide-angle crazy for the first 30 minutes solid, there's an epic crane shot (with a phony backdrop) within the first five minutes (also add pop soundtrack) -- I was assuming he was going for grimy 70's grindhouse. Mission: failed, unless that wasn't his plan at all. I also saw an unnaturally swinging digital weiner.Was The Farmer's Daughters (the porn movie they're making in this film) supposed to be inspired by the 1976 \"roughie\" of the same name? Has Ti West even seen the movie, or is this purely a coincidence? This is another real issue I had. It is these characters' ambition to make a porn film that will not only turn the business on its ear(!), but will make household names of all the cast! The movie they make inside this film is, frankly, completely insipid and boring. I can tell you flat-out there is more plot and characterization in the 1976 sleazefest. The 70's is hands-down the best, most interesting, creative decade for this stuff, and we'll never see it again. West did not even try to capture what was so great about the era. It's just a device (as well as a lurid hook, hey, he got me) for his crappy horror movie.",
    "146": "Someone once said 'Ti West is the best director you've never heard of.\" It was me, I said that. This guy has been putting out quality horror films for years now and not getting anywhere near enough recognition. 'X' may be his best film yet. This one is a blast.This film created something very few modern horror films are able to - tension. I found myself very tense during this film. It's actually a very patient film though. The build-up is methodical and slow with only little hints as to what is to come. Because of the strong characters and dialogue though it is never dull or boring.Then when the action does kick in in the final third of the film it is a wild ride. All the pieces that have been masterfully set up fall into place and nothing is off limits. No character felt safe and I absolutely love that feeling in a horror film. The editing style ad the way it used in some of the horror sequences really caught me (and some other audience members) off guard. I had never seen anything like that in a film before, but it worked so well.There is some great chemistry amongst this cast. All six of the main leads nailed it. I have to say my jaw was hanging when I read that Mia Goth played both 'Maxine' and 'Pearl'. Are you kidding me? That is some truly incredible make-up work and acting.It sounds like we are getting a prequel to this film soon and I am here for it. If it's even half as good as this one then it will be worth the price of admission. See this one. 9/10.",
    "147": "You can still make a good dirty movie.The first half was a little slow, but it's pretty funny because they tried to make a cinematic porn movie, as if they considered porn stars as actors lol.The second half was where the fun began. There were a good deal of creepy moments that effectively built suspense. Ti West did a great job showing that old people again can be very unnerving.As a slasher, the kills were pretty fun, but I still wanted more gore. The premise isn't as disgusting or funny as intended.Overall, after getting past the first half, X is a fun and refreshing time. Don't forget to watch the post-credit like me. 7.5-8/10.",
    "148": "\"X\" could've very easily been great if it had dared to rise above the generic slasher piece it sadly became, transcending the horror genre by at least endeavouring to convey a meaningful message through the themes / subtext of its storytelling.At first, I presumed director & writer Ti West was attempting to craft a cautionary tale which depicted how men have a privileged, selfish flippancy & are happy to exploit women for their sexual gratification but when those same individuals of the female sex empower themselves by reclaiming their own bodily autonomy (taking their personal pleasure in to consideration & making emotional advancements in absence of their partners), males perceive that sudden lack of control & equality as victimisation & thus, conflict is borne from the misogynistic entitlement indoctrinated from living within a patriarchy, since they're incapable of processing the parity they're suddenly being expected to accept... Which perchance may have credibly been a fascinating point to emphasise within the confines of this film (contrasting one type of woman's body against that of a senior in a self aware juxtaposition to question why we associate one with sex / pornography & the other, horror - acknowledging the apparent ageism / unreasonable beauty standards we subconsciously normalise around those surrounding us), but alas - that was not meant to be.Instead, it then seemed to perhaps evolve in to a commentary on the animosity between generational divides within society, portraying the bitter resentment caused by the elderly generation's wasted youth throughout history etc. Or even people's insistence on killing not only themselves with old age, but dragging the young down with them, before they go (global warming / the rise of the far right within older demographics, for instance)... All of which might've also been interesting, had the concepts been developed & fully addressed, as opposed to half baked - at most. Sadly, that wasn't done either - & therefore, although there's a lot of potential brimming beneath the surface, I feel as though most of it was left unrealised in the final product.The cinematography is great, the performances are impressive & there's a lot of personality to the style of the visual filmmaking... Yet none of that (or any of the sexual content & explicit nudity) compensates for the lack of substance, narratively justifying the more provocative creative choices being made. Consequently, you could argue it inadvertently indulges in the voyeuristic acts it ostensibly condemns & resultantly forms something rather hollow. However, catching Sam Levinson's name as a producer in the credits kind of explains everything - & I needn't elaborate any further.",
    "149": "Other than Mia Goth being hot as hell like every other time, this movie sucks.The story was incredibly stupid. Two elderly couples each with one foot in the grave, become jealous of a group of adult film makers. Then they go on a killing spree because the elderly man can't give his wife sex. Really? How stupid.Then there was this annoying blonde character. Every time she would speak it would be like some squeaky dog toy going off consistently, assaulting your skull. Man. It's horrible.I wanted so much for this to be good, like the old people would morph into weird creatures at night; anything would've been better than what was.If it wasn't for Mia Goth and some descent gore, I would've rated this movie a one. I rarely EVER rate a movie a one.Unoriginal and bad taste.3/5."
}