{
    "0": "Ralphie (Peter Billingsley) wants a Red Rider BB Gun for Christmas but his mother is totally against it - the \"you'll shoot your eye out\" discussion being a major opposition.This is essentially a story about childhood and is very spot-on in regards to the yearning of children and the whole Christmas era - I've been watching it since I was a child and every Christmas when it comes on TV I watch it again. It's funny, poignant and totally memorable - it has some of the best scenes of all-time and although I know a few people who dislike it because it's a bit \"weird\" and \"dark,\" most people I know love it.Worth watching every Christmas, forever!",
    "1": "Unlike many people, I don't particularly like seeing movies more than once. Of course there are some exceptions, but I am not a person who usually sees a movie again and again--I find this very boring. However, there are several exceptions--and this movie probably heads the list. Unlike other films this one actually becomes better with repeated viewings--and it's great to see and hear the wonderful and silly lines again--especially when they are are friends and family there to see it and laugh along with you. Perfect writing (albeit, very, very cynical), wonderful acting, great attention to details (the 1940s look to the film is great--down to the boxes of soap and radio programs) and so many funny and sentimental moments make this a perennial favorite. If you haven't seen this then get out from under your rock and see it! If you don't like it, then think about getting psychiatric help! No sane person could hate this wonderful film.",
    "2": "It will never be a complete Christmas without watching \"a Christmas story\". A Christmas Story is a significant kid's movie directed by Bob Clark. Based on the short stories and semi-fictional anecdotes of author and raconteur Jean Shepherd. The movie is based on a number of things; one is his book, 'In God We Trust: All Others Pay Cash\", others derived from 'Wanda Hickey's Night of Golden Memories' and others from short stories from Playboy magazine. All of them, manage to mix in, pretty well. I love Jean Shepherd's narration...a great story-teller. Glad he was given the job. He had a soothing voice that help inspired the creation of 1988's TV show, The Wonder Years. Christmas Story tells the story of nine year old, Ralphie Parker (Peter Billingsley) who wants one and only one thing for Christmas: a BB gun. It's not just any BB gun he wants, either; his heart is set on an Official Red Ryder Carbine-Action Two-Hundred-Shot Range Model Air Rifle. Sadly, everybody thinks it's a little too dangerous for him. Will, Ralphie get the BB gun or will Christmas for him, be a huge disappointment? Watch it to find out. Without spoiling too much, the movie's main plot isn't that strong to stand by, itself. So the writers add a lot of sub-plots to push the run-time for the film such as Ralphie's father (Darren McGavin) winning a major prize in a contest or Ralphie's friend, Flick (Scott Schwartz) memorable getting his tongue stuck on the icy pole. The movie has tons of filler scenes. Some of them were hits to the funny bone, while others were kinda a waste of time like the Bumpuse's dogs. Glad, they cut the Flash Gordon fantasy sequence. It doesn't make sense with the rest of the film. For a kid's movie, it's very smart. Examples are the mock heroic tone of the narration, filled with great hyperbole motif full sentences. It matched well with the extensive use of familiar classical music themes. The movie is beautiful to listen to. You see a lot of leitmotifs references from other works such as author, Sergei Prokofiev's Peter and the Wolf story, Harold Gray's comic strip, Little Orphan Annie, Television shows like 1940's Adventures of Red Ryder, and films like 1937's Snow White and the Seven Dwarfs & 1939's Wizard of Oz. The movie was shot pretty well and the use of old timing locations really made it seem like it takes place in the late 1930s/early 1940s. There is a debate about when the film takes place as the movie never state it, but still, I like the nostalgia feel of the film. I think the pre-World War II era America is a great location for this childhood majestic. The movie is very well acted. Looks for the cameo of director Bob Clark, and Jean Shepard. It's pretty sad, that none of the main cast went on to bigger success. It's pretty weird, that actor, Scott Schwartz became a pornstar for a while. Maybe, one day, they will. Some people might not like the film, due to its off color humor. For a PG film, it's got tons of some dirty jokes, under aged swearing and violence & a few racist stereotype humor. The film was supposed to be R-Rated, but the R-rated script was scrapped when the vice president of Higbee's, the department store, the filmmakers used for locations, refused to allow the store to be associated with a movie depicting a kid dropping the F-bomb, and the filmmakers were forced to change it. Honestly, I think the movie became a lot clever with its swearing through it use of heavy euphemisms of gibberish. Still, if you're looking for a movie to watch with small children. This movie might not be for you. For me, personally, I didn't mind it, as it gives something, that both adults and children might like. It's still a family-friendly movie, but there an edgy sense of humor; that will be lost on little kids. Some people might hate it for its love for commercialization over the religious aspect of Christmas. Of course, the holiday supposed to be about religion, but I think most people, like to get stuff for the holidays. Is it greedy to love films like this, promoting materialism lifestyle. No, because the movie was still made with a lot of heart and love, and we still see the family in the end, celebrating the holiday as a family unit. A Christmas Story did only modest box-office business in 1983, despite every critic, I know, saying it was a disappointment bomb when it came out. The film became a holiday classic, due to the overplayed value of television. Often in Christmas movie marathons. It's estimated that nearly fifty-five million Americans tune every year to watch the film, making it a Christmas movie juggernaut. The film spawned a play, as well as two \"sequels\": the made-for-TV Ollie Hopnoodle's Haven of Bliss and 1994's It Runs in the Family aka \"My Summer Story\". Both are not worth watching, as it has none of the original film's cast members. A Direct-to-Video sequel called A Christmas Story 2 was released on 2012. It's a miserable film that fans of the original, must stay away from. In 2008, a documentary was made call 'Road Trip for Ralphie\". It's a fun-watch. Overall: Hands down; it's one of the best Christmas films, ever. It is a must-watch. You will have tons of fun!",
    "3": "Few stories capture the magic of being a child during the holidays like A Christmas Story. This endlessly quotable classic is one that I enjoy watching every season. It somehow makes me nostalgic for an era in which I never lived. And this simple story has made an impact on all those who grew up watching it. If you haven't seen this movie yet, I triple-dog-dare you to do so!",
    "4": "Obviously, there have been some serious typos, miscalculations and misunderstandings. A 7.9 rating for one of the greatest movies of all time? One of the greatest Christmas movies EVER?!?",
    "5": "Bob Clark, the director behind the collegiate slasher flick \"Black Christmas\" and the naughty sex comedy \"Porky's\" surprisingly went on to hold the reins of the charming, innocent, nostalgic holiday romp \"A Christmas Story\" in 1983. The film is seen through the eyes of nine-year-old Ralphie, and is frequently told through the older more knowing voice of Jean Shepherd, who wrote the source material \"In God We Trust, All Others Pay Cash\" in 1966. The film takes place sometime in the early 1940s (Shepherd has been quoted as saying specifically 1940), although the tone and texture of the film allow for more of the uncertain \"period\" look. The film follows the struggles of our child protagonist, specifically his longing for a very specific BB gun, which he references nearly thirty times during the course of the film, explaining why the come back \"you'll shoot your eye out\" is so associated with this movie. \"A Christmas Story\" is a wonderful, relaxing, little movie that never seems to age.",
    "6": "Even with its somewhat unreliable narrator and his frequent fantastical daydreams, 'A Christmas Story (1983)' is a decidedly more realistic Christmas movie, with its focus on the little familial triumphs which remain in your memory long into adulthood. It's clearly based on a series of short stories as opposed to a long-form narrative, as it very much feels like small 'skits' strung together, but this works in the picture's favour as it replicates the typically sweeping, 'everyday as adventure' feel of childhood. It also allows the audience to empathise mostly with the disembodied narrator, who reflects on his time as a child with the kind of glee only someone who experienced the events could and provides a knowing edge to a lot of the movie's otherwise innocent events. Indeed, adults will probably get more mileage from this typically nostalgic piece than children. 6/10",
    "7": "Peter Billingsly in a custom made role as Ralphy, the 9-year old who wants a toy rifle for Christmas in 1940 Cleveland. Everyone from his mom to his teacher, to even Santa Claus himself tell him that \"he'll shoot his eye out\" and should not have such a dangerous toy. Many wonderful scenes of \"boys will be boys\" trouble, including the unforgettable \"tongue frozen to the flag pole\" make this movie a delight to watch again and again.As an added bonus there is much authentic Cleveland nostalgia, including the old wooden escalators at Higgbees and the main Square in front of Tower City. Add this to your Christmas Classics and place it right next to \"Miracle on 34th Street\" and \"It's A Wonderful Life\"!",
    "8": "This has always been a favorite with a lot of people, and I can see why. It's a nice comedy about a little boy's wish for Christmas and is set back in the 40s. It's narrated by the boy who is now much older and is fondly looking back at the period, which included a lot of funny moments for he and his friends and family.Jean Shepherd narrates and Peter Billingsley plays the little kid, \"Ralphie Parker.\" He's fun to look at, with his nerd-like looks. It's also a good-natured film and, except for a few swear words, is safe for the whole family.Darren McGavin and Melinda Dillon also shine as Ralphie's parents. I haven't seen this in a long time, but I always remember the little kid's favorite Christmas present, a red air rifle and his friend getting his tongue frozen stuck to a pole. That last scene has been a classic since this film came out almost 25 years ago.",
    "9": "We watch it every year, all day on the 25th of December . . . It doesn't get old. It's indescribable. A must watch.",
    "10": "What can you say about A Christmas Story? How many people don't know who you mean when you say...Ralphie and his BB Gun, or the leg lamp, or the pink nightmare? Christmas movies probably have a much better chance of becoming \"classics\" that get watched every year but there are likely as many completely forgotten too but A Christmas Story is not one of those. I think I've pinpointed the love of this film. First of all, the movie is not a \"family\" Christmas movie per se as it does have some bad language but adults love it because they can find something in it to relate too. The film is so brilliantly written that you feel like you are living the life of this little boy. The adult narration in his head is just awesome, and hilarious and the entire experiences that he goes through are fun to watch and completely memorable. Although the film is known for being about him wanted that BB gun, that is such a small part of the bigger picture. Its not a coming of age story but rather a being of age story. As with most classics everything just clicks and works so well and you can watch it again and again like a home movie of your own and feel the same warm fuzzy feeling.The discovery and casting of Peter Billingsley was sheer brilliance. Billingsley doesn't have a ton of lines in the film because so much of what goes on is the adult voice in his head. This makes him even better a performer because he has to react to the voice and to the things going on around him and he is perfect. He gives a top notch performance. Melinda Dillon and Darren McGavin are amazing, memorable, and legendary as Ralphie's parents. They have such unique personalities and you can't help but laugh and smile at their antics. They just light up every scene they are in. Jean Shepherd is the adult voice of Ralphie and he does so with complete ease and utter perfection. He is an adult making everything sound like he's experiencing things as a child and it is perfect for the movie. He literally embodies Ralph as much as Billingsley does. Scott Schwartz, Ian Petrella, RD Robb, and Zack Ward all are brilliant in small doses as Ralphie's peers. None of them have big moments, some of them have very few lines and yet they are all so integral to the story and they all get at least one moment to shine.Bob Clark has had such a mixed back to his direction credit. But there is one thing he knows and that's 80s comedy. He helped take A Christmas Story to epic proportions that nearly everyone holds dear. The movie is, simply put, hilarious fun. You will feel their pain, their memories, their family and the best Christmas they've ever had. I can't say enough about this film because if you haven't seen it, you're likely in a minority and if you have then you likely know exactly what I mean. It is just simply heartfelt, a tad raunchy, and a whole bucket load of fun. 8.5/10",
    "11": "The filmmakers didn't set out to make a lasting piece of Americana, but that's exactly what we got.I have no idea how many times I've seen this movie since I was a kid, but it never loses its lustre. Year after year, it's always a relatable story that any kid hoping for that big Christmas gift can identify with. And it helps tremendously that this movie is well-acted and directed, with great performances coming from not only the leads, but also the supporting players.A great deal of the visual humor rests on the facial expressions and reactions of Peter Billingsley, which go a long way in selling this thing. The same can be said for Darren McGavin, who perfectly wears the mask of eternal annoyance and gruffness for laughs.But it's Shepherd's writing that's the real star of the piece, at least for me. Just as he did in the novel, the man can paint a vivid picture of how things were when he was growing up in Indiana. His words go down smooth, and his impressive linguistic prowess is on full display in his narration.\"A Christmas Story\" has a cultural success story that is unlike that of any other film; or at least any movie I can think of. The movie enjoyed a second life on HBO and home video after being ignored at the box office, but it has made a slow, steady, tenacious comeback into mainstream acceptance. Licensed and marketed to the hilt (novelty leg lamps, action figures, mugs, ornaments, etc.) and maintaining a high cultural visibility for many years, it's become (for my money) the most recognizable American Christmas movie ever made. You can mention Bedford Falls, and someone might get the reference. But if you mention Scut Farkus, a leg lamp, Red Ryder, or \"You'll shoot your eye out!\", everyone in the room will instantly know what you're talking about.It's just about as iconic as a Christmas move can get.9/10",
    "12": "How did this lame comedy get ranked alongside \"It's a Wonderful Life\" as one of the greatest Christmas films? There are some amusing scenes, such as the kid's encounter with the mall Santa, but overall this film looks like a \"Saturday Night Live\" skit, with characters that are poorly drawn caricatures. McGavin and Dillon are not believable as husband and wife. The script is too episodic to sustain the narrative; the humor is forced. The scenes with the bully are way over the top. The direction is pedestrian, relying on stale gimmicks like daydream sequences and fast motion. The sets look cheap and cheesy, like a TV special.",
    "13": "This is the best Christmas film of all time; it is not really even close. No writer for a Christmas film was even remotely as talented as Jean Shepherd (that includes Frank Capra, who was great at CROWD scenes, but not family scenes). This film was the best thing Peter Billingsley ever did, the best thing Darren McGavin ever did, and the best thing that Melinda Dillon ever did. It was, most likely, the best thing that anyone associated with this film had ever did. I defy anyone to find one better.",
    "14": "heres is a feel good festive Xmas full of charm very funny full of delightful characters the Christmas spirit isn't served up more heart felt warmth or observant hilarity than a beloved book adaption of this holiday in the 1940s Indiana where a 9 yr old ralphie played peter billingley dreams of his ideal Xmas present a genuine red Ryder 200 shot rifle but his parents respond with you will hurt your self with that ralphie goes on the Santa campaign of begging he endures all his childhood fears and calamities of snowsuit paralysis to a big I'm going to beat the crap out of bullies to the frozen tongue issues this is a Xmas classic not to be missed don't forget the leg lamp at 1hr30min jump in a see what your missing 7/10",
    "15": "When I saw A Christmas Story repeatedly described as the 'best Christmas film ever', I knew I'd be invariably disappointed. This sweet and sentimental story is a family-focused tale about a young boy growing up in the 1940s and desperate for a toy gun for Christmas. Yep, the usual American preoccupation with commercialism, and not a patch on the likes of IT'S A WONDERFUL LIFE.It is, however, the sort of film that kids would love, given that it charts children getting up to repeated mischief in much the same way as Richmal Crompton's JUST WILLIAM books. I can imagine that it's the type of film that people would watch themselves as a kid in the 1980s and grow up loving it with a fuzzy feeling of nostalgic warmth, which is fair enough.The twist about A Christmas Story is that it's actually a Canadian film, directed by the one and only Bob Clark, whose Black Christmas is one of the ultimate Christmas horror films ever made. As for this film, it's watchable and fitfully amusing, featuring the usual pratfalls and scenes of kids getting their tongues stuck to frozen poles. The main character is a bit annoying although not as much as I'd feared and old-timer Darren McGavin helps to anchor things as his dad. Indeed, I found it entertaining enough, just not the classic I'd read about.",
    "16": "Nine-year-old Billingsley living in 1940s Indiana (the city of Hohman, a fictionalized version of author Shepherd's hometown of Hammond) wants a \"Red Ryder Carbine Action 200-shot Range Model air rifle with a compass in the stock and 'this thing which tells time'\" for Christmas. Seems straightforward? Nah. Layered with many fun subplots that are more humorous than the last, this sleeper hit has since become easily one of the greatest Christmas movies of all-time. The flagpole incident, Shepherd's narration, and Zittrer and Zaza's score are what really make this film worthwhile, but all-in-all almost everything about this Christmas classic is near perfect.**** (out of four)",
    "17": "Bob Clark hit a home run with \"A Christmas Story\". Nothing else in his resume even comes close to this movie. Most of his movies are okay at best. That said, Clark made a classic and his name deserves to be remembered. \"A Christmas Story\" is not a perfect movie but it is a really good one. It has a lot of warmth and a lot of laughs. It understands childhood way better than most other movies about children. Unfortunately, I don't watch \"A Christmas Story\" as much as I should. It's not the movie's fault but the Christmas all day marathons have worn me out. Dishonorable mention: Randy and the potatoes.",
    "18": "The face when he gets pink rabbit suit from his aunt is literally my face after my aunt's gift every Christmas.",
    "19": "I think this is right up there vying for all-time best Christmas movies, with greats like A Christmas Carol (Alistair Sims, of course) and Die Hard (though is it a Christmas movie or just a movie set at Christmas time?). However, it's also just a good movie. The story is cute and clever with an easy humour. Plus, Darren McGavin delivers a great performance.",
    "20": "I grew up with movies like WHITE Christmas, HOLIDAY INN, and IT'S A WONDERFUL LIFE as holiday viewing traditions, but that all changed with the release of A Christmas STORY, the 1983 instant classic that has so enchanted film goers that TBS in Atlanta now shows the film on Christmas Eve for 24 straight hours every year. This warm and funny Christmas story centers on an adorable little boy named Ralphie whose only wish for Christmas is to find a Red Ryder BB gun under the Christmas tree and the manipulations he puts his parents through to get one. Written and narrated by Jean Shepherd and based on his story \"In God We Trust, All Others Pay Cash\", this delicious slice of Americana is a delight from start to finish filled with equal parts belly laughs and warm sentiment. Young Peter Billingsley is a joy as Ralphie and he receives brilliant support from Darren McGavin and Melinda Dillon as his parents. Scott Schwartz also scores as Ralphie's best friend Flick, who has a memorable encounter with a telephone pole. Don't miss this one.",
    "21": "I saw this when I was in grad school. The review sounded good. Also, it had Darren McGavin in it. The whole cast is hilarious. The situations they get into are memorable. It kind of reminds me of when I was little in the 60s. The only minus is when they eat supper. Coulda been handled better.",
    "22": "I've been aware of this movie for years thanks to the TBS yearly marathon but never been inclined to watch. Glad I finally gave it a chance bc it was enjoyable especially those moments when we'd see Ralphie's desires on-screen. Definitely one that could become a part of my xmas rotation",
    "23": "A timeless classic movie. Perfect for kids and adults alike. Years from now this movie will still be just a popular as it's been for the pst 15+ years.",
    "24": "A classic, that's what Bob Clark created in 1983, when he directed A Christmas Story, starring Peter Billingsley as Ralphie. It wasn't an instant classic though, but it was a bigger hit than the studio could have anticipated. Classic nonetheless, as it plays just as often as IT'S A WONDERFUL LIFE, or A Christmas CAROL starring Alastair Sim.Darren McGavin stars as Ralphie's father, in the most memorable role of his life. And the sub-story about the special prize, the leg lamp he won is just as memorable. So much in fact, the lamp has it's own following and Christmas ornament.The film has become an icon of American Christmas celebrations. The film also helped to re-popularize the Red Ryder BB gun. If you enjoy Christmas films and a little nostalgia, then this will surely warm your heart and make you laugh.",
    "25": "The best Christmas movie ever, this one is bringing back a lot of fonds memories from my youth. It's now a tradition to watch this one as we setup the decorations each year. There are so many great scenes and quotes from this one, some of them I quote all year long!",
    "26": "I love this movie! Me and my sister laughed so hard as teens cause of all the stupid things these kids do. And the soap in the mouth, My Mom did that to us too. Mostly Palmolive and Jergens. NOT Lifebouy! Ha hahahaha YUK!! We grew up playing cops and robbers with sling shots and toy guns. We used cans and bottles to practice, Not each other. The fear of bully's rings true. I remember being 6 and my 10 year old brother was about to be pummeled by a 12 year old known bully. All the kids gathered around and this stupid bully who happen to wear glasses, took them off and of all the kids he could have given them to, he handed them to me and then shoved my brother to the ground. So I threw his glasses on the ground and stomped them and ran. It was enough time for my brother to escape too. Ha hahahahah This movie is fun cause it rings of alot of truths that were evident in my childhood. ;D And that leg lamp is HIDEOUS and HILARIOUS! :)",
    "27": "We not only watch this but we have also discovered many other Gene Sheppard stories! The very first installment was withMatt Dillion, who played \"Ralphie.\" It came our 2 yrs. bf \"A Christmas Story!\" It's called, \"The Great American Fourth of July and Other Disaster.\" It has been so exciting, finding all these treasures!",
    "28": "Bob Clark's A Christmas Story is one of the greatest movies that I have ever seen in my lifetime, and now I look back to the time where I was a little kid and I remember not liking the film because of one particular scene and that scene is where Flick (played by Scott Schwartz) is dared by Schwartz (played by R.D. Robb)triple dog dares him to stick his tongue to a pole in order for Flick to see if his tongue either sticks to the pole or not, and now that I love it a lot more I regret not liking it then. The movie stars Peter Billingsley as Ralphie Parker a young boy who tries persistently to convince his parents (played by Melinda Dillon and Darren McGavin) his teacher (played by Tedde Moore who Ralphie writes a theme for), and a Santa Claus impersonator (played by Jeff Gillen) to get him the one thing that he wants for Christmas and that one thing is a Red Ryder BB gun of which he thinks is the perfect Christmas gift for the time period that the movie is set in which is the 1940s. One of the neatest things about this movie is that it is not necessarily a Christmas movie it is a movie about Christmas, but the one thing that I learned from this movie is that joy and happiness are two of the many things that can lead to having a great Christmas, and another thing that I learned was never to be naughty by two scenes where the two bullies Scut Farkus (played by Zack Ward)and Grover Dill (played by Yano Anaya) in which Scut gets a lesson learned in a very manly type of way by getting beaten up by Ralphie, and also not to be a spoiled brat like Randy (played by Ian Petrella) was in the film in which he was spoiled but in a good way because of his performance in the film, the film is also very funny especially the scenes where the old man is swearing at the furnace, and the scene where Scut Farkus gets a lesson learned from the beating by Ralphie among others. The film really works as a timeless classic that never does get old even 31 years after it was released.",
    "29": "A wonderful Christmas classic. Great to see it every year. So funny and relatable to any child and adult. Timeless. Amazing cast all around. Followed up by a great sequel 30 years later.",
    "30": "On Christmas and New Year's Eve, I saw this blond kid with blue eyes and glasses everywhere. I knew it was a Christmas movie, but I had never seen it. I decided to watch this year. Frankly, I was disappointed. I was expecting a different ( in a good way ) movie, but it was a weaker movie than I expected. In the movie, the mother and father are not very convincing and real characters, i think. The blond boy is a dreamer and I was such a kid when I was a kid, but I wasn't naughty. At least as much as this child :) I was able to empathize with the child in some scenes, but I couldn't in some scenes. I know it's one of those Christmas classic movies. I've watched a lot of Christmas movies. Although, I don't celebrate Christmas and the fact that I'm from a different culture. I liked many Christmas movies, but frankly, I didn't like this movie. It's not bad at all, but I think it's over exaggerated, overrated. Watching it once was enough for me. There are many people who liked this movie, I understand, but it was not a movie for me.",
    "31": "I first heard of this film when the Nostalgia Critic placed this at no. 1 on his Top 12 Christmas Specials and while I didn't think a great deal of it apart from the part where Flick gets his tongue stuck on a frozen lamppost, I decided to give it a chance and I'm glad I did because its fine mixture of amusing, touching and dark moments entertained me albeit its somewhat slow pace and parts I felt were incomplete, especially when Ralphie cries to his mother after having beaten up the bully but doesn't tell her he's a bully. The musical score is mostly nostalgic with some hints of whimsy and I liked the arrangements of 'Deck The Halls' and 'We Wish You A Merry Christmas' while the snowy scenery is stunning. The interior sets ranged from Ralphie's family household being true to the 1940s to the department store being beautiful whether on the inside or in the display window. Ralphie is a sweet and ambitious character in terms of wanting a BB gun for Christmas who has his defiant moments such as needing to have his mouth washed out with soap, beating up the school bully and refusing to wear the pink rabbit suit his aunt bought him for Christmas (although it was hilarious when he wore it) I enjoyed watching his imagination sequences such as the pixilation-style one of him trying to defeat robbers with his BB gun while wearing a glittery cowboy suit that made him look like a glammed-up Milkybar Kid, his teacher marking his class's assignments and giving him an A+ (he really gets a C+) and himself becoming blind due to soap poisoning. There were other moments that stood out such as Ralphie trying to crack his code in the bathroom when Randy needed to go, the dogs running in the house to eat all the turkey and the family going to a Chinese restaurant for Christmas dinner. The side characters were hyper (Randy in a sense and Flick), pushy (the female elf), a tad creepy (Santa), strict (Ralphie's teacher and parents), funny (the Chinese restaurant staff) or reassuring (Ralphie's mother). I liked Adult Ralphie's engaging narration and some of the dialogue, especially the memorable line \"You'll Shoot Your Eyes Out.\" The darkest moments consisted of a boy being slapped over the phone for apparently teaching Ralphie a profanity and the bully's nose bleeding when Ralphie hits him.Overall this is an underrated and heartwarming Christmas gem that has its fine blend of touching, amusing and gritty moments. 8.5/10 to round up to IMDb's 9/10 rating.",
    "32": "I grew up with movies like WHITE Christmas, HOLIDAY INN, and IT'S A WONDERFUL LIFE as holiday viewing traditions, but that all changed with the release of A Christmas STORY, the 1983 instant classic that has so enchanted film goers that TBS in Atlanta now shows the film on Christmas Eve for 24 straight hours every year. This warm and funny Christmas story centers on an adorable little boy named Ralphie whose only wish for Christmas is to find a Red Ryder BB gun under the Christmas tree and the manipulations he puts his parents through to get one. Written and narrated by Jean Shepherd and based on his story \"In God We Trust, All Others Pay Cash\", this delicious slice of Americana is a delight from start to finish filled with equal parts belly laughs and warm sentiment. Young Peter Billingsley is a joy as Ralphie and he receives brilliant support from Darren McGavin and Melinda Dillon as his parents. Scott Schwartz also scores as Ralphie's best friend Flick, who has a memorable encounter with a telephone pole. Don't miss this one.",
    "33": "This movie is a poor and secular excuse to ruin a good holiday.Christmas is a beautiful holiday for religious people, and non-religious people. It's a time of celebrating Christ's birth (if you're religious) and giving (if you're not religious.) This film does no justice for either side of the holiday....Ralphie is an obnoxious little boy who whines all the time on how he wants a RED RYDER BB-GUN, and that's basically all he does. He's not even that cute a kid (I thought he looked like a child version of Drew Carey.) His brother is stupidly annoying, and his parents are dysfunctional idiots who should never have been allowed to have custody over their kids. I mean, I would have sought relationship counseling if my husband bought a lamp shaped like a Playboy bunny's leg. That's disgusting. But wait, she was an idiot, so what was I thinking? Ralphie beats the snot out of a bully kid, to the point where he's bloodier than Rocky Balboa was at the end of \"Rocky\". But when Ralphie's mom pulls him away from the bully, she doesn't check if he's okay. But I keep forgetting, she's an idiot. I mean, she thought Ralphie looked cute in his pink bunny PJs... that his idiot grandmother gave him. I'm surprised Ralphie didn't grow up to become a mentally insane serial killer.What's worse, is people are all like, \"It was like that when we were kids.\" Really? Then, I pity you all who had to grow up with moronic mothers, obnoxious little siblings who acted like animals, fathers who bought Playboy lamps and cussed all the time, and grannies who sent you pink bunny PJs.Whats worse, is that the best version of this film is the 30 second version with bunnies. http://www.angryalien.com/aa/xmas_storybuns.asp And this isn't saying much.Please, buy \"A Christmas Carol\", or \"Miracle on 34th Street\", or \"It's a Wonderful Life\", if you want to watch a good Christmas classic. This is not as good as everyone makes it sound. 1/10",
    "34": "Many cuts above the usual \"feel-good\" Christmas movie, but it's all that and much more. One of a handful of movies that are beyond description, such as Repo Man, The Wizard of Oz, and Apocalypse Now. As the storied producer said, \"Don't miss it if you can!\" While there are no \"name\" performers, all are excellent, and the kids are beyond compare, like the movie. Set in the most unimaginable city on earth for such a movie (not Hong Kong, not Rio de Janeiro, not Tristan de Cunha), Cleveland, Ohio, the movie plumbs the depths of a boy's Christmas desire for what was once far more magnetic than any video game or latest electronic marvel: a genuine Daisy B-B gun (politely known as an \"air rifle\"). The kids he hangs out with are also intriguing, and his family is a joy. As the famous man said, \"Don't miss it if you can!\"",
    "35": "As a 13 year old, one might think I have strong or hateful feelings for an \"older\" movie because of my younger age demographic. That is certainly not the case! You have probably already seen this film because of its massive popularity and wonder why I'm writing a review about a 37 year old film, the main reason is, well its a great movie as far as screenplay, writing, casting and almost any other thing you can critique this movie on, but it's not all about that sometimes, a movie should be how it makes you feel and when critics stand on a high horse judging every little bit of a film/movie, we can get very caught up. This movie a is a great example of that, the way this film makes me feel is almost indescribable, It kind of makes me feel like I'm nine again, spoiled rotten and very unlucky (at least in my eyes at the time). The way the writers convey Ralphie's (The main character) point of view and thoughts makes me have almost this relatability and connection with the main character really makes this movie for me! If you haven't seen it yet (somehow!) please just go watch it, its a fantastic film that you will most likely love!",
    "36": "The quintessential Americana Christmas film. This movie depicts what Christmas was truly like back in the 40's and 50's of American culture. I absolutely LOVE this movie, there is a reason that multiple channels play it for 24-hours straight the day of Christmas. It's a reminder of what our country used to be and how people use to handle Christmas time, and not in a \"hallmark\" over-the-top kind of way, it's a very real take on the American condition of Christmas.",
    "37": "We are an english family, now back in the uk but were on assignment in NY for three years and we came across this wonderful film by chance, and have never seen anything more entertaining for the whole family - it is a real gem of a film and a definite must for all families.  Have at last found it to buy with amazon.uk and are thrilled.",
    "38": "I've seen people throughout my entire life go on and on about how this is the greatest Christmas movie ever. People quote it, people watch it for 24-hours on Christmas Eve. You talk about cult classics? This is the Jonestown of Cult movies. Does the film hold up all these years later? In some ways, yes. I get why this film is so beloved. It's the same reason why I find it so weird. It's uniquely anecdotal. Largely based on Jean Shepherd's radio stories, A Christmas Story is a series of awkward holiday mishaps, strung around a story of one kid's dream of getting a BB Gun for Christmas. Don't get me wrong, the stories themselves are great. Many of the gags really stick the landing, and that's this film's biggest asset. They are all iconic. The tongue scene, the department store Santa, The leg Lamp, the bunny costume scene.. and so on. Bob Clark is the director, and this was his first family feature. He typically made horror movies before hand. Unfortunately, that shows here. The weirdness of the stories are amplified by Bob Clark's nightmarish direction. It's a Christmas fever dream. Maybe that was the point.",
    "39": "I've seen this movie repeatedly every Christmas through its 24 hour TV marathons and occasionally in the summer when you want that Christmas feeling.It took me a long time to realize what the story is truly about.It's about a son, who secretly wishes for his fathers affection. The old man, a distant blue collar working man who seemingly is uninvolved in his child's lives, sits back as the mother and teacher raise his child.However, as the movie goes on, you realize he's much more aware of his kids than the audience thinks. Then we realize at the end, it was him who bought the BB gun for Ralphie against the mother's wishes.It's a story about how some men, who don't know how to communicate with their children, can still have a lasting impact on their lives.",
    "40": "According to LEIGH BROWN, CREATOR AND ENABLER The Lives and Love of an Arty Village Chick by Eugene B. Bergmann, \"Leigh Brown, from the early 1960s through the late 1990s, was the steadfast, all-purpose, vital element in the life and art of the raconteur and wit, Jean Shepherd.\" As early as 1972, she would tell people \"If we can ever get A Christmas Story made as a movie using the Red Ryder BB gun tale, he will have it made. It would be the ultimate perennial Christmas movie like It's a Wonderful Life.\"She was so right.Shepherd took the stories that he told on the radio and wrote in books and worked with his wife Leigh and filmmaker Bob Clark to make the stories \"Duel in the Snow, or Red Ryder Nails the Cleveland Street Kid,\" \"The Counterfeit Secret Circle Member Gets the Message, or The Asp Strikes Again,\" \"My Old Man and the Lascivious Special Award That Heralded the Birth of Pop Art\" and \"Grover Dill and the Tasmanian Devil,\" as well as \"The Grandstand Passion Play of Delbert and the Bumpus Hounds,\" as well as the unpublished \"Flick's Tongue\" into a movie.Clark had first heard these stories on the radio in 1968 and worked for years to get this movie made.What amazes me is that Clark made both the darkest holiday film of all time, the perfect Black Christmas, and this film, a movie that for many is the American Christmas film.It wasn't always that way.The city of Cleveland wasn't sure they wanted someone that made a seasonal slasher, much less Porky's, to make a film in their town. Even the department store used for the film, Higbee's, had a clause where vice president Bruce Campbell would be allowed to edit the script for cursing if they used his store. Ironically, the house used for a lot of this movie is on Cleveland Street, which is also the street name - in Hammond, Indiana - where Shepherd grew up.It wasn't an easy shoot. Clark had Shepherd banned from the set at one point for giving his young actor his own direction.The movie did fine - $20.8 million on a $3.3 million budget - but then it went away. That's what movies used to do.But then, something small happened and grew.Metro-Goldwyn-Mayer's pre-1986 film library was bought by Ted Turner. He needed a holiday movie to show that they owned and didn't have to pay the rights to. They started showing it in 1987 and at one point, showed it the entire day of Christmas. It became the holiday movie, replacing It's a Wonderful Life, which ended its free run of being a public domain film in 1993 when Republic Pictures bought the rights to the original story it was based on, as well as the music in the film.You may know the story of Ralphie, of the gun he wants, of the tongue on the flagpole, but maybe knowing all of the above will add to your holiday watch.",
    "41": "Some Christmas films do a lot for you, others don't.This for me was a film that came very, very highly recommended, and yet did absolutely nothing for me. It was a struggle to get from the start to the end.I don't know why this was. Maybe I wasn't in the festive spirit, maybe the characters and indeed the storyline just didn't grab me enough, but ultimately this wasn't a film I overly enjoyed, or would rush to see again every Christmas.I'm thrilled though that so many people do rate it so highly, and that it's one of their festive film cycle every Christmas, but for me it was too cutesy.",
    "42": "Charming Christmas tale directed by Bob Clark of \"Porkies\" (1981) fame (!) about a young boy and his dream of finding a Red Ryder BB gun under the tree on Christmas morning. Shot as an autobiographical 'memory' film, with a voiceover by Jean Shepherd, the story recounts young Ralphie's (Peter Billingsley) 9th Christmas, sometime around 1940. The stories are fun, mostly nice with just a touch of naughty, and include vignettes about the last days of school before holidays, bullies, tongues and cold flagpoles, visiting the department store Santa, and of course, Christmas morning. Peter Billingsley is excellent as Ralphie and the rest of the cast, mostly portraying his family and friends, are fine although Melinda Dillon does not look much like a WWII-era mother. A fun movie, considered a seasonal classic by some, worth watching once, and maybe even once a year.",
    "43": "A Christmas Story  is the story told by Ralphie Parker (narrated by Jean Shepherd acted by Peter Billingsley) who is a nine year old boy from Indiana.  The main point of this story centes around Raphie's desire for a `Genuine Red Ryder 200 Shot Carbine Action Air Rifle.'  Ralphie is like many other kids of the 1940's. He lives with his younger brother Randy(Ian Petrella), his mother( Melinda Dillon), and his Father (Darren McGavin). As the story progresses, Ralphie tries to convince the adults in his life that  a ` Genuine Red Ryder 200 Shot Carbine Action Air Rifle,' would be a good choice as a Christmas gift.  He leaves advertisements in his mother's magazine, he writes about why he wants it in a school assignment about \" What I Want for Christmas\". He even asks the head honcho, Santa Clause. They all respond with the classic phrase,  `You'll shoot your Eye out.' Ralphie is let down by this  but he does not give up.This story is not only about Ralphie's quest for a BB gun, it also is a story about Ralphie's childhood n the 1940's. Like any other movie told from a child's perspective, there is some kind of school or neighborhood bully, who picks on others as well as the main character.  This movie would not be the same with out Scut Farcus, a tall nasty looking green/yellow toothed kid. (probably twelve or thirteen) and who could forget a trusty sidekick named Grover Dill.  Ralphie and his friends are afraid of Scut and try to avoid him as much as possible. These emotions build up in Ralphie until one day, he can take it no longer, his anger gets the best of him, and he beats up Scut Farcus.  All the neighborhood kids gather around to watch the fight which came to be known as the Scot Farcus affair. Although Ralphie was worried that he would get not trouble as a result of this fight, he soon forgot about this as he continued tot think of ways to get what he wanted for Christmas.We are also introduced to Ralphie's parents and brother. like.  Any film of the forties can't be complete with out the house wife/ mother.  Melinda Dillon acts, and looks like the typical house wife of the forties who cares for her family. Ralphie's dad, who is refrred to as `the old man',  is somewhat crabby, but for the most part he is a very likable character. He likes to enetr contests and eventually wins a `major award' which turns out to be a sexy leg lamp. The `Old Man has a tendency to use bad language, however, when Ralphie starts to use some of these words, he is punished by having his mouth washed out with Life Boy Soap. . Jean Shepherd's narration, and Peter Billingsley's portrayal of Ralphie make it seem as though the two really grew up in the forties.  From the way he dresses to the way he acts, Peter does a great job acting out Ralphie's part.  The same goes with Jean Shepherd.  Although he is not acting, just narrating, he describes Ralphie's childhood so well that it almost seems as though we are growing up with him. Similarly, the supporting actors and actresses, Melinda Dillon, Darren McGavin, Ian Petrella and Ralphie's friends, Schwartz and Flick who are played by Scott Schwartz and RD Robb, add a lot of humor to the story.The reviewer would rate this movie a six out of five star rating.  No matter what happens in the movie it manages to have a great plot.  Ladies and Gentlemen.  Make room for this movie on your video or DVD rack at home!",
    "44": "A Christmas Story has gained quite a cult following over the years. Released back in 1983, it failed miserably at the box office. Years later, it has become one of the most beloved Christmas films of all time.The story revolves around a boy named Ralph who wants nothing more than a Red Ryder BB Gun for a Christmas gift. Over the course of the film he receives opposition from his mother claiming, \"You'll shoot your eye out\"! Poor Ralph. He also meets resistance from his teacher, Ms. Shields and a very nasty store department Santa Claus.I enjoy watching Christmas Story every year. The film never gets old and even though you can catch it being played for 24 hours on TNT, it never fails. This is one Christmas film that lives on forever in our hearts.",
    "45": "Peter Billingsley, Darren McGavin, Melinda Dillon, Ian Petrella, Scott Schwartz and Zack Ward star in this 1983 comedy based on Jean Shepherd's novel, \"In God We Trust, All Others Pay Cash.\" This takes place in the 1940's and focuses on young kid, Ralph Parker (Billingsley) who lives with his parents (McGavin and Dillon) and little brother, Randy (Petrella). Ralph wants a Red Ryder BB gun for Christmas, but faces some obstacles before receiving it like dealing with bully, Scut Farkus (Ward) who loves tormenting him and his friends. Schwartz (The Toy) plays Ralph's friend, Flick and the late, Shepherd not only narrates as adult Ralph, but appears as a shopper. I've always liked this film and watch it every year when it comes on TV. Billingsley & the cast are great and I recommend this Christmas classic.",
    "46": "Title says it all. Every year I watch the first showing on TBS. just finished this years annual ritual and it's as good as ever. Can't wait to watch it again in 365 days.",
    "47": "A Christmas Story is a very sweet and funny movie, perfect to watch during the holidays. It's so popular with some of my friends they watch it every Christmas season. The movie takes place in the 1940's in the Midwest. Young Ralphie dreams of getting a BB gun for Christmas. He lives with his parents (Melinda Dillon and Darren McGavin) and little brother. The movie is full of funny scenes including the local bully, the frozen tongue on the flagpole, the trip to see Santa Claus at the department store, the father's \"major award\" and more. Darren McGavin, who made his career in television, is hysterical as the gruff father. Melinda Dillon is good as the doting mother. Peter Billingsley plays a great Ralphie. Kids and parents will like this movie.",
    "48": "This first time I watched this movie, I remember telling a friend he had to see it, that he was guaranteed to laugh. He didn't. It was an early lesson in the subjective nature of humor. But nearly 40 years later, I still feel like it would be almost impossible for anyone not to enjoy this movie. It defines the Christmas season--how can you not watch it sometime in December? This might be the best example of narration NOT ruining a movie. For me, it brings back feelings of childhood and nostalgia, even though I'm not from it's era. It just gets so many things right.",
    "49": "This manages to create nostalgia for a time and place I never lived in, despite seeing some similarities for the era I did. I can only imagine what it's like for those that lived it. It's quaint and simple, about kids experiences and that's why it works, because the feelings are universal enough to last despite the times changing.",
    "50": "Probably the best Christmas movie ever. It is watched in my house at least a dozen times during the season. Side note my wife got me the Red Ryder bb gun. I have not shot my eye out...yet.",
    "51": "This isn't the BEST Christmas movie I've seen but I can't deny its significance that many give it. Really hilarious moments throughout the film! I feel like it's also one of those movies that you have to watch repeatedly to pick up on new things too, which can be a good thing! Takes me back to when I was a kid at Christmas time!",
    "52": "While dozens of Christmas films roll off the production line every year, very few manage to capture the festive season, and the audience's hearts, quite like 'A Christmas Story'. This 80s classic is a real crowd-pleaser, a film that can be enjoyed by anyone regardless of age or film taste, which explains its continued popularity with TV networks.Ralphie is a character we can all relate to, because we were all that kid a Christmas once. The film gets his character spot on and the events that take place in the film will bring back a lot of memories for the average viewer. For such a shallow storyline the film provides so much enjoyment and, although there are other films I would rather watch over the festive season than this one, it remains a classic to this day and will always be up there as one of the Christmas greats.",
    "53": "I'm 41 years old and I've seen this movie every Christmas since i was 4 years old. Gets better every time i watch it. And it brings back memories of me and my brother being locked in our room on Christmas Eve while our parents wrapped presents. We had rabbit ears on our old tv and this was on 24 hours so we watched it over and over. It's still a Christmas tradition today with my kids.",
    "54": "I have tried to watch the movie at least half a dozen times and can never get more then halfway through it.Some people think this is required watching during the Christmas Hoilday season.It has been said it is a reflection on our childhood wants for that certain Christmas present.Well I was never a big believer in the commericalism of all Holidays.The lowest rating here is 1 awful well if I could I would say it is a negative 10 But if others think it is good that's okay just don't expect me to agree with you on it It's a wonderful life is still my all time favorite Christmas story.",
    "55": "A christmas story is my all time favorite christmas movie. Nostalgic, heartwarming, hilarious, and sentimential. Its a movie i can never get tired of watching no matter how many times i watch it. If you havent seen it yet highly recommend checking it out.",
    "56": "Best Christmas movie of all time! Darren McGavin was my father in this movie. Wonderful cast and wonderfully made. Can watch it over and over again. \"You'll shoot your eye out!\"",
    "57": "One of those movies that makes you relive your own childhood memories in your head. Looking back at them almost feel like a movie you saw a very long time ago. I thought it was very clever that the adult version of himself was narrating his childhood. That makes the movie likable both for adults and kids.It's about a kid named Ralphie wanting a BB gun for Christmas and his awkward interactions with his friends and family.",
    "58": "This film was probably the last time anyone's made a decent Christmas movie, although The Ref might have a decent claim to that. Since A Christmas Story, there hasn't been anything that even comes close to comparing to the overall sweetness or it's message of Christmas cheer.Perhaps the funniest sequence was the dinner in the Chinese restaurant towards the end. When I first watched it I couldn't figure out if the mother was laughing or crying, but her reactions to the duck were priceless. Other highlights are the gibberish that was supposed to represent profanity (my sisters and I still laugh ourselves into hernias watching that part since it's exactly like our father), Ralphie's everyday interactions with family, friends, bullies, and school, the actual Christmas Day hilarity (the bunny suit!)...oh, why beat around the bush? It's all great fun to watch.Obviously set in the mid 20th century, it may appear dated but the messages and situations are actually timeless. Peter Billingsley played the part of Ralphie to perfection. Darrin McGavin and Melinda Dillon were perfectly cast as his parents. There isn't a wasted performance in the film. If you only see one Christmas film a year, A Christmas Story is not one anyone would ever blame you for choosing. It's a sweet, timeless classic that belongs in anyone's collection.",
    "59": "Some Christmas films do a lot for you, others don't.This for me was a film that came very, very highly recommended, and yet did absolutely nothing for me. It was a struggle to get from the start to the end.I don't know why this was. Maybe I wasn't in the festive spirit, maybe the characters and indeed the storyline just didn't grab me enough, but ultimately this wasn't a film I overly enjoyed, or would rush to see again every Christmas.I'm thrilled though that so many people do rate it so highly, and that it's one of their festive film cycle every Christmas, but for me it was too cutesy.",
    "60": "Charming Christmas tale directed by Bob Clark of \"Porkies\" (1981) fame (!) about a young boy and his dream of finding a Red Ryder BB gun under the tree on Christmas morning. Shot as an autobiographical 'memory' film, with a voiceover by Jean Shepherd, the story recounts young Ralphie's (Peter Billingsley) 9th Christmas, sometime around 1940. The stories are fun, mostly nice with just a touch of naughty, and include vignettes about the last days of school before holidays, bullies, tongues and cold flagpoles, visiting the department store Santa, and of course, Christmas morning. Peter Billingsley is excellent as Ralphie and the rest of the cast, mostly portraying his family and friends, are fine although Melinda Dillon does not look much like a WWII-era mother. A fun movie, considered a seasonal classic by some, worth watching once, and maybe even once a year.",
    "61": "A Christmas Story  is the story told by Ralphie Parker (narrated by Jean Shepherd acted by Peter Billingsley) who is a nine year old boy from Indiana.  The main point of this story centes around Raphie's desire for a `Genuine Red Ryder 200 Shot Carbine Action Air Rifle.'  Ralphie is like many other kids of the 1940's. He lives with his younger brother Randy(Ian Petrella), his mother( Melinda Dillon), and his Father (Darren McGavin). As the story progresses, Ralphie tries to convince the adults in his life that  a ` Genuine Red Ryder 200 Shot Carbine Action Air Rifle,' would be a good choice as a Christmas gift.  He leaves advertisements in his mother's magazine, he writes about why he wants it in a school assignment about \" What I Want for Christmas\". He even asks the head honcho, Santa Clause. They all respond with the classic phrase,  `You'll shoot your Eye out.' Ralphie is let down by this  but he does not give up.This story is not only about Ralphie's quest for a BB gun, it also is a story about Ralphie's childhood n the 1940's. Like any other movie told from a child's perspective, there is some kind of school or neighborhood bully, who picks on others as well as the main character.  This movie would not be the same with out Scut Farcus, a tall nasty looking green/yellow toothed kid. (probably twelve or thirteen) and who could forget a trusty sidekick named Grover Dill.  Ralphie and his friends are afraid of Scut and try to avoid him as much as possible. These emotions build up in Ralphie until one day, he can take it no longer, his anger gets the best of him, and he beats up Scut Farcus.  All the neighborhood kids gather around to watch the fight which came to be known as the Scot Farcus affair. Although Ralphie was worried that he would get not trouble as a result of this fight, he soon forgot about this as he continued tot think of ways to get what he wanted for Christmas.We are also introduced to Ralphie's parents and brother. like.  Any film of the forties can't be complete with out the house wife/ mother.  Melinda Dillon acts, and looks like the typical house wife of the forties who cares for her family. Ralphie's dad, who is refrred to as `the old man',  is somewhat crabby, but for the most part he is a very likable character. He likes to enetr contests and eventually wins a `major award' which turns out to be a sexy leg lamp. The `Old Man has a tendency to use bad language, however, when Ralphie starts to use some of these words, he is punished by having his mouth washed out with Life Boy Soap. . Jean Shepherd's narration, and Peter Billingsley's portrayal of Ralphie make it seem as though the two really grew up in the forties.  From the way he dresses to the way he acts, Peter does a great job acting out Ralphie's part.  The same goes with Jean Shepherd.  Although he is not acting, just narrating, he describes Ralphie's childhood so well that it almost seems as though we are growing up with him. Similarly, the supporting actors and actresses, Melinda Dillon, Darren McGavin, Ian Petrella and Ralphie's friends, Schwartz and Flick who are played by Scott Schwartz and RD Robb, add a lot of humor to the story.The reviewer would rate this movie a six out of five star rating.  No matter what happens in the movie it manages to have a great plot.  Ladies and Gentlemen.  Make room for this movie on your video or DVD rack at home!",
    "62": "A Christmas Story has gained quite a cult following over the years. Released back in 1983, it failed miserably at the box office. Years later, it has become one of the most beloved Christmas films of all time.The story revolves around a boy named Ralph who wants nothing more than a Red Ryder BB Gun for a Christmas gift. Over the course of the film he receives opposition from his mother claiming, \"You'll shoot your eye out\"! Poor Ralph. He also meets resistance from his teacher, Ms. Shields and a very nasty store department Santa Claus.I enjoy watching Christmas Story every year. The film never gets old and even though you can catch it being played for 24 hours on TNT, it never fails. This is one Christmas film that lives on forever in our hearts.",
    "63": "Peter Billingsley, Darren McGavin, Melinda Dillon, Ian Petrella, Scott Schwartz and Zack Ward star in this 1983 comedy based on Jean Shepherd's novel, \"In God We Trust, All Others Pay Cash.\" This takes place in the 1940's and focuses on young kid, Ralph Parker (Billingsley) who lives with his parents (McGavin and Dillon) and little brother, Randy (Petrella). Ralph wants a Red Ryder BB gun for Christmas, but faces some obstacles before receiving it like dealing with bully, Scut Farkus (Ward) who loves tormenting him and his friends. Schwartz (The Toy) plays Ralph's friend, Flick and the late, Shepherd not only narrates as adult Ralph, but appears as a shopper. I've always liked this film and watch it every year when it comes on TV. Billingsley & the cast are great and I recommend this Christmas classic.",
    "64": "Title says it all. Every year I watch the first showing on TBS. just finished this years annual ritual and it's as good as ever. Can't wait to watch it again in 365 days.",
    "65": "A Christmas Story is a very sweet and funny movie, perfect to watch during the holidays. It's so popular with some of my friends they watch it every Christmas season. The movie takes place in the 1940's in the Midwest. Young Ralphie dreams of getting a BB gun for Christmas. He lives with his parents (Melinda Dillon and Darren McGavin) and little brother. The movie is full of funny scenes including the local bully, the frozen tongue on the flagpole, the trip to see Santa Claus at the department store, the father's \"major award\" and more. Darren McGavin, who made his career in television, is hysterical as the gruff father. Melinda Dillon is good as the doting mother. Peter Billingsley plays a great Ralphie. Kids and parents will like this movie.",
    "66": "This first time I watched this movie, I remember telling a friend he had to see it, that he was guaranteed to laugh. He didn't. It was an early lesson in the subjective nature of humor. But nearly 40 years later, I still feel like it would be almost impossible for anyone not to enjoy this movie. It defines the Christmas season--how can you not watch it sometime in December? This might be the best example of narration NOT ruining a movie. For me, it brings back feelings of childhood and nostalgia, even though I'm not from it's era. It just gets so many things right.",
    "67": "This manages to create nostalgia for a time and place I never lived in, despite seeing some similarities for the era I did. I can only imagine what it's like for those that lived it. It's quaint and simple, about kids experiences and that's why it works, because the feelings are universal enough to last despite the times changing.",
    "68": "Probably the best Christmas movie ever. It is watched in my house at least a dozen times during the season. Side note my wife got me the Red Ryder bb gun. I have not shot my eye out...yet.",
    "69": "This isn't the BEST Christmas movie I've seen but I can't deny its significance that many give it. Really hilarious moments throughout the film! I feel like it's also one of those movies that you have to watch repeatedly to pick up on new things too, which can be a good thing! Takes me back to when I was a kid at Christmas time!",
    "70": "While dozens of Christmas films roll off the production line every year, very few manage to capture the festive season, and the audience's hearts, quite like 'A Christmas Story'. This 80s classic is a real crowd-pleaser, a film that can be enjoyed by anyone regardless of age or film taste, which explains its continued popularity with TV networks.Ralphie is a character we can all relate to, because we were all that kid a Christmas once. The film gets his character spot on and the events that take place in the film will bring back a lot of memories for the average viewer. For such a shallow storyline the film provides so much enjoyment and, although there are other films I would rather watch over the festive season than this one, it remains a classic to this day and will always be up there as one of the Christmas greats.",
    "71": "I'm 41 years old and I've seen this movie every Christmas since i was 4 years old. Gets better every time i watch it. And it brings back memories of me and my brother being locked in our room on Christmas Eve while our parents wrapped presents. We had rabbit ears on our old tv and this was on 24 hours so we watched it over and over. It's still a Christmas tradition today with my kids.",
    "72": "I have tried to watch the movie at least half a dozen times and can never get more then halfway through it.Some people think this is required watching during the Christmas Hoilday season.It has been said it is a reflection on our childhood wants for that certain Christmas present.Well I was never a big believer in the commericalism of all Holidays.The lowest rating here is 1 awful well if I could I would say it is a negative 10 But if others think it is good that's okay just don't expect me to agree with you on it It's a wonderful life is still my all time favorite Christmas story.",
    "73": "A christmas story is my all time favorite christmas movie. Nostalgic, heartwarming, hilarious, and sentimential. Its a movie i can never get tired of watching no matter how many times i watch it. If you havent seen it yet highly recommend checking it out.",
    "74": "Best Christmas movie of all time! Darren McGavin was my father in this movie. Wonderful cast and wonderfully made. Can watch it over and over again. \"You'll shoot your eye out!\"",
    "75": "One of those movies that makes you relive your own childhood memories in your head. Looking back at them almost feel like a movie you saw a very long time ago. I thought it was very clever that the adult version of himself was narrating his childhood. That makes the movie likable both for adults and kids.It's about a kid named Ralphie wanting a BB gun for Christmas and his awkward interactions with his friends and family.",
    "76": "This film was probably the last time anyone's made a decent Christmas movie, although The Ref might have a decent claim to that. Since A Christmas Story, there hasn't been anything that even comes close to comparing to the overall sweetness or it's message of Christmas cheer.Perhaps the funniest sequence was the dinner in the Chinese restaurant towards the end. When I first watched it I couldn't figure out if the mother was laughing or crying, but her reactions to the duck were priceless. Other highlights are the gibberish that was supposed to represent profanity (my sisters and I still laugh ourselves into hernias watching that part since it's exactly like our father), Ralphie's everyday interactions with family, friends, bullies, and school, the actual Christmas Day hilarity (the bunny suit!)...oh, why beat around the bush? It's all great fun to watch.Obviously set in the mid 20th century, it may appear dated but the messages and situations are actually timeless. Peter Billingsley played the part of Ralphie to perfection. Darrin McGavin and Melinda Dillon were perfectly cast as his parents. There isn't a wasted performance in the film. If you only see one Christmas film a year, A Christmas Story is not one anyone would ever blame you for choosing. It's a sweet, timeless classic that belongs in anyone's collection.",
    "77": "This movie is a story of an elfin Drew Carrey look-a-like who wants a BB gun for Christmas. The kid is a an obnoxious brat but his home-life is less than ideal. The father was a drunken profanity-spewing lout, the mother was a lack-wit, and the child a nine-year old boy, is forced to wear a pink bunny costume sent by his grandmother. This is not even counting the bloody fights the kid getting stuck to the street-lamp, or tour main character getting using profanity and then laying the blame on an innocent classmate. What holiday joy, and now it's on a twenty-four hour loop on TBS, and people wonder why i drink over the holidays. The movie was shown in my high school before Christmas break, and I always hated to watch it. Honestly I'd rather take mid-term exams than watch this movie. I was good on exams, but instead of taking the exams at the prescribed time, our teacher,who was generally a good guy, had us take our exams early(over a couple of days) so that we could watch this depressing waste of celluloid. All in all though I'd rather take a mid-term, have a root canal or bang my head against a tree than watch this horrid movie.",
    "78": "I didn't grow up in a bubble. I was exposed to television and movies before I can even remember.Being born in the early 1970's, holiday movies were a tradition in my house. Those movies included \"Miracle on 34th Street\" and \"White Christmas\". I was later exposed to classics like \"A Christmas Carol\" with the great Alistair Sim and \"It's a Wonderful Life\" with the legendary Jimmy Stewart.With that said, I NEVER recall the release of \"A Christmas Story\" back in 1983. If it had some charm or significance, I don't recall hearing a word about it. The first time I became even AWARE of the existence of the film was when TBS first aired it in 1996 -- FOR 24 CONSECUTIVE HOURS! I sat and tried to watch this movie with an open mind, and it quickly became obvious to me why I'd never heard of this movie until 1996. Apart from Darrin McGavin, there was no redeeming element to this sad, depressing tale that is the poorest representation of a Christmas film that I've ever had the displeasure of viewing.And yet TBS continues its yearly tactic of forcing this overrated, offensive and insulting attempt of a movie on the general public for 24 hours every year (And it appears willing to do so for the REST of the ETERNITY). I've said it before on other movie boards: NO MOVIE deserves this much exposure. Not Casablanca, not Citizen Kane, not the Wizard of Oz. NO MOVIE! I'm sure Jean Shepard is a nice guy, and I guess I SHOULD be a fan of the movie because it's based on HIS experiences as a child growing up in Hammond, Indiana -- just a 10 minute drive from where I grew up.But how does a movie that had very little commercial or critical success become this must-see holiday movie, which has cheapened the classics that have come to define a TRUE holiday movie? It remains a mystery to me.What's even more of a mystery is how film critic Leonard Maltin, whose reviews I generally agree with, would be so duped by recent public appeal of the film (Obviously brought on by TBS's continually yearly tactics) that he would change his rating of the film from 3 1/2 stars to four. And yet he continues to keep The Shawshank Redemption at 2 1/2 stars, despite the fact that public appeal for the movie is GREAT and is the most popular movie on the IMDb! The plot, while based on Shepard's experiences, is TERRIBLY over dramatized (I have a HARD time believing Santa booting children down a slide) and has little charm. It's a painful day-by-day dirge through the depressing life of the Parker family around Christmas time and Ralphie's crusade of convincing EVERYONE that he wants a Red Ryder BB gun as a Christmas present. As far as I'm concerned, NOT getting the gun would have been the ONLY thing to redeem the predictable, contrived plot.Another reason why this movie does not hit home with me is that it lacks a relative message related to Christmas! The essence of Christmas can be defined in the story of redemption (Which movies like A Christmas Carol, Miracle on 34th Street and It's a Wonderful Life beautifully embody). Some might argue receiving a present could be considered a form of redemption, but that would be a pretty SHALLOW example of the word.I guess, in the end, the yearly tactics of TBS have fueled my fire as much as how I just find the movie depressing and offensive. I know many will disagree with my review. But I prefer the aforementioned Christmas Classics, and I'm very happy with that! A Christmas Story, however, remains the most OVERRATED movie EVER!",
    "79": "I must have seen this movie in the late 80s as a kid (born in 82). I had vivid memories of Santa kicking ralphitralphiehe slide and the other kid getting his tongue stuck to the pole. And that was it.\nIt wasn't until a few days ago, fast forward to December 2020 and I saw an Instagram post about this movie and realised this was the movie that was stuck in the back of my head for over 30 years.I rented a digital copy and sat down and watched it that night.This movie stirs up so much nostalgia, even for me born decades after this movie was set. Though I think growing up in the early 80s is closer to the 40s or 50s than today possibly is lile for children.\nMy family had 1 tv, a stay at home mum, were fairly poor, walked to school, I had a younger brother and i definitely dreamed of getting one specific toy each Christmas. The super soaker 50 springs to mind one particular year.I think the Christmas message does come through in this film and its clear to me why this movie holds such a strong place to so many people especially the generationgenerations before mine. But I hope newer generations find something in this simple little story about growing up in hard times and figuring out the world and the people you look up to who you think have the world figured out. But even they really don't.I will add this to my list of end of year movies forever now and I'm so happy I rediscovered it after all these years.It's not a classic Christmas story like a christmas carol or its a wonderful life which are magical in their own rights. But a christmas movie paints a picture of a real Christmas lead up so many of us lived. Remembering back to being that age and having that expectation and wonderment for Christmas day. In its own way this movie is very touching and a nice coming of age story for ralphie.I'm so happy to hear that a channel in America plays this for 24 hours straight.",
    "80": "Traditions are not just there for the taking. They are acquired slowly,gradually. Like so much flotsam and jetsam picked up by the raging river currents, joining the flow permanently;as if always a part of it. As for so many of us, Christmas is THE Holiday, whether or not we follow the Christian way. It has in many places, like (chiefly)the United States, it is a Secular cause of Joy, Family Gatherings, good food and drink;all in addition to its original Religious Celebration.One tradition that we have picked up in recent years, and seems to be a true Yuletide \"Keeper\" is A Christmas STORY(MGM, 1983).The working of Author Jean Shepherd's written word into a living, breathing screen presentation is done smoothly and without a labored appearance. The bridging of the two media is accomplished in a most interesting manner, indeed.The feat is completed by using an Adult Voice Actor, portraying the grown-up counter part of 10 year old main character, Ralphie(Peter Billingsley). The selection of the Adult Actor to do the narration wasn't particular brilliant, yet was probably the best choice that could have been made in Author, Jean Shepherd, himself! Mr. Shepherd had a true talent in relating his story to us his audience. His talents make what is an experience that would be specific to a particular period,universally understood,showing its commonality with any person in any period.So, this Daisey Red Ryder BB Gun that's the \"Holy Grail\" to a kid of the 1940's. In the 1950's some item like the Remco Frogman or Hubley's \"Flip Special\"(THE RIFLEMAN'S Rifle) could be interchanged. \"It\" is whatever would be your Heart's Desire, and as such we know that these are universal feelings, common to all.Jean Shepherd has given us all a world from the view point of the Working Class(Prolitarate, Mr. Marx?), not from what all too many of us would label, \"Middle Class\"(Buorguesise, Mr. Engels?). This is a proper designation and carries with it no inherent shame. Depending on the situation and period, they might be called \"the Working Poor\", and again, no shame, no exaggeration-just the truth.So much of our popular fiction is generated by those with a truly \"Middle Class\" background and upbringing, that the pop culture dramatizations lack any common rooting in the work-a-day world.As for the movie A Christmas STORY, the story and treatment is well suited to the time of the year. We join the Parker Family in what is about an eternity before that year's Christmas, which would be about 3 months time to a kid, remember? We meet each family member, one by one and learn about them and their personalities,emotional connections and wants & needs.We have the Mother, Mrs. Parker(Melinda Dillon)the chief-cook-n-bottle washer. She is devoted to the Family, a \"regular Mom\", but possessing a brilliant intuitive knack for \"shifting gears\" when any of her 3 men needed her. 'The Old Man, Mr. Parker(Darren McGavin) is aloof of much going on around. Seemingly worn from his working man's world, he demonstrates a deep understanding and compassion. Somewhat self opinionated(who ain't?), he frets over off season Baseball News(\"...the White Sox traded Bullfrog!(Pitcher Bill \"Bullfrog\" Dietrich)How could they do that!\");and yet his instincts bring him to instant action to defend the wife and kids! And, lastly, Little Brother,Randy(Ian Petrella)is properly quiet, mysterious and secretive, just like a little kid.The cast is put through a number of trials and tribulations, that once again seem all too familiar. From the \"growing pains\" of using Adult 'R' rated language, to fretting about a disappointing school grade; all are universally difficult to deal with and emotionally draining. Our favourite ongoing 'situation' involves Ralphie & his friends, and their dealing with the Neighborhood Bully,Scut Farkas(Zack Ward),his 'Toady'. We see the torment that the kids suffer and the eventual and final ending of the situation! Author Jean Shepherd,Screenwriter Leigh Brown and Director Bob Clark, all did their best to not create, but re-created some beautiful moments, not only for the moment' but for always.",
    "81": "Honestly, I can't stand this movie.  I refuse to watch it.  And, as far as I know, I am the ONLY person in the entire world that hates it.  In my opinion, it's horrible. The acting is bad, the plot is bad.. every thing is bad.  Plus, the image of Santa they portray is traumatizing to little kids.  But, I'll stop ranting.  I just want to say that I hate this movie.  And I think I'm the only person that does.",
    "82": "It is with the utmost sadness that I have read that Bob Clark, the director who turned this little-film-that-could into a minor cult classic and annual television Christmas tradition, was killed in an automobile crash, along with his 22-year old son. The crash happened because the driver of the other automobile was under the influence of alcohol.It is my hope that if a 25th anniversary edition DVD is released in 2008, it will contain a fitting tribute to the life and career of Mr. Clark.R.I.P.Please, please DON'T DRINK AND DRIVE.",
    "83": "It is not funny. It is not clever. There's a single joke: \"You'll shoot your eye out.\" The kid is an abject moron. Come to think of it, if he still believes in Santa Claus yet sees fit to fire off guns, he probably would shoot his eye out. The characterizations of parents and teachers are paper-thin. And--given the over-the-top anti-xenophobia of The Left--how did the producers get away with this tawdry notion of \"humor\" that has Chinese waiters singing \"Deck ze harrs wiss bows of horry\"?",
    "84": "This was really fun Christmas movie to watch, Every enjoyable for the whole family.Kids what something for Christmas, he tries think of aftermath of what he might think will happen after, he try really hard.This was great movie, I loved how the movie flowed really well, mix with bits of Drama and lots of very funny scenes both for Kids and Adults.I loved the older voice over thing was really nice touch on movie, it fits in perfectly.A perfect ending to really great Christmas movie 9 out of 10",
    "85": "Spoilers herein.Something cannot be funny if it doesn't engage.Back before Garrison Keillor, we had Jean Shepherd telling us stories over the radio. There is no storytelling like that on the radio: with reading, you work with the writer to create worlds, but with radio the writer also acts as a tractor to pull you through those worlds. There is nothing at all like radio narrative: your imagination is unconstrained, but the shape of the narrative thread is wholly out of your control.Garrison's innovation is to interest by opportunistic rambles, where each threaded episode is unresolved and arbitrarily leads to another. This works because we are charmed with the randomness but not unsettled because the settings and characters recur as familiar touchstones. The comfort of the characters and puerile moral offsets the novel narrative construction.But before that, we had a greater craftsman who resembled this only in the episodic constructions. Shepherd's novelty was to ramble but instead of a focus on making the characters and situations familiar (though they were), he focused on the connections. These connections are unlike anything I have experienced in radio or film: they are the kind of switches in subject you make in daydreaming that you cannot retrace or logically understand but which you know constitute who you really are.This is abstract, which is essential for humor, but it is as intimately engaging as you can get, which is why it can be so damned funny.Film merely adds pictures to this mix and takes most of the mechanics away from our much funnier imagination. The kid makes this work as a comedy, but not in the way that Shepherd was strong. And the screenwriter has rearranged things to take away the unlikely connections. I thought this was funny, but if you want genius storytelling, get some old Shepherd tapes.",
    "86": "\"You'll shoot your eye out!\" \"I tripple dog dare you!\" Oh Fud-ge\"(Or f*ck). Those are just some of the classic moments in Bob Clark's A Christmas story, my favorite Christmas film and one of my favorites of all time. What's weird is that this is from the guy who directed Porkys. A Christmas story is fantastic comedic entertainment with a ton of memorable things including Ralphie's father's lamp, well I don't want to spoil the fun for you. If you haven't ever seen A Christmas story(I hope everyone has but if you haven't speak now) because it's funny, cute, and a classic. Peter Billingsly is still acting today folks, just so you know. Not only is he acting, he's producing films and directing a new film with Vince Vaughn called Couples Retreat. A Christmas story is so funny and it's no surprise that it's a classic. Because it is. I give A Christmas story a huge thumbs up and if you haven't seen it I highly recommend that you do see it. Because it's just so funny.A Christmas story: ****/****",
    "87": "I don't just mean bad, I mean impressively, surprisingly, stupendously, monumentally, horrendously awful.The people who told me this was a Christmas classic... I wonder when the last time they saw it and paid attention was. This movie sits atop a lofty reputation, which is all that it has in its favor. What is the case for this being a good film?No character is likable. In any scene when the main character is with one of his friends from school, that scene ends with one of them being abandoned by their \"friends\" to a horrible fate of some kind alone, bullies, frozen tongues, etc.The younger brother lives under the sink and is only able to eat his food when his mom tells him to act like a pig, which he does for a really, really long time (editing, anyone?)in disgusting, glorious detail. Probably that kid grows up to be a serial killer. Mom pulls little Ralphie off a kid whose nose he has just broken, and without waiting to find out what happened, leaves the other kid there lying in the snow, bleeding. Covered in blood. Really, the blood is all over his face.Dad is a more endearing character because he is bumbling and likes to drop the f-bomb around his little kids at home while he leaves the parenting to mom. And now I will anticipate a response in the defense: \"but that's how things were.\" I hope life at the time was better. This movie celebrates mediocrity. The whole goal of it is to connect to Americans because \"these things really happened to people.\" There were bullies! There were teachers, and -GASP- pranks! There were trips to the shopping mall! Creepy elves and Santas! Dorky kids who constantly wore repulsive sweaters! Dogs stole the turkey! STOP THE PRESSES. THERE WERE PINK BUNNY SUITS.Is that really funny? No episode or moment of the movie is really any more than mediocre, the humor is pedestrian at its best moments, and the movie just isn't ever remotely interesting.I didn't know whether to be more disturbed by Ralphie's fantasy about shooting imaginary black people trying to rob his house or by the \"amusement\" created by Chinese people trying to speak English; perhaps in the end it was the simple fact that all of the terrible stock characters and pedestrian humor and mediocrity and cheesy voice-overs and all the rest of it were structured around a boy's desire to get a gun for Christmas. Which he did.",
    "88": "A Christmas Story (1983- Directed by Bob Clark) And you thought I couldn't recommend a more current movie? Tell me, how current are the eighties anyway? Why the eighties only started a mere twenty odd years ago.  Anyway, you know the movie at least is set in the 1940s! Our hero, twelve year old Ralphie (Peter Billingsley) has to convince his parents (Darren MGavin and Melinda Dillon) that a Red Ryder BB gun would be the most perfect gift he could possibly receive for Christmas.  Therein lies the catalyst for some pretty amazing antics & side splitting events that befall our hero.  No song and dance routines. No heavy MGM schmaltz. Just a simple tale of a twelve year old hoping and wishing and scheming his way into a Red Ryder BB gun makes this movie a real family classic.  It will bring back a lot of your own Christmas memories and that elusive gift you always wanted and waited forever to receive.",
    "89": "When this movie first came out 35 years ago, it was a modest hit at the box office before becoming more popular when it hit home video and later on HBO before heading to broadcast TV and then streaming and dvd and bluray, becoming the most played holiday movie of all time to this day. Even though this movie was made in 1983, it takes place to the the 1940's, an era before TV and when christmas started to become more commercial. The movie tells the story of Ralphie (Peter Billingsley), who narrates his childhood as he's on a quest to get a red ryder BB gun for the holidays. Hilariousness ensues. You know the rest.",
    "90": "As you know by now, I did not like this movie at all. My sisters seems to like it but I don't and here's why.The main character Ralphie whines and complains alot. His brother Randy is ever worse, whining and complaining non-stop. The kids at school also whine which was torture to listen to.This story makes absolutely no sense, why is Ralph wanting a BB gun. Of course times were different in the 1940s. But I was born in the 1980s so I don't understand this movie and the setting.So Raphie has daydreams of shooting robbers, going blind with a cane, getting an A+ in class but gets a C+ instead. Okay.Raphie uses profanity including the word Fudge. Also I didn't like the scene where the kid sticks his tongue on a pole. I wasn't even laughing and I thought it was very painful and torture to watch. I didn't like it they forced Ralphie to wear a pink bunny suit which bothered me a lot.Raphie gets attacked by school bullies and then finally retaliates against them which scared me very badly. The worst part about this movie was everybody telling him \"You'll shoot your eye out.\" including the creepy Santa Claus, Seriously just show him how to use the BB gun safely.The only good scenes in the movie is Raphie's dad fixing the furnace himself yelling and swearing and fixing the flat tire. I find it weird his dad buys a sexy leg lamp but whatever.To the TV channel companies, if you're reading my review please take this crummy Christmas movie off the air, I don't want it on TV anymore. Show better Christmas movies. Speaking of which.There are much better Christmas movies to watch. including It's a Wonderful Life, A Christmas Carol, Miracle on 34th Street both the original 1947 and the 1993 remake. Also watch Home Alone 1,2,3. Also Santa Clause by Tim Allen was funny. Also Jingle All the Way 1 and 2 was funny.The sequel to A Christmas Story 2 was not as bad as the first movie. Watch that movie sequel instead and forget that this original movie ever existed. Or better yet watch \"Santa Claus conquers the martians\".",
    "91": "Nostalgic tale of a Ralphie Parker (Peter Billingsley) growing up in the 1940s (I believe). He wants nothing more than a Red Ryder Ranger Model Air Rifle (a BB gun for short) for Christmas but everyone tells him it will \"shoot your eye out\".That's about it for plot but the film has sequences that every child (and adult) can relate to. My favorites: Ralphie's best friend getting his tongue stuck to a pole when he's dared to lick it; Ralphie accidentally swearing in front of his father; the bully that threatens Ralphie and his friends every day until Ralphie beats him up (in a GREAT scene); Ralphie's constant fights with his little brother (wonderfully played by Ian Petrella) and Billingsley and his brother being terrified by a department store Santa.Also Melinda Dillon and Darren McGavin are just great as the parents-- especially Dillon. She has one uproarious scene where she gets Petrella to eat by imitating a pig! This was totally ignored when it came out in 1983 but has slowly developed a cult following. It's now considered one of the best Christmas movies ever made--right up there with \"It's a Wonderful Life\" (which was also ignored at its release).A charming, wonderful Christmas film. A 10 all the way!",
    "92": "A Christmas Story, there is absolutely no way that anyone could ever say they never saw this film since it's shown every Christmas, especially on TNT when they do the 24 hours of A Christmas Story, lol. But onto the movie, I've watched A Christmas Story since the day I was born, it's one of those films you never get sick of because of the simple fact that each year of your life you could relate to it in some way. Each character has these memorable moments and you could say that you've been in the same situation. It's great seeing this movie because it makes us laugh about the silliest moments in our life during the Christmas season.Ralphie is a little boy who just so badly wants a B.B. gun for Christmas, it's just his dream. Only one problem, it'll shoot his eye out according to the adults around him. We go through Christmas with Ralphie and his family, his father who is obsessed with a prize leg lamp he won. His mother who is greatly under-appreciated but extremely loving. His brother, Randy, who is your typical silly and annoying younger brother who makes fun of him. And his friends who are on a constant run from the school bully. But all Ralphie can think about during this hard time in his adolescence is that B.B. gun.A Christmas Story has constant unforgettable scenes, like the pink bunny out fit that Ralphie gets as a present from his aunt, him saying his first swear in front of his dad, Mom and Dad's fight over using the glue on purpose, visiting Santa at the mall, and of course that great ending that is sure to bring a that is sure to bring a tear to your eye. It's just the perfect Christmas movie that is a BIG recommendation for the season. It has great comedy, terrific acting, and just the most touching moments you'll ever see in a Christmas movie.10/10",
    "93": "A Christmas Story touches my heart as does no other film, and I know the reason for this is because it reminds me so much of my own 1950's boyhood. For sure it strikes a nerve in persons of my generation. This is Bob Clark's masterpiece and I know I am not the only person who feels this way. I am going to assume that, if you are reading this, chances are you have seen the film; indeed, probably have seen it countless times as I have. This is not a film review in the normal sense. It is more a reminiscence and appreciation of a great story captured for all time in moving pictures which, in turn, captured the essence of the time and place of its setting; that time and setting being a typical town in Indiana during Christmas season in the 1940s as we observe a typical family (the Parkers) with two young sons named Ralphie and Randy. Most of us over the age of 50 can relate very well to the story's key elements. I recall vividly family outings to crowded downtown sidewalks, Mom and Dad squeezing in a season's worth of shopping in one day and doing it under the nose of one who had a visit to Santa Claus on his mind. Staring at the prominent HIGBEES sign in the downtown square, I could almost see the words John A. Brown in its place. Browns was the main department store in my hometown of Oklahoma City and the place where I would make my annual visit with Santa Claus.I am sure most who have seen the film realize this is Ralphie's story, but Melinda Dillon as the typical 1940's stay-at-home mom and Darren McGavin as the grumpy but kindly father made the story work. The stove in the Parker's kitchen reminds much of the one my grandmother had, and the rest of the house reminded me of the home my other grandparents lived in. As you see, viewing A Christmas Story is always a magical experience for me. It is almost as if Mr. Clark made this film with Tom Fowler in mind. There are so many comments to make. It will be impossible to relate them all in a short review, but here are some that I know people my age will be most familiar with:Beautiful toys displayed in department store windows. The agonizingly long wait for toys ordered via mail and learning too late they are not quite what was expected. The excitement of buying a Christmas tree, the joy of setting it up and how much bigger Christmas trees seemed then. Neighborhood bullies who were not nearly as tough as they seemed. Ralphie wanting a BB gun more than life itself. Mom covering trouble for Ralphie to his dad, and the same mom making him eat soap for uttering words -- learned from Dad. Randy sitting underneath the kitchen sink when depressed. A panicky visit to a tired Santa. An unwanted gift from a well-meaning aunt. The furious unwrapping of gifts on Christmas morning. I could go on and on. I will make two more observations and then will sign off and let somebody else speak.In the film's sweetest scene, we see Dad coming through for his son at the last possible moment. To see the look on young Ralphie's (ably played by Peter Billingsley) face as he unwraps his best and last gift is one of filmdom's true golden moments. But, for me the best moment was the last. Ralphie is in bed at film's end. We see snow outside and Ralphie dreaming of his wonderful gift, as the story's author and narrator Jean Shepherd, speaking as the grown up Ralphie, realizes this was the best Christmas he ever had, or ever would have.If you are middle age or older and have not seen A Christmas Story, you are perhaps unaware that you have cheated yourself. Buy or rent the 2003 20th anniversary DVD. It will be the best money you spend this Christmas -- or any Christmas.",
    "94": "\"A Christmas Story\" is a rare film about children yet for adults.  While kids will definitely enjoy this Christmas-themed saga, adults will find a deeper level of depth than they may remember from seeing the film at a younger age.The movie strikes a sharp contrast between the exaggerated, polysyllabic narration of Ralphie, filled with nostalgia and lucid memories, and the soft, high-pitched childlike wonder of Ralphie's spoken word.  The narrator is clearly not the same character as the one portrayed on film, but a character wholly outside the story, reliving his childhood emotions and anecdotes.  Yet he is the heart of the film, the true center of gravity. This is because the movie is not about a scary Santa Clause and a BB gun - it's about childhood memories and the feelings they evoke.  To that end, \"A Christmas Story\" is flawless.\"A Christmas Story\" tells of the epically materialistic journey of Ralphie (Peter Billingsley) as he searches for the golden, upheld idol of all red-blooded American boys:  A Red Rider Air Rifle.  Ralphie spins an intricate web of cunning and deceit as he plots to get his hands on it - including an essay, a trip to Santa Claus and more.  The movie also shows us a glimpse of his family - his irritable, foul-mouthed father with a good heart, his whiny brother Randy, and his sweet, all-American mother.  It is not so much a continuous story as a series of vignettes, but it ultimately serves the movie's purpose.This is a funny film.  The narration by Jean Shepherd is filled with love for this story.  He absolutely captures the emotions and logic of childhood. In a subtle but amusing moment, Shepherd intones the incomparably eloquent pouring forth of thought into writing - only to have Billingsley note in his awe-filled, high-pitched voice that \"I think everyone should have a Red Rider BB gun.  It's very good for Christmas.\" (paraphrased).  Most of the humor is similar - the natural exaggeration of a child as expressed by Shepherd's consistent string of hyperbole.Also, there's a reason why it's played constantly on cable TV throughout the Christmas season - it's a movie everyone can relate to.  There are moments of such pure truth here that few can deny their power.  I'm sure that there is a scientific law left unwritten that determines that every kid must at some point fantasize about his parents feeling absolutely terrible and forever regretting some unutterable punishment they inflicted on their child - in this case, the immortal washing of a mouth out with soap.Obviously, \"A Christmas Story\" is not a film that can be compared to Casablanca or Citizen Kane.  It simply excels at its simple goals, and comes together as an extraordinarily entertaining piece of cinema.",
    "95": "The 1983 \"Terms of Endearment\" won the Academy Award for Best Picture. Now it was deserved. The film still remains popular today. What's hard to believe now is that \"A Christmas Story\" (released the same year) was ignored everywhere. If anything it should of been nominated for best adapted screenplay!Now when the film was released it was \"Critically Acclaimed\" but, MGM failed to capitalized on that. The film was poorly handled & failed to capture a large theatrical audience!Well thanks to the Home Video Market & television this film has now become part of Americana. It also helped that Ted Turner made \"24 Hours Of A Christmas Story\" an annual event.It is now 2017, and \"A Christmas Story\" it is now one of the most popular films of all time. Even \"Return of the Jedi\" ( The Highest Grossing Film of 1983) \"Isn't gaining as many new fans\". .\"Return of the Jedi\" has always rode the coattails of the earlier \"Star Wars\" films. \"A Christmas Story\" has gained fans for just being a great film!Now my review\nSet in the 1940's the film makes you identify with Ralphie and you your routing for him in every single way!Ralphie is in elementary school. His has a little brother and all he wants for Christmas is a BB-Gun. He wants this more than anything. Before Christmas gets there he has many obstacles to overcome. One of them is getting home! He & his friends are always being bullied before they can make it home. The film is flawless. It is a joy to watch and only improves every time you watch it. It is also true that for some reason the older it gets the better it becomes! You need to see this. Also there is a fan made documentary called \"A Christmas Story Documentary: Road Trip for Ralphie\". That is a great fan made documentary.",
    "96": "How difficult is it to perfectly capture nostalgia? It must be pretty darn difficult or else everyone would make movies like this. It may not be absolute perfection but Jean Shepherd, Bob Clark and the outstanding cast came as close as anyone here.Creating a story centered around nostalgia is a tricky thing as the memories that creates it are unique to each of us. The themes, however, are similar and that's where the success lies.I didn't want a Red Ryder BB gun when I was that age but my Christmas wish was just as fervent and I schemed just as hard as Ralphie. The bully at my school didn't have yellow eyes but he was pretty much like Scut Farkus. And so on, from the fantastically flawed parents to the pop-heroes, A Christmas Story captures it all.Truly wonderful.",
    "97": "I lived the life of Ralphie!  Even though I'm a girl and was born in the late seventies, my Christmases were much the same as Ralphie's. From playing Santa on Christmas morning to sipping my Dad's Christmas cocktail to visiting Santa at the department store, I lived the very same Christmas memories.  This movie brings out the true essence of Christmas happiness.  Everyone, young and old, can relive the magic of being a child.Ralphie's vibrant imagination and inventiveness in his ploys to seduce his parents into buying him the ultimate gift are \"pinch-his-chubby-cheeks\" adorable.  And Randy...need I say anything??  He is the perfect picture of the baby brother!This movie is universal in its appeal to audiences of all ages, race, and nationalities.  My husband, who grew up in Lebanon and who's first language is Arabic, even knew the famous \"oh fudge\" line when I first played this movie for him here in the States.I get giddy every time I sit down to watch this movie.  Curling up with a warm cup of cider in front of the fireplace, wrapping Christmas presents, making Christmas cookies, or writing a letter to Santa Claus...those are all perfect times to watch this classic family film.  This has been and always will be my all-time favorite Christmas film.",
    "98": "A Christmas story is a classic holiday film that is very funny and entertaining. This is a movie that should be viewed by everyone, and   can been seen on television during thanksgiving and Christmas time. In most families, this film is already a tradition to watch every year and that's because it has a wonderful plot, great characters and believable actors. \nA Christmas Story is about an average middle class family living in a small town in the 1940's. The film contains an average family of a regular husband and wife relationship and two young boys. The eldest of the boys is named Ralphie (Peter Billingsley) who is the star of the film. All that Ralphie wants is to have a perfect Christmas containing the perfect gift, a Red Ryder carbon action BB gun. This is all that Ralphie can think about day and night. When Ralphie has to write a Theme about what he wants for Christmas, his teacher replies to him `you'll shoot your eye out' which seems to be the only reply to him throughout the whole film.What makes this film so great is the ability to relate to Ralphie with his problems throughout the movie, such as wanting that one gift that everyone thinks that you're too young to have and are unable to get. The acting is very convincing and makes you think that this could even be you in the movie. There are some very hilarious parts in this film that also make it very good. This particular scene also contains some very cheesy acting which also makes it funny. Ralphie has a dream about getting his Red Ryder BB gun and saving his family from a bunch of evil villains. In this scene Ralphie is wearing the white sparkly cowboy suit and he shoots down the evil villains and saves the day with his gun in a very unrealistic way.\nThere really wasn't much music that can be commented on in this movie,  just that it was the orchestral type of music that was out in the time period  of the 40's. The costumes where great and convincing. I also liked how real they made the 40's look. You actually think it might have been made in that time period which makes the film very authentic.  I would recommend this film to anyone who wants some holiday laughs and some great family time together. I would rate this film a 9 out of ten because it's so memorable.",
    "99": "This is one of, if not THE most iconic Christmas movies of all time. If you have never heard of this movie or heard people quote it or reference the scenes, you live in a cave. And if you DO live in a cave, I question what reception you have to be able to read this review!Well, anyways, A Christmas Story is the classic movie about Ralphie, a 9 year old boy who wants one single thing for Christmas-a Red Ryder BB gun. But there is one obstacle, his mother, teacher, and even a department Santa all say it's a bad idea, because, quote: \"You'll shoot your eye out.\"When I was younger, my mother sheltered me from many different movies for religious reasons, examples being- No Harry Potter for witchcraft, and no Titanic for nudity and pre-marital sex. A Christmas Story was one of those forbidden films, for the gun part of the plot, and the swearing, and other aspects of the movie.However, I have seen it now-I was 12 when I saw it for the first time. If I had to guess, I have seen it about 7 times in full, and a few times in part on TV. And it's worth seeing that much, because of how fun and entertaining it is!I mentioned that this has many iconic scenes. Who doesn't know about Flick getting his tongue stuck on his pole? Or Ralphie getting soap in his mouth for saying the F word? Or the Dad's obsession with a sexy lamp? Then there's line's like: \"You'll shoot your eye out\", \"Oh, fudge\", and \"Fra-GEE-leh\" -It must be Italian!\"The acting is great too, and film buffs like myself can recognize other actors- Peter Billingsley is in Elf as the elf that tells Buddy that he's special and not a \"cotton headed ninny muggins.\" Darren McGavin, The Father(or \"The Old Man\" as Adult Ralphie calls him), is the Dad in Billy Madison as well. And for my final example- Melinda Dillion is the Mom in this and also E.T.TNT and TBS also have an annual tradition of playing this on Christmas Day 12 times in a row. I remember seeing in a documentary on TV that they actually offered to do that and that's how the movie's popularity grew. If you have never seen this movie, that's a great way to catch it, but stores are selling it now as well.All who see this should end up cherishing it. While I wouldn't show it to a very little kid, for kids maybe 9-10 and up and anyone older, this is a must watch for the holiday season!",
    "100": "What a wonderful movie! I didn't realise Bob Clark had a movie in him like this. In fact I had to double check that it was Bob Clark who directed this, because while Black Christmas was good, he also did the atrocious Baby Geniuses movies and the lacklustre Rhinestone. Here in A Christmas Story though, this is not only the best I've seen Clark direct but I think it is his best film too.I love Christmas movies, and while A Christmas Story is not my absolute favourite, I think it fully deserves its title as timeless Christmas treasure. The film looks great with the cinematography skillful and the locations striking. The script is always witty and insightful, I loved the home truths and the lack of smut and saccharin which may have marred the film slightly if included. The story is beautifully structured and an enormous joy all the same. The pace was spot on too, while the entire cast performed impeccably.In fact, everything I have to say about A Christmas Story is good. It could have been a little longer perhaps, but overall this film is a classic and never less than hugely enjoyable. 9.5/10 Bethany Cox",
    "101": "This odd little film has become the parallel-universe \"It's A Wonderful Life\" of our time. It brings up memories that many people can identify with - wanting - with all your heart - a toy that will \"shoot your eye out\", facing up to the school bully and then getting punished for being violent rather than being commended for courage, and for those of you up north, sticking your tongue on a frozen pole and getting stuck to it. This actually happened to my brother-in-law as a kid in Wisconsin.However, Ralphie, the child protagonist in our film, has a completely dysfunctional family. To be specific, he has a completely dysfunctional father. In the narration Ralphie never even calls him \"dad\" - he's just \"the old man\". \"The old man\" cares about nothing more than he cares for the tackiest of lamps that he received as an award that is made out of a mannequin's leg that he displays in a position of prominence in the living room. Ralphie's father is no George Bailey. If he got to see the world as it was if he never existed, no doubt the only noticeable difference would be that the tacky lamp would belong to someone else and Ralphie and his mother would be better off. The narration is wonderful as you see everything from a child's perspective, and if you remember your childhood at all, you can probably remember reasoning things out as Ralphie does. In Ralphie's world adults - including his parents - are the arbitrary givers of reward and punishment who all seem to be in odd and unreasoned alignment. These adults are mazes to be solved, not givers of lessons to be learned. However, as an adult, you'll see the humor in the situations too. Highly recommended.",
    "102": "\"A Christmas Story\" is without a doubt one of my favorite Christmas movies of all time! \"Home Alone\" was this close to be my number one favorite, but I don't need to compare the two of them because I love them both in each of their own. So, why is \"A Christmas Story\" my favorite? Here is why. \"A Christmas Story\" is being narrated by an adult Ralphie Parker as he tells his Christmas story, when he was nine years old. The movie takes place in the 40s as we see Ralphie in a young age as he comes across a Red Ryder BB gun, which he sees in his own eyes the \"Holy Grail\" of Christmas gifts. He has always been hoping to get it as a gift, but he keeps getting by others as they tell him with the same warning: \"You'll Shoot Your Eye Out.\" So that is what the premise of this movie is all about. However, we come across with a couple of subplots in the movie such as the Old Man winning a major award which it happens to be a lamp that is shape like a leg; then the Old Man has a major frustration on fixing the furnace; and Ralphie along with his brother and friends get bullied by Scut Farkus and Grover Dill. So, enough explaining on what the plot of the movie is, here is what I thought of this movie. I love \"A Christmas Story\" from beginning to end because this movie always makes me laugh, and I never get tired with these jokes. The cast were absolutely perfect, and I love them each of their own. Peter Billingsley is perfectly cast as the boy who dreams of the perfect Christmas gift. Melinda Dillion and Darren McGavin were perfect as the mother and father, and the rest of the cast were all great too. Bob Clark does an amazing job with this movie for working on the script and directing the movie. Jean Shepherd who also work on the script does a terrific job on the narration, which is what made the movie work. In case if you don't know, the movie is based on Shepherd's book \"In God We Trust: All Others Pay Cash.\" I know many of you would find this overrated that is either not funny, or just getting sick and tired of this movie that has to be shown on both TBS and TNT for showing it as a 24 hour marathon; if that is why, then I fully understand that. Heck, many other people might get sick of \"It's a Wonderful Life\" being shown on television, which is another movie that I also like. So, with that said, I can relate and identify with this movie because it is like anyone's fantasy dream on what gift do they wish for on Christmas; you can either wish for a pool table, a car, a flat screen TV, and whatever gifts that you want. So, that is why I love \"A Christmas Story\" and it will always be my favorite Christmas movie. Also, I can watch this anytime when it comes to Christmas. I give this movie a perfect 10 out of 10, and I wish you all a Merry Christmas!",
    "103": "I'm not sure why I waited this long to review such an excellent film. \"A Christmas Story\" (1983) is my second favorite holiday film, with \"It's A Wonderful Life\" (1946) taking first place. The movie is partially based on the absurdly funny memoirs of Jean Shepherd, specifically, from his 1966 novel \"In God We Trust: All Others Pay Cash.\" Shepherd's sarcastic imagery makes for a heck of a humorous book to read, and I strongly recommend it. However, the film is so much richer as Shepherd (the narrator) describes growing up in Indiana in 1939. It seems very probable that the 1988 television sitcom, \"The Wonder Years,\" borrowed quite a lot from Shepherd's writing and narration style.Let me set the record straight, although the title suggests as much, this isn't your typical Christmas movie. A Christmas Story is essentially one hour and thirty three minutes of a time and place in Indiana that no longer exists, all viewed through the eyes of a nine year old boy, Ralphie Parker. Ralphie has a lot on his mind, but it's not Christmas, school, or anything else. Indeed, his primary goal is to get his parents to buy him an \"official Red Ryder, carbine action, 200-shot, range model air rifle, with a compass in the stock and this thing that tells time\" for Christmas.Even though this film predates my own age and experiences, this period of the 1930s-1940s speaks to a much more innocent time than today. America's heroes then were cowboys and generals, not rock stars and astronauts. There was no Internet, indeed, there wasn't even television. Entertainment at home revolved around the radio, where kids and adults listened to programmed series like Little Orphan Annie who instructed her young audience to read her important messages on their Secret Decoder Rings.Fathers straightened their ties and grudgingly went off to work each morning while mothers stayed home, cooking, cleaning, frequently getting bored, but very likely worrying about how to manage a budget on so little income. In the next 45 years all of this changed, and stereotyped gender responsibilities were either reversed or eliminated, but in that particular window of time, this was a reflection of real life in America.The brilliant Director Bob Clarke had to tangle with Jean Shepherd constantly to get this movie made, but it doesn't show. The actors are so perfectly cast that it is impossible to imagine anyone else in their roles. The cast includes Peter Billingsley as Ralphie Parker, Jean Shepherd as adult Ralphie (the voice), Ian Petrella as Randy Parker, Melinda Dillion as Mrs. Parker, Darren McGavin as Mr. Parker, Scot Schwartz as Flick, and Zack Ward as Scut Farkus.No spoilers here as usual but I will reveal that the man standing in the Santa Claus line at Higbee's Department Store who tells Ralphie where the line begins is none other than Jean Shepherd himself!",
    "104": "So maybe I'm just an old out-of-touch crank. Everyone on IMDb loves this movie. My kids and their friends enjoyed it, and made me sit through it twice on two different Christmases.But I have to say it: I thought this movie was terrible. And I don't mean, \"Not as good as everyone says.\" I mean, if you tied me up and made me watch this movie again, inside of an hour I'd give you anything you wanted to let me go.Based on this film, the secret to creating a movie classic appears to be: Write a series of disjointed, semi-humorous vignettes about a group of largely unlikeable one-dimensional characters, hire a bunch of loud hammy over-actors to gesticulate wildly and shout most of their lines, narrate it with the most punchable voice I've ever heard, and tie it all very loosely to a Christmas theme.If your idea of a good time is watching some poor kid get his tongue stuck on a iced pole and getting it partially ripped open, or an obnoxious little kid repeatedly smash his face into a plate of food while snorting like a pig, or a loud buffoonish father threaten to forcibly cram the food down the kid's mouth, this may be the movie for you. And don't even get me started on the leg lamp.But do yourself a favor: Before you watch it, go to the Quotes section of the Christmas Story IMDb web site, and see if you find any of the quotes from this movie remotely witty or funny. I don't. But maybe you will.BOTTOM LINE: This movie couldn't decide if it wanted to be Prairie Home Companion or National Lampoon's Vacation, so it tried for a 50/50 mix. Apparently this was a winning formula. Just not for me.",
    "105": "Review:\n'A Christmas Story' is a Christmas comedy film directed by Bob Clark. It is based on Jean Shepherd's semi-fictional anecdotes in his 1966 book 'In God We Trust: All Others Pay Cash'.\nPossibly the most talked about Christmas movie in history. I just recently watched this movie with my family, and I've got to say, I loved every minute of it.\nThe comic mishaps and adventures of a young boy named Ralph, trying to convince his parents, teachers, and Santa that a Red Ryder B.B. gun really is the perfect Christmas gift for the 1940s.\nEverybody in the movie is on their A game and you can tell they were in it to win it. Melinda Dillon, Darren McGavin are great as Ralph parents. They played what parents would have been like in the 40's perfectly and Peter Billingsley is great as Ralph, a 8-year-old boy who is slowly starting to realize the meaning of life.\nI liked the story of a child talking about what he wants for Christmas and is on a personal mission for get it. In the film's sweetest scene, we see Dad coming through for his son at the last possible moment. To see the look on young Ralphie's face as he unwraps his best and last gift is one of filmdom's true golden moments.\nOverall, the movie lived up to expectations and then some. I can see why it's such a Christmas classic and am excited to view it again.\n5/5",
    "106": "I would never have known about \"A Christmas Story\" if not for the TBS Marathon. I never saw it at the show. Until then, I always thought \"Porky's\" was Bob Clark's best film. If Ted Turner hadn't preserved it, it probably wouldn't exist today. The film has its technical faults: 1. Wavy musical soundtrack. 2. Negative scratches and dust. 3. Video \"noise\" and tracking. (Maybe too much \"copyguard\"?) Even Clark couldn't recreate the special magic of this film. Two sequels, one by Clark himself, failed. A perfect ensemble cast and Darin McGavin's funniest role. Everything works: The locations, the nostalgic scenes, the narration. Today this film probably couldn't be \"made\" the same way. The \"Chinese restaurant Christmas Carol\", complete with terrible accents, would offend Asian people. (When it was remade as a 3 hour TV special, all the singers spoke perfect English and the headwaiter gave a broad \"wink\" to the audience.) So many (similar) memories: The house looks like my own childhood home. I had a yellow-haired bully at school. I used to play inside the kitchen cupboards. My school looked exactly like that. I got my mouth washed out with \"Fells-Naptha\" soap. The dept. store reminds me of the old downtown Detroit Hudson's store. The \"mean\" Santa reminds me that I was scared of Santa at first. I had 2 aunts that perpetually thought I was 4-years-old and bought me \"baby\" toys and clothes. (I hated clothing gifts anyway, and only wanted toys.) We constantly blew fuses as well in our under-wired house. I never got a BB gun because my mom KNEW I would \"shoot my eye out\" and target birds and squirrels. Too funny to watch only at Christmastime. Even though it was made in 1983, it \"feels\" like an older movie. Well done, Bob!",
    "107": "\"A Christmas Story\" is perfection at Christmastime. The nostalgic feel of early-1940s Americana at the year's most magical time could not have been more appropriately filmed by Bob Clark (\"Porky's). This excellent comedy proves how through the eyes of a 10-year-old child, hopes and dreams for the ultimate Christmas present can overcome neighborhood bullies, homework and even \"The Old Man\".I have watched this movie at least 30 times. Not just at Christmas but year-'round. It's just that perfect. Although I wasn't around, I would almost guarantee this is what my own father lived like during the time portrayed in this excellent movie. It makes me wish for a time machine to go back to this more innocent and simpler way of life.There is nothing I could add to what the other IMDb reviewers are saying on this site. Although the \"8\" score that this universally is receiving is still too low. Watch it every Christmas as a family tradition with hot chocolate, a roaring fire, snuggly blankets and sitting next to your Christmas tree. You will feel the warmth of family and laughter. This is an American treasure.",
    "108": "A Christmas Story (1983) is a movie in my DVD collection that I recently rewatched with my daughter. The storyline is a coming of age gem that takes place in the Cleveland, Ohio area where a blue collar family does their best to get by and teach their two boys about the meaning of Christmas and family. We follow the oldest boy as he goes to school and tries to influence his teachers and parents to achieve his desired outcomes and the depths he will go to accomplish his goals.This movie is directed by Bob Clark (Porky's) and stars Darren McGavin (Billy Madison), Peter Billingsley (Iron Man), Zack Ward (Freddy vs Jason), Melinda Dillon (Magnolia) and Scott Schwartz (the Toy).The storyline for this picture is perfectly narrated, told and paced. The events build-up beautifully throughout the movie and crescendo into a perfect conclusion. The dialogue and storytelling is wonderful and the acting and execution is perfect. There's a fun mix of coming of age and comedic elements. The various scenarios are excellent with many all time greats including the lamp leg, Santa's visit, flagpole tongue scene and constant bb gun references. This is pure cinematic gold.Overall this is one of the greatest Christmas movies ever made and an easy 10/10. This is a must see that I would strongly recommend.",
    "109": "A Christmas Story is the tale of Ralphy, who wants nothing more than a Red Ryder BB Gun for Christmas. It's a heartwarming holiday movie, as well as a great coming-of-age story.Peter Billingsly is adorable as Ralphy, the daydreaming, semi-good natured son of a foul-mouthed 'furnace fighter', a mother who does her best to keep her family in check, and older brother of the slightly infantile Randy. The movie follows a series of events leading up to December 25th, 1940. Ralphy has to deal with the neighbourhood bully, convincing his parents and teacher that a BB gun is a perfect gift, and finding acceptance for his own flaws. He swears, gets in fights and gets his friends in trouble, but his family forgives him. Each of the family members have their own flaws, but thats what makes them so endearing. The movie is narrated by Jean Shepherd, who also wrote the book about his own childhood. His hilarious exaggerations and insights are one of the best things about this movie.So what makes A Christmas Story so enjoyable? For one thing, it's absolutely hilarious and endlessly quotable. It's also very offbeat, with many of Ralphy's daydreams coming to life in bizarre ways. Being told from the perspective of a child looking back on his younger days gives the movie a sense of nostalgia, and because it's so memorable it's nostalgic to watch as well. To many people, this film has become as much a part of Christmas as Santa or presents. Personally I watch it every year, and it brings a smile to my face for a whole week afterwards. The house in the movie has even been re-opened for fans of the movie to walk through, and many of the cast members have re-united to visit it. This movie is love in it's purest form.Some of the movie's best moments are when it breaks away from the dreamlike bliss of the child's perspective, and gives us little pieces of reality: The mall Santa hating kids, Ralphy's decoder pin giving him a lousy commercial, and the present from Santa being from the father who had one when he was a kid. Maybe these are the truths about Christmas, and childhood itself: it is fleeting, flawed and illusory, but undeniably magical.",
    "110": "My God, how quickly time flies! \"A Christmas Story\" celebrates its 34th anniversary this year, which means that all the kids that fill the classroom or stuck their nose on the toy shop window, from Ralphie to his little brother Randy, are in their mid-forties, even that poor little Flick who stuck his ill-fated tongue on the pole (the film's defining image) will turn 50 the next year. And speaking for myself, it's been 24 years that I watched it (fittingly with my kid brother) on a Saturday afternoon and I remember we laughed, we laughed a lot. We weren't from the narrator's generation, but it didn't make it any less accessible or enjoyable. I guess this says a lot about the way the charm of \"A Christmas Story\" operates, it finds a voice that can speak to any child of any generation and any country, any adult too.Indeed, the age of the film doesn't matter actually, many movies are as old without being classics. Many movies dealt with Christmas with far richer and 'entertaining' plots without reaching that little sparkle of truth and wit. In fact, many movies featured kids that were far smarter than Ralphie, with more 'interesting' problems, but were instantly forgotten. There's just something about \"A Christmas Story\" that rings the right note, something that works. It didn't work immediately, in a year where \"Return of the Jedi\" was the phenomenon, and comedies like \"Risky Business\", \"Vacation\" or \"Trading Places\" attracted more crowds, critics welcomed Bob Clark's film with timid enthusiasm. Others, like Vincent Canby, criticized it while conceding a touching nostalgic value. But the attention got warmer with time, people realized they could watch this film and watch it again, that they could enjoy it as well as their parents or their kids, that the quest of Ralphie could resonate more strongly in the parents' hearts. They also saw that unlike indisputable classics like \"It's a Wonderful Life\", the film didn't rely on its ending, it was interesting from beginning to end. Slowly, the film became the consummate feel-good family Christmas movie, with the charm of nostalgic classics filled with colorful characters like Fellini's \"Amarcord\" or Woody Allen's \"Radio Daus\", with a similar wit coming from the voice-over narration of Jean Shepherd. It's set in the 40's, the kids aren't even baby-boomers, but there's a classic tropism established by Ebert that the more specific a story is, the more universal it is, even more universal since the film is about childhood.And what better time than Christmas to amplify the most basic aspects of that magical yet volatile time? We all know the story: \"Little Ralphie wants the new Red Ryder B.B. Gun\" only to bump into the same frustrating answer: \"You'll shoot your eye out\". You have everything in that premise: the powerlessness of children, the fetishism surrounding toys and the obstruction of overprotective mothers, it's the eternal struggle between kids and parents, culminating in Christmas time and forcing a child to seek escapism in dreams or find stratagems to convince his parents, same as parents who use tricks to talk them into finishing their plates.. It's Childhood becomes a time where communication is never a straight line. And some attempts are so pathetically deemed to fail that it elevates Ralphie as one of the most adorable Christmas protagonists.There's something so irresistible in the face of little Ralphie (played by Peter Bilingsley), he's not your smart ass cute-looking kid, not a Kevin McAllister, he's just an average little boy whose dreams are all focused on the holy grail of all toys and trying to find the proper language to communicate it to his father, his mother or eventually his teacher. The father played by Darren McGavin Is a no nonsense man who spends his time swearing but is oblivious to the fact that his kid would have grew an awareness of a few dirty words. The mother played by Melinda Dillon is more diplomatic and sweet (love the scene where she tries to convince Randy to eat) but God forbid she ever hears swearing, she then becomes the 'bad cop' who knows how to wipe dirty words off a child's mouth, with the perfect brand of soap. The film contains all the elements of childhood, friends, parents, toys, bullies, toadies, daring and double-daring (not to mention triple-daring), snow games, toys, joys and deceptions. Indeed, one of the most interesting scene involves the discovery of an ad message behind a secret code (proof that even at those times, publicity was frustratingly omnipresent). The closest to sensual awakening comes from the comical introduction of a sexy lamp made of a leg, causing a great deal of jealousy between the couple. The film looks likes a series of vignettes but to avoid the episodic feeling, there's that common thread, that constant goal that never deserts Ralphie's mind: the B.B. Gun and the inevitable \"Eye-shooting\" line, inspiring a hilarious comment coming, of all persons, from Santa Claus himself.But \"A Christmas Story\" is not about the gun, but about these wishes that obsessed us as kids. And there's just a gentleness about this film, an innocence that rhymes with intelligence, a desire to talk to the inner child inside us without losing the adult touch, that the narration comes from an adult voice creates the perfect bridge between the two worlds, and makes the film such a unique experience. That and the fact that every scene is original and there's a sense of detail that makes each viewing richer than the first. It's a film that grows on you and gets more special every time you watch it.Not to mention that it's hilarious, you won't shoot your eye out, but you'll laugh your ass off.",
    "111": "A sweet, realistic Christmas movie.Not as profound, emotional or idealistic as It's a Wonderful Life or Miracle on 34th Street, or as enchanting as A Christmas Carol (especially the Muppet version), A Christmas Story reminds us all what it is like to be a kid at Christmas time. A very sincere, natural depiction of Christmas. No big moral at the end, just a sweet story. A funny story too. There were many laugh-out-loud moments.Solid performances by Melinda Dillon and Darren McGavin as the parents. Good performance by (then-11 years old) Peter Billingsley as Ralphie.A movie for the whole family. Kids will relate, and adults will be fondly reminded of their own childhood.",
    "112": "This movie was so bad I had to turn it off after 50 minutes (mutually agreed with my wife). It's snowing 6 inches deep outside, December's just around the corner, it has almost as high an average IMDb mark as \"It's A Wonderful Life\" so what could go wrong?Well, from my point of view everything - the main drawback was the sickly-sweet content, so overloaded with saccharine it should come with a warning for diabetics. I hated the dorky kids, likewise their dumb parents and teachers - the situations were shallow and uninvolving, there were zero laughs, need I go on...It's not that I'm against nostalgic Hollywood representations of pre-teen life USA - in fact I see from the IMDb trivia notes that the very wonderful \"The Wonder Years\" was born of this offering, which just shows that TV adaptations can improve on the movie original (\"M.A.S.H.\" and \"Alice\" are other examples that come to mind).In closing, I can only attribute the film's unaccountably high average score here to the fact that every member of the cast must have posted a positive mark - and their parents!",
    "113": "I HAVE REVIEWED OVER 400 (C H R I S T M A S ) MOVIES AND SPECIALS.BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I AM HONEST! I REVIEW MOVIES & SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY Christmas MOVIES AS I CAN. Say what you want about modern films about the holidays. Yes The Hallmark Movies seem to follow a pattern. They are uninspired and always seem to cast the same people in everything. However the jewel of Modern Christmas Movies is not made by Hallmark but by MGM and it is the crown jewel of \"Modern Christmas Films\" and that film is \"A Christmas Story\".Based on the humorous writings of author Jean Shepherd, this beloved holiday movie follows the wintry exploits of youngster Ralphie Parker (Peter Billingsley), who spends most of his time dodging a bully (Zack Ward) and dreaming of his ideal Christmas gift, a \"Red Ryder air rifle.\" Frequently at odds with his cranky dad (Darren McGavin) but comforted by his doting mother (Melinda Dillon), Ralphie struggles to make it to Christmas Day with his glasses and his hopes intact.This film is perfect. It captures what every child feels like at Christmas. The cast is perfect and the film is never dull. What was nice about this film was that it was very respectful of the holiday itself and it showed how all of us go through some sort of stress during Christmas. The film not a huge success when released in 1983 however home video and cable showing the show developed a huge following. Its easy to see why. It is the perfect family holiday film. Its not sappy and its not snarky. It is a tribute to the way America celebrates Christmas. My Christmas is not complete without watching this",
    "114": "What makes A Christmas Story stand-out among the plethora of Christmastime films? What has made it sustain for 30 years? Perhaps it's how we've all been the kid that wanted that ONE toy over all else. Maybe it's the comforting, hilarious narration. Possibly it's the honesty of a family surviving the holidays. Perhaps it's Ralphie's childlike, melodramatic fantasies. Or maybe it's just the leg-lamp. However, I think we are drawn to it because it embraces the magic of Christmas without falling into the fantastical that many holiday movies dabble in. As one of the most down-to-earth Christmas films of all time, ACS is also one of the best. The story is an episodic vision of what American families goes through during Christmas, purely held together by its honest and quirky tone. Sure, the ending is abrupt, the message is unclear, and there is even some dated, un-PC humor (Chinese restaurant). However, even these elements contribute to the movie's naturalistic feel. The characters are dimensional, with some truly great performances by the four family members, and the period-piece elements are warm, cozy, inviting and familiar. Like a Norman Rockwell painting brought to life, ACS is pure Americana at its truest and funniest, mixing the purity of old network sitcoms with the more nuanced and subtle humor of underground comedy. Playing on the big screen at The Grand next week, on TBS Christmas Eve, and always available OnDemand, its omnipresence during this time can be a blessing and a curse. But don't let the ubiquitous existence of this holiday classic keep you from sitting down and enjoying it beginning to end.",
    "115": "Though Peter Billingsley has grown up and now has a career behind the camera in the business end of show business he will forever be remembered as young Ralphie in A Christmas Story. For those who were young and listened to Jean Shepherd's program as a kid he can do nothing else.I remember turning and listening to Jean Shepherd as an adolescent and I even turned my younger brother into a fan and being he was a precocious lad it very much appealed to him as well. All the incidents you see in A Christmas Story culminating with young Ralphie getting that wondrous gift of a Red Ryder BB rifle are those I remember Shepherd telling on his show. I daresay they made that vivid an impression on thousands of others. Getting Shepherd to not only write the screenplay, but narrate is essential to the story.This all takes place in Jean Shepherd's home town of Hammond, Indiana, steel town and suburb of both Chicago and Gary. The Parkers consist of Melinda Dillon mother and Darren McGavin father and Billingsley with younger brother Ian Petrella. McGavin who thought he'd be best remembered for being Mike Hammer and Carl Kolchak on television got his career. Shepherd on his show always referred to his father as \"the old man\" and so he remains here. McGavin is absolutely perfect in the way that Shepherd described him on his radio show.Billingsley and Petrella are appealing as real kids and not Hollywood type kids. Again I'm sure there was a lot of input from Shepherd in those characterizations as well.For me you'll love that scene when the boys meet Santa Claus at the department store. Seen through a kid's eyes it's both humorous and a bit frightening as well.In fact A Christmas Story is a holiday classic and will be for centuries.",
    "116": "\"A Christmas Story\" is a rare film about children yet for adults. While kids will definitely enjoy this Christmas-themed saga, adults will find a deeper level of depth than they may remember from seeing the film at a younger age.The movie strikes a sharp contrast between the exaggerated, polysyllabic narration of Ralphie, filled with nostalgia and lucid memories, and the soft, high-pitched childlike wonder of Ralphie's spoken word. The narrator is clearly not the same character as the one portrayed on film, but a character wholly outside the story, reliving his childhood emotions and anecdotes. Yet he is the heart of the film, the true center of gravity. This is because the movie is not about a scary Santa Clause and a BB gun - it's about childhood memories and the feelings they evoke. To that end, \"A Christmas Story\" is flawless.\"A Christmas Story\" tells of the epically materialistic journey of Ralphie (Peter Billingsley) as he searches for the golden, upheld idol of all red-blooded American boys: A Red Rider Air Rifle. Ralphie spins an intricate web of cunning and deceit as he plots to get his hands on it - including an essay, a trip to Santa Claus and more. The movie also shows us a glimpse of his family - his irritable, foul-mouthed father with a good heart, his whiny brother Randy, and his sweet, all-American mother. It is not so much a continuous story as a series of vignettes, but it ultimately serves the movie's purpose.This is a funny film. The narration by Jean Shepherd is filled with love for this story. He absolutely captures the emotions and logic of childhood. In a subtle but amusing moment, Shepherd intones the incomparably eloquent pouring forth of thought into writing - only to have Billingsley note in his awe-filled, high-pitched voice that \"I think everyone should have a Red Rider BB gun. It's very good for Christmas.\" (paraphrased). Most of the humor is similar - the natural exaggeration of a child as expressed by Shepherd's consistent string of hyperbole.Also, there's a reason why it's played constantly on cable TV throughout the Christmas season - it's a movie everyone can relate to. There are moments of such pure truth here that few can deny their power. I'm sure that there is a scientific law left unwritten that determines that every kid must at some point fantasize about his parents feeling absolutely terrible and forever regretting some unutterable punishment they inflicted on their child - in this case, the immortal washing of a mouth out with soap.Obviously, \"A Christmas Story\" is not a film that can be compared to Casablanca or Citizen Kane. It simply excels at its simple goals, and comes together as an extraordinarily entertaining piece of cinema.",
    "117": "Okay, I was a teenager in 1983 when this movie came out. Let me tell you, NO ONE was talking about this movie, and I mean NO ONE. It was an invisible little movie that meant very little to anyone.Fast forward 10 years, and see advertisements INSISTING it was \"the Christmas classic you loved as a child!\". Well, it wasn't. And it isn't. Yet, the marketers and TV stations obstinately still go on insisting that it is! This movie is proof of one thing, and one thing only. That if you repeat a lie long enough, and loudly enough, people will eventually believe it.The lie is that this movie was EVER a classic! It isn't. It wasn't. It's a poor, tired, unhappy excuse for a TV Christmas move, and anyone who thinks otherwise can not think for themselves, but instead allows ideas to be put into their heads by advertising.There, I've said it. I've been wanting to say that for 15 years!",
    "118": "\"A Christmas Story\" (1983), whenever someone mentions Christmas film, or holiday film, this is the first movie that comes to mind. It is based off an original novel by Jean Shepherd, called: \"In God We Trust, All Others Pay Cash.\" It's a great book, and this film really gets the story right. This is the best Christmas movie ever made, it is truly the epitome of Christmas films. It practically breathes Christmas! Perfect story, perfect acting, perfect sets/locations, perfect special effects, and a perfect soundtrack. The story might just be a traditional narrative of an ordinary American Christmas. But, it's told in such a unique, creative, and very entertaining way. The acting is top-notch, Peter Billingsley as Ralphie is phenomenal, Darren Gavin is absolutely hysterical as the father, Melinda Dillon is great as the mother, Ian Petrella as the younger brother, Randy is funny. The rest of the cast does a brilliant job as well, they are really entertaining and perform their characters flawlessly. Even Jean Shepherd, the author of the original novel, narrates the story throughout the movie. That is really cool, the author is really telling us his own story and he certainly proves himself as a great voice actor! Usually, I'm not a fan of narration in a film. But when a movie gets it right it works very effectively and can help tie the film together. The sets/locations may be a typical American town, but in a movie like this it really works. Also, it's a very quaint neighborhood and it is perfect for the tone of this movie! The special effects are well done, and hold up to this day. Finally, the soundtrack is excellent, and it really screams Christmas. If I hear any random part of the movie soundtrack, I can immediately pinpoint it to this film. That's how you know you have a perfect soundtrack. \"A Christmas Story\" is truly timeless, and a Christmas film for any generation. I could watch it over and over again and never get tired of it. Of course, I give this movie 5 out of 5 stars on my scale, which equates to 10 out of 10 IMDB stars. If you're looking for a Christmas film to watch this holiday season and not sure which one to choose, watch this one. Also, if you have not seen this movie, see it. Any one can enjoy it, it's not hard to find it on TV during Christmas season. Every holiday season, they show this film 24/7 on TV. So I don't have to wear out my DVD of it, because the TV channels save me the trouble and play it for me! This is the only Christmas film to air 24/7 during the Christmas season, and there's a reason why. It is truly, the greatest, and always will be, the best Christmas film!",
    "119": "Since it came out in 1983, \"A Christmas Story\" has become a staple for viewing by many people during the holidays. It's a story told through the eyes of a nine-year-old boy, Ralphie Parker. The plot comes from a collection of stories by Jean Parker Shepherd, \"In God We Trust, All Others Pay Cash.\" The semi-autobiographic tales recount his growing up in a Midwestern town during the depression. Shepherd also worked on the screenplay and narrated the movie. The cast was perfect for this story. Darren McGavin plays his dad, \"the Old Man\" Parker. Melinda Dillon plays his mother. Peter Billingsly plays Ralphie and Ian Petrella plays his younger brother, Randy. Scott Schwartz plays Shepherd's long-time boyhood friend, Flick. He's the kid who sticks his tongue on the flagpole in winter on a triple double-dog dare. The movie is a nice look at childhood in 1930s America away from the big cities. We see the humorous efforts a young boy would take to get his Christmas wishes known. We see an old standard treatment for boys, especially, when they used bad language  tasting of the soap bar. We see the culture of kids  the dares, double-dares and double-dog dares for challenges. There's the usual school or neighborhood bully, and we catch Ralphie in a couple of lies. One of the funniest scenes is his dad's winning of a lamp from a newspaper contest he entered. It's one of the most grotesque things, the shape of a woman's leg. It almost looks like a leg from a mannequin. Why anyone would make a lamp out of such a thing is beyond me. But, Ralphie's \"Old Man\" loved it. I imagine the overwhelming majority of viewers sided with Ralphie's mom when she \"accidentally\" broke the lamp. After more than 30 years, this movie may be losing some appeal. It's not in the vein of \"A Christmas Carol,\" or other films that are classics. Still, I keep it in my collection as an amusing story to share and movie to break out over the Christmas season.",
    "120": "Surprised to see this film listed among Top 250 films of IMDb years ago (a glory will not return considering it has been outranked by other newcomers), but still it is an unthinkable feat since family-slewed holiday season comedies has rarely been able to manage on that prestigious list, less to mention it is from a Tinseltown hack, the late director Bob Clark. Now I finally have watched it with BluRay calibre, what can I say? It is a damn good family boon, a bona-fide Christmas film outshines all its contemporary duds. Set in 1940s, an ordinary American family, Ralphie is a schoolboy lives with his parents and a younger brother Randy, all he wants for the approaching Christmas is a BB gun which every adult considers it is dangerous since it will shoot your eyes out! (An utter antithesis of what I wanted when I was that age, of course, not for Christmas, for Spring Festival instead). So the film minutely recollects what has happened during this unforgettable Yuletide by a congenial voice-over from Ralphie in his adulthood, the mischiefs at the school and at home, all from Ralphie's viewpoint, which perfectly aligns with the whimsical nature of a kid's chimera. Melinda Dillon and Darren McGavin makes such a dynamic on screen duo as the cool mother and the naff father (McGavin is too old to be their old man, a grandfather should be more appropriate though). What happens in the family (a piggy-imitation incentive on the dining table, the leg-shape lamp accident, the icicle misconduct, and the f-word punishment etc.) radiates great affinity towards its viewers since it is not overtly soliciting for instant laughters, rather it stays with its audiences and brings ripple effects to everyone's own memory of their most memorable holidays in childhood. Peter Billingsley, a bespectacled precocious over-thinker, does offset the abundance of epidemic smart-alecks among recent child-performances. Tedde Moore, as Ralphie's schoolteacher, whose deadpan sanctimoniousness satires the traumatizing condescendence on the nose, personally I have met quite a few in my school days. Other skits such as Peter and the wolf parody, the impatient Santa Claus with his fiendish elves in the mall, and the tongue-stuck-on-the-ice prank, all goes well without hyperbole. Bob Clark may not be a great filmmaker, and A Christmas STORY doesn't possess any unique talking point among cinephiles, but with a retrospective nostalgia, it certainly occupies a snug spot among many people's guilty-pleasure bracket.",
    "121": "A Christmas Story (1983) :\nBrief Review -An intellectual fun film for kids and an unforgettable nostalgia for adults which leaves all with tears of joy. I keep searching for a kids film that will have a lot for adults so that i can watch the same film with my kids in future but you know what i found most of those films in animated genre (mostly Pixar films). Now i feel like i have found one named A Christmas Story that would be the same film I was looking for. I never thought that a fun film for kids having kids in the main roles will have so much intellectual and thoughtful messages. The film is about a 9 years old boy Ralphie who desires to get a Red Ryder BB gun as a Christmas Gift but he fails to convince his parents, teacher and Santa. Just not this but the film covers many things like desires of kids, parents thoughts on it, teachers views and then how the entire generation of kids is behaving very differently to each other at the same time. It creates lot of laugh riots, many nostalgic moments like we all had in childhood in school, outsider school and at home with parents. I am not an American guy so i don't know much about Christmas films criteria but I can see it as a normal film and enjoy it every time. From slapstick one liners to kids level intellectual jokes to ultimate conclusive thoughts (narrated by adult character) to emotional attachment, A Christmas Story works in every aspect. In 90-95 minutes runtime and universal theme like this it couldn't have got better than this except the fact that the climax could have easily added something from adult version of Ralphie. Maybe i was expecting too much from a 80s film that is basically made for enjoyment of Family audience. Overall, it gets enough of everything which is needed for a Must Watch Film for Families in Christmas Holidays and for many generations.RATING - 7/10*By - #samthebestest",
    "122": "I started to like the movie in the first few minutes because it was portrayed in the 1940s (which for me is the golden age). A Christmas Story portrays Ralphie's story with his family and friends, showing moments of happiness, anger, disappointment, frustration, dream, desire among others.The film subtly addresses the issue of bullying, in addition to Ralphie's desires and imaginary mind, child's play (like sticking his tongue on a frozen pole), the disappointment of not getting what he wants right away, the anger of adults always denying their desire to own a Rifle, frustration at having put so much into writing the essay and not succeeding, the importance given to things that for adults are bullshit like joining the secret club.Despite being a film with children, the target audience is adults who, having already lived those experiences, can make a way back to childhood.",
    "123": "I came from Chicago... and Jean Sheppard, whose imagination created Ralphie & the rest of the crew in this film, was from just down the road in Gary, Indiana. His time frame was a bit before mine, but his take on Christmas in the industrial, urban Midwest is spot on with what I remember.He captured the hard, gritty aspects of the steel mill town Gary (disguised in the film as mythical Hohman, Indiana) perfectly...  as well as the special, once a year magic that Christmas used to bring us  before we got too sophisticated and modern to let ourselves go and ENJOY a holiday.Jean Sheppard was, IMHO, a national treasure. His writing was the inspiration of CHRISTMAS STORY, tho the film was a conglomeration of a LOT of his short stories.Ralphie, Flick, Kissel, and the rest of the kids are typical for the period, back when Christmas was THE big time of the year...  and Ralphie's quest for the Red Ryder Lever Action BB rifle (with a compass in the stock!) duplicates what EVERY city kid wanted, but couldn't ever  have, and for the same reason; YOU'LL SHOOT YOUR EYE OUT!!!\nJim Backus is EXCELLENT as Ralphie's father...  the flawed, human, but totally real Working Stiff who does what he can to keep his family fed and make Ralphie's world the best place that he can.A CHRISTMAS STORY is a refreshing relief from the countless repetitions of Dickens A CHRISTMAS CAROL that paves the TV channels wall to wall during the holidays. BTW... did you know that a web search will tell you that there have been no less than 247 different film versions of the Dickens tale made over the years???Give this movie a try...   you'll LOVE it. It has become a classic over the 20 - odd years it's been around.\nBTW... because of the film, the folks at Daisy reintroduced the Red Ryder Lever Action BB Rifle for about a year... unfortunately, they forgot to include the compass in the stock.At the age of 44, I finally got my Red Ryder. It's as great a Christmas present (to myself) now, as it would have been when I was Ralphie's age.",
    "124": "If one watches \"A Christmas Story\" in its natural habitat (the holiday season), it would almost be impossible not to give it a full 10 stars. It takes full advantage of the Christmas spirit and capitalizes on baby boomer nostalgia that also filters down through their offspring.All of that being said, \"A Christmas Story\" is also not a perfect film. It really is a collection of set-pieces (almost like a stage play) more than a coherent narrative, and only the quest for the iconic BB gun gives it any structure whatsoever. In this sense, I can't call it my favorite holiday movie, but it obviously is still beloved enough to procure a solid ranking.For a basic overview, this film tells the story of young Ralphie (Peter Billingsley) and his quest for the perfect Christmas present: the Red Ryder BB gun. Seemingly thwarted in this pursuit by a mother (Melinda Dillon) who opines \"you'll shoot your eye out!\" and a father (Darren McGavin) who is too busy fighting furnaces and muttering comic obscenities, Ralphie must take is plea to the big man himself--Santa Claus.Besides that general structure, \"A Christmas Story\" is very much a family-centric (and friendly) film. The antics of the Parkers comprise nearly all of the comedy, drama, and nostalgia in the experience. There's a reason why the house (in Cleveland, OH) now houses an entire museum dedicated to the movie!Upon my recent re-watch of the film, one thing I noticed was how crucially important the \"Old Ralphie\" (Jean Shepherd) is to the proceedings. Much like the later \"Wonder Years\" TV show, some of the best lines and wisecracks of the entire picture are uttered by the narrator here. Without that \"looking back\" perspective, this would all feel a bit hollow.Overall, I consider \"A Christmas Story\" to be a solid entry in the holiday season canon. It isn't in my absolute top tier, but it comes very, very close. It almost works better, in an odd way, watching it in pieces over the now-ubiquitous 24-hour Christmas Eve marathon than just viewing it straight through.",
    "125": "One memorable Christmas in the life of a nine-year-old in 1940's Indiana makes for a memorable movie and reflections on the innocence of youth in `A Christmas Story,' directed by Bob Clark and starring young Peter Billingsley, Darren McGavin and Melinda Dillon.  What is happiness?  To young Ralphie Parker (Billingsley), it's simple; it's getting the best Christmas present a boy could ask for, namely a genuine Red Ryder 200-shot carbine action air rifle BB gun.  But it's getting close to the big day, and his hopes are fading fast; there's an obstacle between him and the coveted weaponry:  Mom (Dillon).  And the answer is `No.'  But why!?  `You'll shoot your eye out.'  Reasoning and wisdom to which there is simply no argument. But, as Yogi once said, `It ain't over till it's over,' and a determined Ralphie refuses to give in or give up on his quest for the ultimate gift. And as the story unfolds we get a glimpse, through Ralphie's eyes, of the way life was in another time and another place; an era long since gone, but never forgotten. \tBased on a portion of the Novel `In God We Trust, All Others Pay Cash,' by Jean Shepherd, with a screenplay by Shepherd, Leigh Brown and Bob Clark, Shepherd narrates (as the adult Ralphie), with reminiscences that are poignant and delightful; about Dad (McGavin), an Oldsmobile man, turkey lover and fabled `furnace fighter,' who in the heat of battle could weave a tapestry of profanity that as far as anyone knows is still hanging in the air somewhere over Lake Michigan; Mom, a woman who hadn't had a hot meal in years, thanks to tending to the needs of her family first; younger brother Randy (Ian Petrella); friends Flick (Scott Schwartz) and Schwartz (R.D. Robb) who share Ralphie's myriad adventures and set the protocol of the `dare,' from the singular all the way up to the coup de grace, the `triple dog dare,' employed during a contest to determine, once and for all, if one's tongue will in fact stick to a frozen metal flag pole; the endearing Miss Shields (Tedde Moore), the teacher who makes them write a THEME; and last, but not least, the yellow-eyed neighborhood bully, Scott Farcus (Zack Ward) and his toadie, Grover Dill (Yano Anaya), who give new meaning to the phrase, `Say Uncle!'  There are humorous anecdotes about flights of fancy and lessons in life, like how to change a tire in record time and how to barter for the right Christmas tree (from Dad), and tricks used to get your younger brother to eat his food instead of just playing with it, as well as alternative uses for soap (from Mom).  We also discover how Ralphie learned a valuable lesson about how the journey is often the best part of the goal finally realized (courtesy of a `Little Orphan Annie' secret decoder ring), and the real meaning of a `Major Award.' \tMcGavin is perfectly cast as Ralphie's dad, `The Old Man,' as he is referred to affectionately, and he gives just the right touch to all of the small ironies of life that seem to surround him, while Dillon gives a winning performance as his mom, whose TLC nurtured the warm memories from which this story was born.  But the most exemplary performance given here is by Peter Billingsley, who forever after will remain Ralphie Parker in the memories of anyone who sees this film.  There is an engaging naturalness about him that makes an instant connection with the audience, for he personifies the child in all of us, and it's a character you'll remember for as long as you retain any memories of your own childhood.  And therein lies the real charm of this movie; because everyone was once a child, and for better or worse, will carry memories akin to Ralphie Parker's (or Jean Shepherd's) forever.  A heartwarming, funny film, `A Christmas Story' is a true classic that can be enjoyed again and again and will most likely become an annual event once you've experienced it.  In the tradition of `It's A Wonderful Life,' and `A Christmas Carol,' this is a movie that can add so much to the festivities, no matter how you celebrate your holidays.  I rate this one 10/10.",
    "126": "There's a reason TV stations devote 24-hour Christmas marathons to \"A Christmas Story,\" and the best way to describe that is timeless. If you didn't know the movie was released in 1983, you'd be shocked to find it out because not only is it set in the 40s, but there is an old, classic quality about the way it's written and filmed.The movie truly is a Christmas story and nothing else. The plot simply follows one young boy named Ralphie on a particular Christmas where he wanted nothing else but a Red Rider air rifle BB gun. What makes it so special is the way it's told. There is a narrator, presumably an older Ralphie telling the story, that adds a strong amount of suspense as well as insight to the characters. The movie then structures itself in little memorable episodes that make you laugh and recall your own childhood all at the same time.Whether it's the kid sticking his tongue on the poll at recess, Ralphie getting soap stuck in his mouth, the delightfully creepy mall Santa, or the immortal words \"you'll shoot your eye out,\" \"Christmas Story\" has something you're bound to never forget. It's replay value is also astounding. It evokes a nostalgia unparalleled by other Christmas comedies.",
    "127": "A Christmas Story is a tale about a young boy named Ralphie (Peter Billingsley), who upon one December wants nothing more for Christmas than Red Ryder B.B. gun. But everything and everyone seem to be against him, like it so often seems when you're a child.The story itself isn't that complicated, but what really makes this a Christmas classic is how they capture the essence of Christmas, as well as childhood in general. The whole film is narrated by an adult Ralphie, describing his own reactions and thoughts from the point of view of an adult, which makes all the difference. Sure, you probably weren't chased from school to home by bullies every single day, but when you're trying to remember your childhood, it sure seems that way. And thus, whenever there's a scene of Ralphie getting out of school, there's the bully to chase him back home.And the Christmas stuff also works really well. It brings you right back to those days of your childhood when you went with your parents to find a tree, or dreamed about the perfect gift, or woke up uncharacteristically early to unwrap your presents. It's full of little touches, and not just from the children's perspective. I love the scene where the parents simply sit down and enjoy the lights and atmosphere of the tree. For me that sums up Christmas perfectly.The parents are also great characters in general. There's a scene where the mother finds Ralphie's younger brother hiding in a cupboard because he's upset. She asks him if he's okay, gives him a sip to drink and leaves him there, knowing that it brings him comfort. What a great moment, and not one you'd expect at all, but which makes perfect sense.What a great film. Yeah, it's overly cheesy and the plot is pretty thin when thought objectively, but it's just about perfect around Christmas. See it come next December if you haven't already.",
    "128": "This is a collection of tales as they are recollected by a person thinking back on their childhood one Christmas. It has all the exaggerations with its ups and downs.Ralphie Parker (Peter Billingsley) spots a \"Daisy Brand Red-Ryder BB\" 200-shot Carbine with a compass, in the window of a story and fantasizes on how to get it for Christmas.Will he succeed?And if so will he shoot his eye out?I had one of those Davie Crocket hats when I was a kid. There were lots of other items and actions that I could relate to. However, my wife likes the watering method used by Melinda Dillon (mother) around the trophy. And she likes the way the mother conserved electricity by turning it off. I could see her snickering through the corner of my eye.I am not sure I should have bought this movie. It may prove fatal to any window plan.The sequel of \"A Christmas Story\" (\"It Runs in the Family\" (1994)) lacks a lot of the originality of this one.",
    "129": "I never got to see \"The Christmas Story\" in a Movie theater. It was rushed in and out of theaters at Thanksgiving time in 83;so most people/fans have only seen it on TV. After viewing this movie only once, it instantly became my favorite Christmas Film moving ahead of \"IT'S A WONDERFUL LIFE\" which I had watched for decades.Even though I grew up in the 50's I could easily identify with Ralphie.Parents/Santa were still giving BB Guns at Chrismas to young boys. I was 7 years old(can you imagine giving a BB GUN to a 7 yr old today)and actually don't remember even asking for a BB GUN but was more than thrilled when I discovered it under our Christmas Tree.Billingsley(Ralphie) did such a superb acting performance in this film,it still amazes me. His Facial Expressions without even saying a word were the highlight throughout the movie. The innocent look he tried to portray when he and Schwartz convinced FLICK to put his tongue on the Flagpole after a Triple dog dare yah! When Ms Shields can't get Flick to tattle on who was responsible for his dilemma.She knew it had to be Ralphie and Schwartz but how are you going to prove it if Flick won't spill the beans.Just a wonderfully entertaining Movie that doesn't really get boring anywhere in the Film. Great performances by the supporting cast also. When you watch a Film like this going on 30 years you can't really see anyone else playing the parts other than the Original Actors. I recently got a glimpse of \"CHRISTMAS STORY 2\" and just couldn't get into it with Daniel Stern playing the Old Man or any of the other non original cast members. Another instance of Leaving Well Enough alone.Anyone that watches this Film and can't come away with some kind of a good feeling or happy memory from their life probably won't like or care for anything worthwhile during their life.Sadly Darren McGavin and Bob Clark are no longer with us;but they both know what this film meant to millions of people...Excellent 5 Star Film in my book...s.m.",
    "130": "With all of the fondness I've read for this movie I was surprised that it's mainly an American thing. I've never seen A Christmas Story on TV or in stores in the UK. I doubt many people outside of the US know who Jean Shepherd is, or of his popular Ralphie Parker character. In fact, most people in general won't know that this movie is actually the fourth of (currently) seven featuring Ralphie.Adapted from the book In God We Trust, All Others Pay Cash, a collection of mostly Christmas-themed short stories, it remind me a lot of Christmas Vacation (adapted by John Hughes from his own Christmas '59 short story) in that it seems semi-autobiographic. But the adaptation of several stories gives the movie a sketchy feel, with a few that failed to resonate with me.The main story has little Ralphie Parker (brilliantly played by Peter Billingsly), a kid with imagination and cynicism beyond his years, beg his parents, and Santa, for a BB gun while dealing with a series of eccentric events in 1940s Indiana. It made me laugh quite a lot, but mainly in the second half. The cosy Xmas atmosphere is lovely, and there's not a shred of anything unwholesome. But I just can't see myself making this an annual tradition.I am sure many will disagree, but it does make me curious about checking out the other Ralphie Parker movies.",
    "131": "For a majority of my childhood A Christmas Story was the pinnacle of my Christmas films to watch. Every Christmas morning we woke up to the film and when Ralphie and Randy opened gifts it was our turn. Such memories for over a decade. Jean Sheperd penned a great script, and it's brilliantly executed by Peter Billingsley, Melinda Dillon and Darren McGavin. Narration done by Jean Sheperd is also top-notch. This film is still incredible and nostalgic even at my age of 28 years old. Classic moments of Randy at the dinner table, the \"fragile\" lamp scene, the getting ready for school, Flick's tongue on a pole scene, and many more that make the film unforgettable. As a kid, I always cherished watching the film because I idolized Ralphie, as well as wishing that my own father loved me like the Old Man loved Ralphie. As a Christmas movie, the film feels so much like it's dead set in Christmas season. You just get wrapped up in the holiday feeling. I have nothing negative to say about the film itself. It's just one amazing Christmas movie.",
    "132": "One memorable Christmas in the life of a nine-year-old in 1940's Indiana makes for a memorable movie and reflections on the innocence of youth in `A Christmas Story,' directed by Bob Clark and starring young Peter Billingsley, Darren McGavin and Melinda Dillon.  What is happiness?  To young Ralphie Parker (Billingsley), it's simple; it's getting the best Christmas present a boy could ask for, namely a genuine Red Ryder 200-shot carbine action air rifle BB gun.  But it's getting close to the big day, and his hopes are fading fast; there's an obstacle between him and the coveted weaponry:  Mom (Dillon).  And the answer is `No.'  But why!?  `You'll shoot your eye out.'  Reasoning and wisdom to which there is simply no argument. But, as Yogi once said, `It ain't over till it's over,' and a determined Ralphie refuses to give in or give up on his quest for the ultimate gift. And as the story unfolds we get a glimpse, through Ralphie's eyes, of the way life was in another time and another place; an era long since gone, but never forgotten. \tBased on a portion of the Novel `In God We Trust, All Others Pay Cash,' by Jean Shepherd, with a screenplay by Shepherd, Leigh Brown and Bob Clark, Shepherd narrates (as the adult Ralphie), with reminiscences that are poignant and delightful; about Dad (McGavin), an Oldsmobile man, turkey lover and fabled `furnace fighter,' who in the heat of battle could weave a tapestry of profanity that as far as anyone knows is still hanging in the air somewhere over Lake Michigan; Mom, a woman who hadn't had a hot meal in years, thanks to tending to the needs of her family first; younger brother Randy (Ian Petrella); friends Flick (Scott Schwartz) and Schwartz (R.D. Robb) who share Ralphie's myriad adventures and set the protocol of the `dare,' from the singular all the way up to the coup de grace, the `triple dog dare,' employed during a contest to determine, once and for all, if one's tongue will in fact stick to a frozen metal flag pole; the endearing Miss Shields (Tedde Moore), the teacher who makes them write a THEME; and last, but not least, the yellow-eyed neighborhood bully, Scott Farcus (Zack Ward) and his toadie, Grover Dill (Yano Anaya), who give new meaning to the phrase, `Say Uncle!'  There are humorous anecdotes about flights of fancy and lessons in life, like how to change a tire in record time and how to barter for the right Christmas tree (from Dad), and tricks used to get your younger brother to eat his food instead of just playing with it, as well as alternative uses for soap (from Mom).  We also discover how Ralphie learned a valuable lesson about how the journey is often the best part of the goal finally realized (courtesy of a `Little Orphan Annie' secret decoder ring), and the real meaning of a `Major Award.' \tMcGavin is perfectly cast as Ralphie's dad, `The Old Man,' as he is referred to affectionately, and he gives just the right touch to all of the small ironies of life that seem to surround him, while Dillon gives a winning performance as his mom, whose TLC nurtured the warm memories from which this story was born.  But the most exemplary performance given here is by Peter Billingsley, who forever after will remain Ralphie Parker in the memories of anyone who sees this film.  There is an engaging naturalness about him that makes an instant connection with the audience, for he personifies the child in all of us, and it's a character you'll remember for as long as you retain any memories of your own childhood.  And therein lies the real charm of this movie; because everyone was once a child, and for better or worse, will carry memories akin to Ralphie Parker's (or Jean Shepherd's) forever.  A heartwarming, funny film, `A Christmas Story' is a true classic that can be enjoyed again and again and will most likely become an annual event once you've experienced it.  In the tradition of `It's A Wonderful Life,' and `A Christmas Carol,' this is a movie that can add so much to the festivities, no matter how you celebrate your holidays.  I rate this one 10/10.",
    "133": "There's a reason TV stations devote 24-hour Christmas marathons to \"A Christmas Story,\" and the best way to describe that is timeless. If you didn't know the movie was released in 1983, you'd be shocked to find it out because not only is it set in the 40s, but there is an old, classic quality about the way it's written and filmed.The movie truly is a Christmas story and nothing else. The plot simply follows one young boy named Ralphie on a particular Christmas where he wanted nothing else but a Red Rider air rifle BB gun. What makes it so special is the way it's told. There is a narrator, presumably an older Ralphie telling the story, that adds a strong amount of suspense as well as insight to the characters. The movie then structures itself in little memorable episodes that make you laugh and recall your own childhood all at the same time.Whether it's the kid sticking his tongue on the poll at recess, Ralphie getting soap stuck in his mouth, the delightfully creepy mall Santa, or the immortal words \"you'll shoot your eye out,\" \"Christmas Story\" has something you're bound to never forget. It's replay value is also astounding. It evokes a nostalgia unparalleled by other Christmas comedies.",
    "134": "A Christmas Story is a tale about a young boy named Ralphie (Peter Billingsley), who upon one December wants nothing more for Christmas than Red Ryder B.B. gun. But everything and everyone seem to be against him, like it so often seems when you're a child.The story itself isn't that complicated, but what really makes this a Christmas classic is how they capture the essence of Christmas, as well as childhood in general. The whole film is narrated by an adult Ralphie, describing his own reactions and thoughts from the point of view of an adult, which makes all the difference. Sure, you probably weren't chased from school to home by bullies every single day, but when you're trying to remember your childhood, it sure seems that way. And thus, whenever there's a scene of Ralphie getting out of school, there's the bully to chase him back home.And the Christmas stuff also works really well. It brings you right back to those days of your childhood when you went with your parents to find a tree, or dreamed about the perfect gift, or woke up uncharacteristically early to unwrap your presents. It's full of little touches, and not just from the children's perspective. I love the scene where the parents simply sit down and enjoy the lights and atmosphere of the tree. For me that sums up Christmas perfectly.The parents are also great characters in general. There's a scene where the mother finds Ralphie's younger brother hiding in a cupboard because he's upset. She asks him if he's okay, gives him a sip to drink and leaves him there, knowing that it brings him comfort. What a great moment, and not one you'd expect at all, but which makes perfect sense.What a great film. Yeah, it's overly cheesy and the plot is pretty thin when thought objectively, but it's just about perfect around Christmas. See it come next December if you haven't already.",
    "135": "This is a collection of tales as they are recollected by a person thinking back on their childhood one Christmas. It has all the exaggerations with its ups and downs.Ralphie Parker (Peter Billingsley) spots a \"Daisy Brand Red-Ryder BB\" 200-shot Carbine with a compass, in the window of a story and fantasizes on how to get it for Christmas.Will he succeed?And if so will he shoot his eye out?I had one of those Davie Crocket hats when I was a kid. There were lots of other items and actions that I could relate to. However, my wife likes the watering method used by Melinda Dillon (mother) around the trophy. And she likes the way the mother conserved electricity by turning it off. I could see her snickering through the corner of my eye.I am not sure I should have bought this movie. It may prove fatal to any window plan.The sequel of \"A Christmas Story\" (\"It Runs in the Family\" (1994)) lacks a lot of the originality of this one.",
    "136": "I never got to see \"The Christmas Story\" in a Movie theater. It was rushed in and out of theaters at Thanksgiving time in 83;so most people/fans have only seen it on TV. After viewing this movie only once, it instantly became my favorite Christmas Film moving ahead of \"IT'S A WONDERFUL LIFE\" which I had watched for decades.Even though I grew up in the 50's I could easily identify with Ralphie.Parents/Santa were still giving BB Guns at Chrismas to young boys. I was 7 years old(can you imagine giving a BB GUN to a 7 yr old today)and actually don't remember even asking for a BB GUN but was more than thrilled when I discovered it under our Christmas Tree.Billingsley(Ralphie) did such a superb acting performance in this film,it still amazes me. His Facial Expressions without even saying a word were the highlight throughout the movie. The innocent look he tried to portray when he and Schwartz convinced FLICK to put his tongue on the Flagpole after a Triple dog dare yah! When Ms Shields can't get Flick to tattle on who was responsible for his dilemma.She knew it had to be Ralphie and Schwartz but how are you going to prove it if Flick won't spill the beans.Just a wonderfully entertaining Movie that doesn't really get boring anywhere in the Film. Great performances by the supporting cast also. When you watch a Film like this going on 30 years you can't really see anyone else playing the parts other than the Original Actors. I recently got a glimpse of \"CHRISTMAS STORY 2\" and just couldn't get into it with Daniel Stern playing the Old Man or any of the other non original cast members. Another instance of Leaving Well Enough alone.Anyone that watches this Film and can't come away with some kind of a good feeling or happy memory from their life probably won't like or care for anything worthwhile during their life.Sadly Darren McGavin and Bob Clark are no longer with us;but they both know what this film meant to millions of people...Excellent 5 Star Film in my book...s.m.",
    "137": "With all of the fondness I've read for this movie I was surprised that it's mainly an American thing. I've never seen A Christmas Story on TV or in stores in the UK. I doubt many people outside of the US know who Jean Shepherd is, or of his popular Ralphie Parker character. In fact, most people in general won't know that this movie is actually the fourth of (currently) seven featuring Ralphie.Adapted from the book In God We Trust, All Others Pay Cash, a collection of mostly Christmas-themed short stories, it remind me a lot of Christmas Vacation (adapted by John Hughes from his own Christmas '59 short story) in that it seems semi-autobiographic. But the adaptation of several stories gives the movie a sketchy feel, with a few that failed to resonate with me.The main story has little Ralphie Parker (brilliantly played by Peter Billingsly), a kid with imagination and cynicism beyond his years, beg his parents, and Santa, for a BB gun while dealing with a series of eccentric events in 1940s Indiana. It made me laugh quite a lot, but mainly in the second half. The cosy Xmas atmosphere is lovely, and there's not a shred of anything unwholesome. But I just can't see myself making this an annual tradition.I am sure many will disagree, but it does make me curious about checking out the other Ralphie Parker movies.",
    "138": "For a majority of my childhood A Christmas Story was the pinnacle of my Christmas films to watch. Every Christmas morning we woke up to the film and when Ralphie and Randy opened gifts it was our turn. Such memories for over a decade. Jean Sheperd penned a great script, and it's brilliantly executed by Peter Billingsley, Melinda Dillon and Darren McGavin. Narration done by Jean Sheperd is also top-notch. This film is still incredible and nostalgic even at my age of 28 years old. Classic moments of Randy at the dinner table, the \"fragile\" lamp scene, the getting ready for school, Flick's tongue on a pole scene, and many more that make the film unforgettable. As a kid, I always cherished watching the film because I idolized Ralphie, as well as wishing that my own father loved me like the Old Man loved Ralphie. As a Christmas movie, the film feels so much like it's dead set in Christmas season. You just get wrapped up in the holiday feeling. I have nothing negative to say about the film itself. It's just one amazing Christmas movie.",
    "139": "It's a bit silly and simplistic, but there is something that I like about these older films, a naive charm that the new ones are missing. I like the nostalgia and I can see that it would mean even more to American men born in the 40's and 50's able to recognise their own past. I think perhaps that it loses a bit in translation to the other side of the pond here, but it's got that 'It' (1990) and 'Stand By Me' (1986) vibe about it. That element that reminds us of an easier time, when childhood was all about what Father Christmas would bring or escaping the bullies and less about computer games and Twitter. When kids didn't have to worry about anything except curfew (And the odd evil clown).I also like the narration by the writer of the original book that the film is based on, it gives it an authenticity and you can feel that Peter Billingsley's character Ralphie, would grow up to become him.He's actually a good little actor and it's a surprise to see that he didn't do much more, in front of the camera at least.The Dad was simultaneously funny and annoying, but other than that it's not a bad film.If only kids could still be kids like this, I'm sure that they'd have more fun.621.95/1000.",
    "140": "What can I say about A Christmas Story other than fantastic! This movie captures the true meaning of Christmas...the commercial meaning at least. It's perfect for all ages. The story set back in the 1940's gives it an old fashioned look that is warm and cold at the same time. Even though it's hard to relate back to these times, everyone can relate to Ralphie.Ralphie, the main character played by Peter Billingsley, is a great choice to have as this kid. His smart ass and almost too mature outlook on life gives him an edge that will make kids and adults like him. Whether it be trying to get his mom to buy him a Red Rider bee bee gun for Christmas or trying to crack the code for Little Orphan Annie, Ralphie always has his game face on.His mother (Melinda Dillon) and father (Darren McGavin) are great as they seem to be on opposite ends of the spectrum at times, and at other times on the same page. This gives Ralphie the edge he needs to get his Red Rider. With his younger brother Randy, the two of them battle through their parent's lamp fights and the dreadful department store Santa, who is more like the department store monster!All together, these characters seem to pull it together to try and make the best of what will be an unforgettable Christmas. With a great script and narrating by the writer Jean Shepard (who wrote the novel this was based on) this movie has stood the test of time and lasted of 25 years and is still gaining popularity to people of all ages.Although the premise might seem childish, a boy trying all he can to get what he wants for Christmas, this movie is anything but. Families all over the globe have come to love this movie and make it a tradition to watch it every year on Christmas. Even stations like TBS have dedicated a whole days worth of time slots to show it non stop! Now that is dedication...Director Bob Clark has given us the chance to become little kids again. Christmas will never be the same thanks to this movie...and I wouldn't want it any other way...",
    "141": "Growing up as a kid, there was no time of the year better than around Christmas, when you were dreaming what gifts Santa was going to give you and when magic seemed to be in the air. Adding to all this were the seasonal movies that always seemed to pop up, from cartoons to feature length films. One of these was 1983's \"A Christmas Story\". Starring Darren McGavin, Melinda Dillon, and Peter Billingsley, it's a movie that gets played over and over again - 12 times in 24 hours to be exact - every year on cable, and for good reason: It's that great of a film. Based off of the writings of and narrated by radio personality Jean Shepherd, it's a simple story at heart, one about a young boy named Ralphie (Peter Billingsley) growing up in 1940's Indiana and dreaming about getting a Red Ryder B.B. gun for Christmas. Problem is, his mother isn't too fond of the idea at all, uttering the famous line, \"you'll shoot your eye out.\" Naturally determined to work around this, Ralphie works on a secret plan to try to hoodwink his mother, and that's where the fun begins, from a scary mall Santa to sticking a certain part of the body on cold, winter beam to see if it sticks!There are some movies that, despite not having the biggest budget or maybe even the biggest star names, seem to radiate a magic all their own. \"A Christmas Story\" is certainly one of those. From the whimsical narration of Jean Shepherd to a certain major award Darren McGavin's the old man wins (you know, the one that's a lamp in the shape of a certain part of the female anatomy), this film has Christmas magic oozing all over it. Peter Billingsley is wonderful as the determined kid to get his hands on the ultimate Christmas gift, doing everything from writing a school paper on the benefits of owning a Red Ryder B.B. gun for Christmas to asking a certain, way too scary for little kids mall Santa, which used to somewhat scare me as a kid but is now probably my favorite part of the whole entire movie. Plus, the performances of the late, great Darren McGavin as the old man, Melinda Dillon as Ralphie's mother, Ian Petrella as Ralphie's annoying little kid brother, Scott Schwartz and R.D. Robb as Ralphie's childhood friends Schwartz and Flick, and Zack Ward as the school bully Scut Farkus (\"Scut Farkus, what a rotten name!\") all add to this joyous experience. Anyone who ever celebrated Christmas a kid will get this movie, and for that reason alone, don't through life without seeing this at least a couple hundred times! Ho Ho Ho, Merry Christmas!",
    "142": "The reason \"A Christmas Story\" lives on as a film is because the simple story of a boy and his family is something adults and children can relate to by connecting the various vignettes to memories of their own. What's so appealing about the film, too, is the way it makes us feel we're back in the 1940s era, with none of today's materialistic, modern technology touches to spoil a tale of childhood innocence way back then.Peter Billingsley as the boy who wants his Red Ryder rifle for Christmas gives what is probably one of the most natural child performances ever recorded on film. And Darren McGavin and Melinda Dillon are splendid as his parents, not always sensitive to his needs and sometimes doing foolish things--like forcing him to wear a complete bunny rabbit from his favorite aunt on Christmas Day--or his mother overdressing him in outdoor wear on a snowy day so that he can barely move.All of the scenes involving the playmate bullies are right on target with a nice pay-off when the boy finally stands up to the worst of the lot. There's an hilarious scene at a Chinese restaurant that has the waiters serenading the family before dinner--and the business about the sexy lamp in the window has got to be one of the funniest mishaps in the whole story.Whatever your memories of Christmas are, you're sure to find a glimpse of recognition here in this very clever parody of Christmas past.",
    "143": "This has become an annual tradition to watch at our house during the holidays - as I'm sure it is at most houses in the U.S. This movie captures so many classic moments, I'm not sure I can ever pick the best.Although set more in the 40's (before my time), I think this is a movie that everyone can relate to in one way or the other.The casting couldn't have been more perfect. Peter Billingsley as Ralphie is pure genius. Its hard to believe a child could deliver such an outstanding performance. He makes the whole movie. My husband favored him as a child so his performance hits close to home for many reasons. But add to that Darren McGavin as the foul-mouthed (although they do \"alter\" his words so he isn't actually saying the words) Dad is pure comic genius. Melinda Dillon as the submissive wife is a good alter ego to the dad.As much as I like the many humorous moments in the film, I think what I like most is that it perfectly captures a simpler time in America. It represents an era that is long gone, when the holidays were less hectic and harried and more traditional. Oh, those were the days! If you haven't seen this movie, you absolutely have to. But I can't imagine anyone not having seen it with TBS running it 24 hours straight starting Christmas Eve!",
    "144": "I didn't grow up in the 1940s. Obviously, my kids didn't either. Hell, my parents weren't even born until the middle of the following decade. So why does this overly sentimental dash of era-specific holiday cheer hold such a special place in my heart? Why do I still cackle like a fool when I can recite all the punchlines? Why can I relate so easily to its themes and characters? I don't rightly know, but it's all true.As a kid, my sister and I would religiously throw our new pairs of dress socks over one shoulder, aping Ralphie and his brother. I knew the unique endorphin rush of planting myself in front of a favorite evening program; the raw fear of standing up to a bully that had me out-muscled and deeply intimidated; the untamed lawlessness of the playground. As I've grown into middle age, I haven't lost touch with the realities behind those well-loved signature scenes. Instead, I've developed an equally powerful admiration for the adult perspective. Now I appreciate the exhaustive desperation of dinner with a picky eater. The rising urge to spout \"do as I say, not as I do\" without the slightest hint of irony. The amplified magic of giving the best gift of the season and watching stars twinkle in the eyes of its recipient. It delivers all this amid a ninety-minute string of huge laughs, expertly teased and foreshadowed and paid off. There's a lot of meat on this bone, but by the time the on-screen holiday has come and gone, we have nothing left to pick.It's a holiday classic for good reason. Our societal scenery may have changed a little, but the messages and feelings and distinct personalities have basically remained the same. Any other movie, I'd get tired of watching on an annual basis. This one hits my belly like a splash of whisky, all warm and spicy and good. This one feels like home.",
    "145": "With a few exceptions, I generally don't like kids films, and not only that; but I hate Christmas too. When you throw the fact that I'm not even a fan of American 'apple pie' institutions (like Christmas), it was a pretty good bet that I'd hate A Christmas Story...yet strangely, I rather liked it. First of all, I'd like to say that I don't think this is a kid's film at all. Sure, kids may enjoy it; but what A Christmas Story really is, is a film for adults to relive their youth with. Like I said, I don't like Christmas; but I did when I was a kid, and although the story in this film is much more American-friendly (me being British), it's still easy to identify with the central character. The film's main point of interest comes from the fact that it's acted out with a child in the lead, but the narration comes from the same person as an adult, reminiscing on his past. This narration is both very funny, and has a great tendency to make you think back to when you were a kid. The way he explains how such trivial things are important to kids is really well done, and it's obvious that writer Jean Shepherd pays great attention to detail.Christmas films tend to get on my nerves because they often follow a nativity plot line, or follow some kids who find 'the real Santa Claus' or some other such rubbish; but the way that this one follows a plot that is all about why Christmas is so loved (kids, getting presents) makes it original, and also relevant in times of the year other than December. The central character has a lot of depth considering he is just a kid, and that is why A Christmas Story oversteps its Christmas bounds. The entire ensemble cast put in good, and believable performances; and this really helps out the film when it comes to things such as the fantasy sequences. For a fantasy sequence to really work, it needs a certain base in reality; and because of the way it's written and acted, you can really imagine these characters having these fantasies. Director Bob Clark seems to have a bit of thing for Christmas, with both of his highly rated films being set in that period. The other one couldn't be more different from this, however - the slasher picture Black Christmas! Anyway, it doesn't take much for a film to be the best Christmas film I've ever seen; but don't take that as a criticism; for this film is easily it.",
    "146": "\"And that was the year we had Chinese turkey...\" I saw this film opening weekend with the family and a couple of friends who were obnoxious in the half empty theatre that used to be off of El Camino and Broadway Avenue. The same place where I saw such classics as \"Dune\" and \"Buckaroo Banzai across the 8th Dimension\". I miss that theatre, somewhat.But, to the film. The child actor who will always be remembered as Messy Marvin from the Hershey's Chocolate Syrup commercials tells us a heartwarming tale of a mid-western suburbia Christmas. The kind of America that was rife with red brick school houses, overbearing adults, large family vehicles with wood panelling (a tradition that would carry over to the family station wagon of the 70s), kids challenging dares to one another, and extended family who think of you as the newborn instead of the older kid you clearly are.It's a kind of familiar Americana for millions and millions of Americans east of the Rockies, and it resonates with certain households on the western seaboard as well (Alaska, Oregon, Washington, California) due to the universal theme of growing up and enduring the child's most favorite holiday of the year; Christmas.In short, it's a good film. Funny, witty, well shot, finely narrated by an adult channeling his youth, and overall just a finely crafted film.I really don't have too much to say about it. It's an excellent holiday piece that most families can probably wrap their heads around. For anyone whose dad thought he knew best in all things, even though he wasn't, but you loved him for it all the same, for anyone who had to endure embarrassment from an aunt or mother, for anyone whose Christmas was a mixture of traditional tree trimmings and suburban familial trials of getting along and an over protective mother, this movie is for you.In fact, even though it focuses on the US from the Atlantic to the Continental Divide, the family theme transcends nearly most cultures who embraced the 20th century and family get togethers. The comedy is good. The story is good. The characters are excellent. And the culmination at the end shows a kind of cross cultural comedy that will hit many a funny bone for those who had their Christmas dinner reservations lost in the shuffle. Remember, it's not Peking Duck, it's Chinese Turkey.Enjoy.",
    "147": "When I first viewed 1983's \"A Christmas Story\" in 1986 the film was just really catching fire with mainstream America, and I liked it so well just as any young kid could because the film was so real. Over the years this film has became an American classic upon it's release in 1983 the film was rarely viewed it was limited to many cities, and the masses later caught on to it's joy on cable and TV, as now the film has a 24 hour viewing on Christmas Eve all the way thru Christmas Day. What's not to like about this movie it's kid friendly anyone can watch and think back to being a kid at Christmas the excitement and joy of wanting that special gift no matter if it's an action figure, video game, football, or a special toy as in this case it's a red Ryder rifle for Ralphie! Not only does the film just have a Christmas theme it does a fine job of showing that kids will be kids, just look at the frozen flagpole scene and the fight when Ralph stands up to the bully! Everything is just perfect from the acting, script, and setting it all came together on this film. This started from the works of Jean Shepherd who was a narrator, radio voice and novelist and \"A Christmas Story\" was not a full length novel, but a collection of short essays that was greatly put together into one big movie! The setting is perfect for a holiday movie 1940's Indiana and the snow covered streets are real, no fake snow making this movie even more true, this was 1983 well before the special effects craze, so this film had plenty of realism scene wise. The screenplay and direction is well done by Bob Clark from Porky's fame as the slapstick fun and trueness combine for a great movie. The acting is top notch too as nobody could have done it better than Peter Billingsley as nine-year-old Ralphie whose never ending dream is to get a Christmas gift of a genuine Red Ryder 200-shot Carbine Action Air Rifle. Also Ralphie's parents are played perfect by the classy Melinda Dillon and the now late Darren McGavin a legend who saw it all during his acting days. Both are gruff and tough, but that's just concerned love in fact it reminds me some of my mom and dad as I was growing up. Remember the fear was \"you'll shoot your eye out!\" This film has a slew of calamities from snowsuit stiffness, to listening to little orphan on radio, to a cruel Santa. In the end a happy ending occurs on Christmas morning with Ralph Parker, it just brings back the kid in you so well. What more can I say just everything works together well in this movie, it's a movie that will never get old because of it's traditional theme. \"A Christmas Story\" is without a doubt the best Christmas film ever, and I know most would agree.",
    "148": "Jean Shepherd was a brilliant humorist whose stories could ring nostalgic for someone who didn't even live in the era he often wrote about. His blend of sentimental nostalgia and satire was much like a combination of Mark Twain and Garrison Keillor. Shepherd had been in radio for many years and brought his stories that he narrated with his wonderful voice to television in the 70's in the PBS series Jean Shepherd's America and Shepherd's Pie. I loved watching these shows and the American Playhouse specials in the 70's and 80's that also featured Shepherd's alter-ego Ralph and his parents in The Star Crossed Romance of Josephine Cosnowski, Ollie Hopnoodles Haven of Bliss, the Phantom of the open Hearth and The Great American Fourth of July and Other Disaster. This film is based from a collection of essays he published in the 1966 novel In god We Trust, All Others Pay Cash. Shepherd was born in 1921 and grew up in Hammond, Indiana. In the book the town is called Hohman, Indiana and takes place during the depression years. The movie moves the time period up a decade to the early 1940's pre-WWII America. Shepherd wrote the screenplay along with his wife Leigh Brown and director Bob Clark and Shepherd, like his television shows, narrates the film. It's the story of Ralphie and his family during the Christmas season. Ralphie wants a B.B gun, he finds disillusion in his decoder ring, his father wins a lamp that was probably designed for a brothel and not a family home but the old man cherishes it as if it's from Tiffany. Ralphie has a little brother he has to look after and a wholesome mother. It's not an exciting story but it's so charming and such a slice of Americana that it was destined to become a Christmas classic. It's not a teary, warm and tender typical spirit of Christmas tale but a steady paced comedy of sentimental satire. Bob Clark who had a very uneven career as a director with a couple of good films in Murder by Decree and Black Christmas and the very popular Porky's is the film's director. He directed a lot of forgettable films in his career and only had one other film of note in Turk 182 after he directed this but he came out with an excellent film here. I hadn't even heard of this when it came out in the theaters but it went quickly to television and I first saw it maybe two years after it came out. When I finished watching it it seemed like I had seen an old movie that I had seen many times before. It did go on to become a Christmas classic and I have seen it many times. I would give it a 10.",
    "149": "A Christmas Story is just wonderful, and having the ability to watch it every holiday season might be the best Christmas gift I could ask for, my grandpa knew what he was doing showing me this at a young age, and it's tied with the brilliant Home Alone for my favorite Christmas movie ever.A Christmas Story tells one of the funniest holiday tales ever, it's a marvelously hilarious film, with loads of slapstick comedy and tons of clever writing, Peter Billingsley is such a joy to watch as his character tries so hard to get the one gift he always wanted, with perfectly accompanying side characters and a truly beautiful ending.The ending realization is everything, that old man Parker was the only one listening to what Ralphie truly wanted.I don't know why I love this movie so much, I just do, a Christmas Story is tied with home alone for the best Christmas film ever made, and it gets an A+"
}