{
    "0": "I am glad I watched this film for 3 reasons: 1-good runtime of 1h 50m, 2-never gets boring, 3-relentless impressive action sequences. Don't expect much from the plot but prepare yourselves for some epic monster fight scenes and some great ideas on visuals. If you have seen the previous kong and godzilla films then you will like this a tad more. But if you haven't, it doesn't matter; it will keep you invested throughout. Its at least a 7 because they kept it relevant to what it is. Its just a fun movie 7/10.",
    "1": "They took the Kong from Skull Island, an excellent film plus the recent less than excellent Godzilla film and smashed them together into a confused mess. They simply tried to do too much. They take the basic titan fight and added \"Journey to the Center of the Earth\", \"Upside Down\" Kong as Indian Jones, \"Transformers\", a light saber Ax, teens save the world, and a little girl saves the world. The company Apex are the bad guys who are trying to do something good. Good visuals. Just a messed up plot.",
    "2": "This is another movie where children save the day from evil and/or incompetent adults.BASIC PLOT\nKong is not happy in Kong biosphere.Incompetent human adults kidnap Kong to bring him to Antartica where there is an entrance to the center of the Earth.Kong's naval escort is intercepted by Godzilla. Godzilla and Kong have an epic battle. Godzilla wins round one.Kong is air lifted to Antarctica. He and humans fall through a wormhole to the center of the Earth.The center of the Earth is replete with light, oxygen, plants, trees, rivers, lakes, waterfalls and of course, dinosaurs.Kong is king in the center of the Earth. He even has a throne down there.Godzilla burns a hole down to the center of the Earth. Kong climbs up that hole from the center of the Earth, to the surface of the Earth.Kong and Godzilla have epic battle. Kong wins round two.Kong and Godzilla have another epic battle. Godzilla wins round three.Apparently King Kong is controlled by an eight year old deaf child. He virtually does whatever she says. (Thank goodness for the children.) She tells him, \"Godzilla is not your enemy. He is your friend. By the way, he needs your help.\"Kong looks over to see Godzilla battling mechanical Godzilla created by evil human corporation run by evil adults.Two other children break into the evil corporation and get control of the mechanical Godzilla control board. (Thank goodness for the children.)They can't override mechanical Godzilla's program. So one kid pours a drink on the control board to short out mechanical Godzilla. (Thank goodness for the children.)Kong and Godzilla decide they cannot be friends. But they will settle for Godzilla controlling the water. And Kong controlling the land.Kong returns to the center of the Earth. But he needs human supervision.This is a movie for kids, and adults who can suspend disbelief.There is plenty of action and violence. No nudity or sex. Couple of curse words.I gave it a 10 for action and special effects. A 1 for plot. Halfway between 1 and 10 is my rating of 5.",
    "3": "Rating basically for the epic battles in this movie, great special effects that blend perfectly with the environment accompanied by immersive sounds to rumble your speakers. Kudos to all those responsible for that. On the other hand, this movie does a poor job of character personalization and story plot. Had a lot of fake smiles and poor dialogues, did a poor job of making you feel for any character's situation and wanting more from them, it's like the movie pauses when scenes switch from the Kaijus to humans. Characters were introduced for no particular purpose or reason. Story was dull and uninspiring. Wouldn't recommend this movie for the plot or character performances but will recommend it for the epic Kaiju battles and CGI.",
    "4": "This is a mindless, plotless action flick with great action and effects but not much else. The plot is mundane, ridiculous and predictable. Much of it didn't even make any sense, because nothing is adequately explained. The acting is mostly awful. The editing made it difficult to follow what little plot there was. Actually the whole series of movies in this rebirth have all been really bad and this just continues that tradition. I am at a complete loss to explain the high ratings some people have given it and cannot recommend it all. Seriously don't bother with this.",
    "5": "Godzilla vs. Kong\nFirst, this is really a terrible movie. Two Hundred Million for this trash? Are you kidding me? This explains why WB is having such a hard time creating a stable DC universe. Green lighting silly ideas like this. There's a vehicle in this nonsense called a HEAV, and that's what I wanted to do watching this. At 87 minutes, it feels much longer. The only positive thing I can say is that the effects were excellent. But even there I saw problems. So, let's break it down shall we?The Director, Adam Wingard. If you add up everything he's directed it doesn't come to much. All his films prior to this might equal the catering bill for this movie. Why pick this guy? No one else wanted to be saddled with this lame script? Still, a paycheck is a paycheck no?Godzilla. Who designed the US Godzilla with this HUGE body and tiny head and no neck? Did anyone even bother to look at the various Toho designs?Kong. A nice design but a lot of plot holes in his story. So, his race comes from the center of the earth where they built things like thrones and statues and a Thor like ax. OK, so why are they extinct if they were intelligent? And why did they come to the surface of the earth?The HEAV (no one saw the bad jokes that would grow from this abbreviation?) If the humans needed a special vehicle to get to the Hollow Earth, why didn't they get squished the minute they got out of those vehicles?Kids... one of the things I really couldn't stand about some of the 70's Godzilla's were the kids. They served no purpose and slowed the plot. Well let's add in conspiracy man, who the kids find in like two seconds and help undermine Apex. So, some pinhead who is a conspiracy theorist gets into Apex (no background checks?) and then the kids get in with him? No security either eh? The kid with the English accent was one of the most annoying characters ever in any monster movie.The deaf girl. First, how does Kong even notice her? She's tiny. How did he learn her sign language? Why would he? He's a giant Gorilla. And yes, I know that gorillas have learned sign language. Koko was famous for it. But why would he?MechaGodzilla. Terrible design. Looks like a giant erector set. And it basically kicks the crap out of both monsters (I knew they weren't going to remain enemies), until Odin, I mean Godzilla charges Kong's ancient stone age axe.Let's see what they ripped off from better Toho Godzilla movies:\nMechaGodzilla. One of the Godzilla's greatest enemies. Originally in the 70's designed by a maniac scientist at the urging of aliens. Later, in the 90's created by the Godzilla defense force.Human with esper abilities. Miki Saegusa, an esper, shows up through many of the 90's Godzilla's starting with Godzilla vs Biollante. Fortunately, she doesn't get killed.Kong getting charged by his axe, is a direct wink at the original King Kong vs Godzilla from 1963, when Kong gets charged by electricity.So, what went wrong with this movie? How about everything. The story is lame. The human characters might as well not even be there. No background as to why or how they built that dome Kong was living in. It's a little sad at the end knowing Kong is the last of his species, but I can honestly say I hope this is the end of the monsterverse.",
    "6": "Separately King Kong and Godzilla work pretty well, together ,for merit was a disaster of a movie. Laughable plot, ridiculous action, all in all very boring time...",
    "7": "I liked the action but once again, The story and characters were unbelievably bland.",
    "8": "My cousin called me this morning. He suggested this movie. I demurred. \"You've got another movie in mind?\" he asked.I thought more about Saturday Night Wrestling on WNEW while watching this movie than I had in the preceding 60 years.Afterwards, we agreed to never speak of it again.",
    "9": "I'm the exact demographic for these types of movies. I love watching giant monsters fight each other. And i don't mind stupid mindless action flicks. But man. Just like with kong skull island and godzilla king of the monsters, this is a really bad movie with some good action.It's completely formulaic with 20+ cardboard characters trying (unsuccessfully) to pull off the marvel formula. But the MCU has good stories and great characters.The sad part is, I am reviewing this 2 days after i watched it, and i remember almost nothing from the movie. When i saw the name Alexander Skarsgård, i had to think about who he was in the movie. Nothing about this movie is memorable..... not even the action scenes. The visuals were great and it was mostly clear, but none of it was special. None of it made my jaw drop, which is VERY common for me. (1 viewing, 3/31/2021)",
    "10": "Martin Scorsese could have been referring to this film when he said that modern action movies have more in common with theme park rides than filmmaking.Horrendous plot, terrible acting... all it had was great sound and some impressive CGI. Not enough for me...",
    "11": "Kong is being kept under-the-dome living on Skull Island and he's not happy about it. Ilene Andrews (Rebecca Hall) is trying to keep him safe and away from Godzilla. Her adopted deaf daughter Jia communicates with him. Meanwhile, conspiracy blogger Bernie Hayes (Brian Tyree Henry) is investigating and working at Apex Cybernetics. Madison Russell (Millie Bobby Brown) is a fan and she tracks him down with Josh. Nathan Lind (Alexander Skarsgård) is a Hollow Earth expert. Oh yeah! There is the Hollow Earth, a magical axe, and a surprise villain.Honestly, I don't remember the previous movies. I don't know any of these characters. Non of them really matters anyways. I do like the idea of the little girl communicating with Kong. The movie should do more of that. BTH is a little fun as the conspiracy nut. His little Scooby gang has potential but it's not that great. The Hollow Earth is rather silly but whatever. It's stupid but kinda cool at the same time. The TRON ships are out of place. It's a tech mishmash. I don't really need a lot of the human story especially if it's not doing anything interesting. At the end of the day, this is a mindless popcorn flix and it's fine for being that.",
    "12": "It's quite amazing how a film as simple as two monsters battling could be screwed up into such an epic mess.The production clearly had a list of tick boxes they want to include within the movie and unfortunately this is the result.The premise of trying to 'protect' Kong is futile, as is making him the hero and Godzilla the initial villain, as is using him to find the 'Hollow Earth' which humanity has been unable to (and died trying to) reach it - which takes up a big part of the movie. However moments after finally getting there, Godzilla simply blasts a hole through to it creating an easy and direct link to the centre of it.Then in the third act the movie decides to shoehorn in the Mechagodzilla (one of the many tick boxes) which turns the movie into a Power Rangers movie rather than an epic fantasy, which in turn predictably allows both the titans to become a cringey tag team for the final showdown.Most of this wasn't needed (or wanted) and for everything they 'added' to the story ended up taking away from the film.",
    "13": "\"Godzilla vs. Kong\" is a weak film with a bad script. Two of the most important monsters in the film history together in a movie, some good things and a lot of problems. The good things are the beautiful visuals, correct performances, an amazing music score, tribute scenes to the original \"King Kong\" film and to the \"Gojira\" franchise, and the best point is that this film is saving movie theaters around the world from bankruptcy after the current COVID-19 pandemic but it is not enough. The bad points are the fake special effects and an awful scrift full of inconsistencies and stupid jokes, it is like an episode of \"Mighty Morphin Power Rangers\" mixed with a telenovela episode and an episode of \"Thundercats\", this may be interesting but in this production is a failure. A really bad film!",
    "14": "I guarantee 99% of viewers just wanted to see two titans go at it. Nobody cared about the humans in this movie. So why does WB keep trying to force humans down our throat in these movies? In an hour and 50 ish minutes were forced to watch people for 80 of those minutes. There's way too much time trying to make a plot here that I don't want to see.",
    "15": "______________________________________________________Madison Russell : \" ...There's something provoking him -{ referring to Godzilla }- that we're not seeing here... \" .______________________________________________________\" A Good, Old-fasioned, -{ Big }- Screen Review \" .So here's the thing. How is it that ...{ Evidently }... Maya, Lind, and Eileen & Jia, & the others, need 'Specially Constructed Deep Earth Crafts 🚀' to blitz thru the so called \"Gravity Inversion\" point-of-contact on their way to 'Hollow Earth' ( in order to prevent them from turning into something akin to 'instant-ketchup' ) ; but the -( \" essentially just as ORGANIC \" )- Kong needs no such parameter of enhanced fortification❓In the final analysis, 'twas... \" the ( Not ) so little things \" such as -{ This }- in \"Godzilla vs. Kong\", aka \"G.v.K\", that left me feeling a little bit like the limits of 👉{ Even }👈 this very decidedly, er... dicey, murky, & malleable thing known as \" Movie-Science \" , had, in this particular case, been stretched, well ...Way, Way { 🤔❗} past the point of acceptable, well, er . . . . . \" Thin-Ness \" .But one thing is for certain. Director Adam Winguard { 'Outcast', 'The Guest', 'Blair Witch' } has mostly definitely exploited the living daylights out of his USD 200,000,000 { 💣💥 } budget, to create a picture that is -{ Atleast }- as huge in Scope, as well as dynamism, as the monstrous & -( Utterly )- behemoth \"Titans\" that it pits against one another. Furthermore, ( & needless-to-say, almost, for those of you who've watched the trailers already ), most of the Artistic & Technical aspects of the production -( Cinematography, V.f.x, S.p.f.x, C.g.i, Music, Set-pieces, Casting )- are entirely \"Par-Excellence\", to say the -Least- . And -{ Yes }- , the Giga-dramatic & \" beautifully-Evocative \" Score from composer Tom Holkenborg literally sets an -{ already }- 'super-explosive' film... \" Aflame { 🔥❗} \" with an anticipatory fervour that is all but impossible to stave off. Franchise 'newcomer' Rebecca Hall ( Ironman-3 ), 'monsterverse-favourites' Millie Bobby Brown & Kyle Chandler, and Demiân Bichir, Alexander Skarsgård, Eiza Gonzáles, & Julian Dennison were all well & truly -{ Fantastic ✅ }- .Although this time it was the two 'super-fresh' faces that really stood out for me. The first being the -{ Phenomenal }- African American comedic talent Bryan Tyree Henry , who -Literally- carries the film 🌠 for the first 7½ minutes or so, \"almost single-handedly\". The latter is a -{ Brand New }- entrant to the very world of big-screen performance itself, an absolutely, positively Angel-Faced Youngster from ( U.s )-Georgia named Kylee Hottle 🌠 , who's -( Actually )- deaf in real life, -And- skilled in A.s.l, { or American Sign Language } ; & who was only, get this, 9 Years Old when GvK was filmed. She brings an 'Utterly Irrepressible' sense of Beauty, Innocence & Humanity to the entire movie, & -{ All }- her scenes with 'the great Kong' are just... { \" Darling 🌺❗\" } ...and that's -Not- an exaggeration. In fact, she -{ More Than }- makes up for the emotional depth that Godzilla-1's lead protagonist for the better part of the film, Aaron Taylor Johnson's 'Lieutenant Ford Brody'..... sadly 😔 .....{ -Lacked- } .Overall, I think this is a picture that would make the \" Kaiju 👉{ Japanese term of endearment for its subculture recognized the world over for 'Reveling' in giant monsters }👈 Crowd \" as a collective... { -Pretty- } darn proud ...Indeed. However, as regards the \" mechagodzilla ghithora Goliath \" : I'm going to -Have- to say that I -Don't- think that I quite \" Felt \" that, for whatever reason. The film's creators might { actually } have been 👉( Far )👈 better off employing some sort of \" Much more Terrifying \" .....( than 'Even' the undeniably fearsome 'Original' 3-headed gargantuar Ghithora from Godzilla-2 )..... -{ Cloned 🔴 }- monster, with -{ A Few }- mechanical 'Enhancements' made to it ; as opposed to going \" Full-Blown Robot \" on us. & Finally, to end on a positive note, I can't even -{ Begin }- to describe to you how \" delightfully-Ecstatic ( 💥 🤣 ) \" an experience it was, to watch that whole \"bleach-Satire\" episode play out .....( you'll -instantly- get what I mean, when you see it )..... referring, Of Course, to the -{ Thorough }- , & indeed 'bare naked' swipe the filmmakers took at one of ( \" a certain \" ) Donald. J. Trump's -{ Particularly }- infamous shenanigans in response to the Covid-19 Pandemic, during the latter part of 2020 .Summary : The film 👉{ Didn't }👈 have the impact that \" Godzilla \" { 1 & 2 }, -{ Or }- indeed, \" Kong : Skull Island \" had on me .... but-then-again.... I suppose it's incumbent & obligatory on my part to remind you, the reader, ( at -this- point ), that the 'all-crucial' \"Novelty-Factor\" within ( Any ) given movie franchise is -{ Bound 🤷‍♂️ }- to diminish... ( & Very-Significantly, At That ) ...with the advent of each new instalment, -Of- said franchise. So. -{ All }- things considered, I'm giving the picture \" A Loud, Supportive 7.50 Marks Out Of 10 👏 💥❗\" .",
    "16": "The special effects in this movie are great and Kong looks really alive.But my God, what an unbelievable stupid storyline in which really nothing makes sense.In a movie like this you know that realism is far away but this movie is nr 1 in unrealism.For instance going down in mother earth and the gravity reverses (WTF?) in a second crushing evrything going through. But Kong has no problem with it and the same for the humans in some kind of aircraft: ask a fighter-pilot what it feels like to pull 3G or more. And try to do it without a pressure-suit.....\nAnd than a whole world in the core of the earth?Please, only make a dumb movie about Godzilla but not something stupid like this movie with Godzilla and Kong together.The great special effects saved the movie a little bit and that's why I rated it a 5 but that is in fact to much....\nAnyone giving it more that six stars should have a brain-examination.....",
    "17": "Millions of dollars spent on effects that are simply loud and obnoxious. The story is NOT science fiction. It is meaningless technobabble. I like some actual SCIENCE with my science fiction. Grims fairy tales make more scientific sense.",
    "18": "I really wanted to see this one as I thought that Godzilla (2014) and Kong's solo movie were both fantastic. But unfortunately this one just doesn't cut the mustard. It's not horrible but it's not great either.",
    "19": "There's zero logic in this movie and way too many pointless characters and sub pilots taking up too much time for no reason..the graphics are great and the fights are good\neven though it felt like Pacific rim sometimesoverall it's basically fool's gold, shiny on the outside worthless on the inside...",
    "20": "Let's see...\nUnexplained non-back-stories, unearned emotion, characters you don't know but are instantly expected to relate to (like turning up at a stranger's family Christmas), trillion dollar effects with no semblance of realism whatsoever, dumbass \"jokes\" ...\nThese days it seems the film industry seems happy churning out kitchen sink formulaic zero quality nonsense which is tantamount to the distraction a kitten finds with a laser pointer or ball of string. This does not fit the cleverness, inventiveness or effectiveness of director Adam Wingard's \"You're Next\", which is one of the best horror movies of the last decade or so.This makes me miss blockbuster classics of yesteryear.",
    "21": "The least of the new GODZILLA series. This one has an interminable storyline with half-hearted plotting, throwing bits and pieces from the Japanese films into a blender and trying to make sense of the garbage that comes out. The human cast is particularly dull and cookie-cutter predictable, from a random cute native girl to the stereotypical comedy relief and one-dimensional villains. I wasn't impressed with the CGI or the way Kong is humanised with incessant pop music, and it's only in the final third that this finally starts to look and feel like a real kaiju movie; the climax isn't bad, but it's a long time coming.",
    "22": "I really like Godzilla and King Kong, but this installment was one hot mess.The plot is ridiculous, if there is even a plot at all. If there were, it's utter nonsense. There was very little develop of the characters, both human and beast, so the viewer finds little emotional attachment to any of the characters at all.What's left is pure action. And that wasn't even well done. There is nothing mind blowing about the action. Just monsters duking it out. Something could've been done utilizing the sheer size of the creatures to enhance their raw power and damage, but their size plays out like slow motion awkward clumsy blows.Because I really like Godzilla and King Kong, I wished more respect was afforded to them.",
    "23": "A movie which i was waiting for a long time. The epic battle between the two titans was simply amazing but the theory used, earth underneath an earth and the hollow earth phenomena was just simply absurd.Not to forget mixing the Kong with Thor. & in this part the Godzilla is more expressive, more flexible and way too fast. The ending, well not liking it at all.Could have been way way way better.",
    "24": "Fourth film in the \"Monsterverse\" series sees the long-awaited battle between Godzilla and Kong take place after a captured Kong (fifty+ years after his previous appearance) is being used by humans to navigate them to Hollow Earth, while an angered Godzilla attacks, only later events will cause them to team up after a rogue MechaGodzilla shows up...Disappointing entry has variable CGI but a mostly dumbed down plot filled with wild coincidences and contrivances not in keeping with the serious nature of the previous films, with human characters you care nothing about, except perhaps for the deaf little girl who is friends with Kong. Otherwise, a hollow endeavor indeed.",
    "25": "I don't what's so special about this movie. I am totally disadpointed. I watched previous movies of the series that was awesome but I really didn't like this, donno why? Maybe because of Kong, how can be he so weak all of sudden. What really doesn't make sense is if he could beat the robot which Godzilla couldn't, how can he be so weak who coundn't even stand infront of Godzilla for a while.",
    "26": "This would be the right recommendation to return to cinemas, taking advantage of the titular conflict's scale that, otherwise, wouldn't be so well experienced. And yet, I prefer to resist recommending in any way this film, since the public's appreciation is dependent on their acceptance of the rest of the wanderings through idiotic situations and characters.Despite its long history, there was an avalanche during the 1990s of a series of American films focused on large disasters caused by internal or external natural forces. If some sought to offer some human drama (see Dante's Peak or Deep Impact), most recognised the absurdity of the proposed situations and, thus, knew how to set themselves in the right tone to tell their narratives.Movies like Armageddon or Independence Day sought pure entertainment. Will Smith saying \"Welcome to Earth\" when punching an alien will be, for me, the highest sign of this understanding. In the simplicity of their narratives and the iconography of their visuals and charismatic protagonists, these films have allowed themselves to remain re-watchable and appreciable to this day, even beyond their cinematic quality.It will be perhaps from the 2010s that this type of movies begins to explain in a serious manner the underlying logic of their stories. Perhaps partly because the public already keeps an attentive look on the absurd plot-holes, given the wide offer of such films. Even the sequel to Independence Day (twenty years after the original) is hostage to this attempt to forcibly introduce apparently more modern and complex concepts and justify every narrative choice.It was this tendency that immediately crossed my mind, as I watched this and, thus, recognised the inconsistency underlying such an attitude. For, if the events portrayed understand the premise, at the same time they find the most chaotic entanglement of explanations to arrive at the illustrated situations.This isn't more obvious that near the movie's end, where Godzilla is headed to Hong Kong, while the giant ape is in the centre of the earth -whose journey had already required several technological explanations to overcome the unnecessary obstacles-; Godzilla then stops his quest to open a hole directly to the centre of the earth (and, conveniently, to where Kong is located), to quickly enable the ape's return to the surface, to allow the second fight to take place.The biggest sin is that we recognise simpler situations in which we could expose these creatures' conflict. The competition between two forces of nature for their place as the only alpha predator would be enough to justify the encounter (without needing to explain Kong's ancestry). In view of the volatility of the behaviour of these creatures, humanity itself would need to come into play in order to move away from potential extinction. Concepts referred here, but hidden behind a collection of ancestral connections between the two species and simple human villainy.Even the second confrontation between the creatures could have taken place in Kong's land, where he would be at an advantage, instead of creating such an expensive situation to justify the encounter in Hong Kong. It would further justify the presence of this territory (instead of illustrating the battles in urban environments where people are always seen in the background but whose consequences are never seen at that scale).Even by the end, the thing that unites both monsters, which could have been a simple robotic creation whose a.i. Gained autonomy, has mechanisms as complex as they are stupid. Mechagodzilla is generated through neuronal connections with a dead titan's skull and its energy source is remotely transferred from the centre of the earth (?!). All this is explained with such seriousness as if it were a plausible explanation.Thus, the movie needs to create these secondary situations just to justify the ones we really want to see, waiting boringly every forty minutes for the few moments of epic battle.And even these battles, with a new director with mere experience in horror (like with its predecessor King of the Monsters), lack the scale that someone specialised in visualising such visual effects can impregnate.The framing of the camera, moving with the monsters themselves and too close to them, doesn't understand the scale of how they should be seen. For, instead of illustrating them from a human point of view or, on the contrary, framing them entirely in the screen, we mostly see body parts and debris in successive cuts that, after some time, are more visual noise than anything else. Even Godzilla, which in 2014 was the slow but inescapable wave of destruction, now runs as if its size was not a factor to consider.Other than that, if there is any (minimal) effort in offering a history to the countless human characters that fill the screen, in the same way there is never time (or desire) to even meet them -beyond young Jia (Kaylee Hottle), the best and most wasted presence.The absurdity of the character of Brian Tyree Henry is the one that brings us closer to something like the Jeff Goldblum's character in Independence Day, as an individual who tries to offer nervous credibility to the most fanciful conspiracy theories and who expresses the most enviable skills as an engineer and hacker. However, his presence is so sporadic and unnecessary in his secondary plot-line later exposed anyway, that his sincere naivety is lost through the rest of such serious characters.Tom Holkenborg's score is a victim of this tonal dissonance, where the grandeur transposed by each musical track aggressively collides with what's seen on screen. The epic tone, where each note explodes incessantly in our ears, ends up losing its impact, when it's even used during the departure of a group of people from a ship, while Kong sits on a throne. It is a continuation of Bear McCreary's previous work, but here exhaustively applied.Not even in the simplicity of its premise can this experience be justified. Rather, its audience has to go through a frankly boring and excessive script to witness the few moments that don't even justify going to a cinema. It's just another case of an experience that doesn't know how to go for the tone or stand out from its former counterparts. This movie even seems to deplete the opportunities of this universe, following the previous movie(s). Perhaps it's time to revisit its better inspirations and not offer time to such weak attempts at modernising them.",
    "27": "Replace robots with 1 robot and two very ordinary looking monsters ,add in scenes written for a 7 year old watching power rangers / Utraman on tv, (there really is a scene where the spilling water on a console will disrupt the enemy at the most critical moment. Perfect setup for these kind of kids friendly superhero, mega-sized shows )plus knowning full well that that the two monsters on the bill cannot be killed ,you get this embarassement of a movie.",
    "28": "Right, well after that hollow movie experience that was the 2019 \"Godzilla: King of Monsters\", I must admit that my hopes for the 2021 \"Godzilla vs. Kong\" weren't exactly sky high. But still, knowing that if nothing else, then it would be a visual tour de force, then of course I sat down to watch this 2021 movie from director Adam Wingard.And yeah, \"Godzilla vs. Kong\" was exactly what I had believed it would be; and that being a movie that was fully devoid of a storyline that had just a grain of intellect behind it. And this movie is essentially a movie where you just disconnect your brain, lean back, grab the popcorn and just enjoy the visual effects. Sadly so, but I must applaud the CGI team behind \"Godzilla vs. Kong\", because they really worked their magic.The CGI in \"Godzilla vs. Kong\" were off the charts, just as expected of this movie. And the CGI team deliveres an in-your-face CGI galore here that is spectacular. I will go as far as saying that the movie is actually well worth watching for the special effects and CGI alone. I was completely blown away by the effects here, and the level of attention to detail was just grand.Just as with every other Godzilla movie in history, the human stories that they entwine into the battles between the Kaijus were insignificant, and I must say that the characters in this 2021 movie felt even more useless and pointless than ever before. I literally didn't care one bit for any of the characters, as they had the importance of paint on a wall, and had the same appeal. The characters felt like stand-ins milling about with no aim or purpose. And it was merely Kong and Godzilla that had any appeal in the movie. So names such as Alexander Skarsgård, Millie Bobby Brown, Kyle Chandler and so forth really had no moments to shine in this movie.\"Godzilla vs. Kong\" was a movie that was set up to be a major movie, but I felt somewhat cheated out of a grand experience here. Sure, \"Godzilla vs. Kong\" was watchable and enjoyable enough for the brainless Kaiju mayhem that it was, but I can't help but sit here now that the movie ended and thinking 'was that really it?'Again, moving back to the CGI team. I have to say that the final showdown between Godzilla and Kong, and then Godzilla and Kong against Mechagodzilla in Hong Kong was phenomenal. That scene alone more than made up for all the shortcomings that the movie was stacking in abundance. Having lived in Hong Kong, I must say that seeing this visual presentation of such destruction in that metropolis was just spectacular. Seriously, if for nothing else, then watch \"Godzilla vs. Kong\" for that scene alone.My 11 year old son and I watched \"Godzilla vs. Kong\" together and were mildly entertained. This wasn't a 'wow' experience in any way, aside from the CGI and special effects. A shame really, because Godzilla has been on a downward slope ever since migrating to American soil.My rating of the 2021 \"Godzilla vs. Kong\" lands on a six out of ten stars, and this is solely and without the shadow of a doubt because of the CGI and special effects and the fact that Kong and Godzilla got to duke it out.",
    "29": "If you are after brainless entertainment then this might suffice when the monsters appear, but there are long stretches of boring and unenvolving plotlines to wade through. I didn't expect much from this, but Skull Island was surprisingly good and much better than this. Jurrasic Park is still the benchmark of how to do a monster movie properly.",
    "30": "8/10 - while some problems from Godzilla: King of Monsters continue and it will certainly not win any storytelling awards, this visually-stunning blockbuster is truly epic.",
    "31": "A crazy adventure movie with moments of action.It is about a company that wants to go to a hole in the earth taking Kong as a guide and finding Godzilla.The first half is slow and the story is so irrelevant.Good effects.Nice fight sequences, but that's after the middle of the movie.Quality.Entertaining the second half, if you don't see the first, nothing happens.The passable performances.They try to put two stories to fill in the time and even a third monster.He does not talk about anything and does not seek something more than entertaining. It even feels more to sell.The open ending for the sequel.Crazy Sunday.",
    "32": "This is roughly what is expected of a film like this , nothing special, a common formula that sometimes succeeds and sometimes doesn't.We are simply oversaturated with similar movies that more or less all look the same. This is not a horrible movie, it has its fun moments, but it is simply nothing more than mediocre entertainment. The cast is not bad, but the actors are in the background here anyway, the main roles are played by CGI monsters. The direction is good, the special effects are great and that's about it. The overall impression of the movie would have been better had the characters been a little more interesting.In short, a somewhat entertaining film that is not a complete waste of time.",
    "33": "This movie it starts very promising but it continues very boring and with nonsense, characters development NOT AT ALL, accept the little girl that can communicate with Kong.The movie relies a lot to the visual and to the : \"we are trying to make MCU jokes and funny situations\" but it doesn't work at all that. First of all. It's not funny to copy Marvel and second you can't relying only to the visuals and waiting the movie to be nice.",
    "34": "The human section of this film wasn't great. Too many stock characters in too many hinky plots. Incredibly weird and un sciencey explanations for doofy events. However, the monsters put on a series of entertaining bar fights. Kong gets Thor's magic axe. Zilla gets anger therapy. Will there be a Mrs Kong? Where were Gamera and Mothra?",
    "35": "I didn't like the movie.Leaving aside the special effects, the plot is terribly bad, far-fetched and very difficult for children to understand.Bring two parallel stories, 1 the stories of humans seeking conspiracies, and 2 the story of kong and Godzilla,\nIt is unnecessary, the parts of the conspiracy seekers could well be cut and the movie would still stand and even improve a lot.Why such a far-fetched argument?But my God, what the hell is the Hollow Earth?It is an abuse of science fiction to raise another Earth within the earth, with a different gravity etc etc, it is too much! Or are they very high?But why the hell are they going to the hollow earth?",
    "36": "Godzilla vs Kong is wrestlemania. Two titans knocking seven bells out of each other and be the king of the ring.Godzilla has emerged after a few years away and attacked the headquarters of Apex Cybernetics. It's boss Walter Simmons (Demián Bichir) is up to no good and Godzilla knows it.Simmons is after a power source from Hollow Earth and needs Kong to help him find it.Kong is not happy as he is living in a virtual reality dome and he knows it. He communicates with a death girl by sign language but has a chance to go home, Hollow Earth.The story is basically Simmons is developing his own mechanical titan to teach Godzilla a lesson.As for the rest, Godzilla and Kong have a fight early on before there is a grudge rematch.The Warner Brothers Monsterverse have learnt their lessons. In Godzilla (2014) the monster hardly showed up in his own movie. In other films the action was in the dark.Here the titans fight in neon lit cities, skyscrapers come crashing down, human casualties are not even acknowledged.The problem the film faces is that both Godzilla and Kong are now seen as heroes and not villians.Each monster has their own fans. So the writers have an ace up the sleeve. A monster team up as they go after an even more powerful foe.The humans are the least interesting part of the movie. There are a couple of cute kids and nods to the previous movie. No need to spend money on A listers, save it for the CGI.This is the most fun of the Monsterverse. It gets the balance right, the villains are hissable enough and most of the humans are mainly background material.",
    "37": "The movie is a complete mess. I mean, what is even the point of the Kyle Chandler role. Payback from the producers for a favor he did them? And who knew that Godzilla was a pescatarian? Pretty much summed up by this: Alcohol, the cause of and solution to all of life's problems.",
    "38": "My wife and I watched it at home on BluRay from our public library. This appears to be a highly updated remake of the 1963 \"King Kong vs Godzilla\" which itself was a Japanese movie edited for American audiences. This current one uses updated themes, like use satellite signals and a virtual reality device to control the Mechagodzilla.It has lots of deep bass, lots of well done computer graphics, and a somewhat entertaining story that requires Kong to be brought out of his protected habitat on Skull Island to battle Godzilla who seems to want to destroy Hong Kong.Mildly entertaining especially for those who enjoy action overload.",
    "39": "CGI vomit of a film.No disrespect to the cast and crew.Plot is non-existant.Nothing to spoil. Whatever you expect to happen happens in the film.",
    "40": "Watch it only for the visuals, I you've never seen CGI before in your life. Don't expect any story or acting or anything. If you want any of those, watch another movie instead.",
    "41": "Godzilla vs. Kong opens with CGI Kong chilling in a CGI jungle and splashing around in a CGI waterfall. The mighty ape takes a CGI tree and throws it at the sky, shattering the illusion: he's really in a virtual reality containment area. At least that explains why nothing looked real. As you have probably guessed, I'm not a big fan of movies that rely heavily on never-quite-perfect computer generated effects, however, I am a fan of bonkers movies, and once I had resigned myself to the inevitable glut of digital trickery, I actually had fun with this gloriously silly kaiju blockbuster.It's possible to pick holes in the preposterous plot until the cows come home: from the moment two kids are able to track down a technology industry whistle blower who doesn't even have the sense to disguise his voice for his podcast, the film shows a distinct disregard for common-sense. But for me, that is the film's greatest appeal-it doesn't give a damn how daft it all becomes, never letting logic or the laws of physics get in the way of entertainment. And entertaining it most certainly is...Mighty lizard Godzilla is provoked to attack the HQ of high tech corporation Apex Cybernetics, resulting in destruction on a major scale. The company's top dog Walter Simmons (Demián Bichir) convinces Hollow Earth theorist Nathan Lind (Alexander Skarsgård) to join a mission to the middle of the planet in the search for a power source with which they can defeat Godzilla; in order to succeed, they need Kong to lead the way, and so the ape is released. With Kong freed, Godzilla launches an attack to become the 'alpha titan'.After a mid-ocean smackdown that leaves Godzilla mistakenly believing that he has won, Kong finally makes it to the Antarctic, where a tunnel leads to the hollow centre of the Earth. Deaf child Jia (Kaylee Hottle), who is able to talk to Kong via sign language, tells the ape that the tunnel leads to where he might find his family; when Kong heads for home, Lind and a team of scientists follow in anti-gravity ships capable of withstanding the perilous journey (and which are clearly a cinch to learn how to operate).What follows is utterly ridiculous (unless you're a Hollow Earth believer), as the ships arrive in the centre of the planet, which is home to all manner of monsters; ridiculous, but also hugely enjoyable. I particularly liked the bat-parrots that inhabit Kong's throne room (although I'm not quite sure what a throne room, statues and carvings are doing there-perhaps these relics of a once great civilisation will be explained in a future film).Power source located and secured, the scientists return to the surface (going out being a lot easier than going in), Simmons using his newfound energy to fuel his ultimate creation: Mecha-Godzilla! Unfortunately, all control of the giant mechanical monster is soon lost: cue the destruction of Hong Kong as Mecha-Godzilla attacks Godzilla, with Kong putting his differences aside to help the lizard fight the robot. Budget well and truly blown!Minor niggles: Hottle's perpetual 'raised eyebrows' concerned expression, and the fact that the kaiju appear to move in slow motion (it's always bothered me in other massive monster moves, but was particularly noticeable here. I understand that it's to give the creatures a sense of mass, but I find their movement a little 'off'). Still, it's a solid 7/10 from me - totally bonkers blockbuster entertainment.",
    "42": "I was so angry and disappointed with the dull human element of this film, some of the acting was appalling and stupid, but the action between the monsters is what saved it.The fights between Godzilla and Kong were amazing and had me on the edge of my seat, especially the last fight between Godzilla, Kong and Mechagodzilla, it was out of this world and I'm actually very happy with the outcome.I gave this a 9 just for the monster fights, absolutely nothing else.",
    "43": "A family film devoid of all substance. It's just nonsense. Even the kids got bored.There is nothing to grab on to. No thread of interest to pull on.It's just dross & an insult to great Kong films of the past.",
    "44": "I feel like they pump in millions of dollars into movies like this and of course get great effects but trash story could barely sit through it all. Complete drag and would never watch again. Overhyped and to much unnecessary things going on. Definitely just a cash grab and movie for the sheeple. Maybe would be actually worth the watch in 3D.",
    "45": "I mean, I was bored to tears watching this. The actors were unlikable and the story non-existent. It was a slog getting through this. That's 2 weak Godzilla pics in a row and the first was just okay to me. Meh.",
    "46": "Incomprehensible plot. Dialogue that makes Marvel look like Shakespeare. It must've taken a lot of talent to make a film about monsters battling over city skylines so boring. Oh wait we can't forget about the compulsory side plot of a teenager breaking into a high security evil corporation, we never fully find out what that was all about but rest assured knowing it was necessary for marketing purposes. So if you want a fun popcorn movie to see in theaters with friends run the other way from this monster fighting monstrosity.",
    "47": "With so sense, this movie is made. You dive deep deep into antartica to the upside world and the Godzilla can make that happen with the radar from the mouth.",
    "48": "Pretty good sequel. Amazing visual effects and non stop action, but I felt the story was a little confusing and convoluted. Despite that I still really enjoyed it.",
    "49": "WOW...\nThe way to really destroy a monster movie is to make it all about the people. I referenced \"saved by the bell\" because of the massive tween presence that lends nothing to the movie experience, just the script which is garbage.( A sample of what to expect)\nI could have used any daytime soap to convey the injustice...the indignity perpetrated against the essence of humanity. Against love, goodness and the innate beauty that is...HUMAN!... Uh,What?Oh and get this...there's a middle earth!!! Not that one. This ones ruled by monsters! I must have slept through that part in all the Godzilla and Kong movies I've seen over the past 4 decades. But wait there's more!Apparently, the two Kaiju are mortal enemies!Yeah, there's some counterfeit ancient Japanese imagery to prove it!So we have to protect Kong ( because he's nice) under a dome, because apparently he's just been slipping under Godzillas' radar for like...Millennia!On the subject of Godzilla, He's a helper of mankind!Doesn't attack unless provoked; until he attacked Pensacola and now! Dudes gotta go! We never could kill him before! But this time he attacked the panhandle! It's on!Back to Kong...Yeah, we need his help to find the most Mondo power source in the galaxy. So we're gonna chain him to a boat, leave him in the rain, and act surprised when he's \"upset\".\"but you're still gonna help us right?\"Writing of this calibre would blow past high school theatre to maybe 5th grade.On a positive note...They spent the money to make the guys look pretty cool.Wait for someone to stream it.",
    "50": "I may have seen many worse movies than this but there are so many bad movies it is hard to remember or rank them. Clearly filmed by a crazed CGI fanatic this is just a waste of money and time which could have been used to make an intelligent film. Sadly this also reflection on the standards of the audience these days and what they are prepared to watch.",
    "51": "Both King Kong and Godzilla stories are really good, especially King Kong.This is what passes for cinema in 2021, absurd story, awfull acting, lots of CGI.",
    "52": "One of the best popcorn flix you'll ever witness. This movie kept me on the edge of my seat from start to finish. This might get an Oscar for the best visual affects. Definitely worth our money and a great blockbuster! Don't miss this one guys..",
    "53": "What were you expecting? It delivers exactly what it promises.",
    "54": "There is no denying that MonsterVerse was getting dumber with each subsequent instalment but wow, this crossover entry is a massive leap in brainless storytelling. On one hand, it gives the fans exactly what they all came looking for, a real battle between the two most powerful forces of nature. But then all of it is ruined by the nonsensical plot & sci-fi claptrap which goes way past the threshold of suspension of disbelief for the viewers to just sit back & enjoy it for what it is.Directed by Adam Wingard (You're Next & The Guest), Godzilla vs. Kong lives up to its name in the sense that it offers an actual mano-a-mano clash between the two legendary monsters with a clear winner emerging in the end. But just about everything else that unfolds around these two behemoths is chock-full of issues. The script is an absolute garbage, devising events & scenarios that are facepalm-inducing. As for the human drama, it isn't just uninteresting this time around but also downright insipid.Compared to its predecessors, this latest chapter dives more into the sci-fi realm but it is never for once intriguing or engaging. The monster mayhem is when the film is at its most enjoyable, plus both the fearsome Godzilla & the mighty Kong get their moment to shine whenever they collide. It is a no-holds-barred slugfest between the two that gets ugly & intense, and is spectacularly shot & glorious to watch. But it also feels like the only thing in the film that has some stability to it, for everything else is an utter mess that's all over the place.Overall, Godzilla vs. Kong is fun & entertaining whenever the titular monsters are battling it out against one another and the anticipation for that iconic clash alone is enough to keep the viewers around till the end. However, every time it shifts its focus on human characters, all the shortcomings plaguing this braindead popcorn entertainer are instantly thrown to the forefront, thus resulting in a cinematic ride that's occasionally thrilling but mostly forgettable. Definitely the weakest entry in the MonsterVerse, the only good thing I can say about this dull blockbuster is that the rightful monster reigns supreme.",
    "55": "This movie is so unbelievably bad it's a joke. I only watched it because it's free on HBO Max, so thank heavens I didn't waste a single cent on this abomination disguised as a \"film\". Characters have no meaning or purpose besides the little girl. All of this happens just for some middle schoolers to spill a drink on a circuit board to defeat a robot godzilla? I could have come up with a better story/script in my sleep. Skip this cash-grab garbage.",
    "56": "This film start with Kong lying at the mountain, and Kong interact with a little girl \"Jia\" scene! As turnout, this film is about Kong, and Godzilla been lured to fight with each other, and eventually Kong need to save Godzilla by killing the Mechagodzilla! Entire film full of quite intense action scene! Such as, punching, headbutting, throwing, shooting, explosion, crushing, chopping, electrocuting, growling, and hitting! Make the film quite watchable! At the end, Kong pull the Mechagodzilla's head out to save Godzilla! Kong refuse to fight with Godzilla again at the very end! That's it! A quite entertain film!",
    "57": "In the current climate, people either love or loathe woke. This movie is absolutely woke and I consider it woke by numbers. As you go through, you can tick off the list. Worst of all, the substance of the story is let down because the people involved were obsessed with woke.For the woke, the story lacks substance. There is nothing original and it has too many white males. Even worse, the white males aren't totally stupid.For the non-woke, there is nothing interesting in this movie. If you can tolerate woke, there's nothing behind it. There is especially poor acting by Millie Brown whose ego has gotten the better of her.This film is suitable for people who like big monsters and nothing else.",
    "58": "Our lives are still quite raw after the events of January 6; where conspiracy theorists were front and center to the attempted insurrection of the US Government.Only to have Warner Brothers release a movie where a conspiracy theorist, Bernie Hayes (played by Brian Tyree Henry) is made out to the good guy. There are no words to describe the pain I had in watching that plot point evolve, including the indoctrination and radicalization of Madison Russell (played by Millie Bobby Brown) to his theories. I felt the only thing missing was a MAGA hat.The remainder of the movie was okay; some nice touchstones for people who are Godzilla junkies. The Megagodzilla battle was just enough.I'm just done with this franchise. The prior movie was abysmal, this one was a little less, but if this is what WB thinks is entertainment... wow.",
    "59": "Make no mistake, this is an animated movie. Sure, there are some actual humans screaming \"Oh My God!\" at green-screens. However, this movie is just filled with ones and zeros punching each other, while tens of thousands of digital humans are slaughtered against the backdrop of a ludicrous plot that would make a seven-year-old roll their eyes. The extraordinarily expensive special effects look cheap. Simple minds will guffaw at the spectacle.",
    "60": "Some of the best special effects I've yet seen and absolutely one of the stupidest movies. Maybe they should have taken one-tenth of the f/x budget and hired a decent screenwriter with it. Or housed some homeless. We have so much capability and, yet, wind up with something like this.I can't say any of HBO Max's simultaneous new theatrical releases have impressed me. Maybe it's a generational thing.My five out of ten is totally for the visuals. Everything else was a gigantic godzilla egg.",
    "61": "This is the best monsterverse movie in my opinion, movies specially made for monsterverse fan and if you are a fan of kong you will surely enjoy the movie from start to end, kong presence made every negatives in the movie forgettable, first half of the movie is lacking but after the end you will be fully satisfied, dont care about what critics saying and if you are a fan you will surely love the movie.",
    "62": "What a boring movie!!! The story is like a copy/paste from other movies, the characters are dull, everything is just soo stupid.My 2 stars are only for the visual affects.",
    "63": "There's a number of reasons why I weren't interested in seeing this. I did not like 1998's 'Godzilla'. 2014's 'Godzilla' was fine, but not a movie I'd be interested in seeing again. I absolutely HATED 'Godzilla: King of Monsters'. I didn't like 'Kong: Skull Island'...And here I am: I watched 'Godzilla vs. Kong', and I'm divided. I really enjoyed the first half of the film, but I didn't like the second half. Ok, here's what I enjoyed. Thankfully Godzilla is no longer a friend to humans (pffff, yup, remember he was friendly towards humans in 'King of Monsters'...). The visuals during the first half were impressive and featured incredible scenes not seen before. I also enjoyed the use of old music like 'Loving Arms' and 'The Air that I breathe' in this new release. Well, that's about as much as I enjoyed.The human characters were incredibly bland and one-dimensional and I didn't care for any of them. Bernie, Josh and Madison served as comic relief. Whenever they were on screen, they completely ruined the suspense, excitement and flow of the movie, and would have been better without these characters - who served no purpose anyway. Oh, and Kong can now do sign language...wha-a-a-a-ttt???! Is this the mighty Kong, or Mighty Joe Young? How is he so clever and friendly towards humans?The film fell to pieces during the second half. With so much CGI, it might as well have been an animated film. It was way too fantastical to be believable - especially when they went in search of Hollow Earth. And when Kong entered his world and found a glowing axe, he goes to sit on a throne like a fu*king king!!! (wha-hahahahahahah!!!! What the bloody hell!! Seriously??!!). The human characters clearly played no part during the second half, which become preposterous to say the least. And one of the characters said \"This is why Godzilla attacked Apex. They're trying to replace him.\" So, a MONSTER knows they're building a robotic Godzilla??? You mean, this creature actually knows what's going on and understands the concept of a robotic Godzilla? Oh, yeah, forgot to mention this; they're capable of building a robot identical to Godzilla, fire breathing and all... Who the hell writes this craps and then spoon feeds the audience with this hilarious stupidity and expect them to sit there glued to the screen??Towards the end the film became so absurd I almost stopped watching. Ok, so I'm clearly no Godzilla fan, but hell there are some beyond stupid ideas in this film! 'Godzilla vs Kong' felt like a mash-up of previous Godzilla and King Kong movies, Journey to the Centre of the Earth, Rampage, Mighty Joe Young, and almost every other Hollywood superhero blockbuster out there. Yawn... The best part about the movie was when the end credits rolled.Would I watch it again? Uhm, no!!!",
    "64": "The movie was alright and entertaining most of the way through, it didn't have the best characters or acting but it was fine, up until the end. The end reveal was so unbelievably stupid, seriously??? A godzilla robot is the reason godzilla came out of the sea and started wreaking havoc and in the end they fight together to destroy it. Seriously stupid movie.",
    "65": "Well the good; excellent next level sfx. The bad, they still don't know how to make a good movie first and sfx second. It's like children dabbled a story and pros colored it in.",
    "66": "Five years after Godzilla defeated King Ghidorah, Kong is monitored by Monarch within a giant dome on Skull Island. Kong is visited by Jia, the last Iwi native and Kong expert Ilene Andrews' adopted daughter, who is deaf and communicates with Kong via sign language.Bernie Hayes, an employee of Apex Cybernetics and host of a Titan conspiracy theory podcast, extracts data suggesting sinister activities at a Pensacola facility. However, Godzilla suddenly attacks the facility; during the rampage, Bernie stumbles on a massive device. Madison Russell, a fan of Bernie's podcast, enlists her friend Josh to investigate Godzilla's attacks. Apex CEO Walter Simmons recruits Nathan Lind, a Hollow Earth theorist, to guide a search for a power source into the Hollow Earth, the homeworld of the Titans. Nathan is initially hesitant as his brother died on an expedition to Hollow Earth due to a strong reverse-gravitational effect. He agrees after Walter reveals that Apex has developed HEAVs, specialized crafts able to withstand the pressure exerted by the gravity field.Nathan meets with Ilene and convinces her to let Kong guide them through the Hollow Earth via an outpost in Antarctica. Nathan, Ilene, and an Apex team led by Walter's daughter Maia board a modified barge escorted by the U. S. Navy that carries a sedated and restrained Kong. Godzilla attacks the convoy and defeats Kong, but retreats after the ships disable their power and trick him into thinking they are destroyed. To avoid alerting Godzilla, Kong is airlifted to the Hollow Earth entrance, and Jia convinces him to enter the tunnel while the team follows him in the HEAVs.Madison and Josh find Bernie, who joins their investigation. They sneak into the wrecked Apex base, discover a secret facility underground, and are inadvertently locked into an underground monorail transport to an Apex facility in Hong Kong, where they unwittingly stumble on a test of Mechagodzilla. It is telepathically controlled by Ren Serizawa, the son of the late Ishiro Serizawa, through the neural networks from a severed head of Ghidorah, but is hobbled by its power supply's limitations. Walter intends to harness the Hollow Earth's energy to overcome Mechagodzilla's limitations.Inside the Hollow Earth, Kong and the team find an ecosystem similar to Skull Island. They discover his species' ancestral throne room, where they find remains of an ancient war with Godzilla's kind and a glowing axe made from another Godzilla's dorsal plates. As they find the power source, the Apex team sends its signature back to their Hong Kong base despite Ilene's protests. Attracted by Mechagodzilla's activation, Godzilla arrives in Hong Kong, and sensing Kong, he directly drills a shaft to the throne room with his atomic breath. In the ensuing mayhem, Maia and the Apex team attempt to escape but their HEAV is crushed by Kong. Kong, Ilene, Jia, and Nathan ascend to Hong Kong, where Godzilla and Kong battle. Godzilla is initially overpowered by Kong, but Godzilla emerges victorious while Kong loses consciousness.Madison, Josh, and Bernie are caught by security and taken to Walter. Despite Ren's concerns over the power source's volatility, Walter orders him to activate Mechagodzilla. They lose control of Mechagodzilla, who kills Walter and electrocutes Ren, and then attacks Hong Kong. Godzilla and Mechagodzilla battle, but Godzilla is overwhelmed. Nathan revives Kong by destroying the HEAV, and Jia convinces him to help Godzilla. As Mechagodzilla overpowers both Titans, Josh short-circuits Mechagodzilla's controls with Bernie's flask of liquor, momentarily interrupting the mech. Godzilla supercharges Kong's axe with his atomic breath, allowing Kong to destroy Mechagodzilla. Madison, Bernie, and Josh reunite with Mark Russell, while Godzilla and Kong acknowledge each other before the two go their separate ways. Sometime later, Monarch has established an observation post in the Hollow Earth, where Kong now rules.",
    "67": "Every human is so one dimensional and implausible that I can't even begin to understand the nature of this film. Where did eco-terrorist Alan Jonah go to? He took the Ghidorah skull from the last movie and then suddenly someone else gets it? Why is Dr Mark Russel even in this film? He does literally nothing in three different parts of the planet. Why does Ilene Andrews call after Jia when she runs off? She's DEAF! Why is Maya Simmons in this movie? She's the disposable daughter of the mad genius who displays no talent at all and dies off camera.Let's ignore the sheer human deaths in the thousands in every major act. Yet in every film to date, these awful parents allow their children to interact with titans. Usually when it's raining. Let's forget that children are able to walk inside not one, not two, but three highly sophisticated and guarded locations without interference. Plus they hitch a ride into some kind of mag-lev container which is transporting eggs we never hear about again and has a display in MPH even though it's an Hong Kong craft. The only thing this film does better than Godzilla: King of the monsters is there's fewer scenes with rain. But there's still a ton of rain. Why? I don't know.Why did they need Kong to \"lead\" them into hollow earth. They already had a reinforced cave leading to it. Kong didn't do anything except fall through a wormhole unscathed. While the humans needed three anti-gravity spaceships to travel there. And of course the debunked defamed author Nathan Lind is somehow also a pilot who once safely back home decides to stay airborne to watch the Titans battle it out instead of getting far away like a sane person might do. And this magical author/pilot found the single switch on the control panel which turns it into an ape defibrillator. And sure, chain up a titan on a transport boat but let's rig up a single lever to let him go. Hey, here's an idea, let's upload the essence of a dead hydra skull brain into a robot's energy source.Let's talk about how every light source in the facilities, crafts and bases plus all the buildings are lit in neon trim like they looted the set of TRON:legacy. How come Apex needed this mysterious energy source from Hollow Earth and when they take a small sample, they only thing they needed was math to recreate it? Did you know all you need to interrupt a satellite uplink into an unguarded control room is a half flask of booze poured on the cooling fan? I didn't, but the randomly Australian comic relief did.There's hardly a hint of blood from either monster even though Godzilla rakes its claws deep into Kong's flesh multiple times and both are dragged face-first into glass and steel buildings. Kong is also a master axe-man who uses the blade as a tool, a key and a shield.I could go on and on about this film but I am exhausted. If only someone could fly a tiny spaceship into my chest and restart me.",
    "68": "The movie is a result of what happens when you give writing and directing powers to an eight years old kid under the influence of hallucinogens.No plot at all, kids saving the day, habitat in the core of the planet, giant monsters. Giant robot monsters, etc etc.It's a disgrace to both legacies of Godzilla and Kong.The only more ridiculous than the movie are the good ratings.",
    "69": "Withoubt doubt this has to be the worst Kong film ever made. The story-line was nonsense, the acting was just awful, and the \"connection\" between Kong and the lovely little deaf and mute girl was pure saccharine too sickly to stomach.",
    "70": "What the hell was that? The CGI was incredible but the \"story\" made no sense whatsoever. Would highly recommend... To someone I dislike.",
    "71": "It started off slow. Godzilla and Kong b!tch slapped eachother a few times, then it continued. The human story got in the way ONCE AGAIN, and the dialogue was terrible. But, the end battle, which was probably 40 minutes, was epic.The fight scenes were actually so good, and the CGI is absolutely amazing.My 69 year old dad was on the edge of the sofa, farting in excitement and saying \"but the amount of damage!!. How many millions will it cost? What about the poor people in that building the monster was just thrown through. Imagine they were just minding their own business, on a lunch break\".It's what a Godzilla/Kong movie should be - giant monsters, fighting .",
    "72": "Sitting through \"Godzilla vs. Kong\" was like watching clouds form in the sky, and actually, that would've been time better spent. Sure, the special fx were fantastic. The music wasn't too shabby, either. But the story? The acting? Oy! They were the equivalent of listening to 100 fingernails across a chalkboard. Almost every scene was completely implausible, from the idiot army generals who have to be told what to do my a primatologist, to the sheer ridiculousness of the Hollow Earth Jurassic Park. The annoying acting by EVERYONE was over-the-top atrocious to the point of distracting. Ultra cheesy open-mouthed, wide-eyed stares in this day and age just doesn't cut it. A machine that can suddenly think on its own? Who knew! Maybe my toaster raids my fridge when I'm asleep. They certainly spent a fortune on this crap and will, no doubt, get their money back x 5. I wish I could get my time back, though. Too bad.",
    "73": "Its just absolutely inane, preposterous, uninspired, OTT nonsense with its specious bare bones story just an excuse to have two CGI leviathans battle it out!Utter, utter crap imo!",
    "74": "Epic Godzilla Action Movie From Beginning To End.Spectacular Production & Great Scenes Of Dragon Fights.Delightful Film That Will Cheer You Up.Satisfaction Guaranteed.",
    "75": "Can't believe I wasted 2 hours of my pathetic life for this garbage.",
    "76": "This movie would have been much better served with about 1/3 of the characters it had. Kong, Godzilla, the Robot Godzilla and maybe like 4 humans with very little storyline would have served a much better movie. The action was co bit Jesus the characters were really really bad. Especially the trio with the girl from Stranger Things.",
    "77": "The fights were awesome, but what was the plot? Too much busyness going on to follow the story which wasn't really presented well. I would have liked a better ending where Kong finally finds other giant apes to end his loneliness.",
    "78": "This is definitely how to make a Godzilla vs Kong movie just pure bliss loved every second.",
    "79": "Has all movie making creativity simply disappeared? Who educates these writers and who hires them? Are they a dime a dozen? Is that the formula now - CGI and ginormic things with completely sterile story telling and character dynamics? Do we not even care about meaningful, even decent, flow? Or is it OK to just pile sequences on without any meaningful connection? How is this a 6 on IMDb? Who are the critics? Do they actually know anything or do they just happily work for this new industry based on movie making art that slowly died with the turn of the century?I miss you, Ebert. I miss the time when critics had courage to say it like it is and when audiences actually listened, or cared about the art of movie making.",
    "80": "I love Godzilla, I love Kong. Face to face they fight like there is no tomorrow for one of them. The battle is very entertaining and breathtaking. Visual are the best of all other monster verse by WB.The weakness is in the plot and story telling. They should paid a bit more attention on the story and human characters to make them at least interesting.Battle is 10/10\nStory and plot 4/10.",
    "81": "Good: Battles, visuals, sound, Kong, 'zilla and the entertainment.Bad: Human drama, logic, plot, comic relief, sci...ence?Watch it for the good alone, and you'll love the movie. I couldn't cut out the bad, so it was a let down for me.",
    "82": "Well, not quite. I think those words, uttered by Dr. Ilene Andrews (Rebecca Hall) is what we all expected, but quite honestly, by not presenting an out and out winner, the franchise can live another day if the studios see fit. I wish I could say I was more impressed by the film than I actually was. It's definitely huge on the big budget special effects and CGI, but I had the sense there was something missing to make it truly epic. When Mechagodzilla was introduced I was slightly bummed, knowing that the attention would shift away a bit from the title's mighty Titans and have to deal with the creation of the Apex Cybernetlcs CEO, Walter Simmons (Demián Bichir). With Mechagodzilla whipping Godzilla around like a rag doll, it didn't say much for the superiority of the King of the Monsters, later reinforced when Kong pulled Mecha's head off with it's spine trailing, reminiscent of the giant ape in the 2005 \"King Kong\" remake by Peter Jackson. My favorite laugh out loud moment in the picture occurred when Nathan Lind (Alexander Skarsgård) used one of those 'hollow Earth aerial vehicles' like a defibrillator to jump start Kong's heart to get him ready for the trip to Hong Kong. That was just too funny. All in all, a very much to be expected large scale spectacle to see on the big screen, but don't fool yourself into thinking that \"Godzilla vs . Kong\" implies a winner. That debate is far from settled.",
    "83": "Full of plot holes, poor character development, mambo jumbo technology (seriously, they emailed energy source!) and 30 minutes fight scene.",
    "84": "Every review keeps bringing up the same issue with this film: the human interaction scenes are boring.Guess what? We watched about eighty kaiju movies in the last few weeks and can honestly tell you that every single one of those movies can claim just about the same thing, so the venerable Toho got smart and added aliens and ape humans from the future to those scenes, as well as miniature singing women who worship Mothra so that even the non-giant monster moments of their films are real strange.To those of you not able to name the four different eras of Godzilla films - Showa, Heisei, Millennium and Reiwa - let me tell you, the human moments in this are in no way as bad as All Monsters Attack.That said, you can literally remove Godzilla and every single human from this movie and you still pretty much could have the same story. This isn't Godzilla vs. Kong as much as it's another movie that we could call Kong: Inside the Hollow Earth. Actually, those moments, where Kong and a crew of good and bad scientists goes inside a gravity well to wind up in a Skartaris or Shangri-La or Savage Land inside our planet are some of the best parts of the movie, topped only by Godzilla somehow being able to blast nuclear fire from Hong Kong to the middle of Earth's core without destroying the entire planet.So, if we remove those moments of humanity - there's a whole conspiracy theory plot with Milly Bobby Brown, Brian Tyree Henry and Julian Dennison from Hunt for the Wilderpeople that exists merely to give us exposition, show off some conspiracy theory under the world trains and explain who the big bad really is.Yes, unlike every human bad guy who has ever gone up against a giant monster, it turns out that owning a big company like Apex Cybernetics and using scientific expeditions to make money never really pays off.Director Adam Wingard made You're Next and The Guest. If I hadn't looked up that he directed this, I would have never known. It's a writer's room-made film, with the last creative team making rewrites so that everyone is in character. And it's another part of the shared universe post-Marvel Cinematic Universe aesthetic, where every movie leads to the next, unlike the Toho films where fans were the ones to create a patchwork No-Prize narrative that barely connects them.That said, you can just enjoy the huge set pieces here, like Kong and Godzilla battling on the deck of an aircraft carrier and the final battle in Hong Kong. It looks like paintings come to life, the kind of battle between giant monsters that I could only dream of as a child satisfied with foam suits and zipped-in actors.Ishirô Honda, who directed the original King Kong vs. Godzilla and made a movie that satirized Japanese TV along the way, once said \"The reason I showed the monster battle through the prism of a ratings war was to depict the reality of the times. When you think of King Kong just plain fighting Godzilla, it is stupid. But how you stage it, the times in which it takes place, that is the thought process of the filmmaker.\"So is this film dumb? Well, it was sold at some Carl's Jr. Restaurants with Godzilla hamburgers and Kong chicken sandwiches, the exact kind of commercialism that the Toho movie made fun of with Kong yaki noodles. But it is a big tentpole Hollywood movie in the weird second year of there not being a lot of places ready to show it.But hey, it does have monsters named Titanus Warbats and Kong gets a radioactive axe, so I can't be all huffy and say that I didn't enjoy it. I still have an entire shelf full of much better kaiju films - ask me, I'll recommend like twenty to you - to enjoy whenever I want, but today's children need a movie like this to get them excited the same way I was back in 1976, going crazy for Kong in theaters and Godzilla on UHF monster host shows.",
    "85": "I was hoping to see non stop fights in this film. Of two iconic monsters. When we do see them fight the effects are fantastic. We only get about 40 minutes of these monsters fighting. The rest is filled up with terrible actors. Giving us terrible and corny dialogue. That ultimately leads to Mechagodzilla's reveal. Forced movie team up of Godzilla and Kong to defeat Mechagodzilla. I was not a fan, of how much of the run time is focused on Kong. I feel like we could have gotten some more Godzilla screen time in the film.",
    "86": "I wasn't expecting this to be anything great but it was still a disappointment.",
    "87": "The 4th in the series of reimagined monsterverse movies finally sees Kong and Godzilla brought together. In the mythology of this series they are both on our side, kinda, as \"Titans\", avatars of worldwideworthness, but they are also huge rivals. In particular, Big G can sense Kong leaving Skull Island: apparently he needs to go home to get an upgrade, and home is apparently the hollow centre of the Earth. We also have a number of human factions, all of whom have their own agendas.There is quite a lot of apparent plot here, but much of it is unnecessary and irrelevant. However, it is nicely played by a good cast (no Nick Fury, Captain Marvel or Loki, but we do have the lady baddie from Iron Man 3). There is also a great deal of utter, utter nonsense: Florida to Hong Kong by secret high speed underground tube travel in what appears to be 10 minutes, anyone?But, of course, this is all about a pair of 400 foot tall antagonists beating the snot out of each other, and that is there in abundance. Hong Kong will never be the same. And, unlike the first in this series, you can actually see what's going on.It really is the most ludicrous tosh but, even while I was shaking my head at how preposterous it was, there were times when I felt like cheering.This is hugely enjoyable big-budget trash cinema.",
    "88": "The thing that stuck with me here was how much I hated the cinematography of this movie. A follow-up to a well-cast flop, this movie gave me vertigo! I'm typically not very critical of such things but the constantly spinning cameras made it impossible for me to enjoy this movie. I very much enjoyed Skull Island, however this was more in line with the \"Godzilla\" flop of last year. If others enjoyed this movie, I'm happy for them, however I was not one of those people.",
    "89": "It's really weird that they chose a little girl to communicate with Kong. I could be wrong but I don't remember her in any of the previous movies. To make things worse they don't actually speak. Most of the Kong interactions are Rebecca Hall kneeling behind the girl doing signs while she passes them to the little girl who passes them to Kong and Alexander Skarsgaard stands behind both with a bewildered look on his face.The Millie Bobby Brown story was a little ridiculous. It's like she was in favor of Godzilla destroying cities and killing millions because he was disrespected. There was very little comic relief there either. They just tried to make conspiracy theorists seem insane. When actually the guy was pretty right about everything.I wasn't expecting much from this movie. The last Godzilla movie was awful. This one is better. I can't get over the fact they made the main character a little girl out of nowhere. I didn't feel a connection to any of the characters or to who won the fights. I also knew they'd cop out and have them work together at the end. Predictable.",
    "90": "This movie couldn't been done SO much better without the whole \"Hollow Earth\" nonsense. And we have Kong living in a dome now? Give me a break. So many things that make no sense as well. They keep saying \"if we take Kong out of here Godzilla will come for him\", so let's chain him on a large ship in the middle of the ocean...that'll keep him safe....\nAt the end we have the little girl who bonds with Kong trying to tell him in sign language that the atomic breath giant lizard that came after him in the ocean and almost murdered him is \"not the enemy\" and Kong is like \"oh!! I guess I misunderstood that\". So predictable and stupid. And Millie Bobby Brown and sidekick were incredibly annoying.One more complaint...so this super high tech cybergenetics facility Apex that can create a Mechagodzilla cannot afford security cameras anywhere on their facility. I could go on and on...",
    "91": "Wow!!! I thought the premiere of WW 84 was a hit mess from movie hell... well hold my beer Diana, Godzilla and Kong are stepping up to the plate and we are bringing MechaGodzilla along for the ride!What a convoluted mess of a schizophrenic piece of boiling hot crap!My absolute favorite is the using of some fandangled hover craft anti gravity electromagnetic wanna be Tesla craft as a defribulator! Wow!!! Now that's creative script writing.Cant wait to see what crap Hollywood churns out next.",
    "92": "This was a solid giant monster fight flick. It has some great visuals of Godzilla and the fight scenes are excellent. Especially the final battle which is really tremendous. The script sucks big fat rocks but who cares? It's kinda cool to see the dad and daughter from King of Monsters back. No surprises but there is another classic Godzilla foe who shows up and I thought they did a decent job with this character. I wish I had seen this film in theaters. That is my only regret.",
    "93": "This movie is made with for the fans. Full stop. This match up was long in the making, similar to the old WWE days where we wait for Hulk Hogan to take on. Randy Savage or Undertaker bashing Ultimate Warrior. The anticipation is fever pitch. The movie does not disappoint. Both leads are given generous screen time, and the human supporting cast rendered nothing more than cursory talking heads. We came for the big fight, and man, did we get that, and more! This was a total contrast to that massive disappointment last X'mas (the one where the two protagonists had a shoving match as the climax), this movie had our lead characters raining major concussion endlessly on each other. It was so so satisfying. At the end of the day, this was money well spent at the cinema, and, I for one, will be getting my hands on the.special edition DVD when it comes out.",
    "94": "Kong is lured into the Hollow Earth to retrieve an energy source to stop Godzilla's mysterious rampages.Adam Wingard deliver all the spectacle you'd expect from a series of expertly choreographed fights between titans but it comes with caution.Lapses in logic, distract from some solid action and special effects set pieces. Many of the illogical moments come from Brian Tyree Henry, Millie Bobby Brown's Madison and Julian Dennison's Josh Valentine. On introduction to Henry's Bernie Hayes he blatantly echoes Jurassic Park's Dennis Nedry. Both Eiza González and Alexander Skarsgård are notable and are stellar actors but are lost in the special effects and mayhem. Rebecca Hall and Kaylee Hottle are good but feel borrowed in part from The MEG and Congo.In a bid to be world building Godzilla vs. Kong lacks the grounded feel of Kong Skull Island and Godzilla. Elements wouldn't look out of place in an Independence Day or Tron sequel.When the movie goes to the hollow earth, it takes an unexpected turn, while rich in new monsters, complete with a gravitational floating Kong, that coupled with an on the surface Mechanical Godzilla it's far removed from its predecessors. In amongst Kong actually becoming a king and both title monsters having a roar of showdown and more we actually have a moustache twirling bad guy.For fans, there's a moment with Kong on the ship that is reminiscent of Kong 1976 and many other nods to both franchises. Godzilla: King of Monsters fans may get more out of this outing but fans of Kong: Skull Island could find it harder to swallow thematically.Overall, its tonal seriousness doesn't fit well with its big budget, B-movie premise. It turns from science fiction to jarring sci-fi fantasy. Nevertheless, if that's your thing you'll enjoy.",
    "95": "Somebody forgot to put a movie in-between the CGI shots, yes, to me it is boring to see two computer-animated creatures battle it out in a once-again physically impossible environment. The human touch is not here at all (one saving grace is the deaf child Jia, played by Kaylee Hottle) but the comic relief (Brian Tyree Henry as Bernie) is not funny and almost entirely pointless, so as the other useless human characters.This movie is rated PG-13 and not even one drop of blood is shed in the entirety of this movie! (some monster \"blood\" is shown in one scene and the producers made sure it is green and not red). I would say 13 is about the right age for this movie, the story is bland as a computer fighting game; makes it feel like it was written by a 10 yr old. Don't expect too much out of this one and you might enjoy the scenery.Exact score: 56 / 100.",
    "96": "Everything in this movie screams cheap and rushed. Poor acting, poor structure, poor casting, poor directing, lazy plot, cheap CGI and etc. Everything is just so cliche, from the villains to the protagonist they're exactly what you'd imagined them to be without any added depth of character, add this with bad acting and you have a two-hour cringe fest. Not to mention how everything is so convenient for the characters (a common symptom to lazy scriptwriting), like how when all of a sudden they need helicopters to move something big somewhere and then BAMM!!! Helicopters out of nowhere! Conveniently appearing to save a poorly laid out plot from crumbling on itself. And like when they immediately need special high tech transports to go somewhere no man can go.... BAMM!!! High tech transports conveniently plotted out and so new that even it's makers seems to be surprised by what it can do....The only thing redeeming about this movie for me is that Godzilla looks freaking sick and the fights are good, but even that couldn't convince me to stay for the whole movie.As a Godzilla geek I feel betrayed... That something as Iconic and legendary as Godzilla could be made into 'Just another summer movie'. It's almost like the whole team treated Godzilla (and Kong) as just another assignment, instead of the iconic titans that deserves an equally iconic movie. The end-result is a poorly thought out movie that didn't even come close to delivering. Just leave Godzilla to the Japanese, they have the passion where Hollywood lacks it.Rating: 1/10.",
    "97": "This movie doesnt have a single minute that makes sense! I finish this review and I'm going to check who wrote this piece of cr... and make sure that I will NEVER EVER WATCH ANYTHING FROM THIS PERSON AGAIN. I might overrated it with 2, it is probably lower than 1.",
    "98": "Excellent fight scenes and special effects. Very colourful with good creatures and locations.The human element of this movie is typical wokeness. Men are morons or evil. Females are intelligent, strong and loving.Dont watch this movie for its script, characters or dialogue. You'll only be irritated or disappointed. But the action is brilliant as is the CGI.",
    "99": "The humans in this movie were totally unbearable. It ruined the entire thing for me.",
    "100": "This has to be the worst character development of all monster flicks, with a story riddled with plot and technical issues. It was predictable and uninteresting with a convoluted and childish plot. The 113 mins can easily be skipped to just the epic battles, you wont miss anything in a story that is barely there. A generous 6/10 from me.",
    "101": "GODzilla Vs KINGkong . It's a feast to eyes for action lovers . It's the movie all the fans of Godzilla & King kong are waiting for . The script , direction and visual effects are done wonderfully . There is not even one dull moment in the film , unlike previous two Godzilla movies . There are some goosebumps moments which makes people scream . Millie brown , Brian , Julian made some funny moments .\nThis movie being released first in India , one week before USA release Is a smart move . Result of which most of the people in India can watch this epic in theaters . This is not a movie to be watched in OTT or pirated print or DVD . Experience this epic in\nnearest theatres , take all precautions of covid .",
    "102": "Kong knows how to communicate like a person? Monsters know karate? Not only is there no winner, but they become friends?Besides that, the one thing I could not get past is the monster sizes. They changed throughout this mess of a film often. The biggest thing, is everyone knows Kong is nowhere near the size of Godzilla. Not even close! Kong would be a tiny annoying pebble stuck on the bottom of Godzilla's foot. Godzilla stomps on buildings. Kong climbs them. What a joke. The only reason this abomination gets 2 stars from me is the film quality/special effects.",
    "103": "This movie delivered as promised, Godzilla and King Kong duking it out. The storyline was a bit far fetched... but can you really expect anything less? All things put together it was pretty good, the cgi and cinematography were amazing to watch.",
    "104": "While the sci-fi of the 4 movies naturally has lots of holes trying to justify giant monsters in modern times, once you buy into the monsters and their unique personalities, then you are in for a serious treat!!! :-)Each monster looks gorgeous, and I could never have imagined the fighting action being this good! :-)",
    "105": "The 4th movie in WB's MonsterVerse is as action-packed as you'd expect! Aside from a few frustrating character choices and flat jokes, the CGI is superb and the movie doesn't rely on the previous films to tell the story.",
    "106": "Godzilla versus Kong is the best new movie I have seen in years. It offers exactly what you expect. Monsters fighting. No politics, no hidden messages and no Political Correctness. The story is really Kong's and he is the hero of the movie. His relationship with the little deaf girl Jia really well and I like the way that Kong is able to win against Megagodzilla and lose to the real Godzilla. One complaint some people have is the lack of importance of the human characters. That is actually not true. Dr. Nathan. Lind ( Alexander. Skar.sgard) saves Kong not once but twice during the movie ( risking his life in the process), and Kong learns to trust the good humans like Lind not just Jia and Dr. Ilene Andrews ( Rebecca Hall). However, the bad ones like. Mai Simmons ( El.za Gonzalez) get their just rewards. Spoilers ahead; Godzilla is secondary to Kong but you see just how powerful and mean he actually can be. Although he does acknowledge Kong saving him and goes away ( which might be as nice as Godzilla can be). If you want to spend time and have fun with a movie you cannot go wrong with Godzilla versus Kong. Easy 10/10 stars.",
    "107": "Everybody knows the main event in these titan movies is to see massive CGI beasts having a battle. But you can't do that for 2 hours because it'd just be boring. All things considered, I think they did a good-enough job of making the silly human parts fun to watch.This movie certainly has its flaws -- distance, time and gravity meant nothing to the writers, and Kong is way too smart -- but dammit! This is \"entertainment,\" and the battle scenes are gorgeous and fun to watch. Just about every hit is rewind-worthy.I always go into these Godzilla movies thinking they're gonna be totally stupid, but I end up loving each one by the end. Nicely done.",
    "108": "Brilliant movie, honestly I loved it. 10 out of 10 for me.",
    "109": "I'll say from the off, I was disappointed. Not as much as the first two Godzilla movies, but I was let down. It wastes far too much screen time on the poorly written human characters, you don't care about, and a convoluted plot, when all I wanted to see was Godzilla V Kong!! I've paid to see a monster movie, give me my monsters, damn you!!As you know, I was so excited for this movie, and it was so poorly handled, I was left sighing a lot, I was so annoyed by its plot, that I just didn't buy anything in it. Something that constantly took me out if it was the scaling of Godzilla and Kong, was inconsistent. They looked much bigger when they were trashing Hong Kong, than when they were on the aircraft, it looked great visually, but I had to think how on earth is that staying afloat under their combined weight.Amazingly, in a movie where all anyone wants to see is two Titans knock the s**t out of each other, there are 3 messy plots going on at once. It's full of plot holes, especially the sci/fi element, I can overlook a lot in movies, but it really made me tune out.1; The Kong plot; Stellan Skarsgård and Rebecca Hall take Kong to the Hollow Earth, to get some power thing, that's not 100% clear why, except the ulterior motive.2; The Godzilla is randomly attacking plot\n3; The totally pointless Millie Bobby Brown and her friends plot, which is easily the weakest one. Her character was front and centre during King Of The Monsters, why is she in school listening to a consioricy podcast?? Why is there even anything like this?? Were the events of the first two movies not covered by ANY news outlets?? You totally could have done away with these characters, and nothing in the other plots needed to change. And what happened at the end, with one poring a drink on a keyboard, was laughably bad!! A cleaner (wearing headphones of course) oblivious to the battle (as they always are), could have accidentally pulled the plug out, or a rat (like in Endgame) could have chewed a random wire and it wouldn't have been any stupider than what we got!!It's a very Kong centric movie, which I was glad about, as I'm Team Kong due to enjoying Skull Island, but I did not like either Godzilla movie. I turned off the first and walked out of the cinema during King Of Monsters.They did make Kong a little too human, though, especially during the opening as he scrathed his ass, en route to his morning shower. Was this so audiences known to root for King Kong. I have to say Godzilla is essentially a side character in his own movie.I could have done without the entire Journey To The Centre Of The Earth section, it feels like that was from another movie, entirely. One I would have gladly paid to see, but I did not care for it here. It just caused more plot holes. If Godzilla can so easily blast into middle earth, why isn't he just chilling in Hollow Earth?? But the charging of the axe section was ridiculous and sending data from a sample from middle earth, is not the same as them having an actual sample, so that was all bulls**t too. As was Kong travelling from the centre of the earth (approx 4000 miles) in no time at all.The majority of the humans were a waste of screen time. We only need one group of humans to follow in this type of movie!!In this we have a Stellan Skarsgård led gang with Kong and then the villains OK. But we also have Millie Bobby Brown (pointless), Bryan Tyree Henry (annoying) and Julian Dennison, whom I loved in Hunt For Wilderpeople, but he serves no purpose here, except for that one laughably bad thing at the end!! His character could have been merged with Henry's for one character and the movie would not have been any worse. Thankfully Kyle Chandler's role is reduced, as man, he can not act in these movies. I get a feeling a lot of his role is on the cutting room floor, not that I'm complaining, but I don't think Chandler would have signed on for three scenes!! My favourite human character was Kaylee Hottle as the deaf girlI had so many questions, watching it;\nHow did they build that dome on Skull Island??Why is Rebecca Andrews in charge of Kong?? Did I miss something in Skull Island??If Kong's ancestors wielded the axe before him, as they were battling Godzilla for decades, how old is Godzilla?? How long was Kong on Skull Island alone for??How did everyone get to Hong Kong so quickly?? Some of its issues with people travelling, reminded me of Game Of Thrones Season 8!! That's never a good thing.If they could so easily fly Kong, why would they choose to take him via water, where Godzilla is??What was the main bad guys aim, in building Mechagodzilla??It was a popcorn movie, I knew this going in, so I wasn't expecting high art, but damn it let me down. I know I sound like I hate it, I don't, it looked great and I did enjoy the fighting scenes, they were great, but I was let down.",
    "110": "Who cares about the plot? What we really want to see is the battle of the Titans and this movie delivered. Some stories don't need to be complex, this is one of them. As a fan of the old Godzilla and Kong movies, this was a goodie. Just buckle up and enjoy the ride!",
    "111": "This one came out pretty much as I expected.All the scenes with Godzilla/Kong are all fantastic.All the scenes without them seriously suck!Good overall but could have been much better.",
    "112": "This was MUCH better than expected! Yes, there are some weird characters but it seriously didn't distract from Kong and Godzilla. Done very well and I'm a HUGE Godzilla fan!",
    "113": "Waited hella long for this movie to come out and it did not disappoint! Enjoyed the big monster fights, storyline was good, and ending felt satisfying. Watch with on a big screen and great sound speakers, if you can. FYI...no extra scene after the movie ends.",
    "114": "I expected a basic monster v monster movie and got it. No plot, no actual acting with the possible exception of the little girl.Could have be done all CGI with no actors and you couldn't tell the difference. Writing appropriate for a six year old's fever dream.",
    "115": "This Movie Wow Going to be a lot Of fun has everything you want in a movie.",
    "116": "I liked it but for a monster flick, I think we've seen better. Even for a Godzilla movie we've seen better. I think it was a little lackluster.Another user mentioned humans get in the way of monster movies in general. While I don't share that sentiment with all movies, I think that was a flow of Godzilla vs Kong. Another critic is hollow earth variable was kinda weak as well, like they coulda have left it out.I will probably end up loving this movie next time I watch.",
    "117": "We all know why we're here, don't we?Of course - we want mindless destruction with awesome monsters and great visuals, and if it was only about that, this film deserves some praise, indeed. I very much liked the wrestling component of the fights, with some of the highlight moves being some of the most satisfying examples that ever graced the screen.However, with all the monster madness there is something that most of these movies seem to get wrong almost every time: the overall plot and characters.Now, I certainly don't expect grand drama and acting excellence from a flick like this, but GODZILLA VS. KONG is a remarkably bad example for both of these aspects. All characters were pretty bad, and the plot... oh boy.Let me put it this way: when the movie is trying to be smart, it's pretty stupid. But when the movie is stupid, it's absolutely brainmeltingly stupid. The techno babble is annoyingly idiotic, down to a point where it completely took me out of the film, laughing hard at the audacity the writers had when typing these lines. The acting is at best alright, but Rebecca Hall's overacting and the astonishingly unlikeable attitude of Millie Bobby Brown's character ruined a lot of the already unbearably inept plot. Alexander Skarsgård's talent was pretty much wasted here, while all the others seem to come directly from that direct-to-video sequel to Roland Emmerich's Godzilla that never happened - for good reason.All in all, I can only recommend this film if you're able to leave your brain far, far behind and to focus only on the action itself. This is basically a script from 1997, made with today's technical possibilities - a script that probably even Roland Emmerich might have thought was too stupid.Also noteworthy: when the Tom Holkenborg score isn't the worst part of a movie, you know that something's off. Although, to be fair, this was actually a pretty decent score for our less talented Hans Zimmer clone.Don't believe the hype though. Instead, get drunk before starting to watch this, and you might have a good time.",
    "118": "The poster says it all. Half blue, half red.When there is an Open AI program that can generate movies from all the previously existing movies, this would be one of those. This movie is so predictable and boring I actually suspect that at least 80% of the script was written by an artificial intelligence. It's so predictable it's ridiculous.I envision the day when movie studios won't even bother making movies: they will simply give the formula and the values of the variables for you to fill in. Like \"protagonist's daughter ethnicity=9, protagonist's education level=PhD\", and so on, and so forth... Or maybe we should scrap this entire genre completely.The \"Power Rangers\" franchise is more entertaining and intellectually stimulating than this crap. I wish they would stop doing this kind of movie. At least they would leave a space for someone to do it properly. This way they poison the well for everyone.Even the minor details in this movie are of full crap, like the fact that the little girl wears a f**king useless hairband that doesn't hold any hair, and we are supposed to take that as some sign of \"ethnic\" value or some s*it, or the fact that the evil CEO sends his own gorgeous daughter to a wild goose chase where she is 99% certain to die a horrible death, or the fact that the daughter of one useless scientist goes on a treasure hunt with a fat androgynous teen and a crazy conspiracy theorist only because the actress in this role is none other than the star of \"Stranger Things\".This is not a movie. This is an epic disaster.",
    "119": "The latest entry in the Monsterverse was built up to be a truly unforgettable battle of two cultural icons - Godzilla and King Kong. Unfortunately, 2021's 'Godzilla vs. Kong' is a colossal letdown - another casualty of overhyping and underdelivering.Being that this is the fourth installment in the series since it was resurrected in 2014 with the reboot of 'Godzilla,' it's expected that we'd start to have sequelitis at some point. 'Godzilla vs. Kong' has a few things working against it, including the fact that it has to come up with a half-baked plot to string things together, even though the real selling point is seeing two classic monsters go toe-to-toe with each other. Sure, a standard plot is probably necessary, but one could argue that a full 113 minutes of building smashing and body slamming would've been a better product that what we get here.Sure, it's cool to see Millie Bobby Brown reprise her role as a monster-crazed teen, but she was relegated to almost a cameo to make room for others to clog up the screen, like Alexander Skarsgard and a young actress who portrays a deaf girl native to Skull Island. There's even more jumping around to all corners of the planet here, to the point where teleportation or apparation must actually be a thing. And don't even think about trying to make sense of anything (not that you would, given the subject matter).The most disappointing part of 'Godzilla vs. Kong' is the ending. Fans of the series were promised something that clearly didn't happen, and for that, Warner Bros. Should have some explaining to do.",
    "120": "\"Godzilla vs. Kong\" is the fourth film in Legendary Pictures' \"MonsterVerse\" and the fourth Godzilla film produced in the west. Starring Millie Bobby Brown, Julian Dennison, and Alexander Skarsgård, it delivers exactly what it says on the poster - a pair of iconic monsters duking it out in the most epic way possible ...and very little else.Sometime after the events of \"Godzilla: King of the Monsters\", the giant ape Kong is being kept under surveillance inside a large simulated habitat, forming a bond with a deaf girl who communicates with him through sign language. One day, Godzilla attacks a city in Florida for seemingly no reason and this sparks an international debate over whether or not these huge monsters are a threat to humanity's future. A team of experts soon deduce that Godzilla was actually tracking Kong's energy signal and decide to transport him somewhere secret in an effort to prevent the two of them from fighting each other and causing even more collateral damage.When it comes to giant monster movies, you can't go too wrong with the ones featuring the undisputed king of the monsters himself - Godzilla. Since 1954, this giant reptilian has been stomping his way through cities battling various monsters of similar size with his brute strength and trademark atomic breath. Every time I hear Godzilla's signature roar, it gives me chills like the first time hearing a lightsaber turning on in \"Star Wars\" or the DeLorean from \"Back to the Future\" reaching 88 miles per hour. Likewise, the enormous gorilla Kong has also had his fair share of time in the spotlight, debuting all the way back in 1933 in the classic film \"King Kong\". With this in mind, it seems fitting that these two iconic titans of east and west should face off against each other at some point, having previously done so in 1962's \"King Kong vs. Godzilla\". Now in 2021, we have a brand new reimagining of such a rivalry, complete with better special effects and destruction galore. There's something so mindlessly satisfying in seeing giant monsters beating the hell out of each other while leaving heavy destruction in their wake. I guess it's all just part of the entertainment value we can take away knowing it's all in good fun and that we can be thankful such colossal creatures don't exist in real life. However, if you are expecting to be treated to anything else beyond this, you will be greatly disappointed. Regardless, if fighting monsters and gratuitous demolition of skyscrapers is what you crave, then this movie certainly delivers.In addition to this, the film also touches on the mythology of these strange beasts (known as \"Kaiju\" in Japanese), with particular focus placed on Kong and his origins. I'm no expert on Kaiju lore or anything like that but I did enjoy that we got to see how these towering figures aren't evil beings with a lust for destroying everything, but rather neutral parties trying to establish their place at the top of the monster food chain. Of course, the level of neutrality varies for each of the two, with Kong perhaps being \"True Neutral\" and Godzilla being \"Chaotic Neutral\". For example, Kong is seen attempting to live peacefully on Skull Island under the pretense that he is in charge and nothing else can take that away from him. Later on, when Godzilla arrives to challenge this notion, an all out brawl ensues, much like how predator animals like big cats would fight one another to establish dominance. We are informed it has been like this for thousands of years and that human civilisation has only popped up recently, just being on the brink of learning how to co-exist among all this ongoing conflict.There's not much to say about the film's human characters, as they are only there to help move the small remnants of the plot along. Most of them were either generic military personnel marked for death or scientific minds trying to make sense of all this madness. I suppose Millie Bobby Brown was the only actor in the film with some dimension to her, as anyone who saw 2019's \"Godzilla: King of the Monsters\" will recall her character and her importance in that story. I did also like the film's scenes with the deaf girl talking to Kong via sign language, as this reminded me of the famous gorilla Koko who was taught how to communicate with her trainers through similar means. In spite of all this, by the end of the movie, I couldn't recall a single name of anybody other than the titular monsters, remembering them by the actor's real names instead of their characters. At the same time though, it didn't really matter because at the end of the day we don't pay to see a giant monster movie for the human characters for the same reason we don't go to McDonald's to order a filet mignon. Godzilla and Kong's names are in the film's title and it should be obvious by now that they are the real stars here, not the humans.As far as giant monster movies go, \"Godzilla vs. Kong\" does a serviceable job at entertaining us with frequent action and great special effects. It's mind numbingly simplistic but I wouldn't expect anything less. At this stage, it is unknown if there will be any more films in this \"MonsterVerse\" but I do see potential in the franchise continuing for as long as the demand is there. Since there are still plenty of threatening monsters out there to be dealt with, I remain hopeful.I rate it 6.5/10",
    "121": "One more chapter in Legendary Entertainment's big, loud, computer-generated monster movie blowout, finally pitting cinema's two best-known behemoths in a rematch of their 1962 rubber suit showdown. The long and short of it is, Godzilla vs. Kong is exactly what you think it is, but also not quite what the three preceding installments might have led you to hope for. Those films contained several unique, essential pieces of a great monster movie, but couldn't quite bring them all together in the same place. This effort may have scattered them to the ends of the Earth.While Godzilla '14 suffered from too much dusty orange, brown and grey, sacrificing spectacle for aura, that also gave it a unique air of mystery and a personal, street-level point of view. The big guy was a force of nature, neither good nor evil, often experienced as little more than a distant rumble through the clouds and clutter of so many toppled skyscrapers. Skull Island and King of the Monsters moved in pop-friendlier directions, granting a better view of the action, while also leaning on pure entertainment value and top-notch creative direction. This new model represents a continuation of that slide into crowd-pleasing razzle dazzle, delivering nearly two hours of curious neon lights, spit-flinging alpha roars, window-shattering concussions and flashy pin-up moments, but it's increasingly limited in most other respects.We get the fight, all right, and kudos for having the resolve to actually depict a winner after two rounds, but the big visuals aren't half as epic as the full-blown elemental fury seen in KotM, nor as ferociously intense as Kong's last solo flick. Both headliners move with a surprising lack of magnitude, swinging ten-story haymakers that land like stiff jabs, not earthquakes. We see so much casual collateral damage that forty-floor buildings become a mere inconvenience, minor hazards that spray black soot as they're toppled over. They might as well be made of cardboard, just like the old days.The nonsensical story elements fare no better. Not that this is a particular strength for previous chapters, or even for a vast majority of similar films. Godzilla vs. Kong is a bad example of storytelling amidst a genre that's renowned for bad storytelling. It's stuffed with cryptic lore, clichéd character archetypes, bone-headed decisions, mindless pseudo-science, telegraphed plot developments... a full bucket of hogwash that made me feel like a moron for paying attention. Kong's ancestral homeland is the worst such offense, a landscape so fundamentally stupid and conceptually flawed that I couldn't stop shaking my head, puzzling over its many gaping, mind-numbing inconsistencies. Godzilla is painted as villain right from the start, which takes all the fun out of picking sides and rooting for your favorite among friends.Listen, I'm not trying to be hard-to-please here. I don't need any sort of spiritual or philosophical revelation in the midst of my giant ape vs. Lizard skirmishes, but I also expect a little bit more respect than this. I'll suspend my disbelief as long as you don't insult my intelligence. And, despite the visceral thrills of those fleeting headline bouts, this fails the litmus test.",
    "122": "This is the clearest evidence of how Hollywood can destroy great movie icons. Unable to make a decent film about Godzilla, they decided to destroy the two great cinema monsters with the bonus that Mechagodzilla's fantastic robot is reduced to a cockscrew. If I pay a ticket to see the film I want the story to be honored: Godzilla has features that we hope to see film after film. I don't ask for much. But the untalented people who made the film came up with the idea that it was better not to play Godzilla's music. I thought of Star Wars without it´s iconic music. It's the same. An aberration. On the other hand, the humanization of King Kong is unbearable. Uncomfortable, worried, it makes it nauseating to see the great King Kong turned smart gorilla who can communicate with his little friend. Since when did King Kong stop liking blondes? The humans who star in the plot are also unbearable. The boy, the particular reason I hated Deadpool 2 now achieved the impossible: that he hated American movies about monsters with an inclusive cast. Of the others only one sentence: I wanted them all dead in the first frame. Everyone, their parents and their grandparents. I wanted everything to explode in the film, and in the final fight they would wipe out humanity, starting especially with those involved with the production of this slug, this crap, this cinematographic insult. Finally: Godzilla has no neck and has a microcephalic head. I don't know who came up with it that this is how the king of monsters should look. Godzilla for that anatomy couldn't even look to the side without having to rotate the body. King Kong using weapons is as if it were an extension of past films with apes conquering the world inaugurated by Charlton Heston. No Hollywood, don't do it anymore. Stop doing garbage. Stop insulting our intelligence and pockets. Stay away from this movie at all costs, well-shot fights aren't worth everything behind and around them. If you want to watch a decent movie, just watch the ones made in Japan or Pacific Rim.",
    "123": "I don't know if this is the wrap up movie or not, but I'm sure the big cities of the world would be happy if it was. From 2014 till now Godzilla and friends have killed hundreds of thousands of people and caused trillions of dollars in damage--not to mention the billions of the U. S. defense budget spent on bombs and jets just to tick Godzilla off.But this is \"Godzilla vs. Kong,\" the main event. Some of the younger less informed crowd may believe this is a first. It's not. I remember seeing Godzilla and King Kong duke it out as a kid. It was epic. Those fights were a lot less costly.Who would win the fight is what we all wanted to know right? Smart money would've bet on Godzilla, but GvK tried its best to make King Kong a sympathetic character thereby deserving to win. King Kong had a special link with a deaf girl named Jia (Kaylee Hottle) which automatically makes King Kong the David in his fight against Goliath. The relationship between them was a little weird and a lot dangerous. Jia's mom (or guardian), Ilene Andrews (Rebecca Hall), seemed to have no problem with her young daughter (or charge) fraternizing with a 100 foot gorilla. Friendly or not, accidents happen.Bad parenting aside, we got the fight that was promised. I didn't enjoy it nearly as much as I expected and the city of Hong Kong didn't enjoy it at all. The CGI is top notch even if the plot isn't. At this point there are no more fights left to be had and to concoct one would just be wrong.",
    "124": "Even a monster battle movie needs a story, and actual characters to go with the plot.None of that here!Great effects, nothing else!Terrible waste!The pathetic attempts at science fiction stood out as even more preposterous than the fantasy aspects. Characters saying things about so-called tech is supposed to make it more acceptable and/or believable? It was difficult to sit through this pile of crap just to see how many thousands of people were killed by the heroic creatures.The standard \"special\" child is here, along with the teens who amazingly get into top secret places without a problem. They got help from the \"wacky\" but right character who knows what the evil corporations are really up to in the world.And don't forget the writer/professor who immediately knows how to operate a super high tech vehicle.",
    "125": "\"Godzilla vs. Kong\" is a fantastic movie, better watched in the biggest screen possible, thus the theaters. It has an interesting storyline, decent acting, aside Jia (Kaylee Hottle) who did an amazing emotional job and for me gets a 10, stellar eye-candy VFX and superbly fitting sound and score.It definitely improves on \"Godzilla: King of the Monsters\" and I tremendously liked all the scenes involving Kong. The VFX special effects Department did an awesome job in bringing the mighty Kong to life with his show of full ranges of emotions and those expressive eyes!The battles were epic and I naively always ask myself, why oh why, do they need to destroy all those beautiful and modern buildings!, to rebuild them again...Do yourself a favor, don't listen to any bad reviews, go find out and watch it for yourself, and be careful not to choke on your popcorns or throw them on your mask, while delightfully 'tasting' those yummy eye-candy sequences of action.They are worth the watch, many times!Screenplay/premise: 7Development: 8Realism: 8Acting: 8.5Filming/cinematography: 9Special/visual effects: 9.5Music/score: 9.5Depth: 6.5Logic: 6.5Flow: 8.5Suspense/thrill: 8.5Ending: 8.",
    "126": "When Godzilla hit the big screen back in 2014 I enjoyed watching it, but it didn't blow me away by any means. Followed up by the average Kong: Skull Island, I started to lose interest in them making this into a franchise. For some reason though, even though critics weren't too pleased with Godzilla: King of the Monsters, I found that to be the most enjoyable of the three. It had been known from the beginning that a film down the road would pit both Godzilla and King Kong against one another. Personally, I found Godzilla vs. Kong to be leaps and bounds better than the previous three installments. Now available in select theatres and on-demand, here are my thoughts on Godzilla vs. Kong.When going into a film like Godzilla vs. Kong, you shouldn't be expecting to see the greatest story ever put to film. It's a movie about two popular monsters brawling it out. For that reason alone, I would suggest going into this film just looking to have some fun. The title promises a fight and there is a lot of action to be enjoyed here. For a movie called Godzilla vs. Kong, however, there is very little Godzilla outside of the action. This actually ended up being a positive for me though.I wasn't expecting this film to dive so deeply into the mythology of King Kong. This is basically a King Kong film, that still lives up to the promise of him fighting Godzilla. The human characters are either there to serve King Kong and provide some genuine drama, or simply to be some comedic relief when bouncing back to the side of Godzilla. The visuals involving King Kong's storyline and the in-depth exploration are really what put this film over just being a film about creatures fighting. This added lore really helped my enjoyment, making me much more invested.Whether you're talking about You're Next or Death Note, director Adam Wingard is a filmmaker that I've never really latched onto. Other than his stellar work on The Guest, none of his films really impressed me. I've always admired his style though and that is very much present here, along with the best aspects of his direction. He keeps everything moving along at a very nice pace and I never once found myself bored. It also didn't hurt that he had an insanely talented cast alongside him. From the return of Millie Bobby Brown as Madison to the introduction of young Kaylee Hottle as Jia, and even to the comedic relief of Brian Tyree Henry as Bernie this cast either had me engaged or laughing, even though they weren't really pivotal to the core story.Overall, Godzilla vs. Kong delivers exactly what the title promises, never skimping on the action or visual effects. They spend much more time making you believe King Kong is the hero and that Godzilla is the threat, so if you're someone who wants to choose sides, that may make it a little difficult. This film isn't one to pick apart in terms of minor inconsistencies, because it literally exists to give audiences a fun fight. Does the film have zero regard for who dies in the streets while these two are going at it? Absolutely not, but it's a blast to watch. Godzilla vs. Kong is far from a perfect movie, but it perfectly executes what it wants to, and for that, I absolutely recommend checking it out.",
    "127": "\"Well this is way my expectation, Godzilla vs. Kong is a movie that of course we expect to be another big fight that most of film do but they always end it with unsatisfying end, but this one is not, this is not only a fight but this is a blast!, finally they fix one thing that very impotant for a monster movie and that was lessing the human part and added more monster part so me as an audience doesn't bored at all, all of the perfomance was good, the cinematography, the music is extremely jarring and i love it, the model is perfect for all the monster especially Godzilla, Godzilla model from the first one always impressed me, Kong in here is a little bit different from the other one, in here Kong is a little bit friendly i can say but he is still the same Kong like the other one when he was fighting and even stronger, the final battle was totally incredible, i really enjoyed it, it was a really solid fight between this two king, just don't missed it, i really recommend watching this in theater because believe me is totally different experience when you watch this on the big screen with great sound than a little speaker or a headset, Overall Godzilla Vs. Kong was totally a blast!, i highly recommended\"",
    "128": "Hands down the best of the Monsterverse! I have been kind to the previous Godzilla movies (the new ones that is, that are part of the Monsterverse), especially when it came to giving them slack due to issues with the human side of the story they tried to tell. I also felt that Kong Skull Island was a bit of a guilty pleasure! Many great actors, a lot of B-movie tropes and throwbacks and fun al around.But combining these two franchises (once again and with callbacks to the original clash from yesteryear ... many many years ago) and some of the actors involved while adding some new ones ... I can't even begin to express how great I felt this was. From the first frame ... when you see Kong himself, I felt this could be something amazing.Now don't get it twisted! This is not a character piece on humans - you will not find a lot of depth and might say that the villains motivation is quite paper thin ... but all you'd do with that is deriving yourself of so much fun you could have. I was not a big fan of the new Snyder Cut of Justice League. It's good in places and has some issues in others - but I was and am happy for anyone who could just plain enjoy it.Why do I even mention this? Because there seems to be a lot of people not even having seen this movie but trying to bury it, because their feelings got hurt and they try to bully Warner into doing what they want. Generally speaking it is a good thing to listen to your fans ... but this has gone too far. And I talked about this as much as needed! Watch the movie before you rate it and be happy for anyone liking something, even if you can't share their feelings.As a big fan of the Original Godzilla movies and kaiju in general, I personally had no issues with the new Monsterverse going CGI. I know others have their problems with that. It will depend on how you feel. But the movie looks fantastic. Even if the \"story\" itself can't grab your attention and hold it - you can't deny how beautiful it looks.But it is not just that. Even though, there is not much plot and the humans are a side note ... actually why even though? It is the right and proper way to do such a movie! And the dialog is handled very well to say the least. Which comes down to the actors involved in this. Adam Wingard went ahead and did it! And he showed a lot of respect to the history of the franchise ... a movie that should be seen on the big screen if possible! It deserves praise for being as entertaining as it is ... Thank you Wingard, thank you Warner.",
    "129": "I've read in the trivia how everyone in the film had such a love of those old monster movies, but I don't see how. This movie has no idea how to portray Kong or Godzilla. The movie lacks any coherency and the plot is so stupid, it actually makes the monsters seem like the most intelligent beings on the planet. You have two battles between Godzilla and Kong that are well done, but then there is a LOT of horrible exposition and terrible acting. People stand around talking about the monsters. There is an evil corporation (isn't there always?), a ton of useless CGI, and then the obligatory \"good\" humans who just want to save humanity. The entire subplot containing Millie Bobby Brown felt like it was from a totally different movie. It was pointless and ridiculous. The less said about Alexander Skarsgaard's and Rebecca Hall's characters the better. They are poorly written, the performances are phoned in, and they offer next to nothing to the plot.Despite all of that, I could have still enjoyed the movie if not for the completely unfathomable idea to add high tech to this clunker. The journey to the center of the earth in what amounted to neon space ships totally took me out of the movie. This is Kong and Godzilla, not Guardians of the Galaxy. I like my monster movies to be a bit more grounded. Kong: Skull Island and Godzilla both had a down to earth feel. This movie just needed to burn up some budget, apparently.I was so completely taken out of the film mentally that in the final battle between Kong and Godzilla I started chuckling. When Godzilla is standing on Kong's chest and is about to end the fight, I fully expected Kong to mutter: \"Save Martha!\". That's how ridiculous this movie is.",
    "130": "40 minutes of awesome battle scenes. 120+ minutes of annoying kids and a garbage plot.Token child actor under 10 getting more screen time than Godzilla or Kong. (Tick)\nBoring/stupid plot (Tick) Little girl teaching Kong sign language..PLEASE!! Some of us have an IQ over 60. Stop assuming the audiences is going to be full of idiots.Horrible acting (Tick) Name one decent performance in this movie, i dare you to find one.Worth the watch but honestly you could basically just skip straight to the battle scenes and it will make NO difference plot wise. You will be missing absolutely nothing.If you guys just listened to the reviews, the results would be amazing. Go back to the Godzilla/Kong roots. Not this modern Hollywood crap that's tailored for the mentally imapired.",
    "131": "Both Warner Bros. And us viewers seem to be on a roll. They already delivered the year's one of the most awaited (and longest) action blockbusters with Zack Snyder's Justice League, and have now delivered another eye-popping, heart-stopping, jaw-dropping action blockbuster, Godzilla vs. Kong. It's no spoiler that the film centers on the epic clash between the two eponymous giant creatures, and the result is a massively entertaining film which reminds us why cinema going used to be such a pleasant experience in the pre-COVID times.It has decent human characters as well, and they don't feel overshadowed or eat up the entire plot either. Plus, the visuals in this film are so incredibly gorgeous that you can literally pause at any moment to get a magical, otherworldly, surreal wallpaper. The pacing is also a major plus, as the film moves pretty quick and keeps the action coming, with destruction scenes looking as epic as they can. Director Adam Wingard has done a fabulous job with this film, and has managed to deliver what fans of escapist cinema really desire from their movies.The action is intense and the film's big draw, especially the final battle where I was left breathless and could easily imagine crowds of viewers cheering in cinemas at certain moments. The background score accompanying most of the sequences is good, and the visual effects are fantastic. All this makes me want to watch it once again and buy a Blu-ray copy when it becomes available in the future. Even without seeing the 2014 and 2019 Godzilla as well as the 2005 King Kong, I was able to understand the plot and enjoy it without being bored for even a second.Although the story is as simple as it can get, Godzilla vs Kong's success in captivating you with its all-out action spectacle is a reminder that cinema is first and foremost an escapist experience, and films that do this notion justice are lapped up more easily by majority of the viewers. No doubt this film too has passed the test with flying colors and has satisfied many fans craving this kind of popcorn-friendly fun. I now need to get back to see the previous films involving the two iconic characters, given that this one's watched and we're possibly not getting another like this for a long time.",
    "132": "His concept backfires and becomes almost laughable in many points. Again casting is incompetent. Hollywood suffers from lack of actors who have genuine personality and acting talent.To understand this movie you have to understand that it is a mashup of two major franchises: King Kong created by Merian Caldwell Cooper and Godzilla created by Honda Ishiro. Both these franchises have many movies in their series and you have to watch all of them by year if you're seriously interested in these types of \"Giant Monster\" movies. With the steady development of computer graphics and the lack of use of real mechanical and clay-motion special effects, the great special-effects and visionaries are no longer with us.Hollywood relies on special-effects to such a degree nowadays that it is threatening the film industry to such a point as people become vary of the generic quality of movies it churns up.I found this movie a bore even with the good C. G. I. Offering it dished out. But I was more interested in an \"interesting\" and \"fascinating\" story-line backed up by some good talented actors. The direction of the movie is uninspiring and comical. The background sound-effects and score seemed generic and sub-par to me. All in all, it was a real waste of almost two hours of my life...",
    "133": "Three colossal blockbuster movies, Godzilla (2014), Kong: Skull Island (2017) and Godzilla: King of the Monsters (2019) have set the pace for Godzilla vs Kong (2021). After years of waiting these two iconic characters to appear on the big screen facing off one another, this long-awaited sequel is finally here to rumble but will it be a gigantic pay off or a gargantuan turn off?Question #1: Are there a lot of action-packed scenes?I know the majority of the audience who wants to watch this film is expecting a non-stop action packed scenes. With a runtime of approximately 1 hour 52 mins including credits, the film offers a few action scenes but not as plenty as to how the critics are referring to. I feel that Kong: Skull Island and Godzilla: King of the Monsters offer more action scenes than Godzilla vs Kong though this latest film is not left far behind as the final act provides a visual pleasing jaw-dropping fighting scenes. As my expectation is high, to say that the film offers 'enough' action scenes is an overstatement but it still manages to be enjoyable overall.Question #2: Are there any fighting monsters other than Godzilla and Kong?Yes, there are a few but it serves more as a filler than getting a part in the main storytelling. Without mentioning which or who, there is an appearance of a monster during the final battle of the movie but I feel that there is much more that can be done with it. It lacks any development and it is hard not to think that the monster is there just to be there without moving forward its story or origin. It leaves an impression that other than Godzilla and Kong, other monsters serve mainly to remind the audience that this is a Monster Verse.Question #3: Is the visual effect as outstanding as what the critics are saying?Oh yes, the visual effect is outstanding. You can witness the figure of the monsters with dazzling spectacle. It feels very much real and alive and it is difficult to spot the flaws in terms of its visual. I can bet high that this film will receive a nomination for next year's awards like Oscars and Golden Globes for Best Visual Effects of the year.Question #4: What do I like about Godzilla vs Kong?The best thing about Godzilla vs Kong for me is the cinematography during the ongoing action scenes. It lets you witness the event by means of a point-of-view technique as if you are about to go to an amusement park ride. It is effectively entertaining, it buckles you on your seat to let you experience the ride and immerse yourself in the experience. The choreography of the action scenes between the monsters is also left to be amazed. It shows you never-before-seen battle movements that are eye-pleasing to watch alongside the color palette which is mesmerizing, it is hard not to think the Pacific Rim universe when you see the colorful and bright neon lights showering the Monster Verse world. I also love the intrinsic and humane expression of Kong and the grisly horrific images of Godzilla, it shows both ends of spectrum, complementing Yin & Yang.Question #5: What do I dislike about Godzilla vs Kong?Other than what I feel that it contains only a few action scenes, the plot moves towards uninteresting territory. This is the problem with the Godzilla films for me, instead of capturing the audience with an appealing plot, it shows you on the process of fighting against or helping the monsters. It establishes the idea to guide you through the journey of survival if we were being attacked with the monsters which sets aside its storytelling. I get it, it is a film about fighting monsters but there is a reason why the first Godzilla film does not receive much appraisal as it lacks both storytelling and action scenes. Furthermore, I also feel that the middle part of the film feels a bit draggy and over-the-top ridiculous with no sci-fi boundaries. I also feel disengaged by the chemistry between Godzilla and Kong because it seems that there were there to only fight without a proper explanation. Godzilla is only present when he is about to battle, no more and no less.Question #6: Who should watch Godzilla vs Kong?Those who:-Have invested in the previous Monster Verse films.Want to watch brainless popcorn flicks and can suspend their disbelief.Want to be impressed by its jaw-dropping visual spectacle.Want to witness monsters fight.Question #7: Is there any end credits scene?Unfortunately, there is no end credits scenes after or during the credits roll.Question #8: Rate the Monster Verse films from Best to Good (There's no worst, every film is entertaining and good.)Godzilla: King of the MonstersKong: Skull IslandGodzilla vs KongGodzillaVerdict: Godzilla vs Kong sets to shake the world with its massive fighting scenes and dazzling visual effect and while those succeed, it seems that the roaring rumble is stepped down by the lack of action scenes in the first two acts and the uncharted exploration of its mythology that makes Godzilla vs Kong an only substantially sizeable monster mayhem film.",
    "134": "That really is just a lazy marketing ploy .King Kong movies are about adventure and discovery, Godzilla flicks are about gimmecky lizards with lazer beams attached to their heads - if you get my drift .Kong has never been a 'monster', Godzilla has never been anything but .This film is reducing the intricate Heart of Darkness nature of the better Kong movies to the mostly cheap B-movie style of the Godzilla offerings .Why can't there be both, the elaborate story telling of King Kong (2005) and even Skull Island, and the neon coloured world of Godzilla for the less demanding ?Mid level marketing execs meetings - that's why we can't have nice things .",
    "135": "Oh, my was I disappointed with this one. I'm not sure what I want from a 'giant monster' movie, but this wasn't it - for the most part. I have a chequered past with the franchise. I hated the original 'Godzilla' as there wasn't enough of the monster (or Bryan Cranston) then the 'King of Monsters' sequel was little more than colours and noise before me, yet the - much maligned 'Kong: Skull Island' was quite an enjoyable romp.Here we have a film about humans. A lot of humans. Occasionally a giant ape or lizard show up and punch each other. That's about it. It's like 2007's 'Transformers' film all over again. I know that focusing a story on either giant monster would be difficult, so humans would have to be a major part of it - I don't know - it's just it felt too centred around pointless stuff. If the main cast of humans wasn't enough, they feel the need to include a totally redundant sub-plot about Millie Bobby Brown leading a pair of other wise-cracking, yet still bland, sidekicks around a secret facility. This whole aspect could have been left on the cutting room floor and the movie would be all the better for not seeing this - supposedly - secret base. Yes, this is the most secure facility that just allows any old Tom, Dick or Harry to simply wander in and nose around.And that's just one of the plot holes. I swear if a modern movie exists that has more leaps of faith in it than 'Godzilla vs Kong' then I haven't seen it yet. To even hope of enjoying this film you really can't afford to allow yourself to actually think too deeply about what you're watching, because nothing really holds up when put under any form of scrutiny.The humans are annoying, but the monsters are - reasonably - cool. Yeah, even for a big budget film like this they're still kind of CGI-looking, but they at least do more than their human counterparts. Naturally, our titular beasties have to team up to fight some 'greater evil' - if you've seen 'Batman vs Superman' it's almost a play for play re-enactment and I kept expecting it to be Doomsday. Don't worry - it's not just the - obviously evil - human baddie in this film who wears a coat over his shoulder just to prove what a cad he really is.It's a film. It's way too long. It's not terrible, but I got through it by not watching it at the cinema and therefore in the comfort of my living room I was able to fast-forward every time I saw Millie Bobby Brown come on.",
    "136": "Unremarkable CGI monster battles and whole sets of characters / sub plots which meant nothing.The story-telling in this film is awful, the characters just talk, it mostly doesn't actually matter what they are saying, it's like they only have lines to justify their inclusion the film.There's a sub-plot with three or four characters (including the girl from Stranger Things) which doesn't have any bearing on the story at all. I can't think of a single way in which the sub-plot had any affect on the film's conclusion. This would be less of an issue if the dialogue or characters in this part of the story were entertaining, but they are not, all the jokes and minimal attempts at endearing personality fall completely flat. If these numerous scenes were completely cut from the film, it would only improve the film by making it less boring and more concise.You know you're watching a bad film, when by the half-way point you start asking yourself why certain characters are even in it, then you realise they are there to literally just fill the running-time and nothing else.There isn't even an attempt at a coherent story, with cause and effect. It's just a series of scenes which make very little effort to explain why anything that's happening is happening. I'd like to say it might be passable for very young kids, but unfortunately I think even they might find it boring.And I just can't agree with all the people who are saying \"watch it for the battles\" either, they are thoroughly generic with nothing to make them stand-out. Even if the CG scenes are exciting for a lot of people, in this day and age, I don't see why we should let producers off putting at least a little effort into engaging characters and dialogue, considering the hundreds of millions of dollars spent.Terrible film. Boring, forgettable, nothing more to say.",
    "137": "Well, we finally get to see how the two different kaiju movie styles blend together. On one side, there's the American tradition of capturing the movie that is the racialized stand-in for the \"other,\" King Kong. And on the other, there's the Japanese window-framed fiction made out of its horrific atomic-bombed past, Godzilla. How do these two national cinematic traditions react to each other? They fight over trade routes--shipping lanes, air cargo, and high-tech portals--and the ultimate destination of the Chinese market. Figures.But doesn't Hong Kong have its own vibrant filmmaking industry, you may ask? Apparently, some seem to think it a multinational mess spearheaded by some foreign vague impression of a baddie that results in some abomination that's transparently mechanical and divorced of any organic origins. Is it a surprise that Legendary Pictures has become a subsidiary of a Chinese conglomerate. Draw your own conclusions about the shared destruction of Hong Kong, as the rest of the human audience to the monsters-as-movies sit comfortably (or try to, at least) behind their safety-glass screens and virtual-reality domes. Same-day premieres on HBO Max help there.I don't know what one gets out of this stuff if not an allegory for the movie-making process of pitting CGI monstrosities against each other as they demolish virtual environments. This Godzilla and Kong have become so devoid of their original meanings that the giant lizard eats bombs, and the people mostly love them, too, and the giant ape slaves away to serve his colonialist captors battling whatever lizardy creature they insist he battles and is so sexless that he only communicates with a child. And the human so-called characters are as vacant as Godzilla and Kong's gazes into each others' digital eye holes (no wonder the biggest stars have since bailed on the series). They're the opposites of their former selves--Hollow Earth to be reformed by corporate social Darwinists in their machinations to wreak havoc over bigger and bigger markets. It's a disaster.I do rather like, however, the beginning of putting Kong in a virtual-reality, or movie, dome that he begins smashing, which is later reflected in the shots of shattering glass. Note that in \"Skull Island\" (2017) and, indeed, in the original \"King Kong\" (1933) that the monster is \"captured\" by film. Hence, the characters who are filmmakers, photographers or otherwise exhibitors. In 1933, he literally broke from his shackles on a stage. So, in \"Godzilla vs. Kong,\" they've since captured him in a movie. His own movie, or at least as best as they can pretend it, but he's soon to break out or be placed in the wider movie of the Monsterverse--the world or windows and international markets, as it was in the 2014 \"Godzilla\" and the 2019 \"King of the Monsters.\" I've got to respect the consistency, if not the faint purpose.",
    "138": "\"I don't know! I'm not used to this! I'm used to pirating movies online!\"\nPersonal Anecdote:\nThe last movie I saw in theatres was Sonic The Hedgehog on Valentine's day in 2020.This is officially my first film back into a theatre since, and me and a group of friends rented out an entire theatre to be covid safe.This was already one of my most anticipated movies of the year when it got announced (I didn't watch a single trailer to make the film as fresh as possible), but back in the beginning of March I watched all the Showa Era Godzilla films and woke up the inner Godzilla fanboy in me.This was by far the most excited i've been for a film since Avengers: Endgame.Review:\nGodzilla vs. Kong absolutely knocked it out of the park with enormous kaiju battles, an entertaining story, with some stunning visuals and sound design.The human-side plot was enthralling and way more entertaining than Godzilla: King of the Monsters, the human characters are greatly improved and have more depth to them, and their story has way more of an impact on the world at large. The world building in this film is next level and I would love to see Warner Bros. / Legendary Studios to continue building off of this world even more than they already have.I did have an issue with some lazy storytelling and a few awkward character moments, but it was nothing that ever took me out of the film.The visuals absolutely blew me away, the cinematography was great and there are a handful of shots in this that are just beautiful to look at, but it also translates over to the big fights, where some scenes are shot from below giving a real sense of scale with just how huge these monsters are.Seeing our God, Godzilla, and our King, King Kong, go head-to-head was breathtaking. The fights were super impactful and heavy, they practically level an entire city fighting each other. The \"Neon City Fight\" was probably my favorite, and is definitely the best kaiju fight i've ever seen.This is exactly what you want in a Godzilla film. Even though this tends to be more of a Kong film, with majority of the film following Kong around and focusing the story mainly around him, I can't not give my man Gojira credit, he absolutely steals the show.Godzilla vs. Kong by all means isn't a perfect film, it has its flaws for sure, but it's the best dumb fun i've ever experienced. It's. So. Much. Fun.It isn't too heavy on the human side, has huge, extremely entertaining fights, and some great visuals. So what's not to love?NOW GIVE ME MY SOLO MOTHRA MOVIE!!!#ContinueTheMonsterverse.",
    "139": "In 1962, two of the biggest icons in cinema history came together for the battle of the century. 59 years later, they return for a rematch. Of the shared universes currently out there, one of the more consistent is the Monsterverse, a world where the most iconic kaiju coexist. Now, it all culminates into an epic crossover, one I've waited for a very long time: \"Godzilla vs Kong\".Plot: A period of peace suddenly comes to a halt when Godzilla mysteriously goes on a rampage. Monarch is approached by Apex to convince the now fully grown Kong to help search for a solution in the Hollow Earth. This puts the two alpha titans on a collision course, one that will determine who will be the true King of the Monsters.The minds behind the Monsterverse took a page from Marvel in carefully planning out this eventually crossover, building on what started with \"Godzilla (2014)\" in all the right ways and paying off spectacularly. The story is well-paced and told even with the 2-hour runtime, feeling like all parties involved get their due. The main human cast, consisting of three factions, are simplistic but decent and contribute to the story in varying degrees, especially towards the end. I came to like their interactions, some comedic and others having a little weight behind them. They also help explain what's going on with the monsters when needed. Easily the heart of them is Jia, a deaf Skull Island native bonded with Kong who communicates via sign language. Her expressions really sell it when a scene calls for it, leading to some touching moments like one she shares with the big ape during the rain. Only two minor characters come up short in terms of potential and overall roles. While not as deep as previous entries in terms of story and themes, the film does explore the value of trust, reflected in different ways among the cast, human and monster, as the story progresses.At the center are the monsters as one would expect. Kong is the arguable protagonist as he goes on an epic journey of discovery wrought with trials and tribulations. You feel the raw emotion as he goes through tough times. While having less screen time, Godzilla is given as much respect. He truly feels powerful and menacing as a force of nature should, though he's also sympathetic when his motives are understood. Whenever they battle, it lives up to the hype; both have clearly defined fighting styles, lots of back and forth as each deals heavy blows with everything around them being utterly wrecked. Unlike in the OG film, this clash of titans has a clear winner. There are other monsters, including a famous Godzilla character that's executed brilliantly in design, portrayal, and sheer power. The environments are pure eye candy from the neon-lit Hong Kong giving stunning illumination to the wondrous Hollow Earth with its unusual wildlife and trippy landscapes. Junkie XL's music is another highlight, capturing the scope of the film and giving each monster their own musical cues based on which is more dominant on screen. I also dig the many nods to previous movies like an iconic moment from the OG version. The cinematography is top notch; much as I love suitmation, the CGI allows for incredible angles to make the fights more visually grand like brief POV shots from Kong and underwater scenes. My only gripe is that the film does cut a few corners, mainly where the aforementioned humans are concerned with a few missed opportunities.\"Godzilla vs Kong\" is like a roller coaster, starting off slow to set the mood and then becomes a thrill right with constant action. Watching my childhood heroes duking it out got me giddy in my seat. This is an event that lived up to expectations and then some. It's certainly better put together than \"Batman v Superman\" which tried to do too much at once. It's not the deepest Monsterverse film, but it's sure to please. Two scaly/furry thumbs up.",
    "140": "IN BRIEF: Loud and mindless sci-fi action that really is no fun.JIM'S REVIEW: (NOT RECOMMENDED) If there ever was a sequel that need not be made, it would be Godzilla vs. Kong (2021). A few of the previous cast members from the first debacle, Godzilla: King of the Monsters (2019), reprise their awful one-note characters. Kyle Chandler and Millie Bobby Brown are back for more absurd encounters with this famous reptile and some very bad dialog to spew forth. This time around, our giant lizard focuses on battling one mighty big ape for the title crown of King of the Monsters instead of duking it out with the likes of Mothra, Ghidorah, and Rodan. It's a royal smackdown the sights of which you may never see again...or want to see again.As one character so astutely says. \"Godzilla's out there and he's hurting people, and we don't know why!\" (Doh, yeah we do...he's a monster!) This hybrid sequel bring the two titan beasts together with more of the same formula and stupidity that one normally expects in this sci-fi monster genre. Art, it ain't...nor does it strive to be. But is it too much to ask for some level of competency with a screenplay that is not so rote and inept, CGI that stays consistent with its epic proportions, and actors that bring some authenticity to their characters? The expression of the computer generated Kong and his details are uniformly strong; Godzilla, in more of a supporting role, is less successful in his movement and appearance. And the addition of a Transformer robotic monster for the climatic clash of the titans makes this outing just plain ludicrous. (I guess onesie beats twosie, but nothing beats three. And nothing on screen is remotely convincing or exciting either!) It's empty cinematic calorie counting. But it's not even campy enough to enjoy as a guilty pleasure.This sequel does have a new director at its helm, Adam Wingard, who is familiar with action and horror genres. To his credit, he does stage the combat scenes well and the action is, at least, visible and not lost in murky shadows as the previous film famously did. But there is a limit with what can be done with the generic screenplay by Eric Pearson and Max Borenstein. Seeing the cast scream their lines, regurgitate lengthy exposition, and holler orders does not exactly test their acting mettle. One desperately waits for the fight sequences to intrude on the dumb dialog and cardboard villainy. The plot remains confusing. Having the human props travel from Antarctica to Hong Kong at super speeds is never really explained. One can only assume it's a terrible plot device just to connect the fragmented storytelling which never gels its dual story-lines.Caught in this much ado about nothing are some fine actors who chose unwisely: Alexander Skarsgård, Demián Bichir, Elza González, Brian Tyree Henry, and Rebecca Hall, whose character certainly would not win any Mother of the Year awards as she continually places her deaf daughter (an overly cute Kaylee Hottle) in perilous situations. Let us hope their missteps in acting roles becomes a valuable lesson for all of these performers. Obviously, Ms. Brown and Mr. Chandler did not learn anything the first time around. Money is the real King of the Monsters.One can say that this second installment may be a tad better than the first updated version. But is that really a compliment? Bad is bad, no matter how you view it! And . Let's face it, Godzilla vs. Kong (2021), is bad. We can only hope this is the end for this franchise. But we know better, don't we? (GRADE: C-)",
    "141": "Silly boring plot. Best actors have cameos while unknown kids perform school play acting. No heart in this long dragged out film. Plot has potential but needs better re-writes because it supposedly sequels 2 better movies - Kong Skull island & Godzilla: King of monsters. This film corrupts what's good in both films re main beasts. Kong becomes more human & then more vicious w/ boosted roar like screams. Godzilla Regresses to a 70's lizard w/ no brain & less power, losing his iconic roar but gaining slanted eyes. No dumb blonde, just mainly young kids having the power to save the world from a greedy mega corp Monarch that's surprisingly still in business. The big fight scene occurs in Hong Kong, hundreds of structures are affected yet all are strangely empty. No govt is involved in this global \"chase.\" There's also another new hidden world that becomes a tourist type attraction - ridiculous concept, except for another sequel.I like both beasts, but making them \"eternal enemies\" is senseless with Kong, an American icon, who edges out Godzilla in key ways, esp using his new historic Excalibur like ax. This sadly reflects the ongoing anti Asian hate in this country, blaming a Japanese created beast for global disease problems. Such is Hollywood's response in these tense times for Asian Americans- release another \"us v them\" movie while shelving long awaited Avatar 2 for another full year.",
    "142": "I was so excited when watching this, but since then I learned that it was based on several old Godzilla and Kong movies from the 90's and other Japanese takes, and those had better plots than most if not all the recent King Kong and Godzilla movies. So I now find it hackneyed and unimpressive.On it's own, it has good action and visuals, keeps you interested throughout even though it's still a bit overhyped, but worth a watch. I was just disappointed at how the Japanese movies on King Kong and Godzilla had so much more in the plot while all the recent \"new age\" Hollywood ones are so bland. Their narratives were more than just epic fights and visuals. My 6/10 rating is judging the movie as a stand alone, but in comparison to the rest in franchise, probably a 4, owing it only to the great action.The other movies in question are Godzilla vs mothra (1992), Shin Godzilla(2016),Godzilla vs Destroyah(1995) and Godzilla vs. Mechagodzilla. While I can't attest to the production quality, their plots are so much better than the Godzilla and Kong movies from Hollywood in recent years. And that makes me sad because I really loved them. I guess I understand why people older than me always go on and on about how movies used to be better.I don't always like to review blockbusters since the review always gets lost somewhere in the middle but I thought it had to be said and I hope someone appreciates it lol.",
    "143": "\"Godzilla vs Kong\" is a visual feast that delivers on the much-awaited commitments! Being the fourth entry for Monsterverse, it is undeniably a pertinent continuation! With Gripping battles & Breathtaking CGI; this is precisely what a devoted fan wishes to see! Nevertheless, a bunch of forgettable characters and weaker script certainly influences the final outcome!\"If this wasn't contributing to world destruction, this would be a great DJ booth.\"Let me get this straight; if you consider yourself as one of those fervent followers of Monsterverse, Bravo! You have come to the right place. No matter what side you're on, the story prudently provides both Godzilla & Kong individual moments to shine! Therefore, appeasement for all tastes!The emphasis here is sincerely on the fights & the brawls, as they should be! Following a relatively dawdling start; upon the beginning of the second act, it gained traction and never looked back. Especially the last act, an impeccable show of Grandeur! 'Remarkable' would be an understatement!When visuals are concerned, It's beyond anything I imagined. One of the best CGI work to date. The way the Camera moves, the specific manner in which some shots were taken; suffice it to say Adam Wingard has nailed it on the presentation side. Accompanied with an exciting Score, composed by one of the best in this business; Junkie XL aka Thomas Holkenborg. Just as always, he succeeded in uplifting the whole mood!Setting aside all the technical proficiencies, the rest of it lacks severely in multiple aspects. For instance, The Script fails to convince us about the gravitas of the concurrent situation. A middling set of characters couldn't be of more help! Barring the sweet little kid 'Jia' ably played by debutante Kaylee Hottle, others added little to nothing value! Performances are not that bad, but what more could actors do if the source material on their hand is that much insufficient.Before concluding, I must admit that I had a great time. This is definitely being made prioritizing Fans' demands above all. An utterly serviceable venture that should impress a wider group of audiences. Not a flawless execution by any means yet it gets the job done I guess!",
    "144": "When I was young, I love the Jessica Lang and Jeff Bridges version of King Kong. When I was younger than that I loved the black and white version. I found passion and aliveness in these movies. I was delighted when Peter Jackson made his version and more so when they turned it into a 60's Vietnam era affair with Samuel Jackson. I even happily got through the Bryan Cranston version. But this despicable piece of celluloid trash makes nearly every mistake that a good movie embraces. It is insipid, disorganized, and patched together piecemeal in a way that makes it impossible for the actors to have any hope of creating realistic dialogue or a meaningful cohesive that guides to the end. It is the opposite of anything resembling feeling, and it would have been better for all involved to chop it up into tiny segments that the viewer could only see moments in time. It is an affront to anything Kong or Godzilla. The Matthew Broderick version, as pale and lusterless as it was, is far preferable than torturing you into seeing this version. Sometimes racism is so starkly presented, so obviously out there in the moment, that Black people, at least initially, are not outraged. They say to themselves, \"Wow. Wow, now that was racist,\" the sentiment being more of profound wonderment than anger. This is how it is with this movie. We cannot fathom how it could be this bad, and overcharged with the profundity of awfulness, we too also say, \"wow, I can't believe how bad this movie was.\" I knew it would be so and was only enticed into renting when Redbox told me, after ordering, \"The Marksman,\" that this one would be half price. Perhaps the only redeeming factor is by default. The first Godzilla movies were cheap beyond comprehension. This one is the same, only they try to trick the viewer into believing that the subpar CGI is something much more than the Japanese originals. Nice payday Rebecca Marie Hall, who wishes she could be Sarah Polly or Emily Blunt. I am sure they paid her tons of money, but what is the cost of a soul?",
    "145": "As someone who has seen every one of the 30+ Godzilla movies I would rate this one higher than 2019's King of The Monsters. KOTM had better music, more Kaiju and a better story, but as an entertaining action film GVK takes the cake. GVK fixes one of the biggest complaints of KOTM, namely the fact that all the action is either shot at night or in rain.Once the action moves to Hong Kong the movie is essentially one giant action scene that is very entertaining. The story and performances are not particularly good though I liked Bryan Tyree Henry in this movie quite a bit, his was the only remotely interesting character and he gave the best performance IMHO. This movie is not great from a storytelling point of view but as a fun Kaiju battle movie it really delivers.I was not a fan of Godzilla 2014 at all but I feel like each new American Goji film since then have only improved as pieces of entertainment, while also making Godzilla's actual design better in each film. This time around Godzilla looks older,rugged, like he has really been through a lot and it is very effective. The CGI in this movie is nicely done and the monsters are quite emotive and move in a way that feels suitable to their size and character.All things considered definitely seek this one out if you are a Goji fan, a Kong fan, or if you just want to see an entertaining movie where two monsters kick butt.",
    "146": "Godzilla vs. Kong takes place after the events of Kong: Skull Island and Godzilla: King of the Monsters. Kong is kept in captivity inside a dome on Skull Island. Meanwhile, Godzilla attacks the Pensacola facility of Apex Cybernetics where Bernie Hayes who hosts a podcast about Titan conspiracy theories is extracting data. To combat the fire-breathing lizard, the humans use Kong as a weapon in case Godzilla shows up again and to go to the Hollow Earth and find out what is causing Godzilla to go on rampages.This is the fourth movie in Legendary's MonsterVerse which began with Gareth Edwards' Godzilla in 2014. It was originally supposed to come out last year, but it was pushed back due to the COVID-19 pandemic. Released in both theaters and on HBO Max, this movie gained a lot of attention when the trailer was released. In fact, the trailer for Godzilla vs. Kong broke the record for becoming the biggest trailer debut ever for Warner Bros (Outlaw, January 2021). This movie had some hype to live up to. After seeing this film in theaters, I thought it did quite a good job.When coming to a big action-blockbuster film, it is expected to see the titular characters duking out with other monsters. The problem with the first two American Godzilla films is that there was too much focus on the human characters and not enough on the monsters. Kong: Skull Island was better in this regard, but it still had its problems. In Godzilla vs Kong, they duke it out.While the first 20 or 30 minutes might be a little slow, once Godzilla and King Kong fight on the aircraft carrier, the movie becomes a non-stop action-packed thrill ride. The two titans are going at it. They are biting, punching and using the environment around them to smash each other. No awkward cuts. No annoying transitions. Just the blissful battles that I wanted. The action is stunning in the film from the way the sequences are shot and edited. The battle at the aircraft carrier is one of the best action scenes I have seen from a blockbuster in a while. The fight is relentless and the focus is mostly on Godzilla and Kong. Neither of them let the other breathe for even a minute. It actually got quite intense. The climactic battle in Hong Kong is also stunning. It is beautifully lit and energetic.As for the visuals, they improved from the last few films. There are so many shots that just show the scale of not just monsters, but the environments around them. Even Kong looks like an ant compared to the Hollow Earth, despite getting a size upgrade. The colors look beautiful and the neon city sticks out. The effects on the two monsters are as impressive as ever and they have vivid expressions. There is one scene where Godzilla glares down Kong with what looks like pure hatred in his eyes. It gives them more weight than just being the two monsters that fight. Details like this make the fights more engaging and intense.I have been praising this film a lot, but the story is its weakness. While it is better than Godzilla: King of the Monsters in both its structure and pacing, it still has a corny plot. It is mostly used as an excuse to get the two monsters to battle each other. The movie moves at such a fast pace that it does not slow down for that much character development. Aside from the young child who has an adorable relationship with Kong and her mother, I did not care too much about the human characters.Luckly, they are not the focus of the movie. The monsters are the focus. King Kong is the most interesting part of the film, especially with his friendship with the deaf little girl. However, Kong got much more development than Godzilla did which was a bit disappointing. There are a couple of twists and surprises for fans and the introduction of a new monster in the second act. However, there is no end-credit scene to indicate what direction the MonsterVerse will head to next.While Godzilla vs. Kong is not without its faults, it makes for one heck of an action film. It delivers on its title and it features some of the best action scenes and visuals from a blockbuster in a while. However, the story is not that great and the characters are forgettable. Not everyone will enjoy this film because of the problems with the story. However, I got exactly what I wanted from this film. I felt the intensity and scale of the monsters while watching this film and I was never bored for even a minute.",
    "147": "I love Godzilla so much and am also a fan of the King Kong movies, but this... this was hard to watch. Not because of how it looked, because it looks fantastic, but everything else was so horrible that it leaves a bad taste in your mouth.The story is ridiculous. Kong is sick of his cage, but there is a place he can live, which is - no joke - a huge hidden world inside of the Earth instead of an actual Earth-core. WHAT?? Also the super secret never discovered hidden middle-Earth has a lot of tunnels to the surface, which explains the existence of Kaiju... And without any evidence or logical reasoning, we KNOW (about this world we didn't know existed) that there is a source, similar to how Godzilla creates his pokémonlike hyperbeam. So evil people want to get that, of course.Still don't think all of this sounds completely silly?Well then:\nUnnecessary plot lines that don't add to the story, like a father who works at the 'bad side' but doesn't know it, and he only shows up in a few scenes because his daughter wants to figure out the truth. Cliché and also just a distraction from the fact that there is no real storyline.Too many roles played by kids \"saving the world\";Top secret locations are completely unsupervised so literal children and a conspiracy theorist can break in;Also, said conspiracy theorist - an adult man - takes two children to \"assist him\" in unmasking the cover ups?One of the only actual adults on the side of the good guys is a woman, scientist called \"Kongwhisperer\", even though her deaf daughter is the only human to communicate with Kong;This brilliant scientist also brings her daughter on ALL life threatening adventures, because reasons;The other adult is also a scientist, who has been hired by the bad guys (don't worry, no spoiler as everything in this movie is so over the top, you will feel like you're watching a kids cartoon) because he was \"absolutely essential\" for the mission to get the power source. But he isn't. In fact, throughout the movie he doesn't do anything except almost die from all the mayhem he has zero control over. He has no purpose in this film and is little more than a figurant;There are so, SO many more faults in this film, but I don't want to spoil it for those who still choose to watch it. Be warned. I love all Godzilla movies, but unfortunately this one is the absolute worst. The only positive are it's cool fighting/action scenes and SFX.I'm going to watch a 'Everything Wrong With...' video, because I need someone to acknowledge that this movie is unforgivable XD and I bet if you list all the mistakes/plot holes that this movie would put the counter over 9000.",
    "148": "I love the old Japanese Godzilla movies. They are cheesy and corny as hell, but they are fun and adorable. The fact that they are basically guys in monster suits stomping through toy cities is just so endearing.The new film miss this element. Instead they try to worldbuild a serious sci fi drama around a \"cute\" concept. And it just doesn't work. If they made it as sci fi comedies, mixing some practical effects like guys in suits with the cgi destruction, then it would retain that charm.For all the millions they spend on cgi spectacle, they can't buy charm. These new movies are not charming. They are loud, dumb and pretentious. That goes especially for the previous one (the first one actually held back on the spectacle and managed to build some suspense before everything went dumb). This one amps up the lightheartedness a bit, but it still attempts to be serious. That's where it fails.The effects are excellent, no question about it. But the concept behind the films is just wrong. Godzilla and King Kong don't work as serious epics.",
    "149": "This movie has the worse plot set up out of what I believe they are calling the Monsterverse ( I could be wrong about that), but realistically, we don't watch these flicks for the human story filmmakers think we need to keep us intrigued.We came here to watch Kong, whose the biggest he's ever been, battle Godzilla, in a match up the internet memes say is one sided because Godzilla is a walking nuclear power plant, but Kong does have the speed and agility. If your a Kaiju geek you'll be treating this event like the Mike Tyson Roy Jones Jr. Fight.The movie is more focus on the story of Kong, which is fair sense we got like 100 movies about Godzilla. The humans are trying to find him a new home and do it without Godzilla noticing they are moving him in order to prevent the epic battle predicted in both Kong Skull Island and Godzilla King of Monsters, but of course nobody is watching this movie to see an epic battle not happen.The best part of the movie is that it hits the fan fast and does not make you wait too long for what we came to the party for, but those parts without the party were not impressive. Concentrating on Godzilla and King Kong battling made the two human stories weak, the weakest they've been in the whole franchise.On the Godzilla side is a direct sequel to King of Monsters with Millie Bobbi Brown and Kyle Chandler reprising their roles and on the Kong side is a new story featuring new characters. Though technically all the movies in this franchise have an ensemble cast of characters each with their own stories, this cast was not overall interesting enough for me not to be like \"Bring on the monsters\", but I did like Bryan Tyree Henry as a conspiracy theorist who helps uncover the best part of the flick.Overall, it's worth checking out to see whose the true King of Monsters."
}