{
    "0": "Watched Ferrari on the closing night of NYFF 61. Great to see the return of Michael Mann after 8 years.Tells the story of Enzo Ferrari and the world of Italian fast car racing both from a personal and professional angle. The glamour of fast cars and their fearless drivers juxtaposed against the mortal risk they take as they try to excel in their field.The personal life to Enzo trying to balance his powerful and strong wife Laura played by Penelope and his love and mother of his surviving son Lina played by Shailene is a treat to watch. Strong performances from all the 3 leads and a special callout for Penelope for her portrayal of Laura.",
    "1": "Have only seen this advertised a couple of times but was sort of intrigued as to what sort of film it would be. The trailers didn't exactly sell it to me & didn't exactly excite me in any way. But as I said, I was intrigued & of course was able to see this ahead of the UK Boxing Day release via a Limitless Membership.Set in the summer of 1957, with Enzo Ferrari's auto empire in crisis, the ex-racer turned entrepreneur pushes himself & his drivers to the edge as they launch into the Mille Miglia, a treacherous 1,000-mile race across Italy.I found the film to be quite mundane for the most part. The story & sub plots were confusing & the film was hard to follow. The racing & crashes were good, & with a bit of eye candy, it just about got you through the overly long 2 hours & 7 minute runtime.The casting is not bad, but could've been better & like the film, could've used some meaty impact. The film looks & feels tired as it plods along & of course, you find yourself not caring & your mind wandering. The pacing is also off in this flick too.I was more expecting the film to be about the orgins of Enzo's life, like how he worked his way up sort of thing & most importantly, to be easier to follow & be more concise in its story-telling, which this film failed on all forms.Overall, don't expect much from this flick. The film really is as mundane as the trailer is & if that doesn't make you think twice, I don't know what will. This film is ok, but could've been better, much, much better.5/10.",
    "2": "Ferrari is the ultimate curate's egg. Some aspects of the film are excellent, the production design, set decoration, costume, SFX and VFX are superb, but the overriding thing I took away was how poorly cast Adam Driver was as the titular character. Whilst it shouldn't necessarily be a factor I found it difficult to overcome the fact that he bore little or no physical resemblance to Enzo Ferrari and his cod Italian accent did little to help. On the other side, both Woodley and Cruz were well cast and their performances were excellent. But the stars of the show were the beautifully recreated vehicles and how the action vehicle and stunt teams that put them through their paces. It is in these scenes that the movie comes into its own and really delivers. Unfortunately the more 'dramatic' portions of the movie came across as plodding and overly morose.",
    "3": "I know it's about Enzo but it's my favorite of the 'Ferrari' movies. 'Ford\nVs Ferrari' didn't do it for me. It's not my favorite racing movie which is 'rush' but it's quite good. We don't know the personal side to the Ferrari's and as someone with a birth defect, I felt sympathy for them losing their son to muscular dystrophy and I know how hard that is on a marriage. Enzo had an affair because Lina didn't demand anything of him. The racing parts were confusing but shocking. I had to look up the events. I disagree with the viewer who insulted the racing though. It looked good to me. I recommend purely based on the story I don't think anyone knows!",
    "4": "The racing sequences are amazing (especially the sound), but the crashes were obviously staged by someone why doesn't understand how cars crash (wildly exaggerated). Penelope Cruz is a revelation and steals every scene she's in. Adam Driver requires you constantly suspend your disbelief (his acting is fine, he just doesn't look anything like Enzo - hard to understand how he was cast - I kept seeing Kylo Ren). This isn't a bad movie, but it's a melodrama about Enzo and his Wife/Mistress/Son/business, not a movie about racing. Unfortunately that melodrama isn't presented in a compelling, gripping manner. It's unfortunate, as they obvs had a ton of budget. It is GORGEOUS to look at!",
    "5": "The only thing qualifies Adam driver to be in this movie is that his last name is driver. Shailene Woodley saved the movie, but this movie is supposed to be about Enzo, honestly, the movie would've been better if she had just played Enzo she is such a fabulous actor on the other hand, it was really well directed and shot, fantastic script, really engaging and entertaining storyline, but the entire time I just kept thinking about Adam driver The person, and not Enzo Ferrari, and the movie just was not pleasant to watch. It's already a challenge to place a famous actor as the role of another famous icon, but plain, and simply it was Adam driver, who should've been able to act well enough to convince the audience.",
    "6": "Michael Mann tries, he really does. But his Midwest liberal grocer milieu just doesn't play with audiences like it did back in his heyday in the 80s. Audiences were much much less sophisticated back then but now they see through propaganda and sleight of hand story telling. The execution of this film is simply sub par. The amazing sorry of Ferrari was left to hands better suited to covering horse and buggy carriages. Michael Mann used to make his assistant throw pennies into his office to get his attention. That kind of crazy shows up in this film but not in a good way. This film will do well in streaming but I'd wait and save your money. Mann is a TV director.",
    "7": "I saw Ferrari, starring Adam Driver-House of Gucci, the Star Wars movies; Penelope Cruz-The 355, Murder on the Orient Express_2017; Shailene Woodley-Dumb Money, the Divergent movies and Patrick Dempsey-Thanksgiving, Grey's Anatomy_tv.This movie is based on a true story about Enzo Ferrari and his car company. It's directed by Michael Mann and Adam plays Enzo, with Penelope as his wife. Adam and Penelope started the company but after 10 years, were facing bankruptcy because Adam was spending more money than he was making. They lost a son to a disease and Adam took a mistress, Shailene, which caused problems with Penelope, of course. The only way Adam could get any financial help for his company was to win a 1,000 mile race called The Mille Miglia, which was across Italy. Patrick plays a driver for Adam's racing team. FYI: Patrick even bleached his hair white for the part. I'm not a big racing fan but I must say that the crash near the end of the film was pretty spectacular. People in the theater were gasping when it happened and it not only killed the driver but 9 spectators-I don't know how it was done but it looked realistic.It's rated R for violence, graphic images, language and sexual content-including partial nudity-and has a running time of 2 hours & 10 minutes.It's not one that I would buy on DVD but if you are a racing fan, it would be a good one to stream.",
    "8": "This movie is as embarrassing as an Italian singer performing a song in English. In a word, \"cringe\". Let's hope that Adam Driver soon stops accepting parts of Italians, stereotyping them in a ridiculous way. And let's hope Michael Mann shows better form in the \"Heat\" prequel he is working on. A boring and anachronistic film, as well as linguistically surreal: why have the actors act in English as if it were recited by Italians to interpret Italian historical characters? That pompous puffball Ridley Scott had already failed in this idiocy! The dilemma still remains unresolved. A film to avoid a lot.",
    "9": "Saw this at the Viennale in Vienna today.Penelope Cruz is a gem as Laura. Woodley somehow plays the same character in everything she's cast in. I think she's got talent, but how can you tell at this point? Driver was okay. The bad accents by the American actors took a while getting used to, but at 135min, there is plenty time for that.The real stars were the cars and the driving scenes of course - and they were absolutely stunning!I'm not a big action movie person, but these scenes were so well done, I'd get into the Fast & Furious franchise if it was done by this crew.As far as the story goes: it's well done, there is enough meat there in Enzo's personal life and the goings-on around the infamous '57 Mille Miglia that audiences who aren't only going for the car race will be satisfied.But Penelope Cruz carries the non-car-stuff on her shoulders, really. She's a powerhouse actress and for some reason I seem to forget it time and time again until I see another movie with her in it and am surprised at how good she is. I shouldn't be surprised - nobody should be. She's always great... but here, she's at the top of her game.",
    "10": "Ferrari ends up being such a slog of a movie in place of what should've been a thrilling an interesting portrait of a complex figure. The performances might be solid and there's an effective moment here or there but the word that comes to mind when describing the film as a whole is flat. This filmmaker and cast telling a story with this interesting a subject matter should've amounted to a lot more than it ultimately did. For as exhilarating as motor racing is supposed to be I have to say I found the film to be overwhelmingly dull when all was said and done.The whole aesthetic is totally without life which is the last thing I would've expected for a director of Michael Mann's calibre. Mann takes a very documentarian approach to the directing and it just robs the film of any energy or sense of direction. From almost the opening minutes there a serious lack of momentum. The scenes play out in very beat for beat type way with no sense of flair and as impressive as the racing sequences are they're too few and far between to save this movie from the drag that it ends up being. All the scenes away from the track are framed in the most shot/reverse shot manner imaginable so almost none of the dramatic moments had any sort of impact on me. There's an extremely effective moment in the 3rd act that felt like Mann was finally adding some stakes to the whole thing by then it was too little too late for me.The script here is painfully unremarkable and it rears its head in how it portrays its main character. Adam Driver is solid in the role as Enzo Ferrari, though I wouldn't rate it as one of his best performances, but I never really found the depiction of the character to be that compelling. It's established early on that Ferrari puts up a wall around everyone but as an audience member it put me at a distance from his character. I didn't think there were enough moments where his guard went down and we see what really drives him so as a result I just found him to be a bit of a rich egomaniac with motivations I didn't find to be that interesting. There's a love triangle that's set up with Penelope Cruz and Shailene Woodley's characters that almost felt like it should've been the scripts main focus but after a while it just fades into the background for the central race to take up more screen time. Driver and Cruz have good chemistry but I never really thought that Mann got to the heart of their relationship and the exposition that's given on this three way dynamic feels like it comes in the complete wrong order. I was just waiting for characters to find out information I already knew and it just kills the pacing and any impact that these reveals could've had.I never would've guessed that Ferrari was a long time passion project for Michael Mann because nothing in the final product gives any sense of a vision for this story. It's totally unimpressive on a script and technical level and the few effective moments and impressive race sequences aren't enough to save the total bore that Ferrari ended up being as a whole.",
    "11": "Saw this at the 2023 filmfestival Ghant (Belgium). Obviously, the main topic is cars and car races, but there is also a mixture of family drama (illegitimate son versus son of current wife who thus gave him an alternative heir, woman with money prepared to invest, and so on) to make it compatible for family viewing. Actually, you can consider it two films, nicely intermixed with another. The car race fans will find plenty to watch, and the rest of the film moves the family story forward. Implicitly we know that the story ends well; this is no spoiler, given that the name Ferrari still exists as a car brand.Nice details in abundance. Drivers can have girlfriends who either distract or stimulate. When drivers bring their girlfriends along, the press tends to ignore the cars and focus on the women, to the dismay of Ferrari. He asks a journalist to bring a rumor in the world, letting him also mention in the same article that he firmly denies it, playing the cards for a business deal. And there is his wife with independent means and lots of money to spare, who has her own set of requirements when willing to invest in the company.All in all, I did not regret booking tickets, although I feared beforehand that car races would be the main course on the menu. My fears were unjustified. There is ample family and relational drama to keep everyone's attention, and the car races do not distract but enhance the experience.",
    "12": "Based on the horrible Racecar Accidents in 1957 on the Mille Miglia Race, 1000 Miles around Rome, German Special Effects Crew created Real car crashes and great Atmosphere.Not only Pilots have died in that race. Cars crashed into the crowd and killed many adults and also kids. It was the last Mille Miglia race because all these victims.The movie shoes respectfully the Faszination and Danger of the Racing Sport and the responsibility of everybody, who is involved in the whole process of developing, building and driving Racecars in public.The spirit and the fascination of the 1950's is perfectly captured.Well done Crew.",
    "13": "This was a major letdown. Michael Mann is a great director and a prospect of a new movie from him had me excited. The biggest dissapointment of all was the look of the film. It looks so boring and has no visual flair at all. I would blame it on it being shot on digital but that can't be it when Mann made both Collateral and Miami Vice, which looked great and were both shot on digital. On top of that, it's really dull and uninspired. Scenes have no energy to them and many characters are constantly introduced without explaining who they are. Even when their presence is explained the majority of them are simply uninterestingly portrayed. Moreover, the accents are awful. I'd much rather actors do no accents. Either way Italians wouldn't speak English so just skip it altogether because otherwise characters sound like caricatures and scenes become laughable.Additionally, there are also some sub-par visual effects. On the other hand, the cars do sound and look great but the racing sequences aren't too exciting. They should be but the pace of the movie nullifies their excitement. It's hard to be invested when you are bored and when you don't care about any of the characters. Compare this to Ford v Ferrari or Rush and it's not even a competition. Those movies made the viewers become very invested in the spectactle. I can't believe I will say this but I wish a different director made Ferrari. Clearly Michael Mann is past it and someone else could've added more energy and pizzazz to the whole thing. I can't believe this is the passion project of a once great director thay we had to wait so many years for.",
    "14": "2 hours I'll never get back, I think the challenge is to see if you can stay awake for the whole film!The trailer did a good job at fooling you into thinking would be interestingAdam Driver was far too wooden and you never really felt any empathy with the character and just grew to dislike him more & more as you got to know more about him, as an advertising platform for Ferrari it failed although that wasn't its remit.Comparing this to Ford v Ferrari which had a much better script and was enjoyable to watch , this just plodded along and never really started , there was no excitement & no emotionMichael Mann had directed some great films like Heat & Collateral but this is probably his worst piece of work to date.",
    "15": "For a film helmed by Michael Mann and starring Adam Driver and Penelope Cruz, I was expecting a lot more from this.By the end, I didn't feel like I was much closer to Enzo Ferrari or his wife. I didn't come away with much more of an understanding or appreciation of the racing element. I didn't feel overly thrilled or engaged.This all sounds a bit negative, but that's not to say there aren't positives to this film. Adam Driver and Penelope Cruz are really strong, even if they don't peel back the layers of the characters enough for me. However this is more of a criticism of the script than the performances. The racing scenes are well executed although could be a little more exciting and perhaps even shot a little better. Speaking of the direction, it is fine but I think there was potential to really get creative and design some thrilling set pieces. It probably didn't help that the pacing of this film was totally off, feeling much longer than it actually is, which reduced the impact of some of these scenes.Overall I think this is a film of what could have been. There's an interesting story and an interesting man at the heart of all of this, but it just wasn't teased out enough.",
    "16": "Michael Mann is an interesting filmmaker as Mann is great at capturing crime, thrillers, and drama stories with strong atmospheres, direction, dialogue, and action. While not every movie he has made was great, I expect Mann to provide some strong directing and interesting action and thrill moments. I didn't love Ferrari as I would have wanted to but I still found it to be interesting.Throughout, the camerawork and the production design is pretty good as the production and setting helps to capture the time period and environment. Many of the wide shots, the car moments, or scenes where tension, action, and racing occurs are well-executed as Mann never disappoints on crafting action and thrill scenes. Most of the performances are solid. Adam Driver as Enzo Ferrari was pretty good but Penélope Cruz provided the best performances as she had great emotions, personality and chemistry with her role. Including a good soundtrack.The narrative explores more on the personal and professional struggles of Enzo Ferrari alongside with others around which is more slow-burn then action. The narrative is interesting as I enjoyed the concepts and themes the story explores. But at the same time I wished certain concepts could have been explored or handled differently. The characters, while slightly dull at times, were interesting in exploring the personal dynamics and personalities of each one's own. Some have criticized Driver's accent for being pretty bad but I personally didn't mind it since it wasn't on the level of House of Gucci awful.The dialogue is pretty good but there were some clunky dialogue moments. Throughout, the movie had a good atmosphere, color presentation and sound design. There are some pretty bad uses of CGI effects. Despite some of the gripes, I was still invested to see where the movie was heading.Overall, it's not Michael Mann's best movie but it was nice to see Michael Mann doing another project after his previous work in 2015.",
    "17": "Definitely NOT a car movie and definitely NOT a gripping dramatic portrayal either. It's not a flop alright, but it is an awkward misfire for sure.The bad: Director Michael Mann is famous for several terrific action thrillers in the past (HEAT), but he has never excelled at making a true drama (on the contrary) and this is the exact problem with this movie, because it is severely LACKING in true drama.It's lackluster, uneventful and simply going through the motions. Almost the entire storyline is about money problems for producing racecars and lots of wife / lover quarrels / issues. What's suppose to be exciting about that?!Not even the car races (the few that were featured) were thrilling to watch. Those races didnt look bad for sure, but they werent exhilirating either. Quite average to be honest. Was this a car movie? NOPE it was NOT.What is it then? This story is entirely focussed on the CHARACTER of Mister Ferrari, played by Adam Driver. I really value this actor's performance in many other great movies, he's definitely a great actor, but he didnt nail it this time. And I am being really polite now...BEWARE: use subtitles because director Michael Mann decided to let all the ITALIAN characters speak in almost unrecognizable English with a terrible accent. THAT was THE most annoying thing, that really PUT ME OFF entirely. What jibberish accents.Not a total flop, but an awkward misfire of a drama for sure...",
    "18": "I wasn't actually interested in this movie after watching the train wreck House of Gucci; reading that Adam Driver would play another Italian icon looked like a disaster waiting to happen.I saw Ferrari yesterday evening, after a friend who knows all the ins and outs of Formula One asked me to go with him; when the movie ended I thanked him: the movie is good, direction by Mann is tight and the script is rather faithful to actual events.I didn't know much about Enzo Ferrari, so I didn't see \"Driver as Kylo Ren\"; his acting is good, especially after his latest string of failures (\"65\" comes to mind).Penelope Cruz has a tendency to overact that is nicely reined in here; Dempsey was clearly enjoying himself (I managed to counter part of my friend's barrage of information by telling him that Dempsey is an avid racer in real life).I quite liked Daniela Piperno's minor role as Ferrari's mother; actually the only actor who was clearly miscast was the bank clerk, whose lack of skill stuck out like a sore thumb.The races and the Italian countryside were beautifully shot; overall I was quite glad I gave this movie a chance.",
    "19": "Just wished we saw more on the Ford vs Agnelli buyout. Really loved how this was depicted in the Ford vs Ferrari / Le Mans 66 movie. Even though we got to see a quick phone call between Agnelli and Enzo, I really wished an interaction between Enzo and Ford's representatives was shown in the movie. I wanted to see how he ended up selling to Agnelli's Fiat as this occurred off screen in Ford vs Ferrari.I also wished they showed how Enzo managed his prosecution case. Even though Laura (performed amazingly by Penélope Cruz btw) mentioned how they were going to tackle it, I felt like this was brushed over at the end.Basically, I wanted the movie to last another 30 to 40 minutes. I think a biopic sequel on Piero would be great!Also the sex scene was unnecessary."
}