{
    "0": "Well, they finally got me to subscribe to the Daily Wire because of this. I almost did it for What Is A Woman but managed to find it on YouTube. In retrospect, I'm glad to be supporting DW financially.The film itself is good. YouTuber Paul \"Call Me\" Chato reviewed it today and his review finally convinced me I need to see this. As per the usual, a lot of really good stuff was in the trailer. But I've heard so many good things about the heartwarming ending that I wanted to see it for myself.The characters and pacing were all good, I too liked the ending, though Chato mentions there are a *lot* of gags and I'm not sure all of them landed. There is one minor character introduced in the cabin scene and the movie ends without further reference to him, a bit of a dark turn.I do think you need to be a DW fan (and not a subscriber necessarily, all their talent have YouTube channels which is how I am familiar with them) to truly appreciate some of the cameos. But the film stands on its own. And while Boreing does give a few soliloquys, I was fine with them and even choked up a bit when he explained to his on-screen daughter about the importance of women (real women) in society.Not perfect by any means but I'm at a loss to suggest anything that should have been radically different. I liked the subtle(?) swipes at Dylan Mulvaney and Bud Light, but never felt any of the jokes were mean-spirited which could have been very easy to do. I think the writers had a real tightrope to walk in that regard, which perhaps many reviewers haven't taken into account, or perhaps think they failed to walk it well. I thought they were great in this regard.",
    "1": "My Live Reaction / Review for Lady Ballers (2023): We have a basketball coach that used to be succesful but now is seen as a loser? That's already pretty interesting. It seems like coach Rob needs a new car. Lol they gave Matt Walsh the perfect role, being the super lib dad, hilarious. Go Alex, go Alex hahaha. I guess a wig is enough, isnt it? The reporter knows the truth but she prefers clicks and fame, good for her I guess. Time to play basketball and time for the old team to come back! Everyone on the team is so brave!Ben is the referee? Lol, epic. The team is on fire! Well done girls. Now they will dominate every sport? That's hilarious. 1 hour in and the movie is awesome. So now they have to face men for the final match? That will be hard to win. And they are losing, that sucks, I really wanted them to win. The creepy cowboy is really funny. The little girls playing basketball is adorable. Overall the movie is really fun, creative and has great messages. My rating is 8.6/10.",
    "2": "Watched this with a friend and we giggled the whole time. Some moments were super clever with the heavy irony, other moments were sophomoric in humor and a throwback to the good times of the '80s and '90s movies. There were a few moments of on the nose preachiness, as they drove home the whole point of the movie; yet they were still on the mark with truth in our current insanity of hypocrisy when it comes to equal treatment. This was a movie that wanted to say something and it did, and along the way gave several good laughs. I really enjoyed it and would recommend it to people of Common Sense and good humor.",
    "3": "Lady Ballers is the perfect antidote to insanity and tackles the very real and very controversial issue of men who choose to identify as women who are participating in women's sports, but does it in a comedic setting with bittersweet overtones.Conservative news organisation Daily Wire have been combatting wokeness for a year or so now by making their own movies and Lady Ballers has ticked all the boxes and has done exactly what it was designed to do, expose the absurdities and trigger left wingers to the point of apoplexy. That's a win/win as far as I'm concerned.You can look at YouTube and see the extremely acerbic and rabid rants by known left wing shills completely panning the film, but the truth is, unless they've signed up to a Daily Wire Subscription, (which I doubt they have as that would mean giving money to Ben Shapiro), then these people and likely as not every person who has left a 1* review on this site, probably hasn't even seen it.I have and whilst I am behind the subject matter and the message it is trying to deliver entirely, as a comedy, it is a bit luke warm, some of the one liners and scenarios hit the spot it was meant to and others fall flat. Maybe they were trying too hard in the comedy stakes, or maybe I find the subject so disconcerting for women, that I couldn't muster the chuckle it probably warranted.Look out for some nice little cameos by conservative commentators Matt Walsh, Brett Cooper, Ben Shapiro himself and perhaps more surprising, Senator Ted Cruz.Not a great movie, by any stretch of the imagination, but certainly not a dud and is ok for Daily Wire's first real foray into film comedy. The fact it's done what it was designed to do and triggered so many people means that it gets a thumbs up from me.Enjoy!",
    "4": "Do you remember when comedies covered topical political conversations while actually being funny? Do you remember a time when people could say on-the-nose things and not be canceled, like a water cooler conversation? Well, that wasn't too long ago... luckily, Daily Wire is here to save us from the crock of kookiness that has infiltrated this corporeal dimension.It's low budget, it's slapstick, and it's downright hilarious. I can only imagine it's funnier without being familiar with DW's staff, of whom I sadly already am. Consider yourself lucky if you're coming into this as a fresh face! The jabs taken at mainstream craziness and \"journalists\" are spot on, and maybe it's only funny because you don't hear it any more, but I don't think so. Even if it was, that is also entirely the point. This movie is the Catch-22 of PC commentary in 2023.The way the film throws water in the face of all the liberal ideologies currently permeating western civilization is phenomenal. This movie hits the comedic and political absurdity nail on the head - anyone with half a brain will love this movie!",
    "5": "When I saw that the Daily Wire team were making a comedy sports movie about a bunch of male so-called athletes pretending to be women to become basketball champions, I knew that I had to watch it.No part of me was expecting this to be funny, so imagine my surprise when I found it HILARIOUS. Soooo many of the jokes hit, and so many of them hit really hard. The lead performance was really great, and every supporting actor (except for the journalist) was surprisingly great and really funny. This movie is chock-full of amazing one-liners. It's also extremely well-made, with very few technical flaws.I highly recommend you check this out if it isn't too 'cough' TRIGGERING to you. You'll probably have a great time if you love to laugh.",
    "6": "It could've been way better but wow.I can't believe we got so many BAD ABSURD COMEDIES over a decade and this one came out of nowhere and hit so many the right buttons. Some dialog exchanges and some actings (especially the wife) are way too cheap but i ACTUALLY HAD FUN with the movie.Kudos to everyone involved. Just like the SP Pander episode, THIS should've been DONE. Not because of social message, JUST BECAUSE IT IS FUNNY.I also wanted to thank the makers for not putting unnecessary nudity and putting headphones on little girls ear when they use bad words. There were also some unseeable details like, it was something like ''The climate is about to burn you all any day''. I really hope we get more of these.",
    "7": "There's not all that much to say other that yes yes this is political comedy satire etc.... done well and doesn't pretend to be neutral or \"centrist\"\nreleased a little late perhaps political-issues-in-fashion -wise\nbut non the less hilarious.A little bit on the nose and not exaggerated per say rather exactly what you'd expect.(spoiler) some of the behaviors of characters get absurd\nsuch as for example a father just forgetting about what his daughter was exposed to like it doesn't matter\nis too absurd and unrealisticand the messaging can be a bit preachy/bland ,but overall the worst criticism i can give the movie is that it's a bit slow\nas in 2 hours long when there's no need for it to be\na hour-1.5 would've done\nit's not horribly drawn out but could've been a bit betternot the kind of movie one might like to rewatch it's just a simple funny plot executed well\nnothing more nothing less.",
    "8": "The underlying premise of this movie is pure comedy gold and the fact no one has made it yet proves how out of touch Hollywood is. Thank god for the daily wire.Irrelevant sports coach realises he can still 'win' at life if he coaches men who enter women's sports and dominate. This movie gave me at least 2 or 3 laugh out loud moments but overall it fell a dash flat - which was a shame. The movie is too long, a crisp 90 mins would have been better but the biggest issue is the set up to the premise; it's too complicated. His former student is working in a drag restaurant? But then wears a wig to the race by mistake? All too hard. A simpler set up wouid have been they intentionally enter a mixed race to win $$$ and then realise that even out of shape former athletes can flog women. And then it goes from there until the end is an all male race 😂 which they thej realise isn't really winning it's cheating and they all go back to having women's only sports. Thy wouid have been a tighter message.",
    "9": "I love the DW, but this just wasn't it for us. Had huge potential and some funny moments. But this was not what I would call a \"conservative\" movie. There was talk of threesomes, scantily clad women that the camera zoomed in on, extra-marital sex, bondage, and at times it was vulgar and raunchy. Thought it was going to be clean and wholesome fun because some of their ads literally say that. It wasn't. It was oversexualized garbage. This is not for young kids at all. Had I known that going in my opinion might have changed a bit. I'm disappointed in the DW. Makes me question some of the people involved with this.",
    "10": "Matt Walsh - WAAAy better than expected.Jokes that really hit home - some remind me of the old 1980s SNL sketches.A plot that makes sense .. well, i mean, low hanging fruit. A bunch of not-so-great jocks are struggling to make ends meet; by coincidence they are enrolled in a sports even for women, when the organizer mistakes them for trans-athletes. And obviously they go on to capture that epic victory that spoofs every sports film ever made - the epic last second score, the locker room pep-talk, etc.You've seen this formula before in a million spoof movies, but, you know, it's well made. It would be fun even if it was completely unrelated to recent events - take for example, Blades Of Glory. The fact that the jokes are fun on their own, and ALSO make sense within the context, makes this film even better.",
    "11": "Before watching this movie, understand that you are watching something made with a 7 figure budget, with most of the cast not having any \"real\" acting experience prior to this. So if you are comparing this to a $50 million Hollywood production, yes, it comes up short. The acting could be better (I thought the youngest cast member gave the best performance), the jokes could be funnier and with better delivery, etc etc.That being said, I think Hollywood not wanting to touch it kind of speaks for itself. Liberal/ left wing media are calling it transphobic, but all it does is poke fun at the absurdity that is the current state of affairs in the Western world. When Hollywood made something similar 20 years ago, it was just a stupid comedy that was good for a few laughs and everyone moved on. The fact that all this craziness is now somehow a reality and this movie triggers people, well I think it was DW's duty to make this film.If I didn't know who any of these people were and if we weren't living in this reality and I watched this movie, I would give it a 2.5/10. The fact that things are the way they are and most of the movie is cameo after cameo of DW folks, it gets a 7/10.",
    "12": "Most of the comedic scenes were in the trailer. Which why watch the movie if you can watch the trailer? Subject content is interesting. Not quite sure how much is satire or real views. Not sure to laugh or be shocked or both. This movie reminds of of \"Juwanna Man\" so we have already been there and done that. That movie was over 20 years ago and geared towards Black audiences so interesting to see it get repackaged for white conservatives and then do so well amongst viewers. (But Juwanna Man was hilarious). Now as for acting, it is mediocre at best. Feels like everyone is trying too hard. The material is there for jokes, it's just predicable with poor execution. Way too long and I wasted my time on this movie.",
    "13": "Solid B movie, makes fun of an absurd concept. FYI not family friendly at all. While I am a fan of daily wire, i did have some reservations about them doing a full length film. However, the film delivered plenty of laughs which is ultimately what you want out of a comedy. Has some cringey parts, which is to be expected from a new director attempting a comedy. Some of the cringe factor is just the fact that it's really on the nose of a terrible facet of reality right now. Most of it was the entire character of Gwen. I loved all the cameos from the DW cast, it was great. Overall would recommend if you've got 90 minutes to kill.",
    "14": "I like to always list the positives well. Lexie Contursi gives a honestly decent performance. I felt she tried her best in every scene, and I for one hope she can put this film behind her. Everyone needs a check. The pacing is decent. I really thought this movie would be a chore. It wasn't. Mercifully short, is better than dreadfully long even if that is only felt. I didn't hate Michael Knowles and Brett Cooper's delivery, even though their recurring bit was pretty stupid. Um, Jeremy's razor's must be good because Jeremy's hair looks great, and I salute him purposefully making him look short. Short kings rise up.That being said this is a ramshackle production is honestly an insight into a mind so simple I want to examine it with the same intricacies as I would the labyrinth of Kubrick's. It's insane. What? Did he write the script in a day? Then never edit it?The jokes come down to saying something \"objective funny\" without doing the premise or set up. The jokes are all derivative of the 2000s comedies like Dodgeball (per Jeremy Boering's, the main star, own admission) - but the film wavers, ending on honestly a dour note, and containing many things too heavy for the tone they want to have. Cross dressing men, and cross dressing men in sports is not some new untouched subject. In this, Jeremy Boering's Coach Rob is down on his luck since his one time champion basketball team lead him to his third. Then he hatches a scheme to have them complete in the global games.First. There's no rewrite on this script. There can't be. It reads like an idea board. It seems like characters that could be better served by three unrelated characters, or ones that could be condensed or written out completely. Many of the bits are complete misfires (how much?). The joke is r*pe guys. They joke is he wants to r*pe them. Contextually the joke makes sense a little bit on first use, but his re-emergence is baffling. The whole point of the Rob Schnieder character was he was supportive, not trying to r*pe them.This gets back to \"objective funny\". They make this r*pe joke because many 2000s comedies (none spring to mind) had r*pe jokes. Not getting into the politics of it all, you have to do the work to make the r*pe joke funny.The movie is such a hodge podge of ideas. I also don't realize what was gained or earned. Did he get to keep the money, by the movie's own internal logic, the money he made? Like he told them to forfeit, shouldn't the ending be their paupers and pariahs? Not just going back to above normal lives?There are two legitimate laughs? His daughter saying okay boomer, and the half twins gag. Characters were random as well. Often if a scene needed a character to say a thing, they would, regardless of whether it was in character or not. An example is both the tall Curly haired jock type and the eccentric billionaire ballboy (idc what their names are) being very Zach Galifanakis coded. Often scenes switched wildly between who was the funny guy. It also ends on a rather dark note, with his friend seeing a phycologist - he, who is given the only real arch.The movie also is very squeamish about sex, only referencing it with the mildest of euphemisms. Jeremy Boering and his mistress waking up wearing more clothes than on a ski slope. The only kind of sex this movie is consumed with is domination fantasies of dom and male r*pe, and mmf threeways. Make of that what you will.It barely makes below the threshold of awesomely bad though. It's such a half effort. Such a lazy script that does not exist in a world of its making. So much tell. No show. Where did the 7 million dollars go?I really hope that RedLetterMedia can do a best of the worst for this.",
    "15": "It was a silly movie with a message that not everyone will like.Surprisingly Jeremy did a decent job in his role for a non-actor along with the talents from the Dailywire(shouldn't be to surprised if you watched him in the commercials for his razors and chocolates). I would normally say the story was over the top with all the crazy things in it but in fact it was full of things people think and are actually doing in the real world. The movie was full of laugh out loud and laugh until you cry moments. It also showed character growth and teachable moments.This movie is for adults with a sense of humor and for others who don't and need a kick in the rear, showing how ridiculous the world has gotten.",
    "16": "So this isn't my usual form of comedy. I'm not really into more vulgar jokes. But given the subject matter it's hardly surprising.Still it had some great moments. 1)The locker room convo with Winnie. 2) The final game. Adorable. 3) The twist ending. 4) The two unexpected cameos. 5) The expected cameos. 6) Matt Walsh smiling and hugging. Both awesome and unsettling.I'm mean ultimately it had its flaws but still pretty impressive for a movie that went from conception to premiere in nine months. Hmm. Was that a coincidence? Imagine how those flaws could've been polished up with a bit more time.Not exactly a family movie but it hit the real message without being cringe.I know plenty who hate DW will disagree with that last part, but I've seen far more cringy stuff the last five years from the other perspective.Everyone did well. Love it or hate it, you should see it before you judge it.",
    "17": "I know that conservative media is few and far between. And when someone does manage to make a \"conservative \" movie or show usually it's lacking quality in cinematography and audio etc.. so I'm writing this review with the understanding that making a movie is hard. But that doesn't mean that any conservative movie is above criticism.First of all the trailer shows WAAAY too many of the funniest movie beats. That is automatically a no go, since you've exhausted all your cards before your audience has even hit play on the movie itself. This is a major problem in mainstream media films as well.Secondly this movie is entirely too long. This may be an editing problem as well but some jokes and scenes go on for way too long. It feels as though this movie is a series of \"bits\" strung together very awkwardly by extended scenes. Each bit is funny by itself, but it loses its momentum when dragged out.Thirdly, this movie takes too much time getting to the main plot. The opening of the movie is good and well paced but after that it drags itself out and you find yourself asking your family members \"how long is this movie?\" And then finding out you're not even halfway through. This is something that your audience should never experience. You want someone to sit down and be satisfied with the timeline of your movie. It's fine if you drag some parts out for suspense or for shock but it shouldn't ever cause your viewer to feel as if they have to \"get through\" your movie.Now another problem I had was the reporter lady and her character. She was used as a joking comment/criticism of the lack of honesty from journalists in our society. That's all fine and was definitely funny because it rang true to our current society, but her being the prime antagonist was a poor choice. Her character added nothing good to the plot. Honestly remove her and you miss out on nothing but a few bad sex jokes. She's supposed to be the driving force behind all this but the movie has already shown that the coach is willing to dress his team up in drag to win anyways, without her intervention. He signs his own kid up for the woman's race and intuitively the plot could've taken over for the reporters part and had the coach's character be the one to convince his team that they could dominate in all the categories. Clearly he was heading that way on his own, so why add another character? Unfortunately all she did was make the awkward scenes more awkward with her \"romance\" subplot with the coach.The other two characters I had a problem with was the brothers. I don't remember anyone's name (which is also saying something about the movie) and I don't care enough to look them up. I can't tell you a single joke I laughed at when the brothers showed up. Again they were there for sex jokes, like the reporter lady. I'm not saying you can't have crude jokes in your movie, but you could tell that the movie wanted more shock from the audience rather than laughter. It also muddled the message this movie was trying to portray. It's mocking a real life belief that men can become woman and that they can dominate in women's sports fairly. This movie is a comedy, but at its core it's really a commentary, and when you dumb it down so much that it feels like your brain has turned to mush after you've watched it, you lose the message in the process. Who's to say that this movie isn't mocking those who think that women can't be men? It doesn't take itself seriously enough to make a point which is what they were trying to do originally.This review is really long I know but I wanted to mention a few other critiques that I personally had1: when will producers realize that showing kids o no phones texting and adding the texting and tweeting noises en mass is not funny. Literally no teenager has their phone off of silent mode. If you do you're a weirdo. The better way to portray obsessed phone kids is to keep them silent and ignoring the coach while looking at their phones, maybe light giggling, or scowling as they harshly type a message out. Personally it would've been funny if they added a teenager clearly taking pictures of himself on snap chat because that is more realistic that your average stock text sound.2: The ok boomer thing has never been funny. Please let it die\n3: Matt Walsh's little \"bit?\" At the end of the movie entirely ruined his character. He was literally the best part of the movie. The ending with him and Candace had absolutely NO reason to be there at all. I get they wanted cameos from all the talking heads at daily wire but they should've stuck Candace IN THE MOVIE like they did with Shapiro,Cooper,Knowles,Walsh etc...\nAnd then revealing that Matt Walsh was actually not a vegan hippie high out of his mind was a stupid decision. I don't know if they were trying to tease a sequel or what but it was confusing and terrible execution.Now I didn't give this movie zero stars for a reason, there were positives.The video and sound were very good especially for a lower budget smaller studio.There were funny jokes before being ruined by continuation.Most of the actors did a good job. There was over a thing but not as much as one might think.The main basketball players facial expressions are hilarious. He did a fantastic job. Him and Felix were the best guys in this movie.The \"cameos\" by dailywire staff was for the most part funny and \"natural\"All in all it was not super fun to watch, but the concept and a few of the jokes were hilarious, and you could tell there was some passion behind this film. Producing media is hard in an industry where literally everyone is against you. Hopefully we'll see some improvement in the future.",
    "18": "First of all: I´m not a left-wing person. I lean towards the conservative side and have been a DW+ subscriber for some time now. I enjoy the insightful political analysis and insightful documentaries like \"what is a woman\". And DW certainly brings some much needed competition when it comes to Hollywood.So i went into this movie wanting to like it and was fully prepared to look over some issues that a low budget production like this will inevitably bring with it. Let´s start with the positives:Costumes/Setpieces/Camerawork and Quality:\nThis is certainly not a triple-A-production, but considering the low budget the setpieces, costumes and make-up are pretty good. The camerawork is decent and the setpieces are alright (aside glaring inconsistencies like the allyway behind the Dollhouse in the frist thrid of the movie).Music:\nThe music does it´s job. At points it really tries to hamfist some early 2000s comedy music tropes into the movie (some music could easily be some B-Sides from a \"The Offspring\"-record). The music is mostly non-offensive, but certainly nothing special.And that is about it for the positives. Sure, the premise is funny and the political message, that it is ridicolous for a biological man to compete against women is reasonable. The execution is pretty underwhelming.The script/story:\nThe story is predictable, which can be forgiven for a silly comedy movie that tries to do a take on a funny modern premise, while also cashing in on some 90s and 2000s nostalgia. But it is very convoluted, since most setups and subplots never lead anywhere. The romance subplot between Jeremy and the journalist is at best a motive for the estranged ex-wife to feel jealous and at worst it leads nowhere and has no consequence on character development. The same goes for the fact, that one of the players has developed PTSD and the wohle thing is just forgotten about halfway through the movie and only exists for some mildy funny jokes here and there.If you´ve seen the trailer, then you have most of the funny moments in the movie summed up. The jokes are loosely tied together, but are mostly forgettable. The script tries to capture the vibe of some 2000s Adam Sandler movies (which were never funny to begin with), but also fails at that.The characters and the acting:\nThe acting ranges from mediocrity that is not offensively bad, but also never engages you in the story. And some of the acting is downright bad. Some of that definetly comes down to the bad script, but also some performances seem like incredibly rushed takes, in order to cram in some cameos. I like Ben Shapiros political analysis, but he is not a good actor.The second big issue is, is that most of the protagonists are actually not very likable. Maybe that is by design to show that the guys who engage in competition in womens sports are actually the bad guys, but our protagonist Jeremy has a character change at the end of the movie, which does not feel earned at all. In the first half of the movie he is actually pretty insufferable.Funnily enough the people who are supposed to be ridicolous caricatures, like the new Boyfriend Chris (played by Matt Walsh) is actually one of the most likable characters in the movie. The only people who are genuinley hilarious are Matt Walsh and Michael Knowles with their supporting characters. It isn´t good for a comedy if it´s best (and only good) jokes are delivered by their supporting cast and through cameos (like Jordan Peterson at the end).Many cameos also feel pretty forced, like the one from Candace Owens at the ends, which weirdly subverts Matt Walsh's character.The politics:\nBeing the DW this movie is obviously very political. But while DW has managed to transport baseline conservative values through good stories in their other movies, this movie was bound to be an easy hit, because the majority of people agree, that men competing against women in most sports is unfair and silly.But the movie never finds it's tone. Is this an attemp to recapture the essence of lighthearted comedies of the 90s and 2000s, making fun of dudes dressing up as women? Or is this a biting political satire, that highlights injustices against women in professional sports?The movie tries to be either and fundamentally fails at both. Scenes with infantile jokes are mixed together with a political message that is about as subtle as a leafblower blowing into a megaphone. DW has rightly criticised fictional characters spouting a political message that reads like bad freshman essay in a political science class. The politics are not subtle, but they are not funny enough to warrant them being so blatantly shoved down the audiences throat. South Park already did this in a much cleverer and funnier way, while managing to actually add some nuance to their political satire.This movie works on a funny premise, with a solid political message, but the delivery is messy and not very funny. A sadly underwhelming flick.",
    "19": "Not a DW subscriber so I saw it by a friend. We couldn't stop laughing! The acting is ok(especially considering the actors aren't actors),but the cinematography and editing are extremely impressive(especially considering it's a small studio). The storyline was also pretty awesome and at one point it went from hilariously funny to extremely touching and wholesome. The ending is very beautiful. I like the message this gives, while also making an enjoyable and fun experience,it's enlightening too. Could a professional studio done it better? Probably yes. But does that mean it isn't fun and enjoyable? Absolutely not! I loved every minute of it. Would suggest watching it with your boyfriend/girlfriend or spouse though,a lot of jokes you can each relate to each other. Enjoy the experience!",
    "20": "The movie overall is great. The ending is very sweet. It's obviously not hollywood slick in writing, acting, and filming. However, the acting, filming, and writing are superior to B - movie material. I'd consider this less anti-trans and more of a pro woman and girl themed movie. The reporter character is hilarious. Loved how evil she is. The way the coach and his first reunion with one of his former players is entertaining. Matt Walsh has a new agey oddball character that pops up throughout the movie and Ican notbelieve how well he plays his part. The kid was very funny. This movie is very well done 👏.",
    "21": "This was the release that finally convinced me to try out Daily Wire+. From the trailer, I figured I might get a few laughs but the majority of the narrative would focus on getting the moral message across.Nope, I was wrong. Lady Ballers pretty much assumes you already know why the situation is messed up and, for 95% of the runtime, dedicates itself to just being entertainment. There are zero grand speeches about protecting the legitimacy of women's sports (though comments are made in passing), no moral grandstanding, no soapbox moments calling out damages done by ideology, there isn't even a magical resolution where the sanctity of the sport is upheld in this fictional alternate universe. Main character learns a lesson and improves himself, and that's it.And I think that's all it needs to be. It was genuinely funny throughout, and I laughed far more than I'd assumed I would. The comedic timing was much better than I'd anticipated and the cast was game, the pacing and the script were solid. It's not an instant classic. Just a really good comedy.",
    "22": "So I thought this was going to be one of those movies with a \"message\" that was more preachy than entertaining. Oh boy was I wrong! There definitely was a message in that art does indeed imitate life but while this is certainly true in this movie, it also brings with it pure comedy gold. From start to finish it brought both the laughs and some serious thought provoking subjects going on in the real world. The comedy style was very reminiscent of the 90's or early 2000's where I was not to over the top to get you smiling, and the acting was great and didn't feel forced which shows that the cast was totally into and have a great time making this movie. If you're looking for an old school comedy with a fresh coat of pain for the modern day then this is the movie for you!",
    "23": "Considering that many of the actors are not actors, (and likely never will be actors),they did a great job. Considering that the production budget couldn't possibly have been even close to the amount of an equivalent Hollywood project, the only thing missing,(thank goodness were 21st-century edits. Considering that no one else had the guts to make this movie, any flaws are forgiven. The only things that bothered me were two or three lines that should've been re-done for clarity, and/or sync. DW was fully aware that this wasn't gonna make it to theaters; that's a wider audience's loss. Maybe TCM will play it eventually:^)",
    "24": "If you're a fan of the Daily Wire and their stable of commentators, this is a solid 10. Much like how early Kevin Smith movies were enhanced by an audience's familiarity with his \"veiwaskewniverse\", the instant recognition of the DW talent, and the issues explored in the film, strike a chord with anyone who considers the \"DW Backstage\" their Oscars ceremony.The script is also reminiscent, if not a little sharper and more mature, than early Kevin Smith films. In fact, this may be a film whose script is more entertaining to read than to see played out on screen.The biggest surprise of the film is a breakout performance by DW's god/king, Jeremy Boreing. I never would have guessed he could pull off a male lead, but his portrayal of the ne'er-do-well divorced former high school basketball coach in desperate search of one last win, is played with just the right mix of cynicism and integrity.The message of the film is timeless, even if the frame it's built on is a modern social issue;\n\"Winners are just losers that do the right thing\"",
    "25": "Hilarious movie in appropriate taste for the topic. In fact, it's perfect for the subject and absolutely brilliant! Outrageously funny, also heartwarming at times. The actors, all of whom are unknown for their acting abilities, at least by me, really pull it off well.And so many cameos by people famous for something else make it more fun, including Senator Ted Cruz, Riley Gaines, an award winning swimmer and activist for protecting women's sports, and Dr. Jordan Peterson, renowned psychologist and author.Be sure to watch to the end as there is a short bit after the credits are run. Well worth waiting for it!If you want to have a good laugh at some of the ridiculous things that are happening today and frustrating us on a daily basis, this is the movie for you. Don't miss it!",
    "26": "Look, I'm not gonna come in and give it a 10/10. It's no Baseketball or Dodgeball, but it's got some genuinely funny jokes. More than a few times I had genuine hardy laughs. There's a few times it gets sincere and those parts are great. The ending is a little weak, but there's not a lot they could do with it and still is wrapped up pretty well. My least favorite part is a shameless ad thrown in which got a smile, but moreover a deep rolling of my eyes. They hit the audience with a lot of very true statistics, (just because you don't like what you hear doesn't make it propaganda). For their first attempt at a comedy this was pretty good, and makes me look forward to more from the DW. In a world where Hollywood is too afraid to make a decent comedy for fear of offending even one person this was refreshing. Like a glass of water in the desert. Maybe not an ice cold glass of water, but still very refreshing,",
    "27": "Hollywood is too chicken to release any comedy like Dailywire's Lady Ballers today. That makes this comedy one of its kind today, daring to tackle today's serious maladies in the most irreverant way. It's a movie that doesn't take itself seriously so that it can tackle the subject matters (gender ideology, child grooming, trans movement, cancel culture, etc.) seriously. While the 1st half of the movie seems rather haphazard and random, the 2nd half is when the movie really ties up all the loose ends and the heart of the story shows itself. The acting is a mixed bag - some actors are better than the others. But one who truly stands out in this movie is young Rosie Seraphine Harper - she delivered her role extremely well despite having some of the most difficult lines in the movie! This is a comedy that dares to be different, dares to tell the truth and dares to cop the flack, and for that, I give kudos to Dailywire. I'm sure their future comedies will be refined and come back even stronger. Great start for comedies in Dailywire!",
    "28": "The function of comedy is to hold a mirror against society, to comment on it and to ridicule it where possible. This is exactly what the Daily Wire has set out to do and boy did they succeed. They created the most hilarious scenarios and the self-deprecating humour was spot on.Seeing the hosts of the Daily Wire play the roles that they did was hilarious. I understood it was created out of necessity, but the best bits are often created like that.The people that want to cancel this movie need to take a look in the mirror. Everything in life should be open for ridicule. When things are not allowed to be ridiculed then scary things will happen. We always need to be able to laugh about ourselves and the things around us.If you are king in your kingdom and there was a jester. Would you be laughing, or would you be saying \"off with the head!\"?Great movie. Very much needed for the times we are living in.",
    "29": "I am a fan of some of the DW lineup. I wasn't expecting them to be able to make a truly funny movie while making social commentary as well. As another reviewer has already stated, this movie could've been mean-spirited but it wasn't. It was just funny and honest. I enjoyed it. I don't even watch comedies typically. The acting, while amateur, was pretty good as well. Production value seems great as well. I have no complaints really. They achieved their goal. I appreciate them making comparable movies to what Hollywood produces. Real movies with real language. Doesn't feel like lame christian media that doesn't discuss adult topics using adult language. No knock against Christians, as I am one, I'm just saying it's not lame.",
    "30": "I am reminded of comedies that used to go to unsafe and non politically correct places just to get you to smile and for the most part this delivers on that... granted in a tongue and cheek lower budget sort of way but even so.It was certainly pushed as a bit of a political statement and to poke fun at media, the entertainment industry, and it's multitude of sponsors but i came away from it smiling as it has a nice ending that they put some thought into. The cameo's by dailywire personalities made me chuckle as well.Definitely worth the overall watch and a good effort that pokes fun at our culture and direction in ways that average everyday people will be able to identify with.",
    "31": "The best analogy is what my wife said, \"it's like Semi-pro, or Blades of Glory.\" I agree, in the sense that they are not great movies, but they will make me laugh. I gave it a 10 because Daily Wire had a lot to live up to for doing this film, and they clearly pulled it off, and well. I'm very excited to see where this film takes this studio, and how this success will drive their variety of future projects. Their kids app, Bentkey, is definitely respectable as well. Not all the way there yet, but for sure headed in the right direction. I love that the Daily Wire is providing alternatives to various forms of media, simply because it's necessary to shake things up when everything starts becoming the same.",
    "32": "The jokes are solid, but timing was off. There are some really good parts, but they are rare. Putting all the DW cast in, was the draw, but realistically, they aren't great actors as a whole.All the obvious, good jokes are there, but then they tried too hard for the weird stuff. Jeremy Boring does this routine where he can't kiss the other actress; I guess cause his wife wouldn't approve. It's weird. Go into acting, or don't. There is no middle ground.It has a low budget feel, probably cause it was. Still worth the watch, but nothing to get too excited about. I'll still watch the sequel.2 cars.",
    "33": "I admit that I was skeptical, given who had made it, but it was actually pretty funny! I fully admit that I am a fan of most of these people in the movie in their day jobs, I just didn't have much faith in their ability (yet) to produce a good movie. Although I really liked Run, Hide, Fight! However, I was wrong. This felt like a throwback to the comedies of old that major movie companies might have actually made back in the day. I laughed out loud quite afew times, and the ending was really hearfelt.I hope a lot of people watch this movie, because it's good, and it sheds light on the ridiculousness of what is going on in our society right now, in a funny way, not in a mean way.",
    "34": "Watched this and was entertained, but it's not great movie by any means. I do not think that the Daily Wire has hit the mark with this film. They're always talking about Politics being downstream of Culture and that their hoping to get involved with the culture and change it. This film has too much over politicization to be smartly funny and effect the Culture.I enjoyed it once and will probably never watch it again. I would not say it was especially funny and I think this movie is really just for conservatives.Like Matt Walsh's \"kids\" book I think it overall is a missed opportunity of doing something that could have wider cultural weight.",
    "35": "Been looking forward to watching this movie. Haven't seen a good comedy in quite a while. If you have a. Sense of comedy. You can appreciate the subtle as well as the obvious displays of comedy here. I admit, I myself am a fan of The Daily Wire and a lot of the personalities and a lot of the content so I had a little bit of a bias for the creators of this that being said, I'm also somewhat jaded when it comes to film because I think a lot of content seems played out contrived and with an agenda or simply cheap low hanging fruit. But this movie didn't seem to have any of those issues. They had some really good writing and some very laugh out loud moments , I watched it with my whole family including people who are impartial to The Daily Wire, but found a lot of humor in this movie nonetheless. I'd recommend this to anyone and everyone. It's a good watch for sure.",
    "36": "I can't believe that this is at all controversial! It is just straight up funny and poignant! Well done as a smaller production and released on a small platform. Jeremy Boring kills it as a coach and Matt Walsh is a very believable anti-character of himself as a chronic hugger. I can't recommend this film enough and welcome anyone to try to refute the utter truth it conveys. The fact that both of the teams become all male is the biggest punchline and point about how this would all play out if we keep ruining female spaces. Once again, this had to be made! Anyone who finds it \"hateful\" needs to make an argument that is cogent and logical. Keep it up you artful bigots!!",
    "37": "I'm going to make a few points here about the movie.Movie is like a bad comedy from the 90's-early 2000, like those stupid Ben Stiller movies, which is what makes it so good.Movie is a bit longer then it should be, editing/directing could be better.While bad comedies B movies are bad to the point they are funny, which is kind of thee point of those movies, this movie is really lacking in the acting department, which is sad, i think the idea and the general direction of the movie is solid.All in all, i wish Hollywood would make a come back for those type of movies again, so stupid it's funny, def worth the watch.",
    "38": "So delving into the good, bad and the ugly...\nThe acting wasn't as great as a normal and overall it doesn't have many funny moments... But that is kind of to be expected since it is a satire comedy and it often adds to the message. The comedic parts - well for me it was mostly not \"haha\" funny because it reminded me of the societal problems. But again, that was kinda the point, can't blame the movie for adhering to what it is said to be.So 80% works as satire perfectly, 15% comedy and the other 5% I'd say was the touching ending. It was so sweet, I expected some positive turn-around, but it still surprised me.I recommend it and most of all I'm glad it exists.",
    "39": "Daily Wire nailed it on the head with this one. I really enjoyed the movie, it was easy to watch and I felt entertained throughout its entirety. Which says a lot because over the past few years a lot of movies aren't about entertainment anymore. Hollywood has really gone downhill. Whereas I used to attend the theatres almost weekly, it's now been months if not a year since I've gone to the theatre to watch a movie. That's saying a lot as a huge fan of movies in general. I find it really unfortunate and hope that there will be some change in the future, but for now I'll just wait until I read reviews and be picky and choosy. This was a good find.",
    "40": "Lady Ballers is an outrageously over - the - top and hilarious response to the overly politically correct state of Hollywood today. This film is both irreverent and entertaining all at the same time. Sadly for many who want to watch it, Lady Ballers is currently only available to watch on The Daily Wire +. But hopefully some time real soon, it will become available to stream for the rest of the masses. I saw the trailer as an ad on You Tube, and I immediately began to laugh my you - know - what off! If you are one of those people who is in the fence about purchasing a subscription to The Daily Wire +, just go ahead and do it so you can watch this movie!",
    "41": "As in the title, the main problem with this movie is that it's just not funny, regardless of your political feelings. Those who rate this highly are forcing themselves to laugh because they align with it politically and don't like trans people, not because they care to look into how the law actually works. The acting was obviously very bad, and most of the jokes were too. Those who are rating it poorly are both people who don't align with it politically, but also 100% of honest reviewers who look past the childish point of the movie and try to judge it honestly. It's just bad at the end of the day, period. I guess it does make for a good detection mechanism for a certain kind of person - just look who rates this over a 4/10 and you will know something about that person with absolute certainty.",
    "42": "Surprising quality of filmography given the rather low budget. The actors and actresses were far better then expected. The movie starts off slowly setting up the mental state of the primary characters. Modern reality then steps in and presents them with out of the box options that result in endless hilarity. I was quite surprised by the dialog quality even though the situations were so unusual. The actors stayed in character in even the hardest moments to keep a straight face. It is quite difficult to complete a project like this with so much comedy happening that the cast itself must of caused a large volume of reshoots to get it nailed down so well. I am surprised they took the time to really nail this down. This somewhat reminds me of The Interview years ago where the actors kept in character when you would believe it to be impossible.",
    "43": "It's about time someone made a comedy about the clown show of biological males playing women's sports. There are now a 55 yr old Canadian man saying he identifies as a 13 yr old girl so he can swim with and change in the same locker room as little girls. We should at least be able to laugh at it. If people aren't even allowed to do that then it's going to get ugly real quick.It's sad that it took DW to make this movie. 20 yrs ago, Hollywood would have been all over this because the comedy writes itself. Even guys like Kimmel & Colbert, who haven't been funny for a long time, would actually be funny in a movie about dudes playing women's sports because even the thought of it is funny, as well as maddening.",
    "44": "I went into this thinking it would be a cheesy, cheap B level movie. Similar to all the old Hallmark movies, it would focus on pushing an agenda over being a good quality movie. Especially considering the tiny budget this was made with, the fast production time, and the many non actors who they got to play a lot of the parts.I was very surprised to find that it was actually a great movie. I burst out laughing numerous times while watching it. Great comedy, great acting, all while talking about a serious issue.Seems you can actually have the trifecta of good, cheap, and fast.9/10. Go watch it.",
    "45": "For a first comedy from the Daily Wire, it was very well made. I really feel they should have included a cameo of Jordan Peterson, but all their cameos were great and perfectly timed.The movie was well written, and the characters were rich. Despite featuring many individuals who were not professional actors and had no prior acting experience, their performances were commendable. You would have to pay very close attention to even notice.There were two scenes where I noticed the actor looking at the camera, and the scenes with Ben Shapiro yelling at the coach could have been better, in my opinion. But perhaps I need to watch again.Other than that, I think the movie was fantastic. I laughed a lot.",
    "46": "Low budget, but entertaining. Too many talking points rather than actual dialogue, but a funny story. I'd watch again, as I loved those early 2000's sports comedies like dodgeball and the ringer. However, the acting quality could always be better. Maybe Daily Wire studios could recruit more recognizable actors in their future endeavors to further aid development of their studio. Gotta love the Ted Cruz and Ben Shapiro cameos, which are hilarious. I wish there was more to say, came in not expecting too much but left pleased by the simplicity of the comedy and easy to follow storyline. Daily wire is trending in a good direction.",
    "47": "This was a funny breath of fresh air. For a smaller budget than Hollywood multi-million dollar enterprise, this was an enjoyable watch.I really enjoyed watching the different personalities of the DW cast step into character. I especially liked the ending (I won't include any spoilers) but it was nice to see how they were able to bring the script around and brought it together nicely. The script was developed nicely and kept us laughing the whole time. It was particularly nice seeing the DW tip-toe into the \"I cannot believe they went there\" boundary!!!Check it out and see for yourself! Not a child's movie- funny adult content!",
    "48": "Just finished watching the movie, came out of nowhere and wow was I surprised, saw it on my new home theater, really wished this one came out in a cinema, but my home cinema completed the magic, loved the pro-women msg of the film with the humor injected in it, very appropriate and the acting, no oscars here but they acted well and funny which is what is important in a movie this days, good music, good pacing, very modern, loved the cinematography, very well shot, it is a good movie to watch with friends you know a good popcorn movie, I missed this type of comedy movies, we have been on a very dry streak here, and this movie brings freshness to the options.",
    "49": "The Daily Wire is definitely stepping up their game. True comedy that doesn't hold back. The editing, special effects and stunts were pretty good, I was really impressed. It was made really well. Aside from the ridiculousness of the subject matter, it poked fun at our current state. Hopefully people can enjoy it and have more open conversation about the true absurdity of It all. IT was a breath of fresh air being able to laugh and sheer tongue in cheek stupidity.Aside from the above, I loved seeing the Daily Wire commentators in most of their acting debut. I'm cheering you on Daily Wire, hope to see more from you.",
    "50": "An actual funny movie. It's a miracle! Lady Ballers manages to be funny without dropping F bombs every other word. It's also not one of these lame comedies that try and be completely clean either. It really threads that needle well and is surprisingly hilarious. Daily Wire Co-Founder Jeremy Boering is great in the lead role as Coach. There are cameo's by the other Daily Wire hosts Michael Knowles, Andrew Klavin, Ben Shapiro, Candace Owen's and especially Matt Walsh who had a recurring role through the film.The message is also a very important one which this movie does a great job of conveying. Looking forward to more Daily Wire Content!",
    "51": "I can't believe that this is at all controversial! It is just straight up funny and poignant! Well done as a smaller production and released on a small platform. Jeremy Boring kills it as a coach and Matt Walsh is a very believable anti-character of himself as a chronic hugger. I can't recommend this film enough and welcome anyone to try to refute the utter truth it conveys. The fact that both of the teams become all male is the biggest punchline and point about how this would all play out if we keep ruining female spaces. Once again, this had to be made! Anyone who finds it \"hateful\" needs to make an argument that is cogent and logical. Keep it up you artful bigots!!",
    "52": "I'm going to make a few points here about the movie.Movie is like a bad comedy from the 90's-early 2000, like those stupid Ben Stiller movies, which is what makes it so good.Movie is a bit longer then it should be, editing/directing could be better.While bad comedies B movies are bad to the point they are funny, which is kind of thee point of those movies, this movie is really lacking in the acting department, which is sad, i think the idea and the general direction of the movie is solid.All in all, i wish Hollywood would make a come back for those type of movies again, so stupid it's funny, def worth the watch.",
    "53": "So delving into the good, bad and the ugly...\nThe acting wasn't as great as a normal and overall it doesn't have many funny moments... But that is kind of to be expected since it is a satire comedy and it often adds to the message. The comedic parts - well for me it was mostly not \"haha\" funny because it reminded me of the societal problems. But again, that was kinda the point, can't blame the movie for adhering to what it is said to be.So 80% works as satire perfectly, 15% comedy and the other 5% I'd say was the touching ending. It was so sweet, I expected some positive turn-around, but it still surprised me.I recommend it and most of all I'm glad it exists.",
    "54": "Daily Wire nailed it on the head with this one. I really enjoyed the movie, it was easy to watch and I felt entertained throughout its entirety. Which says a lot because over the past few years a lot of movies aren't about entertainment anymore. Hollywood has really gone downhill. Whereas I used to attend the theatres almost weekly, it's now been months if not a year since I've gone to the theatre to watch a movie. That's saying a lot as a huge fan of movies in general. I find it really unfortunate and hope that there will be some change in the future, but for now I'll just wait until I read reviews and be picky and choosy. This was a good find.",
    "55": "Lady Ballers is an outrageously over - the - top and hilarious response to the overly politically correct state of Hollywood today. This film is both irreverent and entertaining all at the same time. Sadly for many who want to watch it, Lady Ballers is currently only available to watch on The Daily Wire +. But hopefully some time real soon, it will become available to stream for the rest of the masses. I saw the trailer as an ad on You Tube, and I immediately began to laugh my you - know - what off! If you are one of those people who is in the fence about purchasing a subscription to The Daily Wire +, just go ahead and do it so you can watch this movie!",
    "56": "As in the title, the main problem with this movie is that it's just not funny, regardless of your political feelings. Those who rate this highly are forcing themselves to laugh because they align with it politically and don't like trans people, not because they care to look into how the law actually works. The acting was obviously very bad, and most of the jokes were too. Those who are rating it poorly are both people who don't align with it politically, but also 100% of honest reviewers who look past the childish point of the movie and try to judge it honestly. It's just bad at the end of the day, period. I guess it does make for a good detection mechanism for a certain kind of person - just look who rates this over a 4/10 and you will know something about that person with absolute certainty.",
    "57": "Surprising quality of filmography given the rather low budget. The actors and actresses were far better then expected. The movie starts off slowly setting up the mental state of the primary characters. Modern reality then steps in and presents them with out of the box options that result in endless hilarity. I was quite surprised by the dialog quality even though the situations were so unusual. The actors stayed in character in even the hardest moments to keep a straight face. It is quite difficult to complete a project like this with so much comedy happening that the cast itself must of caused a large volume of reshoots to get it nailed down so well. I am surprised they took the time to really nail this down. This somewhat reminds me of The Interview years ago where the actors kept in character when you would believe it to be impossible.",
    "58": "It's about time someone made a comedy about the clown show of biological males playing women's sports. There are now a 55 yr old Canadian man saying he identifies as a 13 yr old girl so he can swim with and change in the same locker room as little girls. We should at least be able to laugh at it. If people aren't even allowed to do that then it's going to get ugly real quick.It's sad that it took DW to make this movie. 20 yrs ago, Hollywood would have been all over this because the comedy writes itself. Even guys like Kimmel & Colbert, who haven't been funny for a long time, would actually be funny in a movie about dudes playing women's sports because even the thought of it is funny, as well as maddening.",
    "59": "I went into this thinking it would be a cheesy, cheap B level movie. Similar to all the old Hallmark movies, it would focus on pushing an agenda over being a good quality movie. Especially considering the tiny budget this was made with, the fast production time, and the many non actors who they got to play a lot of the parts.I was very surprised to find that it was actually a great movie. I burst out laughing numerous times while watching it. Great comedy, great acting, all while talking about a serious issue.Seems you can actually have the trifecta of good, cheap, and fast.9/10. Go watch it.",
    "60": "For a first comedy from the Daily Wire, it was very well made. I really feel they should have included a cameo of Jordan Peterson, but all their cameos were great and perfectly timed.The movie was well written, and the characters were rich. Despite featuring many individuals who were not professional actors and had no prior acting experience, their performances were commendable. You would have to pay very close attention to even notice.There were two scenes where I noticed the actor looking at the camera, and the scenes with Ben Shapiro yelling at the coach could have been better, in my opinion. But perhaps I need to watch again.Other than that, I think the movie was fantastic. I laughed a lot.",
    "61": "Low budget, but entertaining. Too many talking points rather than actual dialogue, but a funny story. I'd watch again, as I loved those early 2000's sports comedies like dodgeball and the ringer. However, the acting quality could always be better. Maybe Daily Wire studios could recruit more recognizable actors in their future endeavors to further aid development of their studio. Gotta love the Ted Cruz and Ben Shapiro cameos, which are hilarious. I wish there was more to say, came in not expecting too much but left pleased by the simplicity of the comedy and easy to follow storyline. Daily wire is trending in a good direction.",
    "62": "This was a funny breath of fresh air. For a smaller budget than Hollywood multi-million dollar enterprise, this was an enjoyable watch.I really enjoyed watching the different personalities of the DW cast step into character. I especially liked the ending (I won't include any spoilers) but it was nice to see how they were able to bring the script around and brought it together nicely. The script was developed nicely and kept us laughing the whole time. It was particularly nice seeing the DW tip-toe into the \"I cannot believe they went there\" boundary!!!Check it out and see for yourself! Not a child's movie- funny adult content!",
    "63": "Just finished watching the movie, came out of nowhere and wow was I surprised, saw it on my new home theater, really wished this one came out in a cinema, but my home cinema completed the magic, loved the pro-women msg of the film with the humor injected in it, very appropriate and the acting, no oscars here but they acted well and funny which is what is important in a movie this days, good music, good pacing, very modern, loved the cinematography, very well shot, it is a good movie to watch with friends you know a good popcorn movie, I missed this type of comedy movies, we have been on a very dry streak here, and this movie brings freshness to the options.",
    "64": "The Daily Wire is definitely stepping up their game. True comedy that doesn't hold back. The editing, special effects and stunts were pretty good, I was really impressed. It was made really well. Aside from the ridiculousness of the subject matter, it poked fun at our current state. Hopefully people can enjoy it and have more open conversation about the true absurdity of It all. IT was a breath of fresh air being able to laugh and sheer tongue in cheek stupidity.Aside from the above, I loved seeing the Daily Wire commentators in most of their acting debut. I'm cheering you on Daily Wire, hope to see more from you.",
    "65": "An actual funny movie. It's a miracle! Lady Ballers manages to be funny without dropping F bombs every other word. It's also not one of these lame comedies that try and be completely clean either. It really threads that needle well and is surprisingly hilarious. Daily Wire Co-Founder Jeremy Boering is great in the lead role as Coach. There are cameo's by the other Daily Wire hosts Michael Knowles, Andrew Klavin, Ben Shapiro, Candace Owen's and especially Matt Walsh who had a recurring role through the film.The message is also a very important one which this movie does a great job of conveying. Looking forward to more Daily Wire Content!",
    "66": "I can't believe that this is at all controversial! It is just straight up funny and poignant! Well done as a smaller production and released on a small platform. Jeremy Boring kills it as a coach and Matt Walsh is a very believable anti-character of himself as a chronic hugger. I can't recommend this film enough and welcome anyone to try to refute the utter truth it conveys. The fact that both of the teams become all male is the biggest punchline and point about how this would all play out if we keep ruining female spaces. Once again, this had to be made! Anyone who finds it \"hateful\" needs to make an argument that is cogent and logical. Keep it up you artful bigots!!",
    "67": "I'm going to make a few points here about the movie.Movie is like a bad comedy from the 90's-early 2000, like those stupid Ben Stiller movies, which is what makes it so good.Movie is a bit longer then it should be, editing/directing could be better.While bad comedies B movies are bad to the point they are funny, which is kind of thee point of those movies, this movie is really lacking in the acting department, which is sad, i think the idea and the general direction of the movie is solid.All in all, i wish Hollywood would make a come back for those type of movies again, so stupid it's funny, def worth the watch.",
    "68": "So delving into the good, bad and the ugly...\nThe acting wasn't as great as a normal and overall it doesn't have many funny moments... But that is kind of to be expected since it is a satire comedy and it often adds to the message. The comedic parts - well for me it was mostly not \"haha\" funny because it reminded me of the societal problems. But again, that was kinda the point, can't blame the movie for adhering to what it is said to be.So 80% works as satire perfectly, 15% comedy and the other 5% I'd say was the touching ending. It was so sweet, I expected some positive turn-around, but it still surprised me.I recommend it and most of all I'm glad it exists.",
    "69": "Daily Wire nailed it on the head with this one. I really enjoyed the movie, it was easy to watch and I felt entertained throughout its entirety. Which says a lot because over the past few years a lot of movies aren't about entertainment anymore. Hollywood has really gone downhill. Whereas I used to attend the theatres almost weekly, it's now been months if not a year since I've gone to the theatre to watch a movie. That's saying a lot as a huge fan of movies in general. I find it really unfortunate and hope that there will be some change in the future, but for now I'll just wait until I read reviews and be picky and choosy. This was a good find.",
    "70": "Lady Ballers is an outrageously over - the - top and hilarious response to the overly politically correct state of Hollywood today. This film is both irreverent and entertaining all at the same time. Sadly for many who want to watch it, Lady Ballers is currently only available to watch on The Daily Wire +. But hopefully some time real soon, it will become available to stream for the rest of the masses. I saw the trailer as an ad on You Tube, and I immediately began to laugh my you - know - what off! If you are one of those people who is in the fence about purchasing a subscription to The Daily Wire +, just go ahead and do it so you can watch this movie!",
    "71": "As in the title, the main problem with this movie is that it's just not funny, regardless of your political feelings. Those who rate this highly are forcing themselves to laugh because they align with it politically and don't like trans people, not because they care to look into how the law actually works. The acting was obviously very bad, and most of the jokes were too. Those who are rating it poorly are both people who don't align with it politically, but also 100% of honest reviewers who look past the childish point of the movie and try to judge it honestly. It's just bad at the end of the day, period. I guess it does make for a good detection mechanism for a certain kind of person - just look who rates this over a 4/10 and you will know something about that person with absolute certainty.",
    "72": "Surprising quality of filmography given the rather low budget. The actors and actresses were far better then expected. The movie starts off slowly setting up the mental state of the primary characters. Modern reality then steps in and presents them with out of the box options that result in endless hilarity. I was quite surprised by the dialog quality even though the situations were so unusual. The actors stayed in character in even the hardest moments to keep a straight face. It is quite difficult to complete a project like this with so much comedy happening that the cast itself must of caused a large volume of reshoots to get it nailed down so well. I am surprised they took the time to really nail this down. This somewhat reminds me of The Interview years ago where the actors kept in character when you would believe it to be impossible.",
    "73": "It's about time someone made a comedy about the clown show of biological males playing women's sports. There are now a 55 yr old Canadian man saying he identifies as a 13 yr old girl so he can swim with and change in the same locker room as little girls. We should at least be able to laugh at it. If people aren't even allowed to do that then it's going to get ugly real quick.It's sad that it took DW to make this movie. 20 yrs ago, Hollywood would have been all over this because the comedy writes itself. Even guys like Kimmel & Colbert, who haven't been funny for a long time, would actually be funny in a movie about dudes playing women's sports because even the thought of it is funny, as well as maddening.",
    "74": "I went into this thinking it would be a cheesy, cheap B level movie. Similar to all the old Hallmark movies, it would focus on pushing an agenda over being a good quality movie. Especially considering the tiny budget this was made with, the fast production time, and the many non actors who they got to play a lot of the parts.I was very surprised to find that it was actually a great movie. I burst out laughing numerous times while watching it. Great comedy, great acting, all while talking about a serious issue.Seems you can actually have the trifecta of good, cheap, and fast.9/10. Go watch it.",
    "75": "For a first comedy from the Daily Wire, it was very well made. I really feel they should have included a cameo of Jordan Peterson, but all their cameos were great and perfectly timed.The movie was well written, and the characters were rich. Despite featuring many individuals who were not professional actors and had no prior acting experience, their performances were commendable. You would have to pay very close attention to even notice.There were two scenes where I noticed the actor looking at the camera, and the scenes with Ben Shapiro yelling at the coach could have been better, in my opinion. But perhaps I need to watch again.Other than that, I think the movie was fantastic. I laughed a lot.",
    "76": "Low budget, but entertaining. Too many talking points rather than actual dialogue, but a funny story. I'd watch again, as I loved those early 2000's sports comedies like dodgeball and the ringer. However, the acting quality could always be better. Maybe Daily Wire studios could recruit more recognizable actors in their future endeavors to further aid development of their studio. Gotta love the Ted Cruz and Ben Shapiro cameos, which are hilarious. I wish there was more to say, came in not expecting too much but left pleased by the simplicity of the comedy and easy to follow storyline. Daily wire is trending in a good direction.",
    "77": "This was a funny breath of fresh air. For a smaller budget than Hollywood multi-million dollar enterprise, this was an enjoyable watch.I really enjoyed watching the different personalities of the DW cast step into character. I especially liked the ending (I won't include any spoilers) but it was nice to see how they were able to bring the script around and brought it together nicely. The script was developed nicely and kept us laughing the whole time. It was particularly nice seeing the DW tip-toe into the \"I cannot believe they went there\" boundary!!!Check it out and see for yourself! Not a child's movie- funny adult content!",
    "78": "Just finished watching the movie, came out of nowhere and wow was I surprised, saw it on my new home theater, really wished this one came out in a cinema, but my home cinema completed the magic, loved the pro-women msg of the film with the humor injected in it, very appropriate and the acting, no oscars here but they acted well and funny which is what is important in a movie this days, good music, good pacing, very modern, loved the cinematography, very well shot, it is a good movie to watch with friends you know a good popcorn movie, I missed this type of comedy movies, we have been on a very dry streak here, and this movie brings freshness to the options.",
    "79": "The Daily Wire is definitely stepping up their game. True comedy that doesn't hold back. The editing, special effects and stunts were pretty good, I was really impressed. It was made really well. Aside from the ridiculousness of the subject matter, it poked fun at our current state. Hopefully people can enjoy it and have more open conversation about the true absurdity of It all. IT was a breath of fresh air being able to laugh and sheer tongue in cheek stupidity.Aside from the above, I loved seeing the Daily Wire commentators in most of their acting debut. I'm cheering you on Daily Wire, hope to see more from you.",
    "80": "An actual funny movie. It's a miracle! Lady Ballers manages to be funny without dropping F bombs every other word. It's also not one of these lame comedies that try and be completely clean either. It really threads that needle well and is surprisingly hilarious. Daily Wire Co-Founder Jeremy Boering is great in the lead role as Coach. There are cameo's by the other Daily Wire hosts Michael Knowles, Andrew Klavin, Ben Shapiro, Candace Owen's and especially Matt Walsh who had a recurring role through the film.The message is also a very important one which this movie does a great job of conveying. Looking forward to more Daily Wire Content!",
    "81": "Finally a real movie not filled with garbage. And so accurate! Surprisingly well put together, good film quality and great guest star appearances. The surprise Ted Cruze was awesome. It was hilariously funny without being mean, accurate for our times, and heartwarming as well. All the things you'd want out of a good movie, especially in a time of overly sensitive neutered films. Thought this would be a movie you couldn't make, but daily wire figured it out! Nice to see Ben and Brett as well! Hope daily wire sticks with this and makes more films and shows. Almost want Lady Ballers to get released in theaters so everyone without a subscription can watch too.",
    "82": "You would need to have seen the movie to get the Review title.OK, here goes. To be honest I was kinda expecting a whole load of skits, with no real laughs or storyline. So, it was a great to get a good and funny storyline. I guess I also got educated on a lot of stuff as well. LOL, I now know what gender fluid means now and also learned a few other things too. This movie actually made me laugh out loud quite a few times. Now, I really can't remember the last time I watched a comedy that made me laugh out loud so much. There were some real good moments in the movie and the acting was pretty good too, didn't expect that either. Also, loved the ending. I would say give it a try if you want a good laugh.",
    "83": "This is an amateur movie that is funny. Hollywood has forgotten how to make people laugh and that is sad. The actors aren't professionals and the script won't win any awards, but if you are looking for a silly movie that will entertain you then this is worth the two hours. It reminded me of the movie Dumb and Dumber. Not a great movie, but it was so stupid that you laughed throughout the movie. I was skeptical that Lady Ballers would be funny for 2 hours, but it is. Yes, it is a politically motivated movie, but let's be real, does anybody really believe biological men should be allowed to take over women's sports.",
    "84": "I really enjoyed the show, genuinely hadn't laughed this much in a long time. If you're looking for something entertaining to pass your time with, look no further, this is it.The story is simple and often an exaggeration of the on-going fads in america.What i find so remarkable about this movie is that it is able to illicit laughs by illustrating how ridiculous some of those trends had been. I called them \"trends\" here because had them been \"cultures\", america would have been doomed.Advice for the young and impressionable, going with the flow is fine, it may even be fun, but forsaking all common sense and blindly following something is just stupid.",
    "85": "Loved it , just feels like first time I started watching American movies back in 20003.Story line hits on current events makes you think critically about current and all these with full fun and no forced joke's which try to make u laugh even if it isn't funny . I would give 10/10 just cause it made me laugh so much and never bored me throughout the movie never felt it since very long. Just wished it was in theatre. Talking about about picture direction seemed exactly right characters I think they were meant to play specifically few one which i liked most. The way storyline keeps you engaged that at end of movie you think wait where was that slow boring 20 minutes we are used to have in nowadays movies and boom you ended few hours of your life happily instead of trying to feel yourself happy just so you don't feel bad about your money waste in many other movies.",
    "86": "While not the funniest comedy every, I actually think they do a good job dealing with the subject matter in what could have been much more harsh and cruel. Some great laugh moments are the highlight, and of course there may be more value in actually dealing with a subject that we're all brow beaten into not being allowed to criticize, question, or laugh about. Surprisingly the acting is passable for having so many people I'd consider not to be actors (Boreing, the DW crew). There are a couple funny nods to other films. There's a really weird product placement that is over the top and eye-rolly but aside from that one scene it's more subtle.",
    "87": "This whole film left me feeling quite unimpressed. Only one of the jokes succeeded in getting a laugh out of me to start. Which for a comedy is certainly disappointing. The jokes were most often making fun at fictionalized left-wing views, which got old quickly. Tired bits they would repeat again and again. Even taking that aside the plot felt bizarrely cut short near the end to me. With rushed character arcs that were very sudden. Perhaps if they wanted to impart the message they clearly wanted they could've taken certain moments more seriously. Which I could forgive if it made me laugh more. I am usually a fan of comedies and thought I would come in with an open mind here and be respectful. It just seemed like they were thinking of politics first and plot or jokes second. Very disappointing and there really isn't anything redeeming to offer, I encourage anyone to look the other way.",
    "88": "It is not a Hollywood production so you got to evaluate this movie on what it is. When you do that it's actually an enjoying experience.I'm surprised with the quality of acting from people that by no means are actors. Billie Rae Brandt and Rosie Seraphine Harper did great and Ben Shapiros small role where both very Ben Shapiro and exactly how you'd imagine a poorly paid basketball referee to act. The addition of the reporters having to undergo sensitivity training was hilarious.I said you'd have to evaluate it for what it is, but to me it actually felt like a comedy. It reminded me of a mix of Pitch Perfect, American Pie and The Longest Yard.",
    "89": "Great movie. Trans people don't exist. What the f is wrong with people today. The only problem is it's not that funny because it is about the real world. Really why does this seem normal because that's what you see as soon as you turn on the tv so i'm glad they made a good movie. I can't wait for the Pendragon Cycle, Snow White, and Mr. Birchum. Anyways Lady Ballers is an incredible movie watch it if you haven't seen it. I hope Daily Wire release it on dvd too. Because I watch my basketball movies on dvd like Space Jam, Rebound, and more. So i'd love it even more on dvd. But long review short good movie.",
    "90": "It's a very funny movie, if not exactly family friendly. In my opinion, it could have been just as entertaining with half the vulgarity. Tyler Fischer is hilarious and should have had twice the screen time. My favorite moment was his sendup of a particularly obnoxious social media influencer. Matt Walsh's hippy character was endearing and very funny. Overall, I loved the deconstruction of progressive logic. Jeremy Boering is a solid comedic actor and I can't wait to see what he and Daily Wire do next. It's incredible how they're creating movies on a shoestring budget that are way better than mainstream movies with $200 million budgets.",
    "91": "Just as funny as most comedies today just wish there was more adult imagery but then again that's just me. Video looked a little bit under budget but they was able to work with what they had while also saying what they need to say throughout the movie or even surprising me with a few good and surprisingly cleverly Witten jokes but also having actors who I haven't seen before but seem to have know what they were doing either by Talent OR by good directing from third director video talked about real world issues on a level and degree that I think a lot of people would agree with even though it was pushed to a extreme critique in order to drive its Point home.",
    "92": "Non-spoiler** Lady Ballers excellently toes the line of comedy and offensiveness that Hollywood hasn't dared touch in a LONG time. The production quality was excellent and there were several points of the movie that had me laughing out loud. It does a great job of making fun of the absurdity that is happening today in women's sports, as well as the overarching acceptance of anyone can be anything just because. Of course there were some cheesy or not-so funny parts, but every comedy has those moments. I'm sure others found them funny when I may not have. My rating though is based on the overall movie which I found to be quite hilarious, yet still had genuine, thought-provoking moments and messages. I loved the message at the end between the coach and his daughter and the resolution at the end of the movie. I thought the plot had some pretty clever moments that make for great story-telling.Spoiler** I will say, the advertising of Jeremy's products in the background of scenes was fine in my opinion, but the blatant scene in the middle of the movie was out of touch, had zero to do with the movie/plot, and just comes off as annoying. Daily Wire, if you read this, stick to the subliminal advertising as opposed to the in-your-face commercial in the middle of a movie strategy. It didn't make me want to buy your products, let alone contribute positively to the movie in any way, so it's just a negative on all fronts.",
    "93": "Outrageous. Offensive. Absolute genius!The DailyWire cast delivered. The plot was pretty well developed for an uncomplicated satirical project. They mock every current progressive target - from Caitlyn Jenner and Dylan Mulvaney to Elizabeth Warren and others.The supporting cast dialogues were written more sharply than is often the case in comedies where the star gets all the good lines. Jeremy as coach was brilliant. The brief Shapiro, Candace, Klavan and Peterson cameos didn't make the movie better but if you like them, it ends up being a nice addition to the whole.There are lessons lurking everywhere and the ending is very sweet. Great movie in general. I see the DailyWire becoming the new Conservative Hollywood and I like it.",
    "94": "It has the look and feel of the comedies of the mid 2000s, the movies most of us have seen 100+ times but also movies that would never get made today. To start, no way this should be a 120 minute movie, 90 minutes would have been plenty plus a shorter run time would have improved the overall flow. It's obvious the goal was just to poke fun at the notion of biological males competing in female sports but they didn't go a layer deeper and explorer some of the complexity of the subject. There were a few solid laughs, mostly from the physical comedy, some good one liners, funny visuals but fell short trying too hard attacking the social points. Worth a watch? Maybe. Is it one of those comedies you will watch 100+ times, nope. Probably a 1 and done.",
    "95": "Having Daily Wire hosts in the roles had some novelty to it but comedy timing is a skill. Don't get me wrong, it had some genuinely funny bits but would have loved to have seen some more comedic actors.With Hollywood smelling their own farts for the foreseeable future, independent movies like this are important and especially those that aren't afraid to call out the ridiculousness of current culture.I grew up with 90's comedy and this had all the nostalgia of it, but the pacing, timing and script were not quite there. However, this studio is obviously very new and are still polishing their craft, so looking forward to the next instalment.",
    "96": "What a breath of fresh air! This movie is utterly hysterical! Back in the day we had movies like, The Naked Gun, Austin Powers, Airplane!, Anchorman, and more. Movies have shied away from creating anything new lately. Comedies in recent years typically focus on drugs, gratuitous sex, or nonsense. Lady Ballers is witty, fast paced, and the perfect satire for 2023. There's plenty of innuendo, but it has an actual point. Best comedy I've seen in years!No matter what your politics may be, good writing, fun characters, and a movie full of heart is what you'll get delivered.Stop reading this review and just watch the movie.",
    "97": "I would say a solid 9/10! It's hilarious, well written and addresses taboo topics. This is true comedy, it makes jokes that go up to the line without crossing it. It also addresses real issues and satirizes them perfectly. I think my favorite part of this was all the cameos from various people like Riley Gains, Ted Cruz and Brett Cooper. Another interesting thing about this movie is it addresses real debates that society is having about real issues and frames it as satire so that people can see how ridiculous things actual have become. Lady Ballers is definitely my favorite comedy of 2023. Perfect valence of pop culture references with just enough controversy sprinkled in. Would recommend!",
    "98": "This might literally be the absolute worst movie I have ever scene. Full disclosure I didn't want to watch it to begin with, but agreed because my wife really wanted to see it. By the time we were done she was mad at me for not pushing harder for something else. It's nothing but culture war crap trying to be pushed down your throat as humor, and they didn't even do a good job at that. The whole movie was cringe, it wasn't funny it was just cruel. People will say you just don't get it, but there have been other movies that skirted the issue of boy playing as girls that were actually funny. Rodney Dangerfield did it 30 years ago with Ladybugs and they never demeaned or talked down to people. This wasn't funny because it was to crude or offensive, it was just dumb and not funny. Please save yourself the torture and watch something else.",
    "99": "Bravo to Jeremy Boreing and the Daily Wire for having the guts to do this. Is this a side-splitting John Hughes quality comedy? No. The movie features a generally novice cast. So, some of the gags and jokes fell flat, particularly in the opening half of the movie. But, this isn't to say there weren't some good laughs. Andrew Klavan's epic one liner was worth the ticket-price alone, and the men vs women sports scenes delivered several laugh-out-loud moments. Jeremy Boreing shouldn't expect an Oscar, but he gets kudos for bravery. Lady Ballers shines a much-needed light on the absurdity of allowing men to dominate women's sports.",
    "100": "I lean conservative, I'd like to think too that I'm a realist. This movie, realistically does not deserve the high ratings.The acting, on the whole, is just a titch above high school play level. The story was low IQ level. The jokes not fresh or funny. The pace veeeery slow.Camera and cinematography was perhaps the best part of the movie.I just did not find this entertaining.The whole thing kinda reminds me of when a bunch of guys get together and laugh at farts or when one of their buddies accidently hurts themselves.Moronic. Boring. Idiotic. Slow.But then again I'm not a guy, or stuck in high school brain zone.",
    "101": "I wanted to like it. I get what they were going for, and it's worthy of praise coming from such a small studio with such a low budget. I hope this isn't the last in this genre from DW.That said - wow. Not up to par of the classics it was marketed as. Airplane, Dodgeball, Blazing Saddles, Topic Thunder: it's none of those things. I think it could've been with some extra elbow grease and less confirmation bias in the studio.The criticism that many Christian movies get is that they focus too much on the message and not on the core story and quality of the film. Same issue here. I get they had some quality limitations, but I wish they would've waited to really hone in the story and make sure the lines packed a punch.Best parts are all the cameos. These are genuinely good and appreciated.Not sure why we needed the subtle dominatrix thing. Just another example of something that made me cock my head sideways and ask, \"Really? Necessary?\"Overall, I know I'll make some people mad for not absolutely loving it, but it is what it is. They want quality content? I'm happy to be the critic for the next future success. I'm aware I'm not the man in the arena, but I don't care.",
    "102": "I'm not the biggest fan of the Daily Wire, but neither have I found myself agreeing with those this movie tries to satirize. The 'trans athlete' topic is a highly sensitive and ruthlessly divisive one, and it is quite possible to take this concept and satirize it at its most extreme. And bar those who take offence to literally everything, a smartly comical dig at any ideology has the capacity to be entertaining and enjoyable.Unfortunately, while the Daily Wire did have the material to poke fun at the seeming absurdity of the premise, it just ended up feeling like a lackluster presentation of every familiar talking point and anecdote routinely echoed on the network. And sometimes, it's also a 'Jeremy's Razor' commercial, the rationality behind a move as such in a feature film is one that escapes me. There wasn't a single laughable moment in the whole movie, because if you've been on social media at least once in the last five years, you could see the punchlines coming a mile away. And if you did somehow find this movie funny, then maybe some self-reflection on whether you might be a tad ensconced within an echo chamber could be helpful.Underneath all of this, there probably was a silly 'Tropic Thunder'-esque comedy hiding somewhere. Unfortunately, the film fails to tap into that potential, as it seems to lack the nuance and the creativity necessary to bring such a satire to life without appearing as partisan and preachy as it does here.",
    "103": "We need a good comedy poking fun at the society gone mad on gender identification and answering what if men decided to pretend to be girls and compete against woman... however, this movie fails to be it.A Dollar store version of Emilo Esteves coached a high school team to victory some years ago, but has become a loser since. So has his whole team he coached years ago. Throw in some useless filler about his life no one care's about and he runs into one of the players he coached working in a cross-dressing restraint.... more filler, blah,blah, blah they decide to enter the player in a track and field to win 5k while the player pretends he wants to be identified as a woman... blah bla blah more bore and next you know they've convinced the old basketball team to reunite and pretend they're all identifying as woman now and it gets a few news headlines, yadda, yadda, typical predictable outcome with a cute little ending.The film has very little to laugh at. I dunno if everyone involved in making this are just not good comedy creators, or if there was a better script and the studio butchered all the good bits, as this movie fails to be a movie for adults, yet kids would be bored stupid.There's a couple of things I bet the Karen's of the LGBTQ community would say is wrong, but this movie just doesn't push the envelope and just go for it. It doesn't go for anything much actually. It tries to have some moral to it, but it's pretty weak.Mostly I felt like I was watching a movie where someone watched BASEketball, and thought they'd do a version on the gender thing, but this movie had no Zucker, Parker or Stone to inject any funny lines, moments or anything memorable at all really.It's an idea that had a lot of potential, but it failed by holding back, sticking to worrying about being offensive and has no heart or charisma anywhere throughout this typical generic story that's been seen and done a billion times, just this time it's playing on gender identification and being dishonest with it, just to win a sporting event.",
    "104": "If you've seen the trailer for this comedy, then you know exactly what you're getting. It's a goofy sports movie with every single trope of that kind of film hit. Everything is lampooned, nothing is sacred. What makes this a standout film is that the most ridiculous, ludicrous, over-the-top thing they mock is actually happening: men allowed to play sport against women. In a world this stupid, satire is probably hard to achieve, but the Daily Wire team make a pretty good job of it. I particularly liked the 'day three of being a woman athlete' segment, which clearly mocks Dylan Mulvanny and his grossly offensive mocking of women. However, the moment that this turned from a B-grade kind of film to something very thought-provoking and challenging was the end: the way they chose to bring home the genuine evil we are allowing to happen to our women and girls. It was masterful and very moving.Is this a brilliantly made film with superb acting throughout? Obviously not. Is this a must-watch, culture-changing statement about the human condition? Well, yes, I think it might just be.",
    "105": "Cleary, this is movie is a controversial take (relative to typical movies) on a divisive subject. Although arguably more of the division is in legacy media and other pockets influencing culture vs. The majority of citizens. While much of the writing was a bit on-the-nose and could have been more subtle in highlighting the ridiculous, it was far better than it could have been.ESPECIALLY considering that the cast had to comprise people willing to commit Hollywood career suicide. I guess that's why the lead actor was the CEO of a media company, half the main cast are podcast hosts, and the remainder have no other film credits. All things considered, shockingly good performances from them.Film ran long and bogged down at times, but I did laugh out loud a number of times as funny moments. Hopefully the Daily Wire will use this as a starting place and continue to mature as a entertainment creator. But this was a promising start.",
    "106": "\"Lady Ballers\" was a film I approached with some anticipation, given its intriguing premise. However, I found it to be disappointingly shallow and pedantic. The acting across the board was underwhelming, contributing to the film's overall lack of depth and engagement.A critical drawback of the movie was its humor, or the lack thereof. The jokes felt forced and failed to elicit the intended laughter, detracting from the viewing experience. This issue could partly be attributed to the script, which seemed to need more refinement. The potential for a successful comedy was there, but it required a sharper and more experienced comedic writer to bring it to life.The film appeared to serve more as a vehicle for promoting Jeremy Boreing's businesses than as a piece of entertainment. This focus undermined the story's authenticity and the characters' relatability.Tyler Fischer's presence in the film was a lone bright spot. His natural comedic talent shone through, despite the limitations of his role. Fischer's performance gives me hope for his future projects, as he clearly has the potential to excel with better material.In conclusion, \"Lady Ballers\" misses the mark in several key areas, making it a less than satisfying watch. The concept was promising but was let down by lackluster execution and a script in need of a few more rewrites. It's a 4 out of 10 for me, primarily saved from a lower score by Fischer's brief moments of comedic relief.",
    "107": "It's amazing how a b movie with a 7 million dollar budget featuring non-actors i.e. People with no acting training or credentials manages to be at least as watchable as productions worth hundreds of millions coming from big studios like Disney. And unlike those movies this one could have made 100-150 million at the box office thus turning a nice profit, something that seems to elude Hollywood these days, but due to poking fun at certain people, situations and ideologies it will never see the inside of a movie theatre or the catalogues of mainstream streaming services. And this is what makes it a bold comedy with plenty of balls. Needless to say don't expect to be blown away by the best movie you've ever seen but its definitely watchable and definitely funny while making a point that is missing from the one sided mainstream narrative, even if the movie is one sided itself, that's the essence of freedom of speech: having the choice of being able to listen to different points of view, instead of just one.For what this is, it is a good all around movie.",
    "108": "Watched Lady Ballers this morning. It's available only on Daily Wire+. The movie reminds me of comedies from the 80's or 90's; silly and irreverent. No nudity, but there are some racy jokes about body parts and bedroom acts.Jeremy Boreing plays the head coach of a men's basketball team who all decide to identify as female to win a women's tournament. The jokes practically write themselves. To be honest, some land and some don't. Enough land, however, to rank LB at 7/10.Matt Walsh playing against type as \"Kris\" the hippie was delightful. Couldn't stop laughing whenever he was on screen. And, the actress who plays coach's daughter is very sweet. She steals the opening scene.What I didn't expect to be so wow-ed by was the musical score and beautiful drone shots of Nashville. The opening theme song is earnest and oh-so cheesy; a la American Flyers. Love it! There were lots of musical changes of pace, too, like the switch to an old-worldy accordion tune for the scene where coach is getting roughly handled by the dominatrix reporter. \"Furnace burn!\"I've also got some quibbles. For example, the final, fade-to-black image was totally unrelated to the rest the movie. Just oddly edited. Also, the players were too often either fighting or high fiving. That got old quick; as if dudes can't just sit and chill without punching each other.Overall, it was fun.",
    "109": "We have example after example of the far left demonstrating that they can't write entertainment & that any time they attempt to, they just create cringe inducing message fiction.So it's a nice change of pace to see the far right proving that the far left are not alone in their inability to create entertainment..... That anything they try to create is just as cringe worthy as the most far left intersectional wannabe communist, with pink dyed hair.But as far as the actual product, it's nothing but cringe inducing unfunny boomer dad jokes, idiotic stereotypes, proving once again that collectivists cannot write, regardless of which side of the center they personally collectivise for.Do yourself a favour & do something productive with your time, instead of watching this movie.... Or do something unproductive, pretty much do anyhting other than watching this movie.",
    "110": "It's so current that people in 20 or 30 years won't really get the movie.Maybe that's a disservice towards it in the long run,but today,it's everything Hollywood should say out loud and doesn't.At least some people still have the balls,pun intended,to try to show the sad truth about the times we live in.The DW was on the frontlines of the Culture War since day one and it's nice to see they put their money where their mouth is.It's obvious no network,theatre or streaming service will touch this so they knew it was doomed from the beginning yet they still made it.Mad respect and kudos.The movie really had me LoL a few time,which is way more that i can say for most comedies in the past 10 years.Ending was really unexpected which is pretty hard this day and age when you seen every plot and twist possible and impossible.",
    "111": "I will agree with other reviewers that it was more \"mature\" than I expected. However, look at what it's about. If we want this kind of conversation out of our schools, do we really expect a movie about it to be kid friendly?The cameos were pretty funny. There were parts that took me back to older comedies I really liked-Dodgeball and Pitch Perfect to name a couple.Two decades ago, I'd likely give this movie a solid 8. But since the quality of screenwriting has tanked since then, this movie deserves no less than a 10. Thank you for setting the bar higher than everyone else, DW.What was really interesting to me was the fact that so many of the actors in this movie are not trained actors. I must say that they were believable all the same. Yes, there were corny parts, but it was a corny comedy. It was supposed to hit like that. If you don't remember that kind of comedy, it's probably cause no one has been making them (or making any worthwhile) for a long time.I look forward to other shows and movies coming out of DW's studios in the future. This movie was a good laugh.",
    "112": "It just doesn't get any better than this!Absolutely hysterical and only triggering for the easily triggered. ;-)\nTyler Fischer was AMAZING as always and if you're not already following him on y0utube, definitely go do that right now.Go look at all his stuff -- over 500 vids and have yourself a binge-watch, right after watching Lady Ballers, of course!Oh and if only this was satire, but it's not.This is the bizarro-world that we've been led into. Like sheep to slaughter, by the highly organized, screeching network of pied-pipers whose driving force in life is to get their minions to bow down at the sacrificial altar of T0LERANCE.How awesome, right?",
    "113": "With very few creatives in the world being willing or able to produce stories of this nature, I applaud the attempt and intent.However, it just isn't very good overall. Not terrible either, just... barely adequate.The premise is funny, politically and socially valid but the execution leaves a lot to be desired.The actors mostly do a good job, Matt Walsh steals every scene he's in, but the direction, cinematography and editing were just passable.Coming from an independent conservative media group seems to be a double edged sword for the production. They can have an absolute field day with thematic freedoms others just don't have, yet are simultaneously stifled by a logical foundation of understanding when it comes to creativity.The result is a premise with huge potential that comes out a bit bland. The product placement was a terrible choice but, if it was absolutely necessary, they at least got it all out of the way in one segment and moved on.The story has a moral, the outcome is relatively wholesome, there are certainly quirky characters, humourous events and some level of entertainment to be had here. Given the almost complete lack of comedies produced these days, and the fact its themes are verboten throughout almost the entire entertainment industry... you could do a lot worse for something to watch.I had similar sentiments after seeing Sound of Freedom, a film with much better production values and talent. A very important and topical film which will have nowhere near the impact or historic longevity it deserves because of uninspired artistic achievement.The ingredients are all there but they're being prepared by short order cooks and not world class chefs. Unless these types of productions can make a deal with the Devil and coax an unhinged artistic genius into their cause, this trend will likely continue.There IS a thing called movie magic, and people who don't believe in magic can't perform it. Without it you don't have art, you only have a product. Maybe that's enough these days given how little of it remains but with it, the impact would hit so much harder.Anyway, watch it, enjoy it for the bland yet rare thing it is. And maybe someday, an important film will achieve the artistic gravitas needed to perform its function well.",
    "114": "DW promised a goofy, early 2000s comedy with a message and I believe, overall, in landed. I enjoyed it and laughed at the slapstick goofiness and appreciated the meaningful bits. I can see and understand where it fails a little too.As a stand alone comedy, it's a popcorn movie and doesn't overstay it's welcome with it's pacing, comedy, and plot. The general movie goer (who isn't wildly liberal) would still have a good enough time if one likes movies such as the The Hot Chick, White Chicks, Scary Movie, Wayne's World, and other such on-the-nose, wacky, dumb movies that would have a difficult time being made today. It is true that a DW fan would find the movie more enjoyable due to the cameos - which were extra hysterical if you're \"in the know.\"If I could only change one thing as someone who loves the idea of this comedy shedding light on an important issue, I would have either removed the ending cameo entirely, or shifted it to after credits.The general public would also enjoy it even more if they are aware of the western nations' culture war; if the viewer is unaware, the hopeful goal of the movie would be to make people aware of conservative concerns.That said, the movie does not ride on the backs of DW and conservative cast members; it scratches the old comedy itch millennials have, makes gen x roll their eyes, and can show gen z what comedy used to be.",
    "115": "Ladyballers exceeded expectations. I expected a very pointed message with some weak comedy and production flaws.The Daily Wire probably can't get many Hollywood actors onto a project b/c the actors would be afraid of backlash, even if the film had no political leanings--but still, they managed to find some good talent. Jeremy Boreing and Billie Rae Brandt both have star-quality. Fischer and Cone also great, but really the whole team worked. I was looking for weak links in the cast and didn't find any.The cameos were okay, not bad. The best being B. Cooper and M. Knowles as the news anchors. Their arc was hilarious and their delivery was perfect. And quite fearless with the costumes, I love that.The humor landed pretty well, some parts better than others. Most comedies are like this. I didn't find the \"how much\" guy very funny. I loved the badger stuff, that made me laugh pretty hard. I also enjoyed all the shots they're taking at the journalist class. That's long overdue. The Jeremy's razor commercial in the middle of the movie was very funny, pulled off in just the right way.And obviously the satire's message is spot on. Everybody knows these things are true, everybody knows the emperor is naked, but everyone's afraid to speak up.Satire isn't just preaching. There are definitely some preachy moments in the movie (and I didn't mind them probably b/c I agree with the sentiments), but this still works as satire b/c the ideas are embodied well by the story on the whole.It also had better production value than I was expecting. They definitely dropped some money on all the extras in the last game. The score/soundtrack was a highlight, very good music, which is important. The tone was consistent. The cinematic elements were all competent. Lighting was good. I'm not a fan of the murky \"realistic\" lighting movies are obsessed with now. Just make it look good.And the end delivered. It was perfect to see the lady ballers get their comeuppance and get a taste of their own medicine. I loved how they worked in the coach giving \"inspirational\" speech trope and played with it in various ways.And I liked how genuinely heartwarming the ending was with the little girls team. The old comedies usually try to pull some heart-strings in the end and typically fail, but here it definitely worked. The father-daughter relationship was very lovely.I expected a movie I would be a little amused with and probably have to endure, but we ended up enjoying it thoroughly and we didn't interrupt watching it once.I'd give the humor a B+. The heart/feeling an A-.And the satire an A.",
    "116": "Look, I'm a daily wire fan and the message of the movie is good. But this movie is nearly impossible to get through.The acting isn't too bad, especially considering how almost none of these people are actors. But the writing and dialogue is just painful. There were some funny parts but many of the jokes are just weird and unfunny.There are also some montages that go on for much too long.The funnest part of watching this is seeing all of the cameos from Daily Wire hosts. Sorry guys, but this just hurts.If you don't already have a dailywire+ subscription, it's definitely not worth paying for just to get access to this :/",
    "117": "I'm a DW supporter, and I want them to produce great content. This is only OK.Run hide fight was good, not great.Terror on the prairie was ok,\nShut in was rough\nWhat is a woman was great doc\nConvicting a murderer was great docFirst of all. 1h52m is way too long for a comedy, unless it is absolutely amazing. Should have been 80 minutes. We found ourselves struggling to get to the end. It's a comedy, get in there, make the jokes, get out on a high point, fill it with a story with a remotely plausible plot.I like them using DW folks for some of the actors, but Boreing as a lead fell pretty short. Some parts of his acting was fine, most was not. Didn't seem natural. Probably keep him to cameos only going forward.The plot was weak on the whole. The idea was great, but execution is tough I guess. Comedies are not supposed to be the most cerebral of genres, but if all you're standing on is the jokes, they better bring the heat.The writing/dialogue was fine for the most part.Jokes were okay without being excessively mean spirited.They are a new studio, so I am hopeful they will improve.",
    "118": "I am basically the target audience for this movie, but that said, a true Daily Wire fan won't pull punches.Lady Ballers' claim to fame is its comedic satire and on that front, it does very well. A common worry for me with modern comedies is that the trailer will show every good joke or point the movie has to offer, leaving the rest of the movie to be bland plot exposition. In this case, there is plenty more than the trailer shows, but none of it will necessarily exceed the trailer. What you see is what you get.There are a lot of jokes, and some of them are downright incredible, while some of them fall flat. It's definitely a weird movie, and how many and which jokes you laugh at will likely depend on personal taste. I totally agree with the take that this movie may as well have been written by Adam Sandler. On that point, it is not appropriate for kids under 13. Some mature themes are explored (obviously) and there are some dirtier jokes involved. Obviously nothing disgusting is shown, but there may certainly be some awkward questions if watching this flic with those not familiar with the existence of weird fetishes and creeps.As for the message of the movie, I'm happy to report that by the time it arrives, the audience is actually ready for it. There's no beating people over the head with politics (other than the men in women's sports thing obviously) and it winds up being genuinely heartwarming.The acting is mediocre, which is to be expected given the non-professional actors, and the cameos make it all worth it.The cinematography is honestly a bit weird at times, and there were some occasional choices that I found annoying, but pretty good quality overall. The actual production on display is completely acceptable, and quite impressive considering the low budget. It genuinely felt like any other Hollywood production in terms of quality. Clearly a lot of work was put into this movie. (It also says something that $7 million is all you need to achieve the quality of Hollywood's $100 million releases but that's a topic for another time)Best part of the movie: Matt Walsh's character didn't have a single less-than-stellar moment. From writing to casting, his character is brilliant. Most characters have both great and bad lines/acting/presence but a few absolutely knock it put of the park, with the most obvious being Matt.The worst part: there are definitely some odd side quests and stupid tangents sometimes. They aren't necessarily boring, but very weird. The good news is that they don't last too long so you won't get too annoyed as the story seems to spiral out of control. Yes they are slightly pointless, but the story will get back on track within a few minutes.Overall: not bad at all! Not a classic or mind blowing, but definitely does its job sufficiently. Not going to be my favorite movie, but will be watching again. It's probably not worth an entire DW subscription for, but if you were already in the fence, this could certainly put you over the edge, especially if this isn't the last of its kind. I hope we get more like this in the future!SBG for life!",
    "119": "I strongly recommend this film. Great writing, directing, production, acting, but most importantly, it's *actually* funny, and willing to take risks potentially offend people in service of creating laughter. Such risks are so valuable when every other movie these days is lacking them.This film really doesn't pull it's punches. Not a lot of studios would produce a movie like this, with obvious \"offensive humor\". Thank god they did, all the funniest movies are \"offensive\" and as a result this film seems like the funniest live action comedy in years.I was impressed by the excellent cast, great work from with leads. Main protagonist and villain both played pretty much perfectly for me. Some side characters (like the wife, her boyfried and the kid) are played very well too.My only complaint... there's a few unnecessary scenes that drag on or are based on gags I didn't find funny. Additionally there's a couple over cliche jokes that definitely could have been done differently or somehow better.Great film still, because it's tons of laughs! The few slow, flat, or unfunny parts are worth sitting through... because the good parts are truly comedy gold.Go watch it!Misc Other Notes:I won't be specific to avoid spoilers, but here are some vague comments that although don't spoil, some people find spoiler-adjacent. If that worries you, stop reading now!There's a twist \"joke\" introduced to a comical relationship that they seem to thought would add humor but really just takes it away. Really makes that whole running gag less funny.Some good grains of wisdom in it too, has in its serious parts actual excellent life advice.Finally... This film has a great climax+ending! The resolutions and way they deal with the issues near the climax and before the end is brilliant. I wasn't sure what they'd do to get it cleverly working out it, but they picked a perfect idea for the resolution leading towards the preend and it worked.",
    "120": "Can I just say how refreshing it is to be able to a comedy in 2023 that isn't graphically, sexually explicit?The Daily Wire has been putting out some great content and this is no exception. Even if you aren't familiar with the DW team, you'll still enjoy the performances from the cast.Lady Ballers felt like late 90s/2000s comedy: think DodgeBall, Benchwarmers, Blades of Glory, Heavyweights, etc.I think this film did a great job of tackling modern social issues in a genuinely funny way. Content wise, even though its addresses aspects of* sexuality, it's still pretty tame to watch with family/young teens.If you could use a good laugh, I recommend checking it out!",
    "121": "Overall funny movie, a couple of moments of genuine laugh out loud jokes. Especially in the middle.It is not a grade A comedy movie, like Dodgeball or Billy madison, happy Gilmore. Which means I don't think I would watch it again.It's main draw back is timing and length. Comedy movies should be 90 minutes and the great comedy movies are exactly 90 minutes. This is almost 110 minutes and it feels like it.They really should have spent some time in the editing room trimming jokes down, trimming unfunny scenes out. Shortening cameo time or using different methods for the cameos.It could have been a much funnier movie with a little more work.",
    "122": "It's basically a giant in-joke. If you're not the specific audience this is meant for, much of the humor comes across as random or extremely forced. If you see the trailers and that appeals to you, you might be able to get some enjoyment out of it, but otherwise it's a lost cause.Production wise, it is the epitome of mediocre. The production company actually has a history of failed actors running it, and you can REALLY tell when they just inserted themselves into roles for the movie. Direction is very basic and the biggest compliment I can give is that they could afford professional cameras.Beyond those notes, there isn't really anything more notable about it. It doesn't try to tell much more of a story than an excuse to get the cringeworthy humor out there. So decidedly there's nothing of value here unless you specifically want that,All in all, it feels like the sort of film a bunch of fraternity bros would put together for a film festival, just with a slightly higher budget.",
    "123": "This film tackles a very contentious topic, with a comedic and often very sympathetic lens, it doesn't wish to demean anyone, but rather point out the absurdity in some modern concepts by simply putting them to the screen. That is what good comedy does, especially when it is actually tackling a contentious topic (as so much great comedy does, like Gervais and Chappelle, just to name a few).I think the performances are really good, I like the nuance a lot of the characters are given, I won't give it away but one of the main characters is genuinely shown as a struggling young man with issues, and the film illustrates really well the inner turmoil he has (as I'm sure many trans people also experience) albeit the real solution isn't \"changing\" your gender, but simply accepting yourself for who you are, and that's what those that care about you should help you do, rather than affirming a harmful and insidious delusion that will never be fulfilled.Billie Rae Brandt was great in this as well, I was really excited to see her in a feature, and she did a spectacular job. All in all, I just hope whoever is reading this can see past all the leftist political extremism that social media pushes, and go into this (and many other films he may not agree with) with an open mind, like a true liberal would. Someone open to change, open to free speech, and discourse, and not afraid for the man on the other side to speak, but rather welcoming of it. Because if that's how he entered this film, then I'm sure he'd find a good movie and an important message within.",
    "124": "DW promised a goofy, early 2000s comedy with a message and I believe, overall, in landed. I enjoyed it and laughed at the slapstick goofiness and appreciated the meaningful bits. I can see and understand where it fails a little too.As a stand alone comedy, it's a popcorn movie and doesn't overstay it's welcome with it's pacing, comedy, and plot. The general movie goer (who isn't wildly liberal) would still have a good enough time if one likes movies such as the The Hot Chick, White Chicks, Scary Movie, Wayne's World, and other such on-the-nose, wacky, dumb movies that would have a difficult time being made today. It is true that a DW fan would find the movie more enjoyable due to the cameos - which were extra hysterical if you're \"in the know.\"If I could only change one thing as someone who loves the idea of this comedy shedding light on an important issue, I would have either removed the ending cameo entirely, or shifted it to after credits.The general public would also enjoy it even more if they are aware of the western nations' culture war; if the viewer is unaware, the hopeful goal of the movie would be to make people aware of conservative concerns.That said, the movie does not ride on the backs of DW and conservative cast members; it scratches the old comedy itch millennials have, makes gen x roll their eyes, and can show gen z what comedy used to be.",
    "125": "Ladyballers exceeded expectations. I expected a very pointed message with some weak comedy and production flaws.The Daily Wire probably can't get many Hollywood actors onto a project b/c the actors would be afraid of backlash, even if the film had no political leanings--but still, they managed to find some good talent. Jeremy Boreing and Billie Rae Brandt both have star-quality. Fischer and Cone also great, but really the whole team worked. I was looking for weak links in the cast and didn't find any.The cameos were okay, not bad. The best being B. Cooper and M. Knowles as the news anchors. Their arc was hilarious and their delivery was perfect. And quite fearless with the costumes, I love that.The humor landed pretty well, some parts better than others. Most comedies are like this. I didn't find the \"how much\" guy very funny. I loved the badger stuff, that made me laugh pretty hard. I also enjoyed all the shots they're taking at the journalist class. That's long overdue. The Jeremy's razor commercial in the middle of the movie was very funny, pulled off in just the right way.And obviously the satire's message is spot on. Everybody knows these things are true, everybody knows the emperor is naked, but everyone's afraid to speak up.Satire isn't just preaching. There are definitely some preachy moments in the movie (and I didn't mind them probably b/c I agree with the sentiments), but this still works as satire b/c the ideas are embodied well by the story on the whole.It also had better production value than I was expecting. They definitely dropped some money on all the extras in the last game. The score/soundtrack was a highlight, very good music, which is important. The tone was consistent. The cinematic elements were all competent. Lighting was good. I'm not a fan of the murky \"realistic\" lighting movies are obsessed with now. Just make it look good.And the end delivered. It was perfect to see the lady ballers get their comeuppance and get a taste of their own medicine. I loved how they worked in the coach giving \"inspirational\" speech trope and played with it in various ways.And I liked how genuinely heartwarming the ending was with the little girls team. The old comedies usually try to pull some heart-strings in the end and typically fail, but here it definitely worked. The father-daughter relationship was very lovely.I expected a movie I would be a little amused with and probably have to endure, but we ended up enjoying it thoroughly and we didn't interrupt watching it once.I'd give the humor a B+. The heart/feeling an A-.And the satire an A.",
    "126": "Look, I'm a daily wire fan and the message of the movie is good. But this movie is nearly impossible to get through.The acting isn't too bad, especially considering how almost none of these people are actors. But the writing and dialogue is just painful. There were some funny parts but many of the jokes are just weird and unfunny.There are also some montages that go on for much too long.The funnest part of watching this is seeing all of the cameos from Daily Wire hosts. Sorry guys, but this just hurts.If you don't already have a dailywire+ subscription, it's definitely not worth paying for just to get access to this :/",
    "127": "I'm a DW supporter, and I want them to produce great content. This is only OK.Run hide fight was good, not great.Terror on the prairie was ok,\nShut in was rough\nWhat is a woman was great doc\nConvicting a murderer was great docFirst of all. 1h52m is way too long for a comedy, unless it is absolutely amazing. Should have been 80 minutes. We found ourselves struggling to get to the end. It's a comedy, get in there, make the jokes, get out on a high point, fill it with a story with a remotely plausible plot.I like them using DW folks for some of the actors, but Boreing as a lead fell pretty short. Some parts of his acting was fine, most was not. Didn't seem natural. Probably keep him to cameos only going forward.The plot was weak on the whole. The idea was great, but execution is tough I guess. Comedies are not supposed to be the most cerebral of genres, but if all you're standing on is the jokes, they better bring the heat.The writing/dialogue was fine for the most part.Jokes were okay without being excessively mean spirited.They are a new studio, so I am hopeful they will improve.",
    "128": "I am basically the target audience for this movie, but that said, a true Daily Wire fan won't pull punches.Lady Ballers' claim to fame is its comedic satire and on that front, it does very well. A common worry for me with modern comedies is that the trailer will show every good joke or point the movie has to offer, leaving the rest of the movie to be bland plot exposition. In this case, there is plenty more than the trailer shows, but none of it will necessarily exceed the trailer. What you see is what you get.There are a lot of jokes, and some of them are downright incredible, while some of them fall flat. It's definitely a weird movie, and how many and which jokes you laugh at will likely depend on personal taste. I totally agree with the take that this movie may as well have been written by Adam Sandler. On that point, it is not appropriate for kids under 13. Some mature themes are explored (obviously) and there are some dirtier jokes involved. Obviously nothing disgusting is shown, but there may certainly be some awkward questions if watching this flic with those not familiar with the existence of weird fetishes and creeps.As for the message of the movie, I'm happy to report that by the time it arrives, the audience is actually ready for it. There's no beating people over the head with politics (other than the men in women's sports thing obviously) and it winds up being genuinely heartwarming.The acting is mediocre, which is to be expected given the non-professional actors, and the cameos make it all worth it.The cinematography is honestly a bit weird at times, and there were some occasional choices that I found annoying, but pretty good quality overall. The actual production on display is completely acceptable, and quite impressive considering the low budget. It genuinely felt like any other Hollywood production in terms of quality. Clearly a lot of work was put into this movie. (It also says something that $7 million is all you need to achieve the quality of Hollywood's $100 million releases but that's a topic for another time)Best part of the movie: Matt Walsh's character didn't have a single less-than-stellar moment. From writing to casting, his character is brilliant. Most characters have both great and bad lines/acting/presence but a few absolutely knock it put of the park, with the most obvious being Matt.The worst part: there are definitely some odd side quests and stupid tangents sometimes. They aren't necessarily boring, but very weird. The good news is that they don't last too long so you won't get too annoyed as the story seems to spiral out of control. Yes they are slightly pointless, but the story will get back on track within a few minutes.Overall: not bad at all! Not a classic or mind blowing, but definitely does its job sufficiently. Not going to be my favorite movie, but will be watching again. It's probably not worth an entire DW subscription for, but if you were already in the fence, this could certainly put you over the edge, especially if this isn't the last of its kind. I hope we get more like this in the future!SBG for life!",
    "129": "I strongly recommend this film. Great writing, directing, production, acting, but most importantly, it's *actually* funny, and willing to take risks potentially offend people in service of creating laughter. Such risks are so valuable when every other movie these days is lacking them.This film really doesn't pull it's punches. Not a lot of studios would produce a movie like this, with obvious \"offensive humor\". Thank god they did, all the funniest movies are \"offensive\" and as a result this film seems like the funniest live action comedy in years.I was impressed by the excellent cast, great work from with leads. Main protagonist and villain both played pretty much perfectly for me. Some side characters (like the wife, her boyfried and the kid) are played very well too.My only complaint... there's a few unnecessary scenes that drag on or are based on gags I didn't find funny. Additionally there's a couple over cliche jokes that definitely could have been done differently or somehow better.Great film still, because it's tons of laughs! The few slow, flat, or unfunny parts are worth sitting through... because the good parts are truly comedy gold.Go watch it!Misc Other Notes:I won't be specific to avoid spoilers, but here are some vague comments that although don't spoil, some people find spoiler-adjacent. If that worries you, stop reading now!There's a twist \"joke\" introduced to a comical relationship that they seem to thought would add humor but really just takes it away. Really makes that whole running gag less funny.Some good grains of wisdom in it too, has in its serious parts actual excellent life advice.Finally... This film has a great climax+ending! The resolutions and way they deal with the issues near the climax and before the end is brilliant. I wasn't sure what they'd do to get it cleverly working out it, but they picked a perfect idea for the resolution leading towards the preend and it worked.",
    "130": "Can I just say how refreshing it is to be able to a comedy in 2023 that isn't graphically, sexually explicit?The Daily Wire has been putting out some great content and this is no exception. Even if you aren't familiar with the DW team, you'll still enjoy the performances from the cast.Lady Ballers felt like late 90s/2000s comedy: think DodgeBall, Benchwarmers, Blades of Glory, Heavyweights, etc.I think this film did a great job of tackling modern social issues in a genuinely funny way. Content wise, even though its addresses aspects of* sexuality, it's still pretty tame to watch with family/young teens.If you could use a good laugh, I recommend checking it out!",
    "131": "Overall funny movie, a couple of moments of genuine laugh out loud jokes. Especially in the middle.It is not a grade A comedy movie, like Dodgeball or Billy madison, happy Gilmore. Which means I don't think I would watch it again.It's main draw back is timing and length. Comedy movies should be 90 minutes and the great comedy movies are exactly 90 minutes. This is almost 110 minutes and it feels like it.They really should have spent some time in the editing room trimming jokes down, trimming unfunny scenes out. Shortening cameo time or using different methods for the cameos.It could have been a much funnier movie with a little more work.",
    "132": "It's basically a giant in-joke. If you're not the specific audience this is meant for, much of the humor comes across as random or extremely forced. If you see the trailers and that appeals to you, you might be able to get some enjoyment out of it, but otherwise it's a lost cause.Production wise, it is the epitome of mediocre. The production company actually has a history of failed actors running it, and you can REALLY tell when they just inserted themselves into roles for the movie. Direction is very basic and the biggest compliment I can give is that they could afford professional cameras.Beyond those notes, there isn't really anything more notable about it. It doesn't try to tell much more of a story than an excuse to get the cringeworthy humor out there. So decidedly there's nothing of value here unless you specifically want that,All in all, it feels like the sort of film a bunch of fraternity bros would put together for a film festival, just with a slightly higher budget.",
    "133": "This film tackles a very contentious topic, with a comedic and often very sympathetic lens, it doesn't wish to demean anyone, but rather point out the absurdity in some modern concepts by simply putting them to the screen. That is what good comedy does, especially when it is actually tackling a contentious topic (as so much great comedy does, like Gervais and Chappelle, just to name a few).I think the performances are really good, I like the nuance a lot of the characters are given, I won't give it away but one of the main characters is genuinely shown as a struggling young man with issues, and the film illustrates really well the inner turmoil he has (as I'm sure many trans people also experience) albeit the real solution isn't \"changing\" your gender, but simply accepting yourself for who you are, and that's what those that care about you should help you do, rather than affirming a harmful and insidious delusion that will never be fulfilled.Billie Rae Brandt was great in this as well, I was really excited to see her in a feature, and she did a spectacular job. All in all, I just hope whoever is reading this can see past all the leftist political extremism that social media pushes, and go into this (and many other films he may not agree with) with an open mind, like a true liberal would. Someone open to change, open to free speech, and discourse, and not afraid for the man on the other side to speak, but rather welcoming of it. Because if that's how he entered this film, then I'm sure he'd find a good movie and an important message within.",
    "134": "DW promised a goofy, early 2000s comedy with a message and I believe, overall, in landed. I enjoyed it and laughed at the slapstick goofiness and appreciated the meaningful bits. I can see and understand where it fails a little too.As a stand alone comedy, it's a popcorn movie and doesn't overstay it's welcome with it's pacing, comedy, and plot. The general movie goer (who isn't wildly liberal) would still have a good enough time if one likes movies such as the The Hot Chick, White Chicks, Scary Movie, Wayne's World, and other such on-the-nose, wacky, dumb movies that would have a difficult time being made today. It is true that a DW fan would find the movie more enjoyable due to the cameos - which were extra hysterical if you're \"in the know.\"If I could only change one thing as someone who loves the idea of this comedy shedding light on an important issue, I would have either removed the ending cameo entirely, or shifted it to after credits.The general public would also enjoy it even more if they are aware of the western nations' culture war; if the viewer is unaware, the hopeful goal of the movie would be to make people aware of conservative concerns.That said, the movie does not ride on the backs of DW and conservative cast members; it scratches the old comedy itch millennials have, makes gen x roll their eyes, and can show gen z what comedy used to be.",
    "135": "Ladyballers exceeded expectations. I expected a very pointed message with some weak comedy and production flaws.The Daily Wire probably can't get many Hollywood actors onto a project b/c the actors would be afraid of backlash, even if the film had no political leanings--but still, they managed to find some good talent. Jeremy Boreing and Billie Rae Brandt both have star-quality. Fischer and Cone also great, but really the whole team worked. I was looking for weak links in the cast and didn't find any.The cameos were okay, not bad. The best being B. Cooper and M. Knowles as the news anchors. Their arc was hilarious and their delivery was perfect. And quite fearless with the costumes, I love that.The humor landed pretty well, some parts better than others. Most comedies are like this. I didn't find the \"how much\" guy very funny. I loved the badger stuff, that made me laugh pretty hard. I also enjoyed all the shots they're taking at the journalist class. That's long overdue. The Jeremy's razor commercial in the middle of the movie was very funny, pulled off in just the right way.And obviously the satire's message is spot on. Everybody knows these things are true, everybody knows the emperor is naked, but everyone's afraid to speak up.Satire isn't just preaching. There are definitely some preachy moments in the movie (and I didn't mind them probably b/c I agree with the sentiments), but this still works as satire b/c the ideas are embodied well by the story on the whole.It also had better production value than I was expecting. They definitely dropped some money on all the extras in the last game. The score/soundtrack was a highlight, very good music, which is important. The tone was consistent. The cinematic elements were all competent. Lighting was good. I'm not a fan of the murky \"realistic\" lighting movies are obsessed with now. Just make it look good.And the end delivered. It was perfect to see the lady ballers get their comeuppance and get a taste of their own medicine. I loved how they worked in the coach giving \"inspirational\" speech trope and played with it in various ways.And I liked how genuinely heartwarming the ending was with the little girls team. The old comedies usually try to pull some heart-strings in the end and typically fail, but here it definitely worked. The father-daughter relationship was very lovely.I expected a movie I would be a little amused with and probably have to endure, but we ended up enjoying it thoroughly and we didn't interrupt watching it once.I'd give the humor a B+. The heart/feeling an A-.And the satire an A.",
    "136": "Look, I'm a daily wire fan and the message of the movie is good. But this movie is nearly impossible to get through.The acting isn't too bad, especially considering how almost none of these people are actors. But the writing and dialogue is just painful. There were some funny parts but many of the jokes are just weird and unfunny.There are also some montages that go on for much too long.The funnest part of watching this is seeing all of the cameos from Daily Wire hosts. Sorry guys, but this just hurts.If you don't already have a dailywire+ subscription, it's definitely not worth paying for just to get access to this :/",
    "137": "I'm a DW supporter, and I want them to produce great content. This is only OK.Run hide fight was good, not great.Terror on the prairie was ok,\nShut in was rough\nWhat is a woman was great doc\nConvicting a murderer was great docFirst of all. 1h52m is way too long for a comedy, unless it is absolutely amazing. Should have been 80 minutes. We found ourselves struggling to get to the end. It's a comedy, get in there, make the jokes, get out on a high point, fill it with a story with a remotely plausible plot.I like them using DW folks for some of the actors, but Boreing as a lead fell pretty short. Some parts of his acting was fine, most was not. Didn't seem natural. Probably keep him to cameos only going forward.The plot was weak on the whole. The idea was great, but execution is tough I guess. Comedies are not supposed to be the most cerebral of genres, but if all you're standing on is the jokes, they better bring the heat.The writing/dialogue was fine for the most part.Jokes were okay without being excessively mean spirited.They are a new studio, so I am hopeful they will improve.",
    "138": "I am basically the target audience for this movie, but that said, a true Daily Wire fan won't pull punches.Lady Ballers' claim to fame is its comedic satire and on that front, it does very well. A common worry for me with modern comedies is that the trailer will show every good joke or point the movie has to offer, leaving the rest of the movie to be bland plot exposition. In this case, there is plenty more than the trailer shows, but none of it will necessarily exceed the trailer. What you see is what you get.There are a lot of jokes, and some of them are downright incredible, while some of them fall flat. It's definitely a weird movie, and how many and which jokes you laugh at will likely depend on personal taste. I totally agree with the take that this movie may as well have been written by Adam Sandler. On that point, it is not appropriate for kids under 13. Some mature themes are explored (obviously) and there are some dirtier jokes involved. Obviously nothing disgusting is shown, but there may certainly be some awkward questions if watching this flic with those not familiar with the existence of weird fetishes and creeps.As for the message of the movie, I'm happy to report that by the time it arrives, the audience is actually ready for it. There's no beating people over the head with politics (other than the men in women's sports thing obviously) and it winds up being genuinely heartwarming.The acting is mediocre, which is to be expected given the non-professional actors, and the cameos make it all worth it.The cinematography is honestly a bit weird at times, and there were some occasional choices that I found annoying, but pretty good quality overall. The actual production on display is completely acceptable, and quite impressive considering the low budget. It genuinely felt like any other Hollywood production in terms of quality. Clearly a lot of work was put into this movie. (It also says something that $7 million is all you need to achieve the quality of Hollywood's $100 million releases but that's a topic for another time)Best part of the movie: Matt Walsh's character didn't have a single less-than-stellar moment. From writing to casting, his character is brilliant. Most characters have both great and bad lines/acting/presence but a few absolutely knock it put of the park, with the most obvious being Matt.The worst part: there are definitely some odd side quests and stupid tangents sometimes. They aren't necessarily boring, but very weird. The good news is that they don't last too long so you won't get too annoyed as the story seems to spiral out of control. Yes they are slightly pointless, but the story will get back on track within a few minutes.Overall: not bad at all! Not a classic or mind blowing, but definitely does its job sufficiently. Not going to be my favorite movie, but will be watching again. It's probably not worth an entire DW subscription for, but if you were already in the fence, this could certainly put you over the edge, especially if this isn't the last of its kind. I hope we get more like this in the future!SBG for life!",
    "139": "I strongly recommend this film. Great writing, directing, production, acting, but most importantly, it's *actually* funny, and willing to take risks potentially offend people in service of creating laughter. Such risks are so valuable when every other movie these days is lacking them.This film really doesn't pull it's punches. Not a lot of studios would produce a movie like this, with obvious \"offensive humor\". Thank god they did, all the funniest movies are \"offensive\" and as a result this film seems like the funniest live action comedy in years.I was impressed by the excellent cast, great work from with leads. Main protagonist and villain both played pretty much perfectly for me. Some side characters (like the wife, her boyfried and the kid) are played very well too.My only complaint... there's a few unnecessary scenes that drag on or are based on gags I didn't find funny. Additionally there's a couple over cliche jokes that definitely could have been done differently or somehow better.Great film still, because it's tons of laughs! The few slow, flat, or unfunny parts are worth sitting through... because the good parts are truly comedy gold.Go watch it!Misc Other Notes:I won't be specific to avoid spoilers, but here are some vague comments that although don't spoil, some people find spoiler-adjacent. If that worries you, stop reading now!There's a twist \"joke\" introduced to a comical relationship that they seem to thought would add humor but really just takes it away. Really makes that whole running gag less funny.Some good grains of wisdom in it too, has in its serious parts actual excellent life advice.Finally... This film has a great climax+ending! The resolutions and way they deal with the issues near the climax and before the end is brilliant. I wasn't sure what they'd do to get it cleverly working out it, but they picked a perfect idea for the resolution leading towards the preend and it worked.",
    "140": "Can I just say how refreshing it is to be able to a comedy in 2023 that isn't graphically, sexually explicit?The Daily Wire has been putting out some great content and this is no exception. Even if you aren't familiar with the DW team, you'll still enjoy the performances from the cast.Lady Ballers felt like late 90s/2000s comedy: think DodgeBall, Benchwarmers, Blades of Glory, Heavyweights, etc.I think this film did a great job of tackling modern social issues in a genuinely funny way. Content wise, even though its addresses aspects of* sexuality, it's still pretty tame to watch with family/young teens.If you could use a good laugh, I recommend checking it out!",
    "141": "Overall funny movie, a couple of moments of genuine laugh out loud jokes. Especially in the middle.It is not a grade A comedy movie, like Dodgeball or Billy madison, happy Gilmore. Which means I don't think I would watch it again.It's main draw back is timing and length. Comedy movies should be 90 minutes and the great comedy movies are exactly 90 minutes. This is almost 110 minutes and it feels like it.They really should have spent some time in the editing room trimming jokes down, trimming unfunny scenes out. Shortening cameo time or using different methods for the cameos.It could have been a much funnier movie with a little more work.",
    "142": "It's basically a giant in-joke. If you're not the specific audience this is meant for, much of the humor comes across as random or extremely forced. If you see the trailers and that appeals to you, you might be able to get some enjoyment out of it, but otherwise it's a lost cause.Production wise, it is the epitome of mediocre. The production company actually has a history of failed actors running it, and you can REALLY tell when they just inserted themselves into roles for the movie. Direction is very basic and the biggest compliment I can give is that they could afford professional cameras.Beyond those notes, there isn't really anything more notable about it. It doesn't try to tell much more of a story than an excuse to get the cringeworthy humor out there. So decidedly there's nothing of value here unless you specifically want that,All in all, it feels like the sort of film a bunch of fraternity bros would put together for a film festival, just with a slightly higher budget.",
    "143": "This film tackles a very contentious topic, with a comedic and often very sympathetic lens, it doesn't wish to demean anyone, but rather point out the absurdity in some modern concepts by simply putting them to the screen. That is what good comedy does, especially when it is actually tackling a contentious topic (as so much great comedy does, like Gervais and Chappelle, just to name a few).I think the performances are really good, I like the nuance a lot of the characters are given, I won't give it away but one of the main characters is genuinely shown as a struggling young man with issues, and the film illustrates really well the inner turmoil he has (as I'm sure many trans people also experience) albeit the real solution isn't \"changing\" your gender, but simply accepting yourself for who you are, and that's what those that care about you should help you do, rather than affirming a harmful and insidious delusion that will never be fulfilled.Billie Rae Brandt was great in this as well, I was really excited to see her in a feature, and she did a spectacular job. All in all, I just hope whoever is reading this can see past all the leftist political extremism that social media pushes, and go into this (and many other films he may not agree with) with an open mind, like a true liberal would. Someone open to change, open to free speech, and discourse, and not afraid for the man on the other side to speak, but rather welcoming of it. Because if that's how he entered this film, then I'm sure he'd find a good movie and an important message within.",
    "144": "The acting gets better as the movie progresses and Brett and Michael as anchors gave me life from the moment they showed up on screen!It reads Sandler-adjacent, which is a cool throwback for a nineties kid like me and not too over-the-top.My only requirement before going in was that they not drown me in ideology, which isn't an easy task for such a pointed satire. But the silliness and moments of tenderness helped to meet that requirement, and the DW cameos were enjoyable.I loved the conversation between the coach and his daughter, praising women, which is something else I wanted to see done well and seriously. Overall, this was a good debut for DW's comedy slate and I know the next one will be even better! Just don't continue to stay on the same vibe/Sandler-adjacent type material with every entry and the fans will be satisfied! God bless y'all, keep 'em comin!",
    "145": "The highest compliment I can pay this film is that it does actually feel like a movie. It's the first movie of its kind that I've seen where I would believe the people making it had read and followed a book on screenwriting. I mean, it's a low bar, but they did clear it.This has been described often as being like a throwback to an early 2000s Sandler film, and I was actually surprised that this description wasn't just some sort of hype to get you to watch 2 hours of low effort lecturing. I didn't really find it that funny, but there is a structure to the script (to the point of being formulaic, but still). The characters each have a game. The performances are for the most part passable, with some credit to Boreing for being able to pull off the lead, down on his luck, everyman. It just looks and feels like an actual movie, and I have seen low budget fare on streaming that is made more incompetently.I think the messaging of the film is kind of muddy. Is it offensive? Well, I think the fact it exists to advance this dangerous political ideology is... but honestly almost none of the jokes or writing really is. This is really where the comparisons to Sandler hit, because I think you will find as much in both places. Which, this being more of a message/satire/conservative film that is wearing its intentions on its sleeve, than trying to pass it off as just mainstream 'this isn't political/this is how it is'... is preferable, maybe? It's really not as mean-spirited of a film as I expected (not that it isn't mean-spirited). And the climax of the film - removing all context, just taken for what it is - I do have to begrudgingly admit, was kind of cuteIt was a bit of a weird experience to sit through. It's not particularly thoughtful or original, but it also isn't My Son Hunter or Left Behind.",
    "146": "This irreverent comedy is a breath of fresh air, delivering laughs with its bold humor and fearless approach it is truly stunning and brave . The witty writing and hilarious performances make it a must-watch for anyone in need of a good dose of unapologetic humor especially as the point it is mocking needs exposure to wake folks up. That the performers are also mocking themselves or others in the movie is brilliant and important. This is Dodgeball and Ron Burgundy style of humor - irreverent satire mocking and good one liners along with great caricatures from some of the key DW influencers add to the fun. \"Kris\" is hilarious and several others of DW main talent do a good to great job in their performances. The writing dialogue and story structure do a good job in moving things along with plenty of funny moments. Those on one side of this issue will find this funny and hilarious hopefully the other side comes to their senses or can also laugh at themselves. And too bad it didn't get distributed as word of mouth of those who actually watch this should be good.",
    "147": "Daily Wire does some great podcasts and documentaries, but fictional movies are evidently not their forte. Feature length motion pictures are not memes. They cannot be written in a weekend like a razor or chocolate ad for the sole purpose of \"owning the libs\". This was a poorly executed movie all around and Ben Shapiro lacks any semblance of self-awareness when he called this \"the funniest comedy of the last 10 years.\"The premise is rich for humor: men pretending to be women and unironically competing with and dominating them in sport. What Boreing and his team fail to understand is that the setup to a joke is only halfway there: you actually have to deliver a punchline based on the funny setup. And this film just doesn't have it.At nearly two hours, the film doesn't have anything humorous or poignant to say beyond the obvious \"men and women shouldn't compete in athletics\" premise. The film itself has a production value no better than a YouTube channel or SNL sketch, and that's what it feels like this should have been instead. There's simply not enough ammunition here for a feature film. The tone is so unserious and the script so amateur, I'm amazed this is an actual movie. The trailer appears to be a parody of a conservative film, not an real movie that people put effort into.Meanwhile every Daily Wire host and friend of the show makes an appearance, and every single one of them is distracting, adds nothing, and ruins the immersion of the film, of which there's almost none to begin with. What was the point of having Clay Travis, Jordan Peterson, Ted Cruz, or Spencer Klavan in this movie if they're only going to have one line and not even attempt to be a character?The Daily Wire does some of the best conservative work out there in terms of political analysis, but their multiple attempts at films have been disasters to say the least. You can file this one in the ash heap of other disastrous conservative films like American Carol or Death of a Nation.EDIT: This film supposedly had a $7 million budget? Where did all of that money go, especially since a number of the actors probably worked for free?",
    "148": "Absolutely hilarious I was crying lathing all the way though the film. Well written and you can tell they had fun making the film.I have seen some bad press about the film but after watching it really is plain to see they did not even watch the trailer let alone the film.Great story and commentary on some some of the of the crazy rhetoric being thrown into people faces these days.Simple production and a great story just what many films are lacking these days we really need need more films like thisVery well worth watching and I can not wait to see what the team have in store for the next film.",
    "149": "The key to understanding this film is Daily Wire's overall production strategy that basically had a very shrewd idea of reviving not just the lost moral and political values of Hollywood cinema but also its lost aesthetic values as well. So, Daily Wire basically started making films that people like to see but the studios stopped making them and somehow big tech streamers didn't pick up on those genres either. And in case of LADY BALLERS it's the goofy sports comedy that Will Ferrell used to make for New Line. So essentially this is a lost New Line sports comedy and they actually made one like this quarter of a century ago - JUWANNA MANN, right? I mean OK, JUWANNA MANN was a Warners release of a Morgan Creek production but nevermind, you know what I am talking about. And I love that this genre aspect is kept in a work that is more overtly political.The other Will Ferrell connection is another shrewd decision of Jeremy Boreing not just directing but also starring in the film. It gives this film a bit of a Funny or Die sketch aesthetic even though it's actually not an anthology of sketch comedy, it's a pretty straight up narrative and Jeremy is quite good as the star actually.But overall this sketch element is an interesting disclaimer that basically says - Yeah, this is topical unlike our other films which are movies first and foremost. This is a social critique and we are lampooning a particular phenomenon and I like this element which sort of distances itself from the main DW body of work, especially with the PENDRAGON CYCLE on the horizon which will really add depth not just to the streaming service but also to the library.Now, when it comes to the film itself.If we bear in mind that Jeremy intentionally went for this meme-like approach where this is an all-out parody of a troubling phenomenon in contemporary sports, this actually works pretty well as a movie.It worked a lot better for me than for example Will Ferrell basketball comedy SEMI-PRO that he made for New Line around ten year back but of course it doesn't reach the emotional depth of RINGER with Johnny Knoxville which comes to mind.But given this stylized comedy approach that stems from the contemporary school of comedy videos and sketch TV shows and stuff like that, actually LADY BALLERS works quite exceptionally as a movie and even the length of 110 minutes, which is by no means gentle, and it sort of is excessive if we look at it from the side, actually works out when you watch the film.So even though I believe this was envisioned as a more a of a Christmas-special kind of thing, a bit of an internal send up of contemporary sports, what you got in the final product is a film that will be able to live on and really be a valuable part of any library, not just the DW one.Of course, the film is openly political with all the attitude and naming names and Ted Cruz cameo and so on, but in the end it's actually a quite heartfelt experience with some common sense values put in place. So, however partisan it is on the outside it's actually quite universal on the inside.And Jeremy is actually a talented performer. He really brought some kind of John Ritter humour to this character and not just edge but also warmth.I think that the film will work well outside of the US because it deals with sports that people internationally actually know and understand the rules. Outside of the US, football sort of works in films because it's simple and it became global but stuff like baseball is an enigma.Having these spoof approaches in a film is actually a tightrope act. And it's always a mess in the making but Jeremy really found his way around this. If we bear in mind that he is a guy who actually has a day job and doesn't waste his tame thinking about filmmaking techniques all day long, - I must say he proves to be a pretty solid comedy director with a pretty clear vision of what needs to be done and how the general narrative convention needs to be set up.And him as a performer is really a highlight. I mean, his role has genuine emotion and comic timing, so it's not just a famous person being surprisingly good in an acting assignment. It's actually a well-done role.So, outside of Jonathan Isaac cameo, I missed very little in this film. I got quite a lot out of it actually."
}