{
    "0": "I have been recently getting into Studio Ghibli films and I've been impressed. I was highly looking forward to this movie strictly because it was the first time I got the opportunity to see a Miyazaki film on the big screen. And the English dub is studded with talent.I must say... I feel let down. I almost fell asleep halfway through, and the ending didn't make sense. There was so much happening and things weren't explained. I understand that there was probably deep symbolism attached to certain writing choices, but what's the point if the viewer has no idea what they're trying to say?There were some good scenes and some good humor, but overall I feel a little empty.",
    "1": "I got the sense watching The Boy and the Heron a second time would help me like it more, but I didn't expect a second viewing to help this much. I would've ranked it maybe #8 or #9 in a Miyazaki ranking after watching it the first time, but now, I think I might honestly rank it as high as #2. The only film of his I definitely like more is Princess Mononoke (that one's a classic - little can touch it).The first time, I was overwhelmed and somewhat confused, but never bored. It's so beautiful to look at that following what was going on felt secondary. The second time around, it's still beautiful, I like the music even more, and also, I have to say, seeing it for a second time with subtitles instead of the dub helped (though the English dub was of pretty good quality, it does have to be said).I looked into how people were interpreting the film following watching it for the first time, I'll admit. I wasn't clever enough to crack the subtext, but the reading that the granduncle is a stand-in for Miyazaki, and the fantastical world represents Miyazaki's work... it's so apparent now. Having that in mind just changed the entire final half-hour for me, and though part of me feels a little slow for not \"getting\" it, I also respect the film not spelling it out, but having it there clear as day once you know that's (almost certainly) the main subtextual element.But even on an emotional level, things just clicked more this time around. Understanding how certain elements of the fantasy world lined up with reality from the start made things more moving and improved the pacing; it was less like a random stream of events, which is kind of how it felt the first time around. I appreciated the protagonist's arc more, I liked the side characters more, and I think I even found more humor (as well as more sadness) in the film the second time around.The Boy and the Heron was still really good after one watch, for the visual and musical elements alone. But the second time around, it was something else. I still think the pacing is a tiny bit slow in places, but I feel that way about every Miyazaki movie. And the ending... I do wish there'd been just something else that happened in that kind of abrupt final scene. But other than those nitpicks, this is an almost-perfect animated film.",
    "2": "Absolute magical, most likely last movie, made by Miyazaki Hayao. To give you an idea as to what you can expect from this movie, it has a similar feel of \"Alice in Wonderland\" but imbuded with the Ghibli magic you're familiar with. It includes elements of many of the other Ghibli movies \"Princess Mononoke\", \"Pompoko\", and \"My neighbor Totoro\" but adds something new that's never been made before by Hayao. To understand the full scope of it, you'd have to watch it a second time; to fully appreciate why the world is set up as it is and why the characters are the way they are.I can't wait for the English release and the internationalization. Even though no promotional footage or trailers have been shown, I recommend this movie to anybody looking for something magical and mystical.",
    "3": "Directed by: Hayao Miyazaki\nWritten by: Hayao Miyazaki\nDistributed by: TohoSUMMARYAfter a young boy loses his mother, he follows a mysterious blue heron to a fantastical world. There, he meets his mother - before she was born - and tries to rescue his father's new wife, his aunt. Ultimately, he meets the king of this world, who tries to give him the keys to the magical world, but he refuses. The world is destroyed and he has to return home.RATINGB+Beautiful, with a gripping main character. I didn't quite get the story. I think it was all a little too metaphorical for me. Random fantastical elements seem to come from nowhere, like the Parakeet King and him destroying the world at the end. I wish the film were more cohesive.",
    "4": "The best way to describe this movie is to say the entire film feels like the scene in Spirited Away where Chihiro is on the train going to Yubaba's sister's house. It feels nostalgic, contemplative, and yearning for a time when the world appeared to be easier (ie through the eyes of a young boy).But, like all of Miyazaki's works, the film is filled with gorgeous animation and incredibly fantastical set pieces. It's a rare end of career film that feels like a filmmaker at the height of their powers. Don't go in expecting Spirited Away, Howl's Moving Castle or Ponyo - it's very different from all of those films even though it shares a lot of the same themes. Just know you're putting your trust in one of the best living filmmakers whose fire for telling stories is far from dimming.",
    "5": "As other Ghibli animation films this one makes its living out of those magical special moments that only Hayao Miyazaki can create. The amazing kaleidoscope that this man see the world through is truly something to behold. There is no surprise in that part of his genius but I felt like this story didn't reach out to us the way it was supposed to or the way other Studio Ghibli movies used to for that matter.The thing I like the most was the representation of balance. How we must have evil in order for good to exist. It all made for a wonderful metaphor I think suited for the realm of our mind like how we must look for compensation between our good and bad deeds. As usual sending a message for every one of us to decipher in our own different way.All things considered I still found this worthy of Ghibli but not at the same heights as others of their masterpieces.",
    "6": "Miyazaki's farewell is a dreamy, spiritual journey that winks at his past works while standing out as something uniquely new.Heads up, spoilers: The film dives deep into the existential question of where we choose to live. We can see the connection between Mahito and Himi, who both have turned to a fantastical world as a coping mechanism after losing their mothers. Like Mahito, Himi too decides to leave the comforts of her fantasy world for the raw reality of life - war, pain, loss. It's her conscious choice, knowing it will eventually lead to her demise, that drives home the film's poignant message: it is not how we depart, but how we live that truly matters.",
    "7": "Visually striking, this film at moments took my breath away. The storyline is layered and I cannot wait to watch it over and over again to pick up more. The film itself tackles concepts of grief, loss, and community through the lens and understanding of a child.I think this is one of Miyazaki's most beautiful creations. The effects are so realistic, the worlds created are new but also feel like they could be in the same universe as Howl's Moving Castle.The story is less obvious, this one feels muted and subjective. Which I believe is intentional due to circumstances within the written universe and main character.Truly worth the watch and will be a forever repeat for me with most of his classic films.",
    "8": "If you expect this movie answer the question \"how do you live?\", you may be disappointed. The movie only ask the question and you are the one who have the answer.I found some homage for previous Ghibli movies. It's like Mr. Miyazaki hints at the possibility this is the last movie for him and his hope the animation industry has next future figures which don't follow his master pieces but younger people's original ones. The stones which are the keys at the last part might explain it.Personally, I was very satisfied to watch this without any trailer and advertising in such an information society.",
    "9": "Since the film was produced solely funded by Studio Ghibli, Hayao Miyazaki made it as he liked. No clear narrative meaning or answers are provided. This is a story that makes you think about how do you live. Therefore, it is not a story for everyone.The film is inspired by The King and the Mockingbird, a French animated film masterpiece that influenced Hayao Miyazaki. I felt that Hayao Miyazaki used his own influences as a motif in order to create a work that would connect and influence the next generation.The King and the Mockingbird (Hepburn: Oh to Tori, lit. 'The King and the Bird') was released in Japan in 1957 under the title The shepherdess and the chimney sweep (Hepburn: Yabunirami no bo¯kun). I think the above is a hint as to why the title was changed from How Do You Live? To The boy and the heron.The film was produced in cooperation with Ufotable, Studio Khara, Studio Chizu, Production I. G, CoMix Wave Films, Yostar Pictures, and many others. This is truly a compilation work. This will be the first and the last.",
    "10": "This film is strongly autobiographical based on Hayao Miyazaki's own experience around 80 years ago. Despite that, his message could be universal and understandable by many people beyond time and space, because in life, whoever is destined to go through personal struggle more or less.The story begins in the 'real' world in which sadness and absurdity were dominant. Hayao once confessed that he was long separated from his mother, and experienced air raids in his childhood. How do you live in such a world? From ancient to modern times, it is 'fiction' that comforts the misery of reality. From myth to metaverse, the story-telling structure has no change. Then, how did he renew the old hat?Eventually, he let us dive into the world of blatant sense of wonder. There is like a hodgepodge of previous Ghibli films with \"Alice in Wonderland\", \"Back to the Future\", \"Inception\", \"Arrival\", \"Never Ending Story\" and like that. However, they're nothing but fictional images to be cruelly cast down. By self-referencing numerous homages, Hayao bids farewell with the past, penance, and confession though, it seems in more positive and re-creative way than repentant.In the end, his final message is \"don't stay there\" where he had maintained building blocks. We'll become aware of the importance of accepting the reality of life, family, and tricky friends to make something one's own; even if we found our future wouldn't be what we hope.",
    "11": "Hayao Miyazaki have done it again. His movies always touch me deeply and so did The Boy and the Heron. I've been a big fan of Studio Ghibli my whole life ever since I watched Spirited Away along with many other movies from their universe. It baffels me how amazing they are to create these movies. There is truly no one other than Hayao Miyazaki and Studio Ghibli that comes close to their storytelling. Their movies always feel so alive and with good reason. Go watch this on the big screen if you can, I'm very happy I did. But the great thing about their movies is that it works everywhere. If you don't catch it in cinema watch it when it comes out in another media.",
    "12": "THE BOY AND THE HERON has been described as Miyazaki's closest foray into horror, as a confusing exercise in self-indulgence, as a Miyazaki's greatest hits album, and more. Leaving the theater, I definitely think this is a movie that demands repeat viewings and becomes richer the more familiar you are with the full scope of Miyazaki's career, going back to his earliest work in the 1960s on Toei works such as HORUS PRINCE OF THE SUN and PUSS IN BOOTS.On the shallowest level, such familiarity means you'll notice the visual references to Miyazaki's oeuvre throughout. SPIRITED AWAY and THE WIND RISES are the most obvious, but there were moments that reminded me of NAUSICAA, PRINCESS MONONOKE, HOWL'S MOVING CASTLE, and CASTLE IN THE SKY as well. PUSS IN BOOTS (a film on which Miyazaki did storyboards and key animation) gets a notable quotation towards the end, when the parakeet king strides up the daunting spiral staircase of a medieval tower-- a direct reference to the memorable climax in PUSS IN BOOTS, from the setting itself to the king's physical resemblance to Lucifer in the 1969 film.However, the most fascinating autobiographical element of the film is the relationship between Mahito and the Great Uncle character. The Great Uncle wants a successor to keep his magical otherworld alive and to protect it from the callow interests of the Parakeet King. And yet, Mahito-- despite all the trauma and foolishness he's experienced in our world-- opts to return home and live as best he can amidst chaotic brokenness. The otherworld is ultimately destroyed-- could this be Miyazaki sharing his view of what will become of Ghibli once he is gone, since no proper \"successor\" to himself and the late Isao Takahata has ever been found?This all makes the film sound like an impenetrable puzzle for hardcore nerds, but rest assured, it isn't. It's only one way you can understand the film because there is just so much packed in there. There's a lot about wartime horror and grief, but also beauty and forgiveness. There's surrreal imagery and moments of horrific menace, but also a lot of humor. I haven't even scratched the surface of all this movie made me feel. It just might overtake HOWL'S MOVING CASTLE as Miyazaki's most polarizing film. Count me in as a fan.",
    "13": "The above headline is, of course, no faint praise, to say the least.Hayao Miyazaki is one of the all time auteurs, no matter the genre, and a great standout in Japanese cinema. The frontman for the prestigious Studio Ghibli, and this supposedly being his last feature. If so, he definitely goes out with a bang, to say the least!The film is an epic, showcasing the tragedies of WW2, yet providing a childlike wonder across the drama, eventually unfolding into a great and cozy fantasy adventure in typical Miyazaki style! This is such a great combination of genres and a great utilization of Miyazaki's style, that it could perhaps be considered his best work yet? Debatably.The animation is, of course, incredible, as always with Miyazaki - but I am prepared to say this is one of the best looking animated features I have yet to seen. Studio Ghibli and the Disney classics, it feels like, have led to this.Overall, a great mix of drama, great mythology, emotions, humour and an overall cozy feeling. Definitely a film every lover of film should watch, and for sure one of the best of the year!",
    "14": "I am rating this as a stand alone movie. This is not a good pick if it's your first Miyazaki movie. The film plays like a unconnected montage of Miyazaki's greatest hits, as you are transported from setting to setting through Mahito's eyes. The problem is that this results in an extremely fragmented story structure. Characters are weak as you are not given time to connect with them given the fast pace of the film. Characters establish no relationships with one another. One moment they are there, next they are gone as you are transported to a different setting. The settings also reference Miyazaki/Ghibli's past collaborations, which is completely meaningless to you and flies over your head unless you've watched them. The story's message is unclear, and not communicated properly to the viewer during the 2hr time frame, and basically requires knowledge outside the film to appreciate it in full. Unless you are willing to watch Miyazaki's previous 11 films and read a biography of his personal struggles the film just won't land.",
    "15": "This movie blew me away. I thought at first I had been misled in marketing in that the film would be more somber and slow but the unique pacing definitely builds to a mind blowing finale. The visuals are the star here. And there is both a familiarity here with his other works, paired with a strange sense of novel wonder. The plot beats can be a bit confusing at times, but I also think the film invites us to sort of surrender to the dream logic of the world. The film is complex, strange, sometimes shocking and upsetting, other times poignant and sweet. A true kaleidoscopic masterwork, with gorgeous and painterly visuals, striking music, and metaphors about life, loss, and how to live.",
    "16": "A very creative tale with a range of difficult topics from a loss of a loved one, to choices on your very future and how they will impact the world. As a parent I feel this this animation was a gift. How the main character is true to his emotions and is genuine. I personally loved the ending so much. It may leave some viewers upset but the simplicity is rather genius. I strongly recommend all viewers to sit thru watching the plain blue credits and take the time to ponder what exactly you just experienced. The ending isnt an answer your looking for, it should be the beginning of everything going foward. I would have loved to go into detail in all the themes and details, but all viewers should be aware its a studio ghibli movie, no spoilers here.",
    "17": "I just watched this movie at the theater yesterday.. and let me tell you it was hard to sit till the end. The story is very complicated and for no reason since the essence of the story and the main ideas are simple? And for the characters, I'm really used to being emotionally attached to ghibli movies' characters after watching any of them.. not this one though, the characters were rly bland I didn't feel anything for any of them, also their goals or reasons behind actions were not clear at all, moreover some characters that are kind of important to the story only appear at end? And some characters will be emotionally attached to another character but why? It's not clear.. to be honest this movie is just a huge mess! I gave 4/10 and that 4 is just for the art and music, the soundtrack was beautiful. And art was as usual mesmerizing.",
    "18": "Hi there, if you're not Japanese, highly recommended to study social history of Japan, early Post / Pre war era, etc...First 1mins before titles comes, comforts me very well reminded me of \"Glave of Fireflies = Hotaru no Haka\" my personal feelings of How to live.To nothing like that but in both ends of fantasy & realism fusions.Really question deep hits the hearts \"How do I Live\"\nI would say such masterpiece of art of cultivation of imagination with mystery and sacredness of Death & Life.No adds or promo required if there's brochure kind should able to buy on second time around etc...\nDepends on your background this movie may be dull?Compares to nothing but only Ghibri, I would feel this film was really come out to be best, living arts in current world.I wouldn't disagree if he decided to end this film was really last. Really happy to see creativity with his associates.Finally I would say I am fan of Directing arts of Miyazaki !!If you don't love him don't watch, you may not get the plot, story created inside its animation...\nIt's enjoyable for kids to grown up oldies...",
    "19": "The Boy and the Heron, or How Do You Live as per its original name, is something of a weaker retread of Spirited Away and as such will both very much please Hayao Miyazaki fans whilst also leaving something to be desired.First off, the movie's original name is much better because the English name makes it sound like a kids' movie (which was probabluly the intention) and implies a transformative relationship between a boy and a friendly heron character as the movie's central element, which is not the case at all.The plot follows Spirited Away's main elements in that the main child character is swept away into a magical, fairy tale-like but also vaguely creepy and threatening world and has to grow and adapt while also relying on the help of otherworldly strangers to get out. The details of this world and its backstory are intentionally obfuscated. However, whereas Spirited Away offered a more or less complete backstory and plot structure with no holes if you paid attention to the details and everything fell into place, here many elements of the narrative make little sense and even contradict each other. Most significantly, many elements snd magical creatures show up briefly just for the sake of being there (and probably in order to be a part of the trailer) only to disappear without much explanation or point.Despite all this, the visuals and the animation are gorgeous and there is a great world to get lost in, even if it doesn't make much sense. Studio Ghibli pulled out all the stops to create a truly beautiful ambiance. As such, The Boy and the Heron is probably best viewed as a \"vibe movie\" without worrying too much about the plot.",
    "20": "Miyazaki proves once again he is truly a spectacular artist with a vision that brings out the pure magic of Anime, Cinematography, Hand Drawn Animes, Powerful Music by Joe Hisaishi, (Has Worked on many projects with Miyazaki and Studio Ghibli), and Storytelling. Scenery that will leave you speechless. Saw this last night with my fiancé and we both really enjoyed it a lot. Glad to finally see a Studio Ghibli Film in Theatres, really an amazing experience to see it on the big screen! The music, the picture, sound, everything. I would highly recommend this film for everyone to watch. It's a film that really captures you right away (At least it's did with me), we are not truly sure if this is Miyazaki's last film or not. He has announced his retirement 3 times before, this is his 4th time announcing retirement. We will see if he is really done but if he is done, then this film was a very well done film with one last message Miyazaki wanted to send out before his Retirement. Overall, 10/10. Very well done Masterpiece to Miyazaki's Magnum Opus. Thank you for everything! You have changed the world of anime and put so much heart and soul and will enjoy your films for many many many years to come.",
    "21": "Please don't read if you haven't seen the film yet since there will be spoilers.While this film has an homage to the previous studio Ghibli films, this film is essentially different from other studio Ghibli films in the way that it does not try to force upon viewers a particular thought, rather it makes you think about the question of meanings of living in this messed up world by yourself. The theme of the novel Mahito reads in the midst of the film \"how do you live?\" by Yoshino Genzaburo (I've read it) and the building blocks which construct the world we live in, all adds up to the conclusion that each of us is a part of what creates this world and it exists upon the relation between one another. However, such world we live in that exists upon the relation between one another, may be so collapsed, therefore there're always wars and we are so unequal. The envious and ill- intentional facial expressions of the old maids and the classmates who are by far poorer than Mahito are so accurately depicted in the ways you know this film is different from other studio Ghibli films which are rather idealistic. For those who haven't read the book by Yoshino Genzaburo, why Mahito cried while he was reading the book is because he learned about production relation within this unequal world, meaning he started to understand why there are people who would dislike him or bully him. Because he is rich but there are people of his age, who already are forced to be working.The animals in this film are also not idealized like the other studio Ghibli films that in this film, they have greediness and vulgarness. I guess one of the books Mahito drop was about parakeet kingdom, and considering the reference to the books throughout the film means that he somehow got spirited away into the world of books where parakeets eat humans, it's sort of 20th century like atmospheres, once you get used to the style of drawings, makes you excited and there's so much enjoyments. It's probably referenced to the Japanese theology where bird play an important role as well. When the monster parakeets enter the world through that door, they become the parakeets as we know them and that touched upon childish instincts of me that maybe birds have real eyes that are hidden or they may be the predators in the parallel world.At most, the finest parts of the film for me, are the beginning and the ending. The first scene after the logo of studio Ghibli, where there's a siren and Mahito runs into the road where there're pedestrians under attacks of bombings, was so powerful because of the surrealistic drawings of fire and ghosts like people and the intenseness. (I personally interpreted as bombings but the scene is not specifically explained by Miyazaki) That sort of trauma Mahito has, of losing his mother in war is carried out nicely with Hisaishi Joe's soundtrack to the ending where Mahito chooses to live in the real world instead of fiction despite knowing there's so much ill intensions in this world. Mahito knows it, everyone knows it, the premise of the film is that the world we live in is full of ill intentions (Akui) as the creator mentions there're killings and ribbings. It touched me upon the hopelessness of the reality and felt as if I was asked, if you hate the reality so much how about make yourself another one.At the same times, I did watch this film three times but I didn't really understand it to be honest. It would be a pleasure to watch it more times for new findings. I found this movie to be especially for the people like Mahito, who is smart and privileged compared to others, therefore often gets in trouble by those who may be envious of him.Thank you for reading.",
    "22": "This movie stuns as you would expect in the visuals. The visual style that is used for certain scenes just left me in awe. As for the story, it is better to just go in blind and honestly don't watch any trailers. Like most of his movies, the story is a metaphor for something more emotional and grand. This movie is no exception and the world he creates to present that metaphor is outstanding. The only negative I have is that the movie almost delves too much in the metaphor and the ties to reality disappear entirely. The main character at first is very proactive and independent but then devolves to a vessel to take the audience into the world of the movie which felt a bit jarring at first. Overall a great experience and another solid entry in Ghibli's filmography.",
    "23": "I'm not afraid to say the emperor has no clothes. This film has only 2 story points, boy can't get over mother's death, boy can't accept step mom as new mom. The film then goes on to not have 99% of the content of the film be relevant to these story points. There is no storytelling going on here. Truly bizarre, and not from a create standpoint, as this is not a creative fantasy world. It's utterly dull, and banal. A world with an island, some birds, some more birds, some floaty wisps. Ships in the distance that are phantoms or something. For the entire movie I was searching for some kind of story to grab onto, but there was nothing. Can't account for the popularity aside from name recognition.",
    "24": "12-year-old Mahito struggles to cope with his mother's recent passing and the challenges of adjusting to a new town. His life takes an unexpected turn when a talking heron informs him that his mother might still be alive. Driven by hope, Mahito embarks on a magical journey through an abandoned tower that leads him to another world. (Bard AI)I'm not a huge fan of Studio Ghibli movies (so keep that in mind as you read my review!), but I accompanied my eldest daughter, who teaches Japanese to primary school kids, to check out The Boy and the Heron. There are two versions available to see in cinemas: an English-dubbed version and a Japanese-language version with subtitles. We went to see the latter one.As is usual with Studio Ghibli films, the animation is breathtaking. The hand-drawn elements seamlessly blend with modern technology, making for a stunningly beautiful visual experience. The heartwarming story explores some very deep themes of grief, resilience, and the power of love. In addition to the most prominent themes, there are also subtle messages about the environment, encouraging us to respect nature and preserve the environment. The Boy and the Heron is a touching and uplifting experience. The characters are compelling, and all the people and characters Mahito meets on his journey are captivating and relatable. The original soundtrack is whimsical and poignant, and it gently supports the tone of the film.The pacing of The Boy and the Heron may be one of the most challenging aspects of the movie. Some scenes feel slow-paced and may, especially for younger audiences, mean they don't stay engaged. Some of the scenes, too, especially those between adults, can be a bit dry and lack some of the charm of the other aspects of the movie. And given that the main focus of the story is emotional exploration, the lack of action might be disappointing to some. For those of us who have seen a lot of coming-of-age movies, the plot may feel familiar and somewhat predictable. There are not many plot twists or surprises.Returning to the thematic elements for a moment, The Boy and the Heron is very rich with important issues that resonate with contemporary concerns and also includes aspects of Japanese culture and lore that require some thoughtful reflection or further exploration to understand. I believe this is to be the last film by Hayao Miyazaki and is a gift to his grandson, which makes the movie even more poignant, as if it is a message for the next generation. I think this movie is one that will benefit from multiple viewings to excavate the layers of meaning. While I don't think The Boy and the Heron is as good as some of Studio Ghibli's other movies, it certainly deserves ongoing attention.Overall, The Boy and the Heron will, I think, resonate with a wide audience. As I said, I didn't see the English-dubbed version. But maybe that version will be more accessible to English audiences. Because the story is so heartwarming and the characters are so captivating, I'd suggest it would be a good watch for families and anyone who loves beautiful hand-drawn animation. But anyone looking for lots of fast-paced action may be disappointed with this one. I'd recommend it for anyone aged 8 and up.",
    "25": "This movie felt like it was about five hours.While visually stunning and the world they've made is intriguing and unusual....is this based off of a very long and involved book series I'm not aware of? Because watching felt like I was missing a whole bunch of backstory and detail, like there was a reading assignment I didn't do for class.Most-damningly: there's quite a lot of missing character development. As such, the evolution of the characters feels unnatural and forced, like they jump to the ending without the behavior making sense.We're just expected to believe that some 9 year old on a magical adventure, who just ran into her younger sister all grown up, is totally fine and happy to learn she's dead in the future, her sister married her widower husband and is expecting a baby with him, this boy she's been running around the magic tower with is her son---and it's all good? Really? In what universe?Also left out are why the main character suddenly flips to seeing his aunt as his mother, when they've had minimal interaction up to this point, and his real mother has been found alive, albeit younger, and why pregnant stepmom decided to run off to the magic tower in the first place.On the whole: it's like someone went a little crazy with a hole punch on the story plot, for all the little gaps it has.Small children may enjoy the slow meandering through various fantastical scenes, but it's likely a little too dark for the youngest bunch and at over two hours, it's not the most child-friendly of lengths. I can't see this one joining the highest echelons of the Ghibli offerings or becoming particularly beloved, outside of a few unique visuals.Watch if you're a completionist, otherwise, pick a different Ghibli.",
    "26": "Another masterful piece of art by Ghibli - and probably my favourite Miyazaki film after \"Ponyo\"I was enthralled throughout the entire film - I really appreciated the slow pacing despite how eventful the plot was, it was very grounding and refreshing to be able to absorb what was on screen. We've gotten so used to quick gratification when it comes to visual media, but this film was pleasurable in a very delicate and hearty way.My favourite scene was when Mahito trespasses the delivery room where Natsuko was sleeping. I was amazed at the voice acting, and how quickly and bizarrely the scene escalated. One of the most powerful animated scenes I've ever watched.I do agree that the character development for Mahito was a little stunted, and there were too many things about the world building that weren't answered, but I'm someone who's not that bothered by loose ends.",
    "27": "THE BOY AND THE HERON tackles tough territory as a boy struggles to move past his inability to rescue his mother from a fire before she dies. The approach is unconventional with a journey through other worlds. The artwork and animation are outstanding, but despite what should be emotionally-compelling material, the film often is emotionally distant. Many of the ideas and scenes feel like the cast-offs from past, better Hayao Miyazaki films. As good as the animation is, credit also should go to the musical score for contributing to the atmosphere of the film.A young boy named Mahito, yearning for his mother, ventures into a world shared by the living and the dead. There, death comes to an end, and life finds a new beginning. A semi-autobiographical fantasy about life, death, and creation, in tribute to friendship, from the mind of Hayao Miyazaki.",
    "28": "This new immersive world of fire from Hayao Miyazaki perfectly depicts the horrors of reality through the lens of a child; having to deal with grief, duplicity, and regrets in such a young age, a boy named Mahito finds his way to face the journey of acceptance, gratitude, and self discovery.Miyazaki never shy away embracing the peculiarities of his own imaginations considering its his most autobiographical movie he ever made yet. A well rounded, gut wrenching script with pack full of hidden messages and metaphors, it truly is one of the most poetic fantasy worlds that has ever been created on the screen.",
    "29": "As I sat watching this movie today it felt as if Miyazaki didn't know what he wanted this movie to be whether it would be a philosophical fantasy, a straight up fantasy, a period piece, a war movie, there were just so many elements from so many genres and quite frankly it ended up being a fever dream of an incoherent mess of a film and quite frankly the movie sucks and since we are being frank and honest, Miyazaki needs to retire before he's allowed to make another piece of garbage like this. It's quite clear that the glory of when studio Ghiblil actually made decent films is gone because their last few movies whether it be Ponyo, earth sea, the wind rises or even this latest movie you can clearly see that the creative magic is gone and you can definitely see a studio in decline.",
    "30": "This is not the Miyazaki that makes entertainment films (this is not Totoro). In this film, he dives deep into human consciousness, astrology and guilt. This is a \"difficult\" movie to watch in his filmography, with ramification on the plot and beautiful images that \"doesn't make sense\". I love that how Miyazaki draw this film into the main characters subconsciousness.In short, this is a poetic and sentimental film about how a boy grows up, reconciliation his guilt during uncertain wartimes. If you love art-style films, you will love this film. But if you prefer straightforward, easy to watch films, you may feel a bit lost.Make sure to watch Miyazaki's previous film, \"Wind Ries\", since it touches similar views on war and living difficult historical times. If you are a bird lover, you will love this film too.",
    "31": "This one like the other ones was rich on layers but this one is a \"milles feuilles\" as we call it in French a thousands layers .I've been touch by the step mother part but also the poetry about in betweenness a place in between live by and death.The non living and war... but I see that I can't go further without spoiling it.Nevertheless for children even 10 years old that is a bit of a challenge .. my stepsons got lost.It's beautiful but to complexe for young children specially when it lasts 2 hours.Otherwise enjoy! It's still full of symbols and poetry. And people trying to find their way. Do you want to live in a stupid world where people kill each other for greed? Because that's what it is isn't it ? Power and money...",
    "32": "This movie stuns as you would expect in the visuals. The visual style that is used for certain scenes just left me in awe. As for the story, it is better to just go in blind and honestly don't watch any trailers. Like most of his movies, the story is a metaphor for something more emotional and grand. This movie is no exception and the world he creates to present that metaphor is outstanding. The only negative I have is that the movie almost delves too much in the metaphor and the ties to reality disappear entirely. The main character at first is very proactive and independent but then devolves to a vessel to take the audience into the world of the movie which felt a bit jarring at first. Overall a great experience and another solid entry in Ghibli's filmography.",
    "33": "I'm not afraid to say the emperor has no clothes. This film has only 2 story points, boy can't get over mother's death, boy can't accept step mom as new mom. The film then goes on to not have 99% of the content of the film be relevant to these story points. There is no storytelling going on here. Truly bizarre, and not from a create standpoint, as this is not a creative fantasy world. It's utterly dull, and banal. A world with an island, some birds, some more birds, some floaty wisps. Ships in the distance that are phantoms or something. For the entire movie I was searching for some kind of story to grab onto, but there was nothing. Can't account for the popularity aside from name recognition.",
    "34": "12-year-old Mahito struggles to cope with his mother's recent passing and the challenges of adjusting to a new town. His life takes an unexpected turn when a talking heron informs him that his mother might still be alive. Driven by hope, Mahito embarks on a magical journey through an abandoned tower that leads him to another world. (Bard AI)I'm not a huge fan of Studio Ghibli movies (so keep that in mind as you read my review!), but I accompanied my eldest daughter, who teaches Japanese to primary school kids, to check out The Boy and the Heron. There are two versions available to see in cinemas: an English-dubbed version and a Japanese-language version with subtitles. We went to see the latter one.As is usual with Studio Ghibli films, the animation is breathtaking. The hand-drawn elements seamlessly blend with modern technology, making for a stunningly beautiful visual experience. The heartwarming story explores some very deep themes of grief, resilience, and the power of love. In addition to the most prominent themes, there are also subtle messages about the environment, encouraging us to respect nature and preserve the environment. The Boy and the Heron is a touching and uplifting experience. The characters are compelling, and all the people and characters Mahito meets on his journey are captivating and relatable. The original soundtrack is whimsical and poignant, and it gently supports the tone of the film.The pacing of The Boy and the Heron may be one of the most challenging aspects of the movie. Some scenes feel slow-paced and may, especially for younger audiences, mean they don't stay engaged. Some of the scenes, too, especially those between adults, can be a bit dry and lack some of the charm of the other aspects of the movie. And given that the main focus of the story is emotional exploration, the lack of action might be disappointing to some. For those of us who have seen a lot of coming-of-age movies, the plot may feel familiar and somewhat predictable. There are not many plot twists or surprises.Returning to the thematic elements for a moment, The Boy and the Heron is very rich with important issues that resonate with contemporary concerns and also includes aspects of Japanese culture and lore that require some thoughtful reflection or further exploration to understand. I believe this is to be the last film by Hayao Miyazaki and is a gift to his grandson, which makes the movie even more poignant, as if it is a message for the next generation. I think this movie is one that will benefit from multiple viewings to excavate the layers of meaning. While I don't think The Boy and the Heron is as good as some of Studio Ghibli's other movies, it certainly deserves ongoing attention.Overall, The Boy and the Heron will, I think, resonate with a wide audience. As I said, I didn't see the English-dubbed version. But maybe that version will be more accessible to English audiences. Because the story is so heartwarming and the characters are so captivating, I'd suggest it would be a good watch for families and anyone who loves beautiful hand-drawn animation. But anyone looking for lots of fast-paced action may be disappointed with this one. I'd recommend it for anyone aged 8 and up.",
    "35": "This movie felt like it was about five hours.While visually stunning and the world they've made is intriguing and unusual....is this based off of a very long and involved book series I'm not aware of? Because watching felt like I was missing a whole bunch of backstory and detail, like there was a reading assignment I didn't do for class.Most-damningly: there's quite a lot of missing character development. As such, the evolution of the characters feels unnatural and forced, like they jump to the ending without the behavior making sense.We're just expected to believe that some 9 year old on a magical adventure, who just ran into her younger sister all grown up, is totally fine and happy to learn she's dead in the future, her sister married her widower husband and is expecting a baby with him, this boy she's been running around the magic tower with is her son---and it's all good? Really? In what universe?Also left out are why the main character suddenly flips to seeing his aunt as his mother, when they've had minimal interaction up to this point, and his real mother has been found alive, albeit younger, and why pregnant stepmom decided to run off to the magic tower in the first place.On the whole: it's like someone went a little crazy with a hole punch on the story plot, for all the little gaps it has.Small children may enjoy the slow meandering through various fantastical scenes, but it's likely a little too dark for the youngest bunch and at over two hours, it's not the most child-friendly of lengths. I can't see this one joining the highest echelons of the Ghibli offerings or becoming particularly beloved, outside of a few unique visuals.Watch if you're a completionist, otherwise, pick a different Ghibli.",
    "36": "Another masterful piece of art by Ghibli - and probably my favourite Miyazaki film after \"Ponyo\"I was enthralled throughout the entire film - I really appreciated the slow pacing despite how eventful the plot was, it was very grounding and refreshing to be able to absorb what was on screen. We've gotten so used to quick gratification when it comes to visual media, but this film was pleasurable in a very delicate and hearty way.My favourite scene was when Mahito trespasses the delivery room where Natsuko was sleeping. I was amazed at the voice acting, and how quickly and bizarrely the scene escalated. One of the most powerful animated scenes I've ever watched.I do agree that the character development for Mahito was a little stunted, and there were too many things about the world building that weren't answered, but I'm someone who's not that bothered by loose ends.",
    "37": "THE BOY AND THE HERON tackles tough territory as a boy struggles to move past his inability to rescue his mother from a fire before she dies. The approach is unconventional with a journey through other worlds. The artwork and animation are outstanding, but despite what should be emotionally-compelling material, the film often is emotionally distant. Many of the ideas and scenes feel like the cast-offs from past, better Hayao Miyazaki films. As good as the animation is, credit also should go to the musical score for contributing to the atmosphere of the film.A young boy named Mahito, yearning for his mother, ventures into a world shared by the living and the dead. There, death comes to an end, and life finds a new beginning. A semi-autobiographical fantasy about life, death, and creation, in tribute to friendship, from the mind of Hayao Miyazaki.",
    "38": "This new immersive world of fire from Hayao Miyazaki perfectly depicts the horrors of reality through the lens of a child; having to deal with grief, duplicity, and regrets in such a young age, a boy named Mahito finds his way to face the journey of acceptance, gratitude, and self discovery.Miyazaki never shy away embracing the peculiarities of his own imaginations considering its his most autobiographical movie he ever made yet. A well rounded, gut wrenching script with pack full of hidden messages and metaphors, it truly is one of the most poetic fantasy worlds that has ever been created on the screen.",
    "39": "As I sat watching this movie today it felt as if Miyazaki didn't know what he wanted this movie to be whether it would be a philosophical fantasy, a straight up fantasy, a period piece, a war movie, there were just so many elements from so many genres and quite frankly it ended up being a fever dream of an incoherent mess of a film and quite frankly the movie sucks and since we are being frank and honest, Miyazaki needs to retire before he's allowed to make another piece of garbage like this. It's quite clear that the glory of when studio Ghiblil actually made decent films is gone because their last few movies whether it be Ponyo, earth sea, the wind rises or even this latest movie you can clearly see that the creative magic is gone and you can definitely see a studio in decline.",
    "40": "This is not the Miyazaki that makes entertainment films (this is not Totoro). In this film, he dives deep into human consciousness, astrology and guilt. This is a \"difficult\" movie to watch in his filmography, with ramification on the plot and beautiful images that \"doesn't make sense\". I love that how Miyazaki draw this film into the main characters subconsciousness.In short, this is a poetic and sentimental film about how a boy grows up, reconciliation his guilt during uncertain wartimes. If you love art-style films, you will love this film. But if you prefer straightforward, easy to watch films, you may feel a bit lost.Make sure to watch Miyazaki's previous film, \"Wind Ries\", since it touches similar views on war and living difficult historical times. If you are a bird lover, you will love this film too.",
    "41": "This one like the other ones was rich on layers but this one is a \"milles feuilles\" as we call it in French a thousands layers .I've been touch by the step mother part but also the poetry about in betweenness a place in between live by and death.The non living and war... but I see that I can't go further without spoiling it.Nevertheless for children even 10 years old that is a bit of a challenge .. my stepsons got lost.It's beautiful but to complexe for young children specially when it lasts 2 hours.Otherwise enjoy! It's still full of symbols and poetry. And people trying to find their way. Do you want to live in a stupid world where people kill each other for greed? Because that's what it is isn't it ? Power and money...",
    "42": "Every 2 minutes you're presented something new that seems quite random. Before you can process it, they've already moved on to the next thing.You barely get to invest yourself into any of the characters, and it feels like their relationships don't have much depth like several other Studio Ghibli movies do.Everyone in the theater were getting edgy towards the end hoping for the movie to finish because it just felt like such a big disappointment. It's hard to stay interested when the story was so hard to follow.Definitely my least favorite Studio Ghibli film, if I can do that thing in South Park where Stan and Kenny went and got a refund from Mel Gibson for the movie \"The Passion\" I would.",
    "43": "I saw The Boy and the Heron, starring the voices of Luca Padovan-Are You Afraid of the Dark?_tv, Super Wings_tv; Christian Bale-Thor: Love and Thunder, the Dark Knight movies, Gemma Chan-Eternals, Crazy Rich Asians; Robert Pattinson-The Batman, Harry Potter and the Goblet of Fire; Mark Hamill-the Star Wars movies, Kingsman: The secret Service and Dave Bautista-the Guardians of the Galaxy movies, Stuber.This is a Japanese anime movie-which I have not seen a lot of-so it is more for the anime fans. There are dubbed and sub titled versions playing and I went for the dubbed. It looks good and has a great voice cast but I did get a little lost in the story at times. Luca is the boy in the title and his mother is killed in a fire. After a few years, his father, Christian, gets married to Gemma, who looks a lot like Luca's mother. At their new house, Luca meets a talking heron that is voiced by Robert. Robert tells Luca to follow him into an abandoned tower that leads to another world, where the dead are still alive. Luca agrees because he wants to find his mother. Mark plays the master of this other world and Dave is the king of some giant parakeets that are cannibalistic. I guess I need to watch more anime because there were times that I didn't understand what was going on.It's rated PG-13 for violence, bloody images and smoking and has a running time of 2 hours & 4 minutes.Like I said, if you are into anime, you might like it more than I did. It would be a good one to stream.",
    "44": "This movie is beautiful - be it in terms of its simplistic yet moving plot or its naturally engaging characters. Through a characteristic Studio Ghibli style, this animated epic from Miyazaki is a masterpiece by every accord. A tale of a boy who must battle inner demons and come to terms with both his past and his imminent future is an apt narrative for this aging stalwart of international animation, as he makes yet another final film. Sadly, compared to other films, it does not rank as high, opposed to Spirited Away or My Neighbour Totoro. Overall, this is a beautiful film to watch and one I would definitely recommend watching i. The language of your choice, but with lowered expectations.",
    "45": "Just saw it. If you liked Miyazaki's Ponyo (2008) (my favorite film of his) and, you wished he made a 100% dreamscape movie, then you'll like Boy-Heron. Heron also harks back to Spirited Away (2001), another child's hero's journey. Because Heron has far less narrative coherency than either of these films, I found my self bored on and off. Not only does it lack any strong narrative, it lacks an accessible theme; it lacks even story beats showing-telling us where we are going and why characters make the choices they make.In retrospect, I think the first act is mostly wasted. Reddit has discussion on why the boy hits himself with a rock. About six possible explanations are offered. No consensus. The boy begins and ends as a traumatized cipher, a blank. At the end, the only change is he earns a connection with his step-mother. It's not enuf narrative structure.On the plus side, the animation is lovely and non-corporate, a big plus.",
    "46": "So, a kid loses his mother during the war. He and his father moves to the countryside. We get to see a heron beeing curious. Now I'm hooked. The mystical feeling that they manage to capture here with the music and the stares. In that instant I'm thinking «this is going to be a classic». The movie goes on and we see the elderly women. I mean bring out your notebook and take notes, because these drawings showing how each and everyone of them moves with subtle differences... I respect ghibli so much. At this moment I'm sold.Buut. When we move into the second world. Movie looses me. It becomes too messy for me to follow along. Mahitos goal is to save his aunt and during that mission the side quests does not really make me know him any better. When we move into the old mans room where he balances the stones in order to keep this other world alive I didn't feel the importance of the mission. I didn't really feel how it would appeal enough for Mahito either in spite of his struggles with depression and ptsds back in the real world.Beautiful visuals but the story was meh in comparison with many of the others.",
    "47": "Miyazaki films are notorious for eliciting emotion and thought from the viewer. The Boy and the Heron is no different. Throughout this entire film I was trying to piece together what the \"real\" story was. It felt like the meaning was constantly changing. The story focuses on both the innocence in youth and the finitude in age.After I finished it, I certainly had some questions and felt like some things were left unanswered. This would be my only complaint with this film. Some of the story beats are well executed, but not explained to the fullest extent. I find beauty in this however as it allows me to think further and reflect on the rest of the film in my search for the answers.I highly recommend this film to anyone who enjoys cinema.",
    "48": "I recently watched Godzilla Minus One, and a week later I've watched across The Boy and the Heron and I have to say that Japanese movies truly are some of the best you will see. The Boy and the Heron is no exception. Initially, from the trailer, I was uninterested but the movie was much different than I imagined. It was beautiful. Studio Ghibli is an amazing studio, and this is not the first movie I've watched of theirs. I watched My Neighbor Totoro several years ago and it was beautiful too. I will watch movies from Studio Ghibli any chance I get. They know how to make movies for sure. The Boy and the Heron goes down as one of my favorite movies I've ever watched.",
    "49": "Are animated movies nothing more than graphic novels in moving form? Is Miyazaki a misunderstood or fully understood genius creator of movies, regardless whether the movies are live in their actions or confusing in their inked majesties?Irrelevant to the needs of the critics or the viewers, we have here in a movie something that should be seen and experienced on a large screen with sincerity. Without spiriting away too many details of the magical surprises, and without gushing too much about how cool the animated animals, especially the fishies and the white, globby things appear, move, or squeak, I will now endeavor to present a list of Things I Learned while watching The Boy and the Heron instead of a more formalistic review:The people involved in making this fine moving picture were either on some good drugs or wanted to be.When your mom (no spoilers) dies in the city, your dad will move to the country and hang out with your aunt because she looks like a younger version of your mom.Being sad and lonely is something we can all achieve, but both are far easier when you have a mysterious bird heckling your sadness and loneliness\nIf you smash your head with a rock, really hard, a wizard will said rock to build an interdimensional tower with which, and into which, the wizard will lure wandering souls, at which point those wandering souls will lose their minds forever (or become old women).Sometimes the bird gets the early worm.",
    "50": "The Boy and The Heron is an absolute masterpiece that serves as a touching farewell to one of the greatest artists of our time. It's filled with subjective complexities, breathtaking imagery, and a captivating narrative that takes the viewer on a journey of emotions.I cannot express enough gratitude to Mr. Miyazaki for sharing his extraordinary legacy with us all. His life's work has left an indelible mark on the world of art and storytelling, and we are privileged to have witnessed his incredible contributions. Thank you again, Mr. Miyazaki, for everything you have done to enrich our lives and inspire future generations.",
    "51": "The Boy and the Heron in some ways resembles Spirited Away, and in some ways it can be considered an improvement, enchancing its more positive qualities. The key difference is that the movie dedicates a significant portion of it's time to establishing the relationships of the protagonist with his family, and only then go into the spirit world.The animation is beyond gorgeous. The titular \"heron\" is far from the majestic depictions of these birds, starting off as a menacing trickster before becoming goofier. There are fewer creature designs than on Spirited Away, Princess Mononoke or Ponyo, but the other world still feels vibrant and full of strange characters.Overall, a phenomenal exercise in Ghibli's best qualities.",
    "52": "I'm an animator, and in my opinion this might be the most well drawn, beautiful work of animation I've ever seen. It certainly goes on a short list with Fantasia and Akira. It is imaginative, mysterious, and emotionally profound in a way that almost no movies made these days are. It was baffling and yet brought me to tears multiple times in theaters and even when I sat and thought about it later.I'm not sure I've ever made the effort to actually get on IMDB and write a review. But I've just never seen anything like this ever before. Please don't ignore it. This may be Miyazaki's last movie; going to see it in theaters is like going to hear Mozart in person right before he dies.This is not an accessible movie: parts of it don't immediately make sense. But it is an unforgettable movie. Go see it. It's a true experience.",
    "53": "Hayao Miyazaki, director of this great work and who has Studio Ghibli behind him, is looking for someone who can succeed him, inherit and continue his imaginative kingdom, since the first time he announced his first supposed retirement back in 1998, neither more nor less than the last century. Yoshifumi Kondo (Whispers of the Heart, 1995) was his first great choice, but when he was most certain that he would be the future of the studio, the director died in 1998. Another option perhaps could have been his own son, Goro Miyazaki, but he himself has been quite reluctant and has been refusing for years. Or finally, the great Hiromasa Yonebayashi (The Secret World of Arrietty, 2010), who was probably Miyazaki's clearest successor... But he ended up leaving the studio to form his own: Studio Ponoc.And that's how Studio Ghibli was left without someone to follow in the master's footsteps and how they gave up looking for a successor for Miyazaki, with the withdrawal of the also legendary producer Toshio Suzuki. As they recently announced, the Japanese network Nippon TV will take control of the iconic studio from now on.Under this context, it is time to talk about \"The Boy and the Heron\". Miyazaki's new film dazzles, automatically becoming a masterpiece on par with the author's great works. This time, with a film with more layers to explore than ever, in what is perhaps his most abstract and metaphorical film of all, but at the same time, one of the ones that reveals the author behind the film the most. Bearing great parallels with his 2001 work, \"Spirited Away\", it is one of the author's most imaginative works that at the same time hides a very strong background and symbolism with a biographical tone. Miyazaki leaves us in this film clear details of his life and childhood, but above all, of his current situation and that of Studio Ghibli itself.We cannot end this review without spoilers without highlighting that, as the director has already accustomed us to, visually it is impressive, a major masterpiece of traditional animation. And musically, a delight from the great Joe Hisaishi.In conclusion, we have before us the director's new masterpiece, which at the same time is probably the one that most reflects his \"big time\" style and creativity. Perhaps those who are unfamiliar with Miyazaki's work or those who lack context may find some parts abstract or complex, but I am sure that many will understand everything better with a second viewing, since, compared to his previous works, I think we are facing a of those with the most plot cohesion. It is a work that time and perspective will give a new nuance to its magic. For me, it has been a 10.The film has all or almost all of the most prominent elements of Studio Ghibli's way of narrating films, plays with references to Miyazaki's other works and has the author's most acclaimed narrative resources in a work that seems to seek to encompass all of his route.The film's great way of mixing reality with Miyazaki's magical universe is a delight. Starting with at least an hour of footage in the \"real world\" with Studio Ghibli's classic and special way of representing Japanese everyday life. Stopped, slow pace and full of those everyday details. On the other hand, in the second hour, the pace accelerates to adapt to the strange events and immediately begins the purest imagination of Hayao Miyazaki in all its splendor, with hidden world-building details, the most imaginative fantastic elements and everything wrapped up. In a world that dances between the limits of life and death.The various references, from the beginning of the film, which is reminiscent of \"The Wind Rises\", to the girl who controls the fire, which makes one think of Calcifer from \"Howl's Moving Castle\", or the 'Warawara' that so much are reminiscent of the 'Kodama' from \"Princess Mononoke\" or the 'Susuwatari' from \"Spirited Away\". The film is a journey through the author's own cinema.And of course, the character of the creator. A character who cannot make us think of anyone other than Hayao Miyazaki himself. In search of an eternal successor who never arrives, and just as happens in the film: will never arrive.And that's how the entire imaginary kingdom he's kept alive for years... Collapses.",
    "54": "The story, music, everything is just amazing. I love the world they have built and lived in. I wish i could live there even just only one day. I saw this with English voice overs and glad I did, I believe there is a subtitle version too. I highly suggest you see the version that requires no thinking as the palette that is presented is very absorbing. Even after the movie there has some questions needed to be an answer but i guess everybody could make up their own imaginations for this. The movie could make u feel nostalgic about every small piece of previous movies have done.love it so muchhhhh.",
    "55": "Regrettably, this work also couldn't meet the expectation of his enthusiastic fans once again. Aside from his earlier works, he has been continuously facing difficulties in expressing and conveying his own inner images and feelings precisely as he felt in Hayao's own brain to his loved spectators, maybe it started from \"Spirited away\". It's easy to say that it's simply because of aging though. But he's already lost creativity to attract his spectators no reason to the level of ecstasy. His long term right arm, producer Toshio Suzuki decided to eliminate any advertising campaign on this movie, seemingly because he figured anticipated box office stagnation prior to the release. Learning from aged Hayao, we would know the style to suit to his old days should be \"aged but matured\" one. We can't feel such a touch that we could taste from good old directors.",
    "56": "The best movie I've ever seen. A true piece of art that I will cherish for the rest of my life. The exploration into his own soul is not one I'll forget and one I'll revisit frequently. Japanese audio always preferred. Please watch this and allow the lessons of the subconscious to envelop you. The closeness to detail and his own culture and history truly put me into a new world. I believe if this is his final film the collective conscious will be truly grateful. I feel the fracturing of time and place allows truth to emerge. At the heart of this is the most beautiful and touching family stories I've ever seen. I didn't know his life story before this movie. But the second this movie opened I knew what I was watching. And I did indeed know the heron would be my guide into the darkness of space and time.",
    "57": "Mid Miyazaki is better than most films, no doubt. But it doesn't make this specific movie any better than it is: an ultimately disappointing skeleton of his previous works, filled to the brim with his prototypical moments of visual splendor and wild characters, but devoid of the connection that made his other films so lasting and memorable. It's a sketchbook of Miyazaki ideas loosely strung together. Characters come and go with seemingly no impact on the plot or its main character, a young boy entirely lacking in emotional expression.While Miyazaki is clearly attempting to tell a larger story beneath the surface, so is every filmmaker. It's not about the attempt. It's not about the hidden meaning. It's about the artistry by which that meaning is conveyed, how well a story is utilized to leave that impact on its audience. Praise him for trying, but one would be kidding themself to say he succeeded.",
    "58": "A year after losing his mother in a fire, Mahito and his father move to the countryside to be with his new mother, his late mother's little sister, and the factory his father manages. Mahito is still grieving and adjusting to his new life, but there is a grey heron that sparks his curiosity. As he tries to fit in, he discovers the history of his mother's family and the home they built. Baited and egged on by the heron, Mahito embarks on a journey through space in time to discover the truth about his mother and to save his new mother.The latest film from Studio Ghibli. This film has fantastic animation, an accompanying brilliant score, and a captivating and intriguing story. The film has parts that drag on and make it long. Like previous films, this one might take a couple of watches to appreciate the story entirely. The story is a take on the multiverse and how it is used to help a grieving child come to terms with his loss. This is a good watch for anime fans, fans of the studio, or anyone who wants a break from what is currently on the silver screen.",
    "59": "I never write comments or reviews but I just watched the movie and it was an amazing experience! I saw a lower rating than expected and a lot of people saying that they are confused or the movie was confusing! Please you have to understand that the problem is not the movie -it is you. You can not blame the movie for not understanding it. In order to understand the movie you have to at least watch a couple of the movies from Studio Ghibli. Also you have to have in mind that this is the last movie for the director and there are a lot of sumbolic things in the movie related to that. Also it is an Eastern movie and most western people will definitely struggle to understand it because we are fed with the same boring and predictable movies and series for the last 80 years and this movie sends you on an unpredictable adventure where you have no idea what is happening every next minute. In order to absolutely submerge into this absolute masterpiece you have to allow yourself to be a kid again. Capture that feeling of exploration of the unkown and just let this incredible story unfold. But again probably it is good to watch some other movies from Ghibli if you are going to watch this as your first movie from their studio. And for all the people that did not understand it. Please give it some time to sink in and watch it again!",
    "60": "This movie has all the classic and fantastic Ghibli elements. It stays true to the classic animation and has a beautiful sorry with fantasy elements. A great family movie to enjoy at any age. It is refreshing to watcha movie with a good storyline. I will watch this at least a couple more times, so full of rich details in the animation. Pay attention to the background, there are details that enrich the story. This is a must watch for any Ghibli fan. It also stays true to a beautiful soundtrack that is a work of art in its own. I will be adding it to my favorites playlist. I really hope this is not the last movie from Ghibli.",
    "61": "At first I was pretty confused. Fast paced Plot, a lot of different characters, etc. But at End it all made sense. This Movie kinda gave me the feeling that such Ghibli Classics (Mononoke, Castle in the Sky, Spirited Away, etc) gave me when I watched them when I was younger, it was overwhelming but I didn't understand everything and the whole meaning, yet. It's kind of nostalgic but also very mature in its subjects and topics. I absolutely love the beautiful Landscapes and Shots in general (in Myazaki Fashion). It will definitely be in my top 5 Ghibli Movies. Definitely a must watch for every old school Ghibli Fans and also a great start for new comers.",
    "62": "Miyazaki is back and brings animation with him.The highly anticipated premiere of the film \"How Are You?\", better known to English-speaking viewers as \"The Boy and the Heron,\" is already showing in limited cinemas days before the premiere. After his humorous departure in 2013, Hayao Miyazaki switched to a free schedule, and the new film was in production for almost ten years.The main character, ten-year-old Mahito (or \"real man\"), as we learn from the opening shots, is a boy left without a mother during the war after the bombing of Tokyo in the third year of the war, whom his father, the head of an aircraft factory, takes away from the war to the wilderness of the country to an estate maintained by the father's daughter-in-law, Mahito's mother's sister, now carrying a child, and a pack of aunties and unclies hidden from the terrors of war by the daughter-in-law.Without getting into details, Miyazaki brings to our attention the old way of life, in front of which modernity appears as a convention, and war as, if not an aggravating, then a refurbing obligation to life. Mahito is repeatedly bothered by a heron, persuading him, either it's dreams or reality, to step unto the tower to save his own mother, and Mahito, although he has doubts, goes on a strange journey through fantasy worlds, where everything is not what it seems, but in fact it is the same thing, to save not only his mother, but also her sister.To reach the hearts of the TikTok generation Miyazaki forsakes metaphor and goes all-in with analogies. The fascist followers appear in parallel worlds as cannibalistic parrots, the bearing aunt is hidden from the cruel everyday life behind thick curtains and is filled with resentment rising from a jealousy for her dead sister's purity, and Mahito is saved from all dangers by the stubborn and no longer so impudent with a bullet-ridden beak hero(n), a fireproof a girl who, like Mahito, ran away to the tower in her youth, and a rover auntie who makes sashimi out of fish for self-inflating for a new rebirth ballies.Miyazaki's new picture is no longer so much a parable, which the previous generation have probably missed by the tip of the tongue, but a clear anti-war catechism that guides young viewers not so much through the dream world of Miyazaki, Christ and Buddha (I think this is not it's an exaggeration to say that), but through the dream world of those very real young people who are grasping at strings in order to understand what they are and what words to build.And it seems to me that the master succeeds in building a better one. Let's believe that the audience will succeed too.",
    "63": "This movie had elements of pervious Ghibli movies without plagiarizing itself. The visual and story element references to pervious works were present, possibly as a way of communicating with the audience. TBATH had a mix of slice of life, and fantacy. I hope it is not Miyazaki's last film but if it is, it is truly a beautiful swan song.Please note that I am not great with recalling character names and I can't navigate away from this page and if I don't write this now it won't happen.Below here are some of the references I noticed: our protagonist wears the same pajamas as those of Jiro in the beginning of The Wind Rises. I don't know it these are just a common print or if there is significance.The grannies at the estate remind me of other characters: Yubaba in Spirited Away, and the resident ladies of the nursing home in Ponyo.When Mahito is injured and blood rushes down onto the ground, this reminds me of when Nahoko in The Wind Rises has a lung hemorrhage. I heard a youtuber say the parakeets remind him of evil Totoros and I think he's right! That one I did not see on my own first but I do agree. I'd give him credit right now if I could remember his name. The heron reminded me of creatures from Spirted Away, kind of flying Yubaba but not exactly. The war elements of course were present in Grave of the Fireflies and references in The Wind Rises and Porko Russo. Making planes was of course in The Wind Rises. The relationship between Mahito and Kiriko was reminiscent of Kiki and Ursela or Chihiro and Lin. My favorite outfit in the whole movie was Himi's dress. This reminded me of Whisper of the Heart when Shizuki is imagining herself in her story, with rad stripes like Fujimoto. When the papers flung toward Mahito, this reminded me of the scene in Spirited Away when those paper things were following Haku. The whole inside the tower felt like an adventure mostly akin to Howl's Moving Castle to me and even more visually stunning. I'd say that Mahito's relationship with Himi could compare to that of the characters in When Marnie was There but not quite. I still got choked up at the end when what we all already knew was said by Himi.I have only seen this movie once and I want to go back again to see the dubbed version. I really enjoyed it and I will probably notice more and more.",
    "64": "How do you live?I choose life and she choose hers.Your choice makes this world peaceful or chaotic.Holding tight . Letting it go. How do you live makes always your life beautiful.Movie starts from real historical events and a boy drag into the world to find his own family and life.Beautiful animation. Beautiful music.But story itself isn't well made.There are too many scenes are too long and un necessary. That's really breaking rhythm of movie.Also all objects hayao Miyazaki wanted to write in the movie doesn't make much chemistry. I wish I could have seen more organized and combined story.It's not the best one or not even top 5.But overall it is beautiful movie. I enjoyed it.",
    "65": "I enjoyed this film very much and think it is a must watch for many. It does not follow the usual format of story that the director usually takes but nevertheless it still feels like one of his films. Even if you do not enjoy the story, the animation is beautiful and complex and honestly something very mind bending. The story can be understood in many different ways depending on perspective and I would recommend it to anyone. However, I do not see this as a children's film for it is very intense at some scenes. If you believe your child is mature enough then I definitely recommend it but darker themes and narratives are present. I loved this movie at the end of the day and it will be considered one of my favorites for a long time.",
    "66": "Absolutely loved this film the boy and the heroin, it's my first time watching these movies with my grandkids LOL! Haha I haven't got my glasses on right now so hopefully I'm spelling this right. Anyways My grandkids love all this animaye stuff! They are silly they are forcing me an old gal to watch them! Haha anyways didn't think I'd enjoy it but I would recommend the boy and the herion to anyway! I'm hoping I'll be able to watch more of these with my silly grandkids WAP! Couldn't find it on SKY TV LOL! My grandson has alot of animaye merch, I bought him on of those funny pillows once! He loves it LOL.",
    "67": "There were 5 people in the theater . 2 left 20 minutes after the movie started. Me and my boyfriend felt asleep for the whole movie. I was drifting in and out of a dream like state but what I could see from the movie was extremely boring and non sensical that I would just rather keep sleeping/dreaming. When we left the theater , the fifth person was still asleep....\nI wanted to like the animation but it seemed cheap . The backgrounds were dull. The music almost muted. The story non existent . The main characters bland. I really don't understand the good reviews. Is it people trying to feel deep ? That movie was trash.",
    "68": "This was the worst one I have seen yet. It's unfortunate because almost all of Studio Ghibli films are great. This was a literal snooze fest. Me and my boyfriend were falling asleep in the theater. The movie is extremely slow and it goes nowhere. You think it's going to get better, you think it's going to start to make sense but it doesnt. Little to no character development. We could not finish the movie and walked out feeling disappointed. The imagination is there, but it just falls completely flat. The animation is beautiful, that is all it has going for it. Don't waste your time watching this.",
    "69": "When I went to the cinema to watch this movie, I was skeptical at first, because I thought the name of the movie sounded a bit weird and I had no idea what to expect. When I walked out I was not disappointed at all. This wasn't a typical Ghibli movie. In multiple scenes, there was a new change to the usual Ghibli animation style. In certain scenes, it looked amazing (like the fire one in the beginning), but sometimes I thought that the animation looked a little strange. So there were great moments and also not that great moments, but overall I'd say the movie looked amazing. One of the things I feared when going to the cinema was that it would be some generic movie about a boy meeting a bird and becoming friends. I was wrong. Of all of the Ghibli movies I saw this one had the most unpredictable plot (in a good way). I felt a lot of emotions during the movie. I definitely wouldn't say that this is the best Ghibli movie out there, but I enjoyed it a lot and will be watching it again.",
    "70": "Very funny, very gorgeous, lots of heart, beautiful score and definitely an enjoyable watch. However i feel as if they pushed the limits a little too far on how much you can leave up to the interpretation of the viewer.Almost nothing is ever explicitly explained, many scenes and story points seem disjointed as if large parts of the movie were cut out, and the ending came very abruptly.Something that really irked me was how the main character almost never inquires as to what is happening throughout the movie. All of these crazy mystical creatures and events are unfolding, and Mahito never really stops and asks for any explanations. He just acts as if nothing in the alternate realm is new to him or is out of the ordinary.Even when he meets someone who is very clearly his mother as a young woman, his mother who he's been heavily struggling and grieving with the loss of, he has basically no reaction and just treats her as anyone would treat a friend. It is shown by the end that he knows exactly who she is, but even then he just so nonchalantly states how she's going to die and then she brushes it off and they say goodbye to each other. He sheds not a single tear or anything of the sort. The movie feels as if scenes are missing.After leaving the theater, my partner and i spent a good hour in the car going back and forth trying to decipher the plot and understand what was happening and why, since not much gets explained and it's up to you to interpret, but we still ended the conversation with way more questions than answers, which isn't always a bad thing. But in this case, the lack of cohesion and explanations feels more frustrating than intriguing to me.I do plan on seeing it again, and i do predict i'll enjoy it more the second time around, as i did with Howls Moving Castle which i regard as my second favorite Ghibli movie now, only beat by Kiki's Delivery Service.",
    "71": "Bombs rain down on the city and in the fire, chaos, and rubble a boy, Mahito, searches for his mom. He hears her voice calling him, but he can't find her. Even when Mahito, his dad, and a new woman move to the countryside, he still hears his mom's voice calling to him from the fire. In dreams and with the encouragement of a mysterious heron, Mahito enters an abandoned and magical tower where he hopes to get clues to his mom's whereabouts. It may be an elaborate trap.This complex, beautiful, deeply imaginative, and many-layered film continues Miyazaki's amazing and awe-inspiring legacy. He is one of my favorite directors. In nature, wisdom about living, magic, charismatic guides (female as well as male), folklore, cute puffball critters, war/chaos, wackiness including flesh-eating parakeets, portals to other worlds, loss, and love, Miyazaki continues to run with favorite and endearing themes. The film is full of insight into what it means to be human. I was so happy to be part of the first audience to see the film outside of Japan.There is depth in the story, characters, music, voices (much better in Japanese), and especially the artwork. I'm mesmerized just by the drawings and movement of the clouds. Oh and there are fantastic and intricately drawn ocean waves, moonlight reflected on water, vivid colors, resplendent contrasts of light and dark, elaborate tree branches, night skies with resplendent stars and meteors, grasses realistically swaying in the wind, alluring shadows, and so much more. The Boy and the Heron is worth watching for the artwork alone.",
    "72": "It's the Second World War, and Mahito's mother has died in a fire bombing. Now his father has announced they are moving to the country where he has set up a factory for fighter planes, and Natsuko is going to be his new mother and she's expecting a child. And, oh yeah, it gradually becomes clear she's Mahito's mother's sister. The maternal estate is large and beautifully landscaped, and there's a strange tower that has been allowed to fall to pieces, along with a family legend about a great-uncle who built the tower where a meteorite struck, and who later vanished.Mahito is upset about all this, and so he injures himself so he won't have to go to school. But he keeps having strange dreams about the grey heron and the tower, and his stepmother driving it off with a bow and arrow..... which he later spots in her room.And all the elderly female servants look like the characters from SPIRITED AWAY. This is all right, because Hayao Miyazaki has come out of retirement again to offer us a parable about how you can have a family, if you're willing to be accepting. Once again, it's filled with giant, evil parakeets, toy balloon animals that float to the moon, and a sense that there are rules in operation here, even if you don't understand them. In the meantime, enjoy the weirdness, and, as always, the magnificent background art.",
    "73": "Seeing The Boy and The Heron, Hayao Miyazaki's latest movie feels almost like a monumental event in and of itself. It was announced almost as a surprise with the words \"Hayao Miyazaki's last movie\". With this amount of hype, including the amazing reviews it's got from critics, my hype was built up to the max. The end result? Not what I expected, and that's ok!Let's get to the positives, the animation is STUNNING. The way Hayao Miyazaki manages to build these worlds and characters is just an amazing feat, they all come alive with the colours and the movement. Another positive is the tone of the movie, I really hate Disney for trying to market this as a kid's movie, when it's not. It's got some unnerving and scary moments and themes that are not suited for kids, which is good. Hayao Miyazaki is at his best when he manages to blend the adult with the fantastical.The actors are always amazing, I saw the Japanese dub so I don't know how the western VAs are doing but wow; they all do a fantastic job!Now to the negatives... a huge thing about Studio Ghibli movies in general, especially the ones from Hayao Miyazaki, is that they're always by rule driven by the characters, it's their journey that's in the front. World building and narrative always takes a second place in his movies to be able to not distract from the characters journeys, big examples of this are Spirited Away and Howl's Moving Castle where the world building is built by very simple and effective means and rules. But here in the Boy and The Heron the world building is so convoluted and confusing it almost feels like he wanted it to take center stage in this movie and it's such a shame because it feels at like it's at odds with it's own main character who supposedly undergoes a deep deep emotional journey but it all finishes off in a very abrupt and unfitting send-off in the end which really confused me and just didn't feel like a good payoff.Also the way this movie introduces characters left and right with no rhyme or reason is super confusing. Once again, Hayao Miyazaki did this very minimally in his past movies where the characters get room to be explored and to leave an impact in the story but here once again it's at odds with its own world building- it all feels very haphazard and messy. The Heron is a fun character but I don't feel like he or Mahito do or learn anything from these adventures.Now, it may sound like I hated this movie, but I didn't. It's just that I care so much about Hayao Miyazaki movies and Studio Ghibli movies that I can't help to compare them to the movies we've seen before. And despite it not being Hayao Miyazaki's best it's still pretty good, it's very much worth a watch.",
    "74": "I've probably started a review of a Hayao Miyazaki film stating it's his final film before, but \"The Boy and the Heron\", for more reasons than one, certainly feels like the final cut. Now aged eighty-two with an ever-increasing gap between films, it would sadly appear unlikely another feature will be made. \"The Boy and the Heron\" would show that Miyazaki now also knows the gig is up, feeling like a culmination of a life's work, looking backwards rather than forwards.Mahito's (Soma Santoki) mother is killed in a Tokyo fire, and so later goes to live in the countryside with his father and stepmother (also his aunt). His father the owner of an aeronautics factory, he has a large plot to explore, finding a mysterious old building. But he also finds himself stalked by a grey heron (Masaki Suda) who appears to mean him harm.But with his stepmother Natsuko (Yoshino Kimura) going missing, he confronts the heron and the pair go looking for her, finding themselves at the mysterious building of unknown origin. This takes them into worlds within worlds, as they are helped and hindered along the way by various people and creatures.There's a lot going on here, and, it's fair to say, too much. There are some good moments, but this is a film that gets a little lost within itself as it tries to squeeze in too much into its two hours. While there are similarities in all of his films, each has its own unique charm. \"The Boy and the Heron\", however, feels more like a greatest hits parade, with many moments reminiscent of what has come before. You can probably go through the whole film and equate moments to earlier works every step of the way.Whether intentional or not, this can show both a filmmaker struggling for original ideas, but also a messy and convoluted storyline that can become difficult to follow and disengaging. Miyazaki films can almost be made by their moments for reflection, but here you barely feel able to breath as we race into another world of new characters. The result is a film that has some of the confusion and struggles of some of Ghibli's - not just Miyazaki's - lesser works, such as \"The Cat Returns\" (2002) and \"Tales from Earthsea\" (2006).A problem for Miyazaki is that you are judging his films by such high standards, in a career that has never really declined, just become sparse. This is good, but it is by no means great; probably most reminiscent of \"How's Moving Castle\" (2005) in that it tries to open too many doors. Miyazaki is at his best when he keeps things simple, but feels like he's trying to push the magic and wonder here, rather than let it out naturally.Comedy is perhaps the strength of the film, with more outright laughs than I can remember from Miyazaki before. To start, the elderly maids of the country house, while familiar in design, have the mannerisms of excited children, hungry for treats from the big city. Though Suda as the heron is the standout, starting as a squawking threat, but becoming the buddy sidekick and a constant source of humour, as one of Miyazaki's most comical characters.As ever, Joe Hisaishi delivers a memorable soundtrack, with a sparse and simple piano a reminder that Ghibli is at its best when uncomplicated. And simplicity is the word for the somewhat abrupt ending. In a film that has so much going on, the coda is almost notable in its inactivity, and feels like a fitting way to end. A career that has brought so much, should say a quick goodbye and leave us with good memories.Politic1983.home.blog.",
    "75": "If you have never watched a Hayao Miyazaki film, I wouldn't recommend starting with The Boy and the Heron.For an introduction I'd recommend to start with Spirited Away (2001) and Princess Mononoke (1997).If you become amused and the films resonate with you. Then you will enjoy The Boy and Heron. It isn't the strongest of Hayao Miyazaki and Ghibli films but a very good addition to their filmography.The film begins with a slow pace of mostly visually defining the world, characters and their dilemmas. As the movie progresses you see touches of another realm. Before you know it, it becomes a full-blown feverish dream of Hayao Miyazaki imagination and story telling. It eventually comes all together back on its feet at the end.Was it fun and visually pleasing? Yes.Was I confused at times And had a lot of unanswered question? Also yes.",
    "76": "Not his best, but a very solid fairy tale from the master with lots of his trademark elements like stoic characters, spirit worlds, flying scenes and characters running through narrow passages.It is stylistically comparable to Spirited Away and Howls Moving Castle, although a bit less epic in scope. Like those films it inhibits a certain darkness and maturity at times with a war as a backdrop, that is not really aimed at children. I personally liked it and wished that more filmmakers in animation would have similar aspirations, but I guess those who do are expelled to do short movies. But back to Miyazaki's movie: it is bursting with lots of ideas, symbolism and fairy tale motifs like Snow White (with a dead mother, seven dwarfettes and a glass coffin with a sleeping beauty). At other times the character dynamics invoke Jim Henson's Labyrinth, where the protagonist has to rescue a kidnapped loved one and work with a henchman who sells him out at every opportunity until they start bonding.All the visual ideas are great but sometimes they can unnecessary bloat the picture. It is one of Miyazaki weaknesses to be over-indulgent and unfocused at times, sometimes he needs to tighten the story in certain places - especially during the last stretch it can feel exhausting. I still like the leisurely pace in the beginning and that the movie takes it's time to slowly pull us into another world/afterlife/beforelife however you want to call this place. There are beautiful visual metaphors like when the little balloon creatures fly off into the next world, one can say that those symbolize the protagonists own emotions bubbling up into the surface (this is also the first sequence where we see the main character smile and express genuine emitions) - and that he tries to repress those feelings. Especially towards his new stepmom which he tries to rescue seemingly out of pure obligation for his father. It is also no coincidence that we witness the appearance of an avatar of his real mother in that very same sequence - she tries to protect those cute balloons from hungry predators, but in the process burns most of them. The clinging to the ghost from the past is preventing a new blossoming/beginning. There simply aren't easy and clean-cut solutions, neither in nature nor our society.There are certain moments where someone can get the impression that Miyazaki is making a statement towards his own legacy and the studio he helped to build. There are themes of responsibility & duty versus family sharing a lot of similarities to his last movie 'The Wind Rises' . I appreciated the ending, without getting into any spoiler territory, a lot of people wondered or were baffled why the final scene feels sort of \"tacked on\". But when you closely observe it, it is sound with the movie's themes and illustrates rather well the important choice of our main character.",
    "77": "I am a big fan of the films of Hayao Miyazaki...so much so that I went out and got a tattoo of his Totoro characters. And, I've seen and enjoyed all his films. So, when I say I didn't particularly like \"The Boy and the Heron\"...well, that says a lot.The story is confusing and the ending seems, well, to kind of contradictory. I'll TRY to give a brief overview. The story is set in Japan during the later portion of WWII, though the war seems to play very little part in the story. It begins with a fire in which Mahito's mother is killed. A few years pass and Mahito and his father have moved out to the country because the father's fiancee lives there...plus, it is the war and being in a city was NOT a good thing. Mahito is shocked when a heron begins talking to him...and a weird human-like face emerges from the bill. Eventually, he and the heron enter a weird parallel world caused, apparently, by a strange meteorite and his great-great uncle. What happens next is confusing, so I'll just stop here.So many confusing story elements. Why did Mahito smash a rock against his skull early in the story? Why did the great-great uncle say he wanted Mahito's help...but then Mahito wakes up in chains! And, later, the great-great uncle says how much he likes Mahito...but what about the chains? There were more strange and inexplicable occurrances.While some might say that Miyazaki had made other confusing and difficult films, if you know about Japanese folklore and religion, films like \"Spirited Away\" make MUCH more sense. But this one is just confusing...and probably will be to Japanese audiences as well.I'm giving the film a 6 simply because the animation was nice and the film was original. But apart from that, the confusing story isn't fun, the characters aren't lovable and I think it's possibly his weakest movie.",
    "78": "From Studio Ghibli, The Boy and the Heron is an animated movie about a boy that dramatically lose his mother due the war in Japan, and he and his father have to move to a safer place. When they arrive, they live in a nice and quiet home. In a place, were strange things did happen, and will happen, too. First of all, I have to list up what was good about the film. It was absolutely beautiful animation with great paint, drawing techniques, and amazing colors. They had that mix with painting-like animation, but at the same time, classic Japanese anime. And I really liked that, I think it is a very nice thing, and I can see that this is a technique that Studio Ghibli is using a lot, and they are really doing it well. Very nice music. It was soft, easy and quiet, but at the same time it built up a hidden suspense that was holding. The music was some sort of anxiety mixed with calmness. Very strange. Last thing that was good was the overall atmosphere and the feeling of the movie, at least in the first act. Because then things started to get a little weird. Everything became unknown and messy, the story changed the course multiple times, and I wasn't sure which way the plot was going to go. At the end everything became a little more clear, but still a little weird. When you don't know what is really going on, the action becomes a little nonsense, too. And that was exactly what happened. The action sequences were sometimes fun and entertaining, but I was still questioning: Why are they doing it? Why are they running? What are they running from? What's the point of the story? Good enough that they had a good moral at the end. Very great with a good message about the balance of the world, and that the soul value is very important. After all, this was a movie on the middle. Great music and animation. Fine atmosphere in the first act. But it got a little messy, and the story changed course to many times. They rushed a lot and I didn't get time to think. Studio Ghibli could have definitely done better.",
    "79": "Getting the obvious out of the way, like all Ghibli Films, the animation, music and voice acting are all top-notch. But it is the story where this film falters.I admire Miyazaki for doing something original. This movie cannot be faulted for lack of creativity. It does have its fair share of Miyazaki tropes, but the man still manages to keep the audience guessing.I feel most of my critiques could be accused of me just \"not getting it.\" But no, I get it. I just don't understand what is going on, or why people do the things they do. People do and say things that are completely out of character. When the final act comes around and I look at the possible resolutions, I realized I didn't care how it turned out. Mainly because I didn't understand how this fictional world works, or what the consequences would be.It isn't all bad, the movie is funnier than I thought it would be. In isolation there are some nice scenes, they just don't come together to form a cohesive narrative. I have just come to expect better things from the legendary Miyazaki.Overall, it does not hit the heights of a castle in the sky but doesn't crawl as low as an earwig.",
    "80": "This is one of the good ones. However it reflects as much the passion and skill of Hayao Miyazaki as his old age confusion. His latest \"last movie\" starts one way and ends (abruptly) another. It has elements from his own life, his previous work and some new ideas, but the gist of the film is reconciling with loss and moving forward, recognizing there isn't much one can do. A very old man mentality in a movie about a child entering a magical world filled with wonder and dream logic.The animation was so beautiful, the story a bit disjointed, but quite captivating. It was the ending that kind of disappointed. This film has been a long time in the making (in 2019 it was 15% complete, allegedly, with Miyazaki directing a minute of the film a month) and it shows.The Japanese title is \"How do you live?\", the same as the Genzaburo Yoshino's instructional coming-of-age novel that Miyazaki's mother gifted him. In the film, the boy finds the book with a message from his dead mother, instructing him to read it, but it never goes anywhere. There are a lot of other hints and symbols that are quite opaque to non-Japanese, so I felt that I've missed chunks of what the movie was supposed to convey.Perhaps the most interesting quality of the film is how easily it can be interpreted multiple ways, the ambiguity both confusing and thought provoking. As we experience dream and child logic we get a glimpse of the transmuted reality underneath. The grief, the loss, the benevolent yet oppressive culture, the futility and pain of war, the missing and missed parenting and so on.Bottom line: is it a masterpiece or a slice of Miyazaki, jumbled beyond recognition? Both. I felt it might be a fitting farewell film, but also that I missed so many meanings from it. I liked it.",
    "81": "A disjointed mess of a movie, with many confusing elements, and a non-cohesive storyline.I went into it expecting a thoughtful farewell and bittersweet celebration of Miyazaki's legacy, and instead came out of the theater taken aback and disappointed. A work like this I would expect from Goro, not his father.I cannot fathom how so many reviewers have given this movie nines or tens. By no means is it deserving of such high praise, and I have to believe this dissonance is due to fanboy-ism and an inability to criticize the work of someone they love.Well, I love Miyazaki's work as well, but I also understand that it's important to be objective and not biased in an increasingly all too biased world.I hope he creates another, and redeems himself, as I do not want this to be the note he ends his praise-worthy legacy on. Regardless, thanks for all the fantastic memories and moments you've already provided me, Mr. Miyazaki.",
    "82": "I don't know if it's because Miyazaki is getting old and has lost his magic, or if it was shortened for commercial audiences, but something felt completely missing.The sense of wonder you get from a Miyazaki film seems to be void here. There are sparks of it here and there, and the film is not without it's quirks that make a Ghibli film so great. However, it all feels like a \"lite\" version of what has come before. Plot points get tangled and forgotten about, some things feel like an afterthought, and it all just kinda feels a bit too familiar.I will say that I am happy to see such beautifully realized animation back on the big screen. Nobody does japanese animation quite as good as Ghibli does it. I was in awe seeing it on the IMAX, which was the best way to view it. You could see the dedication and detail that went into the artwork and appreciate it even more.After The Wind Rises, I was convinced Miyazaki would never make another film. I almost wished he hadn't. This film feels like a filmmaker who has already said everything he has to say. Tired and worn out. If it wasn't for the exquisite artwork throughout, I would've rated it lower.2.5 herons out of 5.",
    "83": "I'm a huge Ghibli fan and have watched Miyazaki's every film dozens of times each. But sadly I must say I'm disappointed with his latest work: How Do You Live? (or The Boy and the Heron, a much better title in my opinion.)I really wanted to like this movie because it has many things going for it. Animation is dynamic and beautiful. Miyazaki builds an interesting fantasy world yet again, probably for the last time.But story telling and character development are a bit off. The narrative feels forced and not flowing naturally. In the older titles like Nausicaa, Spirited Away, or Howl's Moving Castle, strange things happen but the mystical worlds have their own rules and Miyazaki was masterful in subtly convincing us the way things worked in those worlds. But this movie has just too many things hastily cramped together and they don't have enough room to really sink in. Simply put, it's difficult to follow. The same thing goes for character development. The main protagonist (Mahito) grows up through an adventure, which is great, but his momemts of growth come abrupt and not really earned.It's a cliche by now that Miyazaki does magic, but this particular film doesn't have much of it. Strangely enough, it reminded me of Tales from Earthsea (2006) by Goro Miyazaki. This movie has many bits and pieces superficially resembling what we have seen in the previous Miyazaki films, but the sum is not greater than the parts.",
    "84": "In Hayao Miyazaki's potential cinematic farewell, a departure from conventional reviews is warranted. Despite initial reservations fueled by IMDB critiques, critics' lyrical appraisals offered reassurance. Miyazaki's final masterpiece unfolds abruptly, sparing no time for a gradual introduction. Each frame is pregnant with meaning, a poignant contrast to the extended production duration. The film, rich in raw emotions and adorned with exquisite visuals, navigates seamlessly between ugliness and well-timed comedy, a hallmark of Miyazaki's universe.This cinematic journey delves deep into Miyazaki's psyche, revealing a narrative where tragedy and pain harmonize. A meditation on grief and release, the film serves as Miyazaki's testament to progeny, legacy, and the world. It implores viewers not to take the world for granted, urging them to craft their own destinies. The dichotomy of cherishing true connections and relinquishing past loves echoes throughout, with an emphasis on embracing all facets of oneself.In unequivocal terms, this is Miyazaki's Opus Magnum, a cinematic zenith. It crystallizes a lifetime of storytelling, amalgamating all prior works into a perfect tapestry. As a swan song, it stands as a testament to Miyazaki's unparalleled mastery, encapsulating the essence of his cinematic legacy.",
    "85": "Hmmm.... Hayao Miyazaki's Labyrinth? Kind of! I dig it. Could this have lost a few minutes somewhere? Possibly? But I'll always be in exhilaration of this filmmaker showing me the uninhibited creatures and designs and everything that is inside of his mind. It could be tempting to say it has derivations of his other work, but I don't know if that's so logical when, in reality, it is all just all of a piece with everything he's made. If you say this is Spirited Away or that's Totoro or that's Howl... it's all him and his many concerns as an artist and deep thinker.While there is a fantasy-adventure structure, it's also a Surrealist film, or rather it carries some of that logic (when it isn't making up its own rules as a fantasy story, kind of an issue but whatever), and you never want to look away to see what he will show you next, and that's special. It's like cracking open his Skull and walking around, and not every filmmaker gets to that level where not only they can do that but we want to stay for a while doing that.There's a generosity of spirit in that, and there's a little of everything that you've come to be surprised by in his films, from the *cute Warawaris to the disarming and colorful with flocks of Parakeets (the one shot of the Parakeet sharpening the knife is hilarious and terrifying as anything Miyazaki has shown us in all the decaded), to the uncanny to the nightmarish and garish and tragic - a highlight is the moment Mahito gets to the mother and the two of them become wrapped in hundreds of flaps of paper).But it is more enjoyable as a series of vignettes than a totally cohesive narrative, and because of that it starts to wear out near the end. I also didnt think the lead Mahito is not a very compelling protagonist despite all of the familial and war-set trauma as the backdrop, and there is enough going around him from the little old ladies (love them, I want one in my home) that it's fine. On the other hand, who should I be to complain about an embarrassment of fantasy riches from one of the great modern masters? I feelBut I can't stress enough: Labyrinth... And, oh right, that other movie with the little dog and the Lion and the Emerald City and so on. But how about that Heron reminding one of Hoggle. And the Goblin King is... an old man..... (*and those cute little guys are very very cute).",
    "86": "Two movies into one, where life and magic (reality and fiction, humans and dreams, artist and art) intertwine.It's meaning is up to you. It's not abstract, it gives you enough tools to decypher the allegory yourself, and make up your own interpretation (and is very literal about this \"hey, build your own world\").Its main theme seems to be living through hard times, moving forward and embracing the future and mortality. But this too, is up to you. It reflects on empathy/apathy and self/others. But this is one movie. The other movie detours into Wonderland in a more surreal way (think of a mix between The Seventh Seal and Snow White).The description on this website is misleading. It's not based on the book of the same name, but rather references it and builds a world of its own upon it.I recommend you watch it, even if it gets you confused. We are lucky to have a man of such intellect, so skilled at his craft, still around.",
    "87": "Scenes from this movie are so beautifully illustrated that they feel closer to an art gallery show than an animated film. For those familiar with Miyazaki's animation style, you'll find it here, though it often feels set against an impressionist background somehow grander than the settings of earlier films. It's likely the most fully-realized animation in cinema.Many are saying that this really is Miyazaki's final film, a claim previously made about The Wind Rises. Like that film, The Boy and the Heron feels written predominantly for adults in a way different from other Studio Ghibli films, like Spirited Away or Howl's Moving Counsel. Set in 1943 after its main character loses his mother in a fire during WWII, The Boy and the Heron squarely faces down the loss of the past while looking to the uncertainty and confusion of the future. Though putatively about the boy's mother, the setting amidst the late-WWII period speaks to larger issues about countries and peoples at the crossroads, including Japan in particular. It seems no coincidence that both The Wind Rises and The Boy and the Heron take WWII as their theme, with an artistic lead at the helm looking back at his career and the trajectory of his country.My only complaint is the slapstick-y dialogue with the heron in the second half of the film, which I thought distracted from the power of the story. But, that's a minor complaint. Overall, this film is a work of intense artistry and love. It moves you with its story and gorgeous animation. You walk away thinking about it well after the credits roll. To this point, it's the best animated film I've seen in my life.",
    "88": "I watched the film in the cinema last week, and I can say it was generally mediocre. I have always respected Miyazaki's extraordinary imagination, but in this film, he did the same things again. I don't know if it's his trademark, but in some of Miyazaki's films, he only shows a certain part of the world he creates and finishes the movie without fully explaining the plot. It's as if we've entered a different universe for a short time and are watching random events that happen to occur. Nothing is specifically explained to us.Yes, it has always been enjoyable to watch the worlds created by Miyazaki's extraordinary imagination, but it bothers me that he finishes his films without filling in the gaps in the story. He did this partially in Howl's Moving Castle as well. By the way, this universe he created didn't draw me in as much as his other films did.Miyazaki's latest film can't even make it among the best. It lacks the awe-inspiring qualities of films like Castle in the Sky and Princess Mononoke. Still, it's a Miyazaki classic with its detailed animations and wonderful music. Although I experienced some disappointment, thank you for everything, Miyazaki.",
    "89": "The long-awaited \"The Boy and the Heron\" also known as \"How Do You Live?\" in the original translation has arrived internationally. What I really appreciate the most about this movie is it brings back several animations, styles, and characters from the majority of movies by Miyazaki, especially some of the references from \"Spirited Away\" and \"The Wind Rises.\"As it took about 7 years to create this movie, the amount of details, hidden messages, and hand-drawn animations can be seen for an enjoyable and complex 2-hour adventure. With the hand-drawn animation becoming rare as time goes by, it is indeed an honour to witness Studio Ghibli's consistent and pure work in this day and age.I recommend to pay the full attention from the beginning to the end in order to grasp the plot of the movie as well as subtle nuances that connect the characters because it is one of the complex Studio Ghibli movies.Honestly, this is a type of movie I am hesitated to give a score to it as it is so deep and can be interpreted in different ways depends on how you perceive it. It wasn't perfect, but it was a perfect way to put an end to what might be the last movie of the great Hayao Miyazaki.",
    "90": "Greetings again from the darkness. Fast approaching his 83rd birthday, legendary Japanese animator Hayao Miyazaki claims this is the final film of his illustrious career. In 2015, he was presented with an honorary Oscar, and he has had three films nominated for Best Animated Feature: THE WIND RISES (2013), HOWL'S MOVING CASTLE (2005), and Oscar winner SPIRITED AWAY (2002). His career in animation dates back to the early 1960's and this latest, which took six-plus years to complete, proves he is still amongst the best.A young boy's mother dies in a hospital fire during WWII. Mahito arrives to witness her become part of the flames - the first example of Miyazaki's method of creating occurrences that are outside the norm. Many of his films include childhood trauma, and a few years after the fire, Mahito and his father move to a new home where his mother's younger sister, Nutsuko, is to become his stepmother, while expecting a new child. Dad's factory, which produces fighter jet parts, is booming during the war, and Mahito rebels a bit due to grief and all the changes ... and has no appreciation for the titular gray Heron that's obsessed with him.A mystical tower on the grounds leads Mahito to an alternate world delicately balanced between the living and the dead. The intrusive Heron follows him, seemingly offering bad advice at most every step. On this journey, Mahito meets Kiriko, a great adventurer who takes him under her wing as he crosses paths with large hungry parakeets who sharpen their giant knives, and the Warawara, who are funny little creatures headed to life in another dimension - at least those that escape the pelicans. We understand who Kiriko represents, but it takes Mahito a while to catch on.Spirit animals and mysticism follow Mahito along the way, and the themes of life and death are mixed in throughout. Miyazaki offers a world teetering and with an uncertain future. The stories are inspired by his own life and the 1937 childhood book, \"How Do You Live?\" by Genzaburo Yoshino. Miyazaki co-founded Studio Ghibli, and he remains a true artist with his stunning and beautiful hand-drawn animation blended into a multi-faceted story. We learn Mahito means \"sincere one\", and his lesson here is that life is worth living and fighting through.Opening in theaters December 8, 2023.",
    "91": "As of this month, GKids has brought over the newest and \"final\" film from legendary animation director Hayao Miyazaki called The Boy and the Heron. Inspired by the 1937 novel How Do You Live? By Genzaburo Yoshino, the film has garnered critical acclaim and surprising high financial success since its initial release in Japan this past summer. As this film marks the return of Miyazaki following his second brief retirement, it should be no surprise that the film would garner phenomenal responses from all around the world. But how exactly did his return to glory pave out in the long run?Set during the Pacific War, the story focuses on a teen boy named Mahito Maki who moves to a new town following his mother's death. When Mahito discovers an abandoned tower near his new house, he enters a fantastical world with a talking grey heron. The best way to describe this film is Miyazaki's penultimate autobiographical work. When one takes the post war era of Japan into context, as well as elements of Miyazaki's own family coming into play, Mahito's story of wanting to see if his mother is still alive is truly heart wrenching yet emotionally powerful. While the film's fairly bleak first act may go on for a bit too long, the surreal fantasy elements ultimately make the story thoroughly engaging with how imagination Miyazaki and his team showcase on screen. It's mainly through worldbuilding that the feature is at its most enticing, as one will never know what strange creatures or universes Mahito and the talking heron will enter next. Add this on with parallels between Mahito's reality and the other worlds and you've got the kind of magical storytelling Ghibli is always known for.That all said, as breathtaking as the storytelling is, the characters might leave a little to be desired impact wise. Despite being the main focus, Mahito doesn't do much to express himself emotionally beyond his quiet nature, not helped by how little the film tries to explain how he feels about new family and life. Fortunately, the maid Kiriko dons a tough role to keep the protection of others first, and the grey heron himself transitions from foe to ally in a sardonically sweet manner. Other characters work well enough in their roles like the grandmaster keeping balance to the universe and the Parakeet King as he leads his blindly loyal minions. Perhaps the biggest letdown is how little was done to show more layers to Mahito's concerned father Shoichi or his pregnant fiance Natsuko. On a side note, audiences now have a choice to see the popular English dub with recognizable names like Robert Pattinson, Christian Bale, Florence Pugh, and more. Unless you'd prefer the authenticity of the original Japanese dub, there's certainly no harm in seeing these talented actors deliver some solid performances.Adding on to all of the story and character development is the gorgeous animation and art direction known for in Miyazaki's finest works. As the film contains many of the visual elements people would come to expect in a Hayao Miyazaki movie, many of the recognizable character designs and movements, background details, effects work and coloring come into play along with some beautifully naturalistic environments and gorgeously choreographed action. With how many different creatures inhabit all of the different areas in the surreal worlds, the variety of depictions stand out gorgeously from ordinary pelicans to anthropomorphic parakeets to simplistically charming beings. Any time the heron transforms or fire depicts Mahito's past trauma are visual highlights in themselves. Also, the return of longtime Miyazaki collaborator Joe Hisaishi lends some wonderfully poetic music throughout the feature, whether it be calm but harmonious or intense yet delectable. By blending reality with the fantastical, this film is exactly the kind of splendor we've come to hope for in any Studio Ghibli film.As thoroughly thought provoking as it is beautifully crafted, The Boy and the Heron proves itself to be a welcome return for one of the most beloved animation directors of all time. Whether or not people find this to be the best of Miyazaki's work, it nonetheless shows that there's always a light at the end of the tunnel in an otherwise problematic year for cinema. Now that 2023 is coming to a close, this film is a must watch for any filmgoer, especially since it's only playing in certain theaters nationwide. Here's hoping that a new era for this wonderous studio is on its way quite soon, be it from Miyazaki or others.",
    "92": "I don't want to say much.I just loved it. A beautiful movie. A beautiful dream. I was so anxious about that movie. I wanted to be perfect because I really love all his others films, but I couldn't expect that. To be honest, you have to watch it 2-3 times to understand it and leave the cinema without any plot holes. But who cares? I can watch Miyazaki all day long!It was like a summary of all of his movies, especially Howls moving castle and Spirited away.It's a beautiful way to say goodbye to the cinematography company and to all of us, his fans.It is not an easy movie, but it is a movie that makes you think .",
    "93": "\"The Boy and the Heron\" is an anime fantasy film written and directed by Hayao Miyazaki (\"Princess Mononoke\", \"Spirited Away\", \"Howl's Moving Castle\"). Featuring the voices of Robert Pattinson, Christian Bale, Florence Pugh, Mark Hamill, and Willem Dafoe, it exudes all the trademark Studio Ghibli charm in a way that calls back to some of their most notable films.In 1943 in Tokyo, young Mahito Maki (voiced by Luca Padovan) loses his mother in a hospital fire. A short time later, Mahito's father Shoichi (voiced by Christian Bale) remarries to his deceased wife's sister Natsuko (voiced by Gemma Chan), and the family are then forced to relocate out into the countryside. While trying to settle into his new life, Mahito is frequently visited by a grey heron (voiced by Robert Pattinson), who continues to bother him until Mahito follows him to a large abandoned tower. The heron then persuades Mahito to follow him into the tower where the pair soon find themselves on a journey throughout a fantasy world occupied by the living and the dead.Very few Japanese animation studios have achieved such a high level of recognition quite like Studio Ghibli. Widely considered to be on par with the likes of Disney in the west, Studio Ghibli have gone on to create some of the greatest anime films of all time, including \"My Neighbour Totoro\", \"Princess Mononoke\", and of course \"Spirited Away\", the latter of which I credit as the film that converted me into a fan of anime in the first place. At the helm of most of the studio's best work is Hayao Miyazaki, whose feature films have essentially made him the face of the entire company, to the point where he is sometimes called the Walt Disney of Japan (although he apparently hates this title). Despite constantly claiming that he is retiring, Miyazaki always seems to change his mind whenever a new project comes along and now in his 2023 film \"The Boy and the Heron\", we are shown a semi-autobiographical look at the filmmaker's life in a way that only he can truly convey.In classic Miyazaki style, the story is presented to us by means of a young hero being forced to navigate his way through a fantasy world unfamiliar to our own. We watch as Mahito struggles to move past the painful memories of losing his mother so suddenly, to the point where he is unable to interact properly with those around him. He is noticeably ambivalent towards his new stepmother, despite her friendly attempts to bond with him, and the other kids at his new school refuse to befriend him. Of course, what then sets things in motion is the grey heron, who speaks to Mahito about seeing his dead mother again, so long as he ventures deep into a mysterious, dream-like world that exists beyond human imagination.This whole set-up feels decidedly familiar, as it has been done before in other Miyazaki films like \"Spirited Away\" and \"Howl's Moving Castle\", but unlike those movies, here it is done with a more personal point of view. Reportedly, Miyazaki has used the character of Mahito as something of a self-insert to reflect his own experiences of overcoming his insecurities to create a better world for himself and others around him. To that effect, the film feels like a journey about growth and overcoming obstacles from Miyazaki's perspective rather than from a third party source. It is through this journey into a strange new world that Mahito, and indeed Miyazaki himself, is able to achieve this goal, and we the audience are privy to that.It should go without saying that Studio Ghibli films often look and sound amazing through their artistic merits, and this one has that in spades. Given the fact that almost all animated movies these days are done with CGI, it feels like a breath of fresh air to see a traditionally hand-drawn film that harkens back to the old days where this art style was the norm. Every visual frame of this film brims with so much personality that even something as simple as a character walking across rocks in a pond is wonderful to look at. Not to mention the water effects and transparency are on point, as was previously seen in Miyazaki's 2008 film \"Ponyo\". Additionally, the film's dramatic moments are expertly punctuated by Joe Hisaishi's poignant musical score. One scene where I think this stood out the most was where Mahito is observing an incoming attack by a group of pelicans, where a flourish of strings and flutes give off the impression that danger is looming. The combination of these beautiful visuals and moving musical cues help establish this film as one of the most artistically accomplished films in the Studio Ghibli filmography.However, one major thing that prevents the film from achieving classic status is its confusing narrative. While the story may seem simple enough on the surface, once the journey itself begins, things start to become difficult to comprehend at times. For instance, during the second act, a character may find themselves in a weird location where something strange will occur that you would assume affects the plot, only for it to cut away to another unrelated scene. Other times a scene will introduce a character for brief moment and then completely forget about them until much later on in the story. While things do eventually make more sense near the end of the film, it still had me scratching my head as to why Miyazaki chose to tell this story in such an unorthodox manner as opposed to a regular journey of self-discovery. It's worth mentioning that \"Howl's Moving Castle\" had a similar structural problem, so perhaps this is an intentional creative decision on Miyazaki's part in that he thinks this will prevent boredom in the viewer. If that's the case, then I suppose he has succeeded.Having only watched the English dub at the time of writing this, I can say that each of the voice actors did a nice enough job in their roles. Newcomer Luca Padovan is appropriately youthful as Mahito, a young man intended to serve as a composite version of Hayao Miyazaki himself. I can definitely see echoes of other Studio Ghibli protagonists in Mahito; he has the initial reluctance of living in a new place of Chihiro from \"Spirited Away\", the curiosity of Prince Ashitaka from \"Princess Mononoke\", and the altruistic nature of Pazu from \"Castle in the Sky\". Whether or not this combination of character traits is intentional or just a coincidence is a matter of debate, but for the most part I think it works in the film's favour.I was surprised to discover it was Robert Pattinson voicing the grey heron, as he uses a gravelly, unrecognisable tone that sounds nothing like his real voice. The heron is a comic relief character and an expositional guide to the mysterious world, and Pattinson manages to convince us he is capable of playing both. As for the other cast members, I think they were somewhat underused, especially Christian Bale as Mahito's father Shoichi and Willem Dafoe as a Pelican. I would have liked to have heard more from them but they aren't on screen long enough to leave any real impression. There are other actors in the cast that should have been used better as well, like Karen Fukuhara, Florence Pugh, Mark Hamill, and Dave Bautista, but since their main roles in the story contain spoilers, I will not discuss them at length here.Though it may not reach the same level as other classic Ghibli films, \"The Boy and the Heron\" is nonetheless a solid entry in the legendary studio's library and a worthy addition to Hayao Miyazaki's catalogue. The fantastic visuals are on point and the emotional musical score compliments every scene. After the release of each of his films since \"Princess Mononoke\", Miyazaki has repeatedly claimed he will be retiring upon their completion, only to change his mind later on and return to filmmaking. With that in mind, it's possible Miyazaki may have at least one more film in him before he retires for good, but considering he is now in his eighties, it is unknown what the future may hold for him. Regardless, If he's willing to make another movie for us, then I'll definitely be there to watch it.I rate it 8/10.",
    "94": "Loved it. The main character is always one step ahead of the audience and the movie does not hold your hand on exposition, choosing silence where it matters. This movie was also really touching. The strange world reminded me of a return to Spirited Away's fantasy. The pacing is excellent too, it felt like four hours packed into a two hour movie without overstaying its welcome. They show the beauty in the mundane, animating the smallest tasks and actions and linger on shots that are so nice to look at. I watched the English dub in a large theater and the cast, while stacked with Hollywood celebrities over leading industry VAs, did an amazing job. I couldn't recognize any of their voices and they really sold me on (most of) their performances. My friends and I stayed behind at the bar and digested the film together, talking about the themes and characters. It's a lot to take in and wrap your head around for a first watch, but it's a testament to optimism and spiritual growth. I can see this being transformative for anyone that may be missing a loved one and wishes they could spend another moment together. I'll have to watch it again subbed and see what else I can pick up on. Really, really enjoyed it.",
    "95": "No adjective other than fascinating is apt to describe my impression of The Boy and the Heron. In two hours, the movie touches upon topics of bereavement, youthful troubles, family, growth, morality, self-reconciliation, and so much more that seem to make the film vague and difficult to digest. And yet, it is also because of these uncertainties that the audience are allowed to interpret their own versions of the story, which is the magic of Studio Ghibli. Five minutes in, I feel myself swiftly captivated by the unique animation style and immersed in the rural Japanese greenery. Other than some pacing issues during the second and third acts, this is a film worth your time to experience.Hayao Miyazaki's artistry, Joe Hisaishi's music, and Studio Ghibli's animation have been a great part of my childhood. They belong to a generation of confusion and innocence, of battlefield and nature, of death and youth, which is very much remote from my own but also near and relatable. As a fan, there's nothing more touching than sitting down in a theater, waiting for the lights to dim, and seeing a screen-full of light blue with Totoro's image in the center. Thank you Studio Ghibli.",
    "96": "If this truly is Miyazaki's final film before he retires, then he succeeded in every way. You could not ask for a better curtain call. The Boy and the Heron is a stunning film with a beautiful message... and one that many of us struggle with.What I loved:The death of a parent is something that a young child should never have to experience. The Boy and the Heron explores the emotions of a child who struggles with the sudden loss of his mother, creating a magical journey for this boy to find the answers he seeks, and ultimately closure that he was denied by the tragic accident in the opening scene. I left the theatre a little choked up, I have to admit, the last 20 minutes really hit me as I started to understand the message. Closure, whether it be from a relationship or the death of a loved one, is something that many of us struggle with, and this film does a wonderful job exploring that.This is the first Studio Ghibli project that I was able to see on the big screen, and I was so, so impressed. The artwork and animation are breathtaking from the opening scene until the beginning of the final credits. While other Miyazaki films like Spirited Away and Princess Mononoke still hold up visually, The Boy and the Heron raises the ceiling on Studio Ghibli's animating powers exponentially. A total and constant immersion into another world.The score is perfectly paced to the film. Joe Hisaishi composes the feelings of joy, sadness, adrenaline, and hope to compliment the screenplay every step of the way. There are even a few tracks that have bene added to my Spotify playlist.I saw the English dubbed version and found the voice acting to be great. I was prepared to see this in Japanese with English subtitles, but the star-studded cast convinced me to go the dubbed route. I cannot say if one is better than the other, but I'm sure either choice will be totally fine.What I wish was done differently:Honestly, not much. Any critiques to the dialogue or plot are somewhat balanced by reminding myself that while this film will be enjoyed by all, it does have a younger audience in mind. I will add that a few scenes really frightened a few younger children that were in the same theatre as me... so consider that this movie leans much more towards Princess Mononoke than it does Ponyo before bringing your four-year-old along.All in all:The Boy and the Heron is neck and neck with Spirited Away for the best Miyazaki film, and definitely one of the best films of a stacked 2023. It was such a beautiful experience seeing this on the big screen, so please do so if you're able to.",
    "97": "We get it, you got doused with nukes back in the 40s. The result is this nonsensical child's brained stream of conscious garbage. Typical of Miyazaki who is celebrated as...God, please explain why he's celebrated? The story is hot steaming dog droppings. It's self-important and dull.A young man loses his Mom to a hospital fire and then he is somewhat adopted by his aunt who got knocked up by his Dad. There is something truly unexplained here. His soon to be Mom/Aunt disappears into the woods. And he goes to rescue her. Meanwhile he's being harassed by a heron. Which leads him into a world of other birds. Oof. It's dumb.His animation has never impressed me. Sure, he has a zen like quality that confuses college students that he is yoda, but none of it translate into storytelling. Imagine someone explaining their dreams to you. Yeah, it's that stupid.And I've watched his work in the past. Hoping this would be different. No, it's worse. It's truly boring stuff. Unless you dropping acid...like...maaaaaan. God I hate hippies. And psudeo-intellectuals. You aren't as smart as you think you are.",
    "98": "I loved My Neighbor Totoro and Spirited Away, but this one didn't grab me.I don't know what's so \"magical\" about the animation. Yes, it had some special effects, but overall the animation I would call choppy, not exceptional. I guess you guys have never seen The Incredibles.It's a story of a sullen boy who does not seem to have kindness, or a personality. I didn't care to root for him. And he's pulled through adventures without making his own choices, without agency. It reminds me of the first Harry Potter movie. The kid doesn't do things. Things happen to him. That's another reason not to root for him.And nothing makes any sense. Spirited Away and My Neighbor Totoro had, you know, a plot. I understood what was happening. I loved the new Godzilla Minus One with its WWII themes of Japanese life, so I'm not against the topic or foreign films with subtitles. I just found this boring.It seemed like every few minutes we got a disconnected scene with new characters of unknown intent. Some animals are friends and some you want to kill, and some are both? Some characters are kind, and some are cruel, and some are both? It's so weird and aimless seeming.And it's presented timidly, long pauses that don't seem earned by the plot and not enough supporting music. It's as though I'm supposed to come into the movie carrying my own awe instead of the movie earning my awe. It takes place during World War II but the war is hardly mentioned.I'm sorry. I guess I was supposed to like this, but I didn't.",
    "99": "I just watched the new Hayao Miyazaki (Studio Ghibli) film, at Circle Cinema, with my bro and his kids: \"The Boy and the Heron.\" I was frankly surprised when I heard Miyazaki was coming out with a new one, because he's been saying that he's directed his last film, for every film since \"Princess Mononoke.\" In the ten years since his \"The Wind Rises,\" I had finally believed it.But now, here we are, and I'm not only glad there's another Miyazaki film in the world -- but I'm especially glad it's THIS Miyazaki film, because it marks a return to the kind of big, fantastical, surrealistic epic that he hasn't really done since 2008's \"Ponyo.\" And as much as I did like \"Ponyo,\" it was definitely lighter fare, intended for the very young. \"The Boy and the Heron\" is easily Miyazaki's richest and most complicated film since \"Spirited Away\" and \"Mononoke.\" And I'll just stop there, because I hate to play favorites with a body of work which is so generally good.I like how Miyazaki's films frequently deal with children who are struggling to deal with real emotional pain -- and who do so without a lot of exposition. Their inner struggles become externalized, symbolically represented by the magical worlds which unfold around them. There's not a lot of exposition, and nobody talks too much about how they feel -- but in the sublime and artful way in which Miyazaki's characters deal with one another, and with the strange logics of the worlds they discover, we sense our young protagonists working things out. His animation is eternally optimistic in that way, and that is partly what makes it so beautiful.\"The Boy and the Heron\" inhabits this tradition of his work, and does it with a verve which feels classic, assured, and masterful, even as it continues to surprise with each fantastical new creation.A summary of the plot doesn't exactly do the film justice -- but it involves a boy, Mahito, whose mother is killed in a fire in Tokyo the early days of World War II. Although he didn't see her die, Mahito is still haunted by thoughts of his mother burning alive a couple years later, as his father introduces him to his pregnant new stepmom -- his mother's sister! -- and moves their family to the countryside.The film takes its careful time with these early scenes. We observe as Mahito tries to adapt to his new family-life, and his new life in the country. We see how hard a time he has at the rural school, and how the other boys don't like him -- possibly because his father runs the local factory. There is an incident of self-harm. Mahito is bedridden for a time, and tended to.Throughout these events, there have been hints of strange magic. A gray heron has been glimpsed -- and every time Mahito sees this bird, we glimpse some kind of grotesque new detail. Did that bird just flash a set of human TEETH? Does it have a NOSE hidden inside its beak? Was that a human EYE?One day, Mahito follows the heron into the woods, to discover a strange abandoned tower. The gaggle of old women who act as servants in his house warn him to stay away from the tower. The place is cursed, they tell him! The old man who built the place disappeared, leaving behind only his books! They whisper of dangerous tunnels and strange happenings.However, after his stepmom disappears -- and was last sighted slipping away into the woods -- Mahito knows exactly where to start looking.I really liked how this film took awhile with its opening scenes, immersing us in the reality of Mahito's life, and only ducking-away into the realm of magic in moments where we could be pretty sure Mahito was dreaming. This gives the film a \"magical realism\" quality, and I half-expected the film to stay mostly rooted in reality. I would have been satisfied with that, I suppose, because these early scenes are all quite lovely -- but I did wonder just how much \"magic\" to expect from the film.The answer, eventually, is... A LOT. There does come a point when the film tilts full-bore into an impressionistic, surrealistic exploration of new worlds and strange creatures and places where the living and the dead coexist. This stuff is EXCELLENT. And even if it does go on a little long, I relished every bonkers moment of it.There were too many hilariously bizarre moments to mention -- but my favorite might have been a bit involving gigantic, awkward, knife-wielding carnivorous parakeets. Yes, they are cute. And they will carve you up and eat you.True to his own legacy, Miyazaki uses all these elements largely to tell a story about how Mahito is finally able to come to terms with his mother's death, and accept his stepmom as his new parental figure.But there's more here, too, I think. In the God-like \"creator\" at the center of the film's magical tower, who tries to pass his legacy on to Mahito, one can't help but see a reflection of Miyazaki himself -- a creator of many worlds nearing the end of his life, struggling to keep his tower standing for just one more day at a time.Anyway, there's a whole lot to unpack in this film -- but it's also a joy to behold in the moment. My brother's kids (who are 11-13) loved it, got a little restless by the end and did complain that it felt a bit long -- but overall counted it among their favorite Miyazaki films. Personally, well, I would say that this one feels a little \"messier\" than some of his efforts -- as in, the story does wander a bit in the second half -- and yet, it's beautiful how it all comes together at the end, and ultimately, I can't consider it anything less than a work of art. It took my breath away.",
    "100": "This Japanese animation film presents the tale of a boy, coping with the loss of his mother in a disastrous fire, who finds an unexpected ally in an enigmatic gray heron who accompanies him in reaching another world inhabited by both the living and the dead. The two do not have the best chemistry but their alliance proves to be resilient in the face of what they encounter. After that, this film loses its ability to convey anything of substance.Unfortunately, this story feels distant too often because the narrative is sluggish to the point of being self-indulgent. There are certain plot threads that feel like distractions and at times threaten the film's overall coherency. I actually contemplated walking out of this film, which by now is very unusual. That's how frustrating it was in the early going. It improves somewhat as it progresses with a colorful palette. But the lively imagery cannot do it all. At the core, something is missing. It doesn't connect emotionally, not for me anyway. It's all very nice to look at and there is a soundtrack, which although pretty spare, is quite good. However, the underlying substance is not there and therefore it's difficult to get invested in this story.Critical praise for this film is universal. But here, I dare say the emperor has no clothes. Don't believe the hype. A film that looks great also has to touch something deeper. It left me cold and had me looking at my watch more than once. Not recommended.",
    "101": "The movie starts out with the beginnings of a pretty straightforward plot but quickly launches into an imaginative but abstract fantasy world. While each scene was visually interesting and some were quite beautiful, I was simply completely lost, not knowing what I was watching.The scenes quickly came and went with almost nothing explained, events seemed random, there was no clear plot, or characters, or story line, or emotional connection or development. It was like flipping through an artist's sketchbook, it felt like 50 two to three minute animation sequences that were related only by having similar style. Or like watching a long fever dream that came in dozens of separate scenes.It was hard to even pay attention, my wife fell asleep during the movie, a few people left the theater before the end, as we almost did. It would have been fine for 15-20 minutes but to sit through over 2 hours was torture. I am honestly perplexed by the positive reviews that call this a masterpiece or really even watchable. Perhaps there is a mythology or folklore that everyone else is aware of that somehow ties it all together? I understand that Miyazaki has a great reputation but this artistry is too abstract and unreliable for me.",
    "102": "The Boy and the HeronSpoiler Free versionAs a Miyazaki fan, I knew that I was going to be in for a ride into the surreal, and boy I was not disappointed. The animation, as per usual, varied from standard human depictions, to gigantic out of proportion animals. I'm a little saddened that the English title was changed from \"How Do You Live?\" to the Boy and the Heron. The original translation makes so much more sense and offers a stronger sense of the themes portrayed. The title question could be asked of nearly every character you encounter, and each has a different answer due to their circumstances.I absolutely loved this film. Our main character goes on a magical journey on a quest to see if his mother survived a brutal fire during the Second World War in Tokyo. I can't say much more than that without revealing the twists and turns, and I mean that literally. Your senses will be turned upside down, and I hope you like birds.I recommend seeing this in the original Japanese, even if you don't speak the language. It seemed more authentic, but I'm biased after decades of watching anime with subtitles.One of the biggest mistakes people make in America about animated films is the assumption that animation = children. This is not a movie for children. There is quite a bit of scary imagery and a lot of plot points that are not meant for younger children.",
    "103": "The Boy And The Heron, directed by Hayao Miyazaki is a very unique Japanese film. The amazing high quality sound effects and suspenseful background music are spectacular. However, this film does get confusing very quickly.This semi-autobiographical animated movie follows the story of young Mahito Maki (Soma Santoki), who tragically loses his mother in a fire and moves to the country with his dad Shoichi (Takuya Kimura) and his step-mom Natsuko (Yoshino Kimura). Action soon rises after Mahito interacts with a talking gray heron (Masaki Suda) who is revealed to be a shapeshifting avian guide. The gray heron alludes to Mahito's mother still being alive and Mahito goes on a journey to find her.The sound effects in The Boy And The Heron enhance the film tremendously. Even though this film is animated the sound effects make it seem almost as if it is a live action film. From realistic deep footsteps to the realistic sounds of crashing ocean waves; sound director Kôji Kasamatsu absolutely brought this movie to life. I also enjoyed the background music throughout this film. The music by Joe Hisaishi creates suspenseful and surprising moments that kept me engaged throughout my viewing experience. My favorite scene in the movie is when Mahito and a fisherwomen named Kiriko (Kô Shibasaki) watch the Warwara (creatures whole embody both life and death) be released into the normal world. The music is beautiful and creates a sense of awe and wonder. Who could forget the gorgeous animation by the world renowned animator Hayao Miyazaki? Every scene in this movie is animated to perfection. For example, when Mahito first enters this new world he lands on an island surrounded by a vast deep blue ocean and stormy clouds. The ocean waves crash very fluidly and the clouds are different shades of purple and move very realistically. The detail and fluidity of the animation does not go unnoticed. As much as I like this film, I did find it somewhat confusing. Over the course of two hours we primarily follow the main character searching for his mother, but this plot is somewhat drowned out by many other side plots taking place, which makes things murky and difficult to track.The film's message is to not let grief hold you back and to find different healthy ways to move on. However, this film delivers this message in a very confusing way. It's important to note that this movie contains mentions of self-harm, minor cursing, gore and small jump scares that could be frightening to younger audiences.I give The Boy And The Heron 3.5 out of 5 stars and recommend it for ages 12 to 18, plus adults. It releases in theaters December 8, 2023. Make sure you give it a watch! By Tia O., KIDS FIRST!",
    "104": "LIKES:The Animation: Most of the Time\n-Miyazaki and his studio know how to make things come to life and at opportune moments, that animation style is solid.-Moments of running are beautifully pulled out, 2-D animation coming to beautiful details, fluid, colorful, crisp, and downright gorgeous with the colors designed.-His movement with water based themes still blows my mind, the melting, the flowing, and the chaos so good and in this movie, it's fleeting but still incredible to see such physics captured in the art.-Other elements of anthropomorphized birds are fun, comical, and yet at times deadly, holding more character than the actual character themselves.-And what looks like computer like animation manages to merge well when the time calls for it, granting shading and ominous tones to the big bad stones.The Humor\n-It's odd at times, but once more, his movie holds humor that is earnest, fun, and quite arguably very spot on for delivery.-Heron man in particular is my favorite, his voice alone is very humorous, but his sarcasm, hedonism, and his nihilism work in contrast to the hopes of the others and like Squidward has that finesse that optimizes laughs.-While Mahito is funny in terms of the random things he says focusing more on just absurd disbelief and incredibility as if searching for a way out of a dream.The World Building/Design\n-My favorite aspect in this movie is the way he has designed the worlds and tones of this era of Japan, but at times pulled the lore and legends to make a twisted fantasy world that was awesome.-Starting with the real world, Miyazaki brings his touch of genius to making reality fun and engaging. Vivid colors lead the pack in nature, only offset by the muddied and muddled tones of the inside of the human house. That contrast alone almost tells a story on its own, but a fantastic introduction.-Then once you get into the world by the heron, the proverbial white rabbit, the art changes dynamics and accomplishes much, coming together in ways II did not anticipate.-What looks like Renaissance paintings at times overlays with his animation style, but never to the point of interrupting as background and foregrounds play together in an almost painting meets cartoon exchange.-Use of light is sensational in the tones it tells, sometimes being so bright I had to squint to help keep my eyes from tearing, and other times focusing on shadows as if they are to be swallowed and muted from their personalities.-And the contrast is brilliantly applied to make emotion and engage the atmosphere of the character, all while still having that cute little twist despite the darker elements Miyazaki incorporates in his work.-All in all, that was the most beautiful aspect of the movie, and by far the most engaging of the works I have seen in a long while.The Morals:\n-The movie is a big look at life and character studies in handling darker elements of said life.-The Boy And The Heron takes a deep look at the ideas of escapism vs. Reality, choices, friendship, and the very nature of rule abiding vs. Not, all in the concept of having the audience sort of look at themselves.-It's hard material, which is kind of exciting, as they explore cultures. Self-reflection really being the name of the game as art, visuals, and story come together into one dynamic and have you think in detail is it worth it.-So those wanting that kind of experience and \"elevated\" storytelling are going to really enjoy this movie given that very nature.DISLIKES:The Animation Sometimes\n-Despite the master's work, there were some earlier issues for me at the start of the movie that looked like glitches or dips in animation.-My eyes thought I saw paused frames, some skips, and several times very blocky and slow animation. Potentially due to how limited current animation is in cartoons, I might have just adjusted to what they were showing.-Is it the worst? Not for me it isn't. Just something that I noticed didn't quite flow as smoothly as his other works, at least until you get to about a quarter of the movie in and the animation picks up in movement and speed.The Story Is Less Adventure/More Life Philosophy\n-This is the part that is going to be a mixed bag depending on what type of story you like\n-I can handle elevated thoughts and tales, but it doesn't mean I want it for every movie, sometimes still wanting that traditional Miyazaki adventure.-The Boy and the Heron is very metaphorical, and abstract at times. A linear movement being we are just moving away from the entrance, but otherwise is a scattered and hasty tale.-We crash, bump and bash all over the place in search of answers, the goals and wording odd as to what we are actually trying to accomplish given how the goals seems to change, layer, and feel very randomly added at the most random times.-So much lore is built up in those moments, almost feeling like the movie is a part one to something bigger. Yet it sort of just tapered out, sort of merging with the grand plot of what is wrong with the world and the life testing story with it.-While this touch on reality may be refreshing, and it has that Miyazaki presentation, it just doesn't have the same merit of adventure that Spirited Away, Moving Castle, and others had for me in that spark.-So depending on the style of your story this may not be your most engaging tale.Little Antagonism\n-Again, Miyazaki has crafted some monsters, villains, and beasts that are the very destructive nightmares that plague our dreams.-And this one's antagonism is more so the philosophical components and psychological strain of life than an actual villain that is menacing, threatening, or even present.-At first you might have your thoughts of the Heron being the big baddy, only to abruptly change to something more lurking in the shadows, the Heron sort of dropping into the background.-Even a late entry to the game had some inkling of being good, but again, a very mundane villain, who aside from swipes of a weapon, is more of that classic telenovela yelling in Japanese form.-Things just felt like they were missing, these disjointed connections lacking integration and timing to really connect with these characters or the investment into their inclusion.-Again, elevated storytelling has its moments, but for viewers like me, the lack of a central villain, or even any physical antagonist with merit is a missed opportunity to help add some pep to this tale.Depressing and Weird\n-And for those not ready to handle a very sobering movie, you aren't going to want to see this film.-This tale has a lot things to face, sort of like a prophecy meets dealing with the past and moving forward. While this is handled beautifully in vision and telling, the material is again a tough thing to handle given the context.-And adding that weird lack of villain and Miyazaki's imagination, the movie just has this odd angle that feels out of place and sort of enhanced the depressing story.-Ambling around from storytelling, not really having time to relieve ourselves from the weight of this tale, which can sometimes be so encompassing that it took joy from the movie for me.-I guess that's the point, but so many other depressing movies have relieved the sadness with some means in terms of adventure or a festive banquet. Something only the colors and some interludes of humor accomplished for me.The VERDICT:\nThe latest animation film is a movie that has a spectacle that is beautiful to watch and unfold. Fans of Miyazaki, I feel, will enjoy the ride in terms of that art style and animation coming to life, his weird characters and designs like an Alice in Wonderland that blends styles together. The way his animation tells so many stories by itself, and emphasizes emotions is my favorite aspect of it, conveying the emotions and ideas in this moral heavy tale and helping one reflect. But while this metaphorical story is unique, breathtaking, and quite honestly beautiful, it's also a tale that is not as thrilling, exciting, or engaging as I had hoped. A strong opening act of lore building and foreshadowing sort of got lost for me, and a lack of a strong antagonist, linear story or even goal was hard to keep my attention. Depressing content like this could have used reprieve, some thrills, or another method to break through the heavy life reflection, or perhaps not edit as much, as something feels off in terms of a complete tale. The emotional pieces do keep their momentum though, and are the very blood of this movie with the animation, but I think several other films in his tale vaults hold the better balance and masterpiece for me.My scores for this film are:Animation/Adventure/Drama: 7.5-8.0\nMovie overall: 7.0.",
    "105": "We don't get to choose nothing before we are born. We are given a chance to be here and now in a certain period of time within a certain family which tries their best for us and they manage in the way they can.We all go through better and worse moments and I feel the key take away from this film is to make us think how do we behave when things don't go according to plan and life is tough.Do we get stuck into ruminating how unfair life can be and bring negativity to ourselves, or do we try to have a go and change things for the best no matter how ugly everything else is around?We are here today so we can have a real impact into making our surroundings a better place.I think this is what Mahito's story is about.Also, the music is beautiful.Thank you so much Studio Ghibli!!!",
    "106": "The Boy and the Heron is worth your time. As a matter of fact, it is worth at least one more viewing if not more. If you enjoy multifaceted dream worlds from which the viewer gets the sense there's more \"behind the curtain,\" then this is your movie.Yes, the animation is astounding. It brings a tear of joy to my eye to think Ghibli can still do hand-drawn animation at this point in film history and have a hit film. I also know Miyazaki would have it no other way. However, let us not ignore the beautiful score of this film. Joe Hisaishi is an already established master film composer, but I think the score here elevates the film because it is doing what I think the film is doing-that is, it's built around simple ideas that are actually not that simple at all because there are other layers at work behind the scenes. I cannot say more or I'll spoil the film.Finally, I do not believe it is a \"jumbled mess of ideas\" as I saw one reviewer say. This film is a slow-burn experience, and it can be overwhelming, but I was never under the impression that it was thrown together. I felt I was being led by masterful hands.See it, get moved, get confused, get lost in it, and then see it again and start to understand it. Don't miss real artistic brilliance when it appears.",
    "107": "At one point in the film the heron realizes he's been speaking too much and says (in the subtitled version), \"Loose lips sink ships,\" which is an expression from WW2 propaganda. I have no doubt an equivalent reference was already there in Japanese, and it helped me realize how much Mahito's adventure was a metaphor for the war, something which becomes more explicit toward the end.At the same time and as in the best of Ghibli the story draws heavily and very adroitly from old-style myths, fables and fairy tales (even featuring the much maligned stepmother, or amusing little grannies instead of dwarves), which are essentially the same the world over. The film stays true to fairy tales' tough and disturbing \"graphic\" content, deep and complex psychological import and comment on our place and role in the world and the human experience (the original title translates as \"How do you live?\", from a 1930s novel). This is still a modern fairy tale, however, and so it gets translated in modern idiom as a coming of age narrative about a child facing a terrible reality and in need of escape (but the kind of healthy escape from the prison of reality that Tolkien was talking about).The world he sets out to explore is like a dreamscape into a collective, mythical subconscious, and so makes little sense in a purely rational manner (even less than some of Miyazaki's earlier films). The narrative makes little effort to explain everything, which might frustrate the rationally inclined but which also promises to reward subsequent viewings and, well, thinking (dreaming?) about it. The ending is pretty abrupt, especially compared to a first act that takes its sweet little time, but I feel this is part of the film's refusal to offer a neat and tidy narrative package, with a nice little bow on top of it. Like dreams, or fairy tales, this is a maze, but one which leads somewhere if you only care to go to the trouble of exploring it.The ambitious narrative cleverly weaves all this with its running commentary on the war (the flying squad of pelicans eating souls in the night sky, the tower built at the beginning of the Meiji era as a metaphor for Imperial Japan, the martial king of the parakeets). This makes \"The Boy and the Heron\" into a sort of culmination for Miyazaki's work as it brings together all of his career-long preoccupations and themes (WW2 was brought to the foreground in \"The Wind Rises\", which focused on a character who made war planes, like Mahito's, and in fact Miyazaki's, father). It is also reminiscent of other Ghibli films, including (early on) Isao Takahata's devastating masterpiece \"Grave of the Fireflies\" (another director who was a child during the war) or the more recent \"When Marnie Was There\", which shares a somewhat similar premise. But mostly this is an unmistakably Miyazaki film, with a girl as a supporting character who would have been the heroine in another of his films, and where even the inevitable cuddly little creatures (the warawara) bring poetry and a thoughtful comment about the circle of life and death.Sadly some people cannot help themselves and will unfavorably compare this to \"Spirited Away\", because they just want more of the same. Such people do not deserve such a film as \"The Boy and the Heron\" and everything it can bring them. Their loss.",
    "108": "Rating: 7.2\nOverall, a very beautiful movie with its animation and score as it feels more like an art piece than an actual story, which is telling given how poorly constructed the plot is with its slice of life first half and plot-heavy/rushed second half.Pretty Good Direction (Does a very good job on a grand scale as he builds these vast mystical worlds that are worth exploring; the direction of actors is very good as he does a good job in creating both animated and grounded characters; the storytelling for this movie is pretty lacking as the first half slice-of-life style clashes with the very plot-heavy style in the second half to where it is a bit confusing on what is actually going on), Good to Very Good Voice Acting (Very Good from Soma Santoki (Really embodies the character and carries the movie on both an innocent and ambitious level), Great from Masaki Suda (Really brings to life this animated, yet important character), Good from Aimyon, Good from Yoshino Kimura, Good from Shohei Hino, Good from Ko Shibasaki, Good from Takuya Kimura, Good from the rest of the cast (Everyone plays their role well as they help bring to life such an animated, mysterious world through their characters)), Pretty Bad to Decent Story (The concept is decent (but just feels very similar to Spirited Away to where it doesn't feel that unique); the story construction is bad because the second half crams in too much plot since the first half is very slice of life, and this makes it hard to follow what's going on and what is actually important; the storytelling is pretty bad because there isn't any flow between the scenes (especially in the second half); the character writing is good as we do get to see the internal conflict of the main character as he uses this journey to get over the loss of his mother, and the minor characters do their job in buttressing this journey), Good Screenplay (The dialogue flows very nicely and is typical in style to other Studio Ghibli movies; the attempts at humor were good and did a good job at lightening the mood; symbolism is pretty prevalent (with themes about a post-WWII Japan and dealing with loss handled well); the foreshadowing was pretty standard), Very Good to Great Score (Used very well throughout the movie to help establish the tone and feel (feels very similar in style to Hisaishi and Miyazaki's other collaborations)), Good Sound (Helped create this magical and mysterious world), Good Editing, Great Animation (The best part of the movie as Miyazaki does an amazing job at creating these beautiful worlds as the movie is more of an art piece than a story), Plot Structure was the biggest issue for the movie as the exposition takes up too much time to where the rising action is incredibly rushed and there is practically no climax; the runtime should've stayed the same but some of the exposition should have been redistributed to the rising action to help strengthen the conflict and the storytelling, Pacing was very slow in the first half (because it is very slice of life) and very fast in the second half (as it tries to make up for time lost), Climax was incredibly disappointing as it just feels very anticlimactic and rushed (more of an afterthought than a pivotal scene), Tone was very similar to Spirited Away (sharing themes with other Japanese animated films with also having coming-of-age/supernatural themes)",
    "109": "Opinion on the anime «The Boy and the Heron» (2023):On December 7, Hayao Miyazaki's new animated work entitled «The Boy and the Heron» will be released in Russia.Yesterday I was lucky enough to watch this film 4 days before the all-Russian premiere.To begin with, «The Boy and the Heron» was the first anime I watched from Hayao Miyazaki.I started expecting this anime after the first announcements as well as after watching the trailer.What can I say about this tape? Did my expectations come true? Let's find out!«The Boy and the Heron» - is a beautiful, magical fairytale story about how our world is not perfect, but you should not despair because of this, but you need to enjoy every day in your life, no matter how difficult it is.I liked the plot, it was not simple and surprisingly did not seem clichéd to me, although it may seem more to people than I have, on the contrary, it will seem so.The story fascinates from the very first frames and does not let you go until the very end; the 124-minute running time is easy, interesting and magical.The animation, as in Miyazaki's previous films, was top-notch, I would like to note the colorful backgrounds, well-designed worlds and excellent character design.I also liked the original soundtrack by Jo Hisaishi; the compositions perfectly matched what was happening on the screen.As a result, «The Boy and the Heron» - is an excellent, exciting, two-hour adventure that will appeal to teenagers and adults alike.I give this anime a 10 out of 10 and advise you to watch it!",
    "110": "I'm going to start off by saying, I have seen this movie twice, both times at my local movie theater I watched it in Japanese with subtitles, and I felt amazed, confused, and I felt for the struggles of the main character, Mahito, who deeply misses his mother after something tragic happens to her. I felt invested in this movie from start to the end. Mahito is kind of subdued, he doesn't say much during a good chunk of the movie at the start. Mahito and his father and new mother move to a house in countryside outside of Tokyo, that's where he first meets a mischievous, heron, who you can't quite tell if he is a friend to Mahito or what he is actually up to, for me it seemed like The Heron's true intentions kept changing, shifting throughout the film. The Boy and Heron covers lot of topics, grief, dealing with loss of a loved one, the trauma dealing with that, and how to come to a point , where you try to keep living and trying to enjoy life still, still deaing with the hurt, that Mahito is dealing with, from his dreams of his mother in the fire. The animation in this movie is just superb, top notch. I like computer animated films. However the hand drawn amination in this movie to me, has a like a storybook look to it, which makes it extra special I think. Yes there are parts of this movie, that don't make sense, that are lot of odd, strange things that take place when The Heron takes Mahito to another world for a certain reason. That other world they visit, is really beautifully animated. Lots of scenes would like to replay when I own this on digital. Some terrifying moments happen , some really strange happenings take place. I think this movie is worth seeing. For any fans of Studio Ghibli past films or fans of original animated movies that take you on journey full of strange characters and a movie that has strong emotional weight to it, I recommend., two thumbs up.",
    "111": "Eh... wait for it to come out rather than seeing it in theaters. If you don't have any prior knowledge on Miyazaki's life or other ghibli films it'll be a lot harder to understand or enjoy. It's a movie for a very niche/small audience, which for that audience is great, but it doesn't really work as a stand-alone film. (I enjoy some ghibli films but my knowledge on Miyazaki is very minimal so my friend had to explain to me afterwards that it was very autobiographical in a lot of aspects)\n1) One really big complaint I had was there were new variables/characters introduced like every 20-30 minutes which becomes exhausting after a while because you can't tell which variables are important and which ones are just kinda there to look cool. Really muddied up the story.2) As much as I honestly couldn't stand sitting in that chair anymore and thus wish I didn't wanna think this, the movie could've been longer. It felt like Miyazaki tried to cram way too much into a 2 hour movie and the ending was very abrupt. If someone told me the studio ran out of money and they had to just kinda end it, I'd believe it.3) I get that the animation and visuals and score were amazing, but art doesn't trump story and if you have to hide behind the visuals and sound for your movie to be passable then... it probably means it's not very good.In a nutshell, it felt more like a studio ghibli asmr compilation than a story-driven adventure that Miyazaki usually brings to the table. As talented as he is I definitely think it's time for him to pass the creative baton onto someone else. It's clear he's run out of ideas.",
    "112": "The story is complex and metaphorical it's definitely not everyone's cup of tea. First time I watched I was amazed by the drawings and and the ever enchanting music. It is made ina way that you can not tell apart if everything that happened was in mahito's(hayao miyazaki's) head or real the ending was beautiful and leaves us wondering. It reminded me of my childhood when I used to visit my grandparents. The reason I said it's not for everyone is that it's not a very straightforward movie most will miss the depth of the story. I brought some of my friends hoping they will get to have an amazing experience like I did only to be amazed at their disappointment. All they could see was a weird movie with a few funny scenes and a weird ending. They can't be blamed either, however good a book is int the hands of the wrong audience it will be treated as garbage. Made me wonder if I have treated great books as garbage cause of my own ignorance. All I can say is that watch it with as much open mind and curiosity as you can. For me this movie was nostalgic landmine to my childhood and a flim filled with the writers memories and imagination as well as few life lessons small as they might be considered, valuable ones. Hope you have good time as well.",
    "113": "This is the best animation I have seen from Ghibli yet. It's a complete feast for the eyes. I haven't yet learned whether and to what extent they used CGI, but even if they did, wow. Like the best video game you have ever seen. Lots of the scenes could turn into stills suitable for wall hangings.Now for the story: Very, very strange. Which makes sense, as there is a lot of autobiographical imagination going one. But I think back to the first time I saw Spirited Away. I was like, \"What is happening?\" The movie has lots of bewildering moments without really any explanation connecting them. I personally like that, but a typical American viewer might not.There is also so much going on and so many mini climaxes and denouements, that it makes the two hours feel like four. Best to watch this one during the day, but make sure it's on a big screen.Seven for the story and ten for animation equals nine. Just like things don't always make sense in the Ghibli universe, that's how math works in my world.",
    "114": "I just watched the new Hayao Miyazaki (Studio Ghibli) film, at Circle Cinema, with my bro and his kids: \"The Boy and the Heron.\" I was frankly surprised when I heard Miyazaki was coming out with a new one, because he's been saying that he's directed his last film, for every film since \"Princess Mononoke.\" In the ten years since his \"The Wind Rises,\" I had finally believed it.But now, here we are, and I'm not only glad there's another Miyazaki film in the world -- but I'm especially glad it's THIS Miyazaki film, because it marks a return to the kind of big, fantastical, surrealistic epic that he hasn't really done since 2008's \"Ponyo.\" And as much as I did like \"Ponyo,\" it was definitely lighter fare, intended for the very young. \"The Boy and the Heron\" is easily Miyazaki's richest and most complicated film since \"Spirited Away\" and \"Mononoke.\" And I'll just stop there, because I hate to play favorites with a body of work which is so generally good.I like how Miyazaki's films frequently deal with children who are struggling to deal with real emotional pain -- and who do so without a lot of exposition. Their inner struggles become externalized, symbolically represented by the magical worlds which unfold around them. There's not a lot of exposition, and nobody talks too much about how they feel -- but in the sublime and artful way in which Miyazaki's characters deal with one another, and with the strange logics of the worlds they discover, we sense our young protagonists working things out. His animation is eternally optimistic in that way, and that is partly what makes it so beautiful.\"The Boy and the Heron\" inhabits this tradition of his work, and does it with a verve which feels classic, assured, and masterful, even as it continues to surprise with each fantastical new creation.A summary of the plot doesn't exactly do the film justice -- but it involves a boy, Mahito, whose mother is killed in a fire in Tokyo the early days of World War II. Although he didn't see her die, Mahito is still haunted by thoughts of his mother burning alive a couple years later, as his father introduces him to his pregnant new stepmom -- his mother's sister! -- and moves their family to the countryside.The film takes its careful time with these early scenes. We observe as Mahito tries to adapt to his new family-life, and his new life in the country. We see how hard a time he has at the rural school, and how the other boys don't like him -- possibly because his father runs the local factory. There is an incident of self-harm. Mahito is bedridden for a time, and tended to.Throughout these events, there have been hints of strange magic. A gray heron has been glimpsed -- and every time Mahito sees this bird, we glimpse some kind of grotesque new detail. Did that bird just flash a set of human TEETH? Does it have a NOSE hidden inside its beak? Was that a human EYE?One day, Mahito follows the heron into the woods, to discover a strange abandoned tower. The gaggle of old women who act as servants in his house warn him to stay away from the tower. The place is cursed, they tell him! The old man who built the place disappeared, leaving behind only his books! They whisper of dangerous tunnels and strange happenings.However, after his stepmom disappears -- and was last sighted slipping away into the woods -- Mahito knows exactly where to start looking.I really liked how this film took awhile with its opening scenes, immersing us in the reality of Mahito's life, and only ducking-away into the realm of magic in moments where we could be pretty sure Mahito was dreaming. This gives the film a \"magical realism\" quality, and I half-expected the film to stay mostly rooted in reality. I would have been satisfied with that, I suppose, because these early scenes are all quite lovely -- but I did wonder just how much \"magic\" to expect from the film.The answer, eventually, is... A LOT. There does come a point when the film tilts full-bore into an impressionistic, surrealistic exploration of new worlds and strange creatures and places where the living and the dead coexist. This stuff is EXCELLENT. And even if it does go on a little long, I relished every bonkers moment of it.There were too many hilariously bizarre moments to mention -- but my favorite might have been a bit involving gigantic, awkward, knife-wielding carnivorous parakeets. Yes, they are cute. And they will carve you up and eat you.True to his own legacy, Miyazaki uses all these elements largely to tell a story about how Mahito is finally able to come to terms with his mother's death, and accept his stepmom as his new parental figure.But there's more here, too, I think. In the God-like \"creator\" at the center of the film's magical tower, who tries to pass his legacy on to Mahito, one can't help but see a reflection of Miyazaki himself -- a creator of many worlds nearing the end of his life, struggling to keep his tower standing for just one more day at a time.Anyway, there's a whole lot to unpack in this film -- but it's also a joy to behold in the moment. My brother's kids (who are 11-13) loved it, got a little restless by the end and did complain that it felt a bit long -- but overall counted it among their favorite Miyazaki films. Personally, well, I would say that this one feels a little \"messier\" than some of his efforts -- as in, the story does wander a bit in the second half -- and yet, it's beautiful how it all comes together at the end, and ultimately, I can't consider it anything less than a work of art. It took my breath away.",
    "115": "This Japanese animation film presents the tale of a boy, coping with the loss of his mother in a disastrous fire, who finds an unexpected ally in an enigmatic gray heron who accompanies him in reaching another world inhabited by both the living and the dead. The two do not have the best chemistry but their alliance proves to be resilient in the face of what they encounter. After that, this film loses its ability to convey anything of substance.Unfortunately, this story feels distant too often because the narrative is sluggish to the point of being self-indulgent. There are certain plot threads that feel like distractions and at times threaten the film's overall coherency. I actually contemplated walking out of this film, which by now is very unusual. That's how frustrating it was in the early going. It improves somewhat as it progresses with a colorful palette. But the lively imagery cannot do it all. At the core, something is missing. It doesn't connect emotionally, not for me anyway. It's all very nice to look at and there is a soundtrack, which although pretty spare, is quite good. However, the underlying substance is not there and therefore it's difficult to get invested in this story.Critical praise for this film is universal. But here, I dare say the emperor has no clothes. Don't believe the hype. A film that looks great also has to touch something deeper. It left me cold and had me looking at my watch more than once. Not recommended.",
    "116": "The movie starts out with the beginnings of a pretty straightforward plot but quickly launches into an imaginative but abstract fantasy world. While each scene was visually interesting and some were quite beautiful, I was simply completely lost, not knowing what I was watching.The scenes quickly came and went with almost nothing explained, events seemed random, there was no clear plot, or characters, or story line, or emotional connection or development. It was like flipping through an artist's sketchbook, it felt like 50 two to three minute animation sequences that were related only by having similar style. Or like watching a long fever dream that came in dozens of separate scenes.It was hard to even pay attention, my wife fell asleep during the movie, a few people left the theater before the end, as we almost did. It would have been fine for 15-20 minutes but to sit through over 2 hours was torture. I am honestly perplexed by the positive reviews that call this a masterpiece or really even watchable. Perhaps there is a mythology or folklore that everyone else is aware of that somehow ties it all together? I understand that Miyazaki has a great reputation but this artistry is too abstract and unreliable for me.",
    "117": "The Boy and the HeronSpoiler Free versionAs a Miyazaki fan, I knew that I was going to be in for a ride into the surreal, and boy I was not disappointed. The animation, as per usual, varied from standard human depictions, to gigantic out of proportion animals. I'm a little saddened that the English title was changed from \"How Do You Live?\" to the Boy and the Heron. The original translation makes so much more sense and offers a stronger sense of the themes portrayed. The title question could be asked of nearly every character you encounter, and each has a different answer due to their circumstances.I absolutely loved this film. Our main character goes on a magical journey on a quest to see if his mother survived a brutal fire during the Second World War in Tokyo. I can't say much more than that without revealing the twists and turns, and I mean that literally. Your senses will be turned upside down, and I hope you like birds.I recommend seeing this in the original Japanese, even if you don't speak the language. It seemed more authentic, but I'm biased after decades of watching anime with subtitles.One of the biggest mistakes people make in America about animated films is the assumption that animation = children. This is not a movie for children. There is quite a bit of scary imagery and a lot of plot points that are not meant for younger children.",
    "118": "The Boy And The Heron, directed by Hayao Miyazaki is a very unique Japanese film. The amazing high quality sound effects and suspenseful background music are spectacular. However, this film does get confusing very quickly.This semi-autobiographical animated movie follows the story of young Mahito Maki (Soma Santoki), who tragically loses his mother in a fire and moves to the country with his dad Shoichi (Takuya Kimura) and his step-mom Natsuko (Yoshino Kimura). Action soon rises after Mahito interacts with a talking gray heron (Masaki Suda) who is revealed to be a shapeshifting avian guide. The gray heron alludes to Mahito's mother still being alive and Mahito goes on a journey to find her.The sound effects in The Boy And The Heron enhance the film tremendously. Even though this film is animated the sound effects make it seem almost as if it is a live action film. From realistic deep footsteps to the realistic sounds of crashing ocean waves; sound director Kôji Kasamatsu absolutely brought this movie to life. I also enjoyed the background music throughout this film. The music by Joe Hisaishi creates suspenseful and surprising moments that kept me engaged throughout my viewing experience. My favorite scene in the movie is when Mahito and a fisherwomen named Kiriko (Kô Shibasaki) watch the Warwara (creatures whole embody both life and death) be released into the normal world. The music is beautiful and creates a sense of awe and wonder. Who could forget the gorgeous animation by the world renowned animator Hayao Miyazaki? Every scene in this movie is animated to perfection. For example, when Mahito first enters this new world he lands on an island surrounded by a vast deep blue ocean and stormy clouds. The ocean waves crash very fluidly and the clouds are different shades of purple and move very realistically. The detail and fluidity of the animation does not go unnoticed. As much as I like this film, I did find it somewhat confusing. Over the course of two hours we primarily follow the main character searching for his mother, but this plot is somewhat drowned out by many other side plots taking place, which makes things murky and difficult to track.The film's message is to not let grief hold you back and to find different healthy ways to move on. However, this film delivers this message in a very confusing way. It's important to note that this movie contains mentions of self-harm, minor cursing, gore and small jump scares that could be frightening to younger audiences.I give The Boy And The Heron 3.5 out of 5 stars and recommend it for ages 12 to 18, plus adults. It releases in theaters December 8, 2023. Make sure you give it a watch! By Tia O., KIDS FIRST!",
    "119": "LIKES:The Animation: Most of the Time\n-Miyazaki and his studio know how to make things come to life and at opportune moments, that animation style is solid.-Moments of running are beautifully pulled out, 2-D animation coming to beautiful details, fluid, colorful, crisp, and downright gorgeous with the colors designed.-His movement with water based themes still blows my mind, the melting, the flowing, and the chaos so good and in this movie, it's fleeting but still incredible to see such physics captured in the art.-Other elements of anthropomorphized birds are fun, comical, and yet at times deadly, holding more character than the actual character themselves.-And what looks like computer like animation manages to merge well when the time calls for it, granting shading and ominous tones to the big bad stones.The Humor\n-It's odd at times, but once more, his movie holds humor that is earnest, fun, and quite arguably very spot on for delivery.-Heron man in particular is my favorite, his voice alone is very humorous, but his sarcasm, hedonism, and his nihilism work in contrast to the hopes of the others and like Squidward has that finesse that optimizes laughs.-While Mahito is funny in terms of the random things he says focusing more on just absurd disbelief and incredibility as if searching for a way out of a dream.The World Building/Design\n-My favorite aspect in this movie is the way he has designed the worlds and tones of this era of Japan, but at times pulled the lore and legends to make a twisted fantasy world that was awesome.-Starting with the real world, Miyazaki brings his touch of genius to making reality fun and engaging. Vivid colors lead the pack in nature, only offset by the muddied and muddled tones of the inside of the human house. That contrast alone almost tells a story on its own, but a fantastic introduction.-Then once you get into the world by the heron, the proverbial white rabbit, the art changes dynamics and accomplishes much, coming together in ways II did not anticipate.-What looks like Renaissance paintings at times overlays with his animation style, but never to the point of interrupting as background and foregrounds play together in an almost painting meets cartoon exchange.-Use of light is sensational in the tones it tells, sometimes being so bright I had to squint to help keep my eyes from tearing, and other times focusing on shadows as if they are to be swallowed and muted from their personalities.-And the contrast is brilliantly applied to make emotion and engage the atmosphere of the character, all while still having that cute little twist despite the darker elements Miyazaki incorporates in his work.-All in all, that was the most beautiful aspect of the movie, and by far the most engaging of the works I have seen in a long while.The Morals:\n-The movie is a big look at life and character studies in handling darker elements of said life.-The Boy And The Heron takes a deep look at the ideas of escapism vs. Reality, choices, friendship, and the very nature of rule abiding vs. Not, all in the concept of having the audience sort of look at themselves.-It's hard material, which is kind of exciting, as they explore cultures. Self-reflection really being the name of the game as art, visuals, and story come together into one dynamic and have you think in detail is it worth it.-So those wanting that kind of experience and \"elevated\" storytelling are going to really enjoy this movie given that very nature.DISLIKES:The Animation Sometimes\n-Despite the master's work, there were some earlier issues for me at the start of the movie that looked like glitches or dips in animation.-My eyes thought I saw paused frames, some skips, and several times very blocky and slow animation. Potentially due to how limited current animation is in cartoons, I might have just adjusted to what they were showing.-Is it the worst? Not for me it isn't. Just something that I noticed didn't quite flow as smoothly as his other works, at least until you get to about a quarter of the movie in and the animation picks up in movement and speed.The Story Is Less Adventure/More Life Philosophy\n-This is the part that is going to be a mixed bag depending on what type of story you like\n-I can handle elevated thoughts and tales, but it doesn't mean I want it for every movie, sometimes still wanting that traditional Miyazaki adventure.-The Boy and the Heron is very metaphorical, and abstract at times. A linear movement being we are just moving away from the entrance, but otherwise is a scattered and hasty tale.-We crash, bump and bash all over the place in search of answers, the goals and wording odd as to what we are actually trying to accomplish given how the goals seems to change, layer, and feel very randomly added at the most random times.-So much lore is built up in those moments, almost feeling like the movie is a part one to something bigger. Yet it sort of just tapered out, sort of merging with the grand plot of what is wrong with the world and the life testing story with it.-While this touch on reality may be refreshing, and it has that Miyazaki presentation, it just doesn't have the same merit of adventure that Spirited Away, Moving Castle, and others had for me in that spark.-So depending on the style of your story this may not be your most engaging tale.Little Antagonism\n-Again, Miyazaki has crafted some monsters, villains, and beasts that are the very destructive nightmares that plague our dreams.-And this one's antagonism is more so the philosophical components and psychological strain of life than an actual villain that is menacing, threatening, or even present.-At first you might have your thoughts of the Heron being the big baddy, only to abruptly change to something more lurking in the shadows, the Heron sort of dropping into the background.-Even a late entry to the game had some inkling of being good, but again, a very mundane villain, who aside from swipes of a weapon, is more of that classic telenovela yelling in Japanese form.-Things just felt like they were missing, these disjointed connections lacking integration and timing to really connect with these characters or the investment into their inclusion.-Again, elevated storytelling has its moments, but for viewers like me, the lack of a central villain, or even any physical antagonist with merit is a missed opportunity to help add some pep to this tale.Depressing and Weird\n-And for those not ready to handle a very sobering movie, you aren't going to want to see this film.-This tale has a lot things to face, sort of like a prophecy meets dealing with the past and moving forward. While this is handled beautifully in vision and telling, the material is again a tough thing to handle given the context.-And adding that weird lack of villain and Miyazaki's imagination, the movie just has this odd angle that feels out of place and sort of enhanced the depressing story.-Ambling around from storytelling, not really having time to relieve ourselves from the weight of this tale, which can sometimes be so encompassing that it took joy from the movie for me.-I guess that's the point, but so many other depressing movies have relieved the sadness with some means in terms of adventure or a festive banquet. Something only the colors and some interludes of humor accomplished for me.The VERDICT:\nThe latest animation film is a movie that has a spectacle that is beautiful to watch and unfold. Fans of Miyazaki, I feel, will enjoy the ride in terms of that art style and animation coming to life, his weird characters and designs like an Alice in Wonderland that blends styles together. The way his animation tells so many stories by itself, and emphasizes emotions is my favorite aspect of it, conveying the emotions and ideas in this moral heavy tale and helping one reflect. But while this metaphorical story is unique, breathtaking, and quite honestly beautiful, it's also a tale that is not as thrilling, exciting, or engaging as I had hoped. A strong opening act of lore building and foreshadowing sort of got lost for me, and a lack of a strong antagonist, linear story or even goal was hard to keep my attention. Depressing content like this could have used reprieve, some thrills, or another method to break through the heavy life reflection, or perhaps not edit as much, as something feels off in terms of a complete tale. The emotional pieces do keep their momentum though, and are the very blood of this movie with the animation, but I think several other films in his tale vaults hold the better balance and masterpiece for me.My scores for this film are:Animation/Adventure/Drama: 7.5-8.0\nMovie overall: 7.0.",
    "120": "We don't get to choose nothing before we are born. We are given a chance to be here and now in a certain period of time within a certain family which tries their best for us and they manage in the way they can.We all go through better and worse moments and I feel the key take away from this film is to make us think how do we behave when things don't go according to plan and life is tough.Do we get stuck into ruminating how unfair life can be and bring negativity to ourselves, or do we try to have a go and change things for the best no matter how ugly everything else is around?We are here today so we can have a real impact into making our surroundings a better place.I think this is what Mahito's story is about.Also, the music is beautiful.Thank you so much Studio Ghibli!!!",
    "121": "The Boy and the Heron is worth your time. As a matter of fact, it is worth at least one more viewing if not more. If you enjoy multifaceted dream worlds from which the viewer gets the sense there's more \"behind the curtain,\" then this is your movie.Yes, the animation is astounding. It brings a tear of joy to my eye to think Ghibli can still do hand-drawn animation at this point in film history and have a hit film. I also know Miyazaki would have it no other way. However, let us not ignore the beautiful score of this film. Joe Hisaishi is an already established master film composer, but I think the score here elevates the film because it is doing what I think the film is doing-that is, it's built around simple ideas that are actually not that simple at all because there are other layers at work behind the scenes. I cannot say more or I'll spoil the film.Finally, I do not believe it is a \"jumbled mess of ideas\" as I saw one reviewer say. This film is a slow-burn experience, and it can be overwhelming, but I was never under the impression that it was thrown together. I felt I was being led by masterful hands.See it, get moved, get confused, get lost in it, and then see it again and start to understand it. Don't miss real artistic brilliance when it appears.",
    "122": "At one point in the film the heron realizes he's been speaking too much and says (in the subtitled version), \"Loose lips sink ships,\" which is an expression from WW2 propaganda. I have no doubt an equivalent reference was already there in Japanese, and it helped me realize how much Mahito's adventure was a metaphor for the war, something which becomes more explicit toward the end.At the same time and as in the best of Ghibli the story draws heavily and very adroitly from old-style myths, fables and fairy tales (even featuring the much maligned stepmother, or amusing little grannies instead of dwarves), which are essentially the same the world over. The film stays true to fairy tales' tough and disturbing \"graphic\" content, deep and complex psychological import and comment on our place and role in the world and the human experience (the original title translates as \"How do you live?\", from a 1930s novel). This is still a modern fairy tale, however, and so it gets translated in modern idiom as a coming of age narrative about a child facing a terrible reality and in need of escape (but the kind of healthy escape from the prison of reality that Tolkien was talking about).The world he sets out to explore is like a dreamscape into a collective, mythical subconscious, and so makes little sense in a purely rational manner (even less than some of Miyazaki's earlier films). The narrative makes little effort to explain everything, which might frustrate the rationally inclined but which also promises to reward subsequent viewings and, well, thinking (dreaming?) about it. The ending is pretty abrupt, especially compared to a first act that takes its sweet little time, but I feel this is part of the film's refusal to offer a neat and tidy narrative package, with a nice little bow on top of it. Like dreams, or fairy tales, this is a maze, but one which leads somewhere if you only care to go to the trouble of exploring it.The ambitious narrative cleverly weaves all this with its running commentary on the war (the flying squad of pelicans eating souls in the night sky, the tower built at the beginning of the Meiji era as a metaphor for Imperial Japan, the martial king of the parakeets). This makes \"The Boy and the Heron\" into a sort of culmination for Miyazaki's work as it brings together all of his career-long preoccupations and themes (WW2 was brought to the foreground in \"The Wind Rises\", which focused on a character who made war planes, like Mahito's, and in fact Miyazaki's, father). It is also reminiscent of other Ghibli films, including (early on) Isao Takahata's devastating masterpiece \"Grave of the Fireflies\" (another director who was a child during the war) or the more recent \"When Marnie Was There\", which shares a somewhat similar premise. But mostly this is an unmistakably Miyazaki film, with a girl as a supporting character who would have been the heroine in another of his films, and where even the inevitable cuddly little creatures (the warawara) bring poetry and a thoughtful comment about the circle of life and death.Sadly some people cannot help themselves and will unfavorably compare this to \"Spirited Away\", because they just want more of the same. Such people do not deserve such a film as \"The Boy and the Heron\" and everything it can bring them. Their loss.",
    "123": "Rating: 7.2\nOverall, a very beautiful movie with its animation and score as it feels more like an art piece than an actual story, which is telling given how poorly constructed the plot is with its slice of life first half and plot-heavy/rushed second half.Pretty Good Direction (Does a very good job on a grand scale as he builds these vast mystical worlds that are worth exploring; the direction of actors is very good as he does a good job in creating both animated and grounded characters; the storytelling for this movie is pretty lacking as the first half slice-of-life style clashes with the very plot-heavy style in the second half to where it is a bit confusing on what is actually going on), Good to Very Good Voice Acting (Very Good from Soma Santoki (Really embodies the character and carries the movie on both an innocent and ambitious level), Great from Masaki Suda (Really brings to life this animated, yet important character), Good from Aimyon, Good from Yoshino Kimura, Good from Shohei Hino, Good from Ko Shibasaki, Good from Takuya Kimura, Good from the rest of the cast (Everyone plays their role well as they help bring to life such an animated, mysterious world through their characters)), Pretty Bad to Decent Story (The concept is decent (but just feels very similar to Spirited Away to where it doesn't feel that unique); the story construction is bad because the second half crams in too much plot since the first half is very slice of life, and this makes it hard to follow what's going on and what is actually important; the storytelling is pretty bad because there isn't any flow between the scenes (especially in the second half); the character writing is good as we do get to see the internal conflict of the main character as he uses this journey to get over the loss of his mother, and the minor characters do their job in buttressing this journey), Good Screenplay (The dialogue flows very nicely and is typical in style to other Studio Ghibli movies; the attempts at humor were good and did a good job at lightening the mood; symbolism is pretty prevalent (with themes about a post-WWII Japan and dealing with loss handled well); the foreshadowing was pretty standard), Very Good to Great Score (Used very well throughout the movie to help establish the tone and feel (feels very similar in style to Hisaishi and Miyazaki's other collaborations)), Good Sound (Helped create this magical and mysterious world), Good Editing, Great Animation (The best part of the movie as Miyazaki does an amazing job at creating these beautiful worlds as the movie is more of an art piece than a story), Plot Structure was the biggest issue for the movie as the exposition takes up too much time to where the rising action is incredibly rushed and there is practically no climax; the runtime should've stayed the same but some of the exposition should have been redistributed to the rising action to help strengthen the conflict and the storytelling, Pacing was very slow in the first half (because it is very slice of life) and very fast in the second half (as it tries to make up for time lost), Climax was incredibly disappointing as it just feels very anticlimactic and rushed (more of an afterthought than a pivotal scene), Tone was very similar to Spirited Away (sharing themes with other Japanese animated films with also having coming-of-age/supernatural themes)",
    "124": "Opinion on the anime «The Boy and the Heron» (2023):On December 7, Hayao Miyazaki's new animated work entitled «The Boy and the Heron» will be released in Russia.Yesterday I was lucky enough to watch this film 4 days before the all-Russian premiere.To begin with, «The Boy and the Heron» was the first anime I watched from Hayao Miyazaki.I started expecting this anime after the first announcements as well as after watching the trailer.What can I say about this tape? Did my expectations come true? Let's find out!«The Boy and the Heron» - is a beautiful, magical fairytale story about how our world is not perfect, but you should not despair because of this, but you need to enjoy every day in your life, no matter how difficult it is.I liked the plot, it was not simple and surprisingly did not seem clichéd to me, although it may seem more to people than I have, on the contrary, it will seem so.The story fascinates from the very first frames and does not let you go until the very end; the 124-minute running time is easy, interesting and magical.The animation, as in Miyazaki's previous films, was top-notch, I would like to note the colorful backgrounds, well-designed worlds and excellent character design.I also liked the original soundtrack by Jo Hisaishi; the compositions perfectly matched what was happening on the screen.As a result, «The Boy and the Heron» - is an excellent, exciting, two-hour adventure that will appeal to teenagers and adults alike.I give this anime a 10 out of 10 and advise you to watch it!",
    "125": "I'm going to start off by saying, I have seen this movie twice, both times at my local movie theater I watched it in Japanese with subtitles, and I felt amazed, confused, and I felt for the struggles of the main character, Mahito, who deeply misses his mother after something tragic happens to her. I felt invested in this movie from start to the end. Mahito is kind of subdued, he doesn't say much during a good chunk of the movie at the start. Mahito and his father and new mother move to a house in countryside outside of Tokyo, that's where he first meets a mischievous, heron, who you can't quite tell if he is a friend to Mahito or what he is actually up to, for me it seemed like The Heron's true intentions kept changing, shifting throughout the film. The Boy and Heron covers lot of topics, grief, dealing with loss of a loved one, the trauma dealing with that, and how to come to a point , where you try to keep living and trying to enjoy life still, still deaing with the hurt, that Mahito is dealing with, from his dreams of his mother in the fire. The animation in this movie is just superb, top notch. I like computer animated films. However the hand drawn amination in this movie to me, has a like a storybook look to it, which makes it extra special I think. Yes there are parts of this movie, that don't make sense, that are lot of odd, strange things that take place when The Heron takes Mahito to another world for a certain reason. That other world they visit, is really beautifully animated. Lots of scenes would like to replay when I own this on digital. Some terrifying moments happen , some really strange happenings take place. I think this movie is worth seeing. For any fans of Studio Ghibli past films or fans of original animated movies that take you on journey full of strange characters and a movie that has strong emotional weight to it, I recommend., two thumbs up.",
    "126": "Eh... wait for it to come out rather than seeing it in theaters. If you don't have any prior knowledge on Miyazaki's life or other ghibli films it'll be a lot harder to understand or enjoy. It's a movie for a very niche/small audience, which for that audience is great, but it doesn't really work as a stand-alone film. (I enjoy some ghibli films but my knowledge on Miyazaki is very minimal so my friend had to explain to me afterwards that it was very autobiographical in a lot of aspects)\n1) One really big complaint I had was there were new variables/characters introduced like every 20-30 minutes which becomes exhausting after a while because you can't tell which variables are important and which ones are just kinda there to look cool. Really muddied up the story.2) As much as I honestly couldn't stand sitting in that chair anymore and thus wish I didn't wanna think this, the movie could've been longer. It felt like Miyazaki tried to cram way too much into a 2 hour movie and the ending was very abrupt. If someone told me the studio ran out of money and they had to just kinda end it, I'd believe it.3) I get that the animation and visuals and score were amazing, but art doesn't trump story and if you have to hide behind the visuals and sound for your movie to be passable then... it probably means it's not very good.In a nutshell, it felt more like a studio ghibli asmr compilation than a story-driven adventure that Miyazaki usually brings to the table. As talented as he is I definitely think it's time for him to pass the creative baton onto someone else. It's clear he's run out of ideas.",
    "127": "The story is complex and metaphorical it's definitely not everyone's cup of tea. First time I watched I was amazed by the drawings and and the ever enchanting music. It is made ina way that you can not tell apart if everything that happened was in mahito's(hayao miyazaki's) head or real the ending was beautiful and leaves us wondering. It reminded me of my childhood when I used to visit my grandparents. The reason I said it's not for everyone is that it's not a very straightforward movie most will miss the depth of the story. I brought some of my friends hoping they will get to have an amazing experience like I did only to be amazed at their disappointment. All they could see was a weird movie with a few funny scenes and a weird ending. They can't be blamed either, however good a book is int the hands of the wrong audience it will be treated as garbage. Made me wonder if I have treated great books as garbage cause of my own ignorance. All I can say is that watch it with as much open mind and curiosity as you can. For me this movie was nostalgic landmine to my childhood and a flim filled with the writers memories and imagination as well as few life lessons small as they might be considered, valuable ones. Hope you have good time as well.",
    "128": "This is the best animation I have seen from Ghibli yet. It's a complete feast for the eyes. I haven't yet learned whether and to what extent they used CGI, but even if they did, wow. Like the best video game you have ever seen. Lots of the scenes could turn into stills suitable for wall hangings.Now for the story: Very, very strange. Which makes sense, as there is a lot of autobiographical imagination going one. But I think back to the first time I saw Spirited Away. I was like, \"What is happening?\" The movie has lots of bewildering moments without really any explanation connecting them. I personally like that, but a typical American viewer might not.There is also so much going on and so many mini climaxes and denouements, that it makes the two hours feel like four. Best to watch this one during the day, but make sure it's on a big screen.Seven for the story and ten for animation equals nine. Just like things don't always make sense in the Ghibli universe, that's how math works in my world.",
    "129": "Hayao Miyazaki's (Princess Mononoke/Spirited Away) latest (is he retired or not or does he play for the NFL?) which follows the mystical adventures of a young boy who lost his mother in a fire & relocates to a new location to live & meet his father's new pregnant wife. The boy, Mahito, arrives to the new manse w/hat in hand & quietly kind but the trauma still rankles him where even the kind hearted elderly ladies in waiting try to ferry him along. One day at his new school, he gets into a fight & to underline said point he smashes a rock to the side of the head which after getting infected keeps him bedridden but his imagination (or is it real?) ignite where he befriends the titular bird which keeps showing up at his window sill. Leading him to a disused temple to look for his recently missing new mother, Mahito & the heron descend into a world where there is parakeet uprising underway who look to gain some sacred square stones to change the pallor of the rule while Mahito encounters a younger version of his passed mom who figures into this kingdom's turmoil. All of this marvelous mess is finally resolved w/all the players returned to their true worlds (or true selves) w/the audience, namely me, scratching my head to make heads or tails for this return of the animated master. Feeling like a hodgepodge of some of his back catalogue w/the protag entering a new environment (think Spirited) only to partner w/an inhuman ally (Howl's Moving Castle) to aid in his misadventures which takes place in Japan's past since Mahito's dad is a plane engineer (The Wind Rises) building zeroes for the war effort makes for a potent mix which for me never quite gelled. Maybe several rewatches are needed to see if this animated stew will go down a bit more smoothly but as it is, the film feels like a smorgasbord of eats which may've passed their tasting prime.",
    "130": "Hayao Miyazaki is one of my favorite animation filmmakers as I have grown up watching many of his works and the works from Studio Ghibli. Many of his works had personal connections with me and I had some influences for me when it came to animation works. \"The Boy and the Heroin\" particularly focuses on more mature and darker themes and I think it's awesome.Throughout, the animation is just gorgeous and eye-catching. Ghibli continues to create beautiful and gorgeous animation, colors, model designs and background structures that remain breathtaking and visually. The sound designs, musical soundtrack from Joe Hisaishi, and the colorful presentation is gorgeous and stunning to observe. The narrative is interesting as it provides interesting concepts, themes and characters that are well developed and carry good charms and emotions between one another. On the voice performances, all of the voice performances are amazing as they felt natural, raw, and realistic. I haven't seen the English dub yet so this is based on the original Japanese voice performances, but I plan on seeing it a second time with the English dub.The dialogue is really good, strong atmospheres throughout, and the direction Miyazaki approaches on the concepts and settings were well-executed. The pacing can be slow for many but I never once felt bored.Otherwise, this is yet another great masterful work from Miyazaki. Side note, this isn't for younger children so don't bring the kids to see this.",
    "131": "I was expecting this to be his Magum Opus. Miyazaki is a legend and has been producing high quality films for over 40 years. With a 10 year break, and this film taking roughly 7 years to come to fruition I expected more. Visually its beautifully as is always, but from a narrative standpoint this is one of this weaker films. I'm not sure if I would place it even in the Top 5. The film is more akin to a love letter to his previous works and autobiographical in nature as he uses the protagonist to convey his thoughts and feelings about particular topics. If you've never watched previous Miyazaki films you will find it difficult to follow or understand, and a lot of the imagery will just fly over your head. As the man has created over a dozen animated movies that is a lot of homework required to be able to appreciate this film in full. Similar to the cameos, references, or plot points that you may find in Hollywood superhero movies that may go over your head if you only follow one series instead of multiple. I can understand why it has become one of his lowest grossing films in Japan over the last 30 years as the film just doesn't carry itself well as a stand-alone film at all.",
    "132": "Existential in its themes with vibrant animation. The tone & plot are jarring but strangely captivating with interesting symbolism & deeper meanings. The lack of background noise/score makes an empty feel..\n..\nExistential in its themes with vibrant animation. The tone & plot are jarring but strangely captivating with interesting symbolism & deeper meanings. The lack of background noise/score makes an empty feel..\n..\nExistential in its themes with vibrant animation. The tone & plot are jarring but strangely captivating with interesting symbolism & deeper meanings. The lack of background noise/score makes an empty feel.",
    "133": "'The Boy and the Heron' is Miyazaki's 12th film, and while not his best, it's still exceptional animation with a nice story and a bit of weirdness thrown in to make it interesting. This time, we follow the titular boy, Mahito (Padovan) as his father (Bale) moves them from Tokyo to the Japanese countryside during World War II, after the death of his mother. There he has to deal with his new step-mother, Natsuko (Chan) and new environment.There's a bit of effort that goes into the set-up - and the fire scene in Tokyo is excellently animated - then a lull as Mahito tries to find his place in his new circumstances. This is where he encounters the Heron (Pattinson) - with a cool face-swap trick - who leads him to an abandoned tower, which transports them to a hidden world, a we're on a bit of an 'Alice in Wonderland' trip. Kiriko (Pugh), Himi (Fukuhara) and Grand-Uncle (Hamill) are (mostly) helpful to Mahito here, as he has to figure-out how to save Natsuko and get back to his world.I don't think this lives up to 'Princess Mononoke' or 'Spirited Away', but is similar to 'Ponyo' or 'The Wind Rises'. Possibly a bit long at 2 hours, but it does have plenty of weird creatures, a great voice cast (including Dafoe as a pelican and Bautista as a parakeet!), some beautifully painted backdrops, a great score and a nice little moral about looking out for others and choosing your own path.",
    "134": "At a certain age, a certain young age, some of us (maybe most of us, today) believe that you have the right to let yourself down as much as you want. We tell ourselves that, if your mistakes only hurt yourself, then they don't affect anyone else.In other words, our innate selfishness makes us incapable of imagining that anyone could care about us more than we do ourselves. That is the malice that this movie shows us: your cruelty to yourself does not let just yourself down.If that sounds unfair, if that sounds like your life is not entirely your own: exactly!I might never know how exactly Miyazaki came to learn this, but I can hear his message loud and clear: understand how to live for not just yourself, before you set off consequences that you can't take back, consequences that you couldn't have imagined.I think his hope is that even one person can learn this lesson from this movie, rather than much more painfully from life. I think that would be worth it.",
    "135": "This Miyazaki film feels different than prior works. It has a strong autobiographical character. And a rather dour protagonist.The opening scenes paraphrase Hayao Miyazaki's personal life closely (plane canopies not rudders etc).Then the film shifts gears to become more fantastical, allegorical and metaphysical.It resolves and everyone winds up back in the appropriate place and role.I'm a little split on my opinion. On the one hand it was confusing in places. The different sections almost feel like they were directed by different people. Their tone is so different.But maybe I just need to watch it a few more times to get it. This is not a simple film and, while not a grown up film with nudity or drugs. It's not a cute kids film by any stretch. So it might not be a good idea to take the whole family to the cinema expecting Ponyo or Nausica. Might end up with a car full of grumpy kids afterwards.This film has elements similar to prior Miyazaki films. But the fantastical and cute is dialed down. The symbolic and philosophical is more prominent.I did enjoy the movie a lot. But am looking forward to repeated viewing to unravel what is being said.",
    "136": "I came out of the theatre verbally saying, \"Oh my god, that was SO boring.\"\nI couldn't wait to get home, as I was curious to see what the rating was on IMDb. I saw the rating of 7.7/10 (15K ratings so far), and I said, \"What?! How?\"I was looking forward to this film, as I do for all Studio Ghibli films. But, my god, I was so bored about halfway, to two-thirds of the way through. I seriously contemplated walking out, as I was so bored. I couldn't, because I had to see what the ending was like, so I pushed through. Well, the ending disappointed, too. \"That's it?\" Sigh. If you want to see a Studio Ghibli film, I recommend you watch any other one of his, or your favorite. You'd do yourself a favor, and actually enjoy the movie if you did.Man, this sounds harsh, I know. And I hope Hayao Miyazaki doesn't read this review. You've done GREAT work, sir. Just, this one isn't it.Upon reading that this is semi-biographical, I'm even more sorry that I have said the above, but I have to be truthful to people seeking out reviews. I can't give a 1, as all the hard work that goes into making an animation. I could give a gracious 3, but that seems dishonest. I'll give it a 2.I couldn't emotionally connect with the boy. The plot, though there is one, just didn't do anything for me. I didn't get a grand lesson from this. I wasn't moved, other than to boredom.Gah, I'm struggling in considering if I should post this review. I feel so bad.",
    "137": "The Boy and the Heron, a mini review, no spoilers.Studio Ghibli is known for two dozen ground breaking animation film for all ages. Some of their most renown films include Castle In The Sky (1986), My Neighbor Totoro (1988), Spirited Away (2001), Howl's Moving Castle (2004), and Ponyo (2008). I have seen three of the five classic, all surreal masterworks of animation art. Now I have seen my fifth, 2023s The Boy and The Heron.There is a boy, and a Heron, and they adventure to find the boys lost mother in an antagonistic trip as frenemies. There are the amazing sets, characters, bird, birds, and more bird, with the Heron and a cast of hundreds of parakeets and pelicans.It is in theaters in English with a voice cast that include some familiar names like Willem Defoe, Christian Bale, Dave Bautista and Mark Hamill. That is the power of this animation studio that they can get A list actors to voice their film.The animation is stunning, the plot is so surreal to make it irrelevant, but it doesn't matter. The characters are fun, the visuals are beautiful and there is a plot, we just get lost sometimes, or I did.Rating: Pay full price.If you like animation for all ages, this film is for you.",
    "138": "It may be understandable as a story about Hayao Miyazaki himself, but as a Ghibli animation it does not exceed expectations.Although the opening scene, with its intense switching between reality and mental images, does a good job of expressing the emotions of the main character, in places in the first half of the film, I felt the clunky movements of the characters, which are not typical of Ghibli, were noisy.I feel uncomfortable with the image of women he portrays, which I did not feel when I was a child, but it is not hard to understand considering his background.I think you will understand this film better if you know more about his life and the people around him.The end of the film is also graceful and expressive of him.",
    "139": "From the mind of Hayao Miyazaki and the Studio Ghibli team comes an intriguing tale of self-discovery and acceptance. It tells the story of an indifferent boy named Mahito, during the hard times of World War II in 1943. The loss of his mother really traumatized him to the point he wants nothing to do with his father's remarriage to another woman. However, he soon discovers a mysterious grey heron who seems to guide him through things in life that something fantasy could be at work. But can looks be deceiving? Mahito has yet to find out the true nature of it all.I must say I've seen many of Studio Ghibli's films. Whether it was the fantasy nature of Kiki's Delivery Service, Spirited Away, and Totoro to the touching Grave of the Fireflies and The Wind Rises. All of which are Ghibli classics I've seen over the years. Because I viewed the English dub in theaters, the voice cast which includes the talents of Robert Pattinson, Christian Bale, Mark Hamill, Willem Dafoe, and Dave Bautista. They really brought out their performances in the most skillful of ways. Newcomer Luca Padovan is also notable in voicing the troubled Mahito. His interaction with several of these characters is also noteworthy in help keeping the story going. I didn't even think for a minute when I found out that was Pattinson as the heron. Sounded nothing like himself! Sure shocked me!Since I've also seen fellow anime filmmaker Makoto Shinkai's latest flick \"Suzume\" this year, it's going to be a tough one for awards season! Shinkai's film may be worlds apart from Miyazaki's own movie, but I see the themes of grief playing in both of them. Among all the dazzling visuals and likable characters that you feel for at times in either of these titles, it's the one thing that makes them matter: the story. (Miyazaki VS Shinkai. Ooh.)I applaud maestro Miyazaki and his crew for capturing my attention with this movie and without a doubt, it's definitely awards worthy with his direction and the music of his longtime composer Joe Hisaishi. It's a feeling that can be both beautifully expressed through joy and sorrow. \"The Boy and the Heron\" is an impressive piece that I think has that panache that's as easily recognizable as his past works.",
    "140": "Just watched this movie for the second time and\nwill probably watch it again in the future.The film contains a deep, philosophical and moral meaning, the complexity of the plot is simply amazing, the story is well thought out and with a logical conclusion, which, as I understand from reviews, many did not understand, namely what the author wanted to convey to the viewer. I agree that this movie feels very bloated with underlying messages and intricate metaphors, but that's what makes this movie even more enjoyable on rewatch. Most of us will surely miss a lot of details on the first watch, especially during the first act, which is filled with mysteries and foreshadowing..I was literally shocked by the storyline and the twists and turns of events, the details of which the author wanted to convey without disclosing it in the viewer's face.The characters are interesting, well-developed and memorable. Typical for Miyazaki, the movie has pleasant and highly detailed art, with incredibly amazing animation.From the realization of what the author wanted to convey and how it alludes to the author's biography, I simply experienced indescribable emotions, so strong and vivid that that even my body went numb. Even when I watched it for the second time and had so many \"aha!\" moments which went over my head during the first viewing.The film came out truly beautiful, I don't even regret watching it, at first too many things felt unclear, but after fully immersing myself into this story and trying to deduct the true meaning behind it all, I fell in love with this movie. I'm sure there are more things for me to notice when I'll rewatch it again in the future.The movie has some moments which I wasn't a big fan of, like the rushed ending and not enough worldbuilding, but the pros still heavily outweigh the cons for me.",
    "141": "You may come away with more questions than answers if you were to watch The Boy and the Heron without any knowledge of Miyazaki, his life, and the content of his previous films. On the surface level it's another escapism fever dream of seemingly disjointed themes, mashed together in a jaw dropping visual fashion. The art in his Ghibli creations is unmatched. If you are after mindless distraction instead of questions and challenges, you won't find it here.Once you take a step closer and peer beneath the movie's surface, the sheer level of thought provocation Miyazaki is asking of viewers is worthy of commendation alone. If you analyse this movie in detail, it might leave you in awe of the level of meaning behind almost every second of this film. The films contrasts with Miyazaki and his own life, bordering on semi-autobiographical, give it a personal feel that really adds to the emotional peaks and troughs throughout. The existential themes I waded through in the hours following my first viewing are exactly what Miyazaki makes his worlds for. Death, grief, the meaning of life, the value of a body of work, acceptance of the end of the road, new beginnings.The film is a triumph that feels like a worthy summation of decades of meticulous obsession, in pursuit of building worlds that offer everyday people a way to process some of life's most confronting topics. It takes aspects of Miyazaki's prior films, adds the context of his life, and takes you to a mesmerising, metaphorical universe it is hard to describe in words (see it for yourself if you haven't). Mahito and the Tower Master may as well be blatantly recognised as differing versions of Miyazaki himself at various stages of his life. While the struggles of the great uncle to maintain created worlds hint at Miyazaki's own struggles with the failure to find his successor at Ghibli. Aside the subsequent slow extinction of traditionally animated movies. I truly hope this film inspires a new generation of hand-crafted animated films. There is truly no other art form quite like it in existence.Charming, beautiful, of course creepy. Perhaps one of the most monumental films in the history of animation. Certainly one of the most impactful movies I have ever had the honour of viewing on a personal level. After The Boy and the Heron, I hope Miyazaki finally takes the time to bask in the success of a stunning culmination of a lifetime of work. Bravo Miyazaki and thank you. 10/10.",
    "142": "First things first, I have to say the animation has phenomenally improved. Like awe and a bit of nostalgia hit me the second the first scene plays out. The voice acting's great too. Nothing over the top, melodramatic nor underwhelming.And then... Call me stupid, but I don't quite fully grasp what the movie is trying to say on first watch. And that sucks since I'm a fan of Studio Ghibli movies. I mean, I manage to learn one lesson at the very least. And while that's a good lesson, i still feel empty after getting through the ending, as though I've missed something.Either that the movie is too subtle or has too less on its subtexts, or I'm just too blind to see them. However, after looking through several analysis videos on YouTube and Google, and rewatching a few scenes, I can say I appreciate the movie more. So, guys, don't hate the movie too much just because you don't try and make the effort to understand it. Believe me, it's good when you just squint your eyes a little bit.",
    "143": "In the past 20 years, pretty much everybody has become a Miyazaki fan. And yet, while his style is unmistakable from film to film, it is also true that there are many Miyazaki's, and you're not forced to love them all equally. There's the beautifully poetic Miyazaki from Totoro, Kiki's Delivery Service or The Wind Rises. The master of entertaining fantasy and imagination from Spirited Away or Castle in the Sky. And there's a dark Miyazaki, the one from Princess Mononoke or Howl's Moving Castle.The Boy and the Heron falls into this last category. These films tend to mix many elements that aren't always easy to bring together for the audience. Great beauty and great ugliness (the heron from the title is disturbingly ugly, there's bird feces throughout the entire film), harsh reality and unbridled fantasy, a simple story and a complex one, childhood and death. The Boy and the Heron isn't always easy to watch. The story, ultimately a version of Alice in Wondeland, isn't actually all that hard to understand. But the many paths it takes to get to its conclusion, the many characters and creatures introduced make it feel like a winding road that can make you more than a bit dizzy.Through it all however, you stay engaged, you have the feeling of watching the work of a great artist and something you will never get to see again. Whether you love every scene or not, whether you are able to engage in the plot fully or partially, you certainly always enjoy watching a story like no other, and a work of true personal passion.",
    "144": "You see, my friend. There are two types of people in this world: people who know that Studio Ghibli and Hayao Miyazaki are absolute legends in the film industry and absolute morons.They are responsible for not only some of the best animated movies ever made but some of the best movies ever made in general and even most of their movies that don't fall into the \"best of all time\" tier are still great and The Boy & The Heron is no exception. While not a masterpiece, I definitely think this is a movie you should go out and support. Everything I love about Ghibli is on full display here. Phenomenal animation, amazing music, great characters, captivating story, etc. That being said, there are some major flaw I have with the film and unfortunately, it's the ending. I felt a bit abrupt and insanely rushed. It's not a terrible ending but I definitely think they could've done better. Beyond that, I absolutely loved this film and I might see it again before it leaves theaters.Overall, The Boy & The Heron is another great edition to Hayao Miyazaki's already legendary filmography. He apparently has another movie coming after this one and I for one can't be more excited. Definitely recommend this one.",
    "145": "I recently watched the movie \"Kimitachi wa dô ikiru ka\" and must say that it is an intriguing and thought-provoking drama that explores existential questions. While it possesses several noteworthy elements, it ultimately falls short of fully maximizing its potential. My rating for this film is 6/10.First and foremost, the film's premise revolves around a group of individuals questioning the meaning of life and embarking on a journey to find their purpose. The central theme is compelling and tackles existential concerns in a refreshing way. The introspective narrative offers plenty of room for contemplation, and viewers seeking profound insights will find moments of profound reflection throughout the movie.The performances from the cast are commendable. Each actor portrays their character with sincerity and brings a certain depth to their roles. Their nuanced portrayals accentuate the inner struggles of the individuals, making it easier for the audience to connect with their dilemmas. Furthermore, the chemistry among the ensemble cast enhances the authenticity of their relationships, adding an emotional layer to the story.The cinematography and visual aesthetics are visually captivating. Beautifully composed shots, along with the skillful use of lighting and colors, create a visually appealing atmosphere that complements the film's narrative. The production design also deserves praise, as it effectively sets the stage for the characters' introspective journey in an aesthetically pleasing environment.However, despite these positive aspects, \"Kimitachi wa dô ikiru ka\" could have benefited from a tighter screenplay. The pacing occasionally slows down, and certain scenes feel excessively prolonged, resulting in moments where the film loses its momentum. Additionally, the story's resolution feels rushed and could have been more satisfying if it had been given more time to develop organically.In summary, \"Kimitachi wa dô ikiru ka\" presents a thought-provoking exploration of life's meaning with commendable performances and visually appealing aesthetics. While it could have been more refined in terms of its pacing and storytelling, it remains an engaging film that offers moments of introspection. I would recommend it to those who appreciate thought-provoking dramas, but with the understanding that it may not fully meet all expectations.",
    "146": "Amazing masterpiece.The art, the music and everything about this anime movie is incredible.I haven't seen a Studio Ghibli movie prior to this but now I want to watch them all.The story is unique, magical like a fairytale.Some great english voice acting by Christian Bale and Florence Pugh.I would recommend this to everyone those who love anime and those that do not.I watched this movie in the cinemas with my mother whom is an artist and is studying design. She is amazed by this movie too.I hope to see more movies like this one from Studio Ghibli. Thankyou for the experience :)\n-Laurie.",
    "147": "As someone who had seen bits and pieces of Miyazaki flicks before, but never a full piece, I had trouble digesting and enjoying this movie.I'm no stranger to complex plots, especially those that would require a little research or an additional watch to grasp. But, this movie just did not have the impact I thought it would.The plot was easy to follow, but many of the details seemed to be lost in deep metaphor. There were a lot of major plot points in the movie that seemed to be missing good comparisons to your actual life.I'm not upset that I watched it, and I don't think it was a bad film. However, I just don't think it was that easy to understand. I'd like to revisit this movie after a little more exposure to Miyazaki's art form.",
    "148": "Watched it last night, it was just meh...Story: 3 stars - it starts interesting but things are rushed out to a happy ending that left everyone in the cinema wondering if that was it? There is nothing really deep, convoluted or symbolic beyond the surface, the plot connects more or less fine, but it leaves a bitter taste: it had a great potential but it was sadly delivered as it is. Probably too many characters too little development, rambled story and happy ending would describe it in one line.Picture: 4 stars - watched it on IMAX and there is only one scene 3-5 minutes of high quality content, everything else is looks average or low quality, not a great work. It also looks like an average mix of any other random anime: recycle Arrietty, Ponyo and there you have it. Was this made with AI? Not bad, just average or uninspiring.Music: 2 stars - there is nothing memorable about the music, it starts with couple interesting piano notes but it never develops beyond that."
}