{
    "0": "\"Mad Max: Fury Road\" is not the sort of film I enjoy and I after watching it, I am not a huge fan though I deeply respect the filmmakers. The reason I even saw it was the insane reaction the public had to this one...and the critical reviews were all surprisingly good. I wanted to see what all the hubbub was about...and try to understand why folks liked it so much. My take on it is that if you enjoy a film that is non-stop amazing action, then this one is for you. As far as the story goes, it's plot is super-thin--but the movie is handled so well and the stunts so amazingly insane that you don't mind. Worth seeing--but I sure wouldn't like to see a lot of films like this. Additionally, it was VERY refreshing to see a film where so many women are NOT mindless objects to be killed or protected--several are about as strong and heroic as Max himself--and no doubt this is why women seemed to like the film so much.",
    "1": "The rationale behind the success of 'Fury Road' predominantly lies with director George Miller whose commitment and love for the film series that he's been developing since its first outing in 1979 is evident throughout, and it's pretty obvious that he knows how to craft a damn fine action sequence. Without this passion, the film would have likely stooped as there's not much else in the way of a plot or character development, even though Theron tries her hardest to give us an enthralling new action heroine to be revered. Aside from the aforementioned writing setbacks, 'Fury Road' is a powerhouse in the technical categories. With stunning contradictory cinematography from John Seale giving us a post-apocalyptic world of lavish colour rather than your typical muted tones, a heart-pounding score from Junkie XL and exquisite production design work that rightfully earnt the film an Oscar (one of six) for its spectacular vehicle design.",
    "2": "I realize a lot of people will disagree with me ... but personally ... I don't like movies that leave me scratching my head with a lot of questions at the end. I prefer to ... you know ... understand the movies I'm watching.Now we get from the film that the world as we know it has ended. They are fighting over gasoline and are running out of water. There's this guy Max who used to be a cop who has become a drifter trying to survive. There's this guy Immortan Joe who is really scary, clearly has health issues, and is bogarting all the water from the people. He's got a bunch of blood sucking kids dressed as skeletons who are his lackeys ... and he keeps a harem of women against their will (gross).Furiosa grew up in a \"green\" place with a bunch of other women ... was taken by Joe when she was young. She wants to get back there and the \"breeders\" beg her to take them. And the film is basically them trying to get away from Joe who is trying to get them back. As plots go ... it's extremely basic.But that is it ... that's all we know and it's all we find out (except that the green place is gone). There are a lot of MENTIONS of things that never actually get explained AND THIS IS MY PROBLEM.Who is Immortan Joe?\nWhy does he look like that?\nHow did he wind up controlling all the water?\nWhy are they drinking breast milk?\nWhy are the boys called \"half-lives\" and dressed like skeletons?\nWhy do they need \"blood bags\"?\nWhat is with the silver teeth thing?\nWhat is all this Valhalla, shiny, chrome, what?\nWhy do they have a vehicle that spits fire with a dude playing electric guitar on it?\nHow did Furiosa lose her arm?\nWho was Furiosa to Joe?\nWHO DID KILL THE WORLD? (they keep asking and it never gets answered even a little bit)I had to look it up ... and I hate when movies don't explain things to the point where I have to look them up. That's what is called BAD STORYTELLING.I won't spoil it by telling you what was there but there is SO MUCH CRAZY INFORMATION that the movie just left out to make room for more fighting and chase scenes. This movie is 2 hours long and they couldn't fit any more story into it?Sorry guys ... that's some bad bad writing.",
    "3": "George Miller elevates action and violence to a true art form in this remake of a classic. The film is a gripping full adrenaline race across the desert of a post-apocalyptic future. The action sequences are mesmerizing and the work of a true master craftsman in action. What is perhaps the most enthralling part of the film is the absolutely absurd story and world building. Miller created a fantasy world where men playing flame throwing guitars and leaping through high speed chases on pull-vaults seems like a typical milk run. The movie keeps a relentless action pace that makes all of the absurdity seem so completely ordinary, which might be the real magic of this movie. This is only really possible because the action, filmography, set choices and music are so brilliant you cannot help but believe the insanity that plays out before you. You want to believe the fiction because of the quality of the production. The movie also features some surprisingly good performances. Charlize Theron being the real the star of the film, with the titular character really only acting as her support.",
    "4": "Even at the beginning, there's no hint MAD MAX: FURY ROAD is going to a stop. Right at the very start, the engines are already rewing, gathering furious fires of vengeance and redemption, and before the audience could snap out of the sheer moments of brutal grittiness and exhilarating high-octane drama, they are surely already held hostage within the confines of a post-apocalyptic world, where everything is horrendously scarce. Not that it's a bad thing, no it's not. I tell you, this is like being hurled into the space in a roller-coaster ride. It's dangerous, but it's also thrilling. Witnessing this dystopic world and all its hellish drama unfold might make you grope for seatbelt under your seat.The film shares Max Rockatansky's (Tom Hardy) adventures. Max is an ex highway patrolman. He's been haunted by the past, by family he never saved. He meets the Imperator Furiosa (Charlize Theron) who is being pursued by the dictatorial Wasteland leader \"Joe\". Furiosa reaches for Max for help in keeping the 'Five Wives'—women she brought with her—into safety, as Joe's deranged breed of warriors called The War Boys, that are barely humans, are raging across the desert to capture them. This pursuit throws the unlikely partners into the whalloping dangers of bloody escape, suddenly sending them into a game of survival.After a rip-roaring opening chase sequence, Max is held captive in the Citadel, the city where the ruthlessly totalitarian leader \"Joe\" is ruling over. The grotesquely brutal lord maintains tight grip of every valuable resouces across the land. This brings the entire populace crippling under his control. As for Max, he becomes merely a blood bag for Nux (Nick Hoult) one of Joe's War Boys, who is a fatal devout to the cause of their fascist leader, who has promised them the glory of getting into Valhalla, the promised land.Everything in this cinematic behemoth screams grandeur, even the feverish chase, even the dark erubescents spurred from the ruthless violence. Miller has molded a world where darkness is an escape from the stream of clichés and retreads, surging into the cinemas, today. It's a visual feast, but surprisingly, with sense. It's explosive in every unimaginable ways, but it's not devoid of a human story, which in this case, is propelled by stellar performances from incredible actors on the movie's payroll. Tom Hardy is utterly capable as the main hero, but the emotional spine of the narrative mostly runs on Theron's character. At some point, there would be a sense that Max isn't the only one playing under the spotlight, as it gets evident Furiosa is equally as massive as his role is. Hardy here is singularly stunning, playing his role with utmost credibility as he is required. His mission transcends past his emotional torments and he's never pulled himself free from the ghosts if his past. Same can be said with Furiosa, who is not only running from Joe because she wants to get herself free from his cut throat grip, but also to bring every woman into safety, back to freedom where they belong.Much of the movie is spent with furious speed chases that goes from end to end of Joe's subjugated land, while also taking surprising twists and turns along the way. It's like it doesn't know how to stop, and if it does, that's surely only to allow us breathe and catch up with the next electrifying action setpiece. There's an enigmatic style Miller has employed to provide distinctions in his fantasy world, and it keeps the momentum in tack, if not ever progressing. The tone of the movie, all those vividly dark colors, that magically shifts from something to another, imparts a drowning experience, only it's enjoying and looks festive to the eyes. This makes every eye-squashing spectacles take mammoth forms of visual extravaganza, turning all those burning combustions, metal blasts, and endless pursuits, from mere technical marvels into a hair-raising escapade.Amid these sanity-grabbing action sequences, though, is an emotional streak that keeps Max and Furiousa's humanity alive. This prompts them to survival, into carrying out their similar humane causes, clinging tightly to their only mission even if they get hurled into the barbaric hostilities of their dystopian society. This turns the movie into something visceral, cathartic in some ways that probably only a small fraction of the audience could understand. It will not be enough to merit this achievement with merely a splurge of superlatives. This needs to be experienced, felt, and forever cherished. MAD MAX: FURY ROAD, ignites eternal fire, and it will keep burning through the stretches of cinematic history.",
    "5": "Because my first reaction is to HATE HATE HATE this film. It's like an overly long David Bowie music video in its weirdness without Bowie's great music and great style.But it does do some things well. Yes, the action is great, but it is practically a silent film with just snippets of dialogue and relying on visual story telling. Within the first twenty minutes it is revealed that: Water is perceived as bad and is a means of control, the war boys need blood to survive and use human stragglers as a source, chrome and metal are worshipped, and different tribes in the desert have different specialties in terms of vehicular warfare. Plus there is the strong female character and female empowerment theme mentioned by so many others.For me, it was a split decision. For most other people I imagine it will be a love it or hate it proposition.",
    "6": "I just don't get the praise for this movie. The straight launch into fighting and chasing doesn't let one feel for the characters or identify with them. Lots of gross creatures chase each other in disgusting vehicles along the endless desert.Tom Hardy hardly gets a chance to act - could have been anyone. Charlize Theron is the star of the show and the only redeeming feature. She can do action as convincingly as drama and comedy. She is so beautiful it's a waste that she is used to play dirty roles in these monstrous ugly scenarios.Don't bother.",
    "7": "Why does everyone love this movie? The design, cinematography and action sequences are fantastic, but the storyline is awful (they drive out to the desert, realise that nothing is there, and turn around and comeback!!?). We learn nothing new about Max. And the ending...he drops furiosa back at the place where they pour water onto the dessert, and then walks off???!!! Absolute drivel of a screenplay.",
    "8": "A film that deals in scorched earth landscapes and scorched retina viewers, this film - large parts of which were shot in the Namibian desert - must have been hell to make, but the result is gleefully unhinged, visually stunning and utterly relentlessly thrilling. Tom Hardy may have played the lead role, but the film belongs to Charlize Theron's blistering intensity, director George Miller's crazed vision and every single technical expert who worked on it. A piece of action cinema that you won't have the seen the like of before.",
    "9": "This film tells the story of an able fighter in a part apocalyptic world, who helps a group of women to escape from the evil and cruel king who controls water supply. \"Mad Max: Fury Road\" has really good reviews, but it is completely not my cup of tea. Firstly, I wish they discovered other colours other than brown. Everything is brown, from the landscape, the vehicles, clothes and everything else. Secondly, the whole plot is quite ridiculous. If the blood bag is so important, who put him in front of the fighter vehicle, which is the most vulnerable place? In addition, there is a guy playing guitar in the battlefield, which is ridiculous. And spraying the mouth with silver paint is just weird. Actually, the whole film is so ridiculous beyond description. I didn't like it at all.",
    "10": "So to date it's easily more than doubled the $150 million spent to make it.. and in addition looks like they might have found a replacement for Mel (who's still the best Max by far). So we can now all be sure we'll be seeing more of this very worn out series. Passing off two solid hours of pretty much nothing but constant, mind-numbing crashes and explosions is now what we all have to look forward to in the future. There was not much acting required for this production because there really was not much of any storyline to tell in this overly bland script. But maybe it will make some of the younger generation go back and look at several of the previous works. They might not have been as action packed as this monstrosity... but they were overall much more consistently interesting viewing.",
    "11": "George Miller's original MAD MAX films might have broken too much ground since every other barren landscape within a post-Apocalyptic action vehicle is compared to the source – and here's a reboot by the man himself, perhaps bringing something fresh to the dilapidated table...Well the action scenes are done all right, and the direction is quick and tense. But the characters including MAX himself, cursed with sudden flashbacks to partially explain his brute-like mannerisms and Charlize Theron's Imperator Furiosa, equally bad ass and a far better driver are about as important as avatars controlled on a noisy video game.The score seems intentionally melodramatic, encapsulating a grandiose old school epic vibe, trying way too hard for genuine cult status – treating our heroes like they've earned their thick skin without being fleshed out beyond cool weaponry and nostalgic roots – FURY ROAD actually feels more like a second film following a proper introduction. Meanwhile, the tyrannical main villain looks straight out of a HE-MAN cartoon, and the only hint of a plot evolves around beautiful slaves being protected from his banal wrath.Technically, a ROAD is a particular section of a larger area that takes you down one specific lane, but FURY has too much open space where everything is going on while absolutely nothing happens, back and forth, in either direction.",
    "12": "George Miller has proved you don't need to actually make a movie in order to make money making movies. You see, movies typically have certain key features, such as: a plot, dialogue, and character development (all of which are absent here). And is George Miller now just Frank Miller with a different hat?Anyone who was \"satisfied\" by this mindless smash-em-up dystopian mess should be ashamed and go do their homework on some ozploitaion, you know the kind of movies that inspired Quentin Tarantino to make Death Proof, a far more satisfying car movie. And let me be clear, without exaggeration, that Mad Max: Fury Road has the hands-down dumbest scenes I've ever seen in a movie, the ones where we see the large \"music\" truck with the drummers and the idiotic electric guitar player who inexplicably joins the soundtrack with solos and flames.Hands-down, dumbest. Ever. Worse than Jar-Jar.We really only get a half-movie, because the first half is stuff driving one way, then they turn around and do everything again in the opposite direction, leading to an ending so triumphant that all it lacked was a golden unicorn shooting rainbows out of its flaming ass. It is surely not a great feminist statement worthy of men's rights haterade.The climactic line: \"I'm Max.\" And then Tom Hardy nods approval, as if to reassure himself that he is an actor and really can memorize such inane dialogue.I don't care if the action scenes looked cool. The movie is just plain stupid, so stupid it makes me want to huff some silver spray paint and go to Valhalla.",
    "13": "How this has gotten such a high score is beyond me. Just an incredibly boring car chase through the desert.",
    "14": "I will be honest with readers. I only really watched the first 30 minutes of this Hollywood blockbuster. What I did do before I settled down to watch it, was look at the rating on IMDb. 8.6 out of 10!! This must be great, like many other reviewers, I believe my low rating is a reaction to the absolute travesty that many movies are being rated so highly. The original Mad Max movies had a young and charismatic, unknown Australian actor called Mel Gibson in them. They had some plot and believability. This had so much money thrown at it, supposedly around $150 million, that the whole world view of Mad Max was gone. Hundreds of vehicles driving around in the desert. A community of thousands, with clearly no problem with water or food, even though the baddie turns on the water and lets in pour into the sand and then turns it off, and tells his people not to become addicted to water ??? Words are failing me, to describe how badly I feel. Any young people out there reading this, should watch Mad Max 1-2, skip the Hollywood version, thunderdome. Honestly, once again left speechless with the true awfulness of this film.",
    "15": "I feel like I am the only person on planet earth who didn't like Fury Road. It is basically a movie about a guy making a U-turn. I'll admit, the visuals are great but I've seen most of George Miller's films and he has an eye, but just because the movie looks pretty doesn't make it a good movie. It needs a real story. This is a 2 hour car chase and it gets boring after 30 minutes because it is literally the same crap over and over again. In a way, the action is wasted on the film because it has nothing but action. I can't be the only person who thinks this! WHAT IS WRONG WITH YOU PEOPLE? This isn't art! Stop pretending to be film snobs for like 5 minutes and just go with what your gut tells you about the film. Just because most of the film critics are calling this a highbrow art house film doesn't mean you have to go against your better judgement and pretend to like this piece of waste. 90% of the critics are paid off. Even the ones on youtube. Think for yourself, people will respect you more.",
    "16": "This movie was bad because nothing happens except a chase in a desert, where there is nothing to look at. For some reason this one arm chick decided to steal this crazy leader's wives(aka breeders)and is chased in the desert. And for some reason most of the crazy leader's followers are pasty white and bald. Why they don't have a tan in a desert? I don't know.Any way, this guy is tied to the front of a truck chasing the one arm chick and when all vehicles explode he lives and after fighting with the chicks, decided to ride with them. They're searching for a green area which doesn't exist so they go back from where they escaped. And during all this, you just have crazy people chasing them and vehicles exploding but there always seems to be more.FINAL VERDICT: Just a bad movie. Save your brain cells and skip it.",
    "17": "Mel Gibsons original movies portrayed Max as a real human being with a soul, a character a real person surviving in an apocalyptic world. With action and gore when necessary. The original movies also had storylines and decent acting with interesting characters.Then there is this. Barely a story, in fact the second half of the movie is the first in reverse. They go out and come back. That's it. Script and acting are cartoon like as Tom Hardy is barely recognisable as Max. No charisma no character, he isn't even the lead.Fury road is an all action monotonous CGI fest. Extremely overrated unless you like dumb action movies which is fine, however Mad Max movies weren't like that.This isn't Mad Max.",
    "18": "How to make a really awful, mind-numbing, horrid, puking, cringeworthy, hateful, silly, stupid, sick, marred, sub-par, flawed, blemishful movie? Make one with no plot, with several absolutely out of place looking models, with endless rushing and racing, with endless violence and with endless explosions. Add blood, add silly costumes, add ugly freaks galore, add oil spills, add sand and add unwanted and unsuitable sexy innuendos. This is what you get - awful Mad Max, which leaves a profound shock of wasted time and a feeling of being had by. Even beautiful models like Kershaw or Whiley or Kravitz, even fine actresses like Theron could not save this monstrosity from being a whole, complete, total, wholesome flop on all sides. This is an example of a horrible, totally ugly and unpardonably silly failure which made some cash and was praised. I do not dig this sick liking of sick films. I do not recommend this awful idiocy to anybody",
    "19": "The best thing about Fury Road is that Mel Gibson chose not to repeat his role as Mad Max. And if you have some spare time and decide to waste a couple of hours on this so-called movie, you'd understand why his decision was right.The story of Fury Road fits one simple sentence: Sort-of introduction, action sequence, the end. However, if you measure the movie's success by it's box office performance, this is clearly a masterpiece.If you believe that everything happens for a reason, then how this crappy scenario got this kind of budget? My best guess is that it addresses the audience that grew up on action movies in the past ten years or so. That implies almost non-existent script, zero character development and focus on action or, as some film critic aptly put it, \"eruptions of craziness\".",
    "20": "First off, this is another movie in which the action sequences last so long that you can go to the bathroom, get a soda, come back and still find the same people fighting the same fights you saw begin 15 minutes earlier. Personally, these type of action movies bore me to tears, because the story has to stop moving every time we watch one of these extended action sequences. In terms of story, the good guys and the bad guys meeting is a plot point. Then they fight, then one of them wins. As an audience member, I'm ready to know who wins as soon as they start fighting. And I really need the lead characters to have some logical reasons for doing what they are doing. Here's my spoiler: They drive away from someplace for half the movie and then decide to turn around and go back. The only thing that happened was that they picked up a gang of old ladies. That's as deep as it gets right there. They're running away, fighting the whole way, they get away and then they decide to go back, so they have to fight the whole way. Nothing makes much sense, no characters are anything but as shallow as they could have possibly been made. If you like Avatar, you'll like this movie. If you liked Mad Max and Road Warrior, you're going to be angry about how that franchise was exploited in name and setting only. This character isn't Mad Max. He doesn't have a dog, he doesn't eat dog food, he doesn't eat anything. Nobody in the film ever eats anything. Nor are people clamoring for gasoline, they all just seem to have it. There's an issue with water, but it makes no sense and the entire weak plot seems to depend on it. The movie ends with giant water valves being opened just like the air valves on Mars get turned on in the end of that Governor Arnold movie, I can't remember the name. The reviews calling this something new and different are absolute hogwash. This is nothing but things blowing up and cars crashing for two hours, which, by the way, is another egregious offense of these silly movies. They take a 90 minute movie with a great story line, and they strip it of plot and somehow extend it by 30 minutes. It's a scary trend, the kind of thing that makes one think Idiocracy was prophetic. The less the story and the more things blow up, the higher the ratings. Ridiculous!",
    "21": "I totally love cinema's action genre, always going easy on it. When the latest Mad Max movie first came out, I was pretty disappointed in it. Then all the acclaim and awards started pouring in. Is film dead? Did I just have a bad day? I rewatched it and my initial thoughts have been reaffirmed. The 1/10 I'm giving this is just a bid for this overall rating to lower. Otherwise I'd be giving this 5/10.It made sense for a Mad Max movie to be made now because of the massive upgrades in computer technology. That and it seemed like a nice cash grab. After all, the movie does have a better overall look than the three previous instalments. That's really about it in terms of what this movie has that's better than the others.'Mad Max: Fury Road' is not about anything. The characters are flatter than paper and the story stays in one spot throughout the whole thing. All it is is people driving in the desert with occasional explosions. The audience is expected the care about these characters just because. With underdeveloped characters why should we care? It is super rare when we care about an underdeveloped character. In 'Saving Private Ryan,' Giovanni Ribisi's character was underdeveloped but we felt tremendous remorse upon his death. Nothing that smart ever happens in this.For reader's sake, I will try to give a good summary of the plot. It is after the apocalypse (obviously), the human race is being enslaved (obviously) by the new leader (who is actually cool looking) who has many funny, half-naked Uncle Festers. Max (now played by Tom Hardy) is like a stuffed animal in front of a car and the Uncle Festers try to capture an escaped Charlize Theron. So that's it. There's really nothing more it it than that.One good aspect of the film is the cool images. The Uncle Festers, although cornier than their 80s counterparts, actually do look cool. There's one Fester with a sewn chelsea grin that I liked. The lord guy is pretty awesome and the frequent use of the skull logo is pretty badass. But not all of these are perfect. There's a guitar player on the front of a car that plays and shoots fire while the battles happen. But there's no point in him other than to look cool. The fire that shoots out of his guitar don't do anything. Some cars have tons of spikes that look cool, but they all explode right away. There's no point in having these images other than to look cool.There have been several analysis's about the movie's depiction of survival and feminism. Every movie ever made has themes! Fury Road's use of them are unoriginal and uninspired.On the whole, 'Mad Max: Fury Road' is a subpar action movie that is NOT one of the best action films ever like so many people say. It is literally just driving with occasional explosions and shootings. I knew this would find an audience like early Chuck Norris and Van Damme films did, but the critical acclaim and commercial success this has received is horrible. Do yourself a favour and just skip this.2/4",
    "22": "In Apocalypseland, Max Rokatansky finds himself strapped to the front of a vehicle forming part of a convoy crossing the desert in pursuit of a bus which has hijacked the harem of some feudal overlord-type in a mask whose name I didn't catch (in fact, I didn't catch any name apart from Charlize Theron's character, Imperator Furiosa). Max escapes and, after some disagreement, ends up helping the \"brides.\" I was very excited about the original Mad Max, because I love post-apocalypse fiction. And the first film in the original series actually started by addressing the crumbling of civilisation, showing a bridge between familiarity and the new order. Hindsight shows that what creator/director George Miller really wanted to do was get, as soon as possible, to a place where Max is a lone proponent of traditional values in a world which appears to consist entirely of feral gangs, victims, and sand. Fair enough, but it's not post-Apocalypse, is it? It's an alternate reality. Fury Road is a continuation, not a reboot, in which an entire sub-civilisation has built up in a remarkably short period: Max, a cop before The Fall, is still a young man, but the feral youths here have their own mythology. And how come, in this bleak, arid world, has the petrol not all evaporated? How come people are happy to waste petrol and water, both of which have to be scarce resources? Max's world makes no sense within the context of its own origin: that's why the original series annoyed me, and this addition doesn't change that.In terms of eye candy, it's certainly spectacular: there are some phenomenal stunts, the effects work is good, and the desert locations are dramatic. But the story – an extended chase for two hours - is no more than a hook to hang the visuals on, the characters are mostly uninteresting and undeveloped (not that it matters, because this film isn't about character at all) and Max is uncharismatic because Tom Hardy doesn't get to give an idea of what sort of person he actually is.If you like the idea of spending time in the eye-catching interior of a biscuit tin and being violently shaken for a couple hours, then I suspect you're going to really enjoy this. As for me, it tickled my eyes, but I would have liked a bit of food for the brain, too. I have friends who rated it highly: I had hoped I would too, but I'm afraid I have to record overall disappointment. This is an empty, empty film, and I'm not in a hurry to see it again.",
    "23": "This Mad Max is supremely surreal/Dali, absolutely fascinating even. This one, like the first 3 films, we get to suspend disbelief as the movie projects, thrusting us into the post-apocalyptic world, with anthropological and sociological elements we could believe it. Don't get me wrong, this movie is the best of the series, the unforgivable. Mad Max and The Road Warrior were convincing in it's tribalism, brutality and uncompromising violence I'm sure is true is burned into my survivalist memory. I'm not a hater, but massive dune buggies, rock playing mutants and an oxygen breathing madman? No way. Miller, you messed up bad. What happened to Max, a \"shell of a man\" who hasn't quite lost his humanity, only long forgotten and buried it. In this way this movie pisses me off, in the same way \"The Phantom Menace\" did. And yet, 9 out of 10. MILLER, you'r awesome!!!",
    "24": "The story is very simple and not that interesting for me. It had some cool action scenes, but that's quite it. The performance were fine, but it wasn't something mind-blowing. I think this movie is very overrated.",
    "25": "What to say about a movie like this one? It's easy. If you expect a difficult dramatic story then you are not going to like it. But if you expect an action movie about a whole lot of modified vehicles trying to take over a big modified truck in the middle of nowhere, with creepy looking humans, then you are going to love it. And that's what I was going to expect. I like movies like this one where you just relax and let the action come to you. Not all the time but sometimes I do enjoy a movie like Mad Max. The amateurs of steam punk will also like this one because almost everybody in this movie is strangely looking. The filming itself was good, the script is like I said what it is. It should not have been difficult to write that script. The actors all did their job like they should. Charlize Theron and Tom Hardy are the main characters and they are good actors. Nice action movie if you are into stuff like that, otherwise just pass on this movie and watch something else.",
    "26": "I hated this movie. I never got into the world or the characters. Perhaps it was the Mad Max of old and my nostalgia for that world but this was so different and less real than the world of the original Max. Max was leaden. He seemed almost irrelevant and I couldn't care for him. Furiousa was better and brought some interest to the adventure. Nux was just Nicholas Hoult in bad make-up. I don't generally like movies with endless fight and action scenes and this pushed that genre to the extreme. In the end it was plot free, character free nonsense.But. I can understand the appeal both to the action fan and to wider cinema audiences. The visuals were stunning, the world was unique and the pace and intensity was startling. Immerse yourself in the world and the action and I could understand this could reach 10 out of 10 proportions. I never got there and sadly hated every minute. Just a personal view.",
    "27": "I just didn't like the movie from the start and wanted to stop watching it immediately. It was just unexplained action from the beginning with no plot at all. I don't know how people can like these types of geeky movies with all the science fiction bs. It would have been decent if it had an actual plot and not just over the top action.",
    "28": "This movie was a serious disservice to the classic series. So many things in this movie were just plain stupid. The only thing redeemable about this is the original premise...everything else was intellectually devoid of reason. Special effects were pretty good and \"some\" of the action was good, as well. Unfortunately, the dialog and events just didn't mesh because they were just so bad...so poorly written and executed.",
    "29": "One of the best films I have ever seen, with excellent directing from George Miller, the filming in the movie was excellent and the movie was full of crazy characters like the guitar player, the accountant and the main villain was not awesome and Max did not have that effect in the movie and the least of them was crazy and Tom hardy mastered the character Max and I liked it very much. The character of Furiosa was one of the best characters in the film, and the action scenes in the film were great, especially the scenes before the storm and the characters in the green place to be good and wives whose characters were not good and I recommend watching the film strongly",
    "30": "The action alone is what makes this movie, which is directed very pristinely for the most part. It really slowed down in the middle but other than that it was entertaining. While I couldn't get behind other characters as much and wasn't entirely on board with the Universe and the craziness surrounding it, I didn't feel like I needed to! I still liked Tom Hardy's character quite a bit though. It's one of the better action movies I've seen for sure!",
    "31": "My eyes and ears were sore after watching this film it's got to be the worst film I've ever seen.",
    "32": "I was so amped for Mad Max after seeing the average review was high... WTF? Is it mob mentality or is it crafty advertising because this movie was not good... No character arcs except for Nux and his was so contrived and abrupt that it shouldn't count... the basic story was very lame... the plot was goofy... all the 2D character villains with their bizarre mutations (the hovering baby-man? This movie had shades of Total Recall)... 12 year old boys should like this movie ... When Furiosa walked sadly into the desert and took off her robot arm that was very poorly done... I wanted to scoff out loud but I didn't because I was in a theater... but I'm sure many there would have appreciated it... I see in the user review section that there are a significant number of equally bad reviews... thank you to those intelligent members of the IMDb community for the support... so I don't think I'm insane as Mad Max too for not liking a popular movie... I'll investigate the user reviews here more closely next time so I don't get burned again... I still hope to see some awesome Furiosa cosplayers in the future so that adds a few stars.",
    "33": "Movie about cars going really fast, but every shot looks like great concept art, and the characters all have great development. Most of the CGI is great, but some is shoddy. I don't really care because it works with the cartoony fun of the action. Don't listen to the soundtrack while driving.",
    "34": "I grew up with Mad Max, and The Road Warrior, and I apologize for Thunderdome. I was 13 when it came out, so I was clearly a target demographic. But that one was to save the kids, and now we're saving the chicks.Yes, I heard all the uproar when it came out, and it concerned me. I also remember watching the previews with an arched eyebrow, and ALL of those fears came true. The flamethrower guitar is ridiculous and pointless. Just dumb. Mounting your blood-donor to the front of your car, and then using nitro? Seriously? Hogtie him, and throw him in the back-seat, or the trunk. Isn't it important that you keep him alive if he is giving you a constant blood transfusion? But, it looks cooler if you strap him to the hood, and don't put any eye protection on. It's just a desert. No rocks, or dust or anything.Every single time a woman bit it, there was a stop in action to reflect on the loss. EACH time. When the preggo chick fell, it affected EVERY cast member in the movie. It was TRAGIC to lose a woman, but dudes were getting offed a mile a minute. And their clothes stayed amazingly pure and white throughout the movie. Every male in the movie is either horribly flawed and evil, or exists to serve the women. Max and the kid are the only \"good\" ones. At the end, the benevolent women turn on the water for everyone. ... In, what has got to be, the WORST water-distribution system in existence. I'd like to believe that Joe was actually rationing a limited supply of water, and now these silly binks have just made the world's largest mud puddle for a week.This movie did not remind me of the first two, at all. Yeah, they had the double-barreled shotgun with the dead shell. Whoopie. Did that one-armed chick, really hold a guy by his leg for a couple of minutes, while crushing a speeding car between her rig and another? Mmmkay. He weighs, what? 200 pounds? And she's going to one-arm it, with her robot arm that is strapped on? Wow.I am VERY glad that I refused to see this in the theaters. This is not something that I would have liked to contribute to. Thanks BitTorrent, because I would have been IRRITATED to have paid for this crap. I did notice that the commercials for it stopped pretty much as soon as it came out. That usually means it's all promotion hype, and that usually means a mediocre experience at best. I was so bored and uninterested at times, I put it on pause and went and did other things. I was never glued to my couch, and I felt that I was struggling to finish it.Craptastic. On ... just about every level. Should have been titled: Mad Max - Chopped & Screwed.https://youtu.be/6sk5IuIjr1E?t=50",
    "35": "First I loved the original Mad Max films, OK Thunderdome was a bit iffy but it was OK. This has to be the worst film I have seen this year and I was so looking forward to it. I have seen others call it a masterpiece or work or genius. I don't know what planet they are living on.. No real story and Tom Hardy who is a great actor only spoke about 25 lines in the whole movie. The actions scenes are great and the whole film is action scenes but we know nothing about the characters. Most of the film seems to be a rehash of the chase at the end of Mad Max 2 But with Mad max 2 there was a character build up.This is one film I will not be adding to my DVD collection If I had paid to see this I would be knocking down the door for a refund!!!",
    "36": "Mad Max: Fury Road Review Just had the chance to watch this movie. Mad Max isn't so much a remake but rather a continuation of the story. It starts of with Max already in the post apocalyptic world. Where as Mad Max 1 was a prelude with still having some law enforcement in the world. and the rest of the series is set after all of the chaos breaks out. Fury Road is set in the same universe.The Story is fairly simple, but still enjoyable and loyal to the Mad Max Universe. Furiosa helps young women escape Immorten Joe and is headed for her childhood home. Through Actions of one of the War boys to tag along Max with him, They end up on the War Machine of Furiosa and end up trying to help become free.The Acting for most part wasn't bad. I do feel that Tom Hardy wasn't the best choice as I never really felt that he was mad like (Mel) he actually reminded me and my friends of his portrayal of Bane. His accent and voice were very close to the one he did in Bane, he also had very limited number of lines and that just made it more like Bane, not to mention that he carried himself as big guy with muscles, even though the whole time his body was covered, you felt his size in the film.Pacing is what i loved the most from the film. It had the perfect amount of actions separated with suspense moments to draw you back in before unloading more fast paced action. Right from the start we start of with some chases which don't just stop but actually slow down for you to be able to enjoy them a lot, and then the director uses the sense of character waiting and reaction shots to tell the story of action as to not over bore you with it. But most importantly the actions scenes are never the same and vary a lot. So that you don't have that feel, \"Oh its the same fight as before in the movie\" This is a very solid movie. I give two thumbs up to the director for actually making the film very well paced. Much better then Avengers Age of Ultron and all of the Transformer films, They both can take a lot away from his style. 8.5/10",
    "37": "Unless you are a brainless person, there's no way that you can even come close to enjoy this movie. Movie was so bad that some people left the cinema in the middle. You can't really trust the other reviews here. It's just a bunch on explosions and ridiculous fighting scenes. I can only imagine that people are getting paid to write good reviews here. The whole plot of the movie fits in a single tweet and still leaves space for some facepalm emojis: \"lets escape, lets go back, the end (facepalm) (facepalm) (facepalm)\".",
    "38": "Water is a scarce resource so when it is dispensed and made available to the populace it is by opening a valve of some sort that allows it to cascade from a cliff face and down onto an arid dry dessert floor bed. Some people have cups, mugs and buckets to catch it in, so hey it's not a total waste. We see some water in the film, but no sign of food apart from the two headed mutant lizard Mad Max stamps on and eats, there really isn't any implication of how anyone gets a meal in a dessert with no water and the occasional lizard or bug. Despite this there is a demigod like figure who is worshipped by a populace of thousands. Not really the every man for himself, dog eat dog world of the future one may have been expecting then.And as for where the gasoline is coming from, well what does that matter, even though oil was the principle cause for conflict in all previous films as it was the most valuable commodity it's not even an issue here even though it's the stuff that sustains the film's entire action sequence.The flashbacks imply Mad Max's past, we see them at the beginning when he's being pursued by some sort of dance troupe in make up, or the bad guys. What the dessert lack's in water is compensated by a tremendous amount of white powder and dark eyeliner. But really the film just becomes very monotonous and even giving the film this amount of attention is quite undeserving of the film itself.",
    "39": "Mad Max: Fury Road did not appeal to me in the slightest.I chose to watch this film as it featured the great Tom Hardy and had a decent 8.1 IMDb rating but was disappointed.The plot was basic and simple - driving through the desert for 2+ hours. This bored me and I was waiting for the movie to end.I also believed that the attempts to achieve style were flawed - such as the pointless guitarist (?).This is just my opinion as I am aware many people love this film, but personally I just didn't get it.",
    "40": "Max is minus in this film and gets outplayed easily by Charlize Theron and I guess the director was so glad to have her that she's by far the most interesting character of this action only flick. The story only serves to connect the action sequences which are abundant but after a while you sort of get numb to everything that is displayed before your eyes. This becomes even more clear when they turn around and do the whole thing over again stretching the film even longer and adding absolutely nothing. It had some interesting ideas but all of that never gets of the ground and the realness is lost because the genuine gritty Australian actors of the first 3 installments are replaced by Americans who seem to have no connection with the dystopian desert they're living in. Also the rough straight up violence is changed to a Chinese circus version making everything feel really choreographed and there for fake so you don't feel the tension that was done so well in the original trilogy. The CGI dust storm was the point I should have hit the stop button but I was somewhat hoping things would get better when Hardy gets freed from the mouthpiece stuck to his face,but sadly it didn't.Theron brings some weight to this but the other characters are so laughable which made it all just some what painful to watch. I simply can not understand that a director who made these masterpieces before now goes out in this way and kills his own creation. I strongly suggest his next film should be a parody titled, mad Maxine: blurry road. Which is the road the writers were on when they wrote this abomination.",
    "41": "I don't know what I find more shocking - just how bad 'Fury Road' is, or the fact that it has an average rating of 8.1 on IMDb. If you want to spend two hours watching back to back action sequences, explosions and car chases without really caring for any sort of story or plot, then this is just for you.I didn't particularly like the other 'Mad Max' films, but I would watch any of them again over this. Literally NOTHING of significance happens during the entire duration of 'Fury Road'. Nothing. This is easily one of the most boring, pointless films I've ever seen in my life, and one of my least favourite. It has no redeeming qualities at all. Not one.Unless you want to stare at repetitive action sequences and have you ear drums ruined by persistent noise for two hours, I suggest you avoid this pathetic excuse of a movie.",
    "42": "AWFUL!! After the first 20 horrific minutes of watching this garbage flick I started fast forwarding to get it over with and see where it would go. The movie never got better. It was all blow 'em up special effects, stupid dialog, and a number of the scenes were sped up and looked silly with people moving in fast motion. Whoever directed this should go to director's school. I think Tom Hardy and Charlize Theron needed a paycheck. Worse they probably did not read the scripts before saying yes. Do not waste your time with this garbage unless you desperately want to see lots of special effects. Watching the laundry spin in your washing machine if more interesting.",
    "43": "This movie is stupid. Is it supposed to be this outrageous nonsense? I had to turn it off because it was just so damn idiotic. I watched it when it came out and njoyed it for what it was, but when revisiting i couldnt stand this garbage. I watched it for like 10 minutes before i couldnt take it anymore. Whats up with the high rating? Are we as a culture so used to being spoon fed such total crap from hollywood that we jump at the chance to love a piece of trash like this? I do not get the hype and i cannot watch this garbage ever again. The acting was done very well and i give credit to the actors and actresses for a job well done, but the writing and the feel of this movie is not good at all. Watch something else like umm i dunno...anything.",
    "44": "N the future, the world is an industrialized labor intensive oligarchy. Women are used as \"breeders.\" Furiosa (Charlize Theron) whose name sounds like a Harry Potter spell, absconds with a group of women and heads east toward \"the green land.\" She is pursued and confronted and that is basically the story in a nutshell. Mad Max (Tom Hardy) who can't recall his name, becomes a prisoner, universal donor, hood ornament, fighter, ideas man, and a fuel injector. His lack of dialogue made him a rather boring character and when he spoke, they weren't gems like other little speaking characters...\"I'll be back.\"In spite of the limited personality of the title character, the rest of the film is action packed as goes the Hollywood remake trend to please the younger audiences who prefer video game action over an involved plot. The left has proclaimed this a \"feminist\" film due to the role of Theron as a leader rebelling against the order and will of men. There may be a message there somewhere within the recess of what amounts to a shallow popcorn film, but I didn't desire to think that deep.The action is almost non-stop. This would have an appeal to those who love monster trucks, dirt bikes, pretty girls, and demolition derbies.Now at one point, there is a discussion of traveling in one direction for 160 days on bike. Assuming they ride a modest 500 miles a day, they could circle the globe 3 times (proper land bridges) yet they...Break out the popcorn.Guide: I caught 2 quick F-bombs. No sex. Wet tops. Distant rear nudity. Not much in blood and gore, mostly vehicle crashes and explosions",
    "45": "I'm a huge fan of Mad Max and The Road Warrior. There is a believability in those two films. This is way over the top, way too predictable and way too tired. Max now fights like Matt Damon in Bourne Identity which is something new. And now we have CGI added in the mix which takes away the \"Organic\" feel of it don't you think?Organic, not a term I like to use but frankly, the first two films did feel that way. This is way too much, way too long and over the top. Also, there aren't too many characters to love here and that's a problem.Lastly, this all seems meaningless and stupid. Go back where you came from after trying so hard to escape? It just all seems so dull and tiresome.",
    "46": "This is an another perfect example of beautifully photographed and masterfully directed piece of writing garbage. Except for a nonsense far-fetched story, there is also almost no acting, no jokes and no laughs. Everything is accomplished through design, makeup, sfx and camera/direction. Good casting made no point here. Tom Hardy is not Max, especially if you remember mad Gibson. The same goes for other characters. Mr. Miller should have left the sleeping dogs lay after 30 years. This attempt to reboot fails in most aspects. No story, no emotions, no drama, no mad Max (crazy - yes, mad - no) and so on. As the title says: hollow. Worth a look, though, for comparison with previous sequels. This movie has no soul.",
    "47": "This is slaying of another franchise. This author of this movie must have some kind of brain cancer.It starts off mediocre. Some white pale skin \"Warboys\" is out for Max and seeking death in combat thus entering Valhalla. In this useless movie, the bad guys seems to have unlimited resources, whilst having an almost perfect society, with working order, unlimited supply of fresh water, mechanized grow yards and much more, not at all the previous mad max movies, where raiders were primitive yet only pillaging and unable to achieve anything by themselves. In this movie MadMax is out to destroy their working society conscripting matriarchal motor gang for the task. And the old hags are killing war boys in a Japanese style killing spree. How this movie ever got above 4 in score is a mystery. Did the staff at IMDb get bribed? Database got hacked? Its a disaster. Acting is awful and all actionsceenes have been seen before. I really loath this movie and if i could give it minus i would.",
    "48": "Great film, so fast-paced it makes every other film out there look slow and old-fashioned. Wonderful to see George Miller back on the Australian road, where he belongs. Charlize Theron is great, Tom Hardy is not bad, but the stunts are really where the film shines. It's hard to think of a better action road movie. It has all the intensity and perversity of the MAD MAX and THE ROAD WARRIOR, but amped up to new heights of craziness. Miller is the real star of the film -- in some ways technology seems to have finally caught up with his early hyperactive camera style, and he takes full advantage of the ability to move wherever he wants, however he wants.",
    "49": "Tom Hardy and Charlize Theron are two wonderful forces of nature, bringing to life and into a hellish universe two characters who become classics from the beginning. Mel Gibson gave us the first interpretation of the role, but it took revisiting the material and finding a new actor to truly present what Max is all about. Hardy is a jaded creation who exists to survive. He has that hard look, driven, and with all of his priorities set to survival mode. He recognizes that you can't sit still here, and there is no sense in worrying if you want to live.He finds himself prisoner of a set deviants/mutants that plan on killing him for sport. Max soon finds himself in the middle of a car chase that will eclipse anything else you have seen before. At first, he observes everything around him, as he is on the hood of vehicle which is the stuff nightmares are made of. In the opening scenes, he manages to go through something that could be describe as the place where hell touched Earth, with lighting storms, sand storms, wind storms, and just about anything else that can be thrown at him. He pulls through in what many less ambitious directors would have saved fr the final frames, but in \"Fury Road\", this is just the beginning, and in the hands of George Miller, a man who is around 70 years old, we get what was just a promise in the previous films.The universe is fully developed, with just about every hellish detail up on the screen, every element coming together in almost a magical way for not much is spoken to allow a skilled director to extract emotions, reactions, and powerful images from what his camera captures, a much impressive achievement when one considers the amount of spectacular moments throughout the entire film. As I said before, the opening scenes only serve as the launching pad of what will be recognized as many as unbelievable, breathtaking, and utterly satisfying.In this film, vehicles will burn, crash, tumble, fly, and spit fire continuously, and the drivers are not just ridicule caricatures like those in a recent release. There is power, disgust, hate, hunger, envy, and almost anything else you can think of emanating from everyone on the screen, even the angelic wives/prisoners are not empty shells. One can feel every emotion by letting Miller's sirens seduce and leads into total shock and admiration, not believing that what we have seen is possible. Here CGI doesn't overpower and sterilize the content. Many action films suffer from a mismanagement of resources. Here Miller works with what he knows best, but he still uses CGI to increase the power of what one sees in this movie. Very little looks fake, and nothing is sacrificing to reckless waste of money.Miller has given us a film that captures the magic of movie-making, the realization of its power. This is the masterpiece many dream of, where nothing and no one is spared. Every penny is showcased one way or another. There are no egos to satisfy, just goals to achieve, and these are accomplished. Miller should, like others before him clean his favorite space at home in order to display whatever type of recognition he seriously deserves. Much has been made of a gimmicks recently. \"Birdman\" tried to blend the mania of a troubled mind with harsh reality,and it sorely failed. Here is film which entertains, never bores, and certainly is able to mix intelligence, the hells which some beings carry in their souls, and the possibility that a future like Max's might not be that distant. The film is not fantasy, it's the type of science fiction which shows the almost certain possibility of what might be coming.I never understood why some films had a certainly look, but they lacked vision, charm, or anything remotely intelligent, and the disappointment hurt. No one will walk away from \"Fury Road\" because Miller respects the audience, understand that unless some is \"real\" and we are able to somehow relate, the experience will be meaningless. \"Fury Road\" combines the best of acting and craftsmanship. It's pure, powerful, and it delivers a visceral punch, making the best use of everyone of our senses, giving us an experience that feels fresh and visionary. Miller hasn't copied anyone, instead he has set the bar high for many, and maybe he will be that inspiration that will give many an idea of what it takes to make an almost perfect film, something with much imagination and power, something that is quite remarkable, considering how Hollywood has started cannibalizing its own classics and/or surrendering to the desire to just mass produce movies. Here is a film that proves that it's possible to dream, even if the images are those who will make you wonder if hell is here on Earth.",
    "50": "Don't take my word on this one. I recognize that I am in a small minority of people who didn't care for this move. It wasn't bad! I just think it wasn't for me. The crazy vehicles were obviously pretty cool but I couldn't rationalize the worldbuilding in it. Broke my suspension of disbelief and I couldn't really enjoy the rest of the movie I guess.",
    "51": "Utter garbage. No plot spoilers because there is no plot. Why is this film so highly regarded? Production design and stunts are great but this doesn't make it a great film. Sad",
    "52": "Actors that mumble their lines, dialogue that means next to nothing and a plot that goes nowhere. Complete waste of a decent cast like Tom Hardy and Charlize Theron.The original movie is currently at 6.2, marketing ploy has this one at 8.7. IMDb needs to start removing the advertisers. If you must watch it, bring your own soundtrack. At least by the time you get bored, you'll have some entertainment.On second thought, watch another movie please. Seriously. Let's not reward this gamification of ranking system with more money to feed the machine.",
    "53": "Lets make one thing clear there is no way to say this movie was great.From the first second you are put right into a hostile environment where without any argument a man gets attacked. It stays unclear why (because it stays unclear why the half living needs its blood. that half living seems fine without it the rest of the film.) Though that isn't why i grade this movie so extremely low. The thing is that there is nothing more to the film than chasing each other till some key figure dies. Every moment i was watching for something new and impressive. Butt even the guitar/drum car was not loud enough to be that. The bomb sticks are immensely overrated and multiple armies can't take out one single truck loaded with water. There I named another point of annoyance the amount of water they keep with them in a car chase. Who takes a truck full of water to a chase? They could at least have dumped some to be a bit lighter.So there is now way you can call this a good movie. It was a boring slow and monotonous action movie that does not deserve a rating above 4 stars. It's a shame that even todays critics call this a good movie.",
    "54": "I only got around to seeing the original \"Mad Max\" just about a month ago, thirty six years after the fact. Considering the amount of favorable press this film got and the huge amount of award nominations and wins it's already sustained, I figured I wouldn't wait around so long to see this one. Probably won't make it anyway but that's neither here nor there.Not generally a fan of these types of films, I'd be less than honest if I said I didn't get a certain eerie pang of visceral thrill out of the whole thing. The characters and action are so mind-blowingly furious it makes it hard to keep up. I also got a kick out of the odd names the writers came up with, though if I were watching this without captioning I would probably have been totally lost.I don't know if it necessarily takes a warped mind to concoct something like this, but then again, George Miller also wrote and directed \"Happy Feet\", so there's obviously a creative bone in his body to speak of. Where the vision comes from is probably the better question. On a different day and in a different mood I might have experienced this picture entirely differently, but catching it the way I did, I have to say it was quite the experience.",
    "55": "As the world and the people who parasite on its surface seem intent on heading in the direction of this soothsayer of a film - why not get a head start! Shave your head, start storing water and acquire a copy of Engine Upgrades for Dummies.",
    "56": "If you hate awe inspiring action sequences, little dialog, and post apocalyptic salvation movies you should watch this. You will. If you love those cinematic styling already then you should watch this. You will even more. See it in 3D, it is the type of experience that develops in it's own world with it's own identity separate from the previous installments and in plain enough terms for anyone to relate to. The inevitable visions, actors placed in the right situations, and ability to be long enough to tell the perfect time line but not grow stale make it a trip worth taking. Take it. There are no pointless moments or dead space, it utilizes every second to fill your quivering eyes with dazzle.",
    "57": "I really wanted to like this movie. I read the glowing reviews and eagerly went to see the movie this afternoon. I sat in the theatre and kept waiting to be moved by the action or the plot and felt absolutely nothing but boredom and sadness.I am a fan of Mad Max and Road Warrior. Thunderdome was garbage and although this wasn't garbage it was far from good. I mean, did they really need a mutant midget?! Did they really need a blind mutant guitarist on the front of a truck?! In a post apocalyptic world are we really going to see that many women that look as if they've just stepped off a model's runway? Besides all the things that are just preposterous or don't make sense there is absolutely no character development and the characters do not make any sort of connections themselves. What we get is a lot of car chase with a lot of things blowing up around some very attractive visuals, but little plot or any real reason to care about the characters or the movie itself. I for one am really disappointed.",
    "58": "N the future, the world is an industrialized labor intensive oligarchy. Women are used as \"breeders.\" Furiosa (Charlize Theron) whose name sounds like a Harry Potter spell, absconds with a group of women and heads east toward \"the green land.\" She is pursued and confronted and that is basically the story in a nutshell. Mad Max (Tom Hardy) who can't recall his name, becomes a prisoner, universal donor, hood ornament, fighter, ideas man, and a fuel injector. His lack of dialogue made him a rather boring character and when he spoke, they weren't gems like other little speaking characters...\"I'll be back.\"In spite of the limited personality of the title character, the rest of the film is action packed as goes the Hollywood remake trend to please the younger audiences who prefer video game action over an involved plot. The left has proclaimed this a \"feminist\" film due to the role of Theron as a leader rebelling against the order and will of men. There may be a message there somewhere within the recess of what amounts to a shallow popcorn film, but I didn't desire to think that deep.The action is almost non-stop. This would have an appeal to those who love monster trucks, dirt bikes, pretty girls, and demolition derbies.Now at one point, there is a discussion of traveling in one direction for 160 days on bike. Assuming they ride a modest 500 miles a day, they could circle the globe 3 times (proper land bridges) yet they...Break out the popcorn.Guide: I caught 2 quick F-bombs. No sex. Wet tops. Distant rear nudity. Not much in blood and gore, mostly vehicle crashes and explosions",
    "59": "I'm a huge fan of Mad Max and The Road Warrior. There is a believability in those two films. This is way over the top, way too predictable and way too tired. Max now fights like Matt Damon in Bourne Identity which is something new. And now we have CGI added in the mix which takes away the \"Organic\" feel of it don't you think?Organic, not a term I like to use but frankly, the first two films did feel that way. This is way too much, way too long and over the top. Also, there aren't too many characters to love here and that's a problem.Lastly, this all seems meaningless and stupid. Go back where you came from after trying so hard to escape? It just all seems so dull and tiresome.",
    "60": "This is an another perfect example of beautifully photographed and masterfully directed piece of writing garbage. Except for a nonsense far-fetched story, there is also almost no acting, no jokes and no laughs. Everything is accomplished through design, makeup, sfx and camera/direction. Good casting made no point here. Tom Hardy is not Max, especially if you remember mad Gibson. The same goes for other characters. Mr. Miller should have left the sleeping dogs lay after 30 years. This attempt to reboot fails in most aspects. No story, no emotions, no drama, no mad Max (crazy - yes, mad - no) and so on. As the title says: hollow. Worth a look, though, for comparison with previous sequels. This movie has no soul.",
    "61": "This is slaying of another franchise. This author of this movie must have some kind of brain cancer.It starts off mediocre. Some white pale skin \"Warboys\" is out for Max and seeking death in combat thus entering Valhalla. In this useless movie, the bad guys seems to have unlimited resources, whilst having an almost perfect society, with working order, unlimited supply of fresh water, mechanized grow yards and much more, not at all the previous mad max movies, where raiders were primitive yet only pillaging and unable to achieve anything by themselves. In this movie MadMax is out to destroy their working society conscripting matriarchal motor gang for the task. And the old hags are killing war boys in a Japanese style killing spree. How this movie ever got above 4 in score is a mystery. Did the staff at IMDb get bribed? Database got hacked? Its a disaster. Acting is awful and all actionsceenes have been seen before. I really loath this movie and if i could give it minus i would.",
    "62": "Great film, so fast-paced it makes every other film out there look slow and old-fashioned. Wonderful to see George Miller back on the Australian road, where he belongs. Charlize Theron is great, Tom Hardy is not bad, but the stunts are really where the film shines. It's hard to think of a better action road movie. It has all the intensity and perversity of the MAD MAX and THE ROAD WARRIOR, but amped up to new heights of craziness. Miller is the real star of the film -- in some ways technology seems to have finally caught up with his early hyperactive camera style, and he takes full advantage of the ability to move wherever he wants, however he wants.",
    "63": "Tom Hardy and Charlize Theron are two wonderful forces of nature, bringing to life and into a hellish universe two characters who become classics from the beginning. Mel Gibson gave us the first interpretation of the role, but it took revisiting the material and finding a new actor to truly present what Max is all about. Hardy is a jaded creation who exists to survive. He has that hard look, driven, and with all of his priorities set to survival mode. He recognizes that you can't sit still here, and there is no sense in worrying if you want to live.He finds himself prisoner of a set deviants/mutants that plan on killing him for sport. Max soon finds himself in the middle of a car chase that will eclipse anything else you have seen before. At first, he observes everything around him, as he is on the hood of vehicle which is the stuff nightmares are made of. In the opening scenes, he manages to go through something that could be describe as the place where hell touched Earth, with lighting storms, sand storms, wind storms, and just about anything else that can be thrown at him. He pulls through in what many less ambitious directors would have saved fr the final frames, but in \"Fury Road\", this is just the beginning, and in the hands of George Miller, a man who is around 70 years old, we get what was just a promise in the previous films.The universe is fully developed, with just about every hellish detail up on the screen, every element coming together in almost a magical way for not much is spoken to allow a skilled director to extract emotions, reactions, and powerful images from what his camera captures, a much impressive achievement when one considers the amount of spectacular moments throughout the entire film. As I said before, the opening scenes only serve as the launching pad of what will be recognized as many as unbelievable, breathtaking, and utterly satisfying.In this film, vehicles will burn, crash, tumble, fly, and spit fire continuously, and the drivers are not just ridicule caricatures like those in a recent release. There is power, disgust, hate, hunger, envy, and almost anything else you can think of emanating from everyone on the screen, even the angelic wives/prisoners are not empty shells. One can feel every emotion by letting Miller's sirens seduce and leads into total shock and admiration, not believing that what we have seen is possible. Here CGI doesn't overpower and sterilize the content. Many action films suffer from a mismanagement of resources. Here Miller works with what he knows best, but he still uses CGI to increase the power of what one sees in this movie. Very little looks fake, and nothing is sacrificing to reckless waste of money.Miller has given us a film that captures the magic of movie-making, the realization of its power. This is the masterpiece many dream of, where nothing and no one is spared. Every penny is showcased one way or another. There are no egos to satisfy, just goals to achieve, and these are accomplished. Miller should, like others before him clean his favorite space at home in order to display whatever type of recognition he seriously deserves. Much has been made of a gimmicks recently. \"Birdman\" tried to blend the mania of a troubled mind with harsh reality,and it sorely failed. Here is film which entertains, never bores, and certainly is able to mix intelligence, the hells which some beings carry in their souls, and the possibility that a future like Max's might not be that distant. The film is not fantasy, it's the type of science fiction which shows the almost certain possibility of what might be coming.I never understood why some films had a certainly look, but they lacked vision, charm, or anything remotely intelligent, and the disappointment hurt. No one will walk away from \"Fury Road\" because Miller respects the audience, understand that unless some is \"real\" and we are able to somehow relate, the experience will be meaningless. \"Fury Road\" combines the best of acting and craftsmanship. It's pure, powerful, and it delivers a visceral punch, making the best use of everyone of our senses, giving us an experience that feels fresh and visionary. Miller hasn't copied anyone, instead he has set the bar high for many, and maybe he will be that inspiration that will give many an idea of what it takes to make an almost perfect film, something with much imagination and power, something that is quite remarkable, considering how Hollywood has started cannibalizing its own classics and/or surrendering to the desire to just mass produce movies. Here is a film that proves that it's possible to dream, even if the images are those who will make you wonder if hell is here on Earth.",
    "64": "Don't take my word on this one. I recognize that I am in a small minority of people who didn't care for this move. It wasn't bad! I just think it wasn't for me. The crazy vehicles were obviously pretty cool but I couldn't rationalize the worldbuilding in it. Broke my suspension of disbelief and I couldn't really enjoy the rest of the movie I guess.",
    "65": "Utter garbage. No plot spoilers because there is no plot. Why is this film so highly regarded? Production design and stunts are great but this doesn't make it a great film. Sad",
    "66": "Actors that mumble their lines, dialogue that means next to nothing and a plot that goes nowhere. Complete waste of a decent cast like Tom Hardy and Charlize Theron.The original movie is currently at 6.2, marketing ploy has this one at 8.7. IMDb needs to start removing the advertisers. If you must watch it, bring your own soundtrack. At least by the time you get bored, you'll have some entertainment.On second thought, watch another movie please. Seriously. Let's not reward this gamification of ranking system with more money to feed the machine.",
    "67": "Lets make one thing clear there is no way to say this movie was great.From the first second you are put right into a hostile environment where without any argument a man gets attacked. It stays unclear why (because it stays unclear why the half living needs its blood. that half living seems fine without it the rest of the film.) Though that isn't why i grade this movie so extremely low. The thing is that there is nothing more to the film than chasing each other till some key figure dies. Every moment i was watching for something new and impressive. Butt even the guitar/drum car was not loud enough to be that. The bomb sticks are immensely overrated and multiple armies can't take out one single truck loaded with water. There I named another point of annoyance the amount of water they keep with them in a car chase. Who takes a truck full of water to a chase? They could at least have dumped some to be a bit lighter.So there is now way you can call this a good movie. It was a boring slow and monotonous action movie that does not deserve a rating above 4 stars. It's a shame that even todays critics call this a good movie.",
    "68": "I only got around to seeing the original \"Mad Max\" just about a month ago, thirty six years after the fact. Considering the amount of favorable press this film got and the huge amount of award nominations and wins it's already sustained, I figured I wouldn't wait around so long to see this one. Probably won't make it anyway but that's neither here nor there.Not generally a fan of these types of films, I'd be less than honest if I said I didn't get a certain eerie pang of visceral thrill out of the whole thing. The characters and action are so mind-blowingly furious it makes it hard to keep up. I also got a kick out of the odd names the writers came up with, though if I were watching this without captioning I would probably have been totally lost.I don't know if it necessarily takes a warped mind to concoct something like this, but then again, George Miller also wrote and directed \"Happy Feet\", so there's obviously a creative bone in his body to speak of. Where the vision comes from is probably the better question. On a different day and in a different mood I might have experienced this picture entirely differently, but catching it the way I did, I have to say it was quite the experience.",
    "69": "As the world and the people who parasite on its surface seem intent on heading in the direction of this soothsayer of a film - why not get a head start! Shave your head, start storing water and acquire a copy of Engine Upgrades for Dummies.",
    "70": "If you hate awe inspiring action sequences, little dialog, and post apocalyptic salvation movies you should watch this. You will. If you love those cinematic styling already then you should watch this. You will even more. See it in 3D, it is the type of experience that develops in it's own world with it's own identity separate from the previous installments and in plain enough terms for anyone to relate to. The inevitable visions, actors placed in the right situations, and ability to be long enough to tell the perfect time line but not grow stale make it a trip worth taking. Take it. There are no pointless moments or dead space, it utilizes every second to fill your quivering eyes with dazzle.",
    "71": "I really wanted to like this movie. I read the glowing reviews and eagerly went to see the movie this afternoon. I sat in the theatre and kept waiting to be moved by the action or the plot and felt absolutely nothing but boredom and sadness.I am a fan of Mad Max and Road Warrior. Thunderdome was garbage and although this wasn't garbage it was far from good. I mean, did they really need a mutant midget?! Did they really need a blind mutant guitarist on the front of a truck?! In a post apocalyptic world are we really going to see that many women that look as if they've just stepped off a model's runway? Besides all the things that are just preposterous or don't make sense there is absolutely no character development and the characters do not make any sort of connections themselves. What we get is a lot of car chase with a lot of things blowing up around some very attractive visuals, but little plot or any real reason to care about the characters or the movie itself. I for one am really disappointed.",
    "72": "If you want to see a 2 hour action scene this is the movie for you. On the other hand if you want to have something as silly as a story you won't find one here.The basic plot: \"we have to go that way!\" Gets there. \"No,we have to go back!\" Gets back. The End!The worst thing is it's \"Mad Max\" but you can take out Max and there would be absolutely no difference in the movie* Maxs' best line.",
    "73": "Underwhelming, annoying and mediocre also come to mind. If the name \"Max\" wasn't in the title, I wouldn't have known that this was a Mad Max film -- and I wouldn't have wasted my time trying to watch it. I've seen the first three, and yeah, there were deficiencies, but I still loved them, wanted to watch them again, and when finished, felt happy, even content, feeling I'd been part of a story being told. But this... this is a huge piece of expensive crap. This has nothing to to do with the Mad Max experience. There was no story, there was no reason for this... this huge piece of expensive crap. Whoever was supposed to be playing Max, needn't have bothered showing up, he had the charisma and presence of a box of hair. And Charlize Theron, well, I had a lot of respect for her choice of acting jobs... until now! Granted, neither of these actors were given much to work with to begin with, so this movie isn't necessarily a reflection of their capabilities. As others mentioned, there was absolutely no character development, I couldn't have cared about any of these people, and since I'm never happy to just sit around, thinking; \"Whoah, that blowed up reel guud!\", this was a complete waste of my time.Not only that, but I found that the CGI were really bad. Really obvious. Not sure why everyone is praising the \"action\" sequences of this film... oh, who am I trying to kid... there was nothing but action sequences. It was constantly obvious to me that it was all computer generated. Especially in the first part when \"Max\" was trying to escape. It was like watching a bunch of alien bugs on speed. At first, I thought it was a glitch, that the humans were moving so quickly yet so statically, then I realized it was all CGI. No real chase scenes. Why bother paying actors? This could all have been done on a computer. While reading all of the reviews praising this movie for it's visuals and action scenes, all I could think was, wow, why do these people have such low standards! I wish I were so easily pleased. Maybe a lot of the people who loved this spend a lot of time playing computer games; you know, living life at a distance, cos that kind of describes this movie -- you're just watching it, observing it, from a distance -- you never get drawn in so you can't be hurt by anyone in it or care about them. Unlike with the first three films, with all of their flaws. The first three films were upsetting in their extreme violence. This one was about as scary (or interesting) to watch as a computer game; no depth, nothing of note to take away with you.So call this what you want, but don't call it a Mad Max film, cos that, it most certainly wasn't. I guess the producers were hoping that the viewers would still remember any of the first three fondly, so they wouldn't have to put any real work into this one, just pull in the moolah. Which apparently they did. Definitely won't be excited by the prospect of another one.PS I also have to question the validity of the high score this movie has on IMDb. Either there's been some review tweaking going on, or vapid really is the new deep. I have to agree also that Theron's character was much more Mad Max like than the namesake ever was here. Strange choice to so clip the wings of the main character.",
    "74": "Mad Max: Fury Road is an action-packed adrenaline-fueled film with a ton of action. The cinematography in the film is incredible. The effects throughout the film were beautifully done. The film is highly recommended for great entertainment.",
    "75": "The Action genre has always been mixed, ranging from trashy profit- searching rubbish to thrilling, adrenaline fuelling epics (see Terminator 2 and Aliens).Mad Max: Fury Road thankfully fits into the latter category, but it is fundamentally and wonderfully different. Out goes the usual CGI, explained back story and lack of enough good characters, and in comes a truly insane thrill ride, that somehow manages to make 2 hours of following a truck one of the most enjoyable things to watch in recent times.Let's go over the one thing that I disliked about this film (and honestly, dislike is a fairly strong word in this case): The exposition. Or rather, lack of it. The extreme pace of the film results in details seemingly whistling by, meaning it can leave you wondering whats going on. But then again, the actual story foundations for the film are so small that really, it doesn't matter that everything isn't explained. So long as we know the names of the characters and where they're heading to next, nothing else really matters.What it chooses to focus on is an excellent cast, lovely cinematography and wondrous, wondrous carnage. Practical effects take the lead role here, with amazing vehicles, well timed explosions and constant tension and thrill. The benefits of this are best seen with the big crashes and the huge fuel tanker explosion towards the end of the film; it ends up looking stunning. The Polecats really make the most of this, adding an extra layer of danger while cementing the realism that the film thrives off of.I also particularly loved the sheer attention to detail; every car is different and exceptionally well designed. Sound work is equally amazing, with the soundtrack being entwined with vast array of engine noises, explosions and, in the case of the Doof Wagon (which I'm now calling one of the coolest things I've ever seen in a movie, ever), live rock music. Performances from the cast are excellent. Tom Hardy's Max is very much the usual gritty, rock solid hero that Gibson portrayed all those years ago. Charlize Theron's Furiosa (isn't that just the best name you've ever heard?) really stands out for me, balancing out Hardy's character with a strong and bold performance. And for once, it's a female action hero who hasn't been raised or taught by other men - she's a real self empowered super lady. Nicholas Hoult's character is also a personal favorite, while the Brides and the Many Mothers created an ensemble of female characters that don't get wasted like they so often do in other action flicks. Everyone gives an enthusiastic performance, and it only adds to the quality of them film.There's plenty more to praise here, but I'll highlight some of my personal favorite aspects from the film: The make-up and costume departments did an incredible job here, giving us a massive range of extras that really diversify the entire film. There are plenty of great names and phrases used in the film, including \"Bloodbag\", \"Immortan Joe\", \"The Organic Mechanic\" and \"The Bullet Farmer\". The film seemed to obey the laws of physics for the most part, and was especially good at ridding any infinite-ammo guns or strangely enough, unnecessary explosions.In conclusion, I can't say anything that is inherently negative about Fury Road. It's fresh, bold and so well made that you can't help but be enthralled by its insanity. On the face of it, it's nothing more than a overly long car chase, and yet it isn't. It adds just enough complexity right where it's needed - the characters, vehicles and action. Combined with the great array of characters, sheer attention to detail and wonderful cinematography, it's actually unusually diverse, and its humane undertones only help to differ it from normal action films. And in that respect, it's one of the best films in recent history.",
    "76": "Seriously, what happened? Mad Max and The Road Warrior were gritty, uncompromising, atmospheric and above all character driven. They deserve their status as classic post-apocalyptic films. Fast-forward 30 odd years where we have Mad Max: Fury Road, minus Mel Gibson but George Miller still in the directors chair, and it is impossible to recognise that this is meant to be linked to the earlier films. Its a film that is about as subtle as a jackhammer to the head.This is the story: Max and a load of women drive for days in one direction to escape a dictator who pursues them, then they turn around to drive back to where they came from. That is literally it. To say the film is thin on story would be a gross understatement. Not just that but the whole plot is a device in and of itself. They're making the journey to escape Immortal Joe and to reach Paradise, except it turns out that there is no such thing as Paradise anymore. They are in a post-apocalyptic world for heavens sake, I think its obvious that anywhere even remotely pleasant would have been long gone. To add to the insult Max is absolutely redundant in this film, for one I'm amazed he agreed to such an absurd idea to begin with (he's mad not stupid) and two its not his film. You could take him out, replace him with another girl and it would make virtually no difference to anything that happens. The characters are just weak as we learn nothing about any of them beyond a very simple motivation which is all we get, why should we care about any of these one-dimensional cardboard cutouts? The action can be summed up in one word, Overkill. There is a reason that not many people try to make films that are literally 2 hours of action scenes, because it will eventually get tedious and boring, which is exactly what happens here. On about the third time the truck is attacked I completely lost interest because I knew none of the major players were going to be killed. For action to work you need to feel like the characters really are at threat and will lose something, which I never felt and as a result it simply didn't work. By the halfway mark I was seriously weary, because the action sequences just kept banging on. There are hardly any slow or character building moments, with those that appear literally lasting a minute before quickly moving on to more explosions and cars being flipped over. Most of the sequences being practical effects is impressive, but its nowhere near enough to use it to praise the film to death like so many have. As stated, you'd be totally wrong if you thought we were going to get strong and interesting characters to make up for the other areas. Everyone said Charlize Theron gave a great performance, but I saw no evidence of that because she resembled an oak tree more often then not. All she did was brood or look angry, wow that's difficult to do. She handled the more emotional moments, if you would even go as far as to call them that, horribly and with an expression of total boredom. Tom Hardy (who is usually solid as a rock) is a horrid choice as Max. His expression never changes from confused neanderthal and he delivers the dialogue as if he'd just been kicked in the head by a mule. Not to mention he suffers badly from 'Russell Crowe in Robin Hood Syndrome' as his accent constantly swings from Good Day Bruce Aussie to vaguely Cockney to just incoherent mumbling. Everyone else is barely worth the mention. The girls who travel with them? Not one stood out or had any character beyond angry. Immortal Joe? Dull as dishwater. Even Nicholas Hoult is wasted as an extremely annoying rebel.Visually the film is very creative and looks unique which is probably its best feature, the world created is colourful and grimy exactly when it needs to be. That said I don't think the directing is anything out of the box, its simply not as frenzied as other recent action films (looking at you Michael Bay) and some of the CGI is ropey when it pops up. The are also a few surprisingly funny moments (notably the fella with the flare) which are a welcomed release from most of the straight-faced nonsense taking place. I do think the film is too weird basically just to be weird. I mean Immortal Joe's gang have a guitarist whose guitar shoots fire, sure it looks cool but it makes no sense. Yes its a strange world, but does it have to be an impractical one too? I'm really not sure why Fury Road is getting so much acclaim. Is it because it used practical effects in a time dominated by CGI? I actually think it is. Simply because it has nothing else going for it. The story? My last trip to the toilet had more of a plot. The characters? Calling them planks of wood would be an insult to planks of wood. The action? It's crash, bang, wallop for 2 hours non-stop. The whole thing of 'visual story-telling' is simply an excuse by brainless people to basically admit that when you think about it there is no story. Here's a tip to the creators. The two key things in a film are story and character, when your film severely lacks both then you're already in trouble.",
    "77": "To define it ? Profound dark is more than fine. Bloody ? Off course! But, more significant, example of high cinematography. And admirable storytelling. And not bad acting. A story dynamic and far to be comfortable and pure exces of CGI. But the result is more than the blockbuster who you expect or the modern version of the version of \"80 s. It is a story about loneliness , fall of dictatorship and splendid occasion to see Charlize Theron and Nicholas Hoult and Tom Hardy at work, in a film as large puzzle of memories about different influences. So, just great.",
    "78": "It is almost hard too put into words how bad this movie was: The plot was virtually nonexistent , Most of the acting (bar Hardy and Theoren) was absolutely diabolical ,The script was like a ten year old wrote it, And Oh My God what was with that guy and the flaming guitar???Before you assume that I hate action films and that I am only giving this movie a bad review because I hate action films. Your wrong. Action is my favorite movie genre , and I was so excited to see this movie , but during the film I actually found myself checking my watch every five or ten minutes because it dragged on for so long , and for what ? Absolutely nothing.This is probably one of the worst action films I have ever seen in my entire life and I do not recommend it too anybody. The only really good thing about this movie was the visual effects , which where great.Final verdict : 3/10",
    "79": "This movie is very, very boring. I don't know how people can sit through half of this without firing their brains off. This movie has absolutely no story.Won't ever recommend this to anyone.",
    "80": "With so many Oscars I feel guilty for not having liked the movie, maybe in the future I'll watch it... On October 2, 2019 NOTE: 6.5, reviewing by mistake and completely enchanted, not only for the effect, but also for the script, a bizarre, grotesque and hideous dystopian future, I even changed the note... Fantastic...",
    "81": "Yo punishable by death just letting you know that this movie was shot using 80% practical effects and that's a fact on this web page so you're completely wrong when you say that it's full of cgi. But anyway this movie is a real crazy ride. From the very beginning it takes you straight into the action and never lets go. This movie is so incredibly filmed and the stunts are performed marvelously. Although this movie is said to star Tom hardy and Charlize Theron, the real star here is George miller. This man created a masterpiece and it was so beautifully put together. He managed to show the chaos and urgency without the constant shaky camera crap that we see out of action movies now. This is the best pure action movie that I've ever seen.",
    "82": "Mad Max: Fury Road. There's a reason I don't go and see Hollywood Blockbuster action films. Thought I'd give this a try due to the almost unanimously positive reviews and liking Tom Hardy. Note to self - don't listen to reviews. Utterly dull.. Couldn't tell you any plot - just boom boom boom, bish bash bosh. Okay if you like that sort of thing - I don't! 1 out of ten",
    "83": "MAD MAX: FURY ROAD is the finest piece of pure action spectacle that I've watched since THE RAID 2 and JOHN WICK. It feels like the MAD MAX film that George Miller always wanted to make, and in many ways it's a virtual remake of MAD MAX 2: THE ROAD WARRIOR, except with a grossly inflated budget and CGI effects used to enhance rather than dominate. Now, I love THE ROAD WARRIOR and always will, but MAD MAX: FURY ROAD truly is an action film for our times.I know that some will hate it; the story here is action and action alone and there's little else to get in the way. It's one long chase film and the amazing thing is how they manage to sustain the momentum for a good two hours. Exemplary cinematography and quite wonderful direction is what makes this work. With bad direction it would have been a real chore to sit through, but instead we get tons of suspense, great fight scenes, and incredible spectacle. This is the kind of film you watch to see stuff that's never been done before.Tom Hardy feels like an obvious fit for the role and brings some working class style charisma to the part. As many have commented, Max is often a supporting player in his own film, but Charlize Theron as the real lead is excellent too, so that's not important. Even Nicholas Hoult in support is fantastic. I loved the way that the bad guy is played by Hugh Keays-Byrne, who was the villain in the first MAD MAX all those years ago. Overall, though, this is a film not about the people, but the Namibian desert landscapes, the modded vehicles, the speed, the violence, the overall thrill of the chase. And it's pretty much my idea of a perfect film.",
    "84": "When I wrote this review 3 years ago I had no idea how many people hate this movie and they are preferring Mad Max 3 over this film. Claming Mad Max Beyond Thunderdome the third film is better film than this, really? Better than this? Listen folks it has no Mel Gibson so what? So what's your point? Gibson dropped out this film and he wasn't interested, it was in development for years, since in 2004 this movie was announced. George Miller did something different with this film and he got hate for it. I hate Mad Max Beyond Thunderdome to death! It is rated PG-13 family film and I wanted an action bloody rated R film not a boring stupid lame fu**** movie! I got an rated R bloody action film that I wanted in Mad Max: Fury Road. I was entertained and I enjoy it. At least it wasn't so sick like was Beyond Thunderdome. Mad Max: Fury Road is my second favorite film in the franchise and this movie did it right and it correct that third film that it failed been an good action film. Like it or hate it, is your problem but in my opinion it is a good action violent movie and I love it to death I am an action junkie myself. Mad Max 2: The Road Warrior is my number 1 favorite film of all time. I think Mad Max: Fury Road is George Miller's masterpiece. Finally, Finally after 30.years of fiasco Mad Max Beyond Thunderdome that completely destroyed the Mad Max Trilogy, George Miller finally come back and fix the mistake he did 30.years ago. Why wouldn't I love this film? This film is the best one in the series along side Mad Max 2: The Road Warrior at least for me it is the best film. It has action, high explosive and Tom Hardy been a real Mad Max unlike Mel Gibson was in Thunderdome. I am happy they made the 4th movie. Tom Hardy was a bad ass Mad Max. I didn't even noticed that we don't have Mel Gibson in here. Tom Hardy breaths life into Max Rockatansky and Charlize Theron is excellent and emotionally perfect as Furiosa. I love high speed and pursuit on a road which I seriously love this. The thing was more similar to Mad Max 2: The Road Warrior but much better, George Miller fix it, the film did not copy The Road Warrior the film has it is own story. All, the stunts and action sequences are SPECTACULAR. Immortan Joe was a fantastic villain in here he was really good. The film shows a real wasteland and the future which I am really happy about it. NOTE: \"Don't waste your time if you have seen the original.\" from a hater review my reply: Yes I will waste my time watching this awesome action flick! Yes I have seen the Original Film Mad Max with Mel Gibson so many times than you ever did! I love this film much more than Mad Max because sometimes the original is very boring and the film has so much Drama in it and less Action than it is in Fury Road. I wanted to have an apocalyptic action film like are Fury Road and The Road Warrior which this film fix it. Finally yes Finally I have seen a good Action Film from 2015 and It is finally the finest blockbuster of 2015! Mad Max: Fury Road is a 2015 post-apocalyptic action film directed and produced by George Miller, and written by Miller, Brendan McCarthy and Nico Lathouris. The fourth installment in the Mad Max franchise, it is an Australian and American venture produced by Kennedy Miller Mitchell, RatPac-Dune Entertainment and Village Roadshow Pictures. The film is set in a future desert wasteland where gasoline and water are scarce commodities.10/10 Awesome film I have seen it twice. I love this film to death I love it! Fury Road would be the second favorite best film in the franchise.",
    "85": "I have to say that I tried really hard to like this. But my old fashioned \"There needs to be a story and interesting characters\" mode took over. It took about fifteen minutes to figure out who was who. Apparently, the guy with the death mask and the tubes was seen as a god, that there was some religious following. Could be interesting, I guess. But what follows is one chase after another with every conceivable vehicle that some guy could dream up. There were porcupine cars. Monster trucks. Guys on poles dropping into vehicles. There was no logic presented as to why one vehicle would have a spear thing thrown at it and explode while others were hit with heavy artillery and seemed to move on just fine. Then we have Mad Max who is a captive with a mask that looks like a 1955 Oldsmobile grill. He is put on the front of a vehicle as all this combat goes on. Unfortunately, he has absolutely no personality whatsoever. There was never any suspense in this film because the place they were trying to get to was never really in our mind's eye. Then there's the short crop haired female which seems to be a standard these days. Make her look masculine and she becomes more formidable. Anyway, it is spectacular to look at but when it was over I felt no emotion or satisfaction at all.",
    "86": "Like the previous \"Mad Max\" movies this film takes place in a future desert world which has been devastated by a nuclear war. What remains of humanity is both primitive and barbaric and those who have survived exist with the most basic of necessities in war-like fortresses where few laws exist. That being the case, after being taken as a prisoner, it is to one of these harsh enclaves that \"Max\" (Tom Hardy) is subsequently forced to endure. And since life has very little value Max ends up as nothing more than a human blood bank for one of the militaristic \"War Boys\" by the name of \"Nux\" (Nicholas Hoult). It's at this same time that one of the military leaders named \"Imperator Furiosa\" (Charlize Theron) decides to escape from this citadel and she takes with her five wives of the religious leader, \"Immortan Joe\" (Hugh Keays-Byrne). Soon all of the clans in the entire area are summoned to assist in the recapture of Imperator Furiosa with both Nux and his captive Max in hot pursuit and leading the charge. Now rather than reveal any more of this movie I will just say that those who enjoy films which feature action from start to finish will really appreciate this picture. However, it is this strength which also happens to be the films weakness as there is very little room for anything else. That said, I thought the talents of both Tom Hardy--and in particular Charlize Theron--were terribly wasted. Likewise, I also believe that the current IMDb score of 8.4 (whether by chance or design) is extremely inflated as well. To that end, I would hope that once the initial euphoria has subsided realism will set in and the score will more closely resemble the film's actual merits. Time will tell. In any case, while I certainly do not believe that this particular film is deserving of scores equal to classics like \"Gone with the Wind\", I also don't consider this to be a bad movie either. Accordingly, while my score may not be popular at this time I have rated this movie as I see it. Average.",
    "87": "Mad Max Fury Road is George Miller's return to the franchise he started way back in 1979 with Mad Max. I will start by saying this movie was absolutely batsh** insane. It was filled right to the brim with continuous over the top bloody ridiculous action sequences that keep you on the edge of the seat and just amazed at what Is happening on screen. Now this film doesn't have much of a plot at all but seriously you're not going into this film for an intense plot, this is a film that almost didn't even need one at all. The one thing I was worried about going in was whether I needed to have seen the previous films to understand this one and thankfully you don't, the story is independent of the previous film which was really helpful. The characters were all awesome and it did an amazing job to introduce them all almost instantly and get right into the action. Max (Tom Hardy? and Furiosa (Charlize Theron) were were great and extremely likable characters. Even the villain who I will just call Sweet Tooth was so great, he wasn't anything too special but was a great threat throughout the film. I just absolutely loved this movie, intense action from start to finish and didn't slow down at all, that made it ridiculously fun to watch. The great characters and the performances are awesome on screen and we're always interesting to watch. If there was ever a Twisted Metal movie, this is what it would be. Nothing really let the film down and everything really worked, such a great time and the best cinema experience this year so far. - 10",
    "88": "Mad Max: Fury Road, starring Tom Hardy and Charlize Theron, is George Miller's attempt to reignite his long dormant Mad Max franchise...and my god does he ever. For the past decade or so, with exceptions such as John Wick, The Bourne Trilogy, and The Raid, action movies seem to be struggling to capture the excitement and enjoyment the genre once held; a tenacity that classics from the 80's and 90's had in spades. George Miller single handedly delivers our saving grace with Fury Road on the back of a spike covered oil rig with a blind zombie playing a fire breathing electric guitar.Max is a man of few words, but Tom Hardy's talent for portraying strong, silent characters shines through in a gruff but sympathetic performance. He teams up with Charlize Theron's Imperator Furiosa to save the last 5 hot women in the world from the leader of a powerful cult with a terrifying breathing mask inspired by the Cheshire Cat from Alice in Wonderland. From there, the chase is on. Using this simple plot as the setting, we are able to bear witness to one of the most beautifully shot films in years. The world of Mad Max looks absolutely gorgeous, combining awe-inspiring practical effects and landscapes with bold colours brimming from all edges of the frame. These are of course just bonuses in enhancing the primary reason people will love this film, the action itself. I'm happy to report these action sequences are damn near flawless. No shaky cam, barely a hint of CGI, and scenes where we actually feel like our characters are in danger (yes Furious 7 I'm calling you out). Total chaos relentlessly ensues for the majority of the film, but it's chaos you can follow clearly and marvel at. Whether it's one of the explosive car sequences, or one of the smaller emotional moments, Mad Max: Fury Road refuses to let up on tension for one second.There's a reason this movie is sitting at 98% on Rotten Tomatoes. This is an action movie that will set a precedent for years to come, roaring ferociously at all who may challenge it. Hopefully, this is only the beginning of a genre revolution early in the making.FINAL VERDICT: Mad Max: Fury Road is a beautifully chaotic display of masterfully executed action sequences with a strong emotional core, and a raw energy unmatched by nearly all of its action genre competition.",
    "89": "I was left speechless when this finished. It can be hard to describe  indeed.... but I'll go for it...  Sheer madness that isn't sullied by bad acting or laughable lines. A  blockbuster that is gritty and doesn't have a sense of humour that  could be equated to a fluffy kitten. No 'lets all hug' sentimental BS.  This is seriously a movie I thought I'd never see: a CGI-filled  blockbuster that I flat out loved. The stunts are so much fun, the FX  so great, it is the first movie I have seen where I have thoroughly  enjoyed all this type of stuff - probably because the cinematography  for once doesn't suffer cos of it. It is all incredibly shot.  The action is so brutal and appropriately high-octane. I thought to  myself more than once, 'I think I am loving this more than Terminator  2' but other than that, there wasn't time to think. It kicked off fast  and barely stopped, and the lulls were amplified by the insanity  preceding them. Plus it is a dark film, which made it even better. I  many people do an Aussie accent even close to well, was Hardy actually  trying for that? Either way, he didn't talk much so it didn't really  matter. This is more Theron's movie than Hardy's, he doesn't say much  and does next to nothing for the first third or so. Theron's Furiosa is  more of the hero is the story, if there were to be a hero in such a  grisly and dark world.  I don't even like this type of movie but the execution is  everything. I'm gonna go see this again, soon. 4.5/5",
    "90": "The former policeman Max (Tom Hardy) is captured by the War Boys tribe, commanded by the Immortal Joe (Hugh Keays-Byrne) and assigned to be blood donor for the Wat Boy Nux (Nicholas Hoult) that is sick. Meanwhile Imperator Furiosa (Charlize Theron) drives a tank truck to collect gasoline for Joe. However her truly intention is to flee from the tyrannic Joe with his five women selected to breed hidden in the truck to her homeland. Immortal Joe commands a party to hunt down Furiosa and Max is chained to Nux's car. Furiosa heads the truck to a sand storm but Nux continues to pursuit her. After the storm, Max succeeds to release from the car and brings Nux chained with him. He sees Furiosa and the five wives and decides to flee in their truck; but there is a secret to operate the truck and he teams up with Furiosa, leaving Nux on the desert. When Joe's gang arrives, they retrieve Nux and follow Furiosa. Will Max and she succeed to escape from Joe's gang? \"Mad Max: Fury Road\" is a terrible and overrated sequel of the franchise \"Mad Max\" from the late 70's and 80's. The plot and characters are poorly developed and despite the action, the movie is totally forgettable. Tom Hardy is not charismatic and cannot be compared to the ironic Mel Gibson. My vote is five.Title (Brazil): \"Mad Max: Estrada da Fúria\" (\"Mad Max: Fury Road\")",
    "91": "I love post apocalyptic fiction . John Wyndham and John Christopher are amongst my favourite authors . They weave compelling stories of average everymen surround by a hostile landscape where it's every man for himself and only the cruelest and most heartless survive . George Miller's MAD MAX films are an extention of this . Low brow cinematic spectacle but fair as entertainment goes . And let's not forget hugely influential as well . Sadly the films' influence found itself being transplanted in nearly every post apocalypse story for the next 20 years where a brooding loner , a man of few words , drives through a desert landscape doing his best to survive in a hostile world against scavengers . Influntial but rather unimaginative and the movies probably did the sub-genre more harm than good . This reboot did capture my imagination via the trailers and so decided to give the film a chance , not least because as soon as it was released it shot to number 25 on the IMDb Top 250 If nothing else the film gets off with a bang with the eponymous Max filling us in via voice over that the world has destroyed itself and man has to fight to stay alive against his fellow man and just to prove this is more difficult than it sounds we're treated to a high octane chase sequence replete with fast camera action and editing . Have I mentioned the opening title credits haven't appeared yet ? This sets up the rest of the film that continues in mainly the same way In short if you liked MAD MAX 2 you're going to love this one because this is MAD MAX 2 on a fatal cocaine overdose which is a great thing or a disappointing thing depending on how you look on it . Sadly I'm in the second camp because I wanted more meat on the story and there's not much narrative here . Max gets used as a gimp on the front of a vehicle , manages to escape during an epic stunt sequence , teams up with some fair nymphet maidens and protects them from the baddies and that's it as far as plot goes . The first half of the film is basically one elongated noisy chase sequence full of stunts , car crashes , pyrotechnics . I's brash , noisy and spectacular , so much so that I actually felt myself getting rather bored by all this noise and bluster . Eventually the film does settle down a bit and has characters talking in normal tones without the explosions in the background but the dialogue is just basic as are the performances , Certainly MAD MAX FURY ROAD will be up for a few Oscar noms next year but only for the technical aspects and I'm slightly surprised my IMDb peers rate it so highly",
    "92": "George Miller returns to live-action filmmaking with one of the greatest action films ever put to screen. 'Mad Max: Fury Road' is ridiculous in all the right ways.For those who have seen the original films and loved them, you'll fall in love all over again with this film. Tom Hardy takes the reigns this time around as Max - a man of few words who has been hardened by the world in which he lives. Along with him is Charlize Theron as Imperator Furiosa - a woman who seeks redemption by helping five young '\"wives\" escape from the film's antagonist.Leading up to the film's release, many speculated if this would be just another action film that lacks a solid narrative and motive, but I am happy to say that this is simply not the case. Yes, the film does fill 80% of its run-time with action sequences, but it never gets in the way of the humanity between these characters that Miller has brought to life. There are some emotional moments. Specifically, with Theron's character. Is the story something we haven't seen before? Not at all. But in a film loaded with action, it's nice to see a solid narrative.Now, how about those action sequences? Incredible - exhilarating - jaw-dropping. George Miller has put together some of the greatest, most memorable action set-pieces ever. One thing that sets the action in this film apart from a good majority of mediocre action films today is that every action the character's make have an affect on them. For good and for bad. The action is not pointless. It's motivated. And it's glorious to behold thanks to the use of practical effects, incredible stunt work and stunning cinematography.'Mad Max: Fury Road' has set a new standard for action films. It's arguably the greatest action film of the 21st century. It's that good. George Miller has brought back what we loved about 80's action films while also brining new ideas to the table. It's the best time I've had in a theater in a long time, and I couldn't help but laugh in appreciation of the ridiculousness that was unfolding before my eyes. The film left me feeling giddy, with a big smile on my face.",
    "93": "I see a lot of negative reviews for this movie popping up. People complaining that there is a lack of story and character development, and too much action.... too much action? Really? Have these people never seen a Mad Max movie before? How is that a bad thing in a Mad Max movie? Fury Road feels like an 80's action movie, with a preposterously large budget, and it is GLORIOUS. This movie was an epic ride. So many awesome set pieces, incredible car designs, twisted and bizarre costumes and characters, and a lot of really strong warrior women as well.I've also heard it said that this movie contains a lot of feminism. Strong female characters that kick butt, is not feminism people! There's no anti-men message here. Just a cast which is dominated by more women than men. And about time for a change! Charlize Theron is my new favorite actress after this (it used to be Sigourney Weaver and Linda Hamilton). She really takes the spotlight, and that is about the only criticism I can think of with this movie. It's not so much about Mad Max, but about road warriors in general, and specifically Theron's character. I didn't think Tom Hardy was quite as good as Mad Max as Mel Gibson was, but he wasn't terrible. He just didn't lend enough presence to his character in this movie. Which may be a hard thing to do when the movie does not focus on Max.Special mention should also be given to all the side characters. The villains are enjoyably menacing, especially Hugh Keays-Byrne as Immortan Joe, John Howard as the People Eater, Richard Carter as the Bullet Farmer, and I also loved Melissa Jaffer as the leader of a gang of elderly motor ladies.Go see this movie if you like Mad Max!",
    "94": "Rule number 22 from \"The Ultmate Rules of Film Criticism\" (don't worry if you can't find the book -- I only printed 7 copies) says quite clearly \"Where there is an attempt to re-imagine or re-create a classic, and the attempt is made by the creator of the original, no blame shall accrue if the new effort is of less quality than the original.\" So, as I critic, I am a little hamstrung by that rule. And wish I had never written it.I saw the original Max Max in a theatre (which sort of dates me); and I remember Mel Gibson when he was the \"next big thing\" (which definitely dates me); and I had always respected Miller for going from the \"end of the world\" to \"talking pigs\" without even pausing to catch his breath.But, for this film, George and I have a problem, as indeed I would have with anyone who gives this film a \"10\" and wonders why they are always getting carded when they try to order alcohol.The original Max Max was an attempt to impose humanistic values on a post-apocalyptic world. It had characters, plot, dialog, acting, common sense, and a bunch of other things that most of us USED TO TAKE FOR GRANTED before the arrival of this film.If you want non-stop action, go to a hockey game.If you want to see what happens when one man has many wives, go to Utah.If you want great special effects, watch the Matrix series again.If you want to see a fine film built around a tough hero, watch Chronicles of Riddick. (Which really is a \"10\") I do not overstate my case when I say that, if we reach a post-apocalyptic world in my lifetime, it will be because of the people whose sense of values considered this film to be high art.This is a very scary film. Not because of what is in it. Simply because it exists.",
    "95": "Overall Rating: 4.5 stars Cinematic value: 4.5 stars Big questions value: 4 stars Family value: 2 stars (This film has a mature rating due to the violence, take this into consideration before viewing)We have not seen Max Rockastansky (Tom Hardy) on movie screens in 30 years. This is a welcome return to Max and the crazy, post-apocalyptic world of George Miller (Mad Max, Babe). Max lives an existence of sheer survival. As a former police officer and family man, he is now a tortured shell of the man of justice he used to be and merely wants to survive. After being captured by the leading cult forces of this futuristic wasteland, he finds himself in the middle of a pursuit of Furiosa (Charlize Theron) and the wives of the masked Immortan Joe (Hugh Keyes-Byrne). Max becomes the pivotal force to assist in Furiosa's escape and redemption. Mad Max: Fury Road becomes a race for life, redemption and hope. Shot in the barren desert of Namibia, the fight for life becomes an adrenaline charged chess match that in making the wrong move will cost you your life. No summary can do the action justice, except to say to is a new visual standard that needs to be experienced. Mad Max: Fury Road is a lesson in conveying depth with minimal dialogue. George Miller delivers a masters class in story telling and stunt driven effects that successfully convey back story, cultural nuance and the justification of these desperate acts of disobedience and violence. Even as the fourth outing for this character, we are given a fresh storyline and wealth of new characters for a new generation. It is not necessary to see the original films to enjoy this chapter in Max's adventures, but it might be worth going back to watch the first two films in this anthology. The cast is captivating and effective in their roles, but they have to take a back seat to the energetic stunt work and effects. This world seems to be a maniacal and messy existence, but becomes an enjoyable, orchestrated primal experience. Who would have thought that through the Mad Max franchise Miller would be able to convey his cinematic brilliance and deliver this visceral masterpiece. Not to dismiss the acting, Hardy is brilliant as the tortured lead character and delivering a believable portrait of his desire to survive the present while mentally enduring his past. He is given minimal dialogue, but is able to become the heart of this post-apocalyptic tale. Interestingly, Hardy is not the primary lead in the film that bears his name. Charlie Theron's shining portrayal of Furiosa is the literal and figurative driver of the film. She manages to redefine feminine heroism for film makers. She has strength, purpose and a sacrificial depth that presses the story beyond a mindless chase scene. In a genre that tends to victimise or sexualise the female leads, Miller portrays a strong female led without any unnecessary feminist underpinnings. In masking her natural beauty, Theron is allowed to develop her strengths and vulnerabilities without making a political statement. Both Hardy and Theron are supported by an excellent supporting cast that moves this experience from a mere adrenaline rush to a story of fighting for your right to live, seeing that sacrifice is part of freedom and ultimately for the hope for redemption. On many levels, Miller seems to realise that action without reason loses its purpose. In adding a spiritual component to Mad Max: Fury Road he allows for a narrative depth in the script. Immortan Joe (Hugh Keays-Byrne) is the cult leader in this dark, twisted world. His character delivers a dark and demented message of the need for effective leadership and that leaders need to provide people with purpose for their sacrifice, even if it is misplaced. This story shows that there is basic need for something beyond our material needs that gives society drive and direction. Also, the flower on this desert wasteland is hope. Even the jaded heart of Max is turned and assists in getting those under his charge to their promised land and in giving them hope in the bleakest of moments. This is an essential cinematic vehicle when placed against the backdrop of the depravity of mankind. Miller manages to capture this element and allows for the story to consider the realities of mankind's history and future. If the film does have a weakness, it would be in the conclusion. In all that they desire to achieve and find through this film maker's journey, the finality has an empty satisfaction. After watching a film like Mad Max : Fury Road it might be worth reading through Revelation. Fortunately, with the God of the Bible there is more we can hope for in the future.Reel Dialogue: What are some of the bigger questions to consider from this film? 1. Where is real hope found? (Deuteronomy 31:6, Romans 5:2-5) 2. Can we find true redemption? (Psalm 111:9, 1 Corinthians 1:30) 3. Can we exist without others? (Proverbs 18:1, 1 Corinthians 12:14)Written by Russell Matthews based on a five star rating system @ Russelling Reviews #russellingreviews #madmaxfuryroad",
    "96": "'Mad Max: Fury Road' is the 4th installment in mastermind, George Miller's insane post apocalyptic journey. Starring Charlize Theron (Monster, Hancock) Tom Hardy (The Dark Knight Rises) Nicholas Hoult (About a Boy) and (Hugh Kaeys-Byrn) as the movies villain Immortan Joe.Imperator Furiosa (Charlize Theron) is assigned to a mission. The mission is to drive the war rig and go through to the next town and siphon gasoline. Furiosa ends up double crossing Immortan Joe and stealing his 5 wives to take them back to her homeland where they can be safe. Along side her is Max, a man of action and very few words. Together they must fight trough hordes of enemies in what is basically a 2 hour long, high speed chase.I have been waiting since I heard about the green lighting of this movie back in 2009. I have been waiting for almost 6 years for this thing. My hype was high, I wasn't sure it would live up to my expectations. Well I am here to tell you that it did. It lived up to the hype, AND THEN SOME. This movie is absolutely, 1000% insane. What you saw in the trailers wasn't even close to the level of crazy that goes down in this movie. You know this movie is pretty much just all out, balls to the wall action, so if you think the trailers maybe showed off a little too much. You couldn't be more wrong.The stunt work is choreographed and directed to perfection, it is the most well crafted and stunning movie I've ever seen and will probably ever see, which is kind of the norm and what to expect with a George Miller movie. There's explosions going off everywhere, cars blowing up left, right and center, people being killed and blown to shreds. But none of it is convoluted, it all streams together perfectly, you know what is happening, when it happens. The fact that pretty much 90% of this movie is all practical effects and all stunt work is mind blowing. The cars that explode, that's happening. People bouncing from one side to the other on long poles at 60mph, picking people up and flying then back across, that's going down, too. Too many blockbusters these days are filled with CGI. And even with limitless amounts of stuff you can do with all of that. NONE of it even is even comparable to the action in this movie. The crap that goes down here, other movies couldn't even dream to aspire towards such a spectacle.People complain that there's not much of a story, they wanted more. Well I gotta tell you, the story is just what it needs. For something to be great it doesn't need to be a vibrant cohesive piece of art. The story is very simple, and the simplicity of it is what makes it great. There's enough story to keep you paying attention to it and not just going in for explosions. Not to mention that It's not driven through its narrative or its dialog. It's driven by its characters and its action. To which people also said they were underdeveloped and weren't written very well, from my stand point they absolutely were.The character of Nux (Nicholas Hoult) was developed amazingly well, I didn't really expect to see much from him but he really became his own in this movie. He was developed enough to make you care, he was written to be understandable in his actions and he was by far, for me, one of the best things about the movie. Furiosa was also developed just enough to make you feel something for her character. She's one of the only good left in a world full of bad. What Miller does in this movie is make characters that not only do you are for but are also incredibly likable and super bad ass. Max wasn't developed as much as some of the others but let's face it. If you've watched the older ones (which I recommend you do) There really isn't much to him. He's a man that's had everything taken from him and he has nothing left to lose. All he wants is to be left in peace. That's all he's every been and that's all he wants to carry on being.What I also love about this movie is that the lead character is a woman. Hollywood these days are always depicting women who need a man take care of them. That they can't live without men. That is DEFINITELY not the case with this movie. Furiosa is fierce, she's skilled, she's unpredictable and she's all out bad ass. This is a testosterone filled movie but it's not the testosterone that takes charge.Action movies these days aren't normally as good as one of the reasons being is that the hero is never really in any really danger. If he's never in danger or near death how can you possible expect to have your audience on the edge of their seats. Pondering what if the inevitable happened. Max was in peril SO MANY TIMES in this film. There was at least 10 times where I thought \"this is the end, he's going to die\" then he miraculously gets out of it. But it's not the cliché type when someone luckily comes along at the last moment and saves him. Believe me there aren't many, if any clichés in this movie. He fights his way out of these death defying situations. Furiosa out other lead is also in life threatening situations throughout this movie. Many times where we wouldn't know if she would make it.If you don't see Mad Max: Fury Road in the theaters then you are missing out. I went in IMAX and I can tell you it was worth every goddamn penny. Papa want a sequel",
    "97": "Mad Max: Fury Road is a non-stop concerto of clanking iron, broken bones and splattering blood while fire squirts from all cylinders. It's absolutely glorious. As far as sci-fi world goes, director George Miller creates a remorseless realm with every bit of nastiness present. The two leading actors Tom Hardy and Charlize Theron are utterly convincing, so much so audience would believe they are actual occupants of the unapologetic post-apocalyptic world.Max (Tom Hardy) is a survivor in a barren wasteland. He's about to cross path with totalitarian clan War Boys led by a dictator. As luck would have it he meets with Imperator Furiosa (Charlize Theron) as situation escalates rapidly and they must fight for their survival. Tom Hardy looks physically menacing and exhausted by the burden he carries on the desolate landscape. He is more of an anti-hero who prioritizes his safety in the expense of his morality.Charlize Theron is utterly splendid. With short hair and one arm, she still manages to look beautiful and presentably strong. She seems cold yet also rigidly determines to her cause, this is a real rendition of a powerful female character, not a model shoehorned into the wilderness. Nicholas Hoult as Nux, one of the War Boys is a chameleon. His character might have the most development as a lowly peon who gradually discovers the true nature of his clan.Production value is exceptionally well done. From vehicles, make-up and even prosthetic limbs, all of them look as though they have wear and tear from the dusty world. Strange contraptions and weapons are aplenty, explosive spears are thrown with reckless abandon as large tank mounted with electric guitar rumbles in the background. It's brazenly unworldly and over-the-top spectacle. There is no such thing as too much here.Visual is all shades of tangerine. The vistas look dry and dirty yet still can be lively or solemn as the filter regularly changes. The soundtracks blast rock, metal and techno vibe with each scene. It truly doesn't let up, riding the momentum from start to finish, though it's not just mindless explosion. Its characters are identifiable, audience would be fascinated and cheer for them between each explosions.Never a murky world ridden with death and destruction seems so irresistibly invitingly. As the characters ride through the carnage, the film is an achievement in action and destruction.",
    "98": "George Miller returns with a bang and takes the helm of this crazy 2hr bonkers extravaganza named Mad Max: Fury Road. First of all, the stunts and action sequences are SPECTACULAR. Tom Hardy breaths life into Max Rockatansky and Charlize Theron is excellent and emotionally perfect as Furiosa. The story opens, with Immortan Joe who has young ladies as his wives, but he'll goes down when they escape the sadist's hands. Max, who has a violent past with Joe's cronies, decides to help Imperior Furiosa take the girls somewhere safe. Furiosa can't trust Max, and neither can he. So it all comes down to Joe's cronies fighting against them reaching to their destination. The movie is a bananas car chase for the runtime, as Max and Furiosa work together to fight against the evils. And then, there is Nux, a bonkers \"really skin coloured\" guy, who works with Joe, played well by Nicholas Hoult. The 3D really pays off, and is worth the extra ticket. The movie puts all other action movies of shame, the effects really pop out. Well, this is a definite masterpiece. One of the best movies of the year, one of the best action movies ever made and the role of Theron's life. Miller is truly a mastermind as stated clearly in the trailer. This exceeded my expectations, and will exceed yours as well. The dark style, dark comedy and the over the top characters make a return in this reboot. Must watch, and worth the extra IMAX 3D ticket.",
    "99": "Mad Max: Fury Road (2015) **** (out of 4) In a futuristic, post-apocalyptic world, female rebel Furiosa (Charlize Theron) goes against her tyrant leader by trying to get his female brides to a safe land far away. With the brides stolen the tyrant sends all of his force after them but with the help of the loner Max (Tom Hardy) they try to reach some place they can live with peace.This is technically the fourth film in George Miller's franchise but I think it's safe to say that this here is the best of the bunch. Considering how good the original series was it's rather amazing to see how amazing this one here turned out. I usually don't try to speak too highly of a new movie because I think the true test for any great movie is time. I mean, how does a film work fifteen, twenty or thirty years after it was made? Does it stand the test of time? While watching MAD MAX: FURY ROAD I couldn't help but feel as if I was watching something that would easily stand the test of time.Story-wise this is pretty much a simple story but it's Miller's wonderful eye that makes this truly one of the most remarkable action pictures in recent history. I really don't want to under-praise this movie because it is so wild, so crazy and so over-the-top and suspenseful that you really can't help but feel that you're watching something unlike anything before. The special effects here and stunt work are among some of the greatest that you're ever going to see. So many action films are overloaded with mediocre CGI that you can't help but feel as if you're watching an unrealistic world. That's not the case here because everything looks so real that you get caught up in what's going on because you feel as if it's a real world with a real battle going on.There are some intense, heart-pounding battle sequences that really make your jaw hit the floor in regards to the action. The explosions are loud and violent and there are a number of bodies being thrown around in every way imagination. The built-up cars and monster rigs are something unlike you've ever seen before the the pure wild imagination in the action scenes is just rather remarkable. There's no doubt that what you're seeing here is among some of the greatest things ever captured on film. The masterful editing, sound effects and cinematography just pull everything together.The performances are another major plus with Theron being perfectly believable as this tough warriors. Hardy is also extremely great as the loner who doesn't speak too many words. Nicholas Hoult, Josh Helman, Zoe Kravitz and Hugh Keays-Byrne are all impressive too. MAD MAX: FURY ROAD is pumped full of wonderful action and suspense and it's certainly one of the best of its type.",
    "100": "Cold-blooded, botanically medieval, crusades-like, and horrifically thrilling—that's Fury Road. As for Max, it looks like he's the same archetypal Bane, only this time, he's more immune to \"I'm not afraid, I'm angry.\" He's silent, and angry, and frustrated. He's Rango-like, reflective of the quest to solve the water-mystery. With everything red, orange, and yellow, it seems like you're viewing 300 blended in Saw, and over-the-top F&F.George Miller revises his ideological construct in the most exhilarating, dreadful, and striking manner this time. For all I know, the audiences spoil themselves with \"cinematic orgasms,\" if that's a thing, throughout the movie. They're not afraid of the porcupine-trucks, maybe a little on the edge of madness, but that goes without saying. Here's a hint as to what it was like: Bane and Miranda beating the beep out of war-painted, anti-Christian, Hulu tribe—only this time, it's some dark, full-raged action with mountain bikes, and trucks, and springy tentacles moving idiotic half-Willy, half-Wonka The Da Vinci Code Bettany's horrendous versions. Miller puts his tribal culture in the crux of action, which reveals an unorthodox, authoritarian, and devout portrayal of enmity. The sport-arena action is complemented by prayers in Citadel, banging of drums, skeleton-wheels, and skeleton-feels. It has a bizarre feeling—you're dredged into the modernity of Prometheus and antediluvian era of the Exodus.More than anything—Max's deafening seriousness, Furiosa's bald-grace, armless-attraction, sense of responsibility, and and absolute congeniality to the role (always imposingly remarkable,) religious affirmation, banging, puffing, booming, clatter, splash, tick-tick, boom—the \"fantasized-realism\" behind all the get-off-my-property-you-crazy-lunatic is what gives you the honesty-chills. The stunts, the effort, the don't-care-about-ourselves-just-love-the-movie-please pledge, and the extraordinarily enormous—480 hours of footage into 120 minutes of freaking-awesome warfare—blows me off of my seat in the cinema to the pale, scorching blaze of the sun, amidst the crazy-eyes of this action-genre Orange is the New Black. Even the over-editing has that medieval, darkly comical feel to it, just like 300 for example (can't think of another movie with such aberrant effects, but such positive response.) But like any other movie, there are points where you start questioning yourself. Nothing seems to justify Max & Furiosa's relationship, mutual combats, strategies, certainty of plans, and stuff like that. But by then, the movie's not about logic or sense anymore; it's more about seeing what you wouldn't in ages. With such a brilliant ensemble—I mean it was pretty good for a solely madness-based movie—you couldn't care less about the abacus-loving dumb-toads sitting in exactly the middle seats of the theater to get the most balanced view of the screen, and judge the minus-plus of the 120 minute long clip. I feel like reporting their stupidity to the CIA—enough with the pen and paper!Mad Max comes equitably with the characters, their roles, and the titular projections. Each name is qualified by its corresponding characteristic with the character in the movie—Spikers, Rictus Erectus et cetera. This complements the heartfelt glow to the movie itself—everything's done for the movie. They didn't feel any need to impose worldly sense into it, which is the best part, because that miniature world seemed pretty damn believable to me—but why? Maybe it were those religious beats, maybe the dragon-roars of engines, maybe it was just the psychological effect. Whatever it was, it did what it planned to.Mad Max: Fury Road puts forth the idea that there's so much more to combats than mere combats—MMFR incorporates belligerent, spoiling-for-a-fight attitude, oppressed landscape, estranged and barbaric drug-lords, heavy-weight weaponry and wheelers, and poster-paint bombings. The intensified red-blaze of fire, the sandstorm-effect, the preposterous turn of events, the nonsensical touch of things, and the wacky script—everything wrong with the movie is everything good about the movie. Mad Max: Fury Road revises the post-apocalyptic scene—utter dryness of region and minds—and uses the irritating sense of that dryness into a rigorous will to get past it with victory—Fury Road's victory. It's not about the comparative analysis of protagonists and the white-witty-wackos, it's about what's happening throughout. And when it happens, you're only remark is: \"What a lovely day.\"",
    "101": "Dont understand the high rating.Nothing unique. Just another american typical thriller, with explosions and cars with fire everywhere. Its too much.Nothing new.You can clearly see that it is an VERY exaggerated film which tries to do more things than it actually succeeds with.Concept is pretty good and interesting tho, but it isn't like we have seen post-apocalyptic films before...Its really a film with great potential. It builds up the environment, vehicles, and the atmosphere pretty unique and very good. But it fails to provide a thrilling story. Its a bit confusing storyline aswell, with very small amounts of explanation. The story also fails to captive and to keep the attention. Manuscript is pretty flat, pretty bad, boring and nothing special.Acting is nothing special really.Almost ridiculous boring how excessive almost every scene is. It feels like they put more fighting and fire then needed, only to fill it up with so much fightingscenes, gunshots and fire as possible.Cinematography, editing and music is good.I wouldnt really recommend it, as it isnt my taste really. Its a easy film too watch on a boring afternoon. A average film. But dont expect too much.",
    "102": "The first Mad Max had a few strong attractions. It was overtly Australian in a few dimensions which hit a niche of the familiar exotic. It was pure science fiction in that it abstracted our world into a future where only the tiniest fragment of what we know was carried over and amplified. That fragment revolved around one of our most peculiar social constructions, the wild motorcycle gang. It is peculiar in being largely a cinematic invention. (Paris being romantic is another.)The notion of a motorcycle gang originated in California after WWII where returning GIs (mostly tattooed navy men who had served in the South Pacific) bought surplus army motorcycles. The notion of lawlessness unique to motorcycles is from Marlon Brando as copied by Sonny Barger. It is a wholly cinematic convention made real, like movie gangster talk as adopted by the Mafia. Mad Max joined this to an equally unique cinematic convention: the chase. Now this. After decades, it is still the most pure of science fiction abstractions. It is still overly Australian, more about that in a moment. It still takes the chase very seriously. But it now employs a reverse irony on the motorcycle gang trope, moving it into Fast and Furious car territory, merged with comic heavy metal and pushed into humor. The trick with these is to exaggerate enough to make us laugh but not so much that we don't engage with it in its terms. Among the Australian notions is a new one: architectural dust. Most of the stunts were practical, but all of the environments were artificial. This is the first time I know that a big film used the same effects shop (Melbourne-based Iloura) for both composites (the deserts and cliffs) and dust. Different technologies are required, but a similar notion of texture was used, and the two are combined in the dust storm near the beginning. The result is an astonishing effect of surface become air. The cinematographer seems to have been aboard in the way he overexposes and undersaturates, especially during the 'night' scenes. I don't know of any other film save Derzu Uzala that attempts this, and all Kurosawa had was snow.I hope other Australian productions adopt this technique, as it seems both very advanced cinematically and wholly Australian. When Michael Jackson advanced the art of using a spatial camera, we did see that become common very quickly, first through Hollywood's use of WETA, and then other shops.And we did see the world quickly copy the motorcycle gang trope.",
    "103": "but alas I've been cursed with an IQ that is apparently at a level that gets offended when a conglomerate with an IQ around 40 write a script and expect me to go along with it.--I don't even know where to start. Lets see, if you drive for 180 days and average a speed of even 17 miles an hr, you would go around the circumference of the earth three times. Or 53 miles an hour for 8 hrs each day. So the whole premise of the movie plot is null and void right there. --In this futuristic world there is no water and no rain, but apparently our group of antagonists have copious amounts of water bestowed on them from on high, or rather from the movie makers. If we see it then it must be, so saith the movie makers. The the location of their limitless reservoir is just plain physically impossible, --I needed a reason for that much man power and mechanized weaponry not being able to stop a single semi, and I was never given one, just lots of eye candy. I needed to know how so many people could live and survive when there were no plants and no water. I need to know how so many vehicles could have unlimited gasoline and be in top running order under these conditions. --But all I got were more explosions. -- I wanted a well written script, instead of two hrs of explosions--at the end of the day I guess explosions are a lot lot cheaper and easier than a well written script coming out of Hollywood.",
    "104": "George Miller's Mad Max: Fury Road. I don't even know where to begin. First of all, forget Avengers, forget Furious 7, this is THE movie to see this summer, and perhaps this decade. It is a nitrous injected, chrome plated masterpiece of savage beauty and reckless juggernaut aerobatics that has to be seen to be believed. Miller has taken the core elements of what made his Road Warrior so special and beloved, and kicked them into high gear for a revisionist take on the ages old post apocalyptic punk warrior desert chase film. Tom Hardy is hysterical as Max, a brooding, bruised hearted grump who just wants to be left alone, until he's dragged, literally into a deranged odyssey through the badlands. Charlize Theron is all rock solid tough as Imperator Furiosa, who hijacks the five breeding wives of tyrannical, terrifying warlord Immortan Joe (Hugh Keayes Byrne, Toecutter from the first Max film) and flees into the desert to find a greener place away from the madness. Miller strips away any unnecessary dialogue or clichéd 'getting to know you scenes' and streamlines the film into one sleek, forward surging force of nature, with not a moment wasted, and not a line of dialogue or glare of the eyes that isn't somehow in service of the constant 'go, go, go' mantra of the story. Such pacing is the genius of what makes it such a thrill. Also amazing is the imagination and world building. Miller uses an anthropologists eye to look at what the human mind, and civilization would evolve to in a situation like this, resulting in every character having a realistic, thought through vernacular, and some truly phenomenal, lived in style set pieces that are truly eye popping. Such attention and care is rare in this genre. Miller and team have outdone themselves with this absolutely exhilarating film, technically proficient in every way and filled to the brim with the kind of love for films and telling stories that its predecessors revels in back then.",
    "105": "This starts of very quickly with little ceremony and gets straight into the action; and this is an Action film with a capital 'A'. The expected Mad Max components are there; raiders, apocalyptic locations, cross bows etc; but the film is essentially one massive car chase.But I wouldn't let that put you off. The action is constant and relentless. The clever use of minimal CGI means everything looks fantastic.It stays true to the Mad Max theme with an element of cheesiness which is vital for this kind of movie to stay brutal but stop it getting too dark.There are strange contraptions, men on poles, mutated cliché characters preserved from the old world. The vehicles are wacky, interesting and varied. I personally loved what can only be described as the worlds most improbable morale boosting device? The only two gripes I have is the cgi for the flash backs is very poor along with the obligatory 3d scenes of steering wheels hurtling out the screen (they are even more annoying when you choose to watch in 2d). And the story is a little insulated. You are either in the big rig or chasing the big rig - I would have liked to see a dash more of the ruined world.But there is an awful lot to love about this. Some may find it a little simplistic, some a little too camp. But I think it would have been difficult to win all hearts and minds with this one.",
    "106": "Wow. Just wow. 8.1??? Most superficial film ever. The ones who gave low ratings speak the real truth... this film really has no characters to really care for and there really is no story at all...The little girl flashbacks Mad Max was having??? Pointless. It's just chase/running away and then they decide to head back and chase/run again! Seriously??????I guess people don't really care about stories anymore. I heard the action was supposed to be impressive, but even that wasn't worthy of the hype or praise. Water World has way better action and is more interesting. The pacing is horrible. It's so repetitive and boring. Production set/value alone doesn't make a movie deserve a 8/10... ridiculous. One of the worst most overrated movies ever.",
    "107": "The story line is nonexistent as in so many blockbuster movies today.It's all explosions and fast and over styled cars It starts of with some guy you have no inkling about who is, being captured.Than he escapes and while he's on the run in the capturers compound he has hallucinations, about what I think is supposed to be the boy with the boomerang from the original road warrior,and the old man. Than he gets captured again.Than there's a scene with the main bad guy involving water,which I didn't quite grasp the point off. Followed by endless car chases, and a really poorly choreographed hand to hand fight,between charlize and Tom hardy and some white dude that looks like a cross between a zombie and a vampire. The problem with the movie is,by the time all this has happened you are almost halfway into the film,and yet you don't really care about any of the characters. There's nothing there that give you any basis to root or care for any of them.The story line that makes you loose yourself into the movie just isn't there The whole plot with fuel being scarce is gone,there seem to be plenty off it considering all the cars they use in this movie. I get the impression water is the thing that is sparse here. But you get no real indication of it.So it comes off more as a subplotI think the main story is suppose to be Charlize saving some models from being babymakers for the main bad guy. But that part drown in the endless car crashes and explosions.The acting is way below subpar too.And that's goes for all of the cast. There's also something with a silver spray to the mouth ,that you don't get explained either(Or maybe it passed me by)",
    "108": "After watching Fury Road I can safely conclude that not only will the film be welcomed by a majority of people craving a good action- packed popcorn flick, this new movie will effectively change the action-adventure game for the better.The story begins with Max (Hardy) being chased by a group of crazed goons across the desert in his signature Interceptor car. The vehicle crashes spectacularly and he's immediately captured. We're introduced to a host of characters warped by the landscape and made crazy by their circumstance. Immortan Joe (Keays-Byrne) sits atop of the social spectra. A violent, disfigured dictator who has hijacked not only the world's most needed resource, water, but the world's most precious: the future. He has taken the most beautiful brides among his dirt-pile civilization and forces them into a harem where he rapes them to birth a normal, untarnished heir. That is until Furiosa (Theron) a trusted marauder takes the harem and escapes in her war rig with a mission to take them to \"the green place\". With war parties in fast pursuit, Max is forced to be a feral warrior's \"blood bag\" until fate allows him the chance for escape and possible redemption from the thoughts that haunt him.After a fifteen minute setup the entire movie boils down to one, big, long, explosive, exciting, pulse-pounding chase through the desert. Each action set-piece is a master's course in chaotic beauty and mayhem. Lest you think you've seen it all, watch the first extended chase between the war rig and the war parties...then wait another five minutes, because the expectations you just set for yourself will be blown to smithereens. George Miller decided to film in the otherworldly desert of Namibia instead of the Australian outback. The hues of the rock and sands of Namibia make for some austere beauty and intensifies the desperation of the world of Mad Max. No longer are their paved roads, only basins of flat unforgiving dirt remain. Trekked by those most craven and those most crazed.Through all the absurd chaos, characters emerge. Not through dialogue or long-winded explanations but through action. Everyone we meet is stripped to their essence and pitted against each other. The number one goal for our beleaguered protagonists? Survival; it's that simple. Max in particular has quite a complex character arc given the movie's structure. He is reintroduced in our psyche as a man who once had a moral compass now reduced to an animal; wild and instinctual. He lost those he loved most and is haunted by their memories. By the end of the movie his purpose is molded beyond simply survival. His resourcefulness and pragmatism follows a logical train that ends with Max becoming a restorer of hope. A rebirth of the dark anti-hero we once loved and all with little to no dialogue.Now a game-changing movie like this is not without its controversy. Men's Rights Activists have been crying foul ever since this movie's been released, claiming the movie is feminist propaganda masquerading as a shoot-em-up. Noted chauvinist blogger and blatherskite Aaron Clarey even initiated a boycott over it's perceived \"feminist agenda\". \"men in America and around the world are going to be duped by explosions, fire tornadoes, and desert raiders into seeing what is guaranteed to be nothing more than feminist propaganda, while at the same time being insulted AND tricked into viewing a piece of American culture ruined and rewritten right in front of their very eyes.\"With as much respect as I can give people with rudimentary understanding of discrimination; knock it off. Having physically and emotionally strong female characters is not propaganda. Nor is making an enemy out of a thoroughly disgusting human who in no way represents the male gender or the patriarchy as it exists today. If anything the warped society that exists in Fury Road is an exaggerated view of patriarchy therefore categorizing the political elements of Mad Max as satire. Even to claim the film has a feminist agenda of any kind is suspect. Not all feminists believe the same thing but a majority believe portraying women in media in the mold of a traditional male sans male genitalia, is not the best way to empower women. Not to discount Theron's performance but her Furiosa does fit that bill.My only real complaint is less about the movie and more about Hollywood's insistence that 3D is the way to go. Dazzling sequences of real stunt driving and explosions that would put the Fast and Furious franchise to shame are interrupted by obvious frames where 3D is injected for the sake of being injected. In one, almost delirious moment of climax, we see obvious computer generated twisted metal synchronized to look like a jack-in-the-box. It was distracting flaw but not a fatal flaw.Mad Max: Fury Road is not just a spectacular action film; its an action film that truly raises the bar. Those who have never seen the original films won't be lost nor will they be disappointed. Through frenetic editing, solid, smooth camera work, strong acting, brawny, metal-meets-muscle action sequences and minimalist story, every action movie the foreseeable future is going to wish it was Mad Max.http://www.theyservepopcorninhell.blogspot.com",
    "109": "Let me start by saying this. This movie is MAD. The title was not lying. This film was exactly what one wants from a summer blockbuster. George Miller has come out publicly and said that this is neither really a reboot or a sequel. This is simply another story following Max Rockatansky. In this story, we see Max being captured By Immortan Joe and his band of War Boys. Once he escapes he comes upon Imperator Furiosa who is attempting to rescue the \"wives\" from the oppression of Immortan Joe. Cue action. I love how sometimes simple plots like this can set up an entire world of action. In the action genre, we don't need very convoluted and intricate plots that keep taking unexpected twists and turns. In Mad Max: Fury Road's case, the simpler, the better.Now on to what everyone is wondering about. The action. And yes, the stunts and music when it's all going down is some of the best action ever put to screen. By the time the climactic chase rolls around, the action is even more jaw-dropping and breath taking than before because the stakes continue to be raised. This movie is a two hour chase that never has a dull moment.As for the characters, they were all spectacular. Especially Furiosa, played beautifully by Charlize Theron. Though she is a bad-ass, she never upstages Hardy as Max. Being the emotional core of the film, playing Furiosa was one of the harder tasks to correctly perform and Theron knocked it out of the park. For Tom Hardy as Max, he was just as great as Theron. Having minimal dialog and mainly using grunts to show emotion, Hardy gave Max a surprising amount of depth, though still not nearly as much as Furiosa. This is not a bad thing however, since Max was never a truly deep character, he was an action star who kicked a lot of ass. And of course he does that in this film. The rest of the characters were played great as well especially Nux (played by Nicholas Hoult) who brought even more emotional depth this.Overall, this is a gleefully insane film. The relentless pace never holds back on the audience and it always has them glued to the edges of their seats. If you can, I highly recommend everyone does themselves a favor and witness this master-class action phenomenon that will arguably go down as one of the finest action films ever made.",
    "110": "Greetings from Lithuania.\"Mad Max: Fury Road\" (2015) is like no other mainstream action movie out there. Saw it last night, in 3D - it's a helluva entertainment. The crazy high metacritic score and praises from critics weren't just an empty thing - this movie is truly great. \"Mad Max: Fury Road\" takes place somewhere in between 2 and 3 movie of the franchise, but if you haven't seen previous movies don't worry, this movie stands on it's own, but it's better for you to watch previous parts, especially \"Road Warrior\". To get straight to the point, \"Fury Road\" is a blast from start till finish. It's hands down the best action movie i saw in quite long time. It has insane stunts, terrificly directed and choreographed action scenes, crazy, twisted and \"take you right there\" settings, solid acting, tight and very simple script, amazing / gorgeous cinematography and very good music. All these parts are combined together in not very traditional and at the same time masterfully good way. This movie feels unique. It has lots of explosions, but strangely enough, we do care and kinda feel every single of it, even if characters or bad guys were on screen for just a second. There are some truly visionary scenes in this picture, which you won't see in a big budget mainstream movies, like the one at night in burned land. The ending is terrific, with a last scene just begging for this movie to be seen again - terrific ending which sort off reminded me of \"The Dark Knigh Rises\".Overall, \"Mad Max: Fury Road\" is incredible picture. It has the crazy spirit of previous movies, and if you like this kinda stuff, you will be in nirvana watching \"Fury Road\"",
    "111": "It seemed to me that few people did not totally love this film, and I cannot think of any time on social media or reviews that I saw many negative words about it. So I was keen to see it once it came to being released for the home viewing. Undeniably the film is committed to what it is doing and it seems determined to make this world real simply by the force of its own will. As a result there does not seem any excess that is out of place, even if for me personally this also worked against the film. The simple plot allows the action to be the all, and in some ways it is enjoyably metallic – with impacts, grinding of parts, the smell of grease. However on the other side the sense of vaudeville that it has detracts from the actual feeling of tension and violence it should have. That it didn't manage to draw me into its creation meant that the constant action felt like a show rather than something with real consequence and risk.That is not to say that it isn't enjoyable, because as a show it is often quite the show. I am not sure why this content-light blockbuster got so much praise versus any other blockbuster heavy on action but light on plot, but it did. Visually it is endlessly interesting; the crazy nonsense of the vehicles and the action sequences combine with some great cinematography – over-saturating everything and adding to that sense of otherworldly extremes. The cast do the same and have that 'committed' approach that the film has – whether their performances make sense or not. Theron is the most engaging of the piece, with a very strong and yet emotive character. Hardy is a good presence but surprisingly not particularly interesting as a title character. Hoult is better, and the female support characters see good turns from Huntington- Whiteley (I know – surprising), Kravitz, Eaton, and others.It is a film that simply does what it sets out to do and doesn't seem to worry about whether it will work or not. In this way it does have strong forward motion, and never lack confidence. However the sense of performance and show to it does rob it of a hook to draw the viewer in, and as such it is always a blockbuster, even if the grimy metallic aspects suggest it is more 'proper' than other films doing much the same for a wider audience. Good for what it is, but certainly not worthy of the endless waves of praise hitting it this summer.",
    "112": "This remake to Road Warrior is the best classic epic Post-Apocalyptic Action Science Fiction film in the Mad Max Franchise . An apocalyptic story set in a harsh desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life , within this world exist two rebels on the run who just might be able to restore order. As a a drifter named Max (Tom Hardy) , and a woman named Imperator Furiosa (Charlize Theron) , both of whom rebel against a tyrannical ruler in search for her homeland with the aid of a group of female prisoners ( Zoë Kravitz ,Rosie Huntington-Whiteley ...) , and a psychotic worshiper called Nux (Nicholas Hoult). With the stark desert sands in front of them and marauders behind, only the maddest will prevail the storm. They fight brutal enemies thirsty for blood and to survive some battles to-the-death with lots of blood and gore, including throating-slit ,beheading, impaling and blow up . Only the mad survive. The future belongs to the mad .This stirring movie in comic-strip style is packed with unbelievable car stunts, thrills , chills and noisy action . Top-notch movie and well set in a post-apocalyptic wasteland with a valient group who will have to fight against cruel cutthroats, a band of depraved crazies ; this thrilling picture packs kinetic action , chills, shocks and abundant violence . Spectacular stunt-work plenty of motorcycle races, cars witth breathtaking leaps and explosions . Excellent Tom Hardy as a revenger angel at one of his main roles, he embarks a groundbreaking escape against vicious murderous, he is a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos . And Charlize Theron gives a brave as well as sensitive acting as Furiosa, a woman of action and a warrior who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland .Rumbling and moving musical score fitting to action by Junkie XL . Special and weird futuristic atmosphere created by cameraman John Seale who reflects splendidly the barren outdoors . According to this cameraman the cinematography would be as colorful as possible in order to differentiate the film from other post-apocalyptic movies, which typically have bleak de-saturated colors . Spectacular and impressive production design, the art direction is as beautiful as posible ; that's why the filmmaker Miller reasoned that people living in the post-apocalypse would try to find whatever scraps of beauty they could in their meager environment . Being shot in several locations such as Namib Desert, Namibia Cape Town Film Studios, Cape Town, South Africa , Sydney, New South Wales, Australia, Penrith, New South Wales, and Potts Hill, Sydney, New South Wales, Australia .The motion picture was stunningly directed by George Miller who subsequently announced he would sign on for ,three more Mad Max films as producer or director . Miller is author of the excellent post-apocalypse ¨Mad Max¨ trilogy along with the writer and producer Byron Kennedy. The first was ¨Mad Max¨ (1979) by George Miller with Gibson ,Joanne Samuel , Hugh Keays-Byrne ,Steve Bisley . A sequel titled ¨Mad Max 2, the Road warrior¨ with Gibson , Bruce Spence, Vernon Welles and Mike Preston . It's followed by ¨Mad Max beyond Thunderdome¨ with Tina Turner, George Ogilvie, Frank Thring and again Bruce Spence as sympathetic helicopter pilot . In addition, numerous imitations as the recent ¨Doomsday¨(2008, Neal Marshall), rip offs, and exploitations ,especially Italians products. Rating : Good, better than average, this is one of the most successful of the present decade . This remarkable action film will appeal to Science Fiction buffs. Rating : 8'5, Above average. Well worth watching.",
    "113": "I don't normally say that about a movie. Even my favorite films have flaws that I recognize and humbly admit to, even still that doesn't mean I love them any less. Mad Max: Fury Road is that rare example of a film that understands what it is so well that it forgoes flaws ...this is a perfect movie.Now I understand that's a bold statement, and I also know it's only my opinion, but it's something I thought long and hard about after walking out of the theater, still recovering from the 2 hour thrill ride I had just been on. There was not a single moment during Fury Road that I a) checked my watch b) thought something was out of place c) got bored with the actionThe characters, the music, the action, the direction - it's all top level stuff. No fluffy words in this review, I am simply stunned at Millers execution of this very simple plot. I love how Miller allows the expressions of the characters to speak for themselves, I love how he doesn't dwell on supposed important character moments because he understands exactly what to show and when to get back to the action. The music may the key ingredients in the mix as Junkie XL delivers a soundtrack full of thundering drums, epic violins and shredding electric guitar, a soundtrack that had my heart racing a million miles an hour and gazing at the screen in disbelief as cars and bodies flew through a sandstorm in slow motion.The fact that CGI was kept to a minimum makes the film feel even more satisfying, like we payed to see high octane action where cars crash into one another and people perform death defying stunts ...and we get what we pay for as close to 90% of what you're seeing is real.I could gush over this film for hours but I'd like to say that if nothing else, Mad Max: Fury Road gave me the feeling of being a kid again and seeing a blockbuster for the first time. In an age of bloated, CGI-filled summer movies, it's nice to see a simple, streamlined, real film in the mix. Welcome back Max, don't keep us waiting to long for the next one.",
    "114": "Mad Max: Fury Road, the newest from George Miller was a film i never had much interest in. I haven't really seen the others in the franchise (i say haven't really because i have seen about half of the original) but to be honest it isn't really nesscessary. Im not sure if this is a prequel or sequel but whatever it is doesn't really matter as this is quite possibly the action film of the year and has some of the best action sequences of the decade in fact.If i were to explain plot here it would seem very thin because in terms of plot there isn't a huge deal of it, although this isn't really a bad thing. It follows Max as played by Tom Hardy who does do a great job following the footsteps of Mel Gibson, as well as rebel Furiosa played by Charlize Theron at the top of her game. The two go on a journey to i guess restore order to the post-apocalyptic world we are introduced to from the start of the film. Everybody in this film does a really good job, Tom Hardy's Australian accent wasn't the best i have heard but he doesn't say a great deal, most of the dialogue does come from Theron's Furiosa and she really adds a moral contrast to his performance and they play well of each other, in fact this as much her film as it is Hardy's which i was worried about being called \"Mad Max\" and all, but it doesn't bring the film down by a single notch.Now earlier on i mentioned that the film's plot isn't a very strong one. The reason this isn't a problem? Because the film is pretty much one huge action set piece. From the beginning to the very end the action does not stop. It is very much a road movie, but not a stereotypical road trip movie, it is a road movie where cars explode at every given moment and blood is splattered around with no remorse. I found out 80% of the films effects are practical and this does not surprise me at all because i had an extremely hard job pinpointing what is CGI and what isn't (with the exception of the prosthetic arm used by Theron's character). The real stand out for me was Nicolas Hult as Nux who is a character that you never know whether he is a villain or not. At first he seems insane, like our villain Immortal Joe (not the Toecutter), but you do get to know him and you do in fact feel for his character and even have sympathy for him and want him to succeed at points.By the end of the film, all the non stop action sequences that are thrown at us might seem too much, but they really aren't. Tom Hardy is as badass if not more than Mel Gibson (like i said though, i haven't seem all the Mad Max films) and Charlize Theron with the rest of the supporting cast do this film justice. You hear a lot about long overdue sequels spoiling what was once a great franchise but Fury Road just improves it. I hope that Jurrassic World and even Terminator Genysis can take a leaf out of this film's book. Mad Max:Fury Road deserves all the praise it is getting and is definitely one to get on blu-ray. See this film and you will have a Lovely Day as Nux would say. Plus, the flamethrower guitar dude was awesome, look out for him.",
    "115": "Max (Tom Hardy) is haunted by his past failures to save the innocent. He is captured by Immortan Joe and his men. Imperator Furiosa (Charlize Theron) is driving the war rig to transport to Gas Town and Bullet Farm. Instead, she has freed Immortan Joe's imprisoned wives and escaping back to her former home, the Green Place. Max is chained as a blood bag on the front of his car with War Boy Nux (Nicholas Hoult).The action is unrelenting. The car stunts are amazing and fully worthy of the Mad Max name. It is pure energy on screen. The only thing missing is a gyrocopter and Mel Gibson. Tom Hardy is physically acceptable as Mad Max although I'm not thrilled with the character. He's lost a bit of the spark. The spark he lost has been transferred to Furiosa and has lit a blazing inferno. She is more Mad Max than Mad Max. I am also pleasantly surprised that Rosie Huntington-Whiteley is actually good in this movie. The action, the outrageous vehicles and the pure energy make this something unlike anything else. I would suggest putting the stunts in the closing credits Jackie Chan style.",
    "116": "Understand first where I come from. I am a die hard fan of the Terminator saga, and particularly loved T2. I watched all previous Mad Max movies and I did like them. And I have seen pretty much every post-apocalyptic movie and TV show there is, because this is how I roll.So when I come to see Mad Max 4 I know what to expect. I know it's going to be pretty much action everywhere, a bit of background story, and some character development to keep it all somehow together. I do not expect more, but I also don't expect less because that is what the Mad Max franchise has been giving us.Then, before I get to see this movie, I read all sorts of great reviews from everywhere. I do not read spoilers, and I do not watch trailers, but I can feel from all these reviews that this Mad Max movie seems to have something going for it. It even ranked number 1 of 2015 in IMDb, the very site where I do all my movie reviews, so I decided to give it a go.Unfortunately, this is what I've found: A Benny Hill-esque type of movie but without trying to be fun. Also without any character development, background story, or pretty much anything other than action that gets boring after the first five minutes of it.And it's not like the story didn't have a change to fill those gaps: The main characters give us a hint, even sometimes a mysterious indication, of things that happened to them and things that they wanted. What happened to character X's past that are so present in the movie? What sort of accident happened to character Y? Why character Z became the big boss of that one tribe? Unfortunately there seem to be no time to answer any of these questions, or any question for that matter, nor time for any development or attachment whatsoever.Speaking of time, you may argue that there was none for all the questions I had. Well, Mad Max 4 is a good 2 hours, so I tend to disagree with that. The movie could easily do without 20 minutes of meaningless vehicle chase and put that time for the audience to learn the bare minimum about the characters so we did not feel we where the audience of some sort of monster truck show.To make matters worse, the movie don't even have the minimum respect to fundamental physics. And nope, I am not splitting hairs here. I am not going to tell you that a vehicle cannot fly that high or anything like that. I am going to stick to the basis: Humans cannot run as fast as moving vehicles at high speed. Humans cannot run for miles without panting for at least a couple of minutes. Pregnant humans on their nine month of pregnancy cannot run as fast as non-pregnant humans. And of course, if going in a hurry from point A to point B takes X hours, going back in the exact same route with the same hurry should take more or less the same time. But not in the world of Mad Max 4. Here everything goes because, apparently, the audience will love the franchise so much that it will justify every single of the many errors of this movie.The funny thing is that for a while it seemed to work. I went to watch it with someone not familiar with the franchise, and for a while I tried to forgive and explain the movie, as in \"well, maybe the vehicle looked like in a hurry but in reality was making 2 miles an hour\" but at the end my companion and I decided to laugh it off even though the laugh was on us because the investors of these movie were the ones pocketing our cash.So my advice to you is the following: Do not bother. Wait until it goes for free on your TV, or you have a long flight and it's on. Or skip it all together. Watch again one of the old Mad Max movies and be done with it.",
    "117": "What do I mean by saying that Mad Max: Fury Road, a heavy metal action movie about a group of women led by Imperator Furiosa (and that other guy, Max his name) trying to find safe haven away from the barbarians (especially a Darth Vader-style slave-master) of the post apocalyptic wastelands, by saying 'pure cinema'? It might be unfair to filmmakers who may just love to hear their characters talk. and dialog-driven films can be made cinematic in the right hands. But what I mean to say is that George Miller really would have been perfectly at home working during the silent era, when all you needed to show were images of things happening, frenetically with the occasional dialog, to get your point across. I've seen Fury Road twice in a week and I have to wonder if Miller really wanted to be Buster Keaton or Abel Gance when he was going to the movies. Not to say westerns don't figure plenty in the framework - they have since the original film, and certainly the Road Warrior is nothing without the Cowboys vs Indians aesthetic.But Miller eschews a ton of exposition at the start and puts the characters right into the thick of the story: Furiosa goes to get the gasoline for Immortan Joe (Hugh Keays-Byrne, formerly Toecutter oddly enough in Mad Max 1) and goes her own path - she wants to get to the Green Place with ladies that are \"property\" of Joes, and she will stop at nothing to get there. Max is along for the ride, one of those great, wild visual touches has him strapped to the front of a vehicle with a grated mask over his face - and is once again the reluctant hero for this journey.We find out all of this along the way really, which shows how economical Miller is in his storytelling. He doesn't waste any time, and all that matters is keeping this bad motherf**** of a movie on a roll. The first major action sequence, a chase of the war parties against Furiosa, would be the climax of any other film. For Miller, it's just the start, and even when character try to take a rest (certainly in the first half) there's still tension and suspense going on. And when I mean by pure cinema, take the moment where Max first confronts Furiosa and the women by the truck. He has a gun on them, we know it's loaded from an incident we just saw, but they don't, so there's a level of tension for them but not so much for us. Then the gun gets wrestled away, a fight ensues (a manic fight, but cut beautifully), and yet the chase is still technically underway with the vehicles off in the distance.Very little of that, and other scenes in the film, need any dialog, though characters do still speak (Max, going back to the Road Warrior, was Miller's Man With No Name, the Ronin, the dude who says little but is a big man of action). When characters do talk, there is humanity given, even some dark humor (Nicholas Hoult's character is a good example of that). But what's so mesmerizing and awesome about Fury Road is Miller pushing the envelope even further and, in a way, correcting some things that he went with in Beyond Thunderdome. The movie is bleak but not hopeless for the characters, and there's barely a moment where the stakes aren't super high. Even a moment that is relatively calm like, yes, trying to pull the tanker out muddy sand with another vehicle a ways behind firing a machine gun this way and that (the driver's got blood in his eyes, woops), is kinetic and sensational.And throughout we see two things here that are refreshing: a style of direction and editing where you can always tell what's going on, which vehicle is in relation to the others even/especially during these bug-f*** crazy chases, and this seems to be a welcome thing during an era where action movies are cut too fast and shot too close. Miller has a method of controlled mayhem and fiasco, and so it's a film with about 3,000+ shots and barely a one is wasted. The other one is Charlize Theron. It's really her story - kind of like Eli Wallach in Good/Bad/Ugly, with Max as Clint Eastwood - and her performance is rough, powerful, sometimes stoic but also sometimes incredibly emotional, and she's not afraid in the slightest to show vulnerability just as much as the courage and bad-ass-ery. It's one of those woman action heroes and performances that'll be up there with the greats.Miller started in Ozsploitation with the first movie, and as the Maxs have gotten bigger in size and budget he hasn't lost the spirit of making things madcap, from the gnarled vehicles and character designs to a man who plays guitar that shoots out flames while on top of a rig (and drummers on the back). Why does this guy keep doing this? Well... he loves it, that's why! If you can dig the idea of seeing that, then you should dig seeing the whole thing: it delivers compelling heroes, nasty villains, an unforgiving landscape, and details that'll make you want to come back to see what you missed. At 2 hours it almost feels like 'that's it'? And last but not least, Hardy is a fine new Max, making his own of the role that previously got Mel Gibson his career kick-started. He may not have the same level of charisma as Gibson perhaps, but the devilish fun and cunning is still there, the wild gunslinger who will kill you if he has to but would (deep down) rather not, is there in Hardy, and I can't wait to see more of what he does with the role in future films.",
    "118": "I mean sure, as far as summer blockbusters go, we have had a bit of a dry spell this year. (At least in my opinion.) However, to call this \"The Best Movie of the Year\" or \"A Masterpiece\" that's kinda stretching it isn't it? Seriously, what's so great about this movie? Were the critics watching a different movie from the one than I did? Originally, I wasn't going to write a review for this movie, but after seeing so many raving reviews for this film on the internet, and seeing the absurdly high rating this movie has here on IMDb, I felt that I had to say SOMETHING! Even if my hopes of knocking this movie down a point or two are completely moot, then at least I would've accomplished something by saying how much I hated this film, and add my voice to the small minority of people on this site that believe that this movie is nothing more than an over-hyped, overrated snore-fest. While watching this movie I fell asleep. Yes! This movie, with it's \"Thrilling action scenes!\" and \"Provocative visuals!\" Actually put me to sleep! I would go into the plot now, but I don't think this movie has one. At least not while I was awake. Furthermore, Mad Max, the supposed \"Main Character\" in this film, has no reason for even being in the film! Why call this film \"Mad Max: Fury Road\", if Mad Max himself has no motivations, or stake into what's going on? And for that matter, why even use the character of Mad Max at all? If you were gonna go that way with it, why not have Mel Gibson appear in a 10-15 minute cameo as an older Mad Max? From what I saw, there was nothing good about this movie. I probably would've been more entertained staring at a wall for two hours. Congratulations George Miller, you've accomplished something that only Rob Zombie and M. Night Shyamalan have been able to do: Cure my insomnia! I present to you, your awards: My middle finger, and a long, loud, raspberry! Bravo A$$hole!",
    "119": "I'm not the biggest fan of the Mad Max trilogy, but i love the films, and despite being the least liked, thunderdome is my favourite. Despite of its flaws, to me its the most complex and the one that comes out more as a film and has all the things that makes a film, more importantly the story. So when the trailers for Fury Road came out, i was super hyped, and it was definitely one of my most hyped films to see in 2015, i couldn't stop thinking what Miller would do with 150 million and the trailers made it look like an epic non stop action film with classic visuals, just pure insane action like no other film. Then critics and audiences acclaimed it to the point of being an instant classic and is now an Oscar contender!, then the Score came out and i loved it so much i couldn't stop listening and it made my expectations even higher, so i went to IMAX with my expectations at an all time high and saw it....And i was so disappointed! I couldn't stop thinking what was i missing since everyone loves it. Sure the visuals are insanely good, the stunts are breathtaking, the score is a killer, the performances are great, it has originality to spare, the production design is an Oscar winner, its so inventive, i mean the cars are insane and the costumes are brilliant, but all the rest pales in comparison.I never went expecting a complex story or even much dialogue, but i was surprised that there was no story, and no dialogue, to the point i was a little bit bored one time or two. I couldn't stop thinking how this could be an Oscar contender with no story or dialogue, and how was the film moving along. But this wasn't my biggest disappointment at all, it was the action, because i really went for the action. And it was just OK, sure it was very realistic and all, but the production videos were a lot more realistic and exciting, the film had a mad look that was cool but takes a lot of the realism and excitement and feels weird.I didn't like the choreography, it was just so simple and had a weird rhythm, there were parts where nothing happened, i couldn't find a single piece of action that i truly liked or was excited. Just things happening. And most of the problem was the edition, that mad look. Also Mad Max felt like a secondary character, just going along, that wouldn't be a problem if furiosa was a great character, but she wasn't, i couldn't relate to any character, because they had no story, no dialogue, they were just insane people with great looks, doing insane things.Overall, i can't feel nothing but disappointment, and sure the technical parts are almost perfect, the cinematography, the sound, the production design, the visuals are insanely good, but all the rest pales in comparison, no story, nothing i could relate to, not even the action that is so blunt and simplistic, even with its real stunts and all. This is the weakest of all Mad Max films. This film is hugely overrated, and its another one i cant share the same opinion the world has, but since everyone loves it so much, i must be the problem, I'm not saying the film isn't good, i just cant agree with everyone, i just cant see what makes it so great. This was one of the most strangest experiences at the movies i ever had.",
    "120": "There are very few movies which deliver exactly what they promise and Mad Max: Fury Road is one of those few. This is dark, tiring, brutal and a very serious movie. But it is visually brilliant and there is no complication when it comes to the storyline. The movie is nothing like the Mel Gibson starred Mad Max but a unique, Theron- Hardy show. As many of the futuristic movies, this is also set on an apolcalyptic world where there is scarcity of basic elements. It is ruled by 'Immortal Joe' who is considered to be immortal by those below him. But only few like Furiosa (Theron) who knew the truth takes on him by trying to take his many wives away from him into a better place. Mad Max a prisoner of Immortal Joe who is on neither side happens to be in the midst of this chaos, ends up teaming up with Furiosa to reveal the truth to the people.The film is packed with ruthless action, some epic BGM by Junkie XL who got us that pump up feeling in 300: rise of an empire as well. It is a bit tiring to watch the first 20-25 minutes, but once you start getting the hang of the story, it gets us involved very soon. Tom Hardy hardly speaks in the movie and Charlize Theron has a very important role. Nicholas Hoult is brilliant. A very unique role for him. Other hot girls like Rosie Huntington Whitley are for the pleasant sight at times. If you are a fan of action genre, this is a movie you must not miss. All credit to the director for the grand presentation of the simple storyline.",
    "121": "Mad Max Fury Road is a stunningly beautiful and highly charged kinetic thrill ride. It is brilliantly filmed with amazing, and well suited bombastic soundtrack. The star of the film is its direction by George Miller, showing generation MTV how to direct moving action without getting lost in its mayhem. Almost every shot is moving, similar to a James Cameron action sequence. As mentioned before the film has not got much of a plot other then a giant chase. The first half of the film is great and the second half starts to loose steam due to what has come before it. Chalize Theron is great and adds presence to the film, it is one of her best performances. Tom Hardy gives a solid performance but I found his performance somewhat lacking, he does not have much to work with and is limited to a handful of dialogue, I preferred Mel Gibson's Max. The film suffers when it eventually slows down in pace, but when it is going full throttle there are not many films that can complete with it. Is it an action classic? as a chase film , yes I would say it is, along with set design and stunt work involved But the lack of any real story and small plot holes stop me giving this film a 10, not much is explained in the film. The ending seems sudden and could of done with some more depth to it, especially the Max character. It is still a wonderful and refreshingly directed film to add to the Mad Max Cannon of films.",
    "122": "Mad Max: Fury Road is a visually stunning masterpiece by George Miller. It's been 30 years since Miller's last project: the last of the original Mad Max films, starring Mel Gibson. Comparisons cannot be made as I've yet to watch them. There are no excuses. Max's crazy adventure may not take him very far, but the world in which he resides is imaginative. The vast wasteland surrounding small territories show how bleak everything has become. Water is sparse and saved for the main cretin and his crew. Weird, cult-like followers, with their bald heads, white painted bodies and addiction to silvery substance, follow his orders. There's no sign of any nature, only a rumour of a place populated by trees and running water. Theron's barbaric-looking Furiosa, with her metal arm and gigantic tanker, thwarts her bosses' orders and steals that which is most precious to him. Immortan Joe (Keays-Byrne) gathers his whole force in pursuit. What emanates is a fantastically frenzied chase across the desert. MM:FR is full of insane car chases (the cars are a sight to behold in themselves), incredible explosions and well thought-out action. The 3D isn't necessary; only one part stands out in particular and the story is only strong enough to keep the action expressive. Max (Hardy), with his gruff voice and limited dialogue, is secondary to Furiosa. His serenity and coldness towards others makes him the perfect character to explore. Flashes of his family, from a world once known, haunt him constantly. Mad Max: Fury Road isn't just creative and captivating to the very end, it sets up potential for expansion. After this ride, it'd be criminal for the film studio not to.",
    "123": "It took me almost eight years to see this movie; it was long overdue. I had expectations, a lot, and perhaps that initiated the eventual phase of my disappointment.I didn't like Mad Max: Fury Road. I know telling this would upset so many of you; I can already sense those frowning gazes, and I'm well aware that I fall into the minority here with my above statement, but in the end, it is what it is. I gotta stick to my honesty like always, and this would not be made into an exception.Now, the movie itself is not bad, but this didn't intrigue me in a way I was hoping it would. The action and the setpieces are some of the best I have ever experienced, and I do not have any problems with its technicalities as well. Matter of fact, I too enjoyed them to a certain extent.It's just the story that failed to captivate. I have my reservations there. Neither the narrative nor the characters did much for me! I wasn't really invested in their arcs or in any of their journeys or closures. I do not know what went wrong in here, but if I have to take a safe guess, maybe the direction didn't appeal; it did not work for me like it did for so many out there, and that's quite unfortunate.",
    "124": "Oh my god, is this movie terrible, or am I just getting old?ACTION!ACTION! ACTION! And WAIT FOR IT! MORE ACTION! No real plot. What story there is, is ridiculous. Seriously? \"OK, we've just run through an amazingly savage gauntlet that killed most of us. We can't go this way, let's turn back around and run back through it!\" With pretty ladies...Seriously? I weep for the youth of the world who actually think this garbage, basically 2 hours of non-stop shooting and CGI, is \"entertainment\".The basic philosophy seems to be \"IF WE EXPLODE ENOUGH STUFF, IT'S GOOD! MORE STUFF? EVEN BETTER! What's character development and pacing?\" Ew.",
    "125": "Mad Max: Fury Road, the newest from George Miller was a film i never had much interest in. I haven't really seen the others in the franchise (i say haven't really because i have seen about half of the original) but to be honest it isn't really nesscessary. Im not sure if this is a prequel or sequel but whatever it is doesn't really matter as this is quite possibly the action film of the year and has some of the best action sequences of the decade in fact.If i were to explain plot here it would seem very thin because in terms of plot there isn't a huge deal of it, although this isn't really a bad thing. It follows Max as played by Tom Hardy who does do a great job following the footsteps of Mel Gibson, as well as rebel Furiosa played by Charlize Theron at the top of her game. The two go on a journey to i guess restore order to the post-apocalyptic world we are introduced to from the start of the film. Everybody in this film does a really good job, Tom Hardy's Australian accent wasn't the best i have heard but he doesn't say a great deal, most of the dialogue does come from Theron's Furiosa and she really adds a moral contrast to his performance and they play well of each other, in fact this as much her film as it is Hardy's which i was worried about being called \"Mad Max\" and all, but it doesn't bring the film down by a single notch.Now earlier on i mentioned that the film's plot isn't a very strong one. The reason this isn't a problem? Because the film is pretty much one huge action set piece. From the beginning to the very end the action does not stop. It is very much a road movie, but not a stereotypical road trip movie, it is a road movie where cars explode at every given moment and blood is splattered around with no remorse. I found out 80% of the films effects are practical and this does not surprise me at all because i had an extremely hard job pinpointing what is CGI and what isn't (with the exception of the prosthetic arm used by Theron's character). The real stand out for me was Nicolas Hult as Nux who is a character that you never know whether he is a villain or not. At first he seems insane, like our villain Immortal Joe (not the Toecutter), but you do get to know him and you do in fact feel for his character and even have sympathy for him and want him to succeed at points.By the end of the film, all the non stop action sequences that are thrown at us might seem too much, but they really aren't. Tom Hardy is as badass if not more than Mel Gibson (like i said though, i haven't seem all the Mad Max films) and Charlize Theron with the rest of the supporting cast do this film justice. You hear a lot about long overdue sequels spoiling what was once a great franchise but Fury Road just improves it. I hope that Jurrassic World and even Terminator Genysis can take a leaf out of this film's book. Mad Max:Fury Road deserves all the praise it is getting and is definitely one to get on blu-ray. See this film and you will have a Lovely Day as Nux would say. Plus, the flamethrower guitar dude was awesome, look out for him.",
    "126": "Max (Tom Hardy) is haunted by his past failures to save the innocent. He is captured by Immortan Joe and his men. Imperator Furiosa (Charlize Theron) is driving the war rig to transport to Gas Town and Bullet Farm. Instead, she has freed Immortan Joe's imprisoned wives and escaping back to her former home, the Green Place. Max is chained as a blood bag on the front of his car with War Boy Nux (Nicholas Hoult).The action is unrelenting. The car stunts are amazing and fully worthy of the Mad Max name. It is pure energy on screen. The only thing missing is a gyrocopter and Mel Gibson. Tom Hardy is physically acceptable as Mad Max although I'm not thrilled with the character. He's lost a bit of the spark. The spark he lost has been transferred to Furiosa and has lit a blazing inferno. She is more Mad Max than Mad Max. I am also pleasantly surprised that Rosie Huntington-Whiteley is actually good in this movie. The action, the outrageous vehicles and the pure energy make this something unlike anything else. I would suggest putting the stunts in the closing credits Jackie Chan style.",
    "127": "Understand first where I come from. I am a die hard fan of the Terminator saga, and particularly loved T2. I watched all previous Mad Max movies and I did like them. And I have seen pretty much every post-apocalyptic movie and TV show there is, because this is how I roll.So when I come to see Mad Max 4 I know what to expect. I know it's going to be pretty much action everywhere, a bit of background story, and some character development to keep it all somehow together. I do not expect more, but I also don't expect less because that is what the Mad Max franchise has been giving us.Then, before I get to see this movie, I read all sorts of great reviews from everywhere. I do not read spoilers, and I do not watch trailers, but I can feel from all these reviews that this Mad Max movie seems to have something going for it. It even ranked number 1 of 2015 in IMDb, the very site where I do all my movie reviews, so I decided to give it a go.Unfortunately, this is what I've found: A Benny Hill-esque type of movie but without trying to be fun. Also without any character development, background story, or pretty much anything other than action that gets boring after the first five minutes of it.And it's not like the story didn't have a change to fill those gaps: The main characters give us a hint, even sometimes a mysterious indication, of things that happened to them and things that they wanted. What happened to character X's past that are so present in the movie? What sort of accident happened to character Y? Why character Z became the big boss of that one tribe? Unfortunately there seem to be no time to answer any of these questions, or any question for that matter, nor time for any development or attachment whatsoever.Speaking of time, you may argue that there was none for all the questions I had. Well, Mad Max 4 is a good 2 hours, so I tend to disagree with that. The movie could easily do without 20 minutes of meaningless vehicle chase and put that time for the audience to learn the bare minimum about the characters so we did not feel we where the audience of some sort of monster truck show.To make matters worse, the movie don't even have the minimum respect to fundamental physics. And nope, I am not splitting hairs here. I am not going to tell you that a vehicle cannot fly that high or anything like that. I am going to stick to the basis: Humans cannot run as fast as moving vehicles at high speed. Humans cannot run for miles without panting for at least a couple of minutes. Pregnant humans on their nine month of pregnancy cannot run as fast as non-pregnant humans. And of course, if going in a hurry from point A to point B takes X hours, going back in the exact same route with the same hurry should take more or less the same time. But not in the world of Mad Max 4. Here everything goes because, apparently, the audience will love the franchise so much that it will justify every single of the many errors of this movie.The funny thing is that for a while it seemed to work. I went to watch it with someone not familiar with the franchise, and for a while I tried to forgive and explain the movie, as in \"well, maybe the vehicle looked like in a hurry but in reality was making 2 miles an hour\" but at the end my companion and I decided to laugh it off even though the laugh was on us because the investors of these movie were the ones pocketing our cash.So my advice to you is the following: Do not bother. Wait until it goes for free on your TV, or you have a long flight and it's on. Or skip it all together. Watch again one of the old Mad Max movies and be done with it.",
    "128": "What do I mean by saying that Mad Max: Fury Road, a heavy metal action movie about a group of women led by Imperator Furiosa (and that other guy, Max his name) trying to find safe haven away from the barbarians (especially a Darth Vader-style slave-master) of the post apocalyptic wastelands, by saying 'pure cinema'? It might be unfair to filmmakers who may just love to hear their characters talk. and dialog-driven films can be made cinematic in the right hands. But what I mean to say is that George Miller really would have been perfectly at home working during the silent era, when all you needed to show were images of things happening, frenetically with the occasional dialog, to get your point across. I've seen Fury Road twice in a week and I have to wonder if Miller really wanted to be Buster Keaton or Abel Gance when he was going to the movies. Not to say westerns don't figure plenty in the framework - they have since the original film, and certainly the Road Warrior is nothing without the Cowboys vs Indians aesthetic.But Miller eschews a ton of exposition at the start and puts the characters right into the thick of the story: Furiosa goes to get the gasoline for Immortan Joe (Hugh Keays-Byrne, formerly Toecutter oddly enough in Mad Max 1) and goes her own path - she wants to get to the Green Place with ladies that are \"property\" of Joes, and she will stop at nothing to get there. Max is along for the ride, one of those great, wild visual touches has him strapped to the front of a vehicle with a grated mask over his face - and is once again the reluctant hero for this journey.We find out all of this along the way really, which shows how economical Miller is in his storytelling. He doesn't waste any time, and all that matters is keeping this bad motherf**** of a movie on a roll. The first major action sequence, a chase of the war parties against Furiosa, would be the climax of any other film. For Miller, it's just the start, and even when character try to take a rest (certainly in the first half) there's still tension and suspense going on. And when I mean by pure cinema, take the moment where Max first confronts Furiosa and the women by the truck. He has a gun on them, we know it's loaded from an incident we just saw, but they don't, so there's a level of tension for them but not so much for us. Then the gun gets wrestled away, a fight ensues (a manic fight, but cut beautifully), and yet the chase is still technically underway with the vehicles off in the distance.Very little of that, and other scenes in the film, need any dialog, though characters do still speak (Max, going back to the Road Warrior, was Miller's Man With No Name, the Ronin, the dude who says little but is a big man of action). When characters do talk, there is humanity given, even some dark humor (Nicholas Hoult's character is a good example of that). But what's so mesmerizing and awesome about Fury Road is Miller pushing the envelope even further and, in a way, correcting some things that he went with in Beyond Thunderdome. The movie is bleak but not hopeless for the characters, and there's barely a moment where the stakes aren't super high. Even a moment that is relatively calm like, yes, trying to pull the tanker out muddy sand with another vehicle a ways behind firing a machine gun this way and that (the driver's got blood in his eyes, woops), is kinetic and sensational.And throughout we see two things here that are refreshing: a style of direction and editing where you can always tell what's going on, which vehicle is in relation to the others even/especially during these bug-f*** crazy chases, and this seems to be a welcome thing during an era where action movies are cut too fast and shot too close. Miller has a method of controlled mayhem and fiasco, and so it's a film with about 3,000+ shots and barely a one is wasted. The other one is Charlize Theron. It's really her story - kind of like Eli Wallach in Good/Bad/Ugly, with Max as Clint Eastwood - and her performance is rough, powerful, sometimes stoic but also sometimes incredibly emotional, and she's not afraid in the slightest to show vulnerability just as much as the courage and bad-ass-ery. It's one of those woman action heroes and performances that'll be up there with the greats.Miller started in Ozsploitation with the first movie, and as the Maxs have gotten bigger in size and budget he hasn't lost the spirit of making things madcap, from the gnarled vehicles and character designs to a man who plays guitar that shoots out flames while on top of a rig (and drummers on the back). Why does this guy keep doing this? Well... he loves it, that's why! If you can dig the idea of seeing that, then you should dig seeing the whole thing: it delivers compelling heroes, nasty villains, an unforgiving landscape, and details that'll make you want to come back to see what you missed. At 2 hours it almost feels like 'that's it'? And last but not least, Hardy is a fine new Max, making his own of the role that previously got Mel Gibson his career kick-started. He may not have the same level of charisma as Gibson perhaps, but the devilish fun and cunning is still there, the wild gunslinger who will kill you if he has to but would (deep down) rather not, is there in Hardy, and I can't wait to see more of what he does with the role in future films.",
    "129": "I mean sure, as far as summer blockbusters go, we have had a bit of a dry spell this year. (At least in my opinion.) However, to call this \"The Best Movie of the Year\" or \"A Masterpiece\" that's kinda stretching it isn't it? Seriously, what's so great about this movie? Were the critics watching a different movie from the one than I did? Originally, I wasn't going to write a review for this movie, but after seeing so many raving reviews for this film on the internet, and seeing the absurdly high rating this movie has here on IMDb, I felt that I had to say SOMETHING! Even if my hopes of knocking this movie down a point or two are completely moot, then at least I would've accomplished something by saying how much I hated this film, and add my voice to the small minority of people on this site that believe that this movie is nothing more than an over-hyped, overrated snore-fest. While watching this movie I fell asleep. Yes! This movie, with it's \"Thrilling action scenes!\" and \"Provocative visuals!\" Actually put me to sleep! I would go into the plot now, but I don't think this movie has one. At least not while I was awake. Furthermore, Mad Max, the supposed \"Main Character\" in this film, has no reason for even being in the film! Why call this film \"Mad Max: Fury Road\", if Mad Max himself has no motivations, or stake into what's going on? And for that matter, why even use the character of Mad Max at all? If you were gonna go that way with it, why not have Mel Gibson appear in a 10-15 minute cameo as an older Mad Max? From what I saw, there was nothing good about this movie. I probably would've been more entertained staring at a wall for two hours. Congratulations George Miller, you've accomplished something that only Rob Zombie and M. Night Shyamalan have been able to do: Cure my insomnia! I present to you, your awards: My middle finger, and a long, loud, raspberry! Bravo A$$hole!",
    "130": "I'm not the biggest fan of the Mad Max trilogy, but i love the films, and despite being the least liked, thunderdome is my favourite. Despite of its flaws, to me its the most complex and the one that comes out more as a film and has all the things that makes a film, more importantly the story. So when the trailers for Fury Road came out, i was super hyped, and it was definitely one of my most hyped films to see in 2015, i couldn't stop thinking what Miller would do with 150 million and the trailers made it look like an epic non stop action film with classic visuals, just pure insane action like no other film. Then critics and audiences acclaimed it to the point of being an instant classic and is now an Oscar contender!, then the Score came out and i loved it so much i couldn't stop listening and it made my expectations even higher, so i went to IMAX with my expectations at an all time high and saw it....And i was so disappointed! I couldn't stop thinking what was i missing since everyone loves it. Sure the visuals are insanely good, the stunts are breathtaking, the score is a killer, the performances are great, it has originality to spare, the production design is an Oscar winner, its so inventive, i mean the cars are insane and the costumes are brilliant, but all the rest pales in comparison.I never went expecting a complex story or even much dialogue, but i was surprised that there was no story, and no dialogue, to the point i was a little bit bored one time or two. I couldn't stop thinking how this could be an Oscar contender with no story or dialogue, and how was the film moving along. But this wasn't my biggest disappointment at all, it was the action, because i really went for the action. And it was just OK, sure it was very realistic and all, but the production videos were a lot more realistic and exciting, the film had a mad look that was cool but takes a lot of the realism and excitement and feels weird.I didn't like the choreography, it was just so simple and had a weird rhythm, there were parts where nothing happened, i couldn't find a single piece of action that i truly liked or was excited. Just things happening. And most of the problem was the edition, that mad look. Also Mad Max felt like a secondary character, just going along, that wouldn't be a problem if furiosa was a great character, but she wasn't, i couldn't relate to any character, because they had no story, no dialogue, they were just insane people with great looks, doing insane things.Overall, i can't feel nothing but disappointment, and sure the technical parts are almost perfect, the cinematography, the sound, the production design, the visuals are insanely good, but all the rest pales in comparison, no story, nothing i could relate to, not even the action that is so blunt and simplistic, even with its real stunts and all. This is the weakest of all Mad Max films. This film is hugely overrated, and its another one i cant share the same opinion the world has, but since everyone loves it so much, i must be the problem, I'm not saying the film isn't good, i just cant agree with everyone, i just cant see what makes it so great. This was one of the most strangest experiences at the movies i ever had.",
    "131": "There are very few movies which deliver exactly what they promise and Mad Max: Fury Road is one of those few. This is dark, tiring, brutal and a very serious movie. But it is visually brilliant and there is no complication when it comes to the storyline. The movie is nothing like the Mel Gibson starred Mad Max but a unique, Theron- Hardy show. As many of the futuristic movies, this is also set on an apolcalyptic world where there is scarcity of basic elements. It is ruled by 'Immortal Joe' who is considered to be immortal by those below him. But only few like Furiosa (Theron) who knew the truth takes on him by trying to take his many wives away from him into a better place. Mad Max a prisoner of Immortal Joe who is on neither side happens to be in the midst of this chaos, ends up teaming up with Furiosa to reveal the truth to the people.The film is packed with ruthless action, some epic BGM by Junkie XL who got us that pump up feeling in 300: rise of an empire as well. It is a bit tiring to watch the first 20-25 minutes, but once you start getting the hang of the story, it gets us involved very soon. Tom Hardy hardly speaks in the movie and Charlize Theron has a very important role. Nicholas Hoult is brilliant. A very unique role for him. Other hot girls like Rosie Huntington Whitley are for the pleasant sight at times. If you are a fan of action genre, this is a movie you must not miss. All credit to the director for the grand presentation of the simple storyline.",
    "132": "Mad Max Fury Road is a stunningly beautiful and highly charged kinetic thrill ride. It is brilliantly filmed with amazing, and well suited bombastic soundtrack. The star of the film is its direction by George Miller, showing generation MTV how to direct moving action without getting lost in its mayhem. Almost every shot is moving, similar to a James Cameron action sequence. As mentioned before the film has not got much of a plot other then a giant chase. The first half of the film is great and the second half starts to loose steam due to what has come before it. Chalize Theron is great and adds presence to the film, it is one of her best performances. Tom Hardy gives a solid performance but I found his performance somewhat lacking, he does not have much to work with and is limited to a handful of dialogue, I preferred Mel Gibson's Max. The film suffers when it eventually slows down in pace, but when it is going full throttle there are not many films that can complete with it. Is it an action classic? as a chase film , yes I would say it is, along with set design and stunt work involved But the lack of any real story and small plot holes stop me giving this film a 10, not much is explained in the film. The ending seems sudden and could of done with some more depth to it, especially the Max character. It is still a wonderful and refreshingly directed film to add to the Mad Max Cannon of films.",
    "133": "Mad Max: Fury Road is a visually stunning masterpiece by George Miller. It's been 30 years since Miller's last project: the last of the original Mad Max films, starring Mel Gibson. Comparisons cannot be made as I've yet to watch them. There are no excuses. Max's crazy adventure may not take him very far, but the world in which he resides is imaginative. The vast wasteland surrounding small territories show how bleak everything has become. Water is sparse and saved for the main cretin and his crew. Weird, cult-like followers, with their bald heads, white painted bodies and addiction to silvery substance, follow his orders. There's no sign of any nature, only a rumour of a place populated by trees and running water. Theron's barbaric-looking Furiosa, with her metal arm and gigantic tanker, thwarts her bosses' orders and steals that which is most precious to him. Immortan Joe (Keays-Byrne) gathers his whole force in pursuit. What emanates is a fantastically frenzied chase across the desert. MM:FR is full of insane car chases (the cars are a sight to behold in themselves), incredible explosions and well thought-out action. The 3D isn't necessary; only one part stands out in particular and the story is only strong enough to keep the action expressive. Max (Hardy), with his gruff voice and limited dialogue, is secondary to Furiosa. His serenity and coldness towards others makes him the perfect character to explore. Flashes of his family, from a world once known, haunt him constantly. Mad Max: Fury Road isn't just creative and captivating to the very end, it sets up potential for expansion. After this ride, it'd be criminal for the film studio not to.",
    "134": "It took me almost eight years to see this movie; it was long overdue. I had expectations, a lot, and perhaps that initiated the eventual phase of my disappointment.I didn't like Mad Max: Fury Road. I know telling this would upset so many of you; I can already sense those frowning gazes, and I'm well aware that I fall into the minority here with my above statement, but in the end, it is what it is. I gotta stick to my honesty like always, and this would not be made into an exception.Now, the movie itself is not bad, but this didn't intrigue me in a way I was hoping it would. The action and the setpieces are some of the best I have ever experienced, and I do not have any problems with its technicalities as well. Matter of fact, I too enjoyed them to a certain extent.It's just the story that failed to captivate. I have my reservations there. Neither the narrative nor the characters did much for me! I wasn't really invested in their arcs or in any of their journeys or closures. I do not know what went wrong in here, but if I have to take a safe guess, maybe the direction didn't appeal; it did not work for me like it did for so many out there, and that's quite unfortunate.",
    "135": "Oh my god, is this movie terrible, or am I just getting old?ACTION!ACTION! ACTION! And WAIT FOR IT! MORE ACTION! No real plot. What story there is, is ridiculous. Seriously? \"OK, we've just run through an amazingly savage gauntlet that killed most of us. We can't go this way, let's turn back around and run back through it!\" With pretty ladies...Seriously? I weep for the youth of the world who actually think this garbage, basically 2 hours of non-stop shooting and CGI, is \"entertainment\".The basic philosophy seems to be \"IF WE EXPLODE ENOUGH STUFF, IT'S GOOD! MORE STUFF? EVEN BETTER! What's character development and pacing?\" Ew.",
    "136": "I watched this movie with my sister and some friends in theaters back when it came out. My Dad had showed my sister and I The Road Warrior and I had LOVED it- when the trailer for this came out she excitedly showed us and I was drawn right in. We ended up going to see it and I can say for certain I have never had a movie-going experience like this one...I always envied people who got to see films back when movies were still exciting novelties that could blow audiences away, like the first audiences to see Star Wars, and I was sad id never get to experience that type of thrill. Boy was I wrong.This movie is better than any roller-coaster ive ever been on; better than any drug ive ever done; more adrenalyne pumping than any near death experience Ive ever had and has truly earned that funny phrase \"better than sex.\" It is a non-stop, straight forward action filled ROMP where every single detail has been considered and you notice something new everytime. Every shot; every cut; every punch; every bullet fired; every crash; every scream; every explosion, gets your heart pumping faster and faster as you feel more and more invested in the conflict our heroes face. Part of that is because despite minimal dialogue and maximum action- you care more about these characters thsn you will in most modern movies. This movie has HEART, and a great message. It's story-telling and themes are the epitome of show don't tell. There is rarely exposition dialogue, instead props, scenes, and character costumes communicate everything you need to know about them and this hellworld our story takes place in. More is communicated in a simple nod than most movies achieve in entire scenes- partly credit to the actors and partly just because the writing and pacing are executed flawlessly. Sometimes I rewatch it when I want to feel inspired in our own warlord-run wasteland.This movie is all gas; no breaks, start to finish. Incredibly rewatchable and never loses that high-octane adrenalyne rush I felt upon first viewing.When we finished the movie that first time we went, it was downpouring out with thunder and lightning. But we were so amped up that as I drove everyone home, my friends and sister in the backseat leaned out windows and climbed out the sunroof to scream \"WITNESS ME!\" into the raging storm... in defiance of all that things ahead on the road... 2015 was a simpler time.This is my favorite film, and it's not even close.",
    "137": "\"As the world fell it was hard to know who was more crazy. Me... Or everyone else.\"To describe George Miller's fourth post-apocalyptic Mad Max film as crazy would be an understatement because it is one of those rare over the top and unique action films that keeps you at the edge of your seat during its entire runtime with fantastic car chases and inventive fighting scenes that feel like a breath of fresh air in an era dominated by CGI effects. The visuals absolutely stun you and Miller's amazing vision of this apocalyptic wasteland is beautifully captured through the camera. It may have taken 30 years for this sequel to be released, but it is a huge improvement over Beyond Thunderdome and it manages to build on what The Road Warrior had achieved by introducing a much more chaotic world and colorful characters. Fury Road works both ways as either a sequel or a reboot, and it erases most of the problems I had with Max's character in the previous film. This is a return to what Miller had done in The Road Warrior, but with a much higher budget to work with and that allowed his vision to be fully fulfilled here. Three more Mad Max films are already in the talks and I can't wait to embark with Max on his next adventures. This is going to be a very difficult film to top and so far it's the best 2015 has to offer.In Fury Road, Tom Hardy replaces Mel Gibson for the lead role of Max, a wondering warrior who's still coping with the loss of his wife and son as he travels through the post-apocalyptic deserted wasteland. The film begins with a group of bandits chasing Max who eventually capture him and take him to The Citadel, where a ruthless leader named Immortan Joe (Hugh Keays-Byrne) controls the water supply for the masses that have gathered below the heights of the mountain where he is based. Joe doesn't just control the water supply, he also has a large army of War Boys who he has trained to sacrifice themselves willingly for his service, farming women who breed their breast milk, and even several beautiful wives to give him children. Joe has created quite an empire, and Max has been enslaved to serve as a blood donor for the injured War Boys. We are introduced to this crazy place and its rules as Joe sends his trusted lieutenant, Imperator Furiosa (Charlize Theron) on a local errand with her fuel filled rig to Gasland. However, she decides to take another route and her intentions are soon revealed. She is helping some of Joe's wives escape from their enslavement promising to lead them to the green lands. When Joe discovers that she has betrayed him he sends all his boys out on a desperate chase and that includes Nux (Nicholas Hoult), one of the War Boys who is using Max as his personal blood bag. Nux chains Max to the front of his vehicle and brings him along the desperate and nonstop chase that ensues. For the next two hours Fury Road is basically one extensive chase that will get the entire audiences' blood pumping. I've praised Miller's vision and his direction, as well as the spectacular action set pieces he has crafted, but it wouldn't do this film justice if the cast didn't receive its share of praise as well. It isn't easy to fill the shoes of such an iconic character like Mad Max, but Tom Hardy pulled it off in a very convincing matter. As much as I like Mel Gibson, I have to give Hardy a lot of praise for delivering such an entertaining performance. He is one of my favorite actors working today. It was also great to see Hugh Keays-Byrne back in a Mad Max film playing a different character this time, but he absolutely nailed the menacing role of Joe. Nicholas Hoult was also a pleasant surprise, but perhaps the greatest addition to this franchise was Charlize Theron's Furiosa who injects the film with a very much needed feminist tone. Theron delivers perhaps the strongest and most memorable role in the movie and she is one kick-ass action star. It helped that she got a lot of action scenes where she actually got to do something instead of being the damsel in distress. The look of the film is also breathtaking, and the way that Miller envisions this world is simply fantastic. The cool vehicles are built from all sorts of scrappy metals and materials you'd collect in the wasteland. Everything about this film is simply fantastic and the action scenes don't disappoint one bit. You will feel the rush from the very opening scene and it will continue long after the credits begin to roll. Fury Road is the best film of the franchise. http://estebueno10.blogspot.com/",
    "138": "I am unsure where the rave reviews for this movie are coming from, certainly the film does not deserve its current position in the IMDb top 250.The film supposedly takes place between Mad Max 2 and 3, immediately robbing the audience of any sense of jeopardy for Mad Max.There isn't much of a plot ( and some sources claim that the film didn't even have a script ), just a long desert chase which gets repetitive very quickly.We are given a new actor in the role of Max Rockatansky, Tom Hardy. Sadly, Hardy is less than stellar in the charisma department, and his performance is ineffectual. In addition the film sidelines Max in order to showcase other characters and reduces him to an ineffectual character on the rare occasions when he is given something to do.Charlize Theron is Furiosa, the real star of the movie. Her performance is better but, despite a cascade of social media claims to the contrary, the idea of a warrior woman is an old and tired one even for the Mad Max franchise.The film is mainly a seemingly interminable drive through the desert. Pacing is terrible and I wasn't engaged by the characters.the saving grace is the cinematography, which is beautiful, but not enough to redeem the film as a whole.",
    "139": "After watching this, umm, movie my first reaction was:\"WTF had I just seen?\"Seriously, since I still have no real clue what \"Fury Road\" was trying to be. To me, it felt like someone had done some kind of postapocalyptic action flick with a ton of vehicles and guns, then found that it was lacking a certain mystic touch. And after the film was done, they noticed that it desperately needed a good merchandise almost everybody knows and reveres for sales reasons.And so, they slapped the Mad Max label on it.And obviously forgot what Mad Max I and II were all about (III was already something done to capitalize on I and II plus Tina Turner, but still far better than this worst crash scenario).Okay, so there is no real discernible storyline. Or probably too many of them, I don't know since...see above, no clue. All the very good visuals can't overpaint the facts that the action scenes are drawn out too long, the characters having absolutely no depth with the exception of Nux (doesn't this alone tells a lot about the quality of \"Fury Road\"?) and the actors themselves are playing their roles like being an autopilot on sedatives.Pro tip: If you have never seen any Mad Max movie, start with \"Fury Road\" and whatever you need to make you feel good. When you are sober again, continue with \"Beyond The Thunderdome\" (III, substances not necessarily needed).\nAnd then enjoy Mad Max I and II.One star for the most innovative and impressive car stereo I have ever seen in my whole life.",
    "140": "I have no idea what they thought when made this films... but I sure as hell was not entertained. Mindles action, no story no character backgrounds nothing just a bunch of crazy people driving back and forth on a dirt road doing crazy stuff. The movie was plain crazy... crazier than a bag of cats. To the point that many people that I know who watched it actually fell asleep... why? because too much action without anything else is BORING. I know as my missus fell asleep next to me and when I asked her about the film and her falling asleep she responded \"I don't care, didn't understand anything, what a bunch of rubbish, didn't care about any of the characters\" I am old enough to have watched the originals and boy how disappointing I was with this faker, all they did was to make a movie that has nothing to do with Mad Max franchise. Another over the top re-boot where more money than sense was thrown at it. I have started buying or going through my old old collection of pre 2000, 1990 and 1980 movies as 1 in about 10 movies these days is complete and utter rubbish. They sure as hell don't make them like they sued to. With all the money and special effects... such a shame.At times I felt like the movie was some kind of tragic opera attempt, maybe the director wanted over the top artistic photo/emotional moments without any reason why, just for the heck of it.I have no idea how people rated this movie so high... did they watch the same film? Were they intoxicated or under some kind of drugs? Says a lot about our society and acceptance or sub-mediocre entertainment.Don't get me wrong, I am not someone that enjoys over dramatic and clever movies, I actually love to see something that is fun and entertaining, I really don't like \"clever\" movies that give me too much to think. For example white house down, pacific rim, any of the marvel movies, fast furious series, fun revenge movies such as taken or taken like movies, but this???? what the hell was this?",
    "141": "Mad max: fury road is another movie in the mad max series. It is not a reboot. It is a continuation of mad max stories. This one takes place between the road warrior and beyond the thunderdome. First off this movie is beautiful, every single shot looks fantastic. It looks like a painting. The visuals in this are also so beautiful, almost the whole movie is practical effects and you can see in the action scenes that this real. Like the old ones there isn't much dialogue, just pure action. The acting is great. Tom Hardy plays a great max, of course Mel Gibson well always be the best max but Tom does a great of carrying that character. The one character who Steals every scene is Charlize Theron's character Imperator Furiosa. Every scene she's in, she's just kills it. The action is unbelievable. George miller knows how to shoot old school action and he does not disappoint. Even we there's 50 cars on the screen, you can see perfectly what's happen. This movie is worth paying the ticket for IMAX 3D. This makes George miller a mastermind and the whole movie a masterpiece. Overall mad max fury road was was a crazy fun, non-stop action movie with great character development. Defiantly a movie that needs to be seen on the biggest screen possible. If your a fan of mad max or just a fan of action movies, you need to see this.",
    "142": "At first the film starts very claustrophobic but then soon has one nice shot after the other. Yet with such a contract between dullness and unrealistic scene's make this more of a cartoonish depiction as a \"Mad max\" universe I had expected.While many reviewers complain about the \"feminism universe\", the movie just displays \"a society fueled by war and sitting on resources\" with everyone a particular role from birth with a few leaders, connected by a loyalty that isn't explained or shown. With another society of women. And a loner, Max, who is yet on another vibe but comes in contact with both and path cross with a seemingly \"feeling out of place\" person in this society. In itself, the idea is well translated and reflects on some segments of our society.Max his origin story in this movie is completely lost. While there is one moment you'd feel with Max, as he decides to return - you don't get a sense he \"goes out of his way\" or has anything else to do or to go to. He also constantly is bitching about \"his car\", yet he hasn't been seen in it enough to associate it into his persona.Mad Max used to exist when the world went into war (Gulf War) overoil. In a world where we imagine \"clean and reusable energy\", a post apocalyptic world around cars (the original Mad Max there was shortage of oil and hence the wars. In this version, there was no such thing. The resources they DO sit on isn't showing agony- the \"people shot of suffering people\" isn't convincing and doesn't resonate or isn't displayed in a way you'd sympathize or thing that this world is suffering and it is a \"dog eat dog\" world.Visually, the film is enjoyable There is an attempt to show \"the power of love\", some philosophical idea's are suggested. But it isn't followed through - and traded for the graphics while anything other as the blazing and over the top, unrealistic action-shots looks like it's filmed in the same 40 square feet... Making it rather a mockery of the classics, with a genuite vibe.Go see this film for some graphical sequences, but don't go into it with much expectations. The story is lacking- many good idea's have been put it, but never worked out or followed through and traded it for claustrophobic flashing imagery and little real content.I wished I hadn't spent the money.",
    "143": "what made mad max strong is the cinematography and the complexity of it's action mechanics. all of crushing car ware real, i even cant get it how the hell miller design all those cars crushing up and down. also the stunts were real. decent people nowadays, whose usually watching CGI style movies, will never understand how hard the stunt actions in this movie were. for examples : when a biker cross the war rig below it, between the wheel. when a bikers jumping off the ground up and down. when people climbing on the long rod on the car (i forget the name). it was all real. for *beep* sake those were all hard work in to do my mind. beside the actions, the cinematography and art-direction were no sh*t. miller was capable of shoting the packs of war cars with beauty and tense. he chose set decoration in the desert, which really match for the theme itself (runaways with strong lead females). the other thing that makes me amaze was the scene in the night (where they met old friends granma). miller using a freaking beauty of lighting and camera shot. using a pure candle style in the darkness of desert. seriously, if we compare this to saving private ryan. this movie stand a chance to compete in it's actions. but from the storyline, saving private ryan is much better, and of course more realistic to watch. mark my words, if saving private ryan is a movie which made in this generation, it will be a *beep* disaster, because people nowadays, have really bad taste of movie. only CGI that they thing cool.",
    "144": "On an objective level, both critics and fans don't seem to know what a good movie is anymore. \"Mad Max: Fury Road\" may be filled with nearly two hours of breathtaking non-stop action sequences and a couple of great special effects, settings or locations and some solid camera and light techniques in the few calmer moments. The problem is that there is literally nothing more than this in this reboot of another legendary series. There are no real intrigues going on and creativity is literally non- existent. There are almost no dialogues and the few that are there are quite weak. There are no surprising elements or twists and therefor no tension whatsoever in the whole flick. The plot is so shallow that even the increasingly bad \"Fast and Furious\" feel like intellectual masterpieces if compared to this laughable excuse of a story. One gets introduced to an epic number of characters but none of them has any real depth. The biggest problem is the uncharismatic main actor Tom Hardy and his shallow character that doesn't create any antipathy or sympathy among viewers. I rarely cared less about a leading character in any movie than here. Another problem are the numerous villains that aren't fleshed out either. It feels as if the characters of the bad guys were randomly borrowed from some of the trashiest action flicks of the seventies and eighties. Sometimes, they appear pretty much out of nowhere and die as randomly a few minutes later. The only actress who did a decent job and managed to add some depth to its character is Academy Award winner Charlize Theron. I feel sad for her to be acting in such a disastrous movie.Even two hours of non-stop action end up feeling boring and stretched if there are no truly stunning scenes or any degree of virtuosity in the high amount of exaggerated explosions and endless gunfights. Even as a homage to the original series or a worthless movie to switch your brains off and have some fun, this movie has nearly no merits. Apart of the few objective positive elements which are basically due to the impertinent budget and some obvious inspirations from the original cult movies and which barely justify my extremely generous rating, this film is extremely overrated and not recommendable for anyone.",
    "145": "Mad Max: Fury Road currently has an IMDb score of 8.2 stars, and a Rotten Tomatoes score of 97%. It was in the running last night for a Golden Globe award for Best Picture, but it didn't win. The fact that it didn't win was no surprise; the fact that it was even nominated was a huge surprise. If you read actual user reviews, including this one, you will see that a great many people thought this movie was awful. The film's only redeeming quality was the cinematography, which I will admit was gorgeous. Beyond that, there was nothing to keep my interest. I actually purchased the movie when it became available for digital download, and I couldn't get past 1 hour mark, and I tried three different times.I liked the original Mad Max movie, but it wasn't my favorite dystopian film. I like Tom Hardy, Charlize Theron, and Nocholas Hoult, but that doesn't really matter here. I like dystopian action / adventure, and chase scenes, still doesn't matter. There was just no way for me to suspend my disbelief enough to get into this story. There really wasn't much of a story, and what little there was was, was entirely too stupid and disjointed to believe, even in a movie. Maybe I could have tolerated more than one hour if there was no dialogue at all. It was just too damn nonsensical and stupid.",
    "146": "Mad Max: Fury Road is non-stop, full-throttle, all-out action for a good two hours straight. If you are into that then this film is perfect for you. If you aren't, then I'd suggest that you watch something else.This is a movie you watch for the action and only the action. It is truly amazing in that aspect. The cinematography and stunts are groundbreaking and exceptional with tons of impressive sequences. I've heard that the producers utilized very little amounts of CGI; director George Miller has claimed that 90% of the movie's special effects were practical, not computer-generated. This genuinely amazed me when I was watching the movie. In general, the film delivers visually as well. It looks absolutely stunning at times with an impressive usage of colors and visual effects that look incredible. For example, there is a dust storm in which we see some shots that look truly spectacular. Mad Max: Fury Road is not only exciting to watch, but it is also beautiful.The problem with this movie is that we get little to no breaks from the action. The plot is pretty shallow and not that unique. I've seen plenty of other movies in similar settings, but with better plots. Some pauses to engage more with the characters or to explore the world would've served the movie well.While some movies may have similar settings and better plots, very few have action of the same caliber as Mad Max: Fury Road. The action is fun to watch and the acting from Tom Hardy and Charlize Theron enhances the intensity of the action significantly. If you seek exciting action, look no further than Mad Max: Fury Road. If you seek something more than that, you'll have to keep looking.",
    "147": "I've seen the overstuffed toybox of my childhood pillaged for cinematic \"inspiration\" so many times now that the prospect rarely offends or entices me. Star Trek, Star Wars, every cruddy horror movie ever to have graced a rented VHS tape. Take it all, you greedy bastards. Melt my cherished memories down for pocket change, see if I care. After the heartbreaking artistic faceplant that was Ridley Scott's misbegotten Prometheus, I'd pretty much given up on these sorts of refried treats. O, me of little faith! If anyone can tool up a bloody-knuckle, road-raging death machine out of junked parts, it's George 'Mad Max' Miller. Fresh from the theater, I feel like an overstressed carburetor into which some baldhead lunatic just spat a mouthful of pure nitro. The pitiless desert sun is blazing nova bright above, and it's a lovely, lovely day indeed. I caught Fury Road in 3-D, which was cool...mostly because I now get to go back and see it without the unnecessary dimensional enhancement. And again gaze vacantly into that stupendous vortex of crazy-ass, nonstop, man-machine mayhem like the sweaty, crack-brained adolescent I once was (and of course always will be). I don't know that I've EVER in my screen-staring LIFE seen a vehicular action flick half so relentlessly thrilling. And certainly not this side of The Road Warrior. The bug-splattered, silver-glossed, ear-to-ear grin Miller & Co. smacked across my idiot mug in the film's opening moments is still fixed in place several hours later. Turns out mom was right: my face is stuck this way.One minor quibble: Fury Road would be improved significantly were some sensible soul simply to take a small red pen to each scripted instance of the words \"hope\" and \"redemption\". For a filmmaker whose visual storytelling has received such widespread praise, Miller sure lays on the thematic underlining with a hefty trowel. Some may accept Max and Furiosa's portentous small talk as appropriate to the tale's mythic ambitions. Me, I just found it kind of annoying, with the clunky sentimentalism tipping stoic gravitas into po-faced camp.But why fret over details? I mean, somebody who worked on this once- in-a-lifetime nightmare monsterpiece gets a screen credit for \"Wheels and Skulls\". How many other movies can you say that about?",
    "148": "Wow. As a fan of the original Mad Max trilogy, this film nearly delivered on all fronts. The tone is dark, but the film never takes itself too seriously, and has an insane sense of self-awareness. Some of the concepts are so insane, outlandish, and stylish you can't help but laugh and enjoy the ride.The visuals are utterly unforgettable, creating some of the most memorable images that I have ever seen in a film. In addition to the beautiful desert landscape, like I previously mentioned, the film takes it's ideas and multiplies them to the nth degree. Some of the smaller scenes, that have barely any significance to the story, I remember because of the smallest visual detail that is presented in them, even if that scene in the long run, really holds no significance and is never mentioned again.Tom Hardy is great in the role of Max, keeping the mysteriousness and the likability of the protagonist in full force. What's fantastic about Max too is that, his past is never revealed in a exposition like scenario, rather it is told cleverly through visuals, a display that director George Miller respects the intelligence of the audience and doesn't want to spell everything out for them. Charlize Theron however, absolutely stole the show. Her acting is excellent- perfectly conveying her character and the emotions that are being dealt with. Some scenes she was in actually had me in near tears, her performance was so good. The exposition of her, unlike Max, is conveyed through dialog, but it doesn't feel forced. We don't get some long monologue from her about her past, rather it feels like a casual mention. It expertly tells us about her while keeping just the right amount of exposition left out, allowing us to connect the dots with other pieces of dialog or other visual details that reveal more about her. Simply put, she might be one of the best leading female protagonists put to the screen in a while.The characters are always given time to develop, even the smallest of characters. The film has the perfect blend of action and character driven moments, allowing the audience to take a breather every now and then and just soak in the characters of this world. I forgot to mention, the action is amazing. Because the film has the perfect plot that pretty much lends itself to action, it never stops moving, and gains so much kinetic energy you wonder if it'll ever stop. And sometimes, that can be a negative. Too much action at once can leave the viewer restless, but thankfully this doesn't become much of an issue until the end. It helps that in the action scenes, you can actually see whats going on, and the film doesn't over utilize shaky cam.I was really surprised by how much substance the narrative and the characters had, dealing much with themes of redemption and attempting to rid of a dark past. This is an action movie that isn't only a popcorn movie, this is likely something that you can analyze and find hidden meanings in. Because of this, people who are more into the artistic side of film (like myself) will enjoy it as well.This is the best film released all year and the best summer movie since the likes of Inception. Actually, in many aspects it might be better than Inception. It very well be the best action film so far this decade, and that is no exaggeration.",
    "149": "The engines start roaring and without warning, you've fallen into this completely demented and absurd world - over the top and ridiculous - in Fury Road, Madness reigns. The shock is so great that even if you're familiar with the universe, it may take you a while to swallow everything, to get all the visual clues, to try to understand what is happening and how you can believe and embrace such a ludicrous world, but once you do, and you will, Fury Road takes you in an exhilarating ride.With a minimal plot and as little dialog as possible, Mad Max is a triumph on visual storytelling. Supported by the most epically constructed action scenes in years (or ever) and by unmatched imagination (or insanity), this two-hour car chase proves to be a lot more than a loud quest for gasoline. You'll be stunned by the action, but ultimately, left wondering what it all means - and suddenly Fury Road doesn't look that mad anymore.Ultimately, the most surprising thing about Fury Road is that Max is still there, as silent as ever, but its Furiosa, beautifully played by Charlize Theron who owns this brutal and glorious extravaganza."
}