{
    "0": "When Amy Schumer was roasting the film \"Being the Ricardos\" at the Oscars a couple of years ago, she was making fun of Aaron Sorkin for writing a screenplay about the most iconic female comedian of all time that didn't have a single funny moment. She compared it to making a biopic about Michael Jordan and only showing the bus trips between games.Bradley Cooper, pay attention. Why did you choose to make a movie about Leonard Bernstein, arguably one of the most influential musicians of the twentieth century, and then focus on all of the most mundane aspects of his life? Do we need yet another movie about a famous person bogged down with scene after scene of them squabbling with their spouse? If you don't already know why Bernstein is so legendary, you're not going to learn it here. You might not even come away from the movie knowing what Bernstein wrote, because the film tosses out titles quickly and casually as it's rushing to get to the next scene of Cooper overacting and Carey Mulligan looking strained as all long-suffering wives in all biopics ever made must do. You don't see him developing any projects or working with collaborators. The movie implies that he was disdainful of his success in musical theater despite revolutionizing it with \"West Side Story.\" But then why did he spend so much time working in it if he hated it? Why weren't we at least treated with someone doing a cameo appearance as Stephen Sondheim? Why why why?And then to top it all off, the last quarter of the film is a dreary slog as we watch Mulligan slowly die of cancer. I despise it when movies show characters slowly dying of cancer. It freaks me out, and I hate it. I know this woman actually did die of cancer, but I don't want to watch it. That's more my problem than it is the movie's, because that's what happened, but still.Cooper's screenplay is terrible, and because of that, nothing else about the movie has a chance. Mulligan is quite good, but she's hampered by the material. Cooper will be nominated for an Oscar, and might win, because the Academy loves nothing more than rewarding actors for playing famous people while heaped under prosthetic makeup. To the film's credit, for once the makeup is quite good. Usually biopic makeup makes the actors look like their faces are about to melt off, but here the effect is pretty seamless.Someone clearly told Bradley Cooper that Warren Beatty is the only person to ever score Oscar nominations for producing, directing, writing, and acting in the same film, and Cooper said \"Hold my beer.\" He's so desperately hankering for an Oscar for this film that you can smell red carpet wafting from the screen.Grade: C-",
    "1": "POSITIVES:1) The two central performances are both absolutely sensational. Both Cooper and Mulligan have some really jaw dropping scenes and they were what kept me engaged throughout\n2) The direction and cinematography are both superb. There are lots of long takes and clever camerawork and this helped to make certain scenes feel much more impactful, such as the big conducting scene near the end that goes on for several minutes with only a couple of cuts\n3) Using Bernstein's own pieces as the score for the film was very clever and I loved how over dramatic the score felt a lot of the timeNEGATIVES:1) I really didn't like the first hour or so of this film while it was in black and white. It just felt so pretentious, fake and full of itself. Also, the characters all talk insanely fast for some reason during the black and white scenes. Things did improve once things went to colour though\n2) As the title of this review states, I felt like the film was more of a technical achievement than something I actually enjoyed watching. I didn't really care about any of the characters, in fact I found Bernstein very unlikeable, and I wasn't really invested in the plot\n3) As is the case with a lot of biopics, I think this film is guilty of trying to cram an entire person's life into only 2 hours, which makes a lot of things feel very rushed.",
    "2": "It's a biopic set in New York City between 1943 and the late 1980s. Its primary focus is the relationship and marriage between Leonard Bernstein (Bradley Cooper) and Felicia Montealegre (Carey Mulligan). We learn pretty early that Bernstein's sexual appetites extend to both women and men. An early male relationship is with David Oppenheim (Matt Bomer). Felicia knows Bernstein's orientation from the beginning but asks that he be discrete. We also meet Bernstein's sister, Shirley (Sarah Silverman), and, especially, he and Felicia's oldest daughter, Jamie (Maya Hawke).The second orientation of \"Maestro\" is Bernstein's difficulty harnessing his expansive skills in composition, conducting, and popular education about music. His extroversion sometimes hinders his ability to focus. The film portrays this issue less effectively.\"Maestro\" is an intense and skillfully photographed movie. The cinematography reflects the era being portrayed. Thus, for example, the film is black and white until the 1960s. I cannot comment on the portrayals of Bernstein's conducting or the quality of his compositions, except to note that Bernstein's conducting is very intense. An enormous number of people populate the film, making it difficult to keep track from time to time. That said, Carey Mulligan gives a superb performance that deserves Academy consideration, though some parts of her life are missing, such as her political activism.Cooper's Bernstein is not deep outside the relationship with Felicia that slowly deteriorates. The film omits to mention that Bernstein also had affairs with women during the marriage. The movie portrays Felicia's final illness with breast cancer very effectively and emotionally..",
    "3": "We don't know much about Leonard Bernstein. We didn't learn why he wanted to be a composer or how he got in the business. His relationship wasn't very clear either. He's bisexual, but that doesn't go anywhere. His wife isn't explained much either other than being a stage actress. We don't know much about his children. The timelines aren't clear when the movie takes place. It seems to start in the 50s other than the opening scene of him as an old man. I do like Bradley Cooper's performance, but not much comes from the character. We don't know what made him famous since he was already famous before his memorable score in On the Waterfront.",
    "4": "\"Maestro,\" Bradley Cooper's ambitious foray into the life of the legendary Leonard Bernstein, is a film that seems to hit all the right notes visually but struggles to find a coherent melody in its narrative. As one reviewer aptly puts it, the film's primary flaw is its inability to answer the crucial question: would this story be interesting to someone unfamiliar with Bernstein's legacy?The first third of \"Maestro\" attempts to capture the genesis of Bernstein's relationship with actress Felicia Montealegre, his wife-to-be, shot in black and white. However, this period is presented without significant conflict, leaving audiences yearning for more depth in portraying Bernstein's personal and professional journey.Bradley Cooper, who not only directs but also stars in the film, convincingly looks the part in his portrayal of Bernstein, but it's Carey Mulligan who steals the show as his wife. However, their performances can only carry the film so far when the dialogue and narrative are decidedly banal and inconsequential. Despite the film's visual splendor and meticulous attention to historical detail, it falls into the trap of offering style over substance.The film superficially delves into the complexities of Bernstein's personal life, particularly his relationships, both heterosexual and homosexual. While the movie discreetly hints at the latter, it leaves the audience yearning for a deeper exploration of these facets, which might have added more layers to the character. The ambiguity surrounding his shadowy lovers becomes a missed opportunity, leaving us wondering about the emotional and intellectual aspects of those relationships.Cooper's weakness in imagination regarding Bernstein's early history becomes apparent, especially when compared to the effective storytelling seen in Netflix's historical drama \"The Crown.\" The absence of engaging anecdotes from Bernstein's early life contributes to the film's struggle to captivate the audience.The second third of the film finally introduces conflict into Bernstein's relationship with Felicia, particularly addressing his homosexuality. This segment offers a glimpse into their emotional dynamics, with Felicia expressing anger not about his sexuality but perhaps rooted in his perceived failure to reach his potential-a sentiment potentially linked to a difficult upbringing by his father.Cooper attempts to humanize Bernstein by showcasing his flaws, notably his philandering relationships with men. However, the portrayal of Felicia as a long-suffering wife becomes somewhat of a trope.Regrettably, \"Maestro\" falls short not only in its portrayal of Leonard Bernstein's personal relationships but also in capturing the broader spectrum of his impactful life. One conspicuous absence is the significant event where the Bernsteins invited the Black Panthers to a dinner party, as chronicled in Tom Wolfe's infamous essay. This pivotal moment in Bernstein's life underscored his engagement with social and political issues, providing a glimpse into the multifaceted nature of his character. The film's omission of such crucial incidents contributes to the overall sense that \"Maestro\" tends to prioritize the mundane over the monumental, leaving audiences with an incomplete picture of Bernstein's rich and complex legacy.The film falls into the trap of hagiography, failing to fully reveal the wit and charisma that made Bernstein an iconic figure. The movie struggles to make the audience truly like or understand the man beyond his musical genius.Despite Cooper's efforts to inject some turmoil into the second act, \"Maestro\" ultimately falls short of providing a nuanced and engaging portrayal of Leonard Bernstein's complex life. The commendable depiction of Bernstein caring for his dying wife in the last third of the film takes a turn toward the mundane and lacks conflict machinations, further emphasizing the film's overall struggle to infuse vitality into the narrative. The trajectory of missed opportunities and a lack of imaginative storytelling leaves the audience yearning for more depth and substance.",
    "5": "I am a huge fan of Bradley Cooper and loved the film \"A star is Born\" which was really a pivotal movie in both acting and directing plus the singing was so passionate it gave one chills and deep emotions as a masterpiece love romance.I was looking forward to watching Maestro and I absolutely loved the directing, cinematography and acting, plus Bradley has mastered sound design- and I especially loved the juxtaposition between the black and white first half of a Pseudo, sober years and semi heterosexual years for lack of better representation , and then switching over to the colorful color 2nd half phase of party mode/promiscuous Lenny mode, which did show a fantastic separation of his two different evolving levels of existence inside the marriage and family life.However, I'm not really sure why Bradley made this movie as it's very personal introspective film and as moving as the story is about a man's marriage, especially as a closet queen gay man free yet trapped inside a complex marriage - it seemed rather odd that we get little sense of what created any kind of connection to the man's passion for music; and it's definitely not a typical biopic like Rocketman or Bohemian Rhapsody or Star is Born that drove you towards the passion that makes those artists delve into their music. If anything it's quite the total opposite of \"A weird marriage is Born\" that makes you feel sad of the inner turmoil of Lenny pretending to be someone else yet truly conflicted in his true love of his wife versus his true sexuality and how to make the two flow together and that story feels very unappealing and trite in 2023.I did not really feel inspired by it, or deeply moved by it, and it felt kind of blase for the most part except the acting is superb yet the story is not inspiring enough to merit such a lengthy movie.Maybe other people might enjoy it, but I think the majority of people that want to see it is for his musical talent will be disappointed as that's not the main story. .There's a couple minor parts where he plays conductor which has some passion but it's 5% of the movie. The rest is just this very complex demented marriage that seems rather trite in today's day and age yet maybe for the people in the 1950s it would be sensational but after 1 hour I was hoping it would pivot to a new 3rd act of showing his passion for his music and how it related to his sexuality but instead it quickly stays the course and ends in the cancer phase which is moving yet feels like a sad way to end the film esp showing his hitting on young students create a rather pathetic old queen - which maybe is the whole irony of the film.Kudos to Bradley for a phenomenal job directing it and making it look superb, and the acting is fantastic but as one person said, I would've preferred to see \"more Bernstein and less of Lenny\" as I just didn't really care about him as a character / individual\nand it did not make me feel like he was that grandiose of a person to merit a movie of this level\nmaybe more time could've been spent showing what actually made him so unique or his music so passionate that people wanted his attention all the time\ninstead it was like watching a star musician but you never see what makes them a star on stage and instead you see what a messed up individual he is that had a very complex inner struggle in his marriage and family life to the point of exhausting the whole story on his turmoil or denial - but told in such a masterful manner that it's a shame that it missed its mark for me personally.Six stars and looking forward to Bradley's next film as he's definitely developing as a filmmaker\nso really looking forward to seeing\nwhat is the next story he's going to create/direct.",
    "6": "I found myself following Bradley Cooper's effort of acting more than being lost in the story that he was telling. He came off over the top theatrical. He laughs and and makes nonsensical movements at times just to fill space. His delievery of lines are too fast paced and comes off too rehearsed making his scenes about timing and not connecting naturally to other characters. Mulligan's performance was magical and real. She is so talented that the acting seems effortless, yet you know it is the extreme opposite. Maya Hawke is a joy. She is a gift and has proved to be a highly enjoyable talent in her performances. I think Cooper has a great intention and creative eye, but the effort falls flat. I almost want him to take the film and sit on it and comeback to modify his performance. I think as he grows his talent he will come to understand that people want to see the character and not see Bradley Cooper acting the character. The movie is worth the watch, but not worth the wait.",
    "7": "In a nutshell, this is a very artistic and well-made feature. There are great performances all around and the colours/cinematography/sets/music are all great. The main couple especially stands out. HOWEVER, this film seems to be uninterested in telling the story of a prolific composer/conductor's career, but instead tells the story of a couple and their hardships. It's an interesting choice that will no doubt alienate audience members expecting to learn more about Bernstein as a musician. While I can't say this subversion entirely pays off, it's a sweet story with some tear-jerky moments. Brad plays very convincingly. Personally though I'm left a little unsatisfied and would've wanted to see more of his career and professional life.",
    "8": "This serious contender in several prestigious categories for the biggest awards, is definitely one of the best of the year, and truly a masterpiece in every sense of the word.It is indeed a great testament of Bradley Cooper and his range as both a filmmaker and an actor, and all of the cast do a tremendous job, to say the least. All of them very establisehd, and delivering a vast range. The script is wonderful, a biographical wonder, and expertly, unconventionally and expertly paced.The cinematography, cutting and editing is incredible, invoking a somewhat classical and appreciated style. Incredibly beautifully put together.Overall, indeed a masterpiece in every sense of the word, maybe the best film of the year, and highly Oscar deserving. Every lover of film should give this film a watch, I love it!",
    "9": "This movie is not real. It exists only as a selfish desire to be award bait from all involved. It's not the first one and not the last one. But it feels so devoid of realness that it hurts. It is also a contradiction because the actors are very capable of bringing a kind of realness that is necessary for bringing the characters to life but the realness is so painfully manufactured and not natural...it doesn't have that cinema magic, it's all in the eyes. They were patting themselves on the back after every scene: \"My, my, this is so \"insert generic award here\" worthy.\" I'm talking here about the technical aspects as well. The black and white left me cold.It's not a bad movie in any sense. I just wanted to be fooled more and not be so paperthin and melodramatic.",
    "10": "There isn't much great music. The soundtrack seems garbled, hard to understand the words. I was wishing for a closed caption.The story is terrible. The movie is beautiful, there is one great conducting scene.I thought the movie was a real mess - it seemed like I didn't know enough about Bernstein's life as an entry into the movie, and shockingly, I didn't learn that much after. We know that at some point he was with Aaron Copeland, but not sure where or what they were doing. It wasn't a biography, I didn't learn anything.This is my choice for the worst movie I saw in 2023, but I'm sure that it will win many awards.",
    "11": "Once I got over the disappointment that this film is not about composing or even conducting, but about an extremely unlikeable man and his wife, I was more disappointed by the fact that this couple is dreadful, and they have zero chemistry together. Maybe that's the point. Their marriage seems to be an act that they play out together, because Bernstein is too much of a coward to live openly as a gay man. They don't feel like real people with real emotions. Bernstein in a letter wrote once that he was in an imaginary marriage, and it's painful to watch at times. He comes across as a selfish bore of a man. He doesn't seem like a man capable of composing music at all. His soul seems dark and his heart empty.So, I have to wonder why Cooper made this film at all other than for the hope of winning an Oscar for best actor. It's was a real struggle to get through this film.",
    "12": "It was love at first light for the smoking couple of Louis (Leonard) \"Lenny\" Bernstein and Felicia Montealegre Cohn. During their courtship, Lenny unconsciously blows smoke in Felicia's face. While smoking in bed, Lenny apologizes, saying \"Did I just ash you?\" Inconceivably, the love-struck Felicia tells Lenny, \"I love your smell.\"The filmmakers did not seem aware that they were creating extremely unflattering portraits of their maestro Lenny and his long-suffering spouse Felicia. Lenny comes across as a homosexual man inflicting emotional pain on his wife and children. Felicia wants to conceal the truth about her husband while confronting him with the prediction that he will die a \"lonely old queen.\" Some of the personal moments of this film are grotesque and unintentionally comical.Lenny's prodigious musical contributions were downplayed, as the film focused on his philandering and duplicity. The result was a pretentious and self-indulgent film experience. Even the equally elitist film \"Tár\" at least offered a convincing profile of a conductor and a musical genius. In \"Maestro,\" the music played second string to the biography. There was only a brief segment of the overture to \"West Side Story.\" Couldn't the filmmakers have at least played a few bars of \"Maria\"?The British speech patterns of the actress playing Felicia often crept into her performance. Felicia was born in Costa Rica and raised in Chile. What happened to the strict standards of correct ethnicity in Hollywood film casting?While there is enough about this film politically to disqualify it for Oscar consideration, another glaring lapse was the failure to depict the commitment of Lenny and Felicia to the civil rights movement. Lenny was vehemently opposed to the Vietnam War. Felicia was arrested and handcuffed in a civil rights protest.If the film would have focused on the humanitarian side of the Bernsteins and presented more of the glorious music, it would have rated much more than a single star.",
    "13": "Carey Mulligan and Bradley Cooper showcase some of the best acting I've ever seen in my life in this movie. Unbelievable to watch. Cooper needs an Oscar stat. The fact he also directed this, and in such a way that I've never seen before. It all felt so real, and at times like being a fly on the wall, especially in the social scenes. The recreation of Ely Cathedral is mesmerising, the amount of work that must have gone into that from Bradley Cooper is admirable. This movie is a work of art if you ask me and completely unique. Perhaps the people leaving bad reviews favour Marvel movies or action sequences? Or just don't have the capacity to appreciate subtleties or complex emotional stories. Baffled. I was extremely impressed and moved. Masterful acting, beautiful directing, unique and poignant story telling.",
    "14": "This movie was extremely disjointed, especially in the first 1/2 hour. My wife is a Big Bernstein fan and could stay awake during that part of the film. It did not get much better after that. It meanders through his life in an incoherent manner. It did not really cover his music career very much, even as it played snippets of his compositions throughout the film. The film gave the impression that all he did was cheat on his wife with different men and rarely worked.The makeup artist was decent. This was a missed opportunity. I would recommend skipping this one and waiting until someone attempts to make a better rendition of his life. Another disappointment from Netflix.",
    "15": "I happen to think that Bradley Cooper is one of our finest actors living today. All of his Best Actor nominations are well deserved. I really enjoyed his performances in American Sniper and A Star Is Born. However, Maestro, a very long, dull, and drawn out biography of Leonard Bernstein, really smells of really bad Oscar bait nothing more.The performances by Cooper and. Carey Mulligan are fine but I never thought Leonard Bernstiein was that fascinating a composer to begin with. In fact I find his musical work highly overrated as I feel there are far better composers.So of course I didn't find Maestro to be that interesting to being with. His life story from which covers from the 1940s to his death from lung cancer in the early 1990s, covers such events as Bernstein leading the New York Philharmonic to musicals such as West Side Story.While those who grew up with his music will find that fascinating, others, like me, were completely bored out of my mind, not to ,mention Benstein flat out cheating on his wife to hide his bisexuality rings of complete pretentiousness.All in all, it was a good effort by Bradley Cooper and there is nothing wrong with his direction. I just found his subject matter here to be completely uninteresting.This film is due to come out on Netflix in December. It may have a better success there than it did with my audience many of whom fell asleep while watching it.",
    "16": "I almost feel guilty writing this review because my expectation was that I would be fairly impressed by the movie. In fact it was somewhat disappointing. I can preface that by saying that I'm not a classical music fan and wasn't interested in seeing any of Leonard Bernstein's work when I was a kid growing up in the Sixties. As a consequence, the New York Philharmonic Young People's Concerts held no interest for me. At least with this film, I thought I would learn something about the man and his career, but the story had such a narrow focus that the effort didn't really resonate with me. The first hour or so in fact, seemed dreadfully boring with scenes and dialog that delivered nothing of consequence. Focusing almost exclusively on Bernstein's relationship with paramour and eventual wife, Felicia Montealegre (Carey Mulligan), the story weaves its way through their courtship and marriage even as the famed conductor carries on any number of affairs, many of them with male acquaintances and collaborators. For myself, the story only picked up with that enthralling and mesmerizing symphony at the cathedral, soaring to majestic heights that offered a hint of the virtuoso's talent. In some ways, the picture reminded me of last year's \"Tár\", seemingly made intentionally for a limited audience. This one I'd say was more accessible, but even so, held little interest through to its conclusion. On a positive note, I can say that Bradley Cooper did capture the physical look and mannerisms of the man, and I wouldn't be surprised if he received nominations in various Oscar categories. Otherwise however, the film had the same effect on me as a hit of Sominex.",
    "17": "Well, just trying to be funny. This is just another vanity project that been funded by big tobacco.If you love classical music you will be disappointed, because this movie is not about music, conducting, orchestras or about musicians. It's about a smoking, a boring and a rather bland man and his wife.This could have been a great well to get some knowledge about how conducting or a great classical orchestras work, but no, you will not get that in this movie. I'm a bit surprised because Cooper is a really good actor with great charisma, so that makes this train wreck even more surprising. But I guess, the good story just went up in smoke.that how it goes.",
    "18": "Maestro is a difficult film to critique because everyone wanted the emphasis to be somewhere else: either on Bernstein's music and conducting, or on his gay sex life.In reality, Bradley Cooper chose to tell the story of his marriage to Felicia Montealegre which was sometimes turbulent.Both Bradlet Cooper and Carrie Mulligan are perfection in their roles. Cooper looks uncannily like Bernstein and has the voice and mannerisms to match.Mulligan is reminiscent of Tovah Feldshuh, whom I first saw in the '70s. Pretty and vivacious, she later matures into a woman disappointed in her marriage, and then develops a devastating illness.What is not shown is that Bernstein leaves her for a man whom he claims understands his music. When Felicia becomes ill, he returns to care for her and never returns to his male lover, though they remain friends.Bernstein's gay relationships are only alluded to, and why is Matt Bomer only playing gay men now? I love the guy, I admire his commitment, but to me this narrows his career.I think the point Cooper wanted to make is that despite attraction to other men, he truly loved and needed his wife. She was not, as someone said, a beard with a uterus. That is shortchanging and making fun of the relationship.Fluid sexuality is often seen among creative\npeople. Bernstein was no exception. His story could have had more emphasis on music and gayness, but there's nothing wrong with a complicated love story.",
    "19": "Bradley Cooper, the ego has landed!I have never seen a film that is this desperate to win an Oscar. The entire production revolved around Cooper trying to convince us he's a genius with his fake nose trying to look more Jewish. He doesn't care how boring this film is, he thinks it's what the academy wants. Maybe he's right but this is Fosse and Vernon without the chemistry. This is a pathetic attempt and should be Coopers final attempt at directing. He needs to stick to being a clown in the circus, and give up on this male prostitute begging for affirmation shtick. I look forward to seeing the Hangover 4.",
    "20": "After the first 4 minutes, I felt this film was going to be fantastic. A hour or so in, I threw in the towel. The film dealt way too much on Lenny the human being, and not nearly enough on Bernstein, the genius. Further, there seemed to be a complete disconnect between Bernstein's private behavior and what engaged his very obviously complex soul. I'm not suggesting that the script or the director should have stripped Bernstein of his humanity, but I suspect that Bernstein's humanity was much more complex than what was portrayed (which was often banal and silly) and could've been tied more effectively to what drove his inner gifts. Given all the hype, I expected much more than the movie delivered. I am generally a fan of Bradley Cooper's work, but the script did not deliver.",
    "21": "I cannot even begin to describe how deeply this movie affected me; I have seen it three times in theaters already and am considering a fourth viewing. The elegance of the cinematography and the haunting power of Bernstein's compositions are without question, but what really took my breath away was the raw honesty and realism with which the central marriage between Lenny and Felicia is portrayed. Carey Mulligan gives one of the most immersive and empathetic performances of the century, and Bradley Cooper matches her beat-for-beat with an uneven combination of mature compassion and an almost childlike misunderstanding of her needs. This is no hagiography or even a biography really; it is a poetic exploration of what it truly means to love another human being in sickness and in health, 'til death do you part. Be prepared to cry and perhaps reexamine the relationships in your own life.",
    "22": "This mess of a movie features a brilliant performance from Carey Mulligan and some lovely directorial flashes and early b&w sequences...but that's about it. Cooper mumbles and chews scenery with a generous amount of dialects/ inflections and seems to think his audience is fully aware of the genius and personality of Bernstein prior to viewing. It all makes for a very elitist and alienating biopic that is both short on music (understand this is not the focus) but also on the primary relationship which does not seem deeply felt or realized. And, the end credit \"Music by Leonard Bernstein\" is an insult to the memory of Gustav Mahler.",
    "23": "...but I should have prepared myself given all the hype I've been seeing for the movie over the past three to four weeks. Bradley Cooper seemed to be everywhere and I'm not faulting him for wanting to promote his passion project. It was just that he built it up to be something that it really wasn't. In the end, the only story here is the character portrayed by Carrie Mulligan. And she is incredible. Cooper is incredible as well from a technical standpoint. It's a beautifully shot and beautifully executed movie, but it lacks any soul.So now the door is open for someone to do a mini-series on Leonard Bernstein using actors to portray his life, which was much bigger than any two-hour movie can contain. I hope someone isn't put off by Cooper's film in that you can't do a Leonard Bernstein movie now. You would be correct. It truly requires a miniseries to really mind the depth of this brilliant man.",
    "24": "Don't judge the film based on the nose. Judge is based on the film. Critique the makeup all you want, but not the film. This is a beautiful film - great story, marvellous acting, beautiful music and a great aesthetic production design. This all put together, makes this one of the best films of 2023, capturing the life of the late great Leonard Bernstein. An amazing gem that people will overlook, because they aren't jewish and care so much about a prosthetic nose. Bernstein's s children approved of the nose, so deal with it. It's a shame, all everyone wants to talk about is an exaggerated nose, but that's where we are. Appreciate what's in front of you. An amazing film by BRADLEY COOPER!!!",
    "25": "A horrible movie that did not deliver on what it seems to portray. To portray a historical figure is a hard task to do but to simply just imitate without caring the wholistic aspect of the spectator's experience is a bit unappealing. This really diverted from what I know Bradley Cooper as on screen. The lack of depth of the other characters really made it a fleeting movie that has no real gravitas towards any scene. Everything does not seem to be connected coherently that the audience were scrambling for what really is happening. Thank god it's only 2 hours although it's 2 hours I will never get back. Plus, I bought a horrible popcorn and the seat at the theatre is bloody horrendous.",
    "26": "I wanted to like this movie so I will start with what worked for me. Carey Mulligan and Bradley Cooper are paired well and perform elegantly. The musical score, when I closed my eyes, soared and uplifted. Makeup artist, Kazu Hiro, deserves an Oscar. He performs an incredible transformation in Bradley Cooper's Leonard Bernstein over the course of the movie. This was worth keeping my eyes open. These were the good parts. Otherwise the movie was too long, in need of elegant editing, the repartee was often indistinct, and the ubiquitous cigarettes had a life of their own that often overshadowed the actors and should have been listed among the actor credits. Didn't learn much. The story line was more of a soap opera.",
    "27": "This is essentially a movie about two very pompous people being pompous. Not particularly likeable, not particularly interesting.I'll confess, I have no idea who LB was, but neither have I learnt anything accept he was pompous and loved fags, pardon the pun.I found both characters irritating from the moment they appeared on screen.It was a strange choice of movie for Bradley Cooper to direct, but saying that, he's obviously a fan of his, hence his brilliant piano playing. (Only interesting part of the whole movie)Would have been better making a film on Leonard Cohen's and Marianne IhlenNo doubt they'll expect an Oscar nomination which it will probably get because it's boring and shot in black n white (sporadically it must be said)",
    "28": "Just attended a private screening of this beautiful film.I'm absolutely blown away by the amount of depth of the characters in this marvelous film. Every line of the dialogue, pauses, each movement has a unique feel and reflection on the current situation. Bradly's work as a writer, director, and actor is truly phenomenal. I'm still trying to understand how one person can create such a one-of-a-kind film where every department is devoted to the GREATEST level of success. After speaking with the cast, I'm touched by Bradly's openness, kindness, and objective to heal people with his art. I felt every bit of it! I'm thrilled to be one of the first ones to see this one-of-a-kind work of art. This film truly making you feel all the true emotion.BRAVO MAESTRO!!!",
    "29": "Bradley Cooper rarely misses as both a director and actor, but in Maestro he missed the mark on both. This movie was unbelievably dull, with a hard to follow and confusing plot and mediocre acting. Carey Mulligan is fine (though not her best role as compared to other gems she has been in) but there is just no chemistry between her and Cooper. He is simply not good in this role. It's just plain bad and it seems like he's just doing a lackluster impersonation of Bernstein instead of really turning himself the character. I had to fast forward at times and the whole time, I wanted to watch A Star is Born again as it's so superior in every way and reminds me why I love Cooper so much as a director and actor. Sadly this movie may make you forget how talented he is - it's that bad.",
    "30": "Excellent performances, especially from Carey Mulligan, as is expected. Other than that it's incredibly boring. That world is one I'm not the slightest bit interested in and watching the film hasn't changed my mind.I'm almost certainly wrong about this but I think a conductor does very little. The musicians in front of him or her barely look up so what is the point in waving your arms around so dramatically? I know that Bernstein wasn't merely a conductor. I bring up my conductor point because of the big deal that was made out of Bradley Cooper conducting that orchestra. But like I say, I don't know anything about that world and maybe a conductor does have some kind of impact on the musicians' actions.To summarise, boring boring boring.",
    "31": "It seems to me that there are always biopic movies released around the time that Awards Season is approaching, all made as \"Oscar Bait\", this film released near the end of the year is a good example, it liked the sound of it, and it was getting rave reviews, produced by Martin Scorsese and Steven Spielberg, directed by Bradley Cooper (A Star Is Born). Basically, it opens with the words of Leonard Bernstein: \"A work of art does not answer questions, it provokes them; and its essential meaning is in the tension between the contradictory answers.\" Leonard \"Lenny\" Bernstein (Bradley Cooper) plays a modern classical piano composition while he is at his home being filmed and interviewed, at almost seventy years old. After he finishes playing, he talks about the significant impact his wife Felicia made on him for many years. In 1943, twenty-five-year-old Bernstein is living in New York City as the assistant conductor of the New York Philharmonic. When Bruno Walter falls ill, he makes his sudden debut conducting the orchestra. Bernstein is exceptional as a substitute and receives a rapturous reception from the audience. During this time, Bernstein is having an on-and-off romantic and sexual relationship with clarinet player David Oppenheim (Matt Bomer), but he hides his homosexuality from others. One night at a party, he meets aspiring actress Felicia Montealegre (Carey Mulligan), and he develops feelings for her. They start dating, and sleeping together, and go on to marry and have three children together: Jamie (Maya Hawke), Alexander (Sam Nivola), and Nina (Alexa Swinton). Felicia joins Leonard during a rehearsal for his latest musical, On the Town. By the mid-1950s, Leonard and Felicia have a highly affluent life and make public appearances, and Leonard has composed many successful operas and Broadway musicals, including Candide and West Side Story. They begin to host lavish parties. Felicia has concerns about Leonard's homosexual tendencies, but she is insistent she is in control as his wife. However, over the next few years, Leonard continues to have casual flings with men and is addicted to alcohol and drugs, all of which take a deep toll on his marriage to Felicia. Things are worsened when Jamie hears the rumours of her father's affairs, he tries to deny what she has heard, but his daughter's suspicions are only raised more. Finally, during Thanksgiving, Leonard returns home late from a night of drinking, he and Felicia have an explosive argument where she insists is full of hate, and that if he continues, and will \"die a lonely old queen\". Nonetheless, the couple remains married, through Leonard's composition of Mass in 1971. In 1973, Bernstein conducts a legendary performance of Mahler's Resurrection Symphony at Ely Cathedral, England. During the rapturous reception, Felicia reconciles with Leonard, insistent that \"there's no hate in his heart.\" A few years later, Felicia is diagnosed with lung cancer. Despite going through surgeries and an aggressive chemotherapy regimen, her condition gets worse. Felicia dies in Leonard's arms in 1978. Overcome with grief, Leonard and the children abandon their lavish home shortly afterward. In 1987, Bernstein has moved into teaching the art of conducting, but he also continues to party, and having affairs with his much younger, male students. Returning to the present day and the interview, Bernstein admits that he misses Felicia terribly, and memories of their time together flash before him. It ends with the real Leonard Bernstein conducting a successful performance. Also starring Sarah Silverman as Shirley Bernstein, Lenny's sister, Michael Urie as Jerome Robbins, Brian Klugman as Aaron Copland, Gideon Glick as Tommy Cothran, Miriam Shor as Cynthia O'Neal, Josh Hamilton as John Gruen, Zachary Booth as Mendy Wager, and June Gable as Old Lady. Mulligan gives a tremendous performance as the wife who goes through all the emotions, and Cooper is equally splendid as the famous talented maestro of the title who had his demons, but also a joyous enthusiasm for music. Most real-life based films just go through the \"greatest hits\" material and only skim over the personal things, this one only mentions the musicals and orchestrations Bernstein is famous for and concentrates almost entirely on the relationship element. The use of black-and-white for the 1940s and colour in the later years is an interesting choice, the highlights are the rehearsal scene and the exuberant cathedral performance, the connection between Cooper and Mulligan is heartfelt, it is genuinely heart-breaking near the end when tragedy strikes, and Bernstein's music (his works are heard throughout) is wonderful, and a worthwhile biographical drama. Very good!",
    "32": "A wonderfully human and moving tribute to the beloved Lenny; how we all miss him!Although Cooper's performance is laudable, I have to say that, at least for me, despite all the make up and study he obviously invested in this role, he doesn't quite nail it. Especially in the voice, there should be more of a deep, gravelly quality with much less stuffy sinus quality. The stuffy sinus especially is overdone, and actually detracts from the genuineness of the role.Cary Mulligan is just superb as Alicia! The scenes during her final battles with cancer are definitely the best for both her and for Cooper.No one will ever replace Lenny, either in the world of music or in our hearts, but in this film we have a genuinely moving tribute to a man whose love for both people and music was truly inspiring!",
    "33": "Cooper's work here should be enough to garner Oscar nominations for acting and directing. Carey Mulligan should waltz away with Best Actress. The film is absorbing, seldom lags, but the focus is an intimate love story, not the once-in-a-generation brilliance of Bernstein's music and career. The main objection here is that Bernstein's very public affairs with men, despite his marriage to a woman, are part,of his larger-than-life story, but here they are largely straight-washed. Hinted at, not fully explored as part of his story. If you blink, you'd miss it entirely. Most curious is the fact that Matt Bomer's performance was apparently left on the cutting room floor. Despite his billing as one of three co-stars, Bomer has only about three minutes of screen time in the entire film. WHAT? Much was made of his signing for the movie and his participation was featured in the early publicity. What happened? Was Cooper afraid of tarnishing his straight man reputation?",
    "34": "I was so looking forward to this movie but it was too artsy fartsy for my liking. In another review, it said all style no substance, and I would agree with that completely. While there were some nice moments and the acting is actually really good, the storytelling is very disappointing. It feels very disjointed just jumping around. I don't mind the black and white as it actually makes sense In fact the lighting and coloring of the film were some of my favorite things about the film.Bradley Cooper does a fabulous job losing himself in his character. He has come along way from Alias. I've always enjoyed Matt Bomer on both small and big screen. Carey Mulligan impresses in her role as the loving wife.",
    "35": "I was waiting this movie, it is so notorious throught mr Cooper's career how he has been growing, the performances are very good, the direction, the production and so on\nOn my personal opinion the movie is not bad, the film is focused on his life, goals, double life, family and more\nI am enjoyed. Carrey Mulligan performance, from the begining to the end it was so great and also Bradley Cooper's performace\nI just saw it minutes ago here in Colombia, I know a lot of people said that the movie is not good enough, but I really liked it\nI will be so pending about more opinions here on IMDB and of course I will respect all of them.",
    "36": "I really wanted to like this, I love a biopic of old Hollywood and I do at times like Bradley Cooper. It is shot well, very Woody Allen and a huge old Hollywood style shoot, however it does feel more of a Im Bradley Cooper look at my impression of a great composer and everyone loves me. Maybe it's just me, I think Stanley Tucci would have been better to play the lead or David Strathairn I think he's called from Good Night And Good Luck or the governor from Shawshank.I don't care he has a false nose, actors wear make up. I just feel though it is an .Ok film but it just seems like a love letter to himself. Maybe if he didn't act and direct, like one or the other. He's not gritty enough for this role. Directing wise it is very good. He does taken on a huge amount of style from the Golden Age but acting, I'm gonna pass.",
    "37": "Beautifully shot, beautiful performances but no real story. The impersonation of the character felt more important than a connection to an audience or the characters to each other. Self indulgent and cries for the need of recognition as a filmmaker. I don't know any more about these people than before seeing the movie. Spoilers....was supposed to be a study of their love story but it didn't seem much like they loved each other at all other than his wife keeping life organized and a good public face. Was LB conflicted? Did he question his choices...either professionally or personally? This movie used the relationships he had with men only to highlight what his wife sacrificed. While that is important, and critical to the one interesting sceen of conflict between them, what did he sacrifice and gain in return? THAT would have been a far more interesting movie.",
    "38": "One of the most spot-on impressions of a famous person ever captured on film. Cooper looks, sounds and moves with such precise accuracy, one has to remind themself that they're not witnessing the actual Bernstein. He has captured the joy and the complicated sorrow that was Leonard Bernstein and he deserves every acting award there is. Especially when portraying the late-life Bernstein, Cooper is so uncannily like his subject, it's hard to find a comparable performance in recent memory that so accurately recreates a famous person as impressively as this. The makeup (in spite of all the ridiculous pre-release carping about the prosthetic nose) was also award-worthy. Bradley Cooper clearly reveres his subject and MAESTRO comes straight from the heart-and perhaps the work of something of a maestro himself.",
    "39": "My expectations were much too high, I guess. Inspite of good actors, my kudos go to Carey Mulligan here, once again showing her skills as an extraordinary actress, and Cooper's capability to transform himself into Bernstein, all the effort left me disappointed in the end. We have great cinematography, set design and last but not least great music from the master himself, but what really drags this movie down is the lack of a working story. Everything feels rushed and superficial, and the running time of more than two hours felt too short in the end. Maybe no one's really to blame for it: picking out a few dramatic or tragic events from the life of such a complex genius is simply not more than scratching the surface of his art, his difficult personality, his marriage to a devoted wife and his homosexuality.They wanted to show it all and showed not enough in the end.",
    "40": "An empty bag of mostly water. I have watched in near disbelief as Mr Bradley Cooper is starred in film after film. As an actor he is zero, I see nothing, feel nothing, learn nothing from his body of work. That he has Speilberg's endorsement is, to me, the kiss of death. Mediocrity is the A-Listers new genre. A white man actor, Cooper is so generic that his plastic nose, his acting parts, his very presence adds nothing at all. Why the movie going public is even interested in a film about Berstein is a puzzle. List your favorite music right now. Is Berstein on your list? Making films about below average composers by using a well below average actor makes sense somewhere. Cooper is an empty bag. I try to watch him, but there is nothing there to see. And as for Leonard Berstein, honestly, who cares?",
    "41": "A very disappointing experience of a movie. I feel Coopers performance was like reading from a script, dry and boring . I want my 2 hrs back that I wasted watching this so called movie. I'm Glad I streamed this and didn't waste my $s in the theater. I'm not a fan of the black and white, noir style that the film is presented, I feel at some point they should have shifted over to color. I had high hopes for this movie based on actors performing- but no, it's another stereotypical artsy fartsy movie that Hollywood and the critics and the award shows will claim as \"fabulous\". I doubt this movie will be popular among the general population.",
    "42": "Stanley Kubrick once said about actors who are obsessed with making it 'real' but he countered: is it interesting? The performances in Maestro have everything technically perfect, the accents, the beats, the spaces in between, but they don't come off as real people we know or care about which in itself interesting. We SHOULD since the actors poured their hearts out, but the audience I saw it with, clearly didn't. I'd guess the problem was also in the script. But look for nominations just the same: makeup - some of the best aging makeup to date, score, nominations for some of the leads (if enough people see it.). Bradley Cooper continues to grow as a director and his visual style is getting better with each movie.",
    "43": "Some lovely noir lighting, of course a big spend, but this doesn't do any justice to the great LB.Admittedly this would be hard to achieve for anyone; but Cooper doesn't really achieve the depth, the nuance, the voice, the facial expressiveness (OK maybe that is The Nose) or gravitas.It's an angle to explore, the homosexuality and relationship with Felicia; but to major on the personal conflicts rather than the huge musical life creates such a reductive skew of Bernstein's towering musical achievement and reach.Couldn't catch much of the rushed/thrown away dialogue either. Overall, pretty disappointed.",
    "44": "It's basically a cigarette ad in that everyone is smoking in every scene, but really badly edited in that it drags on for over 2 hours.I'm not sure if cigarette ads are like cigarette boxes these days in that they need to include a lung cancer warning, but that was about the only gripping part of the plot.I watched it because I had Leonard Bernstein confused with George Gershwin, and I can't say this has made me want to know more about Bernstein.Not sure why every biobic has to start with an old dude, then flashack to over their lives -- though going black and white to 50s colour etc does help as done here if you are going to go this cliched route.",
    "45": "Things I didn't like about this movie: the plot, the script, the (over)acting, the constant smoking, the black and white filming to indicate the past (gimmicky) -- the list goes on. In fact, I left after about an hour because I couldn't take it any more. Redeeming features? I didn't stick around long enough to find out. I agree with the reviewer who said why make a film about the last interesting pat of Bernstein's life? Cooper's A Star Is Born was entertaining (maybe it was Lady Gaga?), but this one just didn't cut it. Bradley Cooper is an interesting actor, but it will be hard to forget this film.",
    "46": "Bradley Cooper was snubbed for best director for A Star Is Born, he wont be this time,\nThe way he portrays Bernstein and goes into his life, conducting and hiding himself being gay whilst being married to Felicia, the acting was top notch,\nIt shows almost perfectly the fighting between Felicia and Leonard because of his affairs with much younger men, despite him showing his love for her very much. Bradley Cooper and Carey Mulligan both deserve Oscars for this, and its about time Cooper won anyway, the acting in this is amazing and the way the films been made, even better, it seems different to other biopics, it almost doesnt seem like one. Even though Bradley Cooper caused lots of controversy due to the fake nose. It should be overlooked and this is definetly a frontrunner at the Academy Awards this year,\nHighly Recommended.",
    "47": "I never understood why he took such big leading roles when there are actors like Jake Gyllenhaal and Andrew Garfield and Adam Driver who can do a much better job. To focus on this movie particularly, he lacks the charisma that naturally makes him Bernstein. Charm and charisma cannot be taught and cannot be imitated I guess! He's very stiff and comes off arrogant as a I'm a lead so I'm automatically great. He doesn't seem to really feel his character in the movie and others. He comes off as an actor and not the real character. He is directing the movie so might as well be the main actor too! PASS! The movie industry is in the toilet since 2020.",
    "48": "Maybe my expectations were way too high going in, but i have to say I was disappointed going out. By the 3/4 mark I was ready for it to be over. I wanted to love the motive, but struggled to like it. All the pieces were there: great acting, awesome cinematography, and of course the music, but there was no flow. To begin with the movie is no biography, but a study of a marriage. Bradley Copper did a very good job, but there was just something missing and it seemed overly long to me. If you are watching a movie and as it progresses you find yourself asking yourself if you like the movie, maybe the movie is not doing what it should. Some may love it, but I was disappointed.",
    "49": "Awkward script and embarrassing acting. Where is the story about what made Bernstein great? I should have read the reviews here before seeing the movie which would have forewarned me. Nothing notable that Bernstein did was really featured, his creative process, his tremendous influence as an educator, how he made classical music cool; even his charismatic conducting was only given one or two scenes. I really felt cheated. Why even bother to make a biopic about a notable conductor and composer and omit the whole point of the man's life?The physical impersonation was pretty good, but the acting was shallow and wooden, I thought.",
    "50": "Yes, one CAN dispute that \"...dramatically wielding a baton, flinging one's head and hair about in time to music, does add a rather welcomed, visual highlight to a concert of otherwise stultifying musicians\", if one's reasons for attending a concert are the appreciation of the music and performances, and not such unimportant ephemera as the musicians' wardrobe choices, hairstyles, bodily movements and facial expressions and tics while they play or sing or conduct, etc.There were several notable maestri -- e.g., Dimitri Mitropoulos, Charles Munch, and Bernstein himself - who were so genuinely caught up in the music that they couldn't contain their physical reactions to it. But all too many of the current crop of shallow, callow young conductors fall back on excessive podium choreography to compensate for their lack of depth as musicians.",
    "51": "I was really looking forward to this movie, but it really was painful to watch. Cooper's swallowing of words to try to imitate Bernstein was very distracting. His overacting was the worst. Such a shame to have a wonderful actress Carey Mulligan who did a fabulous job with what she had, but the script was bad and the directing of it made it even worse. He had no clue how to shoot a scene, when to play the music. Perhaps it was his over zealous bad acting that contributed to the bad directing. Such a shame. He loved to shoot the scenes from a distance which took away from the relationship that he was trying to portray. The script was a mishmash of time and music. The film was way too long. It was so painful, I was waiting for someone to die to let the film be over. Such a shame. Bernstein deserved a better biopic.",
    "52": "Oh, how glorious this movie was. My soul craves something so deep and so thoughtful as this highly accurate portrayal of the genius, Leonard, Bernstein and his wife. First of all the portrayal using costumes scenery and make up was impeccable, and I felt like I was living in the 50s and the 1960s and the 1970s. The cinematography was beautiful, so I believe this was one of the best parts.Bradley Cooper once again brings us a stellar performance. He really gets into the role. And again, Carrie Mulligan also brings one of the best performances of her lifetime. This duo so accurately portrayed, the relationship between these two people, the intricacies, the tension, the love, the guilt and the absolute devotion.I had to go back and look at a biography of Leonard Bernstein, as I never knew these facts about him. Oh, how the times were different when you couldn't come out as gay. So many times you had to have a woman as a façade. Not only was this tragic for him, but it was tragic for his wife and the children. They did such a good job with this.I wonder why they're not more movies like this. Good job everyone.",
    "53": "Possibly the worst film ever, apart from the sequence in Ely cathedral that was restaged. Acting is dreadful, camera work amateurish. Nothing at all about music or orchestras, reflecting the impoverished state of culture in America today.Every scene contains characters smoking - we even see 'Bernstein' smoking on the loo! I found the film so repulsive, I actually looked away at times. I guess the reason for wasting everyone's time on a conductor often criticised for his histrionics has something to do with homosexuality - certainly not music. Think of all the great musicians that could provide excellent subjects for films.Save your money!",
    "54": "Bradley Cooper acted, wrote, and directed this artful stylish film which is impressive! I understand the hate it's partly in black and white like Mank was a couple years ago which was slow while being very well made, I feel bad David Fischer doesn't win much he's one of the best directors. Anyway about Maestro this movie is so well acted if anything Bradley deserves a win for that alone along with Carey Mulligan shining she is riveting! Only other flaw I might agree with is the story does seem scattered although there's charming relationships, amazing scenery, musical greatness, and other wonderful aspects that deserve praise. I'm sure my review will be mixed but the movie is exceptional give it chance.",
    "55": "Formidable performances by Bradley Cooper and Carey Mulligan, but the depth of the characters cannot make up for the lack of altitude in the story itself. I believe they tried to tell a wide, expressive story; but even with a little over two hours of run time, it felt empty in many places. It either focused on too much or too little. It should have been a story about the Bernatein's love, a story about their unusual lifestyle or a story about Bernstein as a composer and conductor. There was so much material to work with and the film tried to get all of those aspects included instead of having a clear focus.",
    "56": "Where is the biography? In biographical films, we are accustomed to explaining the character's story from beginning to end, and not just the beginning of success and the love story. Where is the story and where did the hero come from? A weak biographical film that is boring at times... There is a point that I think viewers want to comment on. What does Netflix always want from the appearance of the characters? You will not show your success on Netflix. Except when it is out of the ordinary in everything... and this is why, from my point of view, Netflix has always failed in filmmaking... for the reason of not focusing on the story in the first place, and this is what is clear in this film... the film industry has become a matter of fulfilling the conditions. It is necessary for an academy nomination, not for an artistic work.",
    "57": "The first half of Maestro is a near unintelligible whirlwind of scenes and characters, covering probably 15 years in an hour. It is discombobulating and lacks a strong narrative thread. However the much slower second half of the movie is where Bradley Cooper and especially Carey Mulligan stand out in unveiling the disfunction underlying the \"Maestro's\" marriage.Carey Mulligan specifically thrived in the slower paced second half and her depiction of Felicia's pain and conflict over a husband that could never truly be faithful elevated the film to a new height during its middle section.Overall however, the movie moved a bit too quickly and lacked the connecting thread it needed to fully realize the vision it was trying to execute.",
    "58": "It's basically a cigarette ad in that everyone is smoking in every scene, but really badly edited in that it drags on for over 2 hours.I'm not sure if cigarette ads are like cigarette boxes these days in that they need to include a lung cancer warning, but that was about the only gripping part of the plot.I watched it because I had Leonard Bernstein confused with George Gershwin, and I can't say this has made me want to know more about Bernstein.Not sure why every biobic has to start with an old dude, then flashack to over their lives -- though going black and white to 50s colour etc does help as done here if you are going to go this cliched route.",
    "59": "Things I didn't like about this movie: the plot, the script, the (over)acting, the constant smoking, the black and white filming to indicate the past (gimmicky) -- the list goes on. In fact, I left after about an hour because I couldn't take it any more. Redeeming features? I didn't stick around long enough to find out. I agree with the reviewer who said why make a film about the last interesting pat of Bernstein's life? Cooper's A Star Is Born was entertaining (maybe it was Lady Gaga?), but this one just didn't cut it. Bradley Cooper is an interesting actor, but it will be hard to forget this film.",
    "60": "Bradley Cooper was snubbed for best director for A Star Is Born, he wont be this time,\nThe way he portrays Bernstein and goes into his life, conducting and hiding himself being gay whilst being married to Felicia, the acting was top notch,\nIt shows almost perfectly the fighting between Felicia and Leonard because of his affairs with much younger men, despite him showing his love for her very much. Bradley Cooper and Carey Mulligan both deserve Oscars for this, and its about time Cooper won anyway, the acting in this is amazing and the way the films been made, even better, it seems different to other biopics, it almost doesnt seem like one. Even though Bradley Cooper caused lots of controversy due to the fake nose. It should be overlooked and this is definetly a frontrunner at the Academy Awards this year,\nHighly Recommended.",
    "61": "I never understood why he took such big leading roles when there are actors like Jake Gyllenhaal and Andrew Garfield and Adam Driver who can do a much better job. To focus on this movie particularly, he lacks the charisma that naturally makes him Bernstein. Charm and charisma cannot be taught and cannot be imitated I guess! He's very stiff and comes off arrogant as a I'm a lead so I'm automatically great. He doesn't seem to really feel his character in the movie and others. He comes off as an actor and not the real character. He is directing the movie so might as well be the main actor too! PASS! The movie industry is in the toilet since 2020.",
    "62": "Maybe my expectations were way too high going in, but i have to say I was disappointed going out. By the 3/4 mark I was ready for it to be over. I wanted to love the motive, but struggled to like it. All the pieces were there: great acting, awesome cinematography, and of course the music, but there was no flow. To begin with the movie is no biography, but a study of a marriage. Bradley Copper did a very good job, but there was just something missing and it seemed overly long to me. If you are watching a movie and as it progresses you find yourself asking yourself if you like the movie, maybe the movie is not doing what it should. Some may love it, but I was disappointed.",
    "63": "Awkward script and embarrassing acting. Where is the story about what made Bernstein great? I should have read the reviews here before seeing the movie which would have forewarned me. Nothing notable that Bernstein did was really featured, his creative process, his tremendous influence as an educator, how he made classical music cool; even his charismatic conducting was only given one or two scenes. I really felt cheated. Why even bother to make a biopic about a notable conductor and composer and omit the whole point of the man's life?The physical impersonation was pretty good, but the acting was shallow and wooden, I thought.",
    "64": "Yes, one CAN dispute that \"...dramatically wielding a baton, flinging one's head and hair about in time to music, does add a rather welcomed, visual highlight to a concert of otherwise stultifying musicians\", if one's reasons for attending a concert are the appreciation of the music and performances, and not such unimportant ephemera as the musicians' wardrobe choices, hairstyles, bodily movements and facial expressions and tics while they play or sing or conduct, etc.There were several notable maestri -- e.g., Dimitri Mitropoulos, Charles Munch, and Bernstein himself - who were so genuinely caught up in the music that they couldn't contain their physical reactions to it. But all too many of the current crop of shallow, callow young conductors fall back on excessive podium choreography to compensate for their lack of depth as musicians.",
    "65": "I was really looking forward to this movie, but it really was painful to watch. Cooper's swallowing of words to try to imitate Bernstein was very distracting. His overacting was the worst. Such a shame to have a wonderful actress Carey Mulligan who did a fabulous job with what she had, but the script was bad and the directing of it made it even worse. He had no clue how to shoot a scene, when to play the music. Perhaps it was his over zealous bad acting that contributed to the bad directing. Such a shame. He loved to shoot the scenes from a distance which took away from the relationship that he was trying to portray. The script was a mishmash of time and music. The film was way too long. It was so painful, I was waiting for someone to die to let the film be over. Such a shame. Bernstein deserved a better biopic.",
    "66": "Oh, how glorious this movie was. My soul craves something so deep and so thoughtful as this highly accurate portrayal of the genius, Leonard, Bernstein and his wife. First of all the portrayal using costumes scenery and make up was impeccable, and I felt like I was living in the 50s and the 1960s and the 1970s. The cinematography was beautiful, so I believe this was one of the best parts.Bradley Cooper once again brings us a stellar performance. He really gets into the role. And again, Carrie Mulligan also brings one of the best performances of her lifetime. This duo so accurately portrayed, the relationship between these two people, the intricacies, the tension, the love, the guilt and the absolute devotion.I had to go back and look at a biography of Leonard Bernstein, as I never knew these facts about him. Oh, how the times were different when you couldn't come out as gay. So many times you had to have a woman as a façade. Not only was this tragic for him, but it was tragic for his wife and the children. They did such a good job with this.I wonder why they're not more movies like this. Good job everyone.",
    "67": "Possibly the worst film ever, apart from the sequence in Ely cathedral that was restaged. Acting is dreadful, camera work amateurish. Nothing at all about music or orchestras, reflecting the impoverished state of culture in America today.Every scene contains characters smoking - we even see 'Bernstein' smoking on the loo! I found the film so repulsive, I actually looked away at times. I guess the reason for wasting everyone's time on a conductor often criticised for his histrionics has something to do with homosexuality - certainly not music. Think of all the great musicians that could provide excellent subjects for films.Save your money!",
    "68": "Bradley Cooper acted, wrote, and directed this artful stylish film which is impressive! I understand the hate it's partly in black and white like Mank was a couple years ago which was slow while being very well made, I feel bad David Fischer doesn't win much he's one of the best directors. Anyway about Maestro this movie is so well acted if anything Bradley deserves a win for that alone along with Carey Mulligan shining she is riveting! Only other flaw I might agree with is the story does seem scattered although there's charming relationships, amazing scenery, musical greatness, and other wonderful aspects that deserve praise. I'm sure my review will be mixed but the movie is exceptional give it chance.",
    "69": "Formidable performances by Bradley Cooper and Carey Mulligan, but the depth of the characters cannot make up for the lack of altitude in the story itself. I believe they tried to tell a wide, expressive story; but even with a little over two hours of run time, it felt empty in many places. It either focused on too much or too little. It should have been a story about the Bernatein's love, a story about their unusual lifestyle or a story about Bernstein as a composer and conductor. There was so much material to work with and the film tried to get all of those aspects included instead of having a clear focus.",
    "70": "Where is the biography? In biographical films, we are accustomed to explaining the character's story from beginning to end, and not just the beginning of success and the love story. Where is the story and where did the hero come from? A weak biographical film that is boring at times... There is a point that I think viewers want to comment on. What does Netflix always want from the appearance of the characters? You will not show your success on Netflix. Except when it is out of the ordinary in everything... and this is why, from my point of view, Netflix has always failed in filmmaking... for the reason of not focusing on the story in the first place, and this is what is clear in this film... the film industry has become a matter of fulfilling the conditions. It is necessary for an academy nomination, not for an artistic work.",
    "71": "The first half of Maestro is a near unintelligible whirlwind of scenes and characters, covering probably 15 years in an hour. It is discombobulating and lacks a strong narrative thread. However the much slower second half of the movie is where Bradley Cooper and especially Carey Mulligan stand out in unveiling the disfunction underlying the \"Maestro's\" marriage.Carey Mulligan specifically thrived in the slower paced second half and her depiction of Felicia's pain and conflict over a husband that could never truly be faithful elevated the film to a new height during its middle section.Overall however, the movie moved a bit too quickly and lacked the connecting thread it needed to fully realize the vision it was trying to execute.",
    "72": "I went to Maestro expecting a film that would chronicle the life of one of America's, if not the world's, great composer/conductors. I've seen Leonard Bernstein many, many times, starting at age 8 when my grandfather took me to Bernstein's music for kids on Saturday mornings at Lincoln Center. I had no idea who he was at the time, only that people called him Lenny. My grandpa took me to meet him and he was spellbinding. I remember him looking right threw me with his expressive eyes.He loved kids and loved to teach them about music. Turns out grandpa and Lenny went to Harvard together, hence I got a personal introduction. Bernstein is the guy that got me hooked on classical music and music in general, but I didn't learn anything about his musical career, his childhood, his years at Harvard, his work in Europe, who inspired him, etc.The making of West Side Story is really interesting (if you know the story) but nothing about it in this film and I mean \"nothing.; We get a tiny glimpse of Candide, but nothing about its composition or insight into the Maestro's process. We get zero insight into his Missa Brevis, perhaps on the highlights of his career.Bradley Cooper blew me away. I've seen Lenny up close many times and I've talked to him a few times. Cooper nailed it, and the scene at St John of the Divine is probably one of the greatest musical scenes ever captured on film. Cooper's conducting is simply amazing. He worked very very hard to capture the speech, mannerisms, and the Bernstein attitude and texture toward music. I cannot speak highly enough of Cooper's performance, but we get so little insight into the musician, and that was so disappointing.Carey Mulligan? Her performance is nothing less than spectacular, in fact all the acting is extraordinary, but it's not a story. The Bernstein children really have nothing to do in this film, and I have no idea why Lenny's sister was included as she has very little to say or do. Overall, a very perplexing film ... not sure what he was going for. In fact, I kept waiting for it to start. The emphasis was all on style, and believe me, it's beautiful to look at.",
    "73": "Beware, this is a movie about Bernstein's marriage, NOT about his music. It should have better been titled as \"The Marriage of Leonard & Felicia\" and not \"Maestro\".I expected a music biopic, but what I got was a masterfully directed and terrifically acted portrait of a marriage with a bisexual husband and all the difficulties (secret affairs with gay men) that came along with it, when back in the days of the fifties and sixties, being gay wasnt something one could openly talk about in public.The good: LONG scenes with NO editing cuts. What BLISS to be able to watch these 2 great actors perform uninhibited by cuts, with many minutes long lasting scenes filmed from 1 static angle. I truly applaud the director (Bradley Cooper) and the photographer and editor for this gorgeous and balanced way of filming this portrait. I was really impressed!Any bad? I had my trepidations about Bradley Cooper's impersonation of Bernstein that was borderline according to many. Did he pull it off? I think he did a really good job, although it took me some time to get used to all the mannerisims (the peculiar voice in particular). I can understand though that others might get a bit uneasy / irritated by some of the makeup (too much?) and other mannerisims.Carey Mulligan (as the wife of Bernstein) deserves special mention. Her role was more subdued and subtle, but AS powerful and touching. She truly shined!Conclusion: I am not a fan of watching stories about artist's private lives, but as far as this personal account of Leonard Bernstein's marriage is concerned, they created a really mesmirising, warmhearted portrait, that left me behind in my seat with goosebumps and in reverence...Thank you for reading my 2100 th review on Imdb!",
    "74": "As both director and actor, Bradley Cooper isn't afraid to go showy and flamboyant, and for the most part, his approach works within the contours of legendary conductor and composer Leonard Bernstein's larger-than-life personality and unfettered hedonism. With a prosthetic nose that is surprisingly unobtrusive, he captures Bernstein's theatrics as conductor without being excessive, though the lion's share of this 2023 movie is focused on the unconventional, time-spanning love story between Bernstein and actress Felicia Montealegre played with clipped authority and enveloping vulnerability by Carey Mulligan. Cooper gallantly gives her top billing, but this is far more his star vehicle even as their story takes an uninvited turn. Of course, Bernstein's closeted proclivities provide unavoidable complications throughout. Cooper the filmmaker effectively uses overhead crane shots and mise-en-scene transitions like the welcome \"Fancy Free\" dance sequence. In fact, I wish more of Bernstein's masterworks and his creative process were prominently showcased like, for example, \"West Side Story\" and \"On the Waterfront\" beyond their use as incidental background music. Regardless, the film is worth seeing for Cooper's bravura turn and Mulligan's quietly complementary work.",
    "75": "Think of a biopic of a famous person as like a complex cake - you can carefully dissect one slice of it to examine the contents, or you can bravely try to examine the whole lot to see what it's made of.This biopic of American composer and conductor Leonard Bernstein is like looking at only the surface of the cake through a slice of Swiss cheese - a lot of loosely connected vignettes with no depth. If you don't know much about the man, you would leave the theatre with no great insights about him.The film jumps around in time and gives you snippets of the man's life and work. There are scenes about his bisexuality and penchant for men, his role as a conductor and composer, his drug addictions and his relationship with his daughter, but none of these are examined in any depth at all. His bipolar relationship with his wife and her later death from cancer are given the most screen time, but still feels unfulfilled and lacking in substance.Bradley Cooper directs in a rather disjointed style. The first half is shot in black and white, then we change to colour for no good reason except maybe historical chronology - it doesn't work. Neither does the curiously tight aspect ratio, which again inexplicably opens up to full screen near the end. Some scenes are beautifully shot but too often Cooper relies on the slow zoom in and the very long takes, which don't always seem to match the scene. The film also could have ended perfectly with the penultimate scene, but inexplicably ruins the moment with one extra shot that completely fails to land.Carey Mulligan is excellent as Bernstein's wife but Cooper as Bernstein doesn't quite work for me. He tends to overact, gives you little insight into the man himself, and the nasal voice starts to grate after a while - maybe it was inevitable with the prosthetic nose he was required to wear.Even the grand concert scene in the cathedral, conducting his beloved Mahler, didn't quite generate the depth of feeling it could have - contrast this with the Tchaikovsky concert scene in the French-Russian film Le Concert, which takes emotion (actors and viewers) to a much higher level.All in all this is not a bad movie, and to be fair it does engage the viewer a little more in the second half. But it tackles too many themes with a disturbing superficiality, giving very little substance to almost any. It could have been a lot better. No doubt however it will get lots of Oscar nominations, but then the Academy lost the plot years ago and succumbs to hype more than merit.",
    "76": "Bradley does a convincing facial transformation with make up and nose piece to look enough like Bernstein. Unfortunately every other aspect of the movie is lacking. First of all didn't like the direction. Strange camera angles. Unnecessary black and white cinematography. Also the mumbling dialogue and affected way the leads spoke. I know they were artists but no one talks like that. The main problem was the screenplay turned out like most biopics focussed on the wrong things. It does show him conducting but does not show him creating and glosses over his most famous work West Side Story. Instead the focus is on his marriage. Carey Mulligan is good at looking sad as usual. Sure she wasn't happy in the end he was having affairs with men but is this movie supposed to be about Leonard Bernstein's marriage? Not interesting aspect of his life. In this way it was even worse than the Cole Porter biopic with Kevin Kline. Too much about the relationship problems. In a biopic it's better to do it the old fashioned Hollywood way like in the 50s and 60s. Don't concentrate on the love life and focus on the man and his achievements and his legacy. But that's the problem with modern biopics. Too bad this could not have been an exception. Bradley should just have acted and not tried to direct and write the screenplay.",
    "77": "Obviously made for the Academy to truly honor Bradley Cooper remarkable transformation into the hoity toity world of Leonard Bernstein. Yes, we know he is going to be great in this role. But sometimes when you surround yourself with Oscar level material and talent, it could seem like it's just fishing for the Little Gold dude.This is what it felt like. Though, simultaneously...he's just good.Actor turned directors don't always work. Especially virtuosos that started clownish and end up in the serious zone. Cooper is that guy. Following in the footsteps of Clint Eastwood rather than, say Charles Laughton. It felt like a natural transition for Cooper who seemed to fine tune his energies towards more serious endeavors outside of things like \"The Hangover\" flicks.\"Silver Linings Playbook\" was the start.And who are his mentors in directing if it weren't the top tier directors.... David O' Russell, Paul Thomas Anderson, Spielberg, Scorsese or Clint Eastwood himself.What this film struggles with, is the interest level. A lot will go over modern audiences head. Simply because we only know him as the guy who did the music to \"West Side Story\" And even THAT is stretching it. Cooper doesn't focus his energy on that rather this \"love\" story of a woman who fell for a gay guy. This would've been interesting 30 years ago. Now, not as intriguing.Carey Mulligan is the best thing in this movie. At times, she is very much a Katherine Hepburn North Atlantic phony. But when some of the veil of her pain rises to the surface, she drops the pleasantries and tells it like it is.There is a moment during a Thanksgiving party where we see some of the best acting I've seen between two people. Dialogue is somewhat on the nose, but boy do they both play it to the hilt. It's phenomenal, the ability to get to a screaming match with the words actually meaning something. That is an accomplishment.Things get slow when the self-indulgent conducting moment creeps in. Yes, we know Brad studied a long time to get Bernstein's mannerisms. Do we really have to see all of it?Other things that bothered me... it still feels like a very cold movie. Aside from Mulligan, his entire family seems to have been plugged in as trope characters to get you more understanding of the guy. They don't add much. Perhaps that was attempting to be subtle. It felt like subterfuge.This was Oscar bait in absolute.",
    "78": "A struggling musician agonized by his own genius, talents, and creativity and trapped in loveless marriage filled with guilt. Both look the other way while one has an affair and realize the importance of one's own partner too late. Right now, at the top of my head I can think of 'Fosse/Verdon', 'A Star Is Born', 'George & Tammy', 'Walk the Line', 'Dreamgirls', 'Daisy Jones & The Six', and etc. (Wow, that's a lot.) Biographical genre is especially tricky because it has to excel the life of actual historical figures. 'Maestro' could have been so much better if it delved into the introspective and artistic side of Bernstein deeper or provided a different and fresh point of view on his life rather than reciting his personal life. His autobiography or research would be more fun and interesting than this explanatory movie.There were a few futile attempts to make the movie look more artistic, abstract, and ambiguous. They failed because they serve no purpose but to look pretentious. White and black, camera movement, the use of light and shadows, and musical aspects. They are all good attempts, but for what? By doing so, is the story getting stronger? Do they enhance what viewers feel? Waste of time and films.Bradley Cooper's performance is disappointing. He never acts; he imitates. When he's on the screen, we know clearly that he's acting. It's hard to be absorbed and immersed into the screen because he always pushes the audience away with his trying too hard. I get that he wants to emulate Bernstein's twangy voice. However, emotions and messages he delivers are more important than his likeness of Bernstein's tone, accent, sound, or mannerism. He focuses on what's outside of Bernstein rather than what would be inside of him. There is a 10 minute sequence of Cooper conducting, and it's screaming 'Look how good I am!!!'. It's one of the highest points for emotions to burst out for the audience, and I started to laugh.",
    "79": "I had hoped to enjoy 'Maestro'. It is a film for adult audiences, featuring actors I appreciate (Bradley Cooper and Carey Mulligan) and directed by that same Bradley Cooper. It deals with a true American Icon (composer / conductor Leonard Bernstein) and deals with the 'man' inside that icon. In this time of Holiday Blockbusters it promised to appeal to an audience like me. And, in fact, it did. The theatre was two-thirds full; a first-time-since-the-Pandemic at this small art house.The film, however, is something of a mess. It is confused about the type of picture it wants to be. In its first thirty minutes it takes on a flight-of-fancy aura; it is as though Bernstein and his soon to be wife are in a musical-comedy with the background stage settings changing as if by magic. The film's first half is in black and white; I imagine a testament to The Forties and early Fifties (the time period covered by those scenes) but, in fact, lots of color-films were made at that time.Leonard Bernstein was bisexual. And that bisexuality is, in fact, revealed, but revealed in a coy, teasing, easy-to-misunderstand way. And then there is the background music, all of which was composed by Bernstein, but not all of which fits the scene it backgrounds. The selection from his 'West Side Story' is the most emblematic of this. But not the only example.For me, the story belongs to Bernstein's wife Felicia (played by Mulligan). She is the wife of a bisexual man; a fact that is problematic enough. But he is a man who is always center-stage, and for whom she gave up a promising career to raise their children, support her husband, and who suffers in silence until she can suffer silently no longer. But even here (and though Mulligan has long been a favorite of mine), there is a smile on her character that (a) rings insincere and (b) is repeated so often that I wanted to scream, No more. But, sadly, there is more; the most cinematic, most hard-to-believe smile coming, in a hard-to believe scene, in London's Westminster Cathedral.Finally there is the finale. I will give nothing away when I say that the film ends one scene too late, it is one scene too long. A scene in which Bernstein instructs a young orchestra conductor would be as appropriate an ending as one could hope for.But then .....",
    "80": "It's an old (and unanswerable) question: to what extent is it possible - or desirable - to separate the art from the artist? Is it possible to appreciate the art simply as art, and not to delve into the (sometimes tawdry) details of the artist? Or are the art and the artist so inextricably entwined that you cannot understand the one without knowing the other?I very much lean towards separation. I fell in love with Bernstein's music the first time I saw West Side Story mumble years ago at an impressionable age; which is why I was disappointed that there was so little West Side Story in this film. Surely a biopic of a composer should feature that composer's music pretty heavily?Of course, we all know that beneath every great artist is a human being - usually with a collection of human flaws. But does this matter? Well, it matters here. What we mostly get is a film about Leonard the man, and his complicated marriage to Felicia Montealegre. Much of this was new to me. I knew that Bernstein was bisexual, but didn't care. I find that I also don't care about most of the other details of his life which were revealed to me - although if the film was truly about the man, not his music, his record as a human rights activist should probably have been at least touched on. But never mind that: I came for the music, and didn't get enough.Not that this film is without merit. Bradley Cooper's performance is first class - there's one sequence in which he truly shows us the passion of a great conductor - and Carey Mulligan is as riveting as ever. Cinematography and sound are both excellent.Overall, this is a good film, but ultimately a disappointing one.",
    "81": "The rule for any biographical movie is \"Would this be interesting if you didn't know who this person was?\" And that pretty much is the \"Problem\" with this movie. Bernstein fans will dote on every word; those who have no idea who Leonard Bernstein was will be bored stiff. For those who don't know (and there are many, so don't scoff), Bernstein is considered the first great American conductor of classical music. But that was only one of his talents. He was also a gifted composer who wrote both \"serious\" music (like symphonies, concertos, etc.) and the scores of such diverse Broadway musicals as ON THE TOWN, WEST SIDE STORY, and CANDIDE. All the film's musical scoring is taken from his compositions, which is a bit jarring when used out-of-context. The film concentrates on Bernstein's relationship with his wife who was a Jewish stage actress from South America. They did have a lot in common in that they had similar cultural backgrounds and were both artists. But it's hard for a heterosexual woman to have a relationship with a man who not only is basically narcissistic, but also has an eye for the fellas. And that's \"sort of\" what the movie is about. His gay relationships are very discreet and mostly only hinted at in the movie. You get the idea without going into much detail. Were these just sexual relationships? Or were there emotional and intellectual aspects, too? The movie never tells us who these shadowy lovers are or what they saw in each other. There surely were more interesting things about Leonard Bernstein than his being bisexual. I hope so, because although I am in awe of Bernstein's achievements, I didn't think the movie was very interesting, despite being beautifully acted by the two leads, Bradley Cooper (who also directed) and Carey Mulligan as his wife. The movie is at its best (for me, at least) when the style has elements of fantasy, like when the characters dance and seem like participants in one of Bernstein's stage productions, but too much of it is rather like a plodding TV show. That's the second biggest \"problem\" with the movie. There isn't really a consistent point-of-view. Some of the movie is in black-and-white and then turns to color, but for no particular purpose. It's not like opening the screen door and stepping into Oz; it just means that time has passed. The whole story is shot in the screen ratio of pre-Cinemascope. Although it changes from black-and-white to color, the screen never widens. I came out of the movie not knowing any more about Bernstein than I did when I went in. If you're a fan, that won't matter. But if you're not, well...",
    "82": "Once upon a time there was a nice Jewish boy named Leonard Bernstein who lived in the artists apartments in Carnegie Hall. One day a conductor couldn't show up at Carnegie Hall, so Leonard took his place, and everyone called him a genius. He married beautiful Carey Mulligan and had beautiful children and made important music and TV shows and money. And because he was bisexual, he cheated on his wife with anyone he wanted. Once his wife got angry with him and left, but she came back. Then his wife got cancer and died, and Leonard was sad, but now he could sleep with anyone. And if he hasn't died, he's still doing that today.Well, he did die in 1990 at the age of 72, and Bradley Cooper wore a big fake nose to play him in this movie. That got a lot of people very angry, but I thought it made him look like Bernstein. Mostly, though, I wonder why Bernstein for this diagetic musical? Why not someone who did more interesting music, like Aaron Copeland? As I am so often, these days, I am confronted with the question of who this movie was made for.Not that it's not a fine piece of film making, with great performances, but it's not really much of a story, is it? As for Bernstein's music, he was a middling talent as a composer, and never appreciated the good work he did there; as a conductor, he was mainly notable for being one of the first Americans to be the conductor of a major orchestra or three. His most important role was probably that of educator, not only for his Young People's Concerts, training other conductors, and keeping the upper edge of cultural consensus going in this country for longer than it might have otherwise. Is that enough to justify a motion picture, even one that Spielberg and Scorsese expressed interest in directing?",
    "83": "Carey Mulligan is the only reason to see this movie. Her performance is outstanding\nAll the awards!Bradley Cooper wildly overacts as Leonard Bernstein. Matt Bomer is wasted in a tiny throw-away role.I cannot say much good for the movie itself. It starts out in black & white, then turns to color. Why? The first two thirds of the movie were so dull; I nearly dozed off. There is endless philosophizing, and people talking over each other. It added nothing to the story. Then there are long shots that look like they are a mile away of people talking. It makes the actors look Lilliputian.Bradley Cooper'ss direction of the movie is choppy in many scenes, but lovely in others, such as his direction of Carey Mulligan. The camera loves her as she goes from young woman to middle aged woman to dying from cancer.The final third was the best in terms of the story flow.However, I cannot recommend the movie unless you are a diehard Bernstein fan.",
    "84": "Having just had the pleasure of seeing this film on the IMAX screen in London I can confirm that an intimate drama in standard aspect ratio heavy with closeups of people simply talking can prove perfectly acceptable in this format.The resemblance to Leonard Bernstein of the makeup applied to Bradley Cooper is extraordinary, but the convincing way he ages is more extraordinary still; while the vigour of Cooper's performance is matched by the energy of his direction - which includes fanciful use of black & white and colour which enhances the mood of the film by capturing the look of magazine photography of the period - and the gusto with which Bernstein throws himself in equal measure into both his sex life and his art (both he and wife Carey Mulligan consume cigarettes at a rate of knots throughout the film - even when the poor woman is being (SLIGHT SPOILER COMING:) treated for cancer; right up to the final closeup of Bernstein drawing on yet another cigarette.Lovers of Bernstein's music may demur at how little of his work actually makes it into the film - although his performances of Mahler, Shostakovich and so on are briefly heard on the soundtrack - for the emphasis is principally on his domestic affairs and for Bernstein the theatrical pleasure of conducting plainly far surpassed the lonely drudgery of composition.",
    "85": "There aren't many films out there that feature the classical music world or figures as their subject matter. Tar of course comes to mind, which imo was a masterpiece, though it was initially a bit slow to engage this viewer. Amadeus is another one. Anyway, I came into this one hoping it would be a welcome addition to a very short list.What I was not expecting was this collosal, stupyfingly disappointing shell of a movie. Rather than try to tell coherent story or reveal some information about a somewhat overlooked but important figure, the creator behind this dismal effort--and that would be Bradley Cooper himself--decided to give us a turgid arrangement of seemingly random, uninteresting scenes that ultimately had nothing of interest to say about the character portrayed. Sure, it had the veneer of being technically polished, with lots of aging makeup in play and actors--Bradly especially--amping up their performances to Oscar-worthy levels. But there was no story, and even worse, no sense of engagement with the primary characters. It's like the camera set ups were deliberately planned to make the actors seem as remote and off kilter as possible. The events were random, the dialogue empty, banal and uninformative, the accompanying music frequently distracting. Overall, it was just such a \"look at me, act, direct and write\" vanity piece for Bradley Cooper that said far more about him, and his outsized ego, than it did about the long deceased and sadly overlooked subject that the film purports to be about.To sum up, Maestro is a textbook example of style over substance, vanity over generosity, pretentiousness over authenticity, cinematic form over narrative function.Avoid this film, and watch (or rewatch) Tar instead--or even that old chestnut, \"Amadeus\". (which as much as I didn't like it at the time , is a restrained masterpiece compared to this folly of a film.)",
    "86": "It's worth noting that at this past weekend's screening of \"Maestro\" for members of the Motion Picture Academy, the filmmakers received a standing ovation when they came onstage for the Q&A afterward. This from a crowd of around 800 folks who actually know what it takes to make a film, are willing to make the trek across town, and are not an easy group to impress to that degree. A standing ovation from that crowd is a rare event.As others have noted, this is primarily a study of the relationship between two artists, one a well-regarded Broadway actress (played brilliantly by Carey Mulligan) and the other a once-in-a-generation musical genius. While others bemoan this approach to what some characterize as a biopic (it isn't really), I feel it was a smart way to let the audience in on Bernstein the man. Bernstein the musician is pretty easy to learn about - just check Wikipedia, YouTube and the gazillion recordings available.Many major filmmakers, including Martin Scorsese & Steven Spielberg, have tried tackling a \"biopic\" of Bernstein, and struggled on the best approach; Spielberg essentially handed the project to the fresh-off from \"A Star is Born\" Bradley Cooper when Steven learned of Cooper's passion from childhood for conducting and his fascination with Bernstein. It didn't hurt that Cooper, even without the brilliant prosthetics (approved by the Bernstein children), looks remarkably like Bernstein, and was able to get his voice, accent and speech patterns down so perfectly that if I closed my eyes at that screening I would have sworn I was hearing the Lenny Bernstein I grew up watching on TV. Cooper, growing by leaps and bounds as a filmmaker with this one, serves his actors brilliantly, and leaves the viewer with a palpable sense of what maestro Bernstein was like as a human, flaws and all.",
    "87": "I am a big fan of Bradley Cooper. I think he's an amazing actor and he knocked it out of the park directing A Star is Born. That was one of the best movies of 2018. However I could tell from the trailer that I probably wasn't going to like this movie. It looked like nothing more than pretentious Oscar bait, and that's exactly what it is. There's not much of a story here at all, and it rarely focuses on the part of Bernstein's life where he was a composer. It's mostly about the drama with his wife and it's just so boring and the script is extremely lacking. As I said earlier I think Bradley Cooper is a phenomenal actor and I also think Carey Mulligan is a very talented actress but they're both just so over the top in this movie. Both of them have been nominated for Oscars multiple times and they are clearly desperate to try and win one here. To be fair I could see Cooper winning best actor but I would still bet on Cillian Murphy. You can tell the focus of this movie was made to try and win awards, not because anybody behind the scenes actually cares about the story. To Cooper's credit he did do a good job directing here and used some very unique techniques but the movie still felt like it dragged on forever. I felt no emotion watching this at all, and this is coming from someone who almost cried during A Star is Born. Overall this movie was a complete miss in my book and I hope that Bradley Cooper's next movie is better. 5/10.",
    "88": "The life and loves of Leonard Bernstein are the subjects of Bradley Cooper's movie biography, \"Maestro,\" Netflix's latest lux production for the big and small screen and this year's Oscar tease.Presented in competition at the Venice International Film Festival, lush and romantic, in that classic style typical of the Hollywood biopic, it sweeps in with grand gestures and the stirring strings of Bernstein's beloved \"Adagietto\" from Mahler's 5th Symphony, the composer's love letter to his wife. But, unfortunately, like the typical biopic, it romanticizes a complicated, messy life that's better suited to austere documentary than swelling violins and sumptuous vistas.Perhaps crude to note, but the Bernstein story is worthy of movie treatment only because homosexuality compelled him to lead a double life, which today may seem quaint, in that sense of a love that dares not to speak its name. Older movies about gay composers, Cole Porter and Lorenz Hart, are laughably inaccurate accounts of what are otherwise fascinating, tragic men. In \"Night and Day\" (1946), Porter, as portrayed by Cary Grant, himself closeted, isn't a gay man but a lousy husband, and physically wrong for the role. Far worse in \"Words and Music\" (1948), Mickey Rooney's portrait of Hart's tortured life is reduced to a general malaise over being short. Sexually conflicted, philandering Bernstein, as Cooper presents him, makes for good copy in 2023.The movie opens with a quotation of Bernstein's: \"A work of art does not answer questions, it provokes them; and its essential meaning is in the tension within the contradictory answers,\" which seems less an explanation than an admission of regret for what's to follow.Admittedly, a heterosexual conductor with a remarkable career but a commonplace life does not a movie make, not to mention a movie about a conductor, albeit a great one. Anyway, conducting is really a mystery to most, as its purpose seems unnecessary to the result; however, one can't dispute that dramatically wielding a baton, flinging one's head and hair about in time to music, does add a rather welcomed, visual highlight to a concert of otherwise stultifying musicians.Bernstein was this and so much more: adept at both classical and popular music, winner of Emmys, Tonys, Grammys, and an Oscar nomination, honored and celebrated, from Broadway to the New York Philharmonic, to concerts in Israel, Vienna, London, Berlin, Tanglewood--\"On the Town,\" \"Westside Story,\" \"A Quiet Place,\" \"Candide,\" \"Mass,\" \"Kaddish.\" A musician, a performer, a teacher, he tried to demystify symphonies and the work of conducting, specifically in his CBS broadcasts for children, but mostly for anyone to whom a baton seemed like a magic wand. And he collaborated with some of the best creative minds of the 20th Century. But all of that is material for another film and another filmmaker.Prodigious like his subject, Cooper does triple-duty here as writer, director, and actor, playing the Maestro himself, whom he uncannily resembles, despite latex enhancements to his own features. Cooper's love and admiration for Bernstein are obvious and should come as no surprise: he dives into the role, but never really inhabits it. Without creative distance and restraint, his performance is a testimonial, not an exploration of a life, and especially one in relation to music.A visual storyteller, with an eye for composition, Cooper places and moves his camera with purpose, frames shots for dramatic effect, and edits with rhythmic precision. And as he showcased in his first film, ambitious yet flawed, \"A Star Is Born,\" he also has an ear for music cues and underscoring shots to elicit the right emotion at the right moment. Like his mentor Steven Spielberg, he is a classicist at heart, and, unhappily, like Spielberg, not an innovator, but a follower (an observation, not a criticism). Classic Hollywood filmmaking has stood the test of time and isn't going away anytime soon. Yet, a filmmaker who follows form is never an artist, only a craftsman. Altering his appearance, for instance, to play Bernstein is indicative of craft, what actors from Lon Chaney to Orson Welles have done to find character, working from the outside in. This choice, while outmoded today, is still an accepted practice among actors, more so in biopics. But for Cooper it only adds to the list of reasons why this film doesn't work.Its focus, and its reason for being, is Bernstein's 33-year, somewhat \"open\" relationship with Costa-Rican actress Felicia Montealegre, which began in 1946 when the two met--felicitously--at a party in the home of pianist Claudio Arrau, her teacher. The competent Carey Mulligan plays Montealegre, but she's a bit too peaches-and-cream in a role that's better suited to a Latin. To her credit, she ably acts the part of an astute woman, talented in her own right, entangled in a romance with a gay man, yet she and Cooper don't fit as a pair. This kind of relationship does happen, of course, but hardly ever succeeds. The difficulty here is conveying the attraction, the job of the principal actors, certainly, but also of the director/writer. The obvious conclusion one may draw is that banal standby, \"love is blind.\" True enough, but why marry him? Therein lies the dilemma, the basis of Bernstein's self-indulgent, double life, which necessitated his needing a beard. Montealegre fit the bill. She was also a pretty ornament and a uterus for a man whose life was ruled by his whims. With similar whimsy, Cooper takes the audience along on this romantic escapade, expecting them to understand it and emotionally connect with it, but neither he nor Mulligan is credulous wholly to muster a convincing performance. Period set pieces and attractive costumes don't compensate for a weak script.The image in the movie's poster perhaps says it best: an elegantly coiffed and attired woman, faceless and alone, the word \"Maestro\" hovering lordly above her.What is to be learned? What questions provoked? What essential meaning? What tension within contradictory answers? Don't bother, it's not worth the effort, except to gather that Bernstein was indeed master of his career, but not of his life. If anything, he's an abject lesson for those who care to examine life because examining life is what makes it worth living. But that's more credit than the movie deserves.",
    "89": "Like for many of my generation - I was born in the early 1950s - Leonard Bernstein was known as the handsome, dynamic young American who tried to make classical music accessible to children of all backgrounds across the nation with his televised version of the New York Philharmonic's *Young People's Concerts*. (Walter Damrosch had done the same thing on radio a generation before for my mother's generation, but that were very different. Damrosch was European with a German accent. Bernstein, though the son of Russian immigrants, was all American - even if, as the movie suggests in one fast sentence, Bernstein started with such an accent himself and then worked to divest himself of it.) The man we saw on tv, and the imagine built up around him, is not to be found in this movie about a flamboyant, insecure, and self-centered individual who is too often weak to others' detriment as well as to his own. If you are looking for the Bernstein of your childhood, don't expect to find him here.Nor, from what I understand, should you look for the facts of his life here. This isn't a documentary, and doesn't pretend to be one. So I don't understand previous negative reviewers who fault the movie for not being historically faithful. Evidently it is not.But then, what is this movie about? As presented here, it's the story of a gay artist who, for reasons never made clear, allows himself to become married to a young and not particularly tolerant actress, and then has to spend the years of his marriage hiding his gay life not only from the public at large - which was the case for most gay artists of his generation and before - but also from his own children. This movie never explores why he did this.Nor does it consider contemporary cases of the same thing. The most obvious would be Dimitri Mitropoulos, the conductor of the New York Philharmonic just before Bernstein, who was also gay but who never married. It's strange that Bernstein never for a moment in this movie refers to him as a possible model in that respect.Nor does it really consider why actress Felicia Montalegri would have convinced him to marry her. She has a line about the smell of Bernstein reminding her of the smell of her father's coat, and that she associated that smell with security. But we don't know why she felt insecure without him - if she did - nor why she would enter into such a mariage, which was unlikely to provide emotional security.In short, the two main characters' motives for marrying are never really explored.At one point, near the end of the movie, there is an extended scene between the two in which, among other things, she blames him for not being honest with himself and developing his gifs, which she evidently saw to be his composing. But then, shortly afterward, when he talks about telling his teenage daughter that he is gay, she tells him he can't do that. So he should be free of what others do to limit him, but not free from what she does to limit him? The script, the character development, is often similarly muddled.I didn't expect to learn anything new about Bernstein's artistic life from this movie. That's now how it's being presented. But I didn't learn anything about why he allowed himself to have such a complicated personal life, either. And that is what the movie would seem to exist to present to us.So, what did I get out of this movie? Not much, to be honest.Would this movie be of interest to those not already familiar with Bernstein's musical career? Probably not. Especially in the early, black and white part, there is a LOT of name-dropping of people in the New York arts scene in the 40s and 50s. Aaron Copland, Jerome Robbins, Serge Koussevitzky, Bruno Walter, etc. That would shut such viewers out altogether.If Bradley Cooper made this to discuss the life of a gay man trapped in a homophobic straight world, he would have been better of doing what the producers of Tár did: create a fictional conductor who resembled Bernstein in some ways but not others, and then created his situations and characters accordingly. Pegging this situation to one recent musician whom so many potential audience members feel they knew just created openings for distracting criticism and limited - but not too much - what he could do with his material.As it stands, I don't understand what he wanted us to get out of it, and don't see how it will attract many viewers that stick with it to the end.",
    "90": "I think I my expectations were totally wrong for this movie. I don't really read reviews as I want to discover a movie for myself. I didn't read either if Maestro was a biography or not. And thought it was. I realised after 10mn that it was going going to be the love story between the great composer and Felicia.The movie is beautifully shot in black and white most of the time. It's very aesthetic up to the 4/3 format of old times. The lights the references and the music of course, everything is there.But the main plot lacks rhythm for me. I thought it was too wordy (if that makes sense). I think that Bradley Cooper could have been a bit more dynamic in his story telling.I'm not saying it's disappointing or anything but I dropped it midway of my viewing as it didn't do it for me.",
    "91": "As noted elsewhere, the movie is a series of disjointed, abstract vignettes forming a bit of a puzzle, I thought, which is left to the watcher to sort out. Or perhaps uncover a theme, if any, that connected them.Was it trying too hard to be an art film, at the expense of a film with a recognizable purpose and/or message?Carey Mulligan was very good but her performance was not as seamless as was the case in, say, Promising Young Woman. (I was probably 1/3 of the way into that movie before I even recognized her). It may have been the vocal accent here that caused a bit of dissonance for me. Having said that, she does fully realize her characters as discrete entities; I am hard-pressed to find any 'tells' she may exhibit which appear from role to role. She is a gifted actor.Bradley Cooper was also very good; I had no expectations as to how Bernstein would appear but he seemed to inhabit the role and provide a consistent characterization.The music was given a definite second fiddle status, and it wouldn't have harmed things, IMO, had an ID label popped-up briefly with each piece. I recognized West Side Story and I love Mahler's 2nd but otherwise....Speaking of the Resurrection, the selected 5 minute (and change) excerpt was certainly the climax of the symphony but the tempo of this reading inexplicably shifted into the slow lane on the highway only to find itself behind a loaded semi heading up a hill at the very moment it should have been majestically, effortlessly flying and pulling everyone along with it. I could hear that the orchestra was certainly up for it. I realize tempi are a style thing, and there is no single path chosen through this work by great conductors, but still. Also, I think this is one instance where Mr. Cooper trying to conduct as Bernstein didn't work all that well. It may have been beneficial for him to develop his own style (incorporating, certainly, some Bernstein mannerisms) and taken the training with a view to inject his own soul into the baton rather than trying to channel Bernstein. But what do I know.(Should anyone be looking for a suggested reading of Mahler's No 2; I highly recommend Leonard Slatkin and the St Louis Symphony on Telarc. Magical. Seat belts and subwoofers, or good earbuds, recommended. Youtu. Be/w2jdk18_6c4?si=oKiU3Jb_2JK84eBt)The choreography of the Sailors' Dance was terrific, I thought and very well danced.I switched off Netflix, after watching, not feeling as though I had much more insight into either Mr. Bernstein or his legacy, sadly.",
    "92": "This is a Bradley Cooper project, he produces, co-writes, directs, and stars as Leonard Bernstein. He even spent months learning how to authentically direct an orchestra for the role. It is curious that Carey Mulligan, who plays his eventual wife, Felicia Montealegre, gets top billing. Maybe Cooper was just being gracious, although the Bernstein story would be only a shell of itself if she had never entered his life.I am old enough to remember Bernstein and some of his work during the 1970s and 1980s, and of course the musicals that he wrote scores for. But I only knew of him as an observer from afar. This movie lets us behind the curtain and shows us the unvarnished truth of who the man was. He was complicated.Of particular note, he had a great fondness for attractive people of both genders. When he and Felicia were getting to know each other, and when he was getting ready to ask her to be his wife, she assured him she knew exactly what he was and did not have any issue with that. Only that he always be discreet, which it seems he violated on more than one occasion.Good movie, it received the approval of the surviving Bernstein children, now old men and women. After I watched it I looked up several old interviews I found online and Cooper managed to capture many of the vocal and physical mannerisms of \"Lenny.\" Plus, I noted that some of the dialog included in the movie was extracted directly from some of these old interviews and, I suppose, others.Good movie, I enjoyed it. Maybe being a musician myself and a former symphony member helped.",
    "93": "This is one of the weakest movies I have seen in quite a while. It exhibits the worst faults of a biopic, with none of the compensatory pleasures. It contributes nothing to our understanding of the challenges faced by successful, celebrated people, instead trotting out clichés that go back at least as far as the 1940s. Career-obsessed husband, long-suffering wife, wealth,jealousy. We can safely feel superior, in this day and age in societies likely to screen this movie, that Bernstein's bisexuality can be addressed. In fact, it's pretty much the only thing that's addressed in Maestro. The trajectory of Carey Mulligan's Felicia Montealegre (Mrs Bernstein) is one of acceptance to rejection to acquiescence which, however reactionary that may be politically, at least gives this otherwise spineless piece of work a little spine, and enables me to give the movie one star for Ms Mulligan's performance.. I should really award another for make-up maven Kazu Hiro's remarkable work in transforming Mr Cooper face, but the realism in that department didn't spill over into the performance as a whole. Here, as in A Star Is Born, Mr Cooper is attracted to characters with gravitas, but he isn't able to convey that quality at all. We watched the remarkable Michael Fassbender in a movie the other night: he is someone who is what Orson Welles called 'a king actor'. Bradley Cooper, notwithstanding his many gifts, isn't that.Nor do his talents seem to extend to writing. He's credited as co-author on this project, so therefore half-responsible for the toe-curling sections of thudding name-drops, the embarrasing lines uttered by almost everyone, and the lack of investigation of Bernstein as a political animal. Tom Wolfe's infamous essay about the Bernsteins hosting a party for the Blank Panthers is noticeable by its absence. Indeed, the environment is spectacularly white. There's a Latino housekeeper who has little to say, an African-American student who Lenny takes a shine to. Of course, the world in which he moved was indeed overwhelmingly white: the point is, he was sensitive to it, aware of it. Omitting this side of him to focus on the domestic is a valid artistic choice, I concede that; but to realise that artistic choice in the behind-every-great-man-is-a-woman trope does no service to anyone involved, including the audience.Cooper the director makes puzzling and irritating decisions as far as camera positions are concerned. The most puzzling is fliming the climactic confrontation between the Bernsteins in an unchanging two-shot, as if it were a scene in a play. The result is uninvolving, cold. And there are lots of meaningless shots of the countryside, and the huge estate that, naturally, the Bernsteins owned. If you've got it, flaunt it, right? That's the American Way.Trite, dismal, pretentious. Don't waste your money.",
    "94": "The trailer and my love for classical music had me super hyped for this film, but it was the biggest disappointment in the cinema of recent years for me.When I go and see a biopic I do not expect an imitation or copy of the main person, but at least an interpretation that does their life's work justice.This movie doesn't really tell a story, it seems like a messy collage of shots and incoherent scenes. The absence of a proper screenwriter is really felt in every minute, also in the silly lines the characters sometimes utter. I attribute it largely to the poor script that the characters seemed undeveloped and shallow and I felt untouched by or distant from the events happening around them (despite some great acting by Mulligan).The movie also completely misses the topic that its title \"Maestro\" suggests. Bernstein was indeed a master, one of the biggest musical geniuses to have lived, but you are not going to get any sense for that in the film. What he did for music, for young people, in his teaching, conducting and composing is what will be spoken about for decades to come. But the makers of this movie decided that the most interesting thing about him is the rather unspectacular fact that he was bisexual and Jewish and stuffed all possible clichees into every minute of the movie to total boredom.Cooper does not feel like the lead here, although I had great hopes. Bernstein always said he loves two things and he is not sure, which one he loves more: music and people. That is why he loved bringing music to the people. Cooper had such unemotional eyes, there was something clinical about them, he couldn't convey the warm charisma and nuance of Bernstein. Yet, the whole movie (Cooper has come up with the project, written and directed it, for himself it seems) feels like he is bragging for an Oscar. It was non-stop showboating, when it should have been a subtly calibrated performance, drawing the audience in and showing what might be going on inside such a genius mind.I think it is an insult to denigrate the most outstanding or memorable achievements of someone, just because his sexuality and therefore lifestyle differed from the societal standards of his time. For Bernstein, music was life. He said: \"Life without music is unthinkable. Music without life is academic. That is why my contact with music is a total embrace.\" I think he would turn in his grave for how sloppy and poorly they captured what music and being Bernstein really meant.Lastly, a movie like this should easily have the best soundtrack of the year. Think of a movie like \"Amadeus\", the soundtrack remains one of the most popular classical music recordings of all time. In \"Maestro\", even the soundtrack seems cheap and gives the false impression that what Bernstein did wasn't really that great or beautiful (luckily, we are blessed with tons of breathtaking videos and recordings by him). E.g. All singing in the soundtrack was of poor quality and made the pieces sound so ugly, I wondered if they ran out of singers or if they just had a tasteless musical advisor.I saw \"Maestro\" in a cinema, only 6 people were in it (on the Friday night of release week), one of them left after maybe two thirds of the movie and a woman next to me and myself were often taking a deep breath or sighing (in an annoyed way) when they stuffed every possible clichee and their forced \"message\" into different scenes.The filmmakers/ studio seem to have spent all the money on famous leads (great names to draw the audiences) as well as marketing/ exciting looking trailers, but not much was spent on anything else that constitutes a good film, like script-writing, cinematography, cutting etc. (not the first netflix production to exhibit this problem). In some places the movie honestly looks quickly thrown together and unfinished. Some scenes or shots seemed to be in the film only because they would look great in a trailer, but did absolutely nothing to convey a message or tell the story.",
    "95": "As \"Maestro\" (2023 release; 129 min) opens, latter day Leonard Bernstein is playing the piano at home while he is being filmed by a news crew. He laments the loss of his wife Felicia. We then go back in time, as Bernstein, then in his 20's, gets his big break when the New York Philharmonic main conductor falls ill and Bernstein can fill in. In a parallel storyline, Bernstein meets Felicia at a party, and they strike a close bond... At this point we are 15 minutes into the movie.Couple of comments: this is the latest from Bradley Cooper. He directs, co-writes, co-produces and for good measure plays the title role. The production is top-notch all the way, including exquisite photography (the initial 45 min. Are in gorgeous B&W). It is all topped off by two stunning lead performances: Carey Mulligan as Felicia, and as mentioned, Bradley Cooper as Bernstein. Cooper IS Bernstein. Check out the long sequence late in the movie where Bernstein conducts the orchestra and choir at the Ely Cathedral. Absolutely masterful. One of the great pleasures of this movie is the many long takes that Cooper uses. The camera is set and then simply stays put. Check out the long sequence where Bernstein and Felicia have a massive argument about Bernstein's \"extra-curricular\" activities. As I was watching that, I couldn't help but think how \"Maestro\" is the exact opposite of \"Napoleon\". In \"Maestro\" you actually gain insights as to the thinking and being of these real life characters.\"Maestro\" premiered at the Venice film festival back in September to near universal acclaim. It had a very limited US theatrical run and then started streaming on Netflix just yesterday, where I caught it. There is little doubt in my mind that \"Maestro\" will continue to collect many nominations in the upcoming awards season, and for good reason. It is my No. 1 movie of 2023, period. If you have any interest in Leonard Bernstein, or simply are in the mood for a top-notch relationship drama, I'd readily suggest you check it out, and draw your own conclusion.",
    "96": "I'm a classical music fan and a Leonard Bernstein fan. I have several recordings of Lenny's in my collection. There are not many great films that have the classical music world or figures as their subject. So I was looking forward to this film with great anticipation.I can't think of any other film that was so well done in so many areas of film form, that has bored me to the point of trauma as Maestro has. It looks great. Its sounds great. The direction, cinematography, editing, mise en scene, and the acting are all superb. The hair, makeup and costumes are flawless. The depiction of the various historical periods are excellent. But the characters, story and dialogue are so empty, so banal, so inconsequential that the film's positive aspects are utterly canceled and undermined.Not one interesting word or sentence is uttered in the entire movie. Bernstein, an outstanding conductor and composer and his wife also a seemingly outstanding person and artist are empty shells with nothing to say. No one in the entire picture says anything interesting. It's unbelievable that any people let alone these, who revolve at the highest levels of music, artistry and society could not utter a single relevant word of any interest. If Lenny and his wife were like this at all, it could only represent a fraction of who they were. Two minutes of listening to the real Lenny in his Young Person's TV show gives us a far more compelling amount of talk and revelation of personality than this entire film.I did not learn one thing about Lenny or his wife in this movie that I did not read in a synopsis before going to see the flick at the cinema. Its impossible that these people could be so vacant in reality. Even when Lenny is giving his views on art and life to a biographer who is recording an interview with him in one scene, his statements are mundane and trite. There are a couple of party scenes in the picture where one would think that you would hear some interesting if not compelling conversations. Not here. Not one word of any interest is said in these scenes.There is no drama, no conflict, no tension and no emotion anywhere in this film. It is all style and no substance whatsoever. Despite its polished surface and attention to historical period detail the narrative is inert and the characters sterile in depiction. I'm still trying to find a way to articulate\nthe effect this film had on me. Right now I only know that overall, its was an abrasive and grating experience.The film left me cold and angry. The boredom of it was almost traumatizing as I tried so hard to find something of interest in it. I was in disbelief, exhausted and baffled as I left the cinema trying to understand what I had just sat through. Disappointment is to weak of a word to describe my feelings toward this film. The experience was painfully boring. Perhaps the most intense, active and sustained boredom Ive ever been through. So I harbour great antipathy toward this flick. Its memorable to me for the severity of its boredom and the depth of its vacancy. I'm a film lover and I utterly hate this film!Nothing of music or of Bernstein exists in this picture. Just a shiny well made image of a man and woman that is completely empty of meaning, emotion or thought. Unfortunately, this film might reinforce the idea that some people have of Classical music as being boring. Don't believe it. Go and watch or rewatch Amadeus or Tar instead.",
    "97": "Carrie Mulligan is outstanding. Cooper the actor is almost as good. Cooper the director is often breathtaking.I knew in advance that this was a study of the Bernstein's romance, and not of his creative process as an artist. It is hard to show that creative process in a film. Many times, to portray the trials of creation effectively, a director must expect his audience to have some familiarity with the process. Most of us are not painters, nor dancers, nor composer/conductors. Most of us don't understand how a composer can wrestle with choosing the next note... a 4th or a flat 4th? Such quandaries aren't fascinating to most and are largely unexplored. Films that partially succeed often have crazy protagonists: \"Lust for Life\"'s Van Gogh, or \"Pollock\".Cooper's direction makes frequent use of the \"long take\", a single shot that can take minutes and has no cuts or edits. These shots give us a sense of \"place\", we are there: a long take (and long shot from a distance) of the couple talking with arbors of grapevines framing the scene, the couple on either side of a room arguing while the Thanksgiving Day parade floats past the window, and a wonderful six minute long take of Cooper conducting Mahler 2. Kudos to Matthew Libatique's photography.... and a brief statement to those who complain about the prosthetic: grow up.On the whole, the movie came up a bit short for me. My takeaways: Mulligan rules, and I can't wait to see what Cooper does next.",
    "98": "Maestro is the ideal directorial follow-up to A Star is Born and a biopic that shows what it's like in the shadow of an all consuming fame just as much as it shows the iconic career of its subject. If all biopics were as bold and inventive as this film's early black and white sequences then the genre would never be considered boring again.Aided by Kazu Hiro's faultless make-up, Bradley Cooper gives one of the best performances of his career. It feels like his entire being is in this performance, best exemplified during the one time it shows his conducting in all its glory. It's performed like a euphoric out of body experience in which Cooper gets completely lost in the moment.There's a reason that Carey Mulligan is billed first because this is her film just as much as Cooper's, if not more. She exudes elegance flawlessly and the early scenes in which the relationship begins to form between her and Bradley Cooper has a real spark to it. The most devastating moments of the film come from emptiness that's so clearly felt when she isn't there.Bradley Cooper's direction feels designed as a direct response to any criticisms of his previous efforts not being showy enough. This is truly bombastic stuff, switching between colour and black and white with very precise framing and more lyrical flights of fancy. He also ends the film on the perfect shot and really knows when to incorporate Bernstein's own work into the soundtrack.",
    "99": "Leonard Bernstein was one of the most lauded Conductors and Composers of the 20th Century - although you won't really learn that by watching writer-director Bradley Cooper's MAESTRO - and, that's a valid approach to take. Carey Mulligan, who plays Bernstein's wife Felecia Montealegre, seems to be, in many ways, the central character (Mulligan is billed first). Again, a reasonable POV. It's in the execution where MAESTRO's issues mainly lie.Bradley's screenplay (with Josh Singer) follows the basic arc of Bernstein's career from his early days when he was suddenly, and very successfully, thrust into the role of conductor for New York Philharmonic. During this period, he meets Felecia, a budding actress from Costa Rica (which makes Mulligan's casting a bit off even if she rises to the task). They marry, even though she knows that Leonard isn't a faithful partner and eventually have three children. Stylistically, the early scenes have a notably theatrical frame around them (including being shot on Black & White film and in a boxy 1:37 aspect ratio). There's some fun to be had in the first act, even if it often comes off as sounding a bit overly mannered.As the story moves later in the couples' life, Cinematographer Matthew Libatique switches from B&W to color and widens the frame to 1:85. It certainly calls attention to itself (as does Bradley's sometimes self-conscious framing), but the camerawork (all on celluloid) is accomplished. Bernstein's music compositions are interspersed with selections from the classical canon with works by Beethoven, Schumann and Mahler (the latter's Resurrection Symphony is presented in a vibrant cathedral performance that is the film's highlight). The work Bernstein put in to his own musical creations isn't given much screen-time, including only passing references to his scores for ON THE WATERFRONT and WEST SIDE STORY. Again, an artist's choice, but one can't help but wonder why Bradley felt the need to tell this particular story by ignoring a good portion of his famed work.Mulligan's Felicia is given a good amount of screen-time, but it always feels as if its in service to her husband's life (and the needs of the script). Mulligan is very good at showing how a wife could be betrayed on a personal level while still loving her partner, but one never feels that this still isn't Leonard Bernstein's story in sum. Cooper's performance is too fussy and he never truly gels with his acting partner. Leonard's motivations are never given enough insight including his fluid sexuality and his feelings about being Jewish in mid-century society. Cooper's direction seems similarly to hold the viewer at arm's length. The film never breathes.Compartmentalization is the key to understanding the relationship - both together and individually, but there's so little passion for the joy of music (or marriage) that it doesn't fully engage. It's well mounted and acted but it's a movie that's to be admired from afar.",
    "100": "Came in knowing nothing about the guy, and even after 2 hours I can't say that changed. A common critique of biopics is how their structure usually facilitates merely the broad lines, the Wikipedia summary. Well, let me tell you, Bernstein's Wikipedia page is infinitely more interesting than anything this shows on screen. I mean, the guy had an FBI file due to his left-wing activism, and even Sherlock couldn't deduce that out of this film. Granted, Cooper seems more drawn to interiority, to psyche, but his insistence on bulldozering through the story leaves emotional connections severed. So much nuance is lost that when Bernstein has a fight with his wife, the performances mighty as can be, the motivations behind their disagreement were absent to me. Cooper doesn't seem able to decide how the hell he wants to approach this man. Is it about a troubled mind, an artist wrestling with the inevitably of his end? Is it about a marital struggle fueled by sexuality and ego? Is it about Bernstein's connection to the realm of music? It's all of this and ends up none of this, each element so criminally undercooked it's ultimately unfocused.Maybe the biggest offense, though, is how little we see him actually conduct. It takes 90 minutes for the film to properly show us the conductor doing what that name entails, and it's powerful, not only musically but also through the energy and dedication displayed by Cooper. Obviously, 2 hours of this is not what I'm asking for - but it does hint at the underlying problem of Cooper not understanding where the strengths in this tale lie. Incredible how last year's Tár boasts a completely fictional character that feels more real and defined than the recreation of an actual person here.At the end of the day, it looks neat and features some marvelous performances that will probably sneak their way into the awards season, but, ultimately, there doesn't appear to be a point, which dooms both your engagement and remembrance: I watched this mere hours ago and forgot about it multiple times already.",
    "101": "Maestro' struggles to find any semblance of depth or engagement throughout its runtime. It's a film that treads the line between boredom and emptiness, ultimately landing firmly in the realm of sheer monotony.Despite its attempt to capture a compelling narrative, 'Maestro' falls short on every front. The storyline lacks substance, leaving viewers adrift in a sea of unfulfilled potential. The characters feel hollow, failing to evoke any empathy or interest.The film's biggest flaw is its inability to offer anything beyond a yawning emptiness. It lacks the emotional resonance or narrative drive needed to keep an audience invested. Even the most ardent enthusiasts of the genre would find 'Maestro' an arduous watch.In essence, 'Maestro' is a vacuous, uninteresting film that fails to deliver any semblance of entertainment or substance. It's a forgettable venture into cinema that leaves viewers yearning for more depth and engagement.",
    "102": "Bradley Cooper's \"Maestro\" is a visual feast, a glittering tapestry woven from Leonard Bernstein's iconic life. Every frame hums with the electrifying energy of his music, performed with breathtaking precision. Yet, amidst the operatic grandeur, a haunting note lingers: the film fails to truly capture the maestro's soul, the incandescent flame that fueled his every note.The live performances are undeniable magic. They aren't mere background noise; they're the beating heart of the film, pulsing with Bernstein's raw genius and the characters' emotional turmoil. Cooper understands this, and his directorial baton conducts the camera with masterful precision, pulling us into the intoxicating vortex of sound and light.But then, the music fades, and the narrative stumbles. The love story, though beautifully told, feels like a diverting aria, eclipsing the symphony of Bernstein's artistic journey. We glimpse the sparks of creativity, the whispers of inspiration, but the film never delves into the furnace where his music was forged. We're left wanting to know: what ignited this musical inferno? What drove Bernstein to push the boundaries of sound, to paint the world with his sonic brushstrokes?Instead, \"Maestro\" drowns in the sea of its own spectacle. The dazzling sets, the whirlwind romance, the electrifying performances - they all become distractions, glittering baubles that momentarily blind us to the true treasure: the unyielding devotion that resided within Bernstein, the man who dared to make music his mistress, his obsession, his very lifeblood.The film pays homage to Bernstein's legacy, yes, but it leaves us with a hollow echo, a yearning for a deeper exploration of the maestro's soul. We see the man, the lover, the artist, but we never truly hear the music that made him sing. \"Maestro\" is a stunning performance, a technical marvel, but it's a love letter penned in the wrong key, one that ultimately misses the beat of Bernstein's true passion.",
    "103": "My Review - Maestro\nMy Rating. 7.5/10First the brickbats then the bouquets about an impressive movie which is the bittersweet love story about the relationship of famous conductor composer Leonard Bernstein and his elegant Costa Rican Chilean wife actress Felicia Montealegre.This is the second movie I've seen in a few weeks with a 1:33 narrow screen ratio that doesn't go full screen 1.85 till the last scenes of the film plus it's in monochrome until till the last scenes when it changes to colour. In my opinion it's a gimmicky pretentious and hopefully not a lasting trend . For me it adds nothing to the movie experience on the contrary it lessens it for me.The Director of Saltburn Emerald Fennell recently said she chose the narrow screen ratio to allow a peeping in effect ? So I wonder what Bradley Cooper's excuse was ?Well yes , Maestro is at times an uncomfortable peep hole but the 1.33 narrow screen ratio is not required to portray the intimate lives of 2 famous celebrities who no doubt loved each other . The bitterness of the love story is the fact that Leonard Bernstein was a gay man who fell in love with a beautiful woman who bought stability and respectability and children to his life at a time when that was commonplace thankfully no longer.Yes Felicia was aware of his sexuality but loved him dearly until as as in one of the most poignant scenes in Maestro when Lenny is off his face on cocaine and becoming as she describes sloppy about his male affairs she tells him that he will end up being a lonely old queen.My other technical problem was a difficulty at times to pick up on the complex dialogue which is perhaps my hearing but at times it was like being in a room with a lot of people and not being able to the person speaking to me.Bradley Cooper gives a brilliant performance as I expected and no doubt will probably receive at least 2 Oscar nominations however he sounded as if he had a heavy cold which may or may not have been due to his controversial prosthetic nose .The performance I enjoyed most in this movie was from the superb Carrie Mulligan who gives to my mind a potential Best\nActress Oscar winning performance as Felicia Montealegre .From the moment the camera pans on her nervously walking to a show biz celebrity party where she meets Lenny for the first time to the incredibly sad last half hour of Maestro I couldn't take my eyes off her expressive face Carey Mulligan gives a performance of grace and sophistication.This time 12 months ago Tár another movie about a classical conductor starring Cate Blanchett was received with critical praise and Oscar buzz . It was nominated for 6 Oscars winning none so I'm a little cautious about the Oscar potential for Maestro.I mention Tár also because the fictional conductor Lydia Tár for me had a few of the same strong character defects that Maestro Bernstein had namely a gigantic ego which perhaps is unavoidable with great genius plus an almost childlike sense of entitlement , what Lenny wanted Lenny got whether in love or artistic adulation.I remember well watching a documentary made in 1985 about the making of his recording of West Side Story when Bernstein rudely and cruelly verbally attacked Jose Carreras one of the famous 3 Tenors for his pronunciation of one of his songs at that time I thought you're not a nice person in fact you're a rude pig.When an actor Co writes , Directs and stars in their own movie as Bradley Cooper has in Maestro it must undoubtedly be a labour of love or as some may say an ego trip but not in this case I think he has achieved exactly what he set out to do .Maestro originally had 2 other directors lined up first Martin Scorsese then Steven Spielberg but both decided to be Producers of the movie instead .What better endorsement of confidence could Bradley Cooper have received when in 2018 after seeing an early cut of A Star Is Born which was also directed by Bradley Cooper caused Steven Spielberg to walk over to Cooper after the \"Shallow\" scene and say to him, \"you're directing Maestro.\"\nThe co writer of Maestro is the Oscar and BAFTA winning screenplay writer Josh Singer who won for his brilliant writing on Spotlight and also wrote First Man and The Post so Bradley Cooper has chosen a trusted and proven collaborator .The music in Maestro is sublime of course as it's all the wonderful music of Leonard Bernstein . It won't be nominated for an Oscar as it's not original to the movie but it's all been newly recorded\nIn a wonderful scene filmed at Ely Cathedral where Bernstein conducted the London Symphony Orchestra in 1976 Bradley Cooper said, that was that scene he was so worried about because we did it live\nI had to conduct them. And I spent six years learning how to conduct six minutes and 21 seconds of music.It will be so interesting to see how many Oscar nominations Maestro receives next year I would love Carey Mulligan win or at least be nominated but I don't think Maestro is the best movie of 2023 or that Bradley Cooper's performance is necessarily the best but he certainly is impressive.",
    "104": "Bradley Cooper gave a great performance in this film. There were many times I forgot that he was playing the part because it truly felt like someone else. The makeup was also very great, the actors truly looked like they aged in the later parts of the film. The music was also very great with songs used that were composed by Leonard Bernstein whom is the character Bradley Cooper played. I enjoyed the film most when it was in black and white. It truly felt like an older film and it was most interesting during these parts.Once the film went into color it didn't feel the same. The film becomes bland shortly after as one waits for the film to unravel its plot. This film focuses primarily on Leonard Bernstein's relationship with his wife. While this could have carried the film, it just didn't have enough\ndrama to warrant a film about it. Leonard is revealed to be bisexual and one would think this would be used to create some dramatic moment but it doesn't. There weren't any intense moments or anything heartbreaking or even heartwarming.I liked how the film showed Leonard's sexuality without over sexualizing the film to get its point across.So while there were many things I enjoyed about the film it failed to wow me in the end. The film wasn't memorable enough and the more it dragged it made the relationships less interesting. The ending was abrupt and undesirable.Not one I would watch again despite how I felt about Cooper's performance.",
    "105": "This is a biopic of American composer Leonard Bernstein (Bradley Cooper) directed by Bradley Cooper. Felicia Montealegre (Carey Mulligan) is his wife. David Oppenheim (Matt Bomer) is his lover. Shirley Bernstein (Sarah Silverman) is his sister. Jamie Bernstein (Maya Hawke) is the couple's grown eldest daughter.This has all the cinematography. It starts with the opening black and white sequence. Bradley would stay in black and white for three quarters of an hour. There is a bit of a time jump and the movie would jump into color. In a way, he's doing all the artistic works, but in a straight forward way. This movie suffers from the biopic disease. Bradley needs to pick out the one theme and make a movie about that one theme. I would do it about his sexuality.In that way, I would film the love triangle with David. The last scene would be David and Leonard walking for the last time down the New York street. At that moment, I thought this is a great scene to end the movie. As it stands, this is too episodic and it's surface story telling. It give us all the highlights. Arguing against myself, that would cut out Carey Mulligan's great performance in the second half. She deserves many awards for her work.Finally, there is the makeup controversy. It's a lot of hot takes and hot air. The makeup is amazing and probably deserves awards although I doubt that would happen. No awards committee wants the heat. This is a technically superior film with great acting and good intention filmmaking.",
    "106": "There's so much to admire here: the wonderful performances, the captivating cinematography, the creative subverting of the standard biopic trope. And yet I came away somewhat disappointed.Part of this is due to the nontraditional approach to a biopic. We don't see much of Bernstein's renowned highlights (\"West Side Story\" is barely mentioned), and for the biography of a famous musician there's surprisingly little music. All right, I'll go with that.Call me a traditionalist, but I wanted more of a defined story arc. We see key moments in their lives but I never truly got a sense of what drove Bernstein (or his wife) other than their undeniable love for one another. Also, in many of the scenes I had a hard time following dialogue: lines were spoken on top of one another, rapidly. Yes, I know that's how people talk in real life, but this is a movie that we're supposed to understand.I will watch this again (with subtitles) to see what I missed, and perhaps I will appreciate it more. Let me state that I mostly liked this (hence my rating) -- but whether it was due to heightened expectations or not, I wanted more.",
    "107": "First off, Bradley and Carrey's performances are just brilliant. Period. If you want to watch a movie with breathtaking acting, then you're in the right place. Plus I loved how the long scenes were masterfully directed, a commodity which becomes even more rare in time. The overall production is captivating and serves the story and action pretty well. Dialogues are super realistic and very close to an every day life attitude, without dramatic climaxes with no particular reason. In all, the movie as a production and execution is brilliant in its own right.But what about the story? Yes, indeed it focuses on the love and relationship between Bernstein and Cohn, but I feel the title, the persona(s) and the history would demand way more than just the love affairs of a bisexual man and a loyal and very strong woman. Bernstein is part of the human cultural history, so I don't see why Cooper focused on the lover and just added the music and talent as a decorative prop. It should have been the other way. Or maybe split the story in two separate points of focus, one on the talented persona and his big achievements, and the other around his undoubtedly difficult human side, beside an equally strong woman and vigorous personality. Lastly, I found some dialogues to be out of focus, butt then again I have to pay my deepest respect to both co-stars for their being amazing performers.It's a very good movie to watch, but I feel it inevitably misses out the bigger picture.",
    "108": "I don't know if maybe \"Bohemian Rhapsody\" (2018) or \"Rocketman\" (2019) have made me a bit immune to the rather hedonistic lifestyles of the musical rich and famous, but I found this beautifully photographed depiction of the life of the enigmatic Leonard Bernstein to be remarkably tame. The monochrome presentation is glorious to look at, but the narrative is weak, I found. Carey Mullian, his long-suffering wife Felicia Montealegre is easily the most meritorious of praise here. She portrays the increasingly frustrated, betrayed yet still loving woman with a strength and subtlety that is really engaging - especially towards the end of the film. Cooper, on the other hand - well, was he meant to be mimicking Barry Manilow or Tony Bennett? We learn very little about what made the man tick, about what made his sexuality such a big deal for him? The other characters come and go with little context to illustrate their roles in his life, his role in their's and with the possible exception of their eldest daughter Shirley (Sarah Silverman) there is no conversation to be had about just how this marriage of convenience was established or managed. It's also largely devoid of his most famous musical works. Aside from the tiniest interlude from \"West Side Story\" - which I know he didn't much care for - we could be forgiven for assuming that this was a biopic of a composer with high-brow classical aspirations but with little popular appeal. That said, there is a splendid rendition of Mahler's 2nd from the acoustically gorgeous Ely cathedral to savour, but otherwise this is all a rather underwhelming melodrama that really didn't tell me much that I didn't already know about this charismatic, selfish and flawed individual the fluctuating state of whose marriage was, frankly, of very little interest to me. More marital woes than maestro, sorry.",
    "109": "Leonard is one of the most towering and talented musical figures in the history of this country, yet this movie has NOTHING to do with any of that.Instead, it's a trope about how ALL of us are, deep down, homosexuals, and society has been and continues to be a stone that crushes the best of us (homosexuals), and therefore everything beautiful in humanity. Never mind the fact that, in the current age, it is nearly illegal to NOT be homosexual, making this ridiculous arc upon which the movie rests, spurious.Of course, the the undertow plot, which is raved about as the main plot, is the bravery and strength of the \"woman\" that must endure the man's depravity for the greater good of family, society, art and culture, another trope de jour as jaded as modern society itself. In real life, she was a second rate actress that hitched her star to a flamboyant and famous MAN with earning power, and nothing more. But in today's world, ONLY the female can be the hero.Cooper had an opportunity here to introduce an American cultural legend to a new generation, as well as reveal in-depth knowledge and insights in to the MAN's life and art, while putting his craft, his MUSIC on full display. Instead, he went for what his generation reveres, the glorification of depravity and elevation of mediocrity, producing a movie as vapid as the times.",
    "110": "Chronicles the relationship between musical legend Leonard Bernstein (Bradley Cooper) and his wife Felicia (Carey Mulligan).I nearly gave up on this. Firstly director Cooper has decided to add gimmicky changes to colour / black and white and screen size to illustrate different times in his relationship between the couple which I found distracting and uncalled for. In addition, the first - black and white - section covering the early days when he was an up and coming composer / conductor and first met Felicia was cold and vapid, however thereafter for me, it soared.Rarely do you find such a serious, complex love story supported by such a stunning double act of talent with both Cooper and Mulligan giving it there all. Cooper is entirely convincing, nose et al as Bernstein, the vast, adored talent who clearly adores his wife whilst committed to his art and not shy of continuing to explore his gay side, even in front of his wife. Possibly even better is Mulligan who is staggering as Felicia, loving her husband yet having to tolerate the world wanting and loving him first and his open gayness and still managing to keep him grounded - the scene where she tears into him, is terrifically written and acted. Throughout all this of course is the music which interestingly is never allowed to take over the central romantic theme but remains there to remind us of his talent - the performance of Mahler in Ely cathedral is very moving. Well written then and incredibly well acted, this is a moving and terribly sad tale of a love that lasted despite the odds being against it.",
    "111": "Greetings again from the darkness. A creative genius must deal with the constant demands, both internal and external, of new and better projects. That last one was great, now what's next? The art is never enough, and it's never done. As if that pressure to create is not enough, there is also the personal side. A connection is presumed by fans and customers and critics. We like your art, so we feel like we know you. How does one even find their true self, much less hold on to it, while being adored and showered with accolades? Well, many don't, and the aftermath is usually not pretty.Bradley Cooper has received nine previous Oscar nominations in various categories: Actor, Supporting Actor, Producer, and Writer (many from A STAR IS BORN, 2018). He has yet to win, but with this latest (co-written with Josh Singer, an Oscar winner for SPOTLIGHT), Cooper is likely to nab multiple nominations yet again. \"Oscar bait\" was how a movie like this would have once been described, simply because it's well made and appeals to a wide audience. While the description seems a bit unfair, this film is in fact, well made and appeals to a wide audience. On top of that, the two lead performances are both noteworthy. Cooper stars as Leonard Bernstein, and Carey Mulligan co-stars Felicia Montealegre, the actress Bernstein married.Leonard Bernstein was a generational talent as a world-renowned conductor, He was also a bi-sexual philanderer who felt he never received due credit for his compositions. Felicia was a long-loyal and long-sacrificing spouse who raised their kids and supported her enigmatic husband, who frequently used his musical genius as an escape clause. The film spans the 1940's, when Bernstein made his accidental (no rehearsal) debut as Assistant Conductor filling in for the New York Philharmonic at Carnegie Hall, to the 1980's when Bernstein is giving an interview at his Fairfield, Connecticut estate and discussing how he misses Felicia.This is clearly a labor of love for Cooper as director-star-writer-producer, and yet it's Mulligan who has the most complex role ... one she excels in. Certainly, Cooper shines in a tender moment scene with daughter Jamie (Maya Hawke) where he lies about the rumors she's heard, and he relishes the highlight of reenacting the London Symphony Orchestra at Ely Cathedral in 1976 for Mahler's second symphony. The latter is a scene itself worthy of a theater picket price for the picture and sound. Despite the flamboyant nature of Lenny, it's Mulligan who is the heart of this story, and she excels in every scene ... especially the Thanksgiving Day argument as Snoopy floats by their Central Park apartment window.A third co-star here would be cigarettes, which seem to fill the screen with smoke regardless of the time period or location. Seriously, the supporting cast includes Matt Bomer and Sarah Silverman, and Bernstein's compositions are heard throughout the film, including \"West Side Story\" in the most ominous moment. A particularly creative scene occurs as Bernstein becomes part of the \"On the Town\" sequence on stage, and we also see Lenny and Felicia interviewed on television by Edward R Murrow.This is Cooper's second outing with almost complete control of the project, and it's a technical masterpiece from a movie-making perspective. If it falls a bit short on the emotional connectivity scale, that's likely due to the true story of Lenny and Felicia. The cinematography from Matthew Libatique is gorgeous (both black & white and color), and the costumes from two-time Oscar winner Mark Bridges and prosthetics/makeup by two-time Oscar winner Kazu Hiro add to the smooth transitions from era to era. Rather than a traditional biopic, this is more a relationship story - one between an egotistical, absurdly talented man-child, and the loyal, selfless woman who allowed him to shine, even as she stood frustrated in shadow.",
    "112": "What a let-down\nthe movie about a character with such a huge reputation, and it is turned into a boring movie spoiled by the constant non-stop smoking,\njust because they all smoked then was there such a lack of imagination that the director bradley cooper and the many producers couldn't have said \"we can make this movie without all the smoking\"\nso Bernstein couldn't restrain his same-sex desires, even in front of his wife, but he could still lie to his oldest child,\ninteresting that at the end when Bernstein is teaching a young conductor, the young conductor is so much more graceful, non-flamboyant, in touch with the music, than the scenes of Bernstein conducting when he is grossly overdoing it,\nit would have been nice to see at least one example of what Bernstein gained national fame for, not the concerts to which only limited audiences came, but the 'teaching' of classical music to the masses.Cooper is good as an actor, Mulligan only comes alive in the last third, very few others make much of an impression,\nthe movie may have moved along chronologically but it didn't move as a movie, great disappointment,",
    "113": "Many people know Leonard Bernstein by his recordings of classical music, and by his compositions for Broadway and movies. This film shows the private side of his life - his relationship with his wife Felicia, herself a busy actress. It also includes his relationship with his children (mostly his daughter), and the various men that float thru his life - which his wife accepts, as long as he is discreet.Backing the story are excerpts from Bernstein's career. The soundtrack includes music he composed, including West Side Story, and combined with bits of classical music. There is a scene of a rehearsal of the dancing sailors from On The Town, while the classical highlight is Bradley Cooper conducting (allegedly live) the finale of Mahler's Symphony #2 \"Resurrection\".Since the time period spans ore than a quarter century, there is a problem of having too many characters who are basically cameos, which I had trouble following.Shooting the earlier scenes in black-and-white is an interesting attempt at \"documentary\", given that it was the time period before color film The makeup for Bernstein is impressive, changing as he ages. Also interestingly, Carey Mulligan as Felicia Montealegre is given top billing, even though she has less screen time than Bradley Cooper, but Cooper already has credits for Director, Writer, and Producer as well.So this film will appeal to lovers of certain genres of music, while it will not resonate among those who don't know Bernstein.",
    "114": "I was very excited when I heard Maestro was coming out. With all this filmmaking firepower, it would have to be worthy of its subject. Now I've seen the movie and am stunned by the wasted talent and energy expended for what turned into another movie about rich, talented people who appear to have it all, but get sad and emotional just like the rest of us. They just talk about it a LOT more.The film is beautifully photographed, but I have no idea what the format change and the black and white to color change accomplished. The acting was good, but rather than being shown that the characters are going through something emotional, we are told, All these immensely talented people seem to talk about is their feelings, not their motivations, plans and aspirations.Leonard Bernstein wrote and conducted some of the most memorable music of the 20th century. He singlehandedly (with help from Bugs Bunny) kept interest in classical music alive when jazz and rock were kings. But we learn nothing of this in this film. Bernstein's talents and accomplishments are presented as facts, without exploration. What a waste.",
    "115": "This film is a shoe in Academy Award nominee, potentially winner in at least 7 categories. In the UK it is already out in cinema. Who knows for how long. Then it will be Netflix but, honestly, it is much more enjoyable on a big screen rather than on an IPad or Airplane screen. Funnily enough, for a movie titled \"Maestro\", the film devotes equal parts to Bernstein the man, the Conductor, the Composer, Elite New York and the Wife. In a way it seems a continuation on the themes of \"A star is born\". That was Lady Gaga's movie, this one is Carey Mulligan's. There is a dissonance in the making of this film I am not sure I am able to explain. The black and white parts are near perfect, the transformation of both Bradley Cooper and Carey Mulligan is a feast of make up, costumes and mighty acting, the scenes, the editing, the music, so much music... It' s an emotional and amazing journey in and out of Carnagie Hall, Midtown Manhattan and - go figure - Ely Cathedral, Cambridgeshire. But there is that dissonance, a harsh sound like the phone ringing at the beginning of the movie, and it confines this triumph of research, prosthetic, locations, sound and cinematography to near perfection.",
    "116": "This movie has been shown and competed at many festivals around the world, so ive been very excited about it, because i also have a big interest for music.I really enjoy the black and white format. It brings a very artistic style. Im actually getting some Wes Anderson vibe, of the style it has.Filming, editing and cinematography is very good! I got a little surprised that Bradley Cooper actually directed this aswell being actor in it and he does it very good in both professions. Truly extremely well acted and directed with genuine passion!Its also very well written! And the soundtrack is really good aswell and the use of Bernsteins real music makes it just better and feel more authentic!Very well put together and very well made!However, it has some confusing moments. But overall a good film. Pure art!The cathedral scene is one of the best single shot scenes ive ever seen! One of Bradley Coopers best performances ever! Brilliant! Definitely deserves a Oscar academy awars winner!Definitely one of 2023s must watches!A beautiful told lifestory!A very deep and beautiful film that i recommend!",
    "117": "I wish i was able to watch this in the big screen instead, but i guess Netflix has their own money to acquire the film and surely they make a good decision to put another great \"Netflix Film\" so their name was not completely bashed because Maestro was in fact a really really great movie, an amazing film starring and directed by Bradley Cooper with his stunning and fascinating filmmaking technique, fills with incredible performances especially both Bradley Cooper and the must considered Oscar 2024 nominee for best actress Carey Mulligan, a wonderfully captured yet complicated relationship, the black and white decision that necessary, with the whole film fills with Bernstein own music and score was just incredible, while i do have one big criticism for the film which i just felt there a lot of scene could've been more powerful, mostly with Cooper depiction as Bernstein as he is quite distracting at times just could've been more powerful, and nit picky here and there but the rest of Maestro was an interesting love journey fills with great performances and great filmmaking, it kept me intrigued the whole time and i wasn't bored at all, it's one of the best films of the year, and it's one of my favorite films of the year, Maestro was amazing.",
    "118": "Even with its 4 strong nominations at the Golden Globes (Picture, Director, Actor, Actress), I must say my appreciation of Cooper's new film is not as stellar as organic and fantastic A Star Is Born.Netflix's firs real Oscar contender was Alfonso Cuarón's Roma (2018) which won 3 of its 10 nominations. Last year's Germany's remake of All Quiet on the Western Front (2022) was nominated for 9 Oscars and won 4. My all-time Netflix favorite is Noah Baumbach's Marriage Story which I rewatched recently. It is much better than that year's Best Picture co-nominee Martin Scorsese's The Irishman (2019) which was still as solid movie. Neither won and Netflix's overall 8 Best Picture nominees did not win since a decade at the Oscars.This year, Scorsese produces Maestro (2023) with Spielberg, but his own slow burn of a movie Killers of the Flower Moon (2023) has more flair yet not a Netflix production (he produces it with DiCaprio). I think this year's Netflix better picture is Todd Haynes's May December (2023 - also nominated for 4 Golden Globes). So why did Bradley Cooper not exactly deliver?Carey Mulligan's performance is certainly good, yet his directing lacks the creation of intimacy like he did with Lady Gaga in A Star Is Born. Most interactions are superficial, and you have to wait until the 75th minute to see the first powerful scene with strong dialogue and directing. The intro scene is compelling up until we the two main characters meet, but I found the rest of the first hour a mess. The second half of the film is surely better yet lacks urgency or dramatic tension in directing, even in the hospital scene. There is also a shortage of real wisdom or realisation in the script. We are left with a light and superficial understanding of the two main characters, even to the point where their respective love for music and acting and their love for each other is not really felt. Nolan's Oppenheimer (2023) was much more successful in that aspect.Cooper's acting also lacked some charm in my view, save perhaps a few scenes like in the end when he teaches a young conductor.Finally, Cooper's directing choices for cinematography left the very talented Matthew Libatique with not much to work with. In Black & White, 4:3 aspect ratio or even 16:9 color, few scenes seem to tell the story like a more claustrophobic The Whale (2022) was able to with Darren Aronofsky and was nominated for an Oscar with Cooper's A Star is Born (2018).Better luck next time Coop! Good effort. 6.5/10.",
    "119": "As much as I love Biopics I do think they are one of the harder genres to pull off in a successful way. I've seen more than a fair few that feel like the cliff notes of an interesting story rather than an actual examination of real people and fascinating events. For every Oppenheimer there's a Napoleon and I was so excited to see how Bradley Cooper would portray a biography like this after his strong debut as a director. While Maestro doesn't come close to being in the cliff notes category, I do wish that Cooper had told this story in a bit more of a unique way.I fully bought into and loved Cooper's performance as Leonard Bernstein. I thought his makeup transformation was extremely well done (I think the controversy behind it is ridiculous), I thought he nailed the accent as well as all the conducting scenes, all of which I thought were the best scenes in the movie. And I say that as someone who doesn't know anything about that kind of music. Carey Mulligan is every bit his equal too. There's a physical process that character goes through that can't be fully conveyed with makeup and she portrayed it so wonderfully that it actually start to affect me as a viewer. The best thing I can say about these two actors chemistry is that their interactions never felt scripted. They felt like genuine conversations between too people with a lot of history and that comes down in large part to the dialogue.It's so unbelievably well written and performed. It feels like it's ripped directly out of a film from the 50's or 60's where a large majority of this takes place and it manages to be extremely witty and quick paced without ever seeming overwritten. I can't fault Cooper's performance or his work behind the camera in this movie. It's a gorgeous looking movie with a great use of aspect ratio and other than a few overly flashy long takes and scene transitions I thought his direction was really well restrained that let the performances and music speak for themselves. I'm not overly familiar with all of Leonard Bernstein's music but I thought it was integrated into the film in a really fitting way. I was totally impressed by this movie from a performance and technical perspective but honestly not that enthralled with the way it told its story.I found this to be an extremely well acted and very well shot version of a familiar story told in a frustratingly straightforward way. The opening scene seems to imply that the story will play out with a flashback narrative but after the opening events play out entirely linearly with a lot more familiar plot beats than I would've liked. As soon as the central romance begins it's obvious there's only a matter of time before it runs into turbulence and it does in the most predictable way possible. I wouldn't exactly call the film fast paced but I did think it was a bit too montage heavy for its own good with a lot of time jumps that felt very abrupt. A lot of the key turmoils in this relationship were too brushed over and as a result I didn't always find the drama to be as compelling as it could've been. Because the lack of build up in these areas a large part of the third act dragged for me and after a certain event happens very abruptly the film plods along for another 15 minutes before ending in a way that I felt could've been stronger.I really enjoyed all the performances and technical aspects of Maestro but I just wasn't as invested in it as I wanted to be. It's an extremely well presented version of a story we've seen done before with a lot moments that would've had more impact if the script spent more time on set up than it did on pay off. I did like this movie but I was expecting to enjoy it a lot more given Cooper's clear passion for Bernstein's life. I enjoyed my time with it but unfortunately I don't know that I'd ever watch it again. Still I think Bradley Cooper has a good filmmaking eye and I'll definitely be interested to see what ever project he helms next.",
    "120": "It's a decent oscar-type biographical movie about Leonard Bernstein and his wife Felicia Montealegre with gorgeous production and camerawork, direction and strong performances from the cast members. Bradley Cooper's previous work \"A Star Is Born\" proves Cooper has talents with directing and this movie takes different direction and approach from his previous work, and there are some pretty good directing on the style, atmosphere and tone Cooper provides. Many of the sound designs, the musical/soundtrack moments and the compositions were well executed as it helps to add the energy and setting of the time era and the works of Bernstein. All of the performances are really good as Cooper and Carey Mulligan have good chemistry and dialogue between one another. Including good costumes and presentation uses of black & white.On the narrative, while Cooper and Josh Singer do try to provide some interesting concepts and themes, I found the narrative to be too standard and basic to the extent I wasn't fully emotionally with the characters and writing. The writing is the typical Hollywood biographical setting with predictable structures and set pieces which did make the movie a little boring at times. Leonard Bernstein is an interesting figure and I kind of wish the movie explored more about his character in other aspects. Certain dialogue moments felt a little rough and there were certain styles and movements that felt like it wanted to be Tár but it ended up being cheesy and kind of show off.Undeniably, Bradley Cooper has a vision and this movie does prove it. There are some really good directing and strong performances and chemistry between the actors. But I just didn't connect with the characters and story. Overall, it is ambitious and there are some really strong moments but it feels more like a typical Oscar-Bait movie.",
    "121": "Seeing Maestro was one of those it helped having a full blown fan of the subject (I love West Side Story and On the Waterfront and that's my extent) - my mother, who religiously watched the children concerts on TV for years and saw him as \"heroic\" - and while she loved Cooper's lush and emotionally bittersweet saga even more than I did, talking with her about how some of the visual choices were thoughtful and precise made me like it more.For example, a number of the extended shots showing Lenny and Felicia together in conversation, from afar and close (and eventually in one of the most memorable scenes an explosive argument), and how they are like choices a composer or conductor would choose for - here is where something has to be extended and where this instrument plays softly and then this takes off with a boom and clash. There is distance at times, but never carelessly presented.I think there are a few scenes in the middle I found a little dull (which ones? I'd have to go back to watch it again to pinpoint them but they were a couple of the familial hangout scenes as I recall), but what I did like and really appreciate about the film was that it is firmly a biopic that has its feet planted in character over incident. It doesn't mean there aren't important moments for Lenny and Felicia in the film represented, but it is about the magnetic power of LEONARD BERNSTEIN above almost all else.The almost, of course, being his relationship with Felicia and the bisexuality and other partners (for its and maybe any time), and as sharp and against all odds empathetic Cooper makes Lenny its Mulligan who makes the movie for me, a subtle and joyful and eventually devastating performance and character. In other words, this doesn't make the mistakes of like Napoloen, for example.And while I do think having one or two scenes showing more of Lenny's creative process at work could have been enlightening, it may be clear (at least this was my mom's point I'm adopting because it makes some sense) that as Bernstein tells the one interviewer he is/was as a creative person solitary doing it all himself, so showing that on film might not be as involving (though with collaborators? Shrug).But the real emotional meat, and the greater point of Maestro, is what is felt and accepted and given back of the relationships, about the glorious and beautiful, the thrill of success and the disillusionment of being the \"other\" in someone's heart; and the ugly nature of how someone sees themselves with someone else (especially if they're brilliant *and* a narcissist), or how one doesn't reveal something about themselves (again, the bisexuality).There is daring in the filmmaking - again, once or twice early on to the effect of... that is a choice and a half, like when it becomes a fantasy dance number on stage with part of the cast of On the Town, and I wish that framing had come back at some point - and for the couple of moments it lost me it doesn't mean what works is overshadowed. Like Priscilla also this season, this is a true life famous person saga where it's not about what happened but how they felt about it, and Cooper as actor and director latches on to feeling like a pro... And when Bernstein is conducting the orchestra, specially Mahler? What a rush.",
    "122": "7.5/10. Solid portrait/biopic of a man that refused to be labeled as one thing by society, whether that be in his professional or personal life.The cinematography is fantastic. There are some beautiful frameable shots in this movie. The directing is absolutely on point. I honestly think Cooper should win the Oscar for directing. The makeup and effects were great as well. In terms of technical achievement, this is tremendous.In terms of storytelling, it is very good. Not a lot of emotional punchiness or big-hitting moments (which would be the only thing this movie lacks for me to give it a higher rating), but some standout scenes and stellar acting. The writing and mostly consistent tone is very good. Cooper's acting and casting is an A+++++. Mulligan's casting is good, she still looks quite young in some of the older scenes but her acting is also fantastic. I loved her part of the story as well, arguably just as much as Bernstein's.This is definitely Oscar-baity, but not in a bad way. The themes it explores are well done and incredibly realistic. It felt like everything happening was with very real people, and the dialogue reflected it the most.The best part of the movie (of which the visuals are a very very very close second) is the sound design. Wow. The way it uses the concept of spatial audio and surround sound to tell its tale is incredible. When the choir crescendos, it feels like you're really there. Is it a shame this movie won't be seen in theaters by most? Absolutely 1000%. But if you've got a surround sound system or the like, you will experience the movie as intended. The way it uses sound, and the way the theater bursts all around you with the little elements of the music, feels like you are truly in an amphitheatre. I honestly think \"Dolby Atmos\" and above-the-head sound as it is used in most cinema is pretty meh, unnecessary and just creates more noise, but whatever they did to design it in this movie, it is reference quality for any work.Overall, I enjoyed it a lot, and I'm glad I saw it. There's not much to complain about, and it's a solid movie.",
    "123": "It took Fincher 25 odd years to give us Mank.Cooper has given us his Mank within 4.A Star Is Born blew me away within the first few seconds and never let me go - awesome movie. Here, I was bored within minutes and I am a classical music lover.Not that Bernstein was strictly classical. Compare Bernstein's version of Beethoven's Emperor Concerto with Furtwangler's for instance. Bernstein irons out and smoothes the piece which in Furtwangler's hands is more topologically dynamic!! Bernstein was more Easy Listening than classical. Maybe that was Cooper's point, eh???I'm a big fan of Bradley Cooper and I'm sure I'll return to give this another chance but for now in this moment in time it's a 5/10.",
    "124": "Bradley Cooper wants an Oscar, he won't be at peace if he doesn't win that Oscar as a director, but this is so obvious in the movie that those who watched the movie at the festival already complained about it.The influence of producers Martin Scorsese and Steven Spielberg is felt so much that it is obvious that they stopped being producers and intervened in the shooting.We also saw this in Todd Phillips' Joker.Unfortunately, this does not have a positive effect. Different perspectives and different signatures are felt very much in the film.Ps: the make-up is very bad, especially in the close-ups and especially cooper's make-up looks all grinning.",
    "125": "This film is more a paean to the outsize ambition of its co writer, director and star than it is a satisfying examination of the genius and character of its subject. Take away the stunning cinematography and production values that do such a good job of plunging us into the look of 1960s/70s east coast America and the amazingly good performance of Carey Mulligan (indeed, the film goes deeper into her than it does him) and the fine job that Bradley Cooper does portraying Leonard Bernstein and you are left with a very standard biopic of a famous composer, slightly better than \"Song Without End\" and falling considerably short of \"Mahler\" or \"The Music Lovers\",(which it references).One does not have to go far to detect the film's two major problems. They are story (or lack thereof) and pacing (or lack thereof). To take the first first, the screenplay by Bradley Cooper and Josh Singer takes a complex and creative life and makes the crux of it an account of closeted sexuality and its effects on wife and family. This would be ok if Cooper and Singer had written a mini series on Bernstein and had devoted two or three episodes to this undoubtedly large but hardly definitive part of his life, but to make it the central motif in a two hour and ten minute biopic is, to say the least, reductive. It also leaves out too much. Only one line about Bernstein's struggles with his tyrannical dad. Nothing on the making of \"West Side Story\", arguably his greatest work (although he would have preferred \"Mass\" to be thought of as his magnum opus). Nothing about his relationships with anyone other than his wife and, briefly, his elder daughter. (Ironic that in a film dealing with Bernstein's sexuality none of his male partners comes to life). Nothing about his political views or his flirtation with the Panthers (afraid it'd make him look faintly radical chic ridiculous?) and, in the film's biggest omission, nothing about the Young People's Concerts which is what I and, I suspect, most of my generation remember best about him. The result is a film that, for all its visual and aural splendor (there are generous amounts of Bernstein's music), feels airless and shut in on itself.It also feels slow and long. Which brings us to the film's other drawback, namely that as a director Cooper has the pacing skills of an introspective elephant. Particularly irksome are the repetition of scenes that serve the same function. Three fights between the Bernsteins regarding his boyfriends and betrayals are two too many. And I don't wish to be crass but Mulligan's has to be the most drawn out death scene (or scenes) this side of \"Camille\". Clearly Cooper should have consulted his producer, Mr. Scorsese, on how to speed things up or, at least, to unclog the proceedings.But for Cooper's third hat, that of actor, I have little to criticize. He's not as good as Mulligan, of course, but he's solid, so that Cooper soon disappears into Lenny. Indeed, it is the acting from the two leads, more than anything else, that lifts this movie, ever so tentatively, above the mediocrity line. C plus.",
    "126": "If you are looking for a movie about how Leonard Bernstein created his masterworks, or chose the subjects for his Young People's Concerts or what went into composing his broadway and movie scores - this is NOT the movie for you. This is Bradley Cooper's homage to Citizen Kane. With the strange aerial shots, the black and white cinematography, the overlapping dialogue - exactly the kind of pretentious movie making that the old members of the Academy will eat up.Yes, the two stars, Cooper and Mulligan chew the scenery and will definitely get Oscar Nominations, but the movie was not made for music aficionados.The movie was made for those with a prurient interest in Bernstein's sex life. Too bad it wasn't advertised that way. With a title like Maestro - one might conclude that the viewer might get some insight into the mind of this gifted and inspired artist - completely not the case.This is certainly Oscar candy - it's just sad that you are better off watching a documentary on the movie's title character than this Award seeking click bait.",
    "127": "Just back from seeing Maestro on its opening weekend at our local theaters. Bradley Cooper and Carey Mulligan seem to be shoo-ins for Best Actor nominations, along with a few other categories like set design, costuming, and cinematography. I admired the craftsmanship on display here quite a bit -- meticulous recreation of the styles, settings, speech patterns from the 1940's through the 70's. And obviously Cooper dug very deep into channeling Leonard Bernstein, not just hairdo and makeup. (And at times his resemblance to the real Bernstein is pretty stunning.) I knew a lot less about his wife and love Felicia Montealegre, but I'm assuming the same is true for Carey Mulligan's portrayal of her. They are both arresting, finely nuanced performances.It's all impressive and worth seeing more than once. One thing I wanted more of was, oddly enough, the music. We mostly get only tiny snippets of Bernstein's own compositions, plus a bit of Beethoven and others, as if Cooper (who's also the director) thought we the audience wouldn't have the patience for more. Wrong, IMO. There is one -- just one -- centerpiece scene allowed to play out full measure, which is Bernstein conducting the last several minutes of the titanic Mahler Second Symphony in a huge cathedral. It's the highlight of the film, and although the purpose seems to be to show B's over-the-top directing style, the music itself is what's overwhelming. Bernstein seemed to be made for Mahler (than whom there is no more emotional composer) and his work bringing all of Mahler's symphonic work back into the mainstream is for me his biggest career accomplishment.The rest of the movie is like a series of short vignettes, as if we are putting blocks together to gradually assemble a rounded picture of Lenny and Felicia. I wanted them to let some scenes just play out longer. When this thing is on Netflix I'll watch it again to help decipher all the rapid-fire, overlapping dialog. And, I'm not sure that even if you go back and look at films from the 1940's you would see this much cigarette smoking! It's a feature. He was clearly a chain smoker, but was she as well? Perhaps so, given their causes of death.All this said, it's a major film and worth going to see. There are loads of movie biographies of famous people that are totally off track. This one isn't.",
    "128": "Where do I even start when talking about this terrible biography, which could've been so much better with a little more care on the writing front.Cooper's acting is over-naturalistic, whilst Mulligan's is the polar opposite. The two do NOT go together, so why implement it in the first place?The scenes are scattered, and unentertaining. These scenes made me think how with a bit more emotional depth, Cooper could've explored Bernstein's Sexuality, Race and composing problems. Instead, we are met with an abysmal attempt at explaining these things, scattered like bread in a pond around the plot.This made the film extremely uninteresting, and the character arcs were not met.The score could've been a bit of Bernstein, but mostly his inspirations, like Gustav Mahler (only played his Adagetto for 2 minutes) or Beethoven.From the first scene, the writing seemed weak. Scenes were too unimportant to displaying Bernstein's life. And instead focused on his love life, AND NOT HIS OWN STRUGGLES.I struggled not to fall asleep in this film;\nit was impossible not to. The film should've been made for the west end. Not for an impeccable actor playing a character who was so, so interesting, and COMPLETELY butchering it!An absolute mess of a film.And Bradley's prosthetic nose was not only offensive, but comical.Butchered. What a shame.",
    "129": "After all these years Bradley Cooper is still the worst actor Hollywood has, this was the worst performance I've seen in any Biopic. Even the media play cannot cover his lack of talent. He keeps getting worse with each new movie..Worst Biopic of all time my expectations were already low and it still managed to make me disappointed Bradley Cooper needs to retire he was never meant to be an actor.Pooper was practically begging for an Oscar through the full length of the movie his performance feels so forced and uncessary. A pain to watch. And to think he stole the role from Jake Gyllenhaal just for Cooper to give us one of the worst performances in cinema history is flabbergasting.As someone who usually enjoy Biopic this one fell short compared to all the promotion it got, I can easily say it is the worst of all time. Even the prosthetic NOSE couldn't be convincing and cover Cooper's lack of Talent.",
    "130": "No pun intended - Bradley Cooper! I would not have thought he'd be in this place when I watched him in Alias. The tv show that is - I loved him in that show, just in case that came across in a bad way. And I loved him in the movies he did after his run was done with that show. But he has shown himself able to be behind the camera as well as in front of it.Now this ... I am not sure what to call it: is it a biopic? I reckon that is the closest one can call it. But it is not really focusing on a lot of things Bernstein. It does rather focus on his relationship (Mulligan playing his significant other - well one of them so to speak - the main one).I think it would have made sense to have done some homework before watching the movie. On the other hand it does work without much prior knowledge (I am the best example for that). Of course you may know at least some of his work - or have heard it! Literally that is of course.I had not idea about his private life - and Bradley really gets into that. He becomes him - and that is not just the make up. You may still see Bradley underneath it all - but he also does the voice thing. While I have no idea what the real one sounded like ... I am quite certain Bradley comes at least close enough.When it comes to his private life, I reckon some may have issues with it. But Oscar buzz is there ... for both main actors ... and this is a movie that lends itself to be nominated multiple times ... whether you find it deserving or not is a different matter ... still technically and otherwise top quality ...",
    "131": "15 minutes into the movie I was wondering what was the point of this movie? It is not even your regular wikipedia to screen Oscar bait biopic. It is bombarded with dialogue and most of them add nothing to do the plot (if there was one). The prosthetics and over acting performances from Bradley and Carey were so painful and cringe inducing to watch.A movie with a stellar cast and technicians yet the output is something so painfully bad. Could someone tell Bradley he doesn't need to explain everything and can actually show us what's happening. The entire 120 minutes felt more like a podcast with annoying fake accents rather than a feature film.Leonard Bernstein is regarded as a genius and one of the greatest composers to exist but this movie was nothing about it. It was a dull unemotional Marriage Story where people keep talking and talking about the most mundane aspects of life. The use of music is comically bad, for a movie about a composer, not a single piece of music sticks with you. Bradley uses the most original idea to drift between timelines - B&W for past and color for original (The creativity!).Club this along with Theory of Everything, Eyes of Tammy Faye, Judy, Bohemian Rhapsody, The King's Speech, and The Darkest Hour in \"Please Give me an Oscar, I am doing acting with 10 KGs of prosthetics on my face and faking a foreign accent\" sub-genre.",
    "132": "An old adage holds that meeting an idol isn't always a good idea, if you don't want to be disillusioned.That's the takeaway from \"Maestro,\" a penetrating portrait of monumental musical artist Leonard Bernstein, starring, directed and co-written by Bradley Cooper.Considering how much sublime beauty and exuberant joy he brought to the world as a conductor, composer and concert pianist, \"Lenny's\" life offstage was a glorious mess. Darkness and unrequited hunger in his psyche counterbalanced the soaring highs he shared with adoring audiences.Spanning three decades beginning in 1946, Cooper's ambitious epic follows the artist's meteoric rise and reign in concert halls around the world. His accomplishments extended to theatrical stages (\"West Side Story\") and screens large and small, including his Young People's Concert series in the new medium of television.But more central to Cooper's grand design, it chronicles Bernstein's 25-year marriage to Felicia Montealegre (Carey Mulligan).Cooper gives Mulligan top billing in the credits. Deservedly so. Hers is the more layered performance as she advances from radiant brilliance as a stage actress through the willing sacrifice of her own career in service to her husband's, into final painful decline.Complicating their relationship was Bernstein's bisexuality. When, as a young assistant conductor, he received the phone call that would change his life - to step in for an ailing guest conductor and, without rehearsal, conduct the New York Philharmonic in Carnegie Hall that afternoon - he was in bed with Jerome Robbins, destined for his own Broadway fame as a dancer and choreographer.Although he submerged his sexuality in ensuing decades, becoming instead a doting father to his three children, Lenny would eventually become less discreet in his pursuit and seduction of younger men.He was a charismatic figure of boundless enthusiasm and insatiable appetites. For all the exacting precision he expected from his musicians, on the podium he seemed ravished by the music, his face in ever increasing ecstasy, utterly spent by the final note.Cooper learned to conduct with the same ferocity he brings to every detail of his portrayal - the frenetic Manhattan accent punctuated by the ever-present cigarette in his fingers or hanging from his lips. (\"Maestro\" should come with a surgeon general's warning of secondary smoke risks just from watching it.)\nAround the central performances, with stars like Sarah Silverman in the supporting cast, Cooper captures bygone eras with distinctive visual touches. He'll shoot dialogue shots from the distance, making the settings in Manhattan, Tanglewood or the Bernstein home in upstate New York as important as the words. The cinematography, following \"Oppenheimer's lead in black and white and color, is as lavish and bold as the musical score.The Bernsteins' Park Avenue duplex overlooking Central Park also became a hub of activity, awash in upscale liberal cocktail parties brilliantly immortalized by Tom Wolfe in \"Radical Chic and Mau-mauing the Flak Catchers.\" Here as on the podium, Bernstein was always \"on,\" always performing, the center of attention, sucking all the air out of the room.Considering that he essentially launched his career as the pretty boy in \"The Hangover's\" hapless quartet, Bradley Cooper continues to demonstrate himself as a consummate artist on both sides of the camera. \"Maestro\" nicely follows his remake of \"A Star Is Born,\" which also probed the tortured soul of music making.Creative genius, it seems, isn't always a gift for the handful of humans who possess it. In Bernstein's case it felt like an unachievable responsibility, a curse as much as a blessing.As a member of the audience that grew up watching Bernstein's Young People's Concerts in the '50s, he remains a mythic figure, more demigod than human to me. Steven Spielberg and Martin Scorsese are about my age. Similar feelings my have prompted them to sign on as producers of Cooper's film.Lydia Tár also grew up watching the Young People's Concerts, which shaped her ambition to become a conductor herself. Lydia, of course, wasn't real, but the brilliant creation of Cate Blanchett and writer-director Todd Fields in last year's similarly themed \"Tár.\" Ironically, it's Lydia rather than Lenny who is ultimately the more compelling screen character. His very human failings don't fit nearly as neatly into three-act structure as her fictional flaws did.True, Leonard Bernstein's artistic genius achieved immortality in his lifetime.But sucking all the air out of the room gets annoying after a while.",
    "133": "Started to watch this and completely disappointed. Figured that there would be a small group of people that would watch and give this movie high ratings. Even the worst movies ever made get great ratingsI went to watch Maetro expecting it to be some sort of documentary on the life of Leonard Bernstein.Stopped watching after about 45 min as this movie is so bad. Just bits and fragments of things that were all over.Had to google him to make any sense of timeline and his life. And don't think it is a spoiler to say that I was very confused about Bernstein's sexual orientation in watching this movie. Does he like men? Does he like woman?The main movie starts probably when he is in his early 20's but we don't know. And there is the rub. You will walk away from this movie disappointed if you were looking for a biography.And to my point about some people will watch or give positive reviews to anything. In the world of billion dollar plus box office hits.this movie earned about $300,000 worldwide - making it the bottom 1% for box office revenue making it to the bottom 1% of 14,000 movies tracked If I read correctly.",
    "134": "There are many reviews that bash the film for not giving any background into Bernstein's creative process, the description of the film (at least the one I read) clearly says it is a love story delving into his relationship with Felicia. For that reason Bernstein's conducting and composing serve as a backdrop rather than a focal point of the story.This is a story about a man tortured by conflicting desires. His deep abiding love for Felicia and how it collided with his love for men.The film masterfully shows how this conflict played out in his relationship with Felicia.I had no expectations when I began watching this film, other than it was a love story. In fact, it wasn't until after watching the movie that I learned Cooper wrote, directed as well as starred in the film.Bradley Cooper does an amazing job portraying Bernstein. The conflict Bernstein must have carried is skillfully presented to us through words, mannerisms, and powerful moments of silence. Cooper shows us the pain, the turmoil, and the heartache Bernstein tried to hide from the world and himself. Bernstein's children have raved about Cooper's portrayal of their father.Carey Mulligan is wonderful as Felicia. She gives emotional depth to the struggle Felicia lived through for loving a man who could not love her back with the same totality. She provides some of the best dramatic moments in the film.In spite of the forces pulling them apart, we see how the love they felt for one another bonded them together to the end.This is a beautiful love story that deserves far more praise than it is getting.",
    "135": "I had high hopes for this movie, I really did. But as I eagerly awaited Bradley Cooper directive debut, I ended up not being that excited for it's release. Releasing on the tail end of the year, as well as it being the holiday season, is a recipe for disaster. Keep in mind that this movie is not a Christmas movie by any stretch of the imagination and you'll see what I'm talking about. A biopic like that should have been so powerful to the point where it pushes your emotions to the limits. So aside from the sub-optimal release date, the movie as a whole didn't really deliver on what it could have been. Take The Music of Silence for comparison. Not a critically acclaimed movie, but at least a satisfying one. The trailer alone for that movie almost brought me to tears when I first saw it in theatres. It was undeniably a powerful masterpiece that took you for a rollercoaster of emotions. And that's exactly where Maestro failed to satisfy me. The movie felt lacking and the pacing seemed off. I know I can't delve too much into these intricacies since this is Bradley Cooper's debut in movie direction, but I can't look over how amateur the direction was. Even Cooper's performance didn't feel as powerful as in A Star is Born. It really seems like Bradley should've focused his energy on either acting or directing but not both. However, it's clear that there is a lot of potential here which leaves me excited for what's to come.",
    "136": "Giving this an 8/10 ratingBradley Cooper, writes, directs, stars in this epic tale of conductor-composer Leonard Bernstein and his actress - wife and muse of sorts, Felicia Montealegre Cohn Bernstein, plated by Carey Mulligan. Except Oscars nominations for both of them and this film.Cooper is totally immersed and you really can't see his face with the brilliant make up as Bernstein, old and young, he explodes into this role, like never before, and has too, if he had put a foot wrong, the film would fall so far down the rabbit hole, and that goes for Mulligan, she really, really is so good.Like, 'Napoleon', this is a love story at it's heart, but with the explosive brilliance that is Bernstein's music, the sound is superb, and the the photography, is more than right, it is a film of two halves, and it is sharp, soft, loud and has plenty of moments of did this really happen?! There is plenty of excess here, and I really did not know about a lot that happens in this film. The only reason it does not get a 9 rating is that does drag in the later half, I think some parts of this tale, might not of been necessary, but probably are right for the film, I leave that for you to decide. This is Musical chairs and romance.",
    "137": "And another music-themed Bradley Cooper movie that I really wanted to like, but ended up hating, and for similar reasons. At least I managed to watch \"Maestro\" through to the end, but only made it a third of the way through \"A Star is Born\".Perhaps the movie's most egregious failure is obsessing about Bernstein's bisexuality, promiscuity and attendant family dysfunction rather than focusing on his singular place in the pantheon of American musicians.I think it is the second or third scene where the \"Lenny's Gay!\" theme is introduced (awkwardly, involving a foot massage...), and it never lets up from there. For a movie titled \"Maestro\", and for anyone with the slightest awareness of Bernstein's enormous mid-century stature and popularity, it's shocking that only a handful of scenes even attempt to illustrate his musical genius... and do so poorly.My other major source of agita was the abysmally stilted dialogue. There is not a single line of dialogue that rings true, is profound or memorable, or advances a deeper understanding of any of the characters. In the words of a memorable Seinfeld episode, \"It's all just so much fluff\". Charitably, it may have been a \"style over substance\" artistic decision, intended to evoke the badinage one might hear at a chic Manhattan cocktail party, or the rapid-fire repartee in mid-century films and stage plays, but it simply comes across as pointless and contrived. And, in an effort to sound \"authentic\", most scenes involve two or more characters speaking over each other. I normally hate Netflix captions, but felt compelled to turn them on to \"de-muddle\" the dialog.Much has been made about the set design, period costumes and cinematography, which are all indeed first-rate, but these are marred and jarred by strange camera angles, framing and editing choices. It doesn't quite enter pretentious student film territory, but comes perilously close, and to say the film has \"pacing problems\" is an understatement.Finally, a two-hour movie about Bernstein and his music should have a phenomenal soundtrack, and musical cues that help advance the plot. Instead, the music direction is plagued by the same weak and amateurish production as the rest of the film.",
    "138": "Just watched Maestro and wow! Just wow!!It took me a short while to get into the zone of the film style, but once there, was totally gripped and engaged to the very end. I fear the low score reviews on here, are by people who possibly struggled with the complex nuances within the relationship and story told on screen (so wonderfully depicted by the two main characters). Such complexities often accompany the lives of great creative geniuses!The acting was superb\nThe costumes were beautiful, especially some of the early dresses - you knew exactly which era you were in\nThe makeup and particularly the prosthetics, were fantastic\nAnd of course, the music score was sublimeFitting such an immense lifetime and love, into two hours of viewing is no mean feat. It's well worthy of a 10/10.",
    "139": "Where do I even start when talking about this terrible biography, which could've been so much better with a little more care on the writing front.Cooper's acting is over-naturalistic, whilst Mulligan's is the polar opposite. The two do NOT go together, so why implement it in the first place?The scenes are scattered, and unentertaining. These scenes made me think how with a bit more emotional depth, Cooper could've explored Bernstein's Sexuality, Race and composing problems. Instead, we are met with an abysmal attempt at explaining these things, scattered like bread in a pond around the plot.This made the film extremely uninteresting, and the character arcs were not met.The score could've been a bit of Bernstein, but mostly his inspirations, like Gustav Mahler (only played his Adagetto for 2 minutes) or Beethoven.From the first scene, the writing seemed weak. Scenes were too unimportant to displaying Bernstein's life. And instead focused on his love life, AND NOT HIS OWN STRUGGLES.I struggled not to fall asleep in this film;\nit was impossible not to. The film should've been made for the west end. Not for an impeccable actor playing a character who was so, so interesting, and COMPLETELY butchering it!An absolute mess of a film.And Bradley's prosthetic nose was not only offensive, but comical.Butchered. What a shame.",
    "140": "After all these years Bradley Cooper is still the worst actor Hollywood has, this was the worst performance I've seen in any Biopic. Even the media play cannot cover his lack of talent. He keeps getting worse with each new movie..Worst Biopic of all time my expectations were already low and it still managed to make me disappointed Bradley Cooper needs to retire he was never meant to be an actor.Pooper was practically begging for an Oscar through the full length of the movie his performance feels so forced and uncessary. A pain to watch. And to think he stole the role from Jake Gyllenhaal just for Cooper to give us one of the worst performances in cinema history is flabbergasting.As someone who usually enjoy Biopic this one fell short compared to all the promotion it got, I can easily say it is the worst of all time. Even the prosthetic NOSE couldn't be convincing and cover Cooper's lack of Talent.",
    "141": "No pun intended - Bradley Cooper! I would not have thought he'd be in this place when I watched him in Alias. The tv show that is - I loved him in that show, just in case that came across in a bad way. And I loved him in the movies he did after his run was done with that show. But he has shown himself able to be behind the camera as well as in front of it.Now this ... I am not sure what to call it: is it a biopic? I reckon that is the closest one can call it. But it is not really focusing on a lot of things Bernstein. It does rather focus on his relationship (Mulligan playing his significant other - well one of them so to speak - the main one).I think it would have made sense to have done some homework before watching the movie. On the other hand it does work without much prior knowledge (I am the best example for that). Of course you may know at least some of his work - or have heard it! Literally that is of course.I had not idea about his private life - and Bradley really gets into that. He becomes him - and that is not just the make up. You may still see Bradley underneath it all - but he also does the voice thing. While I have no idea what the real one sounded like ... I am quite certain Bradley comes at least close enough.When it comes to his private life, I reckon some may have issues with it. But Oscar buzz is there ... for both main actors ... and this is a movie that lends itself to be nominated multiple times ... whether you find it deserving or not is a different matter ... still technically and otherwise top quality ...",
    "142": "15 minutes into the movie I was wondering what was the point of this movie? It is not even your regular wikipedia to screen Oscar bait biopic. It is bombarded with dialogue and most of them add nothing to do the plot (if there was one). The prosthetics and over acting performances from Bradley and Carey were so painful and cringe inducing to watch.A movie with a stellar cast and technicians yet the output is something so painfully bad. Could someone tell Bradley he doesn't need to explain everything and can actually show us what's happening. The entire 120 minutes felt more like a podcast with annoying fake accents rather than a feature film.Leonard Bernstein is regarded as a genius and one of the greatest composers to exist but this movie was nothing about it. It was a dull unemotional Marriage Story where people keep talking and talking about the most mundane aspects of life. The use of music is comically bad, for a movie about a composer, not a single piece of music sticks with you. Bradley uses the most original idea to drift between timelines - B&W for past and color for original (The creativity!).Club this along with Theory of Everything, Eyes of Tammy Faye, Judy, Bohemian Rhapsody, The King's Speech, and The Darkest Hour in \"Please Give me an Oscar, I am doing acting with 10 KGs of prosthetics on my face and faking a foreign accent\" sub-genre.",
    "143": "An old adage holds that meeting an idol isn't always a good idea, if you don't want to be disillusioned.That's the takeaway from \"Maestro,\" a penetrating portrait of monumental musical artist Leonard Bernstein, starring, directed and co-written by Bradley Cooper.Considering how much sublime beauty and exuberant joy he brought to the world as a conductor, composer and concert pianist, \"Lenny's\" life offstage was a glorious mess. Darkness and unrequited hunger in his psyche counterbalanced the soaring highs he shared with adoring audiences.Spanning three decades beginning in 1946, Cooper's ambitious epic follows the artist's meteoric rise and reign in concert halls around the world. His accomplishments extended to theatrical stages (\"West Side Story\") and screens large and small, including his Young People's Concert series in the new medium of television.But more central to Cooper's grand design, it chronicles Bernstein's 25-year marriage to Felicia Montealegre (Carey Mulligan).Cooper gives Mulligan top billing in the credits. Deservedly so. Hers is the more layered performance as she advances from radiant brilliance as a stage actress through the willing sacrifice of her own career in service to her husband's, into final painful decline.Complicating their relationship was Bernstein's bisexuality. When, as a young assistant conductor, he received the phone call that would change his life - to step in for an ailing guest conductor and, without rehearsal, conduct the New York Philharmonic in Carnegie Hall that afternoon - he was in bed with Jerome Robbins, destined for his own Broadway fame as a dancer and choreographer.Although he submerged his sexuality in ensuing decades, becoming instead a doting father to his three children, Lenny would eventually become less discreet in his pursuit and seduction of younger men.He was a charismatic figure of boundless enthusiasm and insatiable appetites. For all the exacting precision he expected from his musicians, on the podium he seemed ravished by the music, his face in ever increasing ecstasy, utterly spent by the final note.Cooper learned to conduct with the same ferocity he brings to every detail of his portrayal - the frenetic Manhattan accent punctuated by the ever-present cigarette in his fingers or hanging from his lips. (\"Maestro\" should come with a surgeon general's warning of secondary smoke risks just from watching it.)\nAround the central performances, with stars like Sarah Silverman in the supporting cast, Cooper captures bygone eras with distinctive visual touches. He'll shoot dialogue shots from the distance, making the settings in Manhattan, Tanglewood or the Bernstein home in upstate New York as important as the words. The cinematography, following \"Oppenheimer's lead in black and white and color, is as lavish and bold as the musical score.The Bernsteins' Park Avenue duplex overlooking Central Park also became a hub of activity, awash in upscale liberal cocktail parties brilliantly immortalized by Tom Wolfe in \"Radical Chic and Mau-mauing the Flak Catchers.\" Here as on the podium, Bernstein was always \"on,\" always performing, the center of attention, sucking all the air out of the room.Considering that he essentially launched his career as the pretty boy in \"The Hangover's\" hapless quartet, Bradley Cooper continues to demonstrate himself as a consummate artist on both sides of the camera. \"Maestro\" nicely follows his remake of \"A Star Is Born,\" which also probed the tortured soul of music making.Creative genius, it seems, isn't always a gift for the handful of humans who possess it. In Bernstein's case it felt like an unachievable responsibility, a curse as much as a blessing.As a member of the audience that grew up watching Bernstein's Young People's Concerts in the '50s, he remains a mythic figure, more demigod than human to me. Steven Spielberg and Martin Scorsese are about my age. Similar feelings my have prompted them to sign on as producers of Cooper's film.Lydia Tár also grew up watching the Young People's Concerts, which shaped her ambition to become a conductor herself. Lydia, of course, wasn't real, but the brilliant creation of Cate Blanchett and writer-director Todd Fields in last year's similarly themed \"Tár.\" Ironically, it's Lydia rather than Lenny who is ultimately the more compelling screen character. His very human failings don't fit nearly as neatly into three-act structure as her fictional flaws did.True, Leonard Bernstein's artistic genius achieved immortality in his lifetime.But sucking all the air out of the room gets annoying after a while.",
    "144": "Started to watch this and completely disappointed. Figured that there would be a small group of people that would watch and give this movie high ratings. Even the worst movies ever made get great ratingsI went to watch Maetro expecting it to be some sort of documentary on the life of Leonard Bernstein.Stopped watching after about 45 min as this movie is so bad. Just bits and fragments of things that were all over.Had to google him to make any sense of timeline and his life. And don't think it is a spoiler to say that I was very confused about Bernstein's sexual orientation in watching this movie. Does he like men? Does he like woman?The main movie starts probably when he is in his early 20's but we don't know. And there is the rub. You will walk away from this movie disappointed if you were looking for a biography.And to my point about some people will watch or give positive reviews to anything. In the world of billion dollar plus box office hits.this movie earned about $300,000 worldwide - making it the bottom 1% for box office revenue making it to the bottom 1% of 14,000 movies tracked If I read correctly.",
    "145": "There are many reviews that bash the film for not giving any background into Bernstein's creative process, the description of the film (at least the one I read) clearly says it is a love story delving into his relationship with Felicia. For that reason Bernstein's conducting and composing serve as a backdrop rather than a focal point of the story.This is a story about a man tortured by conflicting desires. His deep abiding love for Felicia and how it collided with his love for men.The film masterfully shows how this conflict played out in his relationship with Felicia.I had no expectations when I began watching this film, other than it was a love story. In fact, it wasn't until after watching the movie that I learned Cooper wrote, directed as well as starred in the film.Bradley Cooper does an amazing job portraying Bernstein. The conflict Bernstein must have carried is skillfully presented to us through words, mannerisms, and powerful moments of silence. Cooper shows us the pain, the turmoil, and the heartache Bernstein tried to hide from the world and himself. Bernstein's children have raved about Cooper's portrayal of their father.Carey Mulligan is wonderful as Felicia. She gives emotional depth to the struggle Felicia lived through for loving a man who could not love her back with the same totality. She provides some of the best dramatic moments in the film.In spite of the forces pulling them apart, we see how the love they felt for one another bonded them together to the end.This is a beautiful love story that deserves far more praise than it is getting.",
    "146": "I had high hopes for this movie, I really did. But as I eagerly awaited Bradley Cooper directive debut, I ended up not being that excited for it's release. Releasing on the tail end of the year, as well as it being the holiday season, is a recipe for disaster. Keep in mind that this movie is not a Christmas movie by any stretch of the imagination and you'll see what I'm talking about. A biopic like that should have been so powerful to the point where it pushes your emotions to the limits. So aside from the sub-optimal release date, the movie as a whole didn't really deliver on what it could have been. Take The Music of Silence for comparison. Not a critically acclaimed movie, but at least a satisfying one. The trailer alone for that movie almost brought me to tears when I first saw it in theatres. It was undeniably a powerful masterpiece that took you for a rollercoaster of emotions. And that's exactly where Maestro failed to satisfy me. The movie felt lacking and the pacing seemed off. I know I can't delve too much into these intricacies since this is Bradley Cooper's debut in movie direction, but I can't look over how amateur the direction was. Even Cooper's performance didn't feel as powerful as in A Star is Born. It really seems like Bradley should've focused his energy on either acting or directing but not both. However, it's clear that there is a lot of potential here which leaves me excited for what's to come.",
    "147": "Giving this an 8/10 ratingBradley Cooper, writes, directs, stars in this epic tale of conductor-composer Leonard Bernstein and his actress - wife and muse of sorts, Felicia Montealegre Cohn Bernstein, plated by Carey Mulligan. Except Oscars nominations for both of them and this film.Cooper is totally immersed and you really can't see his face with the brilliant make up as Bernstein, old and young, he explodes into this role, like never before, and has too, if he had put a foot wrong, the film would fall so far down the rabbit hole, and that goes for Mulligan, she really, really is so good.Like, 'Napoleon', this is a love story at it's heart, but with the explosive brilliance that is Bernstein's music, the sound is superb, and the the photography, is more than right, it is a film of two halves, and it is sharp, soft, loud and has plenty of moments of did this really happen?! There is plenty of excess here, and I really did not know about a lot that happens in this film. The only reason it does not get a 9 rating is that does drag in the later half, I think some parts of this tale, might not of been necessary, but probably are right for the film, I leave that for you to decide. This is Musical chairs and romance.",
    "148": "And another music-themed Bradley Cooper movie that I really wanted to like, but ended up hating, and for similar reasons. At least I managed to watch \"Maestro\" through to the end, but only made it a third of the way through \"A Star is Born\".Perhaps the movie's most egregious failure is obsessing about Bernstein's bisexuality, promiscuity and attendant family dysfunction rather than focusing on his singular place in the pantheon of American musicians.I think it is the second or third scene where the \"Lenny's Gay!\" theme is introduced (awkwardly, involving a foot massage...), and it never lets up from there. For a movie titled \"Maestro\", and for anyone with the slightest awareness of Bernstein's enormous mid-century stature and popularity, it's shocking that only a handful of scenes even attempt to illustrate his musical genius... and do so poorly.My other major source of agita was the abysmally stilted dialogue. There is not a single line of dialogue that rings true, is profound or memorable, or advances a deeper understanding of any of the characters. In the words of a memorable Seinfeld episode, \"It's all just so much fluff\". Charitably, it may have been a \"style over substance\" artistic decision, intended to evoke the badinage one might hear at a chic Manhattan cocktail party, or the rapid-fire repartee in mid-century films and stage plays, but it simply comes across as pointless and contrived. And, in an effort to sound \"authentic\", most scenes involve two or more characters speaking over each other. I normally hate Netflix captions, but felt compelled to turn them on to \"de-muddle\" the dialog.Much has been made about the set design, period costumes and cinematography, which are all indeed first-rate, but these are marred and jarred by strange camera angles, framing and editing choices. It doesn't quite enter pretentious student film territory, but comes perilously close, and to say the film has \"pacing problems\" is an understatement.Finally, a two-hour movie about Bernstein and his music should have a phenomenal soundtrack, and musical cues that help advance the plot. Instead, the music direction is plagued by the same weak and amateurish production as the rest of the film.",
    "149": "Just watched Maestro and wow! Just wow!!It took me a short while to get into the zone of the film style, but once there, was totally gripped and engaged to the very end. I fear the low score reviews on here, are by people who possibly struggled with the complex nuances within the relationship and story told on screen (so wonderfully depicted by the two main characters). Such complexities often accompany the lives of great creative geniuses!The acting was superb\nThe costumes were beautiful, especially some of the early dresses - you knew exactly which era you were in\nThe makeup and particularly the prosthetics, were fantastic\nAnd of course, the music score was sublimeFitting such an immense lifetime and love, into two hours of viewing is no mean feat. It's well worthy of a 10/10."
}