{
    "0": "Denis Villeneuve has accomplished what was considered impossible for decades, to write and direct a faithful adaptation to the fantastic 1965 sci-fi novel by Frank Herbert. And I'm here to tell you, he has done it, he has actually done it.I was introduced to the world of dune in 1992 by playing the video game DUNE released that year. The story completely captivated me, so i decided to read the book. And to this day, it's one of the best stories I've ever read. A tale absolutely grand in scale, and filled with details, making it really hard to adapt for the big screen, even today with all the technology we have at our disposal.I saw the film made by David Lynch, a few years after i read the book, and about 10 years after it was released, and i didn't enjoy it much. The 1984 film completely fails at capturing the very essence of the novel, and feels shallow and unfocused.One of the main differences with this movie and the 1984 movie, is that Villeneuve has only centered on the first half of the first novel. And with over two and a half hours runtime, he is able to concentrate more on the small details, than Lynch ever could. But on the flip side, this also means that this movie has no conclusion.From reading the book, i know what comes next, i know how this story ends. But a lot of people watching this movie, especially those who haven't read the book, can obviously feel like they were watching a prologue to something great, that never happens. This is a very risky move by both Villeneuve and the production companies, because this can only work if part 2 is released to conclude the story. It's kind of how they did it with \"the lord of the rings\" trilogy.But, still, without a conclusion, what a massive blast of a movie this is. I've seen it in IMAX twice already, and the grand scale of everything, the sandworms, the space ships, the ornithopters, the buildings, the sound effects, the soundtrack, the locations. It's epic in every meaning of the word. And all of this without losing track of the deep relationships between the characters. This is a movie that manages to perfectly blend massive awesomeness with true heartfelt emotions.The actors are near perfectly cast, all carrying their roles really well, although i felt some of them didn't get enough screen time.This movie does follow the book quite closely, but some things has been changed and/or left out to fit in a movie format, i must admit that during my second IMAX viewing, i felt that Villeneuve maybe should have adapted this as a mini series instead. But that would have dramatically changed the grand scale of everything, but on the other hand, he could've dived deeper into the lore. Two and a half hours to adapt half of the first novel, is cutting it real tight. And with all the stuff you are constantly being fed throughout this movie, it can become somewhat difficult to follow and understand it all.But that being said, I had really high hopes for this film, i was one of those people hyped beyond belief. I've been waiting for this movie for about 30 years. And still, most of this movie is either as i imagined it myself, or better.What Denis Villeneuve has accomplished here, is actually quite astonishing, he has actually made DUNE. It's finally here, it's gigantic, and close to everything i asked for.The only big drawback, is as i mentioned, that this movie has no conclusion, it's two and a half hours of build-up to something great, that never happens, but it's still a huge epic packed with an awesome soundtrack, solid acting, fantastic CGI and sound effects and jaw dropping locations captured with brilliant cinematography. It's most definitively made for the big screen, absolutely no doubt about that.Denis Villeneuve has once again shown us he's a force to be reckoned with, a brilliant filmmaker, and one of the best of his generation, even one of the best of all time.I give this movie a 9 out of 10. We need part 2, we need it badly. This story deserves to be concluded. But if it never comes, i will just imagine the last half of the first novel with this movie as the template.",
    "1": "It's been some time since I've read the Frank Herbert novel, and I had already forgotten much of the story. However it wasn't a problem picking things up as characters and situations presented themselves in this film, so I'd have to say that was a plus for this viewer. The scope of this picture is quite outstanding, spanning as it does a complex and fragmented universe of worlds and kingdoms. Central to the story is the valued importance placed on a spice that's a preferred hallucinogenic for some, and for the elite, an important component required for interstellar travel. In the novel I believe it was something as common as cinnamon, but on the planet Arrakis, required an intensive mining operation to reclaim it from the barren desert soil in which it's found.The entire story is veiled with a mystical sort of ambiance in which the protagonist, Paul Atreides (Timothée Chalamet), learns of his destiny while obliquely being referred to as 'The One' of legend, a person who will come into great power. Quite honestly, the setting, costuming, characterizations and palace intrigue is all quite reminiscent of 'Star Wars', even if the original novel was written over a decade before George Lucas arrived on the scene. Even the hostile environment of Arrakis has the feel of Tatooine, with the appearance of the Shai-Hulud recalling the Sarlacc, one of Jabba the Hutt's favorite pets.What surprised me with this first installment of the Dune saga was how well director Denis Villeneuve managed to condense the epic scope of a massive novel onto film, even if half of the story is yet to be told. The movie incorporates the most critical elements of the novel into a narrative that works really well. Even though I actually did enjoy the 1984 version directed by David Lynch, this one proves to be more inclusive of events in the novel, and I look forward to a successful conclusion to the saga in due time.",
    "2": "Greetings from Lithuania.\"Dune. Part I\" (2021) was amazing cinematic experience. This is a movie that demands to be seen on a big screen, no less. I haven't read a book nor seen previous version of it, therefore all things that i saw story wise were fresh for me. And i won't lie i did felt to be lost here and there, but at the end of the day the storyline was clear.The visual side of this movie was staggering. This is a 100% movie going experience. Special effects looked as real as it gets - if you enjoyed visual side of \"Blade Runner 2049\" you will get same here - grandiose sets, design, sound and all technical stuff - this movie at every scene looked breathtaking. Yet i wished cinematography was done by Roger Deakins, but still it was solid (but could been even better). Acting was very good by all involved - you can't ask for more from such a cast.Overall, few reasons why i did not gave it 10/10 is because it did felt like a set up of a story more then once - way more then once. Also there are some pacing issues here and there. And finally, this movie will loose ~80% of its visual side when watched at home in my opinion, this is a real movie going experience. But at the end i liked it very much and would like to see Part II - fingers crossed!",
    "3": "Having read the book a hundred years ago, it took some time to begin to understand what was going on. If there is a criticism that many share, it is the pacing of the first part of the film. It needed something to set the scene for us, to show us who the strong and the weak were. I'm not much for narration (show me, don't tell me), but it may not have been a bad idea. The scenes are magnificent with special effects off the chart. Many desert travel scenes are quite endless. How do you spruce up a desert. I thought the sand worms were a little one dimensional. I know there is another film down the road.",
    "4": "Denis Villeneuve directs this remake of the Frank Herbert classic sci-fi. It's the first part of two movies. Timothée Chalamet is the lead as Paul Atreides. The emperor has given his family the desert planet Arrakis where the most important spice is mined. It's a trap and everyone knows it.I've never read the book. I have seen the David Lynch version and the Sci Fi movies. I do miss some of the Lynchian weirdness. This version feels more Earth-bound without the weirdness. Arrakis has a lot more middle eastern influences. House Atreides is more Scottish. I do wish that they get rid of the damn bagpipes. One hopes that they would get rid of that noise in a few thousand years. As for Chalamet, he is the perfect prettiness for the role. He looks too pretty to be believed as a fighter which is exactly what every other character comments on about him. He has the ethereal look of an angelic hero in an ancient classical Greek story. I'm not sure if newbies could get lost in this labyrinthian world. It's not really that complicated. I think Villeneuve has made the right movie. He puts his skills into the epic feel of this franchise. It feels right... coming from a non-book-reader.",
    "5": "I have seen many reviewers write that this movies has no ending. That's true. BUT: The ending Denis chose seems perfect to me. There is no cliffhanger, no big question that I needed immediate answers to. This movie is about house Atreides being betrayed and the path this sets Paul on. This path leads him to his new home: Arrakis.In that sense, this movie had enough of an ending for me to not feel dissatisfied.That said, I will probably go and read the book instead of waiting 3 years (or forever) for the conclusion of this story arc.This is a movie of gigantic scale that feels so familiar, yet so fresh and and unique in it's own way. It's a 2.5 hour, polished piece of art and spectacle.I cannot recommend it more, and if you're hesitant because it's just part 1, don't be.I would give this an easy 9.5/10.",
    "6": "More so than even 'Lord of the Rings', Frank Herbert's 'Dune' is an extremely difficult story to translate to film. All of the novel's many, many moving parts require the kind of explanation that just isn't possible in the format. Therefore you have to find a kind of cinematic shorthand the way David Lynch did with his polarizing 1984 adaptation. Or else you go w/a mini-series, which allows for a greater runtime ala the SyFy network's 2000 attempt. Here the solution was to cut the novel essentially in half. Unfortunately that creates an entirely different problem. Half a story simply isn't satisfying.The film itself is handsomely shot and the f/x are strong, though I dare say the design work is rather bland. The score by Hans Zimmer is an oppressive yet forgettable kit-bash of the \"exotic\" white noise that litters so many fantasy and sci-fi films in the 21st century. The characters are under-cooked, but the actors themselves are by and large solid.As someone who has read the novel three times I have a difficult time deciding if the uninitiated will have even an inkling of what's going on. But even if they do, I can't imagine that what we get here will ultimately be satisfying in a substantive way.",
    "7": "About an hour of back story that really made no sense. The Atreades are on their own planet, so they take about a thousand troops to the spice planet to mine for spice, at the request of the Emperor. When the colony is attacked, that is the end of the Atreades? What happened to their home planet?A lot of the back-story did not make sense. Even worse, the pace of this movie was incredibly slow and boring. The story of the Fremen is not explained. Why are the Harkkunen evil? That is not explained. The Harkkunen have been making gigantic amounts of money from their monopoly on the spice planet, so why are they bitter?I had a lot of questions. The dialogue was not very helpful. The Mother and Grandmother have special powers, why? Nothing is explained about their sect, or why French lead actor, Chalamet, might be \"The One.\"There is not much action until the last 40 minutes or so. The fact that the family doctor can turn off the alarm system and shields to the entire colony was incredibly lame. That nobody was awake to know they were being attacked was even more lame. That King Atreades had absolutley no security staff, and got his ass kicked by the skinny doctor was pathetic.James Brolin is the top fighter for the Atreades clan, and he does almost nothing in this movie. Jason Momoa is the other top warrior and he is marginal. Both of these actors are wasted in this movie. They basically do nothing except to encourage the French kid with standard cliches.Zendaya shows up in the same visions that are repeated numerous times in the movie. There is a constant mix of the Chalamet kid's visions with the actual reality, and that is confusing.",
    "8": "I just returned from a screening, and WOW! It's visually stunning, the soundtrack by Hans Zimmer is majestic, the acting is spot on! The pacing might seem a little slow by todays standards, but it never gets boring. And I actually find it really refreshing to see serious SciFi for adults, without bangs or a \"comic relief\" every other second.I've read the book about four or five times more than 20 years ago. And from my memory (I will refresh it soon) the movie stays true to the story of the book and, more importantly, its general feeling.Opposed to many other people, I also quite liked David Lynchs interpretation, despite all of its shortcomings. Because one thing that Lynch got right, was the \"psychedelic\" nature of the book.And that's my only gripe with Denis Villeneuves adaptation, and the reason why I don't give it 10 stars: While he hints at the mindaltering properties of spice, he never explores the psychedelic aspects of the book as deep as I'd like them to be explored.Here's my hope for part two. If he creates a second part, and manages to keep up the quality while at the same time not shying away from the psychedelic underpinnings of the source material. He will have created a two part masterpiece.",
    "9": "Watching director Denis Villeneuve's groundbreaking adaptation of Frank Herbert's classic science fiction novel \"Dune\" is like feasting on an all-you-can-eat buffet. You can gorge yourself on combatants and conspiracies galore during its spartan 156-minute runtime. Unlike its ill-fated predecessor, David Lynch's critically reviled \"Dune\" (1984), which shoehorned Herbert's gargantuan magnum opus into a procrustean 136-minute escapade, Villeneuve has the good sense not to pile everything into one film. Instead, this $165 million reboot delivers only half of the chronicle, while we must bide our time until the sequel. Some sci-fi fans may cringe at this prospect, but Warner Brothers refused to bank roll the sequel before \"Dune\" generated some box office traction. Mind you, sitting for two-hours and thirty-six minutes requires not only purpose but also patience. Meantime, Villeneuve retreads several Lynch scenes, but does it with greater scope and spontaneity. You cannot help but be caught up by the rollercoaster blend of white-knuckled cliffhanger heroics and Byzantine political intrigue. Although classified as science fiction, \"Dune\" never degenerates into a juvenile \"Buck Rogers\" space opera. \"Star Wars: Rogue One\" lenser Greg Fraser depicts these larger-than-life characters against surreal landscapes in sprawling picturesque murals. Surrounding Timothée Chalamet, who toplines as the hero, is a formidable cast consisting of Oscar Isaac, Josh Brolin, Rebecca Ferguson, Jason Momoa, Javier Bardem, Dave Bautista, and Stellan Skarsgard. Overall, \"Dune\" raises the standards for sci-fi blockbusters. Nevertheless, the filmmakers don't bewilder the audience with narrative overload. Clearly, Villeneuve has surpassed his earlier outing \"Blade Runner 2049\" (2017), and one can only wish him greater success with this sequel.Imagine a mash-up of \"Star Wars\" and \"Game of Thrones,\" and you'll have a clue about what ensues. Specifically, \"Dune\" takes place in the year 10,191. This tour de force saga of clashing empires unfolds on the bleak desert planet of Arrakis. This savage, sun-scorched world is the only source in the universe for a unique mineral called spice. Not only does interstellar space travel hinge on spice, but it also is a psychedelic drug that heightens awareness and lengthens life. The evil Baron Vladimir (Stellan Skarsgård of \"Good Will Hunting\") of the House of Harkonnen, who amounts to a smaller version of Jabba the Hutt, has reaped an obscene fortune in spice from Arrakis over the last 80 years. Now, the Padishah Emperor Shaddam IV removes the Baron and replaces him with a rival, Duke Leto Atreides (Oscar Isaac of \"Ex-Machina\") of the mighty House of Atreides, who hails from the ocean planet of Caladan. Accompanied by his consort Lady Jessica (Rebecca Ferguson of \"Doctor Sleep\") and their teenage son, Paul (Timothée Chalamet of \"Lady Bird\"), the Duke arrives on Arrakis with his aide, Gurney Halleck (Josh Brolin of \"Sicario\"), and a vast army. Leto suspects the corrupt Emperor may be setting him up for failure.Pandemonium erupts soon after Leto has taken over the spice mining operation. Earlier, the Duke had vowed to forge an alliance with the natives. Known as the Fremen, this disgruntled nomadic race resides in Arrakis's deep caverns and conducts campaigns like guerrilla warriors against the spice miners. Suffering dreadfully under the Baron, the Fremen expect similar treatment from Leto. The Duke dispatches a scout, Duncan Idaho (Jason Momoa of \"Aquaman\"), to embed himself among them and win their hearts and minds. Swathed in hooded white cloaks, this mahogany-skinned tribe has dazzling cobalt blue eyes from using spice. A blue-eyed babe haunts Paul's dreams. Meantime, the mining equipment Leto inherited from the Baron is in rough shape. If the broiling temps on the surface weren't bad enough, prodigious sandworms--some as long as 13-hundred feet--cruise beneath the shifting sands like great white sharks. These leviathans can wrap their elastic mouths, bristling with zillions of wicked, razor-sharp fangs, around an entire spice harvesting machine. Eventually, treachery within Leto's palace topples his rule, and the Baron's soldiers annihilate Atreides' army. Miraculously managing to escape, young Paul takes refuge with the Fremen and ponders a rebellion against the Baron.Comparisons between \"Dune\" and \"Star Wars\" are inevitable. Indeed, both films share certain formulaic scenes which seem virtually interchangeable. An empire-building yarn with anti-colonial sentiments, \"Dune\" takes itself far more seriously than \"Star Wars.\" When Paul watches his mentor perish, our hero suffers as tragically as Luke when he witnessed the demise of Obi-wan Kenobi. \"Dune\" differs, too, because it is a sword and sandal saga about supernatural critters. Arrakis makes Tatooine seem like a beach resort. Villeneuve and \"Prometheus\" writer Jon Spaihts and \"A Star Is Born\" scripter Eric Roth don't overwhelm the audience with volumes of exposition that cluttered up the Lynch film. Instead, they parcel out exposition and use it to foreshadow events. The warfare is conducted with ancient as well as futuristic weapons, with emphasis on ancient weapons. The dragonfly helicopters-known as ornithopters-look exciting. The crisp dialogue is both pointed and compelling. Villeneuve and company never cut our underdog heroes any slack in this initial bloodthirsty chapter, and the evil Baron maintains the upper hand despite minor setbacks like a near-death experience. As villains go, the grotesquely fat Baron makes an admirable but unscrupulous adversary. Josh Brolin and Jason Momoa wield their weapons like old hands. Unlike Lynch, Villeneuve doesn't rub our noses in unsavory violence. Nonetheless, the battles are savage without being sadistic. Hans Zimmer's brawling orchestral score with native choral interludes enhances the atmosphere. Altogether, \"Dune\" qualifies as the first truly great science fiction classic of the 21st century with a coming-of-age hero driven by prophetic dreams he cannot fathom.",
    "10": "Dune is an experience made for cinema. Do yourself a favor, spend your money and don't wait for it to appear on streaming. The Visuals, music, and sheer epicness are overwhelming. These alone are worth your watch.But that's not all. Characters, actors, set pieces, plot, and the whole production value is also top-notch.I haven't read the books so I don't know if the film stays true to the source material. But other reviews hint that this is the case. So even Fans will get their desired dose.To put it short: dune is a modern masterpiece and a Must have for any sci fi fan.",
    "11": "A movie made for the big screen. The sound design is great and Hans Zimmer is awesome as always. The visuals are pretty good too, considering everything plays out on a rather mundane sand planet. The visual effects are perfect.Dune is like Villeneuve's other movies rather slow and I almost fell asleep a few times, but other than that it was an awesome experience.The casting was great and the acting was on point. The story was very interesting and made me want to see more.",
    "12": "I read a number of books of the Dune series when I was a kid. I somehow forgot, but when I saw this movie I recalled so much. Like the aircraft that fly like dragon flies. Just amazing how this movie captures the atmosphere of the book series. As with Blade Runner the scenes take their time to sink in, it's visually stunning. The movie is long and there was no pause, but I was amazed how quickly time passed. I was captured and now I must wait long months for episode 2.",
    "13": "There is probably no point in warning about spoilers for this film. You've probably read the book or seen either the 1984 Dino DeLaurentis version or the 2000 Sci-Fi mini-series.... If you've seen either one of those, you've seen this movie. This movie only covers half the story, the sequel we'll probably never get to see will cover the other half.So how does it stack up? Not well, in my opinion. It's a loud, dull action movie, with an ear-splitting soundtrack. It has all the scenes you might have seen if you watched either of those two versions, but didn't do them nearly as well.At two and a half hours, it drags on. The Lynch version of the film was 137 minutes, and got the whole story in. This film leaves key aspects out, and only tells half the story, and it just goes on and on and on.To start, let's talk about characters. DeLaurentis got a cast of largely unknowns back then, many of whom went on to distinguish themselves. Kyle MacLachlin, Patrick Stewart, Dean Stockwell, Sean Young. Heck, even the little girl actress, Alicia Witt, went on to have a career as an adult. This movie uses a cast of people you've heard of, and their screen time is often based on \"I know who that is.\" Other characters, more critical ones, were kind of shuffled to the side.I'll give two examples. A key point in the book is that the betrayal by Dr. Yeuh, (played here with no charisma by Cheng Chen) because as a Suk Physician, taking a human life is against his conditioning. No build up, no nothing, he just does it.On the other hand, because Duncan Idaho is played by Jason Momoa, he gets a lot more screen time than his presence in the book. (Duncan's clones become a much more important part of later books, but that's neither here nor there.) His final fight scene goes on interminably here, while they were quickly brushed over in the previous versions.Similarly, while Peter DeVries is a key player in the book, here they don't even mention him by name, and he's just \"Henchman who gets poisoned\". Other characters are omitted altogether, including Emperor Shaddam, Princess Irulan and Feyd Ruatha. Concepts such as the Mentats, Guild, Bene Geserit, are kind of glossed over to get to those sweet, sweet action sequences.The movie rises and falls on the actor who plays Paul Atreides... and again, he's actually closer to the age that the character is supposed to be at the beginning of the book, but he comes off as a little Emo.Again, trippy as it was, the 1984 version did this better. The Sci-Fi Channel did it better...\nNow, this film really LOOKS good. The visuals are immersive. But without strong characters and story to back them up, what's the point? It's almost like watching a Transformers movie. The thing is, they HAD strong characters and a story... they just didn't use them.",
    "14": "From Hans Zimmers soundtrack to the cinematography.Dune part 1 is everything i hoped it would be.As a fan of the books, i can say that this is the best adaptation we could have wanted. Denis Villeneuve has shown this generation what cinema is supposed to be. If you like the books than do not hesitate to go and watch.It is as of now, movie of the year. A must see.",
    "15": "Dune is technically perfect: direction, cinematography, score, acting, visual effects. It is truly a great cinematic experience and if you are interested you HAVE to go watch it in a theatre because it's visually majestic and the big screen helps fully enjoying it. Even the audio is important with a inspired score and great sounds in general and the big speakers of a theatre can contribute to a even better immersion. Dune is technically great as I said and it should be viewed but its \"part one\" nature is what could let down some viewers or maybe, as it has happened to me, not to fully appreciate the movie. In particular the protagonist has his arc and some important things happen but the movie does not tell a complete story and the ending seems more like the finale of a episode of a tv show rather than one of a movie and I'm already anxiously waiting for the sequel. In conclusion Dune is certainly worth watching, especially in a theatre, even just for its aesthetics but be aware that it is not a conclusive movie and be prepared for that.",
    "16": "Worried like every time a great material is adapted it usually does not deliver on expectation.Here Dennis Villeneuve did the impossible: staying faithful to a complex and rich universe and a fantastic story with a masterful demonstration of direction, stunning visuals and solid acting.Oscar Isaac, Stellan Skasgard and Javier Bardem in particular are impressive while Chalamet was solid.My only (slight) issue is the fact that Lady Jessica is too emotional compared to the original character, and that we never see the emperor and the Navigators.I was afraid that the sex and race swap of Liet would feel forced and woke but it is well done and feels natural in the context of the film.So hat's off Dennis Villeneuve, this is another masterpiece under your belt.",
    "17": "+ Massive dimensions to highlight the Desert Planet and the Universe around it\n+ Epic music / sound supporting the epic scenes\n+ Book readers can be proud how the story is presented\n+ Excellent use of slow frames and bringing details to the forefront\n+ Cast includes multiple actors / actresses who fill the screen\n+ Select 3D if possible, it supports the movie and I forgot that I have 3D glassesFear is the mind-killer.",
    "18": "To me this movie really is 10/10 and i'm not afraid to say it. Easily my favorite movie of 2021. There's no competition even. Visually stunning, Action was good, well directed. Acting was very believable.I haven't read the book and i really liked the movie. Made me curious to learn more about characters and world, but it was very solid first chapter in my opinion. I'm pretty sure others who haven't read the book can get hooked as well, because even if you don't know anything about it, who doesn't like epic looking spaceships and giant sandworms?To elaborate even further, i think this movie will win over lots of Star Wars fans, who have been disappointed in Star Wars in recent years. Unlike Disney Star Wars, Dune is way more mature and has actually deep lore and interesting characters.",
    "19": "This film was quite literally one of the worst films I have ever saw. It was 2 and a half hours of nothingness. Almost nothing happened throughout but people standing around having conversations with each other. Which also weren't interesting at all.I really wanted to like this as I love Denis Villeneuve movies.",
    "20": "I enjoyed the entire experience from beginning to end. It was done better than anyone couldve asked for and better than i imagined. There are stuff in the book that cant be adapted but the movie did well without it. My friends who hasnt read the book was impressed and loved it so i guess im not too biased in comparison within my group.My only dissapointment was it ended too early. Its the fastest 2.5 hours movie ive watched in memory and i couldve easily watched both parts together easily.",
    "21": "I really am amazed by how they could get Dune so wrong 1984 and so right this time! I'm not beating on Lynch - I love some of his work (Mulholland drive is a masterpiece). But his version of Dune is revolting! This was beautiful, dystopic, haunting and perfectly paced. Ant to all you that just have to criticise 'cause you can. I guess you just don't get directing where the actors don't babble and overact. So you get bored if the dialog i at it's minimum and the actors are acquired to act with their faces and body-language. To bad for you! I was stunned and at the edge of my seat the entire length of the movie. It's a masterpiece!!",
    "22": "This film will never compete with the previous older adaptation of Frank Herbert's novel, the eponymous film by David Lynch. In fact, most dramatic elements of this story are replaced by digitalized special effects. The actors are like pawns on the screen, and they have little to say. The music accompanying the visual special effects replaces most of the time any elaboration of the dialogue or the characters.It is a shame for Timothée Chalamet who is underused some will say, though we do not know yet what he could really do in a dense and deep film, like the second part of the book \"Call me by your name,\" though this second part being some ten years after the first part, it might be difficult for Timothée Chalamet to play that particular part of the story.I just hope he may grow on the screen and have a career that could compare with DiCaprio's who was also naïve, superficial, and sort of stiff in his very first screen productions. Does Timothée Chalamet have the potential of a future star? Maybe, but I can't really see it, feel it in this film and in \"Call me by your name\" in which the easy provocative sexual side of the character was in many ways erasing the rest, though the teenager there was sexually depicted as naïve, superficial, and unable to be a real predator, the real predator he was supposed to be.So, watch it with a good one hundred grams of salt in your pocket, and keep the salt in your pocket, please.Dr. Jacques COULARDEAUVERSION FRANÇAISECe film ne rivalisera jamais avec la précédente adaptation plus ancienne du roman de Frank Herbert, le film éponyme de David Lynch. En fait, la plupart des éléments dramatiques de cette histoire sont remplacés par des effets spéciaux numérisés. Les acteurs sont comme des pions sur l'écran, et ils ont peu à dire. La musique qui accompagne les effets spéciaux visuels remplace la plupart du temps toute élaboration du dialogue ou des personnages.C'est dommage pour Timothée Chalamet qui est sous-utilisé diront certains, bien que nous ne sachions pas encore ce qu'il pourrait vraiment faire dans un film dense et profond, comme la deuxième partie du livre \"Appelle-moi par ton nom\", bien que cette deuxième partie étant quelque dix ans après la première partie, ce pourrait être difficile pour Timothée Chalamet de jouer cette section particulière de l'histoire.J'espère simplement qu'il pourra grandir à l'écran et avoir une carrière comparable à celle de DiCaprio, qui était également naïf, superficiel et un peu rigide dans ses toutes premières productions à l'écran. Timothée Chalamet a-t-il le potentiel d'une future star ? Peut-être, mais je ne peux pas vraiment le voir, le sentir dans ce film et dans \"Appelle-moi par ton nom\" dans lequel le côté sexuel facilement provocateur du personnage effaçait à bien des égards le reste, bien que l'adolescent y soit dépeint sexuellement comme naïf, superficiel et incapable d'être un vrai prédateur, le vrai prédateur qu'il était censé être.Alors, regardez-le avec une bonne centaine de grammes de sel dans votre poche, et gardez bien le sel dans votre poche, s'il vous plaît.Dr Jacques COULARDEAU.",
    "23": "Finally, a Dune worthy of Herbert's vision. Like Blade Runner 2049, it took me until the following day to fully digest the assault on the senses. The difference this time around, is that it reminds me of certain Euro art films from the 70s where there would be long close-ups of expressionless faces. Perhaps Villeneuve was inspired by Jodorowsky's Dune in the 70s that was never made, that was supposed to have Pink Floyd composing the soundtrack? Otherwise, it is very dark and brooding like Blade Runner 2049, and very much like the book and the mini-series (script-wise), but nothing like the 80s movie. Jessica is a little more vulnerable compared to her 'regalness' in the novel - at least, that's how I remember her from my reading the trilogy three times. And one person has changed gender! Dr. Liet-Kynes is now played by a woman. Regardless of gender, Max Von Sydow in the 80s film stands above the rest, because it is Max Von Sydow and his uniquely quircky personality that can give an added dimension to any role. If WB doesn't allow for a part II, I will never see another WB film again.",
    "24": "I have neither read the book (yet) nor seen the old movie, but this one was really, really good. It felt like a realistic, dark and yet beautiful story-world, emotionally intelligent, suspenseful and visually stunning. I did read other reviews before watching this and saw several that called this film \"emotionally hollow\". Honestly, what movie did they watch??! Or is the problem rather that those viewers themselves were emotionally hollow? I think it was emotionally rich. Just Beautiful. Makes me want to read the book next. Go watch it.EDIT: I have read the book now - it does it justice in all the right places and the few changes were wise choices (eg. The multiple visions of Chani and making Kynes a black woman - the book IS old after all and women or people of colour need more representation). So - well done! Very well done!",
    "25": "I really hope the filmmakers of the Silmarillion movie (if it ever gonna appear) will do such a nice adaptation as did Villeneuve with this outstanding Dune.And for those who think Dune is very long I can only recommend TikTok.",
    "26": "This was a hopefully awaited new dimension of an intelligent blockbuster movie and a solid proof that arthouse and entertainment don't need to be contradictory. Villeneuve's vision is strong, emotionally deep, visually stunning and powerful, his seriousness and pathos is mind provoking and innovative. Chalamet's coming of age is touching, he portraits his character with beauty, innocence and sensitivity. I'd love to see how the story and the characters will be developed in a possible second part.",
    "27": "I was just as stunned the second time as the first one. I've started to read the book and in my opinion they did a great job translating the book into the movie.I just feel like this is the movie you have to see in the cinema. Small screen (and an average computer screen is small , unless you have one of those giant outrageously expensive flat TVs then maybe you'd be fine) just won't cut it.Also side note, I usually hate 3D imax and I was very skeptical at first but after seeing it I'm amazed of how well it's done and how good it looked. Worth it.Truly a masterpiece! Give it a go and decide for yourself.",
    "28": "In my opinion, this is not the masterpiece I had hoped for. I was never truly lost in the universe of the movie, forgetting time or consumed by the characters.However, DV proves once again, that he is the most interesting filmmaker in the film industry right now. He refuses to comply with the standard Hollywood narratives. His movies are original and unique. Like his masterpiece Sicario. He takes you on a ride, where you never know what's coming. You can't predict his storylines.So. I'm still onboard. Excited to watch part 2. Maybe still, DV's Dune will turn out a masterpiece in the end.",
    "29": "Finally someone has understood how to give this monumental and at the same time profound story an adequate visual form. And not only that, also the intensity and epicness with which everything plays out, from the quiet to the loud moments. The feeling of the drama in the making until the great catastrophe. The subtle to aggressive manifestation of the witchcraft forces.Together with the fantastic actors and Zimmer's music simply the highest pleasure and worth at least one more visit to the cinema before it comes into the home media library.",
    "30": "There is probably no point in warning about spoilers for this film. You've probably read the book or seen either the 1984 Dino DeLaurentis version or the 2000 Sci-Fi mini-series.... If you've seen either one of those, you've seen this movie. This movie only covers half the story, the sequel we'll probably never get to see will cover the other half.So how does it stack up? Not well, in my opinion. It's a loud, dull action movie, with an ear-splitting soundtrack. It has all the scenes you might have seen if you watched either of those two versions, but didn't do them nearly as well.At two and a half hours, it drags on. The Lynch version of the film was 137 minutes, and got the whole story in. This film leaves key aspects out, and only tells half the story, and it just goes on and on and on.To start, let's talk about characters. DeLaurentis got a cast of largely unknowns back then, many of whom went on to distinguish themselves. Kyle MacLachlin, Patrick Stewart, Dean Stockwell, Sean Young. Heck, even the little girl actress, Alicia Witt, went on to have a career as an adult. This movie uses a cast of people you've heard of, and their screen time is often based on \"I know who that is.\" Other characters, more critical ones, were kind of shuffled to the side.I'll give two examples. A key point in the book is that the betrayal by Dr. Yeuh, (played here with no charisma by Cheng Chen) because as a Suk Physician, taking a human life is against his conditioning. No build up, no nothing, he just does it.On the other hand, because Duncan Idaho is played by Jason Momoa, he gets a lot more screen time than his presence in the book. (Duncan's clones become a much more important part of later books, but that's neither here nor there.) His final fight scene goes on interminably here, while they were quickly brushed over in the previous versions.Similarly, while Peter DeVries is a key player in the book, here they don't even mention him by name, and he's just \"Henchman who gets poisoned\". Other characters are omitted altogether, including Emperor Shaddam, Princess Irulan and Feyd Ruatha. Concepts such as the Mentats, Guild, Bene Geserit, are kind of glossed over to get to those sweet, sweet action sequences.The movie rises and falls on the actor who plays Paul Atreides... and again, he's actually closer to the age that the character is supposed to be at the beginning of the book, but he comes off as a little Emo.Again, trippy as it was, the 1984 version did this better. The Sci-Fi Channel did it better...\nNow, this film really LOOKS good. The visuals are immersive. But without strong characters and story to back them up, what's the point? It's almost like watching a Transformers movie. The thing is, they HAD strong characters and a story... they just didn't use them.",
    "31": "From Hans Zimmers soundtrack to the cinematography.Dune part 1 is everything i hoped it would be.As a fan of the books, i can say that this is the best adaptation we could have wanted. Denis Villeneuve has shown this generation what cinema is supposed to be. If you like the books than do not hesitate to go and watch.It is as of now, movie of the year. A must see.",
    "32": "Dune is technically perfect: direction, cinematography, score, acting, visual effects. It is truly a great cinematic experience and if you are interested you HAVE to go watch it in a theatre because it's visually majestic and the big screen helps fully enjoying it. Even the audio is important with a inspired score and great sounds in general and the big speakers of a theatre can contribute to a even better immersion. Dune is technically great as I said and it should be viewed but its \"part one\" nature is what could let down some viewers or maybe, as it has happened to me, not to fully appreciate the movie. In particular the protagonist has his arc and some important things happen but the movie does not tell a complete story and the ending seems more like the finale of a episode of a tv show rather than one of a movie and I'm already anxiously waiting for the sequel. In conclusion Dune is certainly worth watching, especially in a theatre, even just for its aesthetics but be aware that it is not a conclusive movie and be prepared for that.",
    "33": "Worried like every time a great material is adapted it usually does not deliver on expectation.Here Dennis Villeneuve did the impossible: staying faithful to a complex and rich universe and a fantastic story with a masterful demonstration of direction, stunning visuals and solid acting.Oscar Isaac, Stellan Skasgard and Javier Bardem in particular are impressive while Chalamet was solid.My only (slight) issue is the fact that Lady Jessica is too emotional compared to the original character, and that we never see the emperor and the Navigators.I was afraid that the sex and race swap of Liet would feel forced and woke but it is well done and feels natural in the context of the film.So hat's off Dennis Villeneuve, this is another masterpiece under your belt.",
    "34": "+ Massive dimensions to highlight the Desert Planet and the Universe around it\n+ Epic music / sound supporting the epic scenes\n+ Book readers can be proud how the story is presented\n+ Excellent use of slow frames and bringing details to the forefront\n+ Cast includes multiple actors / actresses who fill the screen\n+ Select 3D if possible, it supports the movie and I forgot that I have 3D glassesFear is the mind-killer.",
    "35": "To me this movie really is 10/10 and i'm not afraid to say it. Easily my favorite movie of 2021. There's no competition even. Visually stunning, Action was good, well directed. Acting was very believable.I haven't read the book and i really liked the movie. Made me curious to learn more about characters and world, but it was very solid first chapter in my opinion. I'm pretty sure others who haven't read the book can get hooked as well, because even if you don't know anything about it, who doesn't like epic looking spaceships and giant sandworms?To elaborate even further, i think this movie will win over lots of Star Wars fans, who have been disappointed in Star Wars in recent years. Unlike Disney Star Wars, Dune is way more mature and has actually deep lore and interesting characters.",
    "36": "This film was quite literally one of the worst films I have ever saw. It was 2 and a half hours of nothingness. Almost nothing happened throughout but people standing around having conversations with each other. Which also weren't interesting at all.I really wanted to like this as I love Denis Villeneuve movies.",
    "37": "I enjoyed the entire experience from beginning to end. It was done better than anyone couldve asked for and better than i imagined. There are stuff in the book that cant be adapted but the movie did well without it. My friends who hasnt read the book was impressed and loved it so i guess im not too biased in comparison within my group.My only dissapointment was it ended too early. Its the fastest 2.5 hours movie ive watched in memory and i couldve easily watched both parts together easily.",
    "38": "I really am amazed by how they could get Dune so wrong 1984 and so right this time! I'm not beating on Lynch - I love some of his work (Mulholland drive is a masterpiece). But his version of Dune is revolting! This was beautiful, dystopic, haunting and perfectly paced. Ant to all you that just have to criticise 'cause you can. I guess you just don't get directing where the actors don't babble and overact. So you get bored if the dialog i at it's minimum and the actors are acquired to act with their faces and body-language. To bad for you! I was stunned and at the edge of my seat the entire length of the movie. It's a masterpiece!!",
    "39": "This film will never compete with the previous older adaptation of Frank Herbert's novel, the eponymous film by David Lynch. In fact, most dramatic elements of this story are replaced by digitalized special effects. The actors are like pawns on the screen, and they have little to say. The music accompanying the visual special effects replaces most of the time any elaboration of the dialogue or the characters.It is a shame for Timothée Chalamet who is underused some will say, though we do not know yet what he could really do in a dense and deep film, like the second part of the book \"Call me by your name,\" though this second part being some ten years after the first part, it might be difficult for Timothée Chalamet to play that particular part of the story.I just hope he may grow on the screen and have a career that could compare with DiCaprio's who was also naïve, superficial, and sort of stiff in his very first screen productions. Does Timothée Chalamet have the potential of a future star? Maybe, but I can't really see it, feel it in this film and in \"Call me by your name\" in which the easy provocative sexual side of the character was in many ways erasing the rest, though the teenager there was sexually depicted as naïve, superficial, and unable to be a real predator, the real predator he was supposed to be.So, watch it with a good one hundred grams of salt in your pocket, and keep the salt in your pocket, please.Dr. Jacques COULARDEAUVERSION FRANÇAISECe film ne rivalisera jamais avec la précédente adaptation plus ancienne du roman de Frank Herbert, le film éponyme de David Lynch. En fait, la plupart des éléments dramatiques de cette histoire sont remplacés par des effets spéciaux numérisés. Les acteurs sont comme des pions sur l'écran, et ils ont peu à dire. La musique qui accompagne les effets spéciaux visuels remplace la plupart du temps toute élaboration du dialogue ou des personnages.C'est dommage pour Timothée Chalamet qui est sous-utilisé diront certains, bien que nous ne sachions pas encore ce qu'il pourrait vraiment faire dans un film dense et profond, comme la deuxième partie du livre \"Appelle-moi par ton nom\", bien que cette deuxième partie étant quelque dix ans après la première partie, ce pourrait être difficile pour Timothée Chalamet de jouer cette section particulière de l'histoire.J'espère simplement qu'il pourra grandir à l'écran et avoir une carrière comparable à celle de DiCaprio, qui était également naïf, superficiel et un peu rigide dans ses toutes premières productions à l'écran. Timothée Chalamet a-t-il le potentiel d'une future star ? Peut-être, mais je ne peux pas vraiment le voir, le sentir dans ce film et dans \"Appelle-moi par ton nom\" dans lequel le côté sexuel facilement provocateur du personnage effaçait à bien des égards le reste, bien que l'adolescent y soit dépeint sexuellement comme naïf, superficiel et incapable d'être un vrai prédateur, le vrai prédateur qu'il était censé être.Alors, regardez-le avec une bonne centaine de grammes de sel dans votre poche, et gardez bien le sel dans votre poche, s'il vous plaît.Dr Jacques COULARDEAU.",
    "40": "Finally, a Dune worthy of Herbert's vision. Like Blade Runner 2049, it took me until the following day to fully digest the assault on the senses. The difference this time around, is that it reminds me of certain Euro art films from the 70s where there would be long close-ups of expressionless faces. Perhaps Villeneuve was inspired by Jodorowsky's Dune in the 70s that was never made, that was supposed to have Pink Floyd composing the soundtrack? Otherwise, it is very dark and brooding like Blade Runner 2049, and very much like the book and the mini-series (script-wise), but nothing like the 80s movie. Jessica is a little more vulnerable compared to her 'regalness' in the novel - at least, that's how I remember her from my reading the trilogy three times. And one person has changed gender! Dr. Liet-Kynes is now played by a woman. Regardless of gender, Max Von Sydow in the 80s film stands above the rest, because it is Max Von Sydow and his uniquely quircky personality that can give an added dimension to any role. If WB doesn't allow for a part II, I will never see another WB film again.",
    "41": "I have neither read the book (yet) nor seen the old movie, but this one was really, really good. It felt like a realistic, dark and yet beautiful story-world, emotionally intelligent, suspenseful and visually stunning. I did read other reviews before watching this and saw several that called this film \"emotionally hollow\". Honestly, what movie did they watch??! Or is the problem rather that those viewers themselves were emotionally hollow? I think it was emotionally rich. Just Beautiful. Makes me want to read the book next. Go watch it.EDIT: I have read the book now - it does it justice in all the right places and the few changes were wise choices (eg. The multiple visions of Chani and making Kynes a black woman - the book IS old after all and women or people of colour need more representation). So - well done! Very well done!",
    "42": "I really hope the filmmakers of the Silmarillion movie (if it ever gonna appear) will do such a nice adaptation as did Villeneuve with this outstanding Dune.And for those who think Dune is very long I can only recommend TikTok.",
    "43": "This was a hopefully awaited new dimension of an intelligent blockbuster movie and a solid proof that arthouse and entertainment don't need to be contradictory. Villeneuve's vision is strong, emotionally deep, visually stunning and powerful, his seriousness and pathos is mind provoking and innovative. Chalamet's coming of age is touching, he portraits his character with beauty, innocence and sensitivity. I'd love to see how the story and the characters will be developed in a possible second part.",
    "44": "I was just as stunned the second time as the first one. I've started to read the book and in my opinion they did a great job translating the book into the movie.I just feel like this is the movie you have to see in the cinema. Small screen (and an average computer screen is small , unless you have one of those giant outrageously expensive flat TVs then maybe you'd be fine) just won't cut it.Also side note, I usually hate 3D imax and I was very skeptical at first but after seeing it I'm amazed of how well it's done and how good it looked. Worth it.Truly a masterpiece! Give it a go and decide for yourself.",
    "45": "In my opinion, this is not the masterpiece I had hoped for. I was never truly lost in the universe of the movie, forgetting time or consumed by the characters.However, DV proves once again, that he is the most interesting filmmaker in the film industry right now. He refuses to comply with the standard Hollywood narratives. His movies are original and unique. Like his masterpiece Sicario. He takes you on a ride, where you never know what's coming. You can't predict his storylines.So. I'm still onboard. Excited to watch part 2. Maybe still, DV's Dune will turn out a masterpiece in the end.",
    "46": "Finally someone has understood how to give this monumental and at the same time profound story an adequate visual form. And not only that, also the intensity and epicness with which everything plays out, from the quiet to the loud moments. The feeling of the drama in the making until the great catastrophe. The subtle to aggressive manifestation of the witchcraft forces.Together with the fantastic actors and Zimmer's music simply the highest pleasure and worth at least one more visit to the cinema before it comes into the home media library.",
    "47": "There is probably no point in warning about spoilers for this film. You've probably read the book or seen either the 1984 Dino DeLaurentis version or the 2000 Sci-Fi mini-series.... If you've seen either one of those, you've seen this movie. This movie only covers half the story, the sequel we'll probably never get to see will cover the other half.So how does it stack up? Not well, in my opinion. It's a loud, dull action movie, with an ear-splitting soundtrack. It has all the scenes you might have seen if you watched either of those two versions, but didn't do them nearly as well.At two and a half hours, it drags on. The Lynch version of the film was 137 minutes, and got the whole story in. This film leaves key aspects out, and only tells half the story, and it just goes on and on and on.To start, let's talk about characters. DeLaurentis got a cast of largely unknowns back then, many of whom went on to distinguish themselves. Kyle MacLachlin, Patrick Stewart, Dean Stockwell, Sean Young. Heck, even the little girl actress, Alicia Witt, went on to have a career as an adult. This movie uses a cast of people you've heard of, and their screen time is often based on \"I know who that is.\" Other characters, more critical ones, were kind of shuffled to the side.I'll give two examples. A key point in the book is that the betrayal by Dr. Yeuh, (played here with no charisma by Cheng Chen) because as a Suk Physician, taking a human life is against his conditioning. No build up, no nothing, he just does it.On the other hand, because Duncan Idaho is played by Jason Momoa, he gets a lot more screen time than his presence in the book. (Duncan's clones become a much more important part of later books, but that's neither here nor there.) His final fight scene goes on interminably here, while they were quickly brushed over in the previous versions.Similarly, while Peter DeVries is a key player in the book, here they don't even mention him by name, and he's just \"Henchman who gets poisoned\". Other characters are omitted altogether, including Emperor Shaddam, Princess Irulan and Feyd Ruatha. Concepts such as the Mentats, Guild, Bene Geserit, are kind of glossed over to get to those sweet, sweet action sequences.The movie rises and falls on the actor who plays Paul Atreides... and again, he's actually closer to the age that the character is supposed to be at the beginning of the book, but he comes off as a little Emo.Again, trippy as it was, the 1984 version did this better. The Sci-Fi Channel did it better...\nNow, this film really LOOKS good. The visuals are immersive. But without strong characters and story to back them up, what's the point? It's almost like watching a Transformers movie. The thing is, they HAD strong characters and a story... they just didn't use them.",
    "48": "From Hans Zimmers soundtrack to the cinematography.Dune part 1 is everything i hoped it would be.As a fan of the books, i can say that this is the best adaptation we could have wanted. Denis Villeneuve has shown this generation what cinema is supposed to be. If you like the books than do not hesitate to go and watch.It is as of now, movie of the year. A must see.",
    "49": "Dune is technically perfect: direction, cinematography, score, acting, visual effects. It is truly a great cinematic experience and if you are interested you HAVE to go watch it in a theatre because it's visually majestic and the big screen helps fully enjoying it. Even the audio is important with a inspired score and great sounds in general and the big speakers of a theatre can contribute to a even better immersion. Dune is technically great as I said and it should be viewed but its \"part one\" nature is what could let down some viewers or maybe, as it has happened to me, not to fully appreciate the movie. In particular the protagonist has his arc and some important things happen but the movie does not tell a complete story and the ending seems more like the finale of a episode of a tv show rather than one of a movie and I'm already anxiously waiting for the sequel. In conclusion Dune is certainly worth watching, especially in a theatre, even just for its aesthetics but be aware that it is not a conclusive movie and be prepared for that.",
    "50": "Worried like every time a great material is adapted it usually does not deliver on expectation.Here Dennis Villeneuve did the impossible: staying faithful to a complex and rich universe and a fantastic story with a masterful demonstration of direction, stunning visuals and solid acting.Oscar Isaac, Stellan Skasgard and Javier Bardem in particular are impressive while Chalamet was solid.My only (slight) issue is the fact that Lady Jessica is too emotional compared to the original character, and that we never see the emperor and the Navigators.I was afraid that the sex and race swap of Liet would feel forced and woke but it is well done and feels natural in the context of the film.So hat's off Dennis Villeneuve, this is another masterpiece under your belt.",
    "51": "+ Massive dimensions to highlight the Desert Planet and the Universe around it\n+ Epic music / sound supporting the epic scenes\n+ Book readers can be proud how the story is presented\n+ Excellent use of slow frames and bringing details to the forefront\n+ Cast includes multiple actors / actresses who fill the screen\n+ Select 3D if possible, it supports the movie and I forgot that I have 3D glassesFear is the mind-killer.",
    "52": "To me this movie really is 10/10 and i'm not afraid to say it. Easily my favorite movie of 2021. There's no competition even. Visually stunning, Action was good, well directed. Acting was very believable.I haven't read the book and i really liked the movie. Made me curious to learn more about characters and world, but it was very solid first chapter in my opinion. I'm pretty sure others who haven't read the book can get hooked as well, because even if you don't know anything about it, who doesn't like epic looking spaceships and giant sandworms?To elaborate even further, i think this movie will win over lots of Star Wars fans, who have been disappointed in Star Wars in recent years. Unlike Disney Star Wars, Dune is way more mature and has actually deep lore and interesting characters.",
    "53": "This film was quite literally one of the worst films I have ever saw. It was 2 and a half hours of nothingness. Almost nothing happened throughout but people standing around having conversations with each other. Which also weren't interesting at all.I really wanted to like this as I love Denis Villeneuve movies.",
    "54": "I enjoyed the entire experience from beginning to end. It was done better than anyone couldve asked for and better than i imagined. There are stuff in the book that cant be adapted but the movie did well without it. My friends who hasnt read the book was impressed and loved it so i guess im not too biased in comparison within my group.My only dissapointment was it ended too early. Its the fastest 2.5 hours movie ive watched in memory and i couldve easily watched both parts together easily.",
    "55": "I really am amazed by how they could get Dune so wrong 1984 and so right this time! I'm not beating on Lynch - I love some of his work (Mulholland drive is a masterpiece). But his version of Dune is revolting! This was beautiful, dystopic, haunting and perfectly paced. Ant to all you that just have to criticise 'cause you can. I guess you just don't get directing where the actors don't babble and overact. So you get bored if the dialog i at it's minimum and the actors are acquired to act with their faces and body-language. To bad for you! I was stunned and at the edge of my seat the entire length of the movie. It's a masterpiece!!",
    "56": "This film will never compete with the previous older adaptation of Frank Herbert's novel, the eponymous film by David Lynch. In fact, most dramatic elements of this story are replaced by digitalized special effects. The actors are like pawns on the screen, and they have little to say. The music accompanying the visual special effects replaces most of the time any elaboration of the dialogue or the characters.It is a shame for Timothée Chalamet who is underused some will say, though we do not know yet what he could really do in a dense and deep film, like the second part of the book \"Call me by your name,\" though this second part being some ten years after the first part, it might be difficult for Timothée Chalamet to play that particular part of the story.I just hope he may grow on the screen and have a career that could compare with DiCaprio's who was also naïve, superficial, and sort of stiff in his very first screen productions. Does Timothée Chalamet have the potential of a future star? Maybe, but I can't really see it, feel it in this film and in \"Call me by your name\" in which the easy provocative sexual side of the character was in many ways erasing the rest, though the teenager there was sexually depicted as naïve, superficial, and unable to be a real predator, the real predator he was supposed to be.So, watch it with a good one hundred grams of salt in your pocket, and keep the salt in your pocket, please.Dr. Jacques COULARDEAUVERSION FRANÇAISECe film ne rivalisera jamais avec la précédente adaptation plus ancienne du roman de Frank Herbert, le film éponyme de David Lynch. En fait, la plupart des éléments dramatiques de cette histoire sont remplacés par des effets spéciaux numérisés. Les acteurs sont comme des pions sur l'écran, et ils ont peu à dire. La musique qui accompagne les effets spéciaux visuels remplace la plupart du temps toute élaboration du dialogue ou des personnages.C'est dommage pour Timothée Chalamet qui est sous-utilisé diront certains, bien que nous ne sachions pas encore ce qu'il pourrait vraiment faire dans un film dense et profond, comme la deuxième partie du livre \"Appelle-moi par ton nom\", bien que cette deuxième partie étant quelque dix ans après la première partie, ce pourrait être difficile pour Timothée Chalamet de jouer cette section particulière de l'histoire.J'espère simplement qu'il pourra grandir à l'écran et avoir une carrière comparable à celle de DiCaprio, qui était également naïf, superficiel et un peu rigide dans ses toutes premières productions à l'écran. Timothée Chalamet a-t-il le potentiel d'une future star ? Peut-être, mais je ne peux pas vraiment le voir, le sentir dans ce film et dans \"Appelle-moi par ton nom\" dans lequel le côté sexuel facilement provocateur du personnage effaçait à bien des égards le reste, bien que l'adolescent y soit dépeint sexuellement comme naïf, superficiel et incapable d'être un vrai prédateur, le vrai prédateur qu'il était censé être.Alors, regardez-le avec une bonne centaine de grammes de sel dans votre poche, et gardez bien le sel dans votre poche, s'il vous plaît.Dr Jacques COULARDEAU.",
    "57": "Finally, a Dune worthy of Herbert's vision. Like Blade Runner 2049, it took me until the following day to fully digest the assault on the senses. The difference this time around, is that it reminds me of certain Euro art films from the 70s where there would be long close-ups of expressionless faces. Perhaps Villeneuve was inspired by Jodorowsky's Dune in the 70s that was never made, that was supposed to have Pink Floyd composing the soundtrack? Otherwise, it is very dark and brooding like Blade Runner 2049, and very much like the book and the mini-series (script-wise), but nothing like the 80s movie. Jessica is a little more vulnerable compared to her 'regalness' in the novel - at least, that's how I remember her from my reading the trilogy three times. And one person has changed gender! Dr. Liet-Kynes is now played by a woman. Regardless of gender, Max Von Sydow in the 80s film stands above the rest, because it is Max Von Sydow and his uniquely quircky personality that can give an added dimension to any role. If WB doesn't allow for a part II, I will never see another WB film again.",
    "58": "I have neither read the book (yet) nor seen the old movie, but this one was really, really good. It felt like a realistic, dark and yet beautiful story-world, emotionally intelligent, suspenseful and visually stunning. I did read other reviews before watching this and saw several that called this film \"emotionally hollow\". Honestly, what movie did they watch??! Or is the problem rather that those viewers themselves were emotionally hollow? I think it was emotionally rich. Just Beautiful. Makes me want to read the book next. Go watch it.EDIT: I have read the book now - it does it justice in all the right places and the few changes were wise choices (eg. The multiple visions of Chani and making Kynes a black woman - the book IS old after all and women or people of colour need more representation). So - well done! Very well done!",
    "59": "I really hope the filmmakers of the Silmarillion movie (if it ever gonna appear) will do such a nice adaptation as did Villeneuve with this outstanding Dune.And for those who think Dune is very long I can only recommend TikTok.",
    "60": "This was a hopefully awaited new dimension of an intelligent blockbuster movie and a solid proof that arthouse and entertainment don't need to be contradictory. Villeneuve's vision is strong, emotionally deep, visually stunning and powerful, his seriousness and pathos is mind provoking and innovative. Chalamet's coming of age is touching, he portraits his character with beauty, innocence and sensitivity. I'd love to see how the story and the characters will be developed in a possible second part.",
    "61": "I was just as stunned the second time as the first one. I've started to read the book and in my opinion they did a great job translating the book into the movie.I just feel like this is the movie you have to see in the cinema. Small screen (and an average computer screen is small , unless you have one of those giant outrageously expensive flat TVs then maybe you'd be fine) just won't cut it.Also side note, I usually hate 3D imax and I was very skeptical at first but after seeing it I'm amazed of how well it's done and how good it looked. Worth it.Truly a masterpiece! Give it a go and decide for yourself.",
    "62": "In my opinion, this is not the masterpiece I had hoped for. I was never truly lost in the universe of the movie, forgetting time or consumed by the characters.However, DV proves once again, that he is the most interesting filmmaker in the film industry right now. He refuses to comply with the standard Hollywood narratives. His movies are original and unique. Like his masterpiece Sicario. He takes you on a ride, where you never know what's coming. You can't predict his storylines.So. I'm still onboard. Excited to watch part 2. Maybe still, DV's Dune will turn out a masterpiece in the end.",
    "63": "Finally someone has understood how to give this monumental and at the same time profound story an adequate visual form. And not only that, also the intensity and epicness with which everything plays out, from the quiet to the loud moments. The feeling of the drama in the making until the great catastrophe. The subtle to aggressive manifestation of the witchcraft forces.Together with the fantastic actors and Zimmer's music simply the highest pleasure and worth at least one more visit to the cinema before it comes into the home media library.",
    "64": "For the first twenty minutes of this joyless nerdfest, I had absolutely no idea what was going on. Then for the remaining two hours I was on catch up as the film went from one pointlessly long scene to the next. Obviously for fans of the novels, I was lost, and couldn't wait for it to end. 5/10.",
    "65": "My God, only 20 minutes into the movie and I was already mesmerized for the great masterpiece it is.The ambience, the music, the greatness of the halls, the unique take on the spaceships and tech... the list goes on and on.But the most astonishing were the Harkonnen. They\"re now truly ruthless and savages psychopaths.Thanks, Dennis, for bringing such piece of artwork up to us.",
    "66": "Takes it time to actually build a story and not rush thingsgreat cgigreat musicnice fighting scenesgreat actorsawesome movie atmosphereCan definitely recommend it.",
    "67": "One of the most well-paced and smoothest movies i've ever seen, didn't get bored at all during this epic experience, not even 0.1 second out of the 235 minutes. I was constantly looking at the screen, not blinking, just in awe of what was unfolding in front of me on the big screen.If only there was a part 2 I could watch right now ☹",
    "68": "Having seen the first Dune and enjoying the movie but the special effects were subpar. This fresh remake of Dune is a fantastic movie with a great storyline and superb special effects. The modern actors that portray the original characters not only follow the storyline but add a fresh and unique perspective to the movie. If you enjoyed the first Dune, you will like this one even better.** A MUST SEE**",
    "69": "Where blade runner 2049 felt meandering - and it's best compared to blade runner 2049, both great movies - Dune always felt exciting. The great acting and directing gives the movie a soul of its own.This one is a cinema event. Music and sound effects, the large vistas, the grandiose battles. The special effects adds to the movie, making the fighting seem more desperate than it otherwise would have been. My biggest complaint is that it's made for pg rating. My 2nd (and last as of seeing it once) that the march music is so melancholic.",
    "70": "Better than Stars Wars and I am a fan. Great storyline, casting and directing. One of the best fighting scene ever with Jason Momoa. A must-see movie, trilogy.",
    "71": "The film is visually spectacular and if anyone is asking if a remake was necessary I'd say yes just for the technological advances there have been. We finally get a real feel for these locations, something that neither the original nor the mini series can offer to 2021 audience. Anyone unfamiliar with the book or previous versions may find themselves a little confused about the different groups and planets etc as not enough time is spent developing those aspects. People may also be disappointed to realise it's only the first part of the story. The cast is pretty solid with a few underutilised, but the visuals are what give this the 8 stars, that and the fact I am a fan so for me I wasn't confused by any of the plot. Fans of Dune will want to see the continuation of the story, I'm not sure however how good a job it does of winning over new audiences or those previously unaware of the franchise.",
    "72": "(spoilers i guess... but not really)\nThe movie is great. Cinematography and acting is very good. The atmosphere is really immersive. Scenes are intense and fun. Its a really cool setting and it made me really invested in the story. I'm really looking forward to experiencing the rest of the story and I hope Dennis V. Gets green light on making chapter II into a movie. I ordered the book the same night i watched the movie.Go watch the movie.",
    "73": "It's been amazing being back in cinemas after last year, I have seen some good films, and some shockers, this though, is the first great film of the year for me.The story is somehow easier to follow than in the last adaptation, motives and actions are easier to see and follow. I felt as though the book had come to life here, even if there are a couple of changes.The acting is impressive, as is the music, the visuals however are the most incredible thing about this film, it looks awe inspiring. The battles are epic, the staging is impressive, you almost feel close to the action, I cannot praise that element highly enough.When I saw Part one, I was a little surprised, I was a little more surprised by the ending, I only hope the wait isn't too long.Pacing, considering where the film ends, it never felt slow or drawn out, I was captivated from start to finish.Truly, I was blown away, 10/10.",
    "74": "Although the film is called 'Dune', the opening title refers to it as 'Dune Part One'. I knew, when I saw this, it probably should have been better to wait for Part Two before watching it. As a result some characters felt underdeveloped, and some simply vanished halfway through the movie. They also kept talking about Paul Atreides (Timothee Chalamet) being 'The One', but the one for what? This somehow reminded me of Neo from 'The Matrix', also being 'The One'.Regardless, 'Dune' is a spectacle of note. From the stunning visuals, state of the art CGI, production design, and cinematography, to good performances from a stellar cast and a great score, this is one amazing movie. Sure, the film won't satisfy everyone's palate, and if you're not a sci-fi/fantasy fan, 'Dune' will not appeal to you. However, one can't help but be impressed by what they've accomplished.Ok, now, you can crucify me if you want, but for me there were some issues with the film. With the movie being so long, I later found myself thinking there's a hell of a lot going on, with very little happening. Maybe this is because this is not a completed movie (being Part One), but I didn't always understand the character motives, and I still don't really understand what Paul's real mission is. Spice is the most valuable substance in the universe, and I understand Paul follows in his Father's footsteps to preserve the spice production, but he is always on the move and I don't follow whereto. It sometimes also felt like they were holding back on the action sequences. Some of the action scenes ended so abruptly...Also, large parts of the movie reminded me of other films, like 'Tremors', 'The Chronicles of Riddick', and 'Star Wars'. Then a number of credibility issues. The film is set in 10191, but there were medieval elements here as well. Will they still be using scrolls so far into the future to read messages from? Will they still read books? Will they address leaders as \"My Lord\"? This, and their costumes, felt very dated.If the film was about 30 minutes shorter, it would have been much better paced, with all the unnecessary scenes on the cutting room floor. It was just too long to keep me entertained for the entire 155 minutes, no matter how astonishing the production values.Ok, now that I've had my rant, 'Dune' is still an incredibly well made film, and worth watching at least once.",
    "75": "Dune (2021): Not at all as retro as Lynch's Dune, the Flash Gordon/Steampunk aesthetic is replaced by starker yet still ancient looking furnishings and the Spaceships are more modern than mondo. Still though, there's something of the Imperial Stormtroopers about some of the soldiers, even those out of armour tend to look like Star Wars ship crews. But this is a far darker tale than any SW chicanery. We see Paul Atriedes (Timothée Chalamet) visiting his grandfathers grave who died fighting a bull, Galician Bagpipes are played as the Atriedes family walk along the exit ramp of a spaceship. The spaceships are impressive, a submerged troop/suppies rising up like a whale. But these ships are are like grains of sand compared to the vast Starships, ornithopters are extensively used for transport and combat on Arrakis. The betrayal and retaking of Arrakis by the Harkonnens is vividly portrayed in attacks from above, hand to hand fighting bombings. Here Duncan Idaho(Jason Momos) is given more room to develop as a character than in the 1984 film, it's yet to be seen if Josh Brolin's Gurney Halleck will match or outdo hat of Patrick Stewart's portrayal. The true role of the Bene Gesserit and the early appreciation by the Fremen of Paul as a potential Prophet/Savior is more subtly related by Villeneuve. This is just Part One, i eagerly await the second half. Directed/Co-Written by Denis Villeneuve. 9/10.",
    "76": "To be honest I wasn't expecting it to be a first episode in the series of films, so that was a disappointment at first - but then I realised it's just impossible to put whole book in one movie in any meaningful way (with all my love to the Lynch's version, it didn't do the book much justice), so splitting the story into several parts is actually a good decision.Problem is, even with this division the film doesn't really provide much of the background details on who all the characters are, what's the state of the world, why spice is actually important to the navigators, who are the navigators and many many different important well-thought aspects that make the book so great. Instead there are long scenes focused on the main character, surroundings, futuristic machinery and so on.There are two more outcomes of such screen usage:\n1. It all looks absolutely gorgeous and amazingly well designed - \"firefly\" fighters are incredible, harvesters and their delivery is awesome, and many other things are equally stunning. And oh, the costumes! The costumes are the best.2. Major actors playing secondary characters don't get much time at all - they're all playing their roles very well, but we barely see them at all (save perhaps Jason Momoa, but even his screen time is scarce).Overall it's a great cinematographic feat, and the best Dune adaptation so far - but we'll have to wait the rest of it to see if it holds true. I only wish they'd put more world-building details into the narrative...",
    "77": "I feel I should start by saying I have minimal context for this film. I've never read the book(s?) and I don't really remember the '84 movie all that well. So I'm going into this fairly fresh and with no real explanations. That said...With all due respect to the brilliant Mr. Villeneuve, this felt like a massive superficial film that is a technical marvel but feels so hollow. Seriously, this thing is GORGEOUS with a capital everything, the sound is spectacular, it's shot beautifully but there just doesn't feel like enough meat beneath all the flash. It is a masterpiece on paper, with performances to match the visuals but after two and a half hours I felt like I was struggling to stay awake through an overlong prologue to an actual story.Yeah, this is going to be multiple movies (assuming they get the green light for another) and it feels like it. Kinda how Fellowship of the Ring felt like a dull venture in walking until the ensuing films added texture to the franchise. Maybe when Dune 2 comes out this one will feel like a more cohesive piece but for now it lacks a soul to match all of the stunning visuals.I'm hitting this one hard when I do think there were some legitimately great things here, it just all felt vacuous and empty and I wanted more of an actual story. Still think it's worth checking out, just for the technical mastery and stunning presentation but... That's about all that's here.",
    "78": "Dune: Part One (2021) is a movie the wife and I saw in theatres at an advanced screening. The storyline tells the tale of an emperor who changes leadership in his most important and profitable planet in his kingdom. Follow the new family as they move in and adjust to a ruthless landscape filled with people who don't want to help them and resources set up for them to fail. They quickly realize they may have bit off more than they can chew on several fronts. This movie is directed by Denis Villeneuve (Blade Runner 2049) and stars Timothée Chalamet (Little Women), Rebecca Ferguson (Doctor Sleep), Zendaya (Spider-Man), Oscar Isaac (Star Wars: The Rise of Skywalker), Jason Mamoa (Aquaman), Dave Bautista (Guardians of the Galaxy) and Josh Brolin (No Country for Old Men). The storyline for this is an absolutely brilliant masterpiece in a Star Wars mixed with Game of Thrones kind of way. The vastness and complexity is outstanding and how all the pieces fit together is remarkable. The cast is brilliantly selected and the special effects and action scenes are breathtaking. A few scenes were shot darker than I would have liked but not enough to not call this film perfection. The action scenes are well choreographed and the fierceness of the war and fight sequences were awesome. There is a level of uncertainty in every second of the film. This is a rare masterpiece in a Lord of the Rings/Star Wars kind of way that happens once every 20-30 years that is an absolutely must see. This is an all-time great science fiction movie that is an easy 10/10.",
    "79": "Just watched one of the first screenings of 'Dune' at an IMAX cinema and damn, that were some of the best two and half hours of my life. I was hyped for this movie from the moment it was announced since I'm a huge fan of Denis Villeneuve - but also because the story really spoke to me in a special sense. I haven't read the books, so this experience was very original and new for me.I was amazed when I heard about the amazing cast that was going to be in this film. When I saw them in action I was even more amazed, overwhelmed even. Every one of these top-tier actors brought their A-game to the set of 'Dune' and this makes the characters so much more interesting. The person the amazed me the most was Rebecca Ferguson. Her portrayal of Lady Jessica was absolutely outstanding.The visuals and cinematography in this movie were out of this world. You'd almost think that they actually filmed on different planets. You could pause the movie at any point in time and you would always be looking at a beautiful painting of its own. The sets were incredible, so were the special effects. You can really tell people worked hard on this.Hans Zimmer's score was pristine (as always). It really brought the universe of 'Dune' to life by creating a unique atmosphere of its own. The sound design was also incredible. I was a big fan of the loud, obscure sounds that were coming from many of the gigantic ships. It really gave you and idea of how large in scale this story is.As far as the story goes, I don't know if I can give a good opinion. I haven't read the books nor watched the previous adaptions, so I don't know if this adaption stayed true to the original. All I can say is that this story really pulled me in from the get go and didn't let go until a few hours after the movie ended. And I'm still not over it. I rate this movie 9/10 because I absolutely adore it, missing the one point because the ending didn't really feel like an ending. I truly hope part two gets made because this story deserves to be completed.",
    "80": "I remember seeing a book in my home, as a child. I had no idea what it was but the cover art, of a desert tribesman with piercing blue eyes affected me. Even scared me. The image stayed with me.Everyone that has read Frank Herbert's Dune will have their own vision of it. That's the magic of the written word. And if Frank Herbert taught us anything, it was to have an open mind.Villeneuve has shown us, with Dune, that dreams can be given justice, if the heart is in the right place.A grand achievement of cinema and of science fiction. Many will wish that Herbert was still around to have seen this. But of course he already has.Salut.",
    "81": "From the director of \"Arrival\" and \"Blade Runner 2049\", comes another sci-fi epic \"DUNE: Part One\" based on the novel.It's the year of 10191. There are different planets with different species of human. Our main character Paul Atreides (Timothée Chalamet) is the future of House Atreides. He is on an adventure to Arrakis, a beautiful planet that produces spies and full of dangerous sandworms.This is all I can say without spoilers. The thing about DUNE is it's stunning direction and breathtaking cinematography (by Greig Fraser) and visual image. Not to mention the amusing score (by Hans Zimmer).I watched DUNE in IMAX. Frequent shots of enormous spaceships and battle sequences are always a pleasure throughout. The making of this movie should be rightfully appreciated.It's a movie forcing the audience to pay attention, in a good way. The plot takes time to digest but once you know what's going on, it's a lot of fun.A lot of characters are introduced. Gurney (Josh Brolin), Glossu (Dave Bautista), Duncan (Jason Momoa) and I could go on. During it's 155 minute runtime however, not everyone gets enough characterization. I'd like to see certain characters explored more. Maybe in the sequel.After all DUNE is still a beautiful sci-fi movie. It may not be everyone's cup of tea, but it's still a great piece of modern filmmaking.",
    "82": "Perhaps the greatest lesson that can be drawn from Denis Villeneuve's Dune is that ultimately an entirely satisfying adaptation of the novel is impossible. Nonetheless, Villeneuve's version is the closest at succeeding so far, and is one of the more enjoyable theatrical experiences of 2021.Villeneuve stays very adherent to the original work, even in the smaller elements. There are a few omissions however, and the first scenes are not present in the novel.His version has however not rendered from the sense of mistery that permeates the beginning of the novel. It immediately submerges its reader in the world of Dune, without any introduction, and the complex situation is slowly unraveled throughout the narrative. Villeneuve's previous films prove that this approach could have been undertaken by him, but the 2021 film chose instead to rely on several expository scenes that explain too much to the audience. Some of the revelations that are hinted at very early were not as clear until the second half of the novel (yet to be adapted). A choice dictated by the destination to a wider target audience, for sure, but that ultimately adds dryness to the film.Another slight disappointment might come from the score by Hans Zimmer. It does render the majestic epic scale of the film, but it perhaps remains overly somber and ambiental in scenes where it could have charged up the depicted tense situation.What works best in Dune is the flawless casting. Whoever has read the novel could hardly imagine different actors to portray the characters. Dune also succeeds in rendering the alien scape of the desertic planet Arrakis, as well as the other planets that are even only hinted in the novel, without reduntantly using the strong saturated colours of Lynch's version. Greig Fraser's cinematography is truly a feast for the eyes, aided by a desaturated yet captivating coloring. Rest assured: the sky is never blue, which is something that the latest promotional poster seemed to suggest. On the other hand, what the film does borrow from the never made Jodorowsky version is some of the production design elements, especially for the Harkonnens.Ultimately, even if Villeneuve did not make the perfect Dune film (and it is fairly possible to say at this point that such a film cannot exist), it is an entertaining film. It is entertaining and\nkeeps the viewer glued to the screen even despite its slow nature, leaves the viewer wanting for more, and that alone makes up for all the small imperfections it features.(Extracts from my longer review on my blog, comeandreview)",
    "83": "From its most complex layers, to the simplest ones... From the most joyful or deeply human moments, to the most horrible or deeply inhuman moments. Sometimes raw and dark as life can be, sometimes wonderful and magical as life can be...A universal saga in infinitely more ways than one... A mythology filled with values and philosophies colliding with one another... A multiplicity of beliefs, where certainties and uncertainties are entwined with one another, like two inseparable snakes seeking each other without ever finding each other...Mystical and evanescent, as well as concrete and visceral... Dreams and premonitions, choices and actions, space and time... Or where the role that you play is written but is not, has already taken place but never will...A cinematographic fresco that is immensely majestic and glorious like the greatest of paintings or the greatest of concertos...... It answers everything while questioning you about everything, because it is simply giving you the pure truth.PS : From the entire casting and their performances, to the cinematography+photography+design & visual language as a whole, to the action+choregraphy+music+costumes, the staging and overall atmosphere, the lore/world building, its entire mythology (and its codes), with countless messages and layers... Everything in this movie is pure mastery, pure genius.An absolute masterpiece.",
    "84": "The original Dune film created and released by David Lynch is undoubtedly a cult classic film. This 80's version of Dune was epic with grand visual cinematography, breathtaking costumes and a story that absolutely is a masterpiece. Where the original falls short is on flow and pacing. It dragged out in some areas.The new Dune film created by Denis Villeneuve contains many similarities when compared side by side with the original. In fact, the new Dune more closely follows that novel, and instead of having one long movie like the original, the new Dune fits about half of the original Dune story into a 2.5 hour film whereas the original fit the entire novel into that same 2.5 hours.The good news is that by splitting the novel into a 2 part film such as Villeneuve has done, it captures more of the novel in total. The result is a more detailed dive into the Dune novel that effectively eliminates many of the pacing issues that plagued the original film.The cinematography is next level on visuals. The world of Dune is breathtaking to see visually. The costumes are unique and gorgeous to view. It is very clear that Dune is a film with a massive budget...something that is quite rare to see anymore. Studios are more careful than ever when it comes to doling out the budget for blockbuster films anymore. In recent hits the only films with such large budgets are usually just Marvel films, so it is refreshing, unique and simply a visual treasure to look at this blockbuster film type that is actually filmed in IMAX for that incredible experience.We know the budget is there, but how about the story? Since this films source material comes from Frank Herbert himself, one simply could not have asked for a better story. In fact Dune is quite often hailed as the single greatest sci-if novel EVER created, and that is an accolade that is no small feat! The key was for Villeneuve to accurately convert that story into film accurately. I am pleased to say that this was clearly handled with kit gloves and deftly converted in a very effective manner. In my opinion we have an INSTANT CLASSIC film! The story and even the pacing is as close to perfect as many could have hoped!The acting and actors for Dune is simply a roster of some of the most talented A-list thespians on the planet! I could name this list for you here, but it is long and \"star studded\" as they say. The acting is fantastic and well performed across the board. The surprise performance out of an already amazing list would surprisingly go to Jason Momoa and Josh Brolin who brought \"sizzle\" t9 their respective roles! Additionally, the role of Paul by Timothy Chalomet was good but particularly Rebecca Ferguson as Lady Jessica is a stand out for sure.This film is absolutely worth the money to go \"experience\" at IMAX. Notice I said \"experience\" as opposed to saying watch? This film in IMAX is just that type of film. Most people watch films, but Dune is a movie to \"experience\" if you are able to attend in IMAX. This show ranks very high across the board in every single category, but the entertainment value is particularly high, something that can be difficult to achieve in such a long run type film.9.5/10. I haven't really ever issued a perfect score to any film, but since I am unable to review score an IMDB film at 9.5/10, I then give this film score a 9/10 official review. I have only ever given out such a high score once, and that was for Game of Thrones who I rated the same. Do yourself a favour and view this in IMAX, worth every penny!",
    "85": "What can I say. Not only did I watch this movie, but my body was astrally projected to Arrakis.I got goosebumps whenever Hans Zimmer's melody pulsed through every sequence in this movie. I was surprised by the scale of the film's production. I went into trance together with Paul Atreides when he discovered that the tragic fate he envisioned was coming true.This movie only partially loses because it's half of a whole. I want to see more but I can't.Boring! For those with terrible taste, I have no doubts about that.As for the criticism of the white savior, read the damn books. Or just pay attention to what you're watching.Midway through the film, Paul has a vision of the future, in which the dangers of charismatic leadership elevated to godhood are thrown in the viewer's face. You have to be really mindless not to notice.This is one of the most epic sci-fi movies of all time. Watch it on the biggest screen you can.",
    "86": "Before watching the movie I thought the many good reviews of the film were fake, but after having seen it... this is hands down one of the best films of recent years!Superb visuals not just in terms of CGI but the graphic storytelling via retro archaic style of buildings, atmospheric settings and lighting and soundtrack, stylish costumes, spectacular desert landscapes and retro high-tech machinery, great cast and acting, clever story with intrigues and political backstabbing all work extremely well together.This remake is one of the few exceptions that by far outguns the original on all levels, and is sci-fi cinema at its best!Only negatives are: the movie's a bit drawn out in the end and could have been 15mins shorter. The \"he's the chosen one.. oh but he doesn't look like it\" mantra is a repetitive and a lame cliché - it's unnecessary to mention it and the story would work well (actually better) without random people constantly saying it. Also, the characters are a bit flat and linear and could have a lot more depth or controversy to them, indicating their motivations, inner tensions, what drives them etc. - so far the characters seem a bit like puppets on autopilot.But all in: amazing and potentially epic film and looking forward to part 2.",
    "87": "I felt like I was Paul Atreides - since my memories of watching the original 1984 film flashed before me as a visual guiding force while journeying through the desert planet of Arrakis. As a child, I loved the 80's aesthetic, the practical effects, and the over-the-top science fiction aspects of \"Dune\" - But I failed to understand the core meaning of the story. I'm thankful for having had an experience with the mythology of this tale before since it helped navigate me through this new re-imagining. Which culminated in a surprisingly emotional and immersive cinema visit.All the exposition, all the time put into introducing the people and the worlds - It all continues building and building - Until all those elements find themselves holding hands - And your patience is rewarded with a feeling of relating to the potential of Paul's destiny. All of us are searching for what lies beyond that desert. Beyond that fear, a destiny awaits. And as they say in the story: \"Fear is the mind-killer\". Congratulations to Denis Villeneuve and his team! They nailed it! It made me reminisce on the past fondly, whilst also being in the present with eagerness to continuing striving towards the horizon. A very specific feeling, I know. But that's what the movie did. Plus, re-visiting that image of those iconic Frank Herbet sandworms echoed back souvenirs from a simpler time that I thought I'd lost.PS: It was a bold choice to only adapt half of the book. Fingers crossed that we aren't left hanging with this cliffhanger. Much grandness is left to be witnessed.",
    "88": "I would give it just 9.5, because I think the importance of water came up short. And I also missed the banquet scene, what could have been a really clever scene with good dialogues.But the film is absolutly great, the actors are without exception awesome, the scenes/ the dialogues are perfect, the length of the film is perfect, it's close to the books (great story) and the visual effects are insane (beautiful scenes -> action/fight scenes/nature/spaceships/worms/citys). You can see how much love Villeneuve and the actors put in and I really want to see more. This is the beginning of a new universe. The time I have to wait for part 2 will be hard.In my opinion Villeneuve and Nolan are the best regisseurs in the world and they both made their visual/ their (characteristic for them)/signature masterpiece with Dune and Tenet. I love it.",
    "89": "The biggest question with this film was: was Villeneuve able to deliver? You got one of the most popular sci-fi novels, a cast of talented and very charismatic actors, and a generous budget. Was Villeneuve the right choice to direct this film; could he muster all these resources and use them effectively to tell a story? Could he make a film that is enjoyable to watch and at the same time adapt a convoluted cult-classic on which numbers of filmmakers have stumbled?Turns out, the answer is yes.The real cornerstone of the movie, if you put aside the special effects, the plot and the visual storytelling, is the pacing. The film takes its time and lays out confidently most of the techno-babble and sci-fi jargon upfront. Yet, it is not boring or annoying. In any situation or scene, you know what is going on, who is doing what, and generally speaking the action is clear. That is something that was absent from Lynch's Dune. It is challenging to deliver a lot of information in a digestible manner, especially with the sort of sci-fi such as Dune. But the movie does it patiently and clearly. Most of the time a concept is set-up in one scene and then shown or explained in the next. Not only was everything clear in terms of stakes; but it was also engrossing in terms of tension. Not only do you understand what Paul is up against, but you want him to succeed.The story of Dune is the story of Paul Atreides, the young heir of a noble family. One thing that is cool in Dune is: it's feudalism in space. So, you get something that is closer to Game of Thrones than Star Wars.The movie follows the adventure of young Paul. How he makes the transition to a new world, has to come to grips with becoming a leader and is destined to become a prophetic messianic figure. That stuff is good, but I always thought it was the weaker aspect of the novel Dune. The story of a young boy who discovers awesome powers that leads him to rule the universe is pure power fantasy. It is more appealing to young boys than anyone else. Thankfully, the plot weaves-in the space politics and keeps your attention. It presents a lot of that messianic text in ethereal settings: dreams, distant voice-overs and flash-forwards. Leaving the primary action to focus on the back-room intrigues and political upheavals.Generally speaking, it takes the established source material, but paints it with the Villeneuve brush. The movie has that visually sleek minimalist style, where heft is rather communicated with sound. Those are the same ingredients that made Blade Runner 2049 a good movie. In many ways, this movie is more of the same, there is not much innovation stylistically. On the other hand, why change a winning formula?My only caveat is: You have to love sci-fi to like this. Your typical Grandma will not enjoy this.",
    "90": "Dune is a spectacular movie, but I can't give it 10 having read the book.The visuals are a gold standard. Villanueve is evolving as an artist, and if you imagine what the person who made Arrival and Blade Runner 2049 can do with a bigger budget and a bigger universe, you get Dune. Every single element of the Dune universe is faithful to the book and is beautifully realistic.The cast is great, with Chalamet and Bautista being standouts. Glossu Rabban is given a bigger role than in the book, even though it's still minor, and Bautista does not disappoint.The story: the universe of Dune is complex and the narrative is full of intersecting plot lines. Instead of blindly following the book, the adaptation is more focused and the expositions are not on the nose.However, maybe it's inevitable with a big screen adaptation, but some important plot points were lost. For example, the revelation of Paul about their connection to the Harkonnens, or the more detailed explanation about the imperial politics and the great houses. The importance of the spice production and what it does is not highlighted. Instead of the tangled web and complex origin story, it's basically foreign invaders oppressing indigenous people to extract resources. We are shown the mentats, briefly, but they are basically advisers... and that's it. Where is the mention of the ban on the thinking machines?The House of Corrino, the Spacing Guild, Feyd-Rautha are not shown. Hope they will be featured in Part 2.I suppose that's one of Villanueve's strong points, the ability to focus. But I remember the book well, so it feels like parts are missing.",
    "91": "I grew up watching the 1984 movie and had seen it a hundred times before I even knew the book(s) existed... :) so to me, this movie feels like \"a remake\" and not \"a new adaptation of the book.\"Naturally, I can't help but compare the films.The pacing is much slower here, and I feel it gives the story a \"proper epic\" feel without going full Peter Jackson (The Hobbit/3 movies).There are enough differences between the two to constantly keep things interesting, though I feel some things are better explained in the 1984 version (less confusion and explaining things to my wife).Overall I was pleasantly surprised by this version, as I wasn't super-excited by the the first trailer.Given the strange economics of today's movie world, I'm not sure how the studio will decide whether or not to go ahead with Part 2 ... but I intend to vote with my dollars by seeing this at the theater at least one more time.Thanks!",
    "92": "The original Dune film created and released by David Lynch is undoubtedly a cult classic film. This 80's version of Dune was epic with grand visual cinematography, breathtaking costumes and a story that absolutely is a masterpiece. Where the original falls short is on flow and pacing. It dragged out in some areas.The new Dune film created by Denis Villeneuve contains many similarities when compared side by side with the original. In fact, the new Dune more closely follows that novel, and instead of having one long movie like the original, the new Dune fits about half of the original Dune story into a 2.5 hour film whereas the original fit the entire novel into that same 2.5 hours.The good news is that by splitting the novel into a 2 part film such as Villeneuve has done, it captures more of the novel in total. The result is a more detailed dive into the Dune novel that effectively eliminates many of the pacing issues that plagued the original film.The cinematography is next level on visuals. The world of Dune is breathtaking to see visually. The costumes are unique and gorgeous to view. It is very clear that Dune is a film with a massive budget...something that is quite rare to see anymore. Studios are more careful than ever when it comes to doling out the budget for blockbuster films anymore. In recent hits the only films with such large budgets are usually just Marvel films, so it is refreshing, unique and simply a visual treasure to look at this blockbuster film type that is actually filmed in IMAX for that incredible experience.We know the budget is there, but how about the story? Since this films source material comes from Frank Herbert himself, one simply could not have asked for a better story. In fact Dune is quite often hailed as the single greatest sci-if novel EVER created, and that is an accolade that is no small feat! The key was for Villeneuve to accurately convert that story into film accurately. I am pleased to say that this was clearly handled with kit gloves and deftly converted in a very effective manner. In my opinion we have an INSTANT CLASSIC film! The story and even the pacing is as close to perfect as many could have hoped!The acting and actors for Dune is simply a roster of some of the most talented A-list thespians on the planet! I could name this list for you here, but it is long and \"star studded\" as they say. The acting is fantastic and well performed across the board. The surprise performance out of an already amazing list would surprisingly go to Jason Momoa and Josh Brolin who brought \"sizzle\" t9 their respective roles! Additionally, the role of Paul by Timothy Chalomet was good but particularly Rebecca Ferguson as Lady Jessica is a stand out for sure.This film is absolutely worth the money to go \"experience\" at IMAX. Notice I said \"experience\" as opposed to saying watch? This film in IMAX is just that type of film. Most people watch films, but Dune is a movie to \"experience\" if you are able to attend in IMAX. This show ranks very high across the board in every single category, but the entertainment value is particularly high, something that can be difficult to achieve in such a long run type film.9.5/10. I haven't really ever issued a perfect score to any film, but since I am unable to review score an IMDB film at 9.5/10, I then give this film score a 9/10 official review. I have only ever given out such a high score once, and that was for Game of Thrones who I rated the same. Do yourself a favour and view this in IMAX, worth every penny!",
    "93": "What can I say. Not only did I watch this movie, but my body was astrally projected to Arrakis.I got goosebumps whenever Hans Zimmer's melody pulsed through every sequence in this movie. I was surprised by the scale of the film's production. I went into trance together with Paul Atreides when he discovered that the tragic fate he envisioned was coming true.This movie only partially loses because it's half of a whole. I want to see more but I can't.Boring! For those with terrible taste, I have no doubts about that.As for the criticism of the white savior, read the damn books. Or just pay attention to what you're watching.Midway through the film, Paul has a vision of the future, in which the dangers of charismatic leadership elevated to godhood are thrown in the viewer's face. You have to be really mindless not to notice.This is one of the most epic sci-fi movies of all time. Watch it on the biggest screen you can.",
    "94": "Before watching the movie I thought the many good reviews of the film were fake, but after having seen it... this is hands down one of the best films of recent years!Superb visuals not just in terms of CGI but the graphic storytelling via retro archaic style of buildings, atmospheric settings and lighting and soundtrack, stylish costumes, spectacular desert landscapes and retro high-tech machinery, great cast and acting, clever story with intrigues and political backstabbing all work extremely well together.This remake is one of the few exceptions that by far outguns the original on all levels, and is sci-fi cinema at its best!Only negatives are: the movie's a bit drawn out in the end and could have been 15mins shorter. The \"he's the chosen one.. oh but he doesn't look like it\" mantra is a repetitive and a lame cliché - it's unnecessary to mention it and the story would work well (actually better) without random people constantly saying it. Also, the characters are a bit flat and linear and could have a lot more depth or controversy to them, indicating their motivations, inner tensions, what drives them etc. - so far the characters seem a bit like puppets on autopilot.But all in: amazing and potentially epic film and looking forward to part 2.",
    "95": "I felt like I was Paul Atreides - since my memories of watching the original 1984 film flashed before me as a visual guiding force while journeying through the desert planet of Arrakis. As a child, I loved the 80's aesthetic, the practical effects, and the over-the-top science fiction aspects of \"Dune\" - But I failed to understand the core meaning of the story. I'm thankful for having had an experience with the mythology of this tale before since it helped navigate me through this new re-imagining. Which culminated in a surprisingly emotional and immersive cinema visit.All the exposition, all the time put into introducing the people and the worlds - It all continues building and building - Until all those elements find themselves holding hands - And your patience is rewarded with a feeling of relating to the potential of Paul's destiny. All of us are searching for what lies beyond that desert. Beyond that fear, a destiny awaits. And as they say in the story: \"Fear is the mind-killer\". Congratulations to Denis Villeneuve and his team! They nailed it! It made me reminisce on the past fondly, whilst also being in the present with eagerness to continuing striving towards the horizon. A very specific feeling, I know. But that's what the movie did. Plus, re-visiting that image of those iconic Frank Herbet sandworms echoed back souvenirs from a simpler time that I thought I'd lost.PS: It was a bold choice to only adapt half of the book. Fingers crossed that we aren't left hanging with this cliffhanger. Much grandness is left to be witnessed.",
    "96": "I would give it just 9.5, because I think the importance of water came up short. And I also missed the banquet scene, what could have been a really clever scene with good dialogues.But the film is absolutly great, the actors are without exception awesome, the scenes/ the dialogues are perfect, the length of the film is perfect, it's close to the books (great story) and the visual effects are insane (beautiful scenes -> action/fight scenes/nature/spaceships/worms/citys). You can see how much love Villeneuve and the actors put in and I really want to see more. This is the beginning of a new universe. The time I have to wait for part 2 will be hard.In my opinion Villeneuve and Nolan are the best regisseurs in the world and they both made their visual/ their (characteristic for them)/signature masterpiece with Dune and Tenet. I love it.",
    "97": "The biggest question with this film was: was Villeneuve able to deliver? You got one of the most popular sci-fi novels, a cast of talented and very charismatic actors, and a generous budget. Was Villeneuve the right choice to direct this film; could he muster all these resources and use them effectively to tell a story? Could he make a film that is enjoyable to watch and at the same time adapt a convoluted cult-classic on which numbers of filmmakers have stumbled?Turns out, the answer is yes.The real cornerstone of the movie, if you put aside the special effects, the plot and the visual storytelling, is the pacing. The film takes its time and lays out confidently most of the techno-babble and sci-fi jargon upfront. Yet, it is not boring or annoying. In any situation or scene, you know what is going on, who is doing what, and generally speaking the action is clear. That is something that was absent from Lynch's Dune. It is challenging to deliver a lot of information in a digestible manner, especially with the sort of sci-fi such as Dune. But the movie does it patiently and clearly. Most of the time a concept is set-up in one scene and then shown or explained in the next. Not only was everything clear in terms of stakes; but it was also engrossing in terms of tension. Not only do you understand what Paul is up against, but you want him to succeed.The story of Dune is the story of Paul Atreides, the young heir of a noble family. One thing that is cool in Dune is: it's feudalism in space. So, you get something that is closer to Game of Thrones than Star Wars.The movie follows the adventure of young Paul. How he makes the transition to a new world, has to come to grips with becoming a leader and is destined to become a prophetic messianic figure. That stuff is good, but I always thought it was the weaker aspect of the novel Dune. The story of a young boy who discovers awesome powers that leads him to rule the universe is pure power fantasy. It is more appealing to young boys than anyone else. Thankfully, the plot weaves-in the space politics and keeps your attention. It presents a lot of that messianic text in ethereal settings: dreams, distant voice-overs and flash-forwards. Leaving the primary action to focus on the back-room intrigues and political upheavals.Generally speaking, it takes the established source material, but paints it with the Villeneuve brush. The movie has that visually sleek minimalist style, where heft is rather communicated with sound. Those are the same ingredients that made Blade Runner 2049 a good movie. In many ways, this movie is more of the same, there is not much innovation stylistically. On the other hand, why change a winning formula?My only caveat is: You have to love sci-fi to like this. Your typical Grandma will not enjoy this.",
    "98": "Dune is a spectacular movie, but I can't give it 10 having read the book.The visuals are a gold standard. Villanueve is evolving as an artist, and if you imagine what the person who made Arrival and Blade Runner 2049 can do with a bigger budget and a bigger universe, you get Dune. Every single element of the Dune universe is faithful to the book and is beautifully realistic.The cast is great, with Chalamet and Bautista being standouts. Glossu Rabban is given a bigger role than in the book, even though it's still minor, and Bautista does not disappoint.The story: the universe of Dune is complex and the narrative is full of intersecting plot lines. Instead of blindly following the book, the adaptation is more focused and the expositions are not on the nose.However, maybe it's inevitable with a big screen adaptation, but some important plot points were lost. For example, the revelation of Paul about their connection to the Harkonnens, or the more detailed explanation about the imperial politics and the great houses. The importance of the spice production and what it does is not highlighted. Instead of the tangled web and complex origin story, it's basically foreign invaders oppressing indigenous people to extract resources. We are shown the mentats, briefly, but they are basically advisers... and that's it. Where is the mention of the ban on the thinking machines?The House of Corrino, the Spacing Guild, Feyd-Rautha are not shown. Hope they will be featured in Part 2.I suppose that's one of Villanueve's strong points, the ability to focus. But I remember the book well, so it feels like parts are missing.",
    "99": "I grew up watching the 1984 movie and had seen it a hundred times before I even knew the book(s) existed... :) so to me, this movie feels like \"a remake\" and not \"a new adaptation of the book.\"Naturally, I can't help but compare the films.The pacing is much slower here, and I feel it gives the story a \"proper epic\" feel without going full Peter Jackson (The Hobbit/3 movies).There are enough differences between the two to constantly keep things interesting, though I feel some things are better explained in the 1984 version (less confusion and explaining things to my wife).Overall I was pleasantly surprised by this version, as I wasn't super-excited by the the first trailer.Given the strange economics of today's movie world, I'm not sure how the studio will decide whether or not to go ahead with Part 2 ... but I intend to vote with my dollars by seeing this at the theater at least one more time.Thanks!",
    "100": "The original Dune film created and released by David Lynch is undoubtedly a cult classic film. This 80's version of Dune was epic with grand visual cinematography, breathtaking costumes and a story that absolutely is a masterpiece. Where the original falls short is on flow and pacing. It dragged out in some areas.The new Dune film created by Denis Villeneuve contains many similarities when compared side by side with the original. In fact, the new Dune more closely follows that novel, and instead of having one long movie like the original, the new Dune fits about half of the original Dune story into a 2.5 hour film whereas the original fit the entire novel into that same 2.5 hours.The good news is that by splitting the novel into a 2 part film such as Villeneuve has done, it captures more of the novel in total. The result is a more detailed dive into the Dune novel that effectively eliminates many of the pacing issues that plagued the original film.The cinematography is next level on visuals. The world of Dune is breathtaking to see visually. The costumes are unique and gorgeous to view. It is very clear that Dune is a film with a massive budget...something that is quite rare to see anymore. Studios are more careful than ever when it comes to doling out the budget for blockbuster films anymore. In recent hits the only films with such large budgets are usually just Marvel films, so it is refreshing, unique and simply a visual treasure to look at this blockbuster film type that is actually filmed in IMAX for that incredible experience.We know the budget is there, but how about the story? Since this films source material comes from Frank Herbert himself, one simply could not have asked for a better story. In fact Dune is quite often hailed as the single greatest sci-if novel EVER created, and that is an accolade that is no small feat! The key was for Villeneuve to accurately convert that story into film accurately. I am pleased to say that this was clearly handled with kit gloves and deftly converted in a very effective manner. In my opinion we have an INSTANT CLASSIC film! The story and even the pacing is as close to perfect as many could have hoped!The acting and actors for Dune is simply a roster of some of the most talented A-list thespians on the planet! I could name this list for you here, but it is long and \"star studded\" as they say. The acting is fantastic and well performed across the board. The surprise performance out of an already amazing list would surprisingly go to Jason Momoa and Josh Brolin who brought \"sizzle\" t9 their respective roles! Additionally, the role of Paul by Timothy Chalomet was good but particularly Rebecca Ferguson as Lady Jessica is a stand out for sure.This film is absolutely worth the money to go \"experience\" at IMAX. Notice I said \"experience\" as opposed to saying watch? This film in IMAX is just that type of film. Most people watch films, but Dune is a movie to \"experience\" if you are able to attend in IMAX. This show ranks very high across the board in every single category, but the entertainment value is particularly high, something that can be difficult to achieve in such a long run type film.9.5/10. I haven't really ever issued a perfect score to any film, but since I am unable to review score an IMDB film at 9.5/10, I then give this film score a 9/10 official review. I have only ever given out such a high score once, and that was for Game of Thrones who I rated the same. Do yourself a favour and view this in IMAX, worth every penny!",
    "101": "What can I say. Not only did I watch this movie, but my body was astrally projected to Arrakis.I got goosebumps whenever Hans Zimmer's melody pulsed through every sequence in this movie. I was surprised by the scale of the film's production. I went into trance together with Paul Atreides when he discovered that the tragic fate he envisioned was coming true.This movie only partially loses because it's half of a whole. I want to see more but I can't.Boring! For those with terrible taste, I have no doubts about that.As for the criticism of the white savior, read the damn books. Or just pay attention to what you're watching.Midway through the film, Paul has a vision of the future, in which the dangers of charismatic leadership elevated to godhood are thrown in the viewer's face. You have to be really mindless not to notice.This is one of the most epic sci-fi movies of all time. Watch it on the biggest screen you can.",
    "102": "Before watching the movie I thought the many good reviews of the film were fake, but after having seen it... this is hands down one of the best films of recent years!Superb visuals not just in terms of CGI but the graphic storytelling via retro archaic style of buildings, atmospheric settings and lighting and soundtrack, stylish costumes, spectacular desert landscapes and retro high-tech machinery, great cast and acting, clever story with intrigues and political backstabbing all work extremely well together.This remake is one of the few exceptions that by far outguns the original on all levels, and is sci-fi cinema at its best!Only negatives are: the movie's a bit drawn out in the end and could have been 15mins shorter. The \"he's the chosen one.. oh but he doesn't look like it\" mantra is a repetitive and a lame cliché - it's unnecessary to mention it and the story would work well (actually better) without random people constantly saying it. Also, the characters are a bit flat and linear and could have a lot more depth or controversy to them, indicating their motivations, inner tensions, what drives them etc. - so far the characters seem a bit like puppets on autopilot.But all in: amazing and potentially epic film and looking forward to part 2.",
    "103": "I felt like I was Paul Atreides - since my memories of watching the original 1984 film flashed before me as a visual guiding force while journeying through the desert planet of Arrakis. As a child, I loved the 80's aesthetic, the practical effects, and the over-the-top science fiction aspects of \"Dune\" - But I failed to understand the core meaning of the story. I'm thankful for having had an experience with the mythology of this tale before since it helped navigate me through this new re-imagining. Which culminated in a surprisingly emotional and immersive cinema visit.All the exposition, all the time put into introducing the people and the worlds - It all continues building and building - Until all those elements find themselves holding hands - And your patience is rewarded with a feeling of relating to the potential of Paul's destiny. All of us are searching for what lies beyond that desert. Beyond that fear, a destiny awaits. And as they say in the story: \"Fear is the mind-killer\". Congratulations to Denis Villeneuve and his team! They nailed it! It made me reminisce on the past fondly, whilst also being in the present with eagerness to continuing striving towards the horizon. A very specific feeling, I know. But that's what the movie did. Plus, re-visiting that image of those iconic Frank Herbet sandworms echoed back souvenirs from a simpler time that I thought I'd lost.PS: It was a bold choice to only adapt half of the book. Fingers crossed that we aren't left hanging with this cliffhanger. Much grandness is left to be witnessed.",
    "104": "I would give it just 9.5, because I think the importance of water came up short. And I also missed the banquet scene, what could have been a really clever scene with good dialogues.But the film is absolutly great, the actors are without exception awesome, the scenes/ the dialogues are perfect, the length of the film is perfect, it's close to the books (great story) and the visual effects are insane (beautiful scenes -> action/fight scenes/nature/spaceships/worms/citys). You can see how much love Villeneuve and the actors put in and I really want to see more. This is the beginning of a new universe. The time I have to wait for part 2 will be hard.In my opinion Villeneuve and Nolan are the best regisseurs in the world and they both made their visual/ their (characteristic for them)/signature masterpiece with Dune and Tenet. I love it.",
    "105": "The biggest question with this film was: was Villeneuve able to deliver? You got one of the most popular sci-fi novels, a cast of talented and very charismatic actors, and a generous budget. Was Villeneuve the right choice to direct this film; could he muster all these resources and use them effectively to tell a story? Could he make a film that is enjoyable to watch and at the same time adapt a convoluted cult-classic on which numbers of filmmakers have stumbled?Turns out, the answer is yes.The real cornerstone of the movie, if you put aside the special effects, the plot and the visual storytelling, is the pacing. The film takes its time and lays out confidently most of the techno-babble and sci-fi jargon upfront. Yet, it is not boring or annoying. In any situation or scene, you know what is going on, who is doing what, and generally speaking the action is clear. That is something that was absent from Lynch's Dune. It is challenging to deliver a lot of information in a digestible manner, especially with the sort of sci-fi such as Dune. But the movie does it patiently and clearly. Most of the time a concept is set-up in one scene and then shown or explained in the next. Not only was everything clear in terms of stakes; but it was also engrossing in terms of tension. Not only do you understand what Paul is up against, but you want him to succeed.The story of Dune is the story of Paul Atreides, the young heir of a noble family. One thing that is cool in Dune is: it's feudalism in space. So, you get something that is closer to Game of Thrones than Star Wars.The movie follows the adventure of young Paul. How he makes the transition to a new world, has to come to grips with becoming a leader and is destined to become a prophetic messianic figure. That stuff is good, but I always thought it was the weaker aspect of the novel Dune. The story of a young boy who discovers awesome powers that leads him to rule the universe is pure power fantasy. It is more appealing to young boys than anyone else. Thankfully, the plot weaves-in the space politics and keeps your attention. It presents a lot of that messianic text in ethereal settings: dreams, distant voice-overs and flash-forwards. Leaving the primary action to focus on the back-room intrigues and political upheavals.Generally speaking, it takes the established source material, but paints it with the Villeneuve brush. The movie has that visually sleek minimalist style, where heft is rather communicated with sound. Those are the same ingredients that made Blade Runner 2049 a good movie. In many ways, this movie is more of the same, there is not much innovation stylistically. On the other hand, why change a winning formula?My only caveat is: You have to love sci-fi to like this. Your typical Grandma will not enjoy this.",
    "106": "Dune is a spectacular movie, but I can't give it 10 having read the book.The visuals are a gold standard. Villanueve is evolving as an artist, and if you imagine what the person who made Arrival and Blade Runner 2049 can do with a bigger budget and a bigger universe, you get Dune. Every single element of the Dune universe is faithful to the book and is beautifully realistic.The cast is great, with Chalamet and Bautista being standouts. Glossu Rabban is given a bigger role than in the book, even though it's still minor, and Bautista does not disappoint.The story: the universe of Dune is complex and the narrative is full of intersecting plot lines. Instead of blindly following the book, the adaptation is more focused and the expositions are not on the nose.However, maybe it's inevitable with a big screen adaptation, but some important plot points were lost. For example, the revelation of Paul about their connection to the Harkonnens, or the more detailed explanation about the imperial politics and the great houses. The importance of the spice production and what it does is not highlighted. Instead of the tangled web and complex origin story, it's basically foreign invaders oppressing indigenous people to extract resources. We are shown the mentats, briefly, but they are basically advisers... and that's it. Where is the mention of the ban on the thinking machines?The House of Corrino, the Spacing Guild, Feyd-Rautha are not shown. Hope they will be featured in Part 2.I suppose that's one of Villanueve's strong points, the ability to focus. But I remember the book well, so it feels like parts are missing.",
    "107": "I grew up watching the 1984 movie and had seen it a hundred times before I even knew the book(s) existed... :) so to me, this movie feels like \"a remake\" and not \"a new adaptation of the book.\"Naturally, I can't help but compare the films.The pacing is much slower here, and I feel it gives the story a \"proper epic\" feel without going full Peter Jackson (The Hobbit/3 movies).There are enough differences between the two to constantly keep things interesting, though I feel some things are better explained in the 1984 version (less confusion and explaining things to my wife).Overall I was pleasantly surprised by this version, as I wasn't super-excited by the the first trailer.Given the strange economics of today's movie world, I'm not sure how the studio will decide whether or not to go ahead with Part 2 ... but I intend to vote with my dollars by seeing this at the theater at least one more time.Thanks!",
    "108": "Dont get me wrong, the movie does everything right in bringing the book to life. The visuals are gorgeous and Frank Herbert's work is clearly understood and respected. But there is something slightly off, cant really put my finger on it. While the attempt David Lynch made (Dune, 1984) was a bit too out there and the filmmaker took too many liberties, Denis Villeneuve (Dune, 2021) was perhaps a bit too determined to not make the same mistake twice.Ive read the book a few months ago so I was still perfectly aware how the story develops. This made the film, dare I say it, a bit on the slow and dull side here and there. This was, like I said, more than made up by the gorgeous visuals and sounds, but I cant shake the thought that the story could have been told in a slightly more energetic way.All in all, a small complaint, and people who are new to the franchise, which I suspect will be many, perhaps do not feel that way. In the end I left the theatre more than satisfied, so still a 9/10 for me.",
    "109": "It's such a shame when brilliant directors like Denis Villeneuve start being given massive budgets to make films and start relying on that rather than good story-telling. The same thing has happened to Christopher Nolan. These guys started their careers turning nothing into pure genius. Now they just seemingly want to go out and spend a $300 million budget and forget that if your story isn't interesting then there is no point.Boy oh boy was this film bland. I was looking at the cast before watching the film. There are certainly some notable names, but I noticed a lot of them are also known for giving very dry performances. There isn't a lot of x-factor amongst them. That's very noticeable in the final product. No performance in the film stands out in any way.To be fair there isn't a lot of interesting things given to them in the script to work with. I was shocked how little character development there was. We are just thrown in and told to side with these people, but no justification is given for it. And because the film is so unrealistic it is impossible to relate in any way to what they're going through.This one wasn't for me. I hadn't exactly been itching to see it, but it was one that I had an outside hope of at least being entertained by. Not the case though sadly. A generous 4/10.",
    "110": "I've not read Dune, so I don't know how close it is to the book, so I'm going to have to judge it on its merits as a standalone film.And with that, this is going to sound nitpicky. If you've seen Denis' other works, you kind of know exactly what you're getting with Dune. That's not necessarily a bad thing; in fact I thought, as I saw the trailer ages ago, that Villeneuve was just about the perfect director choice for this movie, and after having seen the film, nothing has changed. Its just....Like, I get that this is set in the far future and ergo there will be lots of unique weird designs etc. But can we change it up a bit? And I would appreciate some spacecraft designs that make at least moderate physical sense, y-know?Although the movie clocks in at a meaty 2 hours and 34 minutes, somehow it still felt too short. Even knowing that this is one of two parts, I think that an extra half hour, Endgame-style, to flesh out a bit more worldbuilding and supporting characters would have helped a ton. A lot of characters' screen time felt comparatively way too short and you don't always know everything you would want to ahead of time. I would gladly watch a 3 or even 4 hour version of this movie.And while it was a wise decision to split a book like this into two parts it kind of suffers from Mockingjay syndrome where a lot of the movie is setup for part two. Don't get me wrong, a lot happens in the film, but once you watch it you will understand what I mean by that.That being said, the subject, theme, and visuals fit Denis' strengths as a filmmaker. I presume the flashbacks (forwards?) are part of the book's narrative as well. It is definitely a moviegoing experience and I am absolutely looking forward to part two.You already know the acting is impeccable with an all-star cast and the leads carry their roles. Timothée and Rebecca are absolutely perfect.But I can't rate the film overall as high as some of the other folks here.TL;DR: Does Dune stand on its own merits? Yes, it does, but expect some mild déjà vu. (Unintentional choice of words, but it's kind of funny that that phrase is also of French origin.)",
    "111": "I first read the Book in 1981 at the age of 12, I know all the series and the history and lore it was the first sci-fy books I fell in love with. I knew the Lore it could not be made in to a movie. This is true the tech was not there.Well 2021 the tech is here and Denis brought the Dreams of this Sleeper to life. The scale was truly worthy of the story, I hate using the word \"Epic\" but in this case it is warranted.I gave it a 10 because we cannot give it a 9.5. It is not a perfect 10, there is issues with the story (There is a lot of backstory missing people who have not read the books will be lost because of) It really needed a Princess Irulan, Opening Monologue, the one we got was useless and a waste of bringing the casual audience up to speed.The story Moved along at a slow pace when so much more could have been added in that time instead of wasting it on to much of the \"epic scenery / shots\". Final draw back was way to much of of the Soundtrack, Most shows dont have enough this one was way to much which in certain scenes detracted from the Movie. Less is More in some cases and this one needed less Hans Zimmer.It is well worth seeing on the Big screen, then multiple times at home.",
    "112": "While it indeed was much better than the first \"Dune\" film, and while it is tremendously worth re-watching, SO much of the books was missing.The problem with that, is not with the film or the filmmakers. In fact, the film is quite beautiful and very carefully and well-presented so that anyone, familiar or unfamiliar with the original works can understand it and gather the main story. What is lost, is some of the lesser story and with it, Dune's foundation.No studio could really, or should have ever, really, thought that such an expansive work could be covered in one or two installments or films or that a budget allotted for two films could ever cover what the true telling of the Dune works would entail.If I had to guess, the remaining chapters will be renegotiated into two more films. Anything less, would leave out way too much. Plus, if this is their first offering, they know they have an audience for it now.",
    "113": "This is the movie all of us Dune fans have been waiting for the past 55 years! Denis Villeneuve said this was the project which he had been dreaming of since he was a kid, and he finally accomplished it. Many people thought a movie adaptation could never capture the intricate details of the plot with all its political intrigues and the richness of the world Frank Herbert created, and earlier attempts haven't been this successful. This movie however, brings the world to the screen as I always imagined it.I loved the cinematography, the imagery is stunning. The contrast between the mist of Caladan and the dust storms on Arrakis is characteristic. Wide shots of desert and rock are so vivid you can almost taste the sand and the spice while watching.The opening with Chani narrating about Arrakis draws you into the story, but it might have had some more action in the beginning of the movie. The dreams of Paul are returning several times. Action scenes are alternated with contemplations and explanations, which makes the movie feel like a long exciting dream. All the main actors have done a great job, especially Timothée Chalamet. I don't know why the character Piter de Vries was left out, but all the other characters are portrayed very well.Of course this is only part one, so the movie has an open ending, but I can't imagine someone not wanting to wanting to see part two after watching this. I'm definitely looking forward to it!",
    "114": "That Denis Villeneuve has mastered the sci-fi-genre like no other has been known at least since Arrival. Accordingly, my expectations were high for his heart project Dune, originally a famous book that Villeneuve has loved since childhood and which, after years of delay, has now made its way to the big screen. Villeneuve is a great champion of cinema in danger of extinction - and what he already brought with Blade Runner 2049, he delivers this time on an even more extreme scale: a MOVIE FOR CINEMA.Since I see Dune as a potential saviour of cinema, it is more important this time to write about the film per se and not its actors and characters. These should be familiar to most beforehand anyway - both as book connoisseurs and non-connoisseurs. Because even though Villeneuve again relies on his tried-and-tested visual exposition, some prior knowledge of the family homes, rivalries and distribution of roles is certainly not a disadvantage. Therefore, rule number 1: roughly memorise the premise in order to be able to follow the plot comprehensively. As for the actors, it remains to be said that they all put on their absolute A-game. Timothee Chalamet shows that he can dominate blockbusters at a young age, although he is not the best despite a bravura performance. Namely, that's Rebecca Ferguson in the role of his mother, who pretty much downplays all emotional facets. All except joy, because no one really feels that in Dune. Now and then there are pseudo-funny one liners, but they are always overshadowed by the fundamentally dystopian and catastrophic atmosphere. This is just as well, because Villeneuve is not exactly known for making humorous and positive films. So, rule number 2: don't expect any fast-moving fireworks of words. What Dune definitely is is an audiovisual masterpiece display that you only get to see in this form every few years. Watching this film at home would almost be a betrayal. Such a feat does not deserve this act of cosiness; here the cinematic experience has monopoly. From the very first second, we are accompanied by elongated shots of the sky, high-tech headquarters and desert dunes. These left such an impression on me that after the credits I was at a loss for words and my legs were shaking. Rule number 3: Go into the film as relaxed as possible, because you won't get that feeling again so quickly afterwards.This guide on how to approach Dune properly is necessary to fully engage with the film. Otherwise, it could be complicated to get excited about it. Sure, the images should impress everyone, because this is where Dune is truly unique. The narrative style, however, is something that personally keeps me from giving Villeneuve's childhood dream the highest possible rating. In fact, I expected the film to be even more sedate and wordless, so in that respect I was pleasantly surprised after quite a few dialogues in the first half. Of course, Dune is not a film that needs many words, since its visuality speaks for itself anyway. Towards the end, however, I occasionally had the feeling that it didn't quite know when it wanted to end. Lethargic scenes suggesting that the film was now over were still followed by surprising twists. But that is a minimal criticism of what is, in my opinion, the ultimate revelation for cinema and metaphorical narrative structure.",
    "115": "Denis Villeneuve's adaptation of Frank Herbert's science fiction novel is a technical display of modern wizardry, an enormous and often thundering spectacle. It's best described as a sort of mix between Game of Thrones and Star Wars with religious parallels, which isn't very surprising since Herbert's novel was George Lucas' inspiration many decades ago.Dune's story is full of rich and often bizarre mythology, political conflicts on a galactic scale, raging battles between opposing forces and fantastical prophecies.It's a meticulously crafted vehicle to fully immerse you into the world; the movie takes deep care to establish lore and characters, unfolding at a slow pace. It's brilliantly directed in a calm but constantly tense premonition.The acting is superb all around, with standouts from Rebecca Ferguson as Lady Jessica and Stellan Skarsgård as the villainous Baron Harkonnen. The latter manages to give the story a menacing, borderline supernatural presence.Hans Zimmer's score invokes historical grandeur and a sort of legendary, Arthurian voice. Greg Fraiser's cinematography is vast and big, giving the story's magnitude the scope it deserves. This is a very unique looking production and it shows up on set and in costume, tremendous artwork and design.As far as criticism goes, the movie lacks a proper ending. Sure, it's not the first movie to end on a cliffhanger, but it could still warrant an understandably inconclusive feeling. Aside from that, the pacing is also a possible deterrent for some viewers. It's long and methodically structured.",
    "116": "For decades, everyone's been sayign that adapting \"Dune\" would be impossible. Too much detail, there is no way to preserve that detail in a movie format. But Denis man, you've done it. This is an absolute masterpiece.From the incredible performances, to the writing, soundtrack, locations and cinematography, attention to details, costumes, this movie is a spectacle and the story is shown in incredible fashion.You NEED to see this in the cinema, it is not just a movie, but an experience. I haven't had a movie in the back of my mind for days after seeing it in so many years. It is mature, it respects you and doesn't explain things to you like you're stupid. It throws you into this gigantic, future world, full of intrigue, darkness and sheer epicness.For me, the best sci-fi movie I've seen.",
    "117": "Dune (2021)By now, it is undisputable that Denis Villeneuve is a master of creating mesmerizing visuals and Dune is probably his biggest achievement as every single frame looks surreal. Frankly, I expected nothing less but ironically, the gorgeous visuals are also the reason for the film's weaknesses. On one side, they create an immersive experience; on the other, it feels like the director is trying to show off instead of crafting a compelling story for the audience to connect to. Nevertheless, it is a movie and it is bound to deviate from the source material so I will try to judge accordingly.While Villeneuve is an artistic genius, this isn't one of his personal art house projects but an adaptation of the greatest Science Fiction novel, which naturally carries expectations. The world of Dune is as complex as that of Game of Thrones where everything is intricately connected and the multilayered characters are filled with ambition; not to mention the philosophy. Unfortunately, none of this is created here and half of the big name actors are reduced to saying a few lines in favor of showing 15 pointless visions of Zendaya in the desert.By struggling to establish the characters and the narrative, the film ends up lacking a soul and as result, it is impossible to care about anything. Yes, every shot looks phenomenal but it doesn't stir a single emotion and no matter how pivotal the scene is, it just feels hollow. The excessive long takes leave little time for development and hence, key narrative moments end up being rushed. Even some action scenes feel underwhelming as they lack any energy and almost feel forced.Despite the anticlimactic end, I am eagerly waiting for Part 2 which will hopefully explain the world and allow the remaining characters to flesh out. Chalamet did a decent job as Paul but he needs to put on some muscle as he is pitiful to look at during the action sequences. At the end of the day, Dune is one of the most beautiful films that I have ever seen with the aesthetics and sound being worthy of IMAX. Sadly, the essence and complexity of Dune itself feels either rushed or lost in between the grains of sand and the panoramic takes.Movies.shmovies in Instagram for movies and tv shows.",
    "118": "Dune is a very well done movie with a great cast, music, visual effects, scenery and the direction of the camera. It's an amazing feeling to see a movie that is payin an homage to the book.Frank Herbert made a great book about society and an messiah that is getting the feeling of a savior of the people. Denis Villeneuve took that book and made the best movie of the year with Timothée Chalamet, Rebecca Ferguson, Oscar Isaac, Jason Momoa, Javier Bardem, Josh Brolinand many others.Timothée Chalamet shines in this role as Paul Atreides. He takes it all like he is the character and makes an amazing performance. Also he has the same qualities as Daniel Day Lewis and maybe he will be the next Lewis (John Campea said it first). Jason Momoa and Javier Bardem doesn't do much in the movie but while their on screen, they don't act the are the characters as does everybody else, but I just had to mention this two actors.The music is by Hans Zimmer and although it's all about the sounds and not the music that works for me. When Paul and his mother are fleeing for the second time that music was breathtaking. Zimmer has completely changed the way I listen to music, 'cause even I now will listen to just sounds and get emotional over it.The camera is so on point with all of the scenes. It has a way of showing you every little thing with out the audience yawning. I felt that the camera and music were really beautifully placed together and I had an emotional feeling to them at the same time.The plot is is really good but we have seen it already by David Lynch, this time we were waiting to see something different from the director of Arrival, Sicario and Blade Runner 2049, Denis Villeneuve. He is the master at tge taking time and gets you to feel the movie.",
    "119": "Thank you Denis Villeneuve for this thoughtful, cinematic, intelligent, complex but not overcomplicated film adaptation. I have never been able to get to grips with the Dune universe because the previous adaptations simply could not make me understand what this world is all about.That has now changed and I haven't had so much desire for a second part since Lord of the Rings.And the best thing about it is: no comic relief, no overplayed characters. The film is very adult and therefore refreshingly different from the other current Star Wars like Movie rubbish.And I don't understand the people who complain about the ending. I think the film stops at exactly the right place and makes you want more. And I thank the director for taking the time to calmly introduce us viewers to the world.I really hope there will be a second part, I can't wait.",
    "120": "I am generally very critical of movies based on books, and definitely did not like Villeneuve's Arrival at all. In this case, as has been said frequently, it is a tad slow paced, but the cinematics, the cgi, is flawless. So many takes are works of art, it is a beautiful movie, there is no doubt about that. The plot does stick mostly to the books, it is enough and sufficient for it to be called Dune, not for example what has sadly happened to The Foundation. This is a take on Dune, there is no doubt about it, but it is a subdued take in terms of plot and the strangenesses (new word) the book has. There are a few missed opportunities, with the Harkonnen, the Sardaukar, Navigators, etc. By this I mean that although the uniforms, the visuals etc. Are amazing, the 1984 movie was much more weird and intense in terms of portraying a foreign or future universe. This is much more mainstream, the plot could take place in any average sci fi world filmed before. As amazingly grandiose as it is, it lacks Duneness (new word again), I would have hoped for a bit more spice in the movie.I will watch it again, as it is a very good movie, and would be quite awesome were it not for the book it is based on. But, having read the books (all of them) multiple times, it does fall short when compared to them. I would place it between the TV series and the 1984 Dune, closer to the original movie than the series, as it is stunning, but not as gruesome and intense as it could have been. The fremen also lack a bit of punch, I will not go on, as I think the point is made. Looks amazing, but lacks a bit of spice.",
    "121": "Is it a good, fun and visual stunning movie? YES, without doubt. This is by any means a slow burning sci-fi opera with one of the most beautiful cinematography in history. Is it a masterpiece? NO, absolutely not. I'm a huge Villeneuve fan. Blade Runner 2049 is one of the most underrated movies in years in my opinion. The atmosphere he created there almost was perfection in it's finest form. Somehow he tried to do something similar in this movie, and it just didn't work out for the best. Visuals are important and are decisive factor for the atmosphere in the movie. Villeneuve does this as none other. You will be flabbergasted at many occasions. This in combination with the sound mixing and music by Zimmer really works out well. I love how he captured the somewhat religious vibe in the costumes and decor. Not many movie directors are able to let you believe this world could very well exist. The architectural minimalist approach of the decors really help to get you into the story. And here is where Villeneuve gets it wrong. Somehow the story never really gets launched. Mainly to do with too many bleak characters who are not able to carry the story. This results in a visual stunning sci fi opera with not too many story. And the little story you get is just too little. If you have not read the book you will leave the theaters with the feeling still not knowing what it was all about after 1 1/2 hours. The main problem was that Villeneuve couldn't decide where to end part one, resulting in a messy plot that wasn't a plot.Still I absolutely adored this movie. Because of the excellent atmospheric style in the movie you could not, not be mesmerised with what was happening on the screen. I have big hopes for part 2 where the story will actually really start. Perhaps splitting this movie in only two parts wasn't the best decision. Many people claim it was to slow. I think it was not slow enough and should really have focused more on an audience that doesn't know the full story.",
    "122": "I have long waited to see this new attempt at turning Herbert's book into a movie. The ingredients sounded promising (Villeneue, Zimmer, cast, ...) as well as the praise the movie has received so far.Trying to immerse myself into the universe the film constructs, or better, translates from the book, I need to say for me there is something missing. I've seen Lynch's adaptation, have read the book, and played the Dune games (esp. Dune 2) day and night in my teenage days. Maybe it is because of this background, that I felt empty during most of the runtime of the movie. The book is difficult to translate to the screen, depicting not only the political conflicts, but also the inner conflicts and motivations of its protagonists vividly.The movie tries not to deviate too much from the book's storyline, which I have to give Villeneuve credit for. But in contrast to Blade Runner 2049, the movie runs quite flat on the emotional side. But as said, maybe because I already know what happens next, and have already immersed myself into the imaginative Dune universe countless times, I felt like I was in a half-dreaming state phantasizing these visuals, but not actually watching a captivating story.There is little dialogue and another point of critique is Zimmer's work in this. Someone here wrote that he considers the Dune soundtrack Zimmer's magnum opus, but to me this was Interstellar (2014). The score in Blade Runner 2049 was already quite minimalistic, but I credit Zimmer for at least using the CS80 like Vangelis did, thereby finding the right sounds for the futuristic setting. But here, in Dune, there is even more absence of any theme/leitmotifs, it's just a combination of a few chords and drones which sometime do not match the film's flow, with some occasional ethnic vocals which are absolutely over the top. It feels like Zimmer tried hard to find the right music for this movie, but in the end, delivered something absolutely generic that a young aspiring composer would probably be ashamed of.Nevertheless I think I can recommend watching the movie, especially for people who have not read the book. I hope Villeneuve will be able to deliver the second (and third?) part, because probably it will turn out that the movie was deliberately filmed in the style of a two hour long prologue.Just do not expect too much; I think the praise that the movie has received on its own is a bit too much for the actual product, but in the end, let's see where this franchise goes, probably this Dune will be the perfect movie if seen as a part of a trilogy.",
    "123": "To film fans - A very beautiful and well written film, unfortunately falls a little towards the end after a strong start, and robust progression.However this is a 2 part film so proceed to the movie with that mindset, because there is going to be a lot more in the 2nd featurette.Perfect casting, perfect performance. There was a difficulty in understanding the words from some of the characters.Unsure if this was a creative decision or editing error, but the movie looked too dim at some parts and could use a bit more brightness I feel, to capture facial expressions and setting better, nevertheless the cinematography is one of the most beautiful I have seen, this truly is picturesque beautiful like the milky way at night.To Dune fans - Frank Herbert would be so happy, the film captures the novel's spirit, and you will truly feel Paul's wit, anger, sadness and journey to Muad'Dib, thanks to Timothee Chalamet and the production.Expect few minor changes; Sardaukars are more dangerous, Baron doesn't look as disgusting, Fremens are much accurate and cooler, memorable lines from the novel are not in the film, dialogues spoken from different characters than the original from the novel.We all know how difficult it is to adapt Dune, if people though Lord of the Rings was hard, they clearly never read Dune. Do not expect perfection because the lore is so deep, it would require multiple prequels, or a prelude to Dune prologue explaining the vast universe of it. All and all, you are going to love it.Looking forward to the 2nd part, and hopefully the rest of Frank Herbert's Dune in movies."
}