{
    "0": "There's Something In The Barn showed some promise but ultimately it doesn't work as either a horror or a comedy.An American family moves to Europe when the father inherits a house from his uncle near a small village in Norway. It turns out the barn has a barn elf living in it and in order not to get it mad you have to follow some rules, like in Gremlins. Bad things happen if the rules are broken and the elf calls on reinforcements and they go on a murderous rampage.The family is for the most part extremely annoying and hard to root for. The rules make no sense. The elves don't like loud noises or bright lights and yet they have a party with very loud music in the third act of the film. A majority of them live in the forest, which begets the question why they are called barn elves if they live in a forest.The humor is repetitive and gets boring after awhile and some of the decisions the characters make are dumb. After a gruesome murder the family has a conversation that feels completely out of place.Overall the story is weak and makes very little sense. The comedy is mostly silly especially from the father and falls flat. Do yourself a favour and watch a Finnish film called Rare Exports: A Christmas Tale. It's vastly superior.",
    "1": "Bill (Martin Starr), his new wife (Amrita Acharia) and his kids Nora (Zoe Winther-Hansen) and Lucas (Townes Bunner) have all moved to Norway after a mysterious death in the family. As they work to transform the property into a bed and breakfast, they discover that there's an elf (Kiran Shah) living in the barn. He seems nice enough, he'll help out and only asks that there are no major changes, no bright lights or any loud noises.Of course things are going to go wrong.Directed by Magnus Martens and written by Aleksander Kirkwood Brown, consider this another horror film for the holidays that you may add to your rotation. If you've ever wanted to see garden gnomes decimate human beings, well, this is for you.",
    "2": "Can't say it's bad.The plot is very flawed, the acting makes no sense in most parts. It was classified as a dark comedy, horror and fantasy film. Only the fantasy part was kind of right, and even there is mostly due to the elfs reference than any fantasy at all. In the first half of the movie you get the feeling that the elf's are fast and hard to see, that would fulfill the fantasy part, then they slowly grade down to children in costumes moving slow and ultimately incapable of putting up a fight. That makes the whole thing kind of pointless and nonsense. I felt deeply diving into the \"if only the remote was by the couch...\" state.Can't say it's bad either. It's a nicely shot flick, with nice landscapes and good pace. But still fails being horror, fails being comic, just...a regular Sunday afternoon nothing else to see and it's already on kind of movie.",
    "3": "And im really honoured and proud of how they show off our countrys beauty and comfort, even though its cold and full of bloodthirsty elfs and elks...i think this is a really good x-mas parade of a feature movie, with hints of many many xmas movies made in the past...Technically and visually its an ''analouge'' masterpiece that leads you into a dreamworld of fantasy,and love actually, not in the shape of kiss and hugs, but in a storyline that even an american barnelf wouldve appreciated and envied...as a horrorpiece its very light on the gore, and as a dramathriller and comedy its unfortunately struck down by some very saggyslow acting moments during the most violent and dramatic moments. This is the parts that will turn off the most squemish of goregalore horrorholic, but overall assessed and assembled im amazed by all the ideas they put into the storyline...its a pity that the rest of the world miss out on the norwegian language and the dialect pieces of it, and funniest of them all is eldar vågan of the ''vazelina bilopphøgers''(a norwegian pop group), a surprising and most heartfelt choice of an offspring from the norwegian valleys...otherwise the acts works, especially among the ''norrøn''-speaking elfs.Its a film with few special effects, so what the technical crew, the camera, light , sound, location , set decoration, costume, make up design and musical score departments has brought forward to you is just glitteringly amazing.Therefore the grumpy old man wholeheartedly recommends '' theres something in the barn'' for what it is, and this review may let the filmakers learn to arrange some better actionacting by the main cast in the most prudent moments in forthcoming sequels. Hitherto im impressed and so is my grumpy old spouce...its not for the minorest minors, but with adult supervision , a 7+ child could eat this one.I hope for a follow up, this will be a classic for generations to come.",
    "4": "I was very happy to hear that a Norwegian horrorcomedy christmasmovie was going to be in the cinema. However, my excitement did not last for long.First of all, with comedians like Henriette and Calle how did they end up having no funny jokes at all? Second of all, the american actors was just mediocre at best.Then the worst part was the plot. The movie is a parody/recreatment of Gremlins and had so much potensial to be good. The jokes did not land, the «nisse» did not speak any known language and they did not have the typical requirements for being a nisse in Norway.Then there is the allowed age for entering the movie. The movie is for 12+? There is literally a woman being cut to a million pieces under a snow scooter and there is blood everywhere. This is no film for a 12+ year old!!No, nothing in the movie made sence. The actors were terrible and just overall not worth your money.",
    "5": "The Nordheim family is moving from California to a remote farm in Norway. Bill Nordheim (Martin Starr) had inherited the place from his uncle. Carol (Amrita Acharia) is his new wife and stepmother to his children. Teen daughter Nora is angry with the move away from her friends. Young son Lucas discovers an elf infesting the barn.This is a horror comedy. The horror part is ok although they may have shown the elf a little too soon. I would have kept him in the dark for longer. The comedy is mostly Martin Starr being Martin Starr. Initially, the casting of the kids didn't make sense. I don't see them as Martin Starr's kids. The stepmother part helps a little, but I still don't buy them as Starr's kids. The daughter is a drag until she starts using the bat. There are some fun kills and the multitude of elfs is chaotic fun. In the end, this is not that good, but it has a few fun moments.",
    "6": "Being a Norwegian, I might be biased, but there are a few things that could be better.The films plays on cultural differences between Norway and the US, but the actors could be more \"stereo typical\" American. And it would have helped if all the actors where actually americans with US accents (the two women in the family did not talk with American accents)\nThe characters themselves could maybe have been more inspired Clark Griswold's family:)As for the scenes with the Norwegian police, they seemed poorly developed.The concept of the Christmas Dinner with the neighbours, and the need for alcohol before we(Norwegians) get social are unfortunately correct, but these scenes could also be fleshed out. I think every Norwegian have experienced funny situations at what we call \"Christmas table\" (Christmas party that almost every one arranges in November/December) at that could have been included.As for why they use the term \"elf\" in the movie, it seems a bit wrong. In Norway we use the term \"låve nisse\", similar to \"jule nisse\" that means \"santa clause\". So a better translation would be \"Barn Santa\",, but i also see that \"gnome\" have been used.The fights with the \"elfs\" in the House where a good idea, but poorly executed.Overall, the movie is neither a very good comedy or a horror movie, but an ok watch.",
    "7": "I wasn't expecting much from this movie and went into it with very low expectations, especially seeing some quite negative reviews on here . But it's just great ! It's not perfect , but it's a ton of fun and very funny in places . It's very Christmassy , music , settings and overall look screams Christmas.The biggest negative is the film takes a little too long to get going . They could have chopped a good 15mins out of the first 40mins which would solve the pacing issues .But be patient and stick with it , because it's an absolute blast . Perfect for adults and young teens, just enough gore and swears to satisfy and enough laughs to keep you grinning from ear to ear . If you like Santas Slay , Christmas Horror Story , Krampus etc you'll love this too .",
    "8": "Culture clash, the superficial American meets the eccentric Norwegian. Clichés? The driving force behind this film. Definitely acceptable visually, quite interesting at first glance in terms of content, rather difficult to digest in terms of realisation. The portrayal of the guests from the USA could almost be described as xenophobic, do the Norwegians have a grudge? The word for this character portrayal is stupid, but that also describes the film. I would also add that the film has no climax, is predictable and quickly forgettable. For all those who were hoping for a new Christmas classic ala Krampus or Rare Exports: forget it!",
    "9": "This is one of the worst movies I've seen all year. And that's not an easy thing to say because I've seen a lot about movies this year. But this one just might be one of the worst.First off whoever wrote this should go back to school. This is extremely poorly written. I think this is supposed to be a comedy? I never laughed one time. I think I've seen the dad in a comedy movie before though? Well he was the dumbest one in this movie, and the unfunniest by far.The horror in it is bad but I'm still giving it two stars instead of one because I do like horror movies and this did have a few good scenes, I guess.2/10 One of the worst this year.",
    "10": "What can I say on the one hand I enjoyed it but on the other it was really annoying. It was a fun family film but went a bit too far with the killings especially with the kids. I debated about continuing half way buy kept watching it just to see the ending. Overall not bad, witty funny annoying at times but overall it was worth watching. Acting was great that's why I enjoyed it. Not all elves are evil. Maybe if another xmas movie is made not to put too much killing and blood then all kids could watch it. I didn't go to the cinema to watch this, I think if I had I would have been mad to have paid to watch it.",
    "11": "I absolutely loved this movie. It was hilarious, silly, corny, and satisfyingly predictable. The setup is that a dysfunctional American family inherits an idyllic Norwegian farm, and makes the big transatlantic move with plans to start an AirBnB. It all goes straight to hell. But they manage to pull together as a family and defeat the demons threatening their farm, their lives, and their family. It all ends in classic Steven King style. Mayhem. My only criticism is there could have been a lot lore blood and gore. And more mayhem.The real story though, is a philosophical story about Norwegian culture- highlighting the metaphorical village troll personified in the form of \"Elves\" living in the barn. The village trolls' seemingly innocuous manner quickly manifests into what it really is- negative, jealous, hateful and destructive forces that delight in ruining for others, especially those who are different and entertain new ideas. Spoiler alert- It was a great pleasure to see them all burn down in the barn- and the ones that survived banished to a museum. Hopefully there will be a sequel- I'd love to be in it and help smoke the rest of them.",
    "12": "The movie had a good premiss, but i think it missed on it's target audience.This movie should have been a light hearted family comedy, without the horror and gore aspects of it.Because i like horror movies so much, i respect when a situation arrises that is difficult to overcome... but i couldn't really get into the family not being able to overpower those little guys... When they invade the house, i was really not worried because, at any point, like it did happen, anyone could just grab a big object and smash their heads in. Which they did, but stopped after the first few.So o think this movie should have just been a children's scary movie, without the gore, because the scary parts weren't scary at all.",
    "13": "If you go into this film expecting a suspenseful and horrifying experience... You'll be really goddamn disspointed. If you instead approach this as a ridiculous and comedic experience with horror elements you'll probably have fun with it.Overall I think that this movie can serve as a good introduction to horror films for people that are new to the genre. There are horror elements and limited gorre but it's all wrapped in a comedic and festive package.The performances in the movie aren't perfect but they're okay for what this film is. It's not a masterpiece and doesn't require great acting.The movie is fine and I'll give it a rating of 4. The reason it isn't higher than that is because the first 30-40 minutes or so did drag a little. After that the movie doesn pick up some speed and becomes more enoyable.",
    "14": "I enjoy comedy horrors, but 'There's something in the Barn' is a miss for me. Maybe its because the film can't really decide what it wants to be. As a comedy it simply wasn't funny enough. As a horror it was holding back on gore and effective kill scenes as if it was scared to loose its young audience. And I say young audience because part of it felt like it wanted to be a cute little kids movie with a message. I just don't really know what that message is. A message of hope for the Festive Season, maybe?The film revolves around the Nordheim family from America who inherited a farm in Norway, so they packed up everything in the States and moves to Norway. Here, they plan to turn the farm into a bed and breakfast. However, young Lucas soon discovers there's an Elf living in the barn. And there are rules to abide by not to piss him off. He hates bright light. He hates noise. He hates change.So, when Lucas befriends the Elf he decides to follow the rules, no matter how much it inconveniences his family. And this is where I started losing interest. It would have made more sense for them to try and get rid of the Elf, angering him that way. Now we have a kid telling grown-ups what to do, and they obey!!The teenage daughter Nora was cliched and annoying. Ok, her character development wasn't bad, but I still found her unconvincing - both the character AND the actress. And the same goes for the mother, Carol - or the stepmother, for that matter. The Dad, Bill, was a hopeless, spineless character who always quietly agreed with everything and everyone.Oh, this was stupid. For a 'horror' it offered very little in terms of suspense. I found the film so silly within the first few minutes that I almost stopped watching, but I guess I was still hoping it would surprise me. Unfortunately, it didn't. The film so badly wanted a feel-good festive ending that they have the dad saying \"People died, but we bonded.\" I think this was supposed to make me go \"Auwww, the family sorted out their issues and they're happy.\" Instead it made me dislike the film even more. Ugh, seriously!!",
    "15": "Fantastic Fest 2023\nGreetings again from the darkness. Billed as a Norwegian comedy-horror, it's unfortunate that this latest from director Magnus Martens didn't work on either front for me ... although I absolutely adore the premise. A typical American family inherits a family farm in Norway, and quickly decide to relocate to the farm and turn the barn into a Bed and Breakfast for tourists who want to enjoy country life and the spectacular views. Of course, this happens after we've seen the opening and what happened to the previous owner a month earlier.The teenage daughter (Zoe Winther-Hansen) is angry about leaving her friends behind. The stepmother (Amrita Acharia) is trying to put on a happy face for the family, while the goofy dad (Martin Starr, \"Silicon Valley\") is just excited for the adventure and mostly oblivious to the obstacles. It's the young son (Townes Bunner) who stumbles on the oddity living in the barn. An elf has made the dusty place his, and a local man provides the breakdown of the local legend. The son tries to explain to his family what the \"Barn Elf Rules\" are, but they ignore him and proceed to break all three rules.Numerous cracks about violence in America are included (evidently part of the 'comedy'), but other than skiing being broadcast on every cable channel, the movie is neither as clever nor scary as it tries to be. Turning into an elf gore-fest with a gang of elves makes for some fight scenes that should have been more creative, and instead mostly fall flat. This is one I had high expectations for since I thoroughly enjoyed last year's VIOLENT NIGHT. At least it ends with the great Darlene Love singing \"Christmas (Baby, Please Come Home).\"",
    "16": "I love horror movies and ever since Dead Snow and Troll Hunter I also really enjoy Scandinavian horror movies with a snowy setting, so I thought I'd give this a try.I had no idea what this movie was about and I was pleasantly surprised when I found out who or what the antagonists are. Minor spoiler but this movie really reminded me of a British movie from last year called Unwelcome. The premise is really similar except that this one place in the snow during Christmas time.We have an American family that moves to Norway and has to deal with some sort of fish-out-of-the-water situation because they have cultural differences from the locals and while the parents are trying to fit in, the moody daughter just wants to go back and her little brother finds something mysterious in the barn.Basically we have a pretty stereotypical family situation and some also stereotypical side character's, especially the towns Sheriff who was the main comedic relief which sometimes worked and sometimes not so much.This is a lighthearted comedy with some horror aspects and some gnarly kills and I overall enjoyed the watching experience. This might not be some Christmas classic like Gremlins but it could still be an annual watch for me during the Christmas time. [5,9/10]",
    "17": "Arriving at an inherited house in Norway, an American family prepares to turn the inherited property into a new bed-and-breakfast location for travelers in the area, but the more they try to impose their customs to accomplish it the more they anger the sacred elf protecting their property and must try to stop its rampage.There was a lot to like about this one. The main starting point here is the rather fun and light-hearted atmosphere that generates quite an enjoyable time. The classic setup involving the family who are out of their element and out of touch with the customs and traditions of the location but trying to fit in with their usual decorations manages to be quite a fun scenario here. The means through which they start to make it feel at home ends up allowing for a creative counter-behavior setup where the son is initially curious about until he reveals about the elf living there which soon gives way to his desire to stop them from continuing their disrespectful traditions as they try to get acclimated in the community. Not only is all of this quite fun in terms of supplying a solid setup for later on with the elf's desires to keep the traditions in check while they start to win over the locals with their non-traditional ideas and customs, but it all provides the proper context for the later shenanigans to come. This setup provides quite a lot of fun once it shows the destructive nature of his actions inflicted on the family. Already well aware of what the elf is capable of, the scenes of it show in practice, from the destruction of the Christmas decorations to the violent reaction after the party, this sets the film in motion rather nicely with the family being unwilling to acknowledge anything is wrong and only angering him further. By the time it gets to the final half, where the vicious elves have had enough and begin launching a slew of invasion attempts to overrun the house and start attacking everyone they can, this features a lot of fun action and battles between the two that escalates to some great destruction of the house and surrounding areas. As this all features tons of great work on the design of the creatures who are extremely effective in their full-scale action scenes and fine gore, these provide the kind of enjoyable factors to hold this one up overall. There aren't too many issues here, but it does have a few minor flaws. One of the main issues here is the rather unsettling and somewhat unnecessary cultural humor that comes about here that grows somewhat tired the more it goes on with the amount of time it keeps going on about the fish-out-of-water Americans being clueless about the Norwegian customs. This is mainly based on the locals' reactions and comments to the family's queries for help and using that to brush it off when it's quite obvious there's something wrong as the continued use of the storyline where their American customs are put to the test. The other drawback to this one is the somewhat convoluted finale that manages to have a lot going on since there are a lot of storylines at play here, from the race to save the family, the attempts at appeasing the friendly elf, and the neighbor getting involved with all the chaos going on, and it can feel too complex at a point that doesn't need it. These factors are enough to hold this one back somewhat.Rated R: Graphic Violence, Graphic Language, and children-in-jeopardy.",
    "18": "I've watched this today at Sitges Film Festival and I had a good time, but it was probably thanks to the crowd, who were doing jokes and clapping all the time.Now let's see. The photography is really good, mostly because Norway is a beautiful country.The film in general is really funny, and their comedy style is really enjoyable (even more if you aren't neither American or Norway).You could call this a familiar Christmas movie, but adding it a sadistic side in the last part of the film.About the plot, it's kind of predictable most of the time, but I've never seen a movie with an evil norway elf, i don't know if you did, but it's not exactly common (which makes it better).One last thing, the acting was really bad, like probably the little kid was the only one who did a kind of good acting, and the Santa guy.I recomend this movie? Yes, if you have nothing else to do.",
    "19": "If I'm honest I was just bored. I loathe Christmas holidays so I saw that as an opportunity to hate them more. It was actually rather cute and it works perfectly. Balanced comedy and horror. It's not horror actually it's as scary as gremlins. I don't get the R rating.Everything works out perfectly except the father. He is Gad in every single way possible. Both the character and the actor who doesn't work.I enjoyed it and usually I hate everything.The kid was amazing and the step mom. The police officer is a dream.Give it a try. It's like the best Christmas movie since die hard. It's a Christmas nightmare but cute.",
    "20": "The person who got the idea should be graduated for this. It was a very simple movie, but made with such a good ironic humor and very good, holding action. The action takes place in Norway, were an American family inherits a house from their Norwegian side of family, and will basically start a new life. But then they discover the barn elfs, and when they broke the rules, the elfs became angry, and came for revenge! It's something you can see on the trailer, it's predictable what is going to happen, but on the same time, not. It was many unpredictable scenes that were made so funny that I started to laugh. The humor. Very good, but not for everyone. In the movie they laugh and make fun out of Norwegians in a way that maybe not everyone will understand. But if you understand everything, then I guarantee it is a fun experience. For example, if someone knows, Norwegian Police isn't the strongest and most menacing police ever. But of course, in here, they dragged it and made it extra funny, including a totally non-caring Sherif in the town, that prefers to watch Love Actually then investigate in the action. They did also use some ironic and unserious dialogues that were totally out of place, but I liked it. I liked that they didn't took the movie too serious, and made it more to a low-budget black comedy! When the fighting with the elfs came, it was also made great, with some awesome camera angles and creative attacks. The elfs themselves was more of the cheap sort, the costumes looked really cheap, but this isn't supposed to be a high-budget movie either. Sometimes the elfs were too exaggerated, and it was just too much, so I think the movie could been fifth teen minutes shorter. Not a big deal, but something that could be possibly changed. Besides that, this is an awesome experience, nice elf fun, it is a little bloody, and I can safely say that it is very entertaining! Recommend it highly!",
    "21": "There's Something in the barn is a comedy, gentle horror set in Norway.It's a Christmas movie with a kind of Gremlins feel about it.The scenery is beautiful and the tone is always playful.There's some light family drama included which definitely helps keep us invested in the movie.The characters are all likeable (apart from those little Elf buggers!)The action is very clever and has some great funny scenes as well as a decent amount of blood!At no point was I not entertained by this quality Christmas movie.It's suitable for family and teenagers.Give it a go, don't expect anything overly dramatic or scary and just be glad there's a new enjoyable Christmas horror to get stuck in to.",
    "22": "Surprisingly sweet and funny film with a high drive.Extra points for the good idea where an American family inherits a house out in the Norwegian wilderness where the barn is \"possessed\" by \"nisser\" or elfs.A slightly crazy story, but if you want to be entertained with action and blood, then it holds up very well with a lot of humor.Certainly not a great film, but quite entertaining and very nice surprising scenes.A bit heavy start for the first half hour, but after that it is turned up.Definitely a movie that I would like to watch with my grandchildren in a few years when they are ready.",
    "23": "Not sure how they thought they could sneak this past - but this is nothing but a copy and ripoff (and really poorly done so) of the British 'Unwelcome' movie from a few years ago.Another example where American movie makers have zero creativity and have to steal from countries that do.Not sure how they thought they could sneak this past - but this is nothing but a copy and ripoff (and really poorly done so) of the British 'Unwelcome' movie from a few years ago.Another example where no-skill movie makers have zero creativity and have to steal from countries that do.Not sure how they thought they could sneak this past - but this is nothing but a copy and ripoff (and really poorly done so) of the British 'Unwelcome' movie from a few years ago.Another example where American movie makers have zero creativity and have to steal from countries that do.",
    "24": "Blending horror and comedy is never easy task to do. You either get a great movie or a total excuse for a movie.There is something in the barn is something between. It's got a very funny moments and some good action.As a European I just loved \"this is not America\" joke's.But something is missing I think a little more blood and gore would make this movie a so much better picture. Some killings just missing those bloody parts and a little bit of creativity.Also I got a problem with the actor who was playing father figure. He was really annoying and not in the funny way. Most of the time he looked like a stoned dad with no love for his children.Anyway a good movie if you love that mix of horror and comedy, not for everybody.",
    "25": "When a new age, nuclear, family pull up their American roots to relocate to Norway- after inheriting a \"devil house\" from the man's extended family- they try to fit in...but things don't exactly go as planned.Because there is something living in their barn.Their adolescent son quickly figures out what it is...and makes friends with it.But no one believes him.So when he tries to teach them the rules (on how not to piss it off).They don't listen...and break every one of them.However, it is one act that pushes things over the edge...Thus turning this festive comedy into a complete horror show.Albeit one made for children.Is it the most innovative Christmas horror film ever?No.Is it the most gory Christmas horror film alltime?Surely not.Hell...it's not even the scariest Christmas horror film to come out of Norway.But it's great fun!With a decent amount of gore.And a whole lot of laughs.Though, not so much to make it unfit for kids.So, if you are the type of family to watch an annual Christmas horror...and you got some kids you want to scare the \"niceness\" into.This film is a great choice.Norway definitely knows how to do it.Except in the case of lutefisk.Everyone hates that crap.6 out of 10."
}