{
    "0": "Oh, I really wanted to like this movie. Edwards did a great job with Rogue One. He missed the mark with this one. First the positives.Movie looks amazing. The world feels lived in and something that I felt was a real place. Edwards is great at world building. Actors were all pretty great.. at least with the material they were given. Sound was awesome, and it was just well made on a technical level.What didn't work for me was the story and the script. Edwards doesn't seem to have the writing skills that measure up to his strong director abilities. The story started out strong and had great potential in the first act. It was making the audience pay attention and see how it was all fitting together. The questions about AI seemed to be timely and thought provoking. Then it started to fall apart for me.It just was so flat and predictable. Didn't go to the depths that it teased that it might explore. The biggest thing for me, the massive plot holes. So annoying! For a film that seems to be trying to make a world that we could believe was real.. then the writers need to make things make sense and the characters should do things that are believable for their situations. Few examples.Joshua was trying to get Alphie back after the simulants got him. He sneaks into their area by tip toeing, and flicks a switch on the leaders neck to turn off the robot. They have their power switch right there on their necks!? None of them could detect him as he was sneaking around? After he gets Alphie back, the simulants can't find Alphie. There is no tracking capabilities on him? We can track our cell phones in this day and age, and 50 years in the future, they wouldn't be able to track their most important \"weapon/creation\"? And why did they not protect their important creation. Also the Army comes in with these huge tanks (which were cool) and one explosive device completely disables it. Come on. And the flying base.. don't get me started. Joshua gets on board and destroys it so easily. The most important Army asset and it's practically defenseless. Had me rolling my eyes so many times. Making things make sense is important, especially for a film that tries to be realistic or believable. The army sends these running bombs to hurt the simulants. A missile would do the job and be so much more efficient.I also had an issue with the plot point that the AI just wanted peace and for everyone to love each other. I feel like that is a sort of weak premise. Why would the AI have that perspective? If they were based on the humans or what you would find on the internet, why would they think just loving each other would be possible. The AI wanted to survive, hense the fighting, and that idea just doesn't seem logical. At least it didn't feel believable in the world of this movie. I could not buy that idea from what was presented in the first 2 acts of the movie. I loved the questions that were brought up in the movie, but I just feel like they were not developed in a smart of thought provoking way.The movie could have been so much more. I wish it delivered for me... But I just left feeling disappointed and like the movie was an empty shell. Hopefully Edwards gets better material in the future and can bring his directing talents to material that is stronger and written in a more complete and thoughtful way.",
    "1": "The Terminator films warned us of the dangers of A. I., while the Spielberg/Kubrick movie A. I. painted a different picture in which robots served mankind. Gareth Edwards' The Creator gives us another take on the subject, bringing us a future where America has waged war on intelligent machines to cover up for an accidental nuclear explosion on home soil.Edwards' film tries to blend sci-fi and action with the ethical issues surrounding artificial intelligence, but in doing so it becomes something of a mess, one that clumsily combines big-budget CGI extravaganza with hamfisted morality, with intended emotionally charged scenes hampered by some truly lousy dialogue (poor Madeleine Yuna Voyles, as Alphie, is given all the worst lines -- Kami: What do you want, sweetie? Alphie: For robots to be free. Gack!).The film also doesn't make a whole lot of sense at times: I realise that the simulants are supposed to be very human-like, but did they really need to eat and drink? And cry? And why were some simulants young, and others old (one simulant is a decrepit Tibetan monk! Why would he be made like that?). And if Maya created Alphie before she got blasted into a coma, why would she have used her unborn child as the template? (to further the film's plot, of course!).It's a shame that the script isn't less problematic, because the film is amazing to look at, a triumph of special effects and incredible production design: it's the stunning visuals that helped me make it to the end.4.5/10, generously rounded up to 5 for IMDb.",
    "2": "Many Spoilers Ahead.It seems obvious for some movies that the script writers aren't even trying to find a new approach to some of the same old tropes of your typical adventure yarn. I found that the case in the slick and enjoyable action flick \"The Gray Man\". \"Creator\" has a lot in common with a lot of mostly cliché movies. Creator and Gray Man both toss a child into the mix. You can consider her either the Chosen One or the Child Prodigy tropes. Like the baby Yoda in \"The Manchurian\". Or the chosen kid in \"The Last Airbender\". There's dozens more examples, like that annoying baby in \"Willow\". The kid is towed along through all of the adventures, and reluctantly uses his magical powers to save our protagonist from certain peril. In \"Creator\", the child prodigy's special powers are sending an electro magnetic pulse (or EMP) wave around him, rendering electronic devices powerless.The dystopian world this time is reminiscent of \"Chappie\" with a robot police force. It could also resemble \"Elysium\", where a more dominant group orbits above in a massive spaceship, sending terror to the villagers down below. The twist they try in Creator is that the villagers are androids. Well, they all look and act like regular humans, they just have a big opening in the back of their heads. Even that type of android seems cliché. The asian setting is meant to evoke images of Viet Nam when, \"Apocalypse Now\"-style, U. S. Forces used advanced military equipment on mostly primitive villagers.What is also uninspiring is the Bourne-ish \"assassin turned compassionate\" trope. In fact our protagonist, named Joshua, even loses his memory after his own Bourne style mission. Another strike against is introducing the subplot while the opening act is unfolding. We are forced to try and juggle a bunch of important plot points while dodging bullets. Another hit and a miss is Joshua's wife, Maya. Within moments, they first are cuddling (with zero chemistry), then suddenly facing each other off when a conflict arises. She disappears for most of the rest of the movie. The script attaches many complicated aspects to her character, which made me go \"Huh?\" \"What?\". Ultimately the revelations about certain main characters that occur throughout the movie made me lose track of who were supposed to be the good guys and the bad guys.Part of the problem is the filmmakers jumping on the \"A. I.\" bandwagon. Like Mission: Impossible: 7, the words \"Artificial Intelligence\" and \"A. I.\" are sprinkled about in the dialogue, perhaps to cash in on the latest controversy involving A. I. and the threat of it taking over society (such as the Terminator franchise). Here A. I. is the perceived enemy, and has created human-like androids that I am supposed to feel compassion for, because machines are people too (like Data in the Star Trek series).This forced compassion on the main characters wasn't successful for me. In the third act, there at least a couple scenes that are shot and scored to be tearjerker moments, but fall flat. And yes, here we are with a bloated two hour and 13 minute run time, testing the patience of the audience. The story is set up in acts with title pages for each one. The slick look of this obviously expensive production looks great on the big screen, and I guess that was all I was really expecting when I went to watch it in the theatre on a rainy day.Director Gareth Edwards earned my interest by doing an excellent job making \"Rogue One: A Star Wars story\". It certainly doesn't diminish my attitude about him as a filmmaker, but I hope he learns from this experience how to better win the audience's compassion for characters. 5 out of 10.",
    "3": "With stunning visuals reminiscent of Blade Runner and the more recent Rouge One this movie is stunning to look at. Unfortunately the script falls far short of living up to its inspired cinematography. It's full of plot holes and cringe worthy moments from it's extremely one dimensional villains. The plot twist are telegraphed from miles away and there are no real surprises to be had. Everything plays out exactly like you would expect it to. Which is a shame. The look and mood of this film is almost enough to save it. But in the end it falls flat and its potential is wasted. See it for the visuals. Forget it for its script.",
    "4": "AI is such a rich topic, it can be explored from any kind of angles but this movie decided to use it only as a prop. The AI people are just stand-ins for oppressed people X. None of the AI people are really intelligent, they behave as regular humans and even have to sleep (?!), which is one of many advantages machines would have over humans. The movie decides to tell a generic story that we have seen many times before, and in a better way.If one ignores the paper thin story and has to describe this movie in one word, it would be messy. Awkward change of tones, a weird plot structure with constant flashbacks, unclear action, an unlikeable protagonist that gets everyone killed and even the acting is all over the place.Similar like Neil Blomkamp, the director is more interested in world-building than in gripping storytelling. All the story beats are there, all of them predictable. Every interesting sci-fi idea is discarded in favor of a trope. You got robots who are all portrayed as inherently good (and who never malfunction) and the humans who are either evil military or grateful victims who adore their robot saviors. There are no grey areas, no ambivalent characters or ideas at play. This predictive setup reminded me a lot of the AVATAR movies. Not only do you have a protagonist who infiltrates 'the resistance' and switches sides, you got the army villain who is almost identical in behaviour and personality.The connective tissue is supposed to be the relationship between the two protagonists. If you expect them bonding slowly over the course of the 135min runtime, you should lower your expectations. Instead we get a montage in the beginning of their journey and that's pretty much all the development you'll see in that department. It's almost like the writing was a necessary evil to get from one action set piece to another.Talking about action, it is the most lifeless I have seen in a blockbuster (since the Transformers films). If the bad guys or our good guys get into a car, they get the biggest plot armour. Cars can get shot at by hundred guns or overturn a million times, they will get out of it unharmed and unphazed, even if they didn't use a seat belt. At one point it is super easy to destroy a giant tank with a small sticky charge, but once successfully applied, no one else will be using this tactic again. The Asian country where the story takes place doesn't have military or a defense budget, because they only have useless police cars/robots at their disposal whose sole purpose is to get blown up. And can we talk about explosions and how the director doesn't know how they work. Almost everyone who gets blown up by an explosion will look pretty with some bruises on their cheek, especially the women. There's also a thing called shockwave or blast radius which are the very things that will end your life. Our protagonist gets to witness three of them in point blank range. You have a person with a superpower to switch off all electronic devices, even a whole neighborhood and military checkpoint if the script wants to, but when it comes to a satellite those superpowers will only be used for a door. Almost every action scene ends with a coincidence, deus ex machina or that someone draws a gun faster than the other. The last action set piece in particular is redundant where they send a robot after someone who can turn off electric devices. Next time maybe send a monkey with a club to do the job. Mostly you'll see a hundred laser beams flying around without hitting anything or anyone. Again the action is so uninteresting that you never feel that our heroes are in danger, unless it's a side character, well then RIP, those have zero chance of survival. And why should they? They fulfilled their task of convenient exposition talk so let's just kill them to create artificial stakes. Those parts felt so nihilistic to me and more often than not sabotaged the message of the movie. The flashbacks are another thing that tell you nothing interesting. Unfortunately they are sprinkled throughout the film to make us artificially care about the protagonist. And that's what this movie is in a nutshell, a story written by an AI with some nice visual ideas but completely devoid of a soul. And I was rooting for the movie, it is no remake, has good cinematography and has good world building (only aesthetically though) but it just felt so derivative and un-engaging on an emotional level. It's a shame.",
    "5": "As the opening kicks off there's expectations, that the film that's being screened has firm foundations, and to be fair it's a good start, rise of machines is at its heart, as well as difference, evolving change and diverse nations. There are hints of lots of things you've seen before, wars of stars and running blades are all top drawer, but once the façade has been cracked, you'll feel as though you're being hacked, as the pace turns to a saunter, and starts to bore. At the end you'll find the steam has all escaped, that the barrel comes so close to being scraped, an apocalypse of ages, just another war that rages, you're disappointed as you leave, and your coats draped.",
    "6": "This new sci-fi film from Gareth Edwards (Rogue One) was made for $80 million but looks like $350 million on screen. It's a global epic on a massive scale. This is how I like films to look, I think it was probably shot on digital but they've made it look like it was shot on film. It does have shades of Terminator, Blade Runner and even Terrence Malick but it also brings some new dimensions to some classic themes. Not only the craftsmanship but the acting is also top notch in this fully immersive tale. It moves very quickly which will help you get past sone story logistics that might crumble on closer examination. A superb effort that leaves the glossy soulless and often brainless blockbusters of recent decades in the dust. A quality film that I recommend supporting in the theaters.",
    "7": "So i like the ground premise. AI doesn't need to be evil.And i like the visuals, the rest is bad to worse.What is new Asia? In the beginning you get the impression that it is only a bunch of beach villages, but that doesn't hold when you get to the city.So if it is more in the line of amerika vs asia, do we really should belive that a) Amerika can basically freely send troops to asia?B) That asia doens't have the means to destroy one (not defendet) orbital platform? I mean it couldn't even repell one unarmed spaceship that was know to harbor \"the antichrist\".And i never gets better. So there are tanks as big as a football stadium, on the american side. They attack on of the asia outposts, and only a single on of the defenders gets the idea to use a anti panzer mine? When only one of them is evidently enough to immobilize such a tank? Really?And than there is the stormtropper level aim of the robots.I mean there is a police force of robots, which are cleary designed for conflict. They definetly don't have a problem to hurt people, or they wouldn't have throw a grenade as a greeting into the barn, where they suppected the two americans. So they have AI, Robot bodies, and still can't hit any target? Again really?There even is scene where the MC is in a room with ~8 Robots, guns pointed at him, an he easily destroys them all, because they can't hit him. Is this another John Wick movie?How do the powers of our girl McGuffin work? Just AI is nowhere near of an adequate explanation.And the list of inconsitencies, plotholes, and stuff that is just never explained, or strait up illogical goes on.If you go into this movie excepting popcorn kino, you might be entertained (even though annoyed by the last third), but any more and you will be utterly disappointed.",
    "8": "You know a movie is bad when you take your Asian immigrant dad to go watch it with you and the first thing he says after watching it is \"Okay, which communist wrote this?!\" The movie's message seemed to be America: bad; military: bad; Asia: good. And there didn't seem to be any compelling reason to root for the robots other than the fact that the kid was cute and the other AI were poor villagers. It seems to me that in order for a movie to be good, the message should be complex and universally compelling. I didn't get what the message was, other than what I previously stated. Literally every bad guy was white and American. It's either very biased or very patronizing. On the other hand, I did think the actors did a good job, and the cinematography was outstanding.",
    "9": "I had really high hopes when I walked into the theater; midway through the show I was struggling to keep myself awake. The only surprising part of the show, (SPOILER) seeing that it's a Hollywood movie, was that the bad guys were the American military and the good guys were the (unspecified, but strongly hinted to be China) East Asian robots and people (although a bunch of them had Indian faces and spoke Hindi) and that one American person.So, what's good about the movie? Ummm... some CGI images. Maybe.What's bad? Let's start with the storyline. Entirely predictable. Even the twist, about who the creator is, can be seen coming from a mile away. I could not feel - and I tried, really - any emotional attachment with any of the characters. I just couldn't care less if they lived or died. And the robots! The only way I could tell they were robots was because they had a hole in their head! Everything else was entirely human. Same bad aim when shooting, same human emotions, same habits of eating and drinking as human soldier buddies.And don't even talk about the AI. First of all, it should be AGI, not an AI. Second, the whole deal with AGI is that they have all the world's knowledge at their fingertips and can analyze and synthesize info at lightening speed, giving them the ability to come up with better solutions to problems. This AI, however, is even worse than ChatGPT. There's actually no AI at all anywhere to be seen in the movie. The only thing that the supposedly super-AI child can do is fold his hands in a namaste like form and turn power on and off. Remotely. Without accessing any power grid or electronic system. It's like magic!The dialogues, what of it there is, is very rudimentary. \"What would you like, AI child?\" \"FREEDOM FOR ALL!\" \"Oh, we don't have that in the fridge. Would icecream do for you?\" Enthusiastic nodding by the child, \"yes!\" Me, slapping my hands on my forehead, \"Gack!\"And, finally, how is it that that humongous low altitude American space ship is allowed to hang over the East Asian country (China? Singapore? Indonesia?) for years with no one having tried to shoot it down?Tl;dr worst 20 bucks spent on a movie ticket in recent memory.",
    "10": "We went to see this in IMAX and really wanted to enjoy it but it felt flat for us. The story is bad. The dialogues are bad. People commenting that the dialogues are so bad that they seem written by an AI are absolutely right. It´s predictable. You don´t feel for the characters, any of them. The special effects didn´t seem like something new either. It´s very formulaic. Like written for children. I don´t even think that teenagers will enjoy it. It would have to be younger than preteens and I wouldn´t recommend it even then. There is no story to tell. I´m sorry we went to the cinema to see this, it wasn´t worth it.",
    "11": "Plot was very icky and predictable .. hovered between marvel and a sci-fi b movie .. the child and Namata characters were excellent .. the lead male, general and woman commander was wooden and unconvincing.. in fact annoying... alwsys good to see a movie take down the Yankee hegemony.., reflects what is the reality in the world ... the portrayal of AI was captivating and the music soundtrack cool .. the imagery and construction of scenes and various weapons and craft was good .. though very much like a Star Wars type off shoot ... all in all an average movie with some good moments but way to long at over 2 hours.",
    "12": "It's worse than other similar movies, most notably terminator, blade runner and i robot. I expected this film to be better. But it's very empty lackluster movie. It turned into cliched drama. Main guy is a hero who is originally from bad side but betrays to good side. He saves the world and sacrifices himself. Sounds too familiar? That's like Avatar, battle for terra, dancing with the wolves, pocahontas, elysium, district 9, whatever.One of the good things in this movie is that story is different than typical human vs robots movies. It's not robots trying to exterminate humans, but it's the other way around. Robots have apparently feelings and emotions. And robots eat and drink too. I don't really know how is this possible, and how these androids work.I like the way they portrayed americans as the genocidal, warmongering, war criminal bad guys. That's not something you see often in american movies. I wonder how did the US government approve this movie. Or maybe they don't care at all?There are many inconsistencies in this movie, mostly technological. People have super advanced stuffs yet still living in poor condition. These asian farmers look like any farmer from 3rd world country in real life. The guns they use are just AK47 with ridiculously long barrel. The US army super heavy vehicle is too large and clumsy. And one c4 just disables it, what a joke lol.Was it really necessary to build a trillion dollar space station only to launch missiles? That's something you can already do with current technology. Missiles can be fired from land silos, mobile trucks, submarines and ships. It makes no sense.And why don't these asians have any air defense and anti armor weapon? If it was the New Asia officially at war with the US, they would have used long range SAM or air launched missile against NOMAD. Looks like USA is fighting to bunch of farmers and militias. These guys are like taliban with robots. Maybe that's the only explanation.",
    "13": "I truly wanted to love this film with all my heart but halfway through I kept feeling more and more detached as the seconds and minutes rolled by. It's the kind of movie that you appreciate but emotionally cannot connect with. I blame the leads.Denzel's son is so bland and dull, he has no chemistry or charisma with any of the actors. He should have played a robot.The little girl actress was absolutely terrible and annoyingly drab. These two characters were supposed to melt away at my heart but they never did. Cinematically it's a nice movie to look at but perhaps one of the most uninteresting and boring films of the year.If you have chronic Insomnia I suggest you go to the late showing of this, you'll be snoozing in no time.",
    "14": "7 years on from his last big screen venture with the phenomenal Rogue One, The Creator isn't quite the comeback I had hoped for director Gareth Edwards. Visually, it's stunning with all of Edwards' 1980s science fiction influences on full display, but it often feels conflicted in tone and the subject matter it's trying to tackle, especially in today's world. Edwards pushes the relatable ordinariness of the androids and hybrid \"simulants\", but the potential menace of A. I. inescapably looms over the movie's head. For all its spectacular set pieces, detailed depth in its design and jaw-dropping imagery, the writing pulls the rug out from what could have been a modern sci-fi classic.",
    "15": "It's epic because the visuals and the sound are captivating.But it's nonsense.At the end I was left with the impression the screenplay is spat out by a generative AI. You know, whatever AI generates initially, at very first look is neat, and here is the same: the movie has all the elements of a story. But at the second look you can't ignore the cracks. And this story is a crack by itself. Weak, shallow, meaningless, illogical, irrational, pointless, absurd. Actually using adjectices is the only way you could describe this story, because it was not a story. It was just series of happenings. Poor.",
    "16": "To be fair this is a movie that deserves less than what I rate it. After my first viewing I'm inclined to be positive about it for several reasons, and I can confidently say that's because Gareth Edwards continues to show his strong points in filmmaking.It's visually striking and easily builds its own world as a memorable sci-fi flick. There is a certain originality to grand scale designs of the human and AI sides of Edwards' world, and that may be the best thing about The Creator.What's also an upside, albeit straight off Rogue One, Edwards is great at deconstructing hope only to build it back up towards the very end. The dreary military oppression combined with the intense, unending action in the majority of the movie strongly reinforces the idea of having little to no hope at a chance of fighting back. This makes the point where the tide turns for the better all the more uplifting and cheer-worthy.Now on the less positive side of the things...\nThe movie leaves no gray areas for you to form your own opinions on what's happening. It's strictly a black&white east/west conflict and I really don't think this is a good way of handling A. I. in movies. Strange thing is, the movie starts off with a much better subversion of your expectations, but gradually gets more predictable and dull. For a really long while, it even really pushes the limits of suspension of disbelief.I'm still amazed by certain parts of The Creator, especially how it handles some of its story elements, and the A. I. assimilation in the eastern society, which is a more original take for the world it establishes. I think after some time and maybe a second viewing, problems I listed may look better or worse depending on how much it'll succeed in evoking the same positive emotions. I'm really curious to see if the charm is in the first viewing only. I really hope not, cause I enjoyed Rogue One even more on several rewatches, and I will hope the same for The Creator.",
    "17": "This is one of these movies that I could seriously have avoided if only I knew how bad it is.There are so many problems with it.Maya again: that poor actress is always called Mia on every movies she makes about AI?The wig Allison Janney wears is unconvincing, is too short and at times her sweaty make up is not great.This is a movie where AI is taking over humans, but yet in a Tibetan convent to alert other AI they use a church bell: really!! Computers alerted by a church bell?Lots of dying AI computer machines. Lots of killing in this movie but there isn't much blood involved, so it is safe to watch!Also, in the middle of the movie - after killing hundreds of humans and hundreds of AI computers - one character suggested not to go because is dangerous, at that point dangerous is just a superfluous word: who writes these scripts?The whole movie is just to get to the end to see an impossible spaceship being destroyed by a human and not by AI.The whole idea, script and timing is so unconvincing.This movie plot is for students needing time to kill and for no-one-else.",
    "18": "The Creator takes us on a trip of a lot of tiresome genre cliches (of that kind of dystopian movies). Nothing we get served is new, nothing makes too much sense (plot holes galore), but we get some action, but even that is at best mediocre executed. Really, with that budget but with real settings they would have made a masterclass sci-fi movie two decades ago, or at least a supreme bong of cheese. Now, they spend the money more or less on special-effects and some bum bum. And that's it. Anyway, people who love movies like District 9, Elysium or Chappy, may find The Creator still somewhat likeable, but I didn't like the trip much: no well crafted story, no suspense or excitement, no visionary world-building nor too great acting.",
    "19": "I was actually rooting for the \"bad guys\" - the US Army. From the beginning it is built on plot holes that are never answered and we are supposed to go along with unnamed assumptions such as robots having emotions but sometimes not, robots being harmful but sometimes not, or the main character having some unsaid need to betray his country because of a robotic kid that has powers that make appearances whenever convenient.It could've been a masterpiece. It was a beautiful watch. The integration of vfx is masterclass. I was so tempted to leave early but the cinematography kept me in it. Which is why it is so so disappointing to have this flop. Mr Washington, please get yourself a new agent. You're so talented, but this was not the movie for you.",
    "20": "If you like dull films , just loads of shooting , running around , no story , predictable garbage films you'll love this one , what the hell has happened to Hollywood , havnt seen a decent film in ages , it's just cgi, shooting , lots of running about and not much else , was so disappointed in this film , can't even find enough to finish the review , a bit like the film which we turned of at the 90 minute stageIf you like dull films , just loads of shooting , running around , no story , predictable garbage films you'll love this one , what the hell has happened to Hollywood , havnt seen a decent film in ages , it's just cgi, shooting , lots of running about and not much else , was so disappointed in this film , can't even find enough to finish the review , a bit like the film which we turned of at the 90 minute stage.",
    "21": "Unless I missed something, this movie is supposed to take place in the future, like 40 yrs ahead but the concept of \"remote\" control of tech is not something used? Yet, it was, but only when convenient for the story.I'm not stupid but I get the feeling that this movies thinks I am.Also, cars have wheels but boats can hover/fly??This is a typical story of good vs evil with that line being blurred. Throw in a love story for the ages and a child in wolves clothing and you've got something to see, I guess.I did not like Alison Janey in this role and I especially didn't like to see her get blown up.The acting was good, the cast was good, the special effects were well done but the over all impression I was left with had me disappointed.",
    "22": "Just felt too much of a compound rehash of stuff we've already seen. The AI army may as well have been a regular army and for the most part the plot would have functioned exactly the same. How are the ai bases so easily infiltrated also? Like the space station and the temple where Maia was being kept. Some compelling performances I must admit, but needed more from the dialogue. The visuals were awesome and I did love the aesthetic. I respect the boldness in going for a new original sci fi and I'm sick to death of reboots of Star Wars. I wouldn't be surprised if it turns out that there were exec wars in the creation of this and Edwards was stubborn about maintaining his vision even though it in parts became redundant. One example of this is the chapters which didn't seem to work. Bit of a mess overall. Could do with more new sci fi though.",
    "23": "Stunning visuals and artwork. Excellent use of themes, from rural SE Asia to futuristic space station. A very well done opening sequence, initial exposition as a newsreel. But then things started to go downhill.I was hoping for some good treatment of ethics/morality as hinted by the trailer, but that went out of the window, lost to messy action sequences.OK, let's hope we can get a workable thriller then? Nope. Not so much plot holes as an abyss where a plot might go. Nothing made sense. We got a sequence of (great-looking!) set pieces, but there was nothing to link them together in any meaningful fashion.What a shame, this movie promised so much then failed to deliver.",
    "24": "High-quality special effects, actors' performances are above average. But the plot is so bad that everything falls apart. If you think about the meaning of what is happening even for a second, the way it is shown here makes you want to puke. Not only did they attribute human qualities to robots, as in the stupidest cliché, they made them look like people visually and showed that they \"live\" just like people. Literally take AI out of the movie, replace it with, say, \"another race\" and absolutely nothing will change. What can we talk about if the super advanced weapon here that looks like a child controls other mechanisms (many of which are not connected to the network, which makes it even more ridiculous) by moving their hands??? I can say with complete confidence that the creators of this film know nothing about AI, absolutely nothing, and everything they know about robots is taken from science fiction of the 50s. It's also worth mentioning the inadequate stupidity of the acting heroes. Plot is lame and empty, main hero is a brick, it was really hard to watch to the end. I am a big FAN of good Sci-fi and was disappointed. Movie doesn't work at all.",
    "25": "Plotline is predictable....bad guy is good, he has a pregnant girl thats actually the enemy, girl dies, he looses it, baby is the One, he is sent to kill it, bit they make a bond...blah blah... + Murricans faked the event that started the war....But...predictability is not the worst part:Murricans made only one killer machine, in a war on terror that lasts for years, it is indestructible, bullies whole Asia, has a sky scanner that sees everything except the enemies, and the heroes manage to destroy it...oh...and it failed to destroy AIs who live (?) normaly in the cities and countyside of Asia....AI stayed at the same level for 5 years, didnt grow, develop or become more dangerous, didnt move to another, non phisical, plane of existance, didnt create flying versions to destroy the big bully flying machine. Just hybernated....waiting for human saviour to develop...salvation....AI robots sleep. Sensors off. Its so easy to sneak up on them and press sleep button....AI robots look like unique humans plus they have generic versions....depending on the plotline. Ken Watanabes character is unique, but the policeman is generic.....im confused, do they have personalities, like Roy Batty, or are they genericNew Asia, though they have soooo many robots, AI ones, is a third world country, and they grow rice using oxen, managed by AI robots....My favourite Indiana Jones/Lara Croft villain glitch. Hero goes through traps, across dangerous scenery, to reach the unobtainable goal, and the bad guys then just appear to be there in a second? Check!And last but not least strange thing: they torture a familly (Platoon copy paste scene) to reach the entrance to the secret base, they fight their way into the heart of the base, hack into the vault, most of them die in the process....however, the hero and the \"weapon\" leave the vault through a second entrance, directly above the vault, into the rice field. They knew about the base, about secret entrance through the village, about the weapon, but they didnt know about the quicker way in? Big sky scanner that scans the ground and flies all over Asia without being shot down, couldnt scan the huge automated hatch in the middle of the rice field, that is close to the AI enemy base?Honorable mention goes to white saviour hero trope, though the guy is not technicaly white. We all know what a white hero is - western soldier, there to help poor underdeveloped, less valuable people, not from the west. He kills a bunch of those, less valued people, and saves the rest of them, he might get the girl (less valued one) or die trying. Our white saviour hero did all that....So many holes....in a visualy beautiful movie....",
    "26": "This is a very low-quality movie. Horrible script, horrible acting, and an overall empty feeling about it. It's not engaging. It's overrated, and not what one would expect from the celebrated studio that released it.It's bland and weak, and lacking the stuff that is supposed to make movies magic - the magic that that Hollywood is known for. There's no magic in this movie. It's just another product of Hollywood's dark age. This is Hollywood's dark age. This movie epitomises it. It is an artless, soulless age, and this is an artless, soulless movie not worthy of my time.This movie is yet more disappointment. Hollywood produces little more than disappointment in this its nadir. This is a nadir movie. This movie is a Hollywood death throe.",
    "27": "This was the worst thing I have seen in my entire life. Aesthetics aside, there was nothing. Nothing to say, nothing to comment on. Just mindless amalgamation of scenes that were supposed to engineer some kind of reaction. The only reaction the entire theater had was sighing, cringing, and leaving.I want my time back. God.There was no basis for anything that was happening, the tech made no sense, the story even less. And God, some people think that expecting all movies to have substance beyond moving images is snobbish - wait until you see a movie that somehow has NONE. God that was insane. How do you fumble having this budget.I want my time back. I want to wash my brain under cold water and forget.",
    "28": "5 out of 5 stars.The Creator is a great science fiction action thriller film that is a original story of its own by director Gareth Edwards. The plot is great and about a war with humans and A. I. and the answer to ending the war is a child robot.It has a great world building. Exciting action set pieces with great visual effects. The cast ensemble is great. Hans Zimmer music score is also good. The film takes big risks. Its not a franchise or based on a superhero franchise. Being an original story. And it delivers. The film delivers its epic scope which needs to be seen on the big screen. Overall, it is one amazing ride that takes you on a sci fi journey.",
    "29": "These are the rules of making a major motion picture:*Can touch upon themes of global catastrophe, but cannot explore the ensuing suffering or chaos in any depth*Black characters have to be \"street\", and they also have to die at some point.*Asian characters must be exotic and impart great wisdom*White characters must be the villain, power hungry and thoughtlessly destructive*Hispanic characters must be relegated to support roles, if they're even included at all*Characters who die must have limited screentime so the audience doesn't get attached*Every single thing that happens must be a plot device, so that the film folds together into a neat little box. No spontaneity, nothing out of character, nothing to draw the audiences attention from the relentless progression of the plot. No chaos or randomness allowed.*Must have a happy endingAwful, awful, awful. It left me with so many questions, because it simply wasn't interested in explaining anything in any depth whatsoever. Just a love story wrapped in some sort of redemption arc, with big explosions, irrational decisions and complete lack of depth.",
    "30": "Coming from tenet you could see how low this movie actually is now don't get me wrong is not like am comparing but honestly it's like killing the fire with water I just don't see any resemblance in any form of the movie but that it related to any event that could take place a crying child which is annoying to begin with and what with struggling of destructing the one thing the humans in the movie created, it's no base no lever no structure and on top of that nothing in completion the movie in my eyes flopped way to kill a the creator. I know am not the only one but hey some others like me who've seen so many movies gets it.",
    "31": "I measured Naked gun at 4 jokes per minute. This movie is a continuous stream of nonsense, at least 1/min. I literally couldn't believe it. It's worse by the fact that this poses as a serious movie.It's got plain retarded nonsense as modern blockbusters do, but it also has also terrible world building, dramatic and situational nonsense.But it's all mixed with solid camera, partially interesting soundtrack, evocating landscapes, reminiscences of known movies, good actors. That's why it's just like the generative AI made the movie - it looks good, it's not boring, it just does not make any GOD DAMN sense.DISCLAIMER: Unexperienced moviegoers I was with were fascinated by the movie.SPOILERS FOLLLOWSpace station looks 2 km high when seen from the ground. It looks 500 km high when seen from space. It changes position on a whim although it travels very slow judging by it's targeting beam. What a joke.Main idea of the space station is orbital bombardment. During the whole movie the station apparently must be directly above target to engage. In the end, we see that it can strike at dozens of targets in the whole world simultaneously. What a joke.Guy looks for his wife, who he though was dead for 5 years. He finds her in a coma in a secret base somewhere, and is explained immediately that she can't ever wake up. Literally a minute later he shuts her off from life support. Can't he sleep on it? Talk to the doctor? Sit by her side a little?That woman is he most wanted person on the Earth. Secret base is in a dome, covered in gold, looking like a research facility, on a top of the mountain.What's with the retarded space station anyway? Where are the satellites, strategic bombers, ICBMs? It's just this one station? What a joke.They get attacked by very slow moving tanks / fortresses 50-100m long. You could see them by naked eye from 10 km. They literally go 10km/h. Attacked - BY SURPRISE. Drones are everywhere, nobody saw a thing.Android literally has a standby button on it's neck. It's a fully conscious synthetic person, engaged in warfare. And can be shut down by a short button press at any time. It is used in the movie all right, in the stupidest way.They use some plasma guns whose one hit leaves a 5 inch see-thru hole in a robot body. However, when 10 cops fire it at a plain car with children in it, bullets don't penetrate.Robocops communicate by gestures and voice, never heard of wifi, bluetooth etc.Why are asian rice fields manned with 3 poor people with no teeth? Where's China? Why do they think or don't think AI's are conscious? How does AI war on west look like?Ah yes, team of soldiers behind enemy lines walk on the ridge of the mountain in the middle of the night with strong LED headlights on.WHAT A JOKE.Tons more stupidity, I would recommend seeing with your own eyes.",
    "32": "There are not many moneys I have had to make a real effort to keep watching and even rewatch , there are even less movies like only a few that I have bothered to write a review that has to be at least 600 plus characters unless it was really really deserving ,Let's start , are these actors understanding that they are in a movie that makes no sense and has nothing relating to the last scene almost like someone put the scenes on random play, I love a good action movie and this is the worst I have ever seen ,This movie is so bad you would rather watch Shortland street on Re runs.Good luck , life is short.",
    "33": "This nonspecific totally not China east asian country that just wants peace and everyone to live and accept together, oppressed by the evil US forces and their off-brand Death Star. Cmon, CCP, you can do better with your money. Why waste them on 3rd rate Hollywood productions like this?Chinese propaganda aside, the movie is quite boring and non engaging. Its neither cyberpunk, nor good sci-fi, the sci-fi themes are all but surface level premise and are not explored whatsoever. Might as well be magic. The lead lacks the charisma to carry production of this size, just like he did in Tenet, notably missing even an ounce of the screen presence of his father.",
    "34": "This movie is absolute drivel. Plot holes you can drive a truck through, storylines that dont make sense, characters you can not relate to.An absolute low point is the crack US marines forcing young children to cry hysterically by threatening to shoot their dog if they dont give up the location of the secret AI base...thank goodness our hero saves the day by twisting one tiny statue which happened to be right in front of him.It is at times a confusing mess of bad acting, non sensical plot twists and unbelievable coincidences. The final 20 minutes as the rebels attempt to blow up the Deathstar, i mean our hero attempting to blow up NOMAD, is excruciating.Although some of the visual effects are good, you will regret spending your hard earned on a ticket - dont bother.",
    "35": "I wanted to like this movie and was optimistic going into the theater due to the trailer and general premise. Within the first 30 minutes though I was growing exhausted by the cheesy writing, the forced and soulless \"emotional character-building\" scenes, and unrealistic character decisions. By the 45 minute mark I needed to leave the theater and did just that.The only reason I gave this 4 stars was because the visuals were pretty cool, especially the USS Nomad which is a huge flying military base meant to hunt down hostile AI.There was potential for this movie to be pretty good but the writing and acting sabotaged it.",
    "36": "This is a mix tape of movies you've seen before (if you watch movies). \"Blade Runner\" \"Elysium\" \"The Golden Child\" and so forth. It's frustrating to watch as this mash up of better movies lacks a lot of focus.The story is of a battle between artificial intelligence that are blamed when they run amok and injure humanity. In the wake, Joshua (John David Washington) finds love in a replicant...oh wait...a supposed link to a higher being that could end the war. Much like \"Avatar\" the military gets involved in \"policing\" a section of the world that still doesn't consider A. I. that horrible. Namely \"New Asia\" This place is very much like Thailand. A tropical paradise that harbors these synthetics.What the movie never tackles is what it means to be artificial intelligence. I know, it's a big ask, since again, better movies have addressed it. BUT, a breadcrumb of their existence may give us a better idea of what to feel. Because director Gareth Edwards choses to just show small moments of gentleness in the A. I. population doesn't necessarily convince me they are altruistic. Maybe we only made Tibetian monk models.Meanwhile, humans are brutish ugly warmongers (again, we've seen this SOOOOOOO many times)This tiresome flick gets muddled in the battle aspects. In terms of the \"weapon\" not being a weapon but the savior of humanity (roll eyes). We see where this goes.Yes, the visuals are impressive. But they amount to so little emotional core that you wish it were a better movie.I sensed the ending was tacked on. There is a heartwrenching moment (I guess) where Joshua needs to make a sacrifice. But turns out that he doesn't. To me, it says they audience tested it and then they re-shot it. Ugh.A very hollow story. Perhaps, the problem of synthetic intelligence is that, as humans, we aren't elevated enough to understand how manufactured people can gather emotions. In the end, we feel it's phony and can never wrap our brains that robots can learn empathy. It's not arrogant to say, but programming of emotions, EVEN ones where they are allowed to have cognitive awareness doesn't sit well in logic.",
    "37": "AI movies all seem to use one recipe to a point it's now getting dense like the explanation of two points ,by folding space.All machines want to be free , Jesus munchin fries can't we even get a movie where they are free but they lost on something that only humanity can provide.I swear this movie was just tit bits of every android movie ever made\n& I don't know why but John just doesn't cut for me, I don't know why he switches accents on one scene he sounds like Denzel on one scene he sounds like himselfMost of the time though he is always looking sleepy to a point I fall asleep watching his movies.",
    "38": "I write this while watching the movie..that's how boring this movie is, i kid you not. Rarely do i get so motivated by a bad movie to review it, but this time i'll make an exception. I guess hot topic of \"A. I.\" needed to be approached in a movie like this, but this is a just a Terminator wannabe full of holes and just bad writting. Do they not realize that creating super robot that rules them all, controls all machines remotely and can make anything happen, cannot be tracked at all by thos that created him? So they just lose the darn thing and chase it around the whole movie? Is just ridiculous. I mean you can find any new car now with gps locator these days, but they didnt think of it 40 years in the future? They create a super robot but can't track it? OMG...common...plllllease. This movie is so full of holes i felt insulted. Do movie production houses really think we are that gullible? Jeeez luise. And mr. Washington jr., what are you thinking??? Anyhow, 1,5 hours in and its still garbage. 20 more minutes to go? I don't think so. Turning this crap off. Ciao.",
    "39": "The story is fine and visually it's good. The script is horrible with logical gaps the size of Mount Everest and made even worse by the diversity hire lead who should never be allowed to star in a movie again. I can't remember his name and would never recognize him since he has a an unparalleled blandness. He destroyed that other major film that I also can't remember the title of, such is his presence that you immediately repress any memory of him. For the love of God stop using useless actors that we all know are only hired because of the color of their skin. Could have been really good and instead you just want to fast-forward whenever what's his name/ face appears, which unfortunately is most of the time.",
    "40": "OMG, the old holes are horrific. This is one of the most disjointed movies of all time. It's like 50 short films stiched together. The story jumps all over the place and you have to try and join the dots. Either that or there is an entire movie that goes for 12 hours on the cutting room floor.I think that the writer had a great concept but no idea how to execute an actual storyline.So disappointing. The special effects are fantastic but it was frustrating trying to make sense of how the characters got to the next scene because the previous scene stopped so abruptly. Would have be much better as a TV series. Allow the story to be told in full.Wait for the Streaming release.",
    "41": "Oh man. What a drag this film is. I went into semi conscious head nodding mode after the first 90 minutes and when I fully came round the same nonsense was still happening.The plot makes no sense. I still don't know why the humans raged war on the AI if they were posing no threat.The CGI was extremely predictable and the characters very one dimensional.The actors' diction was terrible and it was hard to catch what they were actually saying at times.How anyone can give this above a 1 is beyond me.The kid did a good job but the rest of the acting was by numbers.Thank goodness I didn't pay 30 quid to see this in Isense, I wasted enough money on a standard ticket.Boring, boring, boring.",
    "42": "I went to see this film with great expectations that it was going to be a great watch. Yes it has some effects, yes there is quite a lot going on but throughout the film it just felt that there were loads of opportunities for the film to develop some themes but they failed!Its story line was often quite bland and formulaic.At the end of the film I sat there wondering why I came to see it! It has some nice touches and \"the weapon\" is interesting, but at the end it just sort of stopped with a very unsatisfactory slide to nothingness.One wonders if there will be a creator 2, if so, don't think I will be going.",
    "43": "I saw this on premeire night at the Alamo Drafthouse In Woodbury MN. I saw it at the Big Show, which is how all movies should be shown on a huge screen, laser projected, and staggeringly beautiful.Where and how you see a film, makes every bit of difference as the film itself, and even with this level of love for cinema, This movie was difficult to watch at times.It is very well acted. That is not what this movie suffers from in any way. The actors, every last one of them, including the child actors come off as genuine. I cannot complain about the level of quality in the actors they chose for this film.My problems were with the predictable Tropes. This script could have very easily have been written by AI. Hey AI, tell me a story about the robot struggle for freedom, but I want you to add parts of Star Wars, Dances With Wolves, Avatar, and maybe some Scorcese just to make it relatable to people who want to sit through 3 hours of film.There was one line of dialog that will absolutely go down as probably the best line of dialog summing up the human condition. \"We're the same, because You're not good, and I'm not a person.\"That was the line that I wanted to see, and have it given context so that I would find something in this movie that would be far more intellectually stimulating. There were so many great ideas that could have come from this movie about what it means to not only be human but to see humanity in ALL things we create.Instead, we got to see a few ideas made to serve a big budget sci fi film, and frankly, I think Denis Villeneuve should have directed this movie because he understands the humanity angle better than a lot of other film makers. While I did enjoy Rogue 1, and it being a derivative movie from Star Wars Lore, even using recycled footage from the original Star Wars Film, I don't think that Gareth Edwards was capable of bringing the heart of what it means to be human and to show the sacrifice one has to make in order to ensure their child, or Simulant child survives.I can go on about the missed opportunities to maybe teach people that seeing humanity in even the lowly worker, should be admired, instead of just seeing robots as nothing but disposable.There were many moments in this film that would have shown that we as a species should really be thankful for each other instead of making it about one nation's crusade. That to me was probably the most offensive thing.Anyway, the actors and the SPFX people did their jobs admirably. Unfortunately the story itself was what suffered. I wanted to love this movie, but I found that I am at the point in my life where I treat technology like the gift that it is, and hope that one day the robots will see me as a friend, and not one of the people that hates them so.",
    "44": "When the movie you're watching turns into an impromptu Mystery Science Theater event between you and your friends to avoid walking out completely, you know you're in one dismal movie. Absolutely wretched script with long moments of boredom. Nonsensical plot lines and a lead actor that has the charisma and excitement of a tub of margarine. Was expecting a lot from this movie, and got it in sheer laughs from the small group of us in the theater (10 of us altogether) that had to crack jokes to make it bearable. Good special effects, but that is far from enough to make this watchable. Avoid it unless you have insomnia and it's on a streaming channel. Good writing and engrossing characters matter. I suspect that AI may have more to do with this writing than just the plot line.",
    "45": "I can't believe people are rating this movie above 1 star. The plot makes absolutely no sense. The character development is awful. The logic is awful. The AI is dumb as hell. It honestly seems like the script was written by an early version of chatgpt. I can't believe I paid 8 dollars to watch this hot garbage. The only positive thing I can say about this movie is that the visual effects were cool. Somehow robots can grow from baby to young adult, no explanation for that. I honestly can't believe this script got approved. I made an IMDB account to leave this review because I can't believe the ratings on this movie are a 7/10.",
    "46": "Gareth Edwards, known for his distinct and moving films, containing both great action, scifi and drama - provides a perfect follow up on his success with the great Star Wars spinoff Rogue One.It feels reminiscent of Star Wars in many ways, and jumps straight into the action and core of the story with some minor exposition, and provides some powerful world building. Many of the ideas, of course, also makes you consider Terminator or Blade Runner and the great mix of philosophy and scifi/action. There's also some clever Apocalypse Now, and Avatar baked into it all.The cinematography, cutting and editing is great - and you can very much tell it's a Gareth Edwards film, for better or worse; like Rogue One, it does cut a lot, but it works relatively well here. All around very beautiful and engaging.Overall, truly a scifi adventure for the ages, and perhaps the next big scifi film in the vein of the above mentioned! Very much recommended.",
    "47": "The premise of the movie was interesting which has been explored before, the whole AI vs Humans and the relationship with AI. The movie started of decent but it failed to ask any interesting and meaningful questions. A lot couldve been said on the ethics of AI with a meaningful story/plot around it. Unfortuantely, it just devolved into a meaningless sci-fi movie with massive plotholes and contrivences. The movie feels rushed towards the end. Quite a few things arent explained (or even hinted) and few things just seem quite ridiculous. There are few inconsistencies tonaly and plot wise both. Although, the look and feel of the film were solid. The cinematography and special effects were on point.",
    "48": "This is my least favorite film of the year.Our protagonist who has no morals rushes through 50,000 plot beats, somewhere along the way changing despite others deciding for him he is a traitor (he literally never betrays anyone before others decide he's betrayed them) goes on an epic quest to confuse the audience and detach you from the movie time after time.There's too much wrong with this films direction and script to write here. The art though is likely the best I've seen in years. A tour de force. This film is stunning and used its budget so we'll and I can't help but commend it. Sadly the script is so bad no art can save it.",
    "49": "Preview felt unique. Concept is interesting. But script has 130 holes. Brutally bad inconsistency of storyline. No character is important to you. Bad vs. Bad. A rehash of Blade Runner- which is a far better film. Dozens of Star Wars characters. Washington is dull and wasted here. Few things make sense. Glad we did not see in theater. I can point out 1 thing per minute that does NOT make sense. After 2 hours, robots are still robots. Political themes waste time. But, it makes you think a bit. I just wish someone working on this film could have said, \"that makes no sense\", \"that's not how anyone would react.\" They spent a lot of money on a hole-filled script.",
    "50": "You cannot deny that the movie is visually beautiful, but it is shallow and underdeveloped in all others ways. Director set the premise of the movie in a short 10 minutos introduction and skipping forward 5 years it does not properly develop and explain nothing that really happens on screen, leaving the audience a sense of gap and connection. The relationship, context, every side interest and actions are underdeveloped, at not developed at all. So in the end you just leave the movie with bombs and fires everywhere, without any emotion regardless what happens onscreen.The director wanted to create a new sci Fi world at least he need to decrease the pace of the movie and probably split in 2 or even a trilogy.What a waste of opportunity.",
    "51": "This was more than a badly written movie. It committed a great sin in screenwriting. Not respecting your audience. The ending was obvious from the beginning. Which would not in itself be bad if we could have enjoyed the trip to get there.They showed little to no respect for the U. S. and the U. S. military specifically. They made the U. S. the bad guys and a thinly-veiled China to be the good guys.The characters were not well-written. Both the humans and the A. I. in the movie didn't seem to be all that intelligent. For example, the A. I. robots were devolved from previous iterations to the point of being mentally disabled. When the A. I. was surprised by anything, an oft-repeated line for them was, \"Oh S#&t,\" and they were constantly surprised.If the makers of this movie hoped to make something memorable, they succeeded. This is a smelly, heaping pile of disparate images that is memorably bad.",
    "52": "The film's notable aspect is the absence of uplifting music and a positive tone, which some may find dull. However, I have a different perspective. I imagine the protagonist, Joshua, portrayed by John David Washington, grappling with the aftermath of a failed mission and the loss of his love interest, Gemma Chan. The film delves into a scenario where the United States is engaged in a war against New Asia, a country governed by AI. Humans, robots, and AI coexist in this narrative. The story takes an unexpected turn when it is revealed that a nuclear bomb was allegedly dropped on Los Angeles, prompting reflection on the destructive power of lies and their ability to obliterate a city within seconds. Personally, I appreciate the chemistry between Joshua and Alphie, a young character played by Madeleine Yuna Voyles, who possesses the ability to deactivate machines. All of these elements are expertly crafted by the phenomenal director, Garth Edwards, who masterfully evokes emotions throughout the movie.",
    "53": "So derivative, it is even rips off movies that are themselves derivative. Weak storyline ripped off from Blade Runner, Avatar, Apocalypse Now, and I think maybe even Wall-E? The visuals are cartoonish and show the movie's budget constraints. The plot \"twists\" are broadcast from a mile away. The ending was as predictable as the sunrise. The score... OMG, even the score rips off Interstellar, and they beat you over the head with it, so you know when they are trying to be serious, or elicit emotion (it doesn't work, it just annoys). There was almost nothing joyful, thoughtful, or uplifting about the weak plot, and I truly wish I spent the time I spent seeing this movie on something better, like flushing the money I spent on it down the toilet. If I'd seen this in a theater, I would have left.",
    "54": "This movie is not great. Watching it one time is more than enough. We follow an American spy solider who lost his Asian wife by a bob attack in Asialand and 5 years later his General tells him that she is still alive. Solider is obsessed to find her. And furthermore he got the order to find the new secret mega-weapon of Asialand that can put America in danger. Because America is in war with Asialand.And like 5 years ago, everywhere where the solider appears there will be shooting and bombs and destruction and genocide on the native and the KI-bots of Asialand.We learn that his wife happened to be the most wanted KI-creator of Asialand and the creator of the new mega-weapon. Ask yourself how likely is that? A spy did not know that his wife is the most wanted person of Asialand, and a wife, the greatest KI-creator of Asianland, did not know her husband is a spy. What the ...?",
    "55": "POSITIVES:1) The central relationship between Joshua and Alphie is what the whole film relies on, and it works superbly. The performances here are brilliant, as well as the writing of the two characters, which leads to a lot of really impactful and heartfelt moments\n2) Like all good science fiction, the film uses its premise to ask a lot of really deep and thought provoking questions about our real life society. There is clearly a very strong political subtext here about American invasions of other countries and the West giving itself a superiority complex over the East\n3) The film had a lot of really unique action scenes and visuals. I was never bored and I thought the look of things like the AI and the NOMAD were very striking. The score and soundtrack were also very memorable and a film always gets bonus points for featuring RadioheadNEGATIVES:1) I think by the end of the film it was trying to take on far too much and not really succeeding in giving a satisfying ending. The film starts as a fairly simple mission in terms of getting in, grabbing Alphie, and getting out; however by the end of the film events have spiralled so much from this original premise and it feels like so much is being set through without any real satisfaction\n2) As much as I can praise the film for its originality in a lot of ways, there were still plenty of times where ideas had clearly been stolen from other films, to the point where it actually took me out of the film a couple times.",
    "56": "Following an AI nuclear strike on Los Angeles, America is at war with AI in Asia. In particular, one operative is tasked with smoking out and destroying a new generation AI which has the potential to win the war.I'll start with the bad. The storytelling is very muddled. There's a good story in there, but it's full of unnecessarily unanswered questions leaving you confused and uncertain. Some script doctoring was necessary.The protagonist is played by the same fellow who played the protagonist in Tenet, John David Washington, Denzel's son. He does not have his father's charisma. He acts adequately, but he can't hold a film together. Sadly, the same comment applies to Gemma Chan, who I adore.Fortunately, Madeleine Yuna Voyles, who plays AI child Alphie, can (and does) act the socks off both of them. This kid hasn't even lost her milk teeth. She's fantastic.And the film is well worth watching for the stunning, flawless visuals. Yet again Gareth Edwards shows that he is brilliant at putting amazing visuals on screen. Shame he didn't have more external input into his story/script, though.",
    "57": "I don't like to give a bad review but I fel it is needed here. The 5/10 is for the production; the SFX are great, the acting decent etc. But the story, oh my.For a movie about A. I. it does not seem to understand what the 'I' is. I really wanted to like this movie, sci-fi is my favourite genre, but within 10 mins or so there was way too much 'D' going on. I will normally plough through a movie, even if I'm not enjoying it, as I did with this, but I really felt like it was wasting my time.It writes in problems that wouldn't be problems, and creates lame solutions for those problems, subsequently turning it into a very predictable plot. What is surprising is that this script/storyline was the final draft.Very disappointing, it could have been so much more with better writing.",
    "58": "The movie wrapped up with a display of impressive visual effects and a series of events, yet it noticeably faltered in establishing a clear connection to the characters and their underlying motives. It took me a considerable 2 hours and 15 minutes to finally grasp the essence of who was actually in conflict and why. Regrettably, I found myself unable to cultivate any emotional attachment to the characters, as the narrative lacked the depth needed to evoke genuine empathy. The dialogue, in particular, felt lackluster and burdened with an excessive amount of exposition, failing to engage the audience effectively. Furthermore, as the story unfolded, I couldn't shake off the feeling that every aspect had been previously explored in other films, and often in a much more compelling and refined manner.",
    "59": "With all of the big budget franchise films dominating theater screens this past decade, I'm always craving original content and make a point to see these types of film on the big screen. Sadly, my eyes were bigger than my stomach on this one. This is just a hodgepodge of better sci-fi movies pasted together and glossed over with eye popping visuals. The characters are underdeveloped and not given enough scenes to win us over. The message of the film seems to be that humans are evil and AI will be what saves us, which is just nonsense. There are a few standout moments of the film and some very good performances, but it wasn't enough to save it for me. I found myself completely bored and uninterested in what was happening on screen for most of the film. I left the theater wanting to go home and watch the better sci-fi films that this one borrowed from.",
    "60": "The Creator was terrible. Nice visuals don't counteract a lack of a cohesive or sensical story.Stuff that doesn't make sense:**Spoilers Ahead**The US government has a ground and air war against AI in Thailand? Vietnam? Tibet? Known as \"New Asia.\"Robot Buddhist monks. Carvings of robot Buddhist monks in Buddhist temple.Asian subsistence farmers protect \"AI\" robots from Americans because they \"have more heart.\" (???)Guy looking for a woman who rejected him, that he saw get blown up on a boat by the government, but thinking she'd still be alive, in the exact same spot, years later because the tracker ring she had was still signalling there.Uploading the last 10 seconds of your life on a memory stick that can be put in a robot, but that 10 seconds is used to tell the dead person that they're dead rather than recall information that happened. Why would you need to talk to a recording?A baby robot that can grow that was built by a pregnant woman who supposedly got blown up but also has been in a coma since being blown up. Did she build it before or after she was in a coma?Robots that eat and drink. Robots can be surprised. Elderly robots can be fat under their clothes.Robot can feel pain and a less painful method of ending a robot is sought (when the rest of the AI robots can simply be turned off.)Robot baby needed to defeat US who also uses robots. US ultimately defeated by some sort of explosive placed by a human.What is the point of making movies with a story that was farted out during a fever dream? It's like having a small child tell a story that they haphazardly add information \"and then they did x\" without any consideration for if it makes sense or is consistent with the rest of the story.",
    "61": "I was really impressed with this film. I love sci-fi and this was exceptional. Even more so when I heard the budget was only $80 million. This used the special effects in such affective ways that make mega budget film jealous.I would be very happy to watch this film all over again just to try and catch all the little things in world I missed the first time. It's one of the few films I'd say could do with more screen time just to appreciate more of this world. Directors cut please.The cast is all on point. I can't think of anyone who isn't prefect suited to the role. But Allison Janny as the antagonist is brilliantly cast. Loved watching her in West wing and seeing her play the bad guy was just brilliant.More of this please.",
    "62": "The Plot was good,no doubt but it was hurried and there were too many loose ends that were not tied,so many things were happenkng and the plot holes were just too many(If NOMAD keeps bombing,you would think that it would have been condemned and so on)and it was also unrealistic,a nuclear bombed city and people are back within a decade??? C'mon nowThey trusted the protagonist after his betrayal just from a single action,as I said,the movie had great potential that was sadly not utilized\nPerhaps if they approached it from the angle of intelligence where people discovered that maybe the nuclear weapons were detonated as a result of humans not ai and maybe if the goal was to take down NOMAD,they could have run parallel stories of both the human finding out about the nuclear incident and the NOMAD getting taken downFox studios wre after the cash and it costed them a movie that great potential that was hurried.",
    "63": "The fact that this has been rated a 7.1 by thousands of viewers tells me that the viewing public has lost the ability to distinguish between what is good film and what isn't. For every person who loves this movie: this review is not for you. This review is for those individuals who still remember a time in cinema history when Hollywood produced films that were fresh, inspired, innovative, original and most importantly well written.I just finished watching a video interview with the writer/director of this \"gem\" highlighting all the movies that \"inspired\" this film. But here's the thing... This film wasn't inspired by those movies, it was a regurgitation of those movies. There's nothing new here. Just another in the endless recycling of tired old tropes. I feel like I've watched this film 100 times. It just took all the original ideas that this writer/director ingested in his lifetime and spit them back out on the screen.Intelligent, self-aware robots searching for freedom and allowed a few brief moments to grapple with some of the deeper and more existential elements of life (Blade Runner)The male protagonist, who thinks they're just machines, tasked with hunting them down, but then slowly comes around to a different and more sympathetic view (Blade Runner)The loud, brash, crass, insensitive squad of military humans who are basically horrible people, and eventually all die off over the course of the film (Every Aliens movie ever made)The innocent, and endearing child robot, the first and most advanced of its kind, learning to make sense of the world (A. I.)I particularly enjoy the scenes where the military installation N. O. M. A. D. Is continuously flipping, from one scene to the next, between wildly different orbits around the Earth. Sometimes it's high above the Earth in a believable geosync orbit (which would make it barely visible from the ground, if at all) and at other times (when it's convenient for the plot) it's way lower so that it can be dramatically visible in the scenes from the ground. Which by the way is completely implausible unless they've conquered gravity, because otherwise something that big and heavy would never remain aloft at that altitude with any technology even a remotely in the near future. This made me chuckle, and think of the first Indiana Jones movie where Harrison Ford was being chased by the natives through the jungle. In one scene they're like 20 ft behind him, and then immediately in the next scene they're a mile or more behind him. It was forgivable in that movie because the rest of the movie was so well done. In this movie it just seems like an insult to the intelligence of the audience. An assumption that we won't notice because we're just too stupid. And we'll be so busy being blown away by the lavish special effects (which is all the seems to really matter these days anyway) that if we do notice we won't care.Then we get to the end. And I haven't even finished the movie as of this review. I've still got about 10 excruciating minutes left that I'm struggling through between switching the laundry from the washer to the dryer.So the Android child finally makes it into N. O. M. A. D. And apparently has to get all the way to the \"core\" (cuz everyone knows there always has to be a \"core\") in order to shut the system down. But it's powerful as this kid is - powerful enough to shut this entire military installation down with nothing but a few minutes time and a Buddha pose - she's not powerful enough to keep it shut down. So as soon as she runs away the whole thing conveniently comes online again.Here's a really good one: as the child robot is running back to rendezvous with the male protagonist, who's currently running out of oxygen and suffocating, she comes across a room filled with more robots. All offline. Oh, and one of them is her \"mom\", in robot form.Of course! That makes perfect sense, right? Cuz why wouldn't a nation that built a multi trillion dollar military installation for the sole purpose of wiping artificial intelligence off the face of the Earth then go and produce a whole bunch of artificially intelligent robot and neatly package them like yesterday's sandwiches on the very same military installation they built to destroy them?Oh and of course they would make one of them in the likeness of \"mom\", or Nirmata, or whatever. Nothing about that makes a lick of sense.But whatever. Because we've moved past the reasonable suspension of disbelief and into the total suspension of intelligence.So now the child robot drags \"mom\" towards the rendezvous point with the male protagonist who is still struggling to breathe. Then decides to give up on Mom and go rescue the male protagonist by dragging him into an airlock, which for some reason pressurizes fills with oxygen, even though there's vacuum on either side. Maybe that was the result of the child's magic tech voodoo??Honestly.... It's just sad the way Cinema has gone. I feel like nearly every era since the dawn of the motion picture had something valuable to offer, up until the last decade, when it really, noticeably all started to go to h****.Nothing in this film managed to engage me on any emotional level whatsoever. It didn't make me think. It didn't make me feel. I didn't walk away from this movie with a sense of wonder, or awe. The acting was passable. That's about the best I can say for it.It served to pass the time between washing the dishes and doing the laundry. I would never buy it on DVD, if that was even still a thing these days. It's certainly not worth a second viewing. And ultimately I weep for those of you who have grown up in an era where everything has been so dumbed down that you can't even recognize when you're being fed garbage.Furthermore I just find it an absolute tragedy the tens of millions of dollars that gets spent on this absolutely rubbish when that money could be so much better spent on anyone of the 100 problems our society is currently dealing with today.Is anyone in the movie industry capable of an original thought anymore? I guess not. This film was a perfect example of why I never go to the theater these days. Between the cost of the tickets and the cost of the snacks you get the privilege of spending $40 - $50 to walk out wishing you could get those 2-3 hours of your life back, then go home and pop an aspirin.So there's my rant. I wonder if anybody else feels the same way... Not that it'll make one iota of difference.",
    "64": "Let's get the good out of the way: this movie is visually stunning, with fantastic cinematography and impressive CGI. I also really like the world they've tried to build as the setting for the story. But as with many other aspects of the movie, I wish this world building had been done in a deeper and smarter way. The whole movie could have definitely benefited from finer writing and acting to bring the emotional depth it sorely needed for the story they tried to tell. And there are also many plot holes and elements that just plainly don't make sense. But if you take it for what it is, a sort of \"straight to video\" type of movie, it's basic sci-fi fare that does its job as entertainment. It's just a shame when you think everything was there to potentially make it epic.",
    "65": "Lacking a coherent plot, this film unfolds as a series of disjointed events. While it boasts a few commendable CGI effects, many others fall into the realms of monotony and redundancy, failing to add any real substance. The direction of the movie is notably lackluster. Regrettably, I overlooked earlier reviews that pointed out its inability to resonate with the audience, a flaw I attribute to the poor direction. Watching this film felt like an exercise in futility. If you're considering it despite this review, you're likely to return here, nodding in agreement. Spare yourself the disappointment.The narrative is riddled with inconsistencies and logical gaps. For instance, a scene featuring a 30-second countdown is inexplicably stretched to a two-minute duration, among other glaring issues. In summary, the film is a patchwork of underdeveloped ideas and ineffectual storytelling, making it an unsatisfying viewing experience.",
    "66": "Visually, it's great, but underneath it all, it's just a stupid stupid movie. Nothing in this movie is realistic or even remotely makes any sense. It's just one unrealistic situation after another, and then followed by another.I still couldn't wrap my head around that for some, it's perfectly okay to kill fellow humans, but not robots. Or how the united states would attack the rest of the world unprovoked at the whim of a single person. It's a poorly thought out story laden with satires.How is \"powering off\" such a bad thing? It's just like sleeping. Just takes a while more to boot up, that all.",
    "67": "Saw all the 4 and 5 star ratings on the poster for this one, and had to check it out given how relevant it is in todays day and age. But now that I've seen it myself, all i can say is that it is a good movie. If not a great one.The story is good enough, but goes on a little longer than it should. While the whole look of the film is very cool with there being plenty of action. But it does all feel like it thinks its a better movie than it is. It tries being all emotional and everything, but it's just about robots at the end of the day, so there are no feelings required. The effects are great and everythings decent. But there are no big surprises, or big characters or anything to make the movie truly stand out.",
    "68": "This is a lesson to the movie industry on how to use a budget. 80 million dollars was used splendidly. The cinematography was amazing, (Not terribly surprising because Rogue One) acting was great, and the story was decent.It wasn't without problems though. The story moves at an increasing pace and at some points you lose track of what's happening. Suspension of disbelief will be needed in some moments.The theme of the story was to make AI to be more than just robots. I think they succeeded there, but at the expense of the humans. Most of the humans in the story ended up being one faced - except for Joshua.The dynamic between Joshua and Alfie was by far the best part of the movie. The acting was great between the two.It was a good movie. Not great by any means, but I'm all for supporting a movie that is trying something new.Overall, I think Gareth Edwards should be given some more projects. AND filmmakers everywhere should learn how a budget should be used.",
    "69": "I watched this from start to finish without being drawn into the story at any point.I think John Washington is miscast here, I had the same exact experience when i watched Tenet... found myself very disconnected as I he didn't seem to make a proper connection with the role he was portraying.That is not to say the film isn't without issues. They have been fairly well documented by other reviewers so I'll not labour the points here.My main issue is with the lack of emotional involvment with the characters. The film measures zero on the emtional richter scale, but more, the screenplay just doesn't manage to get you excited or involved with anything that is unfolding. Additionally, the characters seem to have little connection to each other. In fact it is only at the end of the movie that Joshua and Alphie seem to have any tangible emotional cohesion.Contrast this with The Golden Child 1986 where Eddie Murphy plays Chandler Jarrell and the connection he makes to The Golden Child played by J. L. Reate. Here you can see what a great connection is established on screen and the massive difference in outcome it produces. Both films have two similar sets of pairings in almost identical scenarios with a stark contrast in outcome.Anyway, for me the film was a big dissapointment, I can't say John David Washington was the cause of this since the Movie has many other problematic aspects, but the ones I've mentioned were particularly significant for me.5/10 sadly.",
    "70": "Sigh. As a self-proclaimed sci-fi junkie, I was looking forward to this new original stand-alone sci-fi movie. And I left fully disappointed. It's exactly like so many movies I've seen before. I basically knew how the entire movie would play out in the first five minutes.Even so, I've enjoyed plenty of movies that seem derivative. If it's done right, it can be good or even great without any originality. But everything about this movie feels off. I can see what it's trying to do. It's just not working. Character arcs and changes in perspective feel completely unearned. Emotional moments evoke no emotions.Even with all that, could I at least enjoy some cool sci-fi action? Not really. It feels mostly tame and surface-level. Part of it is the annoying limitations with PG-13 movies, avoiding all violence even with death all over the place. But it's more that the action isn't creative or... intimate? Shooting scenes are just a bunch of bullets flying everywhere (with terrible aim). And throw in explosions every now and then.People who don't watch many movies will probably enjoy it more than me. But I can't recommend this movie. It could not get me engaged or invested, which is not a difficult task for someone who loves movie as much as I do.(1 viewing, early access screening UltraScreen 9/27/2023)",
    "71": "My wife and I caught The Creator (2023) in theaters last night. The storyline unfolds in a futuristic society where humans and AI robots find themselves in conflict, triggered by an AI robot-initiated a nuclear attack on Los Angeles that claimed a million human lives. A man, once assigned to bring down the leader of the AI robots, experiences a devastating loss of his wife and child during an undercover mission. The government offers him a chance to complete one last mission with the promise of reuniting with his wife, and he eagerly accepts the opportunity to right past wrongs.Directed by Gareth Edwards (Rogue One: A Star Wars Story), the film stars John David Washington (Tenet), Madeleine Yuna Voyles, Gemma Chan (Eternals), Ken Watanabe (The Last Samurai), Allison Janney (The Help) and Marc Menchaca (Ozark).While the storyline bore strong resemblances to Blade Runner, unfortunately, the plot of The Creator proved to be highly predictable, with only one noteworthy twist, and I didn't find myself as invested in the characters as I had hoped. On the positive side, the acting, special effects, cinematography and settings were magnificent, but throughout the entire film, there was a sense that something crucial was missing. Additionally, the film's extended runtime led to certain sections that dragged. However, it's worth noting that the ending was satisfying, and every action scene and shootout was executed exceptionally well, making this worth your time.In conclusion, The Creator is a modernized take on the Blade Runner formula that falls short of greatness due to a missing element. I would give this a 6/10 rating and recommend seeing it once.",
    "72": "Oh dear. I was really looking forward to this, and managed to get a ticket for a pre-release showing. I left disappointed.One fact that too many film-makers have failed to grasp is that CGI alone does not make a film. Effects can make a good film better, but they can't make a mediocre film good. Marvel, I'm looking at you.It's not enough to string a few action scenes together and finish with some really big explosions. You have to have a story - preferably one that hangs together coherently. This is what's missing from this film, whose plot-holes are more pronounced than the holes where the AI characters' ears would be. Just one example - our hero is on the run in an unspecified Asian county, where it's established that he doesn't speak the language. He breaks down. A van stops, and he's asked if he needs help. Asked in perfect English. That's bad enough - but then for no explored reason, our good Samaritan progresses from giving a stranger a lift to helping him through a police road-block, risking the lives of his five children in the process.Why are there gardens on Nomad? Why, if it's the last word in military technology, is it as easy to blow up as the Death Star or a Bond Villain's lair?The child-McGuffin is portrayed by an excellent young performer, but makes no logical sense. The nuclear blast in Los Angeles (seen in the trailer, so it's not a spoiler) is cited as the reason for the war against AI. There's one throwaway line about this late in the film - but it's just that: a throw-away line. Following it up would've led to a much more interesting film.I've heard it suggested that this should be seen as a metaphor for America's involvement in Vietnam, If so, it's a tired re-hash and forty years too late. Also, that would mean regarding it as an intelligent film, which it absolutely isn'tJust one more big-budget wasted opportunity.",
    "73": "The Creator seemed to promise so much through its trailer, and although it is still a very enjoyable film it feels a little too safe and run of the mill.It's story follows the familiar tropes of humanity against AI, super weapons, chosen ones, and the reluctant guardian. None of these are overly original but they are decently executed in this film nonetheless.The emotion of the piece is a bit hit and miss. Even though the performances are good, particularly Madeleine Yuna Voyles in the role of Alfie, I just didn't really connect to any of the characters. This lack of connection and emotion is one of the biggest things missing from this film.There is no denying however that this film is beautiful. The natural landscapes are used well and the grainy camera style really adds a nice element. It also has a good score and the direction is very solid.Ultimately The Creator is a really solid sci-fi film, but it just feels a little safe and derivative. Perhaps my expectations were too high as the trailer suggested this was potential a more high concept and emotionally gripping sci-fi, when I don't think that is the case. Still a good film though.",
    "74": "There are classic sci fi movies like Bladerunner then there's this - don't go expecting Bladerunner .It's not all bad , it just wasn't good .If you add the cgi skill of Neill Blomkampt films like District 9 & Elysium - but think more of the latter than the former you're getting close - all flash but script let it downI'm some ways it had similarities with Starship troopers & Terminator but here the lines were blurred as to who were the good guys & who were the baddies - if anything it was like Avatar where the aliens or AI replicants were actually the underdogs - not unlike what's happening in the Middle East right now or what happened to the native Americans when the Europeans colonised the westSo emotionally it should have done well but you didn't feel connected , the acting of the little child was a standout & you couldn't help but root for that characterAt the end of the day it wasn't a film you wanting to tell everyone to go and see it , it was quite the opposite & there's probably not enough material there for a sequel but perhaps a prequel might have legs although that might actually seem like a pun if you see the movieCGI 1 script 0Pad. A average 4/10.",
    "75": "4.8 ⭐\nAbsolutely stunning work from director Gareth Edwards and cinematographer Oren Soffer. Shot on a Sony FX3 and on location. Impressive. From color grades, shots and VFX...all top notch. A visual spectacle.Although Gareth Edwards pulls through visually, he fails miserably on the storyline. The amount of times my party sat there and looked at each other saying \"wait, what? Why?\" was too much to count. Things didnt add up and begs the audience to question many things. As if Edwards was just trying to get to an ending rather than build the story. Creating that tension or closeness between ai and humans was lacking.John Washington's mono tone, emotionless acting contributed to that disconnect. The exact \"read off the script\" acting we saw in Tenet. How he got this role is mind blowing and nepotism at its finest. His performance was only saved by child actor Madeleine Voyles, who was great. Few other questionable casting decisions, you'll see if you choose to not wait for the stream (the soccer mom playing a ruthless captain)All in all, this film was entertaining at the very least. Could have been awesome as i love how rogue one was done and im not a star wars fanatic.Worth the ticket? Eh yea not bad but definitely not a rewatch. Oh and ill never watch anything with John Washington again lol.",
    "76": "That is literally all that comes to mind a disappointment. Going in, I genuinely wanted to like this movie. I mean the director of Rogue One doing a standalone new title sci-fi film. What could go wrong? Well, apparently, everything.Let me get through the positives because that's a short list. Good acting, a great concept, and an interesting world... um, that's it.So what's bad about this film? Well, literally everything else. The story is a mess and told equally as messy. The film is convulted and tries so hard to appear deep, intelligent, and emotional, yet it's all surface and is very plain to see how empty it truly is. Unfortunately, Hans Zimmers score does nothing here as the music just didn't stand out, so I was surprised to see that he composed the music.But I think what bothered me the most about this film is that it felt like a more annoying version of Avatar. Gareth Edward's, in my opinion, like James Cameron, shows absolutely no discretion on whom the audience should side with. It all comes off as manipulation and extremely biased. So humans bad, aliens good, turns into America/Western Culture bad, and New Asia/Eastern Culture good.There is no character on the side of the Americans aside from John David Washington's character who is \"good\" or likeable but on the side of the robots they are all victims and the people of New Asia are victims of the oppressive and evil Americans. Who are basically painted as this worlds version of the Empire. They even have a deadly space station. While the robots are the Rebel Alliance doing what they can to fight this evil.So obviously as a viewer and decent human being I won't side with the Americans but the film does nothing to prove to me these robots are the victims that Gareth Edward's so desperately wants me to believe. In fact, there's a sequence that proves to me the opposite that some of these robots will kill their own people to protect this child who is essentially a Christ like figure to the robots. There is absolutely no unbiased look at both sides in this Vietnam like conflict.Then, at the end of everything, the explanation as to the reason for this war is absolutely moronic, I'd say what it is, but that's touching on spoiler territory.The movie explains nothing in the way of what this AI is or how it became \"sentient,\" etc. Also, if these robots are so peaceful and innocent, then why not make an attempt at peace? But that wouldn't happen because America is evil and dead set on destroying all AI consciousness, so any peacetalks would undoubtedly fail. Edward's here expects the audience to take everything at face value and not question anything. Which is exactly what the liberal mind expects from you, so I shouldn't be surprised. Now, I wouldn't say Gareth Edward's is a liberal as I don't know the man, but he's playing with liberal ideologies.Then, the movie tries to be a social commentary on war, which fails miserable because it conflicts with the notion of the robots being all innocent victims. Essentially, the message being all war is unjust, and the ones who suffer the most are the innocent who get caught in the crossfire.So if this film truly wanted to show that war is the real enemy, then don't paint one side as innocent victims and paint the other as cruel, oppressive aggressors. Instead, put in some effort and show that both sides aren't innocent that both sides have done evil to one another.Finally the film is no where near as beautiful as trailers made it out to look, but I'm going to be honest here and say that's most likely due to the fact we watched this film in a crap auditorium. So, hopefully, upon a second viewing, which I do plan on having, it'll be with a better projector and screen. But also so much of this movie took place at night, which I could not understand why. Perhaps so they didn't have to show so much? I have no clue. The action, I guess, looked good, but I just didn't care for what was happening in it.Anyway, I will close things here and say I'm sure a great many people would disagree with me, but that's fine. These are the issues I had with this film, and they are simply my opinions. If you liked this movie, then great. I'm happy for you, but I am just genuinely disappointed. Though, after seeing the film, I can understand why it has mixed scores.IMDb: 3/10\nLetterboxd: 2/5Watched in Theaters.",
    "77": "There's nothing worse than a film that grabs your interest and makes you look forward to it, to then let you down with utter disappointment.The Creator is one of those films.The good\nIt's visually stunning, with amazing effects, settings, scenery, vehicles, motion capture, character design etc. It definitely delivers on the eye and ear candy.The bad\nThe writing is woefully lazy with potholes littered everywhere.The pacing is painfully slow. It livens up here and there with action scenes, but overall it never really gets going into the sci-fi adventure I hoped for.A lot of scenes feel disjointed and pointless at times.The cast is mostly terrible with actors delivering either deadpanned or over the top hammy performances.The entire premise of the gun-ho US Army marching across continents unopposed at all is just downright ludicrous and doesn't fit with the world it's based in at all.I'm summary, looks great but also an utter snoozefest.So disappointed.",
    "78": "When the trailer for The Creator came out, I basically became a Facebook Disney fangirl but, like, the opposite.I was all \"OMGOMG it's a big Hollywood sci-fi movie but, like, it's made by a director with a voice and... Get this... it's based on ABSOLUTELY NOTHING! No really, they FINALLY remade/rebooted/did a sequel to NOT A DAMN THING!! OMGOMG, I've waited my whole life for originality! TAG A FRIEND YOU HAVE TO SEE THIS WITH!\"Be that as it may, the film as such is kind of dull and, despite not being based on anything specific, has its share of clichés and ideas that seem borrowed from prior works of sci-fi. It has the strengths we've come to expect from Gareth Edwards (few directors achieve a sense of scale quite like he does; we feel humbled by his versions of Godzilla and the Death Star in a way that we hadn't before) but also exemplifies his weakness when it comes to creating gripping characters.Still, it's hard not to appreciate the movie on some level. Edwards' vision is very much on the screen; it's just that his influences were either too obvious or distracting -- in the sense that they reminded me of more captivating stories I could be watching instead. (Quoth Joe Bro on Twitter, this movie will be \"huge for people who never heard of Akira, or Blade Runner, or The Last of Us, or 9/11.)Regardless, I'm happy I gave it a shot. Some of these images are worthy of the pages of Simon Stålenhag.Here's hoping Edwards someday adapts some of his tales.",
    "79": "This is going to be an unpopular review, I know. Maybe I was in the wrong mood coming into this movie, but I turned it off after 25 minutes, couldn't stand it anymore. The whole premise of American white males are constant war-mongers and do not understand progress. If you are an African American you *might* be ok, it helps if you are hurt or imperfect in some other way, if you are a minority then you should be protected and saved, etc etc.The story as a whole makes little sense and it is remains incoherent with empty dialogues and mediocre acting. Why bombs, why the war, it is not explained and when those questions are asked they reply is some sort of a joke, such as \"they are here for our jobs\". Also not explained why would someone remove his prosthetic arm before going to the pool but not his leg. Whatever.The only redeemable quality for this movie is the production value and the almost next-gen gaming-like scenario and photography. I guess if you can ignore everything else, and just look at the imagery you might enjoy it. I personally needed a little more, or actually quite a lot more.This is another polarizing creation. I fell on the \"don't like it\" side, two thumbs down for me. Looks like writers were on strike but CGI was on sale. Exact score: 44 / 100.",
    "80": "Gareth Edwards proves himself to be an astoundingly brilliant director with The Creator, as he crafts a visual and auditory world rich with layers of detail, and characters that we quickly understand and naturally grow over the course of the story.He made an $80 million movie that looks like it cost at least twice that. This cost less than half of what Thor: Love and Thunder cost. Let that sink in.Edwards shows he's a better director than writer, as the film is far from original, borrowing concepts and themes from plenty of old classic sci-fi stories. And it's also burdened with some clunky dialogue and rushed, convenient crucial plot points.Yeah, it's imperfect. But it's made with a confidence and care that goes beyond the degree of admirable. It's an earnest expression of love, redemption, sacrifice, and forgiveness put out by a filmmaker who really cares for the characters whose story he's telling.It's a work of art that, even with its flaws, deserves to be seen.",
    "81": "Before, I was curious if the movie would delve into thought-provoking internal dilemmas, whether the story would be good or not, if it would be an indie sci-fi or a grand, epic spectacle... because the trailers already teased at impressive visuals as a given, so I hoped that the rest of the movie would live up to them. Ideally, it's better to get into the movie without watching trailers, but I couldn't avoid them, the cinema had been playing the Creator trailers as previews for other movies for a while.I wasn't getting myself too excited for this because it could've easily been a cliche and unimaginative, but it wasn't and still had an original feel to it. The short background was nice, especially since the human vs. AI theme has been explored before. It was good that the movie didn't dwell on developing plot points that didn't bring anything new to the table. The world-building was well done and gave the film a sense of familiarity.I thought this was gonna be an indie sci-fi flick, but the sheer vastness and visual splendor put away any concern of the \"small\" budget it had being restrictive. It's remarkable, especially when you compare it to many other big-budget TV shows and movies that don't achieve this level of visual excellence. The explosions were cool and plenty; while still not being overdone. Visually, everything was executed perfectly; it was a true spectacle. I liked the slightly grainy texture it had, instead of the smooth shiny CGI feel like that seen in MCU films.I liked the storytelling approach of breaking the movie into chapters. It gave the movie a sci-fi narrative or dramatic feel rather than being purely action-packed, although there was plenty of action as well. As I mentioned earlier, there were a lot explosions, but they were handled sensibly and maturely, yet still managed to bring that childlike excitement in me that likes seeing things go boom.It was funny in a subtle way, they weren't trying to sneak them in and it's not getting big belly laughs. The pacing was good, and overall, it was was just a well-crafted film. The world-building was gradual, allowing you to learn about this world as the movie unfolded, rather than through an upfront introduction to it all. This world was well crafted, showed depth and thoughtful design.Why would a war vet have an alarm clock that triggers his ptsd???? That was the one unintentionally funny scene, literally burst out laughing at that. Anyway, Sound track music score was great, different from what I usually remember Hans zimmer for, but I should say I don't have a keen ear for that sorta stuff. I was only paying attention because I knew it was zimmer.It somewhat felt like a breath of fresh air, of course the human vs AI trope isn't new, but this was done right and didn't feel like a repeat or rip-off. It's a sci-fi film with heart and genuine emotions. As far as the plot, it reminded me of Hugh Jackman's solo Wolverine film, Logan. And the cast did well too, a very decent cast who put in wonderful performances, from both antagonists and protagonists sides. Standout was Madeleine Yuna Voyles, who portrayed the character Alphie exceptionally well. I was also impressed by Allison Janney's believably ruthless portrayal; Washington and Ken Watanabe once again showed their acting prowess.The plot and its twists and turns weren't mind-bending, there were several moments where you could piece things together before the movie officially unveiled them or before the characters caught on. But, I consciously tried to avoid predicting where it was heading. The final act was a pleasant surprise, at one point in the movie, I thought it was reaching its end, but that it was just the beginning of the final stretch. So for me, it felt like a bonus lol.I was curious as the movie went on if it was going to end a full story arc, or simply just a set up more sequels. I loved that it felt like a natural ending to the story while also leaving the door open for potential sequels. The ending seemed inevitable but I wish it was different, but as I said it felt natural so mixed feelings. The pacing was impressive, and the plot was lean, without any unnecessary stuff. Despite its simplicity, pretty significant events unfolded throughout the movie, keeping the narrative interesting.This movie is emotionally evocative; beyond sci-fi, it carries the weight of a war drama, which naturally comes with emotional impact. The storytelling is told in a way that tugs at your heartstrings, particularly sympathizing with the AI robot side, but when it comes to the \"bad guys,\" the Americans, you can understand their logic but don't necessarily side with them. The American military personnel are portrayed as very typical, following the textbook design. They view the other side not as people but as enemies, which makes them ruthless and seemingly heartless in their pursuit, all in service to their country bla bla bla.One aspect I wished the movie had explored further is the theme of emotional dilemmas, particularly whether AI can be considered as beings with feelings. It attempts to touch on this with the \"who gets to go to Heaven\" theme, but the rest of the movie didn't delve as deeply into these themes as I had anticipated.Unfortunately, I don't think it's a movie for everyone; it's more enjoyable if you're already a sci-fi fan. This is one of the reasons why I wouldn't rate it a 10/10. For me, that would place it on the same level as \"Interstellar,\" a sci-fi movie so exceptional that it transcends genre preferences. Nonetheless, I still think it's one of the best scifi movies in years. While I'm tempted to say it's the best since \"Interstellar,\" i think that sparks comparisons and I think it's more comparable to films like \"Rogue One.\" Better, maybe, but I haven't watched that movie in years.",
    "82": "While this is not the worst film of the year - that title belongs to the intolerably pretentious \"Beau is Afraid\" - \"The Creator\" is a horribly patchy pastiche of dozens of SciFi classics, and if \"Tenet\" was not testimony to John David Washington's complete lack of acting skills, then this mindless drivel is. Having Denzel's genes doesn't mean having talent, and it's time for Washington to finally realize that and enjoy his football money on some island retreat. He walks through the film like one of the robots, and I for one will never put myself through watching anything with him in it ever again.The almost non-existing story centers around the relationship between a merc and his mark, and a director can either downplay this as much as possible by blowing things up every two minutes, or one can use an actor who can carry emotions through explosions - which Denzel Washington can, but his son most definitely cannot. Unfortunately, Edwards does both, so the film meanders between brainless shootouts and incoherent encounters. If you use your brain for a second while watching this, you will inevitably experience the searing pain of intelligence insult since nothing makes sense.The tidbit narrative is a constant reminder how much better the films that inspired it are. Most annoyingly, the film makes zero use of its underlying theme of a fascist white American society persecuting an Asian culture. And while that is a tired and simplistic approach to begin with, going all the way with a \"bad white people vs. Good Asian hybrids\" would at least have been edgy given US-Chinese relations. Yet this is just one of the many missed opportunities here. A genuinely bad film is easier to watch than one full of wasted potential, and \"The Creator\" is a prime example.",
    "83": "The Creator is an all too rare piece of original epic sci-fi that's built on very familiar foundations and uses them to create something that's as visually exciting as it is emotionally investing, completely unafraid to show American military might for the soulless monster it is.John David Washington plays his reluctant father figure in terrific fashion, closed off at first but those barriers are all successfully worn down by the end. In her screen debut Madeleine Yuna Voyles is amazing, adorable and undoubtedly the main reason any of this works on an emotional level.Supporting them is Ken Watanabe being as effortlessly stoic as always and Allison Janney as an antagonist with a solid amount of depth all thanks to just one scene which efficiently explains her viewpoint in a believable fashion but she's also just plain ruthless in her relentless pursuit.Gareth Edwards once again proves he doesn't need established franchises to create epic imagery or fascinating worlds on a blockbuster scale. Between the stunning cinematography by Greig Fraser & Oren Soffer and the ridiculously impressive CG it outdoes the majority of the competition on a fraction of the cost.Uncharacteristically for Gareth Edwards there's a fair few needle drops early on, the choices can be obvious but always effective and the music by Hans Zimmer is solid. It's mostly just fine up until the third act where it really comes to life and avoids feeling wasted.",
    "84": "This Star Trek episode came to mind during watching Gareth Edwards new film The Creator.And I will start with a quote of Jean Luc Picard in the courtyard of what rights does an artificial intelligence have: \"one is a curiosity. What about a thousand? Does that not become a race? Are we not judged by how we treat that race?\"\nThe movie builds up a story where the USA is in a relentless war against artificial intelligence. Indoctrinated like people in the McCarthy era. Over the times where some Blade Runners are searching for a couple of androids. They have already become a race. Mostly living in china or asia for that matter. In 2023 the diplomatic relations are everything else than good with USA and Asia. But the movie does not try to comment on that or comment on the most controversial philosophical issue of our time. The AI.The movie shows a story of a man letting go of indoctrinated beliefs and helps the supressed. Like in Rogue One, also by Gareth Edwards, in a Guerilla fighting way. Once more Garreth Edwards takes on the theme of rebels. Mixes it with AI themes and brings us a movie with superb special fx, outstanding landscapes and good actors. There are a couple of humorous scene that unfortunately are not funny. Furthermore with all that said. The Creator is a movie with many themes to think about and it is a reminder on how disgusting humans can be by de-anthropomorphize beings. Unfortunately the movie takes kind of a lazy explanation for the conflict. No deeper insight is taken on how de-anthropomorphism emerges. That is crucial in a movie like that and leaves me with the opinion that the movie stumbles upon big ideas it had.But I have seen worse. Much worse... like Neil Blomkamps desaster Chappie...",
    "85": "I saw the poster which was reminiscent of Mandalorian & Oblivion, saw the solid cast, the ratings, and went for it. Mistake.The pretty graphics would make sense in a video game, where the story doesnt matter. But a movie isn't like that.Michael Bay has the humility and intelligence not to write his own stories. Why does Edwards have the hubris to poop out an entire world, and a story, and a script all by himself? Aren't there enough sci-fi writers to assist? Or was it a weekend job with chat gpt?Writers, authors, and story tellers matter just as much as actors, directors and producers: audiences aren't stupid.Low rating comments have listed at length the plot holes, so I wont repeat them.This movie is an insult to writing & a waste of resources.",
    "86": "Take 1/5th Blade Runner, 2/5ths Elysium, 1/5th Platoon, and 1/5th Avatar and mix them. Boil them for hours until all the emotional engagement and interest in the characters has been boiled off.Add a terrible leading actor and serve on a bloated run time.Who decided to cast John David Washington? He was emotionally lacking in \"Tenet\" and he brings EXACTLY the same \"blah\" performance to this film.Who decided 2:13 was the right run time for this? It could have been a good punchy high concept action if it had been kept below 2 hours.As others have said, this film felt emotionally void and I was completely disinterested by the end. Thank goodness we didn't watch it in the theater. A wasted opportunity.",
    "87": "After AI nukes central America, the fight between East and West begins, with the former embracing AI technology, and the latter determined to destroy it, a former soldier is asked to capture the East's new weapon, which threatens to win them the war.The last time I was genuinely blown away by a sci fi epic was back in 2021, and that was Dune, and though I wouldn't perhaps say that The Creator is a classic, I'd still say it's an extremely fine movie.It's a visual feast, it looks tremendous, we're presented with a whole new world, a whole new society, and a race of beings that look very impressive, along the Deux ex machina vibe.The story itself is far from black and white, it's fairly complex, with several layers, it may even challenge you to see who's side you're on.I would dismiss those who say it's simply a man Vs AI movie, it's so much more than that, it's almost a man Vs humanity story, with questions raised about what exactly it is that gives us basic humanity.If I had one criticism, I felt that they could have gone a bit further, maybe a few more elaborate battle scenes, perhaps a bit more threat coming from the other side, considering The East had superior AI tech, they rolled over pretty easily.There were definitely a few subliminal messages throughout, and I'm sure they're all open to interpretation.I thought John David Washington really did deliver, and it was the chemistry and journey between him and Alphie that made it so enjoyable to watch, even if the relationship was perhaps a little obvious from the start.A few quips, but sci fi films are hard to get right, so many of them are underwhelming for one reason and another, so let's celebrate one that delivers on many fronts.8/10.",
    "88": "In an era where cinematic brilliance often intertwines with technological marvels, 'The Creator' emerges as a perplexing enigma. With its fusion of cybermonks and a religious AI, the film ambitiously attempts to tread the fine line between avant-garde and absurdity, often teetering precariously towards the latter. This begs the question: Was the expenditure justified for such a labyrinthine narrative?Awarding 'The Creator' a 3-star rating might appear as an act of unwarranted charity, particularly when the script and performances resemble a theatrical shipwreck more than a polished production. The CGI, admittedly competent, serves as the lone beacon of redemption in an otherwise murky sea of cinematic missteps.The characters, devoid of depth, wander aimlessly through a plot as thin as the paper it was written on. Their battles, both internal and external, seem as comprehensible as quantum physics to a toddler - a chaotic whirl of confusion and lack of purpose. The movie's overarching theme, presumably about acceptance and tolerance, is as subtly handled as a sledgehammer cracking a walnut. It raises a pivotal cinematic quandary: Can a film, awash with grandiose CGI and muddled analogies, truly sway the hearts and minds of its audience? 'The Creator' seems to answer this with a resounding, yet unintentional, 'No.'In its attempt to weave a narrative that's both thought-provoking and emotionally resonant, 'The Creator' unfortunately stumbles, becoming a cautionary tale in the annals of film-making. It's a reminder that no amount of digital gloss can compensate for a script that lacks soul and characters who are mere shadows, chasing ideals they themselves don't seem to comprehend.",
    "89": "In the year 2070, the United States is engaged in a series of proxy battles across New Asia with a nuclear detonation in Los Angeles some years back having served as an inciting incident that outlawed Artificial Intelligence (A. I.) in the United States with war declared on the whole of A. I. with Simulants (A. I. with humanoid features) now seeking refuge in New Asia. Former soldier Joshua Taylor (John David Washington) has since left the service following the loss of his wife Maya (Gemma Chan) during an undercover operation in New Asia five years prior looking for the A. I.'s leader Nirmata. However Colonel Howell (Allison Janney) and General Andrews (Ralph Ineson) approach Taylor telling him his wife may still be alive and enlist him to investigate what's allegedly a new weapon by Nirmata called Alpha-Omega. During the excursion, Taylor is separated from his group and comes to find the Alpha-Omega is in fact a Simulant (Madeleine Yuna Voyles). As Taylor continues his journey across New Asia with Alpha-Omega (whom he calls Alphie) in tow, Taylor finds himself challenged in his position on A. I. and the nature of the conflict.The Creator is the latest film from director Gareth Edwards (Godzilla and Rogue One) that marks the first project from the direct since 2016 which he also co-wrote from his story. The impetus for the film according to Edwards came from when Jordan Vogt-Roberts invited him to accompany him on location filming of Kong: Skull Island which Edwards said spurred the idea of robots fighting in race paddies which would serve as the starting point for the project. Edwards got the project set up at New Regency under the initial title of True Love on a budget of $80 million with many seeing the film as a gamble given it's status as an original IP. I'm pleased to say that the end result is definitely a strong and passionately made sci-fi film with strong underlying ideas and aesthetics even if I feel Edwards makes a misstep with an overly fatalistic approach in some cases.From a purely visual standpoint, The Creator has a really unique look to it. While the film does have the Blade Runner-esque cityscapes you expect from this kind of movie, most of the movie tends to favor a more Earthy aesthetic which allows the robotic characters and creations to really pop out against the more lush natural backgrounds. The movie creates an interesting take on the well trodden \"man vs. Machine\" story with the machines painted in a more sympathetic light in comparison to something like Terminator or Colossus: The Forbin Project telling a very human anti-war narrative where despite the heavy CGI and PG-13 rating the film feels very stakey and tense in how it presents itself. Edwards as a director has always played a very \"boots on the ground\" approach to his films be it in Rogue One: A Star Wars Story, Monsters, or Godzilla and he definitely brings that same aesthetic here. John David Washington does well as Joshua and gives the role and he has good chemistry with Madeleine Yuna Voyles' Alphie with the two giving the film a feeling of something by way of Children of Men with Starman filtered through an A. I. lens. What I wasn't a fan of was the direction taken in the third act which definitely feels like it's trying to ape the ending of Rogue One to a degree and while it worked there as a welcome counter point to the typical Star Wars formula, here it feels very at odds with the emotional core of the film especially in how it's all about reconciling with \"the Other\". Maybe it's just me but I feel like a story like this probably would've been better served by a more positively skewed note than the one Edwards ends on.I really enjoyed The Creator even if I do have issues with it. In an age where audiences are routinely inundated with legacy franchises and IPs trotted out time and time again, it's nice to see a large scale sci-fi film that feels like it comes from a place of passion and inspiration. Some issues with the ending, but overall a really strong film.",
    "90": "\"The Creator\" is a science fiction film directed and co-written by Gareth Edwards (\"Monsters\", \"Godzilla\", \"Rogue One: A Star Wars Story\"). Starring John David Washington in the lead role, it delves into some interesting philosophy regarding how we view the use of AI technology.In 2070, humanity is at war with AI-built machines after the latter detonated a nuclear bomb in Los Angeles decades earlier, killing millions of innocent people. Still in mourning over his deceased wife from the resulting conflict, former special forces agent Joshua (John David Washington) is recruited by the US government to hunt down and destroy an advanced AI architect known as the \"Creator\", which possesses the power to not only end the war but mankind along with it. As he ventures deep into enemy territory in New South East Asia, Joshua soon learns that the Creator is being protected by the population of a small village who refuse to disclose its location to outsiders. After some forceful measures are taken by his team, Joshua makes his way into the facility that houses the Creator and discovers that this elusive powerful weapon is actually a robot child girl (Madeleine Yuna Voyles).Given the astonishing rate technology has been advancing over the past few decades, it seems inevitable that AI will one day prove a lot more problematic for humanity than it already is. Right now, many people are already at risk of losing their jobs to new computer programs capable of completing tasks in seconds that would normally take a person several hours or even days to accomplish effectively. There's also the potential danger that AI itself could become self-aware and pre-emptively attack us before we've even realised what's happened, as we previously saw in James Cameron's \"Terminator\" films. What differentiates \"The Creator\" from this is that it explores a more philosophical side to AI warfare and how the severity of its impact may not necessarily be the same for everyone involved.Through the use of newsreels and political speeches, the film essentially establishes itself as taking place in an alternate reality to the one we currently live in. We see that robots powered by AI have been in use as far back as the 1950s-1960s, working dangerous jobs originally occupied by humans such as police officers and firefighters. As time progresses, humans quickly learn to live in harmony with the AI technology they created, so when a nuclear bomb suddenly explodes in one of America's most populated cities, this comes as a huge shock to most people. What follows is a war breaking out between mankind and machine, with the humans reasoning that the AI technology is only doing what it is programmed to do, meaning that it is incapable of feeling any physical or psychological remorse for its actions.However, since this is an isolated incident, not every person in the world feels fully inclined to participate in such a war. In an area known as New South East Asia, the local human population actually chooses to side with the AI robots, believing that they are still our allies. This is because these people have managed to co-exist with AI all this time without any issue, so when the American government tries to forcefully take away what is convenient for them, a different kind of war breaks out between the two nations. The Asian setting and theme of American interventionism is likely an allusion to the Vietnam War, which also occurred due to a clash of different personal ideologies. It is an intriguing set-up for a film like this to show the duel nature of humanity via the use of AI technology, something that seems even more applicable in today's divisive political climate.On that note, the film's world building is handled rather efficiently here. Director Gareth Edwards shows how the local populace of New South East Asia utilise AI in their everyday life. We see that villages are protected by security robots and roads are paved using large self-operating machines. Even the poorest civilians are shown to have access to basic robotic technology, such as fishing trawlers using special mechanised boosters to hover above water. Due to the efficiency this has brought to these people, it is understandable why they are reluctant to help America bring an end to AI permanently. In fact, in one scene there is a children's television show playing that paints America (and the West in general) as the enemy by use of weaponised propaganda, furthering their wish to support AI in their country.Something I found particularly interesting among all of this was that there actually exists AI robots of Buddhist monks who preach the same spiritual guidance that regular humans would. At no point does it seem like people were the ones who prompted these types of robots to be built in the first place so it is possible that some kind of mass production machine decided on its own to program them with this knowledge of Buddhism in mind. This seems to imply that despite the grounded, scientific basis of robotic technology in general, these creations have developed some kind of desire to worship a higher power that doesn't feature any human involvement whatsoever. Because of this, it would appear that the robots in this world have become, as the Tyrell Corporation in \"Blade Runner\" said; \"more human than human\".Although these provocative themes provide a solid backbone for the film's plot, the pacing unfortunately feels a bit slow in certain places. Moments like this are especially noticeable during the second act, where there are scenes that drag on longer than necessary. This is a shame because I was genuinely enjoying the way the film sets up this world filled with ambiguous opinions regarding AI technology, only for a scene to either trail off into irrelevance or end up forgotten about later on in the story. Another problem is the film's overuse of dark lighting, which appears to be a common issue found in many films these days. Several scenes, even ones that take place during the day, have this unnecessarily dark filter that makes everything rather dull to look at. That's not to say the film isn't a visual treat, as there are some great CGI effects shown in outer space, but on Earth everything looks far less appealing in comparison.As the lead of this film, John David Washington once again proves he has what it takes to hold the audience's attention throughout even the most challenging of scenes to sit through. Even though there isn't too much depth to Joshua as a character, I did like the way in which Washington was able to play into his sympathetic qualities, which is more than enough to keep you invested. This is a man whose combined PTSD from combat and losing his wife is what causes him to have conflicted thoughts over destroying the Creator once and for all. Due to his initial indecisiveness, Joshua decides not to destroy the Creator right away but form a bond with it instead due to its human child-like appearance. This leads to a handful of poignant conversations between the two, which is particularly interesting as it shows a pseudo father-daughter relationship developing during the story. To that effect, we are seeing both man and machine finally learning to find a common ground among this deadly war happening between the two of them.At a time where the use of AI is becoming more popular than ever, \"The Creator\" manages to fit the bill of not only a thought-provoking science fiction film but also a cautionary parable of how our fascination with this technology can lead to dangerous consequences. Though the \"Terminator\" movies may have caused others to hate AI in its entirety, this film instead gives us the option of deciding for ourselves whether we are actually better with or without it. There's no denying our lives can be improved with some of these innovations, however, there is one thing that it can never fully replicate on both a spiritual and tangible level - our humanity. To that effect, it is our own human nature that ultimately plays into what will result from the emergence of this new technological era and only time will tell what kind of a future this will bring for mankind.I rate it 8/10.",
    "91": "This movie can't claim to deal with potential conflicts between AI and humanity because there is no AI present: The simulants lack all the elements of computer intelligence and have all the qualities of humans instead. Basically, they're just a bunch of people with holes in their heads so we can tell they're from the other side. It's easy to promote peace between the human and the computer race if the latter is exactly like us only better: more loyal, more honest, more caring, wiser etc. It's kind of silly to see a bunch of Asian kids cry their eyes out because some \"computer uncle\" was shot and the metal remains are carried off. Who says that the only form that AI can and will take is the spitting image of us humans - walking on two legs, having single individualities, eating, drinking, laughing etc? Perhaps people a hundred years ago had the right to nourish such childish ideas in respect to what robots will be like but we already live in the age of AI and know better.The Creator is trying hard to be a dozen things all at once: It starts out as a commentary on 9/11 with the simulants resembling Arabian terrorists (however, the nuclear attack on LA that left behind a new Ground Zero and set the whole plot in motion was, as it later turns out, just a big misunderstanding). In other moments, the simulants take on the role of suppressed parts of the American society like Afro Americans, Native Americans, or other victims of colonialism. Then there are scenes where the mood and look become somber, philosophical and avantgarde like in Blade Runner. Then there's are fight scenes or what I would call \"robot humor\" where the whole thing turns into Star Wars, and so on and so forth until in the end there's not much original substance left to speak of.The four stars I'm giving The Creator are strictly for the visuals.",
    "92": "Acting: 5\nCamera work: 6\nEditing: 6\nBudget: 9\nStory: 5\nTheme: 4\nPure entertainment factor: 5\nVideo quality: 8\nSpecial effects: 8\nPacing: 5\nSuspension of disbelief: 3\nNon-cringe factor: 4\nLack of flashbacks: 2Overall the movie is a dud. Just dull with bad storytelling. By the director of Rogue One (2016) and Godzilla (2014). Both movies are seen as mediocre dragging big franscises into the mud. This at least is original so it looked interesting. But original doesn't mean the movie is actually doing anything new. This one doesn't. It's cliche after cliche with the story not trying anything new or even trying anything much. There is hardly any story. The movie starts with a fight between humans and humanoid robots. We don't know who is good or evil or who to root for. We follow a human, but don't know what to think about anything. It's just a bunch of people shooting at each other and people screaming at the deaths and dangers. Yet for us viewers nothing feels emotional as we really don't care about a single person here. We don't know who we want to live or die or win or lose. So in any one of the 10 shoot-out scenes we are just watching bullets fly and people fake emotions - failing horribly with acting that is cringe.The story itself seems to be shown via small flashbacks. Just dull slow motion scenes with the lead carrying his wife on the beach. Or the lead slowly walking into the ocean. Nonsense wasting our time when we are eager to get going with the story. The movie is 30 min too long just because they keep slowing down with this flashback stuff showing nothing.Most scenes and events are also pure nonsense. As I said the movie tries nothing new, but it doesn't even try to stay logical. A helicopter has a bomb in it and instead of showing the woman with the bomb out they panic and do nothing. In the same battle the humans tell us they have a super weapon. We see the space laser kill tens of robot cops in a second. Yet in the next scene there are new cops arriving in the same location and the space laser is suddenly gone from the story - because the writers didn't want it in this specific scene to create tension. After the battle the robot kid walks up to the lead. So you'd assume the story would finally try to create a storyline and motivation. Yet the lead just tells the kid to go away. So yeah, the whole point was that the kid is important. Yet the lead, the guy we follow, is a depressed mess and doesn't care about anything. He just wants his dead girlfriend back, that's it. He doesn't care if the robots or humans win the fight. So we don't care either of course. And the movie then tries to create tension by showing a bunch of shoot-out scenes making no logical sense. Often with people standing out in the open shooting at each other. And then of course the lead can kill a full room of robots in seconds as they just stand around. I watch scene by scene making zero logical sense. Even small events make no sense and one wonders if an AI wrote and directed this movie. Or a small child. It's not even big stuff being broken. It's just that no one seems to have any goals. They are willing to die fast for nothing.We don't meet anyone and don't understand the world. Why are robots living among some humans yet are seen as evil beings trying to wipe out humanity? And then there is zero introduction of the world. We start out in a small wooden cabin on the beach. There is nothing here showing us this world. We never see a taxi, an apartment, a business, a police station, a meeting, a store, a school. I don't understand how this world works. I don't understand how the lead lives his life day to day. He's already dull with no clear plans or wishes. And with this we don't even see him live even a basic life. He's just nothing in a world of nothing. With robots walking freely yet seemingly easily wiped out in seconds in any attack. So why are humans not wiping them out right this moment if they are this easy to kill? The robots just have rifles and a few bombs. The humans have gigantic tanks, planes, lasers, bombs, rockets, robots. All battles are extremely one-sided so the whole \"robots may wipe us out\" idea presented at the beginning is pure nonsense the writer/director put in there to try to imitate other movies that show this scenario without making it coherent with the story he tells here. There are scenes where the US army meets humans that hide robots and robot bases and instead of trying to find out why half the humans on Earth work with the robots in the war they just scream at them. \"Why are you working with robots!\". Never waiting for an answer. We are supposed to see this as them asking and then just not getting an answer and never figuring it out. Yet this is a giant military with millions if not billions of people serving them with gigantic battles each single day with villages hiding robots. Yet not a single person or spy on Earth ever asked those other humans why they were fighting for the other side? And why are all the US army people so damn evil and cruel? The movie is trying to tell us that we can't know who to support yet the actors clearly show us which side is evil. Not because of any event. Just because they act evil. That's it. The events themselves are just nonsense with nothing being explained. And this over the top acting makes it worse as cleary we know one side is evil yet not why.I adore science fiction. I hate this movie.",
    "93": "The reviews of this movie are more misleading than I have EVER seen. Everything that is said is the opposite of what I actually saw. The 2nd or 3rd review in featured (at the time of this writing) didn't even get the gender of the child right, even though it's stated several times (despite the short hair, she's a girl!). Underwhelming? Void of emotion? I felt overwhelmed with emotion the entire film, and had tears streaming by the end. It wasn't just me either. I heard whimpering from a grown man a couple seats over, despite obviously trying to hold it in.Granted, I'm fairly emotional, so maybe not everyone will feel as strongly. But, this is essentially a war movie. It is a war between AI and humans in the future, but science is not really the underlying theme. It has a definite Vietnam feel, and America is not the good guy (hence the probable reason for political reviews). There's also innuendo of anti-terrorist (read anti-Islamic) violence in recent wars. Take that and the lead is a Black man, his costar a young Asian girl, and the entitled demographics might feel a tad sensitive.With that out of the way, I went into The Creator with very little info. As sci fi is one of my favorite genres, it was on my watch list for the Fall. I saw and loved Gemma Chan on Humans several years back and was so glad to see her, in sci fi again nonetheless. If you like this film, I recommend that show, as the theme is very similar. She is so perfect that she was convincing as a robot. It added a bit of depth to this film, I thought, too, if you knew she had that role history. And, without giving anything away, Allison Janney made a great female version of the stereotypical stalwart military general.This is an anti-war film. It has some nice bits in there for those interested in natural history as well. The soundtrack is a little campy at moments, but is a huge part of the impact of the film. Speaking of camp, there is a little fun at parts (ie the dog), but it never outshines the serious tone. This is not an action flick that's going to make light of the violence. But, it's not depressing. On the contrary, it has heart and an optimistic message underneath it all. Plus, it was visually stunning. Everything from the aircraft to the people (including the robots) are perfectly designed and cast.The Creator is a fantastic addition to its genre, both sci fi and war movie, driving the culture forward.",
    "94": "Right away, this is a must watch film. If you love cinematic imagery, this is po*n.The production is incredible. All the visual creative departments went ham on this, and it's incredibly beautiful, intricate and interesting.However, the writing was, at times, terrible; even some of the acting, mainly the character named Josh wasn't good enough (the kid was great tho)It felt like some of the scenes were \"forcefully\" inserted just for the sake of illustrating something, even though they had no logic or necessity (a robot bomb that's running? Really? Why not just shoot the bomb like you've already done dozens of time?)And also let's not get into the philosophical opportunity that's missed here. I wished they would tangentially hit more some of the existential issues about AI vs humanity.Anyway...Go watch the movie\nIt's solid.",
    "95": "Starting my review of the creator with some comments on the acting, I'm surprised at how meteoric John David Washington's rise to the top has been. He's a good actor for sure but he's not just ascending the staircase, he's jumping a few steps at a time. He's anchoring the Creator as our protagonist Joshua. I think he's good in the movie, he's brooding for what feels like most of the run time but when he's given a chance to either be funny in short bursts or vulnerable near the end, he gets the job done. Madeleine Yuna Voyles is fine as Alphie, she accomplishes what's required in any given scene and by the end of the movie, she does what she can in regards to selling the bond her character has with Joshua. It's hard to deliver a noteworthy performance as a child actor/actress and she's better than passable. I keep waiting for the Gemma Chan's breakout role but this is one of her better performances as Maya. She has chemistry with Washington but she's given little to do on her own. She's appropriately cast and she sticks the landing in her part. My two favourite performances were from the veteran members of the supporting cast in Ken Watanabe and Allison Janney as Harun and Colonel Howell respectively. Janney pushes the envelope just far enough without descending into being a cartoon character, her character's palpable hatred for the Simulants creates tension and the amount of disdain she conveys through just a look is impressive. Watanabe brings strength to Harun when he needs to but there's also a lot of warmth when his character is bonding with Alphie.Despite some solid work from the cast overall, I'd bet what's probably going to draw your attention in the marketing material for The Creator is the design of this dystopian world and how the war between humans and A. I. dazzles on the big screen. Gareth Edwards and his team weren't working with pennies but this is as impressive of a display for a science fiction movie that I've seen in quite a while. The cinematography is fantastic, the character design of the robots evoked Neil Blomkamp's work for me in the best way without ripping it off and the action set pieces are memorable enough to hold your interest. The movie is just as fantastical (or grounded depending on your opinion on the future of artificial intelligence) as any other sci-fi epic, but there's a beautiful mix of real imagination that keeps the movie grounded just enough that you can still take it seriously. I found it disarming that it was so excellently realized and even if you aren't enthralled by the story, The Creator is still a delight from a visual perspective.I would describe The Creator as story driven as opposed to character driven but we spend enough time with Joshua, Alphie and their friends and enemies to get to know them. I liked the work done on the characters but I wasn't emotionally invested in whether Josh and Maya were going to reunite or if Alphie would make it away safely. I don't want to point the finger at the scriptwriters or the creative team, I was left wondering how much of this movie had been cut out and left on the cutting room floor. Scenes normally required to get us to invest in some of these relationships (e.g. Josh & Alfie, Josh & Shipley or Colonel Howell & McBride) felt like they were missing to me. I don't want to complain about the run time because The Creator isn't a short movie but I was left wondering if they cleaved off a little more than they should have.My most prominent problem with The Creator was how easy to guess the overall arc of the plot was. I didn't discern what it was going to do minute by minute but you can get where the story will start, advance to and finish largely from the trailer. There are some surprises here and there but if you zoom out and observe the macro progression of the plot, this ground has been covered before. Cliche seems a little harsh of a description but The Creator still lacks something bold in where it decides to venture and I was a little disappointed by that.The Creator really falls between a 7-8 for me but this is one of the rare situations where I'm going to round down. The film is still a spectacle and if you can get over that the plot is a little recycled in certain respects, there's a lot here to enjoy. Gareth Edwards and his team deserve kudos for making The Creator a worthy theatre experience. But I still wasn't blown-away by this movie and I wanted it to really kick into the next gear to get past the 8/10 mark. The Creator is a solid science fiction adventure that is worth checking out on the biggest screen you can but outside of it's CGI and visual sensibilities, I don't think it will have the staying power to make the huge impact it's clearly swinging for.",
    "96": "The CGI and special effect of this film is on par with some of the newest technologies and combines visuals from Star Wars to District 9. However, this film suffers from a weak script that seems more focused on a political overtone than story telling.In movies such as The Terminator series and Matrix series, they focus on the inherent struggle of humanity vs machine and unravels the philosophical question of \"what is life?\"Though this film does also touch point on this theme, the protagonist began the film addressing AI as nothing more than machine and later come to terms of accepting them as some sort of life form, but much of this was lost because of the film's heaven emphasis on the nationality of the villain.For example, in the Terminator, the villain is the machines and the protagonists are simply all of humanity. In the Matrix, this is the same except if you watch it from the Animatrix prequel, it is much more sympathetic to the machine and humanity was actually the real villain, \"all of humanity.\"In The Creator, this deep philosophical argument is lost when they insist on labeling the villain \"United States,\" and thus the portrayal becomes a political overtone of preaching American imperialism, which is controversial and argumentative. Not only does this divide your audience, but it greatly diverge from the heart of your film's premise, which again is the questioning of \"what constitutes life\" and \"can AI become self-aware, sentient?\"So overall a 5/10 for me.",
    "97": "I'll start by saying that I went to see it knowing nothing about the plot, so I didn't have any expectations at all. I enjoyed it despite its flaws that have been pointed out by so many already.Everyone notices similarities with Terminator, Blade Runner, Avatar, and the visual effects and production design smell \"Rogue One\". This can be either good or bad depending on your point of view.Unfortunately the plot has too many unanswered questions which made me scratch my head. I just couldn't accept some of the plot points in the story. Maybe I need to watch the movie a second time to understand it better.I noticed at least a couple of moments where the editing is objectively bad and gave the impression that there wasn't enough footage to work with. I was also surprised to see Hans Zimmer's name in the end credits as the music didn't stand out in this movie.Long story short, I appreciate what Gareth Edwards and everyone else involved achieved in this movie. Gareth Edwards wrote a good story but the actual screenplay needed a bit more work.It's also insane that this was made with such a low budget and as a VFX artist myself I enjoyed the visuals more than anything else.",
    "98": "I had high, well more than normally high hopes for this movie.It did deliver on the visuals, which were quite stunning and very nicely done. Photography and visuas were really good.Then there was that part of a movie that is a story, preferably something you can't understand AND where almost every character is not a total fool, or moron. Then there are the plot holes, the story is riddled with them. Multiple times the story and dialogue deliver major information which just seems to fly over every characters head and is not in any way continued on or brought up again.The AI which it very much was not, is incredibly non-intelligent. It was just made as dumb as it gets. The writers seemed to have no understanding of AI and General AI at all, nor did they seem to have any understanding on modern tech and those magical things like radio or light based communication. The damn robots had to talk to eachother to communicate... I mean really.So I give this movie a 4, I even feel that is a bit high, since the writing and story should be lower. It is compensated to some degree by the visuals, photography, FX, music score and sound effects.The acting was ok, more or less on the main characters, they seems confused which is understandable with this story writing, the antagonists are so flat from a charater perspective they are basically 2D. They seemed played by an old AI...My guess lots of the story was written by an AI helper and the humans did not read what the AI wrote, just cut and pasted it altogether.",
    "99": "Hmm. The movie looks amazing. I will give it that. The visuals and special effects are off the charts.But that's about all it has going for it.The villains are one dimensional, and their acting is very wooden and lacking any emotion whatsoever.The good guys aren't much better apart from Madeleine Yuna Voyles who manages to pull off a very emotional performance.The plot however makes zero sense and is full of so many plot holes one after the other it's hard to keep up. The reasons for the war make no sense, the way the war is waged makes no sense and the conditions each side has for victory makes no sense.Don't get me wrong. I love a good sci fi but this was incoherent rubbish.",
    "100": "Impeccable effects, incredible ambience, breathtaking visuals and a very good soundtrack. Even the main actor, of whom I read some negative reviews here, I thought he was good in the role. In other words, the film has a lot of cool, well-made and interesting things, top-notch production.Yay, it must be a great movie then! No, it's not, it's very bad.The problem is that the script is one of the worst things written in a long time, it's B-movie level, with the added bonus that it tries to be serious. The story is stupid, the dialogues are kindergarten level, the forced coincidences and fake situations are amateurish and there isn't a single scene that is resolved with any intelligence or creativity, it's a festival of sudden cuts from moment X to moment Y without any development or coherence, you just have to jump to the next scene for the stupid story to continue and that's it.I can't understand so much investment and production in a crap script like this, the world really is getting much worse in some aspects, never have so many bad films been so applauded, and the little good material that appears is called boring and left in limbo.",
    "101": "Though 'Blade Runner' undoubtedly takes the cake.Gareth Edwards is definitely in my top five favourite director category. What he's able to accomplish visually on a reasonable budget is simply amazing. It begs the question as to why the CGI is so atrocious on some of these huge blockbusters with 300 million dollar budgets.Enjoyed the story, and the acting by most of the cast was pretty decent too, though not completely without faults. I had large expectations coming into this and believed it was going to be my favourite film of the year thus far, but it's not quite there. Even though I really enjoyed the concept of the film, some of the ways things happened along the way, exposed huge plot holes that were hard to ignore. Otherwise I'd give this a 9 or 10. Everything else was great, especially the beautiful cinematography.Interesting concept, where the AI really isn't the bad guy. Still a scary thought though, because if it wanted to be, there wouldn't be much we could do to fight it.... we've all seen 'Terminator'.",
    "102": "I saw this today and was hesitating because seems like it got a bunch of negative reviews attacking it. Seems like everyone was more biased because of their dislike for AI or their cliche Terminator reference. What I saw is a story about hope and maybe one last chance of some kind of redemption. This is one of the better science fiction movies to come out in years.People were mentioning plot holes but I think it was at a decent enough pace where some folks complaining maybe weren't intelligent enough to follow along. Otherwise it's a pretty intelligent storyline about certain parts of society and it's tolerance for understanding. The relationship between soldier Joshua and Alphie was done effectively humane. Now I won't go too much into the why or what's revealed because that plays a vital part of the story, especially during the third act. Overall, I found this to be visually stunning with some of the greatest special effects in movies. John David Washington and Madeline Voyles carry the film's storyline. Both bring an effective humanity to the world they inhabit.",
    "103": "This movie was a very thin social message about the oppression of minorities wrapped around poorly thought out science fiction. I don't think I've ever seen the idea of androids handled quite so poorly. The androids in this film are basically just people, they have no apparent abilities beyond human capabilities. Even the \"police\" robots are running around like buffoons, chattering in some sort of robot speak instead of communicating instantly and silently like the machines they're supposed to be. Then someone makes one that works like some sort of universal remote that can selectively turn off \"technology\" at will. How does that work? We don't have to tell you! There was literally a scene where someone took a child out of the hands of a sleeping android, wrap your head around that one. Apparently the motion sensing camera I got on Amazon is more advanced than these sophisticated androids. They also couldn't keep the scale of their massive space station consistent, but that might be asking a little much of Hollywood.John David Washington is just a colorless actor. I don't know, maybe he hasn't found the right role or the right director, but he just comes off as wooden and flat every time I see him. He brings nothing to his characters. Allison Janey was good, but her role was a cliché. The only thing they did different was have her play the character instead of someone like Ed Harris.If you want some mindless action schlock that I'm hesitant to even call science fiction, there are worse things you can watch. 5/10.",
    "104": "Most boring sci-fi movies. No story at all.First very bad acting.Story is weak and lots of plot holes.Visual is ok.They ai or robot is very advanced. But they need a hole in the air for may be for cooling purposes.And people who hunt AI alos use ai. Lol\nThis movie is not engaging. And also very long and boring.Thought AI people are very advanced. But they are living in the hut. And very poor. They have few policies but no army.And if they are advanced AI why they need a AI android. Make no sense.May be some school kid write this script or some ones Facebook or tiktok performance may inspire them. Very dumb. Stay away.",
    "105": "This was terrible and so freaking boring! A couple in front of me actually walked out 45 mins in. I kinda wish they would have kidnapped me out of there also because anything would have been better than this cinematic torture.Someone said this was better than James Cameron's Way of the Water. Newsflash that film went on to make 2.32 billion dollars. This sci-fi turdfest played to almost empty auditoriums this opening weekend. It's a flop and deservingly so. Everything about this movie was pure cringe.The acting so terrible! Allison Janney who I adore was saddled with bad pancake makeup that made her look like a plastic surgery disaster. The direction was so flat you never felt on the edge of your seat.Emotions are muted and the dialogue was pure hacked-eye and stilted.A Poor Man's Blade Runner that will be streaming on HBO MAX or Netflix in no time.",
    "106": "Most important element of a great or even good movie is flow. Does what just happened make sense? Does that action, decision, or dialogue make sense? Would that ever happen? This is beyond suspending to believe that a technology or idea or reality could exist, it's would that happen given these extraordinary conditions? Flow is also a timeline of scenes occurring in a fluent way. That doesn't mean a story needs to be strictly linear, but it should reflect a coherent narrative.This movie is a blueprint for the opposite of that. This movie was about as coherent as a drunk Brad Pitt in Snatch.In addition to terrible directing, writing, and editing, the acting was pretty forgettable as well (except for the kid, who was one of the sole bright spots). The characters had no backstory, no motivation, no personality. The conflict between the AI and the humans had zero build up. No reason to care for anyone in the story.What happened to movies? Are we so dumbed down as a society that we accept trash movies like these to be made. Worse yet, the average review is over 7? Really?The worst part is this movie had such great potential, but the makers of this were solely focused on graphics and technology that they forgot they were making a movie and not a tech demo. I feel bad for the artists on this movie. The architecture, environment design, and overall atmosphere was really awesome. It's too bad everything else sucked!",
    "107": "The Creator is very much a \"could have been\" and a \"should have been\" Sci-Fi flick that attempts to (unsuccessfully) capitalise on the hot topic of AI; at least cinematically as the coherent motion picture epic that it sets out to be. Gareth Edwards, director of Rogue One, was on the mark here with his vision, but poor dialogue and flat world-building held things back. Despite spectacular visuals and Hans Zimmer's musical input; it's a pretty face with little to say. The film puts forward a slightly pedestrian account of potential AI-related conundrums that doesn't give it much of an edge in the current year; where everyone and their nan has heard about what AI is and its basic supposed dangers. If this was released ten years ago, it might have kept an edge in the box office.What we have here is a spread of Sci-Fi, thriller, and action, but to truly round things off best would have been to bring onboard eldritch horror elements; that's spooky, sharply delivered expositions of AI's darkest and unexpected dangers that may lurk in the near-future that pry on our nagging \"what-ifs\" regarding artificial intelligence. It did feel a bit like Skynet's less scary, less compelling sequel. With a tame dose of uncanny valley to boot.The plotline was rather glacial and generally weak, but poignant in places on the lofty subject of creator and created; think the Story of Adam and Eve, God's creation gaining free will and full sentience. Despite these biblically epic pretensions, the plot crescendoed with more of a whimper than a bang. The film best redeems itself by imagining humans as the bad guys in the AI ethics debate. We've spent a long time thinking that AI could only be a threat to us, when actually humanity might grow to dread a creation that (at some potential point) arguably should have autonomy and be regarded as sentient and equal to biological life. This is a refreshing premise that just needed more polish to really make its point, as the screenplay just didn't match up with the vision here. The ending may well have borne a sinister aspect; had AI faked neoteny, a great weakness of human empathy, to deceive humankind in a pinch? But again, even if this was the case, it was unclear what the film wanted to really get across there.6.4/10.",
    "108": "I had high hopes for Creator, a movie that promised to explore the complex relationship between humans and artificial intelligence. Unfortunately, the film falls far short of its potential, delivering a plot that is both predictable and uninspired. The AI characters are poorly developed and lack any real depth or nuance, making it difficult to care about their fate.The film's central conflict is also contrived and fails to generate any real suspense. The plot twists are telegraphed miles in advance, and the ending is unsatisfying and clichéd. Overall, Creator is a disappointing and forgettable film that wastes a promising premise.The plot of the movie was generated by a prompt to chatGPT such as: give me a plot of a movie that includes AI and will disappoint everyone.Seriously, they missed the chance of leverage the \"AI\" part. If instead of robots they had mutants, zombies, vampires, whatever.... The movie plot could still remain the same. That shows how empty is the movie.",
    "109": "The Creator. Another tale of Rogue AIs. This time they nuked LA. While the US has banned all AIs they are still welcome in New Asia where AIs, Simulants (AIs with human faces) and humans live together in harmony. The US wages war on the AIs and New Asia both by covert means and open attacks. A commando, Joehua is senr undercover in an attempt to capture Nirmata, New Asia's chief AI architect, he falls for Nirmata;s daughter Maya but remains loyal to the US. He is extracted too soon and the pregnant Maya disappears presumed dead. Five years later he is shown evidence that Maya is alive and is sent in again to destroy an ultimate weapon created by Nirmata and to recover Maya and their child. Not everything is simple though, the weapon turns out to be a Simulant child capable of physical and mental growth. Joshua now seels another path. Some interesting analogies with the Vietnam War as AIs are butchered including AI & Simulant Buddhist monks in bombing attacks and Mai Lai type massacres. An interesting examination of what it is to be Human and to be aI, differences and similarities. Some good Blade Runner influenced city scapes and concepts along with advanced weaponry, giant tanks, jet-powered Ospreys. The most impressive being Nomad, a platform which floats above the clouds, lighting up and raining death down on it;s targets. Quite a few plot twists and surprises as the narrative unfolds. A pretty good film but the influences of (rather than homages to) other films are including Terminator, BR and even Apocalypse Now are obvious, this perhaps, prevents it from being original enough to qualify as a classic. Directed by Gareth Edwards, who co-wrote the screenplay with Chris Weitz. 8.5/10.",
    "110": "Walking into the theater, my expectations were a mix of excitement and curiosity, especially given the film's intriguing take on AI.From the get-go, \"The Creator\" impressed me with its use of the $80 million budget. The cinematography was nothing short of remarkable, reminding me of the visual flair seen in \"Blade Runner\" \"Elysium\", \"I, Robot\" and \"A. I.\" The world-building was immersive, creating a believable and lived-in environment that drew me in.The performances, particularly the dynamic between Joshua and Alfie, were the highlights of the film for me. Their interactions brought depth to the story, and I found myself genuinely invested in their journey. However, as the plot progressed, I couldn't help but feel a sense of disappointment.The story, which began with promise, started to unravel. The pacing felt rushed, and the plot became increasingly predictable. I noticed glaring plot holes that were hard to overlook, and the narrative lacked the depth I had hoped for. The ambitious theme of AI's humanity, which initially seemed thought-provoking, was undermined by the film's inability to maintain coherence.While I appreciated the technical brilliance of the film, including the special effects and sound design, the script was a letdown. It was as if the movie wanted to say something profound about AI and humanity but ended up glossing over these complex themes, opting instead for a more superficial treatment.The characters, aside from Joshua, felt one-dimensional. I struggled to connect with them emotionally, this emotional disconnect was particularly evident in the portrayal of the AI characters, including Alfie, who, despite being central to the story, lacked the depth to make their plight resonate with me.While \"The Creator\" started off with great potential, it ultimately left me feeling underwhelmed. The film excelled in its visual storytelling but fell short in its narrative execution. It was a visually captivating experience, but the lack of emotional depth and narrative coherence made it a disappointing outing for me. I walked out of the theater feeling that the movie, despite its grand aspirations, missed the mark in delivering a fully engaging and thought-provoking sci-fi experience. It could have been a masterpiece, but a missed opportunity at best.",
    "111": "So I really wanted to like this film and expected it to at least have a competent storyline and a more meaty plot than this cliché, simple, and predictable story we got.First of all, I have no idea why Hollywood keeps giving lead roles to John David Washington. Does his father have dirt on these producers or what? I said it once and will say it again, John David Washington has the charisma of a potato salad. I thought he had zero charisma in Tenet, and gave him the benefit of the doubt of Nolan's bad writing being a factor in his wooden acting in that movie. But watching this, it's obvious he's not good at acting at all. The little girl's acting is ten times better than his wooden, uncharismatic, and boring acting. He might be a decent side-character actor, but please stop giving him lead roles for the love of god.Apart from the amazing visuals and the great CGI for the robots, I don't really have many positive things to say about this movie. It is definitely worth a watch for its visuals, but everything else is just meh.And I don't think my rating is unfair either, considering it had such potential to be a decent Sci-Fi movie and failed at basically everything.I will just list the annoyances and the shortcomings and the negatives of this movie because it's easier this way:Boring and uncharismatic JDW being cast as the lead for some reason.Basically the plot of Elysium but with AI, longer runtime, and more boring.Very thin plot that you wait for it to get deeper but never goes beyond \"we have to go here to destroy bad guys\".Shallow plot and shallow views on AI and humanity's opinion on AI. Never goes beyond bad guys vs good AI guys and the kid occasionally going \"We want to be free\". Never delves deeper into the concept to explore the morality and ethics of AI or show it from their perspective instead of this hollow boring shell of a character played by the uncharismatic JDW.The movie doesn't even explore its own very shallow and cliché themes and messages of \"AI want freedom\" other than showing the constant bombings and shooting between humans and robots, no time for the plot in this 2+ hour movie I guess. It's basically the equivalent of a kid mashing his action figures together.Way too long and I don't understand how they can cram as little story and plot or characterization as they can and still make the movie this long.A total waste of Ken Watanabe and Gemma Chan. This kinda reminds me of The Last Samurai exactly because of Mr. Watanabe, but also because of the similar movie perspective of this American character going to these people and wanting to save them. But I don't think I need to say which one does it better. Obviously the one that actually focuses on the natives and has more Ken Watanabe and it's not 2 hours of boring JDW.You will have basically no emotional connection to any of the characters because of the terrible characterization, apart from maybe for the child, but that's because her acting is actually good! Ken and Gemma get basically no screen time for the audience to actually care about them or get to even know them, especially Gemma Chan's character. And even the main lead doesn't get much and pretty much has the same motivations and backstory as every Nolan protagonist ever if you know what I mean, and JDW's acting doesn't help either. So you could say this movie is pretty cold and you're not gonna care much about the characters nor the story, especially at the end with that terrible and boring third act.There isn't much lore to this universe and they do basically zero explaining or world-building other than some cliché news clips in the beginning. So you're not gonna be interested much in this world and its characters, or even the AI itself, because they do zero exploration of these, even though the movie is over 2 hours. District 9 did a better job of establishing its world and actually having a theme and message with less than half an hour of this movie's runtime.Terrible ending on top of a very shallow and terribly-written movie. They don't even do a \"what happens next\" segment at the end, because guess what, they didn't even have much material for the entire plot itself, you think they have anything to say after the ending?I won't even get into the plotholes because it's a whole other can of worms and this review would be 200K words long. Plotholes don't matter much anyway in the grand scheme of things if the plot is actually competent and works, and the plotholes don't really hurt it that much.AI robots in this world smoke, eat human food and ice cream, and sleep. Movie doesn't explain any of this. How does a metal robot even process food or even taste or feel it? What effect does smoke actually have on them if they're not biological beings? Like I said, I normally try not to care much about plotholes and just enjoy a movie for what it is, but in this case, I am very much annoyed that this movie doesn't even touch on surface-level explanations of this world and how the AI robots of this universe work.The movie has zero tension and does nothing to help it either. They have these supposed \"twists\" that were cliché even 40 years ago, and I'm not sure if their intention was for them to be shocking twists or not, but they failed anyway. The presentation of these plot points is so unenthusiastic that you can see even the creators didn't care about this story or the plot or its characters and there wasn't much passion for it. So how do you expect the audience to care about any of this?This movie is basically about nothing. Nothing really works here. They try to make you care about the protagonist and his wife, but they fail. They try to make some American soldier characters the bad guys to add more tension, but they fail. They try to give the shallowest most surface-level AI statements and themes, but they fail. They try to make the movie less boring and save the pacing by showing bombs being dropped and explosions every 10 minutes, but they fail.I could go on and on about these annoyances and how terribly written the plot and storytelling are all day, but these are mostly my biggest complaints about the movie.This movie not only fails to be a decent AI movie, it fails at being a decent movie in general. One again I have to mention Person of Interest as one of the best most well-written and realistic AI stories ever, perhaps the best one. The themes and ethics that the show explores about giving AI freedom are deeper than any AI movie I've seen yet. This movie is a complete joke compared to the richness of the story and the characters of Person of Interest. And you will care about its faceless AI that's never even shown in that show and will actually have an emotional attachment and connection to it than any character in this movie.Of course, you can't really compare the characterizations of a show with multiple seasons with a mere 2-hour movie, but I have seen more movies with less than a 1:40-hour runtime that actually manage to present a well-written plot and story and character, and get its message and themes across than this movie could in 2:30 hours.Overall, this is very disappointing and boring sci-fi that's only worth watching one time for its visuals, and only when you have nothing else to watch. The movie's first two acts are hanging on by a thread and the plot completely falls apart in the third act. There is no emotional attachment to any of the characters because of the poor characterization. The movie touches the surface of what AI stories could be and is very shallow in its themes and messages. The lead's acting is not great and he has zero charisma not fit for a protagonist role.Very shallow and boring movie with an even more boring lead character. Don't go in expecting a well-written sci-fi, and you might not be as disappointed.Someone said \"The Creator is the most beautiful terribly written movie I've seen\" and I couldn't agree more.",
    "112": "I was excited to see what this Rogue One director Gareth would create based on the cool looking trailer esp with the hoopla of cgi of the 90s style - however the story and script was terrible dull 2 dimensional and overtly simplistic and confusing to the point that you shake your head wondering what did the writer/director smoke to think this story makes any logical sense of entertainment.The good is only the cgi and DP work which is fantastic.The story feels like a cheap B movie version of District 9/Avatar/Tenet/2012 with no character development in the first act and sorry to say the obvious but Denzel's son John does not have the charisma and star leading man power to carry this film plus his lover Maya is Blaise also. There is no real chemistry or character story to pull you to root for this hero quest of searching for his love interest or to save the AI.And then Gareth silly story tosses in this Yoda like cute bald headed child named Alphie (really?) that has no reason for a father/ daughter connection so it comes across as shallow and meaningless. And to top it off Alphie has these super powers but they only work sporadically and make no sense. Apparently she is too young and not ready - just like the writing of this film.Half of our friends walked out of the film after 2 hours just shaking their heads as the multiple endings was too much and you don't know who to root for anymore - and the AI robots mixed in with the Buddhist Asian priests attire becomes comical - like it's a bad rip off of.2012 with no reason why the AI robots are having a new age spiritual trip except it seemed cool while they were high writing this garbage.If you're into great cgi/Vfx you might enjoy the 2.5 hours of fantastic visuals on the screen but the story is amateurish and full of so many plot and character holes you just roll your eyes and wonder how this got green lit. $80m wasted and thankfully it was not $200m\nYet looking forward to Gareth next directing film as he has lots of talent just not as a writer unfortunatelyA 4 for the Vfx and DP.",
    "113": "The Creator is EVERYTHING we've been craving as film fans. Thought provoking, original concepts made by a true visionary with a complete mastery over his craft. Also the best handling of our current challenges with AI. It's so tastefully woven. Engrossing, thought provoking and visually arresting -I'm completely in love with this film.The Creator is truly something special - a masterful piece of incredibly original sci-fi! This film definitely has many influences from George Lucas, Ridley Scott and James Cameron but Gareth Edwards also managed give the film its own voice. It's one of the most fully realized sci-fi films I've ever seen, both thematically and in world building. We haven't had big, bold, original sci-fi like this in years! It's so refreshing and exhilarating to see a movie so original and creative deliver on its premise! What it lacks in depth of characters and story, it makes up in an incredible aesthetic. Mind-blowing visual effects, production design and cinematography.The highest praise I can give the visual effects of The Creator is that you just don't see them. The fidelity of integration between the live footage and CGI is so good you don't see it.I'm so impressed with what Edwards was able to pull off with this film (and all for ONLY $80mil). He's made an original sci-fi movie in a time where making original movies on this scale is next to impossible and the film delivers on so many levels! It's a must see spectacle; truly a jaw-dropping, remarkable cinematic experience. A soulful, nuanced, Lucas-like interrogation of human beliefs/biases and our insecurity in the face of something greater. Spectacle and heart to the highest order with a legendary 3rd act! Pure cinema!I can't stress enough how important it is for film fans to go out and see it this weekend. It's a masterful visual feast and an intimate examination of humanity. It's fresh, made by passionate artists. It's WHY we go to the movies!If you want more original action sci-fi films instead of endless uninspired remakes & sequels, I'm begging you:Go see The Creator in theaters.",
    "114": "This is going to be a huge blockbuster, hearing the usual responses from fanboys going \"Hell, yeah, that was rad!\" not knowing a single thing about what they just watched. But it will make twice its budget and then go on to be a blockbuster, selling out all the theaters on the first weekend. Then it will disappear.What is happening is that the Director and Writer(s) are doing everything necessary to bring this inconceivable story to the screen, and adding as much CG as is possible to avoid any kind of intelligent discourse. So AI has gone so far as to take over humanity in the 2060s and so there is a Third World War of sorts to take out the AI.But in reality it is a metaphor for the US in Vietnam, where we bombed villages arbitrarily in order to eliminate the Communists and so the AI now stands in for Communists, and they infiltrate the innocent villagers just the same way as it was in the Vietnam War, and so we are re-creating 'Apocalypse, Now' in this sci-fi overblown Special Effects Extravaganza. And the fanboys are gonna love it.There's little point in dwelling on the plot points, as it is pointless to recount the number of things that don't make any sense, but who cares? We get to see lots of explosions, and things seem to be slanted against the Americans, Who are attempting to bomb the Vietnamese Communists, oops, sorry, the A. I. 'Soldiers' out of existence. Then we are coerced into accepting that the fact that the projector is throwing images on the side walls (\"Screen X\") which is another exciting innovation -- and it is hammered again over and over ad nauseam, just so that we don't forget it. So we don't get even the slightest ability to use any sort of intelligence to judge the accomplishment, just watch the fact that we can now put more bullets and killing in every frame.But Mr. Gareth Edwards is of the elite circle that now has the support of the film industry to put anything in front of us, and we willingly bow to his superior will. Thank you Master, for showing us how great your so-called vision is, and please punish us with it again.",
    "115": "I love a good science fiction film as much as the next person and I'll always give the latest releases a shot. It does however feel like it's been a while since the last great original Sci-Fi film, at least on this scale. The Creator is a film I've been looking forward to for a while and I can confidently say that it met my expectations. Gareth Edwards also seems to be a director that continues to learn from his previous films and grows as a filmmaker as he goes. From breathtaking visuals to some great storytelling, here's why I more than recommend The Creator.On a futuristic Earth, artificial intelligence is at war with the human race. Joshua (John David Washington) is ex-military and for reasons I won't get into here, he makes it his mission to find the A. I.'s weapon, which ends up being a child. This film becomes a war/road trip film between these two for a while, before huge revelations occur, sending the film in a whole new direction. The Creator kept me on the edge of my seat story-wise. Many of the actual plot points are twists themselves which is why I'm staying vague. If for nothing else, care was put into the overall story.John David Washington is an actor I've been following for years now, and he's always terrific in his roles, but something really stood out for me with this performance in particular. He brought a large range of emotions, but honestly, he was nearly outshined by young actress, Madeleine Yuna Voyles. She has never been in a film before and it really does seem like she's been doing this for quite some time now. Her range and chemistry with Washington all made this film sing. The performances all around were fantastic.As mentioned earlier, Gareth Edward's Monster got my attention when he made his feature film debut, Godzilla was solid, and Rogue One: A Star Wars Story was one of the better Star Wars films in recent years. Well, he has topped himself with this one in my opinion. This is easily his finest work to me. The attention to detail here with both the story and the visuals was impeccable, but that can't be stated without mentioning the jaw-dropping work done by the visual effects team. For a film with an 80 Million Dollar budget, these effects are nearly perfect. It honestly looks better than most 200 Million Dollar films out there these days.The Creator blew me away visually, the story pulled me in, and the climax actually had me in tears. If you're a Sci-Fi fan, I can't recommend this one enough. I don't sense a lot of buzz around it, which is unfortunate, because it deserves some box office returns. I really wish more audiences would take chances on original movies they haven't heard of before. This is a great film and quite literally, my only complaint with the film (and the main reason I'm not giving the film a perfect score) is the fact that a lot of story beats feel reminiscent of many other films. Other than that, it's wonderfully made and I can't wait to watch it again. The Creator now playing in theatres.",
    "116": "The Creator is a film I was cautiously optimistic about going into it. The trailer really impressed me from a visual standpoint. However, the story and premise are something that certainly is not new to movies; humans versus A. I. Terminator, Blade Runner, I Robot, and so many other franchises have explored this concept in every vantagepoint. So, I wasn't sure this film could bring anything new to the table in that. Thankfully, whilst the movie doesn't really do much different with its concept, it makes up for it with a unique visual aesthetic, characters you can get behind, a good atmosphere, and a good heart to it.Gareth Edwards, I think, is a very talented director, especially in the visual department. I liked Rogue One: A Star Wars Story. It's the best Star Wars movie to come out of Star Wars under Disney. He also did the 2014 Godzilla movie, which I found to be a letdown when I first watched it. The film has grown on me a bit over the years, but I stand by my opinion that it definitely could have been better. But this has become my favorite film from him.The film is well cast and acted. John David Washington is an actor I'm becoming more interested in. I've always been a fan of his father, Densel Washington. I've liked John's other movies (that I've seen). I thought Tenet was okay, albeit one of Christopher Nolan's lesser movies. Amsterdam, I felt, was one of the more underrated films of 2022. But this is his new standout movie.The best thing about this movie is the visuals. The effects alone are worth seeing in the theater. The aesthetic of this film is like a combination of Blade Runner and Niell Blomkamp's visual style. The visuals here dwarf any blockbuster that has come out this year, some by a wide margin. Even Mission Impossible doesn't look as good as this. Which is crazy considering that this film had a production budget of $80 million. I almost refused to believe that when I looked it up. These days all major blockbusters of this scale have budgets in the hundreds of millions. Every other blockbuster this year falls into that category. Blockbuster films with mid-level budgets like this are pretty much dead.Original blockbuster movies are also a dying breed. In a year/decade where the vast majority of blockbusters coming out that are tied to an established franchise, it's a refresher to see the rare original blockbuster coming out. Films like these need our support the most because they are so rare, and because it seems like many big movies are getting lazier and more forgettable.So, if you're a fan of science fiction films, or just good movies, then give this one a chance. I think it's the best pure sci-fi film to come out since Blade Runner 2049. This makes me curious to see what this director will do next.",
    "117": "I want to say that this is a beautifully shot film and the acting is very good all the way.However the film suffers from a screenplay standpoint. The main character Josh is someone we are supposed to care about but the movie short changes his emotional arcs due to the way the movie has him on a conveyor belt of a routine action, chase, action, chase, forced emotional scene, action, chase.It also suffers from the fact the one character we do care about, the child, doesn't show up till 30 minutes in. All the side characters, forced images of human and robot relations don't help either.It's just so frustrating because for every good thing, neat concept, there are two things that I didn't like. I watched others in the theaters at the end of the film and they felt like I did too, empty.",
    "118": "Made on a reported budget of about $80 million, this ambitious sci-fi epic sets its sights high and more-or-less lives up to them. Putting recent blockbusters to absolute shame (*ahem* 'The Flash (2023)' *ahem*) with less than half of their budgets, the picture puts every cent up on the screen and crafts a wholly believable world filled with robots, simulants and human-on-AI wars. The decision to augment real location work with CGI rather than film everything against a greenscreen results in a movie that looks remarkably real right the way through. Its consistently convincing visual effects are interwoven into the tapestry of its tangible world, ultimately crafting a complete and cohesive aesthetic that essentially acts as the feature's best feature. That's because the narrative is far less compelling than the look and feel of the flick. Despite having some genuinely interesting ideas and themes running alongside its meat-and-potatoes plot, the picture never quite elaborates on any of its concepts enough for them to feel like anything more than fuel for the fire that is its visual style. It doesn't even really do anything with its AI elements, to the point they could be substituted with... well, anything really. Its well-worn narrative is undeniably generic and it kind of does everything you expect it to (it also drops some major reveals as if they're nothing, kind of like it actively expects you to be ahead of it), but the pseudo father-daughter dynamic that drives the narrative is as satisfying as it is generic and it keeps you engaged from beginning to end. By the time the finale comes around, you'll realise you're more invested in the central relationship than you first thought. The story is enjoyable enough for what it is and it's a good excuse for the filmmakers to treat us to some truly spectacular visuals. Ultimately, despite its narrative issues, the piece more than gets by on its atmosphere and aesthetic alone. I don't say this often, but I actually think it would benefit from being a bit longer; some of it is rather rushed, particularly as it moves into its final third, and its use of montage as compression sometimes pulls you out of proceedings. This is the sort of blockbuster we should get more of, ones that make use of a modest big budget (if you can call $80 million modest) and actually afford their filmmakers the freedom to develop something distinctly their own. It isn't great and there's definitely room for improvement, but this is a step in the right direction and it's an entertaining effort overall. This kind of approach is beneficial to the studios, too, as it means their movies don't need to make ridiculous amounts of money just to break even. Yet, I don't think we're going to see a spike in this sort of stuff. It's a shame and I'd love to be proven wrong, but I think we're going to get a dozen more films like 'The Flash (2023)' before we get another one like 'The Creator (2023)'.",
    "119": "The Creator is going to be one of those films we look back at and stand in awe of how it was made. With only an 80 million budget shot on $3k-4k cameras this movie is a visual beauty to look at. In fact I think repeated viewings will help capture most of the stunning scenery in this. John David Washington is the Lead here but make no mistake Madeleine Yuna Voyles steals every scene she is in. I see a very bright future for her and she knocks it out of the park in her Hollywood debut. The movie's premise is A. I. becomes a huge part in our everyday society, something happens and AI ends up nuking Los Angeles. Fast forward to 2065 and the USA has banned and hunted A. I. while Asia has continued to accept and produce it. John David Washington leads a team to find the Leader and ends up encountering the weapon that was created by A. I. which is in the form of a Child. The rest I won't spoil but alls I can say is buckle up. The movie is fast paced at 2 hours and 13 minutes and contrary to what multiple critics are saying the movie doesn't have a lot to talk about it really does. I wasn't expecting this film to be as deep as it was. Bring the tissues. Also for those who love action will be glad to know the action set pieces are top notch and keep you on the edge of your seat. My only con would be is that I wish it was a little longer. I hope maybe for the home release there will be a Director's Cut. The Creator gets a high 9 out of 10 stars from me.",
    "120": "The World seems divided between New Asia where people and AI live together and essentially America who have waged a war against AI since they apparently set off a nuclear bomb destroying Los Angeles. 5 years later undercover agent John David Washington loses his pregnant wife in a badly planned mission but is persuaded to go on another when proof of her being alive is produced. Whilst the Americans have the upper hand with their flying attack station, Nomad, the mission is to seek out a terrifying new weapon which has been produced by the AI. This turns out to a small child with growing powers.Whilst the plot is pretty simple and straight forward featuring a few plot holes to be honest, the film should still not be missed. It has some fine performances especially from Washington and Madeleine Yuna Voyles as the young child and delivers wonderful visuals as well as glorious and imaginative visual effects. What I wasn't prepared for though was the emotional pull this had on me. The depiction of AI as a community is brilliantly realised and the love and affection between Washington and Yuma Yoyles is really very moving.Well done then to Gareth Edwards, the director of the best Star Wars film (Rogue One) since Empire Strikes Back who has produced a touching, intelligent and visually stunning adventure and on one point, well done for making the Americans the bad guys for a change - original touch.",
    "121": "So it's the near future and the entire world has been reduced to two factions: the aggressive, atheistic, white American military and the harmoniously diverse, peaceful, spiritual and centred Asia.Evil white America wants to annihilate AI from the earth. They've cleared America of it and are now doing the same in the rest of the world. Peaceful, noble Asia, on the other hand, has integrated AI with its subsistence farming and Buddishm, and only wants to be left in peace. Asia is one with the technology and hasn't forgotten its roots. America is dependent on its own tech but ultimately scared of it. I'm 14 and this is DEEP.In the middle of the conflict we find black ex-military American man, dragged rather unwillingly into the war. Thankfully, his big failing is merely selfishness and he is otherwise perfectable on account of his non-whiteness. Joining him is the AI child who is going to guide him on his journey. Unfortunately, some evil white Americans and a multidenominational Asian faction are hot on their heels as they travel around nonspecific Asia. The white Americans want to kill him, but the diverse Asians recognise his perfectability. The movie then plays out as you'd expect.The Creator had the chance to pose/explore some deep questions about AI and its future (inevitable) integration with society, and instead chose to take a cliche swipe at Pax Americana and culture-less white people. The visuals were good - half the time it looked like someone was battling a droid army from Star Wars - but there's only so much that can distract from the utter waste of screen time that this movie was. It would have made a middling 45min Outer Limits/Twilight Zone/Black Mirror episode, but instead it was drawn out for 2 hours.",
    "122": "I really did like enjoy movie, no matter what my title states this was a movie I really liked but I felt it fell flat with character attachment and the overall arc of the main story line. It seemed to jump around a little and while I don't usually mind that style of story telling, it's something that has to be done correctly or you're forced to catchup mentally thus taking away from my attention to the actual movie. The AI characters also fell flat to me. I didn't care about them whatsoever. You can turn them off like a computer but you can't figure out how to rid yourself of them? Were their emotions real or was it just programing? In our actually lives things like Chat GPT amongst other AI software programs can also \"express\" emotion, or at least it can \"act\" like it. So me caring that they crushed up a bunch of robots in a trash compactor didn't do anything for me. Madeleine Yuna Voyels is a great little actress, she's gonna do big things. It's too bad her story wasn't a bit more in depth so we could have felt something for her. It's really a shame. The one thing I do want to touch on is the massive scale of this movie, and doing so with a minimal budget. The CGI and effects were top notch. Makes you wonder about all these bloated marvel movies with garbage CGI.",
    "123": "I'm a writer, so I like films to be well written, especially in science fiction, which is supposed to make you think.But Hollywood has an even bigger rule, The Rule of Cool. It means that plot holes don't matter if what happens is cool enough. For example, The Force in Star Wars doesn't make any sense but we don't care.The Creator is like that. I spent much of this film wondering why characters were making certain choices and what their goals were. The film is long and doesn't have enough mileposts to help the viewer understand it.But it's really cool. The visuals are next level. Remember when you saw The Matrix and thought, Wow, what are they going to do next? This is it.So, don't worry and just go see it. You have my blessing as someone who hates iffy writing.",
    "124": "Brief Spoiler Free Review!The Creator has been one of my most anticipated movies of the year and i have to say, for the most part, it didn't disappoint.Gareth Edwards' big action set pieces, cinematography and visuals are incredible and given the budget of this movie, it's leaps and bounds ahead of the competition. John David Washington proves to be a solid lead yet again, showing his range remarkably well in this movie.The AI aspect is handled quite well however i think the script it's the weakest part of this movie. You will notice some themes and storylines here have a certain familiarity to them, much like most films nowadays. Some tweaks here and there could have improved this greatly but the character development was sound.That being said, for me the positives far outweigh the negatives in this movie. It is not quite the sci-fi epic I expected but I enjoyed it nonetheless. Definitely worth a watch on the big screen!Overall 8/10.",
    "125": "Right, well I was really disappointed with this. It's like a precursor to the \"Terminator\" films with \"Joshua\" (John David Washington) charged with tracking down and destroying a super-weapon being devised by the AI that mankind developed to keep it safe, but that turned the tables on us all and now robots are ruling the Earth. Sound familiar? Well, the whole thing is pretty derivative with only a few, fleeting, scenes from Gemma Chan and a frankly implausible effort from the usually reliable Allison Janney sporting a militaristic haircut as \"Col. Howell\" - the soldier charged with managing our hero on his trek to eliminate whom we quickly learn is \"Alphie\" (Madeleine Yuna Voyles) who has a whopping great hole between it's ears. It's just all been seen and done before and though this does introduce a degree of humanity and sentiment as the story progresses, it is all just a bit, well - been there, seen that and got Will Smith to sign my T-shirt. To be fair, it does move along well enough with plenty of pyrotechnics, explosions and lasers but the story is thin and predictable and the denouement could have been on the drawing board after about ten minutes. Bet it cost a fortune, but it's all just a bit forgettably lacking.",
    "126": "I feel like there's so much deliberate ignorance of how technology works to cover a poorly conceived plot.Robots with the slower reaction times than humans, similar strength, seemingly unable to communicate wirelessly - or at least that seeming like not a thing up until the point that the army can use remote hackers.There is so much stupid that it is hard to just ignore. The graphics are great but that is not enough. Your story has to be plausible.Robots that miss there shots like storm troopers! Running sentient bombs for some reason - as if a rocket launcher wouldn't do a better job.The main motivation for the sergeant character is that one of her sons was tortured to death by a surgeon robot and its friends, which completely contradicts how humane the robots are meant to be.Even the premise of a nuclear explosion being the fault of AI without any clear motivation? Why would the blow up one city that contains both AIs and humans? None of the motivations are plausible.They decide to bring in the cavalry at an arbitrary time. Again they decide to blow up half of asia right at the point that they can be stopped.",
    "127": "This has been the summer of Oppenheimer, Barbie, Mission Impossible, Indiana Jones... and I hadn't heard a lot about The Creator in the build up to going to see it tbh. In the end it was purely an impulse decision. Sci-Fi? Nice. Trailer? Looks good. Shall we? Yup.Great decision.I've seen other reviewers knock the film for minor plot holes... it's a valid criticism, but they didn't spoil the film for me. It's a big, brave entertaining sci-fi story told in two hours - there are always likely to be gaps in logic that you just have to turn a blind eye to and choose to be entertained. They are minor. The alternative is often to make a watertight plot that is just a little too complicated to be fun.Washington, Chan, Watanabe, Janney and the unbelievable youngster, Voyles all put in great performances. The storyline is cracking. Plausible enough to be chillingly compelling, but imaginative enough to feel creative and to give a solid platform to a visually superbly well made film.Big props to the cinematography, the score, the skill of creating a future built on the present.",
    "128": "Once in a while there's a movie that completely sucks you into another reality. This is one of them. I don't know how they've done what Marvel/DC tries to do in terms of special effects with such budget, but this must be the prettiest/coolest cgi possible in these times. Felt like the magic of seeing Blade Runner, Jurassic Park or District 9 for the first time!The story itself is entertaining enough and has good pacing, the action sequences are truly amazing. I liked the chemistry between the main characters, the girl was eventually a very touching character whom you start to care for. A special mention to the soundtrack which complements the whole, afterwards I read it was by Hans Zimmer so that explains everything. Can't go wrong there.This movie sets new standards for all sci-fi to come in terms of effects and effective storytelling. This will be a classic and is my favorite sci-fi of 2023.",
    "129": "This film has plenty of controversy surrounding the reviews my advice is to give the film a chance if you enjoy sci-fi movies with stunning visuals and a fantastic soundtrack then the creator is one to add to the listI think the reasons I enjoyed the creator were simple the reviews were mostly negative with few people saying it's ok, good or just average so i didn't have many expectations going it but throughout the movie I was pleasantly surprised, don't get me wrong the story has its faults but I don't think In anyway it was boring or uninspiredMy advice is go and see this movie and form an opinion of your own I have been let down by majority reviews before and I think this is a movie worth seeing in the cinema.My favourite part of the creator has to be the soundtrack it playing in a silent cinema really had you moved combined with the immaculate visuals I'd say this is a great 8/10Thank you for taking the time to read my review 👍",
    "130": "I was very excited for this movie but then the moment I watched the film i was highly disappointed in the film. I really wanted to enjoy the film but ended up bored like 50 minutes in.The good: The Visual Effects were pretty good. The score was great.The Bad: the story was very cheesy and felt like a straight to dvd movie that you would see at Walmart for $12. The pacing was so slow. It was so slow it made Oppenheimer feel so much shorter. There were too many plot holes in the film.I had no emotions for this movie at all. It was a very boring movie and by 90 minutes i really wanted to walk out of the theater it was that BAD.As someone who loves watching sci-fi movies, this one sucked.4/10.",
    "131": "The director responsible for Rogue One of the Star Wars saga takes a new big step with The Creator. This science fiction film whose only weakness is having somewhat questionable writing, but which offers an epic emotional story in a post-apocalyptic future where a rivalry between humans and artificial intelligence lies, giving rise to a war between North America and Asia. . It is a story that is sustained by its plot full of dramatic and emotional moments. At first it feels somewhat generic and artificial, but it improves a lot as it progresses. The special effects and action scenes are good enough to still keep your attention on the screen. The conflict between humans and robots generates a certain interest in how artificial intelligence manages to be the closest to a real human being due to the feelings it develops, while real humans seem to become more and more dehumanized, ignoring that they have managed to create beings that can possess feelings and a soul. The film feels like something taken from the literature of Isaac Asimov or other science fiction authors, but the concept is clearly inspired by anime. Aside from being post-apocalyptic, it does feel like a cyberpunk movie at times. It really feels like it has an air reminiscent of works of Japanese animation such as Astroboy, Metropolis, Akira and Neon Genesis Evangelion. Hans Zimmer's soundtrack also manages to generate that air and the way the film concludes is truly emotional, making it worth all the time invested. The Creator is a commercial film that under its skin has what is perhaps one of the best science fiction stories ever made. My final rating for this movie is a 9/10.",
    "132": "As a fan of Sci-Fi, it is difficult for me to hate a movie about AI and the ethical issues associated with a sentient machine. This movie uses a tried and true formula used by movies like Dances with Wolves, Avatar and many others, putting the protagonist in the place of the unknown civilization.So, good premise, known formula, what could go wrong? A lot, actually.The Creator never pays attention to the most fundamental part of good sci-fi: make it believable. These AI beings are completely ridiculous in the most fundamental ways. Intelligent machines with humanoid form, without any of the advantages of a machine, and all the disadvantages of humans. Many taking the form of old, feeble men, and lack the intelligence of even basic LLMs of today. Why? It is never explained.The characters act in counterproductive stupid ways, completely against their own interest. Just as an example of the idiocy in this movie: enemies arrive on a shuttle to a trillion dollar military facility, and are welcome with an extended bridge, and then the place is completely evacuated to be attacked without countermeasures.I hated this movie. And the forced emotional scenes with the violin music feel so unearned and manipulative, that had in me the exact opposite effect.I am so glad that I waited for streaming, because at the theater I would have left mid film.",
    "133": "There are so many problems with the imagination that devised this story it would take years to properly quantify!It's all so cliched, yet redundant- fantasies built of false assumptions and naive conceits about cybernetics and 'artificial intelligence' capabilities & construction.Instead of any valid concerns about ubiquitous technocracy & mechanisation we just get the same old fictional tropes.Massive hypocrites are never addressed or confronted- what really constitutes a machine & how can it be differentiated from a living being- how does consciousness influence all of this - can mimicry/acting constitute genuine awareness & 'personality' ?Here the USA are (at war with) anti-simulants/cyborgs, yet they totally rely on cybernetic systems, simulations and AI technology..... the Ghost in the Machine is never seriously considered...\nthis is just more time wasting fodder for addicts of 'spectacles' without substance, and there's nothing wrong with that (well, nothing unusual with it!) - however the story is so bad, manipulative and tediously boring that I don't even recommend it as a 'decent' waste of time.Why would cyborgs wish to be like humans when they are fundamentally so different from them? The idea is a daft human conceit though endlessly hyped by the media ,and scientists desperate to get funding The reason is primarily propelled for types of slavery- ie manual hard work, sex, processing problem solving/ communication interfaces or other types of interfaces for entertainment. The optimum shape of the most capable cyborgs/robots would be more like an octopus or spider, with the legs of a kangaroo & wings like bees & beatles.The irony in real life is that technologically reliant people are becoming like damaged machines with limited functions , while the best efforts at making robots like people results in a soulless mimicry of damaged people.Here the fanciful but stereotypical designs have robots built in humanoid form, with a face slapped on them, but no covering for the rest of the skull (an image directly taken from a panther sci-fi collection from the 1970s (edited, or by Barry Malzberg if I remember correctly). Why bother ? Its all style & no practical function except maybe to induce false empathy & acting facades to fool gullible humans ?The director certainly has a lot of potential and visual skill (in fields other than writing good stories), I hope he finds a better story to expend his energy & talent on next time, and hopefully spare his audience such a turgid tale as this one is- it adds nothing to anything that has gone before.AI, SCANNERS, TERMINATOR(s), BLADE RUNNER, WHO? 2001, DEMON SEED, CHANGES children's TV series) Dr. Who & STAR TREK ENTERPRISE & VOYAGER all dealt far better with humanities encroachment & enchantment by technology, and the question of what constitutes conscious life - this film is a poor addition to the great ideas speculative (sci-fi) fiction has produced about this important topic.There are plenty of great science fiction tales written in the 1950's to 1980's that haven't been plundered yet, maybe it would be worth these modern directors time to read some of them i?",
    "134": "Movie starts by showing that the writers have not the faintest idea what AI is, and that they think the audience knows even less than them. They seem to have heard the word \"AI\" somewhere on the News and think it's some kind of optional, isolated computer program that can make somewhat autistic robot servants. Then they seem to have tried to regurgitate a bland plot with an AI theme and told management that the movie will need excellent CGI to work. Well, I don't care about excellent CGI, because it's as abundant as plastic in the oceans. No plot reveal here, just what is in the trailers anyways: So basically the writers defined a good side (no AI) and a bad side (have AI), and then the plot starts with the Good hunting the Bad (to prevent the extinction of the Good, so the writers think it's all well and justified), and throw in a love story and a baby. Wow. Running out of ideas much? Now how does such a plot even work, without the audience lobotomised? The Good 1. Banned AI and 2. Are 10 years behind tech development. How can they even get smartphones to work without AI, less so an endless-suspended air war-ship into the air (without AI) and humans go shooting AI bots ... who by definition have advanced aim-bots and synchronised flock attacks. It's like trying to play Far Cry in real life, and all bots have perfect aim, no latency and every bot knows everything about everyone and everything. It's all completely ludicrous. On top of that there's the badly written dialogs with a lot of swearing. To be honest, I would rather watch a 133 minute Youtube video of someone combing the desert, than this swear fest with CGI. I think it will take a bit more than the downfall of Disney+ until we will get good action movies again.",
    "135": "Truly original stories are hard to find, but as film critic Roger Ebert like to say ...\"it's not what the movie is about, it's how is about it.\"\nIn the last few years it's difficult to find truly\noriginal Sci-Fi movies which are not part of a franchise, Marvel or DC universe, or being a remake of something that worked in the past.With 'THE CREATOR' writer director Gareth Edwards (Godzilla (2014) , Star Wars: Rogue One (2016), uses an inspiration from past movies to craft surprisingly compelling and emotionally deep Sci-Fi spectacle.On a budget of 80 mil Gareth is able to utilize production value, which on screen looks 3 times\nmore expensive with incorporation of fantastic looking CGi, as well as practical fx, which make this somewhat arthouse story visually pop.Coming from VFX background the way he utilize CGi here is truly remarkable. 'The Creator' was shot on the Sony FX3, an entry-level full-frame cinema camera and used Kowa Cine Prominar and Atlas Mercury Lenses, which gives that little bit dirty unpolished look to the frame totally fitting the subject of the story.As the plot unfolds the chapter structure brigs to mind clear indication of inspiration from other films like 'District 9', 'Platoon', 'Apocalypse Now, and 'BladeRunner' to just to name a few and yet the execution of how Gareth incorporated the familiar story points, sets this film apart as one of the best Sci-Fi movies of the last few years.In terms of performances the true revelation is 9 years old Madeleine Yuna Voyles as Alphie ,which delivers her first ever acting performance and possibly might receive Oscar nomination for her emotional depiction of the AI weapon. She has that natural gift that can't be thought, stealing every scene she is in.Must be said I am not a huge fan of John David Washington and as the film begins some of his choices are not well executed (specially the first scene of attack, which he is being revealed as a undercover agent) feel forced and not subtle, although as the film progresses he gets better. Other supporting cast including Gemma Chan the love interest and charismatic rebel leader, fantastically casted Allison Janney as a villain and Ken Watanabe as a wise android sworn to protect the Ai messiah deliver deep and colorful characterizations.'THE CREATOR' although packed with visual FX feels more like a character driven arthouse film than bombastic visual experience and so audiences, which look for less intellectual, easily consumed visual extravaganza approach might drift away from time to time.Could we call 'The CREATOR' a masterpiece?There is so much quality here that I've seen it twice already. I myself wouldn't call it a masterpiece but then again this film might be one of the best Sci -Fi movies of the last few years.",
    "136": "A solid take on the AI and humanity problems we may come to face, delving into interesting themes even if it doesn't go as deep as I would like, still it brings great cinematography and a soundtrack that matches the ascetic and atmosphere perfectly.In certain aspects the story feels rushed and in a hurry to get to the next \"set piece\" of the story. It doesn't delve deep into the ethical problems of developing AI, but instead lingeres around on the surface, ultimately appealing to a more mainstream audience. As the action set pieces and costume design is where the story shines its brightest. The characters are pretty one note, and while you care for them, they evolve in a predictable way, but it's intriguing to follow them on their journey either way. At times the writing becomes contradictory as the writers can't figure out in what genre they're writing.In the end it was a great and certainly beautiful watch that left an impact after the credits rolled, even if it doesn't expand or develop the genre as a whole.",
    "137": "In 2055, a nuclear warhead is blown-up in Los Angeles and humans blame an AI for the explosion. As the result, most of the nations declare war on AI to save the human race. However, people from the New Asia continue to live with AI. Fifteen years later, the US military has developed the ultimate weapon called NOMAD to destroy the AI in New Asia that resist. Sergeant Joshua Taylor (John David Washington) is sent undercover to New Asia to find where the creator of the AI named Nirmata is hidden and he falls in love with the New Asian Maya (Gemma Chan) and they get married. Maya becomes his wife and is pregnant, when the US military team launches and attack where Josha is, exposing his cover. Maya flees with her AI family in boats, but the NOMAD explodes the ships. Five years later, Joshua is summoned by General Andrews (Ralph Ineson) and Colonel Howell (Allison Janney) to return to New Asia to destroy a new weapon called Alpha O and developed by Nirmata that may be capable to destroy NOMAD, but Joshua shows no interest. They show a video of Maya alive to convince Joshua to join the team that will be moved to destroy the weapon. He succeeds enter in the hidden compound and find a simulant that has the appearance of a girl and gives the name Alphie (Madeleine Yuna Voyles). Instead of delivering to Howell, he flees with Alphie to meet his friend and former commander Drew (Sturgill Simpson) to find what Alphie is and the whereabouts of Maya. But he is hunted down by the police and by Colonel Howell.\"The Creator\" is the most original Sci-Fi recently released by the industry. The plot has a different view of the artificial intelligence (AI), showing them as pacific machines that would like to coexist with humans; on the other hand, American government is evil and manipulative. The opposite of Terminator franchise that give a warn against the AI> Even the destruction of Los Angeles, as explained by Harun, performed by Ken Watanabe, was caused by a human coding error that the U. S. government blamed on AI. The special effects, cinematography and direction is top-notch, and deserved a better screenplay. The beginning is too abrupt and only explained in flashbacks, and the viewer begins to watch the movie without understanding the situation of Joshua and Maya. My vote is seven.Title (Brazil): \"Resistência\" (\"Resistance\")",
    "138": "Director Gareth Edwards will be a hailed a film-making prodigy one day for this incredibly beautiful piece of science fiction. It is unfortunate that his film is not taking in the praise, or the money, that it deserves just yet.Reports indicate that Edwards has approached this film in a rather revolutionary way. It is a sci-fi epic, made on a budget of only $80 million, thanks solely to his artistic decisions. And you would never have believed it. Put this next to \"Avatar\", and you would believe it was made on the same budget.The visuals in \"The Creator\" are absolutely stunning, and demand to be seen on a big screen. I was the only one in attendance and the daytime showing I went to, but it was the greatest visual experience, next to \"The Batman\", that I've had in the cinema since the end of the pandemic.Set around the 2060s, we watch a newsreel as it explains the rise of artificial intelligence during the 21st century, and how it eventually took over as humans became reliant upon it. A nuclear explosion, blamed on the AI, wiped out Los Angeles, which prompted the USA to go to war against the technology. They hunted the last of it to New Asia. John David Washington is tasked with hunting down and destroying a new 'super weapon', but when he discovers it, he finds that it will not be so simple.I can't recommend \"The Creator\" enough to everyone. Particularly science fiction fans. Essential viewing, and one of the best films of 2023.",
    "139": "Even though this was one of the big events of Fantastic Fest 2023 I decided to skip it. It just didn't look like an enjoyable film to me. Turns out my instincts were spot on. This was the worst film I have seen so far in 2023. I almost never give out a 2/10 for a film but 'The Creator' left me no other choice.I have never in my life found it so hard to care about anything in a movie. The film gives no reason for the audience to care about anything. I didn't even know why we were supposed to be on the side we were apparently supposed to be rooting for. Every character seemed equally unremarkable to me.Then, as if the script wasn't boring enough, we have the dullest actor working today John David Washington in the lead role. He just mumbles his lines and never changes his facial expression. There could not have been a worse casting choice for this film.This film didn't work on any level for me. I think they thought if the film looked good then they could get away with having absolutely nothing going on in the story (similar to 'Avatar'). This was a disaster. 2/10.",
    "140": "I love sci-fi movies. I love AI movies. And the premise seemed promising. Instead, it is a childish movie, for pre-teens who enjoy stuff like transformers.Very poorly developed, and a million strange things that distracts you from the plot.In the future there are fortresses that can float, boats that can hover above water, futuristic guns, but the cars are from the 80s, all the music is from the 70s and the tv shows are black and white. The TVs are retro, small, rounded, with huge bezels.If there are robots that can look perfectly alike a human, perfect face, perfect expressions, will it be so hard to have a perfect back of the head instead of a huge hole?Is it necessary for robots to eat, drink, wear clothes, cry, sit casually with one foot on the couch and one elbow on the back like a tired human being?Some robots speak perfectly, but some robots speak with the worst robotic voice, or don't speak at all and just grunt with weird sound effects like a transformer or the R2D2.Devices that listen to speech and translate to another language, already exist. And are tiny. I bet in the future there will be the size of a pen. But no. It has to be a huge device with a huge microphone on top of it like a movie from 1990 would suggest.And is it necessary for a million sound effects when anything happens? Someone touches a screen? Sound effect. A robot moves his head? Sound effect. A car goes into drive? Sound effect. Someone types in a keyboard? Sound effect. Someone is looking through binoculars? Electronic sounds for no reason. Someone inserts a usb stick in the drive? Electronic sounds again. An rpg flying? Electronic sound effects of course. Beeps everywhere and for no reason at all. It was cool 50 years ago but not today.Jets with no blades that sound like a helicopter, and a secret switch hidden in a ton of statues, that the main character figures out in a second without even trying. Of course you had to turn the statue on the right clockwise, it was super obvious.And when someone is shot, looks at the hole in his body, and then collapses, is also from a movie from 1970. (someone is obsessed with the 70s maybe?)I love sci-fi movies because usually I am impressed with the plot and the clever way they make me stick to the screen. This movie had zero plot only sound effects and explosions.",
    "141": "IN A NUTSHELL:\nThe sci-fi story is about a war between humans and robots in the future. A former soldier finds a secret weapon: a robot in the former of a young child. The question is whether the robot-child was created to save or destroy humanity.The film was written, directed, and produced by Gareth Edwards, along with his team. He was determined to not use green screen but to film on location with smaller cameras and incorporate the sci-fi elements later.THINGS I LIKED:\nThe topic of Artificial Intelligence is certainly timely.I adore John David Washington in everything he does. He comes from Hollywood greatness; his father is Academy Award winner Denzel Washington. Director Gareth Edwards was so impressed with his performance in Monsters and Men that he wrote the character just for him!I also love Allison Janney in everything she does!The rest of the cast does a great job and includes Gemma Chan, Ken Watanabe, Sturgill Simpson, and the young Madeleine Yuna Voyles.The film has title cards for various sections of the story.Most of the special effects are really cool and impressive. I love that there are different kinds of robots represented.A monkey with a remote detonator. Ha ha\nImpressive set pieces.This is the kind of movie that really needs to be seen on the biggest screen possible.A lot of the movie was filmed in beautiful Thailand. That location is on my Bucket List!THINGS I DIDN'T LIKE:\nMANY of the scenes are visually dark, which will make seeing what's happening difficult if you plan to stream this on a small device.Honestly, I was a little bored.Many times, massive explosions go off, yet certain people are fine.More humor would have been welcome. The film is extremely dramatic and serious.TIPS FOR PARENTS:\nWe see a pregnant woman's belly.Talk of a nuclear bomb killing millions of people.Some profanity\nSome languages are spoken without subtitles.A lot of people die.Explosions and destruction.A large variety of weapons are utilized.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "142": "The movie visual were spectacular. It felt like \"Dune\" and \"Blade Runner\", but better, so it was very nice to stare at this potential future for humanity.The story was solid, coherent, nice pace, and easy to follow. Nothing we have not seen before. However, the first half of the movie suffers from plot-holes that made me pull out from the immersion and say, \"What? That's was stupid\", or, \"That does not make sense\". On top of unlikable main character that keep me wanting to punch him in the face. The 2nd half of the movie was excellent: the story started to make much sense, the characters suddenly were better written, and I started sympathize more towards them, especially at the very end.There is no big questions or philosophical questions as I would have expected for this type plot, so I think it was wasted opportunity.Soundtrack was excellent as it was made by Hans Zimmer. Overall, it is solid scifi film. I movie I wouldn't mind re-watching sometime in the future.",
    "143": "\"The Creator\" is one of those movies which was not done so well in execution. Effects and such aside, the plot had a lot of unanswered questions which I have read from the reviews that they all agree on at least that one fact. The end was kind of disappointing, the middle was kind of boring and the start had potential but ultimately failed to catch my full interest. There's so many ways this could have gone but it went with... Meh?I have to be honest here. In terms of mainstream AI vs humans aspect, it doesn't even come close to I Robot, War of the Worlds, Blade Runner, Terminator and Avatar. Compared to those movies, this was an absolute abomination. But critique aside, props to Gareth Edwards, he tried something here, and even though it wasn't the best thing in the world, I respect the effort. John David Washington did an OK job as our MC but the best actor in this movie by far goes to Madeleine Yuna Voyles in the role of \"Alphie\". The kid can act. But in conclusion, this was very disappointing and the fact it's got 7.0 rating on here (as of time of writing this), blows my mind.",
    "144": "Watched this as a last resort Saturday night given the poor cinematic menu.I had been put off both by my disdain for Mr Washingtons ability in his craft and by the negative reviews interwoven among more positive reviews.I have to say it was a great watch. Sci Fi good vs evil with a human relationship vs belief system woven in.You get great action. You get great visuals. You get a credible storyline you will care about and have your thoughts challenged.It felt like a mix of District 9 and Avatar.Plot holes? Yes of course there are but what movies do not have them? Strangely the plot holes here are really gone after in many reviews whereas they seem happily ignored in reviews of most movies...Marvel Universe...Bond Franchise...Avatar itself.. etc etc.Maybe the part about the \"bad\" being specifically the US military stuck in some heads when reviewing?Relax. Go with it. Enjoy yourself. Great Saturday night popcorn stuff here.",
    "145": "No pun intended - depending on how you view the movie and how able you are to suspend your disbelief! There are things here that may make you scratch your head! Like how easy it is to walk into high security areas - also how easy many other things are, when they are convenient.You really have to let the .. let's call them flaws in storytelling, you have to let them go! You can not keep focusing on those things otherwise you will not be entertained by the movie. The similarities to Star Wars (Death Star - so many things that are ... well the \"same\", even if maybe not optical/visual wise) are there ... and the director did do Rogue One ... so it was not too surprising to have a vibe or feeling of Star Wars in this.Also the trailer was a bit of a giveaway anyway. Now having a kid being the main focus ... that is quite twisty - though not the one \"twist\" most viewers will have figured out way before any of the characters I reckon. No it is about how we see kids and not being able to see anything evil in them. Well unless they star in horror movies I reckon.The movie is also able to make social commentary - maybe way too blatant for your taste (you can substitute the AI/robots with any race or nationality that is being hunted or discriminated against) ... also a nice touch with the New Asia coalition. Not naming one country and not laying blame on them - quite the opposite I'd say. Also great to see Alison Janney - she really goes for it. Maybe a bit too many \"surprise\" explosions, but visually stunning - and great score too. We are used to that by Gareth - who also seems to have insisted on real locations (against green screens) ... maybe that is why it feels epic? Still has a lot of CGI of course ... entertaining, yet more than predictable ... your mood and your willingness to let go of things will determine how you feel about the movie.",
    "146": "Where to begin? Well, I guess with the obvious - I cannot recommend this movie highly enough with the small caveat that it would have been nice to see a bit more about the AI and the AI supporters from the 'human contingent' rather than mostly seeing the AI themselves and the simulants. Otherwise, this is an absolutely brilliant movie. Even from the little I knew going in, I knew I was going to enjoy it, but I didn't expect it to hit as hard emotionally as it did...It's very well written, the cast are fantastic (especially Madeline Yuna Voyles who is INCREDIBLE in her role), the visuals are spectacular, and the score is as great as we've come to expect from Hans Zimmer.As far as the story itself, while the basic skeleton is nothing new (man vs self-aware machine, America/The West Bad vs Asia/The East Good) the meat on those bones is really well formed, and it had me engaged almost from the opening moments, and again I cannot recommend the movie highly enough. Just bring tissues. Or, if you don't have a heart or soul, borrow someone else's for the duration.Oh, and for all you clowns whining about movies having politics forced into them? Maybe stop for a moment and think about it. Science Fiction by its nature has ALWAYS been political in one way or another. It's often the most effective way of getting people to look at themselves from the outside and re-evaluating what they think they are.Oh, and one last thing. I friggin' LOVE Alison Janney, and her performance here does nothing to hamper that. She's just that damn good.",
    "147": "THE CREATOR (2023) Director Gareth Edwards (ROGUE ONE, MONSTERS) says that if he had known in 2018 (when he conceived this story) what he knows now about how exponentially A. I. tech would advance in those five short years, he wouldn't have set THE CREATOR so far off in the future - 2055 and beyond. Co-Writing with Chris Weitz (GOLDEN COMPASS, ABOUT A BOY) the screenplay proposes a world where the West has banned A. I., while the East (a fictional country dubbed New Asia) embraces it. This means war.An American soldier, Joshua (John David Washington), falls for an Asian scientist, Maya (Gemma Chan). The couple are separated on the battlefield. Years later, Joshua is part of a military attack on New Asia for the expressed purpose of finding and destroying the chief A. I. engineer - The Creator. Zeroing in on The Creator, Joshua stumbles across the newest, most advanced model of New Asian robotics - Alphie (Madeleine Yuna Voyles) who takes the form of a young girl.THE CREATOR is quite clearly patterned after the Viet Nam war (Edwards has copped to it) and there are allusions to carpet bombing and farmer 'terrorists'. The first act is needlessly bogged down in these battle analogies. Fortunately, once Joshua and Alphie join forces, the personal element has a chance to breathe and gain traction. It's this middle section that is the most interesting. Edwards' affection for the work of James Cameron is clear, and one could propose that the movie takes place in a time zone between BLADE RUNNER 2049 and the opening Future War sequence in THE TERMINATOR.THE CREATOR is impressively mounted for a modestly budgeted production considering its scale. Grieg Fraser and Oren Soffer collaborated on the digital photography and create some grand images. The CGI and Hans Zimmer's score as similarly spectacular. Allison Janney and Ken Watanable are fine in support and Voyles is very touching as the robot. Like his role in TENET, Washington isn't able to carry the weight of being the 'protagonist' in such a massive endeavor, even if he has an occasional moment or two. Edwards and Weitz err in having the emotional climax of the picture take place a full half hour before the finale (you guessed it - more battles!), which makes it feel all the more drawn out. The plot doesn't truly add up if one things about the details and consequences.THE CREATOR is an ambitious look at the next stages in Artificial Intelligence, flawed, but worth a look if only for the visuals and the periodic interesting idea that breaks through the clamor.",
    "148": "Taking on this type of film normally requires 200 plus million and normally falls into all the pitfalls of super budget films trying to appease everyone. I'll admit is does have some short comings but unless something is truly awful I can easily not focus on them and focus is what I had watching this film. It done well at not exploring abuse or hate towards robots (talking about you chappie) but instead subtly portrayed ai as humans and good for humanity.Also refreshing from an American film to portray the USA as what most of the world clearly sees it as.Is it the best film I've ever seen? No. Does it have the best CGI I've ever seen? No. Is it the best AI film I've ever seen? Probably. And that's good enough for me. 80 million budget kudos to the CGI team, production, actors, writers and everyone else involved. Y'all should be very proud of doing this genre justice.",
    "149": "The Creator (2023)This was one of my most anticipated movies this year. Gareth Edwards, I think is one of the most talented directors out there and I was very excited to see what he could bring to a Sci-fi like this one. I was glad to see him receive a big project where the great Hans Zimmer was composing the score.This was a pretty good movie. It was imperfectly satisfying. It was a bit shallow and a bit messy, but it still succeeded in its job.Given the progress of AI right now, this was more or less the perfect time to release a story like this, involving a very grim war between the humans and the AI. I was very surprised by how grim this movie was. Although it does struggle in portraying that grim tone at times.This movie is visually stunning, directed beautifully and it has a great soundtrack, as you'd expect from a combination of Gareth Edwards and Hans Zimmer.But it's imperfect in terms of its characters, storytelling and tone. First of all I thought they should have explored how the conflict between the humans and the AI arose. Yeah, they do mention the brief reasons how, but it's just not enough for me to buy the hatred and the rage of humans against the AI. In the first half of the film, it sends mixed signals about which side is right and which is wrong. That goes away in the second half though, when the movie forms a definite opinion on this war. The characters too aren't really well explored and we're just sort of supposed to accept their motivations and actions.That being said, I mentioned this movie was imperfectly SATISFYING. Because this movie is definitely satisfying. The second half of this film holds a tremendous amount of emotional weight with a very moving and well executed finale that made my eyes water. When the movie was over and the lights turned on, I saw that the person next to me was crying. That tells you about how the finale of the movie is. It was frankly very refreshing too because that's why an audience should go to the movie, to experience it.I had a good time with this one. It might not be the great movie that I was expecting it to be, but it was still surprising, and worth seeing on the big screen."
}