{
    "0": "With so many people upset with the fact that they enjoyed the original and have been watching it on TV their whole lives, this remake should never have been made. Remember that the beloved one is also a remake. I agree that the former was superior, but like other holiday movies, isn't it fun that we try to update and try things differently? Think about something like \"A Christmas Carol\" which has had numerous incarnations. For me the Alistair Sim version still rests on top, but does that mean we shouldn't have Albert Finney's version or, especially, that of George C. Scott (quite well done). I know that actors and directors interpret things differently. We are in a different world now, and personalities are going to be different. There are still the trials and the usual naysayers and the tools of the government presented in their utter humorlessness. It isn't perfect but it's still worth watching. Also, I enjoyed watching Mara Wilson as the little girl.",
    "1": "The late Lord Richard Attenborough looked like he enjoyed himself in the role of Santa Claus aka Kris Kringle in this delightful updated remake. With a solid supporting cast, the film included a believable love story between Elizabeth Perkins and Dylan McDermott. Mara Wilson was wonderful as the child. There are other notable performances like Robert Prosky, Allison Janney, Mary McCormack in her first film role, J.T. Walsh and others. The film was shot on location in New York City. Instead of Macy's there is a Cole's Department store and a rival with Jane Leeves. The film has a charm all its own.",
    "2": "A pretty darn awesome remake. It may bring some extra 90's cheese, mostly due to the needlessly dramatic music, and it may be overlong in places, but this certainly works. Attenborough is the only person I could imagine taking over this role. He comes across as a genuinely kind and considerate man, with nothing but kindness in his heart. Like the original, it keeps silent as to whether he is Santa or not. The court scene is particularly funny, with a few fist pumping moments. I'd still pick the original, but if you can't sit your whole family down in front of a black and white film, this certainly doesn't offend the original.",
    "3": "I watch it every year. I've read negative reviews of Mara Wilson's performance but I think she is charming and smart but not at all obnoxious or know-it-all as others have said. She is acting over maturely as she was raised by her no-nonsense and jaded mother. Her subtle winks and expressions are very apropos to her role and she interacts very well with Mr. Kringle. (Perhaps I like her because she looks like my daughter when she was little.) Regardless, I love the way this story is told and Mara makes it for me. Even though logically she was taught that Santa was not real, as a little girl she was still willing to believe. Take a little joy in believing! I hope you enjoy :)",
    "4": "I can't see why a retelling of a really good story gets panned. It stayed true to the original concept, that believing in something good, even if it only comes once a year, can make us better. If I may reference another Christmas classic of which there have been several worthy interpretations, \"Scrooge\" (1951), the young Scrooge says to the young Marley upon their meeting, \"I believe the world is becoming a very hard and cruel place...\". If it was that way in the 1800's, it's ten times worse today, and therefore all the more reason to be reminded of our better nature. I especially enjoyed the scene where the streets of New York City were filled with throngs of people, traffic on the bridges was stopped, all waiting for the verdict. I know NYC well, and how its people rise to such occasions. These scenes were not in the 1947 version, and I think they added a uniqueness to this version. Better, worse than the 1947 version? Neither - just different, and just as valid.",
    "5": "Dorey (Elizabeth Perkins) and her daughter, Susan (Mara Wilson) live in New York City, where Dorey works for a long-established department store called Coles. It's Thanksgiving Day and Dorey is in charge of the Coles' parade through Manhattan. Naturally, things don't go as planned when the Santa she hired turns up tipsy and belligerent. But, very fortunately, a kind, white-bearded gentleman, Kris (Sir David Attenborough) is in the right place at the right time. He saves the day with his wonderful parade presence and Dorey hires him to be in the in-store Santa from that day forward. Going home to Susan, the two gals have a handsome dinner guest, lawyer-neighbor Bryan (Dylan McDermott) to share their turkey and trimmings. Bryan is in love with Dorey but, she is very reluctant to encourage his affections for she was jilted long ago and left with the sole responsibility for Susan. A nearby department discount chain, Shopper's Express, is mighty peeved at Coles' new Santa, for he begins to turn things around for the ailing Coles. Sabotaging his performance, they get dear Kris sent to jail on various charges. Dorey begs Bryan to represent Kris in a trial that will decide if he is, truly, Santa Claus. But, can Bryan succeed at winning Kris' freedom and stature as well as securing Dorey's heart? We'll see! The old classic, with Natalie Wood and Maureen O'Hara, is still the definite version of this tale but this one comes awfully close in charming its viewing audience. First, the cast is marvelous, with Perkins, McDermott, Attenborough and darling little Wilson giving very nice performances. The supporting cast, including J.T. Walsh, is also wonderful. Then, director and writer Hughes has added some nice touches and modern situations to the timeless tale, making it feel \"more up-to-date\". All of the production values, from costumes to sets to camera work, are of the finest. In short, don't shy away from this new version, even if you love the original. Both of them are magical in their own unique ways. March up your street and get this one for the holidays, or, indeed, any time you need a shot of that warm, happy feeling.",
    "6": "MIRACLE ON 34TH STREET, in my opinion, is another one of the best Christmas movies I've ever seen. If you ask me, it was really funny when Kris Kringle (Richard Attenborough) punched out the drunk Santa (Jack McGee). I was also really moved when Bryan (Dylan McDermott) and Dorey (Elizabeth Perkins) started dating. Also, in my opinion, Susan (Mara Wilson) was a really well-behaved kid. She makes this holiday smash worth seeing. In conclusion, I highly recommend this holiday smash to everyone, especially all you Richard Attenborough or Elizabeth Perkins fans who have not seen it. When you see it, prepare to laugh and have a good time.",
    "7": "I watch this movie every year around the Christmas season. Sometimes I will even watch it during other times of the year. It's definitely one of my favorite Christmas films. Mara Wilson is adorable in the film as Susan, a girl who doesn't believe in Santa. Richard Attenborough is a man who calls himself Kris Kringle and claims to be the REAL Santa Claus. Elizabeth Perkins plays Susan's mom Dory Walker, a head of the Cole's parade (like Macy's but without the liscencing.) , and the dreamy Dylan McDermot plays Brian Bedford, a lawyer and neighbor of the mother and daughter. The movie is virtually identical to the 1947 film but with some minor changes.The only minor problem I have with this film\nIs that it will eventually confuse children as it tries to convince them Santa Claus is real by comparing him to God. I'm not particularly religious so I don't particularly have a problem with that, my problem is more that this film convinces kids without a doubt that Santa is 100% real. Perhaps I have become overly cynical in recent years, but this always bothers me. I know it's just a fun movie to celebrate the holidays, but still. When I found out Santa wasn't real it wasn't until I was a teenager. My parents never told me as I was an only child and the second youngest grandchild in my family so I believe they wanted to keep the magic going for as long as possible. When I found out it was right before Christmas and even though I kind of knew the truth I was very crushed. My childhood was over. With that being said, I still think it's a fantastic movie...it just shouldn't be taken too seriously and perhaps shouldn't compare Santa to God.",
    "8": "Honestly, I'm not one for Christmas moviesnot that I'm a Grinch or a ScroogeI'm just not one for cheesy happiness. Me and my boyfriend were up watching TV, when we ran across ABC Family and them premiering the 1994 version of Miracle on 34th Street. My boyfriend immediately stopped channel surfing and asked if I liked the movie. When I told him I had never seen the movie, he insisted we watch it. I do have to say, this movie was happy, and at time cheesy, but overall it was a good movie. It's honestly not my favorite Holiday movie out therestill, I enjoyed watching it and feeling the spirit of Christmasbelieving. If you're looking for a good holiday movie that will lift your spirits, try this one out. But me, personally, I would grab Elf or the Grinch before I would grab this moviebut that's just my opinion.For daily movie reviews visit: http://kimsmoak.com/",
    "9": "I remember seeing the original movie Miracle on 34th Street, that movie could never be replace with this version. This is the best updated remake of a classic story. There are some difference between the movies, but it is almost the same plot. If I could not find the original movie playing on TV during the holidays, this is the one worth watching.",
    "10": "This remake of the 1947 classic shows how beautifully constructed George Seaton's original script was, because every change John Hughes made from that script weakens the film. For example...In the original, Kris hits someone with the cane who has been psychologically harming his genial friend. Violent, but sympathetic. In the remake, he attacks someone for mocking him. Uncool. It makes me sympathetic to the idea that he might be dangerous.This makes the \"we believe\" hysteria unconvincing. There's no good reason after that for him to become even more popular with the public. And the store execs coming out in support of him ... well, I wouldn't.His reasons for flunking his psychological test also make no sense (I've forgotten what they were, I just remember it was dumb).The courtroom scenes are a disaster. Replacing the DA's kid with his wife weakens the scene - what was the point?. The suggestion of improper influence on the judge is a throwaway that doesn't fit anywhere. The judge staring at that dollar bill for a minute and then coming up with the exact legal argument Kris' lawyer wants him to have is just absurd, and the speech itself is awful. And while the original divided the courtroom sequence into two parts, first forcing the judge to rule there is a Santa (based on political and personal concerns removed from the remake) and only then, with the insanely brilliant mail scene, giving him an out to rule for Kris, the remake simply has the judge basically say, \"well, if there's a Santa Claus I guess, sure, it's this guy.\"Then there's the final scene. In the original, they are using instructions from Kris that lead them to THE house. In this one they *know* they're going to a house (unclear on why) and the girl keeps shouting it's her house (it's as though Hughes believed everyone knows how it would end so why attempt a surprise) and then there's someone at the house with keys who prattles on and it's all just messy and anticlimactic and so, so inelegant.Even the most reasonable change - making the antagonist a scheming outsider - ultimately undercuts the theme. The original was about faith, and the mix and hostility, skepticism, and belief within Macy's represented that. By making Kris' downfall an external plot, you lose that. It's a small thematic weakness, but the point is, it's a change, and the movie is worse because of it.Everything is dumber, everything is less convincing, everything is less resonant.NOW THAT THAT'S OUT OF THE WAY ... here's my reviewThis remake is a dumber, less engaging take on the old movie with a few high points and way too many low points. Richard Attenborough is excellent as the charming and philosophical Kris, and Elizabeth Perkins is every bit as good as Maureen O'Hara. The scene where she rejects the proposal is actually really intense, with Perkins beautifully displaying angry lashing out built from intense fear. It's a scene that deserves to be in a better (and very different) movie.Dylan McDermott, on the other hand, brings to mind a statue brought to life, distractingly perfect and running the emotional gambit, as the old joke goes, from A to B. As for Mara Wilson, her performance is an interesting alternative to Natalie Wood's, less steely and intellectual and a little more human and cutesy, and while I prefer Wood I wouldn't say one was necessarily better than the other.I'm of two minds about how watching the original effects my take on this one. On the one hand, perhaps I'm being too harsh because the original was so good. On the other hand, if I'd never seen the original this one would probably make even less sense and I would wonder why anyone thought it was a good idea to make such a stupid movie.Not unredeemably terrible, but not recommended.",
    "11": "Being a grown man and I will say the scene when Santa using sign language to talk to the little girl, and then know he actually did the scene without the little girl knowing he could sign, is amazing and brings me to tears to see the magic. This was one of the best films depicting Santa as not a comic type character. Just priceless and can't being I just finally saw this.",
    "12": "This is a great example of a good Christmas film that can be enjoyed by all ages. I haven't seen the original so cannot compare the two but the fact that both are often packaged together on DVD shows that both must be equally liked.The story makes for by and large easy enough viewing with some captivating performances by Attenborough and young Mara Wilson. The film captures the spirit of Christmas well and the action moves towards its conclusion well. There are several well crafted scenes and some magical moments that make this a classic Christmas film.It may be a little long for some people and the ending a little contrived but it remains a fun Christmas film that is well worth watching.",
    "13": "As far as remakes of classics go this is certainly one of the better examples.  The great strength of this film is the casting which throughout matches the excellent class of the original, and this is no mean achievement.Occasionally the writers felt the need to deviate from the original - perhaps once or twice too often, because the original story was quite modern anyway, i.e. it did not need much updating.  Some of these deviations work pretty well (the midnight wedding was a great new idea although left a bit underdeveloped), others very much less so.  Using Joss Ackland as a cross between Ebenezer Scrooge and Ernst Stavro Blofeld was a bit daft, but the only real disaster is the resolution of the court case, one of the highlights of the original and a MAJOR let-down in this version.",
    "14": "Faith is believing when common sense tells you not to! This movie has always inspired me to believe, and I have grown up watching it time and time again. If... you can't believe, if you can't accept anything on faith, then you're doomed for a life dominated by doubt. Kris Kringle tells us this, and the movie tells us this. It shows us that Kris Kringle, Santa Clause, Saint Nicholas.. is a symbol. A symbol of faith, and a symbol of hope. Christmas is not for children, or for those who are young. Christmas is for all, and if you believe Christmas Miracles can come true. Hope is the greatest of the gifts you'll receive. Christmas and Santa Clause gives us hope.",
    "15": "Every time that I start to watch this movie I cannot stop.  I have spent many late nights watching this  wonderful movie.  This is truly a film for the whole family to enjoy.  A must buy for every family that enjoys Christmas.",
    "16": "This latest installment of the beloved holiday film tried to succeed, but alas, all of it's efforts failed, particularly in comparison with the two previous versions. In my opinion, once you're seen the 1947 version with Maureen O'Hara and John Payne, this failure becomes obviously and painfully apparent. There is more heat in a winter snow storm than in the odd pairing of Dylan McDermott and Elizabeth Perkins. It just seems to be \"trying to hard\" to be the equal of the original, updating the events to make it more au current, all the while the characters and performances seeming forced and stereotypical, without the true spirit of the B&W classic (with the sole exception of an always superb Richard Attenborough in the leading role). It appears that in a desperate attempt to come up with a truly good Christmas movie, all they've managed to do is reheat last night's Christmas dinner.",
    "17": "If there ever was a film that did not need a remake, the original \"Miracle on 34th Street\" was such a film. The original featured a virtually perfect screenplay in which everything works out right against all odds. Above all, it softened the sentimentality with some genuine satire (corporate heads who are so afraid of losing sales that they have to admit that Santa Claus exists)and, above all, with a delightful sense of ambiguity as it leaves open the possibility that Chris really is Santa Claus. The remake just pours on the sentimentality and (spoiler) even changes the ending.",
    "18": "I totally loved this movie, just as good, acted just as well, great cast. Sir Richard Attenborough was just the one for Kris Kringle. WOW! Dylan McDermontt does great and Elizabeth Perkins shines with beauty and performance. Mara Wilson pursues Natalie Wood with the spectacular role as the little girl in great perfection. I wish Natalie Wood could've lived to see her performance. This was an amazing movie. If you want to have a great Noel, rent both versions. They're so enjoyable",
    "19": "Miracle on 34th Street is a 1994 family fantasy film starring Richard Attenbourgh,Mara Wilson and Elizabeth Perkins alongside Dylan McDermott. It tells the story of an elderly man named Kris Kringle(Attenbourgh) who is fully convinced that he is the real Santa Clause. Only a little girl named Susan(Wilson) and her mom's (Perkins)boyfriend who happens to be an attorney named Bryan(McDermott) can help Kris prove his real identity to the courts.Overall I enjoyed this film. It was a sweet movie to watch this holiday season. From the director of Flubber (1997) and the producers of Home Alone.",
    "20": "And the remake to the classic original MIRACLE ON 34TH STREET makes the wait very worthwhile! Richard Attenborough makes a delightful Kris Kringle, who starts trouble by claiming to be the one, true Santa Claus. Mara Wilson of MRS. DOUBTFIRE also stars as the little girl who at first is cynical about the whole idea of Christmas and St. Nick, but soon Kris Kringle shows her that he does exist. A good holiday flick for the whole family. I'm a teenager, and I thought MIRACLE ON 34TH STREET was a great movie, partly b/c of the film's excellent lack of sap unlike other family movies!",
    "21": "I read many reviews of this film and the original and I was shocked by some of them. I saw this version of the film first and I was amazed. It is a warm, decent, traditional film about courage, faith and hope, that motivates to fight against evil and protect the good. Later I saw the original 1947 version and I liked it, but I can't say it was better than this version. It is difficult to compare after you see one film and love it and then see another version like it more than than the first you saw. But after all I like the new ideas of this film. They are really improvements of the story and the film fits more for the current audience, since less generations lie between it and the film. The film is really well done and Richard Attenborough is a fantastic Santa Claus.",
    "22": "Miracle on 34th Street became a forced holiday classic due to its obsessive airplay in the past twenty years, but it's so empty in content and lifeless in execution that it can merely serve as a background to Christmas dinner.The story is actually made of some interesting ideas: Santa gets a job in a department store, manages to convince disenchanted children that he actually exists but ends up being under trial. Too bad that they used the corniest and most uninventive pretexts a writer could ever think of to get such a story developed. The ways Santa gets framed and the whole trial unwinds just didn't make any sense. Richard Attenborough's Santa Claus was the only convincing thing here and probably the only reason the kids of the 90s still remember this film.",
    "23": "Miracle on 34th StreetA good, kind-hearted remake of the original that stars Mara Wilson as the little girl who gradually starts to believe that the local mall Santa Claus (Richard Attenborough) is the real deal. Her strict conservative mother (Elizabeth Perkins) thinks otherwise and sues Mr. Claus for pretending to be someone else. Hey, the original never made much literal sense either (especially if you're over the age of 10), but both the films have a good dose of sentimentality and cheerfulness that work. But the original is still far superior.*** / *****",
    "24": "The man who brought us Planes, Trains and Automobiles and Home Alone remakes a Christmas classic with his trademark sentimentality and enormous heart. An outstanding cast of heroes and villains bring magic to this outstanding film. A \"must see\" for the holidays.",
    "25": "We had the Thomas Mitchell version, then the Sebastian Cabot version (for TV?). Now comes this flat, annoying, over-produced, saccharine disaster of a remake. None of them come within a mile of the original.I guess this made money. How?",
    "26": "It seems that Hollywood likes nothing better than setting up lovable eccentrics as funny farm fodder and then having them beat the rap in a courtroom finale - think of Mr Deeds Goes To Town, Rosie, even Harvey for God's sake. Often, of course - Longfellow Deeds, Rosie - there is money behind the motive and in this ill-judged remake (if it ain't broke don't fix it) money is once again behind the rival store's framing of Kris Kringle. Okay, the last movie that needed remaking was the original Miracle On 34th Street with its charismatic cast of Edmund Gwen, Maureen O'Hara, John Payne and Natalie Wood, but it HAS been remade so we're stuck with it. Dickie-all-I-want-is-knighthood-Attenborough is surely one of the most overrated actors on the planet yet he gives it the old college try even if you can see the technique a mile away. As for the lovers the less said the better and it surely speaks volumes that Macey's - who were more than happy to be associated with the original - wanted no part of this turkey even passing up free publicity. Okay, if you're ten years old and have never heard of the original this is acceptable, if you're between ten and twenty it's just about passable but if you're older than twenty why bother with this when the original is out there just waiting to be discovered and/or rediscovered.",
    "27": "\"By George, I think they've got it!\" If you watch one Christmas special this year, make it Miracle on 34th Street (1994). Mara Wilson's performance is second to none, possibly the best of her career, and Richard Attenborough and Dylan McDermott shine. The soundtrack is great, with none of those modernised commercial (and fake-sounding) carols, but orchestrated re-creations of old favourites by Bruce Broughton. Of course, it's not just the actors (and of course, actresses) and soundtrack that make a film; cinematography and direction play just as big a part, and Miracle on 34th Street (1994) proves this. Les Mayfield and Julio Macat do a great job reworking of George Seaton 's 1947 screenplay.Again, if you see one Christmas movie this year, make it Miracle on 34th Street (1994); I gave it 8/10.",
    "28": "Every Thanksgiving we watch the 1947 and 1994 versions, and the latter is the one I enjoy most. Both are good, but the actors in the older one are pretty unrealistic and cornball, while the actors in the modern version feel more real, deep, and personable. Often I like older, B&W originals, but the color in the 1994 film is really rich and adds something special.",
    "29": "Most remakes should not have been attempted.  However, this movie has an excellent cast, and significant story-line  differences from the classic 1947 version.  This 1994 version is not better than the 1947 version, but just as good.  This is a movie for today, with video-cams, cell-phones... If you want nostalgia, to see old New York, see the 1947 version.",
    "30": "This remains as one of my favourite Christmas films of all time. It still holds up to when I was a kid and would watch it every year at Christmas time. Mara Wilson was absolutely perfect for this role. She was the definition of adorable and Richard Attenborough was a fantastic Kris Kringle. It's a great movie to watch around the holidays. It's very uplifting and simply magical. I highly recommend watching it if you haven't seen it.I have seen both the 1947 version and this remake. I mean no disrespect to the original (it was good), but I personally connect more with the remake. I also find the writing to be better. For instance, the scene where Kris hits a man with his cane made more sense to me in this film, than the original. In the original I found that scene quite out of place for a Santa to actually strike a man's head and so harshly.",
    "31": "it is not exactly a remake. it is not , in real sense, a version of 1947's movie. because it looking be different. using new scenes, imposing new images and new sides of known characters. Mara Wilson is far to be another Nathalie Wood. she has the usual charm and courage to create a role in her style. Miracle on 34th Streed is a good demonstration. Richard Attenborough is a profound different Santa. and that is the essence of film - to say a story, its story, to a public who is not the public from 1947. the result - a Christmas movie who is more than decent. it is nice, moral, a lesson about the essence of mankind, a smart and touching definition of the spirit of a special holiday. a film who must be discovered not as adversary of the original but as package for a noble message. because that is its fundamental purpose.",
    "32": "I first saw the 1970's version of this on TV. I had not yet seen the 1947 version until after I saw this one. I liked all three versions but I really like this one the best. I usually don't like remakes because they tend to totally change the story or they just add some unnecessary dirty words, nudity, violence or sex scenes. This remake was very good. I don't see why people are so against it. There are many versions of A Christmas Carol and yet few seem upset by that. I liked the dollar bill evidence much more than the post office evidence near the end. I loved the scene in which the citizens of NY city showed their belief in Santa Claus. I also felt that the reason why Kris Kringle struck out at the man was much more realistic in this version than in others. Maureen O'Hara is one of my favorite actors. ( yes the screen actors guild uses the term actor meaning \"one who acts\" for males and females. ) The 1947 version is well acted and charming. The 1994 version is a movie that stands on it's own and is delightful.",
    "33": "Let me start of my saying that I love the original 1947 black and white Miracle on 34th Street and as a child of the 70's I even like the 1973 made for TV remake that starred Sebastian Cabot as Kris Kringle/Santa and even thought the original is better I though the 1973 remake was good but this 1994 theatrical remake was awful! The actors in it are very good actors but the movie itself was the pits and has all the warmth of an a container of ice cream left out in the snow! It is so cold and cynical and mean spirited compared to the original and even the teenage janitor that befriended Kris in the other versions and was depicted as a sweet almost simple minded kid was mean in this movie and did things that he would never have done in the other movies. In this movie he only pretended to be his friend and betrayed him. Yes he may have seen the error of his ways in the end but I preferred how nice he was in the other movies and he would never had treated Kris that way by talking behind his back and being in cahoots with the bad guys! I would say that the character in this movie needs lump of coal in his stocking!",
    "34": "While I believe a great film can be updated to fit more recent times, the 1994 remake of the 1947 classic Miracle on 34th Street is an example of how good intentions can go astray.I thought Richard Attenborough did a fine job in the lead role. The spirit of the film was truly much like the original version. Where they went wrong was getting too heavily into the serious plots—the scenes between Mrs. Walker and the attorney were too long and too detailed, without being humorous at all.{Spoiler alert} One scene near the end was troubling to me. They appeared in a Catholic church after midnight Mass and the priest was happy to marry them even though they obviously had not agreed to get married beforehand. This isn't Las Vegas. Any normal minister on seeing that the couple had not really planned on getting married, but were just then considering it, would have wanted to wait until they were sure before performing a ceremony.What really hurt was that most of the scenes from the original that made it such a fun film were eliminated in the remake. The comical interaction between Kris and Susan as he tried to let her learn to pretend, and, most significantly, the great courtroom scene where all the huge bags of mail were carried in, convincing the judge that the postal service considers Kris to be Santa were not in the remake.In fact, the \"big courtroom scene\" had the judge all ready with his verdict, then, on seeing one familiar phrase on the back of a dollar bill, suddenly rendering a totally different verdict on a rather flimsy bit of logic. In the original, the judge's dilemma was saved by thousands of pieces of unexpected evidence. In the remake, the judge changed his mind over seeing something that he could easily have thought about on his own—the concept of trusting someone or something you can't see is not unique to the phrase on the our money.I will agree that the 1994 Kris had more reason to strike his antagonist in the remake—but the scenes of him being tormented were not fun to watch. When he struck at the man, he swung his cane quite hard—hard enough to have done some real damage, which is something I'd like to think a real St. Nicholas would simply not do. In the original, he was simply frustrated at the annoying Macy's employee and gave a light tap that clearly would not have seriously hurt anyone.Even the opening scene in the remake removed the humor of the original. I remember well how I was impressed the first time I saw the original, where Kris is walking down the street and happens to see reindeer and a Santa figure in a display window, and he knocks on the door and proceeds to instruct the man that he has the reindeer misarranged. The 1994 version simply has Kris standing at a stop light and when the man beside him says that the little boy next to him thinks Kris is Santa Claus, he leans over and whispers, \"I am Santa Claus.\" Ho-ho-dull.",
    "35": "Dylan McDermott (Mr. Gailey), Richard Attenborough (Kris Kringle), and Mara Wilson (the girl) are fine, but Elizabeth Perkins is miserable as Mrs. Walker, the girl's mom. She mumbles her lines with no intensity or feeling. Also, in the original there were some dramatic twists that were interesting and advanced the plot; here, all the twists are planned ahead of time and telegraphed to the audience. I liked the Walker girl watching the parade out of Mr. Gailey's window -- all the floats were (in color!) right there. And, Dylan McDermott does his best to be an engaging boyfriend wannabe, and Richard Attenborough tries to be a charismatic Santa, but the movie really falls flat with poor writing, poor acting by Elizabeth Perkins, and probably poor pacing, staging, and dramatic narrative by the director. Take a pass on this faux remake and go back to the original with great actors like Edmund Gwenn, Maureen O'Hara, and Natalie Wood, and a narrative that was actually dramati, real, and interesting.",
    "36": "This is a great classic that we watch every year without fail and for great reasons, we never get tired of it. Not all movies can keep us interested year after year!",
    "37": "There are some movies in which one watches in life which has no real intention but to make a person feel good about not only themselves but for the collective people. Miracle on 34th Street does this for me. Not only does the performance of all the cast make this memorable but the there is no real person which you end up hating, except maybe 2. This is a must movie for all Christmas lovers out there who just want a tale told to them which will make them as warm as that eggnog they drink that night, (unless you drink it cold like in Australia). Brilliant movie which I watch every Christmas. In conclusion, it is a movie which once watching it and allowing one's self to be captivated by its charm, one finally feels like a kid again. And anyway which is worse? 'A lie that brings a smile, or a truth which draws a tear' Best Santa I have seen",
    "38": "This remake wasn't as magical and full of Christmas spirit as I hoped it would be. Unfortunately, the movie was kinda boring and dull instead of being sweet and fun to watch and enjoy. Elizabeth Perkins was good in it though, and was well casted in her lead role. So that's one plus to it. The little girl that stars in the flick was pretty good, not the best though. But I didn't have a real big issue with the casting overall. It was the lack of substance and weak script I took issue with here. The script and dialogue is kind of dull and lack luster in this movie. It's not a god awful film, but it's certainly not the magical Christmas ride you might expect. It is family friendly though, with the exception of a couple of bad words. So if you want a Christmas movie that's OK for the kiddos, then this might be for you. But in my opinion, this movie just wasn't that good, it had some potential, but I feel like it squandered that good potential. 4/10 for Miracle on 34th Street.",
    "39": "All in all this film was not too bad for a remake of the classic 1947 Miracle on 34th street. But it was interesting because the storyline had been changed a little bit. It could never replace the original film but then again most remakes are never as good the original films. This film was heartwarming and funny though. It is just that the story and focus was changed a little bit. I usually watch this film around Christmas time for a good holiday cheer!",
    "40": "I thought this was a nice movie to watch with the kids. It was lightweight, but not sappy. The movie held up well for adults. I have not seen the original, or if I have, I have forgotten it, but I understand the justification for the court decision allowing a sane man to believe he is Santa Claus is different in the two movies. According to my wife, the original movie's justification sounded ok, but I really liked the clever way it was done in this movie. See both and decide for yourself.",
    "41": "I grew up with the original and I hate this version. They removed all of the great moments of the story. Dylan McDermott has gone to the Raymond Burr school of acting... look away thinking and then deliver your lines. Elizabeth Perkins is madeup to look like a Sean Young look-a-like and the kid has know charm.I realize it was a tough act to follow but the attempt at modernization makes for a very cold movie.",
    "42": "I grew up watching both versions and I love them both for different reasons.I like the Santa better in this one along with the characters. The script isn't as strong as the original. I prefer this ending as well over the other one. My main issue with this one is the court room scenes. I prefer the original version where they proved Santa through the mail service. There was no reason to bring god into this version.",
    "43": "I could only stomach short samplings of this putrid insult to a classic. They botch the plot line, make Santa a wise guy instead of a jolly, clever sage and give all the glory to the attorney, instead of to a miracle of fate.  Finally, they top it off with a ridiculous climax that makes no sense whatsoever.  Leave the classics alone!",
    "44": "A magnificent remake .... all performances are captivating . I watch it several times every Christmas season",
    "45": "I have to say that this is without question my favourite Christmas movie, and am disappointed with the number of people who feel the need to bad mouth it. This movie should not be viewed as a remake of what is admittedly a very good film, but as a modern classic that stands on its own two feet and successfully imparts the spirit of Christmas to a new generation who would otherwise be uninterested in the 1947 version. Indeed, I myself would never have bothered watching the original, until I had seen this. The performance from all the leads is excellent, and Richard Attenborough (who's yet to prove that he's not Santa) and Mara Wilson, are particularly strong. Miracle on 34th street, successfully warms the heart and in places (the scene with the deaf girl, the signs all around NYC declaring people's faith in Kris and the crowds outside the courtroom to name but a few) still sends tingles down my spine every time I see it. Maybe I am overly sentimental, but hey, this is a Christmas movie after all... This film demonstrates just what humanity is capable of if we would just open our minds and, for once, maybe just accept something on faith alone. And I ask you... what can be wrong with that?",
    "46": "This remake is a decent film on its own, but can't compare to the original version. It lost me right from the beginning with juvenile humour (making the bad Coles Santa the butt of jokes), and never won my interest back. I was particularly disappointed in the ending. The original ending drew the necessary distinction between proving that Santa existed and proving that the gentleman known as Kris Kringle was Santa. For some inexplicable and unjustifiable reason, the remake glosses over that distinction. This cheapened the rest of the film for me. I also preferred the ending in the original version. While I like the direct God/Santa comparison in the remake (suggesting that Santa works through others his miracles to perform), I prefer the manner in which the family obtains their house in the original version. It's a lot more meaningful if they have never seen the house before that minute, as the randomness factor hints more strongly at Kris's actually being Santa.In the same vein, I thought Kris acted too mentally inadequate in this version, talking about the Tooth Fairy and Easter Bunny as if they were real, and addressing a local reindeer as if it were one of his own. Santa becomes less a person than an ideal of behaviour and attitude, as the overly sentimental script keeps reminding us. He inspires other people to do things instead of being able to do them himself. I suppose that's the point the film is making, but all the same I prefer the less heavy-handed approach of the original.",
    "47": "You know, I always try to have an open mind when it comes to movies, but this particular one never should have been made in the first place. But if you are going to try and remake a classic like Miracle on 34th Street, you should do way better than this. I mean the original movie had these amazing actors such as Edmund Gwen, Maureen O'Hara, Natalie Wood. So when the remake came out the cast ended up falling really short of the already exceptionally high marks left by these ridiculously talented people. Bottom line, the original is magical and a timeless classic, the remake is a badly failed attempt to capture what the first film pulled off so flawlessly.",
    "48": "I think that this movie is a perfect excuse to watch a Christmas film. The movie teaches us about religion and believing, and i see nothing wrong with that. Mara Wilson is fantastic as the young Susan Walker. I feel that even though she is the smallest of the cast members, she leads them perfectly. If Chritmas films do nothing for you, then show it to your kids, because i am positive that they will love and cherish it. While some disagree, i would say that this movie was a great remake of the 1934 film. If this movie wasn't re-made i don't think i would of even heard of the original. I think the movie was in much need of a re-vamping so that younger people, like myself, would be able to addapt the movie more and to understand it a little bit better. I felt Richard Attenborough was a great Santa who was believable. I would recommend this movie 100%.",
    "49": "My family watches this every year. Growing up in NYC, this s pretty accurate with the locales. The parade, Macy's, Central apark, all are lovely..",
    "50": "Some people are black and white aficionados.  I'm not.  However, in this case, the original was better than the remake.  The careful balancing of emotions needed to make it believable has been tipped too far here.  The emotions are held until they are obvious, not subtle.",
    "51": "I enjoyed the original movie which has since become a classic. When the movie was remade, I was excited about seeing an updated version. The remake is not heartwarming and this sort of movie should be heartwarming. Parts of the remake are very good and, with the exception of Richard Attenborough, all of the actors were very good. The much respected Mr. Attenborough just did not seem like Santa. I watched the movie this past Christmas with family and friends (about 20 of us) and discovered that I was not alone with my discomfort with the part of Santa. The children made comments about him that were surprisingly uncomplimentary. I'm sure the comments were not intended to be commentary on him as a person but almost everyone thought that another actor could have played the part better than he did. The end of the trial, while an interesting twist, did not quite come together well as in the original movie. The end of the movie did not bring a smile to my face. I really wanted to like this movie but after seeing it again, it still falls short. While the original movie is very dated, it remains the superior movie.",
    "52": "There's no doubt about it this movie is definitely a Christmas classic. It's fun to see a real life Santa, especially in the real world with a court case, and skeptics, and drunk Santa fakes. Just about everything in this movie is perfection, but I only have one qualm.I'm sure for its time it was perfectly acceptable, but looking at it now, the love story is atrocious.The woman makes it very clear that she's not interested in the man, he proposes to her anyway, she says no so he gets mad at her for not feeling the same way. Then somehow they end up together at the end of the film? What!? Certainly explains why some \"nice guys\" feel so entitled to relationships.Again, minor flaws with the movie. Overall it was a fun holiday movie, and I'll surely watch it in Christmases to come. I just know that every time I do, the Love story will forever bother me.",
    "53": "I didn't realize until I'd started watching this film that is isn't the one with Fred Gwinn as Kris Kringle and Maureen O'Hara as Doris. Still, I've no objection to a remake: but this movie has made a lot of changes that don't improve it, only make it worse. (Spoilers follow.)The original is in B&W; this one is color. That's better, I suppose, but sadly the lightheartedness of the original has been replaced by something much colder and harder. This shows in many ways: Kris Kringle's cane in the original is a simple wooden cane, not very heavy; its replacement in this one is a much fancier, heavier silver-headed cane. That wouldn't make much difference- unless someone was tapped on the head! This fancy cane could easily have killed someone, while the earlier version would have only delivered a harmless- though painful!- thump. The department stores in this version aren't merely competing, at least one is in deadly earnest; plots are hatched. The drunken Santa who Kris Kringle replaces isn't just a harmless drunk, he's an alcoholic with a mean streak who takes money and lies about his replacement. Everything in this film is just a bit nastier than in the original, and for a holiday film aimed at kids this isn't any improvement!The big scene in the courthouse is changed, again for the worse. Instead of thousands of letters addressed to Santa, dramatically delivered in the court, we have long dissertations about \"In God We Trust\" on our currency. Bleh.The ending of this film is painfully unbelievable, and leaves Santa out entirely. The scene where Fred & Doris get married, at night in an empty church, without telling Susan-? You've got to be kidding, right? Sadly not!This film isn't terribly bad, it just seems that way compared to the pure gold of the original. The acting is mediocre (except for Richard Attenborough, who was excellent- but his performance made the rest seem wooden.) There's nothing much really objectionable about this film, it's just been \"sanitized\" for modern progressive audiences. As a result, it doesn't hold a candle to the original.Accept no substitutes for the 1947 Miracle on 34th Street; because there really aren't any!",
    "54": "I heard it was a Christmas classic so I had to give it a try. It's a bit cheesy, but then I kept thinking it was made in 1994,now that I read the comments and found out it is a remake I need to watch the original as well. I recommend this movie. It's a feel good ending, and a kind reminder to believe in the spirit of Christmas and what it represents. The case for Santa was an interesting approach.",
    "55": "\"Ferris Bueller's Day Off\" director John Hughes has done an admirable job reworking writer & director George Seaton's Santa Claus on trial classic \"Miracle on 34th Street\" but he has made some interesting as well as creative changes with the narrative. The names of various characters have been altered and certain incidents from the original have been enlarged. First, the psychiatrist named Sawyer has been omitted. Second, Hughes has added some melodrama in the form of a villainous department store owner struggling to implement a takeover bid. This villain has a henchman who exploits the drunken Santa Claus that Kris Kringle revealed. The names of popular department stores, such as Macy's and Gimbals', have been altered, too, to fictional stores. .Hughes has taken certain liberties that were not done in the original. Elizabeth Perkins is far more reserved than Maureen O'Hara as the heroine, but she is incredibly sincere. Dylan McDermott is perfect as John Payne's replacement who is an attorney who desperately sets out to woo the Perkins heroine. If anybody bestows a sense of dignity to this respectable remake, actor/director Richard Attenborough does so as Kris Kringle. The strong supporting cast consists of James Remar as the rival department store owner's henchman; J.T. Walsh as the public prosecutor, and Robert Prosky plays Judge Henry Harper. Unfortunately, the remake lacks the passion of the original. There is no mail bag scene, and the Judge issues his ruling based on the circled words \"In God We Trust\" on a one dollar bill that secures Kringle's release. Like the original, the Santa Claus definitely believes that he is the one and only Santa. This \"Miracle on 34th Street\" is appropriate for our enlightened, cynical age and doesn't touch the commercialism of Christmas issue. Les Mayfield does a good job of shepherding the remake through to its inevitable conclusion. Alvin Greenman is the only cast member from the original, but he doesn't play a department store janitor this time. Instead, he is cast as a doorman. Although it lacks the spontaneity of the original, you may enjoy this version more. Inevitably, the two romantic leads unite at fade-out.",
    "56": "I saw this version before I realised there was the original 1947 Edmund Gwenn version, which is brilliant, but this remake is more recognised in popular culture, directed by Les Mayfield (Flubber, Blue Streak, The Man). Basically the actor playing Santa Claus for Cole's Department Store Thanksgiving Day parade is found drunk, so the special events director Dorey Walker (Big's Elizabeth Perkins) persuades the bearded man who found him, Kris Kringle (Lord Sir Richard Attenborough) to take his place. He proves to be a sensation with the public, and is quickly recruited to work in the Cole's store store on 34th Street to play Santa, Kris claims he is the real Santa Claus, and his employment documentation confounds Doris that his address and details relate to this as well. What gives the store really good business is that they market the fact that Kris is telling customers where to find toys, including at better prices, and he is really enlightening everyone's spirits, including Dorey's own daughter Susan (Mrs. Doubtfire's Mara Wilson), who she taught to reject any belief and fantasy. Shopper's Express owner Victor Landberg (Joss Ackland) wants to put Cole's out of business, he gets his associates Jack Duff (James Remar) and Alberta Leonard (Jane Leeves) to orchestrate a plan to get Kris fired, and with the help of the fired drunken Santa, Tony Falacchi (Jack McGee), they get him arrested for assault, after antagonising him. The charges are dropped, but Kris will go on trial, Dorey's friend and growing love interest, Bryan Bedford (Dylan McDermott), wants to help represent Kris, not just to prove his sanity, but unbelievably by proving he is the real, and the one and only Santa Claus! It is going to take a miracle for Kris to win, but they gain support from the public who believe there is a Santa Claus, but with lack of evidence it looks like Judge Henry Harper (Robert Prosky) has no choice but to rule against Kris. However, evidence is presented that wins the judge round, a one dollar bill with the words \"In God We Trust\", as there is no physical evidence of the existence of God, and Santa Claus being an equally believed being he is elated to dismiss the case. In the end, Kris is proved to be Santa Claus, and following the court case, Dorey and Bryan are surprised to be given a surprise wedding, Susan is overjoyed to see the house she always wanted, and she remarks that she also asked Mr. Kringle for a baby brother, Dorey and Bryan stare at her stomach, suggesting a baby is coming, and they share a kiss. Also starring J.T. Walsh as Ed Collins, William Windom as C.F. Cole and Allison Janney as Woman in Christmas Shop. Attenborough is a great choice to play the lovable eccentric man who believes himself to be the real Santa Claus, Wilson is adorable as the cynical young girl with a big wish, Perkins is charming as the mother, and McDermott is a nice guy. It follows pretty much exactly the same plot as the original film, but Macy's (who declined involvement) has become fictional store Cole's, a foreign girl becomes a deaf girl, in a touching scene, and the ending is more modernised (and in a way realistic), it is maybe not as magical as the original, but it colourful and glamorous Christmas movie, a nice charming seasonal family film. Worth watching!",
    "57": "I challenge everyone to find any actor, any extras, any children, ANYONE in the movie who is wearing jeans. You won't. And if the actor should be wearing jeans or work clothes, it'll be a shot from the waist up.There's a scene showing dozens of children lined up in Macy's to sit on Santa's lap and tell him what they want for Christmas. Every single kid is dressed to the nines. Their parents are in business suits or beautiful dresses and coats. It's just a classy, beautiful remake of a very old, very sweet Christmas movie.Oh, and everyone's hair is perfectly cut, combed and styled. Everyone. Not a single detail was overlooked.👏👏👏👏👏👏. Such talent n the director, producer, crew, actors, everyone.",
    "58": "How can you not feel warm inside after watching this? Sure, Elizabeth Perkins was a little too subdued for her role, but Richard Attenborough and Mara Wilson make it worthwhile. Attenborough was perfect for Kris Kringle. Even though I know the \"secret\" of Santa Claus, he made me believe in him for the 114 minutes the film lasted. The part with the deaf girl is really sweet, and you can't help but feel devastatingly sorry for Kris when those slimeballs at Shoppers Express set him up. It's a real shame Attenborough is threatening to never act again if he doesn't get to be Albus Dumbledore. He's a great actor, but not what I had in mind for Dumbledore.Mara Wilson is also adorable and convincing, and, just as Brian says, talks like she's 64. *SPOILER* And the speech she gives about it being highly unlikely she'll get arrested as she gives the judge the card that determines the verdict of Kris's case is priceless!*SPOILER'S OVER.\nAll in all, your heart has to be two sizes too small to not like this.",
    "59": "I always adored this movie since childhood. I definitely have an appreciation for the original, but this version holds up just as much. I love the way they prove Santa Claus' existence in this one. I recommend this movie specifically as a child's first \"serious\" Christmas movie, especially if they have doubts about Santa or have just found out the \"truth about Santa.\" It has fun, wondrous moments to keep them engaged while addressing serious messages like the meaning of Santa Claus', God's role in and acknowledgement by our government, personal integrity, and faith in general.",
    "60": "What a wonderful remake, and thoroughly worthwhile. The story is of course unoriginal, not only as it is a remake, but in that it has all the usual tropes you would expect. But that really isn't a problem - this is a Christmas film after all. It is incredibly warm, the pacing is great, the cast are superb and there's enough laughs for all ages and temperaments.What really makes this the best Christmas film is Richard Attenborough's incredible Santa. Absolutely perfect, whilst showing a fragility and depth you won't see in any other depiction. Ever.You would really have to be a \"watch the original\" snob, or an anti-Christmas grinch not to find something to love here. Can't wait to watch it on Christmas Eve!",
    "61": "I tend to be cautiously optimistic when it comes to remakes, and had a little more faith than usual in this one, as much as I like Richard Attenborough. What bothered me more than anything is that what I'm seeing in this film is \"Santa with an ego.\" For all of Santa's selflessness, compassion, and belief in what he does, it goes against all those qualities to see him on the defensive in terms of any heckling in a department store where kids are waiting in line to sit on his lap, as well as being quickly drawn to strike the same guy who presented no real threat to him on the street other than continued heckling. What also bothered me was the lack of substance I saw in the resolution. In the original, Kris's lawyer found a legal loophole for the government to recognize him as the real Santa, while here an apparent parallel philosophy to the belief in Santa is enough for a judge to make his ruling of--I'm not sure what. There is indeed plenty of holiday warmth in this film, but no strong reasoning to what is at stake, on either side, in the plot. I've read enough reviews to see what reasons others have found that lead them to like the movie, and I have no problem if they keep watching it based on that. For me, it just simply did not have a strong foundation to make it a good movie, even without comparing it to the 1947 version.",
    "62": "Richard Attenberough is excellent as usual but the movie is cheesy and over acted. In a world full of xmas movies, this one sits right in the middle of the pack.",
    "63": "for the presence of Richard Attenborough. or for charming performance of Robert Prosky. but not more. because it is difficult to do a good remake to a masterpiece. because the actualization of story is not really inspired. but, if you do not know the original, this is one of touching films. humor and Christmas spirit are perfect options for entertainment and for a evening with family.correct - the reference to Saint Nicholas is a good point -it has not magic of original. is it a sin ? not but the hope is always a virtue.. a love story, a girl and Santa in his entire splendor. same story about spirit of holiday, faith and miracle. a nice film, yes, it is a nice film. with few drops of deep beauty grace of extraordinary mister Attenborough",
    "64": "Horrible, doesn't hold a candle to the \"real\" one from 1947. WAY too many sappy close-ups of Mara Wilson's would-be \"cute\" expressions (of which she has exactly one, used ad nauseum in both this and Mrs. Doubtfire) and brings in a completely bizarre and irrelevant Christian angle to the end. As others have pointed out, \"In God We Trust\" was NOT originally on currency, and was only added in 1957. It was a sign of the times and should not be assumed to be a government endorsement of religion. Americans believe in literally thousands of \"gods\" and yet only one Santa Claus, so his \"god\" argument was ridiculous and nonsensical.It's no wonder Macy's didn't want to be associated with this film. Treacly sentimentality, mawkish pandering to religious fanatics, and lackluster acting make this movie more akin to a made-for-TV film than a remake of a classic. If you want to watch \"Miracle On 34th Street,\" then watch the real one. Give this gooey, inferior imitator a wide berth.",
    "65": "The original Miracle on 34th Street is a classic. Much that is good about the original is changed in this one. The actor that plays Santa is good in both but the male lead, female lead, and child lead are all far better in the original. The Macy's and Gimbles plot line is also far superior to the changed one here. I hated the acting, hated the changes, and hated the movie. There was no need for this movie to be made. Inferior in every way.",
    "66": "The deaf girl is typical John Hughes heavy handedness and is a good example of how this movie is a joke compared to the original. Instead of accepting that the audience would have the intelligence to \"get\" that Santa speaking dutch could show that he really IS Santa, Hughes has his Santa use bizarrely exaggerated sign language...and it drags out forever. You half expect Hughes to jump into the scene and yell at the audience \"SEE?!? He does SIIIGGGNNN LANGUAGE!!! He Really IS Santa!!!\" And good 'old Mara Wilson. Can't wait for her autobiography, \"Lisping My Way Through Hollywood.\" At least in the original, the little girl acted.",
    "67": "This movie is an absolute wonderful remake from the classic. Richard Attenborough does a fantastic job as Kris Kringle and the whole movie is just a wonderful holiday masterpiece. I hope and pray that Hollywood doesn't dare try to screw with this classic! It's one of my favorite Christmas movies and I hope it will be come yours as well.",
    "68": "If you have seen this movie and like it, I can think of one reason.  You have never seen the original 1947 version.  Both this one and the 1973 made-for-tv version remove all the real feeling of magic from the story. I know Valentine Davies would be sorely disappointed.  Sorry to be a grinch, but Maureen O'Hara, Edmund Gwenn, and Natalie Wood were 1000% more believable.",
    "69": "The original might be the greatest Christmas movie ever made. Any remake was going to be up against it. John Hughes' \"Miracle on 34th Street\" makes a good try but only gets so close. This movie looks great. There's one beautiful shot after another. The cast is okay, I guess. Mare Wilson and Richard Attenborough fare the best with James Remar, Jane Leeves bringing up the rear. John Hughes' script is okay too. Hughes manages to nail some scenes but a lot of the movie isn't very good. The whole thing with the evil store across the street doesn't work at all. Warts and all, this \"Miracle on 34th Street\" is worth the watch every once in a while. Honorable mention: the sign language scene. (I saw this movie in the theater (Movie World, Douglaston, NY) when it first came out.)",
    "70": "I really enjoyed this movie.  I first saw it on a bus trip back from New York City and I was hooked on Dylan McDermott.  He is a fantastic actor. I really enjoy watching him in The Practice.  Even though this movie is a remake, i think it is better than the original one. I don't mean to say that the original is bad but i tend to relate better with this one than i ever did with the original movie.  the story line was really good and it lets people know that there is hope for them.",
    "71": "It is a cute remake. Of the 1940's-1950's movie as it is set in present day 1994 when it went out.The late Richard Attenborough has in the Santa Claus role who is hired by Elizabeth Perkins there as little does she and her own six year old daughter played by Mara Wilson, he is the real thing!Like in the original movie, he is declared insane but lawyer Dylan McDermott tries to prove he is not and the late JT Walsh is the prosecutor who says he is.Cute remake but can't hold a candle to the original.",
    "72": "'Miracle on 34th Street' (1994) is a sweet holiday treat filled with warmth and plenty of holiday spirit. Although it is based on the book/1940s film, it is modernised and takes off in its own direction, and the purpose of this review is not to say that one version is better than the other; the purpose of this review is to review this version.The film engages the audience in a delightful little tale about Santa and the magic that is Christmas, with reflections upon the children. We can reflect in our own childhood when watching this film through the eyes of a child to prove that Santa does exist and what Santa is.The only downfalls of the film were some of the acting and some dullness in the story. Also, this film is made more for adults than it is for children. I think it is still enjoyable and worth a watch over Christmas.",
    "73": "In a time when it seems that every movie you watch must have sex, violence and bad language, this is a real masterpiece without any of those things.Instead it has a a fight against greed and evil, set in a whole background of the magic of Christmas and a bumpy love story.There are some real tear jerking moments in this movie, i9n particular the deaf girl vising Santa, and the marriage proposal. Your heart sinks a few times during the movie, but you are left with an overwhelming sense of happiness at the end.Laugh and cry, but more importantly enjoy.",
    "74": "This version lacks the magic of Edmund Gwen performance – but I might have forgiven it, had the very clever and original court case ending not been wastefully thrown away and replaced by pointless \"schmaltz\".I am no hater of remakes on principle (the 'reimagining' of Battlestar for example - albeit for a different age group - was exceptional) but you may as well have stripped Dickens's story of A Christmas Carol of its ghosts and instead just had Ebenezer Scrooge decide to feel a bit sorry for Bob Cratchit.It's the DVD of the 1947 original which I'll be watching with my young family this Christmas.",
    "75": "Much better that I thought it would be, but why would John Hughes choose a movie that's practically impossible to top an earlier version.The parts that I found irritating were trademark John Hughes like the drunk Santa showing his butt-crack. Still the story maintains its Christmas charm, with good performances from Richard Attenborough as Kriss Kringle and Mara Wilson as Susan Walker, but neither compare to Edmund Gwenn and Natalie Wood, respectively. I wonder how $$ Santa had in his sack to convince George Seaton, the 1947 version's director and screen-writer, to write another version of his inimitable classic There are so many other better Christmas movies out there, not to mention the 1947 version. It seems a shame that the film-makers tried to redo a true classic.",
    "76": "The acting is very good for this movie. The plot is well written. The role of Kris Kringle is perfect for Mr. Attenborough. Little Mara Wilson is a very good actress and does a fine job. There are some surprising moments, some happy moments and some twists along the way. I did not like Dylan McDermott's performance however, it seemed too contrived, just like on \"The Practice\". Kids will like this movie better than the original, as it is in colour and not 1940s style.",
    "77": "I've seen this movie on numerous occasions and although it's pleasant it's just not as good as the 1947 original, which is timeless. Maureen O'Hara and John Payne were superb in the lead roles. Richard Attenborough, for my money just wasn't quite Santa-like enough in the remake. Maybe more beard? I don't understand why anyone thought that a remake was a good idea. It's hard to do better than an original which is almost perfect already. The only thing I would say is that young Mara Wilson turned in a better performance than Natalie Wood. Dylan McDermott is also cute and was right for the role in this movie, but to be honest the performance was different but no better than John Payne's in the original. The money spent on making this film could have been better spent on something more original. They were onto a loser from the first.",
    "78": "when you believe in something or someone you love deeply enough anything is possible this is remake of a 1947 film of the same name with Richard Edinburgh playing Kris Kringle he plays his role perfectly as a being and a belief in people believing in this figure gives this man hope as he sets up a pet project as a little girl who doesn't believe in dreams and reality of Kris as 6 yr old Susan her mother lost her spirit long time ago and it rubbed off and doesn't expect any surprises on Xmas but after meeting a department store Santa who makes her believe in one so as Cole's department store is saved by a figure as he is Santa another shop decides to frame him and but Cole's out of business with Santa locked up Dylan McDermott character who is a lawyer must get the court that losing this man identity would mean the spirit of Xmas ruined forever plus he wants his step daughter a chance to love this joyous uplifting film will make us all believe as this is 1hr49mins and I give this 7/10 this is in my top 5 Xmas films of all time",
    "79": "A solid remake of a great original. For the most part, it has copied the core of its predecessor, but it fails to do it so on some levels. Some roles were successful and some did not fit into the film. Unnecessary remake.",
    "80": "To watch with the family, especially children. It tried me with some tears it's true, but it wasn't as emotional as I thought. Cute, funny, not boring, it could have been better, but I'm grateful. I want to see the original now. Thank you! Merry Christmas!",
    "81": "This version really stayed true to the 1947 classic, until the end and that was John Hughes downfall.  Mara Wilson is every bit as good as Natalie Wood, and the support charactors are good too.  But the trial strays away from the 1947 solution, and it is confusing and falls flat.Still, a wonderful family classic!",
    "82": "If it weren't so irrepressibly festive, this waste-of-time cynical cash in would probably be heralded as one of the worst films ever made. It's an insult to the emotionally intelligent sincerity of the original, a heavy-handed mysoginistic mess - but as Christmas films go? It's worth having on in the background while you're decorating the house for the holidays. Just don't pay it too much attention, check out the original.",
    "83": "I'm surprise this has such a low score on Imdb perhaps because there are no cars being blownup and huge explosions .To me this is one of the Christmas classics, (and remake of older black and white film) Miracle on 34th Street is up there with 'It's a wonderful life', 'A Christmas Carol - George C Scott version' and 'Love Actually' and a few others.Attenborough is just brilliant as Kringle and the theme is do we believe in Santa ClausThis is a lovely film , for all the family, and can be watched multiple times, particularly suited to every ChristmasGood old fashioned, feel good, happy ending story 8/10.",
    "84": "Watch the original again.I often but NOT ALWAYS like the originals a little better than the remakes. In this case I like it WAY better. One of my main problems is Mara Wilson. I can't put my finger on it but I didn't like her for the role of Susan.Other than that it just didn't have the presence the 1st film had. I'd have to re-watch it to give you more specifics and I don't intend to do that.If you haven't seen the other one I recommend you watch this one and then watch it.If you've already seen the 1947 version just walk away you will not care for this one. It might stand on it's own but it doesn't hold up in the shadow of such a classic work.",
    "85": "When I heard this was going to remade I thought well why not most holiday movies eventually get the remake treatment, but this one is brutal to watch.It has no charm and no heartwarming message like the original and all though Elizabeth Perkins is ok as the mom, Dylan McDermott is horrible as the lawyer. Mara Wilson is unwatchable as Susan and even Richard Attenborough isn't at all convincing as Chris Kingle. The original is the best by far.",
    "86": "The 1994 version of Miracle on 34th Street is a remake of the classic 1947 version. It is known to be a great movie to bring holiday cheerfulness to everyone who views it. It is about a little girl who doesn't believe in Santa Claus and then meets a white haired, jolly old man who says he is St. Nick himself. It is a very cute movie to watch with family and friends.The 1994 version goes into more depth than the old version. It also has a different ending. I'm not a fan of how the '94 version ends. I feel that it never should have been changed. This might be a spoiler for anyone who hasn't seen the '47 version, but I enjoyed how all the mail sent to Kris Kringle (Santa Claus) was dumped on the judge's desk. It was a very clear and cute ending. I feel that the newer ending is kind of unclear. All that it says is that everyone must believe in something or someone.I also don't agree with the love scene in the new version. In the old version, the director successfully got away with excluding a love scene. The attention was more toward Kris Kringle and Susan spending time together. It seems that almost every movie has a love story these days and I feel that the love scene between Dorey and Bryan is very unnecessary.If I were to recommend someone a good Christmas movie, Miracle on 34th Street would be a great choice. Except, I would recommend the original 1947 version, but they are both",
    "87": "While a good movie remake, with a fine performance by Richard Attenborough, it simply lacks the overall charm and \"presence\" of the 1947 movie, which I recommend watching instead, whether in the original black-and-white or the later colorized version.",
    "88": "This movie is best all time Christmas movie! Whether its the 1994 version with Richard Attenborough, Mara Wilson, Elizabeth Perkins and Dylan McDermott or the 1947 version with Maureen O'Hara, Natalie Wood and William Frawley, I can watch either one every year with the same emotional pull every time! \"I believe!\" Each version changes the miracle (the 1947 uses the US Post Office's innumerable letters to Santa Claus and the 1994 uses the US One Dollar bill's \"In God We Trust\"), but they both have the same effect. It's too bad Macy's didn't lend it's name to this excellent makeover, especially being the the parade is known as the \"Macy's Day Parade,\" but instead giving way to the fictitious S.F Cole store in the make over.",
    "89": "I am so happy to watch this movie 20 years after it was first released. First, i am still kicking but second, the movie has held up well. Like the first version this version seems just as timeless. For anyone who avoided the thinking the remake would not be as good. I think it's time to cast those fears away and give it a try. Much like the First, his court case is dismissed due to Federal Government's benignly coming to the rescue. Unlike the post office (which we know today would not send Santa Mail to the court) a perhaps better escape comes in with \"In God We Trust\" on a dollar bill... But in another 20 years this too may be something of the past considering the direction we are heading.Some scenes like the wanna-be Santa and the doctor needing a new x ray machine are missing and the tangible proof of the Cane are gone (shame since this cane was so ornate). But all in all, I found I could watch both the old and new back to back and still enjoy them both.Mara Wilson (Susan) take the spotlight just a Natalie Wood did in the first release. What is strange is her name in the credits and here on IMDb... 10th down the list here on IMDb and hard to find in the film's Cast List.... Seems the Hollywood People were to vein to give her a higher billing.... Shame... but that's Hollywood - Actors - Phhhh - almost all the same.",
    "90": "The cast does have a lot of actors that I've enjoyed immensely over the years and I am not trying to denigrate anyone's performance; But, as classics go, this isn't it. Even the Ed Wynn TV movie from the 50s received higher ratings.If you've never seen any version of \"Miracle on 34th Street\" you MUST see the 1947 issue starring Maureen O'Hara, John Payne, Edmund Gwenn and little Natalie Wood. Then, you can skip all the others. Not because they are all that bad; But, because they are not the classic.",
    "91": "I was skeptical.  I love the original 1947 Miracle on 34th Street.  It's a movie I must see every christmas.  I watched this and while it was a very nice remake, and an excellent cast, the original is still the best.  I think what really disappointed me about this one is the judge's ruling.  I realize that the original ruling is no longer relevant, but still it was such a major climax for the original film, that this remake left me asking \"That's it? That's his ruling?\"This movie stands better on its own apart from the 1947 original than it does as a remake of the original.  Go see this movie, enjoy it, but then go see the 1947 original and enjoy it so much more.",
    "92": "This is A Wonderful Movie. Greatly Underated. A Very Rare Movie For The 90s. Most Movies From 70s 80s 90s And Up To Now Have A Bad Message Or Have Bad Language Or Have Nudity. But Not This Fllm It Has A Great Message Of Honesty Faith Doing Good To Others. And In This Movie Mostly Every One Haves Good\nCharacter. I Burst Into Tears Every Time I see it especially when judge Harper says. By a similar demonstration of the collective faith of its people can accept and acknowledge that Santa Claus does exist and he exists in the person of kriss kringle case demised. And then it shows the crowd in the street cheering. I just have tears streaming out\nThis Is One Of My Favourite Christmas Movie Right Under Its A Wonderful Life. Now I really Like The 1947 Version But this is much better.",
    "93": "Overall, an enjoyable Christmas movie. As long as you set reality aside and admit that most of the world does not live in a city like Manhattan, New York or a lavish, Fully furnished, palashal estate. Merry Christmas.",
    "94": "I have seen some bad remakes in my time but Miracle on 34th Street (1994) is the worst. The story line drifted from the original but there was not enough information to support the changes. This was one remake too many.",
    "95": "It's an almost thankless task to remake a beloved classic, and the entire production tries mightily. The actors, production, photography, etc. are all very good. Unfortunately, the pure magic of the original isn't here. This is a movie; the original was an emotional event. There's no Macy's, so the reality of the times is missing; they \"updated\" the characters' names to Dorey and Bryan (Doris and Fred are too 1940's), and as good as he is, Richard Attenborough doesn't twinkle like Edmund Gwenn. This is a good picture if you haven't seen the first one.",
    "96": "There's no doubt about it this movie is definitely a Christmas classic. It's fun to see a real life Santa, especially in the real world with a court case, skeptics, and drunk Santa fakes. Just about\neverything in this movie is perfection, but I only have one qualm.I'm sure for its time it was perfectly acceptable, but looking at it now, the love story is atrocious. The woman makes it very clear that she's not interested in the man, he proposes to her anyway, she says no so he gets mad at her for not feeling the same way. Then somehow they end up together at the end of the film? What!? Certainly explains why some \"nice guys\" feel so entitled to relationships.Again, minor flaws with the movie. Overall it was a fun holiday movie, and I'll surely watch it in Christmases to come. I just know that every time I do, the Love story will forever bother me.",
    "97": "I see a lot of very negative reviews from those who've seen the original. All remakes come under extreme examination which often leads to unfair comparison. This is a good Christmas film, not as good as the original, which is a shame, but no doubt more relevant to an audience unsuited to watch a 1947 black and white film. I understand the desire to change Doris and Fred's names, I understand the urge to give the film a bit more edge than was needed in 1947. What I don't understand is the decision to change a logical and clever resolution to the trial to such a vague and unsatisfying one. Another example of religion spoiling the meaning of Christmas?",
    "98": "This 1994 Attenborough-Perkins-McDermott re-make is a mixed bag, but overall I like it. I look forward to seeing it every year.PROS:1 - Mara Wilson very nicely plays the part of little Susan, a child old-beyond-her-years.2 - Attenborough is thoroughly touching as a Santa burdened by the troubles of the world, but soldiering on. His set scenes (e.g., with Perkins, and the little deaf girl) are quite moving. He trumps Gwenn here, but this is a post-modern interpretation, and may not appeal to those expecting a traditional, but less deep, interpretation. Edmund Gwenn really set the standard for Santa as a holly, jolly elf.3 - I like the more heavily-emphasized \"romantic comedy\" aspects. Perkins and McDermott make an attractive couple. (But sometimes Perkins is a little too jaded. Showing a bit more vulnerability under her facade of toughness would have helped in one or two scenes.) But overall, as a man and woman who are destined to be together, I thought they worked well.CONS:1 - The \"evil business man\" is very disconnected from the plot, overly dramatic, and clichéd. He is the \"devil\" here, but none of the key characters knows that. 2 - The trap set for Kris is a little too realistic.3 - The outed Santa is a little too evil.4 - Jane Leeves is practically missing on screen. 5 - I don't like Santa movies that mix references to the Legendary Figures with Church history. Pick one explanation and stick with it. And since this is supposedly a more adult version of the tale, the references to the Legendary Figures and magic really strike a dissonant note.I imagine that the early script meetings for this remake focused on \"modernizing\" the key conflict and pushing the \"rom-com\" aspects. In that regard, they succeeded quite well. But in so doing, they lost some of the sappy heart of the Gwenn-O'Hara-Payne version.The 1947 Gwenn-O'Hara-Payne version is relentlessly upbeat and comedic, with just a few downbeats to establish a little bit of conflict and dramatic tension.This 1994 version adds more (and deeper) down notes. I find the result interesting and more mature. It is enjoyable but not quite fully satisfying. And I suspect it won't be everyone's cup of tea.6/10",
    "99": "I was a little surprised when I watched the film this year because I had heard that it was a kind of comedy film. But I wouldn't say it is that funny what I expected (I also don't expect it to be funny)\nThat's why I was first a little disappointed about the film. It started charming and calming, however, where was the comedy? And then I found out that it was about much more than only comedy. It is the story about a love, the deep love on Christmas and the Christmas father and the belief in him. The part of Mr Kris Kringle (with K, ;) ) underlines a natural picture of the Christmas father we know and he has a heart for children. For example, the little Susan whose part as a clever, happy girl is simply enchanting.\nThis is the amusing part of the story.\nThen, there are the opponents of Kringle, who meanwhile works in a department store as Santa Claus. But even in process he can maintain his charm and trust in the help of Susan.\nI can't say if the remake is better than the original film from the 1940s as some reviewers have claimed. But I like the film, it is not a comedy film but still amusing.\n;)",
    "100": "I liked this movie because it takes place at my favorite time of the year. Christmas. But also it has great costumes, actors, and acting. Although there were some parts I didn't like but overall it was a great movie,funny and entertaining, and also really cool. Especially the ending. The parts that I like was the parade, the part when Brian, Dorey, and Elizabeth have their Thanksgiving dinner and when they are at the trial and Elizabeth comes up to the jude with a card and a dollar in it. I just thought that was sweet. But what I thought was funny was when she makes a face at the prosecuter,when she does that my mom and I just laugh. Because we both just love that part but we really hate it when MR. Kringle gets framed and put into a mental institution. But all turns out well.",
    "101": "I never realized this was the third remake. The original was 1947. Subsequent remakes in 1959, 1973, 1994. I'd say it's about time for another remake. Or past time for a remake.",
    "102": "The story is simple, but this movie is about the love and the belief in the magic of Christmas. The movie has the most charismatic Santa and will be one of the best Christmas movies forever.",
    "103": "To give the movie its deserved credit, Richard Attenborough is a wonderful successor to the iconic Kris Kingle as played by Edmund Gwenn in George Seaton's seminal Christmas classic \"Miracle on 34th Street\" and Mara Wilson is just as good as the little girl who doesn't believe in Santa but wishes she could and only asks for a proof. In fact, she embodies our very attitude toward the film, we love the original, we want to embrace this one with the same enthusiasm, so we're waiting for the script to charm us.And it's only fair to have high anticipations, the film was made in 1994 when commercialism was as preeminent as five decades later, and written by John Hughes who could give a subtle dimension of satire and benign cynicism, all these elements could have given an edge to the 1994 remake. Unfortunately, the film doesn't really manages to deliver: when it's good, it's just as good as the original, the rest of the time, it's just a pale copy that fails to capture the the taste of its era. This film could have been made in the 80's or the 70's as well because the story is timeless, but not in the 'appealing' meaning of the word.It's incredible but \"Miracle on 34th Street\" manages to feel more dated than its glorious predecessor, the 1947 version starring Edmund Gwenn, Maureen O'Hara and young Natalie Wood. Maybe the remake was liable to feel dated because the 1947 classic was already ahead of its time for its take on Christmas consumerism, its portrayal of a divorced mother and a precocious girl (tired tropes today), so any attempt to duplicate the charm of the movie was likely to fail... unless it tried to modernize the original premise a little bit.The problem with Les Mayfield's movie and John Hughes' screenplay is that the two men seem to be in awe with the original and never really dare to make the original structure shatter, not a bit. As a result, we have quite exactly the same movie, and the changes operated in this one never feel as improvements but rather inspire the opposite feeling. For instance, the climactic trial scene with the bags of mail delivered on the courtroom is only replaced by a parallel drawn between the existence of Santa Claus and the faith in God which, as smart as it is, is anticlimactic and leaves many things in wanting.We all know the story is heading toward a heart-warming and magical conclusion but there's just something curiously depressing in the turn of events that lead the gentle Kris Kingle in jail and the way his aura immediately fades while the set-up of his downfall is quite obvious. There was a moment where I expectedKingle to tell that the man he assaulted had just literally accused him of the worst possible crime and had the punch coming, but the scene dangerously flirts with the idiotic plot where the lines that can get you off the hook aren't said, for no other reason that they're waiting for the right moment. I feel a bit guilty to be so judgmental, again there's that snow beard in Richard Attenborough and that glee in his eyes that makes many scenes with him very touching, I loved his interaction with the deaf girl (a smart remake of the Dutch scene), his chemistry with Mara Wilson hit the right chord, and that little girl is a genuinely good actress conveying the right mix of smartness and innocence (a bit like a real-life Lisa Simpson). But the film reminded me of that scene where Kingle and Bryan, the lawyer enamored with Susan's mother, and played by Dylan McDermott, discuss about the mother (Elizabeth Perkins) and say there's something quite sad about her.There's something sad in the film as well, sometimes, Elizabeth Perkins overplay that feeling and make any scene she's in a killjoy, even her romance with Dylan, while integral to the original happy ending, are only inserted in the movie as an 'obligation' but it's obvious these moments slow down the script more than anything. There are a few good characters in the film, the judge played by a scene-stealing Robert Prosky, the so underrated J.T. Walsh as the prosecutor but the film loses its way in many unnecessary plot points, and escalate to a trial where we feel cheated because we didn't have our bags of mail, after all, there was no Internet yet in 1994, it could work.The film is still an enchanting moment that can please any child of any age, but it lacks that little sharpness, the taste of modernity it needed, and luck, too. Macy's didn't want its name associated with the film so they had to come up with a fictional company had to invent a and make the rival an evil businessman, missing the opportunity of the 'marketing policy' subplot that made the first film so ahead of its time. It's like Mayfield and Hughes didn't trust their own material, they had so charming protagonists who could carry the film alone, who needed villains? Especially when the \"system\" or the world's cynicism was good enough an antagonist. A good film nonetheless, but so one-dimensional in its treatment it feels dated by the original film's standards.",
    "104": "Richard Attenborough returned to acting after 14 years behind the camera in \"Jurassic Park\", and followed it swiftly by daring to challenge comparison with Oscar-winner Edmund Gwenn in this remake. As a heartwarmer for those inadequates who won't sit through a 60-year-old monochrome movie-- albeit one which rivals \"It's a Wonderful Life\" as Hollywood's answer to \"A Christmas Carol\"-- this John Hughes revamp will probably serve. Anyhow, there are plenty of copies on sale at the checkout of my local supermarket. But it is a bit too laid-back and, latterly, too bogged down in argument for younger kids or older boys. It may warm more cockles among the grandparents.The main thematic interest is how Hughes chooses to tweak the original screen story as adapted (unusually for the time) by the director, George Seaton. Whether he sought to or not, the remake has thrown up some intriguing twists for a more skeptical and secular time.The oldie caught the mood of an America yearning to get back to normalcy amid the perils of the post-war, Cold War world. Location shooting in New York City, with much co-operation from Macys, gave a touch of realism to the fantasy, whereas in 1994 it's an imaginary store and (for Americans, at least) an incongruously \"veddy British\" claimant to the chair of Santa Claus- although his nationality is not the issue when the legal meanies of the State of New York try to get him confined to the bughouse.What is striking is the judge's rationale for allowing Kris's plea for freedom. Because US bills have \"In God We Trust\" on them, he reasons, it means New York is allowed to have blind faith in the existence of a supernatural being who lays presents on 1.7 billion children in one night, operating from invisible workshops with reindeer which cannot be made to fly in a courtroom demonstration of his powers because it isn't Christmas Eve. Besides, the sneery prosecutor's kids were raised to believe in him, so there- case closed.In real life the ACLU would be appealing such a judgement all the way to the Supreme Court for allowing too much religion into the law and the public square. \"In God We Trust\" was only put on the money during the Cold War, to cock a snook at \"Godless bolshevism\"; but this film is refreshingly disrespectful to the newer orthodoxy of playing down most Americans' beliefs in their films.Kris asks if he should swear in the Bible, the Pope's ruling on Nicholas's sanctity is debated, and the ethos is quietly but unmistakably Christian. No \"spiritual\" Santa or \"Happy Holidays\" here. In a very light fashion, the film does revolve issues of how far it is legitimate to maintain a metaphor as a source of inspiration when rationalism of the Dawkins and Hitchens strain is sniping at it. The screenplay also looks quite beadily at the way commercial operators use holy myth to make money, even if the message comes muted from Hollywood.That is the good news. There's plenty to carp at as well.Attenborough's quiet, gentle but firm performance (most atypical of one who spent his previous acting time mainly playing unreliables or martinets) suffuses the film. He gets little competition, save from the contrasted crustiness of Windom. Most of the support is so-so, on the level of a Yuletide TV special, and not excluding little Wilson as the girl who has faith in Mr Kringle's claim to be St Nicholas. She is no Margaret O'Brien, if no worse in her way than the kewpie-doll Natalie Wood. In fact, she's a John Hughes moppet who did little later and nothing since 2000.The narrative's departures from the well shaped original are no help. Once off the legal hook, Kris, wearing a brown suit, just disappears-- we don't see any triumphal sleigh ride to bid him adieu-- while attention shifts to a ridiculous post-midnight-mass impromptu wedding in a Catholic church. Then follows a trip out to a dream house in the snowy country, ushered by a silly salesman. The film does not seem to know when to call a halt, and there's not so much as Clarence's tinkling bell to bring back Kris at the close. It's as if the whole object of the exercise was to unite two bland characters in matrimony.",
    "105": "Dorey Walker (Elizabeth Perkins) is the producer of the Christmas parade for Cole's department store. Kris Kringle (Richard Attenborough) is shocked at the drunken Santa in the parade. Dorey quickly puts Kris Kringle in to replace the drunk. Her daughter Susan (Mara Wilson) doesn't believe in Santa because her mother explained it all to her. Bryan Bedford (Dylan McDermott) is Dorey's boyfriend. Dorey hires Kris Kringle as the store's Santa who becomes popular for recommending shoppers to other stores. Susan is taken with the new Santa and starts to believe that he's the real deal. There is a rival store Shopper's Express which tries to sabotage Kris Kringle by getting him arrested.There is the great Richard Attenborough and a cute little girl. There is nothing wrong with the acting. The script is a little dated. Some of the simpler elements seem charming in the original but seem naive in the modern version. This one has very little to offer other than Attenborough. Also for some reason, they got rid of the post office plot line. The mailbags piled into the courtroom is probably the most compelling scene in the original.",
    "106": "On a normal level of cinema, this film is only mediocre. Where it fails is that it is a terrible remake of a well-known, well-loved film. And even worse for this film, it's a lousy remake of a well-known, well-loved film that just happens to be my favorite Christmas film of all time.It has a few positives. All right, it has one positive, and that is Richard Attenborough. He brings a genuine delight to the role of Saint Nick, and it is not hard to believe this guy could be the genuine article. Unfortunately, his performance highlights the lousy performances of many of the principles.Dorey Walker is played by Elizabeth Perkins with none of the sympathy given to her by Maureen O'Hara. It's impossible to even dream of her getting married to anyone. Some of this is to be blamed on the script, though, which spends so much time establishing Dorey's cold heart that it forgets she's supposed to be getting our sympathy, not our scorn. Which brings us to the flat performance of Dylan McDermott. He could be replaced with a cardboard cut-out without affecting the flow of the movie. Then we have Mara Wilson. She tends to be more snobby and over-confident than confused, but Wilson is up against Natalie Wood. To be fair, we never get to see Wilson chattering like a monkey for comparison purposes. That delightful scene was excised from the modern version.A rather ridiculous subplot has been added to this remake with a rival store, Shopper's Express, trying to put Cole's out of business (Macy's refused to have their name put in the film). It is headed by the popular 90's villain of choice, the Greedy Evil Mean CEO, Victor Landbergh. He doesn't play much of a role, yet he is supposed to be the encompassing bad guy, evoking images of Lex Luthor plotting the demise of Superman. He even has his own flunkies who attempt to sabotage the department store, skittering around almost like Boris and Natasha. This subplot tends to weigh down on the film, feeling forced in rather than meshing with the film. The pompous psychiatrist of the original works because it was simply one guy with a chip on his shoulder instead of a wicked retail overlord. The former is funny, while the latter is overkill.Actually, that addresses another problem with this film - it takes its subject matter far too seriously. The original film was an enjoyable farce. This one is a somber story, filled with the right glurgy turns to renew our souls or something. Basically, it's way too serious considering the subject matter (an old guy who thinks he's really Santa Claus.) The original had some laugh out loud moments of sharp humor - this one instead attempts to force you to shed tears of sadness and joy. It usually just shed tears of boredom from me.The court decision at the end of the film is not only anti-climactic, but doesn't really address the actual issue - Kris is on trial for lunacy. The only decision to save him is to prove he's REALLY Santa Claus, thus making him sane. This movie can't seem to make up its mind why he's on trial and its ultimate answer for Kris obvious acquittal would fall upon under the lightest of legal scrutiny, where the original film made a compelling legal argument. I can't answer that, but I will say that this film's answer is far off the mark. Please, I beg of you-if you have NOT seen the 1947 Black and White original, then please correct that. This is not an adequate substitute to a film that didn't need one in the first place. They even colorized the old one, so if you hate black and white, then you still have a color option without wasting your time on this.",
    "107": "Few things are more amusing that reading the comments from the crybaby dishrags who whine about remaking a classic like \"Miracle On 34th Street\" (1947). How are these weepy rants helpful? Did it need to be remade? No. But the source material is good enough that any number of professionally done remakes would still be entertaining. If this 1994 version had been the original, people would already be crowning it with the classic tag.But it is not the original. It strikes a decent compromise by keeping many of the original story elements, deleting some, updating others, and making a few generally ill-advised additions. There are even some clear improvements. Elizabeth Perkins and Mara Wilson are a much better mother and daughter match than Natalie Wood and Maureen O'Hara. There is a real chemistry between them and the producers appear to have grasped this connection. This \"Miracle\" is told much more from their respective points of view and in that sense is much more their story than in the original. Wilson brings a focus and intensity to her roles that few child actors can match. She gave a similar performance the next year in Matilda. Perkins is one of those actresses you don't really notice at first, memorable in \"Big\" and \"Speak\" for performances filled with subtle nuances.It is no surprise that Richard Attenborough falls short of the Edmund Gwenn standard but that was Gwenn's signature role; and as much a part of cinema history as Gregory Peck's Atticus Finch. But look for the sequence where Wilson pulls his beard and discovers it is real-this is one of the great all-time scenes.As long as Perkins and/or Wilson are being featured, the film works quite well. And it really only stumbles seriously during the courtroom scene and during the subplot elements featuring James Remar and Jane Leeves. The film staggers along a bit but recovers itself in time for an original and very effective conclusion. As Roger Ebbert said, while it will never replace the original; this is a sweet, gentle, good-hearted film that stays true to the spirit of the original and doesn't try to make everything slick and exploitative. Then again, what do I know? I'm only a child.",
    "108": "This remake is for me one of the better remakes out there, but it lacks the charm, magic and heart of the original, which I consider one of the best Christmas movies of all time for several reasons(Edmund Gwenn's performance being a pivotal one).So what were the film's flaws? Well while I thought the last act was very well done and strong, the first act especially is rather juvenile and is hard to get into. The script lacks sparkle and could have done with more sophistication, and I found Dylan McDermott rather flat as Bryan Bedford.However, it is beautifully filmed, perhaps looking a little more slicker than the original, and the score is sweet. The direction is good on the whole, while with the exception of McDermott the acting is fine. As Kris Kringle, Richard Attenborough positively twinkles and is easily the best actor in the film(though I still prefer Edmund Gwenn), and Mara Wilson, a very talented child actress, is undoubtedly charming as Susan. Elizabeth Perkins also gives a good performance as the somewhat cold-hearted yet sympathetic Dorey Walker.Overall, a decent remake but lacks the sparkle of the original. 7/10 Bethany Cox",
    "109": "I haven't yet seen the original Miracle On 34th Street film, so until then I'll focus on Les Mayfield's pristine 1994 update. It's a warmhearted delight of a piece, painted in bold, kindly strokes and starring Richard Attenborough in a wonderful, childlike, good natured yet vulnerable performance as Kris Kringle, and elderly gent living in New York City who is convinced that he is really Father Christmas. Like.. for real. Little Susan Walker (Mara Wilson) believes and befriends him. Wilson was a child actress staple in the 90's, also making adorable impressions in Matilda and Mrs. Doubtfire. She's precious here, full of wonder and blooming compassion that's kindled by spirited Kringle. Her mother (Elizabeth Perkins) is in charge of the Macy's Christmas parade and when the drunken Santa she's hired acts a damn fool and is fired, Kringle steps up to the plate. He's a hit, and when word gets out of his belief in himself as the real Santa, controversy stirs, in trademark obnoxious New York fashion. And so a media hooplah leads to a hysterical court case to prove whether Kringle is the real deal. He's defended by compassionate lawyer Dylan McDermott and prosecuted by a smarmy J.T. Walsh, always welcome. There's also work from James Remar as corrupt hoodlum Jack Duff who has a hilarious turn of faith near the end, Robert Prosky as New York's crankiest judg, and appearances from Jennifer Morrison, Jane Leeves, Allison Janney, Mary Mckormack, Jack Mcgee and Joss Ackland. The film comes out a winner thanks to Wilson and especially Attenborough, who plays Kringle with a frank naivety and beaming soul, qualities which everyone hopes and expects to see in Father Christmas, should he really be out there somewhere.",
    "110": "No. Simply...no. This is was wrong, so wrong, in so many way. Dull, overacted by everyone but Attenborough. A miserable and mean DA and bitter \"tension\" that really doesn't belong in this movie. Telegraphed acting and sloppy writing (please stop telling us what is going to happen!)..and it ends with a golf ball from Cartier?? And bonuses. And an expensive new house...\"they can afford it now\"?? It *was* all about the money.. Tasteless..Awful, awful awful - No whimsy. No fun...nothing as simple and heartwarming as watching the little Dutch girl from the fabulous 1947 original—geez, I just hated every moment of it. Yes, this is modern. Yes, it has color. Yes, it's made by *your* generation for *your* kids. So is Velveeta.",
    "111": "I remember when I first saw this version of the classic Christmas film, I kind of resented it because there didn't seem to be any logical reason to remake this story, since it was relatively timeless. However, over time I warmed up to the modern Miracle on 34th Street, and I think I rate them about the same. One of the biggest reasons that this film works so well is the cast. For starters, Richard Attenborough is delightful as Kris Kringle. He has a magical air to his performance that feels like he is perfectly embodying this benevolent spirit of Santa Claus. Likewise, Mara Wilson is the perfect precocious little girl. She is able to play both the over-serious child her mother made her, and then seamlessly transition into the joyous child who is free to believe in miracles. Elizabeth Perkins plays the loving mother who also might be a bit too serious for her daughter's good, and Dylan McDermott is great as the fun-loving friend who can also become a decent lawyer when needed.The other thing that I've always said is necessary to make a good remake is to bring something new or different to the story. This is because, if you're going to just make the same film what is the point? Well, I'm not sure if Miracle on 34th Street quite follows through on that aspect, so I should hate it. There are some tweaks, though. For instance, I appreciated that they dropped a few of the extraneous characters from the original film, and developed the relationship between the romantic leads a bit more. Since the courtroom stuff in both films is ludicrous, I like that this version presses it even further as they explore how the prosecutor would try to prove the impossibility of Santa Claus' existence. And I think this movie makes an interesting choice in the way it changes up the ending. I totally understand people who are purists and say that the 1947 Miracle on 34th Street is all they need. However, I find just enough to like about this 1994 film that I'll gladly watch either at Christmastime.",
    "112": "\"Miracle On 34th Street\" (1994) faithfully follows the 1947 version of this holiday film, but with a few subtle twists. And for that, we have the late John Hughes to thank. Like many holiday themed films infused with the \"Hughes touch,\" the soulful, joyous spirit of this reboot is just as important as the cinematography.There will never really be a movie to replace the original 1947 \"Miracle on 34th Street,\" nor a cast to overshadow the charming performances of its legendary stars, Edmund Gwenn, Maureen O' Hara, Natalie Wood and John Payne. The 1947 original Film won three Academy Awards. Gwenn's heartfelt performance as Santa easily helped him bag Best Actor in a Supporting Role, Valentine Davies for Best Writing, Original Story, and George Seaton for Best Writing, Screenplay. Additionally, the 1947 version was nominated for Best Picture, surprisingly losing out to the controversial film, Gentlemen's Agreement.Nevertheless, \"Miracle On 34th Street\" (1994) features incredibly sensitive performances from its cast of stars. It's a sterling lineup of talent: Richard Attenborough as Kris Kringle himself, Elizabeth Perkins as Dorey Walker, the beautiful, workaholic, beleaguered single mother, and Mara Wilson as Susan Walker, Dorey's delightfully precocious daughter. The entire cast turn in magnificent performances, worthy of this remake, but more so, because they make their characters believable. And we DO want to believe, don't we?Like the original, the 1994 story takes place between Thanksgiving Day and Christmas Day and focuses on the premise that a lovable, irascible old guy who is employed as a department store Santa Claus adamantly claims to be the real guy. Saint Nicholas, Sinterklaas, Kris Kringle, Père Noël, Santa Claus!Yes, the times may have changed since 1947, but the big heart of this remake remains faithful to the spirit of the original masterpiece, both in body and soul.For those wonderful reviewers that may have hastily reviewed this film and mistakenly offered a lower than deserved rating, I say, \"It's not too late to watch this transcending movie again, and perhaps, just maybe, change your rating.\"After all, even Ebenezer Scrooge eventually came to his senses, albeit belatedly. But he was better for it in the end.",
    "113": "I use this movie every year to kick off the holiday movie watching season. It gives a preview of the Christmas season and what's its all about.While the original Miracle on 34th street is a classic, its very, very dated. I actually prefer to watch this updated version. I wouldn't change a thing except Elizabeth Perkins. She didn't quite fit the part. It's also a pleasure to listen to the symphonic score soundtrack. Bruce Broughton did a wonderful job catching the emotions and feelings of both the actors and season.Some would argue that this movie should have never been made. I say shame on you. There is always room for the re-telling of classic stories. While this movie isn't perfect, it still catches the spirit of the original and simply finds a different path to the end. It will always be part of my Christmas season movie list.",
    "114": "A friendly but dubious old man is walking on the street when he sees a parade Santa Claus trying to do his job while drunk off his ass. As the real Santa Claus the man (Kris Kringle) steps in and summons the police  but finds himself escorted away. However, when the drunk can't do his job, Kris steps in and is so good that he is offered the job of store Santa by Cole's toy store. Taking the job, Kris is in his element but cannot convince his boss's daughter that he is the real deal. Things get worse when a rival store, so worried by the business Kris is drawing to Cole's, set out to set him up and taking him to court to get sectioned. Can Kris prove he is Santa, not only to Susan but also to New York State.It is a weakness of Christmas TV that so many interesting movies are wheeled out on so many channels that, in late January, I'm watching a movie that never really sees the light of day outside of the month before Christmas. Anyway, when this came out I ended up going to see it at the cinema and felt that it worked as a Christmas movie but was somewhat lacking as a film. Watching it on television now it seems a lot more serviceable, feeling more suited to the small screen rather than the large. Of course you could question why anyone felt the need to remake the original film but, now they have, I suppose at least it is reasonably good. The plot starts enjoyably enough and features an enjoyable court case, it is only in the sentimental conclusion where it became an average film; up till this point it is structured enough to be enjoyable even if it is a bit \"straight\" but at the end it succumbs to the season but does it too late to really do damage.Slighter older children will enjoy it even though I felt like it could have had more of an edge for adults to appreciate as well. The cast are good, although the film noticeably drops when Attenborough is offscreen. He is an affable character and creates a sense of wonder that the film really benefits from; he is well matched by a cute but enjoyable performance from Wilson. The rest of the cast don't have it so good and Perkins and McDermott are really left with a difficult \"serious\" narrative that is only going to mush. The supporting cast has a lot of well-known faces who are interesting even if they only have minor roles; Walsh, Remar, Prosky, Janney and Ackland all provide an interesting cast even if the whole film belongs to Attenborough.Overall this is an OK film that will play well to older children as well as undemanding adults. Parts of the film are overly sentimental and devoid of the clever modern touches that it could have really had if it had not done it so \"straight\". Hardly earth shattering stuff but has enough festive cheer to do the job, partly thanks to a performance from Attenborough that adds a sense of wonder to it.",
    "115": "I enjoyed this modern-day remake of the old Christmas classic, but with some reservations. First of all, let me compliment Richard Attenborough's performance as the is-he-or-isn't-he modern-day Santa Claus, even if he plays it with an avowed English accent. He interacts sweetly with the children in the cast in particular and with a twinkle never far away from his eye, gets you rooting for him at the climactic trial scene by the end. He performs no \"miracles\" per se but still convinces you of his identity with his innocence, charm and sincerity. As for the rest of the cast, I'm not so sure. Elizabeth Perkins and Dylan McDermott as the yuppie couple bound to get together, lack warmth and seem just too perfect with their stylish clothes and coiffured hair. Worse, Mara Wilson as the little-miss-know-it-all 6-going-on 60 daughter of Perkins, really could just be a female Macauley Culkin, which was no doubt the aim but still isn't a good thing. There are some nice support turns though, especially Robert Prosky as the humane judge and JT Walsh as the persecuting counsel but they don't quite offset the main leads mentioned above. The seasonal shots of New York are a treat for the eye and with a pleasant Christmas-themed soundtrack too, this is enjoyable seasonal fare, well worth taking a break from gift-wrapping, to enjoy.",
    "116": "The 1994 remake of Miracle on 34th Street was updated by writer and producer John Hughes already flying high with his Home Alone films and he manages to snag Richard Attenborough who was coaxed out of acting retirement a year earlier by Steven Spielberg for Jurassic Park.The original is regarded as a classic in America but not as well known in the UK and here I could see this film in its own merits.Hughes has followed the story of the original film with a department store executive Dorey Walker (Elizabeth Perkins) and her young daughter Susan (Mara Wilson) who do not care much for the spirit of Christmas. Dorey hires a venerable old man Kriss Kringle (Richard Attenborough) at the last minute when the usual Santa is found drunk. Kriss quickly becomes popular even if it means by always telling the truth that he directs people to rivals stores for toys because it would be cheaper there.The store is subject to a hostile takeover from a rival and part of the shenanigans means that Kriss believes that he really is Santa Claus and finds himself in court to be declared insane.The film is a decent family drama and although updated for a more cynical age which includes more disbelievers and non-nuclear families it does have plenty of festive spirit that families would enjoy but is never spectacular.The film turns on the revelation contained on a dollar bill but personally if I had written the film I would had just told the Judge to look behind him. Most American courtrooms have the Judge sitting in front of the words 'In God we trust!'",
    "117": "I'm not sure that this really needed reimagining, but Sir Richard Attenborough was probably the best man at giving it a go when it was remade. He is \"Kris Kringle\", recruited by a struggling toy store to take part in their Christmas parade when their regular fella hits the bottle once too often. He goes down a treat and is soon in their store chatting to all the children. He has an honest streak - he tells the parents where they can shop more cheaply and that's risky for his job! His bosses see a marketing opportunity in his altruism though, and the store's profits soar. He isn't popular with everyone, however, and after a street altercation with his walking stick a his predecessor's head, he finds himself in court. He isn't charged with assault: they are trying to certify him for claiming to be - well, whom he cannot possibly be. Or can he? It's a wee bit long, this, but Sir Richard enters into the spirit of things enthusiastically. Though his accent isn't as reliable as it might be, he brings a certain mischief to the role. He is well supported by the increasingly incredulous prosecutor \"Collins\" (JT Walsh) and by Robert Prosky in the judge's chair. It's a pleasing story, well told, with some gentle humour that takes a swipe at the bah-humbug society that has long since forgotten what Christmas really ought to be about. It hasn't the charm of the 1947 version, but it's still enjoyable enough to watch at this time of year.",
    "118": "Miracle on 34th Street is a good movie with a reasonably well developed plot and a great cast. It is a very sweet, heartfelt Christmas movie on which we follow a ton of controversy erupt after a man claims to be Santa Claus. Richard Attenborough shines as Kris Kringle himself, embodying the role significantly, he is quite possibly one of the most believable of any movie Santas, feeling close to the real thing, he was just as good, if not better, than Edmund Gwenn. In comparison to the original 1947 film, it simply is not as good, even John Hughes' writing presence could not help that. The magic and the Christmas atmosphere feels a lot more forced here, as newer movies simply are less subtle about getting a message across, and everything is very in your face here. Santa Claus is also not nearly as much developed as a character here, he is well established and his personality is brought tremendously in the original, however, he is a lot more two dimensional here. I not blaming Attenborough, but the writers for only giving the character cliché Santa dialogue.It shows that remakes always try too hard to be bigger and better than the original, which is often their biggest downfall. While its certainly flawed, the Christmas spirit is alive and well here, I would recommend Miracle on 34th Street to anyone looking for a good movie for the whole family to enjoy. A man who claims he is the real Santa Claus is forced to prove it in court. Best Performance: Richard Attenborough",
    "119": "Little girls are more sophisticated than they used to be. When 6-year-old Susan Walker sees a drunken Santa Claus, for example, she takes it right in stride: \"Bombed? It's the pressure.\" Susan's mother is the PR director for Cole's, a big Manhattan department store, and so the kid knows the angles. \"This seems like a pretty pointless exercise,\" she sighs at one point, while climbing into Santa's lap. But of course her disbelief in Santa Claus will not last long, because she finds herself in a retread of \"Miracle on 34th Street,\" the 1947 classic about a department store Santa who may possibly be the genuine article. The movie has been remade by producer John Hughes and director Les Mayfield, who follow the original fairly closely, but with a quieter, more elegiac tone. As in the earlier version, this \"Miracle\" begins with a charming old gentleman who is hired on sight and pressed into service after the department store's Santa gets drunk at the start of the annual New York Thanksgiving parade. The old man says his name is Kriss Kringle (Kriss is spelled with two s's in the new version, for no good reason). Played in 1947 by Edmund Gwenn (who won the Oscar), he's portrayed this time by Richard Attenborough, whose eyes twinkle and whose beard, he proves, cannot be pulled off. There will never really be a movie to replace the 1947 \"Miracle on 34th Street,\" nor a performance to replace Edmund Gwenn's, but this modern update is a sweet, gentle, good-hearted film that stays true to the spirit of the original and doesn't try to make everything slick and exploitative. You know it's a good movie when you walk out humming the songs, and this time, it was \"Joy to the World.\"",
    "120": "Last night I watched the original Miracle on 34th Street, then the 1973 made for TV version with Sebastian Cabot. The 1973 version was a mess, with some truly head-shaking script and production decisions that simply made no sense, and I suspect were the result of cost-cutting by the producers. Cabot did fine and David Hartman, too, other than his final courtroom scene, which was atrociously bad, but the rest of the cast were either miscast or never found their roles ... possibly rushing into filming the scenes or maybe just terrible direction.This film was a MAJOR slide down the slope from even that disaster. No Macy's? The \"Cole\" Thanksgiving Day Parade? Bad start to begin with. There's no such thing and people know that. Macy's wouldn't participate in this film and I suspect it's because they saw this anathema of a script.Once again, the Santa is fine and the lawyer is okay, but EVERYONE else is a disaster, from the evil rival store owner to the cold, heartless Mrs. Walker, whose first name was AGAIN changed. Why??And yes, they changed the lawyer's name, too. Why??In the original, Maureen O'Hara plays Walker as a sensible \"modern woman\", but with warmth. Elizabeth Perkins' version of Walker is a post-NOW \"modern woman\" who is not only cold, but mean spirited. When the lawyer proposes marriage and she tells him, with ice in her voice, that he's \"a fool\", I was done with this travesty.The addition of the \"evil rival chain\" does nothing for this story. In the original, Macy's and Gimbal's are at least friendly rivals, and let's remember this is a SANTA STORY which should be aimed predominantly at kids. The 1973 version lost that thread with vodka in the morning, and this one loses it with a complicated business plot which makes little sense and gives us too many \"bad guys\".James Remar and his female sidekick offer nothing to the story. They don't even bring a real sense of foreboding.Billed as a comedy, in watching the first half of this film, there was NOTHING even remotely close to giving me a smile, much less a laugh.This is what happens when lesser talents try to leech the brilliance of original writers and creators. They have no chance to improve on the original, and each misstep does nothing but corrupt what made the original a multi-generational success. Shame on Siskel and Ebert for originally approving this disaster. They got it very, very wrong ... which happened more often than you'd think.",
    "121": "This film is the ultimate Christmas film and granted to put you deep into the Christmas spirit, as you ask yourself whether or not you believe in Santa Clause. The story-line deals with the belief in Santa Claus, but it is handled very well, so there is no danger that your kids will stop believing in Santa Claus after watching this movie, I would say just the opposite. It is so well written that the story is believable without the need for magic or hocus pocus. It is a remake of the classic film but with brilliant actors such as Richard Attenborough as Kris Kringle. When Dorey Walker (Elizabeth Perkins) hires a seemingly insignificant elderly gentleman (Kris Kringle) to be their Cole's Santa she has no idea of the success it would bring Cole's. Just as every thing in life is peachy, Cole's rivals decide to discredit Santa by framing him. When it goes to court to decide weather Kris Kringle is a nut case as he believes he is Santa it is up to the judge to decide if Santa Clause is real, challenging all that is good and pure about Christmas.There are scenes that make you laugh, and scenes where tissues are needed. Romantic sparks also fly across the screen, which is an added bonus. I know the acting is contrived and the actors merely walk-through the film, but that doesn't matter. I think the director wanted the film to resemble a remake of the original with the idea of the classic American feel. The guy is far too good looking and the woman always glamorously made up, which adds this massive dollop of American schmaltz to the proceedings. The only things that stood out were an Elizabeth Perkins's performance, she was great in the role of a mother, and Richard Attenborough plays the part of Chris Kringle so well, it's like he was made for the part! Overall, though a great story-line based on the original film, lots of magical moments. A great family film.Overall rating: 7 out of 10.",
    "122": "Hughes script fails to capture the magic and heart of the original Miracle on 34th St. Attenborough does an alright job here, and I think the little girl in this is better (in the original the child always looked angry), but everyone else in this film feels miscast. The romance between the mother and neighbor feels forced, awkward, but more importantly unbelievable. There's hardly any Christmas magic to be enjoyed because the screenplay spends too much time focussing on Cole's almost going under, and the schemey cartoon villains of Shopping Express or whatever cheesey name they assigned the competitor. In the original film there's more emphasis on building relationships and growing as individuals, and the court scene was pure genius. Here it's all slap dash, thrown together in a really lazy way. I don't get why some people love this movie. I honestly think it's because they've not taken time to view the original, which is a damn shame.This movie is Hallmark bad.4 stars go to the actors who actually did ok, too bad it's not enough to make this a classic.",
    "123": "Miracle on 34th Street is a movie fit for anyone who has become jaded and cynical over the years. It encompasses everything that makes the Christmas season beautiful and fun including the parade after Thanksgiving many look forward to, characters with an overflowing amount Christmas spirit, as well as the incredulous characters that are always present in Christmas movies. The film shares the plot of the 1947 classic, Miracle on 34th Street, however the director, Les Mayfield, incorporates a few differences to fit more modern times. The movie's beginning scenes take place at the Cole's Thanksgiving Day Parade. In the film, Cole's has replaced Macy's on New York's 34th Street. It opens with white-bearded Kriss Kringle scolding an intoxicated man who was hired to portray Santa Claus in the parade. When the drunk makes a complete fool of himself, the Cole's parade director, Dorey Walker, approaches Kriss Kringle and asks that he take on the role of Santa Claus, not only for the parade, but also for Cole's department store. Miracle on 34th Street conveys an important message to every viewer, that there is a hope for skeptics that have lost all hope in magic and miracles. Kriss Kringle is not just a man in a red suit sitting in the middle of a department store, he is a symbol of all that is good about Christmas.The film argues that if people no longer have any faith in Santa Claus and all he represents, then the world has become a sad, hopeless place. Dorey Walker, and her daughter Susan, are non- believers. The mother and daughter are both very practical, and to them, Santa Claus is nothing more than a myth. Susan even says talking to Santa in Cole's is, \"a pointless exercise\" due to her disbelief. Because of their lack of faith, the Christmas season is extremely bleak for the two of them. Bryan Bedford, a lawyer and the Walkers' neighbor, teams up with Kriss Kringle to teach the Walkers about the spirit of Christmas.One of the most memorable events throughout the whole film occurs when Kriss Kringle is declared insane after allegedly beating another man with his cane. These events tug at your heartstrings, and will have you rooting for Kriss to beat the evil guys. Kringle experiences a trial that would ultimately determine his future. Bryan Bedford fights with Kringle to prove his innocence and his true identity. During this portion of the movie, Bedford calls upon many witnesses, one of them being a child around the age of six. Bedford questions the child of Kringle's authenticity. The young witness, Daniel, then states that he believes Kriss is the one and only Santa Claus. When asked how he can be sure Daniel says, \"Cause he looks like Santa Claus. Oh, and he's very nice.\"Although the plots between the 1947 and the 1994 versions are extremely similar, the director, Les Mayfield, made a significant change in the script in how Bedford chooses to verify Kriss' identity. In the 1947 version, Kriss Kringle is identified through the post office forwarding all of Santa's mail to Kringle's home. However, in the remake, Bedford uses brilliant logic on Kriss' behalf. He utilizes a $1 bill and the phrase \"In God We Trust\" to validate Kringle's identity. Bedford uses the expression \"In God We Trust\" to signify that it is socially acceptable to put your faith in something that you can neither see nor physically touch.Casting for 1994's Miracle on 34th Street varies from brilliant to unsatisfying. Richard Attenborough's excellent portrayal of Kriss Kringle recollects Edmund Gwenn's Oscar-winning performance without copying it. Young Mara Wilson performs as a captivating character who grabs hold of your heart and doesn't let go. However, Elizabeth Perkins and Dylan McDermott, who portray Dorey Walker and Bryan Bedford, pale in comparison to the 1947 edition's Maureen O'Hara and John Payne (\"Internet Movie Database\"). Les Mayfield, the director of the 1994 classic, took on an almost impossible challenge when he decided to remake the beloved 1947 film. The original had set standards for every Christmas movie created afterward. This modern update is a charming, compassionate, sweet movie that stays true to the spirit of the original. It captures the true meaning of the Christmas season, and remains an outstanding family feature even today. The movie itself is nostalgic, sweet, and manipulative, which makes it so easy to love.",
    "124": "Don't, please.I said, don't! You are too late bla bla blaa!It's never too late!And I'm glad because I watched now!I wouldn't feel that before, as I felt now!So, I got chance to see many many in last time,\nI've seen and many many old ones,\nbut haven't seen something like this one! (And don't, please don't tell me about original, I ain't youu Scroogiesssss who compare just so you could have trash talk about..) so as I said. It's.. it's miracle!It really is! Story is beautiful!Actors/Actresses, as born for their roles!It was like when you go in shooping and you chose wise, check all before you.. well they done it here!Tim is my favorite Santa Clause!But this one, this one is..\nHow to say that.. Tim is Santa, now we tryin to find and his replacment in new series..\nBut this Santa, it's like first Santa, original!The one, before all of them!Watching him as Santa is like watching some old really old too wise man, like angel in human form,\nlike some sensei with whom you want to spend as much as time as you have, to listen, watch, and learn!To be like him!So.. yeah, have to change my list, update to say.Others, him, her.. like couple from dream, movie!Not those today, classy, from before!Example of lady and man,\nthey just did too great!Little one, oh dear Lord! How ?Don't answer that! Haha!It's just magical movie!It's miracle!And I'm thankful because I've got chance,\nhow much, almost 30 years later..\nIf folks back then would knew for today's..\nIt would have at least 8 as raiting.This is timeless! And one of those, for reprise!Thank you all of you who made this possible!I know with this you've changed, still, and 'll do..\nfrom views about life, to everything else!So many great messages/lessons!Thank you!",
    "125": "Only seen clips of the original, but appears to one if very few films where the remake is infinitely better than.the original.Cast works really well and Mara Wilsons performance is right.up.there with Nathalie Portman in Leon Kirsten Dunst in the Last Vampire, and Carrie Henn in Aliens different genre but Wow.Nice gentle film which is story and character driven. Richard Attenborough is Excellent as Kris Kringle trying to restore some belief to a sceptical Elizabeth Perkins.For me this is only slightly behind my all time favourite Xmas movie it's a wonderful life.Works wekk, put together well and superb performances give credibility.You really need to see this film.",
    "126": "This film is probably one of the worst bombs in film history and probably the absolute worst remake of all time. Bad decisions were made in casting. Richard Attenborough was probably the absolute worst person to cast as Santa after the entire world having watched him multiple times and for months in Jurassic Park the previous year. The entire world, especially small kids (and big ones) knew he was the old Jurassic Park guy. They should have went with a complete unknown or lesser known stage actor from Europe like the original did. That completely ruined the magic that anonymity can provide for Santa.Casting a virtual unknown (for most of the world) was genius casting for the original 1947 film. No one in the US knew who Edmund Gwen was in the original and he wasn't even all that well known beyond England. The acting of Mr. Gwenn was ten times better as well and indeed won an Academy Award for best supporting actor for his role. Attenborough got, well a big check and that's about it.That comes to the Mom, played by Perkins, who comes off as bland and forgettable, the complete opposite of funny and charming as was played by O'Hara originally. She was fairly attractive though but that alone isn't enough.The girl (Mara Wilson) from Mrs. Doubtfire is horribly cast and would have been better suited for another kids film or another comedy. Her lines were clearly fed to her the entire time and it shows (Natalie Wood had a photographic memory even at her young age and had memorised all her lines for the filming of the 47 original including the entire script).Ok now it's time to be real: Looks do indeed matter in film, even for young stars. Mara Wilson has since blossomed into a really decent looking woman but in 1994 she was just about the most awkward and most homely looking girl they could have ever cast out of a literal sea of beautiful young child actresses. No matter what, all would have easily been better at the acting and it is guaranteed that they also would have been a lot cuter. Natalie Wood from the original always had a face that was right out of a fashion magazine except she was only 8 years old at the time. One of the cutest and most talented child stars since Shirley Temple.McDermott is decent as the lawyer that helps out but his acting isn't helped by the others and it is horribly wasted. No doubt, what so ever, that this one is regularly left off his filmography when going in for an audition. Luckily this horrible remake has faded away into the relative obscurity of the bargain bin buried under countless other garbage. Even then, thankfully you only come across it once a year as your looking for something actually worth seeing. If it doesn't say (B&W1947) or even (Colorized 1947) then it isn't worth wasting your life on.",
    "127": "I was first introduced to the 1947 classic of the same name , when I was just eight years old. I knew nothing about Natalie wood , , New YORK or MACY's department store. Watching the original, was nothing short of a MAGICAL experience!! I feel in love with New York, Ed Gwynn , JOHN PAYNE , MAUREEN OHARA , and of course , Natalie Wood. , and MACY's !! It became a tradition , each year that followed, that MIRACLE ON 34th street , would be required viewing as son as the American thanksgiving was underway!! I've lost count of how many times I have watched this movie ( I went out and bought the DVD because for some insane reason , 3 years ago , the movie was not being shown on any channel ?!? )All that being said, I have to admit , I was a bit disappointed with the 1994 version. Yes Mara Wilson was cute as a button , and spot on as the the skeptical little girl. But I found this version lacked one key factor - MACYS !!! In this version , Macy's isn't even mentioned. For some reason, after the producers when all out to find the perfect cast , they couldn't get the real Macy's to agree to let miracle, use macys !!! This , I beili really hurt the film . What they should have done was worked harder to get the Macy's name, or not release it at all . I think not getting permission, was a game changer / deal breaker .Trust me., forget this version , and watch the original, and experience the magic!! And whatever you do stay FAR AWAY from the so called television remake that was released in the 70's that starred Sebastian Cabot , and JANE Alexander and David Hartman ewwwwww.",
    "128": "I love this film because it is shamelessly a Christmas film. Unlike several Christmas classics, Miracle on 34th St. has Christmas front and centre throughout, and on this level alone it makes perfect festive viewing.\nHaving watched it many times, I thought I preferred the remake to the original. However I now think its significant flaw makes this updated version of the original look more dated than the 40's version. What flaw? The costumes and scenery are 30's or early 40's at most, while the \"evil-toys-are-us-esque\" sub-plot is pure 1990s. The costumes are all too stylised, with everyone wearing impossibly affluent , upper middle class 1930s, tailored, woollen coats, suits and hats. The apartments and offices all have blazing open fires. Yet the Toys Express and the limo the baddies drive in are clearly not \"period\". Sadly the more times I watch it the more this juxtaposition frustrates me. Will it stop me watching the remake? No, but I do tend to shout at the screen more each time. Interestingly I find the 1940s realism of the original a bit depressing these days. Perhaps a mega mix of the two films would produce a genuine rival to the real classics of It's a Wonderful Life or The Bishop's wife or The Shop Around the Corner?",
    "129": "Sorry, I'm gonna be the Grinch on this one. I put off watching this one for years mostly because I grew up watching the original every year with my family. It was always my mom's favorite so, naturally, that pulls a lot of weight for my review of this movie.\nWe were looking for a Christmassy movie to watch with the grand kids the other night so I thought of this one. I was a little hesitant to go with the new one but I thought the kids would like it more.\nI chose to buy it from Amazon rather than rent it. I will say, first, that my 9 year old granddaughter enjoyed it. I am going to play the original this week and get her opinion on it, also.\nThe movie in my opinion was one of those that had too much dead air time or just some awkward silence. It progressed very slowly and, to me, the acting was forced and a little over the top at times. \nIt loosely followed the original story of a department store Santa that is a little too realistic for some people and was a threat to the competing store and a few hateful people in particular. \nHe befriends the daughter of the head of the \"Cole's department store parade\", who is a little girl that is supposed to be way above her years.\nKris Kringle claims to be the real Santa Claus and the evil department store CEO is determined to prove otherwise. So, naturally, the easiest thing to do is have Kris arrested and thrown in the psych ward at Belleview. He is defended at the commitment hearing by the little girl's mother's boyfriend. \nI'll let you watch and see how it ends.\nSometimes when a movie is being remade, the director has a very difficult time capturing the the feel and the emotion of the original. That is the feel for me on this one. I really think they missed the mark on this wonderful classic. \nWas it horrible and unwatchable? Not really. But I did find myself getting reminded by my wife that we were all supposed to be watching the movie together, not playing on my phone.\nIf you haven't seen the original, please do. There is a colorized version if you don't like black and white movies but I prefer the B/W for nostalgia sake.\nBut if you do take the time to watch the original, please come back and review it and leave a rebuttal on my review.\nMerry Christmas. Happy Hanukkah. Happy Holidays"
}