{
    "0": "Of course the Action Genre existed before Die Hard. After all you had The Terminator, Commando, Top Gun, Roadhouse...but didn't Die Hard absolutely revolutionize the eighties action Genre. It came like a savior and encompassed everything that would blow you right out the back of the theater and made Bruce Willis an absolute idol in the Action world and for good reason. Die Hard had pointless nudity, scores of bad language, bloody death, guns, explosions, a gritty, tough as nails, sweating, dirty hero that takes on everyone with nothing more than a hand gun and his brains. If you watch Willis in Die Hard it's a thing of beauty. His shirt torn off, bare foot, wounds all over him...he looks like he just crawled from a war rather than stalking terrorists through an enormous high rise office building in L.A. The script was so dead on...it was basic, it was to the point, it has great sarcastic humor and one liners that could never be forgotten. And Willis was the man to pull it all together. Add a decent supporting cast, a guy on the ground who is like his partner and a MacGyver style of killing bad guys that will go down in history...THIS IS DIE HARD.Bruce Willis was brought up right in the Prime of his TV Series Moonlighting where his irresistible charm and personality made him a hit. John McLean was David Addison but with a lot more guts and a lot more ammo. That only made the film more exciting to fans of Willis already. Willis has a way of just making everything edge of your seat and everything believable. Who else could make you smile in fear when he's diving out of a 30 story window attached to a fire hose while the roof of the building is exploding. He really doesn't single handedly make the film...the supporting cast is terrific. Bonnie Bedelia is great as McLean's straight laced, professional and estranged wife. They make an odd yet touching couple. They have some electricity and it's ironic and yet sensible that they don't end up together throughout the series. Still Bedelia is a great female lead and her character is strong and not at all misused in the role. Alan Rickman is just one kick ass bad guy. Can you say anything else?? As terrorist Hans Gruber he is terrifying, evil, brilliant, and you just despise him and you can't wait to see him go up against Willis and he does. He doesn't stand a chance but Rickman is still brilliant as the bad guy. Reginald VelJohnson plays a small yet very important role as Willis' guy on the ground on the other end of a walkie talkie. They don't know each other, and barely know each other's name but yet they become as close as partners and they too are odd together and yet fit. William Atherton has to be mentioned even though it's a very small role, it's Die Hard history that he plays slimy, tabloid reporter Richard Thornburg who gets his just end by Holly McLean's fist which becomes a running joke in the series.Die Hard is everything that people would look at in disgust now in the new millennium and yet it was everything the eighties stood for when it came to action and heroes. McLean has a cigarette dangling from his mouth, blood pouring everywhere, and a happy ending despite all the destruction around them. If you haven't seen Die Hard you can't ever proclaim yourself an action fan because Die Hard IS action. It's the film every action film strives to live to and will never meet...whether it was before 1988 or after. We won't ever get something like this again. It's an absolute 100% classic!! for all the wrong reasons!! 10/10",
    "1": "Die Hard (1988) the first action film is by far one of the greatest best action movies of all time from the 80's till this day hands down. It is my number 1 personal favorite action movie of all time, I love this movie to death! I love it so damn much and I have fun watching it so much. I have to talk about this movie: It is one man army fighting against a team of terrorists with automatic weapons and plastic explosives. Bruce Willis performance was excellent in this movie John McClane is his best role ever. It is my number 1 personal favorite action movie of all time, I love this movie to death! It's stay in my heart forever. To me it felt this film realistic and it makes you think that you are alone trapped in a building against bunch of terrorists what will you do? This film has heart and soul. A lot of movies have try to do that premise since, but no movie has nail it like \"Die Hard.\" This is a modern day action film of the action genre. I watch this film as a teenager I even watch it with my mom it was ultimate thrill ride. I love everyone in here all the characters and the lead character. I love that McClane is alone he has no help, all telephones doesn't work he is barefoot with his gun and the only help has is from Sgt. Al Powell down there who didn't even see him at all but were both talking on a radio from cop to cop. I love that bond between those two lead heroes. I always love when McClane talks to himself whenever he was about to do something crazy. It is going to be 30 years anniversary this summer 20th July. I love this film to death I am hugh fan of Die Hard films I love this film so damn much. I would really love to see this movie in a widescreen in a movie theater. It was directed by brilliant John McTiernan it is is based on a novel Roderick Thorp Nothing Lasts Forever. This is a masterpiece action film that started all action genre one man army types battling terrorists while trapped in a confined space. It was arguably the first one in the action genre. This movie has everything . It has intense Action, Drama, Thriller, twists, great dialogue, explosions, fights. Exploding building, great helicopter explosion action scenes. John McClane is one man against a whole team of terrorists. A cracking Action Thriller from beginning to end, Die Hard explodes with heart-stopping suspense! It has great cast, great plot, great explosions, no shaky cam, doesn't deal with CGI, but real actions real practical effects. Great Direction from John McTiernan, great dialogues, great acting from everyone. Everyone does an excellent job. Bruce Willis is a bad ass action star as John McClane. It has a great bad-ass action hero who does impossible buy stopping the terrorists who were actually a real terrorists who try to steal the money in a vault 640.000.000$ in bearer bonds stored in the building's vault. My favorite action sequences and the best part of Die Hard: McClane grabs the fire hose, ties it around his body jumps with the helicopter about to kill him. Then Gruber blows it a second after McLane jumps off the roof! It was an incredible explosion that totally takes out the helicopter. But McLane is falling down the side of the building and needs to get inside quickly this is the best scene in the movie my favorite. McClane climbs in the elevator shaft escapes Karl and his men trying to kill him. McClane shoots on the table with his gun killing Marco. (According to the director, the proximity of the gun to Willis' ear during this scene caused permanent hearing loss for Willis.) \nMcClane shot's Hans and Eddie \"Happy - Trails, Hans...\" Incredibly satisfying action in a brilliant action movie! McClane try to save Ellis when Ellis try to save him self. McClane was afraid of flying and he always carry gun because he was afraid someone would have hijack it. The fight between Karl and John was excellent and well choreographed. McClane drops C4 down the elevator shaft and destroys the entire floor where the terrorists are firing from, giving the cops a chance to retreat. I love The broken glass scene. He shoot's and kills two terrorists with his machine gun to escape Hans and Karl, John McClane is forced to sprint over broken glass while barefoot the best bad-ass scene in the movie my all time favorite. Three terrorists are shooting on McClane on the roof chasing him in which he escapes in the beginning of the movie awesome. Karl shoots in an elevator shaft in which McClane is hiding a real kick-ass scene I love this film to death! I love the characters in this movie: John McClane a real action hero to me that does something that no one can he stops a team of terrorists. Hans Grubar the German mastermind he was ruthless and brilliant and he would do anything to steal the money even killing people and get what he want's. Alan Rickman's performance was excellent I love him to death in this movie. I really miss the actor he was the best villain of the whole world. The LAPD Supervisor (Diana James) I like that girl she was so good when McClane call's her for help, I love it. I love Sgt. Al Powell how he stand's up and defends McClane against his supervisor. Reginald VelJohnson does a brilliant performance as a great supporting hero in this movie. I love Deputy Police Chief Dwayne T. Robinson to death he is my favorite character in here. Paul Gleason was so good I love his performance - \"kick ass.\" I love how he tried everything to safe the hostages including SWAT team who were badly hurt. I like Richard Thornburg in this movie who is annoying reporter but I still like it. Bonnie Bedelia as Holly McClane's wife was great.John McTiernan directed excellent this masterpiece Jeb Stuart and Steven E. de Souza wrote a script that it delivers. The helicopters in here were models in this movie delivered, to me the action scenes felt realistic. This movie has ton's of action and you never get bored with it. Michael Kamen made a music score and you never get bored with it. You'll see lots of heavy automatic and explosive weapons, and you'll see them used well. The film is violent, and bloody rated R with real blood squibs. 10/10 it is my favorite action film in the action genre I love this film to death it is my personal action favorite film. I miss movies like this I miss action movies like this one today I want them back. It is a shame we don't have movies like this today.",
    "2": "The ultimate combination of action, crime and Christmas, Die Hard is timeless in its appeal. Willis is the perfect casting in his most iconic role of McClane, with Rickman the faultless foil, as the equally iconic Gruber.Not only is the action explosive and pulsating, but the wider cast of characters also get some form of arc, fleshing them out. Dialogue is great (even if the German may be a bit off), and the setting never tires despite being restricted within the single building.Big budget, all-out action and perfect one-liners, all in one festive present.",
    "3": "DIE HARD (1988) **** Bruce Willis, Alan Rickman, Bonnie Bedelia, Alexander Godunov, Reginald Vel Johnson, William Atherton, Paul Gleason, Hart Bochner, Robert Davi.  NYC cop John McClane (Willis in his star-making iconic role) is visiting LA at Christmas to reconnect with his estranged wife Bedelia who is at an office party that becomes a nightmare when a group of terrorists take over the building led by Hans Gruber (perfect Rickman) a German nutjob out to filch millions in bonds in the vault of the Japanese company.  As the \" fly in the ointment\", Willis does his damnedest to stop him at all costs relying on his street-smarts and out-guessing as time ticks away.  Great blend of action suspense and much welcomed humor.   Best bit: Willis plunging from a rooftop attack by the FBI (thinking the disheveled cop is one of the bad guys!) attached to a fire hose and shooting his way into an empty office!  Hair-raising and exhilirating fun for all. \"Yippiee-Kay-Ay !!!!\" (Dir: John McTiernan)",
    "4": "Totally outrageous, totally unbelievable and totally over the top - and as Hans Gruber (Alan Rickman) would say - 'But who cares'? It's Bruce Willis in a version of saving humanity along the lines of John Wayne, Rambo and Marshal Dillon. Personally, John McClane had me when he said he was partial to Roy Rogers because that's who my favorite TV and movie cowboy was as a kid growing up. I'd bet that someone might say that of Willis some day.In his own way, John McClane must have had some sort of mystical power because up until the point he started crawling through the transom feeling like a TV dinner, his wife-beater t-shirt was white with some blood spatter. But when he hit the floor again to do battle with the bad guys it suddenly turned brown. So mesmerized was I by this turn of events that I never even noticed when the shirt turned a neat dark forest green later in the picture. I wonder how stuff like that gets by the director? Say, and how about the FBI sending in a double Johnson to take over the attack at Nakatomi Plaza? I'm sure there's a pretty good punch line in there somewhere but I think I'll just let it go for now.It's been stated, and rightly so I think, that this film set a new standard for action/adventure flicks with Bruce Willis portraying a new kind of hero. He's smart, thinks on his feet, takes what help he can get, and engages in wise-ass banter to keep the audience fully engaged. All the noise, explosions and crashing glass is merely window dressing to keep the story moving as our hero saves the day. What more can you ask for in a two hour action flick? You know, if this was a Roy Rogers Western it would probably have a title like \"Under California Stars\". If I had to guess, I'd say Bruce Willis saw that one when he was a kid.",
    "5": "I first saw Die Hard in the late 1980's and have owned it on various formats down the years and will watch it now and again. One of the main reasons I enjoy it so is because of the iconic place it holds within the action genre. At the time it came out we were mostly served up pumped-up action heroes who happily take on entire armies and win in battles that are mostly a simple matter of good versus evil, where good is US and evil is them (whoever them happened to be at that time). Die Hard manages to be more than that by starting out with a \"normal\" guy as our hero. Now I won't pretend that McClane is not an action hero who does extraordinary things but he seems accessible. I particularly like the fact that his first reaction is to run, to call for help form others and that he only faces the terrorists when he has to, rather than going all Rambo on us.If this approach provides a grounding, the concept also brings the action into a slightly more real environment. The action is more or less confined to the tower and the bad guys limited rather than being a constantly flowing army of stuntmen. Director McTiernan uses the location really well, injecting tension and a sense of claustrophobia that works really well. The action is enjoyable and offers a lesson that modern CGI-heavy action movies can learn from  if you rely totally on technology then you'll date quickly, if you make the effects serve the action and narrative then you'll be standing for years. As a result the action in Die Hard feels no less slick or exciting for being almost twenty years old.Although this is the most important part of the film to get right, I always appreciated the clever subtexts in the narrative. Filmed in the 1980's, the film is a clever attack on yuppie values in contrast with the blue-collar \"man's man\" type. In this way the narrative can be viewed as those seeking more and more wealth getting in the way of those who just want to be with their families. The most obvious attack on the business culture is the aligning of the terrorists and the corporation. Hans and Takagi share taste in suits, education, knowledge and even share the same opening lines (\"ladies & gentlemen\"); it is not a stretch to see the film suggesting that Takagi may have also shared some of Hans' ruthlessness in his rise to the top. This is also evident from the very start  John does not lose his wife to Hans, he has already lost her to the corporation as she drops his name and had moved away. Indeed such is the films paralleling of these two threats to McClane, that he only rescues Holly from Hans by getting the watch off her wrist  the watch that was specifically mentioned at the start of the film as a gift from the company.Ellis sees the connection being made even more obvious as he himself suggests little difference between himself and Hans, apart from the gun and fountain pen aspect. Of course with both businessmen being connected to the terrorists in this way, they must also share their fate, and do. Although it has lumbered the film series with a rather poor catchphrase, the discussion of westerns again confirms the contrast between \"man's man\" and \"new man\"  a connection further made by having McClane in his vest, an outfit more befitting a blue collar worker who has his values in the USA frontier rather than the cut-throat world of foreign business. This distain for bureaucracy is also seen in the redemption of Al. Stuck outside the action in the building (handicapped by incompetence) but also desk-bound due to shooting a kid. At the end of the movie he is redeemed by killing Karl in a \"quick-draw\" style shoot out, freeing him from his desk and restoring his manhood. Again the split between bureaucracy and real workers and again the use of wild-west symbolism.The cast respond to the strong script and direction by turning in roundly good performances. Willis has not really been better (even in the same character) and his action twist on his Moonlighting character was the making of him. It is Rickman that dominates the film though; like in Robin Hood, he is a delightful sneering bad guy who has great lines and great presence. The support cast is good below them with Bedelia avoiding being just a damsel in distress; VelJohnson a solid \"buddy\"; Godunov is a real physical threat  even if a few of the other terrorists barely make an impression on the memory. Gleason, Atherton, White and Davi all give a good show as well.Rightly an iconic action movie then. The action has stood up really well and is delivered within a story that is tense and well paced. The performances suit the material and, if you want it, there is a clever and engaging subtext running across the whole film. I find it hard to fault and you can see why it has had the influence it has had on the action genre over the last twenty years.",
    "6": "This movie is the ultimate Christmas movie, despite the opinions that it isn't I believe it is to this day, I always watch at Christmas time.Watching this every time always brings back memories of watching it back in the day. Bruce Willis is phenomenal, I love everything this guy makes. Great story that keeps you on the edge wondering what happens next.Highly recommend!",
    "7": "What more is there to say than Die hard is brilliant and so is Bruce Willis. Could watch them over and over again.",
    "8": "I've seen many action films over the years, but few have had an impact like Die Hard. Bruce Willis gives one of the best (if not THE best) performances of his film career. This is quite simply, my favourite action film of all time.Willis plays NYPD cop John McClane, who has come to LA to be with his estranged wife Holly, (Bonnie Bedelia) and their children for Christmas. To my knowledge, Die Hard is one of the few action films set at Christmas. This makes Die Hard rather unique for the genre, but the seasonal setting does nothing to detract from the action, and its still a gripping film to watch.Getting back to the plot, McClane heads for the Nakatomi Plaza, a 40 storey skyscraper, Holly's workplace, to pick her up from the Nakatomi Corporation's annual Christmas party. But just after a heated discussion concerning the breakdown of their marriage, a group of German terrorists led by Hans Gruber (the brilliant Alan Rickman) seize control of the building.McClane manages to escape detection, and where the action kicks into overdrive. Willis makes a very likable hero as John McClane, because he comes across as a more down to earth guy than other action heroes. An example is when the terrorists first seize the building, but instead of trying to be a hero, he just runs and tries to call for help.This is believable behaviour to me, and you would expect anyone thrust into the same situation to do just that. Since the action is confined to an LA skyscraper, it makes for a more claustrophobic atmosphere and environment. With McClane crawling through air ducts and elevator shafts, the camera angles have you right in his face. In some ways, Die Hard reminds me of The Towering Inferno, the classic Irwin Allen film also set in a skyscraper. But they are still two very different films, with Die Hard being more about action.McClane must now wage a one man war against Rickman's terrorists. It may sound ludicrous for one man to single-handedly pick off a group of heavily armed terrorists, but in this film it works. I think its because of Willis' likable performance of an ordinary man plunged into an extraordinary situation. I like the way he wears that white vest, that becomes increasingly dirtier as the film goes on. To me, this symbolises his transition from ordinary joe to the one man army he's been forced to become.Alan Rickman oozes evil as Hans Gruber, who is principally interested in the 640 million dollars worth of negotiable bearer bonds in the Nakatomi building's vault. He is in complete control of the situation, even when McClane is causing high rise havoc with everything from automatic weapons to plastic explosives.Rickman never loses his cool, and gets a lot of great lines. He even finds time to mock McClane, likening him to a cowboy. This is where McClane's famous catchphrase comes from Yippie Kayee Mother F###er. I like the way Rickman has the police (and later the FBI) at a complete disadvantage, bluffing his way past them about comrades in arms to keep them occupied. He simply weaves them into his plan, and he skillfully manipulates them to play right into his hands. This is a rare thing in an action film, where neither hero, nor villain upstages the other.Reginald VelJohnson is also great as Sgt Al Powell, the only ally McClane has with the cops on the outside. Although they talk via radio, the two have great chemistry, and I like the scene when Al confides in McClane how he accidentally shot a kid, even though they've never met. This illustrates the bond between them. McClane returns the favour when asking Al if he could tell Holly he's sorry their marriage didn't work out. This shows his more sensitive side, but I think it shows depth to McClane's character, and doesn't come across as soppy. That's why he's such a great hero.The stunts are incredible, in particular when McClane has to jump off the roof tied to a fire hose. I like the way he says just before he's about to jump \"Oh God, please don't let me die\", compared to some other action heroes like Schwarznegger or Stallone who would probably just jump. This again demonstrates what a realistic character he is playing.Nailbiting stuntwork and spectacular pyrotechnics are impressive, and never overshadow the characterisation built upon throughout the film. The action scenes serve the plot, when in most action films, it is the other way around. There are some people who won't like the swearing (and even I found some of it unnecessary) but the film is still a masterpiece of action. Definitely John McTiernan's best film (although Predator was almost on a par) and its so stylish and witty right up to the nailbiting conclusion.Die Hard even succeeds as a knowing commentary on the action film genre, dropping references to other action heroes, and exemplifies Bruce Willis as a new type of hero. One that can get hurt, one that feels pain, and one that actually has ties to the world.The best of the Die Hard series, and I love the Christmas song Let it Snow, Let it Snow, Let it Snow on the end credits to remind you it is still Christmas even after all this. Not to mention how liberating it is to watch a corporate building going up in flames.Die Hard set a whole new standard for action films to come. There have been many imitations since, but none have ever managed to top the unforgettable adventure of Die Hard.",
    "9": "Rich eggnog, a roaring fire, a room full of friends and family, Die Hard on the television... Is there a more perfect holiday setting? I doubt it.",
    "10": "Spoilers herein.Here's a conundrum: the vacation action thrillers that star unkillable heros themselves die a quick death. Even a short time later they are limp. Seen \"Speed\" lately? Each is a matter of repetition with the heat turned up a very little, so the next guy always makes it obsolete.But not this one. I've stopped by every few years, and it never seems dated. (Well, maybe the pseudo-terrorist plot.) But its just in a whole different category than any Arnie movie. They fade fast. I think it is a matter of originality, pacing and the stance that Willis invented. The pacing really is a black art, and to judge from McTeirnan's subsequent missteps, was an accident. But I have to give Bruce Willis a lot of credit. We live in an era when we expect nothing to be done straight. Some ironic coloring is expected, some compact between the film and the audience that gives us traction on which to build fun. Sly, Arnie, Chuck and those others take it all so seriously. Bruce, and later Mel (with less intelligence) would first establish their character with the audience as their man, their representative in the action.Then, once in a while, he'd all but look at the camera and say \"ain't this a gas, watch this!\"I don't pretend that Bruce is a fine actor, but he certainly reinvented film. And in his own way as much as Brando. This is his \"streetcar.\"It is important in the history of film, and in how we as a society deal with abstraction. And it is still fun, with the \"cancel Christmas\" guy.Ted's evaluation: 3 of 4 -- worth watching",
    "11": "When it comes to action-adventure films of the 1980s. You have Raiders of the Lost Ark standing as a colossus. The ultimate homage to the 1930 'B' serials. Hot on its heels is Die Hard the ultimate action- thriller.Bruce Willis was known for the comedy crime-drama Moonlighting and comedy movies such as Blind Date. He was not someone with bulging muscles like Sylvester Stallone or a former martial arts star or bodybuilder.John McClane the everyman who happens to be a New York cop visiting his estranged wife at her firm's Christmas party, rather partial to Roy Rogers ends up being in the wrong place at the wrong time.Just as the party gets into full swing a bunch of European terrorists take over the office tower block to rob some financial bonds, led by the magnetic and then unknown Alan Rickman (who in those pre Google days, some critics mistook to be some undiscovered German actor readymade to be a Bond villain!)However as the villains hold the rest of the group hostage waiting for their plan to unfurl including getting an assist from the FBI, there is a fly on the ointment. McClane is on the loose and picking off the bad guys one by one.You have a beat cop in contact with McClane, some inept cops, even more inept and gung ho FBI agents, a slimy journalist and a film director on top form giving you one of the best action films of all time.A mixture of thrills, action and humour. Just look at scene when Uli (the far eastern bad guy) glances at the chocolate bar during a tense moment and steals it, or Rickman naming some freedom fighter groups which seem to be made up. He states to his fellow henchmen that he read about them in Time Magazine.Ultimately Willis pitches his character just right. Here is an actor hungry for that breakout role and he sure hit bullseye here even though some of his subsequent actions films have been disappointing. To think Frank Sinatra was initially under contract to play McClane!At the other end is Rickman playing the suave, sophisticated and ruthless villain. He brings charisma by the truck load and this was also his launchpad to stardom.",
    "12": "John McClane (Bruce Willis), officer of the NYPD, tries to save wife Holly Gennaro and several others, taken hostage by German terrorist Hans Gruber (Alan Rickman) during a Christmas party at the Nakatomi Plaza in Los Angeles.This was the debut of Alan Rickman, the film that cemented Bruce Willis' career as an action star, and possibly the greatest action of film of all time (or at the very least, the 1980s). While it could have become dated, it has not -- not in the slightest.As I write this (December 2013), there is a new \"Red Dawn\" where the Soviets were replaced with North Koreans. The original is now a time capsule. \"Die Hard\" remains timeless because the terrorists were \"European\" and not tied to any particular ideology or movement. This was a wise decision.",
    "13": "First of all, it is a Christmas movie. Ok, that is out of the way. I wouldn't change anything in this movie. The storytelling, the music, the villains, the complaints about California through the eyes of a NYC cop, the camera work, the cast.. I love it all. This movie has been dissected by many of why it works, and all I can say is that it's a must watch.",
    "14": "Every so often,a film comes along that resets the standard for it's genre.Die Hard did just that very thing for action films.Any film that inspires copycats and wannabes really does it's job well.Bruce Willis made a very successful transition from the small screen to the big screen as the everyday Joe forced into being the hero.This film has all the necessary ingredients to qualify it as a great action film.All you have to do is see it for yourself.Particularly well done is the performance of Alan Rickman as the chief villain,Hans Gruber.You can come up with good arguments for many action films as to which is the best all time,and this one is no exception.Well done.",
    "15": "This is the movie by which all other action movie directors should set a bar with. It is a little dated but that's how you know it's a classic because it's still great to watch.",
    "16": "A seriously great action movie. Willis and the guy who plays the villain are great, but so is everyone in this Christmas classic. A lot of fun.",
    "17": "What do you get when you mix late 80-s style action movie with a little romance, good plot and setting with Bruce Willis as protagonist, Alan Rickman as villain and Reginald VelJohnson as a sidekick? You get a movie for an eternity! It's cool, it's fun, fast, packed with adrenaline and that feeling when you root for the protagonist to win. In my country, the name of the movie is literally translated as: \"Die like a man\", so it's definitely a movie you watch when you feel down and don't feel that your ego is alive. I give it 10/10! I recommend it to everyone! Enjoy the classic!",
    "18": "This review contains spoilers.Die Hard is an action thriller movie that premiered in 1988. The movie centers around a Christmas Eve heist that traps a NYPD detective within the building. From there the detective must use his wits to improve the situation for both the police outside and to save the hostages. The movie is based on the book \"Nothing Lasts Forever\" by Roderick Thorp.Die Hard is an excellent action movie that centers around Christmas. This is one of the best action movies that centers around Christmas. John McClane played by Bruce Willis brings in a believable hero thrust into an impossible situation. Bruce Willis is able to make this work by appearing vulnerable and not unstoppable like in most action movie protagonists. John McClane is a well written character in this movie. He has struggles that are apparent to the audience. He has an estranged wife and he is only trying to do what he thinks is best.Die Hard has a great villain in Hans Gruber played by Alan Rickman. The charismatic Hans Gruber is played magnificently by Alan Rickman. Hans Gruber is a great villain that is able to use his charismatic gusto to great effect on the cops and John McClane.The action scenes in this movie are impressive even for 2020. The movie uses these action scenes to great effect in steering the story. Each of the German terrorists have character that is reflected when John McClane encounters them. This makes the series much more in-depth as each of the villains actually have character than being cut-outs.I highly recommend \"Die Hard\". This is one of the best action movies of the 1980s decade.Grade: A.",
    "19": "Believe it or not, many people are dead serious when they say that Die Hard falls into the category of Christmas films. There actually is some truth to this, but the story itself doesn't really have anything to do with it. Because it's often considered one of the best action movies, the focus is squarely set on that and little attention is payed to the impending holiday, especially with regards to the huge amount of cursing the movie has. For an action movie, I was a little surprised by Die Hard's somewhat long set up. Before things start exploding and bullets start flying everywhere, the storyline has to be laid down through a number of dialogue scenes. The plot centers on John McClane (Bruce Willis), an NYPD cop who is flying to LA in order to clear up some misunderstandings with his wife, Holly, and hopefully get his marriage back on track. He is scheduled to meet her is a big skyscraper owned by the Nakatomi Corporation during a christmas party they're hosting. The holiday is tomorrow, and there's a bunch of people not wanting to miss any excitement. As John and Holly start talking, the building suddenly comes under the control of a group of West German terrorists led by the sophisticated (but also evil) Hans Gruber. Gruber (Alan Rickman) and his associates aren't just your average, run of the mill street thugs, and storm the building with missile launchers, stun grenades, and automatic rifles in their possession. Hans' ultimate objective is to break into the building's vault, which contains over 600 million dollars worth of bonds. John manages to stay undetected when the terrorists start shooting up the party and kill several hostages. He later witnesses Gruber fatally shoot Mr. Takagi (Holly's boss) for refusing to give Gruber access to the money. Even without the code, Hans is determined to break open the vault and assigns a computer nerd to try and find the right pass code. Meanwhile, John wreaks havoc throughout the building and kills several terrorists who Gruber sends after him in order to put his interference to an end. The police eventually form a perimeter around the building, but even a SWAT team is unable to breach the terrorists' defenses. McClane causes more chaos for the terrorists and manages to kill some of them in a huge explosion with plastic explosives, which just serves to irritate Gruber even further. He resorts to having one of John's friends, Ellis, try to talk some sense into him over a walkie talkie, but Gruber kills him too when John refuses to cooperate. In a particularly intense scene, Hans tries to track down John himself, posing as a defenseless hostage who doesn't know where he is. He almost succeeds in killing John after the latter willingly hands him a pistol, but it doesn't have any bullets in it. A subsequent gunfight initiated by the terrorists, trying to rescue their stricken leader, leaves John badly wounded. Meanwhile, outside the building, a cop talks with John on a radio, convincing him he will succeed. The FBI has also showed up and orders the building's power to be shut off, which inadvertently ends up helping the terrorists because it disables the vault doors. Gruber makes ridiculous demands to the FBI outside, saying he will let the hostages live (but not release them) if the cops agree to releasing various terrorists in prisons throughout places such as Northern Ireland and Canada. The FBI lies and says they will do it and send helicopters to evacuate Hans, but they will actually send attack helicopters instead. As the hostages are led to the roof, John makes the sickening discovery that the whole roof is wired to explode in order to kill them. McClane fires his gun wildly into the air, telling the hostages the roof is just one big death zone and they all need to head downstairs. In a terrible twist of irony, a helicopter pilot thinks John is shooting because he's a terrorist, and orders his crew to open fire. John is almost killed by the heli, but Gruber blows the roof to bits and it is destroyed. The hostages are all safe now, except for Holly, who has been personally kidnapped by Gruber after he figures out she is John's spouse. John tapes a pistol to his back, pretends to surrender to Gruber, and shoots him when he lets his guard down. Hans is finally killed after being dropped from a window. With his main adversary finished off and the terrorist threat neutralized, John and his wife leave the devastated building. A reporter tries to gets John's thoughts on the spectacular event, but he's punched by Holly. This is quite a good movie. It's not perfect, but I think it manages to set itself apart from many other action movies because of its main character. Bruce Willis plays a man who is not an unstoppable, (somewhat) mindless killing machine like John Rambo or The Terminator, for example. There's several times in Die Hard where he looks to be in a vulnerable state, and he is nearly killed several times. This helps make his character more believable, because no matter how tough you are, you can still die. Another person who deserves praise (arguably more than Willis) is Alan Rickman, who plays Hans, leader of the terrorists. He is a sly, shrewd, and thoroughly despicable person, with many reluctantly agreeing to call him a human being. He kills several people throughout the movie, but he always has class doing so. Lots of villains in movies are what I call stupid evil, meaning that they're loud and boisterous, thinking that makes them intimidating. Gruber on the other hand rarely needs to raise his voice. He's just simply a psychopath. I also enjoyed how there are several references to older movies throughout this one, but not many. Hans often taunts John on his walkie talkie as he knows he is trying to interfere with his terrorist plans, and calls him a \"cowboy wannabe\", similar to John Wayne. Right before Gruber is killed, he thinks John is really surrendering to him this time, and remarks how he won't be riding into the sunset with Grace Kelly now. In all, Die Hard is a pretty lengthy movie, but it is worth seeing because John McClane is much more believable as a character than your ordinary hero. He's not invincible, and it shows. There's other reasons to watch this, but that's my primary one. I still don't really consider this a christmas movie, however.",
    "20": "Die Hard is not simply one of the best action films ever made, but one that is easily able to stand the test of time, and do so in style. Die Hard shines brilliantly with some clever set pieces, action sequences, fun dialogue, and some great performances. Bruce Willis and Alan Rickman are obviously the greatest standouts in this 80's classic. It's surprising to say that audiences at the time were not too thrilled with the idea of him as action hero, and against all odds, he delivered a more than well, not to mention iconic, performance that simply no one could ever come close to capturing the same charm. Alan Rickman at the time was practically unknown, and with him as Hans Gruber, it's certainly a job well done into his life of stardom. Some other great performances include Bonnie Bedelia as Holly, Reginald VelJohnson as Al, and De'voreaux white as the limo driver Argyle. The film is also fantastically shot, surprisingly well written (for the most part), and wonderfully coordinated. In the end, Die Hard is not only a legitimate classic with more than enough reasons to justify it, but a timeless one as well.\nMy Rating: 10/10",
    "21": "Die Hard is the film that re-wrote the action genre, sparked countless copycat flicks (all of them inferior) and signalled the beginning of the slow, terminal decline of the careers of Messrs Schwarzenegger and Stallone (and the somewhat faster dive into obscurity of the likes of van Damme, Dudikoff, etc). The film holds up surprisingly well, despite all those copies. It should be showing its age, but it doesn't, and the subtext of average working joe threatened by  and fighting back against  faceless multinational corporations (legal or otherwise) is still relevant today. Looking through the principal players, the fact that neither the director, the writer or the star has since achieved such giddy heights suggests that this film was one of those fortunate accidents: everything clicked, and we were somehow given a classic in a genre that throws up precious few. This is the kind of film that's easy to dip into  but nearly impossible to tear yourself away from once you have.",
    "22": "New York cop John McClane travels to Los Angeles to work things out with his estranged wife, only to find her office block at the mercy of terrorists, and he is their only hope of rescue.Die Hard did two things - it created a template for big budget action thrillers with one good man against the massed forces of evil, and it turned Bruce Willis from a moderately successful light romantic actor with a predominantly TV career into a major macho big screen star.Die Hard was pretty good. It pushed the boundaries of suspension of disbelief, but it never stepped over them. It gave us excellent baddies, a resourceful and admirable - though not perfect - goodie, some idiots (and one sound ally) on the outside, and a claustrophobic environment and solid scenario within which all the elements could play out. And, of course, scads of first rate action.Die Hard was the first and still the best, and I recommend it.",
    "23": "When New York detective John McClane goes to Los Angeles to visit his wife who works for a large Japanese company he is expecting a fairly quiet time he certainly doesn't expect the party celebrating the opening of the company's brand new skyscraper to be gate-crashed by a dozen or more heavily armed terrorists lead by a German called Hans Gruber! Luckily when they strike he is away from the party in his wife's office so he is able to lead a one man fight back. Once he has managed to kill one of the terrorists he can use his radio to try to contact the local police although they don't seem to believe him until a body comes crashing through the windscreen of Sgt. Al Powell's squad car! He becomes McClane's contact as the situation intensifies as first the LAPD then the FBI attempt to deal with Hans and his gang. It is soon clear that Hans has anticipated the responses of everybody except McClane so it is up to him to thwart their plans.The eighties were a decade packed with great action movies; a decade where action meant fights, bullets and plenty of explosions all accompanied by a few witty one-liners rather than excessive CGI and this is one of the best examples of an '80s action film. Bruce Willis was on top form as John McClane and Alan Rickman was delightfully over the top as Hans Gruber, Reginald VelJohnson also does a decent job as Sgt. Powell. As well as the almost non-stop action there some laughs to be had although they never feel forced. If you like '80s action films then you really need to watch this and if you've seen it already; watch it again!",
    "24": "Bruce Willis gives a amazing performance in perhaps one of the best movies of the 1980s. This is an action/adventure movie for the ages. There are a lot of great scenes, including the scene where Bruce Willis leaps off the rooftop and crashes trough the window. I never thought it would be so good when I first saw it, but I was wrong. Don't miss one of Willis' best films of all time.",
    "25": "\"Die Hard\" is a 1988 action film directed by John McTiernan starring Bruce Willis and Alan Rickman. As the popular meme states, there are people who think this action classic is a Christmas movie and people who are wrong. Since its original release (as it was told me) this film has been the only choice for the perfect Christmas Eve in my family. A few years have passed since I joined this tradition and immediately fell in love with it - and even now it's the highlight of the day to me. It doesn't only enjoy cult status because people watch it during the most wonderful time of the year and feel great thanks to it, it's a cinematic masterpiece that's near perfect. With the beginning shots, the atmosphere begins to set in immediately. The best of it all are the plot and the screenplay: Not only are there iconic protagonists, each and every supporting character has a well designed personality and plays a major part in the story. Additionally, it's perfectly paced and keeps a packing tension every single second, mostly due to the extreme ingenuity of the writers. It might take place in a limited area, but still delivers a powerful and far-reaching experience. From bombastic and realistic explosions to intelligent shootouts, the film develops a scenario that never becomes boring. It offers enough variety and lives from its love for detail, thus enabling the viewer to dive in the situation completly. John McClane, the sarcastic anti hero is getting along perfectly with the calculated and cold antagonist Hans Gruber (brilliantly played by the late legend Alan Rickman). It's always a great joy to see how they fight each other verbally and in the end face to face. Thanks to outstanding editing and a ingenious sound score the buildup to the final showdown is always a treat for a perfectionst like me. In most instances it feels like a video game I'll never get the chance to play myself and that's always a sad realisation. All in all, this action film is the perfect film for Christmas Eve and ranks high up in the list of the best Christmas films of all time (only a certain Frank Capra film is better) and will always be a part of my tradition. It never gets bad or ages badly, even more than 30 years after it hit the big screen it's way better than most of the blockbusters of our modern cinema. Often copied but never reached, it will forever remain on the top spot of action films. To me, Christmas can only begin when I see Hans Gruber fall of the Nakatomi Plaza. Otherwise it's not Christmas.",
    "26": "Released in the summer of 1988, and this action classic is still nowhere near dated.Violent, explosive, great dialogue and blazing top draw action!The best in the 'Die hard' series of movies by far!The late Alan Rickman, portrays one of the great movie villains of all time in one of the greatest action movies ever madeA absolute classic!",
    "27": "When most people think of Christmas and USA, they will often think New York and snowy. Most men will think the Fox Studio's LA (Nakatomi Plaza). I believe the film makers foresaw the 'Christmas Movie' debat when making the film. When JOhn McClane is on the plane travelling to LA a passenger tells him an antidote to go barefoot to overcome travel sickness. John McClane is barefoot throughout the rest of the movie. Setting the foreshadowing rules from the start. John McClane shortly after gets a limo ride. He asks the driver to put on Christmas songs. The driver states it is Christmas music (it clearly isn't to the average viewer) showing this is clearly an alternative Xmas movie and the fact opinion on what is Christmasey is subjective.",
    "28": "Every Christmas, there are 2 movies that I have to watch: \"National Lampoon's Christmas Vacation\" and \"Die Hard\".Every guy that I talk to about this agrees that \"Die Hard\" is a classic Christmas movie. When I talk to women about this, I haven't met a single one that agrees. My wife certainly doesn't agree, but she watches it with me each year anyway.From the first scene where John is in Argyle's limo, the snow's falling and we hear a more hip-hop themed Christmas it just feels right. When John does get to his destination, it's a good-old-fashioned Christmas office party... everyone is in good spirits and sharing some cheer.Sure, there's lots of killing later in the movie, but that doesn't take away from the Christmas feeling that I always have when I watch this movie.If you celebrate Christmas and you haven't yet incorporated this movie into your Christmas ritual, do so this year.",
    "29": "John McClane (Bruce Willis) a NYC cop is in California on Christmas Eve to see his wife (Bonnie Bedelia) and their kids. He attends a party at her company's lavish high-rise. The party is attacked and held hostage by a group of terrorists led by Hans Gruber (Alan Rickman). McClane escapes but what can he do alone against a large group of terrorists?Full of action, excitement, incredible stunts and tons of gunfights and fistfights. When you think about it the plot it's highly improbable but once the action kicks in you won't care. I saw this opening weekend when it came out in 1988. In first run theatres the Dolby stereo was turned up as loud as it could go. There were LOTS of gunfights and explosions in deafening stereo sound. It was GREAT! There's also great acting by Willis, Bedelia and Rickman. TONS of swearing too. A GREAT action flick. Highly recommended :)",
    "30": "My Rating : 8/10Go watch Die Hard if you haven't already. This is out and out action at its finest.Bruce Willis is perfect and everything just works.Not much to elaborate, its a perfectly done action movie.",
    "31": "wow.i forgot how great this movie is.this movie has it all.this is one thrill ride of a movie.all you need to know is this:terrorists have taken control of a high rise building in L.A and have hostages.the only thing standing in their way is one man: New York cop John McClane(Bruce Willis.)Bruce Willis puts in a great performance as McClane,who becomes a one man army.this movie is so much fun,you won't care(or have time to care) about realism.this movie raised the bar for the action genre.it doesn't take long to get going either,and you'll wonder where the tow hours went.if you're an action junkie,and you haven't seen this movie,what are you waiting for?for me Die Hard is a 10/10",
    "32": "Is Die Hard a Christmas movie? That is the age-old debate that surrounds this action-thriller. Without a doubt, you bet it is. Not only is the setting during Christmas, but the holiday music incorporated throughout is enough to win the debate. Terrorists can still do their thing during Christmas, you know. Satisfied? Great, let's talk about how this is one of the greatest action films of all time and revolutionized the genre to make it better, more evolved. The combined forces of director John McTiernan (Predator) and stars Bruce Willis and Alan Rickman created an unforgettable experience. Excellent, relatable performances, great stunt work, and a pleasing mix of comedy/action delivers the goods for this classic.As the 80's came to a close, action films were waning. The formula for these films involved macho men (usually someone like Arnold Schwarzenegger) and nonsensical villains with outlandish schemes. The formula was becoming stale, and change was needed. Enter the idea about an everyman forced into extreme circumstances where this type of action is necessary. Likewise, enter the idea of a villain who is smart, cunning, and has legitimate means. A more personable villain. Of course, these ideas would be played to death in the future (and subsequent sequels), but better than the alternative. Yes, Bruce Willis plays a hero. But a hero who can get banged up (the iconic bloody tank top), can show emotion if needed (not a macho personality), and uses humor as a way to combat nervousness (great one-liners, though!).The idea for this actioner came only the year before when screenwriter Jeb Stuart came across the idea to adapt Roderick Thorp's novel to the big screen. He kept the book's \"Christmas in LA\" setting and added relationship drama to the fold. He also scaled down the setting as it mainly took place at one office building, the fictional Nakatomi Plaza. The plaza was actually set in a vacant Fox Plaza which was under construction at the time. After the success of Predator, John McTiernan came on board to direct. They had a difficult time casting the film as seemingly any big name turned down the role...but Bruce Willis and his everyman persona was cast. For a man with hardly any movie credit and known for his comedic television series Moonlighting, it was an odd choice at first. As the film neared its release date, faith in Willis was very low and was kept away from marketing. It became known he was difficult to work with. In the end, it didn't matter because Willis became a star, and the action genre was seemingly revived.John McClane (Bruce Willis) is an NYPD cop and his wife, Holly Gennaro (Bonnie Bedelia) invites him to the Christmas party at her new job, Nakatomi Corporation located in Los Angeles. We learn that their marriage is strained. During the party, a group of German thieves led by the vastly intelligent Hans Gruber (Alan Rickman) take control of the building and take everyone hostage...all except one John McClane. With little or no help from the local police (except for Sgt. Al Powell played exceptionally from Reginald VelJohnson) and no escape, McClane must take matters into his own hands.The performances were really good. I believed Willis as the ordinary human being facing extraordinary situations outside his control. He is not the strongest nor the fastest action hero, but instead is a more humane, relatable hero. His one-liner delivery is superb throughout. That said, Alan Rickman has the honor of having the best villainous performance since Darth Vader. He was a man with a plan. Being Rickman's first role in the film industry, he knocked it out of the park. At least deserved an Oscar nomination. Regardless, he ushered in a new era of action movie villains with at least some sense of intelligence. The supporting cast was also really good, even if they do not have much to work with. Willis built a strong rapport with Reginald VelJohnson, whose character was battling his own demons. And Paul Gleason! Critics such as Roger Ebert knocked his performance as the \"dumb cop.\" Be that as it may, it was still pretty entertaining to watch him shoot down McClane's actions in the high-rise.Overall, Die Hard is about as close to perfect as an action movie you can get. Even those subsequent action films repeated what happens here (you know the taglines, Die Hard but on a bus, etc), it still feels fresh here. That is because we get committed performances from everyone with Willis and Rickman standing out. Willis even offered to do his own stunts. The action is really great, and every sequence mattered. Some images will stay with you forever thanks to Jan De Bont's handiwork. With many of these action sequences film on one enclosed location (another thing this film influenced), he did a great job with the camera. The scene where Hans Gruber falls off the tower proves that. One more thing! I love how composer Michael Kamen incorporated \"Ode to Joy\" in the soundtrack. Not the first piece of music to come to mind.This is one of the greatest action films of all time in terms of sheer entertainment and influence. While future films are definitely entertaining, this is the film to see. A great start, middle, and finish. And is this a Christmas movie? You bet your soul it is!My Grade: A+",
    "33": "This is great movie. It has great acting. It also has a great story line line. A gang of terrorist hold some people hostage. N.Y.P.D agent John M.c.c.l.a.n.e has to save them. This is has lot of action in it. This a great movie. All the Die hard movie are must sees. Die hard 2 die harder is better. Die hard with a vengeance is better. Live free or die hard is also better. A good day to die hard is also better. But still this is a good movie. It very fast paced. It is not a family which is a good thing. Because family movies suck. People has don't like this movie are just people who has a hate on for Bruce Willis. See all the Die hard movies.",
    "34": "Yup. That's the title I'm giving this short review. Nothing else comes to mind that would do it more justice. The time is 1988, a young Bruce Willis stars as Officer John McClane in an excellently built, explosive late 80's action classic that actually runs at about 2hrs10min but is a blast to watch. It's not perfect. It's got its flaws. But to hell with those, this is just too much fun to not be watched, and even if you're the intellectual kind, if you like cinema, check this out as it is a lesson on how to make a campy, action-filled thriller the right way. It's a bit long, and yeah the relationship with the black cop is a bit rushed during the ending scene... but the cunning intelligent villain is here, vs the anti-hero, guns, big explosions, the cops, the mischievous lines Willis delivers...this is fun man. It's no masterpiece but it's just fun. Just pick it up and, have fun. It's all this is, although it takes real knowledge to do it well and smooth.",
    "35": "I first saw this movie a thousand years ago, but have been meaning to rewatch it since I started reading the debates on whether it can be considered a Christmas movie. But every Christmas when I suggested it to my girlfriend she would reply, \"maybe later.\"And then, after several years, we watched it. And while she's not always a big action-movie person, she loved it. The story is engaging. Bruce Willis has a way with a snappy line. The movie is full of snappy lines. It's exciting.Some elements don't make any sense. It's certainly pure nonsense. And while it may technically have the features of a Christmas movie, it sure ain't Christmasy. But it is lots of fun and if you haven't seen it you really should. Even if it's not Christmas.",
    "36": "This movie is really great, it has a lot of action and it keeps quite well over time. Good performances from Bruce Willis and Alan Rickman.",
    "37": "Die Hard is one of the best action movies ever made, the acting is great. Bruce Willis does a great job as the hero John McClane and Alan Rickman does a great job as the villain Has Gruber. The action is fantastic and the effects are amazing.The plot sees New York Cop John McClane going to LA to see his family since he's currently separated from his wife Holly, he goes to see her in the huge Nakatomi building. John meets Holly and after an argument in the room John calls his Chauffeur Argyle when suddenly the phone wires are cut, Hans and his men kill the guards and has one of his men disguised as one, they then go to the floor where everyone is and take them hostage. John hears the gun shots and quickly goes through one of the doors. Hans asks to meet the boss of the building and he shows himself then in the office Hans explains to him that he wants the collection of valuable items hidden in the vault, he doesn't tell him the code so he shoots him.John witnesses this and quickly escapes. John activates the smoke alarm so the fire brigade will come, they see on the computer what floor the alarm was raised on so Hans sends one of his men after John but he kills him and takes his weapon and bag. John then goes to the roof to call for help but Hans and his men hear where it's coming from so he sends some of his men to get him, the brother of the man John killed wants to personally kill him. After a firefight on the roof John quickly escapes and the police send an officer to investigate, Sgt. Al Powell. At first he doesn't notice anything but after John throws at body out the window they open fire at his car and once getting to a safe place he calls for reinforcements. The police soon surround them place waiting for the negotiations while John tries to stop them from inside the building.Die Hard is a classic action movie that should be seen. 10/10",
    "38": "Before the detractors of movie violence get the wrong idea,I'm not rating this film 10 stars in support of killing or guns or things like that. The rating is that for escapist entertainment,venting one's frustrations for the things that happen in the world,which we cannot do as much as we'd like about....this movie is absolutely great! This film owes a lot to movies like the \"Dirty Harry\" series and \"Bullitt\" with Steve McQueen. They are the true grand-daddies of the genre!A movie like Die Hard is meant to be the like the most dangerous of rides at an amusement park. Thrilling,unexpected,dangerous etc. This is not meant to be \"real\" because this is an action film,not a documentary on terrorism or police work. For non-stop action and just releasing pent up feelings of helplessness. I say more power to films like this. Only a very uneducated person would honestly believe that one person could knock out thugs like those in this movie (educated though they are).Not your kind of movie? Then it's simple find something that appeals to you. As far as the sequels go,#2 is just as action packed and suspenseful,#3 is still good but it does have the feeling of \"been there before\" but it does it's job and so does Bruce Willis. They only way to avoid getting tired of them,is to not watch them a lot. Then it seems fresh. (END)",
    "39": "The world has a new hero. John McClane (Bruce Willis) is a NYPD officer who's come to LA to reconcile with his wife Holly (Bonnie Bedelia). They're at her employer's Christmas party when the building is taken over by German terrorist Hans Gruber (Alan Rickman).John McClane isn't your regular 80s muscle bound superhuman hero. He's the everyman. He bleeds. He suffers. He wisecracks. He can talk in full sentences. He uses his brain as much as his muscles. He's just in the wrong place at the wrong time.The action is big and grandiose. It takes the adage that bigger is better to its limits. Unlike Schwarzenegger and Stallone, the action seems bigger and crazier. Explosions roll off the backs of those muscle heads, but John McClane really suffers. That's the trick.",
    "40": "Die Hard revolutionized the action genre by rejecting the muscle-bound action tropes of its predecessors and introducing a relatable fast-talking hero masterfully portrayed by Bruce Willis. Willis' John McClane receives more sympathy from the audience because of his everyman quality. McClane seems like an ordinary guy caught up in an extraordinary situation and is doing whatever he can to save his wife and stop the bad guys. This more conventional character makes Die Hard much more engaging because most viewers can see themselves in the movie. Mix in John McTiernan's incredible directing, Alan Rickman's standard-setting villain, and sprinkle in some Christmas music and holiday cheer for extra flavor and you got yourself one of the greatest action movies in history and the best Christmas movie of all time (Don't fight me on it not being a Christmas movie, please. Let me have this.)",
    "41": "I'm amused to learn that this has been voted as one of the best Christmas films. Well, it is set in the run up to Xmas and there are Xmas trees and Xmas parties in full swing, not to mention the obligatory renditions of \"Let it snow, let is snow, let it snow\". However, my idea of a Xmas movie is something that the whole family can sit down to and feel all warm inside! This film is not for the faint hearted and its amazing how this film still feels so contemporary when watching in 2015 when you realise it was made in the late 80's. Bruce Willis was finishing his comedy role in Moonlighting when he starred in this and was the casting director's final choice behind Arnie who turned the role down. What a stroke of luck for Bruce. You have to admire his acting in this film and I couldn't help but think how he is so much better an actor than someone like Keanu Reeves who is so wooden in comparison. Great plot, great characters and I loved the fact the FBI guys were made to look like idiots. Interesting to learn that in Germany, the bad guys were made to be British! Well, that's what you get for casting a British actor, Alan Rickman, to play a German terrorist. Love this film, always worth a repeat watch :-)",
    "42": "John McClane (Bruce Willis) is a New York cop visiting his wife and the family in LA. The Nakatomi Office Building is filled with million dollar treasures and none other then McClane's wife, Holly (Bonnie Bedelia) as terrorists target it. McClane enters the building just as the building is taken over by Hans Gruber (Alan Rickman) and his terrorists. As far as Hans knows it will be an easy job as he holds the people at gunpoint, but McClane has plans for his own as he infiltrates and goes out to stop the terrorists ruining his Christmas-Eve. With the help of the overweight LA cop Al Powell (Reginald VelJohnson) on the ground they are able to surround the building with FBI and make an attempt to stop the thieves from killing anyone, with the help of McClane. There are top thrills and non stop action through out the film. Willis is a powerful force as the smart-mouth cop caught in the wrong place at the wrong time. I knew Alan Rickman had done some great films and was skilled but this one convinced me he is a great actor. The plot is simple, stop the terrorists, but it is done in a way where you never know what could happen next.Die Hard. Starring: Bruce Willis, Alan Rickman, Reginald VelJohnson, Bonnie Bedelia, and Paul Gleason.4 1/2 out of 5 Stars",
    "43": "Willis goes to visit his estranged wife (Belinda) in LA. He arrives at a office party only to discover that terrorists lead by Richman have taken over the building - their motives unclear.This basically set the bar for action thrillers very high. Willis, pretty fresh off Moonlighting is catapulted into super stardom as he is perfect as the NY cop who can take it and give it out. Rickman as well is a gloriously suave, witty and ruthless villain, a perfect counterbalance to Willis. Tense, spectacular, tough and funny, this is a brilliantly written, directed and acted thriller than resulted in 4 sequels - so far. Not to be missed.",
    "44": "One of the best Christmas themed romantic comedies ever made. Alan Rickman was brilliant in the title role: he died......hard",
    "45": "Worth watching from the golden area of moviesYou won't regret it",
    "46": "I think this is a great movie. I love the campy one liners and the over the top action, but it was a great movie. It was well paced and they are no real complaints about the movie. Rickman was amazing and it is one of the best bad guys performances and the one scene when we snaps at John's wife is priceless. It is kind of fun to see how a lot of action movies pull from a lot of stuff from this movie (even though I sure this movie got a lot of it's substance from other movies). One of the highlights of the movie is the music and when the bad guys actually manage to open the vault one really feels a swelling of emotion as the music grows. The one problem I have is that the LAPD is not that dumb and the FBI agents are not that dumb and the fact that Al knew better than both of them was kind of silly, but I did like the dynamic of the two FBI agents and the way they fit into the movie as a bunch of idiots, but it was almost a little too much. The humor they tried to inject with the black guy who was cracking the vault was a little dry, but not to the point where I hated him. The limo driver's smile got annoying too, but I liked his character for the most part. Bruce Willis did a perfect job with the character and played him perfect. I like action films like this where there is unnecessary swearing and violence, but it works and I hate how Hollywood is making a lot of action films with a pg-13 rating when i think it would be so much more enjoyable with just letting them swear and be really violent. I know one does not need the violence, but I think it does so much more for the movie experience by letting the characters express themselves with their violence. The last gripe I have is that the ending with Karl jumping up out of nowhere was totally unnecessary and it really annoyed me. The cop did not need a complete arc and John's and his hug was all the ending needed. This will probably always be one of the my favorite action films.",
    "47": "Where do you go when things in your city are quiet? Los Angeles, \"The City of Angels\". That is where New York policeman John McClane(Bruce Willis) will spend his Christmas at. At least for the holidays, because his wife Holly(Bonnie Bedelia) is living. The holidays are going fine until a group of European terrorists ruin the fun. After taking himself a shower, John is very maverick decides to take on the terrorists with a 9mm, and barefoot. Normally, police offers are very resourceful, for John he really is. The only contact had to go on is LA Policeman Sgt. Al Powell(Reginald VelJohnson) those two kept in touch, until the menace was over. When they finally meet, New York and LA will never clash again! John's limo driver Argyle(DeVereoux White) did his part on taking out the computer hacker(Clarence Gilyard, Jr.) This movie is totally non-stop. It was never a dull moment. The music choices were great, and the surprises never stop. A major keeper! 4 out of 5 stars!",
    "48": "Die Hard is the one. Sure it may not be a traditional date movie, but if you want to be perked up in the midst of injustice in the world, then Die Hard is for you. It's more than an action movie. It's a movie with heart and a dose of humor. Also it had engaging African- American actors in key roles, so kind of ahead of its time in a way. Alan Rickman should have won an Oscar for his role as Hans, and his German accent is impressive even though he's English.",
    "49": "Arguably one of the best movies to watch at Christmas. This action packed hit is a must watch in the festive period. Some of the action is over the top maybe little silly. However this is fun filled adrenaline packed adventure. The cast is Stella and acting good. Most of the characters are likeable and well written. An action packed hit that will make you feel festive.",
    "50": "When people think action - they remember Die Hard. They remember Bruce Willis in his star-making role as that guy in the wrong place at the wrong time. They remember John McClane, they remember Han's Gruber, Holly Generro and Ellis, alright not really Ellis... but everybody will always remember those immortal words, \"Yippee-Ki-Ay Motherf*&ker\" Die Hard is the ultimate action film, packed with all the firepower you can handle and enough C4 to level a building. It's and a genuine no-holds-barred roller coaster ride from beginning to end.With a relatable everyman John McClane, (Bruce Willis in his iconic role - brilliant)and a sinister villain in Han's Gruber (Alan Rickman)Die Hard has the action-genre by the balls and sets a standard in this genre that has never been equaled. \"Welcome to the party, pal!\"",
    "51": "Die Hard is ine epic Christmas action flick and I thoroughly enjoy watching it annually over the festive period. The fact it's a Christmas movie isn't up for debate in my book. It's set during the festive period at a christmas party, plus the loads of Christmas references and quips throughout the film. Also using Christmas music as dramatic score during action set pieces is just genius.Bruce Willis gives a great performance and brings layers and emotional depth to a character that could just be a very 1 dimensional action character. Also props to Bonnie Bedelia for her brilliant turn as McClanes ballsy wife who really holds her own against Hans brought deliciously to life buy a top tier performance from the great Alan Rickman.The action set pieces and stunt work in this film should also be applauded. It felt very grounded and not ridiculously over the top like some action films, or most tend to be.",
    "52": "Basically, \"Die Hard\" is the movie that solidified Bruce Willis' dreams of super-stardom. Twenty five years later, Willis is still on top billed in most of his movies. This surefire Twentieth Century Fox franchise has yielded four sequels, including the latest \"A Good Day to Die Hard.\" In the first film, Willis played a 'loose cannon' New York cop visiting California. He had been a member of the NYPD for eleven years when he flies out to see his wife, Holly, who works with a Japanese corporation at the Nakatomi Plaza in Los Angeles. He arrives for the Christmas Party, meets Holly, gets into an argument with her and then gets separated from the main party with his wife. Everybody is taken by surprise when a German terrorist and his minions storm the Nakatomi Towers. They take everybody hostage, but they slip up and miss John McClane. The terrorist leader, Hans Gruber (Alan Rickman of \"Galaxy Quest\"), wants to steal the $640 million in negotiable bearer bonds in Mr. Takagi's company safe. Along the way, Gruber has a person duel with our hard-headed hero. They chase him around the building and at one point, he wraps a fire hose around his waist and flies through a window with a machine gun in his fist sputtering rounds. This is one terrific actioneer.",
    "53": "Die Hard is a Christmas movie directed by John McTiernan that's not traditional at all, but still watched each year during the holidays. Die Hard serves as an alternated holiday movie. Die Hard opens up with off duty New York Police Officer John McClane (Bruce Willis) attend a Christmas Party at Nakatomi Skyscrapper with his wife in downtown LA. Out of nowhere the plot kicks in the door as German terrorist and thieves take the people in the building hostage and start to make demands to the police. The group is led by Hans Gruber (Alan Rickman) a brutal man whom able to have casual persona and an an intimidating one in a few seconds. Hans also had a casual attitude to killing even willing to kill his own men. Alan Rickman is able to show that Han has a curt attitude to people whom he did not know and jokey nature with those he knew. Alan Rickman is able to make him out to be somewhat of a suit. He flaunted his knowledge and boast of his education to anybody, but McClane manage to slip from his grip. The film follows his exploits as he slowly engages the German terrorists one by one barefoot to retake the tower while dealing in depth of personal pain. The broken glass on his barefoot can be seen as his Achilles's heel. McClane lacks heroic virtues and qualities like Achilles. He can be explains to be a Byronic hero or Anti-Hero by having similar traits to those who like being arrogant and cynical. He is also cunning and able to adapt. He has a dis-tasted for social institutions and norms when he was at the party. John McClane works better alone than in a crowd. Die Hard gives their hero, a cutting edge from cookie cut heroes. What Die Hard does well is keeping a small scale budget while exporting a big blockbuster result. Most of the movie takes taking place entirely within a few floors of the Nakatomi Plaza. It was one of the first of the limited-space, small cast action films. This formula of putting characters in limited area spawn great sequels in their own right, but also an entirely new sub-division of the action genre. The movie is condensed in a few scenes and areas that get so well know. It simplified in such a way that lets the characters and the action really develop and shine through. While having a few explosion-filled sequences, the movie allows the audience to care for the characters and not feel like disconnected from the story-arch or the depth of the characters portray. The movie takes light-hearted approach to the genre, incorporating many less-than-serious elements and one-liners keeps the movie fun and enjoyable no matter how many times watched through, but it comes with a cost. Sub-characters in the film seem corny, low-intelligent or bad written. The scenes with the LA police for example drag the movie down and slow it down. The film brings in Reginald Vel Johnson playing a role as a cop which doomed the actor to playing cops for the rest of his life. He continues to be type cast to this day. Reginald Vel Johnson's character has a trouble past where he accidentally shot a kid and now wouldn't be able to shot. While they did give some back-story to Reginald Vel Johnson character, most of his lines were bad and his actions in the movie are nearly useless. All the main characters in this film are fairly complex and well written compared to most of the dumb action hero movies of the 1980s. Still the police chief doesn't serve any purpose except for delaying police intervention which would have wrapped the story up faster. Matters would have been more easily solved had the chief acquired an average intelligence. Since the sub-characters took a backseat, the character of McClane and Gruber makes the movie watchable. The sarcastic nature of McClane's character against the whimsical Gruber makes this hero and villain pairing one of the finest in film history. The movie even makes a famous quote out of its hero's swearing mouth that can be still heard today. The language can be harsh and the violence too much but it's a good movie. The plot might seem rudimentary and unoriginal today, but it still one of the first movie with many of the things action movie need to be a success. It's the blueprint to any action movie today.",
    "54": "This movie is one action-packed ride. Bruce Willis (John McClane) is a New York cop coming to see his wife who has moved to L.A. with their children, hoping for a relaxing Xmas vacation. Instead, he gets a bunch of bad guys who have taken over the Nakatomi building which he and his wife are located in. He hides out, and takes out the bad guys one by one, all while trying to get police attention from the outside world. This movie is tense and full of action. Bruce Willis and Alan Rickman put in outstanding performances. Willis manages to kill all of the bad guys and throw Rickman off the building. If you haven't seen it yet for whatever reason, now is the time to do so.",
    "55": "John McClane is a cop from New York who is on his way to Los Angeles to see his family. Holly, his wife moved to LA because of a job at the Nakatomi Corporation. When he arrives at Nakatomi Plaza, he and Holly go into a private bathroom and get into an argument. When Holly leaves to give a speech, thirteen armed terrorists lead by Hans Gruber seize control of the building and take the occupants of the 30th floor, who are the only ones left in the building, hostage. Luckily, they missed John and he has to figure out how to save the hostages before its too late.....Joel Silver changed the way action movies were to be made with this phenomenal movie. No longer were action heroes going to be a force to be reckoned with, McClane is a human being, vulnerable, and this is the films strongest point.Willis has never been better in his star making role, and is more than ably supported by the likes of Veljohnson, Bedelia, and Bochner.But the film is stolen from everyone by one Alan Rickamn. To this day, there never has been a better screen villain, and it's not because of his evil-ness, its the fact that the man is so normal and just so laid back, its as if he's just attending a business meeting.The action is taut, and despite the fact that the building is huge, it's a very claustrophobic movie, that never lets go of you once we hear the first gunshot.Hilarious in places, very gut wrenching in others, but always thrilling, Die Hard is not only the greatest action movie of all time.In my humble opinion, it's the greatest film ever made.",
    "56": "Excellent fighter with Bruce Willis. Excellent statement and is enough within staginess of realism. Here and still Alan Rickman perfectly wins back. After such movies you do not understand why most of fighters of the last years look so indifferently, passed more than 30 years.",
    "57": "There are countless examples as to why this movie is THE classic 20th century action flick. I want to focus on one. The scene where Hans pretends to be a hostage that got away. He has a run in with John McClaine. John McClaine gives him a gun. Almost immediately Hans betrays him, points the gun at him. The jig is up. But McClaine handed him an unloaded gun. Hans threatens McClaine, pulls the trigger and....click click click. Hans realizes the gun is unloaded, and just then the elevator opens and the rest of the terrorists come out guns blazing, leading to a new series of events that McClaine must overcome. In a lesser movie, a whole third of the film would be dedicated to John and Hans pretending to be an escaped hostage. It would have dragged the movie to a halt and added an unnecessary layer of suspense. But here, in Die Hard, the whole series of events takes 3-5 minutes, and then onto more action. It keeps it light. The whole movie moves swiftly. PACING.",
    "58": "Yeah that's right, you heard me love, actuallyYou either love Die hard or you are wrong",
    "59": "Just seen a re-release of this tonight at my local for the first time in ages & was impressed!The film is about John McClaine, a NY Police Officer who attends a Christmas party on Christmas Eve only to be suddenly up against a group of German terrorists who plan to rob the place & take out everyone inside, including his ex-wife. It's a race against time for John to stop the terrorists before it's too late.The film is action packed, not non stop action as they're points where the film has character development scenes in it, which is fine as long as they don't drag on too much. Which they didn't thankfully, but yeah the film definitely doesn't disappoint in terms of action.But to say this... IT'S NOT A CHRISTMAS FILM!!! Just because the film is centered around Christmas & has a couple of Christmas themed references in it, DOESN'T mean it's ABOUT Christmas! Had to say that as this argument still even 30 years on is still being debated!Overall, a great action film!8/10",
    "60": "This was truly a ground breaking movie and that's saying a lot since it's an action movie which are usually just mindless fun big explosions going off kind of cinema. Not that there is anything wrong with that mind you.But this is the first big action movie to where it wasn't about an army superman taking down the bad guys. It was about a regular everyday cop who while he also stops the bad guys does it in a fairly believable manner. No ridiculous stunts where you go \"yeah right\"(that takes place in Live Free or Die Hard though).Bruce Willis plays the cop character John McClane which took him from being a TV actor to being a movie star. And not only does his character save the day but he does it while not even wearing shoes.",
    "61": "The greatest Xmas film ever made. Action, drama, holiday cheer and a cowboy running around a highrise building with no shoes fighting an elite team of euro-trash. Seriously, after watching this again it is a no brainer. All the other Diehard films can not even be compared to this classic blockbuster.",
    "62": "Coming off of Predator, director John McTiernan was on a roll making a very different, but also an instant action classic with Die Hard. This movie also turned relatively unknown actor Bruce Willis into a big star instantly. Bruce was a different kind of action hero than Stallone or Schwarzenegger, being much more of an everyman than a jacked up killing machine. He plays a heavy duty cop caught in a building that is being taken over by terrorists that his wife is also held hostage by. This is really well done, nicely shot and put together. The story flows well with tons of great looking action scenes and explosions. The acting is also very solid with Bruce Willis truly rising to the occasion as leading man. Also, Alan Rickman gives a super strong cinematic debut as terrorist leader Hans Gruber, who is easily one of the best screen villains of all time. Hollywood tried copying this formula for years to come. I personally, don't like any of the sequels and the ripoffs like Speed, Cliffhanger and Con Air are pure crap in my opinion. But, Die Hard is really solid and really holds up. Essential action, an absolute classic.",
    "63": "Outdated, but easily surpassing the \"look what I can do\" CGI poofs. All you need is a good script,pace, acting and direction. The rest is eye candy.",
    "64": "Die Hard is my one \"must watch\" movie in the Christmas holiday season. Since 1988 (the year it was released) I have watched it every year. I just finished watching it in 2022 and it's still not dated, still relevant. Father Nathan Monk called it a \"reverse Hallmark movie\" because the girl went to the big city, became wildly successful in her career, and the boy followed her. Monk wasn't wrong. Others have talked about all the things that make this movie great, and they were all correct. It's truly an iconic story with iconic characters and the female protagonist is just as kick-ass in her own way as the male. When Holly was so assertive with Hans Gruber and, later, when she punched the asshole reporter, you could see why she was the perfect mate for John McLane.And, as the meme we always see on Facebook proclaims, \"It's not Christmas until Hans Gruber falls from Nakatomo Plaza!\"",
    "65": "Without a doubt one of the greatest action movies of all times, this one grab you from the start and doesn't let go. It is a mixture of comedy, a little bit of pathos, ironically some holiday cheer and a pace that never lets up, making you forget that the movie is over 2 hours. It is also the best movie of Bruce Willis's career, and one of the few movies that I can honestly say that was worthy of sequels and follow-ups. Tough New York Cop may not be Eddie Murphy in Beverly Hills, and indeed, this could be called Century City Cop. He's a New York cop in Los Angeles for the holidays, to visit his estranged wife and daughter, and when taken to the building where his wife is at a holiday party for her employer, he becomes involved in a hostage crisis headed by that villain of all villains, Alan Rickman, in the role that capitulated him to villain stardom.I can say honestly that the details really don't matter, but it's nice to know what the goal of the villains are. There's also great conflict between the various law enforcement agencies involved particularly Los Angeles cop Reginald VelJohnson and obnoxious federal agent Paul Gleason, igniting the script with his usual snark and topping his performance in \"Trading Places\" and other films where he played obnoxious authority figures. The scene stealing De'voreaux White had me in hysterics as well as Willis's chauffeur who sits in the garage throughout the entire movie like a Greek chorus, getting the best reaction to everything going on, and Bonnie Bedelia is great as Willis's wife. The terrific James Shigeta shines in a small role as the corporate executive who pays the price for being a target rlof Rickman's agenda.But the real star is Willis, making the audience root for him as the superhero who manages to gain the upper hand on rickman's Associates early in the film, and every time he kills one of them, I'm sure the audience in the theaters were clapping. The last hurrah goes to VelJohnson however, and by this time, my hands were sore from applauding the end of these bad guys and Bedelia who gets a good swing at an obnoxious reporter who asks a very stupid question as everything is wrapped up. This is a type of film to that would have the entire audience leaving with huge silly grins on their faces, because it is so crowd-pleasing. One of the greatest final photographic shots ever of a character is the one given to Rickman, done in perfect slow motion and oh so appropriate.",
    "66": "A while after the movie started, I noticed something. It's a spoiler. There's a scene where the main character is in trouble and is in danger...but he's okay. But you see something that's why it's ok first. That doesn't make the viewer very nervous. Why does the director make these mistakes? When I was watching it, I thought... the most interesting idea comes at the end of the film. The one that needs to be spoiled first. It's very unique scene so it need spoiler. That's the answer that I thought why there were spoilers. To me, that was the most interesting thing about this film.\nBut for people who aren't visual geeks like me, I think the story was the most interesting thing. The script was really well written and the actors were perfect, so it's a masterpiece that I can't complain about. Bruce Willis became a big star with this movie.",
    "67": "I don't care what some people say, this is definitely a Christmas movie. The story wouldn't happen if it weren't the holiday season, they say Merry Christmas, it's integral to the plot. I'd also call this Bruce Willis' breakout role as a lead hero in an action movie. Not much wrong with this classic. Yippee-Ki-Yay, mothertrucker!",
    "68": "\"Die Hard\" has inspired countless replicas in the decades that have passed since its release. Everything from \"Air Force One\" (\"Die Hard on a Plane\") to \"Speed\" (\"Die Hard on a Bus\") throughout the 90s and early 2000s drew near direct inspiration from the film.Aside from its influence and near immortal status as to how to create an almost infinitely rewatchable popcorn movie, \"Die Hard\" earns its credit from me for its pacing. The slow buildup of the terrorist takeover, the realization of the outside world of what's going on in the Nakatomi Building, and John McClane (Bruce Willis) slowly taking out bad guys as he unravels the true intentions of the terrorist group.Special props to the cinematography (love the use of Dutch angles in this one) and also the incredible performance of Alan Rickman as the slimy Hans Gruber.",
    "69": "Back in 1968, 20th Century Fox released The Detective. Based on the book by Roderick Thorp and starring Frank Sinatra, the film was quite successful for the studio and Thorp would follow up with a sequel book in 1979 with the story following Sinatra's character named Joe Leland attending a Christmas party with his daughter when a group of German terrorists show up and take over the building. 20th Century Fox had expressed an interest in adapting the book into a film but given that Sinatra was obligated to appear in the film, he would have to be offered the part but with Frank being in his 70s, he turned the role down. There were rumors making the rounds for years that the film was going to be a recycled screenplay for the intended sequel to Commando but that was never the case. With Sinatra out of the picture, it gave them the chance to change the characters and remove the connection to the previous story. WIth Joel Silver producing and having worked with director John McTiernan on Predator, Joel felt he would be the right director to bring Die Hard to life. However, McTiernan didn't like the early drafts of the script and turned the offer down several times and only took the job after being convinced to do it. Feeling the screenplay to be too mean-spirited and wanting to lighten up the film a bit, McTiernan decided to add in humor so that the audience wouldn't despise the villians. John also didn't want the villians to be terrorists ether seeing that direction as too distasteful for a summer blockbuster so he decided to stay away from the terrorists' political views and focus more on them being professional thieves in search of financial gain feeling that this would make Die Hard more appropriate for moviegoers. When it came time to casting the lead for Die Hard, names like Harrison Ford and Clint Eastwood were offered the role of John McClane, but both of them turned the role down. Bruce Willis eventually got the role, seeing it as a chance to expand his acting range and do a different kind of film with Die Hard. Shooting began in November of 1987 and finished in March of 1988 with the 20th Cenrty Fox headquarters filling in for Nakatomi Plaza. When the film was released in the summer of 1988, It wasn't well-received by film critics but it still did well at the box office. Over the years, Die Hard has been more warmly received by both critics and the moviegoing public as it's level of filmmaking and storytelling have been given more respect.Now, my experience with Die Hard is next to non-existent as I never had the chance to see it when I was younger and only got around to watching it late last year. Given that I'm a big fan of action films like Raiders of the Lost Ark, a film like Die Hard feels right up my alley. After watching the film, I can certainly saw that Die Hard is easily one of the best action films ever made thanks to it's screenwriting, John McTiernan's solid direction, the performances and it's storytelling qualities. With the current crop of mostly generic action films, Die Hard still stands on its own in the world of action cinema.The film begins with New York police officer John McClane arriving in Los Angeles intending to reconnect with his alienated wife Holly. John is driven to the Nakatomi Plaza to attend a Christmas party and soon meets up with his wife. At first, she is pleased to see him but things quickly turn sour as the tension between them begins to show. As Holly leaves, John gets himself ready for the party. Meanwhile, a gang of professional thieves masquerading as terrorists led by Hans Gruber seize control of the plaza, and only McClane evades capture. Gruber takes Nakatomi executive Joseph Takagi hostage and questions him on the access code to the building's vault but Takagi refuses to cooperate and is killed by Hans. In an attempt to alert the authorities, John gets into a fight with one of Gruber's henchmen and uses his radio to connect the Los Angeles police force. A police sergeant named Al Powell is sent to investigate but finds nothing unusual and prepares to leave but McClane tries to get his attention by throwing one of the dead bodies onto his squad car but this alarms Powell causing him to crash. The rest of the Los Angeles police force arrives on the scene but d nothing to help the situation. Now, John is on his own and must find a way to stop Gruber and save the hostages.In the world of moviemaking, creating the perfect action film that is able to give the viewer an exhilarating thrill-ride while also making them care about the characters onscreen is never an easy task to pull off and every guideline that dictates such actions always has a number of exemptions to this rule. Unlike Rambo and Predator, Die Hard went against all of those rules mostly with the rule of not amping up the action in an effort to have a majority draw. Having shown in Predator that he could handle both captivating sci-fi themes as well as nerve-racking tension, John McTiernan was the right guy to tell the story of a New York policeman facing overwhelming odds and adjust it for the 1980s action crowd and while the movie is nowhere near as explosive as say Comanndo or Rambo III, it nevertheless endures as an appealing and smart action film that doesn't insult or talk down to its audience unlike action movies like Transformers: Age of Extinction or Robocop 3.Nowadays, action movies like Skyscraper, A Good Day To Die Hard, and the Fast and the Furious movies have become identified with idiotic and cheesy dialog, cardboard characters, redundant storytelling, and horribly shot action scenes that it's now easy for audiences to forget the brilliance and improvements directors like McTiernan, Cameron, and Spielberg brought to the genre. Die Hard was such a revelation in the action film genre during the '80s that for the next half-decade, moviegoers were treated to a multitude of Die Hard clones from Speed to Under Siege. Even if people can't agree with each other on whether or not Die Hard is a Christmas film, it's still incredible that John McTiernan's 1988 action classic still stands tall amongst many other 80s action films. Like Nakatomi Plaza, the film seems to dwarf most of the competition and it's not because Die Hard does anything particularly new or interesting with the action film genre but merely because the film uses all the conventions and cliches of action films extremely well as well as not treating its story beats as mere check-list items.It's not hard to see Die Hard as a Sylvester Stallone film in some ways. If the film was released in an alternative reality with Stallone as the lead, it would just another run-of-the-mill 80s action with tons of explosions and gun battles but with generic stock characters and a lack of tension and would have been forgotten by all but the most die-hard 80s action film fans. Sure, the makings of the film are fairly simple with a police officer trying to make amends with his wife, a British villain, a situation where people are being held hostage, explosions out the ass, and the usual confrontation between the hero and villain. If Hollywood made cookbooks for making a mainstream action film, all of them would say that directors and writers should use the basic ingredients of filmmaking when making an action film. Now, if a lesser director and a lesser cast of actors tried doing a film like Die Hard with a lesser screenplay, it would feel forced with cliched plot points one would have to check off before enjoying the gun battles, explosions, and all the predictable action film troupes moviegoers pay to see.Judiciously, Die Hard does work as a film because unlike a film like Speed 2: Cruise Control or Ballistic: Ecks vs. Sever, Die Hard actually is interested in what is happening to the characters. Despite this not being essential for a solid action film, there's really no sense of responsibility. John McClane's vacation to Los Angeles to reconnect with his family isn't just used as a plot point to get us to the action scenes or to try to make us at least feel some sort of sympathy for him, it feels much more steadfast on its own terms because we are given time to see John and his wife interact with each other and see why their marriage is on the rocks. It's the small things that make the opening sequence work like John not knowing what to get his kids for Christmas or his fear of flying. In a way, these moments may feel like they belong in a bad family melodrama but with Steven E. de Souza's witing and McTiernan's directing, they feel more genuine and heartfelt and therefore make the film all the more wonderful.That now brings us to the hero of this film: John McClane. In the world of action films, John McClane isn't your stereotypical tough guy. He's not an invincible killing machine unlike say Rambo or John Matrix from Comanndo but rather an ordinary cop from New York and to some, an icon of 80s' masculinity. He's uncouth, hostile, unsympathetic, and aggressive. He's never without a cigarette in his mouth. He's scornful for any sort of advance and even a bit sexist. He's estranged from his wife, suffers from jet lag, and is stuck in a scenario he's not comfortable with. Despite these faults, John is still a good-hearted person and is devoted to his job and wants to help people and do the right thing, but his personal life as well as his relationship with his wife is a hassle for him to manage, thus showing that he's more focused on his job than he is on his family. This makes the character incredibly relatable to so many people. John's masculinity is one of the core themes of the story. Hans Gruber continually compares McClane to a cowboy. John's heroism inside Nakatomi Plaza is mismatched with the more in your face mockeries of 80s' machismo such as the coked-up white-collared worker Ellis whose snobbish and degrading manner towards Hans is what gets him killed and endangers McClane considerably. There's also the administrativ",
    "70": "This is one of my favorite movies of all time. Bruce Willis is amazing as John McClane. Alan Rickman is perfect as the quintessential bad guy as Hans Gruber. These two characters facing off makes for a perfect mixture, adding in the roles of Holly Genero McClane (played by Bonnie Bedelia), Sgt. Al Powell (played by Reginald VelJohnson) and Karl (played by Alexander Godunov).I watch this movie at least once a year because, even though it was released 25 years ago, it is a classic. This is the one that started the Die Hard franchise. And has continued to be built on since the franchise is now up to five movies.The movie is fairly slow until Gruber and his cohorts take the 40 story Nakatomi tower and everyone inside hostage. This includes John McClane and his estranged wife, Holly; John is a NYPD detective on vacation visiting his wife and children for Christmas. When Gruber and company take charge John is thrust into saving the day and taking out the terrorists. Amazingly, he does this all while barefoot.This movie made Bruce Willis's career. Without this movie in his portfolio there is no telling where he would be today. On the other hand, without Bruce Willis there is no telling how successful the Die Hard franchise would have been. Alan Rickman also made the perfect bad guy, and there is no telling how well this movie would have done with someone else in that role.",
    "71": "'Die Hard (1989)' truly is the definitive action film. It is endlessly quotable, consistently entertaining, fantastically written, expertly directed, enthusiastically acted and an all around good time. Its only flaw is the occasionally obvious stunt double for Willis, which really is a minor gripe. It is easily one of my all time favourite films. An all-around classic. 10/10",
    "72": "One of greatest action films ever produced, with a case to be made for the the absolute pinnacle. Everybody knows what's right with it -- self-contained setting, ever-escalating stakes, fantastic hero & villain, tons of interesting characters on all sides, SFX that hold up nearly 30 years later - - so here's just a couple things that might challenge its claim to #1 Action Film trophy: Too many unbelievably stupid characters challenge suspension of disbelief, and the 80s hair and fashion date it just a trifle. But even the former are good for a few laughs, and the latter is a very minor complaint.Otherwise, \"Die Hard\" is pretty much flawless. Bruce Willis, John McTiernan, Alan Rickman -- their finest hour (maybe you could make a case for Rickman's loftier work, but he's dead solid perfect here). A movie I have seen more than any other but for \"Casablanca.\"",
    "73": "The irresistible force meets the immovable object in John McTiernan's masterpiece. De'voreaux White plays former cabbie Argyle, knocking the audience's socks off whether holding an ornate Nakatomi-logo name placard or rocking out to the sweet sounds of Stevie Wonder. A stuffed bear and CB-radio enthusiast, Argyle finds himself locked in a parking garage below a tower of terror.Argyle's nemesis, Theo, is a brilliant hacker and leader of a mostly European gang of henchmen. Inspiring Bruce Willis' later oil-drilling documentary Armageddon, Theo's technique with a spinning bit is unparalleled as he slowly breaks into a tightly sealed treasure chest/vault.As various intertwined subplots ensue involving a barefoot cop, an itchy-trigger-finger twinkie addict, a judgmental gas station clerk, a bearded yuppie corpse, a tiny-footed telephone anti-repairman, the last man to ever eat a Mars bar, and a Dusseldorf School of Drama American-accent-class dropout, our hero slowly realizes that he is trapped in a stretch version of hell.Despite the distractions above, Theo manages to singlehandedly escape the 30-story high chaos and load his loot into a well-disguised getaway vehicle. Only Argyle can save the day with the best right hook since a young Mike Tyson. Fittingly, Argyle is given the last line in the film as the credits roll.10/10",
    "74": "They just don't make movies like this anymore, Hollywood is has been in a slump for a ling time. Great Christmas movie!",
    "75": "DIE HARD is a one-of-kind action movie that has a breathtaking pace and offers plenty of wits between McClane and Gouber. Bruce Willis gives an excellent performance as McClane, the ordinary guy who has entered the wrong scenario at the right time. Alan Rickman made a terrifying villian, Hans Gouber. Bonnie Bedella was annoying but hysterical as a wiseacre ex-wife turned hostage. The direction by John McTieran (PREDATOR, THE LAST ACTION HERO) was not short of being superb and first class.DIE HARD is one action packed movie that offers thrills, excitement, and plenty of fast paced humor and wisecracks from Willis. The action is fast and furious, and the film pulls enough punches to keep the energy flowing! DIE HARD is simply one of the most cinematic action masterpieces ever. It is often a rarity to see such a white knuckle adventure that keeps you on the edge of the seat throughout the entire film. Bravo!",
    "76": "Bruce Willis is perfect as off duty New York cop John McLane, who turns out to be the right guy, in the right place, at the right time, when suspected terrorists strike. Once the action starts it's thrill a minute stuff as we watch Maclane trying to sabotage their plan against impossible odds. Some fabulous action scenes including a now iconic shot involving a fire hose as fall arrest equipment! The action and high tension is punctuated by fabulous snappy dialogue between McLane and chief villain Hans Gruber played superbly by Alan Rickman. Still packs a punch over 30 years after its release. Reginald VelJohnson has a nice cameo as the local cop drawn into the events.",
    "77": "I've never understood the rampant admiration for this movie. As far as inane American action films go, it's barely even amongst the better ones- let alone a classic. Every single character is a walking cliche, complete with corny Bond villains, arrogant cops, witty black chauffeur and swooning love interest. Bruce Willis is uninteresting and arguably a little irritating while Alan Rickman simply deserves better than this awful writing. The amount of plot armour that Willis is given takes all the suspense out of the film and makes it a rather arduous experience. I have no problem with this genre of movie but Die Hard lacks the atmosphere of The Terminator or the charm of Raiders of The Lost Ark. A very forgettable experience.",
    "78": "so heres a career defining movie that made a star name out of Bruce Willis and changed the action man film forever as john mcteiernan made a reunion with his producers from predator who saw a book called nothing last forever about suspenseful story about terrorist and hostages so when they started looking for police office john McClain they saw a young Bruce Willis who as the character was a no nonsense sense of humour who didn't get technology so with his keen sense of what is going on so when he looks for his wife in nakatomi building he goes he accidental stumbles upon a heist of sorts and hides so with the ringleader and his Hench men after 650 million in bearer bond hands grubber played by a brilliant Alan rick man who looks scary and brilliant and menacing hey defined his movie career out of this so any way with McClain thinking about his idea to thwart the terrorist in the building hey goes to action as everyman but has no way of contacting the police on the outside In his battle to save his Holly, McClane is scorched, torched, beaten and blown up. He jumps off the roof and falls through air ducts. He uncovers deception and double-cross and picks broken glass out of his bare feet. No help comes from the naive and incompetent police, who are unable to get inside, and even less from the FBI. McClane is not a super cop. He is an ordinary guy, who doesn't want a fight. When he is shot, he bleeds. He hurts. All he has are his pants, his vest, his gun - which runs out of ammo. This is the first realistic connection the audience has. When you don't want to be in McClane's position, it makes for much excitement. John McTiernan, who's only previous mainstream movie was Predator, uses awesome photography and technical skills to give the film a truly polished and sophisticated look - it was nominated for four technical Academy Awards. He also allows for enough time for decent character development, most of which comes between McClane and a cop (Reginald Veljohnson) he makes friends with on a CB radio.Die Hard manages to be heart-pounding and teeth-gritting every single time. And if you are one of those many people who have only ever been able to watch it on TV then now is definitely the time to rediscover a cool, classic and creative action picture.its hard to believe Richard gere was going to McClain its another Christmas film with difference 9/10",
    "79": "Great action movie, I enjoy watching the movie so much, The action scene was so great, The Visual Effects in the movie was great, I like John character, The villain was great, The comedy scene was so funny, I don't understand how karl live in the movie ending, I recommend watching it and my rating is 8,5/10.",
    "80": "This trip around Nakatomi Plaza is just straight badassery. No other word can describe Bruce Willis straight up murdering all of the bad guys. And the littlest details that are sprinkled throughout, the character development, it all so great. I loved this film and it gets a 10/10.",
    "81": "Even if the non-action parts are a tad slow in comparison, that is more than compensated by so many things that makes Die Hard so brilliant.For one thing the action is explosive and consistently exciting, and the cinematography is astounding being very inventive and colourful. John McTiernon(The Hunt for Red October, Last Action Hero) directs briskly and efficiently, and the pacing a vast majority of the time is exhilarating.Then there is a terrific score by Michael Kamen, some intelligent and witty scripting and a plot that doesn't feel forced or convoluted. Not to mention some excellent acting. As good as Bruce Willis is, yes his character is somewhat two-dimensional, but he is also resourceful and world-weary and Willis handles this really well, it is Alan Rickman who steals the acting honours as Hans Gruber. Gruber is cold, calculating, suave and menacing, in my opinion only Rickman could do justice to such a character. Overall, a superb movie, not only the best of the Die Hard franchise but one of the best of the action genre. 10/10 Bethany Cox",
    "82": "This original action classic has been hugely influential over the years - and it's no surprise, as it's one of the best action thrillers ever made. New meaning is brought to the word \"action\" as here it is exhilarating, furious and nothing less than exciting. The premise is simple: one location, one good guy and twelve bad guys. Cue lots of explosions, fist fights, blood, violence, and plenty of shooting too. The thrills come from the suspense of Willis using his wits as well as his brawn to fight the bad guys and save the hostages.When watching this film what becomes immediately apparent is how fresh it is. This hasn't been filmed with some cheap cameras for a quick buck, it looks professional and couldn't be less polished. The photography is clear and brings out the best of the surroundings, while the music has obviously been carefully chosen to convey the right mood. And, strangely enough for an action film, the acting is actually very good. Unheard of, as remember this was back in the days where Schwarzenegger and Stallone were the top stars of the action genre. Bruce Willis excels as the wisecracking, sardonic cop, and you can't fail to like him. He's consistently witty and provides a powerful presence when needed - it comes as no surprise as he lived off this image for the next six or seven years.The supporting cast aren't half bad, either. The reliable Bonnie Bedelia takes a break from her usual highbrow, \"moral dilemma\", television movie fare as Willis' tough wife, while Reginald Veljohnson is also great as a sympathetic cop - you just want to hug him. But most memorable of all is Alan Rickman for his excellent turn as the cool, calculating terrorist with a carefully-crafted German accent and a fine line in natty suits. Rickman is THE bad guy of modern cinema, watch any subsequent action film with terrorists and you'll see people trying to be him. He's that good. The rest of the cast of terrorists have all been picked for their imposing looks, and they're not bad either. Keep your eyes peeled for fearsome Bond baddie Robert Davi in a minor role as an FBI man.As well as the tense running around in corridors and stand-offs between Willis and the various creeps, this film really delivers in the action stakes. The guys here really do look like they are trying their hardest to kill each other, and we get people flying down stairs, getting chains wrapped around their necks, getting shot all over the place. Every kill that Willis makes is original and exciting. There are also plenty of ace stunts, like when Willis jumps off an exploding roof with only a fire hose tied around his waist. The gore level is high, graphic in fact, with people being shot apart wherever you look, and it's definitely a film for all cinema fans to enjoy. Consistently entertaining and strong enough to withstand repeated viewings, this is the first and final word on the \"one guy versus lots of bad guys\" sub-genre of the action flick.",
    "83": "In stepped John McTiernan and Bruce Willis with Die Hard. Willis, most famous at the time for the comic TV Series 'Moonlighting', made a perfect ordinary-man-in-an-extraordinary-situation action hero. He was believable as John McClane and not immune to being hurt. He bled and felt pain, a first for the genre. And yet his cool confident delivery of a great wisecracking, intelligent script made him all the cooler. But most credit should go to Director John McTiernan, king of the sophisticated action flick. He made action movies slick, smart and full of pace and wit while never letting up on the bullets, cars and bombs front. Special praise must go out to Alan Rickman too whose performance as chief baddie Hans is to this day one of cinemas finest, moving convincingly from cool, calm and collected to desperate and nervous, never once seeming anything less than utterly ruthless and calculating. Even after we discover that Hans isn't there as a political terrorist but simply as a thief, he loses absolutely no villain credibility when he responds to Holly McClane's criticism by saying \"I am an exceptional thief, Mrs. McClane and since I'm moving to kidnapping you should be more polite.\" Although we know Hans is capable of vile acts, he actually sees those as merely means to a greater and somehow justifiable end. His disposition is almost humanitarian and you would imagine him as quite a gentleman outside of the context of the crimes he commits in Die Hard's arc. In the end though, Hans is a pure sociopath that even the audience is conned into sympathizing with. I would actually argue that Die Hard is the greatest pure action film ever made. Yippie-ki-yay *muddy funster*... and happy holidays.Overall rating: 9 out of 10.",
    "84": "In the late 1980s, Director John McTiernan refined the action film genre with this action- packed thriller that not only stars Bruce Willis is the role that defined his career, but also brought impressed audiences everywhere with ecstatic action sequences complete with amazing practical effects, inspiring characters, and one of the most original scripts for an action movie written for its time. This movie stars Bruce Willis as John McClane, a New York cop who heads on vacation to Los Angeles for the holidays, to spend Christmas with his wife Holly Genero (played by Bonnie Bedelia) and kids. Upon arriving at the Nakatomi Plaza building where she works, he and his wife ended having an argument dealing with family matters. Their dispute is eventually interrupted when the building becomes under attack by a dozen German terrorists lead by the ruthless Hans Gruber (played by Alan Rickman) who's intent on robbing the company of its money. Pitted against overwhelming odds and Gruber's diabolical mind, John McClane must take matters into his own hands and fight off the terrorists who have his wife, along with hundreds of innocent civilians held hostage, with no aid from the Los Angeles Police Department who are helpless against the terrorists' overwhelming power.My family and I catch this fi on cable almost every year during the Christmas season and this never gets old. Unlike other action films from the 80s that spit cheesy little one-liners and mindless gun shootouts, this film presents viewers with a very likable protagonist who is self aware with his flaws and has feels very human, a Villain who is near equally likable and incredibly smart, and the dialogue between these two characters (which are spoken via walkie-talkies for the majority of the time) is very witty and clever that keep viewers' attention. The main character John McClane spends most of the time fighting off the terrorists who are lead by Hans Gruber, and the scenes are exciting to watch. Glossing with intense gunfights, explosions, stellar camera-work and fight choreography, the scenes keep viewers strapped to their seats. In the scenes when the action lightens up, there are some interesting conversations between characters like McClane, who at one point, shares a tender moment with a cop by admitting his flaws as a husband and a man as a whole. These moments are make you feel for the character and are presented in a realistic way and not sappy way. Bruce Willis does an excellent job as the main character and his performances him as the action hero he is today, along with his famous line \"Yippie Kay Yay, motherf***er\". The same can be said about Alan Rickman is gives off a performances as the one of the most charismatic antagonists ever put on screen. What really impresses me about this film is the action set pieces. The Nakatomi Plaza that serves as the film's main setting (at least during the beginning) is shot nowhere other than Twentieth Century Fox headquarters. Quite interesting!Die Hard is one of the most influential action films ever made and shines with nearly every aspect an action film needs. It is a good movie for viewers to pop a bag of popcorn, sit on the couch, and watch. Director John McTiernan did a fantastic job with this film as well as the cast. This film is a textbook example of what action films need to be and a movie that every action fan should not miss.",
    "85": "\"Nine million terrorists in the world and I gotta kill one with feet smaller than my sister.\" Well, what else can I say besides that this is \"THE\" (can't stress it more) action movie from the 80's with a young Bruce Willis. Personally, I don't even know how many times I've seen this movie. \"Die Hard\" remains an example for all action movies that followed. At that time you had the Sly and Arnie action movies. But these were more a performance of brutal violence, with big muscles and a sense of invincibility. Bruce showed a clever, shrewd, caustic action hero, who can take a beating, but on the other hand shows that he's not completely invincible.Of course, the action in films nowadays is much bigger, more impressive and mind-blowing, but the strength of this film is the story, the accumulated tension, lightness and the dry humor of Bruce Willis. From the first minute he takes you in his grip, and he won't let loose. You see him slowly evolve from a wrinkle-free clean-shaved top cop into a reasonable damaged hero. This pattern keeps coming back in the next two parts, which are also top movies of the same caliber.You'll notice this is already an old movie because for instance lighting a cigarette in a public place isn't prohibited. But how the action scenes are imaged, is still top-work and should be the aim for many action flicks.I think the sudden confrontation between Gruber and McClane is one of the strongest scenes in this film, along with the well known \"Yippie-kay-yee\" cry. Trademark of Willis. The fact he likes the character of McClane a lot, you see clearly in \"The Last boyscout\". In that movie he plays an impoverished detective with the same coolness and cynical, dry humor as McClane. Too bad that in the last two Die Hard movies, McClane is only a shadow of himself like in the original movie.\"Die Hard\" is one of those rarities in movie land, which you can watch without thinking \"Pfft Again this movie\". It remains, for me, an enjoyment to watch.More reviews here : http://bit.ly/1KIdQMT",
    "86": "(In brief)\nBy any measure, \"Die Hard\" was a pretty muscular movie back in '88. It made cultural icons out of its two stars and the explosions were guaranteed crowd pleasers. The script (note-perfect) ran like clockwork with setup-and-payoff and was stocked with memorable characters throughout; the hero reluctant and vulnerable, his stakes ever ratcheting, while the action would just keep mounting until . . . Well, there wasn't any more opulent high-rise. It doesn't matter what time of year you watch this movie, it functions perfectly in July and December (or even today, so close to Halloween) and always his the spot. It's the ultimate \"You can't go wrong with\" movie.(Less brief)\nAfter twenty minutes of story setup, BAM! The guns start blazing and the death toll gets going. At a certain point, this just becomes kind of a theme park ride as John McClane scrambles through the bowels of Nakatomi Plaza and everything's raining down around him.McClane is the key to making all of this work after all. He's the ideal rally-behind character, neither hulking nor shredded and always thrust into a fight; and Bruce Willis is working at peak likability. But he's matched by Alan Rickman, the master scene-stealer, as devilish as they come. It's a rivalry commensurate with such a big movie.And McTiernan's the perfect director for this gig. His direction is self-assured, his camera calm and measured. Sure, we're confined to this building the whole time, but the audience had plenty of moments to take a breath and soak it in. Put it this way: can you imagine someone like J. J. Abrams helming this? Stock up on Dramamine first.I can go on and on, but the bottom line is this: \"Die Hard\" is just *fun*. There's joy in the gunfire, personal injury and wanton property destruction. I always feel great after watching this.",
    "87": "Die Hard (1988) *** (out of 4)Enjoyable and tense thriller about a group of terrorists (led by Alan Rickman) who overtake a L.A. skyscraper and the only thing keeping them from getting away with their crime is a New York police officer (Bruce Willis) there on vacation. There's a lot of very good things about this movie but I've always thought that the majority of the credit has to go to star Willis. He might not have been a A-list star at the time this was released but it's easy to see why he became one afterwards. I think what's so great about him and the character he plays is that we can believe he's just your typical guy you'd see walking around on the streets with you. That every-day-man quality that Willis has works so well here because of the odds stacked against his character you can't help but just sit back and enjoy this one person taking out a professional organization. The hilarious one-liners, the smart remarks and the way Willis makes himself know to the terrorists is just classic and we get so many great showdowns that you can't help enjoy all of them. It certainly doesn't hurt that you've got a strong supporting cast with Rickman being a villain you just love to hate. The coldness RIckman brings to the part is the perfect contrast to Willis' cop and it works perfectly. Reginald VelJohnson, William Atherton, Bonnie Bedelia and Paul Gleason also add great support for Willis to play off of. The action scenes are certainly some of the best you're going to see and what holds them together so well is the direction by John McTiernan. He perfectly blends the humor, tension and the action but he also gives the film a wonderful pace that keeps it moving at a fast rate. DIE HARD might be far-fetched in what one man is able to do but this really doesn't take away from any of the fun.",
    "88": "One could claim that 1988's \"Die Hard\" is one of the most influential action movies ever made because it basically revolutionized one of the most copied (but never matched, at least in terms of quality) formulas: a loner, by some unique twist of fate, battles it out with an \"x\" number of terrorists in an enclosed environment.By the time that \"Die Hard\" was released, the action movies were most often dominated by the likes of Arnold Schwarzenegger, Sylvester Stallone, and Chuck Norris. Star Bruce Willis, whose only notable credits at the time were television's \"Moonlighting\" and 1987's \"Blind Date,\" which was released the year before, was the unlikeliest of them all.Willis was a wild card - an unlikely choice for the role of our hero \"John McClane\" - since he didn't have any action credits on his resume' and let's face it: Bruce Willis just didn't have the bulging biceps required for a role like this. But that's the beauty of his performance in this movie: he's an everyday guy, caught in a not-so-everyday situation.On Christmas, McClane's estranged wife Holly (Bonnie Bedelia) invites him from New York all the way out to Los Angeles to spend the holidays with the family. But it requires him to make a stop at the Nakatomi offices, which is having an after-hours Christmas party. Riding for the first time in a limo, he's introduced to the suave driver, Argyle (De'voreaux White), who gives him some pretty useful advice on trying to win over the wife.At Nakatomi, things of course get off to a rough start for McClane, as he gets into an argument with the wife and is left to wallow in his misery. However, those problems are about to take a backseat to the real \"party\" - twelve terrorists, led by Hans Gruber (all-purpose bad guy Alan Rickman, perfectly cast) - seize control of the building and proceed to rob the Nakatomi building of its assets, most of which include negotiable bonds and other valuables. But they didn't count on the \"fly in the ointment\" (pain in the a**) to make things hell for these so-called party crashers.Certainly one of the best known action movies ever, \"Die Hard\" did receive the scorn of critics upon its 1988 summer release, but the audiences sung a completely different tune.The film was most often praised for the production, with the brand-new Fox Plaza office tower serving as the fictional Nakatomi building. It was also praised for the energetic and skillful direction of John McTiernan, whose most notable credit was the action-sci-fi thriller \"Predator,\" which was released the year before and starred Arnold Schwarzenegger.Bruce Willis was the perfect actor for this performance, since he brings the wit and vulnerability to a role like this one. If Stallone or Schwarzenegger were in this movie, I'm sure the effect would have been a lot different.Personally, I think \"Die Hard\" is one of the greatest action movies ever, up there close to my favorite action movie of all time, \"Raiders of the Lost Ark.\" Like Indiana Jones in that film, \"Die Hard\" had an Everyman cast in the role; McClane, like Indiana Jones, wasn't a larger-than-life musclebound grotesque: he was a real guy that you cared about, who got hurt, and had real feelings.That's why I think both of these movies have sort of stood the test of time as becoming what they are best known for today: action classics, and they're here to stay, ladies and gentlemen.10/10",
    "89": "Die Hard tells the story of a New York City detective named John McClane who is separated from his wife. She invites him to a Christmas party at her office building in Los Angeles, and he decides to go to work things out. Once there, a group of German terrorists come in and take hostages with the intent of stealing millions of dollars in bonds. McClane manages to escape and begins to fight the terrorists one by one to save the people in the building.Die Hard is a classic film because it completely revolutionized action films. The 80s were a time of unrealistic action sequences, predictable characters, and rudimentary plots. Die Hard changed all that. Die Hard takes place in a real world setting, or at least about as real as you can get with an action movie, so the action sequences, while insane, are slightly believable. The plot of the movie is simple, yet it's so brilliant at the same time. And the characters in this movie are engaging and a lot of fun to watch. John McClane is a really likable everyman kind of guy, we can all relate to him. Hans Gruber is an awesome villain, both cold and ruthless, yet very human. The supporting characters on the outside of the building are all great as well. Another great thing about Die Hard is that even though it's a hardcore action movie, it manages to be extremely funny at some parts, almost to a point of being able to call it a comedy. This makes the movie really easy to watch over and over again. There's really nothing wrong with this movie whatsoever in any department.The acting is great. Bruce Willis is hilarious and hardcore as John McClane, and he portrays the adrenaline and the frustration of the situation very well. Alan Rickman is awesome in one of his earlier roles as the main villain Hans Gruber. Reginald VelJohnson is enjoyable as McClane's outside contact Officer Al Powell, and Paul Gleason is funny as a hardheaded and incompetent deputy chief of police.Overall, Die Hard is the ultimate action film because it's fast, funny, and hardcore. It also gave us one of the most famous action movie one liners of all time...You know the one.8/10",
    "90": "Seeing 'Die Hard' for the first time as a teenager was a one-of-a-kind experience. This level of raw, \"edge-of-your-seat\" action was unknown to me prior to this film; it made my head spin and the intensity of it was nearly unbearable. When it was over, I could only think of one word: Wow!For a long time - at least in western cinema - the only \"true\" action movies (by that I mean films that were all about the action and you went to see them because of the action) were the 'James Bond' movies. They had the most unreal stunts and crazy, over the top action sequences that you could imagine at the time, and they were (and still are) great fun. However, they usually lacked three vital ingredients:1. A sense of realism (meaning: the hero is only human and can get hurt)2. Grit (messy, unpolished action, dirty people and LOTS of swearing)3. R-rated violence (showing the audience what real weapons do to the human body)Well, it took John McTiernan to bring those three key elements together in 'Die Hard' - and thus the modern action film was born (it had a good run through the late eighties until the end of the nineties – then the studios figured out they could maximise the box-office by taming down the swearing, violence and sex and thus, alas, the contemporary, toothless PG-13 action film was born). Sure, there have been a couple of others before McTiernan's masterpiece ('First Blood', 'Terminator', 'Predator' - which was also by McTiernan - or 'Lethal Weapon' and probably some more), but those films could have fallen into any number of other categories as well ('Adventure-/Survival-/War-', 'Sci- Fi', 'Horror-' or 'Buddy-movie') – and I can't think of another film that was just such a relentless, pure-action-from-the-beginning-to-the-end film as was 'Die Hard'. To me, it's the ultimate thrill ride. The formula has since been repeated so many times, but the original still sets the standard by which I judge an action film. Should be seen every Christmas. 10 stars out of 10.Favorite Films: http://www.imdb.com/list/ls054200841/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/",
    "91": "\"Die Hard\" is the prototype type for the modern action film.  Since it's also one of the best action films ever made, that happens to be a very good thing.  \"Die Hard\" is lean, mean, and doesn't contain a single second of wasted screen time. The direction, the action, the story, the acting . . . every aspect of this film comes close to big-budget action movie perfection. Since \"Die Hard\" was first released in 1988, it's difficult to think of a blockbuster action film that doesn't follow the basic structure and format of \"Die Hard\" . . . or, for that matter, is better than \"Die Hard\".\n\"Die Hard\" is about John McClane (Bruce Willis, in one of his all-time best film performances), a basically good, honest New York cop with a penchant for annoying authority figures.   Traveling to Los Angeles in a last ditch attempt to patch things up with his estranged wife Holly (Bonnie Bedelia), John McClane suddenly finds himself involved in a hostage situation. Terrorists, led by the enigmatic Hans Gruber (Alan Rickman), have taken over the office building in which Holly is working, and with Gruber holding the upper hand over the LAPD and FBI forces in Los Angeles, it's up to John McClane to save the day . . . .Kudos should be given to both director John McTiernan and screenwriters Jeb Stuart and Steven DeSouza -- the film is tight, electrifying, and clever, which is something few action films can ever claim.  The story isn't completely believable, but it's believable enough, and it manages to move along at a quick enough pace to where the most glaring plotholes can easily be glossed over.  There's also enough twists and wrinkles thrown into the story to keep the audience guessing as to what's going to happen next . . . and the surprises don't come out of left field, but are actually clever and well thought-out.  (The fact that McClane often relies on his brains instead of his bullets to get out of his predicaments is also a big plus.) Simply put, \"Die Hard\" is one of the smartest and savviest action screenplays ever written.  McTiernan holds up his end of the film admirably as well -- he uses the claustrophobic nature of the office building to great effect (particularly in any scene involving an elevator shaft), and he keeps the film rolling at a rollercoaster pace, building up the anticipation of the audience before unleashing the action.  A lot of recent action films just fly along at a mindless, breakneck pace, without ever allowing the story to breathe or the suspense to build . . . unlike those films, \"Die Hard\" knows how to maximize the impact of each and every scene, and that's why it stands out so clearly from them all.  With \"Die Hard\", John McTiernan puts on a perfect clinic as to how to pace an action movie.As for the acting, it's darn near close to perfect.  Bruce Willis is awesome as John McClane.  As played by Willis, McClane's a smartass with a distinct disdain for being given orders . . . but McClane's also clever, and knows how to keep cool under pressure.  There's more to McClane than the stereotypical tough guy hero.  Fortunately, the role was given to Bruce Willis, who infuses McClane with the perfect mix of cocky arrogance and stone-cold heroism.  The fact that Willis plays McClane as a man often in disbelief of his own situation, and who struggles in his fight against bad guys instead of just killing bad guys with ease, like most stereotypical action heroes -- well, not only does it make the character much more believable, it's darn brilliant.  (The fact that Willis also knows how to deliver a deadpan one-liner better than anybody else in Hollywood makes the character all the better.)  There's only a handful of movies where both character and actor are a completely perfect match; Bruce Willis as John McClane is one such perfect match.Also worthy of mention is Alan Rickman's performance as the villain Hans Gruber.  The Machiavellian Gruber would've been an easy villain to turn into little more than a scenery-chewing Bond villain . . . fortunately, Rickman doesn't travel the easy route.  Gruber, as played by Rickman, is cold and calculating, and actually acts smart, instead of merely claiming to be smart and then being thoroughly outwitted by the hero.  He always appears to have an ace hidden up his sleeve, and is so convincing at giving this impression, it's hard to tell throughout the film whether he or McClane truly have the upper hand.  Other actors probably could've played Gruber fairly well, but Rickman makes Gruber one of the all-time great villains.  As for the rest of the cast, they're all pretty good.  Bonnie Bedelia does a nice job as John's soon-to-be-ex-wife Holly -- she plays her with enough smarts and feistiness to break the usual \"damsel in distress\" mold.  It's also worth mentioning that Paul Gleason, who plays the obstinate police chief Robinson, pretty much sets up the modern action movie stereotype of the authority figure who refuses to heed the advice of the maverick hero.  The character is stupid to a fault, and he's wonderful because of it.\"Die Hard\" is a terrific example of what happens when all the pieces of a film fall together perfectly.  There simply are no weak spots or dull moments in the film.  Is \"Die Hard\" one of the best overall movies ever made?  Probably not.  But it's undeniably one of the best action movies ever made, and it just might well be the perfect modern action film.  Grade: A",
    "92": "Bruce Willis is stirring up trouble for the bad guys in \"Die Hard.\" In the first of three awesome films, he stars as Lt. John McClane, a New York police officer, who has been invited to the wrong Christmas party.This is an action film for future actors and directors to watch and use as a model because it is what an action film should be. I have seen many action films in my life, but this ranks at the top as it has all the right components. Action packed sequences, explosions, special effects and most of all superb performances with excellent dialogue.\"Die Hard\" is a movie I will not soon forget because the story is so well crafted. Though there are no twists or curves thrown at the audience, the audience can be assured they will be treated to two hours of non-stop action from beginning to end.\"Die Hard\" did not only produce great action and explosions but future stars as well. I am talking about Clarence Gilyard Jr. who starred in Walker, Texas Ranger and Reginald VelJohnson who starred in the series \"Family Matters.\" These two actors were pivotal to this film in their respective roles.Two other names to keep in mind while thinking of key performers are Bonnie Bedelia and Alan Rickman. I was blown away when I saw the impact they had on this film. It is as if they came in and said 'Okay boys, watch out I'm taking over.\" They certainly did that; however, nobody could have done better than the impact performer himself Bruce Willis.On a scale of 1-10; \"Die Hard\" is given a 100 by yours truly. My only regret would be that the movie ended. I wish there was more to see in this film. I CAN'T WAIT TO SEE \"DIE HARD\" AGAIN.",
    "93": "I've got to admit, I only really watched this movie because of the (many, many) references in Brooklyn 99. And I got thinking, is Die Hard really that good? So, I gave it a watch, guided by the many, many Jake Peralta jokes that I had grown accustomed to. And I've got to say, this is the action movie that paved the way for all future action movies.I usually have an aversion to Christmas movies as they all tend to turn into cheesy rom-coms but this was pretty awesome. And I think the reason for that is because that even though it was Christmassy where it mattered, the plot didn't completely revolve around it.I've got to admit, most of it was guns and explosions and there was very little plot to go off of besides a pretty traditional three-act structure, but it was still pretty damn entertaining. And you know it's a good movie when about 90% of it was guns and blood and explosions and the other 10% was Bruce Willis saying badass things and crawling through vents in an ever-disintegrating tank top, and you stilled enjoyed it.There was never a still moment in this movie, but unlike most times, where I just end up getting bored of the CGI-fest explosions, I was actually pretty captivated through the entire runtime. I'm actually really pleasantly surprised. The ending is predictable, but it's nice. Not all movies have to be intellectual masterpieces. Sometimes you just need to switch your brain of a little and watch Bruce Willis kick ass.So, Jake of B99 was right. I mean, it's badass, Bruce Willis has the best one-liners, you have cool explosions. There's not too much more I could say about this movie. Yippie kayak, other buckets.-Sasha.",
    "94": "It's almost unfathomable that in just one year's time, the original entry in the \"Die Hard\" saga will be thirty years old. And yet, even then, it will still remain in its position as indisputably the greatest action-adventure ever committed to the screen. In every way remarkable, entertaining and breathlessly exhilarating, it is the quintessential gold-standard when it comes to action. A masterpiece of filmmaking, \"Die Hard\" took the world by storm in 1988 and even with inconsistent quality in sequels, it still enthralls and entertains thanks to sharp writing, perfect casting, exquisite performances and top-notch direction. It's hard to imagine that anything will ever top it.Bruce Willis stars as Detective John McClane, a New York cop who flies out to Los Angeles to spend Christmas with his estranged wife Holly (Bonnie Bedelia) and children. Arriving at a massive Christmas Party at Holly's workplace in Nakatomi Plaza, things start to seem like they might be looking up for John... until a group of terrorists, lead by the vile Hans Gruber (Alan Rickman) seize control of the building, hoping to get their hands on over half a billion dollars in bearer bonds that are locked away in the vault. Escaping the threat and discovering that the police will be completely unable to help, John realizes he must work alone, eluding capture and taking out terrorists one by one if he is to save the day...Directed by John McTiernan from a script by Jeb Stuart and Steve E. de Souza, the film as just exquisitely assembled. McTiernan's keen eye for visuals and perfect sense of pacing and composition allow the tension and excitement to build with virtually every second as the story progresses and the stakes rise. But he also knows when to pull back and give the characters breathing room to develop and just talk with one another, without rushing through it or over-relying on broad archetypes as many more modern filmmakers do. Absolutely amazing direction. The screenplay (inspired loosely by the Roderick Thorp novel \"Nothing Lasts Forever\") is exceptionally well put- together. de Souza and Stuart craft an instantly identifiable and highly likable cast of characters- including villains you very much love to hate- that all get their proper moment to shine and all feel well-defined and developed. The structure of the film is also very sound, and they strike a perfect balance between story and action in a way few other films have.We are treated to one of the finest casts to ever populate a tale of adventure in the film. Much has already been said about Bruce Willis and his iconic turn in the role of McClane, but it is still not enough. Bruce Willis just might be the ideal action hero. He's tough, but not unstoppable. Smart, but not a genius. And sharp- witted, but with a certain sense of vulnerability. In many ways, he's the sort-of person anyone and everyone can identify with, and that's what makes McClane such an incredible hero. Alan Rickman- in his first starring role- absolutely steals the show as the villainous Hans, a presence who will charm you, even while you root for him to go down. Rickman is a talent that was taken too soon after his tragic passing last year, and it's roles like this that prove just how great a loss it was. Supporting roles by the likes of Bedelia and William Atherton are exceptional for the material. And Reginald VelJohnson is just magical as Sgt. Al Powell, a cop who offers support to McClane over the radio throughout the film's runtime.Beyond the cast, the direction and the writing is just simply a phenomenal overall production. Cinematographer Jan de Bont, who would later go on to become a director in his own right, paints a beautiful cinematic image, with outstanding work done, particularly in the lighting and color. Composer Michael Kamen's score is just a blast of pure fun. With a sort-of old-fashioned scope yet a modern flair, the music constantly and consistently compliments the images on-screen perfectly, and it's such a relief that his themes were used in each subsequent film. And editors Frank J. Urioste and John F. Link expertly manipulate the footage so that every shot... every emotion... everything is in service to the story and characters. Now THIS is how you film and cut an action film!In the end, \"Die Hard\" may soon be turning thirty years old, but it remains as exciting, engaging and enthralling as ever. Upon initial release, it became the perfect example of an adventure done right, and blew audiences away. And it continues to do that now. I honestly have my doubts that anything will ever be able to beat it in terms of quality in storytelling and execution of action. It simple is the best action movie ever made. And for that, it easily earns a perfect 10 out of 10.",
    "95": "I've decided to leave a review for 'Die Hard' exactly thirty years since its release in 1988. Partly because it still holds up after all that time as one of the greatest action movies ever made and, secondly, because it has just (officially?) been classified as a 'Christmas movie.' So, does it promote festive cheer and goodwill to all men? Or does it just give you the manual on how to kill unlimited bad guys with a machine gun, a witty quip or two and dirty feet. Probably the latter really, but, for the record, it is SET at Christmas and a famous Christmas song even plays it out. What more do you need to pull a cracker and eat Xmas pudding to?For anyone that doesn't know, the plot to 'Die Hard' involves a cop getting stuck in a giant building during a terrorist takeover. Guess what? He fights back. It's a simple plot and that's its main strength. It never really tries to be anything that its not. Bruce Willis may have been around before 1988, but it was no doubt that it was 'Die Hard' that cemented him as an 'A-list' star. Granted he's reprised his role as John McClane numerous times since, however one (of the many!) criticisms thrown at the sequels is that he's become a 'superhero' in human form, i.e. he can do anything and is completely invulnerable. But, back in the first outing, we really do feel his pain as he limps, crawls and drags his way through the building's air ducts in order to simply survive the night, let alone take out the entire squad.In short, Bruce Willis was actually 'relatable' back then. But, what is a hero without a good villain? Not much. But luckily, as 'Die Hard' cemented Willis as an A-list protagonist, it also did the same for Alan Rickman as the dastardly terrorist leader, Hans Gruber. I read somewhere that the best films involving a clearly defined hero and villain explore the relationship between them (test it out - the movies that don't really work almost always have the hero and villain never meeting/interacting until the final showdown where the hero inevitably kills the villain). Here, the two spar not just physically, but mentally thanks to McClane stealing one of the terrorist's radios and mercilessly taunting Gruber as he dispatches one henchman after the next.So, you have the relatable hero, the evil villain and the simple plot. What more could you want from an action movie? Well... action, maybe? And it's here tenfold. The wonderful thing about eighties action movies was that they were real. Or rather the special effects were really there on screen, rather than the actors filming up against a green screen and the explosions added later. All the fights here actually look like they could really happen. Yes, we always have to suspend our disbelief that one man shooting at a hundred has a better chance of killing them than the other way round (but then we've been doing that since James Bond first sipped his Martini!). But the action looks real and it's the final icing on this most unexpected Christmas cake.Die Hard' may now be a Christmas movie, but you really can watch it any time you want a simple, yet excellent action film that really doesn't have many flaws (or at least none that detract from its brilliance). It really has been the template for many an inferior action movie to come. Yippie-kay-yah Christmas to you all!",
    "96": "I was not a Bruce Willis fan per say. As a matter of fact, I thought what is this guy from Moonlighting gonna do? Is he gonna make them laugh to death with stupid comments and jokes? I was not a fan of \"Moonlighting\" then either, that would come later. In addition I was not thinking, 'John McClain' \"Hans Gruber' or 'John McTiernan' that was my first error.As I took in the very first minute of the film, I knew, this was going to be radically different than I had imagined. This movie and John McTiernan's directing (Also 'Preditor'-1987 'The Thomas Crown Affair'-1999) (The Hunt for red October) (Medicine Man)The way I felt from his genius directing style, that gets you fully involved, stomach wrapped in knots, pulse pounding. He brings out the whole story, not just a 'clot' of mindless action and or violence. He actually led up to the stories climax and didn't blow it when he got there. I was shocked at this movie, which gets 'compared to' all the time with other action and drama movies! Still, after two decades. Needless to say, it changed the way I felt about movies and film making. From Willis's flawless performance to master terrorist Hans Gruber, (Rickman) what a truly superb 'Villain' & (James Shigeta, Holly's Boss) the emotion and heart-thumping fear that lead up to the demise of James's character. The scenery of the towering building and the city itself after dark, under the threat of terrorist activity. Don't forget L.A. P.D.-in charge 'DeWayne T. Robinson', (Paul Gleason - God rest his soul -Died May 26, 2006)I truly looked at film with a whole different view point. I got a copy of the original script, well the 18th re-write or something like that and went, line by line, through the story. It was unbelievable how this movie changed my mind on Movies...as well as Bruce Willis. I just can't say enough about Die-hard, but I will come to a soft close...but before I do, here is a 'spanner' of a thought, originally Willis was not first choice, it was Stallone that they wanted and he turned it down, think on that one! This would not be what it is this way, it would be wholly different with 'Sly' at the helm. I will even venture further out, do you know who this was originally written for? -Answer: Burt Reynolds. No kidding.This is on my all-time list of the best of the best films, bar-none.",
    "97": "Die Hard (1988) is a movie I recently rewatched on Amazon Prime and is also in my DVD collection. The storyline follows an NYPD officer visiting his wife in Los Angeles. Shortly into his wife's Christmas party at her new job the building is taken over and everyone is held hostage...except the officer who will try to find a way to alert the police, keep the hostages safe and thwart the people responsible for capturing the building.This movie is directed by John McTiernan (Predator) and stars Bruce Willis (Pulp Fiction), Alan Rickman (Sweeney Todd), Reginald VelJohnson (Ghostbusters), William Atherton (Ghostbusters), Bonnie Bedelia (Presumed Innocent) and Al Leong (Big Trouble in Little China).Every aspect of this movie is better than it should be. The cast for the good guys, bad guys and everyone in between is perfect and so is their chemistry with every interaction. The writing is excellent from the dialogue, character backstories, circumstances and husband/wife dynamic. Willis obviously knocks this performance out of the park with his one liners and sarcasm, but Rickman is a marvelous villain as well. The action scenes are action movie gold and the comedic content in this is underrated.Overall this is a gem and action genre gold. I would score this a 10/10 and strongly recommend it.",
    "98": "What can I say about Die Hard that was already said: it is one man army type against a team of terrorists who took over the building on Christmas Eve in L.A. I love this movie to death it is consider as a Christmas movie. It is my personal favorite action film of all time, that is dear to my heart. I have seen this movie over 100 times. Some people put Die Hard 2 over this movie, some people put Die Hard: With a Vengeance over this movie, I will never put any of the sequels above this movie because it is perfect. Die Hard is and will always be my favorite it is the best one in the action movies. Bruce Willis fits perfectly the role of John McClane a New York Cop, it was his first action movie that made him in to an action star.Directed was by John McTiernan who directed Predator a year earlier, this movie is based on a novel Nothing Lasts Forever by Roderick Thorp. This movie suppose to be a sequel to Commando (1985) but Arnold Schwarzenegger declined the role thank god. Sylvester Stallone was consider it for the role and he declined. Richard Gere, Harrison Ford, Mel Gibson, Eastwood, Robert De Niro, Charles Bronson, Don Johnson, Richard Dean Anderson and Michael Madsen were considered, but declined the role of John McClane. Thank god Bruce Willis fit the role perfectlly.This is the first and only movie that is about one man army type fighting against a team of terrorists who took over the building and declared war. There was a bunch of movies that copyied Die Hard but no movie could nealed like Die Hard did. Under Siege with Steven Seagal was my childhood film, I loved Seagal's character but now as an adult and from my teen years Die Hard surpass Under Siege because Die Hard was one man army type, who was in situation that felt realistic. Imagine your in a building and suddenly you hear gun shots, people with automatic weapons shooting at people and takes everyone hostage. What will you do? In this situation was John McClane armed only whith his service revolver barefoot he runs upstairs and all telphones dosen't work. McClane is alone, he crawles down the elevator shafts and try's to find out more information about the group. The only communiactions is trough radio.A team of terrorist shuts down all exits and elvators so no one can go down or up. The leader of the group is Hans Gruber played by Alan Rickman it was actors first role. Hans Gruber is one of the best villians of all time. Ask anyone, or read anywhere they will all tell you that Hans Gruber is the best villiand and bad guy of all time. In actaully terrorists werent agenda for a political demands, they were planing a heist in a 30 floor to steal $640 million in bearer bonds hold in a building's vault and not let anyone go. I can't wrote detailes or I will get spoliers so I don't want any spoliers on my review. Sgt. Al Powell played by Reginald VelJohnson was my favorite characacter. I love how he defends McClane against his suprevisors. I love how McClane and Powell communicate eachother from cop to a cop on a radio I love that. I love Dwayne T. Robinson, the Deputy Chief of Police \"kick-ass!\" I love Paul Gleason who does everything by the book. He is sure McClane is one of the terrorists, I really do wish his character would had more to do. I love Diana James and Shelley Pogoda who are Dispatcher and Police supervisor when McClane calls them for help. Gail Wallens played by Mary Ellen Trainor I love her as news reporter.The movie has tones of action: McClane talks to him self when he is about to do something crazy. my favorite scene is McClane firing 15 rounds with his Beretta 92F on a terrorist under the table. McClane grabs the fire hose, ties it around his body jumps with the helicopter about to kill him. Then Gruber blows it a second after McLane jumps off the roof! It was an incredible explosion that totally takes out the helicopter. But McLane is falling down the side of the building and needs to get inside quickly this is the best scene in the movie my favorite. McClane clambing down the elevator shaft is really one the best scens in the movie. Two terrorist uses Rocket Launcher and destroy a SWAT van that was driving in the building practical effect real explosion realy action done for real. The same van was used later in RoboCop 2 just that movie was less successful. You have 3 explosions in the building all done practical and for real. 20th Century Fox with the 80's really nailed with action movies nowdays the 20th Century Fox does not make so good movies like Predator, Die Hard, Aliens and Speed I miss action movies like this. The fight sequence between McClane and Karl was great choregraphed well filmed and done for real.Great music score by Michael Kamen absolutelly love the music score. All the terrorists are great in this movie. Great lines: \"The man is hurting! He is alone, tired, and he hasn't seen diddly-squat from anybody down here. Now you're gonna stand there and tell me that he's gonna give a damn about what you do to him, *if* he makes it out of there alive? Why don't you wake up and smell what you shoveling?\" Great dialogue and lines in this movie.Some guy meantion this movie on Lethal Weapon review that Lethal Weapon is his favorite film over Die Hard. I disagree this is my favorite film of all time Die Hard it is better than Lethal Weapon! Die Hard is a Christmas action movie one of the greatest movies of all time. I love this movie to death. It is my personal favorite action movie of all time.It is the best bad-ass macho action movie of the 80's extravaganza with balls to the walls, my personal favorite action movie of all time.",
    "99": "Die Hard had an unusual history before it even reached the screen.In the Sixties, author Roderick Thorp wrote a novel, The Detective, which was turned into a movie, starring Frank Sinatra in the title role of Joe Leland. A sequel, Nothing Lasts Forever, was written, in which Joe becomes trapped in the Claxxon Oil Corporation skyscraper after it is taken over by German terrorists and he has to rescue his daughter. Frank Sinatra was contractually allowed to consider (and pass) on making that sequel, an adaptation written by Jeb Stuart. Then Steven E. De Souza was brought on board and he turned the Nothing Lasts Forever screenplay into Die Hard. The skyscraper became Nakatomi, the daughter became the wife, Leland became John McClane and several other actors, including Richard Gere and Clint Eastwood turned down the role until it landed with Bruce Willis.To say that Die Hard sets new standards for action movies is like calling Bill Gates modestly wealthy. The movie was so innovative and groundbreaking that dozens of rip-offs followed - Passenger 57, Under Siege, Cliffhanger, Sudden Death, et al. Hostage/terrorist movies were all the rage in the early Nineties.Very few came close, because Die Hard had so many strong points, not least of which was Alan Rickman's cold performance, as Hans Gruber - also the name of the villain in Our Man Flint - the classically educated, smartly dressed terrorist leader. Gruber would have been well at home on Wall Street.His plan is to break into the vault on the 30th floor of the Nakatomi Plaza and take away $640million in negotiable bearer bonds. When he and his 12 European henchmen round up the office workers, who are enjoying a Christmas Eve party, one man slips away unnoticed. He is John McClane, a New York cop who has come to LA to settle down with his estranged wife, Holly (Bonnie Bedelia). The odds are against him. But that's just the way he likes it.In his battle to save his Holly, McClane is scorched, torched, beaten, and blown up. He jumps off the roof and falls through air ducts. He uncovers deception and double-crosses, and picks broken glass out of his bare feet. No help comes from the naive and incompetent police, who are unable to get inside, and even less so from the overconfident FBI.McClane is not a supercop. He is an ordinary guy, who doesn't want a fight. When he is shot, he bleeds, he hurts. All he has are his pants, his vest, his gun - which does not have infinite ammo. This is a realistic connection the audience can identify with and helps to project yourself into the movie. When you don't want to be in McClane's position, it makes for much excitement.John McTiernan, who's only previous mainstream movie was Predator, uses awesome photography and technical skills to give the film a truly polished and sophisticated look that has become his signature style - it was nominated for four technical Academy Awards. He also allows for enough time for decent character development with arcs for multiple side-characters, most of which comes between McClane and a cop (Reginald Veljohnson) he makes friends with on a CB radio.Die Hard manages to be exciting every single time. It's lost some of it's respect in recent years as action films, post-1999, had tried endlessly to imitate The Matrix and use digital effects in place of real stunts and worse so since 2010 with the endless, tiresome, mind-numbing over-abundance of comic book movies filled with impossible physics, which is a really big loss and signalled the beginning of the end of the true, tough guy action film.",
    "100": "1988 and the undisputed number one action star was that Austrian body builder with the funny name with that monosylabic guy from ROCKY in second place . The thing I hated about Arnie and Sly is that their action movies were uninvolving with over blown battle scenes where the good guys never seemed to be in danger of dying . I was also going to bring the James Bond franchise into the conversation but the series became a parody when Bond stopped speaking with a Scottish accent sometime in the early 70s\nDIE HARD is different to the other 80s action fests with John McLane being a fairly believable genre character . Okay he`s two dimensional but that`s got to be one dimension more than John Rambo who only exists to kill a lot of nasty commies so Americans can flock to the cinema . It`s also interesting to note that McLane`s wife is used in the plot which is slightly different from how most action films work out where the hero is normally single , but that`s probably because DIE HARD as more depth to it than many contemparies. Perhaps the biggest difference is that McLane is slightly flawed as we`re shown one scene where the hero gives the bad guys something they want , not something you`d see in a Arnie or Sly movie . I won`t mention the stunts or the tightly written set pieces or how compelling they are because everyone else has beat me to it , except to say that big explosions and gun fights often overwhelm an action movie ( Bond movies are a good example ) but here they occur from the narrative instead of someone cramming them into the script in a vain attempt to thrill the audience . Normally I`d have a fit that an action blockbuster is well inside the IMDB top 250 but DIE HARD does deserve to be there since it`s the best movie of its type of its era .",
    "101": "In many people's minds the term 'action thriller' is defined as predictable, over exaggerated and boring.I tend to agree the majority of the time, especially after watching films like 'Mission impossible II' and 'James Bond' where the predictability was as present as Bond's sarcasm, ridiculously predictable and unrealistic.Thankfully director John McTiernan was able to add a likable quality to the genre Bruce Willis stars in this 1988 smash hit action thriller which does contain a lot of typical action thriller conventions but why do we criticise? We see him running around Nakatomi towers and with his cheeky attitude and delivering cheesy but hilarious quotes, I found myself appreciating the character and the genre.What was predictable was having many gun scenes which were unrealistic but that is always expected of this genre. Thankfully Die Hard doesn't reach to the extremes as MI2 does and the majority of gun fights and character action codes are believable but ARE enjoyable. Viewers are able to associate with the central protagonist John McClane who is sarcy and purely likable, I found it impossible to hate him. The bad mouthed cop is always on the move and willing to conform to the ideologies which director John McTiernan set, and are pulled off beautifully.Alan Rickman is astonishing as the head terrorist Hans Gruber. His evilness is forever present as he controls the role beautiful with his established role and his cheekiness is great to, a more established and influential villain than some bond villains such as Elliot Carver in 'Tomorrow never dies'.The partnership of Rickman and Willis was great. Having two contrasting characters worked wonders as the two bring their own beliefs to the story and viewers can appreciate these different beliefs by characters who are very interesting to observe.The story is fast flowing and kept me on the edge of my seat for the full two hours. A fast placed plot with typical action conventions was crafted magnificently and appreciates the genre by using gun fights, stereotypes of villains, cops, the FBI etc to great effect. It is what many would expect but the humour, emotion and action ideologies are well crafted together, conveying an enjoyable action film.Question marks hover over the beginning and the ending. The beginning is slow and may appear uninteresting and the ending is very over-exaggerated like many of the action scenes but I can't help but like it.Having the film set in one setting, Nakatomi towers, was vital to the films success because being in a claustrophobic area allows the central protagonist's opinions to be limited, viewers are inclined to know how he is going to solve the problems with only a few options.It is a very captivating film with the acting by everyone influential. The conventions of action are present but are more enjoyable than others because of the humour used.Anyone with a strong gut and a thirst for riveting action scenes and dry sarcastic humour, believe me, you will love it.",
    "102": "... and there was a big question mark there in 1988 because up until that time Willis had been only the thorn in Maddie Hayes' side in the TV show that unleashed him on the world, \"Moonlighting\", and tabloid headline fuel with all of his after hours exploits. John Goodman later said that he was just as drunk and disorderly as Willis was, but pre Roseanne nobody knew who the heck he was, so he was given a pass. But I digress.On Christmas Eve NYPD cop John McClane(Bruce Willis) is in LA to visit his estranged wife (Bonnie Bedelia) at her place of business as a company Christmas party is in progress. She wanted to chase a big career and a big promotion on the west coast with a Japanese company, and John wanted to stay in New York as a cop. That is about the extent of their disagreement, but it put 2000 miles between them. But while they are talking a bunch of terrorists break in. They are actually just thieves, but they are using a terrorism angle as a front for the theft. They don't count on one thing though - McClane. They don't see him so he slips away and spends the evening thwarting their plans. The bad guys spend their evening trying to kill McClane. Why don't they use his wife as leverage? They don't know Bedelia's character is his wife.At one point McClane triggers a fire alarm and a lone cop, Powell, is sent to investigate. That lone cop talks to McClane through a radio and tells McClane he shot a kid once on the job, and he doesn't think he is capable of using his gun even if he must. The radio-bound comradery between the two is very good, in between all of the action.This is very likely one of the very best action films ever made. It has non-stop thrills, human interest, great acting by Willis which I think surprised everybody, and lampoons the media by showing them as lapdogs that eat up the contrived terrorist drivel they are fed by the thieves/kidnappers. And Alan Rickman gives a delicious performance as the head terrorist that is only surpassed by his role in Robin Hood Prince of Thieves three years later.Try it, as most big hits that were first in a franchise, it is much better than any of its sequels primarily because nobody was expecting it to be such a megahit, thus it is somewhat humble in its presentation. And that always helps.",
    "103": "Based on ex cop Roderick Thorpe's 1979 novel Nothing Lasts Forever, Die Hard, directed by John McTiernan, changed the face of the action movie. Starring Bruce Willis, Alan Rickman, Bonnie Bedelia, Reginald Veljohnson, Alexander Godunov, William Atherton & Paul Gleason, McTiernan's movie went on to make over $100 million in profit at the box office alone. Spawning three equally successful sequels (at the time of writing), it began a franchise that showed that if done well, the action movie could be a dominant force in the world of cinema. The set up is relatively simple, Willis plays New York cop John McLane who during the Christmas holidays is in L.A. to visit his estranged wife Holly (Bedelia). She works for the Japanese Corporation of Nakatomi, and currently she's attending the company Christmas party up on the 30th floor of the humongous Nakatomi Plaza tower block. Bad day at the office because a group of apparent German terrorists, led by the charismatic Hans Gruber (Rickman), take the whole building hostage: with one exception; McLane, who evades capture and launches a one man war against the terrorists. What follows is just over two hours of high octane action, smart dialogue and technical smarts. McTiernan had already endeared himself to the action movie fan with the ball busting beef stew that was Predator in 87, a fact not lost on Die Hard's co producer Joel Silver, who clearly knew that McTiernan could smoothly shift the action from the Val Verde jungle to the urban jungle of L.A. And he did. Next was to get the right man for McLane. Richard Gere was first choice but passed, so the makers took a gamble on Willis, whose career was at a standstill after his leap from TV show Moonlighting on to the big screen with the likes of Blind Date & Sunset barely making a ripple in Hollywood. The rest for Willis, as they say, is history. McLane is an everyman hero, streetwise, even slobbish, but identifiable to many with his work ethics, desperate heroics and emotional vulnerability. Willis attacks the role with a hunger rarely seen from the big male earners in filmdom. During the two hours and ten minute running time of Die Hard, Willis as McLane changed the face of the action hero for ever; even making a dirty white vest iconic in the process; the latter of which couples nicely with the hero being bare footed throughout for a nifty bit of writing. Across the board the casting is flawless, Bedelia is spunky and driven, a woman worth fighting for. Veljohnson as beat copper Al Powell-McLane's walkie-talkie buddy and only link to the outside world-is memorable because it feels real, he has his own issue gnawing away at him, but his exchanges with Willis keeps the humanity grounded as the carnage unfolds. Gleason & Atherton are wonderfully anal as Deputy Police Chief and TV Reporter respectively, while Hart Bochner as Ellis dishes out one of the best weasel turns to have ever graced a movie featuring corporate suit types. But as Die Hard resembles the great Westerns of yesteryear, much like the great Oaters, Die Hard could only be as good as its chief villain. As Willis' McLane ushered in a new action hero to copy, Rickman's uber intelligent villain set a new benchmark. Snappily dressed, well versed and as charming as they come, Gruber in Rickman's hands is a villain you could quite easily root for! That's further testament to Willis' turn that Rickman doesn't walk away with the movie, both men are from different sides of the fence, good and evil, yet both are characters you can hang your hat on. Quite a trick from McTiernan that. Rickman is ably supported by the scary Godunov as right hand man Karl and Clarence Gilyard Jr. as the cold hearted Theo. Elsewhere the impact of Robert Davi & Grand L. Bush as the two cocksure FBI agents Johnson & Johnson (no relation) should not be underestimated. All the actors, of course, are indebted to the sizzling script by Steven E. de Souza & Jeb Stuart. So to is praise due to photographer Jan de Bont, who in collaboration with McTiernan, produces a camera work lesson for action movies, as the camera swoops in and around the tower, down elevator shafts and up tilt to roofs; with the fight scenes afforded a spatial sheen not expected in the confines of a tower block setting (the film was actually shot at 20th Century Fox's own 2121 Fox Plaza). Even the scoring from Michael Kamen and the sound tracking are of a high standard; check out the various \"mood\" uses of Beethoven's Ode to Joy from Symphony No.9 and Bach's Brandenburg Concerto No. 3 In G Major: Brilliant. The 80s was well served by action movies with the likes of Lethal Weapon and Beverly Hills Cop proving massively popular. But just as Raiders Of The Lost Ark changed the game for action/adventure, so too did Die Hard. It's now the benchmark movie for action, a film that unlike Hills Cop & Lethal Weapon remarkably shows no signs of ageing either. It's no monkey in the wrench or a fly in the ointment, it's the daddy, and the one that all other action movies have to answer to. 10/10",
    "104": "On Christmas eve, John McClane(Bruce Willis) is over at his wife's office party when hi-tech thieves break into said building and look to steal millions of dollars. While collecting hostages in the process, however there is one man who saves the day and it's McClane in what is one of the greatest action movies ever made. I must admit that i'm shocked it took so long to for me to review this. Over the years this has been in my DVD collection, I try to watch it on TV every time it's on and most of all I think it's there with The Terminator,Hunt For Red October and Rocky as the ultimate genre film. The real reason why Die Hard is so great is due to the suspense factor. Sure the action sequences are brilliant and very exciting but what really earns the high marks is just how suspenseful the movie is, it's one of those movies where the hero actually does the most logical things. Unlike the sequels per say, Willis uses the element of surprise and cunning to fight off the bad guys. Unlike the sequels where he was far more one man army. As it stands I remember seeing Die Hard in theaters and remembering being very skeptical of Willis (He was on that show with Cybil Shepherd) but knew right away after watching Die Hard, that Willis would be a great. However as it stands, this movie is a classic. On the other hand it's also a rare instance where one might want to buy a special edition DVD for the extras. Also of note is Alan Rickman who is one of the greatest bad guys ever.* * * * out of 4-(Excellent, A Must See)",
    "105": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday MorningAs Christmas Eve looms in Los Angeles, New York detective John McClaine (Bruce Willis) arrives to meet his estranged wife Holly (Bonnie Bedilia) at the Nakatomi Plaza. All is going smoothly enough, until a group of terrorists lead by Hans Gruber (Alan Rickman) seize control of the building and take everyone inside hostage-all except McClaine, who takes the terrorists on at their own game, in a deadly duel to the death.The 80's was the decade where the last of the great big ideas were brewing, where the studios thought big and delivered bigger, where concepts became franchises and true artistic integrity became a distinct after thought. That's not to say most of the ideas weren't truly inspired, and didn't have the potential to become big investments. Trouble is, the last year in that decade is now very nearly twenty five years ago, leaving the time period itself very much as a thing of the ages. But it is now twenty five years since Die Hard burst on to the scene, and to it's credit, is still hailed by many after all that time as the definitive action film which set the standard by which all others are measured and of which countless imitations have been made. If nothing else, watching it again will wash the memory of that Godawful new film released earlier this year out your mind and remind you of the joyful, exhilarating spectacle that inspired the series in the first place.Bruce Willis made his name with this role, making it all his own and putting his stamp all over it as the cynical, gnarly detective who proves a one man battle machine for the villains he's engaged with. The massive appeal here is almost certainly his presence as an every-man the average, predominantly male action fan could probably relate to, having been force-fed the impossible image through-out the 80's of the muscle bound, mumbling killing machine they could never live up to. McClaine is totally believable as a resourceful but bewildered man of the law thrown in to a situation he wasn't expecting, while Rickman as his adversary is restrained, jovial but also utterly cold and ruthless, determined to see his plan through to the end. Between them, they are a brilliantly twisted double act.Some ideas are so good, and are executed so faultlessly, they deserve to become profitable institutions, spinning off with other versions and sequels, being imitated many times and still holding a special place in everyone's heart twenty five years on. Die Hard is full of explosive, exciting action, is brilliantly written, with great characters, fine dialogue and even finer set pieces. And all that aside, it's just great fun. It's success really speaks for itself. *****",
    "106": "This film began a remarkable action movie franchise that runs around the detective John McClane of the New York Police Department. In this film, he will try to save the life of a group of hostages held captive in a corporate skyscraper of Los Angeles. Directed by John McTiernan, the film has a script of Jeb Stuart and Steven E. de Souza. Bruce Willis embodies the leading role. The film was nominated for four Oscars (Best Sound, Best Editing, Best Sound Effects, Best Visual Effects).At first glance, this film does not look like anything special. Another eighties action movie, full of explosions, police cars made in pieces and bloodthirsty killers facing a single man, full of noble intentions. However, this film has something different: in a decade full of bullet proof heroes, this hero does not act (or looks) as something indestructible. He hurts himself, complains all the time and looks like a guy facing a situation beyond his control. So, its not difficult for the public to chear McClane, making Willis great performance the big advantage of the film.Everything else followed, more or less, the pattern of the decade for action: stunning sets, special, visual and sound effects made with great care and regular performances from the rest of the cast (the interpretation of Alan Rickman, then still little known by non- British public, deserves a positive note of attention). This is an action film that captivates some audiences more adverse to this kind of movies, which proved to be the key to its success.",
    "107": "The 1988 was the movie that definitely put Bruce Willis on the radar for me, as this movie turned out to be such a blast of an action movie back in 1988. In fact, it is a movie that still holds up in 2020; where I just revisited it yet again.\"Die Hard\" is very much a late 1980s action movie with everything that term carries. And \"Die Hard\" placed Bruce Willis right up there alongside the likes of Stallone, Schwarzenegger, Seagal and Van Damme back in the late 1980s.The storyline told in \"Die Hard\" is an enjoyable and entertaining storyline, one that actually has enough contents and material to it to support several viewings over the years. And while one does know the story after having seen the movie, there is just something solid about it to make it possible to watch it again and again.Now, they cast some nice performers for \"Die Hard\". Needless to mention Bruce Willis in this movie, but Alan Rickman in the role of Hans Gruber was just so well-cast because he performed so well and that role was just tailored for him and his charismatic presence. I remember being rather impressed with seeing Reginald VelJohnson (playing Al Powell) in this movie back in 1988, as I had only seen him on that TV series \"Family Matters\".Some people claim that \"Die Hard\" is a Christmas movie. I beg to differ. Just because the story was set to take place during the Christmas holidays doesn't make it a Christmas movie, nor does \"Die Hard\" have the contents to be a Christmas movie in any way. So nay, I am not one of those claiming that \"Die Hard\" is a Christmas classic.If you haven't already seen \"Die Hard\", then there is something wrong, because this is one of the defining action movies of the late 1980s. So if you haven't already seen this classic action movie, then you should most definitely take the time to do so.My rating of \"Die Hard\" settles on a well-deserved 8 out of 10 stars.",
    "108": "Die Hard is an action picture with a capital 'A'. In fact, you might as well go ahead and capitalize the whole darn word. It's an expertly constructed machine for mayhem - a relentlessly thrilling, masterfully executed action film that turns up all the knobs and sets the standard for all of the American films made in the genre.To begin with, it's the classic plot hook of one man against many, right against wrong - a sweaty, bare-chested, all-American hero who battles a band of swarthy, heavily accented terrorist villains. But Die Hard is more layered than your average action movie. It is Christmas Eve. John McClane (Bruce Willis), a New York cop, is in town to spend the holidays with his kids and to fashion a reconciliation with his estranged wife Holly, who works for the Los Angeles branch of Nakatomi Corporation. Planning a rather different holiday agenda are the terrorists led by Hans Gruber (Alan Rickman). The dastardly dozen invade the plush 30th floor offices of Nakatomi during its Christmas party, and hold the employees hostage as a computer whiz cracks a code that will put our bad guys in possession of $600 million in negotiable bonds. McClane's in the john when the bad guys arrive, and he manages to slip away into the bowels of the building with nothing but his handgun, where he becomes the fly in the ointment of the criminals' plans. As the FBI helplessly marshals its forces outside, it's up to McClane to carry on the battle from within. McClane must scrap his way through the mêlée, free the hostages, and in the process repair his troubled marriage. Shirtless and barefoot, McClane swings through elevator shafts, clambers up heating ducts and creeps across rooftops as he tries to pick off the bad guys one by one. There's something satisfyingly claustrophobic about the premise, and the movie makers fully realize it's potential. Director John McTiernan works here with a clever script that offers ample opportunity for violence that is mind-boggling without being mindless. He composes the action cleanly and logically allowing the proceedings to acquire a sense of scale that can't help but impress. The film always looks gorgeous, and it never stops being exhilarating.At the center of this whirlwind of a movie is Bruce Willis, who blends the vulnerability - normally unseen in action film heroes - deftly with the requisite superhuman feats. He almost burns the screen with his overwhelming charisma, his wicked sense of humor and his big-balled bravado. He ensures McClane remains human and relatable, even as the bodies pile up around him. The rogues in the movie pitch in equally commendable performances, particularly Alan Rickman. Smarmy yet charismatic, Rickman adds a theatrical flourish to his performance which only makes him more menacing. Sleekly engineered, impeccably staged and shrewdly dosed with humor and sentiment, Die Hard manages to be heart-pounding and teeth- gritting every single time. Yippy-Ki-Yay!",
    "109": "So many things made this movie great.This movie made Bruce Willis immortal. He soaks up this character so well, it was him. The wise cracking cop who is entertaining because he is sarcastically funny not uttering stupid catch phrases. He is a cop who looks like a normal guy, middle age, loosing some hair with wife problems. (no faked up pretty face with shaved chest and oiled muscles). He is cool without pretending to be cool. He manages to thwart the bad guys while barefoot, man that is a great twist.The plot is great because it does not fall perfectly in line for the hero. He stumbles, gets stuck and survives only by last minute thinking. It has plenty of action without getting ridiculous.And the bad guys are great, smart sinister and well acted.It is one of those movies that could play every weekend and would still be watched. Is one of those top 10 movies every guy should own.Die hard 2 was OK but not as good as the original, I wish they would have stopped after 2. Die Hard 3 is poor.",
    "110": "One of my criteria for the best-of-the-best, top-shelf classic movies is that it is hard to imagine a world in which they did not exist. When it comes to \"Die Hard\", this film absolutely fits that description: a world without John McClane, Hans Gruber, and the Nakatomi Plaza seems utterly incomprehensible.For a very basic overview, \"Die Hard\" tells the story of John McClane (Bruce Willis), a New York cop invited to an LA business party by his wife Holly (Bonnie Bedelia). The couple are estranged, creating an awkward dynamic, and things go from bad to worse when a group of international terrorists led by Hans Gruber (Alan Rickman) choose that night to raid the vault in the building's basement. With the police presence continually bungling the situation, it is up to John McClane to single-handedly take charge of matters.In terms of action set pieces alone, \"Die Hard\" would still be considered one of the best of all-time. Jumps off skyscrapers, helicopter chases, epic gun battles, perfectly paced espionage...it's all here. Yet, what elevates the film to the stratosphere is both the characterization and acting present in the John McClane character.Essentially, McClane is a \"wrong place, wrong time, right person for the job\" sort of protagonist. Yet, not in the Rambo or Schwarzenneger mode whatsoever. No, John McClane is the \"everyman\" who just happens to be a cop that can think on his feet. His reactions and wisecracks--perfectly created by the writers and Willis' acting talent--portray this expertly. He is what all the viewers would want to be in a similar scenario, and just believeable/attainable to be infinitely engaging. From his engaging marital backstory to his ability to keep a cool head and crack wise even in the most dire situations, John McClane is truly one of the greatest characters ever put to celluloid.Of course, the auxiliary cast is almost as iconic. Bedelia is great as Holly, while Rickman's Gruber (from accent to mannerisms) is basically as culturally well-known as Willis' McClane now! Paul Gleason (aka \"the principal in The Breakfast Club) plays a cop you'll love to hate, Reginald VelJohnson is the cop you'll be rooting for, and even De'voreaux White's Argyle chips in with some tension-breaking humor. Every performance here has stood the test of time.Overall, I consider \"Die Hard\" to be one of the finest films ever made, largely due to the John McClane character. But even taken as a whole product, this movie will forever remain the standard by which all subsequent action romps are judged.",
    "111": "No doubt about it, to a lot of people, Bruce Willis will ALWAYS be John McClane, for better or worse.In the film that made him a star, or at least got him out of TV work, Bruce Willis is New York native cop John McClane, come down to LA to see his estranged wife and family for the Christmas holiday. Then Hans (Alan Rickman, in one of his best evil performances) and a group of thieves posing as terrorists who look European male models and an obnoxious black computer hacker show up, take over the building and try to rob the place. Only McClane can stop them, and his only real support comes from Sgt. Al Powell (played by the dad from TV's \"Family Matters\"). Calamity, chaos and mayhem ensue as McClane and the foreign thugs tear the building apart trying to kill each other in the ultimate battle of all American cowboy hero and sophisticated Eurotrash and the idiot cops and FBI gets trip over themselves to help out.Based on the novel by Roderick Thorpe. Bonnie Bedelia is Bruce's wife, and the late Alexander Godunov is Karl, who's vendetta with Bruce turns personal. Bonnie does well as the sympathetic wife with a bad haircut and Godunov, in a role very different from his debut part as an Amish farmer in \"Witness\", is surprisingly menacing in spite of his pretty boy looks. Of course, it helps that his career as a ballet dancer gave him more dexterity than the usual hulking henchman. His knock-down-drag-out brawl with Willis is one of the best.Alan Rickman commented that he didn't view Hans as \"the villain\", but more as a guy who \"has made certain choices in life, wants certain things in life and goes after them.\" All the same, Alan is the perfect villain for Bruce's wise cracking McClane, who is neither weak nor super human. Bruce worked very hard on this film and allegedly did a lot of his own stunts and really brought a lot of life and warmth to a character who could very easily have been just another grim loner. It's a shame that he's had to spend the majority of his career trying to get away from this character (kind of like Sean Connery trying to live down his glory days as James Bond). And to think that Arnold Schwarzenegger, Sylvester Stallone, Burt Reynolds and Richard Gere all turned this part down (probably better that they did).\nSadly, the appeal of the McClane character was lost in #3 \"Die Hard: With A Vengeance\", where McClane HAD become a grim, burned out, wasted loner.\nA big part of the power of \"Die Hard\" is that there are no easy escapes, very few places to run and very little \"cheating\" as director John McTiernan put it. And it's true that very few moments require you to suspend logical disbelief, although we do have to question if it's possible to successfully pull of the stunt where Bruce jumps off the building with a hose wrapped around him.So grab the popcorn and get ready for the madness of \"Die Hard\"! This is actually one of the few action films my family and I enjoy watching together. This was actually filmed at the 20th Century Fox Plaza.",
    "112": "Sure he shoots people and blows things up, but there is only one moment in \"Die Hard\" where smooth criminal Hans Gruber (Alan Rickman) loses his cool: When a woman realizes what he is up to, and tells him he is nothing but a \"common thief.\" \"I am an exceptional thief,\" Hans says after vaulting a desk to get in her face. \"And since I'm moving up to kidnapping, you should be more polite.\"\"Die Hard\" likewise may be just an action film, but it is an exceptional action film, an entry in an already overcrowded field of cinematic bloodbaths that dared to be more than a little clever and insightful about the human condition even as it upped the ante on the on screen violence.Hans and his Euro-goons help matters considerably, by projecting real personality along with the menace. You understand their motivations, enjoy their humor, and still relish their comeuppance at the hands of a New York City cop played by Bruce Willis who finds himself alone against the bad guys in a Los Angeles skyscraper.Willis became a movie star from his performance here as John McClane, and it is very good. Willis projects his usual smugness, but manages to ingratiate himself to the audience early on in a key scene with his limo driver, Argyle, who presses him on what he's doing in L.A. if he's from New York. McClane says he's here to see his wife, who works here, and alludes to some trouble in their marriage, saying he couldn't also move to LA because of his responsibilities to the NYPD.Argyle won't let up. \"You mean you thought she'd come running back before you packed your bags,\" he laughs. McClane winces, but smiles. \"You're very quick, Argyle.\" It's not a major moment, but it points up a key strength of this film. Everyone in it matters. Whether it's Argyle, McClane, Hans, a cop doing what is supposed to be a routine drive-by, a cokeheaded businessman, or a gunman with a sweettooth, the brilliant script by Jeb Stuart and Steven de Souza and deft direction by John McTiernan gives everyone a certain weight and presence that adds to the proceedings.For most of the film, McClane doesn't have Argyle to talk to, so he talks to the audience instead, in a series of monologues made believable by the pressure he is under (he seems to be in the habit of talking to himself anyway) that give McClane a humanity and humor unique for action films. \"Now I know what a TV dinner feels like,\" he says when crammed in a vent shaft. It's not that his one-liners are so clever, but that they come at the right times. Willis crafts a hero viewers can relate to, which makes his heroics more satisfying.The film also succeeds as a straightforward caper film, since the caper itself is intelligently designed and presented in such a way we sense we know where everyone of Hans' dozen underlings are at every given moment, even when the camera isn't on them. Also, the action scenes are incredibly well-done, grittier than anything else on screen at the time yet still entertaining.Okay, the picture is too glib at times, and shows Willis' hunkitude off more than I care to see. The phony business with the walkie-talkie chatter (you can't cut in on other people's transmissions the way everyone does here) is annoying, and the business with the TV reporter should have been left on the cutting room floor.But \"Die Hard\" is a film every bit as brilliant now as when it came out, influential, never equaled, and incredibly fun. Rickman is a great villain. And what can you say about a musical score that encompasses Vaughn Monroe, Run-DMC, Ludwig van Beethoven, and Christmas music? This is a film that leaves nothing out in its ambition to entertain, and succeeds wonderfully.",
    "113": "Action-packed, violent, explosive, funny and well-crafted, \"Die Hard\" elevated Action to a peak that set a standard which has been endlessly followed and has yet to be surpassed. The struggle and drama of police officer John McClane in his battle for justice and personal redemption is one of the great epics in the popular and controversial genre. Scaling and descending a high-rise edifice in flashy L. A. to save his estranged wife and a host of terrified hostages symbolizes perfectly the man's odyssey as he shoots, beats, kills and hurls while getting shot, sliced, beaten and punctured in return. Everything that should work in an Action flick is on display: on point action, a well written urban script, a complementary soundtrack, consistent good acting throughout and the able use of special effects. The film's flaws like its length, plot holes and already glaring pc fortunately barely detract from its overall fun and watchability. Hugely popular during its time elevating lead star Bruce Willis to the A-List and arguably the greatest Action film made, \"Die Hard\" is one of the rare bullseyes where artistic and commercial success are both equally deserved. Essential.",
    "114": "'Die Hard' is without a doubt the pinnacle of classic action films and a highlight of the 80s. There's only one name that terrorist fear; McClane!1. In a time when a new action star was needed, a young Bruce Willis rose to the challenge amidst the likes of Schwarzenegger and Stallone. Reluctantly on a trip to Los Angeles to meet his estranged wife (Bonnie Bedelia) and kids, John McClane (Bruce Willis) finds himself under the radar of a terrorist plot on Christmas Eve. Willis really was a breath of fresh air at the time of this film's release, considering no one knew what to expect since action stars of that era were damn near body-building types.2. As far as Willis is concerned, with every great hero...there must be a great villain to follow; enter Alan Rickman (Hans Gruber). Apart from '007' films, Rickman defined what a suave, intelligent and deadly antagonist can be. No matter how bad a villain is, it's equally fun to have a formidable henchman at his side, which (the late) Alexander Godunov (Karl) portrays with sheer brutality. However sad it was to hear of Rickman's passing, his legacy still lives on in his most memorable and career defining role as Hans Gruber.3. Behind a great action-flick like this, stood an exceptional director. John McTiernan proved his worth in the realm of action the previous year when he directed another cult and sci-fi classic; 'Predator'. It was clearly a no-brainer having him on board and in turn, McTiernan also went on to direct the third film in the franchise: 'Die Hard: With a Vengeance'. His directing style is obvious as can be since the action sequences are well maintained so that things never get derailed or too crazy.4. Reginald Vel Johnson and Paul Gleason round out the main cast, with memorable side characters as well that stand in as other terrorists and comic reliefs respectively. Willis himself adds more of the humor to the film when he finds himself in stressful situations as the film progresses. He just has a natural charm as McClane which no other action star has ever brought to a character before.To find things that don't work about this film is a hard task, cause I honestly can't think of anything. When spectacle meets action, that's when you'll know that old habits DIE HARD!!!",
    "115": "\"Die Hard\" is one of the best and iconic action films from Hollywood, starring Bruce Willis as NYPD Officer John McClane, who tries to save his wife Holly Gennaro and several of her co-workers and friends after being taken hostage by German terrorist Hans Gruber and his henchmen during a Christmas party at the Nakatomi Plaza in Los Angeles.Willis' witty and deadpan delivery personality, coupled with his never-say-die attitude and relentless attacks on the bad guys made him a force to be reckon with, giving us a tough yet comedic performance. A majority of the movie takes place inside the Nakatomi Plaza, where you will find all the heart-pounding action as Gruber terrorizes his hostages and tries to rob the treasures within the building the process, while McClane takes on his henchmen one-by-one.Alan Rickman did a wonderfully devious performance as Gruber, calm and crafty but cold enough to generate no sympathy. Bonnie Bedelia did a great job as Holly Gennaro - gentle, yet fearless. And, Reginald VelJohnson did great as Sgt. Al Powell. I enjoyed the parts of him communicating with McClane inside the building, giving him the will to stay tough with all the bad guys around him.Overall, it's a great movie full of suspense, thrills and excitement. Coupled with awesome special and sound effects and a solid plot, it's an edge-of-your-seat ride that is perfect for any action movie fans!Grade A",
    "116": "I won't say much about this film, the \"father\" of a new kind of action movies. There was a before DIE HARD, and there is an after DIE HARD. The same with CONAN, DIRTY HARRY, ESCAPE FROM NEW YORK, SAVING PRIVATE RYAN, HEAT, SCARFACE and so on. The kind of movie which provokes a chain reaction of hundreds of rip-offs. The only detail which I would like to talk about is the novel which this masterpiece is inspired from, a book written by Roderick Thorpe, the author of THE DETECTIVE. I read both books and I am still astonished to see how much they both are different from each other. As if you compared HAMLET and STAGECOACH. Same hero character in both, but for two soooo different topics and atmosphere, style and writing. And the novel seems very close to the movie, yes, but not on the meaning. In the novel the hero was visiting not his wife but his daughter. She was working for a huge company which, in the late seventies, sold weapons to the Chile dictatorship, a right winged regime that the terrorist of the story wanted to denounce. So, you see, this scheme is really far from the film's \"message\". The novel is really gritty, bitter in the meaning, The hero in the book doesn't hesitate to kill in cold blood some female terrorists who, at the end, fight for what they are convinced to be a fair fight against facism in Chile. The book is really immersive, radical, visceral, profound and dark. That's just what I want to say. One last thing, there is not a day in my life where I don't think about the loss of John McTiernan whoo seems to have the great difficulties to emerge since his relased from jail, back in 2014. Please, come back to us John !!!!",
    "117": "\"Die Hard\" is simply put one of the very best action movies that's ever been committed to film. Absolutely everything about the movie is perfect, or very close to it. Starting with Bruce Willis as the star, who finds himself caught up, totally unprepared, in a \"terrorist\" situation where a Japanese corporation's L.A. office building is taken over by heavily armed, highly trained German terrorists (or mercenaries, or maybe just thieves.)Alan Rickman is an incredible villain in this who steals every scene he's in.The best part about this movie is that it is much more believable and realistic than other action movies. He's a flawed cop, barefoot, and he actually makes mistakes and gets very badly hurt. The good guys aren't perfect. It's largely luck as well as his own toughness and ingenuity that get him through each gunfight, and his need to get his wife (who works for the corporation) back from the bad guys. Incredible story, pitch perfect acting, lots of great comic relief moments (the dad from Family Matters is in it!), fantastic action sequences. This movie is a must see for action lovers!",
    "118": "This is how an action flick should be done! And this just happened to be the flick that propelled Bruce Willis' career.As one reviewer put it, these are three key points that every action film should have:1. A sense of realism (meaning: the hero is only human and can get hurt)2. Grit (messy, unpolished action, dirty people and LOTS of swearing)3. R-rated violence (showing the audience what real weapons do to the human body)This film had it all, and the outstanding performance by Willis was perfect.A little fun fact for all you Willis fans: he was a bartender in NYC and gave a ride to a friend to an audition. While waiting for their audition to end, he got spotted and asked to audition - and got the part! The rest is history!A perfect 10/10 from me!",
    "119": "Die Hard is one of many action films made in the 1980s. Part of them weren't very good but some are real classics. This first Die Hard movie is one of those classics. Other Die Hard movies aren't as good as the first though I think Die Hard 3 and 4 are very good too. Before Die Hard series Bruce Willis was just a television actor. John McTiernan is the director of the movie.On Christmas Eve John McClane (Willis) who is a police from New York comes to Los Angeles to meet his estranged wife Holly (Bonnie Bedelia) who works for the Nakatomi Corporation. The company is holding a party at Nakatomi Plaza where Holly is invited too. Soon after John and Holly has argued Hans Gruber (Alan Rickman) who is a West German former political radical and his armed henchmen take control of the building. They are going to steal 640 million dollars.The movie is very exciting. The chemistry between the main characters John McClane and Hans Gruber is the most important thing why Die Hard is so good movie. McClane is a traditional hero character who opposes crime. Willis brings much rough charisma to his character. McClane's sense of humour is also very ruthless. Gruber is a manipulative criminal and mastermind. He is very cool and insensitive man. Rickman was even better as Gruber than Willis as McClane. His role work is of the highest quality. Gruber's very violent henchman Karl is totally crazy guy and memorable character. Gruber is maybe the best movie villain ever. The Plot isn't too simple. I think action scenes are more credible because computers and special effects don't play a big role in the movie.In my opinion Die Hard is best action movie ever. 10/10.",
    "120": "Bruce Willis stars as John McClane, a New York cop who flies out to Los Angeles to meet with his estranged wife at a Christms party in an LA Highrise that belongs to a wealthy company for which his wife works. Unknown to the guests, a group of terrorists headed by Alan Rickman takes everyone hostage, except McClane who manages to sneak by. Left with only his pistol, brains, and brawn McClane starts to give the bad guys hell.US action pictures were never the same after this film came out in 1988 and in watching it you can easily see why. Placed in one building over one night with one hero, who could have imagined such an exciting movie? Other 80s action films, while many of them are classics, never quite managed to accomplish what Die hard did so well. It is not the relentless action nor the characterization, but both of them combined. McClane is introduced like any other cop would be and not like some big guy who is obviously going to kick ass like say Schwarzenegger was shown in Commando. This film put a real human side to its hero - he's tough as nails, but not invincible. He relies on his brains and his brawn. He winces in pain, but pushes on. And of course he snaps wise-cracks and quotable lines: I mean who can truly forget \"yippy-kah-yay, motherf***er\" after seeing this movie even once?And it is not just the hero, but the villains he combats as well. They have their unlikable side and are obviously meant to be the bad guys, but they have their brains, their brawn, and of course their own weaknesses. Scripters Jeb Stuart and Steven de Souza must have gone about describing the villains pretty carefully in their screenplay and they have created a memorable bunch little army that is not your typical cardboard cut out set of villains. They range from a hacker who can't fight if his life depended on it to the mountainous assault rifle packing Karl who makes John McClane's day especially bad. Interestingly, Karl's seemingly endless fury isn't just an excuse to have a \"real tough ass\" bad guy, but it is characterized and introduced in of itself.Also, the music is very well developed. Beethoven's 9th is the backdrop for the score and it is interesting to see how it was put into the story in a both diagetic and a non-diagetic level. Added to that, they even put a Christmas twist to it.Finally, when you consider the fact that this one movie not only spawned an overall great trilogy, but a whole little sub-genre of \"Die Hard on a...\" makes this a great film all around. 10/10Rated R: violence and profanity",
    "121": "(NO SPOILERS, BECAUSE I'M COOL) This is my favorite film ever made and this film is a masterpiece. If you don't like this movie, that's fine, I was just joking in the title, but from my perspective, there is no reason to not like this film. The first thing I want to say about this legendary film is that there can be good 1st acts in films, but normally they are the worst part in the movie, which it is here, but in this film every act is consistently amazing and the second and 3rd act are only slightly better than the 1st one. Bruce Willis is a laughable action star, right? No, he is so cool and he seems like a genuine cop wondering how he got himself into this situation. Alan Rickman as Hans Gruber has an even better acting performance and if they got some random other guy who was popular, but just ok at acting, this film would not even be in my top 20, even with the great writing. It takes place on Christmas, and it is of course and argument whether it is a Christmas movie, personally, I think Die Hard 2 is a Christmas movie, but not Die Hard. Sorry, this review has been all over the place, I'm new to these, but the last thing I want to talk about is the humor, basically all of the humor is given to Bruce Willis, and I'm glad. I watched a 45 minute documentary on this movie, and the things he says in these movies are definitely things he would actually say in real life. Overall this is a great movie for adults, and even some kids who are mature enough to watch it. Honestly this is a great dad-son movie. 10/10 MASTERPIECE!",
    "122": "I'm back in 1988, when Die Hard came out and I'm reliving that year in memory.A superb action movie that's a standard by itself with great everything, being its screenplay, acting, development, flow and ending.It isn't the first of the genre and surely won't be the last, but is the only one directed by the very talented director John McTiernan that combines suspense, thrill and magic.Loved the stellar cast, loved the magical score and loved the broken glasses, falling and sparkling before my eyes.I still see Hans Gruber, extending his hand, desperately trying to reach a long lost chimera...\nRIP Alan RickmanScreenplay/story: 9.5Development: 9.5Realism: 9.5Entertainment: 10Acting: 9Photography/filming: 9.5Visuals/special effects: 9.5Music/score: 9.5Depth: 9Logic: 9Flow: 10Thrill/drama: 10Ending: 9.",
    "123": "Die Hard, one of the greatest action movies of all time, still to this day, it's more impressive than ever. If you were to look in the dictionary and look up the word action, this movie would probably be shown, lol. My mom was just absolutely in love with this film and told me how much I should see it if I love action movies, also I had become a Bruce Willis fan, so when she mentioned that, I decided to sit down and watch it. It's not just Bruce Willis that makes this movie, although he does a fantastic job as the ultimate hero, his line delivery is always perfectly on cue and he's just such a cool guy that anyone could love. But for me it was Alan Rickman who truly steals the film, he is the ultimate bad guy and his voice was just so creepy, I love him. But all together the cast and special effects truly make this a memorable film for generations to come.John McClane is a police officer who has taken his career very seriously, a little too seriously since his wife is about to divorce him and he's about to loose his children. When John comes to see his wife, Holly, at her office building during the company Christmas party, he asks if he can be given a second chance, but that gets slightly interrupted when terrorists enter the building. Hans Gruber, the leader of the terrorists, wants 600 million dollars of bonds from the company's owner. But with John in the building, he's gonna have a hard time because John is on his case will make sure to give him a roller coaster of a crime bust.This is without a doubt the most exciting action movie since The Terminator. I love the whole idea of this taking place around Christmas, it just adds a little more dark humor. Especially the way that Alan Rickman says \"Now I have a machine gun. Ho...Ho...Ho\", it was just so perfect! I really love Die Hard, I am officially a fan, this is just the most awesome movie to watch. Believe me, it's that good, I highly recommend this movie for anyone, it's a lot of fun, I guarantee you that you will not be disappointed.10/10",
    "124": "This may be the epitome of 80s action film, Bruce Willis stars as John McClane opposite Alan Rickman as Hans Gruber and both of them are eating every scene up. John McClane is the sarcastic renegade cop opposite Hans Gruber, the super intelligent German terrorist and if you think this sounds cliché it's because it is, still I loved it.The film brilliantly manages to up the stakes and grow tension throughout as we slowly learn the true extent of the villains plan, as well as that I love the way we see all the fights and injuries gradually wearing down McClane. Now while you know my opinions on Rickman and Willis, what about the surrounding cast? I think that on the whole they're really good apart from Bonnie Bedelia, who in her defence isn't given much screen time, and the group of goons who are just there to fight Willis and feel more like obstacles than people, still does that take away from the film? No. My biggest issue with the film is the sub plot of a Limo Driver being stuck in the tower car park, we keep cutting back to him and he adds nothing to the film, if you removed him it would have zero impact. Apart from that I'm a big fan, none of the technical aspects are outstanding but that doesn't take away from the fact that this is easily one of my favourite action films of all time and one I hope to revisit every Christmas from now on.",
    "125": "This movie begins with a New York cop by the name of \"John McClane\" (Bruce Willis) arriving in Los Angeles to spend some time with his estranged wife \"Holly Gennaro-McClane\" (Bonnie Bedilia) and their two children during the Christmas holidays. Upon making his way through the airport, he is greeted by a limousine driver by the name of \"Argyle\" (De'voreaux White) who has been hired by his wife's company to take him to a party being held in their high-rise corporate office. Once there, he is greeted by the manager of the company \"Mr. Takagi\" (James Shigeta) along with Holly and a couple of her colleagues. Not long afterward, he goes to the washroom to freshen up and while he's away from those at the party, a dozen terrorists enter the building armed with all kinds of weaponry and proceed to take everyone hostage--everyone except John, that is, who is also armed and intends to free the hostages no matter what it takes. Now, rather than reveal any more, I will just say that this was an outstanding action film which, even though it is a bit long, kept my attention from start-to-finish. I especially liked the acting of Alan Rickman (as the terrorist leader \"Hans Gruber\") who was a perfect fit for the role along with that of the aforementioned Bruce Willis as well. In any case, I recommend this film for those looking for a good, action-packed film during the holiday season. It's quite remarkable.",
    "126": "Is there anyone out there who hasn't seen Die Hard? It's an American staple in the universally loved genre of action movies, so unless you really don't like them, you've probably seen it. I'll tell you a secret: I fell asleep the first time I watched it. Thanks to the magical DVD player and the boxed set of Die Hard DVDs my dad bought, there've been ample opportunities to rectify my mistake and watch the movie again.In this Bruce Willis classic, action, tense drama, comedic one-liners, and Christmas are all mixed together to make a winning combination. Walking barefoot on broken glass might not be the type of scene you want to watch him in during the holidays, but Die Hard has been added to many people's Christmas movie traditions. He plays the iconic policeman John McLane-with an iconic catchphrase that isn't appropriate to write out or say in front of children-who, on Christmas Eve, winds up fighting the scary Alan Rickman, a German terrorist who takes a building full of people hostage, instead of reconciling with his wife, which was his original plan for the evening.Sometimes the old action flicks wind up becoming cheesy over time. While I'm not one to call 1988 an ancient time, this movie has had time to settle, and even among the young, impatient audiences of today, it's still enjoyed and entertaining. When James Shigeta says, \"You'll just have to kill me,\" he's not saying anything new; hostages have always whimpered to villains that they don't have the needed information, and the villains always shrug and let them live. In Die Hard, Alan Rickman shrugs and follows James's suggestion. It's iconic, funny, terrible, and makes Alan both a wonderful and frightening villain. Get ready to start quoting both the hero and the villain, and you're guaranteed to have a \"yippe ki-yay\" of a good time.",
    "127": "Until I saw Die Hard I heard rumors about it. \"magnificent\", \"best action movie ever\", \"unmissable\", \"often copied, never bettered\". And the weirdest thing was that I didn't believe those quotes. So, I rented it on video a few years prior, watched it, kicked myself, and watched it as many times as I could because I couldn't get enough of it!! Die Hard is one of the most eye popping action movies ever made in cinematic history. I personally think this IS the greatest action movie out there on the video shelves! PLOT. It's Christmas Eve. A New York cop named John McClane has just arrived in California to meet up with his wife. His wife Holly has a great career working for the Nacatomi Plasa, a highly successful buisness. Tonight the Nacatomi Plasa is celebrating it's most successful year with most of it's workers attending. Soon after John arrives, terrorists seize control of the 40 story building! Now John must use all his wits, abillities, and knowlege to save the lives of all the hostages, including his wife. This is nearly as good as it gets as the movie progresses with hair rising stunts, explosions and gunfights. Bruce Willis is a very apealing action star, with all his dark humor-ed one liners and moves. Alan Rickman plays the head terrorist with a lot of style and devilishly great charisma. The two of them play off each other terrificly. Packed with plot twist after plot twist, eye popping explosion after eye popping gun fight, and over all 100% thrills make this action-er stand out among the list of good action movies. Okay, some of the stunts would seem un realistic. But movie lovers of all kind, LET GO. loose yourself in this movie about a man fighting an uphill battle, with the odds of winning stacked against him. A man who doesn't know what he'll do next, a man who has no choice but to fight. A truely spectacular movie that is to NOT be missed by an action fan of any kind. 9.6/10. MPAA Rated R for: strong, sometimes gory violence, strong language, some nudity and some drug content.",
    "128": "It has all the ingredients of Entertainment. Deadly Action sequences. Typical Smart ass conversations between the Bad guy and The Good guy. A healthy army of dispensable henchmen , all of whom represent the widest variety in terms of Race, Ethnicity, Sex , Attitudes , Build and Accents.Odds against the good guy. Hostage Situation. A reluctant hero. An unassuming aide. The sophisticated and bright Villain. His star team, comprising of equally brilliant and skillful crooks.You can watch this movie for umpteen number of times without ever getting bored. They don't make such movies now. This one though is no holds barred entertainer . The Introduction, Body and Conclusion of this essay outdo one another.Just great.",
    "129": "(r#56)This was an exhilarating movie that anyone should be able to enjoy. Bruce Willis shines in his breakthrough role as John McClane, the wise-cracking hard-ass cop. Willis, although a rookie actor, handles his shamelessly bad-ass one-liners as well as his dramatic scenes very well and never feels unbelievable. Alan Rickman almost steals the show from Bruce himself as the ultimate German villain, Hans Gruber. Rickman is a fantastic actor and it makes me sad to see him sleepwalking through The Hitchhiker's Guide to the Galaxy and the Harry Potter series when he should be focusing on finding a good script instead. We need more movies like Galaxy Quest and Die Hard from him.John McTiernan creates a perfect balance between the smashing action sequences, the character development and the humour, and as a result, Die Hard is one of very few movies that can be called \"perfect\" blockbusters. McTiernan had previously directed the Arnold classic Predator, but in my opinion Die Hard blows its predecessor out of the water in terms of pure awesomeness. The script is shock full of memorable lines that seem to have been written for Willis. The tension is thick throughout, but the comedy (mainly provided by McClane's one-liners, but also by a pathetically incompetent police deputy and an ignorant newsreader) never feels out of place or forced. It is perfection on all levels, and I wish that I could've been born in the late seventies just so I could've seen this film in the theatre. I don't think any fan of action could dislike Die Hard, and neither would most fans of movies in general. It is a great thrill-ride from start to finish and features some of the greatest one-lines in history. It's just plain awesome even 18 years after its release. See it.",
    "130": "Despite its flaws, 'Die Hard' remains as one of the best action films of all time. I've seen this movie dozens of times, and really enjoyed its sequels (aside from part 2, a la 'Indiana Jones 2.') This absolute classic set all the standards, or in better terms, clichés. So, if you watch this today, you might recognize a lot of the scenes, dialogue, \"surprises,\" but real \"die hard\" fans will see this started it all. Much like 'Halloween' really was the birth of the slasher film (others will dispute, but it really was Michael Myers that started the trends.) Unfortunately for the copy-cats, 'Die Hard' had an excellent villain (Rickman) and supporting cast. In addition, and most importantly, it had Bruce Willis who was, I've read, the bottom of the barrel choice of the producers and yet, contributed the most depth of ANY HERO of these 'Die Hard' rip offs. He had great lines, depth, realistic approach, was vulnerable, and simply human. As stated, despite its flaws (the white-to-green wife beater was solely a distraction and the fact two main characters seemed to just ride off in the sunset – yes, it was part of the storyline, but surely unrealistic to the rest of the \"it could really happen\" plot) 'Die Hard' was nearly perfect, and this was thanks to nearly perfect performances from Rickman and Willis. Not to mention the continuous and great action sequences. Basically, on Christmas Eve, Willis flies into LA from NYC to make good with wife only to help hostages during a heist. Only thing I would've done differently in Willis' role was, when he had the police on the secret radio, was to threatened the President. I'm sure that would've brought more than just the police. And $.74 gas? Wow, I love the 80s!",
    "131": "Die Hard still remains, to this day, one of the best action films of all time. Directed by John McTiernan (The Hunt for Red October, Predator) and written by Jeb Stuart (The Fugitive), the story packs a great amount of action and suspense with memorably immortal characters.The acting: This was the film that propelled Bruce Willis to absolute stardom. Starring as the charismatic Officer John McClane of the NYPD, Willis lacks the Schwarzenegger-esque physique but shows us you don't need bulging muscles to defeat your foes. Rather, he is presented as the everyday Joe who is thrust into a flurry of German terrorists. His screen presence is strong throughout, with his witty one-liners (Yippy-Ki-yay, motha*****) and believable character development. There are smaller details presented where Willis reveals more of a vulnerable side to him (usually when he is alone) that perfectly contrasts his 'cop machismo'. As he barely escapes one threat presented after another, we are reminded that this is a normal guy in a highly abnormal situation.Another character who absolutely owns his screen time is Hans Gruber, played by an electric Alan Rickman. He gives a spectacular performance as the leader of the terrorists - conniving, intelligent and also has a comical side. His subtly sinister demeanor keeps us on the edge of our seat and we relish his every move. Perhaps that is why Die Hard has succeeded where so many other action films have failed. We are equally engrossed by both the virtuous and villainous figures presented.The screenplay: Taking place in predominantly one area for the majority of the film, Die Hard delivers one taut thrill after another. The sense of realism and grittiness does not seem too far-fetched, even for an action flick. The explosions are not superfluous and the gore is not unnecessary – it all helps in developing McClaine's character and shows us the right extent of how chaotic things become for him.I particularly loved the meta-humor (\"This time John Wayne does not walk off into the sunset with Grace Kelly.\" \"That was Gary Cooper, a**hole.\") And banter was common in this film, whether it being between Hans and John, John and Office Powell. The superb dialogue, acting and direction manage to elevate this film an echelon above its action-film wannabes.",
    "132": "One of the things I love about action films is just like with the suspense thrillers it plays with all the what ifs, where something that most likely wouldn't happen or are considered unthinkable does and from this two questions are asked, \"if ever put under the spot how would we deal with the situation?\" and \"is it possible to survive and win?\"This film is one of my favorite movies of all time, but also, it's my second favorite action film of all time. And of course, one of my favorite Christmas movies. I remember seeing this when I was an adolescent it blew me away, even today I still have lots of fun watching. Heck, even watching the trailer for this film is lots of fun, with that music going on and hearing some of that narrative from the late great Don Lamonte, he always had that great voice for ad narration and is something I sorely miss in trailers.And this film wasn't just another 80's action film it was a phenomenon where this film has established itself as a subgenre in the action genre as many other films throughout the year and TV episodes have utilized the format like the movie \"Under Siege\" and the underrated \"Toy Soldiers\" but that's and many others are different stories. Even has a few video games, two of them are good like \"Die Hard Trilogy\" for PS1 and \"Die Hard Arcade\". There were even two pre sequel comics from Boom Studios based on John McClane that are surprisingly good. And even most recently a tabletop game that is cool.I really love the plotline; from the way it's conducted it feels plausible; who's to say it can't happen or no criminal organization has every had this in the back of their minds.The characters are great there are a lot of colorful characters.Karl played by late and underrated actor Alexander Godunov whom is a solid subordinate villain as he is just throughout the film from beginning to end, hellbent in liquidating McClane. It's just interesting how as the film gets further along the more this guy's cool and sanity is just melting faster than the polar ice caps.And of course, the late great Alan Rickman one of my favorite actors is great as Hans Gruber, this is one of my favorite roles from him and he's an honorable mention in favorite fictional villains. The Hans Gruber character isn't really a deep character as he's more of an archetypal villain but I think it was really in Alan's performance that makes him stand out, from the sharp German accent that you feel ever word could almost cut you like a knife.He's a villain that is just constantly in control, much like a chess player he is a step or two ahead as he already has an elaborate plan in action. But he's very cold, calculating, and ruthless he isn't afraid to off anybody that gets in the way or tries to ruin his scheme. But also the guy has a dry charisma which means he's got some memorable lines and humor but in a different way, one line that makes me snicker is \"I read about them in Time magazine.\" , I know small line but once you see the scene you'll know why it's funny.Supporting characters are good like Officer Dwight whom is played by the late and underrated actor Paul Gleason. He's is someone you just love to dislike as he is pretty much that stereotypical jerk police chief whom we see is constantly trying to oversee the situation but it really not in charge of jack squat. What's funny about him is that he's practically a moron, but I do like that he at least tries to help despite not good at it.And there is of course Sergeant Al Powell played well by Reginald VelJohnson, whom I always call the character Carl Winslow as that is that actors signature character from the TV show \"Family Matters\" as both characters are kind of the same. Anyway, really like how he really provides support for John by keeping him up to date on what's going on the ground as well as provide some intelligence from John about the perpetrators. But just like the back and forth between both of them which is touching and gives the film the buddy cop element, but here it's different because it's a long distance friendship; I thought that was cool because it's something different that don't see in that sub-genre.But of course, it's the protagonist himself we love and are here for. Bruce Willis whom is an honorable mention in favorite actors in my book is great as John McClane, this is my favorite role from him, it's practically his signature role and John is sort of an honorable mention in favorite fictional heroes.At the time he wasn't your typical or conventional action hero as he wasn't a man of muscle or not much muscle, let alone had the greatest set of fighting skills but that's part of why this action hero is great is because he's you everyday guy which made him somewhat relatable and shows how you don't have to be a man of muscle to kick ass.One of the things this action hero has going for him is his sharp, witty, wise cracking charisma; this character just has lots of funny and memorable lines; he's much like Deadpool as he just keeps the jokes and lines coming. This in a way really helps in keeping his cool as well as being able to think straight under a highly stressful situation.I even like how human the guy is as we get some depth into him, as we see his marriage is on the rocks and he's aware that he's not perfect that part of the reason is he fraked up a little, but he really does want to make things better you can say this situation was one hell of a way to do it. I also just like how he reacts to things which feel like how any ordinary person would react, really like how at times he talks to himself to help himself think, in those scenes the film is almost a one man show, one of my favorite quotes is \"Think God Damnit Think.\" Yeah that what I always say whenever I have a certain dilemma I have to deal with.Also, you see in some places how tired and slightly irritated mannerism as you can tell half the time he's thinking \"I don't want to do this, I really don't.\", he didn't ask nor want to put himself in the action hero position as all he really wanted to do was the simplest thing spending Christmas with his family. But he has no choice so he pretty much rolls his eyes and goes with the role as no one else can do it, let alone his life and many others depend on it.The action is well choregraphed, I like that it doesn't look too smooth which makes the film a bit realistic if you can believe that. You have some solid shootouts in the building like one that involves probably the biggest boardroom meeting table I've ever seen, which is kind of funny as it seems big enough to fit Congress. As well as a one on one fight which is one of my favorite one on ones of all time as both Karl and John are going at it, I liked the way it was done because it really felt realistic as it looked like real fighting. As a real fight wouldn't be perfectly choregraphed and there are no rules involved as both are fighting dirty.And of course, the effects are great like the explosion which are practical there's no CGI bullcrap which makes them look beautiful. My favorite is of course the explosion of the third floor, when I saw, word will fail to describe this as you have to see it for yourself but seeing it, I thought \"Wow, John you nuked the building.\"Music is also great, there are plenty of memorable scores which create excitement and suspense. Even like the use of one famous Christmas song from Dean Martin in the end credits \"Let it Snow\" every time I hear that song, I can't help but think of this film.What also makes this action film unique is the suspense from the physical situations of going from point A to B, surviving the firefights, and close calls in places that really put me on the edge of my seat.But also, double layered and clever in what is revealed to us and not revealed. Where on one hand you are sometimes in the robber's shoes as you actually do want them to open that vault, but seeing their perspective actually helps make us at times part of the action because we actually are one step ahead of the protagonist. And the suspense is hopping the protagonist will be able to catch up on time, get a step ahead but also help fill in a blank or two because despite knowing most of Han's plans there is one part of it, we still don't understand.Also, it's not just physical warfare but it's also a war of wits. Both John and Hans are both smart people, Han's heist plan and methodology is fool proof but the problem with him and the robbers is their thinking is inflexible and rigid because they never counted on an anomaly in the plan. John his intelligence might not be on the same level as Hans, as Hans stated he's had the finest education but good enough, because the thing about John is that his thinking is unorthodox, he is able to improvise and think on his feet literally.Die Hard will blow you away and Merry Christmas.Rating: 4 stars",
    "133": "The idea has a certain allure to it: A cop is trapped inside a high-rise with a team of desperate terrorists. He is all that stands between them and their hostages. Give the terrorist leader brains and a personality, make one of the hostages the estranged wife of the cop and you've got a movie. Die Hard,\" and it stars Bruce Willis in another one of those Hollywood action roles where the hero's shirt is ripped off in the first reel so you can see how much time he has been spending at the gym. He's a New York cop who has flown out to Los Angeles for Christmas, and we quickly learn that his marriage was put on hold after his wife (Bonnie Bedelia) left for the Coast to accept a great job offer. They, too, are a multinational group, led by a German named Hans Gruber (Alan Rickman) who is well-dressed and has a neatly trimmed beard and talks like an intellectual and thinks he is superior to the riffraff he has to associate with. He has a plan that has been devised with clockwork precision involving the theft of millions of dollars in negotiable bonds, and it is only after Willis starts causing trouble that he is forced to take the Nakatomi employees as hostages. But then the filmmakers introduce a gratuitous and unnecessary additional character: the deputy police chief (Paul Gleason), who doubts that the guy on the other end of the radio is really a New York cop at all. Without the deputy chief and all that he represents, \"Die Hard\" would have been a more than passable thriller. With him, it's a mess, and that's a shame, because the film does contain superior special effects, impressive stunt work and good performances, especially by Rickman as the terrorist. Here's a suggestion for thrillermakers: You can't go wrong if all of the characters in your movie are at least as intelligent as most of the characters in your audience.",
    "134": "It isn't Christmas if you don't watch Die Hard. Yippee-kiyay motherfu...well, you know the rest. John McClane. Nakatomi Plaza. Hans Gruber. Twinkies. \"Let it snow, let it snow, let it snoooow\". McTiernan's near-masterpiece is the epitome of 80s action and truly sets the bar high for future action films. It evolves the genre to new levels by balancing drama and character development with memorable explosions and a slew of gunfire. McClane visits his wife on her Christmas work party, when a group of terrorists hold them hostage for a large sum of money. But McClane doesn't sit down and roll over. Oh no, in typical cowboy fashion he targets the enemy. Luring them to their demise. Bang. You just got \"McClaned\". \"Thanks for the advice\". This isn't just an action film, don't be fooled by its overwhelming praise. Although justified, this is also actually a well balanced crime thriller. Gripping dialogue between McClane and Gruber allows both characters to have infectious personalities. The former being this New York loud mouth with a ludicrous amount of quippy lines and the latter being the commanding antagonist that withholds a sense of compromise. Their interactions, or lack of, was tangible. Then the police department and FBI get involved, but the development doesn't stop there. In fact, it just ramps up with the action. Aside from Argyle, who is just an obvious plot convenience, all the characters have natural inclusion to the story. The action was explosive and surprisingly bloody, particularly the rooftop C4 explosion. McTiernan's direction was perfect, crafting a perfectly paced narrative. Packed to the brim with memorability, from its antagonist and his slow-motion demise (Rickman was an absolute legend) to the various quotable lines of dialogue. This is a near-perfect film, and one that deserves the acclaim it has garnered. With excellent performances to boot from Willis and Rickman, there really are a limited amount of flaws (in fact hardly any). Merry Christmas McClane, merry frickin' Christmas!",
    "135": "Nearly twenty years and millions of clichés later, the original Die Hard still holds up in all of it's Hollywood glory. One of the last films to come out of that greater era of quality popcorn entertainment (compared to today's standards), this fluidly visceral, though lighthearted study into the hostage tensions overtaking 40-story Nakatomi plaza has become a modern day action classic for all the right reasons.Sure some characters have devolved into caricature upon recent viewings (Hart Bochner's coked up Ellis), sure the entire mechanics informing this intense ordeal feel a little less gripping in retrospect, and sure an excess of one-liners can degrade the entire process on the whole...but not by a whole lot. Die Hard was perfectly calibrated to be as entertaining as it was bloody, adult, and exciting when it arrived. While time may have extracted a percentage of the urgency out of this eternally exciting experience, conceptually the original Die Hard will continue to remain one of the most captivating settings ever staged in a modern action film. The selfless direction from John McTiernan was hitting it's stride as he captured progressively intense battles in a simultaneously spacious and claustrophobic setting.It is the triumphant locale which hosts this intelligent robbery thriller that will continue to beckon re-visitation, though without the considerable tension between our two leads, Nakatomi skyscraper would remain an empty gesture. Bruce Willis could not have asked for a better early career move then to star as New York cop John McClane. Even if it did pigeon-hole his limited talent, Willis already displayed the raw intuition that made him one of our most agreeable action stars. His everyman style was one of instant cult likability: a person most average joe's could relate to, thrust into a situation no one could relate to. His line deliveries will pale to the actor who has slightly but surely refined his craft over many years, but the finesse with which he eases into the action with believability and likability became instantly recognizable.",
    "136": "It has just about everything, a good guy we all love, a mean and fun villain and of course a lot of action.A film that conquers with its simplicity, charm, humor and brutal action. The cast is excellent, Bruce Willis is obviously the perfect choice for the role of John McClane.The supporting characters are also interesting here, and the villain is just great. Alan Rickman is superb as Hans Gruber.The action scenes look brutal, bloody and spectacular. The atmosphere is tense, a perfect blend of humor and action. The cast portrayed these great characters superbly.The action is brutal and bloody as it should be, and the main character struggles to stay alive, bleeding and killing the villains one by one. And along the way he manages to throw in a few good jokes.Bruce Willis at his best. An absolute classic of the action genre.",
    "137": "Exhilarating, thrill to-the-moment joyride that will have you cheering! Tough New York City cop, John McClane (Bruce Willis) travels to Los Angeles on an invitation by a powerful corporate leader to celebrate at a Christmas Eve Party, where McClane's estranged wife (Bonnie Bedella) is attending. This was supposed to be a peaceful, joyous occasion, but before McClane could reconcile with his wife,internationally based terrorists lead by Hans Gouber (Alan Rickman, in a terrific performance) and his assistant (the late Alexander Godunov in a fine supporting role) hijack the tall skyscraper. Several hostages are killed, and the police and FBI have been called in to negotiate.What follows is a non-stop spectacle of stunts, explosions, and amazing action cheorography. Hans Gouber has kept several of the patrons hostage, and he assumed only too much that he had tied all the loose ends. However, Gouber and his mercenaries have not counted on McClane to intervene on the action! The stakes are rising though...as McClane's wife is among one of several hostages captured at this moment.Don't count McClane out yet!DIE HARD is a one-of-kind action movie that has a breathtaking pace and offers plenty of wits between McClane and Gouber. Bruce Willis gives an excellent performance as McClane, the ordinary guy who has entered the wrong scenario at the right time. Alan Rickman made a terrifying villian, Hans Gouber. Bonnie Bedella was annoying but hysterical as a wiseacre ex-wife turned hostage. The direction by John McTieran (PREDATOR, THE LAST ACTION HERO) was not short of being superb and first class.DIE HARD is one action packed movie that offers thrills, excitement, and plenty of fast paced humor and wisecracks from Willis. The action is fast and furious, and the film pulls enough punches to keep the energy flowing! DIE HARD is simply one of the most cinematic action masterpieces ever. It is often a rarity to see such a white knuckle adventure that keeps you on the edge of the seat throughout the entire film. Bravo!RATING: ***1/2 out of ****.",
    "138": "In the 1980s, a unique trend developed in American Cinema. It became popular for one man to go against a larger superior force and emerge triumphant. Die Hard if not the progenitor of this genre, it most certainly stands as the prototype. It helped to establish what is possible for the emerging action genre when done right.This film also established the career of Bruce Willis. At the time, he was considered a major risk. He had not had any significant \"breaks\" into film and had an average television career. Through his performance he became a household name and would be propelled into stardom. Mr. Willis was able to capture the \"everyman\" struggling through his life and never giving up.Die Hard also introduced to the world the character actor, Alan Rickman. An actor whose speaking voice comes across solemn and droll. His voice was perfect for conveying the arrogance of Hans Gruber, the film's antagonist. He also has a chance to put his voice talents to use as he is required to use two different accents for the role.The film follows a New York policeman, John McClain (Bruce Willis) who finds himself in the wrong place at the wrong time when a group of German terrorists led by Hans Gruber (Alan Rickman) take control of a skyscraper. The film does a good job of balancing action with McClain's physical and emotional suffering. Over time it has held up as an iconic film of the decade as well as within it's own genre.",
    "139": "Die Hard is regularly ranked as the greatest of all the 80s action movies, and among the greatest of all time, and even 25 years later, it is not difficult to see why. Die Hard really is action film-making at its best, and began a new type of actioner - the everyman caught in a unique situation - that many films would try to copy; some more successfully than others, but none would ever measure up to the original. That even includes the 4 (and counting) sequels! It would launch the careers of Bruce Willis and Alan Rickman skyward - admittedly on different trajectories - and even become a bizarrely popular choice for a seasonal festive film each December! John McClane (Willis) is a New York cop who has travelled to Los Angeles to reunite with his estranged wife Holly (Bonnie Bedelia) at a Christmas party in a city skyscraper, when an armed band of villains march in with machine guns and take over, led by Alan Rickman's evil Hans Gruber, holding the partygoers to ransom. McClane must then work his way through the building, picking off the terrorists one by one, fighting a one-man war while the LAPD pontificates impotently on the doorstep.The recipe is incredibly simple, yet brilliantly effective; the ludicrous situation is tempered by the Regular Joe nature of Willis's character, allowing the audience to identify wholeheartedly with his efforts and motivations, while hissing at the Machiavellian machinations of arch-criminal Gruber. The action itself is replete with some superb and exciting shootouts, spectacular set pieces and a new level of violence not often seen in such a mainstream action film before now - just watch for the scene with the broken glass, and you'll be wincing for weeks! Bruce Willis so perfectly captured the essence of his character, that the image, hair and even name have become synonymous with action heroes for all movies hereafter. The iconic shaved head and dirty white vest perfectly captured the feel of the right man caught in the wrong place at the wrong time, but it was not just Willis's physique and wardrobe that made John McClane such a hero. His fight scenes are brutally brilliant, and his delivery of both threats and sarcastic one-liners will have audiences punching the air and chuckling in equal measure. His radio exchanges with Rickman's Gruber are superb, and his charming banter with Sgt Al Powell on the outside - also over radio - lend the character an extra warmth that could easily have been missed, which would have made the character slightly less sympathetic.But every great hero needs a villain, and Alan Rickman produced a performance of a lifetime; one which would lead him to being pigeonholed as a great British 'character actor' - Hollywood code for 'plays great villains!'. Admittedly this would lead him to even further success, most notably as the Sheriff of Nottingham in Robin Hood Prince of Thieves, and of course Professor Snape in the Harry Potter films, but it was unquestionably this role that set him on the role to a reputation as one of the greatest villainous actors of the twentieth century. His performance is never overstated, and without resorting to scenery-chewing, makes every single line positively drip with threat and menace. But he is also allowed a few light moments of his own in between his shooting of innocent bystanders - darkly comic interplay with the FBI outside in particular. His arrogant dismissive nature of the FBI while reeling off a list of names the group want freed is particularly black - his request for one group that he then mouths to his associate that he 'read about them in Time Magazine' a standout. His ability to produce a villain who is both positively loathsome and yet darkly charismatic makes Die Hard just as much Rickman's film as it does Bruce Willis's. Jeremy Irons' attempt to reproduce this balance in the film's third entry pales in comparison, producing a villain that is fun, but unfortunately occasionally too camp to be truly hissable.The majority of the other characters are generally rather 2-dimensional, in particular McLane's estranged wife Holly, whose character is unfortunately lacking much in the way of back-story that could have made Willis's mission even more effective, whilst the henchman are as typically anonymous as you might expect from such an actioner. The rest of the attendees at the party are also mostly anonymous, making it difficult for the audience to truly get invested in their fate.But such quibbles are unquestionably minor next to the brilliance of the whole, and such was the film's success that virtually every action film of its type would thus be labelled as the 'new Die Hard' or the even more derivative 'Die Hard on a plane/train/boat/submarine' (delete as applicable). So to see how films like Die Hard actioners should be done, it can only be Die Hard itself. A true era-defining film, one that even gained numerous name-checks in 'Friends' to demonstrate its iconic nature, that became a perfect template for all subsequent action films to follow.",
    "140": "In the midst of so many copies of the action genre of the 1980s, Die Hard was born, based on a 1970 novel by writer Roderick Thorp entitled Nothing Lasts Forever. This first adventure by police officer John McClane became one of the great references of the genre. The rules of action cinema in Hollywood have been rewritten and experienced a welcome evolution in the three decades that followed the explosion of Die Hard. At first glance, Die Hard can be seen superficially as a film of an invincible army man, who ends up alone with a catastrophic terrorist assault that involves millions of dollars, a lot of shooting, blood and death. But the work of the ever underestimated John McTiernan is much more profound, referential and iconic than this.John McClane (Bruce Willis) is a New York detective who is going to Los Angeles to meet his wife (Bonnie Bedelia), who works at a Japanese company. However, upon arriving at the building where she works, he realizes that the building is being assaulted by a band of terrorists and decides to disrupt his plans to rescue his wife.One of the great differences of the script of Jeb Stuart and Steven E. de Souza was to bring in John McClane a hero of different action. Unlike the \"superheroes\" who used to save the day badly by sweating their shirts, the policeman in the wrong place at the right time was a normal guy, without special training, without muscles, who runs, sweats, bleeds, despairs and he is very lucky to get to the end of the day. McClane, on the other hand, was not as realistic as Popeye Doyle, who gave Oscar to Gene Hackman in Operation France, there was no subtext to the character beyond what is explicit on the scene. The studio, in turn, wanted to bet more on the action and concept of the film than on its protagonist. Die Hard looked like an anomaly, and in the end, Bruce Willis won his first big role. Willis' casting was a great success, given the need to find a delicate balance between an invincible policeman and a human being like any other, with whom the viewer can reasonably identify.The script is very skillful in not only building McClane's character by avoiding expository texts or long sequences that precede the action itself, but also in pacing the narrative in a logical crescendo, so much so that McClane does not delay. partnership with a brave local common policeman (Al Powell, played by the friendly Reginald VelJohnson) with whom he communicates via radio, as well as on the side of the villain Hans Gruber, with shady purposes that only make the plot more palatable. Everything we need to know about the protagonist we learned in the initial ten minutes of the projection, the only ones really calm in the work and what we see, from there, is a well-connected succession of risk situations behind risk situations that, however, do not they create sensory overdoses and do not necessarily have that obsessive Hollywood tendency to turn the next scene into something grander or noisier than the previous one.The $28 million lean budget was offset by the sweat of McTiernan's team and the brilliant work of producers Lawrence Gordon and Joel Silver. Production started with the concept of the unfinished film. Scenarios were still being built and the ending was being discussed when McTiernan and his team stormed Fox's own Los Angeles headquarters, alongside the company's studios in Century City, to house production. The building was still being completed, and much of what we see in the film was shot on location, including the unfinished floors. The original concepts were changed by the director. He traded terrorists in the original film for thieves in search of the millions kept in the building's vault, who pretended to be terrorists as part of the plan. The action, extended over three days in the original text, was condensed into a single night, Christmas Eve.It is also the director's merit to make the most of the extremely detailed production design for each floor of the building under attack that leaves nothing to owe to what we see in Hell in the Tower. Using the setting as an inextricable part of the narrative just as he did with the rainforest surrounding Dutch and his companions in The Predator, McTiernan, along with the photograph of Jan de Bont (well before venturing into the director's chair at full speed) gives life to inanimate objects, to the grand but functional sets and to the Nakatomi Plaza itself, transforming them into real characters in the plot. The soundtrack of the prolific Michael Kamen, who specializes in action films, is loaded with functional elements that aim to amplify the suspense in the film, but without drawing attention to itself with leit motifs of characters or other artifices of the genre.\nThe first thing that is noticeably obvious in Die Hard is his little affair with men seen as important by the societies that surround them. While Alan Rickman's Hans, the leader in front of the terrorists, is cold, calculating and feared, you can see how everyone else is treated with disdain, as if history made a point of dismissing them. Who is the first to die? The president of the company, the highest ranking man among all hostages. What about the FBI agents? Seen with trembling eyes by the majority of criminals in police films, they appear here in a tragicomic way, entitled to uncontrolled laughter and actions incompatible with the status of their credentials.What about the thug who tries to quote (High Noon, 1952), but misses Gary Cooper's name as Grace Kelly's partner? McClane corrects him. He is right, he knows what he is doing, he knows the comparison, his opponent does not, and that puts him at a psychological advantage, even though he is obviously at a logical disadvantage - one barefoot pistol, the maximum of primitivism, against automatic and a much larger number of enemies.In 1988, when the film was produced, women still had little space in the financial market. As a Working Girl, 1988 explored, it was Hard for a tough, macho and imperfect policeman to accept that his wife was in a more favorable professional position than he was. McClane is like that, just human, of mistakes and successes. He appears to be the politically incorrect protagonist, who mercilessly kills his opponents while smoking, but is just an orderly being who tries to do what is right for his family in an extraordinary situation. Despite the fight, both he and his wife keep pictures of each other in their wallet, at the work table .... They split up, but their story together is far from over.John McClane knows that the roof of the skyscraper that houses the powerful Nakatomi Corporation is lined with explosives. Barefoot, bleeding and alone, he goes up to the helipad and, firing his machine gun into the air, forces the hostages down, saving everyone from certain death. FBI agents in a helicopter shoot McClane, taking him for a terrorist. The clock is ticking. He runs away from the bullets, ties a fire hose around his waist and, already in the sight of one of the agents, jumps off the roof, which explodes on his back.... Your words before the ocean of fire projected on your body? \"I swear I'll never be in a tall building again.\" And so it was, reaching its bombastic climax, that Die Hard showed the world the primer on how to build an action movie. This is, without a doubt, has well-defined characters, human frailties wonderfully inserted in the context of the narrative, an unforgettable performance by Willis and action sequences that would establish a new level for the genre for the following decades, the work is, one of the best action movies already made.Between explosions of convincing mechanical special effects and shots that destroy legs and organs without the slightest subtlety (imagine the film being made today), there is a story of love and optimistic overcoming past traumas - in this sense, there is a secondary character of a police officer important to McClane's psychological maintenance. The film is courageous, authentic, has a voice of its own and an action that convinces the casual and Hardcores of cinema: it is one of the best representatives of the genre available on the market. Die Hard had a great critical return, receiving four Oscar nominations and awards around the world. A great diversion that went much more well than expected, showing that ironic heartthrobs could also be good heroes of action, strengthening the identification with the viewer, who cheered at the end of the chair for the inevitable happy ending. Success that continues today.",
    "141": "Loosely based on the novel \"Nothing Lasts Forever\" by Roderick Thorp, and scripted by Jeb Stuart and Steven E. de Souza, \"Die Hard\" is very much one of THE quintessential action movies of the modern era, delivering many thrills and laughs for over two hours.It gave TV star Bruce Willis one of the defining film roles of his career, as a frustrated, foul mouthed, yet very human and talkative average Joe detective forced into becoming the hero, when a slick group of nasty terrorists infiltrate a high rise office building and cause havoc. John McClane (Willis) has to rely on his own wits and resilience to save the day when the odds seem to be outrageously stacked against him. To add to that, most of the authority figures on the outside turn out to be useless, to put it charitably.Willis is engaging in the lead, and convincing in action and fight sequences as well. One of the most appreciable and interesting facets to the movie is indeed the \"cat and mouse\" game he plays with the terrorist leader, a man named Hans Gruber. The always excellent Alan Rickman, at the time a very well respected Shakespearan actor, makes a hell of a film debut as Hans. Hans is an intriguing character because on one hand he's a well dressed, confident, intelligent, and cultured man, yet at the same time, he's a cold blooded creep. The other well developed relationship in the story is between John and L.A.P.D. sergeant Al Powell (future TV star Reginald VelJohnson, in his break through film role), the only person on the outside with more than half a brain in his head and who repeatedly offers John the words of encouragement that he needs.Lovely Bonnie Bedelia may play the only substantial female role in the movie, as Johns' estranged wife, Holly, but she's a tough cookie who does have the courage to stand up to Hans as he and his men throw their weight around. Alexander Godunov, who'd previously appeared in \"Witness\", is great fun as the thuggish, vengeance crazed goon Karl, who proves so indestructible near the end he comes off as a horror movie type of villain. Paul Gleason portrays inept, thoughtless deputy police chief Dwayne Robinson, a humourless jerk who served as a prototype for similar roles in future action movies. Other unlikable weasels are memorably portrayed by William Atherton (the stubborn, very self serving reporter) and Hart Bochner (the coke snorting corporate sleaze who foolishly thinks he can reason with Hans). Even the FBI agents on this case (Robert Davi, Grand L. Bush) come off as pretty dumb and don't express too much concern for the hostages. A number of other familiar faces in small roles, too: James Shigeta as corporation boss Takagi, De'voreaux White as the likable limo driver Argyle, Clarence Gilyard Jr. ('Walker: Texas Ranger') as the electronics expert Theo, Al Leong as candy bar thief / terrorist Uli, comedian Rick Ducommun as the city worker, and Mary Ellen Trainor (recognizable to action fans as the psychiatrist in the \"Lethal Weapon\" series) as the lady newscaster.\"Die Hard\" is rough, tough, violent, hair-raising stuff. Although somewhat overextended at two hours and 13 minutes, it never gets dull. Director John McTiernan, who'd already proved his abilities on *his* breakthrough movie, \"Predator\", guides it all in style, and he and his crew are up to the challenge of shooting sequences in some tight spots. Michael Kamens' music is thrilling, and the special effects by Richard Edlunds' Boss Corporation are most impressive. Often very funny (with a generous dose of quotable dialogue), the story has genuinely touching moments as well. The big finish is especially riveting.True filmmaking craftsmanship results in superior visceral entertainment the entire time. Four sequels have followed it so far.In closing, it would be impossible to imagine a fan of this genre not having a copy of this movie in his or her movie collection.10 out of 10.",
    "142": "John McTiernan's second mainstream film manages to amazingly top an outstanding previous effort, Predator. This even better film will resonate will audiences even more than Predator. While Predator was a superbly crafted and fairly straightforward sci-fi action thriller, this film takes the archetypal imperfect everyman loner, saddled with personal issues(in the form as an estranged relationship with is corporate high flying wife) and through a twist of fate has him battling, against the odds an international team of highly motivated and competent) bank robbers while trying to protect his wife, who is amongst the hostages these robbers have taken. It differed from both Predator and other action-thriller films of the period in that the hero was more human in physique, rather than the physical super-men such as Stallone, Norris and Schwarzenegger. He survives through determination and his wits rather than on brute strength, and Bruce Willis was a refreshingly original casting choice.The plot is cleverly structured and sets up all the characters seamlessly. There are good performances from most of the key players. The robbers are all interesting, but clearly most time is spent with Clarence Gilyard Jr. and the late Alexander Gudunov, who are both charismatic, albeit it is their boss, the relatively unknown at the time British actor Alan Rickman, who steals the show and is terrific in this film, and makes for a worthy rival and antagonist for Bruce Willis's John McClane. Bonnie Bedelia and Reginald Veljohnson are also good value, as is James Shigeta as Mr Takagi. However a couple of the characters do stray into caricatures, notably De'Voreaux White and Hart Bochner as Argyle and Ellis respectively. Fortunately the other performances and the film itself as so fast paced and involving you can overlook these slightly over the top performances, and they do not detract from the enjoyment of the picture.The good performances are woven into an expertly crafted film. Technical credits are outstanding. Jan De Bont's photography is stylish, and makes fantastic use of the Fox Plaza Tower to double for the Nakatomi building. He also makes clever use, but not over use of lens flares to create an excellent mood and atmosphere. Frank J Urioste's stunning editing, Michael Kamen's great music and Richard Edlund's brilliant but incredibly subtle visual effects all work together with truly fantastic action sequences and stuntwork, and director John McTiernan deserves huge credit. He draws out entertaining performances from most of the cast, but mixes this brilliantly clever setting up of the characters, and then orchestrating some truly outstanding action sequences with a pervading atmosphere of growing tension and suspense. It has stood the test of time brilliantly, it still by some way the best of the series, and overall comes off as a truly outstanding and emotionally satisfying thriller.Overall a terrific achievement that has not been bettered.",
    "143": "All I can say is WOW....OK, I lied, I can say more.Die Hard is one of those movies that is all good action and a good plot: something very rarely seen in the action genre, but it does exist apparently.NYPD Officer John McClane (Bruce Willis) is in L.A. visiting his wife, Holly (Bonnie Bedelia) at her office for a party. However, a band of European terrorists led by Hans Gruber (Alan Rickman) soon storm the place and take everyone hostage, except for McClane. Its up to McClane to stop the terrorists and save the hostages.Acting-wise, everyone should have gotten an award for their part. Not a single weak performance here, also no unlikable characters, you pretty much appreciate everyone.Willis' character was the best by far. He was funny, skilled and there was no way you couldn't like him or at least get a laugh or two out of his comments or sneaky tactics.There is plenty of action along with enough background to adequately cover everyone's motives. There are many great scenes too. You will not feel like you wasted your time watching Die Hard.10/10",
    "144": "New York City cop John McClane has flown to Los Angeles to reconcile with his estranged wife, Holly. He arrives on Christmas Eve and heads to Holly's office, where her company's Christmas party is in full swing. Holly does not work for some ordinary company. She works for the Nakatomi Corporation, whose headquarters are located high up in the Nakatomi Plaza skyscraper which is still under construction. In this office there is a vault. In this vault there are bearer bonds worth $640 million. Enter Hans Gruber. He and his heavily-armed goons storm the building, take everybody hostage and set in motion their plan to open that vault and get that money. Only one thing stands in their way: John McClane.McClane is conveniently the only person in the building who manages to escape being taken hostage. He then conveniently manages to stay alive as a whole swarm of well-trained, heavily-armed terrorists continually fires at him with machine guns and attempts to blow him to smithereens with powerful explosives. He makes quite the nuisance of himself, Hans is not pleased. Anyhow, there's a lot of shooting and a lot of things blowing up...and then there's a lot more shooting and a lot more things blowing up...and then...well, you get the picture. It's basically two hours of this on an endless loop. It's an action movie that indeed has lots of action but that action gets repetitive rather quickly. This movie is often described as innovative and revolutionary. That's overselling it by quite some distance. It's an average shoot-'em-up action movie. No more, no less.The best thing the movie has going for it is the talents of its two leads. Bruce Willis plays the hero, Alan Rickman plays the villain and if anything in this movie rises above the level of cliché it is their performances. Willis infuses McClane with some personality, delivering wisecracks which bring a smile to your face. Rickman makes Hans into a rather unique villain, a detestable guy to be sure but one with some serious intelligence and cunning. Unfortunately these two main characters spend very little time actually squaring off with one another, McLane spending the bulk of the movie dealing with a bunch of anonymous bad guys you really don't care about. Supporting characters offer very little support. Aside from McClane and Hans there's not much there. Reginald VelJohnson has a few good moments playing an LAPD officer who comes onto the scene. Unfortunately he is soon overshadowed by a deputy police chief character whose stupidity is just mind-boggling. Any momentum the movie threatens to gather comes to a screeching halt anytime this guy opens his mouth. Then some FBI guys show up and remarkably they're even worse. There's a lot of stupidity outside Nakatomi Plaza. And there aren't enough interesting things happening inside the building. Die Hard is a movie which is considered to be a standout in the action movie genre, a classic. The truth is it's a rather ordinary movie.",
    "145": "Die HardOne of the most full-out action movies of all time. It had the best formula, the best dialogue, the best stunts, the best characters, and the best explosions. \"Die Hard.\"Bruce Willis plays John McClane, a recently divorced cop who travels to LA for the opening of his wife's new workplace, Nakatomi Plaza, owned by a rich Japanese man. His wife (Bonnie Bedalia) is happy to see McClane come, and we feel that they want to get back together. Perhaps this opening party will do it. But then it happens. As John takes a trip to the bathroom, a gang of terrorists (headed by Alan Rickman) take charge of the company building, demanding money. John hides out in the building and tries to think of a way to get the bad guys. They have no idea that John McClane is loose in the building, and only realize that someone is out there watching them when an elevator shaft is blown to pieces by Willis. Pretty soon, the LAPD, FBI, CIA, and just about anything with three or more letters is outside, and only one man has contact with John McClane from the outside - Reginald VelJohnson, a cop with a walkie-talkie.This is, without a doubt, Bruce Willis' best film. By far. His personality fits the persona of John McClane. It's fun watching him, for once.The formula for this movie is what makes it so great, however. Think about it. A man, trapped in a building with some bad guys; a one man army. The perfect action flick formula. But what makes it even better is the non-stop action and excellent, adrenaline-packed explosions and gunplay. People can criticize this movie for being unrealistic, but everyone needs an escape from reality once and a while. One of my favorite parts is where John grabs a fire hose from the top of the building, ties it around himself, and jumps off the edge of the building, smashing into the outside of the glass. Yes, it is very unrealistic, but I'll be darned if it isn't fun.Reginald VelJohnson, of TV's \"Family Matters,\" is perfect as The Cop on the Outside, having contact with The Man in the Inside. VelJohnson has mainly gotten supporting roles in films over the years. These credits include \"Turner and Hootch,\" \"Die Hard,\" and \"Die Hard 2: Die Harder,\" which was more of a cameo than anything else. Regardless, he is a good actor, and it's too bad his career has been so bad lately that he has had to resort to his old days by re-doing his character from \"Die Hard\" by voicing him in a PC game. It's sad enough when actors resort to videogames, but it's even sadder when video games only want you because of an old character you have played and not because of you, yourself. Of action is your specialty, see \"Die Hard\" as soon as you can. And if you don't like action...well...there's always \"Gods and Generals\" for you!",
    "146": "33 years later, it remains highly regarded as one of the best action movies ever made by many action fans. I'm only 29 but I think it is one of the best action movies ever made also. Whenever I think about what the standards are that an action movie should live up to in terms of craftsmanship, this is a movie that comes straight to mind. I also think of it when considering what a great action protagonist should be like. He or she is not invincible but can hold their own. They also should be likeable and relatable on some level. Enter John McClane, played flawlessly by Bruce Willis. My favorite performance of his is in this movie. I love Bonnie Bedelia, as his wife Holly McClane. I love Reginald VelJohnson as Al Powell, who would coincidentally go on to play another cop in a long-running sitcom where he was the neighbor of a kid who always \"did that\" (one of my favorite shows). I don't think anybody misses a beat in this movie. That leads me to the late, great Alan Rickman. He inhabited the role of terrorist Hans Gruber. An unforgettable performance by Rickman. He is every bit as strong of a villain as John McClane is as a hero. The odds are certainly against John as he has to square up against 12 terrorists as a lone man on the inside, while they are taking people hostage. The action, acting, editing, sound and the musical score are all wonderful. I'm not a filmmaker but if I were John McTiernan I would most certainly be proud to say that I made this movie right here. McTiernan also directed the 3rd film \"Die Hard with a Vengeance\" which was also fantastic. And while I also enjoy \"Die Hard 2\" and \"Live Free or Die Hard\" (which I find underrated BTW, particularly the unrated cut), McClane works best when McTiernan is in charge. Notice I didn't include \"A Good Day to Die Hard\". If you noticed before I said anything, then you know why.",
    "147": "John McTiernan and John McClain, it is like a match made in heaven. McTiernan, the director of action movie hits like \"Predator\" and \"Hunt for Red October\" knocks it out of the park with this staple in the action movie genre. It is hard to quantify the impact this film had on action movies going forward. In 1988, \"Rambo III\" was the more typical formula for an action movie. Bigger explosions, more bullets and invincible heroes. After the more grounded and isolated approach of \"Die Hard\" suddenly the focus of action movies changes. Our heroes are less like Schwarzenegger and more like Nic Cage. We trade out a John Rambo, for a John McClain.What makes this movie work is how vulnerable and human our protagonist is. He is a great example of the reluctant hero, just in the wrong place at the wrong time. By the end of the movie, you feel like he has gone through the ringer. When 12 \"terrorists\" take control of a plaza, any other action hero of the time would have run out gun's blazing. But here we have a hero who is smart enough, and human enough to run.We also have a great back and forth between the hero and villain. Part of what makes Bond Villains as memorable as they are, is the fact that they are given the opportunity to face off with our hero various times through the picture. And in this case, thanks to the radio, Gruber and McClain get a lot of time to work off each other. Likewise, all the henchmen of Gruber are memorable characters in their own right.I have watched this movie enough times, and I have enough films that try to be like Die Hard, that I pick up the little details that make this one work, and others fail. First off, thanks to Mctiernan's excellent camera work and directing, the audience is given a good sense of location and distance throughout the film. Second would be the characters. The news reporter and police subplots could easily have just felt like homework to sit through. But thanks to terrific acting and writing, they are just entertaining set up, to a great pay off.This film makes it on the list of Top 10 Action films of all time. Give it a watch any time of year and have yourself a merry little Christmas time.",
    "148": "Christmas Tree - Yes\nChristmas Music - YesDie Hard is definitely a Christmas movie. It is also a fantastic action movie. With a top-tier villain, an over-the-top protagonist and endlessly quotable lines, Die Hard is a film classic.That beings said, this movie is not perfect. Some of the characters are too dumb to handle (the emergency phone rep and the negotiator) and Carl Winslow's acting is a bit stiff (though his character is beloved).Die Hard is action at its purest and is a film that I will revisit every holiday season.Best Character: Hans Gruber\nBest Scene: The body in the elevator\nBest Quote: \"Welcome to the party, pal!\" - John McClane.",
    "149": "The eighties was the decade of the big blockbuster action flick - Lethal Weapon, Beverly Hills Cop, Cobra, Commando etc. But one film outdoes them all and this is it Die Hard, the action sequences are superb and set the standard for everyone to follow. The premise is a good one and while not exactly realistic it provides a firm base for some rocking action.Our main hero John McLaine (Bruce Willis) is well drawn and manages to avoid falling into the cliché trap of some action hero's, a sub-plot with his estranged wife is given just the right amount of time to provide depth without spoiling the pacing of the movie or feeling tacked on. The other main relationships in this movie is equally well played with the one good cop on the outside John forms a bond through humour and necessity and the interplay between them provides a nice counterpoint to give the audience a chance to draw it's breath.Also credit has to be given to Alan Rickman as Han Gruber for creating one of the best bad guys of any action flick, Rickman seems to have a nice line in bad guy persona's as he was easily the best thing in Robin Hood Prince of Thieves playing the sublimely evil Sheriff of Nottingham. But lets face it action is what we want here and boy those it provide it, bad guys are picked off left right and centre, a rooftop shoot out and one incredible explosion.If you love action movies and you haven't seen Die Hard get out there right now and get yourself a copy it'll be the best move you'll ever make.9/10"
}