{
    "0": "The good: 2 brilliant actors, Leonardo Di Caprio and Robert DeNiro acting quite well. Not extraordinary well, but they really deliver solid performances. It's always a joy to watch them perform.The bad: this movie LASTS WAY TOO LONG. Come on, 3 hours and 20 minutes! BEWARE: this aint no gripping masterpiece, this aint no fastpaced spectacle, this aint no visceral drama. It's merely a SLOWburning portrait, which was already wearing my patience thin after half an hour...The first 90 minutes into the story we get to see nothing else but money hungry men, marying Indian women for their land (rich on oil) and then (once married) slowly poison those Indian wives with an altered \"medicine\" which makes them terminally ill. And when they die, they own their oil rich land. Copy repeat. On and on the same plot. May sound vicious and intrigueing, but it was the opposite.How did director Martin Scorsese manage to ruin such a devestating story? By simply NOT restraining himself in time. And by not injecting any TRUE drama or thrill. It just toddles along. Only after 2 hours, the pace takes up and there is some spark and punch to be experienced.There are more faults with Martin Scorsese's direction. His choice of editing, photography, soundscore, are all below his usual level of quality of directing. Not terrible, but quite average. Martin Scorsese's movies used to be wild and dangerous and fast. None of that is to be seen in Killers of the Flower Moon.Disappointed. Not a terrible flick, merely a tedious one and that's a huge pity when you have such talent and money available with the potential to make something truly great...Thank you for reading my 2100 th review on Imdb !",
    "1": "Leonardo Di Caprio returns from World War One to Oklahoma, where oil has made the Osage Indians rich. After long, meandering talks with his uncle, Robert De Niro, Di Caprio runs a taxi, and picks up Lily Gladstone, a pure-blood Osage, and begins to drive her regularly. They fall in love, and eventually have three children, while someone is busy killing off Osage Indians.This being a Scorsese movie with a stellar cast, it is impeccably written, directed, and shot. I don't know what Thelma Schoonmaker, Scorsese's long-time editor, was doing. At more than three hours before he wraps it up with a ten-minute epilogue, presented as an episode of Gangbusters talking about where everyone wound up spending the rest of their lives. It goes on too long for a movie, at least for a movie without a break. This is the upside and downside of companies like Amazon and Netflix having the wherewithal to tempt great film makers with large gobs of money. Because the viewer at home will watch a movie like this at his leisure, taking time to go to the bath room, having a meal, and so forth, it's made for him. There is no need to edit this down. What could have been cut to a reasonable length without DiCaprio's army career and finding out that he lived in a trailer in his final years is left in, with only the audience's bladders telling them it's time to leave this story. What would have made a fine mini-series on television must be watched in one go in the movie theater, trapped between the gorgeous images, and the fact that every minute of screen time cuts two points off the IQ of DiCaprio's character.It's a movie that really should be seen in the theater for the size and audience, and yet makes it impossible.",
    "2": "Greetings again from the darkness. Read the book and see the movie. The order doesn't much matter, as David Grann's best-selling non-fiction novel is an incredibly emotional read, while Martin Scorsese's film is an example of elevated filmmaking. Of course, it's understandable if a book detailing a repulsive historic travesty is not your cup of tea, or if a three-and-a-half-hour movie on the same subject holds no appeal for you. However, if you are up for the challenge, both are extraordinary works of art, though surprisingly, quite different experiences.Oscar winner Scorsese worked on the script adapting Grann's novel with Oscar winning screenwriter Eric Roth (FORREST GUMP, 1994), and Scorsese has stated Leonardo DiCaprio encouraged some changes in perspective. Scorsese also spent a great deal of time with Osage folks making sure to gain insight on how to properly tell their story with all due sensitivity and respect. And what a story it is. While reading Grann's book, I remained in a state of disbelief that this tragic story from the 1920's was not common knowledge. In contrast, I felt the telling of this story in the movie, softened the edges just a bit.Oscar winner DiCaprio stars as Ernest Burkhart, a man returning to town after serving in WWI. Ernest is a simple man, and DiCaprio plays him with a SLING BLADE jaw line and a constant state of being a half-step behind goings on. He's not a total sap, but close enough that he can be manipulated. This is especially true when it comes to his rancher Uncle William King Hale played by two-time Oscar winner Robert DeNiro. The two men are related but seemingly share no other characteristics. \"King\" is a master schemer who has spent decades cultivating a relationship and image with the Osage, only to secretly take advantage of their trust at every opportunity. Ernest is a self-described lazy man who 'loves money', though he has little interest in earning it the hard way.There are multiple relationships that are crucial to follow closely. Ernest and his Uncle, Ernest and his Osage wife Mollie (a brilliant Lily Gladstone), Hale and the Osage, Federal investigator Tom White (Jesse Plemons) and everyone to whom he speaks, and then the network of interactions between Ernest and the locals. The long roster of characters jumps in numbers again during the final act, which offers a courtroom drama and interrogations that deliver the conclusion. It's the first act where Scorsese portrays the dramatic shift from the \"old\" Osage culture to their staggering newfound wealth. Of course, at the core of all of this is the despicable scheme used by Hale in a heartless strategy to steal the wealth. For those who haven't yet read the book, it's best if no more of the story is known prior to seeing the movie. One thing that can be disclosed is that this true story proves the exception to \"them with the gold make the rules.\" This was also the first case of the newly formed FBI under J Edgar Hoover.As always, Scorsese has assembled a deep supporting cast to complement the stellar leads. A few of those playing key roles include Tantoo Cardinal, Gene Jones (the coin flip clerk in NO COUNTRY FOR OLD MEN), John Lithgow, Oscar winner Brendan Fraser, Cara Jade Myers, Jason Isbell, Jillian Dion, Scott Shepherd, William Belleau, Sturgill Simpson, Ty Mitchell, Tommy Schultz, (personal favorite) Barry Corbin, Pete Yorn, and Jack White. With apologies to Jesse Plemons who is solid as Tom White, it's the three leads who captivate us. DiCaprio turns in what is likely his best ever performance, while DeNiro eerily captures the sneaky and devastating evil of Hale (and we get a nod to his Al Capone role from 36 years ago). What can we say about Lily Gladstone? She was a standout in CERTAIN WOMEN (2016), and here she is the heart and soul of the story (though DiCaprio's Ernest gets much more screen time). Her expressive eyes convey so much, even when she speaks no words.In addition to the talented cast, Scorsese's technical group is just as outstanding. Cinematographer Rodrigo Prieto (BROKEBACK MOUNTAIN, 2005) perfectly balances the vastness of the setting with the intimate moments. Production Designer Jack Fisk (THERE WILL BE BLOOD, 2007) delivers the look and feel of the times, while three-time Oscar winner Thelma Schoonmaker works her magic as an Editor to create a manageable flow of this epic. The film's score, expertly tied to the story's measured pacing, comes from Robbie Robertson (longtime leader of The Band), who passed away soon after. There is a Scorsese cameo, and I left the theater thinking how usual it is to find a movie so ambitious in scale, yet so intimate and searing in its personal moments. Some may find the larger story a bit difficult to grasp, and that's likely due to our humanity and desire to believe in the non-existence of this level of evil.Opens in theaters nationally on October 20, 2023.",
    "3": "Martin Scorsese follows up his sloppy The Irishman with another excursion in indulgence and overnarration. For three and a half hours, he tells the story of the Osage Indian murders in Osage County, Oklahoma at the beginning of the 20th century, but this is not a cinematic work; it's a visual retelling of literature. The narrative is so unfocused, longwinded, and loquacious that watching the movie is like listening to a busker going at it repetitiously for hours on end. And the story, although fascinating enough in a historical context, has an unappealing revisionist whiff about it and is often reduced to a simple us-and-them dichotomy. Scorsese keeps pounding his narrative drum like that aforementioned busker, but The Killers of the Flower Moon never becomes the grandiose, epic drama it purports to be, and it desperately lacks subtlety. The performances could have been good in a tighter and more focused movie, with De Niro being onto something unique as the ageing, self-righteous patriarch William Hale.",
    "4": "Straight up it is a good movie but somehow just feels lacking it multiple places which drags it down. First, the acting by DiCaprio was great and I'm not his biggest fan but after 'Don't Look Up' he once again just pours this emotional effort into scenes he doesn't need to and makes them all elevated which I think helps this movie a lot. Gladstone, De Niro were decent and Plemons wasn't asked to do a whole lot but was fine.Secondly, after seeing Oppenheimer which was a dialogue heavy movie and being gripped from start to finish with the tension building being 10/10 to seeing this and not for one second feeling any tension. As the FBI came knocking I felt I should've been getting itchy for DiCaprio and De Niro but for some reason it just wasn't landing with me. The script was nothing special and I haven't said this for awhile about a movie but it was truly boring. Scenes I could feel like 000o this feels like it's going to escalate here but it doesn't, just keeps this one pace tone the whole way through. The murders just felt so... bleh like it wasn't a big deal and provoked zero emotion from me each time.Lastly, I don't need non-stop action, in fact I don't need any action in a movie to be gripped from go to whoa but the acting and script need to be top tier to do that and this just missed with that. The story would be more interesting if it really did show the bigger picture more and made it feel more impactful, where this just felt like kinda one family with people dying that barely had screen time, that you didn't get to know and therefore care about.Killers Of The Flower Moon is the not masterpiece you expect it to be and is a bit of a slog at times to keep your interest peaked. I'd wait for it to come to Apple TV.",
    "5": "Well that was a real snorer.Scorsese took a taut thriller of a book, detailing a horrific crime against the Osage tribe of Oklahoma, and turned it into a boring history lesson 2 hours too long. I almost fell asleep twice.Moreover, he significantly changed the facts of how the bad guys were sniffed out. In reality, J. Edgar Hoover's Texas Ranger, Tom White, went undercover, at significant risk to his life, to root out the evil mastermind and his henchmen.Why screw with a masterpiece of writing? This could have been a nail-biting thriller exposing a terrible episode in American history. The decision to dumb down the actual suspense of the situation was a poor one. Sadly, this film will bypass generations of moviegoers who should have been given a film to watch and rewatch.Go read the book instead.",
    "6": "I am really bummed about how this one turned out. I love the very politically, morally, and racially charged story. I love Eric Roth, I think he's a living legend screenwriter. I loved DiCaprio and Gladstone, they were both brilliant and had beautiful chemistry together. DiCaprio's character is really interesting, he kind of reminds me of the murderer from Act of Killing. Just so dumb he doesn't realize what a monster he is.But this freaking movie is too long and a big mess. The first two hours are very repetitive, and I had a hard time keeping track of all the characters, and who was who, and who was supposed to be murdering who, and for what reason exactly. When Jesse Plemons shows up it does pick up finally, but by then I was so overwhelmed and fatigued that I didn't enjoy it as much as I'd have liked.Also, oddly enough I noticed the sound was TERRIBLE in some scenes. Really crappy dialogue recording. Very surprising.Anyway, I might read the book now, cause the story seems really compelling but I don't think they really did it enough justice here.",
    "7": "Not the masterpiece I was expecting mainly because the leisurely pace overshadows all the good qualities. \"Killers of the Flower Moon\" is a tragic nonfiction murder tale that I was really looking forward to. My expectations were high, especially after Martin Scorsese's passionate rants about what qualifies as cinema. From a technical standpoint, almost every aspect of the movie was excellent. The visuals were stunning, the story had good intentions and emotional depth, the dialogue was well-crafted, and the acting was top-notch. Lily Gladstone truly shone in a cast that included Leonardo DiCaprio and Robert De Niro, so it should have been a great film, right? However, there was absolutely no reason for it to be 3 hours and 30 minutes long. It felt like a real chore to sit through.The movie had a slow pace, which would have been fine if it were around 2 hours long, but for a nearly 4-hour runtime, it simply wasn't engaging enough. I know that film enthusiasts and Scorsese fans who believe superheroes ruined cinema will likely praise this film, but as a regular moviegoer, it didn't resonate with me as much. Some people even walked out during the screening, but I stayed, hoping the movie would pick up later on. It got to the point where cinema staff had to wake up some people after it ended. The movie could have easily conveyed the same emotional depth and told the entire story in just 2 hours.DiCaprio plays a villain, and although the extent of his villainy is slowly revealed in parts, De Niro is the mastermind behind the plot. There is some humor, the kind that might be frowned upon today but was likely just everyday conversation in the 1920s. The film had selective subtitles, and while more subtitles would have been helpful, maybe they didn't add much context to those scenes.The movie lacked liveliness, high points, and because of that, it failed to engage the audience. While Leonardo DiCaprio and Lily Gladstone were standout performers, I mostly remember DiCaprio for how much he frowned, second only to Karl Urban in \"Dredd.\" I wasn't expecting to see a spanking scene either. The rest of the cast's performances were decent but not particularly memorable.The film felt flat, with no real climaxes or peaks. It likely rides on the reputation of the big names associated with it. It's a profoundly emotional and tragic story, but the movie's extended runtime and lack of engagement overshadow the sadness and brutality of the narrative.",
    "8": "After seeing the trailers , I couldn't help but look forward to this. On paper it has everything. Aside from the performances which will clean up at the Oscars along with best picture, director, score, costume etc etc , I came out feeling flat, bored and relieved it had finished. The running time is ridiculously long and could easily have been 90 minutes shorter. It just plods along, with no surprises or tension. It tells an important story in American history but I've watched documentaries that hold my attention more. Martin Scorsese has recent history in long features and where something like Oppenheimer's similar running time flew by, this was tough to get through....... Can you imagine the directors cut.......",
    "9": "\"Killers of the Flower Moon\" is getting rave reviews from critics and audiences alike. People are hailing this movie as one of Martin Scorsese's best films, with standout performances from both Leonardo DiCaprio and Robert De Niro. \"Masterpiece\" and \"a sprawling crime epic\" are just a few of the praises \"Killers of the Flower Moon\" is receiving, and as a fan of Scorsese's work myself, I was beyond excited as I headed down to the theatre opening night to go watch this movie. And to be quite honest, I wasn't as big a fan of this film as I thought I was going to be.\"Killers of the Flower Moon,\" admittedly, follows a group of criminals as they engage in said criminal behavior, a common trait of many Scorsese films. Where this movie differs, however, is in the way it handles the material. In stark contrast to other films of a similar genre, \"Flower Moon\" makes little to no effort to have its audience sympathize with its villainous protagonists. On one hand, this is appreciated, as the protagonists are truly some of the worst, most evil people ever to grace the silver screen. On the other hand, this lack of characterization makes for one-note characters that start and end the movie in the exact same emotional headspace. And maybe that's how everything happened in real life, but for a film, I would've appreciated a little bit of nuance or dramatic heft.As characters engage in their killing spree, you'd be hard-pressed to find any of them undergoing any type of moral quandary or emotional turbulence, or really any type of second guessing as to the morality of their actions. And again, perhaps in real life every single murderer just happened to be a cold-blooded psychopath with zero sense of remorse, but for the sake of the film, it would've been nice to see at least one person question their actions. But because you don't get that, everything feels surprisingly dry even as the scale of the killings increase; the perpetrators are consistently aloof to the destruction they're leaving in their wake, to the point where, eventually, the movie started to get kind of boring.While Scorsese always brings a sheen of professionalism to his films, I also found \"Flower Moon\" to lack the cinematic feel of his previous movies. Something about this movie just felt cheap, despite the $200 million budget. The editing was also jarring at times, lacking coherency, just making the entire movie feel more like a direct-to-video release than a theatrical one. And when it comes to the ending of this movie, whoah man. I won't spoil anything, but let's just say that Scorsese pulls a move directly out of Wes Anderson's playbook with an epilogue that is, simply put, ridiculous, almost as if they didn't really know how they should end the film.Overall, I was disappointed by this movie, and didn't find much to like. I will say that the length - practically a 3 hour and 30 minute runtime - wasn't a problem for me. The problem, for me, was in the lack of characterization and one-note performances throughout. Will you enjoy this movie? There is a strong possibility you will, considering I seem to be in the minority; however, my recommendation would be to temper your expectations, and be prepared to take a bathroom break or two.",
    "10": "This is a very good movie, but it could have been told in an hour less. The material is grim, but I guess that's part of the story telling.I can't understand why this couldn't have been done in 2 hours. The plot didn't warrant it, and the acting almost held it up. But we could all see where this was going.The court sequence was way too long and muddled the nature of the story. Is it an historical account of what happened to these poor people? Is it a story about duplicity in a relationship? Is it about greed and human nature? Is it about psychopaths? Or a court room drama?For me, it would have been an 8/10 if it didn't drag on unnecessarily. Great acting. Great story. Just drawn out.",
    "11": "I didn't mind the length. Most of the time with movies I wished they didn't cut so much so that was cool with me. But I didn't like that they told the story from Ernest's POV. Should've been mainly told from Mollie's or the Osage tribe. They would've been great to watch act out the true story & honor the tragedy. Instead it's really kind of honoring the Burkhart men by giving their story so much focus & screentime & it's almost as if giving them a voice when they don't deserve it from all the awful things those men did. They shouldn't have had a voice the Osage should have it or Mollie. I realize that without the star appeal people sadly wouldn't have come out to see it but they could've been in it just the same. The ending wasn't great, just blah.",
    "12": "Don't get fooled by the director or the cast. Don't get fooled by the score either. It's 8.1 at the time of writing this but I assure you it will get down to no more than 7.5. This is a bad movie, plain and simple.The whole story is told in such a lackluster way that there is no drama to it. It's like reading a long (a very long) newspaper article from start to finish where everything is narrated in a factual and boring way. There is no stakes, no big question, no expectation and no rush. The characters are shrouded in no clouds of mystery and no one changes from start to finish.Went to watch it to in the cinema. Truly disappointing. I wasted my time, don't waste yours.",
    "13": "I never heard of Osage Nation before this. It was a 3 hour 26 minute education not just of the oil wealth and of American Indian culture but of sensitive filmmaking crafted so beautifully Michelangelo would have cried. Lily Gladstone has a classic, timeless, renaissance Madonna face and Robbie Robertson's tender score embellished her sensitive performance perfectly. True to Mr Scorsese's form, it ran so long and needed a deus ex machine ending that while innovative, brought (for me) the film to a premature end. Dessert was served too soon. Otherwise, I could not say a bad thing about this show. Mr Scorsese, I wish you a very long life so you can continue your master craft for mere mortals like me for a long time to come.",
    "14": "I was bored to the fullest ngl. Watched 2 hours, slept an hour, looked up and down for the rest 30 mins. Felt like a prisoner in cinema 😂 only reason I didn't leave is DiCaprio since he is my fave actor of all times. But yeah..Btw,People are gonna be scared to criticize this film because of the cast and all the hype but if I can get to be honest, everyone should imo. It's not a good movie let's be honest.There is no story that makes you intrigued, no story that is fun to follow, povs are boring, characters have plain depth, you don't root for anything and nothing. And its 210 minutes.. imagine.. two hundred and ten minutes... iki yüz on dakika.... doscientos diez minutos.",
    "15": "First of all, I would like to address the reviews that state this film is about pushing \"liberal white guilt\". It is not, it is a true story with villains who were tried and convicted in the American court system after an investigation led by the conservative head of the FBI, J Edgar Hoover. I highly recommend that everyone reads the nonfiction book of the same title by David Grann prior to watching this film.I was fortunate to see an advanced screening of this film yesterday at the Zurich Film Festival. Martin Scorsese certainly satisfied the monumental challenge of bringing this story to the cinema. The actors fully possess their tragic and complicated characters, especially Leonardo DiCaprio and Lily Gladstone (who I hope to see more of). The score, cinematography and featured songs only contributed further.Despite its length, the rather abrupt but appropriate conclusion left me feeling melancholic to depart this cinematic masterpiece and it has remained in my thoughts for hours since. Please go and watch this film and recommend it to others once you do.",
    "16": "This film doesn't need the three hours to tell the story. Too long and extremely incoherent in the beginning. DiCaprio is mediocre at best. Director seem to be afraid to actually work with DiCaprio. He ruins the movie and not even de Niro can save it. This film doesn't need the three hours to tell the story. Too long and extremely incoherent in the beginning. DiCaprio is mediocre at best. Director seem to be afraid to actually work with DiCaprio. He ruins the movie and not even de Niro can save it. This film doesn't need the three hours to tell the story. Too long and extremely incoherent in the beginning. DiCaprio is mediocre at best. Director seem to be afraid to actually work with DiCaprio. He ruins the movie and not even de Niro can save it.",
    "17": "The film is ultimately hampered by its miscasting and excessive length.Leonardo DiCaprio and Robert De Niro are both undeniably talented actors, but they are simply too old to play their respective roles. DiCaprio is 47 years old, but he is supposed to be playing a man in his early 30s. De Niro is 79 years old, and he is supposed to be playing a man in his early 60s. The age difference is distracting and makes it difficult to believe in their characters.The film's runtime of 206 minutes is also excessive. The story could have easily been told in 2.5 hours or less. The film's slow pace and meandering plot make it feel much longer than it actually is.",
    "18": "Killer of the Flower MoonThe film tells of the Osage Indians, who after finding oil in their land, are riddled with mysterious deaths within their close knit community. Focusing on the lives of Mollie Burkhart and her family, the film pieces together a slow but harrowing awakening of a small family built under false pretense.Okay, shocked how well paced the film is.Interestingly, it took an different approach to the maximalist and \"Hollywood\" styling of Oppenheimer - a film I personally hated. It's just very direct and slowly build its story up.It opened talking about how and why they are killing, how the White men of Osage is hateful and would use everything to get above the \"unworthy\" Indians - not so much glamorization just pure unadulterated hate.It slowly quivers into much more sinister murders while it posits that the Osage's does know that they are targeted. In addition, the film posits that the Osage's are also a victim of new found wealth. A bunch of them where not in particularly great shape NOR does any take action (sans Mollie) with growing deaths in the area, which is a neat commentary to compliment the deadly ruthless ness of Hale.The way it told the story reminds me so much of Edvard Munch (1974). Its pretty precise and almost documentary-like fashion. The details are direct yet substantial. And given that this is a true crime film, has elements that is both \"Anti-Suspense\" and \"Anti-Western\" that worked tremendously AND compares quite nicely against Marty's flashier fare.And all and all, it just hits perfectly without being too much and also commenting fully on all sides. Everything was particularly fleshed out for your judgment. Its clearly for the Osage BUT is willing to show the problems on their side too.The only real negative I would say about the story is how they handled Molly and her husband plight. They were somewhat trying to make it a story of love crossed against his Uncle's wishes. I wish they took a harder stance in his overall portrayal. That man did not love that woman - just from what the screen shown.In addition, I think Scorsese was not particularly confident in portraying her. She was fully supporting all throughout the film AND that felt like sad for a film ABOUT the Osage Indians.Performance-wise, even with a less screentime - Gladstone ate the scenes she was in. Her simple but effective presence gave depth in a character that is shoved behind the scenes. Sadly, I think the Oscar's would surely bump her down to supporting BUT she deserves that win. Di Caprio and De Niro is subdued AND wonderful in respective role. Plus points for De Niro's pitch perfect accent work. Very consistent to be honest.Also, I particularly love how the sound in this film is mixed. Lot of silence in this one BUT compliments the slow burn element of the film.Highly recommended BUT has some flaws.",
    "19": "Had to be the worst picture I've ever seen. What is all the hype about anyways ? Acting was beyond horrible and really should've been condensed into a 15 minute cartoon. Waiting 2 hours for anything to happen . I only exciting thing in this whole movie was by the mysterious owl. Hard to even watch ..and it just dragged on and on with nothing ever getting done or said. Just a pitiful display of an over budgeted Hollywood SNOOZEFEST. Knew right from the beginning , Dinero was the culprit...Doesn't take a rocket scientist to figure this monster of a mess out. Save yourself the pain and agony...and PASS !",
    "20": "Idk, perhaps all this critics and I saw different movies. Tbh I will say this movie is beautifully shot by Prieto, with good performances but with a poor narrative construct. Mollie (Gladstone) and Ernst (DiCaprio) is recusable as a couple but there is no urgency, no opposition in telling the story this way. It seems passive. The movie linger and lingers over nothing and goes nowhere. There's no tension, no real story. As a story I could tell it in a paragraph. For a 3 hours + that goes nowhere from a huge budget and Scorsese, DeNiro and DiCaprio is a sham. I'm sorry to say cuz I love the 3 of them dearly specially Marty. It just hurt me the amount of brown noser desease here. Is overly dull and boring.People are saying the trial is good, well the trial is something as before there is nothing. I like 3 hour + movies (Babylon) I like 4 hour movies (Eureka) I like 9 hour movies (Filipino family) but this 3 hours felt so unnecessary. In one word. Pointless plot.",
    "21": "Having read the spectacular book several times, I was excited to see this film. They wasted 3 hours showcasing DeNiro who plays himself as a boring soulless nasty old man. If only they'd limited his time on screen to 30 minutes the story might have been told with dignity. DeCaprio grunted through 3 hours, but Plemons should have filled at least an hour as the FBI man honoring that agencies' first case. He was terrific in the part! Molly was the shining star. As could have been the other indigenous actors. I love Scorcese, but his version of a finale had me shouting \"No!\" In the theatre. Just \"NO!\"",
    "22": "It's great that yet another shameful episode of American history was told but let's hold back the praise on what another 'brilliant' Scorsese masterpiece this was. First of all, it is way too long. The story could have been told in 2 hours or less. The second half of the movie drags on needlessly.Second, there is nothing new in the storytelling. If anything, I felt like I was watching Goodfellas all over again. De Niro, as Bill Hale, virtually reprises his Jimmy Conway character in manipulating all the poor stoops working for him and knocking them off one by one. I am still waiting for Joe Pesci to turn up in a scene somewhere - maybe in a scene in the 5-hr Director's Cut.This movie is at best a mildly entertaining but too long movie that recounts a disgraceful event in history. It is far, far short of being great.",
    "23": "Given Martin Scorsese is one of our great filmmakers I was expecting much more from the film. Dicaprio was his usual hard-working self, capturing the loathsome character that would be part of a scheme to murder Native women for their oil rights, and as his wife Liliy Gladstone had a powerful stillness and tragedy about her, but the film itself had a very lifeless, going-through-the-motions quality, as if Scorsese were too afraid of disrespecting the events to bring any of his customary pizazz or excitement to make it anymore than scenes of stitched-together exposition. Very disappointing film.",
    "24": "The pacing of \"Killers of the Flower Moon\" felt slow, certain scenes were confusing, and some characters displayed lies and greed. Unfortunately, the movie lacked the emotional impact I was hoping for, and my attention started to drift. In comparison, Oppenheimer's movie managed to capture it better. Additionally, the non-musical atmosphere in certain scenes felt slow and uninteresting. Leo's character was hard to keep up with, and his lies and ignorance became annoying. I was expecting him to face the consequences he deserved, but the ending, with its Broadway-like twist, left me confused. I had hoped that the movie would respectfully leave the audience wondering about the fate of the Osage people, but I was ultimately disappointed. I wanted to feel an emotional connection, but instead, I was left feeling empty and puzzled. Despite that, I tried my best to appreciate it.",
    "25": "Killers of the Flower Moon is a special film. I saw it in IMAX over the weekend and couldn't help but be swept up in the majesty of this film. It's absolutely gorgeous; not just because of the amazing Oklahoman landscape that stretches forever, but the incredible set and costume design that, over the course of the film's first 40 minutes, brings you into the world of the Osage Nation and the town of Fairfax before the narrative begins in earnest.I honestly loved this part of the movie; it felt so immersive and impressive. When Scorsese intercuts black and white footage and photography, it's really peak cinema. This is honestly one of the most historically immersive films I've ever seen. Yet, it still feels like a Scorsese film; with its quick pacing, use of montages, and copious amounts of (sometimes dark) humour. This isn't really a slog to get through; despite the runtime, I found myself engaged from start to finish. It's a testament to Scorsese's storytelling and the work of the editors to rein this thing in.On the topic of what I really liked, I feel like the performances were all (for the most part - more on that later) excellent. Not just DiCaprio, De Niro, or Lily Gladstone, who are all phenomenal (even if I had problems with some of their characters). More impressively, it's the side characters, the other people who make up this world who impressed me most. A lot of the people felt like they were ripped straight out of the 1920s and so, so true to life.The sound design of this film was probably the biggest reason I'd recommend seeing this in IMAX. It's so good that there were several moments that during the film, I legitimately thought someone was speaking or making sounds next to me. To say it envelops you and brings you deeper into this world would be an understatement.As for the plot of the film itself, Killers of the Flower Moon is positioned as a crime film and with that in mind, it feels like a return to form for Scorsese. However, the film never loses sight of an aspect of these crimes that inherently makes them *feel* different from Goodfellas or Casino or The Departed. Simply put, you can't watch this film or understand it without considering the overarching themes of white supremacy and exploitation. As much as we are told to the Osage are a wealthy, prosperous people, it's impossible to ignore how none of this protects them in a society that fundamentally does not recognize them as equals. You can almost feel the tension from the screen, as the murdered Osage men and women come to terms with this.There are some scenes in this film that really stuck with me; a particular murder that is shown towards the end that is conducted so coldly and ruthlessly that it honestly gave me chills. It's hard not to be moved by this film and it's obvious - especially by the ending - that Scorsese really cared about bringing this story to life and into public consciousness.Yet, I find myself a bit uncomfortable with this film. From a narrative standpoint, it follows Leonardo DiCaprio's Ernest, a WWI vet who comes to Oklahoma to work with Robert De Niro's William Hale, a local businessman and (as we learn) crime boss. I'm going to say this unequivocally: Ernest was not the right person to center this movie around. There's almost no mystery or tension because Ernest knows the scheme his uncle is pulling from the beginning. Ernest participates, motivated by money, yet Scorsese tries to make him feel sympathetic, emphasizing that he genuinely loved Mollie (Gladstone). I don't buy it and it feels like a weird direction to take; to be clear, as dumb as Ernest is, he is complicit in every murder that takes place and to paint him this way was a huge misstep, in my opinion.I genuinely wish this film's narrative was more...Scorsesesque, jumping from character to character to explore the EPIC nature of the story, but also to give us more perspectives. The Osage kind of come off as naïve and easy to fool, Mollie in particular, as we don't get a good sense of the time scale between the murders. Further, as much as people are raving about Gladstone's performance - which is well deserved - her character is criminally under utilized. I would've even preferred more FBI stuff to emphasize the \"murder mystery\" aspect of the film. As it stands, it feels like it's a movie about a white guy who is taking advantage of Native American people, but feels REALLY bad about hurting his wife (but...not her entire family?) I couldn't help but feel Scorsese dropped the ball on this.Also, Brendan Fraser...my man, what happened? His - admittedly short - feature in this film was by far the worst performance of the entire thing. He's overacting, yelling, and feels out of place in what is otherwise an extremely well-acted movie.While flawed, Killers of the Flower Moon is a movie I haven't stopped thinking about since I saw it. It's a truly magnificient example of cinema's power, handled by an incredible auteur. I feel lucky that we get to experience Scorsese and it's obvious he hasn't lost a beat.",
    "26": "The nonfiction novel \"Killers of the Flower Moon\" is a riveting true story of how a series of murders on the Osage land inspired the creation of the FBI. It is a stunning expose of lost innocence, abject evil, and true heroism. The movie... gets bogged down in telling one person's story -- the husband of an Osage woman whose loved ones are mysteriously dying and who barely registers in the book -- and he's such a cipher that you never quite know if he's innocent or not... and that's deeply unsatisfying. You end up watching the movie and waiting and waiting and waiting for someone to STOP this band of criminals (the opposite effect Scorsese's more irreverently amusing tales of mob life - Casino, Goodfellas - have). In the book, the FBI is on the case much quicker and it makes the story feel less redundantly grim. I do think DeNiro is the surprise acting standout here. DiCaprio mugs a lot. And while I appreciate Lily Gladstone's authenticity in the role, her character is such a passive dud and her acting so limited to one glum note... any awards talk seems very misguided.",
    "27": "I know it's Martin S. That made this film, but if it was anyone else they'd have gotten a 3 or lower. The acting was good, but somehow over a 3.5 hour long movie, I was not invested in a single character. There was no depth to them. There was a lot of fluff, not a lot of explaination of how people got to where they are. The previews were horribly misleading, if going expect a slow moving dark film that doesn't have many jokes, fun funny, or even happy moments. How Leonardo and his characters love interest got into a relationship is worse done than Anakin and Padme in the Clone Wars. At least and hour and a half could have been cut from that film.",
    "28": "If we believe that the truly great movie doesn't waste scenes, then Killers of the flower moon is not a great one. Among the great aesthetics, which are as of today given when you know it's Scorsese, one can leave the theatre feeling betrayed. Betrayed of the surprising lack of emotional weight and focus. Yet the movie felt thought out to the point it feared being too epic or demanding. The result is too undemanding and it sadly doesn't justify the fact it passed the 3 hour mark. It is also true that There will be blood is made only once and achieving any similar kind of emotional slap is something many directors seem to fear. I can see Scorsese searched for a new way of telling the story, but unfortunately he searched too much and grabbed too much from too many places.",
    "29": "It's a shame that Martin Scorsese didn't better use the 3 1/2 hours in length. Glossing over the first important chapters of the book discussing oil head rights and conservatorships that the Osage tribe suffered under, undermined the story from the beginning as those two facts are the basis for everything that follows. Scorsese also missed a wonderful opportunity to expand on the intrigue of the investigation by federal agents leading up to the arrests. And while cast, including Leonardo DiCaprio and Lily Gladstone, did a great job, the lack of cohesion and very unnecessary embellishments, which add nothing to the movie, lead to a disappointing and underwhelming movie at best.",
    "30": "As the title says, I believe this is one of the best movies we have seen in many years. To start out, the acting is just incredible with DiCaprio, Gladstone and De Niro all at the top of their game. I was very hyped for this movie and I wasn't not disappointed. Despite the 3hr 20m runtime, this movie goes by in an instant. You could watch it 3 times and it would only feel like you'd watched the original runtime. The score, the acting, the story, the cinematography, the writing, the directing, it's all absolutely masterful and incredible. I would one hundred percent recommend this movie to anyone.",
    "31": "I was anticipating this movie like crazy let me start off by that.Martin Scorsese, DiCaprio & Robert DeNiro? I would be stupid not to be excited .The trailers were amazing, I would literally recommend everyone to just simply watch the trailers because it is not only the best parts of the film shown in the trailer, but the whole plot as well. I love long movies, I really do, but there is nothing worse than a horribly paced movie. Not slow burn no, this was horribly paced. When were first introduced to Osage its so cool & interesting, but that interest dissipates within the first hour. My three stars is for this : The fact that it is a period piece, the costumes and set feel authentic.... and ...... well nothing else honestly. There's no music really at all, Im a strong believer that a good movie is where visual expression , meets a musical expression, meets a human expression. If ya know what I mean. The aspect of this film that made me loose.any interest was this one fact. I couldn't understand the fact why it was told from Ernest and not Molly. Really . It was so boring, from the first ten minutes we know , that DeNiro is the bad guy who's going to sway DiCaprios character we know right away.. I wish we got to spend time with the Osage people & their richness, I never once felt that Ernest (DiCaprio) loved Molly (Gladstone) . Everything about them felt rushed. & the whole \"it's about greed, he really loved her but greed took over he couldn't see how terrible it was that he was poisoning her\" Please.... how could you poison the mother of your children and claim to love her ? I know Scorsese loves to focus on the human aspects of the \" bad guys\" and usually it's a home run for me, but this time it was such a strike out. If it had been told from Mollys POV we could have had inside views to the richness that the Osage people had, their lifestyles, we could have felt comfort in that money, till Ernest comes around. She falls in love and its an earnest love . Her heartbreak when her family members keep dying, who can she trust ? & not in a \"whodunnit\" way, in a real way. Showing one's emotions when you don't know who to believe. I wish we had seen the King from the Osage peoples eyes, they believed him he was the white man they \"trusted\" for a long while and I wish we could have had that trust built to be broken . It was such a long movie there was definitely the space and the budget. The whole time , the minute earnest gets off the train this is how I felt: This guy is going to do anything is uncle tells him, his uncle is bad news he s the rotten egg in the bunch , the girl won't realize till its too late, of course the white people are working against the osage people. It was predictable, & the ending was very weird too I have nothing to comment on it , truly like three hours just to wrap it up like that? I wish for once this was told from a different side. It was like a god awful boring western ( even though it isn't a western) .",
    "32": "Incredible, powerful film. This movie got me thinking about the horrors of life, and just how far some people could go due to greed, or by someone having major influence over you.Set pieces were great, cinematography on point, the music was great and the directing, and of course the acting was phenomenal by Leo and De Niro. The one superstar of this one I would say was Lily Gladstone, who played her role so well with such grace and fervor and I am now a fan. I am fiending for a rewatch already. Oh, and the writing of course was phenomenal. I find no flaws in this one, bravo Scorsese and company.",
    "33": "Martin Scorsese recently complained about people that complained over the run time of his new movie Killers of The Flower Moon. If that complain should have any substance he gotta make it better than this. Because the movie is really too long-drawn out, heavy on the dialogue and it's really a dragged affair ending with his bizzare crime play to sum up the movie by the ending, which is just cheesy at best and adds to the very long run time. If it had been filled with more excitement it had been no problem, but this movie really bores you with it's heavy usage of voice-over reminiscent of what Scorsese did in Casino. You see some decent acting from De Niro and Di Caprio and the movie really starts better than it ends, with the story of the Osage that reels you in, but at the same time the investigations into murders and repeating the same stories over and over again, just does not hold you interested the way you should be in a longer movie like this. A lot of people are sceptical of the run time and it don't really think watching it will kill the sceptisism.I had expected it to be more violent and vivid and although there are some violence it is very short in it's appearance and the movie itself is miles of Scorsese's best work like Cape Fear and The Wolf of Wall Street. The investigation and the sequences with De Niro and Di Caprio being in jail does drag it out a lot, and the story may be told a lot more from Osage perspective, but it is also really annoying that it's not texted properly, a lot of the time you do not actually translate what the Osage are saying.. Maybe some people may call this movie artwork, some may label it an oscar movie. But for me it is a very boring movie that I do not neccessarily regret that I went to, but I have seen a lot of better movies than this. Although Scorsese may be proud of this movie to me it's perhaps the most overrated movie this year because people have been talking it up all year. To me at least there was no real hard good reason for that. Because although the story was interesting the movie tries to tell way too much without having too much substance. What could also have done is to short it down at least an hour, tone down the heavy dialogue because a lot of it just dragges the movie and scale up the violence. For me personally it's a 5/10 a quite large dissapointment. But you may of course like it better.",
    "34": "The return of true cinema. An outstanding piece of art after a long time. The old Master rocks again. Almost four hour, a bit slow, yet you can't take your eyes off of it. Rodrigo Pieto painted the big screen with his camera. Top notch actings, solid script, compelling shots, Masterful direction, a very touching ending and all and all will pave the way for Killers of the Flower Moon on the road to the Oscar. It tells the true story about the first official case of FBI revolving the mysterious serial murders of Indian members of Osage tribe back in early 1920s in Oklahoma and the scandal that follows.9/10 definitely.",
    "35": "Marking the first feature film collaboration between Martin Scorsese, Robert De Niro & Leonardo DiCaprio, Killers of the Flower Moon brings the real-life story of the Osage murders to the screen in extensive detail, covering the web of lies, deceit & corruption that paved the way for the serial killings to take place, and is masterfully anchored by first-rate performances from its impressive ensemble. Enormous in length, exhaustive in research, engrossing in narration and essential in historical context, this absorbing account of America's relationship with its indigenous population is yet another artistic triumph for the revered filmmaker.",
    "36": "I haven't fallen asleep during a film since Benjamin Button, but this was bad. There was no need for this to be even close to 2 hours! Brendan Fraser's limited acting was a joke, and DeNiro did his best DeNiro impression.The film was basically the same repetitive plot over the span of 3 hours and 20 minutes, one family member or tribe member being murdered after the next. Then a trial which we already knew the outcome of. The ending was the strangest cringeworthy finish I've seen in quite some time, with a cute cameo visit by Scorsese himself.This was a shame since I'm a fan of Scorsese's work in the past, but this was unbearable.",
    "37": "I was so looking forward to watching a masterpiece after reading all the rave reviews. After seeing the movie I will never trust reviews again...ever. The story is an incredibly interesting historical occurrence, unfortunately it was not portrayed as so. I was thinking I was going to be crying or feeling heavy hearted after the movie was over, I felt nothing. I was incredibly interested in the Osage community, I learned nothing about them. I absolutely hated the fact that Leo was the main character, it wasn't the correct character placement. I felt nothing for him, didn't love him and didn't hate him. Same goes for Deniro. It was almost 4 hours of the same characters on repeat. No excitement, no climax, no story. I'm so angry and that's why I am writing this review at 1:30 in the morning, I just left after a 9:00 showtime! Not cool! The problem is, movies just aren't good anymore, there's no depth and no story line, it's all about the visuals. Just shallow stories that look pretty and unfortunately that exemplifies society today.",
    "38": "We all can agree Master Scorsese can do what he wants at this point and he definitely does with his new yet again near four hour attempt at an Epic Tale. Unfortunately that doesn't mean it yields groundbreaking results or withstanding impressions like his past films of his prime. This film much like his last The Irishman is chalk full of brilliant actors and dialogue something that's usual for his films. Leo is always delivering an Oscar worthy performance. Where this movie can drag lies within its slow as molasses story. I'm not expecting shootouts and incredible heists from a based on true events tale but for the length of near four hours there's only so much talking and staring that can be withstood. While it most likely depicts what it needs to it could be cut in half and be more effective that way. The scenery is magnificent and the overall visuals are immense and worth the watch alone. The bottom line is that it's clear Scorsese wants to film talking more than anything which is fine for 2 hours but a bit winded at 4.",
    "39": "It is long, dark, one-dimensional and boring, from the beginning you know the ending, the novel had much more emotion. The story it tells does not need that much length, it is a great disappointment and even more so after having read all those unfounded praises from some critics. The lighting and cinematography options are vulgar, there is nothing that stands out. The actors are not directed, Robert De Niro plays Robert De Niro once again, Leonardo DiCaprio is past and out of the film, only Lily Gladstone provides some authenticity and with one look she devours her companions on the screen.Martin Scorsese has made very good films but this is not one of them.",
    "40": "This had all the pieces of a masterpiece - top notch director, 2 big name seasoned actors, an incredible historical story, authentic and respectful casting - but it ultimately fell flat. I had much higher expectations - I thought it was going to be powerful and moving, placing a spotlight on yet another instance of depravity in American History, but there was zero chemistry between the characters, there was tons of lacking information to explain the motives of the natives, the timeline was seriously muddy making it difficult to understand how much time had passed between events.... I was surprised that with this incredible story, the movie was a dud. And what a travesty to have this story told without an ounce of passion.",
    "41": "Martin Scorsese makes long movies; he makes gangster movies and villainous movies and movies about men who sink with their choices; but they are always long. He has made a career of painstaking attention to detail, and of getting the most out of a scene, and those scenes linger. Think of Travis Bickle blowing it on the phone with a date. Think, more famously, of Henry Hill, showing off the trappings of his mafioso nightlife. Scorsese gets close to his films, and he tells a complete story - a three-hour story, often, but one that's dense and absorbing, every time. I knew and expected this going into \"Killers of the Flower Moon.\" Probably not all of his audience will be so willing.A hundred years ago thrived a rich and intelligent community of Osage, owners of Oklahoman land meant to be worthless but floating on oil. In flocks the white man, coyotes, seeking a bit of fortune from these Osage; wooing their women, building them schools, and trading them goods. If any of these white folk were well-meaning, they were those who left them be when the cards were on the table. A kingpin of these folk, William Hale, has ingratiated himself within Native American society like a fattening tick. He means to take everything. In this film Robert De Niro plays an exceptional sociopath, single-minded and unconflicted, who becomes responsible for the murder (that is, the poisoning, stabbing, shooting, burning, exploding, and garroting) of dozens of these Osage.But the soul of this film lies between Mollie (Lily Gladstone) and Ernest (Leo DiCaprio): Mollie the Osage heiress of a black gold fortune, and Ernest the dimwitted, charming nephew of Hale. Their relationship and the events within are devastating on a level I've rarely seen. It would be a disservice to dissect it in a review meant to get you to see the movie, so you'll have to take my word on their performances - stunning, perplexing, distressing, and nuanced. I don't fawn over Leo but I've never seen him better.Something I've been dying to talk about is the balance of dialogue punctuating \"Killers\". Moments that tell you the most about a character are often when they say the least, white man and Osage alike. Scorsese omits subtitles in some scenes so you're scrutinizing Leo and Lily's faces as they speak her language, until suddenly you realize you didn't need them to understand. Leo's relaxed charm in the first act is later juxtaposed in U-turn fashion with contorted, confused, suffering grimaces (which apparently has people questioning if his jaw was wired). Lily conveys unimaginable heartache with simple glances, her eyes like fates, knowing how it's going down but unable to change it. Until her last appearance on screen, she's magnetic. Don't be surprised if three Academy Awards for acting home in on the three leads.In a film of such Godforsaken girth, there is so much of \"less is more\" put on display. It's stated explicitly as a trait of the Osage - they waste no breath when it isn't necessary. And William Hale spends the whole film yapping.This here's a beautifully shot bit of legitimate non-fiction which reeled me in from the start and held my attention to the end. It won't work for everybody (and already hasn't, according to some of my friends). In some other universe is a shorter cut of this film, leaner by perhaps an hour, and more of a thriller than a contemplative tragedy. As a trumpeter of this version's excellence I'm satisfied, but even I thought some scenes languished. No matter. With acting, writing, and cinematography of this echelon, I'd have sat through a fourth hour.8/10 for being alive at the same time Marty Scorsese is making magic.",
    "42": "The film was too long for me, it has also partially lost the focus, the story could have been shortened by 60 to 90 minutes. My eyelids fell to me twice, I had to make an effort to stay awake. Leonardo di Caprio had the whole film about a facial expression that reminded me of Gollum. I found his performance set up, unnatural and much too artificial. The trailer contains all the action sequences of the film, some of which are only incidental to the film. The film had a completely different effect on me than the trailer, lengthy and not focused on the essentials. At the end there is an American puppet theatre, where Martin Scorse himself appears instructively with a message that would not have been necessary.",
    "43": "My favorite reviewer here is the \"Greeting from the darkness\" dude. I appreciate their insight.But this movie was simply boring. DiCaprio's fake scowl disappears in one scene that seems laughable- when he is trying to hire a man for a job; makeup crew skipped a day, perhaps? I cant stand mistakes like this. How are there scenes where DiCaprio looks younger? Perhaps 3+ hours invites the over scrutiny but scorcese is asking for it.How about the stabbing scene that is so poorly acted you can see no blood on knife or that the knife makes contact at all? Review that and get back to me.Dont make a film so long if you cant keep it interesting.",
    "44": "Not insightful, not witty, nothing interesting, bad direction, but good acting. And that's unbelievable idiotic as it is based on amazing true story. They managed to screw up and americanized to the worst the whole story. Such a disappointed, i strongly suggest to check YouTube or read a book about the topic instead of wasting your time. This is just one big wanna-be artistic movie that in the end is just one big American fart. Avoid at all costs.Even the character buildup ia so lacking that you lose connection and interest so fast into the movie. I've seen bad long movies, but this was one of the worst.",
    "45": "The story is historically important. And nearly everything about the film is very good, even very, very good. Oscar's? I wouldn't be surprised. But the filmmaking repeatedly gets in the way of the story and, for me, somewhat becomes a more interesting story to watch as it slowly, slowly eats itself right before your very eyes. I mean, oh sure, we follow the characters, we know both their secrets-and that they'll be revealed. And Leo grabs your attention when on screen (but how much of that is because your eyes are dying for ... anything?). What's the one adage about time passing slowly when you watch a pot boil? And what's the other one about being a frog in a pot of water and slowly dying without realizing it? This film allows you to be the frog, the pot, the water, the stove, and the sink. And you have time for the bathroom.",
    "46": "Somebody at the movie studio forgot to tell Scorcesee \"CUT!\" because this movie is so frigging long. 4 hours! We need an intermission, it's so long.Some scenes drag on and on and on and I wanted to yell, \"hurry it up\". It's a story that needed to be told but perhaps in a docudrama and not a fictionalized movie. And certainly with a better director. Better yet, maybe Scorcesee should have made this a 2-part series for Netflix.DiCaprio (Ernest) and DeNiro (King) compete to chew up scenes. They both are capable actors but for some reason I only saw one emotion from both of them.The story is about a true incident that happened to the OSAGE Indian tribe in Okla. I'm sure liberties were taken with the story. The Osage lived and owned land that was rich with oil. To assure that the oil land would be passed onto White citizens, white men married Indian women and coincidentally the wives died (prematurely by murder or fire) leaving the husbands the estate.That same plan is what Ernest is urged to do by his uncle King. And one by one we watch Indian women die; Ernest even poisons his wife.The story ONLY perks up and gets engaging when the wife goes to Washington and asks the President to intervene to find out why these women are dying. That's when the FBI comes in the picture and it becomes a crime drama. Much more interesting and more engaging.But with that we are dragged through long long scenes between DiCaprio and the FBI and witnesses and Deniro (the uncle) and the wife and they go back and forth, and you just want to scream \"Get on with it.\"\nThis could be called typical Scorcesee. He's known to make long belabored movies. He won best director for the Departed, but that was such a snappy fast moving movies with all types of twists I didn't mind the 3-1/2 hour sit-through.But this Killers Movie is laborious.It's going to get a bunch of awards because the hype has already started and Scorcesee is promoting it all over the internet and TV. The only person deserving of a nomination is the lead actress. I don't think DiCaprio did anything unexpect from him, nor Deniro.I still say save your money, stay home and stream it so you can take potty breaks.",
    "47": "This movie has pacing issues and could have been edited down. I wasn't very invested in the characters and it's hard to sympathize with some of the characters in the film. It's also way too long in the first act.Not to say that it's a bad movie. It's good. But it is not as good as the hype suggests. I've seen other 3 hour films this year that were much more engaging and riveting than this.The cinematography is great but not as good as Oppenheimer. The music score is dull and lacks a forward momentum. The story lacks drama because you know who is responsible. Some of Scorsese's other long movies have a lot of energy but this just felt like it was drawn out. It was also too difficult to follow because you are introduced to all of these characters you don't know and there is a lot of exposition.",
    "48": "In the plus side, important amatory and brilliant acting from DeNiro and Gladstone, especially the latter who was mesmerising.The film was fundamentally let down by not being capable of delivering the central premise - that DiCaprio's character was thicker than pig excrement. The actor, editor and director bare responsibility.After 3hrs 29m they were so far from telling the whole story that they introduced a rather ill-judged reenactment of a 1950s theatre 'show' to tell the rest in a toe-curling fashion - including a white man talking in an indigenous American accent, which almost finished me of, before Scorsese's cameo did!",
    "49": "Oh boy. I see that I am going against the grain with this but I am sorry it is what it is.After finally getting to the end of this movie, I just kept wondering who this was made for. If you wanted to bring attention to this datelinesque tragedy why not make it two hours shorter and target the younger generations, who clearly have more sensitivities toward these issues than older people. There aren't too many people under the age of 50 who would even sit through this. If I hadn't been with someone, I wouldn't have either.It moved at a snail's pace throughout. It was quiet, lulling, and it hit me, scratching my head as to why the people that were being systematically murdered couldn't easily figure out who was doing it. Especially the wife of Leonardo DiCaprio, who was bedridden for three hours over the course of however many weeks, months, or years progressively getting worse, and yet she could not put two and two together that Leonardo was poisoning her even as he injected Daley shot into her body. Please.And then, after finding out that he had a hand in systematically murdering all her sisters and her mother, she still was able to keep a straight face, and offer some level of compassion and decency toward him. The director did also. Were we supposed to sympathize with or dislike Leonardo's deplorable character?Then, on top of it the anti-climax where is the villains served a couple of years and then went to live out the rest of their lives to ripe old age is just didn't settle. I mean if that's the true story and fine. And maybe that's the point which is supposed to spark outrage from viewers.From a historical perspective, the story was so small in scope and focus that I felt it offered very little to expose much of the white man evil that existed in these time periods.On this one I love the players, but hated the game. Much like Oppenheimer just another overly long snore and bore fest that played out way longer than needed. Jesus.",
    "50": "Positives: I loved the casting. Leonardo DiCaprio, Robert DeNiro, and Lily Gladstone did a fantastic job in this film.Covers the book well, touching on most of the major highlights of it.Negatives:\nI read the book and that was 1000% more intense, paced well, and left you hanging on every word. The movie revealed everything to us in chronological order in a very slow fashion, thereby eliminating all suspense and mystery.The movie was 1.5 hours too long. Martin could have cut down the movie and made it more concise by highlighting the greed of white man when they struck oil, how many of those men swindled Osage out of their fortunes, covered more of the introduction of J. Edgar Hoover and the birth of the FBI (all of his trials and tribulations, including mistakes made during this investigation), included some small but crucial moments like mentioning that Ernest was Mollie's guardian, bring up that Lizzie's death was suspected posioning, reduced some of the cinematic shots that Martin seems fixated on (you'll know when you see them), and I wish he introduced this movie from the perspective of the FBI.",
    "51": "Incredibly boring movie. After 2 hours - shortly after the halfway point, I shut it off. The characters are very dull, the plot is extremely slow to develop, and the characters are quite boring. How this movie got more stars from most is beyond me. I seldom stop watching films in the middle, but this one was one of them. The indians are displayed as stupid and unintelligent, the whites as all crooked and conniving and it was a stereotypical whites were all bad, and all the indians were taken advantage of politically correct film. While certainly there was much exploitation of natives, hardly anything is ever said today about the atrocities natives did to whites or even to each other. This film failed to even develop those reasonable questions. It was an extremely boring film, and I love watching westerns. This wasn't one of them. Skip it.",
    "52": "The cinematography of this movie is increíble , you could print almost every frame of this film and hang it in you living room as a piece of art.The acting is one of the best I've ever seen, DiCaprio's ability transform into a completely different character on every movie he makes it's one of a kind. An De Niro is just perfect as always .A story about how América was built , manipulating and destroying the good heart native people !Instant classic , and a film that tries to to say a lot , and accomplishes it perfectly. I strongly recommend this movie to people that appreciate cinema, music and photography.",
    "53": "After having eagerly awaited Scorsese's follow up to The Irishman for so long, I was so excited to see this film as his newest work.I was very bitterly disappointed to find a dull, repetitive, shallow and just plain boring movie with nothing of substance to offer.The first 2 and a half hours of this film is a collection of scenes that follow the exact same formula of whites acting greedy and despicable, committing atrocities and then the Native Americans lamenting their situation, rinse and repeat about a dozen times and you have the first 2.5 hours of this movie.The plot doesn't move forward until much later when Jesse Plemons shows up and I was waiting the whole time for him to show up because I knew the plot wouldn't start moving until he did. The investigation by Plemons was quite engaging to watch and the most enjoyable part of the film.There is little to no depth to be found in any of the characters, white or Native. Each character is defined by a single shallow trait such as greed, stupidity, suffering or sociopathy and there are little to no opportunities for the audience to get a glimpse of their souls or inner workings of their minds to understand their complex motivations. The Native American characters in particular are not given much personality and mostly exist as stand ins for slasher movie victims for the white villains to slaughter.The acting and performances are competently done as expected of the cast and there are some very beautiful shots in this film but the story or perhaps the lack of it, makes it a very painful and laborious watch and just a chore to sit through in the theater.",
    "54": "A movie can be slow and boring for an hour and a half, even two hours. When you are bored at the movies for more than three hours it is an ordeal, a torture.Extremely boring. Leo Di Caprio's face imitating Corleone's characterization is not credible. Robert de Niro doesn't make you feel like he's a monster. I can say as a positive note the performance of the Indians. Especially Di Caprio's wife. Run away from the movie. Whoever recommends it to you is not your friend.Because it doesn't have a nice soundtrack. I don't understand who thinks it's a good movie. It's Scorsese, yes, 0ero also makes bad movies, you can say that. It's not worth a penny. This movie is worthless.",
    "55": "I have never found Martin Scorsese to be that great of a director, (Yes, I know that he has million of filmgoing fans but I am definitely NOT one of them!) I find his films to be completely pretentious and highly overrated, everything from Mean Streets, to GoodFellas. I think his films are pretty good, but definitely not my cup of tea soy to say.I enjoyed The Aviator and The Irishman but I definitely find Scorsese's work to be highly overrated and I don't really enjoy watching his films very much.With that being said, his latest film, Killers of the Flower Moon is a VERY long, (nearly four hour long) film that chronicles the murders of Native Americans in Oklahoma. Now, Scorsese is best at making gangster dramas, and while this has similar elements, this is a very long, drawn out Western/murder investigation that was definitely far too long for most audiences, including myself to maintain interest.Leonard DiCaprio and Robert DeNiro give fine performances, but the film's shock value really didn't grip me as much as it does some die hard Scorsese film fanatics.While some critics are saying that this is one of best films of the year, I definitely did NOT agree. I felt it was far too long too maintain any interest for most filmgoers.,This will play out much better when it comes to Apple TV later this year, but it really didn't hold my interest at all.",
    "56": "I wonder what score this movie would get if people didn't know it was directed by Scorsese. What would one think without that knowledge?Probably that this was done by an ambitious, very young, albeit not too talented guy/gal fresh out of film school who wanted to show the universe of knowledge they have about moviemaking. This then predictably ends up in an overly long, dabbling, shallow production that drowns in its own point. Also proof that even great actors need to be given well-written lines and directed - otherwise it just falls apart.I love and respect Martin Scorsese. This makes it all the more difficult for me to understand how he managed to make a movie where the main characters are at best one-dimensional without any kind of depth or improvement. I could even accept this if this shallowness served a purpose, but if it does, it's beyond me. We have the (1) constantly-scheming evil old white guy, (2) the dumb, relatively young white guy who for some reason is ~50 years old and halfway through the movie, starts to contort his face into a bulldog's, and (3) the absolutely braindead Native American lady who doesn't seem to notice/connect how people are dying left and right around her.What is this movie trying to convey? Is it trying to raise sympathy for how Native Americans were taken advantage of? Or just contemplate the simple, stupid evil of human beings? Whatever it is, it quickly turned boring and repetitive enough for me to make it a test of will to watch through and feel no interest, compassion or pity for any characters whatsoever.",
    "57": "A greatly paces melancholic story. I have to mention the actors that brought out the emotion of the characters so very well. Every time Lily Gladstone is in the frame you always have a sense of sad foreboding and she carries that role so well. Even with the mildest dialogues, her expressions, body language are so exact that they tell the story in just that. Dicaprio plays his role to utter and absolute perfection, you always have that sense of irritation that he is going to say or do something idiotic through out the film while also sympathising with him. De Niro just gets under your skin the entire time, another perfectly played part. The story itself is extremely sad and infuriating at the same time, and I am happy to have watched this film and learnt about these native tribes and people. Even the length of the movie didn't seem a deterrent it did not drag at any point. Exemplary film making.",
    "58": "With masterful storytelling, impeccable direction, and exceptional performances by DiCaprio, Di Nero, Gladstone, and the rest of the fantastic cast. This movie left an indelible mark on me. Scorsese's latest creation is a cinematic landmark that feels like a natural progression of his fabulous film making career, delivering a powerful and thought-provoking experience that engages the senses and nourishes the soul. A true testament to his creative genius, this movie is a must-see for film enthusiasts, reminding us once again why Scorsese is a true master of his craft.Give this movie all the Oscars possible, I haven't been captivated by a movie like I did with this one in a long time! Must see for all movie-lovers!",
    "59": "It's criminal how such a good line up can result in something so utterly average. It had everything - murder, betrayal, ethical dilemmas, great cast, great director, but wow was it easily the worst thing De Caprio has done in a long time.The twist is given away far too early and then the film drags on for another 2 hours.There is no pay-off at the end. No suspense, no drama, barely any action.The deep, ethereal, enchanting and hard-hitting trailer is full of intrigue but don't expect anything but a long sigh in the actual film.There are so many ways this could have been a better film - could be shorter, could give the twist away at the end, etc etcThe cinematography is the only good quality about this film. It's nice to look at, sometimes.Anyone rating this a masterpiece is 100% blowing smoke.",
    "60": "First of all, regarding the technical aspects of the film, such as the cinematography and especially the music, they were quite remarkable and special. The IMAX experience was definitely worth it. The sound mixing was excellent; I was truly impressed.I don't know how many generations Martin Scorsese has introduced to his films, but this is certainly a testament to the quality he's passed on to the latest generation. Everyone in the film delivers strong performances, but Lily Gladstone's performance is absolutely stunning. DiCaprio and De Niro are as great as ever, and there's not much more to say about them.Now, let's talk about the length and pace that everyone has criticized. I'll evaluate both separately. In my opinion, the film is long, but it's not an ideal length for what people are saying could be covered in 2 or 2.5 hours; 3 hours is a suitable duration. The final 30 minutes did wear out the audience, but aside from that, I think it shouldn't have been shorter than 3 hours, especially given its length. The pace remained fairly consistent throughout, and I can understand why they kept it that way to maintain the tempo they established at the beginning and for its development. However, since the film was 3.5 hours long, I believe they could have included 1 or 2 rollercoaster scenes in the final 30 minutes.I think it was valuable to pay tribute to the Osage people as well. The storytelling of the murders was of high quality and simple, especially the trial scene was well-placed without exaggeration. The Osage people's rebellion and council were very realistic; everyone portrayed their reactions without exaggeration. In my opinion, the film truly made it feel real.Finally, everyone seems to be living for money nowadays, and this isn't a way to live life. Yes, money is important, but let's not make this world unbearable for the sake of it. There's only one world to live in for now. I want to thank Martin Scorsese for drawing me and everyone else to the cinema.",
    "61": "Never liked Scorsese. His movies draaaags on forever. They could easily have cut the movie half the running time. It's also a very annoying\nDepiction of the Indian tribe. Don't tell me they where so completely NAIVE not to understand what was going on?? After the first murder i instantly suspect that slimy douchebag old fart and all his goons. And the indians do nothing about it. It's really a movie that makes me frustrated for all the wrong reasons. You want the indians to revenge the idiots but the revenge is so miniscule it really doesn't matter. I'm all in for bleak, tragic real life stories but in flower moon it's difficult to even care when the characters are as dumb as they come. And when the chances are in front of them, like when the fbi knocks on the door. The wife is so drugged up she can't even understand. Its that type of annoying movie.",
    "62": "We left after an hour and a half..... we looked at each other many times during the first hour waiting for the something interesting unpredictable or exciting to happen that the 10 star people mislead us with! We haven't left many films but looking through some of the reviews here we definitely werent alone.... I'm struggling to understand how it got an 8.2 average??? Some films are just businesses trying to make more money than is spent making them. Can't see them recovering the 200 million on this crao.....!! Hope you are reading this before you waste a large portion of your life waiting for this film to take off..... YOU HAVE BEEN WARNED.",
    "63": "I am a fan of Scorsese and liked most of his movies but Killers of the Flower Moon was not one of Scorsese's better movies. It was way too long for the amount of story, it could have been 1:30 hours long and still tell the same story. I'm not generally against long movies and I enjoyed the Irishman a lot though it had almost the same running time. The story and the characters were very predictable from the get go. The characters were stereotypical, very white or very dark without anything that would make them interesting or nuanced. The story had no twists and turns and was even repetitive at some points. The factual story behind the film was actually way more interesting than the film itself and I think a director/screen writer with better story telling techniques could have made a far more engaging film with the material. For a movie that was about murder, there was absolutely no suspense within the story to keep you engaged for 3 hours.I don't think it was worth my money and time.",
    "64": "Hey let's not kid anybody, it's a Osage Indian Goodfellas...that's exactly what it is. Only this time it's the Masonic Mafia killing Native Indians...and yes just like Goodfellas it's based on fact. It is shocking but no more so than other facts that have come to light. Yes it's excellent but I don't think it needed to be so long. That seems to be the trend of Scorsese's movies at the moment. DeCaprio and DeNiro do a fatastci job and transport you into the 1800's. It's allegedly about the formation of the FBI but this is the latter half of the story. And that is all I want to say. It's interesting if not very disturbing and I can see modern day society doing the same atrocities.",
    "65": "As a long time admirer of Martin Scorsese, this film promised so much, but apart from the running time, delivered less than the promise.The premise of the story was good, and the acting excellent, but the pace was slow and the film could do with some judicious trimming in the editing suite. Some scenes were overlong and others such as the autopsy scene were jarring and completely unnecessary.It seems like another recent example of a great director who has either forgotten the need to tell a tale concisely, or that has no-one around them to have a quiet word, rather than just agreeing and admiring the master.Look forward to seeing the 'non-Directors Cut' of the film to experience what could have been.",
    "66": "I'm a huge fan of Scorsese,dicaprio,deniro\nbut this was the dullest movie I've ever seen this guy's in, almost 4 hours that easily could have been edited correctly,\nthe sound composer did a horrible job, from Scorsese brilliant composing movies like Goodfellas and casino\nto this is so dissapointing, the directing scenes were choppy and didn't go fluently, for 200 million budget it appeared more like a 3 million dollar budget.I understand the story line and I feel first nation Americans need more exposure for awareness of the genocide they went thrue, from my heart\nbut this was a 4 hour dreadful ordeal with no appealing scenes.",
    "67": "From the beginning it was clear that the style of the movie would be slow and deliberate. The Robbie Robertson score was the heartbeat of the story and early dialogue reiterated the Osage Indian way of communicating with the White Man.While the book takes the point of view of the investigation and the FBI, the movie follows Ernest Burkhart (Leo DiCaprio) and is a study on the situation he found himself if between his uncle, who befriended the community in order to get as close as possible for evil purpose, and his Osage wife, who's family and community were under attack.To see Ernests' struggle was like watching an analogy for how a general population can be led into temptation without remorse. To see the plight of the Osage community switches the focus back onto true American History, not a black eye, but straight out thievery.The details in the book could not be expressed in the cinema due to the need to focus on the story, so it's far from a documentary recreation, but it is a careful, poignant and meaningful recreation of a story inside American History that some may not want to see for admission that our country's heart may be in the right place (eventually when they benefit from it) but their hand is always in your pocket.Headrights, inheritance, not being allowed to handle one's own money and indifference to life. It's all here as well as the personal story of Molly Butkhart (Lily Gkadstone). She's as stoic as one can be amidst such evil. It's her who the movie focuses at the end as it's really her story and who you're thinking about leaving the theater.Robert DiNero is fine as Willian Hale, if not simply obvious. But since he understands his prey better than anyone, he is able to manipulate the events the way the director, Martin Scorsese manipulates the audience. The appearance of other famous actors towards the end of the long movie experience was charming but distracting.This will play out on Apple TV but I'm glad to have seen it in the auditory confines among respectful theater goers. This was a worth Cinefile Event.",
    "68": "Beautifully filmed and acted, as always with Scorcese, but ruined by a rambling, unfocused, incoherent script that was presumably supposed to give a more in depth picture of the clash of two cultures than the usual cowboys and injuns stuff, but was an hour too long and so full of disconnected scenes and irrelevant secondary characters that the story got lost amongst the maze of bewildering plotlines.Furthermore there seems to be a confusion of character in that the two male leads are portrayed as basically sympathetic men struggling with their own demons, but emerge in fact as cold-blooded ruthless killers with no real redeeming features!",
    "69": "I had high hopes from this one but keeping the acting and storyline aside, the movie disappoints a lot. The pace is extremely slow and at some points it gets quite boring. The movies is bearable only because of the well executed plot and brilliant acting, otherwise it would have been a disaster.Leonardo & De Niro were excellent as always and so were the other cast members. The length of the movie could've been shortened as it feels stretched out on many occasions. Overall, the pace and the length were an issue and the movie could've been shortened a bit. It felt unnecessary long and was quite unbearable at times.",
    "70": "For the first time I am seeing Leonardo Decaprio play the role of a character who is somewhat dim witted - not his usual sharp smart personality. But he played it beautifully.Other characters were good but some of the acting of the side character didn't feel on point.The story is a good one, worth watching but it feels like it centers around one family only. I hoped for a much broader picture that includes many cases of many families and overall situations and crimes against the osage people as a whole.The story is not told on an epic scale but rather it shows just one case. There should've been more back story and other incidents. This is the only thing I didn't like, other then that everything else is mama Mia.",
    "71": "I just got released from this interminable film and I feel like I've been robbed of half a day. I really can't fathom all the love for this movie. Despite a strong start to an interesting and tragic story, it quickly lost steam. It would also have been more so if told from the Osage point of view.Usually brilliant DiCaprio looked confused like a Godfather impersonator with some sort of vague Southern accent. If they give an Oscar for jutting out your jaw and speaking as if your mouth is filled with mush, he'll be holding a gold statue. At 48, he's too old to play the character, Ernest Burkhart, who was around 30.There was no need for this to be 3.5 hours long. None. Toward the end I was ready to yell at the screen, \"Just. Stop. Talking!\" And that little bit of business with the radio play at the end was too cute by half. A couple of end cards would have done the trick. Someone needed to edit this bloated heap down to a manageable amount of time, but apparently nobody had the guts to reign in Scorcese.Things started to pick up in the last third or so, when Jesse Plemmons and the FBI rode into town, but it is unclear how they uncovered the whole truth. The birth of the FBI and the techniques developed to solve the crime were glossed over in favor of long, repetitive conversations and multiple lingering shots of a fire that had nothing to do with the rest of the story.The courtroom scene was a mess. Brendan Fraser dropped in to munch on some scenery, but for no other apparent reason. I was so bored by that time, I don't remember why Ernest suddenly decided to flip despite threats from Fraser and Robert DiNiro.The real tragedy is that this is an important story bogged down in the poor storytelling and self-indulgence of a director who believes that his body of work renders everything else he does legendary. I'll consult Wikipedia to figure out what I just watched.",
    "72": "All these reviewers saying this film is a masterpiece and brutally honest... What's wrong with you? Just because Martin Scorsese is a famous director people think everything he makes must be amazing... People are afraid to put their heads above the parapet and go against the grain and question a big name like Scorsese. You cowards! This film is terrible. It doesn't know if it's a comedy or a drama or what. The acting is over the top and the story idea is something we've all seen a dozen times before. I read a review where someone mentioned that a film from the 1950s told this story exactly! Come on! Sadly people think because Scorsese is Scorsese everything he does must be solid gold. This is not solid gold. This is rusting bronze. Yes the cinematography is nice and the score and some of the lesser roles are played nicely. It doesn't matter because the main stars Leonardo DeCaprio, Robert DeNiro and Lily Gladstone are like wood! Stop being afraid to question and criticise bad movies because they come from famous directors or feature famous actors. This is a bad movie and that's all there is to it.",
    "73": "It had the potential for a great movie, interesting topic but was long, drawn out and anticlimactic. The pace of the movie was so slow they rushed the end by getting news readers to read out the ending. Unfortunately worst movie I have seen in a long time, I only stayed until the end because I paid to see it.The actors were excellent and there were some big names in this movie but unfortunately they couldn't do much to make the storyline any better. Just when you thought something was going to happen, it fizzled out. Such a shame, the trailer looked interesting and I had high hopes for this movie.",
    "74": "Wow, was I disappointed. Yes, there's some solid acting here, but the story just isn't all that interesting. It's way too long, it's been promoted far too much by the media, and I hate to say it, but the movie is boring. It's one of the only movies I've been in for a long time where my butt started to ache in the theater seat despite the fact that big stars were on the screen in front of me. I'm sorry, but I just don't \"get\" the acclaim here. Take Marty out of the picture and give this credit to an unknown director and it would have been an \"also ran.\" If this thing shows up at the Academy Awards with a bunch of wins, I'm going to toss my TV out the window. Let's call it here folks . . . This thing comes darn close to being labled a complete stinker.",
    "75": "I just saw in a special screening this movie . It's absolutely fabulous in terms of the direction . All of the actors give amazing performances , especially the actress that plays Molly ( sorry i don't remember her name ) , Robert de Niro and brendan fraser ( although his sceen time was little ) . I understand why some people may have problems with the runtime , i think it's as long as it should . About the theme of the film also maybe it's not for everyone and at some times it becomes a bit more depressing than you already expect , but i think it could easily become a classic . It deserves all the hype and more and i have to say although the enormous runtime , everyone should see the movie on the big screen .",
    "76": "It should be ended in 2hr. Most of the scene is unnecessary. De Niro character is boring and lack of leadership chrisma , this has to be the worst performance Decaprio did. Decaprio most of the facial expressions is frown in this show,Gladstone deliver a power performance but lack of chemistry with Decaprio. I no mind longer movie ,I can watch Oppenheimer 2 to 3 time without feeling bored with it's rich content story telling but this is way too long and most of the scene didn't link with the story at all. Wish to see more performance from Osage tribe supporting cast since this story is about them. Still a watchable movie ,too much room for improvement.",
    "77": "\"Killers of the Flower Moon\" is a Western crime drama film co-written and directed by Martin Scorsese, based on the non-fiction book of the same name by David Grann. Starring Leonardo DiCaprio, Robert De Niro, and Lily Gladstone, it touches upon an often overlooked piece of American history in the best way possible thanks to the talents of its director and cast.In the early 1920s, the discovery of oil on land belonging to the Native American Osage Nation turns the tribe into some of the richest people in the world. This sudden acquisition of wealth attracts the attention of white businessmen looking to seize the opportunity at stealing as much from the Osage tribe as possible. Among this group of interlopers is Ernest Burkhart (Leonardo DiCaprio), whom upon arriving in Oklahoma is encouraged by his uncle William King Hale (Robert De Niro) to marry a member of the Osage as a way of inheriting their fortune. Ernest soon falls in love with and later marries Mollie (Lily Gladstone), a young Osage woman who has strong ties to her family's riches. As the white occupation of native land continues, members of the Osage tribe are repeatedly found murdered under mysterious circumstances, with some of Mollie's close family being among the most prominent victims.One of my favourite things about movies is that in addition to being an enjoyable means of entertainment, they also function as a great method of preservation. No matter obscure the topic may be, if a film is made about it and released into the mainstream, then it has already been permanently preserved in some way. This is especially effective if the filmmaker believes that people should be made aware of something that may otherwise have been forgotten with time, and in doing so, has helped maintain its relevance with the general public. One event that is often glanced over is the Osage Indian murders, a series of slayings of wealthy members of the Native American Osage tribe during the early 20th century. However, thanks to Martin Scorsese's film \"Killers of the Flower Moon\", audiences now have the chance to be both educated and entertained about this overlooked historical occurrence in a movie that provides a sophisticated, eye-opening look at America's treatment of one particular group of their indigenous population.Much like most of Scorsese's best known work, the film is framed as an epic, in-depth study of the dark side of human nature. We watch how the Osage tribe, who live in harmony among themselves, are forcibly thrust into the sights of the outside world after oil is found on their land. In spite of the vast wealth they have all accumulated, the Osage are unable to hold back against the large tide of white people showing up and attempting to steal away everything that is rightly theirs. Because of this, the tribe's happy existence has been compromised as they are subjected to frequent discrimination, first verbal and then physical. It is here we see the sinister plan of William King Hale come into play, where he marries off his nephew Ernest into the Osage as a way of pilfering their riches when the time is right. What makes this scheme so intriguing to watch is not only the patience required to pull it off but the ethical ramifications that result from it. Only a filmmaker like Scorsese could explore a topic like this with such complexity, and in a style that remains as timeless as ever.Additionally, almost all of Scorsese's visual trademarks as a director are on full display here, from his wide-open cinematography designed to immerse the audience in the world of 1920s America to his creative framing of characters in shot to give a certain perspective on a scene. One in particular that stood out to me was during a conversation between Ernest and William as they discuss business regarding the Osage. We see the two seated inside a darkly lit room discussing what type of future lies ahead for the entire tribe, with Ernest choosing to remain loyal to his Osage wife Mollie, while his uncle William reminds his nephew of the important reason why he married her in the first place. Here, Scorsese places the characters in a way that makes them look out of place inside a single bright spot in the dark room. The darkness surrounding these two can be likened to a perfect visual representation of their true intentions and the supposed brightness focused on them is in actuality a metaphor for their tainted presence on everything the Osage have created up until this point.Due to the scale of its theme and plotting, the film rightfully earns its long runtime of almost three and a half hours (206 minutes in total). This is because there are so many different facets to explore with each of the characters, as their actions and the resulting consequences make for a compelling viewing experience. While I personally think this made the film more interesting to watch, I'm not entirely sure the same can be said for casual viewers. The film's pacing is intentionally slow as a means to build tension in the air, which I believe works rather effectively, and the minimal musical score is used as a method to showcase a more realistic point of view during scenes of raw emotion. In other words, this is a film that requires patience and an attentive mind, something of which is greatly rewarded to anybody who manages to display both of these virtues. To that effect, Scorsese has made a film that is heavily reliant on atmosphere rather than the frequent action of most other Hollywood blockbusters.In his sixth collaboration with the legendary director, Leonardo DiCaprio delivers yet another memorable performance in the role of Ernest Burkhart. What makes DiCaprio's character so intriguing is his indecisive nature, in that he is torn between supporting his own white family or his Osage wife Mollie. On one hand, Ernest's loyalty towards his birth family is what made him go ahead with his uncle's idea in the first place, while on the other hand when he truly falls for Mollie he cannot bring himself to end her along with her entire tribe. DiCaprio displays his signature range of emotion here, alternating between a strong family man and a submissive weakling doing his uncle's bidding, both of which he pulls off quite effectively.After working on ten films together, Robert De Niro steps back from his usual spot as the Scorsese lead and into the supporting role as William King Hale, where he is essentially the main antagonist of this story. Hale is a man who is determined to weasel his way into wealth, regardless of whether or not he has truly earned it. His intentions are malicious and are only meant to serve his own personal gain, with little regard for the wellbeing of others, even his nephew. What I consider to be his worst character trait is that he believes all of his actions are justified by what the Bible says about spreading the Word of God. His claim that God wants him to participate in the genocide of an entire race of people is nothing short of evil, and he demonstrates this at numerous points throughout the film. A role like this is perfect for an actor like Robert De Niro, and what better director to show this to the world than Martin Scorsese?However, the film's true standout would have to be Lily Gladstone as Mollie, who is truly the heart and soul of this story. Here is a woman who has experienced so much pain and heartbreak in her life, whether it's her own physical ailments or the sudden death of her relatives. Yet, despite all these hardships, Mollie remains as steadfast as ever, choosing to be a loving wife to her husband and caring mother to her young children. Mollie essentially represents all of the positive values that her tribe upholds, and she is among the last of her family who hasn't completely sold herself out to the ideals of a rich lifestyle. This is easily a career defining role for Gladstone, and she certainly has potential to be noteworthy star one day.For the American history buff and the Martin Scorsese fan, \"Killers of the Flower Moon\" represents a fascinating look into the best of both worlds. It brings attention to an often neglected historical issue through use of another well-crafted cinematic addition to a beloved filmmaking veteran's library. As mentioned previously, it is nice to know that this story has now been effectively preserved through the medium of film, which means that future generations will be able to watch it back and learn about the horrific events that took place during this time period. After all, as the classic saying goes - those who don't learn from history are doomed to repeat it.I rate it a solid 9/10.",
    "78": "Killers of the Flower Moon (2023)While watching the Irishman, I remember feeling guilty about pausing to check how much time was left. This time, I was scared to look at the watch because I never leave the cinema without finishing a. Movie. I know it's Martin Scorsese, one of the greatest directors who made phenomenal movies like Taxi Driver, Wolf of Wall Street and The Departed, but honestly, Scorsese shmorsese for making this one 2 hours longer than it had to be.The story is about a tribe of Native Americans who discovered oil in Osage at the start of 20th century. Our protagonist Earnest (DiCaprio) and his uncle (De Niro) are on a mission to snatch that money for themselves. It's a nice story that could have been an 8/10 as it explores the topics of greed, colonisation and cultural erasure without any consequences. It also came out at a perfect time considering the current events, but did it have to be sooooo damn loooong?Knowing the title of the film, you automatically know it's ending so that alone saps out all the mystery. For what is supposed to be a sad story, the film doesn't create any emotional weight to make us care for it's characters and as a result, it's hard to connect with anything. De Niro and Fraser did a fine job but DiCaprio looked like a pitiful aging boar instead of the young, sly and seductive fox he was meant to be.The costumes and decorations were great but it's like they forgot about the audience while making this film. The story repeats the same trope again and again creating zero tension for us to be invested in until the final 30 minutes. Moreover, it's as if the whole cast, was injected with ketamine as they looked and sounded lethargic adding more weight to the dragging pace.If Scorsese wanted to make an impact then he should've used emotions and tension instead of 600 pauses, glances and empty conversations. He was trying to say a lot in the epilogue about tragedy being hidden behind entertainment and profit but by the time the epilogue finally came, I was happy to go home instead of being floored by the sadness. It's an important story that sadly didn't work out as an impactful drama.Movieswithoutshmovies on Instagram for honest movie and TV reviews.",
    "79": "Some films warrant long runtimes. Epics like 'Lawrence of Arabia' or 'Das Boot' are both over three hours in length, and rocket along at a brisk pace, largely because of fastidious editing. The duration of both those pictures is necessary, one could argue, to tell their stories without sacrificing details, coherence or excitement. Then, there are films like 'Heaven's Gate,' which also has a runtime of over three hours, and is a bloated, self-indulgent and unaffecting watch thanks to director Michael Cimino's arrogant refusal to cut anything.Martin Scorsese's 'Killers of the Flower Moon' teeters somewhere between both camps. It has elements deserving of high praise, but is inarguably too long, with pacing, structural and narrative issues galore. Based on the non-fiction novel of the same name by David Grann, the film centers on Emmet Burkhart, a simple-minded World War I Veteran who returns to The Osage Nation, to the home of his uncle William King Hale. There, Emmet falls for an Osage named Mollie, who- his uncle tells him- is set to inherit much of her people's oil headrights. Meanwhile, someone is killing off the wealthy Osage in the area; and it looks like Mollie's family might be next.On paper, it sounds like a fascinating, exciting picture, with dashes of psychological intrigue. However, Scorsese's version of the tale is dour, swollen and predictable. Grann's riveting story is transformed into a formulaic meditation on moral corruption and greed, lacking any kind of suspense or momentum. Screenwriters Scorsese and Eric Roth cram too much into the narrative- namely too many characters and unnecessary scenes leading to redundant dialogue and vice versa. They have to scrabble to end proceedings neatly; which they don't do, preferring to hastily sum up events rather than let them play out.Had Scorsese and longtime collaborator Thelma Schoonmaker been more active in the editing booth, things could have been different. There are some brilliant sequences in the movie, in fact, the first third is engaging and intriguing. The mystery is successfully set up, the location established and the characters introduced, then things start going downhill. The pacing slows to a crawl for the remainder of the runtime; until the end, of course, when it rushes to its sloppy conclusion. Beyond pacing, there are some fundamental flaws editing-wise that are inexplicable, considering Scorsese and Schoonmaker's prestige.For example, seemingly important characters are introduced, then disappear for long stretches of time. Similarly, the fate of some characters is either driven home multiple times, or overlooked; leaving us in the dark. Furthermore, at times, cuts occur just as someone is opening their mouth to speak. All this- including the fact that the runtime could have easily been trimmed by forty minutes without negatively affecting the narrative- is amateur work; far below Scorsese and Schoonmaker's level.This is not to say, however, that 'Killers of the Flower Moon' is without redeeming elements. To make a film about cultural appropriation is always a just cause worthy of commendation, no matter its effectiveness. Scorsese should also be applauded for trying something new- although he fails to deliver a compelling or insightful story about the exploitation of the Osage people. The film doesn't explore the historical or cultural context of the Osage Nation, nor the psychological and emotional impact of the murders on the survivors.Scorsese and Roth's narrative also fails to challenge the stereotypes and prejudices that the white characters have towards the Osage, or the systemic injustice that they face. Their characterisation lacks depth or nuance, relying on familiar tropes and cliched attitudes. Had he focused on the perspective and agency of the Osage, rather than the corrupt, inept white characters; Scorsese could have had a masterpiece on his hands.Conversely, Rodrigo Prieto's cinematography is evocative and enchanting. It makes for a stunning watch, proving Scorsese's eye for visuals has not been blinded. Under Scorsese's direction, Prieto captures the beauty and brutality of the Oklahoma landscape astutely, while Jack Fisk's detailed production design lends proceedings authenticity and textural richness; which Adam Willis's set decoration and Jacqueline West's costume design only compounds.Moreover, the late, great Robbie Robertson's score is striking, bearing a resemblance to the work of Ry Cooder. Full of sleazy slide guitars and Indian chants, it complements the narrative perfectly. The inclusion of period-accurate songs also lends the movie a dose of realism, which- in the times of Baz Luhrmann, who insists on bizarrely using modern music in period pieces- is most welcome. The last project Robertson worked on before his death; his contribution to the picture acts as a powerful swansong.Leonardo DiCaprio stars as Emmet, alongside Lily Gladstone as Mollie and Robert DeNiro as King Hale. DiCaprio has the ability to turn in brilliant performances, but here takes a page out of the Daniel Day Lewis playbook: the most intense acting must surely be the best. DiCaprio spends the whole film frowning, scrunching his mouth up and completely overdoing his character's expressions and eccentricities. In the first third, he has a bit of range; though for the latter two thirds gives a tonally one note performance.As does Lily Gladstone. Initially, she creates in Mollie a nuanced and witty character, who can see through people. She doesn't suffer fools, and we find her both compelling and captivating. However, after the first third of the film, she becomes subservient, unquestioning and dull- and all this before there are medicinal reasons for her being, shall we say, slowed down. DeNiro, for his part, plays King Hale like an evil George Burns: manipulative, darkly funny and morally bereft. Anytime he's on screen, the film is a joy; he's the best thing about it.They are supported by a large cast of talented actors, some of whom do great work. Ty Mitchell is excellent as John, a poor man drawn into Emmet and King Hale's plans, who has more dignity then the both of them combined. Jesse Plemons does typically fine work as FBI man Tom White, while Louis Cancelmi is seedily slick as Kelsie Morrison, a stooge of King Hale's. On the other hand, the likes of Cara Jade Myers- as Mollie's alcoholic sister- and Brendan Fraser- in a thankfully small role as King Hale's lawyer- are both so miscast and over the top, they distract from everything going on around them.It's a sad indictment of a film when its central message was summed up more succinctly in a Dean Martin song (The Money Song) from 1948: \"Them that have it, get more of it. The less they need it, the more they love it.\" Such is the thesis of the film: greed spreads like a plague, and the richer you are, the greedier you are. It's not original, nor is it profound: this very same tale was told much more impactfully back in 1959, in Mervyn LeRoy's 'The FBI Story.'At the end of the day, 'Killers of the Flower Moon' is a truncated adaptation of a great non-fiction book, overlong and devoid of any original or meaningful message. Despite its stellar cinematography, evocative score and a few powerful performances, Martin Scorsese's 'Killers of the Flower Moon' is an underwhelming disappointment.",
    "80": "Obviously this isn't bad. It's from an amazing director with an interesting story. Now that that's out of the way... This was the worst way to tell this story! It should have been from the POV of the FBI! That's when things got interesting. Telling the story in chronological order wasn't interesting. It would have been better to hear it all and investigate it because then all the info is waiting there to be discovered. In order, random things happen along with a story that didn't deserve that much time.Following Leo wasn't interesting enough to hold two hours by itself. Was it supposed to be heart breaking? Sad? I don't know. But there wasn't enough going on to fill up the plot. The FBI gets in and that team looked so cool. It would have been much more shocking for them to hear about the murders all at once and really driven the point home instead of kinda experiencing it.It was so slow! Too slow! I was worried about 3 1/2 hours, I didn't realize that was going to feel like 6 1/2. The Irishman is a slow movie but it isn't boring. And this movie is boring. It's not just slow, it's boring. I kept waiting for it to get going and it never did. The slow pacing was a disadvantage to the movie because it made me lose interest. And it made me much more aware of the length because I kept thinking about how much longer it was going to be. I think they just kept shooting until they ran out of film.",
    "81": "I strongly recommend reading the book over the film. It's clear that movies simply can not communicate the same amount of events and information that books can, but that is not what's wrong here. I would say the movie is mostly faithful to the book (except with certain chronological order of events). The problem is that reading the book was a vastly more exciting experience, especially how the events unfolded. I don't understand Scorese's decision to ditch the mystery and replace it with nothing by giving away right away who's behind it all. We don't even get a solid character study since DiCaprio's character (and performance) is one-dimensional, so is DeNiro's unfortunately. You have this back and forth between these two characters, and it's always the same dynamic. Even their final scene in what is supposed to be a cathartic moment for one character felt nothing short of underwhelming. One good thing I can say is that the movie doesn't feel like three and a half hours. Although the first hour is clearly the best part, with the rest of the movie dragging quite a bit, due to it's repetitive nature. Choosing to tell the story from a perpetrator's point of view felt like a safe choice, Scorese has done this before (and much better I might add) . There are several cross cuts, upshots and stylistic choices that are straight out of Goodfellas which rubbed me the wrong way given the nature of the material. A few nice visual ideas here and there, can't breathe life into a drab screenplay. One of the best parts of the book was the investigation of Tom White into the murders which was a true Herculean act and the scientific evolution of methods like fingerprint identification. Whereas the movie zaps through it, and therefore makes it look like it was very easy to catch and convict the conspiracy behind this. The book showed a dimension of government corruption and systematic sanctioned murder that went way beyond mere individuals, which the movie simply failed to portray properly. The end coda with the Lucky Strike radio show was another one of those tame attempts to upset the audience. All it did for me, was reminding me of a similar scene in a much much better movie 'The Assassination of Jessie James by the Coward Bob Ford' where two brothers reenact the famous murder in a theater play. I think this movie would have been in better hands by a director like Andrew Dominic but I still commend Scoresese for putting a spotlight on this important part of American history.",
    "82": "I'm not a die-hard Martin Scorsese fan. I have a deep appreciation for some of his movies, while others don't quite resonate with me. This particular film fell somewhere in the middle for me.Considering its extensive three-hour runtime, the pacing held up well. I never found myself bored, though I can't say I was thoroughly thrilled either. There were moments when it seemed like some of the conversations lacked significant impact on the narrative. The movie truly hits its stride in the final third, where the tension escalates significantly.The acting across the board was outstanding, especially from the lead cast. DiCaprio and De Niro, as always, delivered great performances, and I've become a fan of Lily Gladstone. The visual and set design were also top-notch.I believe it's an important story, and it's skillfully told. While I don't have a strong urge to watch it again, I'm glad I had the chance to see it.07/10.",
    "83": "First things first. There is absolutely no need for this to be 3½ hours long. It follows the story of the ambitious \"Ernest\" (Leonardo DiCaprio) who arrives at the Osage home of his venal uncle \"King\" (Robert De Niro) who encourages him to ingratiate himself with the wealthy, indigenous, population. He ends up meeting and driving the independent, no-nonsense, \"Mollie\" (Lily Gladstone) and after a while she starts to fall for his charismatic charms, they fall in love and marry. Though he does love his wife, \"Ernest\" proves to be a rather fickle and violent man who loves money more - and at the behest of his outwardly benign relative starts to implement schemes that will ensure the rights to the oil well heads move swiftly - and frequently brutally - to more \"suitable\" owners. This sudden spate of \"accidents\" and killings and the prudent action of the fearful local council alert the authorities in Washington who despatch a team of FBI agents led by the tenacious \"White\" (Jesse Plemons) to get to the bottom of things. Perhaps the \"King\" house of cards might now be becoming just a but precarious? DiCaprio is very effective here. He plays well a man who juggles internal demons and conflicts as he is cleverly manipulated by an on-form, slightly menacing, De Niro. It's Gladstone who steals the show for me, though. She plays the role of the decent and loving - but shrewd and savvy - \"Mollie\" strongly. As she starts to become a victim of her husband's avarice she exudes a sense of desperation that is both pleading and dignified and her struggle is potently illustrative of just how far the \"white\" man was prepared to go to get to - and keep - the money. The film is beautifully shot with a plausible look that helps generate for the audience a true sense of just how this outwardly genteel and civilised society was really anything but and the writing clearly interweaves the clandestine aspects of the the plot with the more noble ones. Perhaps sacrilegious to say, though, but at times it does really drag. I felt it could easily have lost an hour, condensed the story and immersed us more quickly in the characterisations and not really suffered. It's a good film, but it's not a great film and unlike Scorsese's far better \"Irishman\" (2019), I'm not at all sure I will rush to watch it again.",
    "84": "I feel like I watched a different movie from many of the reviews. I went to the theater, with high expectations.The movie is a brutally honest story of moral bankruptcy, corruption and decimation of a tribe at the hands of local landowners. Only this story is different - it's not the typical settlers moving west and battling tribes. It's taking the land through marriage, murder and inheritance. The movie is shot well and the acting is top notch for what they are working with.Now for the bad: it is in desperate need of editing! 3.5 hours is fine if the story keeps pace and moves the plot with pertinent scenes. This is not the case. There is at least 1.5 hours of drawn out scenes and scenes that are completely irrelevant (like the random goofy white guy dancing at a fair for almost 15 minutes. He is never seen before or after). I felt like the story was being told by my elderly grandfather and he would lose pace and ramble about things that are unrelated to any of the events taking place.There are full conversations in the native languages, with no subtitles. It is incredibly irritating. Why does DiCaprio talk like he has marbles in his mouth? Deniro was definitely miscast and should retire. Time passes over a period of days, months and years with no discernible shift to let you know more than a day has passed. And a sudden shift at the end to the format of a radio show was both distasteful and surreal. It left the audience anxious to leave the minute the screen darkened.Sadly, I would not recommend this movie.",
    "85": "This movie should not have been longer than two hours. The scenes in the film are formulaic. There was a repetitiveness between scenes showing Lily Gladstone being sick, DiCaprio giving insulin, and De Niro plotting someone's death. This repetitiveness is what made this film so long. There seemed to be a build up for some kind of turn of events but the audience has already been fed the whole story. There isn't a real climax because by the time the story gets away from its repetitive build up the ending is a total let down. The ending is predictable and not worth the wait it takes to get there.The acting is fine but the characters are not that interesting. Lily Gladstone was about the only character that actually had some personality and she was pretty much bed ridden the whole film. The rest of the characters didn't provide anything to make them standout.The execution of the story is what made this film so weak. It is dialogue heavy with a few action scenes but even with all its dialogue it never feels dramatic or intense. It all ends leaving one feeling indifferent and that defeats the purpose of telling such a story that impacted a whole group of people.This film is highly overrated when you consider its simple story and the entertainment value it provides. It's a small piece of history that is told in the most unemotional way possible. Not a film that I would care to ever revisit. This is not Scorsese's best work and it doesn't deserve such high praise.",
    "86": "Scorsese's done it again. Killers of the Flower Moon is another masterpiece, or close to it. I have next to no complaints. It finds the legendary filmmaker at the top of his game (he's been there since 2013 it seems, with an amazing unbroken streak), telling what might be his bleakest and most emotionally distressing story yet.It was expected that a film about a series of real-life killings committed by greedy people against indigenous people was never going to be easygoing, but it's the execution here that counts. It's constant dread and an exploration of twisted, manipulative, and often downplayed evil (at least in the eyes of the evildoers) that's always in the shadows, and just hidden enough to ensure such violence continues. It disturbs and creeps up on you in ways that are difficult to anticipate or prepare oneself for.It's an exploration of the death by a thousand cuts equivalent of atrocious, systemic murder. Seeing blatant crime against a race or group of people is troubling when it's out in the open, but in depicting it as both blatant and sometimes in a more insidious and calculated way, it makes you think about how many similar cases might've happened that weren't noticed or brought to light - not just in America, but anywhere with indigenous populations. It's here where Killers of the Flower Moon isn't just powerful for the specific story being told (and it is), but for what it suggests on a broader level.It's like Shoah, in that way - the lengthy and soul-crushing Holocaust documentary from 1985 that is as much about the horrifying banality and numbing effect of great, widespread, non-stop evil as it is about laying bare what evils were committed. The pacing and length of Killers of the Flower Moon are essential to conveying these things. Having to spend so much time with this story and these troubling themes makes them all the more impactful.The film's beautifully shot, masterfully edited, and the three leads - Leonardo DiCaprio, Lily Gladstone, and Robert De Niro - are all deserving of awards recognition. Those who thought The Irishman dragged might feel the same here, but I thought it earned just about every minute of its 3.5 hour runtime.Complaints? DiCaprio contorts his face like a bulldog the whole movie - I only noticed at about the 2.5 hour mark, but I couldn't shake the mental image. It's still a great performance, and the character he portays here is unlike any other he's ever played. There is also a sense of creeping familiarity to parts of the final act, but some interesting turns are taken. And then the ending... the final scene and then the very last shot are both brilliant, and helped the film end on a powerful note. That being said, I do expect the final scene to be divisive. Good, I think.",
    "87": "Killers of the Flower Moon is a drag. There is a large absence of tension and drama in the story that really sabotages the pace of the entire film. Zero urgency in the characters motives nor any sense of depth to them. Everyone acts great, (obviously) but even they can't save it from the dull numbing dialogue and lack of story direction.I don't have a problem with long movies. I don't need constant action and mayhem to keep my attention. I loved the Irishman and that was the same running time. But this felt like an eternity to get through. Nothing happens and when something does, it's underwhelming and hazy. The story is repetitive and never truly kicks things off to keep your attention. I felt things weren't explained clearly nor entertaining. It just all felt so bland and hollow. The movie sleepwalks start to finish.Breaks my heart to write this about my hero. He's the best filmmaker working today. I absolutely love the guy and his work has impacted my life tremendously. But this was a painful sit. There are good scenes to be enjoyed but its far and few in between. The biggest positive about this movie is it's the first time I've seen Robert De Niro truly act in the past 20 years.",
    "88": "Just back in from Killers of the Flower Moon.Sad to report that what could have been a taut and thrilling portrait of the evils that men do for money - particularly when it comes to acquiring the money that belongs to people they look down on, is instead a ponderous meditation on wickedness.On the upside, Di Caprio is convincing as the idiotic foil, caught between the schemes of his uncle and a genuine affection for Mollie his Osage wife, and De Niro is always watchable even when he verges on pantomime as the conniving villain, while Lily Gladstone shines as Mollie .The script and even worse, the edit is where my issues lie. It is simply far too long and the large parts of the film proceed at a snails pace.Rather like the portrayal of the Tulsa race riots at the start of the Watchmen TV series, it does shed light on an ugly slice of 20th century American history, but for a film that purports to champion the cause of the Osage people (and perhaps remind Us citizens of the plight of first nation Americans in general) it provides them with no agency at all. Despite their new found riches they are presented as largely passive, often easily duped and in need of saving by the good ol' FBI (though only after receipt of a fat old fee).",
    "89": "Martin Scorsese has produced a lot of all-time great films. Lately he's made overhyped and under-edited time wasters.The history of the willful execution of the Osage people to swindle their oil wealth is an important tale to tell. With incredible actors to tell the tale this should have been a masterpiece. It was with this in mind that I was extremely excited to watch this film.Instead Scorsese's inability to make proper cuts to his films (see The Irishman) makes an otherwise well told story a drag. Good moviemakers know how to compress good books to fit a two to two and a half hour window. He seems to have lost this ability and the result is too many redundant scenes that are repeating the same dialogue.This is especially the case with the constant manipulation between De Niro and DiCaprio, both of whom put in captivating performances even if they are inappropriately cast as characters that are supposed to be decades younger. Multiple scenes between the two could have been removed with only positive results.The ultimate conclusion to this film is predictably clear after about an hour, yet it takes well over two more hours to get there leaving much of the audience exhausted and disinterested by the end. This is such a disappointment and a disservice to this subject that I actually felt anger towards the director instead of the people who perpetrated such atrocities against the Osage people.",
    "90": "I really loved this movie but it simply was way too long. I like long movies, I like slow cinema but there is still the concept of economy or story telling. I wish he would allow himself to \"kill his darlings\" and cut like almost an hour out of this. One of his justifications is that people \"sit and binge tv shows for 4-5 hours\" but it's not at all the same. The form and structure of television and film are completely different, he knows that. It really just feels like self indulgence because he's at the end of his career and nobody is going to tell him no. Self indulgence is the death of a lot of great artist once they find success. Particularly Scorsese, all of his most respected films (maybe with the exception of casino) even if they had a slightly longer run-time were completely trimmed of fat. Every shot, every line has a point in advancing the plot and was very economical. This adaptation felt like it made all the mistakes of adapting from a novel to film. I would absolutely love an edit of this film that is maybe 2 hours long and could easily been done. It would have been more emotionally impactful, interesting and still honored the story and the people it was about. The Osage, which was definitely the most interesting part of the film. But gets swept up in a stale courtroom drama that we've seen a million times and could have been a couple of short scenes.",
    "91": "This is my fifth??? Martin Scorsese movie, so I was expecting to like it since I liked/loved most of his other works. My verdict: yes, I really like this one too. I have to note that the cinema I watched it in had a pretty bad sound system and a few times I couldn't hear characters whispering. So I might rate this even higher on a future rewatch, hopefully on Apple TV soon.Killers of the Flower Moon is based on a book, which is based on a true and forgotten story of the Osage Nation in the 1920s.All the cast members really did great, which is an understatement. This is the first I see of Lily Gladstone, and she's just superb. Leonardo di Caprio, my favorite in this movie, is at the top of his game as well, and Robert de Niro is unsurprisingly amazing too. Despite a three-hour run, the story feels well-paced and doesn't really drag much. The story is also really distressing in some parts as well and this might be his most brutal film yet. I really cannot forget it, some of those scenes are still stuck in my mind and still makes me feel a bit emotional. I also love the minimal use of score, makes things feel more...I dunno...raw?I also love the ending, very creative. I highly recommend for you to watch this.",
    "92": "This is what cinema is all about, a wonderful storyline, with terrific acting, and a stunning visuals.Scorsese has an impressive backlog already, this instantly goes into that list of classics, I was super excited by the announcement and the trailer, I was not disappointed.It isn't an obscure piece of US history, but it's one that isn't often spoken about, it definitely makes you think about events.Lots going on, you have a mystery, you have plenty of manipulation, and there's a little bit of the violence that you'd expect, though it's rather toned down I thought.Visually jaw dropping, it looks sublime, the sets and costumes are incredible, absolutely spot on, and those cars were incredible. A large number of extras make several scenes look pretty epic.It's a long film, I was glad the cinema put an interval break in the middle of it, at no point did it feel slow, it didn't lull, it flowed at a fine pace.The twist at the end had the whole cinema gasping, what an unexpected moment, I can't think of a time where Scorsese has used such a plot device, I did not see that coming.The acting was flawless, everyone played their part, personally I see DiCaprio coming away with a big award for this one, he certainly deserves it.Don't be surprised to see this pick up a number of awards.10/10.",
    "93": "Visually, the movie was well-shot and the setting was great. And I didn't find the movie dull for the 3.5hrs running time, which could have shaved off an hour or so. I guess because it kept shifting tone and angle every half an hour, which could have worked in its favour, you were left hoping it would have some sort of pay off ending or climactic conclusion. Sadly. That doesn't happen.One big issue with this film is the lack of a hero or protagonist you could relate to. The main character, Ernest, was a villain. His wife, who you would have hoped would have taken up the 'heroine' role, was mainly an invalid, victim through the entire movie (after the wedding). We never get to find out more about how the wealth ran through the community, why Hale wanted it for himself, or if he was in league with others, since there were suspicious deaths happening before Molly's family. We never get a sense of where Hale is coming from or even his family, he's just the archetype crime lord, getting others to do his work, and selling them out when they cease to be of use. DiCaprio seemed to be teetering into Sling Blade territory with his characterization. And we know that his character Ernest has a brother Byron, also involved in all this, but you never really see them act like blood relatives. There doesn't seem to be any relationship at all.Then there were those distracting cameos. The worst was Brendan Fraser's outburst in the court room. I almost forgot what movie I was watching, it was that bad. Then we seem him in a scene with a bunch of supposedly powerful men trying to convince Ernest to do the 'right thing', pointing to a greater conspiracy, but then leaving it hanging.The end was terrible, cutting to some radio program that almost destroys the atmosphere of the film that had just preceded it. It felt cheap and trite. And Scorsese's cameo, another distraction, was almost self-serving.So while I am glad this terrible incident in US history has been brought to light through this film, I don't feel it said much or took any stance. A wishy washy effort by Marty.",
    "94": "The story of a conspiratorial plot to kill members of the Osage Nation for their bountiful oil wealth in 1920's Oklahoma is one that was unfamiliar to me until Martin Scorsese decided to make his Killers Of The Flower Moon, a three and a half hour epic that impresses on every technical level and flounders on the thematic and emotional ones. Perhaps it was my neglect in doing the proper research or reading the nonfiction book this is based on that partially led to it feeling cold, detached and disarrayed, but in any case it has not resonated for me the way it has for some. Leonardo DiCaprio is cast jarringly against type as Ernest, a cowardly quasi WWII vet who is pressured by his amoral, Machiavellian uncle King Hale (Robert De Niro) into marrying wealthy Osage woman Mollie (Lily Gladstone) and insinuating his own lineage into the oil rights that get passed along through wedlock. Much of the film is distressing in the sense that we, the audience, know exactly the sort of insidious betrayal that is happening, both at large with everybody in the region and on a more intimate level with Ernest and Mollie. I saw an interview with Scorsese where he seemed excited to tell a story that has all the same scheming, backstabbing and psychopathic double-crossing of his urban crime sagas, but in a far wilder, more rural and spatially wide open locale. He further told of his interest in the story of a woman fatally and unforgivably betrayed by her partner in the worst way, and what that might look like onscreen thematically. Well he seems far more interested in the first part and indeed the overall tapestry of crime, clandestine wrongdoing and often unnecessarily blunt, comedic upheavals in fortune is a well oiled (pun intended) machine here, because that vernacular is solidly within his wheelhouse. It's in that second part, the more intimate picture of a false marriage and unspeakable betrayal that he consistently shies away from exploring in the sort of raw, elemental detail and unflinching eye for emotion that is required here. Only Lily Gladstone, who undeniably gives the film's best performance is really up to the task, imbuing Mollie with a smouldering ancestral rage and elegant, angelic poise that is utterly captivating. But she's marooned in a tempest of misguided choices, missed opportunities to really make this story flare up alive and political clockwork fanfare that clouds over any real chance at true poignancy or catharsis. I've read the backstory of this film and how Scorsese pivoted away from the original plan to tell of the FBI's eventual involvement (they were ultimately, sadly too little too late here) and towards a deliberate focus on the Osage, their plight and identity as a people within this tragic turmoil. Well, he doesn't really achieve that beyond expository newsreel montages, round-table elder discussions and an admittedly impressive eye for costume. There is a scene where senior members of the tribe mention that \"if they could see their enemy, they would kill them\" but they seem to have no idea who is perpetrating these atrocities against them. ...really? From a narrative standpoint it's pretty darn clear and the fact that none of them, Mollie especially, look anywhere close to home in their suspicions simply didn't ring true for me. She is such a well rounded character played beautifully and hauntingly by Gladstone, but the well earned outrage and eventual catastrophic corrosion of her marriage to a man like Ernest, rife with red flags from the outset I might add, is something that Scorsese frustratingly sidesteps, stifles and outright avoids in favour of cold procedural. I can't help but wonder if this story, meant to be told from the perspective of the Osage, may have been better off in other, more edgy and esoteric hands.",
    "95": "The story in itself is interesting , even very interesting. The acting is good as expected , though not on the highest level.At some instances I thought this was a Paul Anderson movie. Some elements from Magnolia came along as well some elements from Zhang Yimou's Curse of the Golden Flower . Though honestly both of those movies are far superiour .The movie is too long and could have been edited to 2 hours .Not only that , the focus it too much on DiCaprio.We also get little insight on how the Osage are reacting on all this mess .I think this is a missed oportunity to tell a story seen from the eyes of the Osage themselves instead of this constant focus on Ernest.Scorcese has made better movies.",
    "96": "Sorry to say that this was far too long for the cinema. I found the Irishman far too long as well, however I was able to watch that at home from day one, which made it a much easier viewing experience, enabling me to take breaks as needed, because of which I was able to really enjoy the Irishman Would have felt the same about this under similar circumstances, but it really is a very tough watch in the cinema. I try to avoid looking at my watch during a movie, but couldn't seem to help myself during this one, on each occasion to see that only a few minutes had past since the last peek. I realise I wasn't helping myself much with that at all.It's not boring, it's just NOT a cinema film. Something only for the comforts of home, where you've got the option to treat it like a mini series. If this was a mini series for TV it would have been fantastic, but as a movie for the cinema it makes for an extremely taxing viewing experience.I must also admit that I started to go down with a nasty cold during the film, which might have affected my feelings towards it, however went in feeling perfectly well, as far as that goes, and came out quite sickly, and so the movie was evidently long enough for something like a cold to take hold!",
    "97": "There's nothing to learn from this movie. Though the world is changing around them, the characters are stagnant and two-dimensional.While Lily Gladstone's character, Mollie Burkhart, gracefully waltzes through her scenes like the rolling plains of Oklahoma, Leo's character, Ernest, is anything but earnest.The movie does come off as an enactment of a true-crime podcast with a predictable outcome.The sets and costumes look authentic, so kudos to whoever did that.I spent most of the movie just waiting for something interesting to happen, but nothing did. There were two scenes in the whole movie that actually moved me: 1) Ernest decides to stand up for something and testifies in court. 2) Mollie meets him in the next scene and confronts him about what he did to her.I guess that is the crux of this movie. \"How far would you go for what you love?\"\nOn a metaphorical note, I think Mollie represents the unblemished and sometimes gullible aspect of the natural world. And Ernest - Well, we're all Ernests (without the a) wrestling with our conscience, but eventually doing what's wrong.",
    "98": "I'll start off by saying that I wanted to be pleasantly surprised by this film and so I never watched any of the lengthier trailers, just the initial teasers.I was somewhat aware of what the plot was about, but what I wasn't prepared for, was just how incredibly dull, overhyped and drawn out this film was.There are several aspects to the storytelling that made this film so atrocious that I considered walking out several times - something I've never done in my entire life.First off, the subject matter is dark, grim and vile. The crimes behind this tale are obviously reprehensible, but also took place over 100 years ago. So retelling them now feels like a reach for Scorsese to tell a story that has a more significant audience in todays world. Absent an entertaining or stylized approach, this was Scorsese's attempt at capturing the dollars behind modern day outrage against the history of America. There is no shortage of that after 2020.What made this film specifically hard to watch is the combination of a dull storyline that emphasizes the crimes but doesn't add any dressing to the story. Any sliver of humor that was there falls flat. The dialogue is so plain and straightforward that even when they retell stories of murder it just comes off as shocking and repulsive in a way that an informative movie that ISNT a documentary shouldn't. If that is the intent, then that begs the question, why was this movie marketed as something more than that? The trailer implies humor, and drama worth telling. Not to simply stoke the anger of Native Americans who's ancestors faced this kind of evil.Overall the old timey music, poor character development, lack of humor, and excessively lengthy runtime made for an INCREDIBLY unenjoyable film. The Irishman might have been the sign that Scorsese is past his good days. If he hung it up after The Departed he would have held his head high, alas with this heaping pile of trash he forgoes that option.",
    "99": "Yes... this is supposedly BASED on true events. Yes, these people were done wrong. But this movie is no different from every other modern piece that has come out in the past decade. The entire premise is skewed around the bianco bad narrative. Every bianco character is skeezy, manipulative, underhanded and/or just plain evil. The other peoples, of course, are all strong, brave, and the very image of greatness. People are individuals, some good, some evil.... this movie does not reflect REAL Truth. It instead portrays truth™ as hollywood sees it.The acting is better described as overacting. The plot is trite. The filming looks like it was done by a film school drop out. The characters are not likable at all. That it takes three and a half hours to tell this 'story' is ridiculous. 90% of the film could have been cut and it would have still been boring.Every word here is MY OPINION. That is the very definition of a review... MY OPINION on what I thought about the movie.",
    "100": "Lost for words to be honest.The story has a lot of potential, tho Scorsese doesn't get the message across.I get the feeling that this is a very American idea of self criticism, just without the actual criticism.You can't just throw some money around for big names in the industry and think this will guarantee succes.This movie is way, way, way, way, way...sorry, I dozed off again, too long to be in theaters. Maybe it was intended, but it feels more like a documentary than a movie.The long stretched shots are extremely boring and painful to watch.Me and my compagnon both fell asleep during this movie.There is little to nothing to stay interested.After what turned out to be 30 minutes of sleep, it turns out I could still pick up where I left. Didn't miss anything to understand the story or where it's headed.I kept waiting and waiting and waiting for something interesting to happen, but it never did. Even the ending isn't interesting.At some point I stopped caring all together, because I just wanted to leave.Don't be fooled by reviews of people praising this movie, there is nothing artistic I've missed, nothing to discover, it's just plain boring and that's that.Could have read the entire book while watching excruciatingly slow paced movie instead.I can definitely appreciate movies with not a lot going on, no bombastic exaggerations and such, but there needs to be at least a tiny bit of entertainment. Or at the very very least, it needs to grab and hold your attention. It's simply didn't have any of that. That's why I think this should be seen as a documentary rather than a film.",
    "101": "Very very very long!Too boring. No catch to hold the attention.Obvious plot. Good actors but even the acting is quite common.Bad movie...too much hype.De Niro looks the same \"mafia\" type.Di Caprio trying to replicate Marlon Brando from Godfather does not succeedThe Indians talking not in English all the time without any translation is complete unnecessary.Even the murders are simple and obvious. There is no mistery, no suspense.Brendan Fraser and John Litgow with small participations that don't cause any impact.The actress that plays Mollie is the only good thing about this terrible movie.",
    "102": "This movie shows you how to spent investors' money profusely without worries since the budget to make this movie seems unlimited.This is a very simple movie, but since there's lot of dough lying around everywhere in the director's bedroom, he smartly found a way to use it at his will. So many unnecessary scenes were added, prolonged, extended. Huge amount of money spent on the settings, the costumes, the make-up. Lot of meaningless dialogues were thrown in to accommodate the unnecessary scenes...There are more despecable details that had added into this supposedly a regular 90 to 120 minutes movie, fully blown up to close to 4 hours long extravaganza, so tiresome and so boring to watch. It felt like you sat on the toilet, trying very hard to poo, but your chronicle constipation simply made it impossible to have a supposedly 5 to 8 minutes dump unlimitedly prolonged to almost 4 hours. That's what I felt when I watched this movie and, finally gave up in the end.You really don't have to make it look like a masterpiece, or trying to make it an Oscar worthy big film. Sadly, this movie actually quite sucks. I was looking forward to watching this film thirstfully, you won't understand how I was disappointed at it.",
    "103": "Let me start out by saying there are some very impressive performances here. As expected Leonardo Di Caprio and Robert DeNiro are terrific, they almost always are. But in truth, the best performance is by Lily Gladstone. She should (and hopefully will) get an Academy Award nomination. The supporting cast is also excellent, it's overall a terrific film to see for acting performances. I had read the book, so I was aware of the plot. It may be a little dificult for some people to follow if you haven't. But I can't get away from the elephant in the room, namely the length (around three and a half hours). Somehow (I'm not sure how since I have prostate issues) I managed to sit through this without taking a bathroom break. I also didn't fall asleep although I did have to catch myself a few times and others in the theater did nod off. It is just wrong to have a running time this long with no intermission. Because I was hearing this might be Scorsese's last film and I personally still prefer to see films in a theater, I saw this at one. At home I could have paused this to take a few breaks. And I wouldn't have had to put up with trying to hold my bladder or having a very sore back from sitting that long in a theater seat without getting up to move around. And let's be honest, there isn't enough going on that the movie couldn't have been cut by an hour or so with some better editing. Scorsese has forgotten the moviegoers and failed to show them the respect they (the people who foot the bill for his movies) deserve by not either doing a better editing job, having an intermission, or what should have been done, doing both.",
    "104": "This film probably is enjoyed by a certain audience and I respect everyone has their tastes but the beauty of a lot of films is that whatever genre, a good film can engage anyone, this is not that.To be honest if I see Leo I do think \"boring long slow film\" but this was endless, the cinema was packed which was great but within 20 minutes about 8 people had left, more followed over the next half hour. It was so slow it felt endless, the acting was unimpressive, the characters were bland and the design and set up where underwhelming.The story is obviously important so no disrespect on any events but this film isn't good. It'll win Oscar's no doubt but nearly every year, Oscar winning films are as painful as having your eyeballs tattood.I'm sure everyone will rave about it but from my experience and the one cinema I was in, close to a quarter left before half way and two separate people caused hysterics as they were loudly snoring, that's the truth, if you love that type of film or story, it's all yours, if your looking for entertainment or a fun night, skip this.It felt about 3 1/2 weeks let alone hours.",
    "105": "This is a fantastic opportunity to work with one of the leading studios and one of the most renown Directors. You will be responsible for editing future and current films to sensible cuts so stories don't drag and create a positive and enjoyable experience for the audience. You must be able to influence the Director!!After watching Killers of the Flower Moon, this was my only thought as I walked out of the cinema! Its obviously a very important story to the American Native people and rightly so this will focus and educated globally (I am from the UK and was not aware of this part of US History).However this overblown, almost unedited version could have easily run at 2 hours and delivered a more impactful message. I appreciate that Scorcese has directed some modern classics, but he needs a new editor that has the ability to stand up to him!Im also not convinced by DiCaprio, there is a line in the film where he says \"he just loves the money\" there was no acting invloved there! He was wooden and at no time did I ever get a sense of the true feelings of his character. Dont get me started on DeNiro, he has the same style in every film nowadays.Yes its shot well and I presume the period look is right (you'd expect it to be for 200mil) but its too long, lacks any likeable characters other than Molly (just about!). The best part by far is the radio show end, which is exactly how this film could have been delivered!!",
    "106": "Killers of the Flower Moon centres around 3 primary characters instead of a single protagonist. They're all interesting but in my opinion, they aren't all layered characters. I gravitated towards Molly Burkhart quickly (this was helped by Lily Gladstone's performance but I'll talk more about that later), she's quiet but strong and takes initiative while others are more content to just suffer through what's ailing the Osage tribe (several things are but a bad case of continual murder and theft are the primary problem). She also tries to see the good in Earnest even when there's so little on display. William Hale is closer, he's playing both sides, pretending to be a friend to the Osage nation yet having his own stake in the game through manipulation and coercion. His true motivations are never in question however and I could have used a little more time with his character's lighter side to perhaps feel some sympathy or understand his side of the story. I wanted to bond with Ernest but his lack of common sense is revealed almost immediately and due to his actions throughout the movie, I never wanted to side with him or was rooting for his success. I think this is all intentional, Flower Moon is a drama and ultimately a tragedy so this always how this story was going to unfold (you also have a duty to tell the story how it actually happened... instead of taking the American Hustle route). But even if that's the intention, you can't blame the audience for refusing to invest in all 3 of the protagonists and instead only empathizing with the one of main characters. This in turn will limit how much I engage with the movie because if the movie is predominantly being led by characters who are unsympathetic scumbags, why should I do anything but root for them to get their just deserts? This is so drawn out in the movie's laborious runtime that it dampened the enjoyment I got from the retribution, but more on that later.Killers of the Flower Moon was hyped up with featuring 3 Oscar calibre performances. I would say Gladstone is worthy of that consideration and De Niro is close. I have to give Lily all the credit in the world, this is the biggest stage with some of the most talented people in their respective fields and she shone the brightest. She was a great casting choice and she fits this part like a glove. I had some problems with William Hale's characterization but De Niro hits all the right notes. He's affable when he needs to be, sinister when it requires and icy cold by the end. Scorsese-De Niro pairings have led to some legendary films and it's obvious to anyone that has seen any of those movies, they're a perfect match and they create special stuff together. I'm probably going to be in the minority here but I think Leonardo DiCaprio is miscast in Killers of the Flower Moon. His character is supposed to be an every man nitwit who is easily manipulated and he just doesn't fit as the yokel type. He's a great actor and I understand why Scorsese cast him but I would have gone another direction. The supporting cast is stacked but my favourite was newcomer Tommy Schultz as flunky Blackie Thompson who's darkly comedic in how blunt his delivery is. Killers needs a little levity here and there and he made me laugh with how resigned his character is to just doing everyone else's dirty work.The trailers for Killers of the Flower Moon should have been advertising it as a Best Picture nominee (we all know it will be) and you expect a lavish production when you're stepping into the theatre. Killers definitely delivers on that front. The sets look fantastic, the attention to detail is great and it helps you absorb the world these people are experiencing. The cinematography is fantastic and the production design is top shelf. You can tell this movie was well funded and they used their giant budget effectively.I was prepared stepping into Killers of the Flower Moon for it to be long but just like previous Scorsese flick The Irishman, even knowing ahead of time might not prepare you for how LONG this movie is. Conversely to the Irishman, this movie had a lot of fat to be trimmed off here. This is a good film but holy cow is there a lot of dead air in Killers. The story is fairly straightforward, there aren't many unexpected twists or turns to accommodate so the scenes of trickery and deceit all meld together. You have to take the movie how it is but I do think there was a more compact version of this movie that would have been more palatable.I wanted to like this movie a lot more than I did and I'm a little disappointed I didn't enjoy it more. This movie will be remembered fondly by most of the critical population and I feel like a killjoy. Killers of the Flower Moon is beautiful and has all the trappings of what should be the premier movie release of the year. But I liked it as opposed to loving it and I do feel like I won't be the only one who feels this way. I'd still recommend checking out Killers if you're intrigued but in terms of quality, I think you can wait for streaming.",
    "107": "My Review- Killers of the Flower Moon\nDirected by Martin Scorsese\nMy Rating. 8/10This movie is the 10th collaboration of Director Martin Scorsese and actor Robert De Niro and the 6th with Leonardo Di Caprio on a feature film and it was obviously a passionate movie project for this incredibly talented trio.With an estimated production budget of $200 million it will need to exceed extremely well at the box office that remains to be seen.Does it deliver ? A resounding yes in my opinion the trouble is it takes far to long for this impressive movie parcel to arrive .At 3 hours and 26 minutes this factual original American Horror Story set one hundred years ago is really a truth telling tale concerning the multiple murders of approximately 62 Osage indigenous land owners in the rich Oklahoma oil fields during the early 1920's .These murders were virtually left uninvestigated until a delegation of Osage Indians travelled to Washington appealing to President Calvin Coolidge for assistance and justice.I know Martin Scorsese is the greatest advocate for Cinema being seen on a cinema screen but I'm certain even his 80 year old bladder would need relief after sitting for nearly three and a half hours .I bet he pressed the pause button in his luxury home cinema when viewing the Final Cut.Truth is I think this would have made a great mini series or would have benefited with some skilled editing or at least some trimming down .Remember when epic movies like Doctor Zhivago or Lawrence of Arabia had an intermission?However as expected the cinematic scope of this movie is impressive as are the performances of DiCaprio as Ernest Burkhart the rather weak but charismatic nephew of William Hale his much smarter incredibly Trump like Uncle played by Robert De Niro and I suspect his Trumpian characterisation was not unintentional.The standout performance for me was from Montana born Lily Gladstone who grew up on a Blackfeet reservation and gives an incredibly understated but incredibly powerful performance as Millie Burkhart .Millie was the indigenous Osage wife of Ernest Burkhart her wealth and family inheritance or headright is a prize that William Hale uses to encourage his nephew to propose marriage.Killers of the Flower Moon is a story of greed and exploitation of the indigenous land owners who by an accident of fate when driven from their original tribal homes in the late 1880's to the dusty plains of Oklahoma literally struck oil.The movie opens in the early 1920's to images of an incredibly affluent and prosperous community where an entire ecosystem of greed and graft quickly arose around the Osage capital of Pawhuska and neighboring Osage city of Fairfax, keeping the money flowing and keeping the white locals including the newcomers in control of it in the guise of Guardianship for each Osage Native American citizen.The White settlers courts legislated if any member of the Osage Nation died, their headright would pass to their legal heir.This person might be their white spouse, who was often conveniently also their guardian. Or the headright might go to a relative or heir whose guardian already had complete control over their accounts - so that the money would effectively go straight to them.No spoilers this information is just meant to set up the scenario of murder that follows.The screenplay co written by Eric Roth and Martin Scorsese is based on a book by David Grann is excellent but far too lengthy and drawn out for one movie sitting.The score is also very effective and composed by Robbie Robertson who sadly passed away a few months ago .I thought Killers of the Flower Moon told an interesting story very effectively with a great cast including Jesse Plemons as the Government investigator Tom White and 2 interesting cameo performances from this years Oscar winner Brendan Fraser who plays the trial Defender and John Lithgow as the trial Prosecutor Peter Leaward.",
    "108": "The Good: Lily Gladstone deserves an Oscar just for sitting through this \"epic\" slog, pouring her all into a thankless role, where she deserved to have way more lines and material to chew on. Deniro was great playing evil to his best ability. The story was great, but the book already explained it better. The costumes, setting, and time period were extremely well done, but that seems to be the gimmick.The Bad: The top investigator and FBI, whose perspective that the book was written, were relegated to the backseat and a Jesse Plemons Columbo is in sleepwalking mode so that the movie can self-indulge into Dicaprio's and Deniro's big egos, Dicaprio overrated as always in this. The Osage victims are done no justice, and what is this expressed as an actual study on? It should've studied deeper into the great Osage people, but they were mere background actors. It's way too long with no rewatch value and not even on a spectacle level like one-watch Oppenheimer. The final ten minutes were an absolute joke and fraudulent.I'll give it a 4/10 just as an investment into future sleeping assistance and for Gladstone's suffering in having to be a part of this mess.4/10.",
    "109": "There are many sermons from the Indians about the importance of preserving their own tribe and how their women should not marry outside their tribe at the beginning third of the of the movie. But, despite the movie being 3,5 hours long, we don't really see why these Indian women fall for the White men. It just happens.I was bored out of my mind in the first 15 minutes. What are the stakes? What is the story? Why should I care about any of these people? And this is really not a TikTok thing either, you really have to get people engaged right away.DiCaprio and De Niro are not used well. There is no chemistry between DiCaprio and Gladstone (which makes their relationship implausible). When Mollie says \"I don't really know if you love me anymore\", I'm just throwing my arms in the air. Are we just supposed to believe any woman should automatically love a character portrayed by DiCaprio, even if it is not elaborated in any way? This DiCaprio does not have any charisma. I just don't believe it. Or maybe her own tribe's men are just absolutely dreadful? Who knows?Scorsese has really crashed and burned in his later years.\"As far as I can remember, I've always wanted to be a gangster.\".Like, okay, I already get the framing for the story right there.With this movie, nuthin'.However, Scorsese's point about the irreconcilable interests of different ethnic groups is of course a bold statement. And very timely. It just deserves a better movie.",
    "110": "Killers Of The Flower Moon was a film that I have been looking forward to seeing for several months now. I have only just started going back to the cinema to watch films, but only really for films that I really want to see. Killers Of The Flower Moon fell into that category.It ticked all the boxes, a Scorcese film starring Dicaprio and De Niro? Yes please. I was, however, massively disappointed. I think the cinematography is pretty good, and the acting was quite good too (especially the always great Dicaprio), but that was about it for me. I'm not one to see a films long run time and be put off by it, in fact there are some great films that over two and a half hours and sometimes even three or more hours.Unlike Oppenheimer, I don't think Killers Of The Flower Moon warranted the three and a half hour runtime, could have easily cut forty-five minutes to an hour. The time wasn't really the reason why I didn't like it however. I just didn't feel like the film ever got going, its sort of the same monotonous pace throughout the entire thing. Ultimately, I don't like it when people say they don't like a film because it was 'boring', because more often than not that just means they didn't understand what was going on. Despite understanding the plot and what was going on, I have to say Killers Of The Flower Moon is pretty bland in truth.All in all, I came away from the cinema feeling quite underwhelmed and disappointed, somehow Scorcese took a really interesting part of history and turned it into a pretty unengaging slog. Overall, its not bad, its just that you expect a bit more from Scorcese given his track record. Overall I'd give it an average score of 6/10.",
    "111": "I know there are lots of fans of Scorsese and I completely understand it, but it's not a reason to think every single movie he does is a masterpiece.Of course I've loved, for example, The King of Comedy, Taxi Driver, The Wolf of Wall Street or The Departed. But a general negative aspect I can tell of Scorsese is the lack of emotion in some of his movies and the tendence to drag the story too much.And this happens in Killers of the Flower moon, a TOTALLY boring, dull, unemotional, uninteresting and contrived plot shown in the screen with mid performances, yes, because I couldn't care less about any of the characters, they didn't have a soul. Deniro was simply awful, DiCaprio hateable, and his wife in the movie was depressing.What happens here is that Scorsese is absolutely big-headed and thinks that every fanboy will love any of his movies whatever he puts on the screen, he might seem untouchable, but his age definitely finished him.He couldn't fill this movie with even a small amount of excitement, and the same happened with The Irishman, he repeats the same thing again and again, just like this or the typical murders of handgun shots at the back (like in his mob films). Scorsese mixed up a lot of uninterest things in a movie that, in my opinion, was an insulting way to bore to death.To add up, the ending seemed like it was just put there to end the damn movie for once, and so this man could appear on screen. It was a stupid dialogue of what happened with the characters that I couldn't care about at all.You know it's trash when u get out of the cinema without rememering any part, not a small dialogue sticks to you and you have a feeling of insult, that the whole producers insulted you.",
    "112": "This is cinema.Killers of the Flower Moon is a harrowing, important masterpiece from one of the greatest filmmakers alive. It's a monumental achievement from the filmmaker who has brought us some of the greatest films in all of cinema - no one will ever do it like Martin Scorsese. This film truly showcases why he is considered one of the greatest directors to ever live! It's impeccable!The film is an epic tragedy that is masterfully crafted. It's dark, devastating, and powerful. The film tells a horrific, yet important story that demands to be seen. It's a tragic rumination on greed and power. It's a murder mystery told from the murderers' point of view, packing a nauseating emotional punch thanks to how brazen its conspirators can be about killing a people they deem beneath them - for financial gain, no less - given how much power and political influence is on their side. Scorsese captures, in riveting detail, the sheer arrogance, stupidity, cruelty, and soul-eating evil of white supremacy. Killers of the Flower Moon makes an unsettling companion piece to The Wolf of Wall Street. The American dream at the expense of the easiest victim. And in this case, the business is genocide. Chilling stuff, and Scorsese wisely tones down any theatrics and goes as stark as possible.I feel like when movies are described as \"educational,\" some people tend to look down on them. It makes a movie sound like a \"chore,\" or suggests that it's more concerned with being used as a \"teaching tool\" than with being a \"work of art.\" But when I say that Killers of the Flower Moon should be mandatory viewing for everyone, I think it's perhaps some of the highest praise I could ever bestow upon a film - especially since it's because of this specific cast and crew's courageous artistic commitment to this story that it simultaneously holds said educational significance.It's already astonishing that the story of the Osage has been swept under the rug by history as long as it has (if sadly unsurprising), and by telling this tragedy at all, Killers of the Flower Moon instantly asserts itself as important. But the way Scorsese tells it - with profound and unspeakably painful power packed into every scene, and a staggering sense of control over the entirety of the scope and scale of this sprawling story throughout - is what makes this telling significant, and, as of now, the definitive telling as well.And by its sincerely surprising ending - an ending that left me speechless, with a massive lump in my throat - it had transcended beyond its biographical drama trappings to become something else entirely. Something far beyond what most films ever dare to dream of becoming: an essential existential enlightening, and a summation of all the love and loss that could ever possibly comprise one life, with an additional reminder of not just the very real evil that infests every inch of this world, but also a reminder of how we can't afford to ever allow anyone to endure it to this extent - or any extent - again.Scorsese's two most prominent on-screen collaborators, Robert De Niro and Leonardo DiCaprio, are finally united in one of his films, lending it infinite star power. However, the real revelation here is Lily Gladstone as the wealthy Osage tribeswoman Mollie Burkhart, who falls in love with DiCaprio's chauffeur character, but soon begins to see her family and culture slowly die in front of her. Gladstone turns in a stunning performance that starts out as sweet and powerfully self-assured - but that aura soon slips away as if the life were gradually being drained from her body, and from her eyes. What Lily Gladstone did in Killers of the Flower Moon is astounding - the subtlety of contained emotions (pain, loss, angst all at once) entirely delivered by mimics of the face, it was remarkable to watch. She steals the movie in a film where both DiCaprio and De Niro deliver excellent, potentially career-best performances.The film is brilliantly compelling, and asks tough questions with integrity. It's also delicately crafted, with excellent cinematography, production design, music, and editing. What especially keeps Killers of the Flower Moon interesting despite its epic length is its breakneck momentum, whether through Scorsese's fluid camera movements, editor Thelma Schoonmaker's propulsive cuts, or an expert combination of the two. The subject matter may be somber, but this is a Scorsese movie through and through, with a litany of minor parts played by instantly recognizable actors (like Brendan Fraser and John Lithgow) and scenes of snappy dialogue that make each bit of planning and plotting feel like something out of Goodfellas. It's disarmingly fun, but it also knows exactly how and when to yank you out of comfortable and familiar modes of movie-watching, with stark reminders of the viciousness and bloodthirst lurking just outside the frame (and often inside it, too).The lengthy runtime has the advantage of making something heavy settle in the pit of your stomach for extended periods, not unlike the last hour of Scorsese's The Irishman, in which learning the details of a secret murder plot becomes stressful and harrowing. Only this time, the plan is visible for almost everyone to see - every white character, at least, and the camera is complicit, too - making it even more dread-inducing. It becomes all the more depressing given the ease with which violence is perpetrated against the Osage, even within the confines of supposedly just systems, which seem unlikely to convict white men of these crimes to begin with.I implore you to give this film a chance in theatres. Let yourself experience the powerful tragedy, all the emotions, and really think about what the movie is saying. Then, once it's done, ask yourself: How long will you be complacent with racism? How long will you go along with something and not speak up?It's one of Scorsese's most brutal films, yet one of his most thoughtful and self-reflexive, as he crafts a subversive murder \"mystery\" that leaves no lingering questions save for one. It's a question that defines the tide of American history: Just how far are people willing to go for greed?There's not a single thing about this film that isn't flawless. I was left stunned and speechless. Urgent, unforgettable filmmaking from the first frame to the last. An astonishing, unsettling film. A cinematic masterpiece that will be studied for years to come.A Martin Scorsese Picture.",
    "113": "I watched this movie hoping I would learn a little bit more about the Native American people - who were there first. But after three and a half hours I know almost nothing more than when I went in. It's a totally wasted opportunity.I also don't care; everyone in the film is awful or passive. No one is doing the right thing and there is no hero, just a weasel.Not a single really cool shot, nothing we haven't seen before. Where is the cinematic edge? It's just lots of big sets with lots of costumes. No cinema.What is new in this film? What is there that hasn't been done before, and the answer is nothing.Yawn.",
    "114": "I'll have to confess that this is my first Martin Scorsese film --- I've heard legends and myths about Taxi Driver, Raging Bull, The Wolf of Wall Street, but never really got the chance to watch them. And therefore it's really hard to describe what makes Killers of the Flower Moon a scrupulous, captivating, and evocative piece of true cinema. Perhaps a particular setting with blinded windows reminds me of Frances Coppola's The Godfather; perhaps the inter-dialogue silence reminds me of the Coen brother's No Country for Old Men; perhaps the occasional dark humor reminds me of Quentin Tarantino's Pulp Fiction; or perhaps the \"made by Scorsese\" label influences my judgment. I could not tell exactly, but the work itself showcases craftsmanship which I have never before seen. Specifically, all the discourses in the movie are presented with incredible precision, whether in terms of cinematography, character layout, script writing, lighting, or plot progression --- the directing is just flawless. Take away the exteriors, the film actually narrates quite a simple story: scammers slash murderous getting exposed. And yet, if we put it into the historical context of Indians versus whites, plus the elements of interracial romance, detective mystery, and humanity, something suddenly clicks.I don't think Leonardo DiCaprio has performed an \"uglier\" role than Ernest Burkhart --- even his Calvin Candie in Django Unchained is bestowed some maniacal comicality. Physically, Ernest is stout, stained-teethed, and always frowning like a wrinkled pumpkin, prompting me to wonder if his actor is seriously the same guy who played Jack in Titanic. What makes Ernest truly loathsome is his character: avaricious, spineless, frequently imprudent, and often foolish. Most disgustingly, he is faithless --- hinted at start by him not attending churches despite being Catholic --- when promised profit and protection Ernest abides by his uncle's game, yet when regret overwhelms after the death of his daughter he immediately chooses to testify against Hale. Ernest represents the banality of evil during the Indian persecution; unlike Hale who masks his guile and malice beneath the complexion, Ernest is simply incompetent. What more could be said about a man who claims to love his wife while feeding her poison daily!Lily Gladstone will most definitely be nominated in the next Oscar for her role as Mollie. Throughout the first act, the lady is demure, well-dressed, graceful, but shrewd, observant, and aloof --- her trait is almost the perfect epitome of the Indian culture. It is for these fascinating qualities that make her schemed fall so tragic, into becoming bereft, fragile, sickened, disheveled, and vomiting one's heart out on the sweat-soaked deathbed. The Native Americans made only one mistake that was fatal in their fight against the intruders: for being too quiet, for being too patient, for being too kind.What an exciting year for cinema! Nolan's got his Oppenheimer, Scorsese with Killers of the Flower Moon, Ridley Scott's upcoming Napolean, and Hayao Miyazaki with The Boy and the Heron. Can't wait to watch their competition at the Oscars.",
    "115": "I really tried to like it but it was all 'show' and no 'go'.This movie was a 'how to' for budding filmmakers, sure, the director is a master, the costume designer did their research, the sets were accurate, the score not bad. But how about a little story telling, character building or intrigue? The technical skills were on show but the story telling was drab and drawn out. It's almost as if in the search for recognition the audience was forgotten. It was cut paste for over 3 hours, a murder, a death, another murder interceded with some culture moments, so on and so forth. I didn't connect with or enjoy any of the characters. None of the men had any redeeming features or personality to speak of. I noticed DeNiro unnecessarily repeating himself a lot, a lot, a lot, a lot it was frustrating; move along. Every moment with DiCaprio or Deniro seemed anxiety riddled or creepy. The movie is dark in a way that wasn't planned I'm sure. The highlight was the female lead but even she was dreary, before she got ill. Was everyone on Prozac? I know this movie is based on a true story but a little poetic/dramatic license is required to entertain....and the winner is....not the movie goer.",
    "116": "Last night I saw Martin Scorsese's new film Killers of the Flower Moon in the movie theater, which is based on true events surrounding the 1920s murders of many members of the Osage Indian tribe in Oklahoma, and is adapted from a book by David Grann, which I read prior to seeing the film.The film is not a cinematic masterpiece like I've heard so many reviewers saying. The massive 3 hour and 30 minute runtime I feel was unnecessary, and the story could've been trimmed down by an hour. There are certain movies that are 3 hours long that do a fantastic job at capturing your attention right from the get go and not letting go, and that are executed well in their story (films like Oppenheimer, The Batman, and Lord of the Rings: Return of the King do this kind of thing perfectly) but Killers of the Flower Moon slogs on in some places and the pacing drags on, to where you're sitting there either falling asleep or wondering when the movie will get to the point it's trying to make. The pacing and the runtime fail in their execution for me.Money is the root of all evil, and that's no exception here in the story. Even though I read the book beforehand, (the book is an absolute page-turner) audiences, even if they haven't read the book are given the information of who is being the murders and who is trying to steal the Osage's massive amount of wealth. It's blantantly obvious and I wish there would've been a better story along the lines of a proper whodunnit. This just seemed like a poorly executed who-didn't-do-it. It gets very confusing at certain points and even I got confused and I had read the book beforehand. And because of that the movie drags on and on and on and doesn't hold your attention the whole time.However, that being said, it IS filled with Oscar worthy performances by Leonardo DeCaprio and Lily Gladstone. Their presence and performances alone are what kept me from almost walking out of the theater. So nuanced and so deeply layered performances, they are the only two bright parts in the whole mess. Robert DeNiro's performance however, is so blatantly obvious, stale, and so generic; it almost seems like he's just a cardboard cutout in the movie for a check.The movie overall certainly wasn't the greatest thing in the world, but it certainly wasn't the worst. I've had better times at the movies this year, especially in a 3 hour movie (Oppenheimer still holds the top spot as the best movie I've seen this year) but even if you enjoy westerns as much as I do, you'd probably be wise to steer clear of this one in general. Besides, it's probably a movie that I would not give a second viewing to.",
    "117": "I'll be perfectly honest and say that even though The Irishman was an incredibly well-made film, being nearly four hours and only available on Netflix really made it a chore to watch. I really like that film, but I wished it was on the big screen with maybe an intermission. With that said, the pacing issues I had with that film made me worried about Martin Scorsese's next film Killers of the Flower Moon. Sitting in a theatre for three and a half hours with no breaks is something I haven't done in many years and it just felt like a daunting task. Well, I'll admit when I'm being ridiculous and I absolutely was. Not only does this film barely feel its length, but I wasn't bored for a second. This is a film that utilizes every minute of its screen time perfectly. Killers of the Flower Moon blew me away and here's why.Based on the true events in the 1920s, Killers of the Flower Moon takes place in Oklahoma, as the Hale family rules the land of the Osage tribe. As members of their tribe begin to be killed off one by one, investigators come to town to get to the bottom of it. Ernest Burkhart (Leonardo DiCaprio), who is the nephew of William Hale (Robert De Niro), marries into the wealthiest family in the Osage tribe. His wife, Mollie Burkhart (Lily Gladstone), happens to be on the receiving end of many of these deaths. For those of you who don't know the true story, I'll just leave it at that but say that the main characters of this film are the true villains of the story. That alone made this a hard watch, but it's so impeccably made that I couldn't look away.Martin Scorsese, in my opinion, has made one of his best films in decades. I haven't loved one of his films quite this much since I experienced Hugo back in 2011. Let me be clear though, this isn't a film that I can say I enjoyed in an entertaining way or anything like that, but I just sat back and appreciated the filmmaking being done, along with this very important, dark story that I wasn't entirely aware of (in terms of the details). It may be a tough pill to swallow for some viewers, but this had me completely engaged from start to finish. In a depressing and dark way, this film defines the word epic.There aren't a lot of people to root for in this story, but Leonardo DiCaprio and Robert De Niro, as always, command every scene they're in. Everyone has also been talking about how incredible Lily Gladstone is and for very good reason, I won't be surprised at all if she gets a lot of awards love in the coming months. Her performance here was simply remarkable. Accenting the performances and beautiful camerawork was also the score by Robbie Robertson. From pulse-pounding moments to intimate moments with hardly any music at all, Robertson's final piece of work (since he passed away after completing this) is wonderful.Killers of the Flower Moon is a three-and-a-half-hour film that never feels its length. Yes, since it's so long, your body may feel it, but again, it was impossible to feel bored. The subject matter being displayed was just too important for me to look away from. This film took me on a journey and I left in awe. It may just be my favourite film of the year so far. I sadly don't think it will find a wide audience, but I implore those who are interested, to please see it in a theatre. I'm very happy that I did. Filmmaking at its finest.",
    "118": "I went into the theater with a lot of the hype I was hearing from critics, however I was disappointed. The story of the Osage nation is tragic, and specifically the family shown in the film. The problem is that in the 3.5 hour duration of the film, you will already know the story, characters and their arc, all within 30-45 minutes. There just wasn't enough that kept my mind engaged for the duration of the film, or me on the edge of my seat. Simply put, it was boring. I checked the clock multiple times to see how much longer was left. I was thinking that maybe towards the end of the film there could be a big payoff for the viewer, but it wasn't like that.A similar type of film set on this landscape like \"There will be blood\" was a true masterpiece compared to this.If you're on the fence about seeing this in theaters, I would recommend waiting for streaming on Apple TV instead.",
    "119": "9/10. Expertly crafted, powerfully acted, brilliantly edited, and filled with hard hitting, dense themes. Martin Scorsese's Killers of the Flower Moon showcases his talents as an auteur, spellbinding filmmaker.This slow burning, epic drama earns its three-and-a-half-hour runtime. Yes, I was quite concerned with the length also. But it's not really a problem and only drags on in a couple of scenes. The length allows Martin Scorsese to take his time and really invest in the story. This is his unflinching view of a horrific, true story about the gruesome murders of the Osage people. It's grim, gritty, and very sad. If you are looking for a fun, lighthearted ride with tons of action, funny one-liners, and a happy ending; then you are looking in the wrong place.Leonardo DiCaprio gives his usual tour-de-force performance. He is my favorite actor, and he scores a huge touchdown with his role. He brings subtle nuances to his conflicted, complex character. Robert De Niro still proves his acting chops for his age. I haven't really heard of or seen Lily Gladstone in anything. Wow, her performance is captivating, amazing, and powerful. Leo and Lily deserve Oscar nominations for their performances.This film is not an easy watch. There are a bunch of themes to digest and chew on for a while. There are many characters and gets a little hard to keep up with all the names. Luckily, the editing is very tight and keeps you invested throughout the long runtime. Martin Scorsese has been making movies for decades and is one of the very few who can pull something like this off.",
    "120": "\"Killers of the Flower Moon\" is a screenplay developed by Martin Scorsese, Eric Roth and David Grann from his book of the same name.This movie is based on shockingly true events that occurred early last century in the good ol' US of A.A series of murders of wealthy First Nations Osage people took place in Osage County, Oklahoma.It all came about in the early 1920s, after big oil deposits were discovered beneath their land.After the Osage people were awarded the rights to the profits made from those deposits, they prepared to receive the wealth to which they were legally entitled and became hugely rich beyond anyones wildest dreams.A complex plot was hatched to eliminate the Osage inheritors on a one-by-one basis by any means possible.White men (Coyotes) married into the these rich Osage families with one intent to get all the oil money for themselves.Officially, the number of victims reached at least twenty, but more could be undocumented.Martin Scorsese read David Grann's book \"Killers of the Flower Moon,\" and knew that he had to make it into a movie.Scorsese spent several hours together with Chief Standing Bear to convince the Osage Nation to help with the filming to tell their story which until today had been largely unknown.Although this film is not the first motion picture about the Osage Murders. \"Tragedies of the Osage Hills\" by James Young Deer was released in 1926, nearly a century ago.Later in 1959, films such as The FBI Story likewise depicted the murders.Watch out for: Lily Gladstone as \"Mollie\" just perfect for this role.Sad Fact: \"Killers of the Flower Moon\" is the last movie of actor Larry Sellers.Of Osage and Cherokee descent, Larry was also an Osage language instructor.Fun Fact: This is the seventh film collaboration between Martin Scorsese and Leonardo DiCaprio.It also marks the eleventh collaboration between Scorsese and Robert De Niro.This is also the fourth time De Niro and DiCaprio have appeared in a film (short or feature length) together.However, this is the first time that Scorsese, De Niro and DiCaprio will have all collaborated together on a feature film.Robbie Robertson's (ex- The Band, Bob Dylans group) wrote his final film score for \"Killers of the Flower Moon\".He died two months before the film's general release and \"Killers of the Flower Moon\" is dedicated to his memory.What helps make this movie so powerful is \"Killers of the Flower Moon\" is the first time that Scorsese, De Niro and DiCaprio have all collaborated together on a feature film.Somehow Leo transforms his face in this movie without prosthetics to look more like a young De Niro.De Niro himself is finally back in fine form after a series of low grade comedies that only propped up his Superannuation and did nothing for his legacy.The wonderful Jesse Plemons only comes into the movie in the third act as a FBI agent, \"Tom White\".Brendan Fraser and John Lithgow have small but solid roles at the backend of \"Killers of the Flower Moon\".There will be many award nominations and wins for \"Killers of the Flower Moon\".Granted it was filmed on $200 million dollar budget making it one of the most expensive biopics ever made in Hollywood, but you can see where every dime has been spent on marquee actors, director, sets, props, costumes etc\nThis is a must see movie, don't let the movies length deter you, because my eyes never left the screen and I never looked at my smart watch or phone once.Grab a ticket for \"Killers of the Flower Moon\" in Gold Class/Lounge whatever, get real comfy order lots of food and drink and enjoy this faultless movie that's not so much a whodunit, but a who-didn't-do-it.\"Killers of the Flower Moon\" is the \"Citizen Kane\" for this century.",
    "121": "What surprises me most is the very high score this movie received. Because at the moment of writing, it scores 8.0 stars on IMDb. And with almost 100k people having voted, this is a very high score. So if you use IMDb scores as a guideline for determining what movies or shows to watch, it is a no-brainer to decide to watch this movie...I decided to read some reviews from the people that watched it. And I also decided to calculate the average score of what those reviewers gave. And surprisingly, these people seem to agree on a way lower score. If I for instance take the top-10 reviews, they seem to give an average score of 6.1. And the top-20 seems to agree on a similar average score of 6.2 stars. A score that I think is also way more true to reality...And why I do agree with them, is not too difficult. For one, it is the plot that is very thin and predictable for a movie with almost 3.5 hours in duration. So thin that I lost interest in quite a lot of moments during the long sit. And that is despite all the famous actors you see.I even think that if all famous actors would be replaced by more unknown ones, this movie would go in the history books as an irrelevant production. So yes, I think it is unfair that this movie gets a rating similar to productions like 'Kill Bill', 'Groundhog Day', 'Jurassic Park', 'Finding Nemo' or 'Bridge on the River Kwai'. Because those iconic movies are easy to recall many years after I watched them. And 'Killer of the Flower Moon' neither fits this category, nor will I remember it in a few years time...So with an estimated budget of 200 million USD (!), I think the viewer does not get something that is worth such a huge budget. A budget that seems to have been spent on a lot of famous actors. Because for sure there is no lack of high-grossing actors. Even the smallest of role - like e.g. A lawyer that you see only a few minutes - is taken by actors that by themselves can carry the main role of any other movie.",
    "122": "British Reviewer.Wow, what a surprise. I'm not someone who leaves early: nights out, books, football matches, trips to the cinema. I'll always (99.9% of the time) stick it out. I sat through the whole of Enys Men, I've read The Illyad. And yet, with two hours yet to play out I walked out of KotFM.The DP has done an adequate job, nothing too flashy. The score was forgetful, the editing adequate. For me, personally, the casting was what let the film down: Leonardo DiCaprio cannot play an unintelligent character, his whole visage evokes cunning and cleverness and as a consequence the character he was portraying lost all of its cruel naiveté. Desirous was on form and perfectly cast as an aged sinister antagonist.From a narratorial perspective KotFM was just incredibly boring and I don't use that word lightly. I checked my watch several times in the 90 minutes I did sit through. It is painfully slow and it's not cohesive. Scorcese's ego is too big and the producers/studio didn't have the bollox to advise him that he needed to tighten it up; lose 60 minutes at the least!Finally, the politics. White guilt is a very peculiar cultural exportation by America. I surmise this MUST be because the American military industrial complex is doing, right now, the travesties it portrays to other indigenous populations. No, this type of allegory does not forgive the sins of your modern day atrocities. By remonstrating and flagulating, rightfully, the atrocities of the past don't buy into the propaganda of how America wants to export itself morally to the rest of the world.With great power comes great responsibility and as an Englishman don't I just know it.",
    "123": "As a whole i can still easily say that Killers Of The Flower Moon was a Masterpiece, for 2 hours and 30 minutes the movie kept me intrigued and stuck to the movie the whole time, and while the last hour of the movie dragged a little bit with scene that i don't find boring but more of like fills with sequences that i feel we have enough but never i wanted the movie to be like that's it please end it now, Scorsese's was again in his top of his game at freakin 80 years old, what i see in Killers Of The Flower Moon was some of the best movie directing i've seen from the editing, cinematography, and the best thing was the performances, it's really some of the greatest movie performances i've seen, all cast and even De Niro i believe could have his Oscar nomination in a while for this movie, Screenplay, and definitely Best Picture, it is also one of the best true story ever adapted to a movie, Killers Of The Flower Moon felt absolutely complete, once you in the story you can't think about anything else and that's how i feel throughout the film, it is incredible, it's a movie and a true story that i wish have the same amount of interest as Christopher Nolan's Oppenheimer, and i can tell personally that Killers Of The Flower Moon was a better movie than Oppenheimer, all praise for the film and although i wish to give it a perfect score again there is a moment that i wish the movie stops so it can be perfect but the last hour was filled by couple or more scene that i think we have enough, there is not a lot of real cinema film that came out in theaters for a long time and if you looking for one this movie was the one, overall Killers Of The Flower Moon was another Masterpiece from the master of cinema himself Martin Scorsese, and it's quite an experience, epic in a way, one of the best films of the year simply.",
    "124": "Killers of the Flower Moon finds Martin Scorsese finally making a Western on his own terms. A sweeping tale of greed, sin and violence that depicts a true story with the sensitivity it deserves. It makes sure to emphasise this wasn't a one off event in American history and ends on a poignant note that turns its attention to the audience directly.Leonardo DiCaprio is the lead here and his performance here is up there with his best roles. Ernest is a conflicted yet clueless person, he clearly loves Mollie but is by no means innocent when it comes to the crimes being committed. People undermine him throughout by calling him boy and it's clear that's because of his lack of control more than his actual age.It's a clever inversion for Robert De Niro to play a character with so much power following his previous Scorsese collaboration as a foot soldier with no self awareness. King Hale is duplicitous to the very end, appearing as an ally to the Osage people whilst plotting to take everything from them. The real terror of his performance is the fear he instils in others is never seen, he appears kind throughout.Lily Gladstone is phenomenal and the main reason for any of this working. Taking the perspective away from the FBI was a brave choice that only works because of how raw her performance is. The pain, the happiness and the strength all feel incredibly real and any scene without her lacks that presence (in ways it's meant to).Martin Scorsese's direction is faultless, he remains a master of the craft. It has urgency from its opening frames, uses that gargantuan run time to show a real odyssey and utilises the huge budget to fill every scene with detail. Thelma Schoonmaker's editing is masterful. It definitely doesn't feel its length and there's such a natural rhythm to the scenes.",
    "125": "Great film. Not sure how I want to describe it after that. It's a brutal story, but Scorsese doesn't dwell on the brutality side - he focuses on how the brutality affects the characters. In particular, It focuses on Lily Gladstone and how she deals as her family is slowly killed off. There really isn't any gore or gruesomeness in the film. The worst scenes have been in the previews so if you've seen the previews, that's what you will see in the film.This is pretty much a Gladstone movie: she is not a supporting player by any means. DiCaprio is good as the catalyst to keep the story action moving. He's used as the pawn in DeNiro's clever game to get the oil fields from the Indians. His makeup is subtle but convey his sliminess. DeNiro, when he does drama like this, always does a tremendous job in the role: it's a \"Trumpian\" type role when he manipulates you to do the job, then he makes sure you're the fall-guy for the issue. It's a well made film that tells a fascinating story. All technicals are top rate.The only issue I had was with the ending: not a bad thing/not a good thing -> just something I wasn't expecting and i'm not going to tell you what it was - only that I had never seen that type of resolution before and, in hindsight, it was a pretty nifty way to wrap the story.Can't wait to see it again when it comes to AppleTV.",
    "126": "I've read some good reviews about the movie and DiCaprios acting and maybe went into it with high expectations (western are my favroite). I was really disappointed.The movie felt like a eternity. I was checking my watch all few minutes and noticed doing other viewers doing the same. It's way too long, the story could've been told in 1,5 - 2 hours. The dialogs were boring and repetitive and every scene was drawn out.Overall very predicabtle, because it was told from the perspective of Burkhard. There was no mistery.It's such a good, heartbreaking story, which should've been told from a different perspective.Sometimes scenes felt comical/humorous, which didn't fit at all.It was hard to take the movie seriously.I was hoping for so much more.The best part for me was Lily Gladstone, her acting was great.",
    "127": "Nothing in this film could hook me. Killers of the flower moon is a film that tries so hard to be ambitious, and complex, and tell a large-story, without ever caring to be interesting. It tries so hard to be real that it forgets to be interesting. This is my main problem.Things just happen. People just talk. Camera stands still. No facial expressions. No cries, No laughs, not any emotions are in sight. This is simply plain boring cinema. DO SOMETHING! Move, cut, show emotions, be alive, make your characters and your world feel alive, the camera should be it's own character but it's not. And all of the things I mentioned were very well made by Martin Scorsese in the past. He lost his touch as a director, he lost what made him great. His characters were interesting and all different, in Killers, all feel the same. They're not interesting enough.My main problem is that it is almost like a documentary. But it's not the job of a film to tell a historical story accurate, it's the job to do it as accurate as it can be in an interesting matter. This is cinema. Give your own spin into it.I could've listened to a podcast and it would've been the same. Compare this to Nolan's Magnificent Cinematic Oppenheimer and it ultimately falls down the elevator into ground zero, while Oppenheimer is at ground 10. In other words, it's a piece of non-interesting information clustered together in an even more uninteresting context.It does not work. It is old-fashioned cinema. The kind of cinema that I believe, we do not need anymore. We need a new wave of artists, that tell more twisted and complex stories that dare to say something bold or critical, without simply just showing what once was. These times are over and have no huge effect on a viewer anymore, me especially. Give your own twist into the plot.",
    "128": "Oh boy, what a letdown this overlong borefest was.Seminal movie maker Martin Scorcese's latest 'epic' follows in a long line of recent big league directorial duds (Scott's Napoleon, Fincher's The Killer, Nolan's Oppenheimer, Andersons Asteroid City) that make me wonder if ANYONE is capable of making a great movie anymore since the pandemic changed everything for the worse (you know, legit classics like The Shape of Water, The Revenant, American Sniper or No Country for Old Men for example).On the plus side the cinematography, fabulous mood music and scene stealing perfromances from De Niro and Brendan Fraser deliver the goods. However Di Caprio's lead character (somewhat channeling Brando in The Godfather) annoys while the supporting cast fails to add any weight or emotion to the 3 and a half hour slog. The ending (featuring a director's cameo) is also a cop out likely tagged on to cut down on the already longggg runtime.The pacing of the piece is super slow, there is a distinct lack of surprise, excitement or indeed revelation while the talky delivery is mostly deadpan and emotionless throughout. There is simply nothing here to draw the viewer into the story or the characters over such a long, drawn out duration. In fact some aspects border on parody (like the bizarre masons scene and the enormous amount of funny hats on show).In summation, from the trailer I was expecting another Wolf of Wall Street or Gangs of New York from the American master but this rates as one of his worst in years. So disappointing.I would advise watching it with remote in hand to fast forward, otherwise you might not make it through, like many of the featured Osage in the film. A definite strike out i'm sorry to say.",
    "129": "First of all, let's clear the normal praises:\nScorsese is a legendary director telling a story that's often forgotten and certainly needed to be told. The movie is beautifully shot and has great acting and a great soundtrack, to boot. This is all true. Now put aside the critics who feel Scorsese can do no wrong, because that's where the praise really ends.First of all, this is the movie that will be the last straw for run time. I will be checking future movies before attending because honestly, three and a half hours? Why? Does he not expect viewers to have bladders? I mean Jesus, even a 3 act play has two intermissions.This movie is not what you'd expect from a Scorsese film. If you're expecting a period western in the typical Goodfellas/Casino/Wolf of Wall Street/Departed/etc. Level of quality, think again - this movie is DULL. It's paced so horribly and there's no mystery, no tension, no suspense, nothing. This movie is molasses slow, and needlessly so. After the two hour mark, I spent the last hour and a half or so trying to decide if I should just leave.If you're thinking about going to the movies to see this, seriously check that thought. Watch it at home instead, where it can be paused. Or, if you hate slow movies, just avoid it entirely. Catch it when you can stream it in pieces, or at least not at the cost of a movie ticket.",
    "130": "This movie held my attention for its entire 3.5 hours. That said, however, I would not go to see it in a movie theater again, whereas I have seen Oppenheimer three times in theaters and been spell-bound all three times.The good in this movie, for me, was the sometimes striking cinematography, and the performance by Lily Gladstone in the female lead. I found both di Caprio and de Niro's performances more like caricature than drama, and that sometimes grated on me.There were things I didn't like as well, however.First, for a movie that is supposed to provide understanding for the Osage, and Native Americans in general, I was bothered that by far the majority of the screen time was devoted to the underhanded machinations of the Anglos. It would have seemed a lot fairer, and more interesting, to me to have had regular extended scenes with the Osage talking among themselves. The plotting of the Anglos to get their money was all pretty obvious and could therefore have been considerably condensed to make room for more scenes with the Osage. Yes, that would have reduced the roles of the two big draws, di Caprio and de Nero, but they could still have been listed as the leads.Second, I really hated the trivialization caused near the end with the switch to the G-Men radio show to present what happened to the characters. I don't know if that show was as hokey as it is in this movie, but the shift from drama to that was jarring and distancing.Finally, while some of the scenes with Osage dialog are subtitled in English, not all are. It was aggravating not to know what the characters were saying.But again, the movie did hold me. And certainly the story is an important one that deserves to be told - though the comparison to the 1921 Tulsa massacre of the Black Greenwood district was stretching things. I suspect a Ken Burns documentary would satisfy me more than this fictionalized telling.",
    "131": "Killers of the Flower Moon is a new historical crime drama directed, written and produced in part by Martin Scorsese, director of Goodfellas and Taxi Driver.When oil is discovered in Osage land in Oklahoma in the 1920s, their people receive the oil rights. William Hale (Robert De Niro) tries to help and advise the Osage tribe with their rich find. For example, he tries to involve his nephew Ernest Burkhart (Leonardo DiCaprio). Through this, Ernest meets Mollie (Lily Gladstone) of the Osage tribe and they fall in love and get married together.When more and more people from the Osage tribe are murdered, the fledgling FBI comes in to investigate the murders. This investigation is led by Tom White (Jesse Plemons), who believes he has discovered a suspicious link.This film is based on the book of the same name by writer David Grann. After Martin Scorsese read this book, he wanted to adapt it into a film. To do this, he had hours of consultation with Chief Standing Bear of the Osage tribe to help him make this film. In this way, he tries to incorporate the history and cultures of the Osage tribe into his film in the right, respectful ways. This film can come across as a historical documentary about the Osage tribe. Martin Scorsese, together with the other screenwriter Eric Roth, manage to convey the story in such an interesting way. The film tells a story about true history that deserves to be discussed more publicly, so that it is not forgotten by future generations.Together with photography director Rodrigo Priesto, he also conveys the film in an appropriate, respectful manner. It almost seems as if they take you as a viewer into history in a time machine, to let you experience the story surrounding the Osage murders for yourself.In addition to consulting with Chief Standing Bear to film the story of the Osage tribe, Scorsese also receives help from the Osage tribe, who also play roles in the film. Actress Lily Gladstone also comes from a similar background. In this way she knows how to provide credible and appropriate acting. She acts well, even without using many words and only showing what is going through her character's mind with facial expressions. Leonardo DiCaprio also provides suitable acting, as a character who seems to be between two different worlds. In this way he tries to remain faithful to his uncle, but later also to his wife. The two are sometimes just the opposite of each other, so he has to find a way to keep both sides balanced. Robert De Niro actually plays more of a wolf in sheep's clothing in this film. He tries to appear as a friend of the Osage tribe, but secretly also tries to obtain the oil rights of their people.",
    "132": "When Martin Scorsese comes up with a movie, you immediately know it just has to be okay. Especially if the cast also appears on the casting list with names like Leonardo DiCaprio, Robert de Niro, Brendan Fraser and so on. The names are not strange names in Scorsese movies. Of course, DiCaprio has already starred in The Wolf of Wall Street and De Niro in The Irishman. This time Scorsese does take a lot of time to tell his story, because the film lasts almost three and a half hours, so you have to schedule the film just as well if you want to visit it in the cinema and you also have to have a good piece of sitting meat. Incidentally, Scorsese's The Irishman also took almost three and a half hours, so it turns out to be a bit of a habit for the quirky director. Incidentally, this is not the first film about the Osage murders, there was already the film Tragedies of the Osage Hills in 1926 and later films such as The FBI Story (1959) also portrayed the murders.Of course you can leave these kinds of jobs to Scorsese. The story is about a gruesome piece of American history, where the Osage- tribe was driven out by the white settlers at the beginning of the last century and managed to become the richest story people on earth in northern Oklahoma because they found oil in the soil where the tribe lived. As the greedy white settlers see this with great jealousy and do everything they can to be able to put their hands on the money of the Osage- tribe. The seemingly sympathetic William Hale, who is also called King, is at the helm to make the nefate plans. The role of William Hale is played by Robert de Niro and it must be said that it was really a long time ago that we saw the Niro play so terribly well in a movie. When his nephew Ernest Burkhart, played by Leonardo DiCaprio, comes into the picture and drive around the rocky Mollie of the Osage- tribe for a while, it seems at first that the two fall madly in love with each other, but in the meantime nefarious plans are being forged. The first hour is therefore more like a love story, in which things are deepened and little actually happens. Still, you soon find out that Ernest turns out to be a real grease pipe, who doesn't turn his hands to rob the graves of the murdered Osage- tribe, rob the living and eventually gives the orders in the name of William Hale, to get people out of the way.The second act delve deeper into the crimes committed and the poisoning of Mollie, who leads to diabetes and slowly but surely dwells with her insulin and looks death in the eye. The murders that are committed are really like Scorsese can only portray that, rough, disturbing and realistic. Still, it can be concluded that the film with its monstrous length of three hours and twenty-six minutes really lasts way too long. If the film had been shortened by about 45 minutes to an hour, the film would have been more accessible and really achieved its goal. Now sometimes you really have to struggle through the film, where you also have to be careful not to lose the thread. The third act of the film is the most interesting. When the FBI gets air of the matter and comes to take note of it. This is a brilliant role played by Jesse Plemons, led by agent Tom White. In the end it comes to a lawsuit and, well, you have to look at the rest yourself. The ending is really surprising and will also receive you with a strange look, not the denouement itself, but how it is told and translated to the screen.Killers of the Flower Moon is dominated by grandmasters Robert de Niro and Leonardo DiCaprio. Yet they also do not know how to prevent the film with its monstrous three hours and twenty-six minutes sometimes becoming a really tough long-winded seat. It turns out to be a real test case for your sitting meat. It definitely doesn't get bad, but sometimes it's just difficult to keep your attention. Anyway, Scorsese almost never disappoints and he absolutely doesn't do that here. It is a gruesome piece of American history about greed, cunning and deceit. Don't expect an action movie or a smooth movie, no, Killers of the Flower Moon is a dormant project, which may not overflow from the action, but slowly works towards a climax as actually only Scorsese can. That the film is going to compete for Oscars seems to be a certainty, but with Oppenheimer and the upcoming Napoleon in his wake it becomes a true battle of the titans. Anyway, Killers of the Flower Moon will be one of the best films of 2023 anyway, and certainly end up in the top 5, but it won't be a movie that I'll watch for a second time soon. The film is just a bit too tough for that.",
    "133": "I have sat through my fair share of long movies, and slow movies too. I don't mind an arty film or a gritty reality. This however, was endless.3.5 hours of my life taken by the promise of another Scorsese masterpiece, which this absolutely is not.Clearly no one thought to edit this movie at all, they just left everything in.Even the great soundtrack can't redeem hours of endless drudgery with no real direction.The odd gunshot or explosion is overwhelmingly loud in contrast to the downbeat never-ending dialogue. Almost as it they know you need waking up every so often.They don't even try to build the characters or see them develop in any way. You feel almost no connection to your them, not sure if any are villains or heroes or just there for the sake of it.Tropes are plentiful both of white and non white characters and the Klan seems to be there for no reason at all, other than to make an appearance? But none of this seems to serve any real purpose.By the time the plot starts to move at all, if you would call it that, you are already desperate for it to end. The last 90 mins, which could easily have been 45/60 mins were vaguely intriguing.",
    "134": "Someone has to say it so it might as well be me, this movie is boring, very boring, I would rather do my tax-returns whilst listening to a politicians' debate than endure it again. I left the movie theatre after two and half-hours and should have done it sooner. Why?1 You don't get to identify with any of the characters or really grasp why each character is doing what they are doing. The characters just don't develop in the movie, they just interact with each other and more characters are added into the mix to distract from this.2 I love the actors and director individually, but you get the sense they are all in the equivalent of one of those old British phone boxes trying to move around - and there isn't room. They are simply too big for the little they have to work with. It's like you have three famous chefs and you give them a can of beans, a potato and a stick of celery and say 'Right, your all good at what you do, make me a great meal'.3 Historically this is very selective with the truth and facts and let's leave it there or this review would go on for pages. What can be said is that the Osage are in many ways their own worst enemy, but leaving that aside that they currently own, amongst many other assets, seven casinos which turnover hundreds of millions of dollars per annum. So if they were ever exploited, the shoe is on the other foot now.4 With such a high IMDB rating most people will go and see this and ignore low ratings like myself, but when that little voice in your head says 'God, this is boring...' then get up and go and cut your losses, because it will only get worse.",
    "135": "Immediately after finishing this very dragged out movie, I was thinking about giving it a low rating since the conclusion wasn't that well done, and the story just felt plain boring and veryyyyy dragged out. The fact that I didn't fall asleep watching it, is astounding. No movie needs to be 3 and a half hours. NO movie. (Except the very rare few that manages to keep your interest throughout the entire long duration), but this one just felt... I don't even know.First of all, let me get this out of the way, the actors were incredible. Leonardo DiCaprio as always did an amazing job in his role, this man can not miss, and Lily Gladstone was very surprising too. Robert DeNiro and so on. The cast wasn't where the movie went wrong, far from it. The plot and pace just felt so drawn out which led to it being exhausting just halfway into the movie. Now, what I will give it is, it was gritty and realistic i guess the word to describe it is. And we all know Martin Scorsese loves making these gritty and real movies. In fact, one of my top 10-20 favorite movies were from him. \"Goodfellas\". But \"Killers of the Flower Moon\" just wasn't it. Now, I will play Devil's Advocate and say that since it was based on a true story, it's probably hard to actually make a it exciting but it definitely has been done before so why not this one? My conclusion is, this was just... meh.",
    "136": "At 80 years of age, I'm sure I'm not alone in being thankful that legendary director Martin Scorsese is still defining age and not only making feature films but making feature films still right up there as some of the best on offer, as his mostly impeccable post 2000's filmography continues to enhance his reputation as one of the all-time greats.His first film since his somewhat divisive Netflix mob epic The Irishman from 2019, Scorsese has once again returned to numb-bum territory with his 206 minute adaptation of author David Grann's novel Killers of the Flower Moon, an adaptation that sees the bespectacled master collaborating with his old faithful team of Robert De Niro and Leonardo DiCaprio to gift us a meticulously made drama that thanks to its distributor Apple has arrived at a time when many films of this calibre have jumped shipped to 2024 release dates.In the times since The Irishman's arrival in 2019, Scorsese has been making headlines talking about the effects of Marvel films on the artistry of the film-making medium and more recently doubling down on his insistence that in an age where many individuals and family units spend most of their nights binging streaming services (and their phone screens), long running times for films aren't that big of a deal but despite all his passion and many valid points it's sad too say that Moon doesn't always earn its epic runtime as Scorsese's film is one you can always appreciate on an artistic level but one that remains mostly emotionally cold and devoid of spark across its repetitive and sometimes unfocused journey.Differing from Grann's book in a sense that for the majority of its proceedings examining the terrible murders afflicting the Osage Nation in Oklahoma in the early 1920's it points the lens squarely on the relationship and dealings of Leonardo DiCaprio and Lily Gladstone's couple Ernest and Mollie Burkhart and Ernest's uncle William Hale (played with some grizzled glee by De Niro) rather than on the FBI's eventual involvement in what was happening in the state, with Jesse Plemon's Tom White and co only coming on board in the films later stages, Moon takes a respectful approach to the true life tale at the heart of its narrative but in doing so Scorsese forgot to make his film justify its runtime or give us an emotional core that would've been the magic ingredient this labour of love craves.Strangely much has been made about the film belonging to Gladstone's Mollie and how she is the true star of the show here but the actress who has previously been best known for independent films such as Certain Woman and First Cow doesn't really ever get too do to much here other than look sweaty and remain po-faced throughout as DiCaprio chews the scenery (and his lips) and becomes the real focus of Scorsese's gaze as the hard to read and often dimwitted Ernest, who battles insulin injections as some of the films most frequent attention grabbers.It's a typically solid performance from DiCaprio and witnessing him play off the likes of De Niro and in small moments Plemons and even a Brandan Fraser cameo is solidly entertaining but for such a dialogue heavy film there's nothing spectacular about the ensemble in Scorsese's film or in the beating heart stakes, with the relationship between Mollie and Ernest never one that takes hold the way in which one might've hoped for.With all this to consider the true star of Scorsese's at times dragging affair is the production values and stunning work of his creative team that includes memorable work by his DOP Rodrigo Prieto, with Moon one of the best looking and alive feeling films of the year, helping it overcome a sometimes intrusive and distracting score by the late Robbie Robertson and a poorly structured sound design that at times does a disservice to a film that wants its words to do much of the work.There's undeniable moments of magic in Moon (a fire on a farmstead or an opening segment at a train station come to mind) and when Scorsese finds his groove he's almost unmatched by any current or past director but for all the moments in his latest offering there's too many misses and mismanaged components for this to be regarded as one of his best works.Final Say -A film that tries desperately to be special and sometimes reaches that tagline, Killers of the Flower Moon is far from a misfire but there's an emotional coldness to Scorsese's pretty but overlong and repetitive epic that misses its chance to gift us the quintessential telling of a true life tale that should've made for a far more gripping and impactful feature, the type of feature that it clearly was aiming to be.3 1/2 paddlings out of 5.Jordan and Eddie (The Movie Guys)",
    "137": "Killers of the Flower Moon is directed and produced by Martin Scorsese, who co-wrote the screenplay with Eric Roth, which is based on the 2017 book of the same name by David Grann. The direction is truly top notch, Martin Scorsese directed a cinematic masterpiece with just the right length. Scorsese was extremely passionate regarding the source material, the true events, and of course the Osage Nation. Even spending several hours together with Chief Standing Bear to convince the Osage Nation to help with the filming. You see the attention to detail and passion in the screenplay, also in the direction and visual storytelling. The first drafts of Killers of the Flower Moon had it following the book, then the focus shifted on the Osage Nation and the native americans. You could say the first hour of the film feel like a different movie than the rest, because of how they're building the plot and characters, and giving the Osage people more screen time made this a much deeper story as we feel what they're going through and Scorsese interrupts the script perfectly and tells this story in a magnificent way. The film looks absolutely stunning and the camera angles which Scorsese used are so important for its dialogue scenes and others. The mise-en-scene is absolutely perfect, Martin Scorsese sets up a scene brilliantly, each scene and frame ends up looking beautiful and spectacular. Rodrigo Prieto served as the cinematographer for the film (whom worked on Wolf of Wall Street, Silence and The Irishman prior to this), and the cinematography is just stunning, what a beautiful looking film and s great cooperation between these two filmmakers. Thelma Schoonmaker's editing was truly perfect, along with Martin Scorsese, these two made a 3.5 hour film feel like a 2.5 hour film. The pacing was great, not too slow and not too fast, a nice pacing for an epic drama western.When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one - until the FBI steps in to unravel the mystery.Leonardo DiCaprio, Robert De Niro, and Lily Gladstone lead an ensemble cast that includes Jesse Plemons, Tantoo Cardinal, John Lithgow, Brendan Fraser, Cara Jade Myers and JaNae Collins. About the acting, Leonardo DiCaprio is absolutely perfect in the role and so is Lily Gladstone. DiCaprio transforms himself into Ernest Burkhart, a different accent to different mannerisms, that might be one of his best performances yet. Getting multiple scenes throughout the 3.5 hour runtime to show off his acting, from monologues to other scenes. He also got to share a lot of scenes with Lily Gladstone who portrays Mollie Burkhart, Ernest's Native American wife. Her performance has so much emotion and is the character who gets the trademark voiceover lines, which are a small part of the film yet important. Like DiCaprio, it's an award-worthy performance. Robert De Niro is great but not as great as he used to or could be, the accent is far from perfect but worked for me yet my friend criticized that. Maybe it's him growing older or all the incoming projects, who knows, it could have been greater but I'm happy with what we got. Robert De Niro does a fantastic job with bringing the real life figure William King Hale to the screen, it's a three dimensional character and De Niro is a huge part of making this evil man three dimensional when it could have been easy to show one of his layers, the pure evil side.Killers of the Flower Moon captures the time period, the Osage Nation, and every other detail perfectly. The locations used and sets that were built, makes for such a great experience for us viewers as it feels real. The production design and value of overall production were truly superb, so was the art direction. It was the final collaboration between Scorsese and his musical partner, Robbie Robertson who died back in August. His musical score fits the film perfectly, just wish there was more of it. It's bluesy and percussive, also quite old timey.David Rooney of The Hollywood Reporter commented on the length, \"The three-and-a-half-hour running time is fully justified in an escalating tragedy that never loosens its grip\" and praised the screenplay, direction, cinematography, score, and cast performances (particularly that of Lily Gladstone). That summarizes it perfectly. This was my first experience with a Martin Scorsese film at the cinema and it was an unforgettable experience, a film without flaws (possibly too long for some but you can easily watch it in two parts at home if you wish so). It's nice to see Martin Scorsese so passionate about a project, which he was for Silence and The Irishman. What a beautiful looking movie, but what a depressing story told brilliantly by Martin Scorsese.",
    "138": "Killers Of The Flower Moon is wonderful. Martin Scorsese's output recently has been terrific and he is on fine form here as well, showcasing his ability to take his time with the story while racking up the suspense to a neat finale.Seeing Robert De Niro & Leonardo DiCaprio share a screen is great and they are given many scenes together and ignite the screen with their chemistry. De Niro has a much bigger role than i expected and it will be funny seeing him up for Supporting Actor when he has more screen time than most lead actors will have this year.Just as the film is starting to feel it's length, Jesse Plemons appears and breathes new life into it. Plemons is a great actor and deserves the best roles possible, as a character actor he may be the best around since Philip Seymour Hoffman.The storytelling is sensational and Scorsese handles the violence in his typical strong way. Likewise, typical Scorsese, the score for the film is spectacular and Robbie Robertson deserves a lot of praise for the success of the film as the music is vital to the piece.Lily Gladstone is new to me and she is wonderful here as Mollie Burkhart. Gladstone has the hardest job here managing to convey so many emotions throughout the film. An Oscar Nomination could well be in her future and she would be fully deserving.Killers Of The Flower Moon is a triumph and continues to show that Martin Scorsese is one of the greatest film directors of all time.",
    "139": "It's like a long, moderately interesting, history lesson. The subject was, I guess, important. The acting was quite good. But it was a marathon, and long, really long, a tedious meander through time to a not particularly rousing finish.It would have been nice if there was a little more rhythm. Maybe a parallel story in there that punctuated the tedium. But there wasn't. Just this monolithic story from start to end.Robert De Niro played Robert De Niro, with his increasingly self-satisfied demeanour. DiCaprio pulled out a decent performance, and carefully depicted character traits that allowed insights into the Ernest Burkhart and why he ended up in various predicaments.The sets told the passage of time very well, though.Overall, it wasn't fun, more of a chore.",
    "140": "The BankofMarquis would highly recommend you see the latest epic (and we do mean EPIC) film from famed Director Martin Scorsese in a movie theater. Not because of the beautiful Cinematography by Rodrigo Prieto, not because of the Epic-ness of the tale told and not because movie theaters could use your business (all of which are reasons to see it in the movie theaters). You need to see KILLERS OF THE FLOWER MOON in a movie theater so that you cannot be distracted by things around you (most, notably your PHONE). One needs to immerse themselves in the experience of this 3 1/2 movie to totally understand and appreciate it.And that is because KILLERS OF THE FLOWER MOON is as much atmosphere, mood and setting as it is story. Early on, one of the characters warns another one that the Osage people (the central group in this story) \"don't say much, listen more and let long pauses hang between words\" and Scorsese does much of the same. Letting the story hang - and be told in - the silence between the words. And it works...if you are paying attention.Starring Scorsese regulars Leonardo DiCaprio and Robert DeNiro and featuring a wonderful, soon-to-be-Oscar-Nominated performance by newcomer Lily Gladstone, KILLERS OF THE FLOWER MOON is based on the novel of the same name by David Gann and tells the tale of the Osage Nation who discover oil on their land in the 1920's and the white men who come to try to connive and steal it away from them.Taken on the surface, this story could be a pretty straight-forward white-man steals from the Indians story (substitute Buffalo for Oil and we have a story told so many times before - most notably in the Oscar winning movie DANCING WITH WOLVES), but in the hands of master craftsman Scorsese, this movie is much, much more than that.Easily his best work in at least 10 years, Scorsese lets this story breathe and focuses in on the mood and atmosphere of the period - and the disparate people that inhabit...and battle for...this land and oil. It is the work of a maestro nearing the end of his tenure, skillfully conducting the Orchestra, one last, loving, magnificent time.Like Scorsese, this is Oscar winner Robert DeNiro's best performance in years and will not be surprised if he garners his first Oscar nomination in many, many years. Gone are the histrionics and over-the-top gestures and facial ticks that mar his comedic work (and in some cases his non-comedic work). DeNiro returns to the compact, internal \"method\" acting that was the hallmark of his early (best) work. You can see that this player still has \"game\" and he gives the role of William \"King\" Hale some dimension. This is good for this character could have, in lesser hands, turned into a \"mustache-twirling\" villain tying the heroine to the railroad tracks but in DeNiro's capable hands (with Scorsese skillfully leading him) it is so much more.Speaking of the Heroine, newcomer Lily Gladstone is just a strong and compact in her portrayal of Mollie Burkhart - the Osage woman in the center of the story. She gives Lily some sharp edges along with the rounded corners she is given in the script and the story and more than holds her own with the likes of DeNiro and DiCaprio in the many, many scenes she has with them. Most of the time, she needs to express quite a bit with a look or silence (while looking away) and she is able to convey that very, very well.Fairing less well in this film is Leonardo DiCaprio as Ernest Burkhart, the sad-sack that is the pawn of \"King\" Hale and the love interest of Lily...or is he? DiCaprio is very good as Burkhart (when has he ever given a bad performance) but this character is thinly written and you can almost see the puppet strings on him. This, probably, is on purpose by Scorsese...but against two solid characters like DeNiro's \"King\" Hale and Gladstone's Molly, there just needed to be a bit more to DiCaprio's character to make him more interesting.Since this is a Scorsese film, it is fleshed out by some wonderful character actors led by the always watchable Jesse Plemons as the FBI agent sent to unpack what is going on. Joining him in what are (essentially) extended cameos are John Lithgow, newly minted Oscar winner Brendan Fraser, the always good Tantoo Cardinal, Scott Shepherd (as Leo's brother) and a myriad of \"that guy\" and \"interesting looking roughnecks\" to flesh the feel of the film out - both on the white man as well as the Osage sides of the story.The aforementioned Cinematography by Rodrigo Prieto along with the Costuming (Jacqueline West), Production Design (Jack Fisk) and Score (Robbie Peterson) all add to the mood of the piece and makes it very successful, indeed.Just be forewarned, it is as every bit of 3 1/2 hours as it's runtime dictates. There will be long, slow, silent parts that will make you tempted to pick up your phone - but resist that and enjoy the epic mood piece that is KILLERS OF THE FLOWER MOON. You won't regret it.Letter Grade: A-8 stars (out of 10) and you can take that to the Bank(ofMarquis).",
    "141": "It's not only a masterpiece cinematically, and visually but also it gives tribute to authenticity of Native American culture, specifically Osage tribe.The actors Leo, De Niro and Lily Gladstone play the characters so well. The visuals look stunning and rich. The natural places are captured in great details; the camera work is without a doubt a masterpiece.Some of the editing tools that they used were breathtaking.The plot even though longer ( could have been shorter ) was justified with great performances with great guest actors such as Plemons and Fraser. Fraser plays a corrupt lawyer that surprisingly looks stunning.The story is about a mysterious cases of murders of Osage family ( The richest family in the world back then ); Earnest ( Leo), Bill ( De Niro ) are linked directly to this mystery. Not to spoil the key points of the plot; They both play the bad guys.",
    "142": "Just saw KOTFM and a few words I can use to describe it are epic, heartbreaking, and colossal. I'm still processing everything but here are some quick first impressions:1. Film is visually stunning. The sense of place and time in creating this world is outstanding. As an Osage from the reservation, the scenery is spot on. The clothes, the storefronts, the houses, everything. Was all perfect.2. De Niro and Lily Gladstone had Oscar worthy performances. Their acting was phenomenal. Lily's presence in the face of horror and heartbreak felt so real and powerful, and she stole every scene she was in. De Niro's portrayal of Hale as being purely evil while also being gregarious and a pillar of the community was chilling. In my opinion this could be De Niro's greatest performance ever, and that's saying something. (Also loved Scorsese's homage to the Untouchables where De Niro played Capone, when he had Hale laying back getting a shave. Anyone else catch that?)3. While the movie was long, it never got boring. Pacing worked. There was a constant bass beat later on in the movie that created a foreboding sense of terror. This really worked well imo.",
    "143": "Synopsis: When oil is discovered in the 1920s at a land that belongs to the native Osage people, they are slowly starting to get murdered one by one. Until the FBI steps in to investigate the case.Directed by the great Martin Scorsese after 4 years since his last film The Irishmen (2019), he returns again as Leonardo DiCaprio and Robert Di Niro in lead roles as well as Lilly Gladstone. The film can simply be described as a 'disappointment' at least to me personally. That does not make it a bad film, it's still a great film filled with so many positive elements, but, its negative elements surpasses the positives ones.This is DiCaprio's first leading role since his last one which was in Don't Look Up in 2021 as Dr. Randel Mindy. Before that, his leading role was in Tarantino's Once Upon A Time In Hollywood in 2019 as Rick Dalton. Anyone noticed anything 'unique' or 'different' in his role in Killers of the Flower Moon comparing to the last two characters he presented? Same acting skills, same craziness that the characters has, same actions, same facial expressions, and same characteristics. This simply lowers in DiCaprio's acting skills ability as well as his choices of the roles he wants to present. Note that Leo himself decided to switch roles as he stepped in to take the role of Jesse Plemons. So DiCaprio originally was suppose to play Jesse Plemons' role which is the FBI investigator. In my opinion, this is the biggest mistake and the weakest decision that DiCaprio has ever made. I would've loved to see DiCaprio in an unusual and different character comparing to his last two ones. More importantly, would've actually loved to see Jesse Plemons in a leading role. Plemons is highly talented and can easily carry a film by himself with his ability of bringing such heavy weight on the screen. Robert Di Niro is by far the biggest surprise as many expected him to introduce something usual. This man still got it all and something that helped a lot is that he is playing a character that reflects his actual age.The film could easily be cut down to 2 hours. There is a whole hour and a half that added NOTHING to the story and had 0 support to the plot. The film contained so many scenes that felt repeated and overused.The trailers of this film tricks you into thinking that this film has a great soundtrack. The film overused that one specific piece of track that gives a very suspense vibe to the scene yet it is the only thing being heard throughout the whole 3 hours and a half of the film which made my ears truly get sick of listening it throughout the whole film and throughout each scene and sequence.The film could've (and SHOULD'VE) chosen to tell the story from the perspective of the Osage people. Or perhaps ANYONE else like the FBI detective agent and turning this into a suspense/crime/thriller film. A 3 hours and a half that truly presented nothing new, even thought I was patiently waiting for the climax to hit, until the film ended in the most cold and slow way ever.My rating is 7.5/10\nFormat: regular IMAX theatre\nWatched on November 4th, 2023.",
    "144": "I have been a fan of Martin Scorsese as a director since I saw \"The King of Comedy\" back in 1983. Since then he has come out with one great movie after another:\nFrom the 1980's:\n\"After Hours\"\n\"The Color of Money\"\n\"The Last Temptation of Christ\"\nFrom the 1990's:\n\"Goodfellas\"\n\"Cape Fear\"\n\"The Age of Innocence\"\nFrom the 2000's:\n\"Gangs of New York\"\n\"The Aviator\"\n\"The Departed\"\nFrom the 2010's\n\"Shutter Island\"\n\"Hugo\"\n\"The Wolf of Wall Street\"\nWhat an amazing career this man has had! And now with his new film, \"Killers of the Flower Moon\" he has another contender for Best Picture of the year.Starring Leonardo DiCaprio, Robert De Niro and Lily Gladstone with supporting performances from Jesse Plemons, John Lithgow, and Brendan Fraser, it is another Scorsese Masterpiece.It is a long film at almost three and a half hours but it is never less than compelling and fascinating.The performances are all great and the film is superbly made on every level. Based on a true story, this is one of the best movies of the year. Highly recommended.",
    "145": "I've rated this 8/10 because of the quality of the acting and the importance of the history this movie is based upon.It appears though, that Scorsese, due to his previous body of work, has reached a point where people around him may be afraid to speak up particularly when it comes to editing.Whilst beautiful to look at in many scenes, the movie is anywhere up to an hour too long for the events portrayed.As an example, without giving too much away, there is a scene which involves fire and the same shot of human silhouettes against the backdrop of the fire is shown several times when once would've been enough to convey the imagery.It remains a movie worth seeing, but the editing staff around the Director should have been more upfront with him and shortened or cut several scenes which fail to move the story forward.",
    "146": "Yes, the acting is first rate. Yes the film-making is wonderful and the sets and locations are all impeccable. But this movie is so self-indulgent, so bloated and unevenly paced, so repetitious and tedious, that it simply does not work.I think perhaps Scorsese was too close to this. I know he'd been trying to get it made, like, forever. But perhaps his masterpiece was Raging Bull, and that was really DeNiro's picture. Maybe Scorsese is better when someone else supplies the vision. Like Paul Schrader.Also, where the heck was Thelma? She's a brilliant editor, surely she must have know that the pace was totally off. That really has me scratching my head.I wanted to love this movie, and I don't hate it, but it's maybe at the bottom of the list for me. That's a great list, of course. Scorsese is a treasure.",
    "147": "An extraordinary and well crafted picture by Martin Scorsese .Holds a lot of emotions by these massacred souls of Osage and the set up of the story was cohered and we get in the heart of story immediately . I should praise the introduction of the characters every single character introduced in a quickly smart way make us involved in the middle of big and small events in the movie and hang with characters. Its horrifying point of view to the story and the whole murdering and wasted spirits by the greed of the heavy wealth . What a performance from DiCaprio one of his best acting performances ever , De Niro proved again that he is the best actor in entire history by this contrasted character , Gladstone was perfect acting choice she had done on of the most perfect female performances in last years .The movie is long but without a single boring second on it . The film contains transformations in characters and twists in events and introductions of a number of characters with their moral conflicts and intentions, and all this progressed in a genius way in the film and so that the film is not exhausting was in short chapters as a break from the style of the film and it was fun breaks btw .",
    "148": "Well, I didn't walk out during the 3.5 hours of Killers of the Flower Moon. Just when the plod (sorry I meant, plot...actually no I didn't, it's a combination of plod and slog) got to be too much, two and half hours in, the Feds show up and things change from plod/slog to an amble.DiCaprio and DeNiro do their best to overcome the miscasting and blend in by adopting weird jut jaw expressions and obscure accents. Several times I was reminded of another NYC actor, Tony Curtis and his legendary attempt not to sound like he was from Brooklyn in the classic movie 'The Black Shield of Falworth' set in 14C England. Playing a squire he gestures to a castle in the distance and says to Janet Leigh (the movie where they met): Yonda lies da casul of my Fodder'. It's not that bad in Flower, but close.Unconsciously attempting the same jut jaw expression left me with an aching jaw. The plod left me wondering why Scorsese picked this weird matrilineal Native American complicated legal murder spree as his next opus.I repeat: I didn't walk out. Which is, kind of a movie review.",
    "149": "Had the pleasure of watching this in the afternoon on a random Thursday as I had to take some PTO, in at 1 out 5 and still time to have a drink after before dinner.Was a tough one not to go to bathroom, but was worth it to stay in the theatre for this as we were brought into the life of the Osage all those years ago.Leo, Robert and Lily were all incredible in this and each made the film in their own way. I don't think it would be success without them especially Lily Gladstone.Hats of to Martin Scorsese at the wise old age of 80, still doing amazing work for the cinema. Ridley Scott coming out with Napoleon next week. They're going to be hard to replace in the coming years...Sit back and enjoy while we can..."
}