{
    "0": "Benicio Del Toro co-writes this gritty, granular police procedural about a murdered real estate agent. Who killed her? Her fiancé, Justin Timberlake, her soon-to-be ex-husband, or a sketchy weirdo played convincingly by Michael Pitt?But then, heavy spoiler alert, the final act: when Del Toro comes home one night from the job, he finds signs of a break in. The pool is leaking. You think, Oh no, the killer got to his wife!But she's not dead - she's shot at Pitt and put a hole in the pool. Pitt is there, it turns out, to give Del Toro a clue. One of those handy thumb drives with all sorts of damning digital evidence.The real estate thing involves the cops, and drugs, and something about money laundering. Del Toro confronts the cops, at one of their homes, at nine in the morning, and a shootout ensues. End of story.He doesn't even go after Timberlake, who instead we see golfing in a penultimate scene, then the FBI ride up in a golf cart and nab him.Roll credits.I mean, Jesus.What started out as a creepy, interesting story with lots of tension devolved into a by-the-numbers \"corrupt cops\" trope. Granted, a lot of this was done well. The pacing feels brisk, the editing crisp. Del Toro is great, his wife played by Alicia Silverstone is great, and it was refreshing to have their marriage be healthy and functional.The music is on point, too. The direction and camera work consists of the usual intensive continuity with way too many close ups, but that's nearly every film today.Se7en this is not. This is Netflix doing a pretty good job of creating a serviceable cop drama with some flashes of originality that ultimately isn't brave or bold enough to not fall victim to the most pat formula resolution.I mean, who or what was \"reptile\" anyway? Who even actually killed the woman at the beginning? What was the significance of her wounds - being stabbed so hard the knife penetrated bone?? What were the potential bite marks on her hand all about?? It's like the writers thought to present a great mystery but only figured out how to solve some of it.Close, Del Toro, but no cigar.",
    "1": "This film could have easily been a series of True Detective.... the filming, atmosphere and music are very of that genre... this is a long film and not for the action lovers. It's thoughtful well written and you need to be awake and concentrating. If you like this pace of film you will enjoy it and the plot is complex and cleverly developed... I won't spoil it... there are web sites that fully explain it. I believe it's got a 7/10 rating due to some impatient poor reviews by people not suited to the pace and genre. I would say if you like the true detective series 1 you might enjoy this ... but if you wants a shoot out every two minutes and an easy plot line... I'd give it a miss.",
    "2": "Reptile is a movie that starts out, absolutely fantastic builds to a crescendo about halfway through, and then falls apart through all the red herrings, macguffins, and unresolved loose ends, that it presents in an effort to give us a dramatic end to this murder mystery/procedural drama.Benicio Del Toro delivers possibly the best performance I've ever seen him give he can often seem slimy, slick or creepy but in this film, he comes across just as he intends you to see him, which is as a man with a spotty history as a policeman, but greatly desiring to get onto the street and narrow. He is supported by his dutiful wife Judy, played by Alicia Silverstone in a really strong performance.Justin Timberlake gives us a turn as the bereaved boyfriend of the murder victim, Timberlake and his mother, played by Frances Farmer, who is very underused on the real estate company that Timberlake and his girlfriend work for.Quickly the suspects add up. There is the girlfriends soon to be ex-husband; then there's Eli who Timberlake and farmer have screwed out of his families property. There's also some sort of a weird creepy guy out of the church that's getting painted in the middle of nowhere. This is apparently a piece of property that the girlfriend sold but revisited. This plot point is never revisited, nor dug into any further, yet the paint that they've been using to paint the church appears on the victim and on the victims soon to be ex-husband.Finally, we discover that the whole business is a result of police corruption and drug trafficking and money laundering. The police corruption goes so deep. We are not quite sure who's clean and who's dirty. This also leads to all sorts of loose ends that we are provided.There's a scene with Del Toro at a therapists office as required after a shooting and he talks of a dream. Then later he has a dream or does he? It would seem that the dream which is very plot specific reveals the killer out right and no point do we get any indication that his realization of who the killer is wasn't a real occurrence rather than the dream it is presented as. But so many questions abound.Why would any self-respecting policeman on the teak hang on to the vehicle that was used by the killer to kill the victim?Was the killer actually the police chief and not the boyfriend? We don't know we're never told.Why does Timberlake's character show up just days after the murder of his girlfriend with a girl that looks almost identical to that girlfriend in a restaurant where he runs into the detective leading the case? Further why would he have showed up with this girl and does she have any relevance to the plot that follows? No. It's another blind alley.Is del Toro's partner in on the corruption? At the end we don't know.What was the point of the police pulling Del Toro and his wife over after the party? If only to lead them home? It's possible it was to reinforce the fact that the police corruption goes deeper than he is aware. However, if this is the case it never comes up, or is never revealed at the end of the film. We just don't know what happens.Who actually killed the victim in the film? It is never really divulged who that is. We are led to believe it is the boyfriend, but then if it is, why is the car that was used by the killer parked in the chief of police house?Eli is killed off screen and this time we know Timberlake is in on it but we're not allowed to see who else is present in the room and it is never revealed to us even though it is alluded to.Finally, the climax of the film has some of the most confusing things in it. Del Toro gives the evidence to the police captain, and they both go to see the chief of police to confront him with what they have. Now Del Toro's character has given over the evidence that Eli provided him to the police captain, whom we assume is on the take and Del Toro is unaware. This fact when realized really makes Del Toro seem like a rookie detective and not the seasoned guy he supposed to be.When the chief of police whispers to Del Toro to leave because he's been found out, and that the captain is in on it, before Del Toro can leave, we must assume that the head of the DEA, who is a friend of Del Toro's is responsible for murdering the chief of police in his own home. Hearing this gunshot, Del Toro goes in to the bathroom where the captain has retreated and confront him and kills him. Then Del Toro's friend comes down the stairs after having killed a police, chief and attempt to kill del Toro. They have a gun fight, and Del Toro mortally ones his friend Dave. Then Del Toro picks up his phone and calls 911. We don't see police cars. He doesn't speak to the police or 911 yet in the next scene, we see Timberlake being arrested by the FBI while playing golf and then the next scene cuts to Del Toro Having his wife dip, his hands in hot wax, supposedly/assumedly to remove any gun shot residue he might have on his hands. But why? What is the shooting a good shooting? Or a bad shooting? We'll never know. The Director decides to leave us right there. We don't know if Del Toro is a good cop, who discovered a nest of vipers as the title would lead us to believe or if the FBI stumble across this whole thing on their own, and after their investigation, finally get around to arresting Timberlake. We don't see Francis farmer arrested. We don't see the police force getting arrested for this corruption and drug smuggling and money laundering and murder.So while the film has incredible acting, and has a really neat premise, it just sort of falls apart at the end, because all these questions are left on answered, and there are just too many little bits and pieces that are thrown in that have no reason to be there..",
    "3": "For those who like murder mysteries like me, this is an excellent movie. My fave shows and movies are BBC mysteries and Nordic Noir - well written and well acted productions. Certainly, for the mystery-affectionado, this is a quality production from top to bottom - acting, writing, story-line, camera work, production. Benicio Del Torro is a pleasure to watch. I feel like the story was somewhat familiar but I appreciate a movie which re-covers a certain theme but in a quality way. For those who enjoy an intelligent mystery / thriller, they will enjoy this movie. For those who want a more shoot 'em up, car chase, action-packed show, this will disappoint. Overall, I recommend to anyone who enjoys quality mystery / thriller productions.",
    "4": "Well what do you think if that. A neo noir drama meant for actual adults that is not insulting to the intelligence or wrapped up in gimmicks. Excellent casting of experienced character actors and nice performances from Alicia Silverstone, too many times typecast, and Justin Timberlake,not just a disney brat-boy band hottie . It's reminiscent of american crime dramas that rely on story and character and a sense of paranoia and foreboding rather than car chases, flashy scenario or snappy dialogue. I was pleasantly surprised. Much more restrained than say a Sydney Lumet drama. Nice to see new blood escaping typical formulas for the genre. It's always worth giving a look at what Benecio del Toro involves himself.",
    "5": "If you are interested in watching a good thriller, shot at a good pace, with twists and turns, than this is for you.Do not buy into some of the reviews, they do not reflect the general feedback. This is a very very good neo noir thriller with nice subtleties and some very good acting, particularly from Del Toro. Timberlake is quite good too, allowing for more method in his performance.I found the dynamic between Del Toro and Alecia Silverstone strong, with the Clueless star playing a much more important role than you often see from the protagonists spouse' in these films.Very good, gritty at times, with some minor plot gaps, which can be forgiven as the story evolves into a thrilling finale.",
    "6": "Ignore the ridiculous low scoring reviewers who obviously don't have the capacity to enjoy this excellent thriller and who've probably seen The Fast and Stupid movies ten times each. Though it is indeed a slow burn it is never ever boring and keeps you captivated from beginning to end. Twists and turns abound until the very end which will keep you guessing and you won't know the whole story till the near end. I did guess some parts correctly and they weren't that difficult but not everything. Del Toro gives another excellent subtle performance as well as surprisingly, so does Silverstone. The rest of the cast is equally good. For his first time directing the director did a good job and I will be looking out for any of his future work. Despite what many say Netflix has had several well made original movies as of late and you can definitely add this to this list. Ignore the whiners whose sole reason of existence is to hate on everything.",
    "7": "Reptile is one of the better thrillers I have seen this year. Of course .Benicio Del Toro absolutely makes this movie and it is nice to see him and Alicia Silverstone together in a movie again. This is a taunt thriller and a solid mystery that does have some twists and turns. The acting was spot on from all the cast including Justin Timberlake. I loved the classic music that was used, it helped to add atmosphere and they played some of my favourite songs. There were some nice scenes mostly with Del Toro, he is an actor that can bring some real gravitas to any role he is in. The movie was well scripted and had me guessing the whole time, it all came together in a satisfying way. This is for people who like slow burn thrillers.",
    "8": "I'm still trying to figure out why this movie is called Reptile. The title is the worst part of the movie, all the rest is very good. I've always been a fan of Benicio Del Toro and again he didn't fail to deliver. This character fits him very well so perfect casting here I would say. Justin Timberlake is definitely better as an actor than as a singer, he should stick to this. Michael Pitt was good as well playing the outcast, another well casted job. The whole cast delivered here, it makes Reptile standing out in this genre. As for the plot it has it all, a lot of slow burning mystery that keeps you guessing, good suspense and a clear and satisfying ending, I couldn't ask for more. I honestly don't get why somebody who likes crime mysteries wouldn't like this movie? That's exactly what it is, a crime mystery, and it's a exceptionally good one.",
    "9": "I'm more of nostalgic in this review so I give it a 9 instead of 7.5 , but damn I miss a good crime thriller. This is exactly what I needed , after Little Things with Denzel , this one is the next one I really like. Movie is a nice mixture of 90s killer thrillers combined with likes of Training Day, so you gonna keep your seat warm trough the whole movie. Cast is more then amazing , screenplay is enjoyable with some nice twists , cinematography is also on point , dark and gritty . It's a more then 2 hour movie but you don't feel it at all , it just flows and keeps you interested . Don't believe bad reviews and enjoy this one. We need more of those in production !",
    "10": "The opening scenes of 'Reptile' show real estate developer Will having some uneasy exchanges with his realtor girlfriend Summer. The following night he gets a message asking him to meet her at a vacant property, and arrives to find she has been stabbed to death. The initial police investigation zeroes in on Will, but the case gets murkier when it's revealed Summer had a bitter ex-husband, while a former client holds a grudge against Will.All this is just the introductory passage, after which homicide detective Tom Nichols sets to work and finds additional complications. With the plot unfolding at an unhurried pace, Nichols' nuanced relationship with his wife Judy is given refreshing prominence for a neo-noir mystery movie. The rest of the excellent cast is well up to the task of portraying characters being devious and deceitful as Nichols ruffles the feathers of his suspects and colleagues. 'Reptile' is a thoroughly professional debut by a first time director offering several innovations to the genre, which ultimately lead to a somewhat conventional conclusion.",
    "11": "This movie has a great cast, very well acted, it sucked me in and held my attention... but then it just ends. It was almost like they looked at the clock and realized that they had to finish, so they tried to tie it up as neat as possible. Maybe I have been spoiled by the twists and turns of other thrillers, maybe I have been spoiled by slow-burn films that have huge endings.This was a slow-burn, with no big flame, and it was immediately extinguished. I honestly feel like they could have condensed everything thing that happens, because the ending feels like the halfway point. Just as things start moving, it stops. Great actors though, I really enjoyed the movie until I realized they were going to rush job the ending.They never even explain what happened to his hand in the beginning of the film. He does injure it again at the end, and then they have the silly wax dip so the can tie in this forced notion of a reptile shedding its skin. Meh.",
    "12": "There was a young real estate agent named Will Grady. He worked alongside his girlfriend, Summer and his mother, Camille in their family business. One day, tragedy struck when Summer was found dead in a house they were showing to potential buyers.Will then becomes the prime suspect given that he and Summer appeared to be on the verge of breaking up. Adding to the story, Summers ex-husband, Sam, was involved in some shady dealings as a heroin dealer.But there was another character in the mix, Eli Phillips, who held a deep grudge against the Grady family. His father had taken his own life after a real estate deal gone wrong, and he blamed the Gradys for his father's death. Eli had a personal vendetta against them.As the investigation unfolds, it seems that anyone could be a suspect with motives and opportunities aplenty. But the shocking twist came when it was revealed that Summer's murder was not a result of personal animosity but a desperate attempt to silence her. She had stumbled upon a web of crime and corruption that went far beyond her relationship with Will.Detective Tommy Nichols who led the case began to peel back the layers of deceit. His close knit circle of friends including his police colleagues, started to fall under suspicion.Eli plays a crucial role by providing Tommy with a thumb drive that exposed money laundering scheme involving the Gradys real estate company and a private security firm run by one of Tommys best friends. It is then we know that corruption ran deep reaching even the Captain and the Chief of Police.Tommy found himself in a dangerous predicament as he was the only one in his circle of friends who remained untainted by the corruption. When his knowledge became a threat, his life was in peril.In the end the truth prevails and justice was served. Will Grady gets arrested for Summers murder revealing her threat to expose the drug money laundering scheme.The movie ends with Tommy wounded but resolute, cleaning his hand under a motion sensor sink symbolizing the cleansing of the town from its deep seated corruption.",
    "13": "All movies require a suspension of disbelief. But you expect that your screenwriters will have some connection to the real world. That the major plot lines or the comments about every day life won't be stupid.You would expect that. Not here.A minor example, right at the beginning of the film. A harbinger. The screenwriters apparently have no experience with automobiles. In one of the opening scenes between two young women swimmers talking about a nightmare in a locker room, one of them talks about the horror of being stuck in a car in a tunnel. And that she had to \"turn the battery on.\" Huh? Anyone who drives a car knows you turn on the IGNITION.The three screenwriters couldn't get that right? One is a neophyte director/screenwriter, so he probably takes the subway. Another is a world famous actor, so he's probably driven around. You'd think the third would have some idea what you use the key or fob for in an automobile. Nope.And the major plot point for which the real estate agent was killed -- that her broker's commissions were somehow being invested in real estate to avoid taxes -- is preposterous. That's not how it works. And selling houses worth almost a million dollars and for 6 sales she generates the whopping sum of $70,000 in hidden commissions? What is she selling - doll houses? No. Houses in the high 6 figures.Of course here the \"sales\" all involved civil forfeitures from planted narcotics. Civil forfeitures aren't that easy. There are defenses to them. After a number of these forfeitures (like, two maybe), someone would get wind of the scam. Here the only one who figured it out was the kooky neighbor. He must be a relative of the kooky faux scientist in the Moonfall movie.And what's with the Benicio Del Toro character's injured hand, and the re-injury and treatment at the end? Mysterious? For what reason? Never explained. Never an issue. There for no reason. Chekov would be very disappointed.And so was I.This turned out to be glop, spoiled by screenwriters who don't have a viable connection to the real world. What a disappointment.",
    "14": "A great movie very tense and gripping. Lots of twists and turns to keep you on your toes. All the cast were great. Nice to see Alicia Silverstone cast in something good. Benicio is excellent as always. The music really adds to the atmosphere and it has an almost Lynchian feel.The cinematography is worth mentioning too and is very effective in creating tension and mood.One of the better movies on Netflix I would definitely recommend it if you love a good thriller.I wasn't sure what to expect as I've watched many poor movies on Netflix but this is definitely one of the better features it's a shame it wasn't released theatrically.",
    "15": "In English:Grant Singer has directed music videos but otherwise has no experience in directing films.I have very limited knowledge of Benjamin Brewer as well. He has a film on my watch list (The Trust).At some points, the film is too clever for its own good; it's a slow-burning crime thriller.The ending and the whole narrative are sometimes incomprehensible, and some strange and inexplicable choices are made.If the head of the department was in on Summer's death all along, why would he have assigned Nichols the case in the first place (i.e., one of the cops not in on it)? They could have easily covered up Summer's death by other means and just not involved Nichols at all.However, there is a particular atmosphere that also works well in some parts.",
    "16": "Benicio del Toro is the main actor here and is also credited as a screenwriter and executive producer, so he is given tons of screen time. This doesn't really help the film as there are many scenes that are just nothing but filler and don't add anything to the story.Alicia Silverstone and Justin Timberlake are decent enough as are some other well known actors but the movie as a whole feels like a patch work quilt. Show this scene, jump over and show the married couple chatting, then jump back to another scene. Constantly.Add in tons of miscellaneous details that don't add to anything, a snake skin molt for some reason. How about a scene where we are given a key phone number through an investigation, and the main character dials the number. Then let's show 4 other people waiting or hearing the phone ring and cut back and forth. Yeeesh, what is this.Then let's add a dream sequence in there somewhere. Some super unoriginal dialogue such as, \"It's me, dude, don't shoot. You know me.\"And the ever popular, \"They have the hard drive. They know!\" Especially annoying as there is no actual reason for the character to know that there is a hard drive with any info.The more I remember about the film, the more I have to adjust my rating accordingly. The abrupt ending is just strange, ran out of ideas/money type ending.",
    "17": "My Rating : 7/10Standout thriller with a well-paced storyline, 'Reptile' grips the viewer into a murder-mystery puzzle in the vein of 'True Detective' or 'Twin Peaks'. Slow, meticulous and skilfully directed, 'Reptile' has many twists and Lynchian undertones such as upright characters in double-dealing situations, dark suburbia and noir.Benicia del Toro gives off a moody yet moral detective vibe with a dark sense of humour. On the flip side, it is very slow so viewers who want a fast-paced thriller will perhaps not enjoy it, it can drag unfortunately. However, if you like small towns, mysteries, Polanski then 'Reptile' is your thing. Go seek it out. It's not only a slow-burner, it's a slow-but-confident crawler!",
    "18": "I can't believe I almost didn't watch this movie because of the crazy low ratings. Honestly, if you think this is a 1, 2 or 3 star movie, you should have your ratings privileges taken away.Super suspenseful. Lots of twists and turns. I thought I knew where it was going and I wasn't completely wrong, but iot taook a whole lot of turns to get there. Ups and downs where I thought I was wrong and someone else did it, just to find out it wasn't really about that and now I have a new suspect. Yeah, it's a great film. I highly recommend this one. Don't give up on it, take it to the end. You won't be disappointed.",
    "19": "The movie was entertaining for the most part, music a little too dramatic and I don't get the ending? There's no closure of characters and the hand washing at the end???? Good acting and I liked all the characters some stood out more than others. Needed more character development and not sure if I would recommend this movie to anyone, just didn't reach its full potential. Probably could have been a little longer to explain things, was there a book that this is based on?? Who was all involved? How deep did it run? How did he explain the blood bath at the end did the other cop survive and confess to everything??",
    "20": "This movie is a testament to Benicio Del Toro's return to form, reminding me of his stellar performance in \"Sicario.\" It maintains a perfect pace, is skillfully directed, and boasts impressive performances by the lead actors. The storyline is intricately developed, and while it does have some predictable moments, it offers plenty of unexpected twists and turns that kept me captivated throughout its over two-hour runtime. It's a refreshing addition to Netflix's lineup, and I eagerly anticipate more films of this genre in the future. Not sure where some of the 1 star reviews come from, but this is definitely one of the standout crime thrillers of recent times, in my view.",
    "21": "They're at the scene of the crime. They're investigating. They're giving each other looks. You think something is about to happen. And then... nothing.But then they're at the station. More clues are coming in. The phone rings. He's eating a salad. The music intensifies. And then... nothing.But then out of nowhere, someone knocks on the door. He looks very suspesious. He knows stuff but we don't know who he is or where he came from. And then out of nowhere... nothing.Now they're in the car. They're driving. They pass by a house. Nothing.The phone rings. Kids are playing outside. It's tuesday. Nothing.Shots are fired.Nothing.Asbolutely nothing.What tf was that?!?Hey, Dumbflix, are you just seeing how far you can go before we lose our patience?!#CancelNetflix.",
    "22": "I truly enjoyed this movie, it kept me guessing almost the entire time. You do figure it out towards the middle to end. The characters were very well developed and the relationship between the main character and his wife made me envious lol.This movie reminded me of the old school '90s style crime Thrillers like Internal Affairs from back in the day. If you've never seen it it's really good with Richard Gere and one of the Baldwin brothers.I gave it a 9 to help with the ratings since I really think it's a good movie and should be higher than a 6.9. Benicio del Toro is such an intense actor and his eyes are so menacing. But this role really suited him and it was a little different from his past characters. It's a good watch!",
    "23": "Yeah this film was pretty decent of a thriller with the right mixture of mystery thrown in. It's one of those films that makes you wonder who the real culprit, or culprits are. Justin Timberlake is back. I don't think I've seen him in anything since the can't stop the feeling video. I don't think much of him as an actor though. He plays will. A man working in real estate that comes home one night to find his girlfriend summer dead. A bigger mystery starts from that as we see benecio del Toro as a cop and Silverstone as his wife. There's a whole other group of cops to and as the film's grows as start to relize something is off. Parts are slow but it's a pretty good mystery overall.",
    "24": "I think every film fan hopes that any given film will break away from the rest of the pack and dazzle you with brilliant writing, fine performances, and a plot that keeps you guessing, but about a quarter of the way through this film, the storyline rolls out pretty much the way you expect it to. There aren't any surprises here, the bad guys are exactly who you expect them to be. This is not to say that the acting isn't any good, it's delightful to see a remarkably layered, restrained performance from Benicio del Toro for once, and Alicia Silverstone possesses the ability of some actresses who are able to convey entire conversations with their facial expressions. The film is too long and there are too many red herrings along the way, but it's sufficient entertainment if you can't find anything else to watch.",
    "25": "This was really well made.All of the actors were perfect for each role. But my favorite part of the whole movie was the relationship between Benicio and Alicia's characters.Usually in movies, the cops wives are always clueless and there's no real communication between them. In this movie, it was the opposite.The two of them were real and honest and open with each other. He never hid the truth and she was strong and always there for him. Loved loved loved it!Justin surprised me as well. It was a different kind of role for him and he nailed it.A great whodunnit movie! Glad I watched it and watch it again.",
    "26": "This is a quiet film - it's hard to sustain interest when crime stories follow a procedural structure. Yet this film manages to hold the tension really taut and consist. I was riveted from the first scene. It's all about character.What helps here are choices that are quite unexpected. The film's tone and writing are fine-tuned away from the genre's typical focus - thorny plot, being highlighted by theatrically dramatic, scenery-chewing performances. Instead we listen and follow a modulated trail defined by an electrical current of tension that the main characters are experiencing. Captured in faces, often without dialogue. Good actors who also possess faces one can read depth into like textured history.The story moves forward, but what matters most to the filmmaker is something that we often miss in crime and mystery films: the gradual unveiling of incomprehensibility that cops need to wade through. Mystifying and odd with few easy choices. But here we get the chance to see the actors fill out the realism of the world and story without it feeling like they are governed by plot structure.Benicio Del Toro's contemplative detective is tempered by a deeply felt mistrust of people. I had forgotten just how good Alicia Silverstone is when understated. The cast is uniformly excellent. The cinematography allows for complexities to be revealed by actors facedEnjoy the film for what it's actually doing, not what some film snobs think a crime film should be doing, according to genre rules and expectations. I believe that \"Reptile\" will age well and the critics will be seen as shortsighted.",
    "27": "Unexpectedly good. Netflix movies are usually pretty terrible so I'm happy I gave it a chance. Only gave it a shot because I saw Del Toro in the cast, it says he also wrote it which is new. Good twists, engaging and great build up. If you like dramas and are looking for something worthwhile and new give it a watch. Hopefully Netflix starts making this a trend and puts more into quality content, although no new ideas are made, not every movie needs to. The movie knows what it's doing and does it well. It seems like the directoral debut for the director so let's hope there's some more in the works.",
    "28": "It has been a long time since a good intelligent thriller.I really enjoyed the overall acting on this film, because people are not one dimensional and we didn't have the trope of the workaholic cop hyperfocused on his case. I really love the relationship between Del toro and Silverstone's characters, it feels real and authentic.The pace is slow but in a good way, it breathes a lot during the events, so you have time to do your own investigation and hypothesis during those moments.I was also really impressed by Timberlakes skills, really good good acting!Oh\nhonorable mention for Pitt's performance, it really creeped me out!",
    "29": "This movie gave me back some good old 90's vibes. No CGI, no huge effect, just the actors and the story. The story build-up was good, suspenseful all they way through and man Benicio Del Toro is amazing. If you are around your 40's you can even smell this movie. I don't think I've seen such a depressing and gloomy cop movie in the recent years.Now for those who complain about that it is slow, and they were yawning I have request if I may: please just go watch your Marvel and green screen movies and leave us grown ups alone with our depressed good oldschool storytellings, okay? I would really appreciate it, thank you!I hope moviemakers and directors will not give up keep making movies like these. As long as they don't, there is still hope!",
    "30": "Will Grady (Justin Timberlake) runs an upscale real estate agency owned by his mother (Frances Fisher). His girlfriend Summer (Matilda Anna Ingrid Lutz) also sells homes with him. We later discover she is still married to Sam (Karl Glusman) and they still occasionally hook-up. Will discovers her dead, stabbed many times in one of the houses. Tom Nichols (Benicio Del Toro) investigates as there are a number of suspects including the creepy guy Eli (Michael Pitt). Tom has his level headed wife (Alicia Silverstone) assist him when she is not flirting with the contractor.The story is multiple faceted. It is like cramming a mini-series into two hours. It was good. I wish Tom had more personality.Guide: F-word. No sex or nudity.",
    "31": "This movie was great and kept on getting better. I was in the edge of my seat the whole entire time on what will happen next. Benico Del Toro at his best since secario. You need to really pay attention during the movie cause you can get lost in who the characters are. There is no introduction to some of the characters and you just need to figure out who they are. I'm not really sure why this got a 44% on rotten tomatoes it really deserves a better rating than that. It did not really button up some of the things at the end. I will not spoil anything for someone going to watch the movie. You need to watch this movie definitely.",
    "32": "Reptile has many things that could have made this a find movie. The biggest weakness of the movie is the cliche conclusion after much goose chasing. It has a promising start. The dark shadow over the murdered woman and her husband is duplicated over Del Toro and his wife. Fod a moment I felt that Del Toro might murder his wife in the same way the victim was murdered. But the story went in a different direction, to a cliche conclusion that we so often see in many crime movies dealing with drugs and police corruption. Somehow drugs and police corruption don't go too well with the suburban milieu of the Town of Scarborough. It would have been better if the story dealt more with the deep darkness of humans.Another thing I couldn't understand was the use of several old pop hits like Just Like an Angel. What does it have to do with the story of the movie?The movie could have been good. The only strength of the movie is the solid performance of Del Toro. It was for him that I watched the movie to the end.",
    "33": "Really, just don't waste your time. It's a police thriller that's two hours longer that it needs to be. BdT is good, as is Timberlake, but the plot simply can't sustain the 135 minute runtime.Grant Singer's thriller \"Reptile\" uncovers department-wide corruption within the Scarborough police force as Detective Nichols tracks down the killer of a young real estate agent.Will Grady killed Summer in a plot twist that may feel formulaic, but Justin Timberlake's role adds an enjoyable element of surprise.In the end we discover that Summer was killed because she was planning to reveal the truth about a drug laundering scheme involving the police department and the shell company White Fish.The narrative gets convoluted, but the tension and tone remain missing.",
    "34": "I was not holding my breath given the terrible track record Netflix has with movies, but this one was surprisingly watchable. Not a world class thriller, do not get me wrong, but good enough to keep you entertained. Yes, arguably a bit too cardboard with some of the shady characters and cops it throws at you early on, and a average ending, but decent acting by some of the leads and at least a couple of storylines that kept me guessing almost all the way. Del Toro is excellent as always, his character had enough depth, and his acting made the movie. Silverstone was good too, and I particularly enjoyed Eric Bogosian. I thought he was excellent in Billions, and here again his acting is great. Some of the other cops did not quite reach the same level, and I have seen Timberlake act better than this (maybe they should have cast Ryan Philippe to reunite him with his movie mum from Lincoln Lawyer, Frances Fisher). Anyway, I think it is better than most stuff coming out of the Netflix studio pipe, so would recommend to give it a go if you like cop movies and thrillers.",
    "35": "Detective Tom Nichols (Benicio del Toro) investigates the gruesome murder of a real estate agent who was the girlfriend of Will Grady (Justin Timberlake), the son of the owner (Frances Fisher) of a real estate company.The case leads Tom to uncover hard truths about his job. It reinforces the warning against judging a book by its cover, as humans have the ability to change behavior like snakes shedding off their skins.The movie takes its time to lay the groundwork of the story, showing Tom's almost idyllic life with wife Judy (Alicia Silverstone) and his co-workers in the police force that will make the revelations at the last few minutes of the film more shocking.",
    "36": "Another movie that wasted the opportunity to show off its potential. They casted a decent ensemble of actors that most are familiar with. They can all act but the story and the pace was troubling. There were several moments I kept thinking all your ducks are in a row let's get on with it. But then they pull back and say not yet, here's more we need to show you. Nothing significant happens and most people in the audience already know who the culprits are, why don't the cops know?By the time, they finally get to the reveal they're about 30 mins too late. I was just sticking around to see if maybe there was any possible twist I missed. Nope standard cops and robbers yarn. Don't waste your time on this one.",
    "37": "I thought great cast, so I would give it a shot. I was pleasantly surprised! The movie harkens back to the days of intriguing cop murder mysteries. As opposed to the ever present cookie cutter crap we see streaming everywhere.It kept me guessing and had some interesting twist a turns.Definitely a well developed story, although I had to stretch my imagination to figure out what may have happened at a couple of points. But those were minor points in the story. These were characters I'd like to see in a follow up movie.I have to admit, the title threw me off, I was expecting the killer to be some reptilian man.",
    "38": "This is exactly what I needed. A good old-fashioned detective story with a couple of good twists and no hand-holding. It gives precisely the information you need, when you need it (it also sends you on different tracks, and it's all part of the plan and not gratuitous) and the slow pace is so well-built that you don't even feel when 130 minutes go by.What bothered me was the cinematography, so nice sometimes but also kinda boring in the use of color, or very limited. Del Toro helped write this stuff (and also produced it) so he brings his all and you can see it, even when he is restrained, I found it all purposeful.I seem to like it more than it is liked by the rest.",
    "39": "So why was the car parked in the garage and by who?Who's kids were they?So what happened to the old lady?Why why whyyyyy?Why did the dude dye his hair?The only thing I enjoyed about this movie was seeing both Timberlake and Alicia acting again, there were some serious issues that I cannot even explain and feel that over two hours of my life were just stolen from me!What was the silicone thing on the hand at the end? The tap thing? Omg so many many many issues with the plot in this movie I honestly think they want the audience to feel as dumb as I do right now.I didn't get it at all....",
    "40": "Well written story and fabulous acting. The story seems a typical detective drama (think Gone Girl) but begins to twist away from this trope toward a more complex understanding of right and wrong.Benicio del Toro, as always, memorably immerses himself in the role. Surprised at Alicia Silverstone's casting in this type of movie, but really believed her portrayal and her relationship with BdT. Justin Timberlake strikes the right tone and the rest of the cast, from Eric Bogosian to Michael Pitt were believable.We thoroughly enjoyed it, start to finish and would watch this director's work again.",
    "41": "Benico del Tora and Justin Timberlake as well as the other actors shine in their characters.A corrupt police film portrayed in a slow fashion which is very realistic for this type of film.Don't believe the bad reviews but read them anyway. You have to wonder what planet the reviewers were on at the time.Should be nominated for awards. Acting, directing etc.As for Benico del Tora - oh man, what an actor he is.Justin Timberlake also amazing as was Alicia Silverstone.Suspenseful throughout the entire film. Nothing boring here.What more can one wish for except a follow up film.Please and thank you.",
    "42": "I enjoyed this and the run time didn't feel over long. Unlike other viewers, I found the music and tense scenes, well suspenful. The movie kept my attention.There's some red-herrings and some strange behaviors from just about everyone that keeps you wondering for a while.Some people don't understand the title. We see a shedded snakeskin early on.The title is a metaphor for people who are snakes in the grass, people. People you should be able to trust, but find out too late you couldn't. Not that difficult to figure out. I mean, didn't we all study literature in middle school? Shessh!Anyway, I like it...",
    "43": "I read some negative reviews, but I still wanted to watch it. I didn't watch the trailer, as I usually don't for movies, so I didn't have any expectations. I just watched it and then decided how it was. Anyways, I was hooked from the beginning. No phone, no distractions. I loved it. It was slow, but in a good way, not the boring kind of slow. Everything seemed excellent to me. I don't have anything to criticize. I think they did a pretty good job. The acting, directing, everything appeared solid. The length was good too. I didn't feel like it was too long. However, as I mentioned, I watched it without any distractions, not even thinking about having to go somewhere, so I didn't keep checking when it would finish, which would have spoiled the experience. Anyway, if you have some free time, can survive without constantly checking your mobile phone, and enjoy crime and suspenseful dramas, then go for it.",
    "44": "A very rare gem sitting in a giant library of trash aka Netflix.Strong cast, especially Del Toro (Tom) who is mesmerizing to watch. Michael Pitt (Eli), Domenick Lombardozzi (Wally) and Eric Bogosian (Allen) deserve soecial mentions, all are very well written characters.Good slow and steady pace, the cuts are masterfully edited with sometimes over the top ominous soundtracks but otherwise mostly effective to maintain the thriller tension. Never a dull moment, the build up leading to the ending is just masterful.Grant Singer film debut scores high marks, excited to see what he is onto next. 9/10.",
    "45": "With misdirections galore, Reptile certainly keeps you guessing. This is done not only in the plot but also in the editing room as overlapping cuts to different suspects creates a cinematographic shell game of sorts. Del Toro's and Silverstone's performances being a key high point of the film.The only major critiques I'd have is some tonal inconsistency, film length, and some fairly wooden acting from Justin Timberlake. Without spoilers, Del Toro's character Nichols provides moments of levity, especially at the start of the film but this is often jarringly bookended by suspenseful scenes and the wonderful but loud score. Without the laughs, the movie certainly evokes Prisoners in terms of its mood, tension beats, and twists and turns. In the latter acts, the levity disappears as the plot unravels, which while providing a sense of juxtaposition, also makes one question their overall purpose. This, along with some questionable plot and character points that go unanswered makes the ending feel a little abrupt.Additionally, the film is on the long side. The pacing of the first act felt a bit fast, especially when introducing new characters and so when the plot is revealed it's easy for the viewer to forget who's who in this whodunit. The other acts are a mixed bag of great and suspenseful pacing and additional to party or line dancing scenes that provide little value other than allowing us see the shadows in the light.Lastly, while Timberlake has shown himself to be a solid acting presence in films like The Social Network, he simply feels bland in this role. He doesn't get a ton of screen time but the time he is on screen, his delivery of certain lines, especially when he's yelling, feel robotic more than they feel sincere. This is evident in the first few scenes of the film.That being said, for the director's first film, Reptile certainly shines. There are some extremely clever moments (the phone call and pool leak especially without giving too much detail) that feel incredibly fresh. I certainly look forward to what Grant Singer released in the future.",
    "46": "\"Reptile\"? I can only thing of one connection the movie had to a reptile and it had nothing to do with the story. It was when Summer Elswick (Matilda Lutz) got frightened by the shed snakeskin and dropped the plant during the opening of the story. From there, I guess you could say that all of Tom Nichols' (Benicio Del Toro) partners turned out to be snakes, but I'll have to leave that tenuous conclusion to the viewer.While I thought the picture was pretty good, I thought the basis for the criminal activity by the dirty cops and Will Grady (Justin Timberlake) was suspect. It was revealed that crooked detective Wally (Domenick Lombardozzi) was working with Grady to plant drugs in homes, that a phony business front swooped in to buy after the house got seized. Although this can be done under civil forfeiture, the process would be unusually complex and take a long time, with several defenses available to the homeowner. While it sounded good in the movie, it would have to have been going on for a long time in order for the bad guys to be profiting from it. It sounded like too much work for me. The company, White Fish, could have been buying any number of other legal properties for a quick turnaround in a hot market. Same thing with the calcimine in the paint that was found on victim Summer Elswick's hands. That was a dead end that didn't contribute to solving the murder.So, I guess what you have to go with here is the performances of Benicio del Toro if you're a fan, or even if not. Timberlake doesn't impact the story much after the cops decide he isn't a reasonable suspect in his girlfriend's death, while Alicia Silverstone provides some consolation as Nichols' wife Judy. I liked the soundtrack of Bob Dylan's 'Knockin' on Heaven's Door\" when the cops came for Grady, a song he wrote for the 1973 Western, \"Pat Garrett and Billy the Kid\", a film in which the singer/songwriter had a minor role.",
    "47": "A character who knows who he is and is quietly ethically uncompromising is placed in the center of a confounding situation. Nuanced writing, a pleasure to watch, because we come to know the characters through a glance, a stare, and a sigh. This moody film is reflected in the sets, design and lighting; it's not pretty, but at its core, like the lead actor and actress, genuine and in command of themselves. You have to admire them. I have already watched it twice. Someone needs to win awards for this film. It's got a \"3 Billboards\" vibe, and a talented cast to match. It is wonderful in the ebb and flow of tension till the final moments.",
    "48": "I read a few user reviews and completely ignored the \"expert\" reviews. This movie is AWESOME! The writing, directing, dark shots, and acting is PHENOMINAL! The eye contact(s) alone were so strong. Silverstone and Del Toro were so believable as a couple who have been together for years and are so comfortable with each other and protective of each other. Timberlake is a true artist: musician, singer, and actor. The following scenes are incredible: (1) Del Toro returning home with water in the driveway and what ensues with Silverstone, (2) Timberlake and Del Toro scene when there was a break-in at the Grady Real Estate building (eyes alone both thinking what is the other one thinking), and last but not least, (3) Pitt (from Boardwalk) when Timberlake pays him a visit. Pitt is amazingly creepy and continues to hold his own with powerful actors. 11/10 for this movie!",
    "49": "This movie is a little like a classic Michael Mann movie. Not quite to the standard of Heat or Manhunter, of course, but it brings to mind those and similar classics.Some complain about the unresolved storyline threads, but I find that to be much more intelligent and rewarding. Did his wife cheat with him? Doesn't matter, it just mattered how Del Toro's character responded to the potential of it. Who was the actual killer? Doesn't matter, once we know that the boyfriend was complicit in it.There are definitely some potential issues with the plot, such as the police not going to the victim's legal next-of-kin first, and the sometimes casual obtuse responses by some of the police, which don't seem to phase Detective Nichols, who otherwise has the nose for right and wrong. It seemed pretty implausible that the PO Box thing was so obvious and convenient to tie his DEA pal to the murders. But these things happen in movies and you have to take some of it with a grain of salt, there are only so many ways to move a story forward in two hours.For those reasons, I'd give the movie a 6, but Benicio Del Toro's performance is worth a bump up to a 7/10. The acting throughout is terrific, in fact, with Alicia Silverstone convincingly playing the role of supportive but heady partner. Justin Timberlake leaves you wondering all the while, with a perfectly muted but evocative performance. The secondary characters are mostly well-played as well, even if a little one-dimensional in some moments.Definitely worth the watch, if you like the actors and the trailer caught your attention, you will enjoy it.",
    "50": "One of the most gripping crime thrillers I've seen in a long while. A great plot with unexpected twists and turns that kept me guessing, and a solid cast with equally solid performances, particularly Del Toro. I was unsure of Timberlake at first, and whilst he takes a bit of a back seat in the movie, his performance was surprisingly strong. The films dark cinematography added to the overall suspense, creating a palpable sense of tension throughout. If you're a fan of suspenseful thrillers with a dose of some edge-of-your-seat action, then I would highly recommend adding Reptile to your watch list!",
    "51": "Always leaving you in the dark and forever keeping you guessing what will happen next and where it's going to go from there, this is the best way to describe this crime mystery thriller.Once you get past the long into and dive into the journey, this movie will keep you wanting more and more. And Benicio Del Toro delivers an amazingly dark and mysterious role like only he knows how. Although Justin Timberlake's role wasn't much at first it was refreshing to see him in a darker role.This movie is more of a story than an action packed adventure, so go into the movie keeping that in mind, but it will be worth the watch.",
    "52": "Great acting, brilliant beginning good middle. I was getting very excited thinking yes! Finally a really decent thriller. So disappointed then to get to the end and not have a clue who really did it. So many unanswered questions. Too may loose ends. I really would like to have known what happened.That said all the actors were really good. Alicia Silverstone and Benicio del Toro were a believable couple. She was a great supporting role. Justin Timberlake also gave a really solid performance\nAgain I wish I haf a full understanding of just what he did and didnt do.But did I mention .... Great acting.",
    "53": "I can't believe I wasted over 2 hours of my life watthing this movies. Benicio Del Toro has played in some entertaining movies like The Hunted and The Way of the gun, but this one is a movie with a plot that not even hangs together with a barbed-wire. It ends up being just a thing story about drugs, when it could have been so much more. But the real problem is of course the boredom, you need these movies to be way more intense. But maybe that's just Netflix these days, because really these is one of the worst I have seen from them in a lifetime. It is so much investigation that you just drown halfway into the movie and it's all about these inclusion characters that can't really act, but are just there for inclusion and a large paycheck. It's a shame Benicio Del Toro wasted his talent in a movie like this which should have been a lot tenser to really reel you in. Actually the performance done by Domenick Lombardozzi may be the only highlight in a very mediocre movie which I am really not sure what the purpose is, maybe to bore you to death? And making awful characters like Judy Nichols have the larger slice of the cake. The movie tries to catch you back with light flashes of tense music after driving you all the way into a large storm in the atlantic occean. But it never does catch you back again. I am really not sure why people may like this movie, because it's a really long drwan-out affair that may be one of the most hopeless movies so far this year. That's why it aint more than a 4/10 in my book.",
    "54": "I've read some of these reviews and some are awful, simply because some of the plot points went right over the person's head. They made their own plot holes. The dream the detective has, is just a dream. We know JT's character didn't kill his girlfriend, as he was somewhere else when she was killed and made sure to make calls and such, to go along with his alibi. Yeah they look in to him anyway, but obviously it couldn't have been him. The review that talks about this and the movie leaving the killer unknown, is written by someone who doesn't even know who the characters are. He thought the Uncle was the police chief, when he was the Captain. The Chief, is the guy who the detective goes to at the end, not knowing that he was also involved. We know the car was used by the person involved in the killing and we know the person who walked up to the house \"walked funny\" like with a limp..... Helloooo, we know the police Captain has MS, which is why to that neighbor, he walked funny. Whether or not he physically killed her, is irrelevant. Most likely we can assume that Wally may have been with him and that he's the one with the strength to have killed her. Yes, I think by the time we get to the end of movie, we know that obviously the police chief seems to be in on everything, with the way he acts when given the flash drive. It makes sense from within the movie, though, that the detective wouldn't think that the chief is involved. For some reason, that bad review also seems to think Wally is DEA, when he is clearly another police officer working at the same station; how over 200 people found that review helpful, is very very sad. It doesn't matter who the 2nd person was at Eli's house, when we figure he is killed. It's likely Wally, but who cares. The wax at the end of the movie is something done to help wounds heal, as we can see the detective was shot through his hand and it's healing; another thing that went over the head of the other reviewer. In the end, this was a very good film, with decent twists and very solid acting all around. Don't write review when you're not capable of understanding what you're watching, especially in a film that doesn't leave thing ambiguous.",
    "55": "A Netflix original starring Oscar winner Benicio Del Toro (who co-wrote here) currently streaming. A woman, Matilda Anna Ingrid Lutz (from Revenge), has been found dead in a luxury home which she was selling as part of a mom & son realty operation run by Justin Timberlake & Frances Fisher. Del Toro is assigned the case by his wife's uncle, played by Alicia Silverstone (wow an Excess Baggage reunion!) & Eric Bogosian respectively, as the clues & evidence point to Timberlake being the culprit, more candidates emerge namely an ex-drug dealing husband, Karl Glusman, & a son, Michael Carmen Pitt, of a client of the realty firm who feels they ripped his family off. Del Toro is excellent here; taciturn, stoic, a man who truly only moves & speaks when he needs to so when the layers are peeled away for this particular murder you're just as shocked & thrown off as he is. Special kudos to music video director Grant Singer's muscular debut in a genre not made any more. Co-starring as Del Toro's fellow detectives are Dominic Lombardozzi, Ato Essandoh & Mike Pniewski (from Starz' High Town).",
    "56": "If I have to see one more murder mystery where a cop or two cops go to arrest a suspect and one cop leaves a single cop to do the arrest while leaving the room, I'm gonna puke.Not only does that NOT happen, but they literally bad a bunch of cops OUTSIDE the house, but none of them went inside? That is just ridiculous.The sound design and music overwhelmed a lot of the scenes and became distracting. And the melodramatic slow motion shots. I.e they tried to force the tone and emotions way too much.A lot of stuff just went nowhere. However, it was still decent despite a lot of things not making ANY sense or characters forced to do things they would never do in real life, just to create drama.",
    "57": "This Netflix production is a pretty solid piece of crime escapism for 2/3 of its running time - a taut police procedural rich on characters and atmosphere. Benicio Del Toro leads the way with his typically naturalistic style, and the mystery hangs aptly in the air as we close in on a handful of possible suspects. The modern TV style production values and pacing are agreeable here, at least until the final third approaches, at which point Reptile takes a sudden turn towards genre-bound cliches. Instead of intensifying, the suspense drops abruptly as everything gets \"solved\" by a very convenient plot device, leaving plenty of open questions regarding the detective work the movie had been so meticulous about up until this point. An ending this sloppy becomes all the more disappointing when the groundwork has been as solid as in here. There is a fine supporting turn from Alicia Silverstone as Del Toro's wife - they represent a refreshingly sound relationship for the police genre. The effective musical score is by Yair Elazar Glotman.",
    "58": "I recently watched Reptile, starring Benicio Del Toro, and it was an interesting and exciting thriller! Detective Tom Nichols (Benicio del Toro) and his colleague Dan Cleary (Ato Essandoh) are tasked with solving a murder case set in the town of Scarborough. Their victim is Summer Elswick (Matilda Lutz), a real-estate broker, and the two detectives take a closer look at possible suspects, including Summer's boyfriend Will Grady (Justin Timberlake) and her ex-husband. The suspense builds throughout the entire movie, and Del Toro's performance was incredibly captivating. The plot twists and unpredictable ending kept me on the edge of my seat, and I would definitely recommend it to anyone looking for a thrilling movie experience.",
    "59": "A girl was killed in a house and then detectives suspect her boyfriend and husband...\nBut after starts investigation they findout lot of things and reveal more culprits...\nLot of twists and turns have in this movie..\nMust watch investigation thriller movie..!!A girl was killed in a house and then detectives suspect her boyfriend and husband...\nBut after starts investigation they findout lot of things and reveal more culprits...\nLot of twists and turns have in this movie..\nMust watch investigation thriller movie..!!A girl was killed in a house and then detectives suspect her boyfriend and husband...\nBut after starts investigation they findout lot of things and reveal more culprits...\nLot of twists and turns have in this movie..\nMust watch investigation thriller movie..!!",
    "60": "Grant Singer's Reptile runs at a slow pace. Story I a real estate girl murdered. And investigation. There is a suspense where everyone seems deceitful except the main guy. Essentially story of drug laundering using real estate. Not really sure what the relevance of the snake skin was. Justin Timberlake and the detective Benevio Del Toro has acted really well. Last scene of catching the culprit was pretty cool. Overall I have to admit dozing off first time, and having to rewind again to see what happened. Can't understand some parts as well. Also is his mother part of it not sure. One time slow watch.",
    "61": "To reveal my bias up front, ever since I first saw him in \"The Usual Suspects,\" Benicio del Toro has been one of my favorite actors. And here's yet another slow-burning performance by this still-underrated actor in this thrilling murder mystery. The supporting actors are also quite good in it: Alicia Silverstone as Benicio's wife and Justin Timberlake as a suspicious realtor who was the victim's cuckolded boyfriend. Eric Bogosian plays a one-time mentor and a long-time friend of Benicio's on the police force, and Frances Farmer plays the mother of Timberlake's character. (A '90s Chrysler Imperial is also a key character in this somewhat convoluted plot.) And I'd also like to mention another underrated character actor, Michael Pitt, who's almost not recognizable as another dark lurker named Eli. As legendary redneck drive-in movie reviewer Joe Bob Briggs used to say, \"there's almost too much plot gettin' in the way of the story here.\" But the several excellent performances make it well worth the 2-hour+ time investment. 8/10.",
    "62": "Struggle for a while to find thrilling movies like '' reptile'', its intermeshed and complex like an astrophysisits' aritmethical algebraeic formulations, a sneaking tiger of benicio del toro magics in the den within the den of the den, where the den is police, narcotics and corruption.I love the kind of setup, that gave me vibes of some of the best thillers made in the 1980's, the invisibileness of crimes made within the blueeys really engage and thrills even today. Ill make a note on the delightful lack of digital investigation, along with a very well cut musical score, and last but not least a camerawork that makes an amateur reviewer's witt awestruck by the great craftmanship.Allthough it has got a soaringly long playtime, its made for grumpy old reptiles like me, so i recommend a bite, its thrilling and lethal...",
    "63": "Can anyone explain the surgical glove in the final\nScene and why call the film is called Reptiles? This film had so much promise but Spoiler Alert - it was concluded with a fairly stereotypical bad cop good cop ending! Come on Netflix try harder please this had a 7 star rating and I hoped to rely upon IMDB ratings but this shakes my faith completely.Del Toro was very watchable.There was the promise of a complex story and the process of whodunnit was a fun experience but ended ultimately in disappointment... almost seems like the scriptwriter ran out of juice or inspiration as it were.So I'd recommend a more traditional film if you want a good whodunnit like an Agatha Christie with a lot less American shizzle and a lot more depth and ultimately a clear conclusion.In my conclusion a poor script took over what could potentially have been a great film. Just required a good dose of creativity.Work harder Netflix / Hollywood / whoever you are. Kind of agree with the reviews that reference the use of an AI Bot. Maybe this was just such a script but then I would expect someone of Del Toro's calibre NOT to accept such a script!",
    "64": "In slow-burn murder-mystery crime-thriller \"Reptile\" Benicio Del Toro (outstanding) is a New England cop (married to Alicia Silverstone) who with his colleagues (including Eric Bogosian, Dominic Lomardozzi, Mike Pniewski & Eto Essandoh) probes various suspects in a woman's slaying: bf Justin Timberlake; ex Karl Glusman; & creepy weirdo Michael Pitt... but as the case progresses it becomes apparent it has deeper depths. Its character-rich writing (from Del Toro, Benjamin Brewer & debutant Grant Singer) engages as it darkens & intensifies, and Singer directs (also on his debut) with stylish polish. While not as explosive as the absolute best-in-genre, it's not too far off.",
    "65": "While IMDb reviewers get it more right for a change compared with their Letterboxd peers, Reptile is nonetheless woefully underrated. There must be some truth to the seemingly stale criticism that today's audiences have a short attention span. The number of people complaining that this movie is too long... Well, these are folks who don't understand how to enjoy a slow burn, tension-filled movie. I was literally on the edge of my seat off and on throughout. The score perfectly companions the pacing and the editing. Reptile is a triumph of suspense. The acting is superb, and it's really great to see del Toro in a role like this, given how easy it is to cast him as the weird guy or the psycho. The script is deft, the story is compelling, and the conclusion is satisfying. Even the title is thought-provoking. There are a number of allusions to molting and other things reptilian. I'm still thinking on that. It is so rare these days to find a true suspense movie, let alone one that succeeds as well as this one does.",
    "66": "Some ease and platitudes in the final outcome of the plot (fortunately made up for by a charming deus Ex Machina), but a detective film which focuses on the majesty of its editing and the mystery of the characters without giving too much into easy psychology is rare enough to note it.The very short epilogue after the resolution is beautiful, leaving no doubt about the fact that the film focused on the interiority of its protagonist and the reconquest of his dignity much more than on the whodunnit which served as a pretext and backdrop.Del Toro is at the height of his extreme mastery, with this elegance and false nonchalance which characterize him so well and make him a fascinating actor to contemplate in every shot.",
    "67": "I gave it a 10 in lieu of and 8 to offset some of the troll ratings. Acting, writing and directing were great. Highly recommend watching this if you like crime, police dramas. Benicia Del Toro and Alicia Silverstone were perfect together. He's great of course but she was really good, and of course still beautiful. I only had a couple plot holes to get filled but I'll watch it again to see if I just missed something as it was over 2 hours. Beautiful scenery on exterior shots, some dark interior scenes. It left me guessing until 3/4 of the way through and still a couple surprises came. I'll be watching for this directors work again.",
    "68": "Impressive direction. Although a slow burn of a story, the direction was decent at building suspense. The acting was generally good and Benicio did his usual excellent work. It was great seeing Alicia Silverstone again but it felt like she was a forced fit and mostly a distraction as Benicio's wife. There's just no way Benicio's character would have married an ex-Valley girl 😀.The movie was done-in by a murky, complex plot with too many poorly developed characters. In essence, it told the same story that has been told hundreds of times before and to greater effect. If you like films leaving questions unanswered or vaguely hinted at, this may be your cup of tea. I should have passed.",
    "69": "This movie was surprisingly entertaining. It features a solid cast turning in solid performances. I was pleased to see Alicia Silverstone & Del Toro reunite, and they proved to have enough chemistry to form a believable and formidable couple. Timberlake was decent and not at all cringeworthy. The script is really good, which is a feat in this genre these days (we've kinda seen it all by now). I thought it was going to be more predictable but I was wrong; the twists truly had me intrigued. Some of my suspicions were correct but not always exact. The ending leaves a bit to be desired, but all in all this movie was worth 2 hours of my time. I enjoyed it enough to leave a brief review, and that says a lot.",
    "70": "It seems that there is an escalating trend I've noticed with the growth and increased significance of streaming services to the film industry. Lots of major actors are featured in straight-to-streaming films that appear to be produced on tiny budgets -- and hence, poor quality. Yes, on Netflix, too, which is where I watched this film.I am a sucker for noir-type mysteries, especially those with great titles like \"Reptile.\" I hoped to enjoy this film but I could never get into it - mostly because I kept thinking, \"This is like a film school project with a big name cast.\" The build up was worthy; but, unfortunately, I can't say the same for Benicio's acting. He was just going through the motions, collecting a check.The mystery? Yawn. The revelations? Wake me when it's over. And the ending's big reveal? WEAK! This felt like a low budget made-for-TV flick, not a feature film.",
    "71": "I still sit shocked that the talent involved with this film could possibly disappoint THAT much. I love Del toro and he usually makes solid choices but this was garbage! I kept watching thinking, \"It will pick up and get better...\" NOPE! The audience watches all these characters and there's no movement. It's a meandering series of minimal content with a cast you are expecting A WHOLE LOT more from. Sci-fi channel could have made this. There was no depth to the faces you're excited to see. This was a solid waste of talent for DelToro, Silverstone and Timberlake. The writing was so poor they couldn't have saved it.Eerie music dances in the background while the audience is begging for ANYTHING to happen and it doesn't. I didn't get a solid sense of direction whatsoever. Further character development may have helped. I watched at 1.5x speed and it still didn't bring action. There were subplots unrelated and, characters scattered around. There was never a dramatic moment that pulled it all together-to even remotely make up for what I had sat through at that point. It was a solid waste of time.",
    "72": "This movie was sooooooo much better than I thought it would be. It's not horror at all, if that's what you were looking for, it's murder mystery/detective and you would not believe who was the responsible party and that's what makes it so great.I looked up the main character and he helped produce it. I saw him as an Al Pacino. I don't want to say he carried the movie, but choosing him as the protagonist really helped. He did a fantastic job in both acting and directing. It's a bit long for some, but if you get on the ride and stay with it, you'll see how crazy the storyline is. I'll give it a 7.9/10.",
    "73": "Where on earth was the promotion for this film? It was by complete accident that I found it on Netflix today. Either I need my eyes tested or Netflix gave up on a film they thought would be great?Either way I'm extremely pleased I gave this a shot, and wow is this film so so close to being a great film. It was everything you want from a murder/detective/thriller. Great lead actor/character, fantastic ensemble, complex story and lots of twists. Plus add the terrific directing that 100% deserves a shoutout, I was absolutely gripped for about 1hr 45min of the just over 2 hour runtime.However, there is one glaring error that keeps this film from being great! That is the woeful third act and ending, you can't help but talk about spoilers with this film. To me it feels as if the writers, director or Netflix themselves either ran out of time, money or effort to give this film a fantastic and warranted ending. 3/4 of this film is brilliant, it was awesome to follow and kept you guessing who the murderer was. Plus the bigger conspiracy behind the families drug business, in with some of the police. You have all the ingredients to make something spectacular. Sadly it just ends super fast and with a whimper. Benicio Del Toro's character finds out all the info, kills the bad guys, Timberlake's character is seen arrest by FBI.....the end. Within 10 mins of the 2 hr runtime everything is wrapped up far to easily and quickly. Plus maybe a bit of ambiguity may have elevated this film even more.It sucks so so much because I want to love this film however that final act has felt a real bad taste in my mouth, like I've been short changed. Even so with all that in mind I'd still love to watch 3/4 of this film again and still think its very good. 75% out of 100, not your average thriller by any means!",
    "74": "This movie took forever on where it wanted to get to. It was very bogged down by a 2 hour+ run time. It's a shame as well because there is a very talented casted assembled here. Where the fault lies is the direction, identity, and pacing of the film. I love me a black noir thriller/mystery but this just didn't pop the way I thought it was going to. I feel there were some uneccesary scenes in this film and if they were cut out it would have helped. Benicia Del Toro and Justin Timberlake give average performances but nothing to rave about. I believe underneath the layers of this film is a decent movie. Reptile gets low stars out of 10 from me.",
    "75": "I saw on a Sunday night and the night before on Saturday I watched the Killer with Michael Fassbender. Now I am only stating this because the have exactly the same imdb rating at the moment. In my opinion this is a much better film. The story unravels in excellent pace, the characters all of them are well acted. The best part for me was that almost constant unsettling feeling, not many films achieve this mostly because they are action driven. The only thing I would have liked to be resolved -and wasn't- would be the fate of the protagonists police partner.All in all a very good movie, a solid 8.",
    "76": "I don't like when I have to write the movie myself. All along the movie they lay out pieces that I was hoping they would weave together by the end but nope. You're left with a bunch of why this, how come, what for, who was that, who was involved etc. And at 2hrs+ you had plenty of time to do it.I don't know if the missing pieces were edited for time or what. I was really enjoying until it ended weakly. Performances are good but nothing to award. Benicio always shows up. It was honestly good to see Silverstone back at it. Timberlake, I'm sorry to say, is just in the movie as neither a plus nor minus.Note to Netflix: Less is more. Spend less on making the okay many and more on making the great few. My two Lincoln heads.",
    "77": "I think this movie deserves a much better rating, it is really very good, mysterious, criminal and exciting until the end.The movie has a noir and creative touch, which makes it more interesting in my opinion. It didn't seem predictable to me at all, just in part, difficult to explain without spoiling it.J. Timberlake only has a supporting role in my opinion, I can't say much about him, what I saw is okay, the absolute star is without a doubt Benicio del Toro, I love this actor. The only role I found it unnesessary was from the actress Alicia Silverstone, it doesn't add anything, but I guess is personal.In short, I think it is a very exciting and mysterious thriller, don't miss it if you like good crime thrillers with a twist.",
    "78": "This was unexpectedly good and especially from a director who has nothing similar in his palmare. The whole feeling of the plot and the acting reminded me the Michael Mann of the 90's and early 00's. For sure it wasn't something new and it didn't create a new genre by any mean but the atmosphere as a whole is like those smells and tastes we all have written in our memory since we were kids. It feels so familiar when something bring them up in front again. Of course the script and probably the post editing of the movie has some minor inaccuracies and some of the main characters suddenly move out of the scene without apparent reason or explanation but this does not spoil the fact that this is a well crafted story.",
    "79": "Detective police thriller, the threads of the investigation of which will lead to unsolved crimes and unpredictable consequences.The film tells a complex story without delving into the inner spaces of personalities, but also does not neglect the individual characters of the actors.Benicio Del Toro is the decoration of any movie, he plays great, the weapon in his hands seems to be something natural, and this further emphasizes the vivid image. Interesting complicated crime, excellent director's work, a great script? What else do you need to please the audience? Answer: \"I don't need it anymore, but I wouldn't mind\" :)",
    "80": "Director Grant singer debut flick reminds us of legendary David fincher style of movie making with each and every frame needs a serious attention with some good elements to appreciate if ur fan of slow burning proceedural thriller...\nOn course the flick faulters in post mid runtime as the imprint on the victim and the church episode does tricky mislead to confuse the audience...\nThe investigative murder mystery travels through multi-layered frame peeling off cleverly with multiple suspects thats where writer Benjamin brewer shows his brilliancy and later getting to the conclusion instantly on the last 19th minute or so ....\nOverall a genuine brilliant piece of cinema thats definitely not be missed.",
    "81": "This is an excellent film that has a really creepy vibe all the way through. The paranoia and suspicion make the viewer doubt every characters honesty. The atmosphere builds steadily and the plot has good twists which keeps the uncertainty brewing.It has a strong cast and the acting is superb. One gets really invested in the main characters. It's great to see Alicia Silverstone back in a major role. Benecio del Toro's brooding presence is perfect for the film.I would highly recommend this film. The camera work adds to the creepiness and the the whole thing is a very well directed and acted package. Enjoy!",
    "82": "This is a movie that will hold your interest. It has a lot of suspense, and the ending is one that will surprise most. It starts out a little slow, but it builds up and is a good who done it type flick. There is some really good acting from Benicio Del Torro, and I was really surprised at how well every actor handles their roles. They were very believable in their parts. There are some questions that are not answered, and the ending is a bit odd as I would have liked a bit more closure to the movie. But overall, this is well worth watching and much better than most of the crappy movies that seems to regularly come out of Hollyweird.",
    "83": "People every day face the situation our protagonist is facing...every day all of us are given choices that cause us to question ourselves and the people we care about and are intertwined with. The choices seem mundane but added up they change our lives in ways we can never predict. This story isn't flashy. It's not a new story. It's people you know...people you like, it's people who touch your heart. People you call friend. People you call enemy. All in a day's work. Maybe it's you. It's an everyday story. But make no mistake it is not a boring tale...our characters are well fleshed out without being predictable. We're able to catch glimpses into each of our characters. See a bit of darkness and light. What would you choose? Who would you choose? What would you do? Who do you really think you are? And who are you really?",
    "84": "People giving this 10/10 can't be taken seriously. This movie doesn't even come close to the quality of a film like Prisoners which is a genuine 10/10.Likewise people giving this a 1-2/10 are just silly and more likely reflect the reviewers' anger that their expectations given the cast weren't met.The best reviews here are those giving score between 4-7.One issue I haven't seen discussed is what the point of Silverstone's character. Her character adds nothing to the plot nor does her relationship with the protagonist add anything to his character. For a relatively long and slow film nearly all her scenes could have be cut.The other main criticism is one that's perennial in the mystery genre is that if you give too much away the audience gets ahead of of the story, if you obscure more you end up with a Scooby Do-high exposition reveal. This movie suffers from the latter.",
    "85": "This movie starts of interesting, starts to the point,Yet goes no where. Acting is very well delivered but the pace just doesn't seat right. It's a little bit confusing at times, especially by the time you get to the end of the movie you just don't care. A lot of stupid decisions and a lot of unanswered questions that just don't come together. If you like murder mystery movies like I do ,skip this as it's not at all that intriguing or thrilling. It's a mystery that adds more mystery and questions that you never really receive an answer at the end of the film. YES there are answers but don't come together that well and missed opportunity.",
    "86": "First, let me quickly touch on the strong points of the film; it has very good acting, with everyone giving their best performance. Especially Benicio Del Toro did an excellent job; I really enjoyed watching him in this film.The script, in my opinion, started off very well, but in some places, it became too obvious that it would ultimately be about money laundering, and the characters of Justin Timberlake and Frances Fisher, who plays his mother, gave it away so much that it was clear that this was a network they were running. In my opinion, the film lost all its mystery at these points. The most specific example is when Will Grady goes to get a girlfriend; it was the worst choice in the film, and it definitely dragged the movie down.I also didn't like some of the scene transitions; they felt like they were trying too hard to create tension. However, despite all this, I found Grant Singer's cinema debut quite promising; with a better script, I believe he can do much better.Apart from these shortcomings, the choice of locations and the tension in some scenes were well done, and I liked them. Also, it being a slow burn was valuable; as I said, if the script didn't give away so much, it would easily be an 8 out of 10.In conclusion, it's a solid thriller worth watching in the evening, but my humble advice is not to trust anyone.",
    "87": "My review contains a kind of spoiler that does not really spoil much. You can definitely watch it after reading. The movie has a good start and looks promising but it does not meet expectations in the end. Detective movie with decent actors and some suspense moments here and there, but the plot does not really fly. How's that in 2023 they still make movies in which the pen drive is the only thing the contains the proof of guilty, and of course you hand deliver it to one of the unexpected perpetrators, while you didn't make any copy of it anywhere. Seriously, let's stop this because it is not thrilling anymore. By the way, nowadays it's all about tv series, while I really miss watching actual movies. This is a movie, not an amazing one but not bad either, give it a try.",
    "88": "Much build-up with a great atmosphere and good acting and ...... nothing , just continues for more than two hours ,until a bland and uneventful ending ... If it is so long , it should be on a par , or at least make it shorter ... Unfortunately , but I can't give more than 5 stars , which are only for the first hour . If the second would be even close , it would be probably an 8 stars review...\n600???(((\nmuch build-up with a great atmosphere and good acting and ...... nothing , just continues for more than two hours ,until a bland and uneventful ending ... If it is so long , it should be on a par , or at least make it shorter ... Unfortunately , but I can't give more than 5 stars , which are only for the first hour . If the second would be even close , it would be probably an 8 stars review...",
    "89": "I was expecting lizards, there were no lizards. It was an okay thriller, nothing noteworthy.I was not to thrilled out by the plot. Although, Benecio is always a treat. I kept mixing up his wife with the blond chick from Psych, totally not the same person.The pacing was an issue for me too. It felt too drawn out. The acting was good, I felt convinced, Benecio was showing cool age. The story seems over-done.Still figuring out why it's titled lizard... I mean Reptile. I mean, is it because the mother kinda looks like a reptilian? Justin should stick with acting, I'm still not sure why I can't associate him with more serious genres.",
    "90": "Wasn't bad but just weird. I thought with so many big names it had to be worth watching. I've seen Timberlake in other movies and his acting never bothered me but it really wasn't my cup of tea this time.I'm not really sure what feel they were going for with the music but the majority of it was just eerie, which made it weird. I caught myself imagining scenes without the strange background music and thought it really would have been better, but that's just my taste I suppose. If I watched this in theater I would definitely fall asleep.This kind of felt like a struggling actor's montage. Sorry if that offends anyone, but...",
    "91": "I should not have tried this film; because I usually get asleep watching investigation plots, except the likes of SEVEN, ZODIAC, or a couple of other ones for which one hand fingers would be far enough to count them. So, I discovered it on netflix and tried it. But of course, I rapidly got bored, despite Benicio Del Toro's presence and a good directing. I was so bored, bored, because there is nothing riveting, tense, only Del Toro's presence and charismatic physique. I don't say it's not a good film, but I nearly fell asleep for a movie which doesn't belong to a category that I am used to be a big fan of. It's my fault, after all.",
    "92": "Turned the movie on because of the premise and (honestly) the cast. Had not heard much about it, but watched it now and this deserves more popularity. I read that people find it a slow burning movie which I somewhat agree with but there is still plenty of stuff hapening right from the start. I like a slower pace series or movie, so that did not put me of but I know for some it will and that is a shame because I was hooked form beginning till the end. Benicio del toro plays very well the quiet and tough police officer. The film has eerie vibes, especially the last hour or so. Music added beautifuly to the already very suspenseful scenes. It was the right pace to build up that suspense and it was like a snakes tail; then it was going this way, and then another twist and turn. It was thrilling and it just captured me, and because of that perfect build up and pace, it sucks you right in and you want to follow along the story. Great perfomances overall and I am really impressed by it.",
    "93": "Film icon Robert Mitchum epitomised the detective who slowly deliberately unraveled murder mysteries. His swaggering walk, his talk, his \"less is more\" performances were brilliant...But now Del Toro's awesome performance sets a new and higher standard for the tough no nonsense badass intelligent detective. His character is focused on finding the culprit and despite some missteps...well... watch to see the \"surprise\" climax. So yes a 10 for DelToro ...the rest of the cast try but cannot compete with the natural magnetism and deliberate patience of Del Toro. The only actor who comes close to a respectable performance is the understated but sneaky character performed by Timberlake - is he the reptile? The musical score is a blah...the set design and cinematography could use some inspiration...",
    "94": "This was a good murder mystery. There is a lot of time building up the mystery and the possible suspects seems to change all the time which made it interesting. The use of music and sounds were used very well. The acting was also very good from the entire cast.If action is what you are looking for then there isn't much here but if you are into the details of detective work then this will be enjoyable.The film is easy to follow and the story is well written .There was more to learn from the characters as the story continued to build up. The one negative is that there comes a point where the audience and the characters in the film know who the killer is and then the film seems to drag a bit after that.",
    "95": "I had high hopes for this. Everyone loves Benicio Del Toro. But love can only carry one so far. After a certain point the project has to carry its own weight. This movie is excruciatingly boring. The score is heavy handed and is constantly telling the watcher what to feel and how apprehensive to be. Back out the score and it's an endless slow boring journey to nowhere. Some of the actors have talent. The guy from succession. Benicio Del Torro of course. Beverly D'Angelo lookalike Alicia Silverstone gives an ok performance through some extra pounds as does Justine Timberlake. I guess plus size is hot over at Netflix.",
    "96": "The look, the grading, the sound: everything ist so sub parn from the beginning, that I doubted it's going to pan out. It's clear from the begining, that the husband is somehow involved, it's clear from the first time the evil stupid looking cop is showing up, that police is somehow involved. Whatever: I only made it through 2/3ds & had to stop watching. What a waste of time, what a waste of benicio del toro's talent. The sound recording is awful, it sounds like cheap synchronsisation, no sound recording on set, no atmorspheric recordings, the sound is simply dead. The lighting is as awful as the grading: looks like cheap video with a yellow/ orange cast overall. The story: some standard neo noir, but: no timing, no meaningful dialog, terrible editing, loaded witch cliches. How can such a thing even happen? Was there no time at all to rehearse, work on the script, think about camera & lighting & sound recording? It's like they forgot to record the sound an dubbed it afterwards in a cheap studio in hambug in one afternoon. Whatever: unbearable. Unwatchable. Netflix: shame on you.",
    "97": "Reptile is Netflix version of the old network style movies of the week. What works is there some big names. Just like Robert Urich, back in the day, there is Del Toro, and others. A murder mystery concept with a transplant Philadelphia cop on a rural murder case grabs the viewers attention! What does not work: Slow dragged out dialogue which murders the viewer slowly; maybe a slow burn effect which is too slow. A lower budget movie just like the old networks movies of the week. The low budget gives a campy quick and cheap feel for a bad film. Not a bad movie, my wife liked it, but I found the script too slow. I seen better old Miami Vice episodes. 4 stars.",
    "98": "This was a great film with solid performances by all. While Silverstone, Del Torro and Timberlake were reminiscent of past characters I found it perhaps the one comfort of the watching experience!The 1 stars are rediculous, I was on the edge of my seat for the whole thing, but came here to say this has got to be based on the Vancouver real estate murder crime of Lindsay Buziak who died in eerily similar circumstances complete with mummy's-boy real estate boyfriend and so on (I don't want to spoil anything).If you like this and want to know more I recommend Caesfile podcast episode 28 which goes into fhe details of the crime, the mystery and the theories surrounding.The \"slow burn\" descriptor was apt, it burned through my adrenaline.",
    "99": "Briefly, the film centers around Tom (Benicio del Toro) a seasoned detective investigating the murder of a real estate agent and subsequently uncovers a plot involving drugs, cover-ups and corruption. It's certainly one of Netflix's better offerings of feature films; it has some excellent performances most notably from Benicio and Alicia Silverstone (who plays his wife) and the supporting cast also turn in a solid shift. The cinematography is also generally very well done and is well used to build tension at times subverting the expected direction a scene might go. The soundtrack gets used unconventionally at times to also keep tension throughout the movie and though it results in a few too many red herrings I do appreciate the creativity.While I enjoyed the slow and subdued build up as Tom uncovers more and more of the conspiracy, and the actors keep you engaged throughout the movie, the runtime does eventually out-run the actual plot which turns out to be a fairly run-of-the-mill trope that's been done and Reptile doesn't do much different to help it stand out. As a result, that slow build-up of the mystery during the first 3/4 or so of the movie then sadly underwhelms a bit in the last 1/4 when it becomes apparent that the plot will play out fairly conventionally as one by one the red herrings turn out to be just that. If anything, it tries a little too hard at the end by having the chief in on the conspiracy as well which is about as predictable a trope as you get in these kind of plots. All that isn't to say it's not an enjoyable movie still, it's just pegged back from being particularly memorable.",
    "100": "Benecio Del Torro and Alicia Silverstone really anchor this film with their solid performances. This is one of those atmospheric crime movies that keeps you guessing. The first half setting up the story is solid but unfortunately there are so many plot twists in the second half, it gets a bit confusing. Solid performances throughout with the exception of Justin Timberlake who turned in a wooden performance. He was seriously miscast and it becomes so evident because he's up against some heavy hitters acting-wise. Towards the end of the film, I had this dread that it was going to end badly and dramatically in a film noir type denouement. Thankfully, the ending was satisfying. Not a great film, but definitely watchable and a must see if you're a Del Torro fan!",
    "101": "Started off good with Justin Timberlake and his little back story and then moved on to the main character Benicio Del Toro who played his character effortlessly and with charm. The scenes were masterfully put together without giving anything away too soon, very well directed. The pacing was also perfect, kept my interest up throughout. Every other actor did their job nicely too. I liked this a bit too much, more than I should have, maybe because for once politics weren't included, very much like a thriller in the early 2000s. There's also a twist at the end too, which is like the icing on cake.",
    "102": "Decent cast and the ever brilliant Benicio Del Toro in a modern film noir that entertains and keeps the interest whilst falling some way short of greatness. I found the music score and incidentals a little intrusive/over the top at times and the film sometimes just feels like it's trying a bit too hard to be clever. Overall It works though because Del Toro is totally watchable and you kinda forgive the film it's failings largely because of this. A lesser actor would've struggled to keep it all together way before it reaches its finale. Silverstone and Timberlake put in solid supporting performances, the writing is decent if a little convoluted.All in all well worth the watch despite a number of shortcomings...",
    "103": "Every one talks about it being a \"slow burn\" but to be patient for the twists and suspenseful turns at the end.... Nothing about this film was shocking, or implausible to the extent that it wasn't predictable. The end..? Omg... THAT was the ending?... OK!Talk about rushed and over simplified. Plus we never see what happens to a character that played a role in uncovering things, it was just left to speculation.I love Del Toro, but this one was lame and predictable. They do not make cinema the way they once did everything is so rushed.Not worth the watch, unless you are stuck on a plane or something...",
    "104": "I've enjoyed most movies that Justin Timberlake has done so I decided to check this one out. It's a slow, slow moving whodunit kind of movie.It started out kind of calm and slow. There's been a murder but nobody is just overwhelmingly devastated about it. Well that's pretty much the pace of the entire movie. You're given a \"list\" of possible suspects, anyone of who could've done it. But they just drug the movie out so bad, I fell asleep and when I woke up it was almost over and I still totally understood what was happening. I won't watch it again to find out what I missed because it couldn't have been that important or I would've felt the need to rewind.I gave it 6 stars because the acting really isn't bad, the story is your typical murder type mystery. But there's no excitement to it. It's worth a lazy day not really in the mood for anything else kind of movie.",
    "105": "I was compelled to watch this movie because of the actors. I found it to be a good story and was relieved it was not a B movie about a giant killer snake. I was not sure where the storyline was going to go, but did figure it out well before the reveal. It felt like a movie that was based on a book because there were pieces of information that seemed like we should have had a bit more for them to really feel like a part of the story. I especially enjoyed seeing Alicia Silverstone in the role of the wife of the main character. Her character was smart and engaging and their marriage was relatable in that they shared things with each other. As to the pacing some have mentioned I have a habit of watching on the app at 2X speed so no problems there. Overall this was a very solid, enjoyable movie.",
    "106": "Reptile epitomizes the mediocrity that plagues many Netflix movies. Its lackluster plot, uninspired characters, and feeble attempts at humor make it a snooze fest. In a sea of uninspiring Netflix releases, \"Reptile\" stands as a poster child for the term \"boring.\" It's a film so devoid of entertainment value that it makes you wonder if watching paint dry would be a more thrilling option. Netflix should be a platform for engaging and innovative content, not a source of cinematic sedatives. If you're struggling with insomnia, \"Reptile\" might be a more effective sleep aid than Ambien. Avoid this yawn-inducing disappointment at all costs.",
    "107": "So many things that are included in this story... but why? Why did we see that there's a hand injury to Del Toro's character? Why did the murder victim have bite marks/not bite marks on her hand? Who murdered her? Why involve an old car? Why hide the car? Why were a bunch of dirty cops involved with a real estate company? Why did we have to see so many close ups of Del Toro's eyes? Why was Silverstone flirting with contractor? Why were they square dancing? Who square dances these days? And so many more questions...So many things that just didn't work and just seemed to confuse.They had some good actors and that's what drew me in but it's a shame it wasn't laid out better.",
    "108": "The kind of movie you start doing a creative autopsy on while it's still live: What went wrong here? Why is everybody acting so creepy and ominous? It's confusing with no explanations. The drama exists only in the steely eyed gaze of Benicio and the rest of a charitable cast of professional actors, who donate character husks to an empty story.You can feel a huge void watching this movie: of stakes, of realness, of actual suspense, as opposed to non-suspense slathered in suspenseful music. The actors are also over-praised, but it's like getting a shot glass of water in the desert - you're thankful for anything.",
    "109": "I can see why some people may like this film. Certainly if you are a Benicio Del Toro fan, you will have your fill of him brooding through many a scene. For me, this was far too slow paced. Which would have been fine, if I was really bothered about finding out who killed our extremely dull realtor. The set up and murder itself was so uninspiring, that it left me totally nonplussed about what was to follow. I stuck with it for 60 minutes, but found myself yawning repeatedly due to total boredom. I have given it 5/10 as the quality of the acting was good, it was just the story that didn't grip me.",
    "110": "SLOWburning detective movie and when I say SLOWburning then I mean really SLOW. Sorry for all these capital letters, but the first hour nothing much happens and I was wondering if anything was about to happen at all. Well, fortunately it did!The REAL suspense and thrill (only slowly yet steadily) intensifies during the second hour, which gets really creepy and intense, with a final that is like a sledgehammer. Wow. Really impressed by it.The good: Benicio del Toro Benicio del Toro Benicio del Toro.This man has got charisma few other actors (are lucky to) have. He really steals the show, with his very subtle acting skills, that convey so many different feelings that simply watching Benicio del Toro lifting up a small glass to drink is fascinating to watch.Benicio del Toro co-wrote the screenplay and he co-produced this movie as well. So he had a lot of cloud. And it shows, because this is one heck of a Benicio del Toro flick.The director made his feature movie debut, with only having made lots of music videos before and although I dont think his direction was terrific, it certainly was a masterful debut.Quite impressed AND spooked out by it. Recommended for the art house movie fans of slowburning (yet still suspenseful) detective movies.",
    "111": "This slow-burner of a murder yarn may just turn out to be the best thriller of the year. A realtor is found dead by her colleague and partner who naturally becomes a suspect but then there are a few other men in her life who are also suspects; so far, so common-place but Grant Singer's \"Reptile\" is as much about the police investigating the killing as it is about the investigation. These are a close-knit bunch of cops who both work and play together and who may not be as clean as they should be.A sterling cast, (Benicio Del Torro, Alicia Silverstone, Justin Timberlake, Eric Bogosian, Michael Pitt, Frances Fisher), add a further touch of class to an already classy thriller and one that is as far from conventional multiplex fare as you are likely to get. It may not always be that easy to follow and midway through the killing seems to fade into the background but it's always highly intelligent and while it may not appeal to a mass audience I think it has cult status written all over it.",
    "112": "Music-Director Grant Singer Teams-Up with Benicio del Toro and Delivers this \"Netflix\" Original for His 1st Feature-Film.A Bleak Detective Thriller that is Driven by a Moody Neo-Noir Tone.It's about del Toro, a Transplant Detective Trying to Avoid Mistakes-Made in the Past, and is Caught-Up in a Murder-Corruption Case where \"Bad\" is Overwhelmingly Everywhere.He \"Bites-the-Bullet\" and Hunkers-Down as Events and Revelations Slow-Burn the Case and the Film.The Tone is Suppressing, Dark, and Deep. More Reliant on Characters \"Behaving Badly\" than Action and Violence, although the Mood is Relentlessly Depressing and Cuts to the Bone.Del Toro Nails His Inner-Turmoil Eating Away at His Soul Reflecting in His Demeanor Concerning His Job and His Wife (deliciously played by Alicia Silverstone).A Stone-Faced Justin Timberlake is a Suspect. What Amounts to a Cameo by Eric Bergosian becomes Integral to the Story.Worth a Watch.",
    "113": "Set in the town of Scarborough, Detective Tom Nichols (Benecio del Toro) and his partner Dan Cleary (Ato Essandoh) investigate the murder of real-estate broker Summer Elswick (Matilda Lutz). As the two run down possible suspects including Summer's boyfriend Will Grady (Justin Timberlake), her ex-husband Sam Gifford (Karl Glusman), and a man with a grudge against the Gradys named Eli Phillips (Michael Pitt), the case goes from a simple murder to something of larger scale implications.Reptile is the feature film debut of music video director Grant Singer who also co-wrote the script alongside Benjamin Brewer and the film's star and executive producer Benicio Del Toro. Singer and Brewer wrote the initial draft of the film in 2018 where it was acquired by Black Label Media who'd previously worked with Del Toro on the Sicario films and upon showing it to him he became a huge proponent of the project. With a gritty noir story, an all star cast, and an Autumn adjacent release date you can tell Netflix wants this to be their equivalent of Gone Baby Gone or Prisoners as that dark horse crime thriller that scores some Oscar nominations, and while it doesn't reach those heights unfortunately it's an ultimately decent detective thriller with a strong sense of style and some committed performances.Despite being the debut feature of Grant Singer, he shows a strong grasp on filmmaking from a stylistic and technical sense with the film given some solid shots that capture the environments in which Nichols investigates. With a predominantly suburban setting that often uses the states of various homes like McMansion Grady is trying to sell having signs of vermin infestation or a neglected swimming pool with stagnant water, you get the sense Singer is trying to capture that underlying sense of rot within these seemingly idyllic homes. While Tom Nichols isn't given the greatest depth as a protagonist, del Toro who serves as a co-writer on the film does add some humanity to the role especially in regards to his relationship with his wife Judy played by Alicia Silverstone who takes what could've been an underwritten character and makes her more of a confidant who actually assists Tom on several occasions and the two have some solid chemistry together. Where the movie faulters for me unfortunately is in the mystery aspect of the film especially in how it establishes its array of suspects only for us to switch gears at the one hour mark where we begin another decidedly different investigation. The writing in the film while fine most of the time is perfectly fine (if not exceptional) but it does lead to some groanworthy dialogue exchanges and a fake-out dream sequence that I didn't really care for.For those who like dramatic procedural thrillers of this kind you will find some good elements to appreciate here especially in how it relates to the acting and visuals on display. The movie itself as a mystery I'm sorry to say fell somewhat flat for me despite seemingly having all the right pieces in play. A slight stumble out the gate for Grant Singer, but one that shows promise if given refinement.",
    "114": "First up, Amazon needs to start dumping idiotic reviews from users who don't understand movies. How in the world have has this received a 1 star? The story is solid, the actors are solid and so is the run time.For me, reptile is generally how a thriller should be built. Slow, clues thrown in, characters revealed slowly and so on. However for the m***** with the 1 star reviews, they like their thrillers like their premature ejac********.Benecio Del Toro is one of those brilliant actors I would watch any movie. And you throw in Alicia Silverstone and I'm in.The story is very good, the screenplay does not reveal all at the beginning, and the support actors are quite brilliant.Go watch this if you are like me a thriller and mystery lover. If on the other hand you are a tiktok addict who expect the truth in 1 minute don't watch.",
    "115": "I've never really been what you can call a Timberlake fan. I can take his music or leave it. As for his screen work, I don't think I have ever been particularly moved to watch a project based on his inclusion, or not. That said, he was pretty excellent in this. Based in this one performance, I may have to reevaluate his body of work. Yes; he was that good.Del Toro, in the meantime, (at least at the beginning), pulled a bit at my heartstrings because he looked both, so much older than I am used to, and somewhat heavier and more \"worn\" than usual. His performance, however, was ever so rich with subtle context and deep ever-changing ranges of conflict, that it reminded me of the first time I saw him in Traffic. He's mesmerizing.The rest of the cast was nothing short of perfect. It is better for me to point out the copious amount of collective talent, rather than make this review too long by pointing out each nuanced performance. So, to watch this for any of these actors would be reward enough. To watch it for all of them is a treat. And yet ... it delivers more than that. You see, despite all the strong portrayals, the REAL \"magic\" in this film, happens in the story and how it's told.While not necessarily linear, and while sometimes a bit heavy-handed, the tale is solidly terrific.",
    "116": "What we have here is an off-beat, slow-moving, labyrinthine police procedural which rather suddenly arrives at its violent denouement in its closing minutes. Benicio Del Toro stars as the veteran detective who when we first meet him at a crime scene seems more interested in ideas for home improvements at his own house than looking for clues. In his spare time, he goes line-dancing with his wife Alicia Silverstone and also has \"The Oogum Boogum Song\" as his mobile ring-tone. So yes, we get it, not your average run-of-the-mill cop.The case he's called to is the violent murder of a young female estate-agent on the premises of a vacant, high-tech property, being sold as a repossession by her and her partner - boy-friend Justin Timberlake. We're clearly shown that JT was somewhere else at the time of her killing so who's the perp? Once Del Toro finally takes his eyes off the fancy set of taps at the murder-site, his investigation snakes out to initially involve the murdered woman's deadbeat ex-husband before leading to a drug-ring using the sale of empty properties for money-laundering with it seems connections back to his own police colleagues and bosses.Like I said, it all unravels in a bloody shoot-out but in a movie with so many characters and sub-plots milling about, by the end I was still left scratching my head. Characters drop in and out of the narrative, inconclusive scenes flit across the screen while all the time the plotting is confusing and the pacing leaden.I get that we're in post-modernist \"True Detective\" territory here but with an over-elaborate story-line, too many unconvincing, unusual characters but most of all a lack of anything approaching directorial flair, this movie for me achieved the rare feat of being both flat and uneven at the same time.And nope, I've no idea where the title came from either.",
    "117": "As \"Reptile\" (2023 release; 136 min) opens, we meet realtors Will and Summer as they are prepping a house for a showing. Looks like they are a couple. Some time later, Summer is again at that house. Will is on his way there too but for reasons unknown he is not able to reach Summer on her phone. He arrives at the house only to find Summer brutally murdered... At this point we are 10 minutes into the movie.Couple of comments: this is the feature length directing debut of Grant Singer, best known for his music videos. Here he brings a murder mystery that initially seems straight-forward: who killed Summer? Will? Summer's ex? A local bad boy? Except that this is just the beginning. The movie is super plot-heavy so the less said about that, the better. Suffice to say that it helps if you can keep an open mind how it all plays out. Along the way we get a number of great performances including Justin Timberlake (as Will), Benicio del Toro (as the Detective on the case; del Toro also co-wrote the script) and Alicia Silverstone )as the Detective's wife). Yet despite the plot twists, the movie lacks a true element of surprise and it all feels quite standard and strictly by the numbers. Consider as well that this movie was shot a full 2 years ago. Why has it been sitting on the shelves for this long?\"Reptile\" premiered at the recent Toronto International Film Festival to ho-hum reactions, and after a limited 1 week theatrical release, the movie started airing on Netflix this weekend. If you are in the mood for a murder mystery, I'd readily suggest you check this out, and reach your own conclusion.",
    "118": "I have no idea why this movie is called reptile,maybe it's because most reptiles are cold blooded like most characters in this movie.My god is this movie slowwwww, it felt like it went on forever, plenty of close face shots, and Birdseye view of cars driving down country roads, the background music was more dramatic than the actual movie. The story is ok, and the twists are ok, nothing you haven't seen before.The movie is blessed with a strong star cast, benicio del Toro, a personal favourite holds the movie together, supported by Alicia Silverstone and Justin Timberlake who has aged super bad...lol.I wanted to give this movie a better rating, the star cast deserved better but the movie moves at a pace that is soooo slow, who needs a general anesthetic when you can watch this.",
    "119": "I'd put off watching 'Reptile' for a few weeks since it came out on Netflix, and now I don't know why I did. This is exactly my kind of movie and it's done extremely well. It's the kind of movie where I don't mind it being in excess of 2 hours because it can justify it. There's no wasted time in the movie. Everything serves a purpose and is working towards the ultimate conclusion. This was a film where I wanted to know how it would end, but at the same time I didn't want it to end.There's a lot of complexity to the story and not everything is handed to you on a silver platter. I went online after watching the film to try and clarify a few points and was delighted to see some healthy discussion/debate over certain things. This is always a sign of a great movie. The answers are often there, but they aren't cut and dry and take some detective work on the part of the audience as well.There was a dream sequence that I thought could've been left on the cutting room floor, as I thought it was a little bit cheap to have it in there. Otherwise though this was a really enjoyable film. 9/10.",
    "120": "I'm so mixed on this film. I went in with high expectations. And the first hour is engaging. Well paced. The mystery competently set up. Stylish cinematography. Dark, forbidding vibe. But at the end, I found it to be a missed opportunity.The crime: a young, attractive real estate agent, Matilda Lutz as Summer Elswick is brutally murdered at a home she is showing. It is clearly a crime of passion. Over thirty stab wounds, and a knife embedded in her pelvic bone.Her boyfriend, Will Grady (Justin Timberlake) a successful colleague, is the first suspect. Summer failed to show up for one of his talks, and he becomes quite angry. He was to meet Summer at the listing.Suspect #2 is a sleazy, slightly \"off\" ex-husband Sam Gifford (Karl Glusman). His art projects are downright creepy. Number three is Eli Philipps (Michael Pitt) who appears a few nights later at Will's mom's home as a threatening, perhaps mentally disturbed young man bent on avenging a decades old real estate deal brokered by Will's dad. He feels cheated out of a family farm. He looks like a messier, bad-hair-day Russell Brand.But then it all crashes at hour two. The plot becomes cluttered and unfocused as we wade into the suspicious doings at the small city police department, and procedural stuff. Too many ancillary characters wander in and out of the story. Subplots are dropped. Plot holes emerge. A ridiculous mistake by one of the bad guys reveals too much too soon. And it is all way too slow. A traffic stop takes an eternity and nothing much happens. There are several scenes of cars lazily cruising through scenic country sides, a cliche I often see in Nordic noirs. This thanks to cheap drones, I suspect.On the positive side, Benico del Toro is great as the enigmatic detective Tom Nichols. He keeps the interest level up as viewers trudge through the messy narrative. He's perfect for a procedural. Low key. Poker faced. And unlike so many TV detectives, his character is free of major vices and a bad / failed marriage. Detective Nichols' only temptations: a better kitchen (and a motion activated faucet, a running joke here) and a top of the line used pickup truck. A not-at-all developed sub-plot shows him to be a jealous husband as well.Alice Silverstone plays his wife, who is sort of an \"assistant detective\" helping him piece together a few clues. She is refreshing, a real change from the usual victimized, put-upon police wives we so often see.I actually found Justin Timberlake's Will convincing as a sort of dodgy, narcissistic rich-kid real estate agent / motivational speaker. There's family money here and a strong mother (Francis Fisher) who heads the real estate business. If this were a series that dynamic would be ripe for exploring further.In fact, Reptile, with all its subplots and supporting cast, would have been better as a six-part series. Or, a more skillfully edited, slimmed down 90-minute film. Both, though, would need a better title. \"Foreclosure\" maybe? \"Do We have a Deal?\" \"Great Bones.\"",
    "121": "An intense thriller: well written, perfectly acted and with a sound background music (pun intended).Plot isn't unpredictable but this is not surprising, given the number of movies we all watch these days. And in any case you won't see where it is going for a long, long time..Everybody did well but Benicio del Toro not only stole the scene but also significantly contributed to the story, to the point they had to include him in the credits as a cowriter.For director Grant Singer, who previously directed music videos only, this was a debut (a very good one, I'd say). And he also (together with Benjamin Brewer) wrote the story.Everybody is entitled to his own opinion, of course, and the exact value of this artistic effort is open to discussion but ratings in the binary system are unjustified...Enjoy.",
    "122": "Oooooook it's been a long time that I have started watching a movie and been entangled what's going to happen not since \" Seven\". I have seen that til now.At first I was like well Justin Timberlake in it .... Ughhh it's crap right....... Ummm WRONG it was good yet you have the amazing Performance of freaking Benicio Del Toro. His name per say it's amazing and SO is HE....,... he is such a great action type of actor. Amazing and ever since I saw him on yes \" excess baggage\" I was like this guy has possibilities. And yea him and Alicia working together amazing. She was also great in this... love Alicia. It's been a while since I have seen her. I always have thought that Benicio del toro's best performance has been \"Sicario\" but this movie is good not better lol but it's good. And let's not forget Michael Pitt, another great star that's just awesome!!!!!!!! Love him In This too. He was just brilliant as well in \"Murder by Numbers\" with great notable appearance of Frances Fisher. Always enjoy watching her in different roles ......anyways my opinion at least give it a try.",
    "123": "A very S-L-O-W burn style crime/detective drama.It wasn't horrible but not,praise-worthy as many reviewers write.Although cast & acted overall decent,had unusual or interesting music plus cinematography average.The title itself was a metaphor so understood that,but how it ended was that also one(shedding skin,ect?) Or did he do something to cover his prints,in order to get closure with an arrest.The lead detective wasn't all that likeable & he seemed jealous of his younger wife,felt hard to root for him to live & catch the bad guys..\nFigured out early on,those closest were involved.. Shocking!Worth seeing if you like,an ok mystery or any actors.",
    "124": "You know there is a lot to like when your biggest criticism is that there should have been even more. Reptile is rich and complex enough that it may have benefitted from a two 80-90-minute episode structure. As is, the noirish murder drama avoids cliches and trusts viewers to pay attention and not become restless waiting for the next action scene.To state the obvious, Del Toro knocks it out of the park. No surprise. Alicia Silverstone is a revelation. She is excellent and casting directors will want to take note. The part of the troubled detective's better half is typically a stereotypical bed and kitchen character. Not here. Judy is smart and savvy. She is a quick study, offering valuable insights and reactions when the couple discusses the case. Tom has trouble turning off his powers of deduction, becoming suspicious over a trifle, which adds another layer to a complex character.The supporting cast is quite strong, leaving me wishing a few roles had been developed further. The slow burn shifts to a faster pace in the final act, and the close is strong enough to quell a few quibbles. I'm surprised to see Reptile receiving rather mixed reviews. It is not perfect, but it will captivate many viewers with both style and substance. I recommend the film, and am left longing for a Del Toro and Silverstone detective series.",
    "125": "Even though I'm not a huge Benedicto Del Toro fan, I respect his long contribution in the film industry. He was an actor who came into prominence in the 90's. His movies are a mix of high and low budget fare. I like two of his movies, namely, The Wolfman(2010) and Sicario(2015).Back to this film. The plot concerns a man who finds his wife murdered in his house. He immediately phones the local police. Detective Tom Nichols(Benedicto Del Toro) investigates the case, but finds holes in the husband's story. He slowly uncovers a web of corruption. This then is the gist of the movie. I have seen many similar films: Serpico(1973), Mangnum Force(1973), Tango & Cash(1989), Eraser(1996), Cop Land(1997), Phoenix(1998), Training Day(2001) and so on. In my opinion the plot is all to familiar, but the overall acting and direction are the film's saving grace. The photography and background sound-effects were superb for me and enhanced the movie till the end.I would recommend this movie to anyone fond of dark thrillers. Thanks for reading this review.",
    "126": "REPTILE is a movie that exemplifies why actors should assume they're capable of writing. This film makes all the conspicuous errors it can possibly make, from silly suspense sound effects, to unnecessary and superfluous lines, and pretentious throwaway cop lines.Why is a cop's spouse quoting homicide statistics to a homicide detective? Why is the main character (detective) driving a dumb muscle car as a police cruiser? Why is this film named REPTILE? Because of the pointless exhibition in the beginning that was never tired to shutting later?I typically love Benicio del Toro, and can usually tolerate Timberlake, but this was terribly pedestrian and silly.Meh.",
    "127": "What's up with the critics? Attention deficit disorder or mental laziness? \"Doesn't fulfil its promise\"? What does that even mean? And if you claim this then spell out what the promise is and how it doesn't get fulfilled! Clever turns of phrase left hanging are not criticism worth listening to.I enjoyed the movie immensely.Classic noir tropes beautifully revitalised and updated. Sharp, crisp script. Taut editing. Yeah, slow paced but not slow, not a single superfluous scene. Cinematography to die for! Music score super appropriate and effective.But above all it's a masterclass in character acting. Benicio is utterly mesmerising and Alicia sizzles. The chemistry between them is off the scale and their shared scenes are superb.Ditto Justin. He's developed into a great actor lately. And all the other actors do a superlative job right across.One can find flaws in God's creation. Man is a flawed creature and therefore no movie can be perfect. To let any minor flaws become major criticism over the abundance of excellence in the movie is both bad manners and intellectual dishonesty.See it for yourself. Netflix, please do more stuff with Benicio and Alicia together. A super winning screen \"couple\" oozing screen presence and acting charisma. Well done all.",
    "128": "This is a beautiful film that will be studies in film classes. Angles, shots, music, mood are all very strong. Grant Singer deserves a lot of credit and should get major recognition for this piece.Bottom line, this is a fairly traditional detective story that floats much closer to True Detective than Columbo. Del Torro is a gritty veteran detective that must investigate a grizzly murder. But is there more here than meets the eye?! You bet ya! However, what exactly that is isn't very clear or interesting.Del Torro leads an excellent cast that includes strong performances by all - although Timberlake and Silverstone both needed more screen time. These are interesting characters that avoid cliche for the most part.The plot is where the film starts to show some cracks. While at first I tried to follow the flows of logic, I quickly gave up - partly because it was hard to follow, but mostly because the plot isn't very good. Things happen, people give telling sideways glances, then there is an ending of some sort.So, this movie will frustrate some. It is an experience more than entertainment. But, if you are interested is great acting and filmmaking, strong characters and mood and an overall great 'feeling' film, then this is your jam. However, the ending of the film will result in this film falling from being a leader of the genre to an also ran.Still, 8/10.",
    "129": "I'm writing this review for all the potential viewers out there who like me might find themselves bored at the very slow pace of the movie and pausing it now and then to check reviews on IMDb. Let's start with the positive. To be fair, the film is shot well. It's not great. It's not bad. The cinematographer is schooled. The film is well cast. In the hands of a better Director, or more apt to this particular film, a better script, this cast could really excel. The actors, in their defense, do as good of a job as anyone could with such a weak script and poor direction. If you are 30 minutes into this film and find the slow pace of it starting to bore you, unfortunately, this review is to inform you that no it will not get any better. And no, you will not be rewarded with a payoff by the ending. In fact, the ridiculously silly clichéd and irrelevant ending will leave you angry that a Netflix production once again wasted your time. If you are 60 minutes into this movie, by now you are almost thoroughly bored and considering cutting your losses, but probably still holding out. You hope that some of the questions you have might be answered by what you hope might be the movies climactic ending. Let me assuage your curiosity: no, you will not ever learn who the killer is, nor what the significance of the gloves are, nor what the significance of Del Toro's hand is, or the significance of the square dancing, or the mysterious bite marks on the victims hand, or why she was stabbed 33 times so violently, nor the significance of the Chrysler imperial, or the ex husband, or the boyfriends mother, or the contractor working on Del Toro's house, and anything else that's thrown in to this childish mess of a script. You won't even be made aware of what the significance of the title is. Never before have we ever spent this long, observing so many characters in a film, and not learned one thing about them. There is zero character development here. It is a very, very bad script. And because of that, because of how long you were asked to invest your time and attention and then not rewarded, but rather, insulted, reptile is sadly a very, very bad movie. Definitely not a film.",
    "130": "Well,the.man does not headline or even star in movies all that often but when he does,he has a tendency to sideline his colleagues and scene partners. Not out of ego or even with intent,Benicio del Toro just has a unique,fascinating screenpresence that few can match.He can be aloof, quirky or very intense,all within seconds and without signaling what's to come,a wonderfully predictable actor. Between 2004 and 2011, he sadly only made four movies (He spent the best years of an acting career partying,turning down scripts and dating A LOT) one being his passion project,the epos he produced and had the lead in and Che was a gamble that just didn't pan out,financially it bombed and sent Benicio out into the wilderness for some years.Well,he has been back for some time and seems to enjoy this stage of his career. On the downlow,slowly but surely he just became a bonafide movie star,a latino Robert Mitchum with a dash of Brad Pitt and he goes from Sicario to Dannemora to The French dispatch with such ease cause he knows he has arrived.And in Reptile...well,Thank god he is in it and is the lead character. This is the first time in his career he plays a character with alot of his own Personality and quirks in it and it was a joy to watch. And he is slowly becoming Orson Welles but sure knows how to cover that guy and thank God an actor with some extra pounds can get a lead like this. Sometimes the studios do understand the concepts of gravitas and imposing physicality.He gives a very grounded, understated performance,which is what a story with an impressive but really out there Michael Pitt,one of the last years most deranged,excessive murder scenes and a plot that seems to slither like a reptile but at closer look,its lying in wait. Circumstances and clues change, clues that become red herrings as soon as you look closer,the plot sheds its skin but it still remains static. For a long time nothing in this bizarre tale has changed except our and Toms (Benicio) perspective.It would be cynical to say that a womans death,stabbed 27-30 times does not matter. But this is a two act movie,not the standard three (think The talented Mr. Ripley) and halfway through due to some questionable reasoning and dubious police work,it seems the law got the culprit...and then the film slowly morphs into a depressing,maybe not too realistic but a scary allegory about the law and sadly,the greedy,lawless institutional rot. And suddenly the title makes sense,Tom is holding on to his moral convictions and code but to what end as it seems he is surrounded by snakes who might shed their skin at any moment. Del Toro is since way back no longer a man of histrionics,he lets his eyes and bodylanguage inform us off his paranoia and despair.The others actors are a mixed bag,Timberlake is fine, adequate. The role has several layers and masks and he handled a few of them well. But sadly,he can not just be casually sinister,he has to Telegraph it.Bogosian has charisma and its sad that besides telling us he has MS,in the end,his captain is underdeveloped and we have so many questions about him. Lombardozzi finally gets a role where his passive-agressive,confrontational New Yahk-scumbaggery is used the right amount and the right way. Best I've seen him.Silverstone seems to get a lot of praise here,perhaps cause her long absence from quality movies? She does a solid job,looks great but doesn't do too much to propel the plot.Speaking of plot,trying to put this all together coherently and make it make sense could give you an aneurism.See this more of a character study of an odd but seemingly incorruptible man who might not always be truly committed but when big things are at stake and shocking betrayals hit close to home, Tom rises to the occasion and proves his worth...if he only can survive the deadly web he is stuck in.Director Singer makes some bild,interesting choices that echo a mix of arthouse and Finchers obsession with detail and lighting in Zodiac while I found the score to go from eerie and very ominous to the composer just laying on the violins and \"dread\" a bit much,in uneventful moments, unwarranted in a desperate attempt to fabricate mood and kinda condescend\nto the audience.Still,in the end,I really like this one. It makes weird,bold choices,both visual,the sound design and the story had me dumbfounded a few times.Two loose ends do annoy me and it is about 15 minutes too long. But this is one of the better Netflix films intesrs and a crime thriller with Benicio Del Toro at the center will always warm an old cinephiles heart.And that Dylan needledrop while Tom finally sheds his skin,the meaning there is profound and very telling in its simplicity and the film is one you really should see.",
    "131": "Would you like to see some action, shooting, car chases, killings and have a lot of fun? If so, watch something else. This is not for you.I enjoy action movies as described above, nothing wrong with that. REPTILE is different though. This is a very good crime thriller, easily the best crime thriller since WIND RIVER (2017, Taylor Sheridan). When i say \"crime thriller\", i mean movies with officers/detectives trying to catch killers, murder investigations etc. For some reason, this genre is dying. I don't remember many crime thrillers recently except THE PALE BLUE EYE/TO CATCH A KILLER/Abgeschnitten (2018)/ONLY THE ANIMALS (2019). Some of them were good, some were not. REPTILE is undeniably better than all of them.Beware, this is a slow burn. There are some twists and turns but this is not a movie that will blow your mind with surprising events. It takes its time to unfold, i mean, a lot of time. And it's superb regarding acting and character study. No words to describe Del Toro's performance, this is indeed mindblowing. I could watch him for 10 minutes straight even if he didn't do anything, just thinking about his next move. I'll be honest, some people may find it boring, i don't agree with that but i respect it. No way though i could respect a bad opinion about this performance. The way he conveys his feeling without saying a word, it's out of this world. Of course, i helps if your face is so much expressive.There are some reviews criticizing this because there are not many straight answers but enough plot holes. I hear it but i disagree. Almost every question is being answered here, as long as you think it through. This definitely ain't an ambiguous movie. Not plot holes, almost everything is crystal clear. At times, answers might not be so specific but these particular questions are kinda insignificant if you look at the great picture. Now, if you like a bit spoon feeding in your movies, sure you shouldn't watch this.In conclusion, this is intelligent, realistic, well acted, intense at times and the ending is satisfying. It's flawed, not groundbreaking, definitely not a masterpiece, definitely won't stay in your mind for long. But if you miss this genre, you are gonna like it.PS I don't remember Timberlake being that good in any of his movies. Actually, i always thought he's a bad actor. He is good here. Silverstone too. Bogosian is excellent.",
    "132": "An eyebrow raised when I saw Justin Timberlake in the cast...but I said Scr*w it, I'm watching my favorite bad*ss BdT!!!Indeed, the movie was a slow burn, but it was all worthwhile. One of my favorite crime / thriller movies this year.I just love Alicia Silverstone and Benicio del Toro's onscreen performance. They're pretty cute together. I was just remembering their earlier (much lighter) movie Excess Baggage / 1997 film.I don't care what others have to say about Reptile.. I think it's a good movie and worth watching. Pretty good performance from all characters.Again, I'm not a fan of JT, so I just took it all in stride.",
    "133": "Directed and written by Grant Singer. A runtime of two hours and fourteen minutes. Streaming on Netflix with an R rating.\"Will Grady\" played by Justin Timberlake finds his wife stabbed in a home she was showing. This prompts \"Detective Tom Nichols\" played by Benicio Del Toro and his partner \"Detective Dan Cleary\" played by Ato Essandoh to investigate.These New England detectives are very close. \"Captain Robert Allen\" played by Eric Bogosian is the uncle to \"Tom's\" wife \"Judy\" played by Alicia Silverstone. You also have \"Wally\" played by Domenick Lombardozzi. He's a former detective who hangs out a lot with his past employees. He currently has his own business in the security sector.They all hang together and look like family. With some of them being family. This only further complicates things when the case takes some unfortunate turns. Making everything very murky.Whether it's \"Will Grady\" who killed his wife, the wife's friend/potential ex-lover in \"Eli Phillips\" played by Michael Pitt, or even \"Will's\" mom \"Camile Grady\" played by France Fisher. No one is safe and everyone is a suspect in this murder. This case takes some interesting turns. See what turn they end up making and where their final destination lands them.\"Reptile\" was an interesting film. It had a dark nature. You never knew where it was going to go. Del Toro is him. Most films he's in you already know they're going to be good. Then you throw in Justin Timberlake who comes from where he originally came from. Disney and Music, especially a boy band when it comes to the music. He bats a very high percentage with his films.It was odd seeing Alicia Silverstone who was in the cult classic film \"Clueless\". Seeing her as an adult even though she was an adult when she filmed \"Clueless\" but you know what I mean. It was just a little different. Makes me feel older.It dragged a little. Around thirty to forty minutes left in the film, I was wishing for it to wrap up. But I'm glad it didn't wrap because after that mark the film took another crazy turn. I hated the very end because I was left with a lot of questions. At one point I'm wishing for it to wrap up and at the next I'm wishing for more time so I could get a couple of questions answered. It was a good film. I give it four mor fires 🔥🔥🔥🔥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#Reptile.",
    "134": "Film Review: Reptile streaming on NetflixSynopsis:\nSet in the town of Scarborough, Detective Tom (Benicio del Toro) & his partner Dan investigate the murder of real-estate broker, Summer. As the two detectives zero in on possible suspects - Summer's boyfriend, Will Grady (Justin Timberlake), her ex-husband, and a man with a grudge against the Grady's , the case goes from being a simple open and shut one to something that is much bigger & will change the lives of the investigators forever!!This film is a slowburn .. very laidback, no adrenaline rush moments mostly till the climax when the end reveal happens. Del Toro is the mainstay of the film and has performed brilliantly. He shares a strong chemistry with his onscreen wife Alicia Silverstone who acts as his confidante and also helps him in his cases. Justin Timberlake is unfortunately wasted in a role which doesn't pack a punch.A decent murder mystery which peels off in layers as things start becoming clear!!Watch it if u have liked Manorama - 6 Feet Under & Sean Penn's Mystic River( 2003) !! Beware, the slow pace of the film might not appeal to everyone!!Going with 3/5 for this one ... Adios 🙂!!#sanjuzzreviews #reptile2023 #BenicioDelToro #AliciaSilverstone #justintimberlake #netflixindia.",
    "135": "There was a lot to like about this movie. You definitely want to find out the mystery. I kept wanting to turn it off because it was late at night and come back to it, but I couldn't wait to find out what was going to be revealed so I kept watching. This is a great attribute of the movie.The acting was mostly very good. Del Toro was very very solid.Timberlake was good too.Side characters were pretty good.But the reason I give it six stars is because it drags out a lot of the scenes, a lot of waiting to find out what new information in their case is going to reveal, and when it finally is all revealed it's not so satisfying, making it a little frustrating to have sat through such a slow burn.Overall was interesting and mysterious and moody in all the right ways but just did not finish very strong, and it's the kind of movie where the ending has to be great because it's a mystery until the end.",
    "136": "Del Torro is a legend. Ageless perfection. Alicia, also ageless perfection and I love seeing her on screen again.Reptile gave off The Departed vibes, except far darker with more twists and turns.A classic tale of \"smart cop vs the greedy criminal cops\" slowly unfolding subtle clue's in every scene, eventually revealing the true suspects. A heart pounding build up to a very shocking ending.While most of the actors seem like they were born to play these parts, Timberlake just looked lost and out of place. While his character was important, his acting didn't leave me in awe like the others.Otherwise, a great movie and worth the watch.",
    "137": "Grant Singer movie of 2023.Benjamin Brewer and Benicio del Toro co-wrote the script based on a story by Brewer.The film, which opened at the Toronto International Film Festival (TIFF), was screened in a small number of theaters in the USA, probably because it will be nominated for a few more festivals.The pace of the movie is so familiar that it reminded me of a few David Fincher movies, especially Zodiac (2007) and Gone Girl (2014).It is difficult to clarify whether Benjamin Brewer and Benicio del Toro wanted this when writing the script, or whether Grant Singer, the video clip director, is a Fincher fan and took great care of it.But even if the goal was to make a David Fincher-like movie, the end result was something better than CBS and PBS' legal dramas.Justin Timberlake, Alicia Silverstone, Micharl Pitt and Benicio del Toro themselves are in the cast of the film, but our director could not direct this cast because he was in love with capturing Fincher-esque images.These names do not offer anything other than the performances we are already accustomed to, and this lack of experience in the movie even overshadows their performances.",
    "138": "Truly captivating cinematic masterpiece that combines the talents of two incredible actors, Benicio Del Toro and Justin Timberlake, to deliver a thrilling experience. From start to finish, this film immerses the audience in a world of suspense, intrigue, and unexpected twists.FRom the visually stunning cinematography to the hauntingly atmospheric soundtrack. The attention to detail in every aspect of the movie is evident, creating a world that feels both authentic and immersive.What truly sets \"Reptile\" apart is its ability to seamlessly blend different genres. It's part thriller, part mystery, and part psychological drama, making it a unique and refreshing addition to the cinematic landscape.Don't miss it!",
    "139": "\"Reptile,\" the directorial debut of Grant Singer, takes audiences into the gritty world of Detective Tom Nichols (Benicio del Toro) as he investigates a murder in Scarborough. While Singer demonstrates a strong visual and stylistic sense, capturing the decay behind seemingly idyllic homes, the film falters in its execution of the mystery. The initial setup of potential suspects, including Summer's boyfriend, ex-husband, and a disgruntled individual, promises a compelling investigation. However, the abrupt shift in focus at the one-hour mark disrupts the narrative flow, leaving the audience somewhat disconnected from the unfolding events. Additionally, the dialogue, at times, falls into the realm of groanworthy exchanges, detracting from the overall viewing experience.Despite the film's missteps in mystery execution, \"Reptile\" has its merits, particularly in the committed performances of the cast and the visual flair brought by Singer. Del Toro, also serving as a co-writer, infuses some humanity into his role, aided by a solid chemistry with Alicia Silverstone, who elevates her character beyond the confines of an underwritten role. The film's portrayal of suburban decay and neglected homes adds an atmospheric layer to the story. While \"Reptile\" may stumble out of the gate, it holds promise for Grant Singer's future endeavors with refinement. The detective thriller genre offers ample opportunities for improvement, and with a more focused narrative and polished writing, Singer could potentially deliver a more compelling and cohesive cinematic experience in the future.",
    "140": "This was ANOTHER crime story written by dudes, directed by a dude, about a dude detective and his dude friends, chasing a dude or dudes that killed a girl, and there was nothing groundbreaking about it. The murdered girl, as most murdered girls in these movies, was just a body, she is on screen for like 90 seconds, we never get to know anything about her as a person either before or after her death, so I personally never got to actually care about her character or her death.I did love Del Toro's character and performance, because even though he was a tough detective, he showered, he smiled, he didn't have a drinking problem, he seemed to have genuine friendships with his colleagues, he wasn't going around beating people up for no reason and his marriage wasn't falling apart, which was all a pleasant and refreshing surprise, since most movies of this genre often portray detectives as violent alcoholics who never shower or sleep, don't have friends and are divorced or at the verge of getting a divorce. I also liked the relationship he had with his wife, they seemed like a normal couple who got along, made each other laugh and enjoyed each other's company without being too corny.I liked Silverstone's acting, but unfortunately here, as in most movies of this genre, her character was relegated to \"the wife of the protagonist\". She didn't have one single significant interaction to the plot with any of the other 2 \"supporting\" female characters on this film and her actions or decisions didn't have any kind of impact on the story at all. Even though she did a gret job, if you cut her scenes, the film doesn't change one bit. Also, as in most movies of this genre, the only black character was just that, the black guy, his character, as well as the female characters, didn't have any kind of relevance, he was just \"assisting\"¿? The protagonist, but if you cut him out of the story, its stays the same.About Justin Timberlake, I can't stand his speaking or singing voice, but that's a ME problem, however, I don't think he did a bad job, neither did he do a good one. And the story itself wasn't that interesting or engaging or thrilling at all, I think it's at least 30 minutes way too long for what we were shown. At times I kept looking at the clock and praying that something exciting would happen, but my prayers were ignored, as there were only 2 tense moments in the whole movie.Overall, this was a forgettable experience, but at least I didn't pause it or fell asleep while watching it. There was nothing about this movie that excited me or shocked me, or made me anxious or put me on the edge of my seat, nothing about it will stay in my memory, not the story, nor the twists, nor the music, but I will definitely remember how ONCE AGAIN, a movie treats its female characters as irrelevant, unimportant, replaceable and disposable people.",
    "141": "I manged to watch it half way through so not sure I should rate the whole film. But that´s all I can take of this boring piece of crap. It´s no tension and the only thing that´s mildly exciting is the sound or \"music\" which leads us to nowhere.. No idea how this can get such a high rating cause.. it´s beyond me.Nothing wrong with the acting.. well not much. But not one likable character. No build up. I actually don´t care who did it... or did what. I´m rooting for no one.It´s described as dark on Netflix.. Is it cause you have no hope that you will be able to focus on it till it ends? Cause I quite quickly lost the attention for it. It´s missing ... so much. I like.. nothing about this at all.And no idea why it has to be such a \"long\" review of this movie cause it doesn´t deserve it. Boring... boring and long.. Now done.",
    "142": "I'm not going to write a real review here but I am going to talk a bit about the plot. If you look at the reviews that rated the movie is an 8 or 9 maybe a 10, I'm probably in agreement with most of what they said. Great acting! Benicio Del Toro is the man - what a performance!What I wanna mention is, this is one of the few movies that does not do the conventional thing of making every little point in the movie to be important to solving the crime. And in fact, many, if not most of the points that came up are never resolved, but that is life. I'm not a cop but I know that if you are a detective, hundreds if not thousands of leads come in that never really point you to the answer of who done it and that's exactly what this movie does. It has lots of leads that seem important, but they are left unanswered. The characters in the audience have to figure it out.Final thought: I wish that Benecio Del Toro, Alicia Silverstone, and Grant Singer as the Director would do a true crime series. I would be watching every single episode!",
    "143": "Like Carla Gugino, who I just reviewed in the \"The Fall of the House of Usher,\" I'll watch just about anything Benicio del Toro has been in the last 25 or 30 years. Reptile is a pretty good detective story with a great cast and escalating dramatics that is easy to watch for a couple hours.I loved seeing Alicia Silverstone and Frances Fisher in their supporting roles...Silverstone is especially effective as Judy, the wife of Tom (del Toro). Special nod to Owen Teague as Rudi Rackozy, a role that could have been easily overacted but Teague played it with just the right amount of poignancy and tension.Plenty of others have summarized the plot and the film has its detractors...and they have some good points because several key aspects in the story were dropped as if they didn't exist. Those details didn't detract from the impact of the story, and I scarcely noticed them until they were raised by other reviewers (\"oh yeah, what about that?\").Bottom line, I found the movie very entertaining and enjoyed watching the gears shift in del Toro's face whenever he was struck by something that came to light. Despite the plotting gaffes, there was scarcely a sour note in the film because of all the strong performances, solid score, spot-on production values and effective direction.",
    "144": "You know what's worse than a slow movie? One that's unnecessarily over two hours and predictable from the start.The real highlight in this murder mystery was Alicia Silverstone. I suspect we're supposed to root for Benicio Del Toro, but he truly felt like he was sleepwalking through this whole movie. If I wanted to watch a Police Detective film like that, I'll just rewatch the enormously superior Insomnia with Al Pacino.Nope, Del Toro's onscreen wife, Judy (Silverstone) steals this whole cop procedural suspense, even with limited screentime. Most of the time I couldn't even see what her character sees in her husband, Tom (Del Toro.)Will Grady's (Justin Timberlake) realtor girlfriend is murdered and Detective Tom is very slowly on the case. The usual red flags are presented and the onion is pealed. Just sit back, this is going to take a while to resolve.Don't get me wrong. I didn't hate it. It had its great scenery and cinematography and everyone performed well. There was the mood and common slow burn mystery shown. But, I have seen so many of these that were so much better and even if they matched the run time, I was never bored with those.If you like all actors and this subgenre AND you have Netflix already, with 2+ hours to kill that is, you could do worse.***Final Thoughts: But, yeah, I'd recommend 2002's Insomnia or 1997's L. A. Confidential much more.",
    "145": "The movie starts so well, a kind of 'who's done it show' but then it turns into a big cop-realtor drug trafficking business plot with so many questions and no answers. And at the end we do not even know who was the killer.Why there are so many loose ends with no answer?I think the acting was great from everybody. Amazing actors, very fitting character choices.I was not also keen on the music being so dramatic/laud almost the whole time. It could have been so much better.I cannot say I hated this film, I was more disappointed at the rushed ending leaving the loose ends. It almost feels as if the editing was not done right and someone just cut important parts only to make the movie shorter.",
    "146": "Star studded cast can't save this movie from its biggest flaw, it's boring. Hollywood loves Del Toro and Timberlake, but even them doesn't look comfortable in their roles.Right until the end I couldn't figure out the role Alicia Silverstone suppose to play. I get that she is the wife of Del Toro, but why on earth is she interferes with the police business. Is it fir the sake of women power or parts of it were taken from other police stories?This movie feels like it is trying to emulate other police dramas of good/bad cops, but failes incoming so.What we've got was a grim, boring movie with no thrills, tired lead and uninteresting development.Nothing really good there, so I'd advise to skip thus one.",
    "147": "IN A NUTSHELL:\nThe story is about Tom Nichols, a hardened New England detective in pursuit of a case where nothing is as it seems. It begins to dismantle the illusions in his life.This is the directorial debut of Grant Singer. He also wrote it with Benicio Del Toro and Benjamin Brewer. Benicio Del Toro also stars in it with Justin Timberlake, among others in the great cast.THINGS I LIKED:\nOthers in the cast you'll love seeing are Alicia Silverstone, Frances Fisher, Eric Bogosian, Domenick Lombardo, and Ato Essandoh.We all know Justin Timberlake has some serious pipes, but he also does a fantastic job in all of his acting roles. Fun fact: he's wearing brown contact lenses in this role.Benicio Del Toro and Alicia Silverstone dated in real life for about a year. They also appeared together as love interests in the movie Excess Baggage in 1997. Unlike most detective movies, they actually have a good married in this movie.Pay attention to all of the clues. They're hidden cleverly.There is some subtle humor to make the characters endearing.I love twists and turns. There are plenty of red herrings that will try to divert your attention to the wrong suspects, of course.THINGS I DIDN'T LIKE:\nLike a snake, Act 1 moves very slowly, but then, things really pick up and hit you over the head.It's really much longer than it needs to be.TIPS FOR PARENTS:\nKids will be bored. It's not appropriate for them anyway\nProfanity, including F-bombs\nAn unmarried couple lives together, even though the woman is already married.Talk of a brutal murder, and portrayal of murder.We see some blood on parts of a dead body and on other bodies, as well as blood splatters.Talk of a hooker\nLots of alcohol.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "148": "19min - so far slow start and fast at the same time. It's slow and building up but at the same time it feels rushed and chaotic. Completely neutral so far30min - nothing has really changed. Slow and chaotic. But I am patient/51min - it might be picking up the pace... about time59min - if you loved True Detective... this is not even the same shelf... unfortunately...1h 5min - mediocre music choice...1h 11min - I think it might be picking up the pace from now on... we'll see..1h 25mib - it's speeding up/1h 37min - getting all tensed up1h 43min - now that surprised me nicely1h 50min - a truly scary situation...1h 56min - getting really tensed up, will it snap?2h 1min - oh it definitely snapped/Barely worth my time. Meh. Super slow, filled with totally useless scenes and a little bit of something at the end... Just no.",
    "149": "The movie itself is great, intense, and almost great till the conclusion. But what makes this movie above the average crime-cop thriller is Benicio. He's the most talented here and obviously who saves the show to sink because of the rushed conclusion.First, the story is interesting till the last part of the movie. I don't understand why you can build a great story and finish it in a rushed way. I mean, there are so many questions to answer.Second, Benicio's acting skills are superb here. You can feel him and emphasize with him easily. That means his job is great here. Again.Last, cinematography and music are great. Excellent job in a technical way speaking.So, overall a good cop-crime thriller with an excellent cast but it makes you feel like it could have been far better with a more elaborated conclusion. Anyway, I recommend the movie to people who haven't watched similar movies."
}