{
    "0": "Quick review: 'Eileen' is one of those films where all the pieces were there to be something great, but they just weren't quite assembled correctly. The film just comes across a little flat. There's quite a prolonged and drawn out build-up, and then the pay-off isn't quite worthy of it. I still liked the film, don't get me wrong, but I can't help feeling it could've been something more.There are a few attempts at humour long the way, none of them really land though. And there are a couple of fake-out scenes that were truly shocking, but ultimately meant nothing unfortunately. Not a bad film, but not one I'm sure I'll remember much of a year from now. 6.5/10.",
    "1": "You have a fertile and quite vivid way of dreaming, it's a way to pass the time thinking and scheming, after all home life is bad, with an alcoholic dad, who you keep topped to the brim, showing well-meaning. At the prison where you work starts a new Doctor, called Rebecca it's soon clear you really want her, so you swoon in mother's clothes, as she's never growing old, perhaps your visits and your haunts, will be no longer. But this woman is not all you think she is, she has surprises nestled underneath her lid, quite spontaneous, unscripted - you may feel somewhat conflicted, as the credits start to role, you might just quiz.Wonderful performances.",
    "2": "Eileen is a case of not enough happening in the first two acts and too much happening in the 3rd act. Because for most of the first 2/3rds I just couldn't figure out where the film was going. Sometimes for better but sometimes it meant that a lot of those portions dragged considerably. The 3rd act takes a pretty drastic change that I found pretty intriguing but I don't think had enough set up to fully justify. It made me wish that the script focused on a different perspective than it did in retrospect. The ending is also pretty abrupt and left me with more questions than answers. Thomasin Mackenzie and Anne Hathaway are great though and every scene that they share are when the film was at it's most captivating. It's also very well shot with a really good 60's like aesthetic. Eileen as is was a pretty intriguing ride but it's hard not to think that there's better version of this story existed in the script somewhere.",
    "3": "Mark Kermode gave this film a positive review with Simon Mayo on their YouTube podcast (and made an obvious reference to the Dexys Midnight Runners song \"Come On Eileen\"), it sounded like an interesting independent film and I decided to go and see it in the cinema during its limited release. Basically, set in Boston, Massachusetts in the 1960s, Eileen Dunlop (Thomasin McKenzie) is a young woman who lives a dull existence working in a youth detention/correctional facility (young offenders prison) for teenage boys. At work, Eileen is given the cold shoulder by Mrs. Murray (Siobhan Fallon Hogan) and her colleagues. She has been watching one of the inmates, Lee Polk (Sam Nivola, Alessandro's son), for some time and may be having fantasies about him. Eileen's home life is worse however, living with her widowed and alcoholic father, Jim (Shea Whigham), a former police chief who suffers from paranoia and is emotionally abusive towards his daughter. Eileen frequently daydreams about killing herself and her father. Her world is turned upside down by the arrival of a new psychologist, Rebecca Saint John (Anne Hathaway), who joins the prison staff. Eileen is immediately drawn to Rebecca's intellectual conversation and glamorous appearance. After Eileen has been talking about him, Rebecca begins working with Lee Polk, who is revealed to have stabbed his father to death and has been imprisoned since. Rebecca invites Lee's mother, Rita (Marin Ireland), to speak with her and her son, but Rita soon leaves distraught after Lee refused to speak with her. Rebecca invites Eileen to join her that evening at a local bar. Rebecca introduces Eileen to smoking, and they spend the night drinking and dancing. Rebecca kisses Eileen before leaving which excites her. The next morning, Eileen wakes up lying in her own vomit in her car and finds that Jim locked her out of the house. While cleaning the car, a local policeman visits to tell her that the neighbours have complained about Jim's violent and erratic behaviour. Consequently, Jim must relinquish his gun and give it to Eileen. At work, Eileen is upset to find out that Rebecca has already left for the Christmas holiday. Eileen spends the day sleeping on Rebecca's desk. Eileen receives a call from Rebecca on Christmas Eve, inviting her for drinks at her house. Eileen is delighted and they have a drink when she arrives. But Rebecca is panicked and eventually reveals that they are actually in the Polks' house. Rebecca arrived at the house earlier to question Rita about Lee, suspecting he was sexually abused by his father. But their conversation became heated, they got into a scuffle, and it ended with Rita falling into the basement. While Rita was unconscious, Rebecca tied her up and drugged her. Rebecca intends to coerce Rita into admitting involvement in her son's abuse and wants Eileen as her witness. Eileen reluctantly agrees to help, getting her father's gun from her car. In the basement, Rita initially refuses to answer Rebecca's questions, until Eileen threatens to shoot her. With the gun's safety off, Rita breaks down and admits that, although initially ignorant of her husband's abuse of Lee, she eventually became aware after walking in on her husband in Lee's room. She felt powerless to stop the abuse and enjoyed her husband's renewed interest in her, so it continued, she gave Lee an enema and bathed him before he went to bed. As Rita finishes her story, Eileen (perhaps accidentally) shoots her in the shoulder. As she yells in pain, Eileen and Rebecca drug Rita into unconsciousness. As Rebecca panics, Eileen suggests that they frame Jim for Rita's shooting and run away together. Eileen finally admits she has feelings and is in love with Rebecca. They carry Rita and put her into Eileen's car boot and agree to meet at Eileen's house. Arriving there, Eileen waits and looks out the window waiting for Rebecca, while her father is sleeping in his chair. After Rebecca fails to show up and dawn breaks, Eileen drives to a remote forest. She leaves the still-drugged Rita in her car and turns on the engine to asphyxiate her smoke. Before leaving, Eileen's father briefly woke up and she wished him goodnight. Eileen returned to the main road and hitches a ride, smiling to herself as she leaves the town; the fate of Rebecca is unknown. Also starring Owen Teague as Randy, Jefferson White as Buck Warren, and Tonye Patano as Mrs. Stevens. McKenzie gives a good performance as the young prison worker with strange thoughts, but Hathaway almost steals the show looking hot and being mysterious, they are an intriguing double act, I kind of hoped Whigham was on a bit more. It is a fairly simplistic story with good period detail, a near-lesbian relationship that is toxic and takes a dark turn much later is interesting, but it doesn't go quite the way I hoped or expected, it could have been more thrilling or racy, and I must say that the ending was a bit of a let-down, overall it is intriguing enough, a reasonable psychological drama. Worth watching, in my opinion!",
    "4": "The film captures the dark and twisted tone of the book, as well as the complex and unreliable character of Eileen, who narrates the story in voice-over. The film also adds some twists and surprises that deviate from the book, making it more cinematic and suspenseful.The film features outstanding performances by the lead actors, especially McKenzie, who portrays Eileen with nuance and intensity. She shows Eileen's vulnerability, insecurity and desperation, as well as her cunning, cruelty and obsession. Hathaway is equally impressive as Rebecca, who is charming, mysterious and manipulative. She has a great chemistry with McKenzie, creating a fascinating and disturbing dynamic between the two women.Eileen is a compelling and disturbing film that explores the themes of identity, loneliness and violence.",
    "5": "I saw Eileen, starring Thomasin McKenzie-Last Night in Soho, Jojo Rabbit; Shea Whigham-Mission: Impossible_Dead Reckoning Part One, Joker; Jefferson White-Yellowstone_tv, God's Country and Anne Hathaway-Interstellar, Get Smart_2008.I wasn't expecting too much and I wasn't disappointed. It started out alright but ended really weird. Thomasin plays a secretary at a juvenile detention center in 1960's Boston. She leads a boring life and lives with her father, Shea. Shea is a retired cop and sits around the house a lot, just drinking and swinging his service revolver around in the air-I guess to remind everyone that he used to be a cop. Jefferson plays the cop that keeps answering the call when Shea gets his gun out. Anne plays the new psychiatrist at the center and becomes friends with Thomasin. Thomasin has a lot of fantasies and day dreams-some sexual, some murderous-and starts to think that Anne may have some feelings towards her. Then, like I said, it gets weird at the end and leaves unanswered questions.It's rated R for violence, language and sexual content-no nudity-and has a running time of 1 hour 7 37 minutes.It's not one that I would buy on DVD or stream. If I were you, I'd wait until it comes to cable tv.",
    "6": "It was an odd little film and at first I thought it rather strange in the prison and Eileen working there. Then when the older woman arrives things get better. As they go to the bar and Eileen hopes it will be okay and it goes well. With the music and even the dancing of the two girls it is so well done that I almost had tears in my eyes. In the next third it was the boy in the prison who had killed his father and we see his mother called in by the older woman Anne Hathaway, she refuses to speak at the meeting. The third part of the film is incredible like a noir, nasty and wonderful. At the very end there is something else that is strange but happy, maybe. Moving and difficult, but a very good film.",
    "7": "Just Got out of an Eileen Screening.The Way Anne Hathaway Delivers that line was so Chilling and whilst I was sitting their in the cinema, when she said that line and specifically because of that Line Delivery, it was a moment of a \"Oh, Here We Go\" line.I Love the Build of this Film, it's a Slow Build to that inevitable line.Elements of the Film -1. ⭐ We have, I would say 3 Super Strong Performances and 1 Strong Performance.💗 Thomasin Mckenzie, this Girl Surely has to be a Superstar at Some Point. She does so Little(For the Most Part) in her Emoting and she's so Dialed Down(within this Film Performance), and Yet is So Effective. On top of that \"You have a Plain Face\" as Rebecca puts it. And Honestly, in her Case Specifically, that Plainness works in her Favour in multiple Aspects. Another thing also, she totally sells that she was in Love with Rebecca. 😍💛 Anne Hathaway, what more can I say. Just so Skilled in Acting Ability and Line Delivery. She plays this Shady, Sure of Herself, Sexy character named Rebecca, who Eileen is in Love With.💚 Marin Ireland, Super Strong Performance in my Opinion, she's not In the film for long but that segment near the end that she gets was Shocking as Hell and the Stakes were also Strong because of This.🍻 Shea Whigham, he plays the Drunk Dad, and I really like the scenes with his character and Eileen just talking. Good acting and Strong Performance from him.2. 🎵 The Score was really good and effective in multiple Scenes.3a. 📜💬 The Screenplay, I loved some of the moments of \"outta nowhere\" gunshots happening to either themselves or other people, because of the Auditorium Being so loud, anytime it was a long prolonged quiet scene, I was just waiting on edge 😆, but it only happens 3 times. Also, all of the Dialogue was Strong, many scenes are just people talking but it was delivered well and was interesting, when you have scenes that are just people talking yet keep people engaged (me anyway), you've won half the battle.3b. 📈The Plotline, I won't give away the Plotline but let's just say, things take a turn for the worst.4. 🎥 The Cinematography and Edits were Solid.And here's my 1 Major Gripe with the Film -1. 😔 Why that Very ending? Look, I haven't read the Book but even if the book ends like that, you CANNOT end the film like that. They needed to rewrite just that Very Ending, everything up until Eileen hitches a Ride Works. Just go back a bit and do something with that \"situation\" that Eileen and Rebecca were in.When the film ended, I could feel that the audience were bewildered when it ended, and everyone just got up slowly like \"that's it?\" 🤷Overall, a Great watch, a Slow Build with Outstanding Performances but that Very ending just brings the film down so much (for me).",
    "8": "I saw Maesro on Saturday and I saw Eileen on Sunday. And much to my surprise, I found Eileen the more enjoyable film. I loved the film Nior feel, the acting was good, there were some nice twists, and more to the point, I could connect the dots. Something that I thought Maestro lacked. I really love films that make go, \"Wow! I can't believe that happened.\" And I really thought the music added a lot to the picture as well. There were no Lenny Bernstein compositions, but the songs were just as integral to the movie.If you like film Noir, if your like strangeness, and unusual characters, give Eileen a watch. I think you will be pleasantly surprised. As for Maestro, I am not so sure.And that's my opinion.",
    "9": "Its not very often you see a movie with so many amazing performances in it. But that's what won me over with Eileen. A movie that i originally only watched because it was made by film4 and looked dark and gritty.I'm not sure i'd describe the movie as a thriller. Its more of a drama/character study which takes a turn towards being a thriller toward the end. If that sounds good to you i'd highly recommend the movie. Especially seeing as star Thomasin McKenzie is great in the movie. As is Shea Whigham as her father.The standout however is probably Anne Hathaway. Who we expect has more to her character and more going on than we first get to see. A great movie if you like psychological, gradual slow burners.",
    "10": "William Oldroyd attempts the change of tone in this film - its big twist - with all the finesse of a DJ with one turntable mixing two tunes together. And Oldroyd isn't a very good DJ to start with. When that fails, all he can think to do is turn the volume up on the score. All the problems with this film lead back to Oldroyd.As readers of the novel will know, Otessa Moshfegh (who oddly gets half the screenwriting adaptation credit here, as if she had little familiarity with her own novel and how it works, and doesn't work) filled her pages with absolute grime, leaving the reader to imagine hair-filled carpets, drains, basins, counters, etc. Her anti-heroine never shaves her legs, much less her pubic area. Just about every setting in the novel is a public health crisis while Oldroyd's film has exactly one pubic hair. In a bar of soap. This is a problem.\"X-ville,\" as the New England town that is the setting of the novel Eileen is called, is the kind of place even the reader doesn't want to spend time in, a place where understandably no one begrudges the titular character for getting out of - so much so, no one even ever comes looking for her after her departure (even though her abandoned vehicle would've led the authorities right to her, a lapse in logic we're perhaps meant to believe is symptomatic of the inertia engulfing the place). Moshfegh is hardly working for the X-ville tourism board. This is all spelled out in the opening chapter of the novel, since Eileen is narrated in retrospect by the title character later in her life. This is another problem with Oldroyd's film since the adaptation only deals with the immediacy of these events and thus the duality of the novel - and all of its context and point of view - is lost. Eileen is not a perfect work or even a masterpiece of modern literature, not by a long stretch; its strength lies in its narrator's voice which nobody here, including the author herself, seems to understand.Casting, pretty much all the way around, is a major problem. Though Oldroyd's cast is expert in their approach to what they've been given, they are all largely miscast. The casting of Thomasin McKenzie in the title role is particularly blunderous. She's a wonderful actress and acquits herself nicely here but she's so miscast the most she could ever hope to be is a paper-doll construction of the actual character, a character who should be greasy and unkempt, who is probably pasty and smells a bit off - you will need reminding that Eileen Dunlap is a WORLD-CLASS MISANTHROPIC SELF-LOATHER, along the lines of Ignatius J. Reilly, who doesn't shave her legs, her underarms, who is scatalogically obsessed to the point of timing out and controlling her massive bowel movements which are one of her life's few pleasures and often has an itchy bottom. I'm thinking Janeane Garofalo, in her '90s prime, might've turned heads taking on an assignment like this. But not here. McKenzie's casting would make more sense if she were revealed to be an imposter who tied up the real Eileen Dunlop and locked her in a closet. She tries. But with her perfect complexion, perfectly brushed hair, and soft willowy high pitched voice, it's amazing she suggests any internalisation of the character at all - and given there's no voiceover, the entirety of the character, who is given full uninterrupted flow in the novel, is required to be fully internalised here. It's like watching a poorly cast high school production of Eileen. McKenzie isn't helped at all by the filmmakers' decision to rob her of Eileen Dunlop's primary objective - escape, to get out of X-ville at any cost - until the film's final minute. It doesn't even qualify as an after thought since it appears they never gave it any thought at all. Instead this is substituted with minor fantasies of Eileen's, a few moments here and there, the likes of which used to be popular on certain prestige television shows about 20 years ago. Even these are poorly staged and perplexingly lacking in tone - are they supposed to be funny? Empathetic? Who knows. More likely, they're just meant to jolt the audience out of their stupor.The much vaunted performance from Anne Hathaway as Rebecca St. John proves to be little more than a fashion story. She is similarly miscast though likely her casting is the only reason the film exists at all. She's too old for this role - which is accentuated because McKenzie reads too young for hers. Eileen and Rebecca should nearly be contemporaries. (It's telling that Rebecca is never described as a \"Dr.\" in the novel, a title she is granted here to account for Hathaway's obvious gravitas.) Instead, what little chemistry the two have reads more like a mother/daughter dynamic, with Rebecca filling the void of Eileen's dead mother. Superficial comparisons to Todd Haynes' Carol are insulting to that work. This isn't Carol. If anything, it leans in the direction of Heavenly Creatures, that is, if it were anything at all.In the novel, it's not quite clear whether Rebecca sees herself as a movie star (she's a redhead there, not platinum blonde as in the film) or, more likely, perceived as such by Eileen within the context of X-ville. Rebecca's actions certainly suggest she is a woman of serious concerns, albeit one who sees herself as towering over the plebs of X-ville; she entitles herself to be judge, jury and the law. One thing's for sure: casting a movie star as Rebecca robs her of any complexity or mystique she might of otherwise had, if she were an actual character instead of the bungle of poses and attitudes Hathaway strikes here. In the context of the film's mixed reception and spotty release, Hathaway is obviously both a blessing and a curse but she's slumming it here, imagining herself in some other movie. Oldroyd hones right in on her too, never realising that if the character is to exist at all on celluloid, she needs distance, as she is after all, a fleeting distant memory of the protagonist, who has probably been greatly embellished in Eileen's twisted, razor sharp mind, especially to account for her collusion with her. While the rest of Oldroyd's film is immediate, Hathaway's performance plays like a well-polished memory that likely never existed at all. Here she is one note and when the needle gets to the end of the record she is over without even a fade. Hathaway's performance is all chorus with no verses. She must've been enticed by the wig.Similarly, when the characters of Eileen's father and Mrs. Polk illicit our sympathy, you know the casting is way off base. Shea Wigham as the former is a terrific actor and he suggests a full character here - I like the movie he's in - but he's no Mr. Dunlop, who should be absolutely repulsive. Here he doesn't have a hair out of place - it's like Tom Ford styled him - and at worst suggests a broken down Andrew Scott, which would still be better than most. He's not quite lovable but seems a reasonable man, nothing like the lecherous, vile, abusive drunk of the novel. (He's supposed to be a hardened, psychotic former police chief suffering from ultra paranoid delusions, like \"who are all these other people in the house\"-type delusions.) A doctor states that he'll die if he doesn't stop drinking and suffer the same fate if he does but Wigham doesn't seem that pickled at all and appears to put on a clean shirt every day; nothing like the yellowed, sweat stained, stretched out wife beaters of the novel with the smell of hard liquor rising from his every pore, and probably urine and faeces as well. (In the novel, he's beyond caring if his daughter sees him doing his business on the toilet.) Wigham seems like his life would be greatly improved if someone would just invent a television remote 20 years earlier.Marin Ireland is, of course, a terrific actress and she does her job here - with a much truncated speech that has been so shredded in this adaptation viewers who haven't read the novel will likely need a special decoder ring to figure out what she's talking about. Which begs the question: who did the filmmakers make this film for? Are they embarrassed by the content of the novel? Do they think diluting it in this way - and arguably robbing it of its power - somehow makes it more...commercial? Mrs. Polk needs to be more a of beast, and for all that she gives, the slim and pretty Ireland only confounds matters further. At a point when the entire film is spinning out of Oldroyd's control, and Eileen is at its blackest, he fills the screen with the faces of his pretty female leads and the entire premise couldn't seem more contrived or poorly staged. You half expect someone on screen to just say \"Scene\" and roll credits.What remains on screen is so deflated and half-hearted the mere minutes that follow hardly matter, which seems to be the consensus of the filmmakers who appear to have spent more time commissioning custom \"period\" style graphics for their producing partners than figuring out how to adapt this troublesome, unyielding, almost stubborn novel to the screen.Ultimately, Oldroyd's limiting sense of taste and, dare I say it, surprisingly middle class sensibility, does not extend itself to the vomitous, bilious \"haven't brushed my teeth in three days\" taste where Moshfegh's novel idles and without that, as a starting point, it just doesn't work. We're meant to be lulled into a sense that the gruesome, pointless mundanity of young Eileen Dunlop's life can't possibly get any worse - and then it does. The third act isn't meant to be a jarring, half-hearted, confused tonal shift. It's meant to credibly emerge from what is already there, from what has been there all along: the grotesque. Oldroyd's folly seems to be in thinking he could make a tasteful version of Eileen, which is a bit like a bloodless version of Jaws. Only worse.",
    "11": "Halfway into Eileen and I was so intrigued by Rebecca, certain she's hiding some secrets about herself. By the end of the film something so big has come along that you're not thinking about what Rebecca's secrets are any more as the situation has turned to something much more urgent.The shock of the twist was certainly out of left field and gives the viewer a very effective, if unpalatable, jolt; however after the credits roll you feel tricked that the film gets you intrigued about Rebecca and then doesn't give any answers about her aside from the fact she's clearly able to get herself into quite a (justified imo) pickle.Unfortunately the 3rd act feels rushed... Rebecca disappears, which would be fine if the film gave this disappearance and its effect on Eileen any time to breathe. Instead Eileen is surprisingly chill about the whole situation, she instantly comes up with another plan (was it meant to look like carbon monoxide suicide? When she's clearly been shot in the shoulder? The car will be traced directly back to her surely)I was left bemused about what she was happy about in the truck at the end, after everything she's just been through there really is nothing to be smiling about. I guess they wanted it to feel like a happy ending even though it really wasn't?I'm giving this 6 purely because the performances were brilliant which elevate it from being a 5.",
    "12": "This film is quite dark. Definitely leave the kiddos at home for this one. The audience I was with, found itself snickering at the absurdity of some of the events that take place though. Thomasin McKenzie does a great job playing the awkward main character who can be darkly comedic at times. I thoroughly enjoyed her New England accent in this. She will most certainly win more acting awards in her future.Anne Hathaway is very pleasing to the eye as a blonde in this and her character is perfect for this noir film. She does not disappoint.The movie does a fantastic job of keeping the viewer wondering what will happen. Like most other reviews have disclosed, there is a chilling twist. It sends the movie in a completely different direction that is almost guaranteed to be unpredictable to anyone seeing it for the first time.",
    "13": "Eileen features some of the years best performances. Thomasin McKenzie shines here and shows the most range she has had in a movie. She yet again proves that she is one of Hollywood's best upcoming actresses. And as always Anne Hathaway is absolutely brilliant. She plays such an intriguing role here and plays it to perfection. This movie is very disturbing and I like how it leans into it. There is a twist towards the end of the movie that I absolutely love and I think the movie executes it very well. The movie is also very well directed and the costumes are fantastic. This movie isn't getting much attention now but once it comes out on streaming I think it'll definitely grow a fan base. My only real critique is that the movie is too short. There could've been some more exploration of the characters and the resolution could've been a bit more fleshed out. Overall Eileen is a thoroughly entertaining movie with some great twists and stellar performances. I wish it was a little longer but I would definitely consider this 2023's sleeper hit. 7/10.",
    "14": "The acting was great, how they filmed it was great, but there was something missing. I don't what it was. It just took so long to get to the suspense, and it only lasted what seemed like a span of ten minutes.The story is very much the story of is Rebecca real or someone that Eileen is just making up in her head to release who she really is inside. To release the inner bad girl, and in the process she goes to far.But I was entertained, it was just a really slow start that didn't seem to go anywhere. Even the finale focused on a character that was so minor. As I write this I figured out what was missing. The relationship between the boy and Eileen/Rebecca. If they would have shown his story more, you would of gotten why she did what she did.But it's worth a watch if it's on a streaming service.",
    "15": "This film is quite dark. Definitely leave the kiddos at home for this one. The audience I was with, found itself snickering at the absurdity of some of the events that take place though. Thomasin McKenzie does a great job playing the awkward main character who can be darkly comedic at times. I thoroughly enjoyed her New England accent in this. She will most certainly win more acting awards in her future.Anne Hathaway is very pleasing to the eye as a blonde in this and her character is perfect for this noir film. She does not disappoint.The movie does a fantastic job of keeping the viewer wondering what will happen. Like most other reviews have disclosed, there is a chilling twist. It sends the movie in a completely different direction that is almost guaranteed to be unpredictable to anyone seeing it for the first time.",
    "16": "Eileen features some of the years best performances. Thomasin McKenzie shines here and shows the most range she has had in a movie. She yet again proves that she is one of Hollywood's best upcoming actresses. And as always Anne Hathaway is absolutely brilliant. She plays such an intriguing role here and plays it to perfection. This movie is very disturbing and I like how it leans into it. There is a twist towards the end of the movie that I absolutely love and I think the movie executes it very well. The movie is also very well directed and the costumes are fantastic. This movie isn't getting much attention now but once it comes out on streaming I think it'll definitely grow a fan base. My only real critique is that the movie is too short. There could've been some more exploration of the characters and the resolution could've been a bit more fleshed out. Overall Eileen is a thoroughly entertaining movie with some great twists and stellar performances. I wish it was a little longer but I would definitely consider this 2023's sleeper hit. 7/10.",
    "17": "The acting was great, how they filmed it was great, but there was something missing. I don't what it was. It just took so long to get to the suspense, and it only lasted what seemed like a span of ten minutes.The story is very much the story of is Rebecca real or someone that Eileen is just making up in her head to release who she really is inside. To release the inner bad girl, and in the process she goes to far.But I was entertained, it was just a really slow start that didn't seem to go anywhere. Even the finale focused on a character that was so minor. As I write this I figured out what was missing. The relationship between the boy and Eileen/Rebecca. If they would have shown his story more, you would of gotten why she did what she did.But it's worth a watch if it's on a streaming service.",
    "18": "Thomasin McKenzie is quite good as the eponymous, rather timid, prison secretary who lives a rather pedestrian life watching the couples make out in the car-park, or fantasising about a quickie with one of her colleagues, before returning home to her retired cop/dipso father replete with two bottles! The arrival of new psychologist \"Rebecca\" (Anne Hathaway) injects a little life into her dull routine. This assertive sophisticate takes an interest in \"Eileen\", they go for a drink - there's even some flirting - before \"Rebecca\" shares a secret with her new friend that involves a young man in prison accused of the brutal murder of his father, and of just what his mother might know of the crime and it's causes. The first hour is quite intriguing but that sense of anticipation is let down by a last half hour that is really quite undercooked and the denouement, well that is just incomplete - on just about every level. The acting and writing is fine - nothing more, but I left the screening thinking that something was missing. What exactly was the point here? It's a good looking film - effort has certainly gone into the aesthetic but I'm not sure I'm really any the wiser.",
    "19": "At first, I'd want to say the film Eileen 'Carol by way of Jim Thompson,' and all this while being based on a whole other book (unread by me). But that makes it sound both more emotionally restrained and/or romantic and even more unpleasant than this is or could even pretend to be. And there is a nasty streak running through this that means you can't much \"like\" anyone or \"relate\" and that is, in its way in 2023 cinema, refreshing. Needless to say, it's my kind of thoroughly engrossing, perverse, precisely character-based and subjectively presented study Neo-Noir, where circumstance and chance meets the fatalism of a child of a cop, and yet...I didn't think it was tonally all over the place as I've seen a few of the reactions, as it is all of a piece as we are seeing things from this young woman's jaundiced and outsider-y perspective. On that level, for as unpleasant as things get for Eileen (and as unpleasant as she makes things eventually), it is all about a woman - a human being, but especially as a woman - who has so little prospects or hope for much in the way of change for herself, and the one new beacon of light is quite up front about what she gets out of people (and that is... pretty one sided!)And if you need a connecting thread, going back to this as a Feminist story (or an anti-Feminist one if that is your reading), one could say Eileen is about a woman realizing who she is, what is her agency (and the full dearth of it), why she needs to break free, and this despite everything in her life being crap. As is the case with countless Film Noirs and Femme Fatales, sometimes it takes that one New Wild Card Connection (ie Stanwyck in Double Indemnity) to shake things up and change things; Rebecca hearkens back to so many of the cunning and sultry blond women of yore, only this time the \"Average Joe\" archetype is a mousy young lady who is at a muddy crossroads with a Very Bad Dad (though he's not the only one, as it turns out eventually.... mild spoiler).The film is brown and gray and smokey-looking, locations highlighting snow snd Christmas time can still look decrepid, but you dont feel totally despairing watching even as Eileen the character may be at points (that shot of her in the bathtub, my goodness). Eileen the film is, like Carol, beautifully shot despite/because it has such a moribund and brooding color palette and vibe. And McKenzie and a career-best Hathaway have electric chemistry (which, as it turns out, is all part of the Hathaway-Rebecca character's entire persona to act like she has this chemistry with anyone as a perpetual user), while Shea Wigham and Marin Ireland appear in bursts in this like these little tornados that pick you up and thrash you around with what they unleash on the audience.The ending is... hmm. Gotta sleep a little more of that one. Or... maybe not. Maybe that does make sense on a story level, and I wanted one more McKenzie and Hathaway scene (McKenzie by the way gets a much more unnerving and difficult person to portray, totally f-ed up and horny and confused and full of potential for violence, and it's nice to see her with someone meaty after Last Night in Soho didn't give her as much). But Eileen hits the spot if you're hankering for an (eventually) suspenseful story of moral decay and the things that make life worth living - like watching the partner you have a crush on punching a man for coming on so strong and then going back to dance without a care in the world.",
    "20": "Eileen: A Noir film with not just one but possibly two Femmes Fatale (depending on how you look at it). This movie strides through the genres: from lesbian romance akin to Carol to Classic Noir to Horror, even a touch of Hitchcock with a soupcon of Black Comedy. Massachusetts, early 1960s Eileen (Thomasin McKenzie) is a young secretary in a juvenile prison, she's lonely, dreams of love with one of the young guards, is fascinated by an inmate Lee Polk who killed his father, the Polk family are central to the unfolding of the narrative. Eileen looks after her alcoholic ex-cop father, he's verbally abusive but some of this might be designed to drive hr away to her away, to find a life of her own. A new prison Psychologist, Rebecca (Anne Hathaway) arrives and sweeps Eileen off her feet, takes her drinking and dancing, then involves her on a strange and dangerous situation. There is a plot twist at this point that cannot be revealed here without giving too much of the storey line away. The Classic Noir tinged with Horror takes over at this point, Eileen reveals her own hidden depths of depravity. Matching or even outclassing Rebecca. Her fantasy life has always been quite violent and some of this may have have bled through to influence her real life actions. Great performances from McKenzie. Hathaway and Marin Ireland as Rita Polk, Lee's mother. Directed by William Oldroyd with a screenplay by by Ottessa Moshfegh and Luke Goebel. 8/10.",
    "21": "\"Eileen\" focuses on the titular lead character (Thomasin McKenzie), a young woman in 1960s Massachusetts. Her life is less than ideal: she is sexually repressed, professionally stifled in her job as an administrative worker in a young men's prison, and has to deal with her widowed and neurotic alcoholic father (Shea Whigham) at home. Eileen's downbeat existence is upheaved, however, by the arrival of Rebecca (Anne Hathaway), a glamorous and charismatic psychiatrist who is hired at the prison. The two women's encounters with one another eventually lead down a dark path.Based on the novel of the same name by Ottessa Moshfegh (who co-wrote the screenplay), \"Eileen\" is immediately striking simply on a visual level, as every frame of it is steeped in atmosphere. The film is bathed in a wave of rusty sepias and cool blues, the only real color popping up in the form of Christmas lights or Thomasin Mackenzie's bright red lipstick. The time period and place in which it is set (1960s New England) is also demonstrated impeccably. This works greatly to the film's advantage, given that its narrative arc is quite sparsely drawn (and I don't mean that as a demerit)--simply that the story is lean and succinct.The first two acts largely work to establish Eileen's loneliness and depressing interpersonal dynamics with her father, with Hathaway's character jutting in and unknowingly shaking up Eileen's humdrum routine. It is at times difficult to discern where the story is exactly going; there are hints of a budding lesbian love affair, though the character perspectives and their foggy motives more or less put the brakes on this avenue (at least for one of them). There is a dark twist in the last act that feels somewhat arbitrary, though it functions in terms of driving the timid Eileen to take drastic actions for once in her life (for better or for worse). If nothing else, the climax of the film is disturbing.While I feel that the film comes across as slightly irresolute in terms of character motives and their relationship to the events that transpire in the climax, what makes it all ultimately work is the well-written dialogue paired with McKenzie and Hathaway's performances. McKenzie excels in her portrayal of the emotionally downtrodden protagonist, while Hathaway goes full-throttle (bordering on camp) as the Harvard-educated, freewheeling Rebecca, a woman with her own unnamed demons. Shea Whigham also gives a memorable performance as Eileen's alcoholic ex-cop father.While I think the screenplay leaves behind a few loose ends in the wake of arbitrary events and decisions, I suppose it is also worth noting that these loose ends, arbitrary events, and decisions are also sometimes demonstrative of life itself. The film effectively depicts just how the chemistry between two humans can quickly spiral into a grim and dangerous place, with neither party foreseeing it. The fact that it is visually stunning and robustly acted make it worth viewing. 8/10.",
    "22": "This movie had all the makings of a great film. Act 1 provided a satisfying introduction to our main cast and let us explore the intricacies of their personalities. It seamlessly eased into Act 2 with the twist that was greatly hinted at in both the trailer and the synopsis. Then once we get to the height of the climax the film ends. We get no Act 3 and no resolution to what went on in the whole film. Every single plot point was left open with too much room left to interpretation. I honestly got hooked onto these characters and invested in their lives and stories and from Act 1 to Act 2 I felt like the film had an average score of a 7 that turned into an 8, but when everything ended so suddenly that score in my head dropped to where it is now. This film really should have had another hour to explore the consequences of the character's actions whether they were allowed to lead their same lives or not. As for now, we as the audience will never know and that doesn't jive with this viewer.To sum up my thoughts the movie was the start of something great. But since it cut off so suddenly I'm left to wonder what the point even was.",
    "23": "This one is going to be polarizing but I enjoyed this one.It's an interesting psychological character study of a movie with strong direction from William Oldroyd, interesting writing, and good performances from the cast members. Oldroyd's previous movie \"Lady Macbeth\" was really good and Oldroyd continues to provide strong direction on handling the movie's tone, narrative and the atmosphere throughout. The narrative is interesting as it has some interesting themes and concepts explored within the characters. Although certain narrative concepts weren't the greatest, as a whole, still worked for the most part. The costumes and make-up really help add the feel of the 1960s.All the performances are great as Anne Hathaway and Thomasin McKenzie have great chemistry together. The camerawork is solid and the dialogue is well-written. The characters, while have interesting traits, I wasn't too fully emotionally connected with them and there are some pacing issues that did drag a bit.Overall, I liked it.",
    "24": "I hate giving films a 1/10 star ranking here and do it extremely infrequently. Most movies have at least some redeeming value, and it's almost an indictment of my own flick-picking skills to give one the bare minimum. But that's where I find myself with Eileen--a mess of a film without a single coherent character or theme.For a very basic overview, Eileen tells the story of the titular character (Thomasin McKenzie), a 20-something secretary at a boys prison in 1960s New England. She hates her job, has no romantic potentials, and is also basically a care nurse for a drunkard ex-cop father (Shea Whigham). But when the prison hires new psychologist Rebecca (Anne Hathaway), Eileen finds a sort of kindred spirit or role model to give her life a little glimmer of hope--until a scenario unfolds that threatens to destroy both of them.There's no way that a film starring Hathaway, McKenzie, and even Whigham should be this devoid of entertainment or thematic relevance--yet here we are. Eileen is the epitome of \"throwing stuff at the wall and see what sticks\" filmmaking, and in this case it all slides to the floor. I did not feel compelled by a single plot element--even the curveball thrown near the film's end--and I had not an ounce of care for any single character, as their creation and unfolding were so oblique and all over the place. Not a single morsel to sink my teeth into.After listening to an interview with the writers/director and hearing them essentially say that the film can mean \"whatever you make of it\", and implying that parts may be closer to fantasy than reality, it pretty much sealed the deal for me. Perhaps if you enjoy providing every scrap of plot sensibility and character motivation yourself you'll like this far more than I, but it I am not a fan of such movie-making unless it is exquisite--and Eileen is a far cry from that.",
    "25": "Let me start out by praising the movie. The characters are well developed and believable and that is true from the first moments of the film until the conclusion. The acting by Ann Hathaway and Thomasin McKenzie is quite simply of the highest caliber ; they nail the characters they are portraying. The locations and 'art direction' are every bit as good as qualities I reference above. You will be drawn into the movie from its beginning and you're never quite sure where it's going. The ending will disappoint many and I guess I too was disappointed at the end but to be fair the script is taken from a novel. The film is expertly executed in every phase of the filmmakers art, I don't think that can be disputed but for those that what all the loose ends tied up or a conclusive ending, they will find the film unsatisfying. I can tell you this; I would be pleased if only half the movies I go to see were as well done as 'Eileen' and I think the movie will stay with you and make you think. It was only then, after I had seen it and digested it that I fully appreciated the full quality of the film. Post Script : my partner pointed out some details in the film the subtlety of which I did not pick up on which if you get them will only make the film better in my estimation.",
    "26": "As \"Eileen\" (2023 release; 98 min.) opens, it's the late 1950s/early 60s and we are introduced to the title character, a 24 yo who works at a corrections facility for teenage boys in New England. Eileen lives with her dad, a retired cop who is an alcoholic and emotionally abusive of Eileen. Then just in time before Christmas, the corrections facility introduces the new resident psychologist, a splashy dame from Harvard named Rebecca... At this point we are 10 minutes into the movie.Couple of comments: this is the screen adaptation of the novel of the same name, which I have not read and hence I cannot comment how closely the movie stick to the book. The best aspects of the film are the two leading performances: Thomasin McKenzie (as Eileen) and Anne Hathaway (as Rebecca) are solid, period. Alas, it's not their faut that the script leaves them shorthanded for a good part on the movie. Indeed the Big Reveal doesn't come until just over an hour into the movie, and hence the \"crime drama\" part gets only the last half hour. Id this a \"bad\" movie? It is not. But neither is it great or a \"near classic\" as another reviewer here puts it. For that the movie lacks the necessary punch.\"Eileen\" is currently playing in US theaters. The Saturday matinee screening where I saw this at was attended poorly (only 3 people including myself). Even though \"Eileen\" is currently rated 85% Certified Fresh on Rotten Tomatoes, I can't see this playing much longer in the theater. Of course don't take my word for it, so if you are in the mood for an ok, but just ok, psychological crime drama, check it out and draw your own conclusion.",
    "27": "Eileen is directed by William Oldroyd (who? Yeah I have no idea either) and is apparently based on a 2015 book of the same name which I haven't read as to be honest I only saw a trailer for the film about a week ago. Set in 1960s Massachusetts the story is set around the titular (any excuse to use that word) character played by Thomasin McKenzie. Eileen works at an all boys prison as is a bit set in the ways of her everyday routine. She goes to work and then she comes home only to have to continue working basically as a carere for her alcholic dad played by Shea Whigham (no relationship to the police officer in the Simpsons although he was good in Boardwalk Empire). Eileen's life is changed when one day when the prison brings in a new physiologist called Rebecca played by Anne Hathaway who let's just say doesn't play by the rules.As I mentioned earlier I only saw a trailer for this film about a week a go otherwise I wouldn't have known about it (good job marketing). The trailer was very vague and for this type of film it needed to be and so what it was mainly the cast that had me intrigued about this one. Thomasin McKenzie you might remember was the lead in Edgar Wrights Last Night in Soho, a film in which she shown in for me. I was surprised to not have seen her in more things since then but I'm happy to say she's back on fine form here. She's playing a character that needed to be played with subtly. A character that is learning about herself and developing slowly as the film moves on and Thomasin does a great job of getting those emotions across. She even outshone Anne Hathaway for me which is some feat considering she puts in a solid performance in this film too.As for the story itself, it's very much a slow burn focused around self discovery and watching a young woman start to find herself in the world. It's really not for everyone and I did feel that despite its runtime being just shy of 100 minuets it didn't always use that time as well as it could have. I particularly found the ending to be a bit disappointing especially after a film that up until that point does a good job of keeping the tension and keeping the audience guessing as to where the film is going next. If you enjoy good acting and don't mind a slow burn thriller then this one's for you but I do feel this one's going to have quite a niche target audience and may struggle at the box office.",
    "28": "EILEEN is a slow-burn of a movie, for sure, but it's fascinating nonetheless and rewards the patient viewer with a completely unexpected (but perfectly legitimate) twist in its final third. Very thoughtful attention to period detail (mid-60s, small-town Massachusetts), outstanding mood and mostly careful pacing contribute to the success of the film, but it is the never-less-than-gripping performance of Thomasin McKenzie (LEAVE NO TRACE) and the slightly unhinged work from Anne Hathaway that make this a film well worth the viewer's time.Eileen (McKenzie) is a young lady who returns home to her small town from college when her mother falls ill. As the movie begins, her mother had died and her father, the former police chief of the town, hangs around the house all day, drinking gin and does little other than berate his daughter and occasionally brandish a gun in the neighborhood, yelling at kids. Eileen has a secretarial job at the local boys prison, and spends much of her day gazing at the young men around her (both inmates and staff) and indulging in various fantasies, some involving sex and others involving violence. She is ostensibly her father's care-taker, but other than buying him booze, she doesn't do anything to keep house or to encourage her dad or herself to move forward. She is stuck. Other than her fantasies, it's hard to see that she has an ambition, drive or future.Enter the new prison psychologist, Rebecca (Hathaway), a Harvard grad full of modern ideas. She's been dropped right into a boys and men's club of an institution, where it's clear her new ideas and unconventional approach to work and life will likely just run her into a brick wall of resistance. If the prison is a square hole, she is certainly a round peg. But she's also the electricity that ignites Eileen. Her passions, her interests, her very appearance are transformed when Rebecca shows an interest in her.Eileen is clearly vulnerable to such an outside influence, and it's pretty clear that Rebecca is exploiting this...somehow. We're never quite sure where this relationship might be going, emotionally or physically. But when it reaches a turning point, it's a crazy ride for the viewers. The surprise of the film is delivered in such a matter-of-fact way that we are both shocked and nod our heads in acknowledgment. We didn't see it coming but it makes perfect sense, given what we've seen of these characters.No further plot points will be revealed, but suffice it to say that the final 15 - 20 minutes or so of this film are filled with incredible tension and leave your mind reeling with all the possibilities and potential consequences. Director William Oldroyd (his second film after the even more compelling LADY MACBETH) juggles what is really a lurid genre piece into a gripping character study. We watch Eileen's growth and actions with grim fascination. McKenzie is just terrific in this film and Hathaway chews the scenery to just the right degree. And Marin Ireland makes a great impression in a small but pivotal role.It's not a perfect film. Shea Wigham is fine as Eileen's father, but the role is very one-dimensional. We aren't given a chance to see that man that once was. The other very minor characters in the film are also one-dimensional too. And certainly, even at 96 minutes, one feels the film slackening its pace once or twice. I'm okay with a slow burn, but there are a few minutes of the film where nothing really seems to happen. I'd guess it could have ultimately come in at 91 minutes and not missed a beat. But these are pretty minor quibbles. It was a lot of fun, in the end.",
    "29": "\"I'm just kind of average, I think.\" While this effervescently delivered line encapsulates the essence of Eileen, her film is quite the opposite: It's above average in every way. The follow-up to director William Oldroyd's smash hit \"Lady Macbeth\" that proves that writer Ottessa Moshfegh's talents are just as striking on screen as on the page, this intense, deliberate, disorienting period piece chronicles the inner turmoil of its titular antiheroine with the élan of an astonishingly ferocious storyteller.24-year-old Eileen Dunlop (Thomasin McKenzie) is an enigma. She's timid, mousy, and without even the most basic of frills; however, she's also apprehensive, repressed, and harboring shocking fantasies. She has perpetuated a feedback loop of self-loathing and self-consciousness, and discerns little purpose in her life in a scroungy 1960s town besides her dead-end jobs as secretary of a juvenile prison for boys and carer for her alcoholic father Jim (Shea Whigham). But in the days prefacing Christmas, her world, not at all au fait with style or class, turns on its head when Dr. Rebecca Saint John (Anne Hathaway), steeped in haute couture and a glamorous je ne sais quoi that follows her wherever she goes, arrives for her new position at the prison. Eileen is instantly enchanted and resolves to win Rebecca's favor, materializing a latent Oedipal complex with a maternal Rebecca and an abusive Jim. Immediately and unceasingly, the film's acting and cast dynamics are flawless. McKenzie is a revelation as the lead, imbibing even the tiniest of tics and mannerisms into Eileen's portrayal, proffering audiences one of the most absorbing and stimulatingly layered characters in recent memory. And of course, the incomparable Anne Hathaway never disappoints, mimicking her real-life celebrity glamour while adding a peppermint-fresh bite that's so crisp it breaks your teeth.Of course, the third-act twist, faithful to the source material's ending, was the most polarizing aspect of the movie, a tonal and narrative volte-face that veers a \"Carol\"-esque psychodrama into thriller territory. But the ending of \"Eileen\" doesn't skip a beat, at no times feeling undeserved or out of left field, instead gliding into what may be the most macabre, haunting, repugnant monologue ever captured on screen, then immediately whisking us into a gleefully frantic crescendo that sees Eileen's character arc come full circle. However, some of Eileen's fantasies of leaving located in the book have been lost in translation, making the ending a little more ambiguous than it should've been.Ari Wegner's cinematography is impossible to ignore. From the camerawork itself (the aspect ratio and film grain deserve a chef's kiss) to the set pieces and period atmosphere, the film embodies that time of transition and degradation in a downtrodden New England to perfection. And in combination with a score that knows exactly what it's doing and wardrobe design that tells a story of its own, the movie's on- and off-camera decisions accumulate to a precise, calibrated end result. Forgiving the book's narrative details that would've made the finale much more satiating, it's hard not to get hooked on \"Eileen.\"",
    "30": "'Eileen' is a strange film. It raises a good many questions but answers very few. It is as though director William Ondroyd purposely made no attempt to bring resolution. Rather he's left it up to us - the viewers - to decide what was going on, and what, in the future, will happen to the film's characters.I give nothing away when I say that the film takes a turn about midway through. It is a turn the viewer could not possibly have seen coming. Many will feel betrayed by this turn as it, indeed, comes 'out of nowhere'. Others may be thrilled by the plot-turn; what seemed a rather run-of-the-mill tale of sexual awakening now and suddenly is dealing with an altogether different issue. Me? Count me among the thrilled.Eileen as played by Thomasin McKenzie works as a clerk in a local penitentiary. There she meets the institution's new psychologlist, Rebecca, played by Anne Hathaway. Sparks fly for Eileen, indeed we have love at first sight. And Rebecca seems more than willing to accommodate the young employee. And for Young Eileen a doorway to her future has opened, a way out of a life of serving her abusive alcoholic father (an always great Shea Wingham). But it is here, and now, that the film's sudden dramatic turn takes place.Eileen is based on a short story by Ottessa Mochfegh. And like many short stories the ending leaves a good deal unanswered. Which, if that is OK with you, will enhance your enjoyment. You will leave the theatre still engrossed with those characters and what the film might have been saying about them.But - and this is important - if a neatly tied-up finale makes for a story-of-choice, I'd keep my distance."
}