{
    "0": "Charming Christmas confection--about a boy raised by elves in the North Pole who grows up and journeys to N.Y.C. in search of his biological father--puts a clever spin on even the most familiar gags, successfully walking a fine line between absurdist comedy and holiday schmaltz. Will Ferrell looks like a string-bean in yellow tights and, with his mass of curly hair peeking out from underneath his elf's hat, he could easily be used as a walking punchline. Fortunately, director Jon Favreau's handling of \"Elf\" is incredibly nimble, treating Ferrell and his naive character Buddy with the utmost respect; you can laugh at all the silly pranks without ever feeling guilty. Favreau's work is smooth, and he's assembled an incredible supporting cast of character actors to back his star, though some may find the climactic moments (involving Edward Asner as Santa Claus) a bit too literal--and the movie is certainly funnier before we get to this point. Still, the special effects are kept to a minimum in order to let the people shine...and that's not only refreshing, it's heart-warming. *** from ****",
    "1": "Elf isn't a perfect Christmas movie, but it was sweet and charming with a great cast. The script can be a little too fluffy and unfocused sometimes though, while the pace occasionally lags and some jokes such as Buddy eating the sweets felt forced. However, it does look terrific, with the locations striking and the cinematography very nice. The soundtrack is a nice addition too, it made me nostalgic and all the more ready for Christmas. The story while simple and a tad predictable is at least original and well-meaning, while the direction is credible. The cast is what gives Elf its staying power and charm. Although I am not a fan of Will Ferrell, I think he really shone here as Buddy, while Zooey Deschannel is beautiful and a huge part of the film's charm, James Caan is a suitably gruff father-like figure and Bob Newhart is wonderful. All in all, it is a sweet film if you forgive the slightly cliché ending, by all means not for all but the cast do save the day. 7/10 Bethany Cox",
    "2": "At first glance, it's hard to imagine a less likely candidate for an unironic Christmas film than the director/star of the snappy, sardonic Swingers (and soon-to-be director of Iron Man, of all things). Yet, curiously enough, it's this particular background that makes Jon Favreau so well-suited (ha) for the job. Sharp enough not to tumble into the schmaltz too heavily but shrewd enough to recognize the value in playing it straight, Favreau's Elf hits the ideal balance between being fun for kids while clever and sweet enough to remain tolerable for adults without caving to becoming closeted-self-loathing. It's no wonder that such a comparatively recent film has already worked its way into vintage holiday movie canon. Favreau is evidently nostalgic for the good ol' days of Christmas flicks (check out the distinctly Rudolf-esq stop motion Arctic creatures and Seussian snowflakes, some of the film's most delightful additions), but is clever enough to have a good beat on what makes them tick. Like all the best elating seasonal fare, Elf delivers a story of a fish-out-of-water outcast struggling with abandonment and an inability to fit in, but finds inspiration in his unflinching cheeriness in the face of his adversity, and its infectious effect on the community. Between corporate office culture, rampant consumerism and the bedraggled staff responsible for hocking it, there's a fair share of Scrooginess proliferating the film, but, bouncing along like a pointy hat-sporting George Bailey, Buddy the Elf(/human? Elf-man? Humelf...?) remains such a radiantly positive character that it's impossible not to be won over by him, as the film's other characters echo.Though there are gleeful setpieces aplenty (the \"you're not Santa!\" toy store brawl is already iconic, but Buddy's proficiency in a snowball fight is just as wickedly fun), Elf works by never abandoning its core emotional story, weaving in touching beats throughout, as Buddy connects with his estranged \"naughty listed\" father and thug life brother, and clumsily wooes his jaded coworker (one of the film's few objectionable bits - while cute, it's a bit underdeveloped, not to mention eyebrow raise-worthy how quickly she acclimatizes to a romance with a man who, for all intents and purposes, has the mental facilities of a 12-year old...). Pacing-wise, the film ticks along at a satisfyingly jaunty rate, and it only helps that Favreau commits to the tone aesthetically, with popping, vibrant candy colours and soft-focus lighting that allows the film to almost literally sparkle. The climax, finding conflict in Santa's sleigh crashing in Central Park, beset by Nazgûl-like park rangers, would play as laughably shoehorned in if Favreau didn't deliver it with such a knowing wink, and, strained as it might feel, he pulls it off without distracting excessively. And aww shucks - who could begrudge to a finale that dives whole-hog into sentiment - a Christmas spirit-inducing sing-a-long, no less! - so confidently and unironically, that, unlike most such euphoric 'happy endings,' it actually works really well. Hell - if James Caan's humbug can sing along, you sure can too. It's impossible to imagine the film to work without the stupendous work of Will Ferrell powering it. Like Favreau, Ferrell has mastered a delivery that plays to multiple audiences at once, allow him to sound wholeheartedly sincere yet uproariously stupid in the same breath, yet uniquely lovable either way. In between the inevitable more kid-friendly slapstick (and thankfully only one burp joke), Ferrell is never crass about Buddy's childlike approach to life, mining it for the utmost of wide-eyed truth, and he's all the funnier and more adorably charming for it. The rest of the cast, thankfully, are game to echo Ferrell's spirit. James Caan is pitch-perfect as the curmudgeonly Scrooge too wrapped up in exploiting nuns and orphanages to pay attention to his giddy elf-son, while (a jarringly blonde) Zooey Deschanel showcases the luminescent, quirky charm that would shortly catapult her into stardom (she even sneaks in a couple of songs for good measure). Ed Astner's gruff warmth makes him the most definitive Santa Claus since Richard Attenborough, and the hangdog charm of Bob Newhart lends the film's narration a perfectly relaxed airiness. The ever-adorable Mary Steenbergen helps the film's emotional heart blossom as Caan's more amiable wife, while Daniel Tay avoids the curse of the obnoxious Christmas child star with an edgier and more sly precociousness. Favreau even sneaks in some parentally crowdpleasing cameos - hey there, Kyle Gass from Tenacious D and Andy Richter! - while Peter Dinklage just about walks off with the show with his sublimely preening rock star children's author. Confidently festive and heartwarming with just the right underbelly of snarky eye-rolling, Elf is a true delight, and one of the most worthwhile additions to the Christmas pantheon. Although it's not as ambitious or infused with an emotional home run as other holiday classics, it's inevitable that the Christmas cheer level on the Clausometer will receive a hefty boost upon viewing or revisiting Elf. I'm still not eating spaghetti with maple syrup, though. That's a step too far. -8.5/10",
    "3": "The perfect holiday movie for the cynical New Yorker (or anybody from any other metropolis) is so colorful and cheerful, yet not one that will give you a sugar overdose. It's the story of Buddy the elf, Will Ferrell, an actor I normally can't abide. He's an orphan who crawled into Santa's bag and was adopted by bachelor elf Bob Newhart and when he learns the truth of who he is heads to the Big Apple to locate his father, the cynical James Caan, and ends up finding a family.Stepmom Mary Steenburgen (along with Dianne Wiest and Sissy Spacek the perfect on-screen mom) immediately takes to him, half brother Daniel Tay finds a playmate and world weary Zooey Deschanel goes from wanting to kill him on their first meeting to completely entranced by his sweetness. Caan must find the kid in himself to from the Scrooge like publisher to a loving husband and father, and that will take a Christmas miracle.Having not seen this until now, I felt like a complete freeze miser for unintentionally missing it, although I did see the musical on Broadway in 2012. This film pays great tribute to our modern Christmas culture with references to the Franken-Bass TV specials of my childhood and even gets a very funny Keebler elf reference in as well. Who better to play Santa than Ed Asner? He's completely loveable with absolutely no Lou Grant gruffness.One of the funniest gags is the reemergence of the long defunct Gimbles department store where Buddy meets Deschanel and turns the Santa village upside down by redecorating it overnight. When he surprises her in the employee lounge (complete with shower) as she sings \"Baby It's Cold Outside\", it's a magical moment, one of many that starts with the sight of Santa's real village.Everybody is absolutely perfect here, not a false note in the film. So old fashioned in theme but very modern in spirit, this never falters in any way. The ensemble seems to have been magically delicious in loving the script because they are all filled with joy even when acting grumpy like veteran little actor Peter Dinklage, playing one of Caan's prestigious clients whom Ferrell accidentally insults. Putting my own big city cynicism away for the evening, this made me feel like Scrooge the morning after all of his nightmares when the spirit of Christmas returned to him. At times, this can even bring on a tear of joy.",
    "4": "After seeing \"Elf\" last night (special preview screening) I am happy to say that I, as well as my children left the theater feeling full of Christmas cheer. I do believe that this movie will become a Christmas classic. I can see this movie being viewed by millions each year on TV just like \"A Christmas Story\", and \"It's a Wonderful Life\". Was the movie perfect? No. Will it win an Oscar? Of course not. Did it make me laugh, and feel good while looking forward to another Christmas this year. Without a doubt.\n7 out of 10 Stars.",
    "5": "Confession time: Until just a couple of hours ago, I had never seen this now-classic Christmas comedy starring Will Ferrell in the title role. He's an actual human who as a baby was taken to the North Pole accidentally and was raised by elder elf Bob Newhart. After becoming the least prolific of workers at Santa's Workshop, he decides to go to New York to find his biological father who's played by James Caan. I'll stop there and just say this was quite funny and had also some touching scenes. Because this was a family film, there's no dirty language nor any adult situations. In summary, Elf is a wonderful comedy suitable for kids \"from 1 to 92\"!",
    "6": "I was lucky enough to see in the theater today which was so much fun! Will Ferrell is endlessly entertaining in just about anything. Zooey Deschanel is especially stunning in this role, she's a glow of true beauty. Elf is so much fun as should be to many others too! Numerous funny parts and several heartwarming bits makes for a lovely gem that I'll always appreciate.",
    "7": "Elf (2003)I sure wish they would have released this movie in December, it would have given it an even Christmas-ier spirit to it all. Elf was a hilarious movie about a guy named Buddy (Will Ferrel), who was raised by elves at the North Pole. He then discovers he isn't an elf, and travels to New York city to find his real father (James Caan). It turns out his that Buddy has a stepbrother and a stepmother (Mary Steenburghen). While there, he meets Jovie (Zooey Deschanel) at a store there, and falls in love. This movie is all about Christmas spirit and is wonderful and enjoyable. It's a great family movie. You should take you ands your family to it during the holiday season. This will be one of those Christmas movies that I will be able to watch over and over. I give Elf a 10/10.",
    "8": "This was one of my favorite movies in 2003. Will Ferrell is brilliant as the Elf. The supporting cast is great too, especially Bob Newhart as his elf \"dad\". The characters are well written and it is a refreshing film to get lost in. Will Ferrell plays the elf with such innocence, he is so funny! This is not just a Christmas film but when the DVD comes out I will be watching \"Elf\" in July. The story progresses nicely, there are many lessons to be learned as you watch this movie. It touched my heart in many ways. I highly recommend this movie for kids AND adults, you won't regret it. Treat yourself and watch this \"original\" movie. Hollywood needs to make more like this.",
    "9": "This is the greatest Christmas movie mlm of all time and it deserves at least an 8 out of 10.",
    "10": "It was so nice to be able to sit down and watch a movie featuring an SNL actor without having to mute or fast forward any crude parts. Granted, this may not be Will Farrell's most amazing performance, but if you want a new Christmas movie to watch this season, I highly recommend Elf. I talked to a few people who thought the movie was stupid, but that was because they were expecting Will Farrell's character to be a duplicate of his SNL performances. So, to fully enjoy this movie, watch it without any expectations and remember that it's okay to have a childlike sense of humor--nobody's too cool for a great Christmas movie. I love most all the movies from Adam Sandler, Rob Schneider, Will Farrell, Jim Carrey, Chris Farley, Chevy Chase, and David Spade, but most of them aren't appropriate for viewers of all ages. Elf is a movie you can throw in the VCR and not have to worry about what the kids hear or see on it. Thanks, Will, for putting out a hilarious movie that the whole family can watch!",
    "11": "One of the best Christmas films I have ever seen. The movie was very funny. Buddy's character was very funny and her relationship with people, especially his father, was the most funny thing in the movie.",
    "12": "I do love Christmas movies, always a sucker for them even if the style and story is not new or different. Elf does bring some new story to the typical Christmas movie but for the most part it's same old, same old which for someone who loves the Christmas movie is great!! Unfortunately I am not a fan of Will Ferrell, okay granted I thought Night At The Roxbury was pretty funny but everything else since then has been horrid. Nonetheless with Elf Ferrell finally finds something that suits his completely child like annoying behavior and his over acting actually suits the character.Elf is the story of an orphan who accidentally makes his way into Santa's magical bag on Christmas Eve as a baby. When Santa discovers him he puts him in the care of the elves, in particular Papa Elf. The elves raise him as one of their own despite his size difference and a few other more human traits he is raised to believe he is just another Elf. Buddy as he is known has now reached the age that Papa Elf believes he should know the truth, especially considering that Buddy has a real father, alive and well who didn't even know he existed. Buddy is excited about making his way to New York City to meet his real father. He travels from the safe land of The North Pole where he knows and understands everything into the brutal modern world of New York City. Buddy sticks out like a sore thumb, and not just because of his green elf costume he insists on wearing but his politeness, his fascination with the simple annoyances of life, and his insistence that he is truly an elf from the North Pole. He finally tracks down his real father, Walter, a big time children's book publicist who spends more time working than with his wife and other son. Buddy tries to explain that he is Walter's son but Walter has him removed from the building. After being kicked out Buddy meets a friend in Jovie, a rather down on her luck Gimble's worker who plays an Elf for the Christmas season. Although first rather nervous about Buddy she begins to warm up to his childlike innocence. Buddy continues to do all he can to get back to see his Dad and eventually with a blood test Walter discovers this rather imbalanced man is indeed his son. Walter's wife Emily insists that Buddy stay with him. Buddy does everything he can to spread Christmas cheer and turn everything more \"Christmas-y\" wherever he goes. Unfortunately his ignorance to the real world infuriates Walter and he just wants Buddy to go away but both his wife and other son have become very attached to Buddy. Buddy tries his hand at working with Walter, which causes disaster, and eventually Buddy finds himself all alone until Santa has a bit of a disaster himself and crashes the sleigh into Central Park. The sleigh won't fly because their is no Christmas spirit left. Fortunately Buddy has touched enough people's lives for Jovie and Emily and Michael to bring Christmas spirit back for everyone including Walter who finally realizes what is important. Buddy will save Christmas for everyone!! Buddy is a great Christmas character. His naivety and ignorance is funny but touching and cute. Ferrell actually does manage to pull that off thank goodness. Although I don't know if they make Buddy pure enough that it actually comes across that he is touching these people's lives. The real laughs are with the physical comedy in the film, mostly entirely done by Ferrell but it's very funny. James Caan is so out of place and yet so perfect for the role of Walter. He fits in but doesn't at all which is kind of strange. Bob Newhart as the narrator and Papa Elf is also a great little cameo. And the great Ed Asner as bit rough around the edges but very caring Santa is also great. Zooey Deschanel as Buddy's love interest Jovie is a good choice. Although at first she doesn't seem like the right pick they actually have decent chemistry and she plays her role with a lot of depth for the short time she gets. Director Jon Favreau does a good job of creating something I actually compared to the amazing classic Miracle on 34th Street. Much of this film reminded me of a more updated modern version of that film which is a great honor. While I don't think Elf has the staying power it's still a cute little Christmas film with a tolerable Will Ferrell and a good family film. Pick it up this Christmas or even if you just feel like being in the Christmas Spirit. 8.5/10",
    "13": "Elf (2003): Dir: Jon Favreau / Cast: Will Ferrell, James Caan, Zooey Deschanel, Mary Steenburgen, Bob Newhart: The story of little people doing big things, or in this case big people doing even bigger things. Will Ferrell stars as Buddy who crawled into Santa's sack upon his visit to the orphanage. He is raised at the North Pole where cheer and good will are the norm. When he learns that he is human he treks to New York to reunite with his human family. His father works in publishing and sees Buddy as a lunatic. He eventually lands a job in a toy store where a young lady with a winning singing voice catches his heart. Neat concept and funny situations and a conclusion where Buddy obtains the best of both worlds. Directed by Jon Favreau who previously made a very different film called Swingers. This time he aims for a different audience. He is backed by Ferrell with outrageous bursts of enthusiasm in an overgrown elf costume that is appropriately out of place. James Caan makes a great foil as his father. Zooey Deschanel is pleasant but as a female shop worker she is a predictable romantic prop. The biggest disappointment is Mary Steenburgen who is limited as Caan's wife. Bob Newhart narrates the film as Buddy's parental elf, which adds that fable like affect to its presentation. Hilarious Christmas comedy taking the elf theme to new heights. Score: 9 ½ / 10",
    "14": "I love Elf every time I see it. Love!!!! Buddy is full of love, innocence and hope. He expects the best in everyone and believes there is good in everyone.",
    "15": "I remember when I saw \"Elf\" in the theater. I thought it was pretty funny. I never would have guessed that 17 years later it would become a Christmas classic. There are a lot of laughs in this movie. There's also a lot of good music. The cast is very likeable, especially a dreamy Zooey Deschanel. They all do a nice job. \"Elf\" has so much goodwill going for it that it almost gets over its bumps in the road. For some reason, it's never a completely satisfying watch with me.",
    "16": "Elf has become a classic and always a favorite of mine to watch during the Chrsitmas/holiday season. For goodness sake, people! Don't make more of it than it is! It's fun, and there a much worse movies out there. The low rated reviews crack me up. I think all those reviewers need a hug!",
    "17": "The most helpful thing I can tell you about this movie is that if you've got even a smidgen of a youthful spirit about you, then this movie will make you laugh until you cry....over and over. There's one scene where Elf and a gruffy fellow warehouse worker(who was a total stranger just a few moments before) are sitting on a pallet after smoking some dope, and are laughing really hard about something really stupid, and the Elf leans over and begins tickling the guy under the arms and shouting \"Tickle, Tickle!\" as they both topple over in hysteric ecstasy....and I thought I was going to have a coronary, I laughed so long and hard (after running the DVD back to watch the same scene about 5 times over!!!!! This is absolutely my favorite all-time comedy! I'm very hard to please when it comes to comedies, seeing most of them as just stupid, but Elf is in a class by itself.",
    "18": "A sure thing in our household every Christmas. Charming, hilarious, cute and full of Christmas cheer. Will Ferrell is always an instant laugh for me and all he has to do is spit in a can and I am rolling on the floor peeing my pants. Bye Buddy, until next year.",
    "19": "I gotta say, while a lot of stuff is quite over the top and a little too silly in the film, a lot of stuff still makes it work as a feel-good comedy and as an adult, I appreciate it a lot more than I did when I was a kid. I like some other Christmas movies better but this one is definitely a good one for the humor alone! Will Ferrell does great as this main character and was a good casting choice. The film even sends a good message toward the end about what love is and how important it is to have enough Christmas spirit! This is the kind of movie fun that is meant for the whole family to enjoy!",
    "20": "I love this film so much and it is hilarious. Although, I do feel like buddy could come across as more stupid as he doesn't really know how to act civilised. The actors/actresses were very good and the pace of the movie was excellent. This is a movie we watch every year as a family and I expect to watch it for the next 10 years +.",
    "21": "ELF is not yet twenty years old as of this writing, yet it has already become an entrenched Christmas classic, playing constantly every year. I'm not terribly receptive to Will Ferrell's charms, but I find him very funny and sympathetic in this movie. James Caan, the script (which alternates between sentiment and goofy comedy without feeling tone deaf-- not a small accomplishment), and the wintry atmosphere also contribute significantly to the success of this unpretentious little film.",
    "22": "Timeless classic. Will Farrell crushes it as Buddy, the title character. Feel good family film.",
    "23": "Orphan Buddy (Will Ferrell) sneaks in Santa (Edward Asner)'s bag and ends up in the North Pole. Papa Elf (Bob Newhart) raises Buddy as an elf. His giantness causes all kinds of problems. Santa allows him to go to New York City to find his birth father Walter Hobbs (James Caan) who is actually on Santa's naughty list. He gets a job at a store and befriends fellow worker Jovie (Zooey Deschanel).Childlike Will Ferrell is giving off so much joy and innocence. He is so silly that it is impossible to not laugh at his slapstick humor. He fully commits and that's what makes it so hilarious. The only minor difficulty lies with James Caan. His personality is way too intense for a wacky comedy. But it picks up whenever he reunites with sweetheart Zooey Deschanel. And he has good fun with his brother Michael. Jon Favreau has created a wacky comedy with a heart.",
    "24": "I guess size matters ... well that is body size. But how can a strange movie like this even be so fun to watch? I think it is a combination. You get Jon Favreau as a director who has proven since then what he is capable of behind the camera (we knew he is a great actor) and this amazing assemble of wonderful people in front of the camera. It is silly and if Will Ferrell knows to do one thing, it is being silly and likeable.Mission accomplished ... but also James Caan, Zoey Deschanel and so many others. It really has a heart of gold, even if you may not see it at first or think it isn't there to begin with. Best watched at Christmas time or around that time and with a younger one. I did watch it with my nephew. Great fun all around.",
    "25": "Over the years this has become a classic, it never gets old! Funny and heartfelt, this Christmas movie is sure to put a smile on anyone's face. Love watching this movie every year with family!",
    "26": "This film is about a man (Farrel) who had just learned that he was born human! He never knew that he was human and he imagined that he was an elf the whole time! Now he needs to search for his biological father instead of his elf father. He finds him but his father won't believe it. They take a DNA test and you know what? He is his father! I must say this film entertained me a lot! It' actually really funny and I wasn't expecting from it that much. This film made me cry from its sweet moments. This is also a great film for the family looking for a great Christmas movie to watch. The adults won't get bored and the kids will have the time of their lives! The special effects are great to see. I highly recommend anyone who hasn't seen this movie to see it!",
    "27": "Buddy (Will Ferrell) is a human brought up in the world of Elves at Santa's grotto in the North Pole by Papa Elf (Bob Newhart). When he finally realises he doesn't seem to fit in, he asks Papa Elf and learns that his dad (James Caan) lives in New York and he's on Santa's naughty list. So off he goes on a quest to find him.Elf is charming and funny throughout and Buddy's naivety in the big apple is an over-used premise that works with charm. He also meets a department store Elf (Zooey Deschanel) bringing a little romance to the tale.OK its full of clichés and the basic plot has been done to death, but the film is still a winner that cannot fail to entertain on some level.7/10",
    "28": "This is one on my Must Watch at Christmas list. It just fun, and we still watch it every year. The movie is sappy, but that is the point, most Christmas movies are.Will Ferrel is great in this and is perfect. And I know I will get some flack for this, but I am glad it never got a sequel, it is one of those that shouldn't. Will did everyone a favor by turning down the role for the sequel.",
    "29": "Elf has the perfect blend of laugh-out-loud comedy and wholesome cheesiness that you would want from a family Christmas movie. It features a great cast and is probably the highlight of Will Ferrell's career. One of those films that you can and should watch exactly once a year.",
    "30": "This is an instant classic film. From beginning to end, ( and I mean beginning to end ) is fantastic. The directing, writing and acting. Everything about this film is hilarious, light hearted and fun for the entire family and will live on for generations to come. From the jokes in the narration to the final conclusions in the end, everything about Elf just works flawlessly. Elf is a very out of pocket film to be as good as it is, and really shouldn't be. But nevertheless, Elf is just a perfect film. Will Ferrell did his absolute best in this film and you can tell why. Overall this is a must watch film for everyone who likes anything funny.",
    "31": "Buddy is an orphaned baby who accidentally gets into Santa's sack and winds up in the North Pole. Santa and the elves decides to keep the human baby and raise him as an elf. When Buddy gets older, he finds out he's adopted and he learns who his parents really are. Buddy then sets out on an adventure to find his biological father in NYC. The enthusiastic elf-man doesn't fit into human culture very well and that leads to quite a humors time.The best way to describe this film is cute and sweet. I got quite a few laughs and smiles watching this crazy elf-man (Will Ferrell) trying to fit in and understand human culture.Worth watching this holiday classic.8/10.",
    "32": "And also, how does this movie have a 6.9 rating? Rotten Tomatoes has an 83 percent on this movie and I totally agree. This movie has been out since I was a baby, so ever since I was 2, and this movie always get so many laughs out of me and my family no matter how many times we watch it every Christmas. I just love Will Ferrell's childish humor in this movie and the things he does in this movie. If you love Christmas, Christmas films and/or Will Ferrell, check it out. It is such a good Christmas movie and doesn't deserve any negativity.",
    "33": "Wow. Will doesn't have to be crude, addicted to sports or streaking naked to entertain the masses.What a lovely and non-threatening holiday classic. Pretty darn funny in some spots, warm in others and the suspension of disbelief is fairly easy for the most part. (I mean, exceptHe's still human, right? Wouldn't he freeze in that outfit? I digress)I've only seen this once before – many years ago and remember liking it, but since I've heard so many people call it their favorite, I had to revisit this Christmas Eve 2015. Not sorry I did and will now continue to cherish it many more times. Kinda reminded me a ton of another one of my all-time favorite comedies, Liar Liar, this movie about an adopted kid/elf seeking out his stereotypical bad movie dad and showing true positivity in an otherwise cross New York City is perfect for the whole family. And every once in a while, it's nice to have something that's both great for kids, but also enjoyable to adultswithout being a Pixar animated movie. ***Final thoughts: You may have been right about the half star, Chris, but forgot about the four full ones before it. See? My heart's not always three sizes too small! (Oops, wrong movie)",
    "34": "Ingenious, very funny movie about a human adopted by Santa who travels to New York. This very sweet little movie is powered by Will Farrell as the goofy almost-elf; Zooey Deschanel gives a rare non-manic-pixie performance as a suspicious store worker. Perfect Christmas fare.",
    "35": "Hope someday this gets a 4K transfer. It's one of my family's favorite Xmas movies. Up there with Home Alone, Christmas Vacation coming soon on Warner Bros 4k ultra hd release November.",
    "36": "It's so touching and beautiful yet it makes you laugh every scene thank you will and the whole cast this will be in my heart forever.",
    "37": "A great excuse for Will Ferrell to run around in holiday garb, drawing sidelong glances from the sidewalk-strollers of Manhattan. Ferrell is the ultimate man-child, a six-and-a-half foot mess of arms and legs in green tights, buckled shoes and a pointy hat, matching the elvish wardrobe of 1964's Rudolph the Red-Nosed Reindeer. As physical comedy and ridiculous enthusiasm is his forte, Elf makes for an excellent vehicle, but it's also loaded with a swath of supporting talent (admittedly, another of the comedian's calling cards). Zooey Deschanel (somewhat unrecognizable in blonde hair) is a good fit as his skeptical, frayed love interest, but the best work comes from James Caan, Peter Dinklage, Amy Sedaris, Andy Richter, Kyle Gass and especially Bob Newhart as his sweet, yet long-suffering, adoptive father on the North Pole. Genuinely funny, warm, sugary and spirited; an unexpectedly effective successor to the Christmas classics it seemingly sets out to roast. Worth adding to the annual rotation.",
    "38": "You've got to be Elf'n kidding me. Not only is this an amazing Christmas movie but it's also just a well done movie. It has laughs, love, drama and Christmas spirit all in one without trying too hard. It's an immediate classic that can be watched every year and is automatically in the best 3-5 Christmas movies EVER. Will Ferrell is amazing and the movie is just so unique and stands alone. Definitely watch it as soon as you can and then again every year for Christmas for the rest of your life. IMDb needs to chill with this character minimum. It's way too long for the normal movie fan and reviewer.",
    "39": "When I first saw this movie, around its release date 17 years ago, it was a time when I was just about burned out by Will Farrell's lampoony style of over the top humor. It was the same with Adam Sandler, I just got tired of their brand of humor. So I didn't find Farell's performance funny at all, I found it annoying, and that spoiled my appreciation for even the plot. I was so burned out by Farrell that I had only watched 2 of his films since then: Talladega Nights and The House (both which I love). I've finally come around to giving this movie another shot since I always hear people ranking this as one of their favorite Christmas movies. It's a well scripted and heart warming, straight forward plot. It has a wonderful supporting cast, particularly James Caan; Ed Asner, Bob Newhart and Zoe Deschanel are delightful. But most importantly I think is I can appreciate what Will Farrell brings to the character: sweet and childlike, full of spirit and good will, and his humor filters through those characteristics. Elf is definitely a Christmas comedy classic that I rank up there with Jingle All the Way and just a step below Home Alone, A Christmas Story, and Christmas Vacation. Well, I have a lot of catching up to do with Will Farrell films that I passed over the last 2 decades. I'll start with Anchorman, I hear that's pretty good.",
    "40": "This movie was for a long time in my watchlist but I never got interested to watch this movie until today when I gave it a try. I enjoyed this movie to the fullest. Though, it was childish story which your grandma may tell you while sleeping it was entertaining to watch. You laugh at the scenes where comedy is happening and feel the scenes where love and drama is happening. This shows that the direction was great. The story and the screenplay was simple but good. The performances by the cast members was good especially Will Farell, he was just great.Overall, you should give this movie a try if you haven't yet.",
    "41": "Watched this 4 or 5 times last Christmas - had it on in the background while decorating. Such a feel good film, with laugh outloud moments! Will Ferrell was brilliant in this role - a must see.",
    "42": "There are a lot of iconic lines in 'Elf', and it deserves more than that. Every line from Buddy should be iconic because it is freaking uproarious. Master of situational comedy. The storyline is very simple indeed. A human accidently grows up with elves in winter wonderland and thinks himself as an elf. That's the only difference, but the comical situation from this one setting is more than plenty. Also, Will Ferrell's comic acting is precious.",
    "43": "I cannot possibly overstate how magical this movie managed to be/become. I watched it as an adult...and was completely charmed by it anyway. I introduced my kids to it a decade later...and they fell in love with it too. Creating a Christmas classic after the year 2000 is pretty unthinkable. But the script had heart, Favreau had vision, and Ferrell was at the peak of his powers. Even if it was a bit derivative, the familiar beats find new humor and heart. Every year we watch Elf while eating waffles (with candy on top, of course). It never gets old. I don't always re-watch the Rankin & Bass TV movies, but a December without Elf would be unthinkable.",
    "44": "Elf is hilarious! It's never ending enjoyment with terrific acting. All the scenes in this movie are amazing. Will Ferrell owns every scene and makes everyone around him light up. The music and Christmas decorations are great, and the story is different.\nOverall, it's a perfect Christmas movie.",
    "45": "I love everything about elf, the story, the comedy; the Christmas everything about this is entertaining to the point it becomes a Christmas tradition to watch it. Will Ferrell is without a doubt one of the funniest comedians I've had the pleasure of watching, in this he plays Buddy the elf, a baby who was found in Santa's sack when he got back to the North Pole, that alone makes the story interesting and even more so we get to see an elf go to New York, a human sized elf that is.Its a very funny movie that is sure to keep you entertained and in stitches, I really enjoyed it and i think everyone else will, truly remarkable!Highly recommend!",
    "46": "Elf is a beautifully shot film with a phenomenal cast and a great storyline. The perfect Christmas time movie. A+++ Film.",
    "47": "As a general rule, I don't like Will Ferrel movies, I find his over the top acting annoying and simply not funny. Elf was no exception.\nI watched Elf because it was hailed as the best Christmas movie of all times, I don't agree with that at all. It did have some cute elements that would have made an enjoyable film, but the annoying antics of Ferrel didn't work for me.\nBut clearly I am in the minority - so there is that.",
    "48": "I never gave \"Elf\" much consideration, and it's not \"A Christmas Story\" levels of classic, but there's a lot to be said for Will Ferrell in elf booties roaming wide-eyed the streets of New York City. I guess the movie hinges on that central arrested development innocence vs. modern-day yuletide cynicism, but that ain't a bad thing. Favreau squeezes every funny ounce out of putting Ferrell in small spaces and the guy really is an endearing spaz. I like the cast, Peter Dinklage is a great easter egg (for lack of a better phrase) and it's just the right dosage of holiday warmth. Sweet, but not stifling.7/10",
    "49": "This movie is slowly becoming my favorite holiday film. I mean, there's a lot of competition for that title. Miracle on 34th Street, it's a Wonderful Life, The Man Who Came to Dinner, Alistair Sims' Christmas Carol, Muppet Christmas Carol, The Santa Clause (#1), White Christmas... the list goes one. Elf is so well-crafted and excellently helmed by Jon Favreau in his first spin as Director, that I consider it to be totally flawless. I might just be obsessed with it. Get your family together and enjoy this one. Over and over and over and over.",
    "50": "No matter how many times I watch it I can still thoroughly enjoy it all the way to the end. If there was ever a Christmas movie to top all Christmas movies in the 21st century it is without a doubt Elf. Will Ferrel not only gives a spectacular performance (along with a great supporting cast) he carries the film without leaving a single shot wasted. With a perfectly fantastical score, beautifully nostalgic scenery and a very hilarious but original story this movie doesn't disappoint. What more can you ask for in a Christmas film? Whether you like it or not, this movie from start to finish is a classic and it's hard to say it's anything less.",
    "51": "How this movie is \"only\" rated 6.9 is a mystery to me. Everybody I know young and old, who has ever seen it fell in love with it. For me personally, Elf is up there with Miracle on 34th Street and It's A Wonderful Life- not just a great Christmas movie but one of the eat family movies you'll ever see. Will Ferrell is hot and cold when it comes to his film work. I've enjoyed maybe half of his movies, but the other half are unfunny duds. (Bewitched, Kicking and Screaming, and Semi-Pro come to mind.). Elf is probably his very best work ever- and also just happens to be his most innocent, childlike character. The supporting cast is wonderful, too. James Caan is a great, grumpy comic foil, and Bob Newhart is perfect, as always.",
    "52": "In a concession to my eleven year old granddaughter, I watched \"Elf\" yesterday with her. Quite honestly, I thought she was suggesting \"Alf\" to me, so when she pulled it up on Netflix I managed an inward groan to myself. The end result though, was that I came away pleasantly entertained by the naive innocence of the Elf character Buddy, disarmingly portrayed by Will Ferrell. I don't usually go for pictures starring former SNL comedians because they're usually mindless fluff, but this one had a way of holding your attention to see what silliness comes next. I got a kick out of the sight gags and Buddy's one-sided view of a world he had no knowledge of once he hit New York City on a mission to find his real father. The script writers apparently weren't too concerned about him finding his real mother, a thought that occurred to me throughout, especially with each time that photo of a young Walter Hobbs (James Caan) was shown with his one time girlfriend. But that quickly gets lost in the shuffle of Buddy's precarious encounters with the staff at Gimbel's and Santa's (Ed Asner) arrival fueled by the Christmas Spirit provided by all of Buddy's new found friends and family. I can't really claim that this will wind up a holiday staple with me, but for a one time experience, \"Elf\" will bring a smile. Because in the words of Buddy himself - \"I like to smile. Smiling's my favorite\"!",
    "53": "Delightful Christmas Movie. So nice (Delightful Christmas Movie. So nice )",
    "54": "Basically, director Jon Favreau's goofy but entertaining Christmas comedy \"Elf\" is a 'fish-out-of-water' saga, and David Berenbaum's screenplay relies heavily on incongruity. Visually, \"Elf\" is a delightful little movie with interesting characters. The North Pole set and the costumes that the elves wear are colorful.\"Elf\" concerns an infant up for adoption at an orphanage who crawls into Santa Claus' gift bag during Christmas and winds up at the North Pole. As it turns out, he is raised as one of the elves, specifically Papa Elf (Bob Newhart), who serves as the narrator. At six feet, three inches, Buddy (Will Ferrell) cannot do anything right as an elf. Ironically, Buddy has no idea that he isn't an elf. The revelation that he is not an elf staggers him. One day he is shown a picture of his mother and father. Tragically, Buddy's mother died without informing his father Walter Hobbs (James Caan of \"The Godfather\") that he had sired him. Buddy sets out from the North Pole and walks on foot to Manhattan where he finally comes face-to-face with Walter. Walter is married, has a teenage son, and works at a book publishing firm. Reluctantly, Walter takes Buddy into his house and disasters galore ensue. Briefly, Buddy holds a job at Gimbels' Department Store in the toy department. When he assaults a man masquerading as Santa Claus, Buddy lands in jail and Walter bails him out. Eventually, after exasperating Walter continually with his adolescent antics, Buddy leaves and is standing on a bridge surveying the river when Santa Claus (Ed Asner) streaks overhead in his sleight with his reindeer. Something goes wrong and Santa has to crash land. Naturally, Buddy heads to his rescue.Light, frivolous nonsense from start to finish, \"Elf\" qualifies as scintillating comedy with Ferrell having a field day as the tallest elf on record. This is Ferrell at his finest in an emerald jacket and golden tights. Mind you, the former \"Saturday Night Live\" comedian is an acquired taste. He behaves like an imbecile and he stoops to conqueror with lowest common denominator humor. James Caan is appropriately harried as his selfish father, and Oscar winning actress Mary Steenburgen plays Walter's wife Emily, while Zooey Deschanel is cast as Jovie, Buddy's love interest. \"Game of Thrones\" star Peter Dinklage appears in an amusing small part as a children's book writer.",
    "55": "Spoiler Will will be the next Bill Murry.  Not to many actors could pull this character off, and Willy did it!  Funny film, geared for the kids, but entertaining for adults too.  The Santa is coming part is very good, and the fight with the department store santa is the best.  I wonder if Willy can be this strange in real life too.  Maybe he could play a movie about me if they ever did a movie on me.  Well go out and watch it this for Christmas. 7/10 Mike",
    "56": "Finally after all these years saw the now Christmas classic \"Elf\", and I must say it was funny and enjoyable actually sentimental. As the story is well done and it gets one in the holiday mood for the meaning of Christmas. Buddy(in a funny turn from Will Ferrell) is an orphaned little baby who ends up in the North Pole to be raised by a lead elf(Bob Newhart) and he loves it up only when grown like an adult he needs a change so he decides to travel back to earth and find his real dad in New York City. And Buddy loves and lives it up only to find that real daddy is cold and tough(James Caan) he's not really a Christmas or holiday guy. Yet Buddy meets Jovie(the young and perhaps first film appearance from the sexy Zooey Deschanel) and she's a department store elf who has talent that being of a great singing voice. Thru it all Buddy learns life with a new family as magic and fate help bring out the spirit of Christmas. Overall fine and funny Christmas film memorable for Ferrell's funny turn as his adult elf is a kid at heart and the talent of the sexy Deschanel was well on display making this movie a must watch.",
    "57": "Elf will be one of those movies that is going to be an instant classic, next to great movies such as A Christmas Story, and Its a Wonderful life. This was a great movie. It had me laughing throughout most of the movie. So before or after you do your Christmas shopping go see this movie because you will love it.",
    "58": "A really nice movie to be honest. The way the main character act like child is just amazing,",
    "59": "This film is just amazing! It's funny, keeps you on the edge of your seat and has a big ol ' Christmassy heart. When I first saw this I had some doubts but nearing the ending I f the film I had realised that this movie was amazing (you could say my heart grew three times the size it used to be*)\n*a reference to how the grinch stole Christmas.",
    "60": "Elf is a really enjoyable comedy for the holidays. The story is nicely written. The heart would come to the right place when Buddy meets his real father for the first time. The setups are really creative for Christmas. Sometimes the movie would add some nice mix of animation that tributes the classic Christmas specials. The characters are very well developed and serve a purpose to Buddy's journey. And this would contain the most hilarious humor for a Christmas film. In fact, I can really tell the actors had fun with this movie. This would be worth a watch for those that are in a Christmas spirit and need a good laugh. This is probably one of the funniest Christmas movies out there. Merry Christmas.",
    "61": "One of the funniest Christmas movies is Elf that stars Will Ferrell, James Caan, Bob Newhart, Edward Asner, Mary Steenburgen, Zooey Deschanel, and Michael Lerner! Wil Ferrell is is just excellent in this film. He hilarious and charming and I really like his character. Caan is also very good in the film and so is Steenburgen. Lerner has a very good performance too. The acting by everyone else in the film is good. There are so many hilarious moments in this picture and when I saw Elf it I just could not believe it! Its that funny! I love Ferrell's walk in the park. The music by John Debeney is excellent! If you want to see Wil Ferrell as a hilarious character and want to see a very good Christmas film then I strongly recommend that you do what I did and buy Elf today!",
    "62": "Buddy that is adopted by the North Pole and raised as an elf and how that the late Ed Asner's Santa Claus delivering him as a baby to the unknowingly North Pole with rest of toys from the orphanage.But is taken in by the kind-hearted Papa Elf there played by Bob Newhart and tells Buddy the truth. He finds out that in searching for his father is nothing but a business executive who is or has little to no time with family and is in the wanting to have a big deal with a company about children's books.But he later bonds with James Caan's Walter's family in particular the son there. As that when Buddy messes up a deal and is thrown out there while also in the mall as his acting like childlike there alienates Zooey Deschanal's worker but he grows on her.He must find ways to save his biological family that of Christmas there.",
    "63": "I thought this movie was really good. It's funny, it's light, it's carefree and simple. It's a movie the whole family can enjoy.This movie is about Buddy. He was a baby in an orphanage and on Christmas Eve, when Santa came, he sneaked his way into Santa's sack of toys and ended going to the North Pole with him. An elf adopted him and cared for him as if he were his own. When Buddy grew up, he never knew why he was so big compared the other children. One day, when he was an adult, they told him that he isn't an elf. Buddy was surprisingly okay with it, and set off to New York City to find his birth Dad. Once he does, he tries so hard to get his Dad to like him, but nothing worked. Eventually, Buddy had to stay with his Dad and his Dad's wife and kids. Buddy met a beautiful girl who worked in a department store. Buddy set up all Christmas decorations, as an elf would do. Eventually, his Dad believes him when he says for the umpteenth time that he's an elf. And everything works out.Recommended for: Families and children.Do they say the title of the movie, in the movie: Yes.Overall, I give this movie an 8 out of 10, which in my ratings book is: Awesome.",
    "64": "Buddy was a baby in an orphanage who stowed away in Santa's sack and ended up at the North Pole. Later, as an adult human who happened to be raised by elves, Santa allows him to go to New York City to find his birth father, Walter Hobbs. Hobbs, on Santa's naughty list for being heartless, had no idea that Buddy was even born. Buddy, meanwhile, experiences the delights of New York City as only an elf can. When Walter's relationship with Buddy interferes with his job, he is forced to reevaluate his priorities......Elf isn't as clever as it thinks it is, but it shouldn't be this good either.Ferrall has never been better as the titular character, and it's due to his child like prowess and body language. It's a shame he's never really hit this high in a long time, as he is really likable in this, and makes this movie a little more magical.The rest of the cast are fine, but this is Ferralls movie all over the shop, and there is hardly a scene where he's not in it.It gets a little soppy at the end, but it's a Christmas movie, so all is forgiven.Funny and touching, if a little too blunt with its message.",
    "65": "So, I've just came back after seeing a re-release of this tonight in my local after not seeing this film in years on DVD & have to say it's still a good film!The film follows Buddy Elf who discovers that he was adopted & goes off to NYC to find his estranged father, but things aren't all what Buddy expects & finds himself in all sorts of funny situations as he bumbles round NYC!I found the film to be pretty good! It's a funny 1 hour & 31 minute film with plenty of laughs, jokes, ups, downs & romance! It's a classic film to say the least & definitely re-watchable all the same! It's a shame they don't make comedies like this anymore & I'm more talking about things are now...!The story, characters & effects are pretty good & the pacing is decent given the runtime, there's a bit of eye candy with Zooey's character, the board room scene is still funny after all these years with Miles!Overall, it's a funny comedy film of the 2000's & definitely a Christmas film all the family & friends of all ages will love!7/10.",
    "66": "I actually was not all that remiss to seeing this, Jon Favreau is one of my favorite filmmakers working in Hollywood today. Zathura is Where the Wild Things Are without the cerebralness or Karen O, I am of the camp that considers Iron Man and its sequel to be both living up to and counterbalancing Nolan's machismo brooding tale of The Dark Knight, Cowboys vs. Aliens promises to be geeky fanboy action in CGI awesomeness about in a blender with some actual plot and characters.I find Will Ferrell insufferable when he yells.Will Ferrell is like Jim Carrey. People like him mugging, mocking, yelling, contorting his face, and generally just being a big child, when homeboy could actually continue to keep making awesome stuff like Stranger than Fiction (or in Carrey's case, Eternal Sunshine of the Spotless Mind). For whatever reason, actually having a character is animus to an audience that just wants a clown banging his head against a wall. I'm sorry, Will Ferrell. You deserve better than that.So anyway, this movie is a modern classic for the Yuletide Time and for what it's worth, I can definitely see why. Buddy's absolute belief in Christmas cheer and his grinning dedication to spreading it is infectious, in its own way. It helps that the cynicism of the other characters actually works out sensibly. The movie still has to have its regrettable prolonged burp jokes, but it's nice to see things like random-taxi-hits-lead turn into actual character development as Buddy progressively gets a handle of this strange New York reality world he's found himself in and starts to adapt to its landscape... but all without losing his spiritedness. I can get behind that.Could be better. It did feel like just a few scenes were missing in the love subplot between Buddy and Jovie (Zooey Deschanel).What won me over in this movie was the North Pole land and the CGI references to old stop-motion animation Christmas movies of the past. Leon the Snowman is where it's at. Also, not only is Peter Dinklage an underrated actor, but his work in this movie shows he could do some really remarkable stuff if we'd all get over the \"But it's funny 'cause he's a little person\" aspect of it. Compare his role here (oh so woefully, woefully short, oh so scene-stealing) to his work in The Station Agent and then his work in Death at a Funeral (the, uh, British one, not the redundant and confusingly way too soon after remade one) and this man has a gift.So what the hey, seal of approval for this one. Going back to Favreau, I can't emphasize enough he knows how to keep a movie moving and never outstays his welcome, Elf moves at a brisk pace and is over before you know it, whether you like it or not. Now that audiences are actually getting comfortable watching giant robot movies for two and a half hours or more, the art of moving along, one of Hollywood's major entertainment assets, sometimes feels like it's getting lost.--PolarisDiB",
    "67": "I saw it last night at a Christmas party and found it enjoyable. But despite its Christmas theme, it was really intended to entertain adults rather than children.There was no profanity, graphic violence, and sexuality was limited to seeing the head and shoulders of a woman in the shower. But much of the humor would fly against most children's' heads. The basic story is about a human baby in an orphanage who crawled into Santa Claus's toy sack and ends up at the North Pole, being raised by an elf there. Buddy, as he is named, does not fit in as he is a giant compared to the elves, and Santa allows him to go to New York City to meet his biological father-who happens to be on Santa's naughty list for being too devoted to his career to pay attention to his family. Buddy meets his father, who disbelieves him at first, and he goes to the Gimbel's department store where he is mistaken as an employee and is put to work. Buddy inadvertently causes trouble there, and when he reunites with his father who finally discovers that Buddy was the son he never knew existed, he inadvertently brings trouble to his new family too.The movie is based on the \"fish out of water\" trope, and Buddy is naive but not necessarily stupid. The ending is happy if predictable, and it works as adult Christmas entertainment. The actors work well in their respective parts too and Ed Asner makes a surprisingly effective Santa. Recommended, but really for the grown-ups.",
    "68": "A movie for all seasons and happy reasons.You couldn't get to watch a more simpler film helmed with profound emotions which compel you to shed a bucket full of happy tears.",
    "69": "Why is British Christmas TV so damned depressing?There is an annual Yuletide Cull in all our favourite soaps,characters we have let into our homes for months or years get raped,pillaged,bludgeoned or stabbed or emotionally destroyed with indecent haste over a four day period,leaving us rubbing our eyes with disbelief.Of all the Christmas Specials only \"The Royle Family\" was even vaguely uplifting.As Jim Royle would say,\"Happy Christmas - my ar*e!\"So in desperation I scoured \"Radio Times\"(other listings magazines are available)for a movie to get me out of the slough of despond.\"Santa Claus - the movie\" lasted 10 minutes,a multitude of \"Chrismas Carol\" clones had me reaching for the Amontillado.\"A matter of life and death\"?A fine movie but hardly likely to warm the cockles of my heart........\"Elf\"?Never heard of it.With nothing to lose except my taste for mince pies I turned to Filmfour as I have so often done more in hope than anger before.Bingo!! \"Elf\" is 100% a Christmas movie.It has elves in it(honest!),reindeer,some cute North Pole creatures including a wonderfully surreal narwhal that pops its head out of the water to say farewell to Buddy(Mr W.Ferrell) as he leaves on his Odyssey to the Big Apple. Chief amongst the elves is the wonderfully laconic Mr B.Newhart - remembered with affection by my generation for his brilliantly inventive one - sided telephone conversations.His is the voice - over that helps the story move along. What I loved most about \"Elf\" was its unremitting optimism,its belief in the inherent decency of mankind despite all the evidence to the contrary not only in 2003 but even more so today. It has all the wonder and innocence of childhood and the deeply - held conviction that we lose rather than gain wisdom as we grow older. Mr J.Caan,splendid as Buddy's natural father, is a deeply suspicious man totally unable to accept his newly - acquired son at face value.Miss M.Steenburgen - perhaps more in touch with her inner child - has an immediate empathy with him.Here is an actress who has grown more beautiful and honest as she has got older. With all the best bits from many earlier Christmas movies lovingly embedded,\"Elf\" is a pure pleasure for adult or child. Together with its diametric opposite,\"Scrooged\",it will certainly play at my house for many Christmasses to come,and as far as I'm concerned the BBC can go and jump for their licence fee next year.",
    "70": "'Elf' is my third favourite Christmas movie. Consistent innocent laughs throughout. Will Ferrell delivers a wonderful performance as a misfit elf in a brand new big world. It's impossible not to fall in love with Buddy the Elf.Sometimes we need a reminder to be a lot nicer to one another. As naive as Buddy is, all he tries to do is be nice to everyone he meets, and spread Christmas cheer. This film is a great yearly reminder of that.",
    "71": "This was a funny holiday film with great performances all around. Will Ferrell gives one of the best performances of his career (and one of the funniest) as a human raised by Santa and his elves. When he was a baby, he crawled into Santa's sack, which explains how he got there. Now that he's an adult and six feet tall, he realizes he's no elf. He gets Santa's permission to go to New York and find his father, who is on Santa's naughty list. Once he arrives in New York City, however, he has a tougher time adjusting to the \"human\" world than he ever imagined. He tracks down his father (well played by James Caan) and convinces him of who he is. Initially a jerk, having Buddy (Ferrell) in his life makes Cann make some changes in his life and priorities. He is originally totally immersed in his job. I think this was a wonderful family film for the holidays and really recommend it.*** out of ****",
    "72": "It has Jon Favreau all over it. And that other guy, the one in every scene. And thank god for that because that Will Ferrell is so funny he can BE in every scene and you still want more. This movie is sweet. It's funny as hell without hurting anyone. It's gentle humor so perfect for an xmas tale. In this one a human man who has been raised as one of Santa's elves is told the truth by his tiny elven \"father\". This makes the chance for hilarious sight gags of Will Ferrell being too big for his life. When he finds out his actual father is a human in NYC (and on the naughty list) he sets off to find him. Will Ferrell's elf is a character so full of love that he can push his way in and be happily received, even if not right away.",
    "73": "Fantastic Xmas film. Silly fun, good story, Will Ferrell is excellent as elf. Some really funny moments there should be Elf 2.",
    "74": "Will Ferrell, James Caan, Zooey Deschanel, Mary Steenburgen, Edward Asner and Bob Newhart star in this 2003 comedy. This tells of human elf, Buddy (Ferrell) who is an orphan raised at the North Pole. Newhart plays papa elf who tells him about his real father, Walter (Caan) who lives in New York. Buddy embarks there and gets into mischief while trying to get to know him. Walter not only has a hard time accepting him as his son, but he's been consumed with work and hasn't spent much time with his family. Walter eventually bonds with Buddy and gets his priorities straight. Buddy also finds love with woman, Jovie (Deschanel) who works as a mall elf. Steenburgen plays Walter's wife, Emily and Asner (Lou Grant) plays Santa Claus. Ferrell is great in this as usual and I recommend this good holiday comedy.",
    "75": "Anyone who knows me, knows I love NY more than life itself.  This movie is set in NY, it's about an Elf in NY and It showcases Central Park to the extreme.  I am a big tough guy but I still had tears in my eyes towards the end.  This is a great Christmas movie.  Thank you Will Ferrell, for this great Christmas gift for all of us that like, no love this kind of Schtick.",
    "76": "After 20 years of thinking it would probably be a silly waste of time and listening to the naysayers (like my husband) that it was stupid. So, if you are like me and haven't watched this, then put on your childlike wonder, forget that you are a grown-up and enjoy this very enjoyable and funny movie. Chill out and laugh out loud. Bob Newhart is hilarious as papa Elf and Ed Asner plays a marvelous Santa.Now I understand why Zooey Deschanel now has black hair, because in this movie she has blond hair and it does not suit her well.Give this movie a chance, don't wait 20 years to watch it like I did!",
    "77": "'Buddy the Elf, what's your favorite color?'So a baby 'Buddy' climbs into Santa's sack and is whisked away to the North Pole by accident. Upon this discovery Santa decides to allow 'Papa Elf' to raise and look after him. Not too sure why they just didn't take him back to the orphanage where he crawled into the sack, seeing as they know he came from there. I guess him being an orphan it didn't matter?.From here on Buddy grows up at the North Pole as a worker in Santa's workshop. He soon discovers by mistake that he is in fact human and not an elf (elfling?), so off he goes to New York to find his dad. Turns out Papa Elf knew all about his mum and dad and what happened to them...somehow, handy huh. Is that elf magic or Christmas magic that enabled Papa Elf to know everything? or am I missing something here.So lets switch off the cynical part of my brain for a moment. The start of this film is a typical Xmas setting and scenario yes...but its so damn charming cozy and delightful you can't not love it. I mean sure you can't really go wrong with Santa's workshop at the North Pole really, but the added gem of seeing the odd bit of classic stop motion animation on one or two cheerful little characters really added another dimension to the whole sequence. It all looked like a whimsical children's story book, a snowy happy world with cutesy fantasy characters plodding around. Arctic Puffin and snowberries? adorable!!.Once we reach New York and the real world the tone shifts to that classic American Xmas movie magic type scenario which we all know and love from various other movies. And what better setting for a cold wintry Xmas tale than New York. Yeah you know straight away all the famous landmarks and stores you'll be seeing, we know how this goes...but does it get old? no, never. New York is probably one of the most atmospheric places in the world at Xmas.'I passed through the seven levels of the Candy Cane forest, through the sea of swirly twirly gum drops, and then I walked through the Lincoln Tunnel'This is basically a pure unadulterated Ferrell show, the whole thing is all about him as the innocent sweet childlike elf completely out of place in a dark sinister world. You have the obligatory love/hate issues with his real father played grumpily by Caan to great effect (you can feel the sense of shame and disdain he gives off for Buddy), all this of course plays out exactly how you think it will right from the start. Then you have all the visual tomfoolery that Buddy serves up as he comes to terms with reality and not the candy cotton world he's used to.At no point did I actually get tired or bored of Ferrell and his cherub- like virginal antics. It is utterly predictable hokey Xmas pantomime guff of course but its just so enchanting and visually pleasing you can't look away. Everywhere he goes he elaborately decorates with Christmas cheer, baubles and shiny trinkets, he's like the Xmas monster. Some of the scenes where he learns about 'human' ways and everyday things/objects are highly amusing despite being so simple and kinda cheesy. The board meeting where Buddy comes across the rather small elf-like Mr Finch (who is actually a little person) is hilarious. The way Buddy talks to the guy as if he were a very young child is easily a laugh out loud moment (must have been a South pole elf). I must also mention the brilliantly done forced perspective we see here and there. It looks like CGI but apparently its not, very clever and nice usage of an old trick.This is probably one of Ferrell's best films and best performances...strange as it may seem. The whole idea is completely not original and is stuffed to the gills with every Xmas cliché you can think of. The only reason this film works is because of the infantile character that is Buddy the elf...errr human. The ending is totally sappy and cringeworthy but it still doesn't stop this Christmas juggernaut of yuletide spirit. 'Oh, I forgot to give you a hug!'8/10",
    "78": "A Christmas film is a Christmas film is a Christmas film,and only once every so often does one come along that becomes a must see every Christmas season.Elf is just such a film.Going in and knowing the type of humor that Will Ferrell represented,I went into my first viewing expecting to hate it.I am happy to report that I was pleasantly surprised to the contrary.I love it and it is an every Christmas must see at my house.The humor is clean and funny,the story has a very retro feel with hints of the Christmas movies and TV specials of our childhood.Ferrell was great as the central character and he was supported well.Bob Newhart was a nice touch as Papa Elf.I could go on and on.A fun film.",
    "79": "I don't usually watch a lot of Ferrell movies because I feel like he goes a bit too far with his comedy, but this movie was so funny that it had me rolling throughout. The comedy was great, it had a heartfelt story, and it's a great flick for kids and adults alike.",
    "80": "I don't think this movie is bad, in fact whenever I have nothing better to do BUT watch this film I enjoy my time with it. But I don't get the praise or why it has garnered \"Christmas Classic,\" status. I'm sure I am missing something, but my complaints have already been vaguely explained up above.",
    "81": "'Elf' is my third favourite Christmas movie. Consistent innocent laughs throughout. Will Ferrell delivers a wonderful performance as a misfit elf in a brand new big world. It's impossible not to fall in love with Buddy the Elf.Sometimes we need a reminder to be a lot nicer to one another. As naive as Buddy is, all he tries to do is be nice to everyone he meets, and spread Christmas cheer. This film is a great yearly reminder of that.",
    "82": "This was a funny holiday film with great performances all around. Will Ferrell gives one of the best performances of his career (and one of the funniest) as a human raised by Santa and his elves. When he was a baby, he crawled into Santa's sack, which explains how he got there. Now that he's an adult and six feet tall, he realizes he's no elf. He gets Santa's permission to go to New York and find his father, who is on Santa's naughty list. Once he arrives in New York City, however, he has a tougher time adjusting to the \"human\" world than he ever imagined. He tracks down his father (well played by James Caan) and convinces him of who he is. Initially a jerk, having Buddy (Ferrell) in his life makes Cann make some changes in his life and priorities. He is originally totally immersed in his job. I think this was a wonderful family film for the holidays and really recommend it.*** out of ****",
    "83": "It has Jon Favreau all over it. And that other guy, the one in every scene. And thank god for that because that Will Ferrell is so funny he can BE in every scene and you still want more. This movie is sweet. It's funny as hell without hurting anyone. It's gentle humor so perfect for an xmas tale. In this one a human man who has been raised as one of Santa's elves is told the truth by his tiny elven \"father\". This makes the chance for hilarious sight gags of Will Ferrell being too big for his life. When he finds out his actual father is a human in NYC (and on the naughty list) he sets off to find him. Will Ferrell's elf is a character so full of love that he can push his way in and be happily received, even if not right away.",
    "84": "Fantastic Xmas film. Silly fun, good story, Will Ferrell is excellent as elf. Some really funny moments there should be Elf 2.",
    "85": "Will Ferrell, James Caan, Zooey Deschanel, Mary Steenburgen, Edward Asner and Bob Newhart star in this 2003 comedy. This tells of human elf, Buddy (Ferrell) who is an orphan raised at the North Pole. Newhart plays papa elf who tells him about his real father, Walter (Caan) who lives in New York. Buddy embarks there and gets into mischief while trying to get to know him. Walter not only has a hard time accepting him as his son, but he's been consumed with work and hasn't spent much time with his family. Walter eventually bonds with Buddy and gets his priorities straight. Buddy also finds love with woman, Jovie (Deschanel) who works as a mall elf. Steenburgen plays Walter's wife, Emily and Asner (Lou Grant) plays Santa Claus. Ferrell is great in this as usual and I recommend this good holiday comedy.",
    "86": "Anyone who knows me, knows I love NY more than life itself.  This movie is set in NY, it's about an Elf in NY and It showcases Central Park to the extreme.  I am a big tough guy but I still had tears in my eyes towards the end.  This is a great Christmas movie.  Thank you Will Ferrell, for this great Christmas gift for all of us that like, no love this kind of Schtick.",
    "87": "After 20 years of thinking it would probably be a silly waste of time and listening to the naysayers (like my husband) that it was stupid. So, if you are like me and haven't watched this, then put on your childlike wonder, forget that you are a grown-up and enjoy this very enjoyable and funny movie. Chill out and laugh out loud. Bob Newhart is hilarious as papa Elf and Ed Asner plays a marvelous Santa.Now I understand why Zooey Deschanel now has black hair, because in this movie she has blond hair and it does not suit her well.Give this movie a chance, don't wait 20 years to watch it like I did!",
    "88": "'Buddy the Elf, what's your favorite color?'So a baby 'Buddy' climbs into Santa's sack and is whisked away to the North Pole by accident. Upon this discovery Santa decides to allow 'Papa Elf' to raise and look after him. Not too sure why they just didn't take him back to the orphanage where he crawled into the sack, seeing as they know he came from there. I guess him being an orphan it didn't matter?.From here on Buddy grows up at the North Pole as a worker in Santa's workshop. He soon discovers by mistake that he is in fact human and not an elf (elfling?), so off he goes to New York to find his dad. Turns out Papa Elf knew all about his mum and dad and what happened to them...somehow, handy huh. Is that elf magic or Christmas magic that enabled Papa Elf to know everything? or am I missing something here.So lets switch off the cynical part of my brain for a moment. The start of this film is a typical Xmas setting and scenario yes...but its so damn charming cozy and delightful you can't not love it. I mean sure you can't really go wrong with Santa's workshop at the North Pole really, but the added gem of seeing the odd bit of classic stop motion animation on one or two cheerful little characters really added another dimension to the whole sequence. It all looked like a whimsical children's story book, a snowy happy world with cutesy fantasy characters plodding around. Arctic Puffin and snowberries? adorable!!.Once we reach New York and the real world the tone shifts to that classic American Xmas movie magic type scenario which we all know and love from various other movies. And what better setting for a cold wintry Xmas tale than New York. Yeah you know straight away all the famous landmarks and stores you'll be seeing, we know how this goes...but does it get old? no, never. New York is probably one of the most atmospheric places in the world at Xmas.'I passed through the seven levels of the Candy Cane forest, through the sea of swirly twirly gum drops, and then I walked through the Lincoln Tunnel'This is basically a pure unadulterated Ferrell show, the whole thing is all about him as the innocent sweet childlike elf completely out of place in a dark sinister world. You have the obligatory love/hate issues with his real father played grumpily by Caan to great effect (you can feel the sense of shame and disdain he gives off for Buddy), all this of course plays out exactly how you think it will right from the start. Then you have all the visual tomfoolery that Buddy serves up as he comes to terms with reality and not the candy cotton world he's used to.At no point did I actually get tired or bored of Ferrell and his cherub- like virginal antics. It is utterly predictable hokey Xmas pantomime guff of course but its just so enchanting and visually pleasing you can't look away. Everywhere he goes he elaborately decorates with Christmas cheer, baubles and shiny trinkets, he's like the Xmas monster. Some of the scenes where he learns about 'human' ways and everyday things/objects are highly amusing despite being so simple and kinda cheesy. The board meeting where Buddy comes across the rather small elf-like Mr Finch (who is actually a little person) is hilarious. The way Buddy talks to the guy as if he were a very young child is easily a laugh out loud moment (must have been a South pole elf). I must also mention the brilliantly done forced perspective we see here and there. It looks like CGI but apparently its not, very clever and nice usage of an old trick.This is probably one of Ferrell's best films and best performances...strange as it may seem. The whole idea is completely not original and is stuffed to the gills with every Xmas cliché you can think of. The only reason this film works is because of the infantile character that is Buddy the elf...errr human. The ending is totally sappy and cringeworthy but it still doesn't stop this Christmas juggernaut of yuletide spirit. 'Oh, I forgot to give you a hug!'8/10",
    "89": "A Christmas film is a Christmas film is a Christmas film,and only once every so often does one come along that becomes a must see every Christmas season.Elf is just such a film.Going in and knowing the type of humor that Will Ferrell represented,I went into my first viewing expecting to hate it.I am happy to report that I was pleasantly surprised to the contrary.I love it and it is an every Christmas must see at my house.The humor is clean and funny,the story has a very retro feel with hints of the Christmas movies and TV specials of our childhood.Ferrell was great as the central character and he was supported well.Bob Newhart was a nice touch as Papa Elf.I could go on and on.A fun film.",
    "90": "I don't usually watch a lot of Ferrell movies because I feel like he goes a bit too far with his comedy, but this movie was so funny that it had me rolling throughout. The comedy was great, it had a heartfelt story, and it's a great flick for kids and adults alike.",
    "91": "I don't think this movie is bad, in fact whenever I have nothing better to do BUT watch this film I enjoy my time with it. But I don't get the praise or why it has garnered \"Christmas Classic,\" status. I'm sure I am missing something, but my complaints have already been vaguely explained up above.",
    "92": "This was my 4th viewing and now ready to review.The story is insane. This film should not have worked. But almost as a tribute to the X-Mas miracles it tries to riff off, it is an astonishingly entertaining film.Behind the camera Favreau, Mr Money Shot, who has quietly without fanfare turned into one of the hottest directors in Hollywood history. In front of the camera Farell who I usually don't care for but may just give the performance of his career here. A script to die for. Probably the best use of Zoey D's looks in her career to date.Way under rated and unappreciated.As in my other reviews, most \"recent\" X-Mas films (since about 2000) are Canadian B-movies shot on a budget which would barely cover a reno on THIS OLD HOUSE What an unexpected treat See it",
    "93": "Accidentally finding his way into Santa's bad once Christmas Eve, little baby orphan Buddy ends up in the north pole, where he is raised by the elves as one of their own.  As he gets ever bigger and less and less suited to the elf lifestyle he is told about his real father and decides to go to New York to find him.  However Buddy's natural smile and elfish enthusiasm doesn't really fit in with New York, not to mention a father who rejects him.When I first saw the trailer for this film I laughed slightly but I also thought that it could easily be just awful.  Despite this fear I decided to go and see it on the basis of seeing Ferrell in the Reloaded MTV spoof on the DVD and being very funny.  I was glad that I did as the film was refreshingly funny very enjoyable despite the weaknesses inherent in a seasonable film of this nature.  The jokes are a mix of adult and children - but not separately, the humour is of a nature families can all enjoy rather than being of a `one for me and one for the kids' type.The film does get a little sweet towards the end, but it manages to avoid this usual trap for the majority of the film and can't be expected to not be all Christmas cheer at some point!  The fish out of water stuff is pretty funny and Farrell makes his character funny without being annoying to the audience (as he feared he might be from the trailer).  Caan is good but has to work with the `scrooge' character of the film and thus gets fewer laughs. The support cast is good with fun turns from Newhart, Asner and Steenburger.It does get a little sickly sweet towards the end and the fish out of water jokes do wear a little thin towards the end but mostly it is very funny and refreshingly fun to watch.  The film is made better by a performance from Farrell that is perfectly pitched without being annoying and full of spark and wit.",
    "94": "ELF (2003) *** 1/2 Will Ferrell, James Caan, Mary Steenburgen, Edward Asner, Bob Newhart, Zooey Daschanel, Daniel Tay, Amy Sedaris, Faizon Love, Andy Richter, Kyle Gass, Michael Lerner, Artie Lange, Peter Billingsley, Peter Dinklage, Claire Lautier, Jon Favreau. Ferrell gives an inspired lunacy turn as a man who was raised by elves at The North Pole and discovers to his dismay he's actually human sparking his quest to be re-united with his long-lost father (Caan in an inspired bit of casting), a 'naughty-list' occupant, who works as a children's book publisher in New York City, just in time for Christmas. Hysterically funny thanks to the goofy yet sweet and wonderful turn by Ferrell (no one else could pull off the razor's edge of looking like an idiot yet retaining the innocent glee of a child and bares a striking resemblance to Tom Hanks' turn in 'BIG') with a great cast especially the beguilingly pretty Daschanel as his fellow Santa's Little Helper at Gimbels'who he falls in love with. Directed with style and witty warmth by Favreau (who has a cameo) and written by newcomer David Berenbaum with a smart, fun script that caters to all ages with a nostalgic nod to classic animated holiday specials for good measure. An instant holiday classic. Trivia note: Billingsley, best known as Ralphie from the yuletide cinematic classic, plays 'A CHRISTMAS STORY' the elf foreman!",
    "95": "BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM HONEST ABOUT THEM. I saw \"Elf\" when it was first released theatrically in 2003. I did not see it again until 2016. I forgot everything about this film. What I can't believe was that I forgot how wonderful this film was. It does everything you want in a \"Christmas\" movie. This film is full of \"Christmas Spirit\" that most films never seem to capture. In this film On Christmas Eve in 1973, an orphaned infant boy stows away on Santa Claus' sack. When discovered back at the North Pole, he is adopted by Papa Elf. Papa Elf names his son Buddy.Buddy grows up at the North Pole believing he is an elf, but due to his human size is unable to perform elf tasks. When Buddy accidentally learns that he is human, Papa Elf explains that he was born to Walter Hobbs and Susan Wells, and was given up for adoption without Walter knowing. Susan died and Walter works at a book publisher in New York City. Buddy travels to find him, whom Santa indicates that Walter is on the naughty list due to his greed and selfishness. Buddy then is out to save Walter and Christmas itself. This should be on your must see watch list.",
    "96": "This is the kind of Christmas movie you should be watching every 25th of December apart from your usuals. It's a wonderful story, with a strong Will Ferrell, playing an innocent, child-like, distracted elf who has no idea how the real world functions, as he is on the quest to search for his real family. He is willing to spread the Christmas spirit on a city which apparently hasn't got the spark in its eyes, so there is a hard task on his hands.The rest of the cast is wonderfully completed by Zooey Deschanel, James Caan, Mary Steenburgen, Daniel Tay, with Peter Dinklage and Bob Newhart in small roles. Ferrell definitely steals the movie; and his troubled relationship with his father (Caan) provides some funny and touching moments as well. Jon Favreau did quite a good job from the director's chair, turning this seemingly childish film into a marvelous choice for your Christmas movies of every year. Some even regard it as a classic, but well, I will let you be the judge of that.",
    "97": "This is a good natured holiday comedy that definitely is in the same realm as \"The Santa Clause\" and (Dare I say?) \"Miracle on 34th Street\". Story is about a human that has been raised by Santa's elves at the North Pole and as he gets older he figures out that he's very different from the other elves. Years earlier Santa (Ed Asner) was delivering at an orphanage and a human baby accidentally crawled into his sack and was taken back to the North Pole where he was raised by Papa Elf (Bob Newhart). He is called Buddy (Will Ferrell) and he grows to six foot three and one day he is told the truth about his situation and told by Santa who his real father is. Buddy travels to New York City to meet his father and he heads to the Empire State Building where he works. He finds his father Walter (James Caan) who runs a publishing business and works all the time much to the chagrin of his family. Walter is unable to get away from Buddy and after a blood test proves he is his son he takes him home with him to stay with his family. He meets Walter's wife Emily (Mary Steenburgen) and their son and Walter thinks Buddy is just someone reverting to his childhood after a shock. Buddy starts to work in a department store and he meets a woman named Jovie (Zooey Deschanel) and is smitten by her. Buddy tries to fit in with the others but finds it difficult although he becomes friends with Walter's son and starts dating Jovie.This film is directed by Jon Favreau who has made his mark as a director of low budget films like \"Made\" and also as a character actor but this is his first effort at directing a mainstream Hollywood movie. He does a commendable job and as I watched this film I kept having the feeling that he purposely made the most commercial film that he could. Favreau as an actor has mostly appeared in small roles. As a director his small films are lucky to play at art house theaters and I seriously doubt he's getting rich hosting \"Dinner For 5\" on the Independent Film Channel. It looks as though he wanted to make a crowd pleasing film that will ultimately be playing on some cable channel for the rest of our lives. I'm not knocking this decision at all, it's a smart move and he's become a major Hollywood player with the success of this film. Even the script was carefully written to insure that WHEN this plays on television there will be nothing to edit out. The closest thing to a bad word is uttered by Caan when he says \"Hell\" once towards the end of the film. This is a fun film that does have undeniable charm and its heart is definitely in the right place. It's sentimental and corny but thats part of the appeal. The script doesn't try to hard and the energy and flow of the film keeps at a constant pace, it doesn't try to go over the top which is refreshing. Ferrell is a natural performer and his dopey wide eyed expressions never grow old. This film must be doing something right because tough guy James Caan is believable as a caring husband and father. Very old fashioned story that never raises itself above lightweight status is nonetheless funny and charming. Like I said earlier, this film will be playing on television every year for the rest of our lives!",
    "98": "\"Elf\" is a pretty cute film--but they're starting to overplay it a bit. Just this Christmas season, it's been on TV 1483857 times (give or take 2). And I worry that being shown so much that folks might have a backlash--might start to hate the film even though it's decent family entertainment and is worth your time.Will Ferrell stars as 'Buddy'--a STRANGE young man indeed. Apparently, as a baby he was accidentally kidnapped and brought back to the North Pole by Santa. Not knowing what to do with the boy so he gave him to an elf (Bob Newhart) to raise as his own. However, he's a terrible elf. Part of it that he's absolutely too big to live as an elf--and part of it is that he's a bit...well....stupid. Eventually, after not fitting in for a very long time, the elves inform Buddy that they now know who his read father is and Buddy leaves the Pole for New York City to find his dad. Once there, Buddy once again does NOT fit in--and makes a mess of most everything. Can Buddy sort all this out and connect with his dad or will the audience leave the theater feeling depressed and miserable (yeah, right!).The film has many funny moments (my favorite was when he exposed FAKE Santa to the kids waiting to see him), a few sweet ones and some very clichéd ones--but I can forgive this, as it IS a family comedy and I am not expecting Shakespeare! Well worth seeing....and a bit odd seeing Ed Asner playing Santa!",
    "99": "Will Ferrell does a great job here, and it's the perfect Christmas (Holiday) movie that can be enjoyed anytime of the year.The contrast of almost unbalanced folly of Will's character with those that encompass him, lends a great degree of innocence and non-stop joy and plenty of laughter as he leaves the mundane world of the usual, boring, and often time intolerance of the world in his dust.It's refreshing to see a story where others are encouraged to rise to the level of this main character instead of him being overwhelmed and dragged down by the majority of \"Cotten Headed Ninny Muggins\", a.k.a. the \"touch me not, speak to me not\" big city public psyche so familiar that many walk around with.For those that represent the general public in the movie, as well as the audience, Ferrell's character dares us to believe again, even for a moment of the magic of Christmas and tears down decades of political correctness to connect us with the late 60s and 70s when so many annual Holiday shows brought us a seemingly sustained desire to entertain ourselves with the magic that waxes then wanes but for a few short weeks each year. Whether a work of animation or raw theater, this refreshing story brings vitality and rekindles childhood memories for the kid in all of us.",
    "100": "Elf (2003) -I first watched this film, because I was hungover at a friends house and couldn't change the channel and I am so glad that I did, because it is now a must see every year.A happy Christmassy place that was obviously full of fun, their version of the North Pole had a quirky, cartoony style that was inspired and made it clear how different the worlds Buddy The Elf found himself in really were.I had always found Will Ferrell's (Buddy) films to be a bit too childish and abrasive for my tastes, so I was surprised to find that I adored this film and that he was, of course, ideal in the role of a child like Human, raised by Elves.There were a few moments that I would typically associate with the Will Ferrell type of films that I have seen bits of or avoided based on the trailers and they did get on my nerves slightly, but I got over them fairly quickly, because everything else was just so brilliant.It had many great actors in it and no one gave a duff performance. I liked Mary Steenburgen playing Emily Hobbs, although it was a relatively small part for her and I found a new appreciation for Zooey Deschanel, because she had a great voice and was lovely as Jovie. I have since adored her as Jess in 'New Girl' (2011-8) and recommend it to everyone.Even James Caan was perfect as the grumpy old Walter Hobbs, whom Buddy visited in New York. Bob Newhart was also the absolute cutest as Papa Elf, who suffered greatly as Buddy's adoptive father.All of the Elves were actually very cute and cleverly depicted, including Peter Billingsley, the kid from the American classic, seasonal film 'A Christmas Story' (1983), as Ming Ming, which I thought was a clever touch.Veteran Santa, Edward Asner was a tad grumpy in the role for me, but he didn't effect things too much for it, because the story followed Buddy so closely and the shenanigans he got up to in The Big Apple, leaving Santa as just a bit part.Said Shenanigans were full of wit, joy and laughs aplenty, thanks in a large part to the brilliant direction by Jon Favreau, the genius behind 'Iron Man' (2008) and 'The Mandalorian' (2019-). He clearly had a liking for cult Christmas style and a great sense of humour, which delivered this enchanting tale.961.04/1000.",
    "101": "As a baby, Buddy {Will Ferrell} crept out of his crib in the orphanage right into Santa's goody bag. Thus he grows up at the North Pole working with the elves in Santa's work shop. Now firmly grown up physically, Buddy is shocked to learn that he is a human being, not an elf. So upon hearing that his father lives in New York, he sets off to find him. But can he survive New York? More to the point, can New York survive Buddy?Like him or loathe him, Will Ferrell has a nice line in physical comedy. So with that, Elf is the perfect vehicle to showcase his exuberance. But with that also comes the problem with the film. For it feels {actually it is} like director John Favreau and writer David Berenbaum have plopped Ferrell into a fish out of water scenario and stitched together a number of sketches for him to run thru. The outcome of which may induce some amiable comedy along the way, but renders the finale a weak attempt at holiday message emotion. The supporting cast also suffer in the wake of Ferrell's domination. Something that annoys when you consider we have the likes of James Caan and Mary Steenburgen trying to breathe on the sidelines.There's enough here to make it a safe holiday viewing for the kids and those adults who have a penchant for Ferrell's comedy. But really it's a patchwork quilt of a picture, with the makers playing it all too by the numbers just to sell tickets. 5/10",
    "102": "If I were to tell you \"Elf\" stars Will Ferrell as a human named Buddy who thinks he is an elf and Ed Asner as Santa Claus, would you feel an urgent desire to see this film? Neither did I. I thought it would be clunky, stupid and obvious, like \"The Santa Clause 2\" or \"How the Grinch Stole Christmas.\" It would have grotesque special effects and lumber about in the wreckage of holiday cheer, foisting upon us a chaste romance involving the only girl in America who doesn't know that a man who thinks he is an elf is by definition a pervert. That's what I thought it would be. It took me about 10 seconds of seeing Will Ferrell in the elf costume to realize how very wrong I was. This is one of those rare Christmas comedies that has a heart, a brain and a wicked sense of humor, and it charms the socks right off the mantelpiece. Even the unexpected casting is on the money. James Caan as the elf's biological father. Yes! Bob Newhart as his adoptive elf father. Yes! Mary Steenburgen as Caan's wife, who welcomes an adult son into her family. Yes! Zooey Deschanel as the girl who works in a department store and falls for his elfin charm. Yes! Faizon Love as Santa's elf manager -- does it get any better than this? Yes, it does. Peter Dinklage, who played the dwarf in \"The Station Agent,\" has a brief but sublime scene in which he cuts right to the bottom line of elfhood. \"Elf,\" directed by Jon Favreau and written by David Berenbaum, begins with a tragic misunderstanding on a Christmas long ago. As Santa Claus is making his rounds, a human orphan crawls into his sack and accidentally hitches a ride to the North Pole. Raised as an elf by Papa Elf (Newhart), he knows he's at least four feet taller than most of the other elves, and eventually he decides to go to New York City and seek out his birth father. Indeed the whole world has grown too cynical, which is why Santa is facing an energy crisis this year. His sleigh is powered by faith, and if enough people don't believe in Santa Claus, it can't fly. That leads to one of those scenes where a flying machine (in this case, oddly enough, the very sleigh we were just discussing) tries to fly and doesn't seem to be able to achieve takeoff velocity, and ... well, it would be a terrible thing if Santa were to go down in flames, so let's hope Buddy persuades enough people to believe. It should be easy. He convinced me that this was a good movie, and that's a miracle on 34th street right there. Of course there's a big scene involving Buddy's confrontation with the department store Santa Claus, who (clever elf that he is) Buddy instantly spots as an imposter. \"You sit on a throne of lies!\" he tells this Santa.",
    "103": "Funny, heartfelt, and with great casting- Elf's continuing status as a Christmas classic still manages to this day, due to its true sense of joy and child wonderment, as well as it simply being a genuine family film. Will Ferrell is by far the perfect casting choice for Buddy the Elf, no one can pull off the character with such ease, and make him so iconic. Ferrell has the energy to bring the character to life, and James Caan's performance as his father also proves to be an equally impressive match. The film starts out a little bland, I get what they were trying to, being an obvious ode to the Rankin Bass films of the older generation- but something just falls a bit flat about it, and it adds nothing really to the heart and or point of the story. I enjoyed watching Buddy harass people in New York, always found it really funny, as well as his scenes at Gimbels, interactions with Zooey Deschanel's characters, and him bonding with his new family. Perhaps the best part of the film though is its triumphant ending due to the large amount of Christmas spirit, and truly you are a cold hearted cynic if you don't smile at least once during that scene, let alone the film itself. In the end, Elf is not quite as great as the hype, but it still proves to be a very enjoyable and heartfelt little Christmas movie. Well deserving of its classic status.My Rating: 8.6/10.",
    "104": "This movie is incredible, and it's almost impossible that this movie could've been better.I loved the character growth and development, and the climax is golden.Overall, probably about 9.5 stars.This movie is hilarious, and I completely recommend, because not liking this movie is very rare.Twenty years after it came out, I can assure you that this is a classic.Everyone in my family loves this movie, and we watch it every year.Thank you for reading my review, and don't forget to check this movie out, because it really is incredible!Merry Christmas, happy new year.While it's still 24 days until Christmas, this movie doesn't fail to give you Christmas spirit, if you watch it on Christmas Eve or July 7th.",
    "105": "There are very few Christmas movies, or movies in general for that matter, that I could watch over and over again without getting sick of. 'Elf' is one of those movies.We're approaching the festive season as I write this review and, being such a crowdpleaser, this movie is already appearing in TV listings everywhere. It seems to grow in popularity year-on-year and it's hard to believe that it's been 14 years since its release.Will Ferrell without doubt makes the film what it is. He gets his character spot on and provides plenty of laughs for adults as well as kids. There are some hilarious individual scenes and the movie as a whole is just great fun, which is what Christmas movies should be.For sheer entertainment value, 'Elf' is without question one of the best.",
    "106": "'Elf (2003)' is a sweet, 'Christmas spirit'-soaked experience that's got just the right amount of edge. It's lead by the somewhat 'restrained' (in that he isn't swearing or getting sexual) yet brazen and unembarrassed Will Ferrell in perhaps his most iconic role. It's also backed-up by pretty much the pitch-perfect 'straight-man' and screen legend that is James Caan. The film is genuinely funny on a surprising number of occasions, while just generally being enjoyable the rest of the time, to boot. Where it falters slightly is in its third act, where the much more interesting father-son stuff is sidelined - to the point that the 'all is lost moment' and its aftermath (including its initial rectifying and, even, the flick's ultimate denouement) are rushed so much that they feel fairly disingenuous - in favour of a more traditional, typically 'Christmassy' 'saving Santa' story which honestly feels a bit out of place here. It's a real shame that the crux of the narrative is glossed over for this finale, especially considering that the focal relationship and its themes are actually really juicy - in terms of both comedy and character (indeed, pretty much every major player comes full circle in terms of their arc). It's an entertaining experience, nevertheless, and a pop-culture staple, too. Its problems pale in comparison to its successes. It's delightful, a quintessential Christmas classic. 9/10.",
    "107": "\"Elf\" is a laugh-out-loud with a tear-in-your-eye charming, updated tribute to one of my favorite movies \"Miracle on 34th Street,\" much better than the tepid actual re-make. Here, the plot turns in a now-vanished Gimbel's, but the family in much need of \"faith means believing in something even when your common sense tells you not to\" again lives in an apartment on the Upper West Side overlooking Central Park. While I couldn't tell from the credits just how much was actually filmed in NYC vs. Vancouver, I'll credit whatever it does, as it is such a Valentine to Christmas in New York, to mix holidays. While Ed Asner makes me believe that he too thinks that Edmund Glenn really was Santa Claus, it is Will Ferrell's consistent wide-eyed innocence that carries the movie. The product placements do get annoying, but mostly serve the script. Who knows if director Jon Favreau, who also has a cameo role, punched-up debut writer David Berenbaum's script, but it is delightful.Zooey Deschanel is a sweetheart, while James Caan and Mary Steenburgen just pretty much get to reprise their TV roles, in, respectively, \"Las Vegas\" and \"Joan of Arcadia.\"The visual references to other movies are amusing, from the Disney-like animation at the North Pole to treating the Urban Park Rangers like the Dark Riders from \"Lord of the Rings: The Fellowship of the Ring.\"The holiday song selections are mostly classic, though it's nice to hear new Leon Redbone interpretations on two tracks.(originally written 1/19/2004)",
    "108": "Elf has the premise and the look of a badly made Christmas special made solely for network TV. Going into this with mediocre expectations, it only took about ten minutes of seeing Will Ferrell in an elf costume to know that my predictions were dreadfully wrong. This wasn't a case of holiday dreck, but a case of the Christmas film that combined heart, soul, wit, and laughs into a beautiful holiday parable.The story is about Buddy the Elf (Ferrell) who accidentally crawled into Santa's sack at the orphanage when he was an infant and gets taken back to the North Pole. Santa Claus and the elves choose to raise him and train him to become an elf. Buddy is of course a human so he grows a lot faster than the average elf. In fact, he towers over every other elf he works with, and this leads to problems when he is older.Buddy then learns he is a human, which causes confusion and sadness. It is told that he was placed in that orphanage as an infant because his father fell in love with a woman who gave birth to him then gave him up unbeknownst to him. Buddy then decides he will go to New York City to try and find his dad and reconnect with him.His goal is to also spread Christmas cheer far and wide because Santa's sleigh is almost forced to operate with an engine. In the olden days, Santa's sleigh could fly because of mass amounts of Christmas spirit and children believing in Santa Claus. Now, he has to resort to heavy machinery to do that job.Will Ferrell hasn't sat right with me for the longest time, but as I see more of his movies I begin to like the guy in a sense where I'd like to see him do one of two movies; (a) heartfelt children's' films or (2) very serious dramas in the vein of his 2011 film Everything Must Go. He doesn't have the talents to pull off incredibly funny slapstick because his schtick is usually composed of running around like a towering dork or just screaming. Elf shows his ability to incorporate his persona in a character you can't help but love.We also see Zooey Deschannel, one of my favorite females in the business today, as Jovie, a woman who works at a mall as Santa's little helpers. Buddy falls for Jovie in a sort of non-conventional way, but he winds up getting conventional help from his younger brother Michael (Tay).Elf is more than holiday fluff, it's a successful romp of Christmas spirit sealed inside a good family film. The cast is lively, the antics aren't over the top, and the storyline unique and film sustainable. This also shows immensely that director Jon Favreau can be handed a script for a thriller, a comedy, a romantic comedy, a superhero film, or a drama and still be able to create on screen magic. I'm also sure this beats a movie about elves working in a tree during the dry season.Starring: Will Ferrell, James Cann, Zooey Deschannel, and Daniel Tay. Directed by: Jon Favreau.",
    "109": "I'm not the biggest fan of Will Ferrell, but in casting \"Elf\" someone had a brainstorm, because I have to admit that Ferrell was absolutely perfect in this role. He plays \"Buddy the Elf,\" a human baby in an orphanage who accidentally hitches a ride in Santa's toy bag one Christmas Eve and finds himself at the North Pole, adopted by \"Papa Elf\" (Bob Newhart) who raises him as an elf. Of course, it isn't a good \"fit,\" so to speak. As a human, Buddy is a lot bigger than your average elf and, finally realizing he's human, he sets out for New York City (with no knowledge of the world outside the North Pole) and sets out to find his father, who he's been told is Walter Hobbs (James Caan) - a big publishing executive working at the Empire State Building. Essentially, the story is about Buddy trying to fit into life in the real world, and to be honest, it's really quite enjoyable and sometimes even quite funny.The cast all do quite well with their parts, although I thought that we didn't really need a love angle for Buddy, represented by Jovie (Zooey Deschanel) - who's adorably cute, but I'm not sure she was essential to the story. Every movie of this type, of course, needs a scrooge-type character to be reformed and filled with the Christmas spirit. Here, that was supposed to be Walter, but I honestly didn't find Walter to be scrooge-like enough. He seemed to be a basically nice guy who was himself just being overworked by an overbearing boss (in a limited role played by Michael Lerner.) I didn't get the jarring \"turnaround\" in Walter's attitude that you often get from this. He seemed to accept Buddy too easily - with a bit of encouragement from his wife (Mary Steenburgen.) Still, while some of the characters didn't hit home as powerfully as they could have, the performances were good and they added up to a fun story.It was nice to see Ed Asner play a fairly important role as Santa in this, and the movie even managed to pay just a wee bit of homage to the TV special Rudolf the Red-Nosed Reindeer, as Leon the Snowman who slid around at the North Pole looked basically like the sliding snowman who slid around and narrated Rudolf (although the narration for this movie, when necessary, was done by Papa Elf.) The animals in the woods at the North Pole also reminded me of the animals in Rudolf.It's a cute story, good fun for the family in the Christmas season. (7/10)",
    "110": "Elf is the story of a human named Buddy who was raised by elves in the North Pole at Santa's Workshop. When Buddy becomes an adult, he is told that he was adopted so he goes on a quest to find his father in New York City.This movie is hilarious. Will Ferrell is perfect for the role of buddy! He really portrays the character's sweetness with a comedic touch. One of the reasons I love this film so much is that it really captures what it would be like to take someone who has lived in fantasy land and throw them into the hustle and bustle of the big city. There are several montages throughout the film. My favorite would have to be when Buddy comes to New York for the first time because he does such bizarre things. If I were to see him eating the gum of the hand rail or playing in a revolving door in my town, I would think he was crazy! I end up feeling bad for Buddy because he is so clueless to how the real world works.Another thing that makes this movie so hysterical is that in the North Pole the props, costumes, sets and back drop are so elementary and simple, it really accentuates the innocence and comical quality of the elf world. Also, in the North Pole, there are some animals made of clay animation. Their design is very similar to the old Rudolph the Red Nosed Reindeer movie, and that warms my heart and makes me laugh.This movie is perfect for family night, watching with friends or when you just need a laugh. This story is touching yet funny as Buddy goes on an amazing journey to get closer to his father's heart and bring back holiday spirit to all. This is a great film for all ages because it contains the fun innocence of an elf that children can enjoy and it also has a bit of adult humor for the older viewers. Although young children will love this movie, I think ages 7 and younger should watch this with an adult or older child because they may get slightly confused or frightened. Over all, this is a wonderful film, whether it's the holidays or not.Reviewed by Raven Devanney, age 13, KIDS FIRST! Film Critic",
    "111": "Jon Favreau's Elf is as snappy as holiday comedies come, mainly thanks to Will Ferrell's pretty damn hilarious performance as Buddy, a human baby stranded in the north pole and raised by pint sized elves as one of their own. Ferrell can be overbearing at times with his often hard to swallow brand of abrasive humour, but there's always moments where he reigns it in, sticks to the script and gives us magic. I think that this being a family film dictates that he especially needs to play it close to the chest and gives him a comedic track to run on without derailing into the desperate realm of cringy improv and sticking to the screenplay's wonderful jist, and not smothering it in ego and comedic decadence. It's a wonderfully sweet script as well, seeing Buddy travel from the north pole to bustling Manhatten to locate his long lost human family. His cranky birth father (craggy, immortalized James Caan) wallows in lukewarm disbelief as Buddy follows him everywhere, including back home to spend time with bis wife (Mary Steenburgen) and kids. He sorta kinda finds work in a mall due to his inherent elf-ness and gets himself into all kinds of trouble, until he catches the eye of a hired elf played by adorable Zooey Deschanel, who's got herself a case of the Christmas blues. Ferrell's upbeat, manic tone combined with Zooey's dry, laconic yet amused personality makes for perfect chemistry, especially in their odd, compelling rendition of 'Baby its cold outside'. Buddy blunders his way from one austere NYC situation to the next with shiny naivety and blind, trusting optimism to hysterical payoff, a dynamic which sits at the core of what's made the film so successful over the years. The only bad note for me is a terrifying animated version of the north pole that looks like Wallace and Gromit got drunk on rum and eggnog and dreamt some creepy version of Santa's homestead, complete with eerie talking seals. Director Favreau participates in a cameo as Caan's family doctor, Edward Asner shows up as a jolly enough Santa, and Bob Newhart steals many laughs as Buddy's awkward surrogate elf father.",
    "112": "The film is something quite intriguing with a very unique plotline; from the beginning it looks to be very promising and, is, in fact, promising. However, it misses a certain something that becomes more apparent throughout the film: after a while the pure immaturity of the Elf slowly begins to wear away on you until the film loses all of the original appeal that it had.\nNonetheless, the film has some delightfully entertaining and hilarious portions, though overall it leaves much to be desired. The ending drags out painfully and becomes torturingly corny, nothing that is unpredictable about it. In spite of the ups and downs that one has when watching the film, it can still be called a decent film. There was some very good exercise of comedy and admittedly it is superior to many of the films that have come out, but if you were hoping for anything more than just a slightly entertaining film, you will be disappointed. Aside from the minimal comedy to keep you interested nothing more is offered by the story.The movie should make you laugh, and the movie is worth seeing, but again, it is far less than the Christmas classic that people are claiming.",
    "113": "This film has a very good cast with some big names of the time and past in entertainment. \"Elf\" is a modern Christmas fairy tale that scores well just for its comedy. Somewhere amid the crazy antics and situations there is a Christmas message or two. But this film is something to enjoy just for the laughs. Most of the humor comes from an overgrown elf trying to adapt and learn how to live in an adult world. Along the way, he spreads some Christmas joy. Will Ferrell is Buddy – an overgrown elf by mistake, whose doings resemble the Marx Brothers, the Three Stooges, and Merwin's magic. It's hard to imagine anyone else giving the performance Ferrell gives here. The role seems written for him. Bob Newhart is Papa Elf. I don't know any other comedian who could get people to laugh so much with a straight face. He applies his trademark as well in \"Elf.\" Edward Asner is Santa Claus, and James Caan is Buddy's real father, Walter. A host of younger actors do very well in their supporting roles. This is a fun movie that most should enjoy for the silliness and laughter.",
    "114": "Being an American entails watching people robotically tell themselves they like something that a marketing dept told them they like, and/or insisting there are laughs in the last few horrible Will Ferrell vehicles. The bits here are strenuously unfunny. The movie is a schlocky piece of garbage lifting garbage-y ideas from other garbage-y movies. This movie doesn't have an inch of redeeming celluloid. Every copy of it should be collected and dumped into some live volcano. Then we should all pity the volcano... Favreau made it for his adolescent daughter. It is over-ripe maudlin, sentiment that stinks worse than the dirty diaper you stepped in, in the Red Lobster parking lot last week. Zooey Deschanel gives Diane Keaton a run for her money in the \"actresses who should never be allowed to sing... EVER\" sweepstakes. This is dreck.",
    "115": "Can a real Christmas movie get made in our cynical, charm-free 21st century? Probably not, if \"Elf\" is the best stab at it so far.Up in the North Pole, Buddy the Elf (Will Ferrell) discovers he isn't an elf at all, but a displaced human orphan who found his way into Santa's bag at the end of a busy Christmas and was then raised in Santa's workshop. He undertakes to reconnect with his biological father, Walter Hobbs (James Caan), a gruff Manhattan executive who has found his way on Santa's naughty list.Odd to step back in time and see Will Ferrell in this early starring role, playing so resolutely to PG sensibilities that he almost seems made of gingerbread. Unless you own Keebler stock or have an aversion to watching spaghetti being eaten with maple syrup, there's little here to offend you.Alas, \"Elf\" is a film that thinks it's way cuter than it actually is. The idea of hearkening back to the stop-action TV Christmas shows I grew up with back in the 1970s is pleasant enough, and so is seeing NYC all dolled up for the holidays. But the story is a one-joke premise stretched well past its limit: Ferrell doing his man-child thing wearing an elf suit in the big city.One sequence demonstrates for me the limited nature of the film. In it, a children's book author played by another future big star, Peter Dinklage, comes to Caan's publishing house office to help concept an idea. Buddy spots him and immediately calls to him as a fellow elf, thus sparking a WWF rumble in the conference room.Sure, Dinklage is a little person and so the joke gets a bit of a laugh, but not anything to build deeper humor from. Why not, since we know Buddy is an overgrown kid, move past that and have the two get into a spirited disagreement about kiddie fiction, or what weather conditions are like on the North Pole? Instead, it's a short joke, some mayhem, and then cue the next scene.The film has a lot of go-nowhere moments like that, whether it's Buddy getting mistaken for a store employee at Gimbel's or Buddy's stop-motion pals on the North Pole. Caan deserves credit for playing his part with a deft lightness I wasn't expecting, and indeed most of the supporting work is fun. I especially enjoyed Bob Newhart as an especially sedate elf who looks after Buddy.There are also some funny bits for fans of Ferrell's wilder roles. Watching Buddy get into it with a department-store Santa (Artie Lange) who he accuses of being a fraud (\"You sit on a throne of lies!\") is good for a few laughs, even if it devolves into another rumble. Zooey Deschanel is sweet as Buddy's left-field romantic interest, and the ending actually manages to be rousing, shot as it was literally in the ashes of 9/11.But manipulation is kind of at the heart of this film, both when it's working and when it's not. For all his evident good taste and desire to please, director Jon Favreau seems at a loss when it comes to finding that next gear and giving \"Elf\" a sense of wonder or of mission. It's pleasant and light, and often amusing, but still leaves you with the feeling of a misfit toy.",
    "116": "Will Farrell has done better films than this one but this is a warm feel good holiday film. When you look at it as a whole film, it holds a certain charm. That charm is established by framing the story around belief in the fantasy known as Christmas.This is the most extensive work done by Bob Newhart since the 1990's. Bob is the framework that holds this story together. Ed Asner has a very small role as Santa & is just here enough to be recognizable having little chance to do much acting.Brunette bomb shell Zooey Deschannel is charming as a blonde & proves she can sing. Hopefully she will get some better roles as her young career has proved she can handle them. In this movie, she makes the viewer buy that young innocent charm as she glows here.Faizon Love is excellent in support as the Gimbles store manager. James Caan is OK here, less annoying than in some films, but for some reason he does not seem to get really good roles anymore.There are some gross holiday bits, like downing a 2 liter Coke & a 5 minute belch which is entirely logical, and then some bits which are funny physical comedy. Farrell does not carry the whole show here and that is a good thing. While he is considered the star of his films, his films are better when the support can carry them. His easily worst film is Bewitched where he tried to carry the entire film & flopped badly.This doesn't measure up to classic holiday films but is better than some of the lame efforts of recent years.",
    "117": "Elf is one of the better Christmas movie I have seen. The only movies associated with Christmas that are better than this are the first two Home Alone movies. This is nothing Oscar-worthy but it is a feel-good holiday film. I think Will Ferrell is an mediocre actor at best but I feel this is his best role.This is about a human who was raised in the Arctic by Santa and the elves. When he is thirty, he ventures out to find his real dad. Unfortunately for Buddy, his dad seems to have no interest in having him as a son.The acting is pretty good. I mentioned Ferrell before and I am surprised on how I actually liked him. The older guys like James Caan, Edward Asner, and Bob Newhart were wonderfully cast.Overall, this is a fantastic Christmas tale. It's definitely the best one this century so far. I rate this film 9/10.",
    "118": "Elf is a fantastic movie with a very well written plot and a great comedic cast. It's a film that I always insist on watching at Christmas time, because it's just so much fun, I never get tired of it. The humour remains constant throughout while still managing to be sweet and very charming. The only thing I ever felt was missing from Elf was more tension between Buddy and Jovie's relationship. It's too perfect, when they meet up there is a bit of conflict, but shortly after that they have no real issues, they should have made them split and convince the audience that they were not getting back together, so that it would feel more fulfilling once they did. The performances in this film are outstanding and everyone suits their roles perfectly, whether it be James Caan as a business executive who struggles with the responsibilities of being a father, Zooey Deschanel as a complicated girl who is confused with the idea of falling in love, Bob Newhart as the father of all the elves, or Edward Asner as Father Christmas himself. Everyone plays a character that suits them and their own characteristics or personalities perfectly. The highlight of the movie is of course Will Ferrell, he is funny, charming and very lovable, though the movie may not be that old, Ferrell's performance as Buddy the Elf is already iconic, we can relate to him on several occasions, whether it be his sense of optimism, trying to find the good in everyone, or even just his love for Christmas, there are several aspects that make him one of the most beloved characters of any Christmas movie, and Ferrell is to thank for most of that. Sweet, heartwarming and very, very funny, Elf is a perfect film to watch at Christmas time that the whole family will enjoy. When Buddy, a human raised by elves in the North Pole, learns that his real father lives in New York, he heads off to find him.Best Performance: Will Ferrell",
    "119": "So-so film with a few really funny moments. It always seemed like the comedy could have gone two steps further than it did. There are tons of missed opportunities and jokes that are built up without payoff (the news broadcast at the end of the film is a perfect example). Elf earns points for being a decent family film in that it has almost no objectionable content  one very long belch is about it. It's nice that it doesn't resort to gross-out humor, but it could certainly stand to be less lame a lot of the time. Will Ferrell, a former Saturday Night Live actor, stars as a human who is raised by elves until his enormous height compared to the other elves makes this fact all too obvious. When Ferrell finds out that his father (James Caan) lives in New York City, he goes out and finds him. It becomes a standard fish-out-of-water comedy. The writing is half-hearted, so the weight of the movie ends up resting wholly on Ferrell, who does his damndest to carry it on his shoulders. I've always been a fan of Ferrell, even if he did create a couple of truly obnoxious characters on SNL. He actually does a fine job in Elf, playing a truly manic but sweet idiot. The filmmakers should have trusted Ferrell more, because it really shoots itself in the foot when it begins to concentrate on a very cheesy and unbelievable crisis in the elf's newfound human family. Ferrell has run away from home, and Caan and his family think they can find him in New York City  which, of course, they do. And Ferrell (along with his family and his girlfriend) have to convince the people of NYC to have faith in Santa Claus so his sleigh can fly. They do this by having the girlfriend (a very cute Zooey Deschanel, who might look a bit too much like Reese Witherspoon to become a star) sing 'Santa Claus Is Coming to Town' on the news. I was enjoying the film, but this kind of formulaic garbage just ruined it. It's nice to see Bob Newhart, Charles Durning, and Andy Richter. One of my favorite comediennes, Amy Sedaris, was also there somewhere, but I must have missed her (was she one of the elves?). 5/10.",
    "120": "Like most people around the holidays, I'm usually up for a watching (or re-watching) of the great holiday classics (\"Wonderful Life\", \"Home Alone\", etc.). For whatever reason, however, it took me until 2016 to actually sit down and watch \"Elf\" all the way through. While maybe not jumping up to the top of my \"all-time Christmas list\", I did find Elf to be an enjoyable romp.For a basic plot summary, this movie tells the story of Buddy (Ferrell), a human boy raised in the North Pole due to a mix-up with Santa Claus (Ed Asner). For most of his life, Buddy believes he is an actual elf, until realizing his shortcomings in that community. As such, he decides to strike out for the \"human world\" in order to find his real father (James Caan). Along the way, Buddy (as a result of his endearing cheerfulness) brings a bit of Christmas spirit to all those around him that are in dire need of it, including a young retail worker named Jovie (Zooey Deschanel).To me, \"Elf\" is primarily a success because of the iconic character that Ferrell creates. The script/plot itself is about as irrelevant and corny as they come, but Ferrell's quirky energy steals every single scene. Quotes like \"You sit on a throne of lies\", \"Bye buddy, hope you find your Dad!\", and \"Buddy the Elf, what's your favorite color?\" will forever be burned into my memory! I don't think there is an actor out there who could have played Buddy as perfectly as Ferrell.Simply put, I'm glad I finally sat down and watched \"Elf\" from beginning to end. I don't know if it will get watched religiously every Christmas in my home (time will tell on that one...but maybe it will grow on me even more!), but I can tell you that I will be quoting it going forward!",
    "121": "At first glance, Elf would appear to be one of countless holiday- season cash-ins with daft costumes and even sillier special effects, featuring a well-known actor performing pantomime on a bigger budget and grabbing an easy pay-day in the process. That is stars Will Ferrell, one of cinema's most naturally hilarious funnymen who seems to be caught up in an endless loop of mediocrity - Blades of Glory and Stranger than Fiction excluded - as the titular human-turned- elf, bodes even worse. Throw in some little people dressed in elf costumes and a romance involving surely the only woman to accept a date with a man who claims to be from the North Pole, and it would seem like a movie tailor-made for a critical beat-down.Only Elf is genuinely charming, and even more alarmingly, incredibly funny at times. Using Ferrell's man-child comedy chops to the fullest extent, this may actually be the best work Ferrell has ever done. He plays Buddy, an orphan accidentally whisked off to Santa's homeland as a baby. Taken in by the sympathetic Papa Elf (the wonderful Bob Newhart), it doesn't take long until Buddy is towering over his adoptive father and his co-workers. Learning of his biological pop Walter (played by James Caan) and that he is in fact a human, the 6-foot elf journeys to New York City to be with his real family, only for his miserable publisher dad to shun him. Buddy learns that his world no longer buys into tales of flying reindeers and a jolly fat man who knows if we've been bad, disbelieving in the 'magic' of Christmas and draining the power from Santa's sleigh in the process.Directed by Jon Favreau and written by David Berenbaum, Elf is pretty standard stuff story-wise, and is hampered by a predictable sub-plot involving Walter's struggling publishing company and his dire need to lighten up. Yet there are many touching moments, particularly in the scenes involving Buddy and his young half- brother, and the former's awkward courting of a pretty toy store assistant (Zooey Deschanel) initially freaked out by his maniacal claims but who eventually succumbs to his hyperactive charms. It all inevitably leads to a climax built around a special-effect laden set-piece as Santa struggles to deliver the presents with a dying sleigh, but this is expected from a movie designed to win over those looking for something easy-going and festive. The world has grown cynical, and perhaps so have I, but Elf reminded me that it is no fun being so.",
    "122": "\"You sit on a throne of lies!\"Elf is one of those rare comedies that grows on me each time I rewatch it. I remember I enjoyed it the first time I saw it, but I love it even more now. Not everyone is a fan of Will Ferrell's man- child character, but seeing him wear those yellow tights and his green elf suit is hard to resist. He is hilarious in this movie and at the same time charming. Elf is not just a comedy that aims for cheap laughs or plays on one gag, it is also wickedly smart and brings out the Holiday spirit in everyone no matter how much of a Grinch or Stooge they are. There are so many great scenes and memorable quotes. The funniest scenes in the film are the ones where Ferrell calls out a fake Santa in the department store where he has been hired, and when he mistakes one of his father's associates (Peter Dinklage from Game of Thrones) for an elf. Those two scenes were great, but there were so many more hilarious moments playing on his confusion. The love story is also sweet and Zooey Deschanel shines in every scene she's in. James Caan plays Ferrell's father (who's in the naughty list) extremely well. Elf has turned into a Christmas classic, but the great thing about these comedies is that you don't need to wait for the Holiday season to enjoy them. Jon Favreau has proved he can direct some great films and he has a great sense of humor. It's been 11 years since it first was released and it continues to be a joyous experience.",
    "123": "I watched this last night as it was on TV and there was nothing on at all last night so I said since we are reaching the holidays I might as well watch it. The movie is similar to Enchanted in a way(minus the animation)and it tells the story of a man who is raised by Santa's elf's and he goes to NYC to find his biological father who is a writer apparently . Buddy(Ferrell) then meets a girl named Jovie(Zooey Deshnail who is a dead ringer to Katy Perry)and becomes smitten with her.I may not be a fan of Will Ferrell but I laughed at a few parts to this movie like the part where he is singing the Baby its cold outside song from Tom Jones and the part where he humiliates his father at work by some guy who he called an elf too LOL that was hilarious.The movie is a bit stupid but I like fish out of water movies as I like how the characters interact with our world and that. I liked some parts to it but the ending was quite dumb. So I am giving it a 6 simply because its nearly Xmas and I like to get into the Holiday season.",
    "124": "(There Are Spoilers) Buddy the Elf, Will Ferrell, never seemed to fit in with his fellow Elfs in Santa's, Edward Anser, workshop at the North Pole. Being a couple of sizes bigger then the Elfs that he lived and worked with at the toy factory Buddy felt out of place and with his overly big hands he was clumsy in making toys as perfectly and delicately as your average Elf. Buddy considered himself to be, to the horror of his fellow Elfs, a \"Cotton-Headed Ninny Muffin\". One day Buddy's dad Papa Elf, Bob Newheart, came clean with the obviously confused Buddy and let the truth come out: Buddy your not an Elf your a Human. Buddy,were told, was left at the steps of an Cathloic Orphanage to be brought up by the Nuns there. One Christman Eve Santa came to town and Buddy slipped into his bag of toys and ended up in the North Pole and was secretly made to think that he's an Elf by Santa Papa Elf and all the Elfs working there. Now with the truth about him and his real dad Walter Hobbs, James Caan, a greedy and unfeeling children's book publisher who's, O' My God, on Santa's naughty list! Buddy crosses the seven levels of the Candy Cane Forest and past the Sea of Twirly Swirly Gumdrops and finally goes through, on foot, the Lincoln Tunnel to the magic city, New York, to finally meet his dad who he never knew up until now. Looked at as \"Some kind of Nut\" at first Buddy's good and child-like nature, as well as his belief in the Christmas Spirit and Santa Claus, wins over everyone that he meets. From his dad Walter to his step-mom Emily Hobbs and younger brother Michael, Mary Steenburgen & Daniel Tay,as well as Jovie, Zooey Deschanel, the girl who he worked with as an Elf, what else,at Gimbel's Depertment Store. Through Buddy's skills as a toy maker as well as his all around good nature he made believer's of everyone in New York City that there is a Santa as well as a Christmas Spirit. Buddy did it with a little help from his newly found and made friends who at first didn't believe him and even thought that he was just a wee bit mentally unstable. Heartwarming Christmas Movie with Will Ferrell perfect as Buddy the Elf who saved Christmas with James Cann as his grouchy but later Santa believing dad. Jovie who has a beautiful singing voice but was too stage frighten to sing in front of people, she only could sing in the shower, was so motivated by Buddy's actions to open up her voice in public at New Yorks Central Park, singing a Christmas Carol, where everyone in the park joined in including Buddy's at first apprehensive dad Walter. This gave Santa's sled the power to lift it up above the clouds and fly higher then it did, with the Christmas Spirit that powered Santa's Raindeer driven Sled in everyones singing the Christmas Carol, for years.",
    "125": "That's the only explanation I have in order to explain why such a sucky, corny and unfunny movie was such a huge hit at the b.o. and now on home video. So many people's brains are so numbed by drugs that something as awful as ELF can easily be considered a classic.What's remarkable is how unfunny and predictable ELF was. I knew things were going to happen several minutes even before they were going to happen (for example, the short writer...). And the film's corny attitude is so overwhelming, I cringed throughout the movie. This film is so corny, it could supply a years worth of high fructose corn syrup for Coca Cola, Pepsi, 7-up, Dr Pepper, Tab, RC Cola, Orange Crush, Kool-Aid AND every Kelloggs cereal in production!!! This film is so divorced from reality that it's unfunny. Yes, it's a fantasy. I'm aware of that but the employees at the mail room of the Empire State building are working on Christmas eve? I mean, come on! And I felt so bad for James Caan.If you like Will Ferrell's shtick, you'll probably like this movie. But for those, like me, who see Ferrell's shtick as something utterly annoying, avoid this movie at all cost!",
    "126": "Good watch, will likely watch again, and can recommend.For all the good this movie has in it, there is a fair amount of annoying as well, which is what keeps it from being a great movie.A family reconnection trope, with a character out of his element trope, crossed with one of the most annoyingly positive characters of all time trope.Ultimately, it's a sweet, hear warming story that really captures the spirit of family, Christmas, and togetherness.It also captures all of the insanity Will Ferrell can conjure up for his character, basically as if he wrote a SNL Christmas special and just rode rough shod over the other actors.The cast does a wonderful job of backing up Will Ferrell, but that's clearly what it is.Around the holidays, especially, don't be afraid of giving this a try, and bear through the annoying bits, because there is likely something really funny just about to happen.",
    "127": "Elf has sort of went off the map in recent years. It's been a while since I watched it, and I wasn't sure if it was going to hold up. I like Will Ferrell a lot, so I have it a try. It's a good one. Perhaps one of the best Christmas movies out there.The movie is about a human baby who grows up as an elf in North Pole. He discovered his real father lives in New York, and sets out to find him. There, he meets his father, and falls in love with another human.This is some good stuff. There were plenty of laugh out loud scenes. I couldn't even say it had any boring parts. The beginning was a little slow though. It was some solid good fun. I guess everyone else in the cast was secondary to Ferrell, but they all did well. When I thought the collaboration between the elf and his business minded father would suffice the entire story, suddenly new subplots arose that were even more satisfying.Great movie. A must see7 stars",
    "128": "I'm starting to think that there are dumb comedies and smart comedies. The \"dumb\" ones typically I cannot stand and usually fall into the banal (Farelly brothers) or ride one joke to exasperation (\"Romy and Michelle's high School Reunion\")This is a pretty good dumb comedy. One that thankfully gets by on a single belch, a little \"tasteful\" vomit and a urine joke that spears asparagus. Instead it relies more on us liking and maybe even identifying with an \"idiot\" who is more childlike than clueless.The more Will, the more power it has...especially when we get detours from the required plot landmark visits. Scenes like... -   Will running around New York city waving at a guy hailing a taxi, swapping pamphlets, etc... -   Will hitting the \"maple\" in the mail room...making a best friend -   Will getting a DNA check at the doctor's (director Favreau)That last section may have been the funniest to me, as it felt the most free... I suspect some of that was just plain improvised based upon the props on the set??Overall of course 99% of this was scripted, but whenever a film can at least feel like the comic is just riffing, that is a key for me. (And I think it is where Eddie Murphy's career evaporated...)Certainly this film is well planned out, but to its credit (and largely to Ferrell) it does have a looseness. If you enjoyed Ferrell on SNL, you should likely be able to find humor in this. Or if you like tromp l'oiel this has some nice bits... Some of the other grandiose reviews on this (lauding Asner, for what exactly?) might unjustly inflate expectations. Product placement was a little heavy here, I wish they'd skipped that and just not spent the money on the CGI sleigh ride from the four horsemen/orcs of the central park rangers. The ending of the film suffers as many comedies do, it's the time when everyone has to pass their papers to the front.Favreau is a sharp and gracious fan of film (from his IFC show) and Ferrell is funny as a stand-up sort of everymoron. 7/10",
    "129": "Before his first debut in the superhero genre starting with the first two Iron Man films, he directs a Christmas comedy known as \"Elf\" starring Will Ferrell and James Caan.It's about one of Santa's elves named Buddy who learns of his identity as a human and goes to New York City to find/meet his father and teach him the true meaning of Christmas in world of wacky cynics.As far as Christmas movies go, this one successfully details the Christmas feeling quite perfectly. The actors are brilliant. James Caan did a good job as Buddy's father, but I think that the best performance goes to Will Ferrell for his portrayal as Buddy and successfully gives out his hilarious comedic moments. The rest weren't that bad either especially Bob Newhart, Mary Steenburgen and Ed Asner. The jokes in this movie are hilarious including the \"He's an angry elf\" part and the directing from Jon Favreau was surprisingly good.My biggest complaint about this movie was the ending which felt too cheesy for my taste and in the third act, there were barely any jokes near the end of the film including it's atrocious dialogue, but I think the story was wonderful that boosts up the character development and it's not a complaint.Elf may not be excellent, but I'm sure it would be known to fans of Jon Favreau as a Christmas classic for children young and old.7.6/10",
    "130": "This film has become a sort of modern day Christmas favourite and it is not hard to see why. It has all the magic, heart and humour that makes a perfect Christmas film.Throw in a good script, Santa and a twist on A Christmas Carol and it is clear why this film has endeared itself to so many people.The cast are good - Ferrell may be the star name but James Caan and Ed Asner are all good in making their roles add something to this film. The whistle stop romance is rushed but very sweet and there is enough visual humour to entertain kids while also being verbal enough to make their parents smile.If any modern Christmas film has a chance to be a classic that is enjoyed every year it is this one, because it has all the magic ingredients, and appeals to so many.",
    "131": "Jon Favreu and Will Ferrel as a director/star combo is a good premise and execution here in Elf, as they create a film that assuredly works for the whole family.  This is because the film is as much directed towards fans of Ferrel from Saturday Night Live (which ranges with both sexes from little kids to people in their middle ages) as it is towards those looking for the holiday spirit.  Bottom line is, he makes the movie fun to watch, among a cast of well knowns (the likes of Bob Newhart, Ed Asner, Mary Steenburgen, Artie Lange, and Andy Richter pop up, and James Caan has a better than average supporting role).  Here, Ferrel plays Buddy, a man who's grown up adopted in the North Pole.  Raised by Elves, it pains him to find out that he isn't one, and that his father didn't even make Santa's 'Nice' list this year.  He decides to seek him out in New York, and has a brief stint working in a department store, followed by the mailroom of his father's office in the Empire state building.From what I described of the plot it sounds a little routine, and it is, but there are some things in the story that are inspired, though most of the joy in the film comes from Ferrel's Buddy.  Some might take his performance as over the top or lame, however I think he finds just the right bit of gleeful un-awareness at what he does, good and not so good, and there are a few real howlers too.  Best scene- Buddy confronts the department store Santa in front of the children (this is a near draw with the scene in the recent Bad Santa where Billy Bob beats down the plastic reindeer in the store).  Only the last part of the film, the Christmas Night bit, doesn't work at all.  A nice little Christmas comedy, which can be seen after the Holidays too. B+",
    "132": "Elf is already one of the most popular Christmas movies of all time, so in a way, this may already be kind of a pointless review. But I am going to review it anyway, since I haven't before, and this can be for the people who haven't seen it, or the people who may want to revisit it.Elf stars Will Ferrell, playing an elf named Buddy. When he was a baby, he snuck into Santa's bag while living in an orphanage and ended up in the North Pole, so one of the elves offered to raise him.As Buddy gets older, he learns that he still has a father (played by James Caan), and feeling like a misfit at home, he decides to go to New York to see him, only to find that there is little Christmas cheer there. Not for long...To start with praise, this is a really fun movie with my iconic scenes. Mention Elf to someone and see what they quote. They may say: \"World's Best Cup of Coffee! Great job everybody!\" or \"I'm in a store and I'm singing\", or \"He's an angry elf!\", or even: \"Oh, wait, I forgot to give you a hug!\" This may rank with It's A Wonderful Life as one of the most quotable Christmas movies of all time.Because of the lines I've mentioned and the goofy situations Buddy gets himself into, Elf is also a very funny movie. While writing this, I took a break to read the Quotes section on IMDB and found myself smiling and giggling at the favorite lines of others. Even now, the humor still works overall.Elf also contains many great actors. Will Ferrell is a mixed bag for me, I like some of his work and some of it I don't. However, Elf is easily one of my favorite of his works. James Caan does a fine job as his Dad, who is a grump at Christmas Time. Although, it makes it kind of odd (in a funny way) to later see him in a movie like The Godfather or Misery later on in life.Actors like Zooey Deschanel, Ed Asner, and Bob Newhart do great in their parts, as well as the other actors. Jon Faverau, the director, even has a cameo as a doctor and a Narwhal. (\"Bye, Buddy! Hope you find your Dad!\") And to think in 5 years he would direct Iron Man!Despite the charm Elf has, I do have an issue with it now as an adult who grew up on this movie. Let me explain:This movie came out when I was 5, and there is no way to count the amount of times I have seen it in the last 18 years. My uncle had the DVD, and most Christmases included watching it, up until I was about 12. Let's assume that's 6 Christmases, since we may not have watched it EVERY year. There were a few times I saw it at school before winter break, let's say about 4 times.I also got the movie on DVD for Christmas when I was 11 or 12, but I think I used that DVD once. I also have a friend who owns it and we've seen it twice together. That alone makes for about 13 viewings that I can remember, again in 18 years.That is where my \"flaw\" with Elf comes in. There's some movies I can see again and again, and as I have gotten older, I have realized that this isn't exactly one of them.It's still a fun movie, but for lack of a better term, my viewings of Elf are somewhat tainted due to how many times I have seen it. For example, when I was a kid I used to find this funny:\"Okay, everybody, Santa's coming...\"\"SANTA! OH MY GOSH!... I know him!\"Which is cute and all, but I dare you to watch that a dozen times in a row and not get annoyed. That is how that scene feels now, kind of.Does that make it a bad movie? Not at all. I just don't have the same appreciation of it as I did in say, elementary school.On that note, Elf released in theaters on November 7th, 2003. One of my favorite Christmas movies, Love Actually, happened to be released on the same day. I have gladly seen that about 5 times, it's that wonderful and charming. Elf doesn't quite do that for me on that level.So do I recommend Elf? Of course. I'm not a Scrooge or a Grinch for crying out loud! But I would have higher suggestions for Love Actually, It's A Wonderful Life, Scrooge from 1970, Prancer, and other personal favorites.I will most likely see this more times later on, and I'm okay with that. Is it one of my favorite Christmas movies? Not exactly. Is it still a good time? Yes. Elf is like Buddy's favorite food- spaghetti with syrup and sprinkles. It's super sweet, but not to be digested in large amounts.Note: This is intended to be the first of 25 Christmas reviews- one posted a day.",
    "133": "Elf is a throwaway comedy in which it feels like the actors aren't really trying. Every line is flat. The first 20 minutes of the film is in narrative format. Narrative is a crutch for a writer, it's the opposite of \"Show, don't tell\". There is something really off with the pacing.And the bits with Bob Newhart looking sad and unenergetic are really boring. How can anyone find that funny? It shocks me deeply. Maybe the film picks up (as Star Wars I: The Phantom Menace did after the first 20 minutes). But I didn't get that far. I like the occasional kids film but this one was awful. For Will Ferrell films, see Anchorman instead.Who should see Elf:-- Kids only, and maybe not even kidsI'll give Elf a 4 out of 10 which is the highest rating I'll give a film I couldn't sit through all the way.",
    "134": "As the delightful human who was raised by elves at the north pole, Will Ferrell, the greatest new comic actor out, walks a fine line between satire and genuineness.If he played Buddy completely for laughs, the movie would not imbue the audience with christmas spirit, and make us forget our doubts for a magical hour and a half.If he played Buddy completely subversively, poking fun at the christmas myth, adults would perhaps have had a few more laughs than they did.The reason Ferrell's performance is one of the best comic performances in recent memory, is that it serves both these purposes: there is a hint of satire in Ferrell's over-the-top enthusiasm, yet the innocence on his face appears absolutely genuine. One of the greatest sources of humour in the movie comes from actually believing Buddy has the mind of a child.Truly a remarkable thing. After this he goes on my list of greatest comic actors.My other favourite thing about this movie (which i found absolutely magical) was exciting newcomer Zooey Deschanel. She was absolutely radiant in this movie. I would watch it again just to watch her. She played William's sister in \"Almost Famous\" who leaves home to become an airline hostess (and plays Simon & Garfunkel's \"America\" to her mother to explain why she must, in one of the movies's best scenes). She also played one of the funniest characters in \"The Good Girl\" - Cheryl who remedies her boredom with her job by insulting customers without their understanding. I've now become a pilgrim of hers, and will follow movies wherever she goes. And believe me, i'm not usually this enthusastic!",
    "135": "If you take it out of the holidays, you may not like it.But for Holiday season, it truly is an instant classic. Much like A Christmas Story, for live action. It just becomes classic to relax and enjoy, and gets you in the mood for the holidays. Fun, spirited.Zooey Daschel as a blonde in the shower...whoop.But it is a fun movie you should share with your children side by side, with A Christmas Story, the Grinch who Stole Christmas (cartoon version) just to get the holiday spirit in you.Isnt that what it is all about? Getting you in the spirit? That was the premise if you watch all the way through.Watch and enjoy.",
    "136": "\"You sit on a throne of lies!\"Elf is one of those rare comedies that grows on me each time I rewatch it. I remember I enjoyed it the first time I saw it, but I love it even more now. Not everyone is a fan of Will Ferrell's man- child character, but seeing him wear those yellow tights and his green elf suit is hard to resist. He is hilarious in this movie and at the same time charming. Elf is not just a comedy that aims for cheap laughs or plays on one gag, it is also wickedly smart and brings out the Holiday spirit in everyone no matter how much of a Grinch or Stooge they are. There are so many great scenes and memorable quotes. The funniest scenes in the film are the ones where Ferrell calls out a fake Santa in the department store where he has been hired, and when he mistakes one of his father's associates (Peter Dinklage from Game of Thrones) for an elf. Those two scenes were great, but there were so many more hilarious moments playing on his confusion. The love story is also sweet and Zooey Deschanel shines in every scene she's in. James Caan plays Ferrell's father (who's in the naughty list) extremely well. Elf has turned into a Christmas classic, but the great thing about these comedies is that you don't need to wait for the Holiday season to enjoy them. Jon Favreau has proved he can direct some great films and he has a great sense of humor. It's been 11 years since it first was released and it continues to be a joyous experience.",
    "137": "I watched this last night as it was on TV and there was nothing on at all last night so I said since we are reaching the holidays I might as well watch it. The movie is similar to Enchanted in a way(minus the animation)and it tells the story of a man who is raised by Santa's elf's and he goes to NYC to find his biological father who is a writer apparently . Buddy(Ferrell) then meets a girl named Jovie(Zooey Deshnail who is a dead ringer to Katy Perry)and becomes smitten with her.I may not be a fan of Will Ferrell but I laughed at a few parts to this movie like the part where he is singing the Baby its cold outside song from Tom Jones and the part where he humiliates his father at work by some guy who he called an elf too LOL that was hilarious.The movie is a bit stupid but I like fish out of water movies as I like how the characters interact with our world and that. I liked some parts to it but the ending was quite dumb. So I am giving it a 6 simply because its nearly Xmas and I like to get into the Holiday season.",
    "138": "(There Are Spoilers) Buddy the Elf, Will Ferrell, never seemed to fit in with his fellow Elfs in Santa's, Edward Anser, workshop at the North Pole. Being a couple of sizes bigger then the Elfs that he lived and worked with at the toy factory Buddy felt out of place and with his overly big hands he was clumsy in making toys as perfectly and delicately as your average Elf. Buddy considered himself to be, to the horror of his fellow Elfs, a \"Cotton-Headed Ninny Muffin\". One day Buddy's dad Papa Elf, Bob Newheart, came clean with the obviously confused Buddy and let the truth come out: Buddy your not an Elf your a Human. Buddy,were told, was left at the steps of an Cathloic Orphanage to be brought up by the Nuns there. One Christman Eve Santa came to town and Buddy slipped into his bag of toys and ended up in the North Pole and was secretly made to think that he's an Elf by Santa Papa Elf and all the Elfs working there. Now with the truth about him and his real dad Walter Hobbs, James Caan, a greedy and unfeeling children's book publisher who's, O' My God, on Santa's naughty list! Buddy crosses the seven levels of the Candy Cane Forest and past the Sea of Twirly Swirly Gumdrops and finally goes through, on foot, the Lincoln Tunnel to the magic city, New York, to finally meet his dad who he never knew up until now. Looked at as \"Some kind of Nut\" at first Buddy's good and child-like nature, as well as his belief in the Christmas Spirit and Santa Claus, wins over everyone that he meets. From his dad Walter to his step-mom Emily Hobbs and younger brother Michael, Mary Steenburgen & Daniel Tay,as well as Jovie, Zooey Deschanel, the girl who he worked with as an Elf, what else,at Gimbel's Depertment Store. Through Buddy's skills as a toy maker as well as his all around good nature he made believer's of everyone in New York City that there is a Santa as well as a Christmas Spirit. Buddy did it with a little help from his newly found and made friends who at first didn't believe him and even thought that he was just a wee bit mentally unstable. Heartwarming Christmas Movie with Will Ferrell perfect as Buddy the Elf who saved Christmas with James Cann as his grouchy but later Santa believing dad. Jovie who has a beautiful singing voice but was too stage frighten to sing in front of people, she only could sing in the shower, was so motivated by Buddy's actions to open up her voice in public at New Yorks Central Park, singing a Christmas Carol, where everyone in the park joined in including Buddy's at first apprehensive dad Walter. This gave Santa's sled the power to lift it up above the clouds and fly higher then it did, with the Christmas Spirit that powered Santa's Raindeer driven Sled in everyones singing the Christmas Carol, for years.",
    "139": "That's the only explanation I have in order to explain why such a sucky, corny and unfunny movie was such a huge hit at the b.o. and now on home video. So many people's brains are so numbed by drugs that something as awful as ELF can easily be considered a classic.What's remarkable is how unfunny and predictable ELF was. I knew things were going to happen several minutes even before they were going to happen (for example, the short writer...). And the film's corny attitude is so overwhelming, I cringed throughout the movie. This film is so corny, it could supply a years worth of high fructose corn syrup for Coca Cola, Pepsi, 7-up, Dr Pepper, Tab, RC Cola, Orange Crush, Kool-Aid AND every Kelloggs cereal in production!!! This film is so divorced from reality that it's unfunny. Yes, it's a fantasy. I'm aware of that but the employees at the mail room of the Empire State building are working on Christmas eve? I mean, come on! And I felt so bad for James Caan.If you like Will Ferrell's shtick, you'll probably like this movie. But for those, like me, who see Ferrell's shtick as something utterly annoying, avoid this movie at all cost!",
    "140": "Good watch, will likely watch again, and can recommend.For all the good this movie has in it, there is a fair amount of annoying as well, which is what keeps it from being a great movie.A family reconnection trope, with a character out of his element trope, crossed with one of the most annoyingly positive characters of all time trope.Ultimately, it's a sweet, hear warming story that really captures the spirit of family, Christmas, and togetherness.It also captures all of the insanity Will Ferrell can conjure up for his character, basically as if he wrote a SNL Christmas special and just rode rough shod over the other actors.The cast does a wonderful job of backing up Will Ferrell, but that's clearly what it is.Around the holidays, especially, don't be afraid of giving this a try, and bear through the annoying bits, because there is likely something really funny just about to happen.",
    "141": "Elf has sort of went off the map in recent years. It's been a while since I watched it, and I wasn't sure if it was going to hold up. I like Will Ferrell a lot, so I have it a try. It's a good one. Perhaps one of the best Christmas movies out there.The movie is about a human baby who grows up as an elf in North Pole. He discovered his real father lives in New York, and sets out to find him. There, he meets his father, and falls in love with another human.This is some good stuff. There were plenty of laugh out loud scenes. I couldn't even say it had any boring parts. The beginning was a little slow though. It was some solid good fun. I guess everyone else in the cast was secondary to Ferrell, but they all did well. When I thought the collaboration between the elf and his business minded father would suffice the entire story, suddenly new subplots arose that were even more satisfying.Great movie. A must see7 stars",
    "142": "I'm starting to think that there are dumb comedies and smart comedies. The \"dumb\" ones typically I cannot stand and usually fall into the banal (Farelly brothers) or ride one joke to exasperation (\"Romy and Michelle's high School Reunion\")This is a pretty good dumb comedy. One that thankfully gets by on a single belch, a little \"tasteful\" vomit and a urine joke that spears asparagus. Instead it relies more on us liking and maybe even identifying with an \"idiot\" who is more childlike than clueless.The more Will, the more power it has...especially when we get detours from the required plot landmark visits. Scenes like... -   Will running around New York city waving at a guy hailing a taxi, swapping pamphlets, etc... -   Will hitting the \"maple\" in the mail room...making a best friend -   Will getting a DNA check at the doctor's (director Favreau)That last section may have been the funniest to me, as it felt the most free... I suspect some of that was just plain improvised based upon the props on the set??Overall of course 99% of this was scripted, but whenever a film can at least feel like the comic is just riffing, that is a key for me. (And I think it is where Eddie Murphy's career evaporated...)Certainly this film is well planned out, but to its credit (and largely to Ferrell) it does have a looseness. If you enjoyed Ferrell on SNL, you should likely be able to find humor in this. Or if you like tromp l'oiel this has some nice bits... Some of the other grandiose reviews on this (lauding Asner, for what exactly?) might unjustly inflate expectations. Product placement was a little heavy here, I wish they'd skipped that and just not spent the money on the CGI sleigh ride from the four horsemen/orcs of the central park rangers. The ending of the film suffers as many comedies do, it's the time when everyone has to pass their papers to the front.Favreau is a sharp and gracious fan of film (from his IFC show) and Ferrell is funny as a stand-up sort of everymoron. 7/10",
    "143": "Before his first debut in the superhero genre starting with the first two Iron Man films, he directs a Christmas comedy known as \"Elf\" starring Will Ferrell and James Caan.It's about one of Santa's elves named Buddy who learns of his identity as a human and goes to New York City to find/meet his father and teach him the true meaning of Christmas in world of wacky cynics.As far as Christmas movies go, this one successfully details the Christmas feeling quite perfectly. The actors are brilliant. James Caan did a good job as Buddy's father, but I think that the best performance goes to Will Ferrell for his portrayal as Buddy and successfully gives out his hilarious comedic moments. The rest weren't that bad either especially Bob Newhart, Mary Steenburgen and Ed Asner. The jokes in this movie are hilarious including the \"He's an angry elf\" part and the directing from Jon Favreau was surprisingly good.My biggest complaint about this movie was the ending which felt too cheesy for my taste and in the third act, there were barely any jokes near the end of the film including it's atrocious dialogue, but I think the story was wonderful that boosts up the character development and it's not a complaint.Elf may not be excellent, but I'm sure it would be known to fans of Jon Favreau as a Christmas classic for children young and old.7.6/10",
    "144": "This film has become a sort of modern day Christmas favourite and it is not hard to see why. It has all the magic, heart and humour that makes a perfect Christmas film.Throw in a good script, Santa and a twist on A Christmas Carol and it is clear why this film has endeared itself to so many people.The cast are good - Ferrell may be the star name but James Caan and Ed Asner are all good in making their roles add something to this film. The whistle stop romance is rushed but very sweet and there is enough visual humour to entertain kids while also being verbal enough to make their parents smile.If any modern Christmas film has a chance to be a classic that is enjoyed every year it is this one, because it has all the magic ingredients, and appeals to so many.",
    "145": "Jon Favreu and Will Ferrel as a director/star combo is a good premise and execution here in Elf, as they create a film that assuredly works for the whole family.  This is because the film is as much directed towards fans of Ferrel from Saturday Night Live (which ranges with both sexes from little kids to people in their middle ages) as it is towards those looking for the holiday spirit.  Bottom line is, he makes the movie fun to watch, among a cast of well knowns (the likes of Bob Newhart, Ed Asner, Mary Steenburgen, Artie Lange, and Andy Richter pop up, and James Caan has a better than average supporting role).  Here, Ferrel plays Buddy, a man who's grown up adopted in the North Pole.  Raised by Elves, it pains him to find out that he isn't one, and that his father didn't even make Santa's 'Nice' list this year.  He decides to seek him out in New York, and has a brief stint working in a department store, followed by the mailroom of his father's office in the Empire state building.From what I described of the plot it sounds a little routine, and it is, but there are some things in the story that are inspired, though most of the joy in the film comes from Ferrel's Buddy.  Some might take his performance as over the top or lame, however I think he finds just the right bit of gleeful un-awareness at what he does, good and not so good, and there are a few real howlers too.  Best scene- Buddy confronts the department store Santa in front of the children (this is a near draw with the scene in the recent Bad Santa where Billy Bob beats down the plastic reindeer in the store).  Only the last part of the film, the Christmas Night bit, doesn't work at all.  A nice little Christmas comedy, which can be seen after the Holidays too. B+",
    "146": "Elf is already one of the most popular Christmas movies of all time, so in a way, this may already be kind of a pointless review. But I am going to review it anyway, since I haven't before, and this can be for the people who haven't seen it, or the people who may want to revisit it.Elf stars Will Ferrell, playing an elf named Buddy. When he was a baby, he snuck into Santa's bag while living in an orphanage and ended up in the North Pole, so one of the elves offered to raise him.As Buddy gets older, he learns that he still has a father (played by James Caan), and feeling like a misfit at home, he decides to go to New York to see him, only to find that there is little Christmas cheer there. Not for long...To start with praise, this is a really fun movie with my iconic scenes. Mention Elf to someone and see what they quote. They may say: \"World's Best Cup of Coffee! Great job everybody!\" or \"I'm in a store and I'm singing\", or \"He's an angry elf!\", or even: \"Oh, wait, I forgot to give you a hug!\" This may rank with It's A Wonderful Life as one of the most quotable Christmas movies of all time.Because of the lines I've mentioned and the goofy situations Buddy gets himself into, Elf is also a very funny movie. While writing this, I took a break to read the Quotes section on IMDB and found myself smiling and giggling at the favorite lines of others. Even now, the humor still works overall.Elf also contains many great actors. Will Ferrell is a mixed bag for me, I like some of his work and some of it I don't. However, Elf is easily one of my favorite of his works. James Caan does a fine job as his Dad, who is a grump at Christmas Time. Although, it makes it kind of odd (in a funny way) to later see him in a movie like The Godfather or Misery later on in life.Actors like Zooey Deschanel, Ed Asner, and Bob Newhart do great in their parts, as well as the other actors. Jon Faverau, the director, even has a cameo as a doctor and a Narwhal. (\"Bye, Buddy! Hope you find your Dad!\") And to think in 5 years he would direct Iron Man!Despite the charm Elf has, I do have an issue with it now as an adult who grew up on this movie. Let me explain:This movie came out when I was 5, and there is no way to count the amount of times I have seen it in the last 18 years. My uncle had the DVD, and most Christmases included watching it, up until I was about 12. Let's assume that's 6 Christmases, since we may not have watched it EVERY year. There were a few times I saw it at school before winter break, let's say about 4 times.I also got the movie on DVD for Christmas when I was 11 or 12, but I think I used that DVD once. I also have a friend who owns it and we've seen it twice together. That alone makes for about 13 viewings that I can remember, again in 18 years.That is where my \"flaw\" with Elf comes in. There's some movies I can see again and again, and as I have gotten older, I have realized that this isn't exactly one of them.It's still a fun movie, but for lack of a better term, my viewings of Elf are somewhat tainted due to how many times I have seen it. For example, when I was a kid I used to find this funny:\"Okay, everybody, Santa's coming...\"\"SANTA! OH MY GOSH!... I know him!\"Which is cute and all, but I dare you to watch that a dozen times in a row and not get annoyed. That is how that scene feels now, kind of.Does that make it a bad movie? Not at all. I just don't have the same appreciation of it as I did in say, elementary school.On that note, Elf released in theaters on November 7th, 2003. One of my favorite Christmas movies, Love Actually, happened to be released on the same day. I have gladly seen that about 5 times, it's that wonderful and charming. Elf doesn't quite do that for me on that level.So do I recommend Elf? Of course. I'm not a Scrooge or a Grinch for crying out loud! But I would have higher suggestions for Love Actually, It's A Wonderful Life, Scrooge from 1970, Prancer, and other personal favorites.I will most likely see this more times later on, and I'm okay with that. Is it one of my favorite Christmas movies? Not exactly. Is it still a good time? Yes. Elf is like Buddy's favorite food- spaghetti with syrup and sprinkles. It's super sweet, but not to be digested in large amounts.Note: This is intended to be the first of 25 Christmas reviews- one posted a day.",
    "147": "Elf is a throwaway comedy in which it feels like the actors aren't really trying. Every line is flat. The first 20 minutes of the film is in narrative format. Narrative is a crutch for a writer, it's the opposite of \"Show, don't tell\". There is something really off with the pacing.And the bits with Bob Newhart looking sad and unenergetic are really boring. How can anyone find that funny? It shocks me deeply. Maybe the film picks up (as Star Wars I: The Phantom Menace did after the first 20 minutes). But I didn't get that far. I like the occasional kids film but this one was awful. For Will Ferrell films, see Anchorman instead.Who should see Elf:-- Kids only, and maybe not even kidsI'll give Elf a 4 out of 10 which is the highest rating I'll give a film I couldn't sit through all the way.",
    "148": "As the delightful human who was raised by elves at the north pole, Will Ferrell, the greatest new comic actor out, walks a fine line between satire and genuineness.If he played Buddy completely for laughs, the movie would not imbue the audience with christmas spirit, and make us forget our doubts for a magical hour and a half.If he played Buddy completely subversively, poking fun at the christmas myth, adults would perhaps have had a few more laughs than they did.The reason Ferrell's performance is one of the best comic performances in recent memory, is that it serves both these purposes: there is a hint of satire in Ferrell's over-the-top enthusiasm, yet the innocence on his face appears absolutely genuine. One of the greatest sources of humour in the movie comes from actually believing Buddy has the mind of a child.Truly a remarkable thing. After this he goes on my list of greatest comic actors.My other favourite thing about this movie (which i found absolutely magical) was exciting newcomer Zooey Deschanel. She was absolutely radiant in this movie. I would watch it again just to watch her. She played William's sister in \"Almost Famous\" who leaves home to become an airline hostess (and plays Simon & Garfunkel's \"America\" to her mother to explain why she must, in one of the movies's best scenes). She also played one of the funniest characters in \"The Good Girl\" - Cheryl who remedies her boredom with her job by insulting customers without their understanding. I've now become a pilgrim of hers, and will follow movies wherever she goes. And believe me, i'm not usually this enthusastic!",
    "149": "If you take it out of the holidays, you may not like it.But for Holiday season, it truly is an instant classic. Much like A Christmas Story, for live action. It just becomes classic to relax and enjoy, and gets you in the mood for the holidays. Fun, spirited.Zooey Daschel as a blonde in the shower...whoop.But it is a fun movie you should share with your children side by side, with A Christmas Story, the Grinch who Stole Christmas (cartoon version) just to get the holiday spirit in you.Isnt that what it is all about? Getting you in the spirit? That was the premise if you watch all the way through.Watch and enjoy."
}