{
    "0": "The movie does well to portray the Field Marshal's life and everything he went through. The acting by Vicky Kaushal is top-notch, he perfectly embodies the character. However, the movie left me disappointed because it felt very shallow. It's as if the writers wanted so badly to cover everything that they ended up covering nothing. At no point does the movie feel intense or engaging at all. The 1971 war between India and Pakistan is a major moment in history and the Indian victory was largely because of Sam Manekshaw. For some reason such a crucial war sequence is completed within 7-8 minutes of screentime like it wasn't the character's most important contribution. Also, Indira Gandhi is portrayed as a feeble tiny woman in the movie with the representation nowhere close to the stature she had. Filmmakers in general need to stop chasing petty laughs and comedic reliefs. I want to be thrown at the edge of my seat when i pay for your movie, I don't want to hear low-effort jokes made by the protagonist's house help. Overall the movie is definitely worth a watch but its wasted potential is what frustrated me.",
    "1": "Awesome portrayal of character of real life war hero by Vicky Kaushal. Outstanding performance and perfect storytelling by the writer. Let me tell you guys Vicky Kaushal didn't act in this movie because the way he walked, the way he talked, his eye movement, body movement, etc etc list is endless, it seemed that Manekshaw sir himself, was acting on the screen. Fantastic Vicky Kaushal and thank you for making us the proud Indian once again and for making us feel lucky to be born in a country which has bred bravehearts like Manekshaw sir. He was a real hero and you portrayed that character and done 1000000% justice to that. Kudos to real hero as well as reel hero.",
    "2": "Amazing, excellent, brilliant, these are the only things that you will gasp after seeing Vicky Kaushal in this awesome epic.If you did not get a chance to know Sam Manekshaw, this film will do the job for you!! My Soldiers want to win, we want to WIN!! The dialogue delivery is emaculate, the conduct is worthy of being a field marshal, no words to explain the kind of work Vicky has done, this is a true blockbuster and not the one to miss, best watched in 2D and on IMAX/big screen if you can. The film is about personality so 3D is not what you want. Go for it, don't miss this performance or you will regret having not watched it on bif screen.",
    "3": "Sam Bahadur is the best Indian film of the year, a masterclass biopic drama of one of India's most important personality. This can also be seen as a historical war film and does have documentary elements. Vicky Kaushal is sensational in the lead role of Sam Manekshaw, he completely embodied the personality and body language of him, the hardwork of his preparation for the role shows on big screen. Meghna Gulzar's direction and screenplay is top notch, cinematography is beautiful, soundtrack blends well with the movie. I hate to say that Indian critics have no respect for this kind of cinema they heavily underrate it and ignore it, all they want is popcorn entertainment, ignore them.",
    "4": "In the days of cinema with adrenalin rushing over the top action sequences & violence, this movie brings a sense of nuance that let's you leave the theatre with a sense of pride about the country. This movie must be watched by every youth in the country and imbibe skills such as discipline, ethics & unity that the Indian armed forces exude. Overall this is a very feel good movie. Vicky Kaushal as Sam Bahadurji & Fatima Sana Sheikh as Indiraji are stand out performers to remember. Vicky Kaushal especially has done a remarkable job to imitate the character he plays and I won't be surprised if he gets the National award for his role.",
    "5": "\"Sam Bahadur\" unfolds as a riveting tribute to India's first Field Marshal, Sam HFJ Manekshaw, MC, brilliantly showcasing the legendary Army General's remarkable journey. The plot gracefully weaves through crucial historical chapters, from World War II to the Sino-Indian War, culminating in the pivotal 1971 Indo-Pakistan conflict that led to the creation of Bangladesh. The film pays commendable attention to detail, meticulously depicting Manekshaw's illustrious career, which played a pivotal role in shaping India's borders. With a focus on authenticity, the narrative captures the essence of the no-nonsense Army Commander, affectionately known as 'Sam Bahadur' by the soldiers he led. The dynamic life of this military luminary is presented with finesse, offering audiences a compelling cinematic experience that celebrates a true hero and his indelible impact on India's history.",
    "6": "This movie is truly an inspiration for this generation. The storytelling, attention to detail, wittiness and sense of humour of Sam Bahadur has been captured by Meghna Gulzar so well and adapted by Vicky Kaushal with such class, he's definitely the chosen one!What I loved the most about the movie is Sam's personality and sense of humour, there was something endearingly real about it, the man stood strong on his principles and his army. He was a true leader & most importantly, a gentleman and it doesn't surprise me that till date, the Indian army looks upto Sam Bahadur.This movie will evoke all the emotions of patriotism - I had goosebumps watching it and this is by far the best tribute given to an Indian army officer.",
    "7": "Vicky Kaushal has nailed the character of Sam Bahaudur Maneckshaw with his look and mannerism but I think talking could be better as I have watched Sam Maneckshaw's interview. The film depicts his life nicely but Meghna Gulzar lost the opportunity to make this movie more engrossing since it has shown war in it.I also expected real Sam's old interview in the end. In spite having Gulzar and Shankar Ehsan Loy's combo we don't have any memorable song in the movie expect Badhte Chalo. Fatima Sana Sheikh looking too young as Indira Gandhi although her mannerism is same.All other characters has not given much importance.",
    "8": "The film is a worthwhile watch. On a scale from zero to five, I give this film a five. The film literally brought tears to my eyes. I highly/strongly/definitely recommend the film. Great movie,great national hood and great character as Sam Bahadur. One of the Indian army soldier who given services to various era like British army, Indian army and others.Dear all this a great character movie please go and watch this movie.This movie showing a drama ,war and other army rules .So I will give 9 star out of 10 .the screen play amazing ,direction great and dialogues are superb.Santosh yadav.",
    "9": "Sam Maneckshaw was one of the two Field Marshals who served the Indian Army. The director did a very good job and so did Vicky Kaushal. Vicky tried to emulate the legend in every possible way from the way Sam Sir used to talk, walk and behave. A lot of research has gone into making the movie which was clearly visible in the movie. Considering the limited time of 2 hrs 30 mins , the director only could show only the most relevant aspects of his life. There could have been many such moments in the Field Marshals real life which were indeed inspiring and needed to be brought to reel but must have been left out. The makers may have considered the option of making a Web Series out of his achievements. It is stranger that fictional characters get showtime of 3 hrs 30 minutes these days while legends only get 2 hrs 30 minutes of screen time. Great work by the entire team involved beginning from Mohd. Zeeshan Ayub to Fathima Sana Sheikh and Sanya Malhotra. The movie had excellent punch lines and humour too.",
    "10": "Watched SAM BAHADUR today. It's brilliantly presented by Meghna Gulzar. But what stays with you is the superb performance of Vicky Kaushal. There is not a single frame where you see Vicky Kaushal, but only the character of Sam Makeshaw played by him, he makes it too believable. He is probably going to win every best actor award next year for a Hindi movie. It's a tough movie to make by a creator as to what not to show from Sam's 40 illustrious years in Indian army, but instead of turning it into a plain vanilla biography, Meghna Gulzar has picked some of his top/well known achievements and scripted it into an enjoyable visual treat. Totally recommended viewing!! Do yourself a favour by watching it only on the big screen or you won't \"feel\" this gem of a movie.",
    "11": "Picture so slow..dialogue delivery not good...storyline should be better..Legend Sam bahadur was great achiever..but created movie so poor...don't watch..\nPicture so slow..dialogue delivery not good...storyline should be better..Legend Sam bahadur was great achiever..but created movie so poor...don't watch..\nPicture so slow..dialogue delivery not good...storyline should be better..Legend Sam bahadur was great achiever..but created movie so poor...don't watch..\nPicture so slow..dialogue delivery not good...storyline should be better..Legend Sam bahadur was great achiever..but created movie so poor...don't watch..",
    "12": "Man, the level of respect and love this guy has for his craft is beyond words and it's clearly visible through the film. Brilliant acting, a SOLID 10/10 for that! Especially because, it takes a lot to portray a real life character, unlike frictional characters where you can improvise. You really have to get into the soul of the person to understand the character and boy-o-boy has Vicky understood the assignment. All HEART for Vicky!!! He is a star and Hindi cinema needs to realize his potential.You know it's a great direction if it's Meghna Gulzar. She never disappoints. Overall a great movie.Vicky Kaushal has to win a National Award for it! Period.",
    "13": "From a Army chief(takes 9 bullets onto his body) to field marshal its a honorary tribute to Sam manekshaw,the film potrays untold story of one the finest person who played a pivotol role during bangladesh Crisis...\nA notable national award worthy perfomance by Vicky who does effortlessly potray a real life character with dedication,dictation & embodying mannerism proves he his one of the methodical actor...\nAlso the film explores the relationship with general yahya khan & Indira gandhi clearly shows the multi-dimensional persona of comic sense,care towards fellowship & efforts during anti-indian sequence makes us remarkably authentic...\nZeeshan ayub(yahya khan) govind namdeo(vallabhai patel)&neeraj kabi(nehru) are noteworthy performance adding grace to the flick...\nWhile shankar loy ehsaan music brings out the patriotism from the deep blood lively...\nOverall a must see movie to register the heroic efforts of the person built one of the strongest defence system of the world.",
    "14": "Plese watch ..can't remember the last time I wrote a review on IMDb, but here I am compelled to share my insights. I got into this movie purely for my love and respect for the Indian army (or military, in general). Also, the fact that it stars Vicky Kaushal, who was brilliant as Sardar Udham and in Uri. And god, did I enjoy this? In simple words, it's an excellent movie shot wonderfully and the team at work captures elements quite exceptionally. This isn't your typical Bollywood drama. There aren't any high-octane action sequences, and neither are there any songs that could pull audiences. It's a slow-paced narration of.",
    "15": "As a frequent admirer of military anecdotes I have read a lot about Manekshaw and I could easily tell that this movie is based on the incidents shared by Manekshaw to his Grandson in the famous interview.Overall I liked the movie, there were some parts that really gave me goosebumps while others that cringed me a little. Vicky Kaushal's portrayal of Manekshaw is one thing that is a huge plus in this movie, Kaushal mimicked Manekshaw's posture, gait, facial expressions, communication style and\noverall body language. We could feel that there is this man of strong commitment on the screen, but, I was not satisfied with how other co-cast were presented and I am disappointed especially with the portrayal of Indira Gandhi. Indira is a strong and passionate lady, who led India through tough times taking tough decisions but she was portrayed as a timid damsel in distress almost always relying on Manekshaw for all her solutions. I understand that her character had to be largely squeezed down to just her interactions with Manekshaw but she didn't convey her role. Not to the criticism of the actress (Fatima Sheikh), it was a deliberate decision.Other thing that really cringed me out was the weird workplace romance showed between Mankeshaw and Indira and to make it worse was the reaction of Mrs. Manekshaw to this whole situation as if being jealous of his work wife. The normal leg pulling was shown as an uncanny romantic tension between the two, which were strangely intiated from Indira Gandhi's side.To talk about the overall storytelling, the plot, I had visited before, due to my interests so I am giving it the benefit of doubt that the story was not grasping me as it would others because I already knew all the anecdotes so there was no surprise to me. But I hardly felt the tensions and difficult situations that Manekshaw was in. This was due to extremely rapid pace of the movie. There was not enough screenplay of isolated incidents for people to dwelve into the situation and develop the same tension, thus, the grip loosened.There were some instances like when Sam proposed to Siloo, and in the next few scenes they have a baby, awkwardly quick. There were similar instances throughout the movie and altogether there were a lot of skip.What would have been better is a TV Series of 6 episodes showing each of his major achievements in each episode instead of a sprint of 2 hours.",
    "16": "The movie covers the biopic of India's first field marshal Sam Manekshaw and beautifully describes his journey without politicising, spreading propaganda and also showing the hardwork and sincerity it took by our leaders be it in the army, government to shape our nation. The movie covers how everyone on both sides of India and Pakistan suffered through partition and also how the Indian Army was under its greatest leader unlike today! Highlighted key areas of give respect to get respect, how earlier government and central government agency like the Army were respectful and focused on working together without demeaning the other under great leadership unlike today.",
    "17": "Outstanding performance by vicky Kaushal what a showcase for the legendary Marshall Sam manekshaw, sometimes we feel apart from the Bollywood stories where we are enlightened by patriotism with such intelligence script shown on the real heroic efforts given by someone to save the country and serve their life for the people of country , the movie truly did more than justice to his efforts , hope you all will appreciate what vicky Kaushal did is a true acting sport the director has also given his best to prove what capabilities they have , three cheers for vicky specially his walk ,his dialogues were so real it gave goosebumps.",
    "18": "Worst screenplay\nWorst acting by hero,\nThat actress who played Indira Gandhi\nShe made Indira Gandhi character so dull but in reality Indira was never\nIndira Gandhi role lacks confidence before Sam manikshaw role\nDirector has added his masala to change history\nEvery character has a strength but in this movie overemphasis on hero only like Salman Khan fictional movies\nArmy vs politicians\nThey show army above\nIn army hero is above all.its a documentary movie truth must give importance over masala\nWhy Bollywood fail because even in this also they try to create their own masala\nWorst documentary movie I have ever seen.",
    "19": "The movie goes along at a swift pace and does give you a good glimpse of what Sam Manekshaw was made of. It's a realistic depiction of how the Army is and is a treat to watch how effortlessly Meghna Gulzar & Vicky Kaushal tell this great tale of courage and valour while keeping the humorous side of the character intact.Decent performances by the other actors too, while in my view the movie is pivoted by Vicky's performance as it should be. The depiction of a defence leader who was able to connect on an individual level with thousands of troops under his command has been captured beautifully too.Definitely recommend this one - worth the time.",
    "20": "Sam Bahadur is a classic. Great work by Meghana Gulzar. Vicky kaushal as always is immaculate. Mark my words viky along with pankaj Tripathi, Nawazuddin are some of the finest actors of current generation. He morphed into the character of Field marshal Sam Maneckshaw like a shape shifter. I'm no critic but I know a good movie when I see one and Sam Bahadur is right there at the top. All the negative feedbacks seem fake. Its a surprise to see a stupid movie like Animal roar past a masterpiece like Sam Bahadur. This simply is among some of the finest movies that I've seen and I've been seeing them for quite sometime now. Well-done!",
    "21": "Vicky as a Sam is the most beautiful thing about this movie. Apart from this a lot of hurry and director seems to depict every thing about the sam, which looses the grip and turns into a documentary more than a cinema. Scenes are not connected well together makes unaware viewers confused. No other character impresses other than Vicky kaushal. Sanya as a wife has nothing to do much and looks too young for the wife of a retired Field Marshal. Fatima Sana as Indira Gandhi disappoints most. Such a great aura of indira Gandhi could not be depicted in movie a looks pale throughout the movie.Can watch if you are a Vicky kaushal fanboy.",
    "22": "This is a hotel room movie. Is room se us room. Is scene se us scene. Real war clippings yaha waha. Baaki sab sasta maal tha sweety. I swear you will feel like ye kya tha yar ye picture hai, is mai itna real clips hi daalne hai toh film kyu banayi, theatre mai ek meetup rakhte ki bhaiyo beheno aao, lets me show you our country's best soldier and sell you popcorn while i show you some clippings.Performance of everyone was good. No complaints but i expected to see more war filming than seeing clippings. Its a movie, enact it. Presentation nahi chahiye tha.But sound design was good. Liked it in Dolby. Also if you emotional like me then you will break a tear once in a while during the movie. Some light humour may shock you any time, be ready ðŸ‘»",
    "23": "Speechless. Complete masterpiece. Hatsoff to everyone especially Vicky Kaushal and co-staff. Keep up the good hustle guys!!A must watch movie for everyone. Animal is just a hype and it is actually a wonderful movie.You should watch it atleast once because in Bollywood we rarely watch such masterpiece. Meghna Gulzar direction and cinematography also outstanding. Every characters are good in this film.Manekshaw's actual service period was long and they tried to add almost all of the journey in movie and now it's time to create a web series based on this legend with same caste and direction team and it will rule on web series too. Mark my words...",
    "24": "The charector of Sam Manekshaw is good , but the incidents and the storytelling has been too fast for the viewers to grasp . Casting too seems a bit off the track except for Vicky Kaushal as Sam , everybody else seemed just to fill in the voids and not for the particular role . The war scenes have been intense but a bit fast .The cinematography doesn't much good for a film like these. All the scene are bit dull to explain the significance of the said wars . The dialogues were well written and Vicky Kaushal as Sam Bahadur is very realistic to watch .The film has also themed on the political aspects of war and also presented a description of war and the scapegoat politics around it . The honour and valour of military has been suitably mentioned. Overall a good movie without any drama .",
    "25": "We have watched the movie on 03 Dec 23. It's an excellent, fantastic and superb movie to watch with family. All the actors have performed extremely well in their cast role, especially Vicky Kaushal's role as Sam Bahadur was amazing and awesome. It's an evergreen and must watch movie. This is a one of the best movie ever I seen. It's a completely patriotic and thoroughly entertaining movie. Wonderful and fantabulous. ðŸ’¯ % credit to the director for well direction and creating dramatic situation through out the movie. We have enjoyed a lot. In Hindi it's a Paisa Wasool movie. VERY WELL DONE BY ALL.",
    "26": "The overall film is good. The character development of Field Marshal Sam Manekshaw seems very satisfying. Vicky has indeed done a great job. The background music hooks the audience, and cinematic experience is superb. The run time could have been longer with few extra details that have been missed.Talking about the story, it feels more like a timeline of events rather than the journey of life. Fatima looked a little weak for Iron Lady. The supporting cast did their jobs well. The dialogues were crisp and impactful. The action sequences felt realistic though. The few punchlines did a great job in lightening the tension built.Not every audience would find it worthy to watch, and a hard time keeping up with events. I personally had a lots of expectations from it and to he honest, it met many of them.",
    "27": "The movie describes the key points of Late Field Marshal Sam Manekshaw however story cannot be summed up in 2.5 hours. The movie zips past his high and lows in a hasty manner but is on point. Brilliant acting by Vicky Kaushal and a near perfect enactment of Late Field Marshal Sam Manekshaw. The background score does justice to the movie as well with some decent acting by the supporting cast of the movie. There were a few low points which were boring however overall the movie is a good one time watch. Also due to less screen time a lot of his achievements and life instances were missed in his biopic. Hence I strongly advocate for a web series depicting his life.",
    "28": "The movie is well crafted with great direction and acting depicting the story of Field Marshal Sam Manekshaw. The cast is well chosed. Gives us the close insights of the pre-independence and post-independence events in the Indian history and the role of the Brave Sam Manekshaw in the Indian Army.Meghna Gulzar has done great work by studying all the events and the sets look too real if you check the photos on internet.The movie currently has less bookings as it is completing with Ranbir Kapoor's Animal but the movie is worth spending money and time for.Do consider to add the movie in your watchlist.",
    "29": "So there are two was to look at this movie. If we watch it as a biopic documentary then it's a classic good acting by Vicky Kaushal. If as a entertainment movie then i wouldn't recommend watching it. The movie should have more action all the family scenes could have been avoided. It should have talked more about the actions, of Marshal Sam Manekshaw. If it's an Army man's biopic it should tell more about his army exploits. Many more could have been told and depicted in the movie. Actors are depicting theirs roles very fine and no complaints there. Overall a nice tribute to Marshall Manekshaw. Good.",
    "30": "Vicky has outdone himself...great acting by all supporting stars. The story went through several turns and could not make an impact. It is true it was not possible to cover the long career of Sir Sam Manekshaw. The director tried to cover too much and could not do justice to all plots except a few.Let's hope we get to enjoy similar movies with a better direction. I don't have much to write...so just copying the above text.Vicky has outdone himself...great acting by all supporting stars. The story went through several turns and could not make an impact. It is true it was not possible to cover the long career of Sir Sam Manekshaw. The director tried to cover too much and could not do justice to all plots except a few.",
    "31": "Movie was really good it's about biography of Sam\nFirst Indian army field marshal\nVicky kaushal acting was superb exactly matched with real Sam\nI enjoyed a lot in the first day show\nWhenever Vicky come in the scene it's like we don't blink our eyes so that we can't miss any moment\nOne one dialogue by Vicky was really good n superb specially when he deal with politician n his answers to them.Overall very good movie n acting done by full team\nAnd want this type of film every year atleast two/three about any defence forces related Army/Navy/Airforce.Kishan Bhattacharjee\nTripura, Agartala.Northeast.",
    "32": "Vicky kaushal did a great job. Its would have been great to see more action and war scenes in the film. Neeraj kabi as Nehru Ji and Fatima Sheikh as Indra Gandhi were looking pathetic in the character also their makeup and costume were badly done. Casting could have been better for the prominent character's in the film. Yahya khan played by Zeeshan Ayyub was perfect though he was unrecognisable. Sanya Malhotra played her character beautifully and was fun to watch. 10/10 for Vicky Kaushal but overall i feel the movie is 6 out of 10 for the lack of detailing in the character artist and screenplay.",
    "33": "2 hour 25 minutes is not enough to show what Sam Bahadur has achieved in lifetime but you don't regret it after watching. You can sure see the character growth through out the movie you witnessed that after each event how Vicky kaushal changed his acting as Sam Bahadur was brilliant no doubt in that other actors such as zeeshan, Sanya, Fatima had delivered sincerely there role . Meghna Gulzar has captured the essence of every time period either it was pre indipendence or post indipendence. Music of movie flows like river very smooth which makes you at peace, cinematography was beautiful as it should be\nAny one can't capture the whole glory of Sam Bahadur but it was at best one should surely watch it once.",
    "34": "I rarely review movies but it's worth for this one. Narration, story flow, acting, humour, romance, emotion everything single aspect finds a perfect balance in this movie. Bollywood needs such movies to revive and get it's image back.It's a proper family entertainer and I would watch the movie again on OTT. Vicky Kaushal has taken his character to next level and while watching you cannot actually recognise him. You will only see Sam.Not sure the breakup of real vs cooked up for entertainment but you might learn a bit history as well. I strongly recommend this movie for all. Completely worth the watch and your time.",
    "35": "This movie had everything, just lacked quality songs to tintilate the \"Pathan\" generation to get them to watch this masterpiece over \"Animal\". Can't think of any reason why this movie is struggling to cross 100crs after over a week of releaseSalute to Sam Bahadur, the ultimate solider that country needed during its toughest 3 decades. Cast and performance was on point, Vicky kaushal did great justice to the role by making each of his body part act the way it should (especially his eyes). Also a great history revision for our brainwashed generation that has grown up only reading about the great mural rule and nothing else about country's history.",
    "36": "Vicky Kaushal and Meghna Gulzar bring Sam Manekshaw to life and also the key players of those times. Vicky Kaushal was amazing in his portrayal of Sam Bahadur which reflects the class of actor he is. A heartwarming and overwhelming experience of the times gone by especially the depiction of the partition period and the three wars. Zeeshan Ayub as Yahya Khan was flawless as always and provided depth to the character. Fatima Sana Sheikh and Sanya Malhotra also carried their characters well. A wholesome experience least to say. A well deserved tribute to the great soldier Field Marshal Sam Bahadur.",
    "37": "The movie aims to show the audience the \"Man\" in \"Manekshaw\". Devoid of unnecessary mass scenes and cliche dramatics, the story focuses on the real life story of India's finest war hero.Vicky Kaushal's performance as usual is fantasmal. Just like in Sardar Udhham Singh, I felt like I was watching the real Field Marshal on screen. Kaushal will make you go places you've never been, will make you see the world through the eyes of Sam.This movie is a classic work of art and will always be remembered for many years to come. I'm sincerely relieved that Bollywood hasn't lost the real art of sincere storytelling.",
    "38": "Vicky Kaushal's outstanding performance in Sam Bahadur indeed captivates the audience, making it an unparalleled cinematic experience. Meghna Gulzar, the director, skillfully weaves a narrative that complements Kaushal's brilliance, contributing to the film's overall excellence. And as for the dialogue \"I'm okay, Sweetie,\" it adds a touch of emotional depth to the characters, enhancing the movie's impact.Additionally, the soul-stirring songs further elevate the emotional connection, resonating deeply with the audience's hearts and enhancing the overall cinematic experience. Sam Bahadur is a masterful blend of authenticity and emotional depth, making it a standout in contemporary cinema.",
    "39": "This is indeed a Masterpiece movie created by meghna, vicky Kaushal & other actors. Yes Vicky kaushal nailed the character of first First field marshal . He played the character very well that after a while one wouldn't realise that you are not watching Sam Manickshaw , He was just perfect . This is a Must watch movie for all age groups , very well written & directed .... After a long while a excellent movie with wonderful scenes from history well drafted script , story is created that will make you feel proud and motivated. It's definitely worth spending time & money to watch it . .. ..... don't fall/ compare other movies like Animal they are utter trash.",
    "40": "Starting from the Birth of \"Bahadur\" till the end it was just tremendous. And the Acting of Vicky was a 'Copy that' command of Sam. The dialogues which are used in the movies are also entertaining and it is a Movie for the Army Lover.Into the movies it was also shown the British Army and the Partition of the India and Pakistan. How Sam acted upon the situation of East Pakistan. Even the FM Sam (Vicky) also motivated each and every troops for the so as performed in the Movie.It inspires and motivate many if it is being shared each an every place.An Indian must watch movie of their historic heroes. Jay Hind !!!",
    "41": "This is a hotel room movie. Is room se us room. Is scene se us scene. Real war clippings yaha waha. Baaki sab sasta maal tha sweety. I swear you will feel like ye kya tha yar ye picture hai, is mai itna real clips hi daalne hai toh film kyu banayi, theatre mai ek meetup rakhte ki bhaiyo beheno aao, lets me show you our country's best soldier and sell you popcorn while i show you some clippings.Performance of everyone was good. No complaints but i expected to see more war filming than seeing clippings. Its a movie, enact it. Presentation nahi chahiye tha.But sound design was good. Liked it in Dolby. Also if you emotional like me then you will break a tear once in a while during the movie. Some light humour may shock you any time, be ready ðŸ‘»",
    "42": "Speechless. Complete masterpiece. Hatsoff to everyone especially Vicky Kaushal and co-staff. Keep up the good hustle guys!!A must watch movie for everyone. Animal is just a hype and it is actually a wonderful movie.You should watch it atleast once because in Bollywood we rarely watch such masterpiece. Meghna Gulzar direction and cinematography also outstanding. Every characters are good in this film.Manekshaw's actual service period was long and they tried to add almost all of the journey in movie and now it's time to create a web series based on this legend with same caste and direction team and it will rule on web series too. Mark my words...",
    "43": "The charector of Sam Manekshaw is good , but the incidents and the storytelling has been too fast for the viewers to grasp . Casting too seems a bit off the track except for Vicky Kaushal as Sam , everybody else seemed just to fill in the voids and not for the particular role . The war scenes have been intense but a bit fast .The cinematography doesn't much good for a film like these. All the scene are bit dull to explain the significance of the said wars . The dialogues were well written and Vicky Kaushal as Sam Bahadur is very realistic to watch .The film has also themed on the political aspects of war and also presented a description of war and the scapegoat politics around it . The honour and valour of military has been suitably mentioned. Overall a good movie without any drama .",
    "44": "We have watched the movie on 03 Dec 23. It's an excellent, fantastic and superb movie to watch with family. All the actors have performed extremely well in their cast role, especially Vicky Kaushal's role as Sam Bahadur was amazing and awesome. It's an evergreen and must watch movie. This is a one of the best movie ever I seen. It's a completely patriotic and thoroughly entertaining movie. Wonderful and fantabulous. ðŸ’¯ % credit to the director for well direction and creating dramatic situation through out the movie. We have enjoyed a lot. In Hindi it's a Paisa Wasool movie. VERY WELL DONE BY ALL.",
    "45": "The overall film is good. The character development of Field Marshal Sam Manekshaw seems very satisfying. Vicky has indeed done a great job. The background music hooks the audience, and cinematic experience is superb. The run time could have been longer with few extra details that have been missed.Talking about the story, it feels more like a timeline of events rather than the journey of life. Fatima looked a little weak for Iron Lady. The supporting cast did their jobs well. The dialogues were crisp and impactful. The action sequences felt realistic though. The few punchlines did a great job in lightening the tension built.Not every audience would find it worthy to watch, and a hard time keeping up with events. I personally had a lots of expectations from it and to he honest, it met many of them.",
    "46": "The movie describes the key points of Late Field Marshal Sam Manekshaw however story cannot be summed up in 2.5 hours. The movie zips past his high and lows in a hasty manner but is on point. Brilliant acting by Vicky Kaushal and a near perfect enactment of Late Field Marshal Sam Manekshaw. The background score does justice to the movie as well with some decent acting by the supporting cast of the movie. There were a few low points which were boring however overall the movie is a good one time watch. Also due to less screen time a lot of his achievements and life instances were missed in his biopic. Hence I strongly advocate for a web series depicting his life.",
    "47": "The movie is well crafted with great direction and acting depicting the story of Field Marshal Sam Manekshaw. The cast is well chosed. Gives us the close insights of the pre-independence and post-independence events in the Indian history and the role of the Brave Sam Manekshaw in the Indian Army.Meghna Gulzar has done great work by studying all the events and the sets look too real if you check the photos on internet.The movie currently has less bookings as it is completing with Ranbir Kapoor's Animal but the movie is worth spending money and time for.Do consider to add the movie in your watchlist.",
    "48": "So there are two was to look at this movie. If we watch it as a biopic documentary then it's a classic good acting by Vicky Kaushal. If as a entertainment movie then i wouldn't recommend watching it. The movie should have more action all the family scenes could have been avoided. It should have talked more about the actions, of Marshal Sam Manekshaw. If it's an Army man's biopic it should tell more about his army exploits. Many more could have been told and depicted in the movie. Actors are depicting theirs roles very fine and no complaints there. Overall a nice tribute to Marshall Manekshaw. Good.",
    "49": "Vicky has outdone himself...great acting by all supporting stars. The story went through several turns and could not make an impact. It is true it was not possible to cover the long career of Sir Sam Manekshaw. The director tried to cover too much and could not do justice to all plots except a few.Let's hope we get to enjoy similar movies with a better direction. I don't have much to write...so just copying the above text.Vicky has outdone himself...great acting by all supporting stars. The story went through several turns and could not make an impact. It is true it was not possible to cover the long career of Sir Sam Manekshaw. The director tried to cover too much and could not do justice to all plots except a few.",
    "50": "Movie was really good it's about biography of Sam\nFirst Indian army field marshal\nVicky kaushal acting was superb exactly matched with real Sam\nI enjoyed a lot in the first day show\nWhenever Vicky come in the scene it's like we don't blink our eyes so that we can't miss any moment\nOne one dialogue by Vicky was really good n superb specially when he deal with politician n his answers to them.Overall very good movie n acting done by full team\nAnd want this type of film every year atleast two/three about any defence forces related Army/Navy/Airforce.Kishan Bhattacharjee\nTripura, Agartala.Northeast.",
    "51": "Vicky kaushal did a great job. Its would have been great to see more action and war scenes in the film. Neeraj kabi as Nehru Ji and Fatima Sheikh as Indra Gandhi were looking pathetic in the character also their makeup and costume were badly done. Casting could have been better for the prominent character's in the film. Yahya khan played by Zeeshan Ayyub was perfect though he was unrecognisable. Sanya Malhotra played her character beautifully and was fun to watch. 10/10 for Vicky Kaushal but overall i feel the movie is 6 out of 10 for the lack of detailing in the character artist and screenplay.",
    "52": "2 hour 25 minutes is not enough to show what Sam Bahadur has achieved in lifetime but you don't regret it after watching. You can sure see the character growth through out the movie you witnessed that after each event how Vicky kaushal changed his acting as Sam Bahadur was brilliant no doubt in that other actors such as zeeshan, Sanya, Fatima had delivered sincerely there role . Meghna Gulzar has captured the essence of every time period either it was pre indipendence or post indipendence. Music of movie flows like river very smooth which makes you at peace, cinematography was beautiful as it should be\nAny one can't capture the whole glory of Sam Bahadur but it was at best one should surely watch it once.",
    "53": "I rarely review movies but it's worth for this one. Narration, story flow, acting, humour, romance, emotion everything single aspect finds a perfect balance in this movie. Bollywood needs such movies to revive and get it's image back.It's a proper family entertainer and I would watch the movie again on OTT. Vicky Kaushal has taken his character to next level and while watching you cannot actually recognise him. You will only see Sam.Not sure the breakup of real vs cooked up for entertainment but you might learn a bit history as well. I strongly recommend this movie for all. Completely worth the watch and your time.",
    "54": "This movie had everything, just lacked quality songs to tintilate the \"Pathan\" generation to get them to watch this masterpiece over \"Animal\". Can't think of any reason why this movie is struggling to cross 100crs after over a week of releaseSalute to Sam Bahadur, the ultimate solider that country needed during its toughest 3 decades. Cast and performance was on point, Vicky kaushal did great justice to the role by making each of his body part act the way it should (especially his eyes). Also a great history revision for our brainwashed generation that has grown up only reading about the great mural rule and nothing else about country's history.",
    "55": "Vicky Kaushal and Meghna Gulzar bring Sam Manekshaw to life and also the key players of those times. Vicky Kaushal was amazing in his portrayal of Sam Bahadur which reflects the class of actor he is. A heartwarming and overwhelming experience of the times gone by especially the depiction of the partition period and the three wars. Zeeshan Ayub as Yahya Khan was flawless as always and provided depth to the character. Fatima Sana Sheikh and Sanya Malhotra also carried their characters well. A wholesome experience least to say. A well deserved tribute to the great soldier Field Marshal Sam Bahadur.",
    "56": "The movie aims to show the audience the \"Man\" in \"Manekshaw\". Devoid of unnecessary mass scenes and cliche dramatics, the story focuses on the real life story of India's finest war hero.Vicky Kaushal's performance as usual is fantasmal. Just like in Sardar Udhham Singh, I felt like I was watching the real Field Marshal on screen. Kaushal will make you go places you've never been, will make you see the world through the eyes of Sam.This movie is a classic work of art and will always be remembered for many years to come. I'm sincerely relieved that Bollywood hasn't lost the real art of sincere storytelling.",
    "57": "Vicky Kaushal's outstanding performance in Sam Bahadur indeed captivates the audience, making it an unparalleled cinematic experience. Meghna Gulzar, the director, skillfully weaves a narrative that complements Kaushal's brilliance, contributing to the film's overall excellence. And as for the dialogue \"I'm okay, Sweetie,\" it adds a touch of emotional depth to the characters, enhancing the movie's impact.Additionally, the soul-stirring songs further elevate the emotional connection, resonating deeply with the audience's hearts and enhancing the overall cinematic experience. Sam Bahadur is a masterful blend of authenticity and emotional depth, making it a standout in contemporary cinema.",
    "58": "This is indeed a Masterpiece movie created by meghna, vicky Kaushal & other actors. Yes Vicky kaushal nailed the character of first First field marshal . He played the character very well that after a while one wouldn't realise that you are not watching Sam Manickshaw , He was just perfect . This is a Must watch movie for all age groups , very well written & directed .... After a long while a excellent movie with wonderful scenes from history well drafted script , story is created that will make you feel proud and motivated. It's definitely worth spending time & money to watch it . .. ..... don't fall/ compare other movies like Animal they are utter trash.",
    "59": "Starting from the Birth of \"Bahadur\" till the end it was just tremendous. And the Acting of Vicky was a 'Copy that' command of Sam. The dialogues which are used in the movies are also entertaining and it is a Movie for the Army Lover.Into the movies it was also shown the British Army and the Partition of the India and Pakistan. How Sam acted upon the situation of East Pakistan. Even the FM Sam (Vicky) also motivated each and every troops for the so as performed in the Movie.It inspires and motivate many if it is being shared each an every place.An Indian must watch movie of their historic heroes. Jay Hind !!!",
    "60": "Movie is awesome, found it better than hyped Animal, truly inspirational Sam Bahadur. \"Sam Bahadur\" delivers a riveting cinematic experience, seamlessly blending historical accuracy with compelling storytelling. The stellar performances, breathtaking cinematography, and meticulous attention to detail create a powerful narrative that resonates. A must-watch for its emotional depth, authenticity, and the portrayal of a significant chapter in history. It is a good one from the production company and the way Vicky Kaushal has turned out the role is amazing. He has picked up almost all characteristics of the General!!!!!",
    "61": "Amazing movie portraying General Sam Manikshaw, (1971 war Hero), Vicky kaushal truly justified the role of Manikshaw with ever best performance...10 points for Vicky. Very inspirational depiction of Sam manikshaw ,his role in Indian army and every soldier. The best performance of Vicky kaushal and the best actor at present. The way movie tells about the personality of Manikshaw was very inspirational and makes us proud of our Indian army. This movie is must watch for everyone to get inspired from the Sam Manikshaw and Indian army and also to watch the best version of acting of Vicky kaushal. Though it's a must watch movie I would suggest but movie could be well directed more on the detailed events related to Manikshaw in 1971 war, then it's would be more fantastic creation of the Indian cinema.",
    "62": "Having not read his biography yet, the movie was very informative to me. Vicky Kaushal holds our attention in every scene and when he is not there I found myself waiting for him to reappear. He performs Manekshawji with impact, aplomb and grace. Though it is a complete imitation of the real man, sometimes unto exaggeration, it works wonderfully for the movie. Sanya and Sana Sheikh did well and did not ruin the experience. They added to it beautifully infact, without taking too much attention to themselves. All the other actors also complement Kaushal well. Overall a good one time watch. Ofcourse one can never hope to bring together 94 years of rich experience on celluloid in 2.5 hrs and that too such a legendary one. We should give the movie that consideration and be happy they could cover enough to create in people a genuine interest to know more about this great man.",
    "63": "This is an absolute showcase of Indian hero and Vicky Kaushal did his best to fill in the shoes. An inspiring movie for those who will fill proud on Indian soldiers and Army for the sacrifices they made and continue to do the same without any demands. Its all about filling energy and showed how to command a team with all planning. I liked the last line in the movie that they can fight with external enemies but its our duty to fight internal ones who can do anything to fullfill their wishes with no love the country mens. Soldiers are kept for a purpose and they should be allowed to do the same and are not for someone's personal assistance. Sam had the guts to protect and save their pride right at the moment when it was needed rather than doing it later to save yourself first.",
    "64": "Finally Bollywood has shown guts by making a pure war film and on the best superhero of that era. Ofcourse there are many areas on which team can work and they could have improve the delivery of the movie. But for me it's a perfect family movie which teaches a lot of life lessons and everyone should watch it as it shows the real patriotism, respect towards junior, being humour and gentleman at the same time and what Army and defence forces and soldiers means to this country. For me it's the movie of the year, and yet again Vicky Kaushal just nailed it with his performce and skills.SALUTE TO SAM SIR.",
    "65": "Definitely something different for a historical biopic. Vicky has outdone himself to get into the character and shines bright all over the movie. A lot of things to learn about patriotism, more of a soldier. To die for the country is not the duty of a soldier, to kill for the country, I am sure this dialogue will be on every soldiers' mouth now. Good cinematography which takes you back to past, as if you are watching the history happening in front of you. Production design is up to the mark. Good screenplay, decent music, action choreography nothing like would make you cringe. Only flaw the movie has is overstretched. If you're a history buff or into biopic, then this one is totally worthy of your money, but not for every average person.",
    "66": "SAM BAHADUR\nExcellence beyond measures. I can't express how overwhelming this film was. Before watching the film I've read so many articles, watched so many videos on Sam Manekshaw so that I have a proper knowledge and I don't miss a thing about his personality and his achievements. And I would say how I don't think any other actor in Bollywood would have done so much justice to the character as much as Vicky Kaushal. He looked so believable as if Sam Manekshaw himself playing his character. He got into the skin of Sam Manekshaw soo brilliantly. Perfection Personified. Hats Off Vicky Kaushal.KYA BANDA HAI YEH.",
    "67": "Sam Bahadur, is a gem that deserves far more attention that it is getting. This movie is based on the life of Captain Sam Manekshaw one of India's most decorated military commanders. With stunning visuals, a stirring soundtrack and powerful performances Sam Bahadur is a cinematic achievement that shouldn't be missed. But the character like nehru, indira etc. Could be better but if we will compare it by the budget that is 55 crore then it is not bad. So over all this movie is very underrated at the same time also very fantastic. Because of Animal it is hard for the movie to cover up even it's budget but I will hope that the movies like this should get more attention from the audience.",
    "68": "Must watch movie deserve spending your time and money plus this movie re-join you from your roots and an inspiration for everyone. The team overall had done a fantastic job. Vicky Koshal have nailed the role. This time the movie haven't make alot in collection but after seeing Vicky performance I can say he is underrated. The days will not be far when Vicky koshal movies will be in big movies club but in my eyes this movie already is unique and can't complete with any movie. From now on I will watch all movies of Vicky koshal. Other than that I would say Jai hind and Jai bharat. Thanks once again for showing this masterpiece god bless you all...",
    "69": "\"Sam Bahadur\" is a good movie that flawlessly captures the life and legacy of Field Marshal Sam Manekshaw. Vicky kaushal stellar performance adds depth and authenticity to the character, bringing Manekshaw's charisma and leadership to the forefront. Vicky Kaushal's performance as Sam Manekshaw is nothing short of exceptional. Kaushal not only captures the physical nuances of the military leader but also taps into the emotional depth of the character. The actor's commitment to the role is evident in every frame, making it one of the standout performances of his career.Sam Bahadur is a must-watch for history enthusiasts and those seeking a poignant tribute to one of India's greatest military leaders.",
    "70": "Vicky kaushal acting is superb, Instead it feels like we are watching Sam bahadur live. This is the greatness of Vicky's acting. Must watch movie. You will surely enjoy this movie.Sam Bahadur always stood with his army staff and always supports them even if he reached at the top of army position. The same has been picturised in the movies too. Along with Vicky all other characters played their respective role superbly.All war be it the second world war, 1947 war with Pakistan, 1965 war and 1971 war with Pakistan where east Pakistan became Bangladesh with the help of Indian army who was led by Sam has been well picturised.",
    "71": "Vicky Kaushal elevated this movie to a whole new level by portraying the entirety of his life story, a challenging feat. Nonetheless, he delivered an outstanding performance, infusing the film with humour, substance, patriotism, and top-notch acting. I am so glad I chose watching this over Animal.I appreciated the way they injected humour into such a serious subject matter. Vicky's portrayal of SAM felt incredibly authentic. Meghna Gulzar's direction is remarkable, and I hope Vicky Kaushal achieves great success following this performance. It's disheartening to see movies like 'Animal' generate massive box office numbers, while this one, which deserves much more recognition, doesn't receive the same level of attention.",
    "72": "This was what Bollywood was missing from the past few years. Vicky Kaushal's acting as Sam Maneshwar was really outstanding. No useless songs or dances with no contribution to the story whatsoever, this film was the bet one I have watched this year. For the first time ever, Indira Gandhi's portrayal was done correctly in a Bollywood movie. The political tension during the 1971 war between India and Pakistan was shown on a much bigger scale than other movies. Sam Maneshwar's sense of humour was also highlighted in the movie and minor references to incidents from his life are also in the movie, giving you an idea of Sam's charming personality and humorous behaviour.",
    "73": "Firstly a young lieutenant is always having a straight back giving charm to his personality. Vicky is acting like a hunchback since the starting of movie lacking to depict the army smartness and FM SAM Manekshaw had. Secondly SAM Manekshaw had a great humour but till the end Vicky irritated audience with his fake accent of Manekshaw. Thirdly the director didn't show the most importantly the problems Indira Gandhi gave to SAM Manekshaw and stopped his pension, Dr. APJ Abdul Kalam meeting and starting his pension scenes were not addressed. Movie gets slow in second half and not even a single picture of Manekshaw is shown or any video is shown in movie .Fourthly the movie is for the audience who knows history.Discovery's Documentaries are better than this.",
    "74": "I'm giving this film a 5/10...5 stars for Vicky's performance no doubt he's done such a great job pulling up a character this legendary... But the script and direction doesn't demand much from him.0 Stars for Meghna's Direction as she was holding such a biased or neutral view point on all the event that really happened and touched only the surface of Sam Sir as even after watching the film I don't knowmuch about him as what kind of man he was apart from his few decisions and dialogue he has made during the film.When we read or hear about him there's soo much things in which we can take pride in, but in movie everything has shown soo plain that it doesn't even feel like an achievement. 1st time in my life I've seen an Ind/Pak partition which went soo smooth like not a single blood shed during it, and people are going in a picnic. And they've shown those pakistani people military people not bad but just some bunch of losers.And don't let me start about the Congress part as they've shown it soo smartly that you'll feel like it's a part of history but you will not understand how psuedo history they're showing, and a big part of his life in which he has issues with the government and the govt. Is not even giving him his money or like no big leader from congress came at his funeral, thry didn't even mention. All the wars they've shown with few people dying and an \"injustice\". No real motive, No real Study, No sides taken... They're too nuetral or biased that it ruins the whole essence & for those who didn't know will never know.",
    "75": "This movie is a work of art. All the aspects of this film are point on. VICKY KAUSHAL - what have you done? How? What are you? I am living here to witness this ERA of VICKY KAUSHAL.The body language, the dialect, the expressions everything was point on. Meghna is a crazy genius. She takes you back to the earlier days of Indian Army and it is pure bliss to watch those times on the big screen.Loved how the story was fast paced and covered all important aspects of SAM's life.What a life lived by SAM and what a story told and depicted by MEGHNA and VICKY.I smiled, i felt pride and i came out becoming VICKY KAUSHAL's fan for life.",
    "76": "It's story of first Indian Field Marshal. Amazing story line captures of Field Marshal Sam Hormusji Framji Jamshedji Manekshaw. Highlights less know facts about challenges faced and wars fought on east front on india. Very well written Script and Impactful performance of all actors captures attention during whole screen time. Four decades of his army carrier is covered in this film. Film. Great film with story depicting whole his army life and personal life with immense feeling of nationalism . Must watch film. Every actors justifies and holds up the dignity of actual Army and Polititians. DO NOT MISS THE EXPERIENCE.",
    "77": "Vicky Kaushal's performance in \"Sam Bahadur\" was truly commendable, showcasing his versatility as an actor. The entire cast contributed to the film's success, and the gripping story added depth to the overall cinematic experience. Vicky's portrayal in \"Sam Bahadur\" demonstrated his ability to immerse himself in diverse roles, capturing the essence of the character. His nuanced performance in \"Sam Bahadur\" resonated with audiences, elevating the film to new heights. The ensemble cast, alongside a captivating storyline, contributed to the movie's success, creating an impactful and memorable cinematic masterpiece. The collective brilliance of the cast and a compelling storyline undoubtedly made the film a memorable cinematic journey.",
    "78": "Watched this amazing epic movie two times in 24hrs.with daughter's & today with my wife. Unbelievable performance by Vicky and other actors. Rarely we watch such films which shows the role of family and it's influence in shaping the profesdional success and there by become a saviour of mother land. This film is a lesson for generations to come and eye opener for politicians and the ego is the egoistic systems prevailing now. The importance of leadership is.naturally scripted and enacted well which gives light to solutions to several problems in work place.This film is not a mass movie but much above that.it has transformational potential\nThe duty of a true karma yogi is to do work selfless and for the greater cause with fearlessness.Technically and artistically this film was exceptional, same with casting, and direction.",
    "79": "Movie tells a story which every Indian should know today. General, later Field Marshal Manekshaw is one of the most iconic figures of Indian Military. No doubt his life has inspired thousands of Indians to join the Military and serve the nation. So it's only fit that there should be a movie to tell his story to Indians of the present generation. Thankfully, the movie does not disappoint. Vicky Kaushal acted in a brilliant and believable manner. Story picks up bits and pieces from the most important periods of Indian Military history and personal life of the General. No doubt well acted and well made movie.",
    "80": "\"Sam Bahadur\" meticulously narrates India's pivotal involvement in the Bangladesh Liberation War, spotlighting the strategic brilliance of Sam Manekshaw. The film masterfully intertwines political complexities and battlefield heroics, delivering a profound portrayal of sacrifice and determination. With authenticity in historical representation, it offers a captivating view of the era's socio-political climate. Stellar performances and vivid cinematography enrich this compelling saga, humanizing characters while honoring their valor. This cinematic masterpiece is a must-watch, not only for defense enthusiasts but also for those seeking a deeper understanding of historical events, encapsulating the essence of India's crucial role in shaping the Bangladesh Liberation War.",
    "81": "7.5 Stars.Although I like the movie, it could have been much better if it was series.Sam Manekshaw's life is too long and filled with too many experiences to fit into a movie.a lot is crammed still missed a lot.The ensemble is excellent, especially \"Vicky\" in the role of \"Sam\". Not for once, I have the impression that I was watching Vicky the entire time, Sam was the only character I was seeing.He picked the physical traits as well as commanding yet smooth speaking style. He is a chameleon.Supporting cast is hit and miss.The entire set design is excellent, and the raw mood is enhanced by filming conflict scenes in actual locations.The movie moves quickly between scenes, but Sam's flamboyant, cheeky personality is the only thing that keeps you interested.As expected from a Meghna Gulzar film, the direction is excellent. However, the screenplay and writing don't do the other supporting characters justice because they have very little on-screen time.In production design, research and detailing are used to create sets, costumes, and makeup that are entirely visible on screen.Good songs and music, especially Badhte Chalo, which aptly captures the togetherness of the Indian Army despite its different regiments.Sam and the system had a fight when he retired, and it was an important aspect of his life that I wanted to see.Although there is more to the tale, it is still a fantastic film that should be seen.",
    "82": "I can't remember the last time I wrote a review on IMDb, but here I am compelled to share my insights. I got into this movie purely for my love and respect for the Indian army (or military, in general). Also, the fact that it stars Vicky Kaushal, who was brilliant as Sardar Udham and in Uri. And god, did I enjoy this? In simple words, it's an excellent movie shot wonderfully and the team at work captures elements quite exceptionally. This isn't your typical Bollywood drama. There aren't any high-octane action sequences, and neither are there any songs that could pull audiences. It's a slow-paced narration of the life of Field Marshall Sam Manekshaw. It started in the early 1930s and ended after the liberation of Bangladesh. I just loved every bit of it. The direction, acting, cinematography, locations (highlight) and background music. It's a delicious tale of our legend and Vicky Kaushal got into the skin of character quite easily here. He has lost his weight here, the way he walks and speaks, everything reminds us of Sam Manekshaw. He is brilliant. Every else in the cast gave it their best shot. Nothing felt out of place to me. I also appreciate Meghna Gulzaar for her sincere direction and for not getting seduced by propaganda. Every Indian should watch it. Jai hind.",
    "83": "Meghna Gulzar, Bhavani Iyer, Shantanu Shrivastava and Vicky Kaushal take a bow; what a fitting tribute to one of the finest soldiers of Indian Army and a true gentleman Field Marshal Sam Manekshaw.The screenplay is fast paced and crisp. The writers remain true to the historical events and have woven all of Sam Bahadur's anecdotes into the script beautifully. The transitions between timelines are smooth. The screenplay spotlights bravery and the brave rather than bravado. The dialogues are spot on, there's humour and there's pain. The anguish of partition in a speech by a young Yahya Khan tugs at your heart and you find yourself swallowing upon a lump in your throat. Meghna Gulzar's dialogues do remind one of her father's writing prowess.There are just three songs in the movie. The lyrics of Badhte Chalo give you goosebumps, as an Indian you feel proud to hear the war cries of every regiment. Only Gulzar Sahab could have written this.Vicky Kaushal is ably supported by Sanya Malhotra, Fatima Sana Sheikh and Mohmd. Zeeshan Ayub.Sanya Malhotra is sweet and likeable as Mrs. Silloo Manekshaw. Though Fatima Sana Sheikh looks a softer version of Mrs. Gandhi but her aloofness does convey a stern persona.Mohmd. Zeeshan Ayub in a cameo as Yahya Khan is convincing.Vicky Kaushal is in fact Sam Bahadur in flesh. He aced the expressions, body language, voice and mannerisms to perfection and by doing so he pays the greatest respects to a great personality that is Sam Bahadur. Anything less would have been a great insult to Sam Bahadur's memory. Rab ka Banda.As the end credits rolled and I looked around all I saw were smiling faces. Amidst the howling and rattling of animals, Sam Bahadur is like a mother's lullaby; soothing and comforting to the soul,A must watch.",
    "84": "Summary:\nFor me while this movie was charming, it did not hit the right notes that it could have when exploring a figure as historically important as Sam Manekshaw. The film seemed more intent on making audiences feel good about the Indian army and patriotic for the country that it did not delve too deeply into the character of Manekshaw. What were the factors that drove him? What was his decision-making process like? All of this was ignored, and all we learned about Sam Manekshaw was that he loved the army and a few of his favorite sayings.Plot:\nThe story covers the entire military career of Sam Manekshaw, but as mentioned earlier does not delve too deeply into any aspects. It is more of a rough summary then a deep dive into the person.Acting:\nThe casting for this film could have been a lot better. I was interested to see if Vicky Kaushal could lead a movie in a non-comedic role and the verdict is that he can't. He was not terrible but lacked any screen presence or natural charisma in the role. Sanya Malhotra, who I usually rate highly, delivers her lines with all the gusto of a block of wood. Of the leads only Fatima Sana Shaikh does justice to her character.Script:\nThe script for want of a better word is quite lame. It's all just sayings with the express purpose of making Indian audiences feel good. The dialogue lacks any sort of real gravitas. Even the serious moments when they are going to war feels like a bit of a joke.Music:\nBackground music was ok, but the actual numbers were quite poor and took away from the enormity of war.Conclusion:\nOverall, the movie is not terrible, it is pleasant enough to watch. However, it really does leave you wishing they had tackled this subject in a different way.",
    "85": "\"Sam Bahadur\" is not just a movie; it's an experience. It's a journey through the heart of Indian history, a story that will leave you with goosebumps and a renewed sense of pride in your country. From the very first frame, the film captivates you, engulfing you in its world of war, sacrifice, and unwavering courage.At the center of this epic tale stands Sam Manekshaw, played with remarkable brilliance by Vicky Kaushal. Kaushal embodies the spirit of Sam Bahadur with utmost authenticity, capturing his wit, his resilience, and his unwavering dedication to his nation. His performance is so powerful that it transcends the screen, making you feel every emotion that Sam Bahadur experiences.The film meticulously recreates the historical events of the 1971 Indo-Pakistani War, immersing you in the tense atmosphere of the battlefield. The battle sequences are masterfully crafted, showcasing the bravery and sacrifice of Indian soldiers in the face of overwhelming odds. You'll find yourself holding your breath as the soldiers charge into battle, and your heart will swell with pride as you witness their unwavering determination.But \"Sam Bahadur\" is more than just a war film. It's a story about leadership, about the burden of command, and the unwavering belief in one's cause. Sam Bahadur is a man of the people, a leader who inspires loyalty and respect with his simple yet powerful words. His leadership is both strategic and compassionate, and it's this very duality that makes him such an inspiring figure.The supporting cast is equally impressive, each actor bringing their characters to life with depth and authenticity. Sanya Malhotra as Sam Bahadur's wife, Silloo, delivers a performance that is both heartwarming and heartbreaking. She portrays the strength and resilience of Indian women during a time of war, reminding us of the sacrifices made by those who wait at home.The film's direction is masterful, seamlessly weaving together historical accuracy with cinematic brilliance. The cinematography is breathtaking, capturing the beauty and vastness of the Indian landscape. The music is stirring and evocative, perfectly complementing the film's emotional highs and lows.\"Sam Bahadur\" is not just a very good movie; it's a must-watch for every Indian. It's a film that will stay with you long after the credits roll, leaving you with a renewed sense of appreciation for the heroes who fought for our freedom. It's a film that will inspire you, move you, and make you proud to be an Indian.Here's why you should watch \"Sam Bahadur\":Vicky Kaushal's electrifying performance as Sam Bahadur.A thrilling and historically accurate depiction of the 1971 Indo-Pakistani War.A story of leadership, sacrifice, and unwavering courage.Breathtaking cinematography and a stirring soundtrack.A film that will leave you with goosebumps and a renewed sense of pride in your country.So, don't miss out on this cinematic masterpiece. Go watch \"Sam Bahadur\" and experience the thrill of Indian history come alive on the big screen.",
    "86": "Oh, brace yourselves for the cinematic masterpiece of the century - a riveting tale of India's first field marshal, Sam Manekshaw. Prepare to be blown away by the unparalleled realism that practically oozes from every scene.This gripping saga, rooted in undeniable authenticity, unfolds with the subtlety of a sledgehammer. Forget about those pesky facts; who needs them when you can have a story that's more dramatic than a soap opera on steroids? Rumors are the true storytellers, right?And let's not forget the groundbreaking narrative - so cliche that even cliches would find it too predictable. Who needs originality when you can stick to the tried and tested formula that's been beaten to death like a dead horse?But fear not, dear viewers, for the screenplay is here to save the day. Who needs a proper biographical film when you can have a mass entertainer? Accuracy and authenticity are so last season; give us explosions and flashy lights any day.Ah, the shining star of this cinematic marvel - Vicky Kaushal. His performance is so fantastic that it almost distracts you from the sheer absurdity of everything else. Bravo, Vicky, for managing to salvage something from the wreckage.Of course, we must acknowledge the decent production values. After all, it takes a special kind of talent to make something so unbelievably unreal look somewhat acceptable. Cinematography is fine, music is okay - the perfect soundtrack for a film that's just about as forgettable as yesterday's news.In conclusion, this groundbreaking work of art is a must-not-watch. Save your precious time for something more intellectually stimulating, like watching paint dry or grass grow. Trust me, you'll thank me later.",
    "87": "*** Sam Bahadur Hindi Movie Review***Starring Vicky Kaushal in the lead role. Also starring Sanya Malhotra Fatima Sana Shaikh ..One Line Review : A half baked scriptThe story is of India's First Airfield Marshall Sam Manekshaw, from a performance perspective Vicky Kaushal has lived in the character. His mannerism, his walking style, the way he speaks , even though a viewer who had never seen the videos of the original Manekshaw on YouTube etc, Vicky's performance will convince them. The only positive point in this movie.Madam Prime Minister, the Iron Lady these tabloids we had given to our Late Honorable PM SMT. Indira Gandhi but in this movie I feel pity as Fatima's casting was totally absurd. Her performance all through felt that she is carrying a heavy character which is too heavy for her. Biggest Negative Point..Sanya Malhotra had given an ok performance as she did not have the screen presence..Coming to the screenplay, where the movie shows the promotion of Sam Manekshaw fastly, the movie runs fastly overlooking the crux factors required for the audience to connect with the movie but here it was NOT.. A half baked from Meghna Gulzar , Bhavani Iyer & Shantanu ShrivastvaAs an audience, we would expect the battle sequences, where we wished to see Manekshaw's involvement in the battlefield, the tactics he used to win etc etc the film except during the last part, the film was disconnected to me..The film could have been trimmed as when the film reached the final part it was feeling stretched.Overall an Average Watchable Experience 2.5/5 â­",
    "88": "It was long overdue that someone told the story of India's first Field Marshal- the incredible Sam Manekshaw. Meghna Gulzar has done a fantastic job portraying the ever so dynamic & steadfast soldier who lead India's army during challenging times. Not for 1 second did this biopic stray form it's focus of telling the story of the soldier who joined the Army when india was under British Rule.I fall short of words while describing the brilliance and excellence of Vicky Kaushal's acting. He has aced the walk, the accented, the persona, the character, the emotion of the great Sam Manekshaw . Every moment on screen is as if Vicky is living and breathing the soldier he is paying for to.The screenplay is smooth and crisp. Important historic moments are shown as much as possible without blowing the context of the biopic.Fatima Sana Sheikh has done an amazing job in the little screen time she got playing as Indira Gandhi.Ever INDIAN who can, should watch this movie. Every Indian owes this much to the great 'Sam Bahadur' .",
    "89": "It is difficult to fit in five decades of laurels in 150minutes. No wonder sambahdur seems to be in a rush to the finish.If not for vicky kaushal's finesse in acting the movie would have been average. He not only captures the nuances that sam manekshaw is known for but plays him to perfection.The first half is fast paced and keeps you glued to your seat. Intermission comes in a jiffy. Meghna gulzar!s direction concentrates on sam, is for sam and only for sam. Rest of the characters have little to do.The film belongs to vicky kaushal. It's sam and not him on the screen. He is a marvel in every frame, acting with eyes and expressions.The only other character that shines is fatima sana shaik's take on indra gandhi. Frames that feature both vicky and her are the backbone of the film.Zeeshan too is good, as is neeraj kabi as nehru but their screen time is minimal. Sanya malhotra has nothing much to do.The war scenes are aptly conducted. The writing could have been better.Sambahdur is a movie, the icon in some of the most important wars in india's history, deserves.Go for it.",
    "90": "Sam Bahadur' endeavours to encapsulate the chequered career of a decorated Army officer who epitomized bravery and nationalism, leaving an indelible mark in the annals of the Indian Army as a larger-than-life persona. However, the film only partially succeeds in capturing those moments, lacking a cohesive portrayal of the protagonist's illustrious journey. Vicky Kaushal emerges as a saving grace for the film, delivering a performance that goes a long way in redeeming its shortcomings. Vicky Kaushal has delivered a commendable effort, but 'Sam Bahadur' falls short of being a cinematic experience to be savoured in its entirety, offering enjoyment only in fragmented segments.Sam Bahadur is a brave attempt, but it aimlessly meanders in most parts, trying to give us an insight into the life of one of the most revered and celebrated army officers. Perhaps, if the valiant Manekshaw had seen the film, he would have said, \"It's okay, sweetie! Better luck next time.\"",
    "91": "Sam Bahadur - The Film .The following are the reasons why you should not watch the film :-1. If you have zero interest in Indian geo - political history.2. If you have no concept about the Indian armed forces.3. If you never knew about Sam Manekshaw was a human being who once walked this country, not so long ago .And now , why you must watch the film Sam Bahadur :1. You watched his excellency, the Mr. Manekshaw's interviews and video in YouTube .2. You consider your precious life's time and hard earned money invaluable !3. You consider the armed , air and naval forces as the silent protector and watchful guardian of this motherland named India , which is Bharat .Â© Sandip Ray Chaudhury\n10th December, 2023 .",
    "92": "It was a treat to Watch Vicky as Sam. I am the individual who didn't personally saw Sam before the movie but after the movie i checked his interviews and videos and i was like through this movie i have lived with Sam. In every Single frame i didn't feel at all that i was watching vicky at all it was like i am watching the great Sam Manekshaw. Vicky's dialogue delivery, body language, acting everything was at point. For me, when i close my eyes and think about Sam and it is Vicky who comes to mind. Other then some videos of Sam there was nothing on internet but through this movie i have felt every moment of Sam's Life and get to know more about how he was as a human being. He was a great man and this movie portrayed his character very beautifully. Everything from proper uniforms the authenticity of some war scenes were beautifully portrayed throughout the movie. The timing of the songs give you goosebumps and you don't feel bored at all throughout the movie. I watched it without interval but not a single moment i felt it is stretched or boring. It was engaging and gives me good vibes throughout the movie. The storyline gripped me throughout till the end and at i felt happy, emotional, and proud at the same time. I recommend this movie if you want to know about a real hero who was not just only a great officer but a great human being. Go and watch because Sam is here.",
    "93": "Real life heroes makes story everyday. That we dare capture in one movie-Connectivity Issues from scenes after scene and I blame it fully to story writer and Director. U can start the movie anywhere U want and close it where U want. This will cover one full episode.What's is fun in covering preindependce actions and I thank director not starting from Birth of Sam. Now Daughter and son-Law photo selection 10min Why.. Sam's Transfer chronicle is also have lots wasteful and confusion for audiance from main Topic. Indira role is well played and charming to make an Impact. I felt Vicky tried to pull the story more with his acting skills on wasteful script and I rate Sir Manikshah real life and Vicky acting is only positive rating here.If U want to know Sam history and tell to ur family this Braveman and true Indian. This is the Movie. If U want this as action or strategy of this hero. It's farGo ahead and watch with full family. Very less movies on real life\nheroes of IndiaNot to be missed.",
    "94": "Sam Bahadur stands as a significant film that demands the attention of every youth in the country. It offers a compelling narrative with impressive cinematography and well-crafted dialogues that are sure to leave an impact. Director Meghna Gulzar takes viewers on a historical journey, shedding light on pivotal events through the eyes of its central character, Sam Manekshaw.The film, although captivating in many aspects, seems to offer enjoyment only in fragmented segments. This could be attributed to the occasional inconsistencies in the narrative flow or pacing, preventing the audience from fully immersing themselves in the story. However, the screenplay, though engaging in bits and pieces, lacks the consistent flow needed for a seamless cinematic journey. The moments of engagement are strong, but they are not sustained throughout, leaving the audience wanting more coherence in the storytelling.Vicky Kaushal's superlative performance injects life into the character, delivering a depiction that resonates with authenticity. His excellent performance brings the character to life, providing a portrayal that feels remarkably authentic. The noteworthy characters, including Ayub's General Yahya Khan, Fatima Sana Shaikh as Indira Gandhi, Neeraj Kabi as Jawaharlal Nehru, and Govind Namdev as Sardar Vallabh Bhai Patel enhance the overall storytelling and contribute to the historical authenticity portrayed on screen.Direction 3/5\nActing 3.5/5\nDialogues 3/5\nStory 3/5\nScreenplay 2.5/5.",
    "95": "Film Review: Sam Bahadur screening in theatres near you !!An inspirational biopic of a characteristic individual - India's first Field Marshall- Sam Manekshaw !!Critics ki aisi ki taisi!! All our esteemed critics who have given this movie a low rating should undergo a mental health checkup!! Dimaag kharab ho Gaya hai inkaYou surely can't compare this with a film like Uri . For heaven's sake.. use ur brains !!Vicky Kaushal is just awesome!!ðŸ‘ðŸ‘\nHis look , mannerisms and every thing ABT Sam are bang on !! The guy gets into Sam's character with such ease .. speaks volumes about the prep work done by him, the director Meghna Gulzar ( grt direction!!) and other backend staff !! His funny one-liners, his banter with PM Indira Gandhi , who he refers to as \"Sweety\" will definitely bring a smile on your face !! Emotional scenes too have been very well enacted!!Others in the cast like Sanya Malhotra ( Sam's wife) , Fatima Sana Sheikh ( Smt Indira Gandhi) , Mohammad Zeeshan Ayub ( Pak general Yahya Khan) have also performed brilliantly!!ðŸ‘ŒðŸ‘ŒOverall, Sam Bahadur is a well made biopic!!Critics ko bhool jao .. Apni Akal lagao!!Highly engaging.. unmissable!!Go watch it... Apne liye nahi toh ...apne Desh ke jawanon ke liye dekho .. itna toh Banta hai !!Going with 4/5 for this one.. adios ðŸ™‚!!#sanjuzzreviews #SamBahadur #SamManekshaw #vickykaushal #SanyaMalhotra #FatimaSanaSheikh #biopic.",
    "96": "\"Sambahadur\" captivates audiences with its gripping narrative, compelling performances, and a nuanced exploration of societal complexities. Directed by a seasoned filmmaker, the movie seamlessly weaves together various elements, making it a standout in contemporary Hindi cinema.The film's storyline revolves around the life of the protagonist, Sambahadur, portrayed by a seasoned actor. Sambahadur's character undergoes a profound transformation throughout the narrative, grappling with personal struggles and societal expectations. The screenplay expertly delves into the intricacies of his journey, presenting a poignant reflection on the human condition.One of the film's strengths lies in its character development. Sambahadur is not a stereotypical hero; instead, he embodies the complexities of a real-life individual. The audience witnesses his evolution from a seemingly ordinary person to someone grappling with ethical dilemmas and internal conflicts. The nuanced portrayal adds depth to the narrative, allowing viewers to empathize with the character's struggles.The supporting cast contributes significantly to the film's success. Each actor delivers a commendable performance, bringing authenticity to their roles. The chemistry between the characters enhances the storytelling, creating a realistic and immersive cinematic experience. Notable performances by the supporting cast elevate the film beyond its individual moments, creating a cohesive and engaging narrative.Visually, \"Sambahadur\" is a treat for cinephiles. The cinematography skillfully captures the essence of the story, using lighting and framing to convey emotions and moods effectively. The film's visual appeal extends to its production design, which authentically recreates different settings, immersing the audience in the world of the characters.The soundtrack complements the film's emotional beats, enhancing the overall viewing experience. The music seamlessly integrates with the narrative, underscoring key moments and eliciting a range of emotions. The film's soundtrack, a blend of traditional and contemporary elements, contributes to its cultural richness.Thematically, \"Sambahadur\" tackles pertinent social issues with subtlety and finesse. The narrative serves as a mirror to society, prompting viewers to reflect on the complexities of human relationships, morality, and societal expectations. The film intelligently addresses contemporary challenges, making it relevant and thought-provoking.However, like any film, \"Sambahadur\" is not without its flaws. Some pacing issues in the second act may test the patience of certain audience members. Additionally, while the film successfully navigates complex themes, it occasionally leans towards didacticism, risking oversimplification of the issues it addresses.In conclusion, \"Sambahadur\" stands as a commendable addition to Hindi cinema. Its well-crafted narrative, compelling performances, and thematic depth make it a must-watch for those seeking a thought-provoking cinematic experience. The film's ability to balance entertainment with social commentary showcases the prowess of the director and the ensemble cast. \"Sambahadur\" not only entertains but also challenges its audience to contemplate the intricacies of the human experience, solidifying its place in the contemporary cinematic landscape.",
    "97": "1. Based on a real life story of India's first field Marshal Sam Manekshaw, our true hero. And the fact that the film did not have any junior artists but instead real-life army personnel and people from the Defence Force makes it praise worthy. Meghna Gulzar did a tremendous job by fitting in 5 decades of Sam in the movie in a span of150minutes, cautiously written, and well shot!Except for the role of Indira Gandhi played by Fatima Sana Shaikh which was an extreme mismatch, with bad acting, every other casting was on point!3. A movie made on war and Indian army will definitely gives you a sense of pride and makes you feel more patriotic but what Sambahadur does is much more. It makes you happy & inspired. Its light hearted yet hits the bullseye!4. Vicky Kaushal has outdone himself!! He deserves characer of Sam. His dialogue de they otty language, personality will make you feel he is the reincarnated version of Sam Manekshaw himself! Such fitting tribute to the legend and the Indian army, I take a bow!!5. If youre looking for good Cinema, great acting, this is the one. But if you're not into this genre, or if you're someone who gets easily bored by History, then you can skip!",
    "98": "Sam Bahadur is just not a movie but an emotion when you watch the legendary field marshal Sam Manekshaw.The movie was not about wars but about the life and the leader that sam Bahadur was. His discipline and love for Indian armed forces were very beautifully shown and was captured in this movie. Vicky Kaushal again gave a stellar performance by playing the role of Sam Manekshaw where we can see the way he had embraced the character. Please do not go to the theatre expecting a war saga but please do go into the theatre to learn and understand the complexity of Sam Manekshaw and his relations with his subordinates and his family.Movie shows the life of Sam Bahadur, all the way from his IMA days till he retired as the first defence personnel to be promoted to the rank of Field Marshall and that too just 15 days before his retirement. So far two Indian field marshals to date.I loved that the director, writer and the cast had done a thorough research although they did a few changes in a few scenes as part of the creative liberty but it showed the most historic partition that Indian and Pakistan army had and how Sam had very good close relationship with Yahya Khan and other Pakistani army officers as they were all trained at IMA and were from the same batch and even had fought against the Axis power duringthe World War 2 and rose to become prominent army leaders in their respective administrative. One scene where he sold his bike to Yahya Khan for 1000 inr in 1947 and post the liberation of East Pakistan and forming Bangladesh he jokingly said in one of the interview in 1971 that Yahya Khan didnt paid him 1000 INR for the bike he sold and so he took half of his country.I liked how its showed even in IMA the aggresive and the ruthless character of Tikka Khan (also well known as the Butcher of baloch and Bangladesh) the officer who initiated operation searchlight that killed many Bangladeshi and that resulted in the 1971 war.The movie progressed well and showed the complex relationship between Sam and Indira. Sam was always known for his straight forwardness and that resulted in many prominent leaders disliking him which also resulted in stopping his pension untill President Abdul Kalam revived the pay. As he was holding the rank of Field Marshall and although he announced his retirement but was not retired from the army service because of the rank he held till his death in 2008, since the field marshal rank never retires.The movie also showed how armed forces boost the morale post the 1967 when Sam Manekshaw was suspended due to wrong accusations against him by his superior and the then corrupt Defence Minister Menon. How he was reinstated and was asked to take charge of the army to damage control.Movie too showed each of the characters like a small shot where Raw founder and Raw chief KN Rao too cane with vital information to Sam and other defence personnel in the Ops room.The 1971 war was where the spirit of India could be seen from the planning to preparations and finally the execution.Like I said do not expect to see the whole war but they beautifully showed the real war videos and photos of the 1971 war with a nice chest thumping song to cover all the scenarios where how Naval blockade and operation python was a huge success and then airforce bombing and destroying the Pakistani airfields and supply lines. Sam did acknowledged the bravery at the battle of Longewala and the bravery that Indian army and airforce showed together.The generation should be inspired of such personalities but many are more interested in only movies like Animal or Kabir Singh.This movie is not about the usual chest thumping or high pitched patriotism. Its a true story based on the life of Sam Bahadur.",
    "99": "Sam Manekshaw deserves better. There's no doubt that Field Marshal Manekshaw made a great contribution and earns the highest respect of every Indian citizen.In this film, the director barely skims through the surface and flops in creating an engaging biopic. It's more a documentary about the Indian Army. Unfortunately there's no storytelling, just dates, incidents and facts - a series of anecdotes from SM's life, mainly disjointed.We see Vicky Kaushal playing Dev Anand (in his Hum Dono role) playing Sam Manekshaw. Calling everyone 'Sweetie' - from his men to the Prime Minister. His sincerity shines, though. (But he was better as Sardar Uddham Singh. And yet didn't get a National Award for the role.)I'll remember Fatima Sana Sheikh for her horrendous wig, playing former Prime Minister, Indira Gandhi. We never see the steely version of IG.There's Sanya Malhotra, playing Sillo, SM's dutiful wife. Her role is to be jealous of Indira Gandhi and give her tough looks across a banquet hall.As is the current flavour of the season, the Gandhi family gets mocked at every possible opportunity. Jawaharlal Nehru telling he doesn't know what to do next (in the context of the Chinese betrayal), Indira Gandhi getting corrected and patronised by SM.Having said all this, it is extremely difficult to make a movie about the armed forces in India. One needs to get a clearance from the Ministry of Defence at every stage of the making.In sum, Sam Bahadur is a waste of a subject. It takes the life of one of India's most significant heroes and gives us a lukewarm film. You can wait for its OTT release where you can fast forward the portions you want to avoid.N. B. Don't get swayed by samosa critics' reviews.",
    "100": "Sam Bahadur (2023) :\nMovie Review -Sam Bahadur Review: Meghna Gulzar forays into the war-biographical genre with Sam Bahadur, starring Vicky Kaushal, Fatima Sana Shaikh, and Sanya Malhotra. Sam Bahadur is not a regular war film, but since it's a biopic of a military man, it has to have those war scenes and be called a film of the war genre. That makes things difficult for the film as biographical is more like a story-driven genre and war genre is more curved towards action and explosion zones. Despite knowing this challenge and the mood of today's audiences, Meghna took the bet and successfully conquered the area she was looking for. With war dramas, I go back to great flicks like \"The Charge of The Light Brigade\" (1936), \"They Died With Their Boots On\" (1941), \"Uncertain Glory\" (1944), \"Objective Burma\" (1945), and then to modern classics like \"Patton\" (1970)-these remain unbeaten because they were made in those eras, when nobody actually dared telling those stories, and also because the storytelling was damn powerful. Sam Bahadur is set in the 40s, 50s, 60s, and early 70s, so I can say that it is too late to make a film now. It's almost 5 decades late to knock on the door, but did we have enough vision for biopics (especially in the war genre) back then? So, that's settled. It's a mixed bag compared to what people usually expect from a war film based on the India vs. Pakistan conflict. But we know that not every film can be Gadar, even though Uri and Sam Bahadur are more real than Sunny Deol's loud fictional tale.In India, we hardly have any great films in this zone. Haqeeqat (1964) could be the one, and then there was Border (1997), which was more into the jingoistic war zone. Vicky has earlier exposed a brilliant mic-drop burn with Sardar Udham, and that's not a war film, even though it was a war story-off the border. Sam Bahadur stays away, only to find its own existence, and by the time you finish watching it, you'll be forced to stand up and salute Field Marshal Sam Manekshaw for whatever he has done for our country and to Vicky Kaushal for whatever he has done in this movie. I don't know how many times people saluted Vicky Kaushal in the film and how many times Vicky Kaushal saluted others, but I want to salute him for the OUTSTANDING portrayal of Sam Manekshaw on the big screen. Hands down. He has not acted; Bro has lived the character.Sam Bahadur begins with Sam's birth scene, as the Parsi parents want a better and different name. In the next scene, we see a backshot of Vicky Kaushal walking in and asking one of his soldiers his name. The local soldier replies, \"Sam...\" He can't say \"Manekshaw\"-maybe due to poor English. Then he shouts, \"Bahadur. Sam Bahadur!\". The allegorical vision of the writer and director is seen and acknowledged there. The film continues with young Sam (Vicky Kaushal) falling in love with Siloo (Sanya Malhotra) at first sight. He is then sent to different regiments, as all his transfers have been highly successful. No conspiracy can stop him, and so Kaul's inquiry commission doesn't bother him much. While Sam knows there are hints of war and wants to be on the field again, Nehru Ji's death brings the government and their actions to a halt. But there is an emerging sensation called Indira Gandhi (Fatima Sana Shaikh), who has full faith in Sam and gives him a free hand with military activities. Sam does not fail her and builds a strong team in almost every corner of the country. The conclusion portion shows 1971 war events and Sam's retirement plans, leaving all of us in awe of the legendary personality called \"Sam Manekshaw.\"Sam Bahadur has flaws in the writing and screenplay, and they remind you that the filmmaking is not fully updated. When Sam joins the Tejpur regiment after the embarrassment of 1962, he gives a speech that is surely encouraging. Then we see a random soldier saying, \"We needed someone like him to tell us what to do.\" I mean, bro, that's too dated for 2023. Sam and Indira's flirting and Siloo's possessive behaviour annoy you after a while. Maybe it was true, but the background score and comic touch were like, \"Wait.. it's too much. It's going somewhere else.\" The visual effects during some war sequences are poor. The Army camps could have been presented in a better way. The pace should have been more speedy, and a little bit of jingoism wouldn't have hurt Uri-era audiences. One of the ministers pronounces Sam as \"Sham ji,\" and I am damn sure half the audience won't understand the actual joke here. Well, Vicky's real-life father's name is \"Sham Kaushal. Now say, \"Hell, that's hilarious!\"Vicky Kaushal, as Sam Manekshaw, makes sure that you don't take your eyes off the screen whenever he is there. Let me tell you, he is there in literally 97% of the scenes, so that means you don't get many chances to take your eyes off him and ultimately the film. What more can I say? He deserves a bunch of awards next year. Hands down to one of the greatest performances in biopic movies in the history of Bollywood. Fatima has done a fabulous job with the voice of Indira Gandhi, but her looks don't really match the required details. Sanya Malhotra is cute as Siloo, Neeraj Kabi is okay in the role of Jawaharlal Nehru, Govind Namdev is decent at Sardar Patel, Mohammed Zeeshan Ayyub as Yayha Khan has a very little to do, Ravi Sharma is overdramatic as Pak general, and there is a big supporting cast in minimal rows, and all have done pretty okay.Sam Bahadur is technically a good film if you have to consider the budget. However, I should argue that the scale is too minimal for such a big story. Why compromise with the methods of storytelling while handling the man's story who never compromised with his methods? Meghna does well otherwise. In the ending scene, Sam looks at the office compound, and we all know how emotional the moment is for the man who once said that \"Army is his life.\" But he does not cry, nor do we hear any melodramatic music in the background. Well done, Meghna. She knew how old and dated these theories were. She keeps it real and evident, but maybe that's the problem for our massy audience. They can't understand the simple fact that a real-life story can never be as adventurous as a fictional story that one can imagine without any restrictions. Sam Bahadur is too true to its main context, and that somewhere caused a loss of entertainment. Nevertheless, you should watch it to learn about the life of the most amazing soldier in India, who had the guts to speak loud and clear even in front of the prime minister, ministers, and his seniors for his country and for his soldiers. Besides that, Vicky Kaushal's performance alone is worth twice as much of your money.RATING - 6/10*",
    "101": "The movie is Amazingly made! Casting is on- point (Indra Gandi's role could have been better)\nBut overall it's a Happy movie... No lead character dies, No extra maritals, No nudity, No vulgarity, No cruelty & so on.All actors, truly made justice to their roles but a big round for 'Vicy Kaushal', oh bouuyyy, did he study the Character- Sam Manekshaw! When I say this, I remember a scene where Sam addresses the Gorkha regiment, while doing so, the way Vicky acted, hatts off, you could see.. Vicky speaking from the navel (bottom of the heart) like the real Army officers do! Sillo Manekshaw- Sanya, looks very pretty and even carries her character with utter Grace!It is commendable, how beautifully the Writter- wrote & the Director- Potrayed it. This is one of the amazing examples of what happens when writter & director work hand in hand. If you later think about the movie, one can understand, how, even the smallest thought was channelized to inspire people.Truly, AAAAAAmazing & Inspiring!",
    "102": "Director Meghna Gulzar, known for her previous works such as \"Raazi\" and \"Chhapaak,\" embarks on the biographical journey of one of India's most celebrated military commanders with \"Sam Bahadur.\" While the film marks an improvement from Gulzar's previous venture, there are notable reservations about its ability to encapsulate the intricate tapestry of Sam Manekshaw's life.\"Sam Bahadur\" chronicles the remarkable career of Sam Manekshaw, played with commendable finesse by Vicky Kaushal. The film displays Gulzar's growth as a director, evident in the improved cinematography and production design that successfully transport the audience through the different eras of Manekshaw's life.However, the film falls short of delivering a comprehensive portrayal of Sam Manekshaw. Its focus on key milestones and historical events in his military career leaves the audience yearning for a more profound exploration of the man beyond the uniform. The screenplay, while detailing his strategic brilliance, lacks the emotional depth required to truly understand the complexities of his character.Vicky Kaushal's performance is noteworthy, capturing the military leader's demeanor and charisma. Nevertheless, the constrained emotional range, dictated by the script, prevents Kaushal from fully immersing himself in the character. The supporting cast adds value but is underutilized in terms of character development.A pivotal consideration arises in contemplating whether the film would have been better suited as a mini-series, akin to HBO's \"John Adams.\" The expansive nature of Sam Manekshaw's career demands a more extended narrative, allowing for a nuanced exploration of both his professional and personal dimensions. The episodic structure of a mini-series could have delved into the intricacies of his relationships, the challenges he faced, and the historical context that shaped his decisions.The success of historical mini-series lies in their ability to balance character development with the unfolding of significant events, providing a more immersive experience for the audience. The feature film format, while offering a glimpse into Manekshaw's life, ultimately feels constrained in capturing the full breadth and depth of his journey.In conclusion, \"Sam Bahadur\" stands as a commendable effort, showcasing Meghna Gulzar's growth as a director and Vicky Kaushal's skillful portrayal of Sam Manekshaw. However, the film's limitations in conveying the emotional intricacies of its central character leave room for reflection on the potential benefits of a mini-series format. A more extended episodic canvas might have provided the necessary space to paint a more detailed and emotionally resonant portrait of this national hero.",
    "103": "A Meghna Gulzar MasterpieceNo other bollywood film depicts our very own and dear cities Tezpur and Jorhat so gracefully and authentically the way Sam Bahadur does.In India, there is hardly any other biographical film which can match upto Vicky Kaushal as Sam HFJ Manekshaw MC - Sam Bahadur. Not even for a single frame you would realize that an actor is playing a role of a real life hero. You just cannot keep your eyes off when he's on the screen. Such appealing acting!!!!(Kenny DB also shares screen time and dialogues)The film not only tries but does incorporate significant events since 1930s up until the '71 war, also a few bits and pieces of World War II.It's an informative film simply and basically about the first Field Marshal of India.",
    "104": "Sam Manekshaw, an Indian army officer with a legacy spanning over four decades and participation in five wars, achieved the prestigious rank of Field Marshal-a historic milestone in military history.In the world of cinema, Vicky Kaushal undertakes the daunting task of portraying this legendary figure in \"Sam Bahadur.\" While Kaushal's performance garners commendation, the film as a whole falls short of delivering a cohesive cinematic experience. Instead, it offers fragmented moments of enjoyment.\"Sam Bahadur,\" a 2023 Indian Hindi-language biographical war drama, meticulously chronicles the remarkable life of India's inaugural Field Marshal, Sam Manekshaw. Released on December 1, 2023, the film spans a duration of 2 hours and 30 minutes.In summation, \"Sam Bahadur\" provides a window into the life of a true hero, yet its narrative struggles with consistency and storytelling finesse, hindering a complete capture of Sam Manekshaw's grandeur.",
    "105": "The armed forces have always fascinated the common man and filmmakers across the world. In India also number of remarkable films have been made on army/war but no biopic as such has been made keeping a legendary armed force man,and so Meghna Gulzar takes the plunge on arguably the biggest name of Indian armed force post independence- the great Sam ManekShaw!The film is a tribute to the great man(played effortlessly by Vikki Kaushal)and shows various chapters of his life from pre-independence till his retirement. The film covers various chapters in the form of several wars - World War 2,India Pakistan 1947 war,Indo Sino 1962 saga,North East India army- separatist conflict, India Pakistan 1971 war and creation of Bangladesh. The film also showcases various modern history and important political incidents of India. In this process Meghana Gulzar and her team also shows real characters Pandit Nehru,Sardar Patel,Lord Mountbatten,Indira Gandhi,VK Menon,Yashwant Chavan,US diplomat Henry Kissinger(who passed away last week) and Pakistani generals Yayaha Khan,Tikka Khan and more.Meghana Gulzar has made remarkable films like Talwar and Raazi in past and SamBahadur is her grandest film,produced very well by Ronnie Screwala. She handles the life of Manekshaw ably and captures all important armed and political incidents related to him in episodic form. The research of the team is impeccable and even many dialogues are straight from what Sam said at couple of places. Though the film takes cinematic liberties yet stays true to the lead man's life. The screenplay is good but what many fans found missing was a solid emotional punch at many important instances. They have used real life archive footages to give the film an authentic touch. However, as some critics have rightly pointed out rightly,due to various wars shown ,the movie looks more of a war-political history docudrama of modern India like ABP political series PradhanMantri and Aaj Tak war series Vande Mataram. So a major chunk of audience who are unaware of the events will find it kinda jumping from one event to other without pausing much on each. Also the personal life of Sam is not covered much except his conversations with his wife and his domestic help. Having said that,there is no doubt that Meghna and Vikki with their team have brought alive the legend for the rightly deserving big screen and surely audience who like war,army,politics,modern history will definitely like it. This is where I feel Meghana succeeds in SamBahadur,where Shyam Benegal had failed in the grand but disappointing Bose. The cinematography, action and production values are first rate. Music and lyrics by Daddy Gulzar are apt for the few songs. Of the cast both Dangal girls get major footage after the title character. Though Sanya Malhotra as Mrs Manekshaw is fine but Fatima Sheikh looks misfit as Indira Gandhi. Meghana's Talwar fame Neeraj Kabi ,after playing Gandhi in Shyam Benegal's tv series Samvidhaan is good as Pandit Nehru. However Zeeshan Ayub with really bad make up and over prosthetics look fully forced and ineffective as Yayaha Khan.The film however fully belongs to Vikki Kaushal who as Sam Bahadur himself gives an excellent performance. Vikki already played armed officer successfully in Meghana's Raazi and in Aditya Dhar's Uri. Here,the Udham Singh fame Vikki, has taken care of mannerisms of the real life Manekshaw, added a bit of style of moustached army Dev Anand in Hum Dono, yet given a performance which is his own. It makes up for all the minor flaws of this heavily mounted film. And \"Sweetie\" he is the main reason why \"Josh is high sir\". The release clash decision of SamBahadur with the hugely popular Animal by the makers seems wrong placed and will definitely effect its box office prospects ,just as YRF released Tiger 3 on Diwali day instead of 2 days earlier killing a major chunk of extended Diwali business.However,all in all SamBahadur is a good film with great lead performance and celebrating the life of an Indian legend,and even with few flaws will find its own audience!!!",
    "106": "Movie is biography of Sam Manekshaw from birth to retirement. In this long period and illustrious career, he participated in many wars. Movie depicts all key events in his life. There is only one proper songs, and no much else in sense of typical Bollywood tropes.What works? It's unusual topic for Bollywood hence producers should be rewarded for taking a risk. It's story of a real hero who every Indian should know. Many historical events are described in matter of fact way without excessive jingoism so it it's good history lesson for typical Indian.What doesn't? Movie covers so many events that none gets proper due. For instance, Ghazi movie shows story of single submarine war, or Raazi shows one instance of spying, and it takes proper 2 hour to tell a good story in an engaging way. Sam Bahadur has 100 such incidents and none gets its due. Essentially movie becomes rushed documentary of all things he did. Each event gets barely 10 screen minutes, and then timeline jumps to next 5-10 years. They could have started late in his career and showed only few events in details.Few other noteworthy things: Key political leaders of time e.g. Nehru, Indira, Patel, VP Menon also get barely some time and also show fairly factually without fawning over. In the earlier career, Sam was soldier under British government and movie didn't display his any point of view towards wanting it contributing to India's independence. He was a good soldier and he remained a good soldier whichever army he was in.",
    "107": "Very disappointed.Such a low budget movie never makes a justice with the story.Story telling is very poor.Editing is also very poor. You can't relate to the existing scene movie takes you the other scene.Why there be a romantic song in the movie ?People don't like those Black and White Video of war instead a real movie scene.Stay apart from the those cost cutting.Even \"Pippa\" movie had done better in war scenes than this.Lots of expectations there from Meghna Gulzar mam.But Mr. Koushal.... You just steps into a different level. My deep love to you again sir. If the director and producer make little justice with your efforts then the movie may turns into a masterpiece just like real Field Marshal Sam Manek Shaw.",
    "108": "Could have been way better than this, very weak screenplay, totally not baked properly. Yes, 40+years 5 wars is lot for a 2hr-long film, still making wise and writing wise should have been better. But for its standard, it gets better in the second half specifically when it shows the Bangladesh parts. When it shows the biggest achievement of Sam Manekshaw 'The Bangladesh Liberation' that's when the drama peaked in the entire film, should have treated it as Manekshaw's contribution on the 1971 war instead of his biopic.It's Vicky Kaushal who saves it with his powerful and nuanced performance, totally chewed the character in, he made it look like method acting. He not only gets the outside but also gets the voice perfectly. Two years ago he brilliantly played Udham Singh now Sam Bahadur, surely an actor born to portray the pre-partition India's historic titular characters. But Sardar Udham is a way better film than this and its two different things to give a great performance in a well written and directed film than to done the same in a badly written and made film. He would have earned an Oscar nomination if it was a Hollywood film.--@pranabchaudhury (03/12/23)",
    "109": "This is just a true tribute to the legendary person who contributed so much for our countryHe was the person for the history and geography we are seeing today otherwise things would have been different today.I found we are so lucky to have a gem like person Field Marshall Sam Bahadur.Coming to the movie it has justified every bit of his personality and Vicky Kaushal has proved it no one could have done it better than him.This kind of movie makes us proud and I really thank the makers for making such a gem movie to tribute every appreciation to the man .Please go ahead and watch the movie with your kids\nThey need to know how and what all this gem person did to make our country proud.",
    "110": "In kerala , the movie is screened in only two cities, the rest of the population is going to miss this cinematic experience.In the Gulf, too there is delay. Till now the movie hasn't reached theaters here. Why ?Meghna Gulzar is a movie curator's delight. She is creating magic again with this biopic on one of India's greatest war heroes.Vicky Kaushal as expected fleshed out the character of Lt. General Sam Manekshaw to perfection. No words to express the perfect portrayal of one of India's most beloved army leaders.Will be watching this movie again & again.It's not everyday that you get to watch a movie that inspires humans to lead, to serve and to be kind when you have the power to do anything.This is what people of all ages must watch!Another feather in the cap of Ronnie Screwala and team!Please ensure that cinematic experience will not be denied by ill-advised distributors.",
    "111": "Firstly shout out to Ronnie screwvala for sticking to these kind of topics in and out.Basically if it's a RSVP production, the movie comes under the must watch category, and congratulations for that.A great story, along with great acting. A delight to the eyes.Sanya Malhotra and Vicky Kaushal were too good, and their love for the art can be seen in the movie.Music could have been a bit better.The only thing missing was the disconnects In between. The makers were probably not ready to invest much, and the film got a place somewhere between the documentary and a biopic.The ending could have been better espacially.Overall, this is a good movie with a must know story.",
    "112": "\"Sam Bahadur\" unfolds as a compelling cinematic journey that defied my initial expectations. While I anticipated a film largely centered around historical facts, wars, tactics, and politics, the movie pleasantly surprised me with its diverse appeal.The narrative seamlessly weaves elements of comedy, romance, action, and drama, creating a well-rounded experience for the audience. The film meticulously explores the life of Field Marshal Sam Manekshaw, delving into his struggles and triumphs. Impressively, it manages to sustain engagement without a single dull moment. The production values are commendable, and the cinematography adds a layer of quality to the visual experience. While there might be a few factual liberties taken, the director and her team have artfully exercised creative freedom.In the realm of performances, Vicky Kaushal and Sanya Malhotra shine in their portrayals of Sam and Silloo, respectively. Kaushal's rendition of Sam Manekshaw surpasses his previous works, capturing attention with every nuance of his performance. His dedication to the role, from physicality to dialogue delivery, is evident, creating an immersive experience for the audience. However, the portrayal of Indira Gandhi by Fatima falls short, lacking the fierceness that characterized the political figure.The musical score by Shankar Ehsaan Loy marks a triumphant return for the trio. After a few lackluster soundtracks, they deliver music reminiscent of their signature style. \"Itni Si Baat,\" sung by Sonu Nigam and Shreya Ghoshal, stands out as a delightful trip to 60s music, captivating with its pure melody and poignant lyrics. The other tracks, \"Banda\" and \"Badhte Chalo,\" evoke nostalgia, reminiscent of the memorable tunes of \"Lakshya\" and \"Kandhon Se Milte Hain Kandhe.\"In conclusion, \"Sam Bahadur\" proves to be an entertaining cinematic experience catering to a wide audience. I recommend watching it in theaters with friends and family, as it successfully blends history, drama, and emotion, leaving a lasting impression on the viewer.",
    "113": "Another wonderful biography nicely made for silver screen.Vicky Kaushal is fabulous, script is nice but not so dense... But overall a great inspirational movie. You can enjoy with family and will not regret.Brilliant starcast and army background is beyond imagination. It shows a complete different dimension of war.5 stars from my side.. music is a weak point but overall experience is fantastic... A must watch in cinemas.. for a great experience.It is a tribute to India's most loved, decorated soldier. Great effort by Meghna Gulzar and team to bring out the contribution of a military strategist which otherwise may go unnoticed and may not be celebrated much in current culture. Songs are mind-blowing.Overall highly recommended, good, decent and healthy movie. Go for it. I am sure you will be back with a sense of pride.We all loved the movie.",
    "114": "They should have just focused on 1971 war a lot of time was wasted and in the end they just played recordings of the warThere were a lot of factual inaccuracies in the movie nehru was whitewashed and all of the blame was on British when in reality it was nehru who took the issue on un for no reasonThere were a lot of missed opportunities in Burma war there was no mention of Subhash Chandra Bose which could have been a huge factor.Overall the movie was a mashup of history like a documentary there were no climax. A lot of time was wasted on sam personal life.This movie had huge opportunities which it sadly missed as the life of Sam manik shah was connected to major world events.",
    "115": "This is just a true tribute to the legendary person who contributed so much for our countryHe was the person for the history and geography we are seeing today otherwise things would have been different today.I found we are so lucky to have a gem like person Field Marshall Sam Bahadur.Coming to the movie it has justified every bit of his personality and Vicky Kaushal has proved it no one could have done it better than him.This kind of movie makes us proud and I really thank the makers for making such a gem movie to tribute every appreciation to the man .Please go ahead and watch the movie with your kids\nThey need to know how and what all this gem person did to make our country proud.",
    "116": "In kerala , the movie is screened in only two cities, the rest of the population is going to miss this cinematic experience.In the Gulf, too there is delay. Till now the movie hasn't reached theaters here. Why ?Meghna Gulzar is a movie curator's delight. She is creating magic again with this biopic on one of India's greatest war heroes.Vicky Kaushal as expected fleshed out the character of Lt. General Sam Manekshaw to perfection. No words to express the perfect portrayal of one of India's most beloved army leaders.Will be watching this movie again & again.It's not everyday that you get to watch a movie that inspires humans to lead, to serve and to be kind when you have the power to do anything.This is what people of all ages must watch!Another feather in the cap of Ronnie Screwala and team!Please ensure that cinematic experience will not be denied by ill-advised distributors.",
    "117": "Firstly shout out to Ronnie screwvala for sticking to these kind of topics in and out.Basically if it's a RSVP production, the movie comes under the must watch category, and congratulations for that.A great story, along with great acting. A delight to the eyes.Sanya Malhotra and Vicky Kaushal were too good, and their love for the art can be seen in the movie.Music could have been a bit better.The only thing missing was the disconnects In between. The makers were probably not ready to invest much, and the film got a place somewhere between the documentary and a biopic.The ending could have been better espacially.Overall, this is a good movie with a must know story.",
    "118": "\"Sam Bahadur\" unfolds as a compelling cinematic journey that defied my initial expectations. While I anticipated a film largely centered around historical facts, wars, tactics, and politics, the movie pleasantly surprised me with its diverse appeal.The narrative seamlessly weaves elements of comedy, romance, action, and drama, creating a well-rounded experience for the audience. The film meticulously explores the life of Field Marshal Sam Manekshaw, delving into his struggles and triumphs. Impressively, it manages to sustain engagement without a single dull moment. The production values are commendable, and the cinematography adds a layer of quality to the visual experience. While there might be a few factual liberties taken, the director and her team have artfully exercised creative freedom.In the realm of performances, Vicky Kaushal and Sanya Malhotra shine in their portrayals of Sam and Silloo, respectively. Kaushal's rendition of Sam Manekshaw surpasses his previous works, capturing attention with every nuance of his performance. His dedication to the role, from physicality to dialogue delivery, is evident, creating an immersive experience for the audience. However, the portrayal of Indira Gandhi by Fatima falls short, lacking the fierceness that characterized the political figure.The musical score by Shankar Ehsaan Loy marks a triumphant return for the trio. After a few lackluster soundtracks, they deliver music reminiscent of their signature style. \"Itni Si Baat,\" sung by Sonu Nigam and Shreya Ghoshal, stands out as a delightful trip to 60s music, captivating with its pure melody and poignant lyrics. The other tracks, \"Banda\" and \"Badhte Chalo,\" evoke nostalgia, reminiscent of the memorable tunes of \"Lakshya\" and \"Kandhon Se Milte Hain Kandhe.\"In conclusion, \"Sam Bahadur\" proves to be an entertaining cinematic experience catering to a wide audience. I recommend watching it in theaters with friends and family, as it successfully blends history, drama, and emotion, leaving a lasting impression on the viewer.",
    "119": "Another wonderful biography nicely made for silver screen.Vicky Kaushal is fabulous, script is nice but not so dense... But overall a great inspirational movie. You can enjoy with family and will not regret.Brilliant starcast and army background is beyond imagination. It shows a complete different dimension of war.5 stars from my side.. music is a weak point but overall experience is fantastic... A must watch in cinemas.. for a great experience.It is a tribute to India's most loved, decorated soldier. Great effort by Meghna Gulzar and team to bring out the contribution of a military strategist which otherwise may go unnoticed and may not be celebrated much in current culture. Songs are mind-blowing.Overall highly recommended, good, decent and healthy movie. Go for it. I am sure you will be back with a sense of pride.We all loved the movie.",
    "120": "They should have just focused on 1971 war a lot of time was wasted and in the end they just played recordings of the warThere were a lot of factual inaccuracies in the movie nehru was whitewashed and all of the blame was on British when in reality it was nehru who took the issue on un for no reasonThere were a lot of missed opportunities in Burma war there was no mention of Subhash Chandra Bose which could have been a huge factor.Overall the movie was a mashup of history like a documentary there were no climax. A lot of time was wasted on sam personal life.This movie had huge opportunities which it sadly missed as the life of Sam manik shah was connected to major world events.",
    "121": "\"Sam Bahadur\" is not just a film; it's an experience. It's a stirring cinematic tapestry that takes you on a rollercoaster ride through the extraordinary life of Field Marshal Sam Manekshaw, the man who redefined the landscape of Indian military history.From the very first frame, Vicky Kaushal disappears into the role of Sam Bahadur. It's not just mimicry; it's an embodiment of the man's spirit, his unwavering resolve, his wit, and his fierce love for his country. Kaushal delivers a performance that is both nuanced and powerful, leaving you awestruck by the sheer brilliance of his portrayal.But \"Sam Bahadur\" isn't just a one-man show. Meghna Gulzar, the director, deserves a standing ovation for crafting a film that is both epic and intimate. She seamlessly blends grand war sequences with poignant moments of personal conflict, giving us a holistic view of the man behind the legend. The film's pacing is perfect, never lagging or feeling rushed, allowing you to fully absorb the gravity of each scene.The writing, a collaborative effort by Gulzar, Bhavani Iyer, and Shantanu Shrivastava, is nothing short of inspiring. It's not just a dry recounting of historical events; it's a story filled with humor, heart, and unexpected twists that keep you glued to your seat. The dialogues are sharp and memorable, etching themselves onto your mind long after the credits roll.Jay Patel, the cinematographer, deserves special mention for his breathtaking visuals. He captures the vastness of war-torn landscapes with stunning precision, contrasting them with the intimate beauty of Sam Bahadur's personal life. The film is a visual feast, a testament to the power of cinematic storytelling.And let's not forget the unsung heroes: the make-up team, the supporting cast, the crew, and the production house, RSVP Movies. They all came together like a well-oiled machine, pouring their hearts and souls into making this film a reality. The result is a seamless, polished masterpiece that leaves you wanting more.\"Sam Bahadur\" is more than just a biopic; it's a celebration of courage, resilience, and the unwavering spirit of a true leader. It's a film that will stay with you long after you leave the theater, inspiring you to face your own battles with newfound determination. It's a must-watch for every Indian, a reminder of the heroes who shaped our nation, and a testament to the power of cinema to move and inspire.So, go watch \"Sam Bahadur.\" Don't just see it; experience it. And walk out with your head held high, knowing that the legend of Sam Bahadur will continue to echo through the corridors of time.",
    "122": "First of all hats off to Meghna ji for choosing such an inspiring biopic of Sam Manekshaw\nWith all the reseach and technical ideation the character came out really well. If anyone doesnt know how the real Sam Bahadur looks and talks like should definately check his videos online.That man is really one in the world. With his sense of humor and the cute gentleman behaviour he can charm you away.The story is so clean and crisp. Shots are very cinematic and all scenes can be felt.So many politicans were shown as per their roles during that time. Sam stood strong and did his duty well.Fatima Sana Sheikh and Sanya Malhotra were also in the movie. Fatima played the key role of Indira Gandhi Ji and it was a good try for that. Sanya is Sam's wife in the movie.If you are a person who loves biopics and wants to see the reality of these real heroes then this is for youðŸ˜",
    "123": "One of the best movie,if it were come on independent day must have created history.Acting of vickey kaushal is amazing and love to watch him in army uniform .Director kept everything same as in gorkha rifles and replicate the same.One word for movie is wow.I am giving 10/10 for this movie.. Manekshaw is presented throughout as a hero, consistently correct, noble, witty and forgiving. Whether he's standing up to politicians, boxing a rival or charming his future wife, the guy can do no wrong, and the\ncharming Vicky Kaushal is well-cast in the role.This Vicky Kaushal starrer is a long, fragmented history lesson.",
    "124": "Superb movie with awesome acting and direction.Every Indian must watch movie with family and friends.Go for the India and its glorious past, how this man put behind everything when if comes to Army or Pride of nation.No one can do better SAm as Vicky did it.He is superb in patriotic films and I am becoming a big fan of him.Movie by movie.Sam Bahadur is based on the life of India's first Field Marshal, Sam Manekshaw. He served Indian army for over four decades and was part of five wars.Vicky Kaushal as Sam blew me away totally. His intense performance in \"Uri-the surgical strike\" made me in an awe of him. And now with his performance as Sam Bahadur is yet another example for his dedication, charismatic and brilliant performance. He has picked up the nuances, mannerisms, body language, walking style of Brigadier Sam very well. He does complete justice to the role.",
    "125": "There is a wire article on the movie which says that the movie does not get into the mind of the Field Marshal and is essentially a rehash of the anecdotes to craft a life story of the man. True but harsh.Having seen some exceptional ultra-realistic war movies, I didn't mind a bit of Bollywood emotional masala and sentimental patriotic songs. To the director's credit, she avoids jingoism and most of her retelling is consistent with facts. She does paint the Pakistanis in a light rarely seen in Indian cinema. Yahya Khan and Sam's friendship and Yahya Khan's comment about partition were fascinating portrayals.QUOTE\n\"The British offered us khichdi, and then gave us the choice to separate the rice and lentils for ourselves.\"\nUNQUOTE.Some of the complex topics like Kissinger, Yahya Khan & China relations in the background of the Bangladesh war have been grossly simplified. But nevertheless, its a good retelling of a quality not often seen in Bollywood. If you have read about those periods, then perhaps the familiarity will make you appreciate it more.In making this movie, the makers displayed bravery!! Long back I used to look at the Armed forces from a purely civilian lens and that's unfair. Unlike other professions, a soldier faces high risk of death, while they are trained for such situations, a safety net is essential. The film raises important questions about the perks that are made available to the forces in terms of cantonment access etc. The questions those comments raise are pertinent!!",
    "126": "Diving into the cinematic experience of this long-anticipated masterpiece was nothing short of a revelation. From the very moment the lights dimmed, the screen came to life, and the story unfolded, it was evident that this was more than just a movie-it was a visual journey through India's history following the life of one of the greats!The cinematography, a vital aspect of any cinematic creation, was nothing short of spectacular. Every frame was meticulously crafted, bringing to life the era in which the story is set. The visual richness not only enhanced the overall viewing experience but also served as a portal, transporting the audience back in time to witness the pivotal moments that shaped the destiny of Modern-day India.What sets this movie apart is its commitment to historical accuracy. The correct period usage of machines, warplanes, and weapons adds a layer of authenticity that is often overlooked. It's a testament to the dedication of the filmmakers who spared no effort in recreating an era long gone. As a viewer, this attention to detail made the narrative more immersive, allowing a seamless connection between the audience and the historical events unfolding on the screen.The heart of any great film lies in its storyline, and this one does not disappoint. The narrative carefully weaves through the life of India's First Field Marshal, Sam Manekshaw, allowing the audience to witness the highs and lows, the triumphs, and the challenges that marked his remarkable journey. The storytelling is both engaging and enlightening, striking a delicate balance between entertainment and historical documentation.Sam Manekshaw's life, portrayed on the big screen, becomes a canvas on which the hues of India's history are painted. The film masterfully captures the essence of the times, offering a glimpse into the political and social landscape that defined an era. It's not merely a biopic; it's a reflection of the collective journey of a nation, told through the lens of a man who played a pivotal role in shaping its destiny.Central to the film's success is the casting, a critical element that can make or break any historical depiction. In this regard, the choices made by the casting director deserve applause. Vicky Kaushal, in the role of Sam Manekshaw, delivers a performance that transcends mere acting. It's a portrayal that goes beyond the superficial, capturing the very essence of the character. Throughout the movie, Kaushal embodies the spirit of Sam Bahadur with such authenticity that, for a fleeting moment, it becomes challenging to distinguish between the actor and the historical figure.The subtleties in Kaushal's performance are commendable. From the nuances of body language to the cadence of speech, every detail is meticulously executed. This dedication to authenticity is what elevates the portrayal from good to exceptional. As an audience, you don't just watch the story; you become a silent companion to Sam Manekshaw, sharing in his joys and sorrows, victories, and defeats.One cannot ignore the emotional resonance that permeates the film. It's not just a retelling of historical events; it's a journey that stirs the soul. The highs are euphoric, the lows are heart-wrenching, and every emotion in between is a brushstroke on the canvas of the narrative. This emotional depth is a testament to the skill of the filmmakers in creating a holistic experience that transcends the boundaries of time.In praising Vicky Kaushal's performance, it's essential to acknowledge the collaborative effort that brings a film to life. The supporting cast, the crew behind the scenes, the directorial vision-all play pivotal roles in shaping the final product. The ensemble cast, each actor meticulously chosen to breathe life into their characters, adds layers of authenticity to the narrative.As the credits roll and the lights gradually brighten, one is left with a profound sense of having witnessed not just a movie, but a piece of history unfold on the screen. The resonance of the story lingers, urging the audience to reflect on the sacrifices, the struggles, and the triumphs that paved the way for the India we know today.In conclusion, this cinematic portrayal of FM Sam Manekshaw's life is more than a biopic-it's a symphony of visuals, emotions, and historical accuracy. It's a testament to the power of storytelling to transcend time and connect with the collective consciousness of a nation. As the credits fade, what remains is not just a memory of a movie but a profound appreciation for the journey that brought us to where we are today. ðŸ’¯ðŸŽ¬",
    "127": "Wow Sam HFJ Manekshaw a legend. Vicky kaushal did a total justice to the role of field Marshall Supporting actors were average. Beautiful portray of all the five wars lead by Sir SamVicky kaushal did an exception work from a 15 years old Sam at Indian military academy to a five star generalCan movie be extended more yes definitely\nBeyond 1973 More life of Sam Manekshaw should have been shown as he was ignored by Indian government during his last days Even his interaction with Sohan Singh (A jawan) was not shown Even when APJ Abdul Kalam came to visit him was also not shownSo it's worth watching oh yesssss every penny\nWhen you will walk out of theatre you will feel proud potriotic and immense respect for the man Field Marshall Sam Manekshaw or our beloved SAM BAHADUR."
}