{
    "0": "The first time I watched The Suicide Squad it was with a number of other people and I have to admit that I really didn't get much from it. It was just OKAY to me.A couple of months later, my husband and I watched it and I really listened and paid attention, and I thought it was excellent - apart from the dumb / gratuitous harm to the birds (what the heck was that about, anyway?) and the ridiculous villainous \"thing\" (I won't say more in order to avoid a Spoiler tag). The 'twist' early on, and the comedic flow, especially between Elba and Cena, was fantastic.The thing is, although I normally do not find many movies to be rewatchable, we just got through watching it (for me, a third time) with family, and if anything, I found it even funnier than the last time! My rating of 9, is for the times I laughed just today.",
    "1": "...but this has all the imperfections and grit I want in an ADULT superhero movie. As odd as this seems, I saw \"Invincible\" animation series, and this reminded me of an IRL version of that.The comedy is actually funny and not cheesy or cringy, the superheroes outside of Cena don't all look roided to be powerful, and there's actually good acting.Marvel is for kids, DC is for adults-hate it but if you're honest you'd agree.",
    "2": "This movie is surprisingly fantastic. Much has been said about it so I want to just add my two cents about universe building in movies. From the very first scene, Suicide Squad made it clear what it was. You understand the world you are in and the rules in place, or lack there of. It then follows those defined rules throughout. Comic book movies can take many forms from gritty realism like Joker all the way to off the wall zany like we see here. As long as the movie follows it's own rules, viewers are willing to go wherever the director wants. What an absolute blast of a good time this one is.",
    "3": "A -BIG- Screen -Micro- Review. Viewed August 16, 2021.High Points : 1. \"PEACEMAKER\" : The cheeky & sneaky', yet unequivocally -{ Bold, \"Fresh\", & Delicious }- narrative swipe at the long, long, long standing -Imperialist- tendencies ; but -even- more significantly, \"Hypocricies & Triple Standards\" . . . Of -PAST- United States Governments. 2. Simply-put : basically -\"Everything\"- the { Stunningly 💣💥❗} Talented Margot Robbie, ( 'Harley Quinn' ) does ; with an 'Extra-special' mention for her -protracted- \"Escape From Coronel\" fight scene. 3. Daniela Melchoir ( 'Ratcatcher-two' ) : This peculiarly endowed 'Anti-heroine' has a seiously -Bizarre- talent... but she, along with Idris Elba's 'Bloodsport', the just bespoke Margot's 'Harley' ( -and Others- ) ...end up bringing a whole lot of \"Unexpected, & Genuine\" -{ HEART }- to 'The Suicide Squad'.Mixed Feelings : As a 'doting' parent, I'm going to come clean and tell you that I had a definite problem with the fact that I really, really -{ DID }- enjoy this -Certifiably- { Decadent } \"Bloodsoaked Goofy Adult Camp-Fest\", and in no small measure either, at that. Sure it was 'dominated' mostly by -Cartoonish- violence meant only for 'Mature' viewers, { it has an MPAA certified rating of 'R' ; and it's homepage, ( right here ), denotes it's rating as '15' }. But -even- so ...the, um, how shall I say... 'Sheerly, Obscenely, Gratuitous' levels of gore in said film -Did- somewhat take me by surprise . . . Given as it comes directly from the Director \"best-known\" for his ( -relatively- ) \"More kosher\" -MCU- ( 'Marvel Cinematic Universe' ) movies.Summation : \" A Conflicted, yet -Thoroughly- Entertained, 8.50 Marks Out Of 10 From Me \" ; if only out of ABSOLUTE admiration for the Funny, & \"Insanely-Creative\"James Gunn. It bears iterating that I ( -Very Obviously- ) won't be letting my young adults anywhere 'Near' this super crazy, super fun, but also 'Super Kid-Unfriendly' Picture . . . HOWEVER . . . \"the reviewer\" in me has -Indeed- won over \"the parent\" in me, in this instance, all the same 🤷‍♂️ 😂❗.",
    "4": "Before you think \"Yea. We know. It's stupid. That's the point\" please keep in mind that there is stupid and there is STUPID. \"Guardians of the Galaxy\" is stupid but it's wonderful. This film is simply STUPID.",
    "5": "I guess the movie studios need to make money by catering to a juvenile cartoon market, addicted to hyper violent video games. Perhaps I am just too old to understand how this movie is remotely enjoyable.Don't get me wrong, I appreciate many of the DC Comics characters that bring more depth than those of the Marvel/Disney universe -- which is why I pressed the play button in the fist place. But during this movie, I just had to fast scan through 80% of it. This would make a 10 minute cartoon, for those who enjoy humor in the style of the three stooges.While some movies do not need to be made, this is a movie that should NOT have been made.",
    "6": "The first SS was a real idiocy, but this new part has managed to topple the sheer level of lunacy and imbecile crass low ebb by all means/\nThe recipe is simple - awful plot, unlikable characters, loud noise, lots of gore, cringe deaths, horrid pace, total absence of depth or integrity, sheer profanity and and on top of all that - lackluster performance where every aspect is overplayed and overcooked in lukewarm watr.Even Margot Robbie did not save this abomination since her part is a pathetic clowning with no merit.In a word - stupid to the brink of clear abomination.",
    "7": "I like James Gunn movies. But I think you really need to be a comic book fan to really appreciate this film. I watched it twice and I could not get into the ridiculous characters like King Shark, Rat Girl and Pok-A-Dot Man. The comedy wasn't there for me. Perhaps I am just too old for this film. But it seems to be doing well here on IMDb so I guess I am missing out on something.",
    "8": "With the amount of money this must have cost to make, you would have thought it would be half decent. It couldnt be further from the truth. Fails across the board, not surprising will smith gave this a pass. Seriously cant think of a single good thing to say about it.",
    "9": "Throughout the movie, the only good part was when Amanda Waller gets whacked in the head. It's not an easy job to make a bad movie with that kind of cast. The whole from start to end is a drag. It was like watching a TV series by skipping episodes. Total dissapointment.",
    "10": "How' it's 7+/10 I can attribute to most reviews written by 13 yr old boys. It's sloppily written, plot holes up the yinyang, and the good guys still manage to fire a 20 round clip assault rifle on full auto for about 10 seconds, or about. 100 rounds..... that's one heck of a long clip !!King Shark is suddenly stupid for some reason?Just a stupid pointless movie, no wonder they didn't advertise it much.. try to save as much money as they could.",
    "11": "Too much death, and not in an exciting or good way. Killing that supposed to be funny, when it's not. Killing off of promising characters in first scenes of movie. 100% un-necessary male nudity scene, too many 6th grade penis jokes, and John Cena in prolonged scenes with skimpy underwear on. Boring at times and plot was off. Harley Quinn channeling John Wick now with Superman level strength and Batman level fighting skills. Very predictable and stupid ending. It just wasn't a good movie.",
    "12": "The first one was amazing , the second one was pretty near to perfection ,so why would they create this abomination ? Looks ,like a comedy spinoff to me , not a real movie...Another great possible franchise brought down ... Sad...",
    "13": "What a horrible movie. The humor was stale, the fights boring, the costumes looked cheap and the visuals were bad. It was so obviously bad that I'm wondering if all of that was intentional? I'm struggling to find even one redeeming quality about this movie. I mean, Margot Robbie is always a treat and Idris Elba always does well but otherwise the plot was weak. It was so bad, that even 2016s Suicide Squad blows this movie out of the water.",
    "14": "Hey! I've got a great idea. Let's take a movie that sucked beyond belief and.....MAKE IT AGAIN!!! OK. There's a different plot and different characters to not care about but still.....Oh, and speaking of plot this movie seems to be missing one. There's also a lot of \"humor\" added to this one. Problem is that somebody forgot that humor is supposed to be funny. Or at least amusing. Big miss on both. This is not the worst movie this year (that goes to Candyman) but it's definitely in the top 3.",
    "15": "I didn't go to the Cinemas since I thought it would be mediocre. So I watched it at home. The movie overall was nice, when they got to that acapella battle in the Rain storm with no music and King Shark just ripping a guy in half while roaring, I was thinking, I should've went to the Cinema to watch this! That was some straight Victor Crowley, Hatchet, Horror sh**. Nice work, Gunn! King Shark was actually great. The rest of the characters i don't even remember sadly lol...The Polka Dot color guy was also great! I can't complain about the gore when Gunn also made Slither (2006) 😂 Dont like gore? Well Jungle Cruise should be down the hall ;)",
    "16": "Unfortunately this is no guardians of galaxy. The story is totally empty and idiotic where it bitterly fails trying to humor the audience by bringing the dumbest elements in movies ever possible, it's doubtful if a 5th grade child would find this funny. The first suicide squad was silly but watchable, birds of prey is terrible, but this sequel is so much worse, it redefines what pure garbage is. The suicide squad is just incredibly gross and stupid beyond imagination, with awful acting and directing I couldn't find a thing that's even worth commending. What's actually funny about this movie is the ridiculous amount of paid or moronic reviewers and critics overrating this trash at a 7-10.",
    "17": "IMDB have started to censur long good thought-out reviews so this will be a short one to replace the actual review.This movie is horrible. It is one of the worst I have ever seen and it make movies like Black Widow look like a masterpiece. The directing, acting, script, and editing all suck.Do not see this filth.",
    "18": "If Suicide squad means to kill a franchise then this is aptly named. A giant starfish from out of space? The villain of this movie is a starfish with an eyeball? Give me a moment to sigh and roll my eyes. Doesn't DC have any good writers or stories? When I saw Peter Capaldi I thought I was watching a two hour episode of Dr. Who... This is so confusing because I don't know if this is a reboot or a remake. All the senseless killing and deaths try to come out as funny but it's just sad and pathetic. This movie is even worse than the first movie... Maybe the third reboot will be the one because people are going to want to forget this.",
    "19": "I wonder how many 32 year old teenagers died laughing at this. I don't even know what is going on anymore. People are giving this 10/10. I don't think I can do this anymore...",
    "20": "So many characterisations coming and claiming as superheroes and we as an audience aren't sure whether to accept them as such. Some weirdest behavioural characteristic being is being called superheroes and they go on to save the world. I think it is this concept of saving the world that has gotten bored and maybe the superhero subjects are better off with just evil villains and not aliens probably.",
    "21": "If you thought Wonder Woman 2 was the worst recent movie of the super-hero genre - we have a new contender. While the first SQ was at least an enjoyable big-screen experience - this one falls flat in every single regard. Flat humor, boring action sequences that have been done better a million times before, even less interesting characters that you wouldn't GAF about.",
    "22": "Gruesome scenes aren't edgy and randomness isn't funny, booking good actors doesn't fix any of it. The music is terrible, the plot is unbearable, i would rather watch anything else, seriously this movie is awful, i will remember not to watch anything by this writer. I can't believe how bad this is when they obviously had a good budget and employees. Why are the superpowers so stupid? I'm not sure what anyone would gain by watching this, even the music is 10 years old.",
    "23": "I don't know where to start, this movie is just trash . The first movie was fun to watch and this is awful. Maybe I'm probably giving it 3 because of Hurly. I loved her crazy, bold character *-*",
    "24": "If it wasn't for this star studded cast, people would see the truth. There's literally no plot here. The worst of this somewhat trilogy, comes in last due to the boring portrayal of the thinker and some dumb giant starfish as a big bad. Lame, incoherent and silly. I actually liked the first one but Will Smith was a believable alt-hero. Idries tries, Cena can't act (we know this and don't care), actually not enough Harley and everything else was pointless. Not as good as anything CW does for DC, and that's saying something.",
    "25": "I could not watch more than 17 min - its a bad parody with ridiculous antiheroes, even worse humour and killed off characters from the first seconds. Very graphic and vulgar and not in a bearable way.",
    "26": "The high ratings on IMDB was a shocker, bigger shocker than the movie, so i gave the movie another go, maybe i missed something in it, but the answer to such query was NO.Firstly, way too bad than the first one, it was Margot Robbie as Harley Quinn, as the main highlight again and what beautifully has she played this character again.Rest, simply ignore, especially John Cena, another wrestler coming into action and wish he knew what he was playing. Disappointing.In a nutshell, horrible compared to part-1, only Harley Quinn doing some justice, rest is simply not worth watching, especially the rainbow colour jello monster, lamest of all.",
    "27": "I really enjoyed this ensemble superhero movie, the diretor's best since his similar GUARDIANS OF THE GALAXY. It has the same fun, anything goes kind of vibe, and the CGI effects are out of this world. This one's a DIRTY DOZEN style men-on-a-mission flick, as a group of refreshingly quirky heroes land on an island to take down a corrupt regime and their dark scientific experiment. The script zings, the violence and bloodshed are amped up, and the camaraderie works. There's nothing not to like about this engagingly high energy production.",
    "28": "When I heard about a kind of remake of Suicide Squad I was pleased. Good on the producers and studio I thought to resuscitate a film that bombed the first time. However for me this was a disappointing film. It honestly felt like the story was written within a week. Even with the thin story, the poor pacing, weak character development and randomness of it was hard to buy into. The star studded cast couldn't save it. I couldn't tell where the heck the film was going. The humour fell flat and they tried to succeed at things Marvel did so well. Why is DC cursed with their superhero movies? Such a shame.",
    "29": "So suicide squad are the bad guys but Hollywood won't allow a film to actually have characters that are bad guys, so they're basically heroes that just swear a lot. Which massively takes away from the premise of Suicide Squad.Then we have a paper thin plot, with pointless action, with John Cena hamming up another movie with his MDF style of acting.Having a couple of actors who actually know how to act is the only thing stopping this from being a 1 star movie.",
    "30": "This movie is terrible. Maybe it's because I'm unfamiliar with the comic book characters it features, but I fell asleep more than once while watching it. In my experience, that's the hallmark of an awful movie. I'd pass on The Suicide Squad if I were you.",
    "31": "This is what people like? This is what gets 8 out of 10? This is an awful movie. Suicide Squad is so mush better. That got 7 out of 10. Well this is what I gave it. But I give this 1 out of 10. This has a bad story line.",
    "32": "You will not only need to turn your brain off but take it out, call a taxi and have it driven out of town.The story is boring and makes no sense. The jokes are poor at best and not one made me even smile. The HQ character was highly annoying.Best thing will smith did was leave this behind.",
    "33": "Either HBO or whoever managed to put in 70,000 8-10 ratings like it's The Godfather.I've see 30 movies with hysterical over the top violence with a better story line, and significantly better dialogue.All this is is gratuitous 2021 Three Stooges violence with the morons turned good to get the bigger evil moron....\n74 Metascore who were the Reviewers middle school students.Terrible but not terrible enough to shut off after 25 minutes unfortunately.",
    "34": "Hey! I've got a great idea. Let's take a movie that sucked beyond belief and.....MAKE IT AGAIN!!! OK. There's a different plot and different characters to not care about but still.....Oh, and speaking of plot this movie seems to be missing one. There's also a lot of \"humor\" added to this one. Problem is that somebody forgot that humor is supposed to be funny. Or at least amusing. Big miss on both. This is not the worst movie this year (that goes to Candyman) but it's definitely in the top 3.",
    "35": "I didn't go to the Cinemas since I thought it would be mediocre. So I watched it at home. The movie overall was nice, when they got to that acapella battle in the Rain storm with no music and King Shark just ripping a guy in half while roaring, I was thinking, I should've went to the Cinema to watch this! That was some straight Victor Crowley, Hatchet, Horror sh**. Nice work, Gunn! King Shark was actually great. The rest of the characters i don't even remember sadly lol...The Polka Dot color guy was also great! I can't complain about the gore when Gunn also made Slither (2006) 😂 Dont like gore? Well Jungle Cruise should be down the hall ;)",
    "36": "Unfortunately this is no guardians of galaxy. The story is totally empty and idiotic where it bitterly fails trying to humor the audience by bringing the dumbest elements in movies ever possible, it's doubtful if a 5th grade child would find this funny. The first suicide squad was silly but watchable, birds of prey is terrible, but this sequel is so much worse, it redefines what pure garbage is. The suicide squad is just incredibly gross and stupid beyond imagination, with awful acting and directing I couldn't find a thing that's even worth commending. What's actually funny about this movie is the ridiculous amount of paid or moronic reviewers and critics overrating this trash at a 7-10.",
    "37": "IMDB have started to censur long good thought-out reviews so this will be a short one to replace the actual review.This movie is horrible. It is one of the worst I have ever seen and it make movies like Black Widow look like a masterpiece. The directing, acting, script, and editing all suck.Do not see this filth.",
    "38": "If Suicide squad means to kill a franchise then this is aptly named. A giant starfish from out of space? The villain of this movie is a starfish with an eyeball? Give me a moment to sigh and roll my eyes. Doesn't DC have any good writers or stories? When I saw Peter Capaldi I thought I was watching a two hour episode of Dr. Who... This is so confusing because I don't know if this is a reboot or a remake. All the senseless killing and deaths try to come out as funny but it's just sad and pathetic. This movie is even worse than the first movie... Maybe the third reboot will be the one because people are going to want to forget this.",
    "39": "I wonder how many 32 year old teenagers died laughing at this. I don't even know what is going on anymore. People are giving this 10/10. I don't think I can do this anymore...",
    "40": "So many characterisations coming and claiming as superheroes and we as an audience aren't sure whether to accept them as such. Some weirdest behavioural characteristic being is being called superheroes and they go on to save the world. I think it is this concept of saving the world that has gotten bored and maybe the superhero subjects are better off with just evil villains and not aliens probably.",
    "41": "If you thought Wonder Woman 2 was the worst recent movie of the super-hero genre - we have a new contender. While the first SQ was at least an enjoyable big-screen experience - this one falls flat in every single regard. Flat humor, boring action sequences that have been done better a million times before, even less interesting characters that you wouldn't GAF about.",
    "42": "Gruesome scenes aren't edgy and randomness isn't funny, booking good actors doesn't fix any of it. The music is terrible, the plot is unbearable, i would rather watch anything else, seriously this movie is awful, i will remember not to watch anything by this writer. I can't believe how bad this is when they obviously had a good budget and employees. Why are the superpowers so stupid? I'm not sure what anyone would gain by watching this, even the music is 10 years old.",
    "43": "I don't know where to start, this movie is just trash . The first movie was fun to watch and this is awful. Maybe I'm probably giving it 3 because of Hurly. I loved her crazy, bold character *-*",
    "44": "If it wasn't for this star studded cast, people would see the truth. There's literally no plot here. The worst of this somewhat trilogy, comes in last due to the boring portrayal of the thinker and some dumb giant starfish as a big bad. Lame, incoherent and silly. I actually liked the first one but Will Smith was a believable alt-hero. Idries tries, Cena can't act (we know this and don't care), actually not enough Harley and everything else was pointless. Not as good as anything CW does for DC, and that's saying something.",
    "45": "I could not watch more than 17 min - its a bad parody with ridiculous antiheroes, even worse humour and killed off characters from the first seconds. Very graphic and vulgar and not in a bearable way.",
    "46": "The high ratings on IMDB was a shocker, bigger shocker than the movie, so i gave the movie another go, maybe i missed something in it, but the answer to such query was NO.Firstly, way too bad than the first one, it was Margot Robbie as Harley Quinn, as the main highlight again and what beautifully has she played this character again.Rest, simply ignore, especially John Cena, another wrestler coming into action and wish he knew what he was playing. Disappointing.In a nutshell, horrible compared to part-1, only Harley Quinn doing some justice, rest is simply not worth watching, especially the rainbow colour jello monster, lamest of all.",
    "47": "I really enjoyed this ensemble superhero movie, the diretor's best since his similar GUARDIANS OF THE GALAXY. It has the same fun, anything goes kind of vibe, and the CGI effects are out of this world. This one's a DIRTY DOZEN style men-on-a-mission flick, as a group of refreshingly quirky heroes land on an island to take down a corrupt regime and their dark scientific experiment. The script zings, the violence and bloodshed are amped up, and the camaraderie works. There's nothing not to like about this engagingly high energy production.",
    "48": "When I heard about a kind of remake of Suicide Squad I was pleased. Good on the producers and studio I thought to resuscitate a film that bombed the first time. However for me this was a disappointing film. It honestly felt like the story was written within a week. Even with the thin story, the poor pacing, weak character development and randomness of it was hard to buy into. The star studded cast couldn't save it. I couldn't tell where the heck the film was going. The humour fell flat and they tried to succeed at things Marvel did so well. Why is DC cursed with their superhero movies? Such a shame.",
    "49": "So suicide squad are the bad guys but Hollywood won't allow a film to actually have characters that are bad guys, so they're basically heroes that just swear a lot. Which massively takes away from the premise of Suicide Squad.Then we have a paper thin plot, with pointless action, with John Cena hamming up another movie with his MDF style of acting.Having a couple of actors who actually know how to act is the only thing stopping this from being a 1 star movie.",
    "50": "This movie is terrible. Maybe it's because I'm unfamiliar with the comic book characters it features, but I fell asleep more than once while watching it. In my experience, that's the hallmark of an awful movie. I'd pass on The Suicide Squad if I were you.",
    "51": "This is what people like? This is what gets 8 out of 10? This is an awful movie. Suicide Squad is so mush better. That got 7 out of 10. Well this is what I gave it. But I give this 1 out of 10. This has a bad story line.",
    "52": "You will not only need to turn your brain off but take it out, call a taxi and have it driven out of town.The story is boring and makes no sense. The jokes are poor at best and not one made me even smile. The HQ character was highly annoying.Best thing will smith did was leave this behind.",
    "53": "Either HBO or whoever managed to put in 70,000 8-10 ratings like it's The Godfather.I've see 30 movies with hysterical over the top violence with a better story line, and significantly better dialogue.All this is is gratuitous 2021 Three Stooges violence with the morons turned good to get the bigger evil moron....\n74 Metascore who were the Reviewers middle school students.Terrible but not terrible enough to shut off after 25 minutes unfortunately.",
    "54": "I couldn't finish watching this movie, the first one was a lot better. Not only were the actors better in the first one but overall entertainment. The plot is incredibly dull and stupid, and nothing makes sense.I really wanted to give it a try but I actually could not watch more then 1 hour. This is probably the only movie in my entire life I didn't finish watching once started.",
    "55": "Approximately 150 million + USD, 2000+ people as in cast and staff, probably much more uncredited, excellent source potential from DC, unlimited potential and ideas, and this is what they make. Even though you can't blame the cast too much, as they're trained to do what they're told - banausic; however, writer, director, producer, studio should be ashamed of themselves for the monumental waste of time, effort, money, and talent squandered in this production of silliness. I do not understand why this movie can be given anything more than 4 stars, let alone 10 - I suppose some of that 150+ million was spent on hard advertising, ratings, and, of course, stars - I gave it 1 star for its rebarbative effects, and for it being obnoxious and profoundly stupid.",
    "56": "Not worth it. Not a good plot, no good characters and waste of time.",
    "57": "Violet, bloody and hilarious. Margot Robbie really gets to shine as Harley. Highly recommended. James Gun made the movie we all wanted to see. Hallowed be his name.",
    "58": "This is a horribly stupid movie, with a hint of entertainment value. The special effects are good, but the storyline is all over the place and the script is crap. Much of the humor is forced. Another loss for DC movies IMO.",
    "59": "Great cast, some interesting visuals...but it got really boring in the middle.Appreciated the humor. Some really far-fetched ideas, but that was probably the point.Best part was Harley and the President.Not really a recommendation for me, sorry. I think there are a lot better things out there to watch.",
    "60": "From the opening scene onwards the film is incoherent and a waste of time.",
    "61": "Something ceases to be cool the moment it becomes aware of its own \"coolness\". This trillionth superhero movie gets miniscule credit for attempting some new things... but is all too aware of itself (\"Deadpool\"-style) to actually work. The sole purpose of this film is to be cool... and thus it fails to be exactly that. It is another in a long line of infantile blockbusters. A drab commentary on what sells at the box office these days.",
    "62": "I never laughed at all. Time-wasting attempt for humour. I hope this is not the future of movies.",
    "63": "If you could half a star, it would a generous 4.5 stars. Two hours of shoehorning in the f-bomb and CGI blood fest. A really poor effort and poor casting for the main. Robbie and Ratcarcher the only two creditable performances. And to cap it all off, it's all about a killer starfish // Giant Pokémon.Dull and repetitive.",
    "64": "If you're making a dark humor flick at least make the humor funny. It's hard to sit through this and I would have turned it off if not for Margot Robbie being in it. This movie is just plain bad. The first suicide squad movie lacked charm but again it had Margot Robbie so I stomached it. This is just a truly bad super hero comedy. DC wonders why it's movies don't do as well it's because they're movies are terrible. Hire some actual comedic writers to help with the script. It's like bad joke after bad joke after bad joke.I'm short some words here so I'll just say if it wasn't for Margot Robbie no one would have watched this film and since they replaced her the new Joker films good luck getting me to watch them. Lady Gaga? Yuck! No body is fantasizing about her or ever called her hot.",
    "65": "I can't believe the first S. S. has only 26% on Rotten Tomatoes, and this one is at 92%. If anything, David Ayer's first S. S. was much better written and directed.Don't get me wrong, James Gunn's Guardians of the Galaxy franchise is one of my favorite super-hero films of all time, but it's the specific lead characters that made it work, especially the humor. Chris Pratt and Dave Bautista, to name a few, made me laugh and cheer them on, along with the awesome Rocket voiced by Bradley Cooper and Groot voiced by Vin Diesel. I've never laughed so hard and had so much fun in any other superhero film. But in this one, the humor and most of the cast trying to be funny, was cringeworthy.Then in this one, Gunn decides to kill off the characters you want to route for right at the start, like Michael Rooker as Savant, and Nathan Fillion as T. D. K., and you're left with Polka Dot dude and John Cena, of whom was a horrible casting choice. I'm a huge fan of Cena, but in comedy, he just doesn't work. None of his jokes came across as funny, and the horrible costume they put him in didn't do him any justice. Sly as King Shark and the amazing Margot Robbie were the only true funny characters. The rest were pretty much clowns trying too hard to make you laugh, and convince you they are superheroes. Idris Elba and Daniela Melchior as Ratcatcher 2 - although not meant to be funny, were the only others that were well cast and convincing in their roles. Of course Margot Robbie, as usual, stole the show.Gunn's choice to write and direct this to try and be funny was a cringeworthy flop. What was with the cartoonish flowers and whatnot in that one scene with Harley Quinn? There was just too much infantile nonsense in his writing and directing. Oh, and don't get me started on the one-eyed pink and blue starfish and its babies smh. His story also had way too many plot and technical issues. Some scenes felt rushed, others never-ending, and some totally unnecessary.To me, this was a huge disappointment from the successful and much better first one. If they're going to come out with another one, please go back to David Ayer writing and directing it. At least his story had better continuity and was more cohesive and entertaining, albeit not that much of a comedy, of which I'm just fine with that. I'd rather have zero laughs, than cringeworthy attempts at humor. It's a very generous 7/10 from me.",
    "66": "This is worse than 2016 version. Had high expectations coz of James Gunn but it's just a stupid film. Nonsensical story. Uninspiring characters. Stupid jokes.",
    "67": "Ye I didn't hate the first suicide squad as much as some, and thought it was OK. So the idea of a James Gunn backed, more adult followup could turn out pretty well. And it has.This sequel/rebranding understands that focusing on some of the lamer dc characters means you can pretty much do what you want with them, and make an unpredictable movie. The movie is insain, action packed and has some decent gags in it as well. Even If not all of the wise cracking works.It's great to finally see Margot Robbies Harley Quinn actually look like Harley Quinn, but I couldn't believe the real star of the suicide squad is John Cena. Who was hilarious in it. Just don't take the mindless gritty action too seriously. The movie has polka dot man in it.",
    "68": "I think people are biased cause it's a James Gunn so its supposed to be amazing as all his other films are. This didnt have the great story, I didnt feel the emotion. I liked the gore but if it was a pg 13 it would have been a 1. I give it a 3 for gore. The action was decent but I've seen much better. No character development at all and I usually dont want any but it was needed here. For over 2 hours I should have felt something and I didnt . I didnt connect with any characters , come on you think there was a star lord? A drax? Not any better than the 1st film I liked will smith and Margot in the 1st film better. Sorry you have this one wrong!!!v oh and the Terrible CGI monster looked he was from barney cartoon . Not good go back to marvel!!!!",
    "69": "Definitely better than the first one on virtually every front, but still, the characters aren't terribly interesting in this one, the humour is very hit or miss (mostly miss, although I did chuckle a few times here and there) and the attempt of stylistic direction was a little too much for me. Some good performances here and there, but the actors aren't given a good script to work with. Some of the action is good, but it's mostly way too over the top. I think I get what they were going for and I get the whole weird obsucre character dynamic and sometimes it kind of works, but it never really did it for me.All in all, I was mildly entertained by this movie, but nothing more, so I wouldn't really recommend it.",
    "70": "Just awesome awsome awsome a laugh out Loud riot movie fun fun fun it's so mich fun wacky zainy and a laugh a minute, exactly! So It's awsome awsome awsommmmmm!e! Ohh my gosh WOW! Holding face\" slow sigh\" anyways i just thought you might like to know it's awsome awsome awsummmmmmmm. Infact it's actually kinda silly a little Bit kiddy and not really worth your time mate, have a good one. I wouldn't recommend.",
    "71": "I like all sorts of films but what the hell was this? It was like it was aimed at 7yr olds but with foul language and some violence. This made the first Suicide Squad film look good and as to why there are so many positive reviews, maybe a lot of 7yr olds did watch it and found the naughty words funny.",
    "72": "Don't know how on earth this has a rating of over 7 . . . The original Suicide Squad was a bad film, but this make it look like an absolute masterpiece.I managed to make it through 55 of the 2 and a but hours before I decided not to subject myself to any further torture. The first Suicide Squad wasn't good and I wouldn't watch it again but at least it wasn't bad enough that I couldn't even bear to watch half of the film.It tries to be funny but its just really, really truly awful. Seemingly tries to be like Deadpool, but Deadpool was funny and this just isn't in the slightest.This is really like a very bad B movie both in all aspects.",
    "73": "Apparently, this film is supposed to be a superior alternative to the first Suicide Squad film, which was universally panned. But surprisingly, both my hubby and I found this one to be a silly misfire. The monster-villain is a laugh out loud giant starfish that looks like a leftover from a Ghostbusters ripoff. The patter is flat and unoriginal, and the true star of both installments, Margot Robbie, doesn't shine nearly as brightly as in the original.Don't believe the hype: this one's truly a dud.",
    "74": "Why, why, why do I even waste my time by watching such drivel. It's REALLY true. Every movie looks the same these days. Find something better to do. Reading a book is the first thing that springs to mind. Don't let your gray matter atrophy and go to waste!",
    "75": "I saw all the great reviews and was excited to watch. But what the hell did I just watch. What a mess. Hope you enjoy it better then me. I must have missed something.",
    "76": "I had such high hopes for this movie. Great director, great cast & a concept (suicide squad) with tons of potential. Yet like so many recent movies, it seems like the writing was done by amateurs. Many of the jokes were elementary school level humor yet the violence and gore were adult. So i ask, just who was this movie meant for???After watching this, the first suicide squad movie looks like a masterpiece. It at least had character development and by the end you could actually care about a few of them. It also had a more coherent, mature and entertaining story. This movie didn't have any of that. It could have still been goofy without being dull if it was written better.Overall a huge disappointment, all i can say is that i'm happy it was on HBOMax because i would have been angry had i paid movie theater prices to go see this garbage.",
    "77": "2 hours and 12 minutes if people saying and doing things no one would've easy or do. Incredibly disappointing as the cast was capable of so much more and clearly got screwed by the director and writers.",
    "78": "If this is the future of our movies, then heaven help us. If it is a one off shlock jock type film , then fair enough.Just dont expect me to pay for this steaming pile of crap.The future of cinema is doomed with this junk.",
    "79": "So basically, just make a movie of weird people with weird powers, make it somewhat funny and show a lot of gore, and you've got a hit on your hands! I'll stick to watching animation movies, thanks!",
    "80": "I went into this really expecting, FINALLY, a decent DC movie after a 10 or so year wait. I was not impressed.Zero character development (or really any time spent with any of the characters), a paper thin plot, fairly unimpressive effects (as per usual for a DC).It was occasionally mildly amusing, I always like Harley, though there really wasn't enough of her.I suppose it's a bit more blood splattered, if that's what gets you off, and there's a smile to be had here and there.",
    "81": "Without a doubt, this is the best DCEU movie to date.The story is good and very well executed. All the characters shine in their own way. The action is created with taste, the effects are great and the colors...the movie looks gorgeous!It's fun movie, as you may expected, but it also has a heart. James Gunn has found the perfect point and combined things great in \"The Suicide Squad\".This is definitely the best DCEU movie for me and I believe it will become the one for many people too. It's light years better than the 2016's one.It's not \"The Shawshank Redemption\", but it's a damn good movie.",
    "82": "Pacing of this movie.is all over the place. We do have some exciting spots but most of it gets rather unbelievable and predictable. Catch on streaming services.",
    "83": "5/10 - I guess it was just me, but the biggest flaw at least in my opinion of 2016's Suicide Squad: the pacing, still plagued this new installment with Margot Robbie and Viola Davis' performances being the film's only saving grace.",
    "84": "I Didnt realy enjoyed the movie . John Cena as an actor is very bad and look very silly trough the all movie. Idris Alba is more convenient as a leadership of the new Suicide Squad . I found the movie pretty boring all along and didnt give me any reason to give my interest to it . I enjoyed some jokes that they made sometimes and the action scenes are pretty well made but its just spectacular nothing meaningfull or we didnt already seen before . The only thing that keep me watched this movie is to know how it will end and what will happened to Harley Quinn and the others members of the Squad . The visual Effects are still pretty well made but the story is pretty classic and dont give the same interest as the first one who were a little bit more interesting (characters past , reason to have empathy or reason to their behavior). I Didnt really enjoyed it and the most disgusting at all scene is when a guy is shot when he has no pant on him and we can clearly see his dick , so pretty graphic sometimes , just be aware about what you are watching .",
    "85": "I don't know how this movie is rated 7.4\nIf it wasn't Idris Elba...\nIt would be a zero.Idris Elba, and one good scene with Harley Queen...\nThat's all the movie is about.",
    "86": "Contrary to what I read some critic write, it's not even as good as the first one--far from it. Hard to believe this is from the director of the finest superhero movies of them all, \"Guardians of the Galaxy\".",
    "87": "After reading so many reviews 'best dcu film' 'what the 2016 film should have been' I expected more than what I got. It's not that funny and it's not that serious, it sits in a weird place. I thought the 2016 film was better to be honest. Harley Quinn's character is getting tired, Bloodsport has the same back story as Deadshot and the biggest disappointment was the end boss.. a giant starfish, I mean WTF. It isn't crazy or totally out there it's just stupid. Was waiting for the end by the end.",
    "88": "Such a forced movie, not even remotely entertaining. The jokes fall flat and are actually quite boring. Where is the creativity Hollywood?",
    "89": "I liked the first Suicide Squad, Birds of Prey was fun and I was looking forward to this one but I can't believe the rating is so high for this movie. I love the cast but everything felt forced...the comedy, the sentiment, the violence, even the plot. I really wanted to like it but it just didn't work.",
    "90": "Dumb movie for a niche market I guess.I just didn't get it. Maybe it's me.",
    "91": "Characters and plot were terrible. DC takes another L.",
    "92": "Don't waste your time, seriously. Shot terribly, horrible pacing. Parts of it feel like a B-TV show w/ generic music laid over poorly made scenes.Hard pass.",
    "93": "This is an odd movie, its gory, violent, trying to funny with flat humour and it has a somewhat decent cast. I do not know whats wrong here but i guess the movie spins to many character plates all at once and tries to give all of them some sort of \"reason\" to be there or simply be sad. Because somewhere someone thought sad story background makes good characters.No spoilers here\n1/10.",
    "94": "This was the first suicide squad I've seen, so because I'm not judging it against the other horrible DC movies, my take is a little different.I don't like any of the characters they are trying to get you to like. The painfully absurd back stories of each, trying to switch from typical James Gunn funny over the top comedy (which isn't funny in this context) to a serious scene trying to explain each character doesn't work that well.The evil plot is dumb. Either Rick and Morty ripped it off, or the writers of this ripped them off.I guess I just don't like the suicide squad and nobody can make these silly characters likeable for me.",
    "95": "I feel like I'm missing something profound but all I can get from this is stupidity. A good movie keeps you from noticing you're watching it. This keeps bringing to mind the same question... What am I watching?",
    "96": "This is a comic book in a movie format. Cheesy, hokey, predictable etc. But it's a fun, action packed escape from reality. With a good soundtrack. John Cena is good for a change too.In a time when Marvel movies have gone woke, this film is 'Unisex'.",
    "97": "I wanted to like this..I like all the others. Great cast, with the exception of Cena. So..why was it so bad. I'll state it like this, did you like Saturday morning cartoons when you were growing up? This is the movie. An Alien starfish? Cena's costume is what? The writing, acting all out of the Saturday morning cartoon playwright..lol..sad..",
    "98": "The only possible reason this was green-lit is to make its predecessor sound better.What the heck happened to the reviews? How is this flop of a movie getting 7.6 out of 90k votes? I really had to take a moment and check if I got the wrong rating. The critics who praised this should be ashamed of themselves. They're culprits in this ripoff and are responsible for your wasted money on this scam! This movie is so awful! It's almost hilarious watching the supposedly emotional sympathy-provoking scenes. Don't get me started on the CGI characters and the rats! Disgusting and stupid!",
    "99": "The movie was action packed with great humor. And the soundtrack was legit.",
    "100": "I liked Groot when he was a tree and not a Shark! Or a Weasel. Just sayin. And killing off the group of 'heroes' early on, right after they were assembled, well, seemed a bit too similar to what happens in Deadpool 2.Speaking of Deadpool, they really tried hard to make this a swear fest, but it comes across as pretty juvenile. The gore was good, but all of this could not make up for the fact that the dialogue was weak (humor? I didn't laugh), and the plot made no sense. If their mission was to destroy the evidence, why didn't they just send a drone or fire a cruise missile covertly and blow up the installation. It made no sense, whatsoever.The worst part about this movie was there was no charismatic lead. Yes Harley Quinn took up a lot of screen time, but she was NOT the lead. She was still a side character to the main group of Suicide Squad characters led by Idris Elba. Idris is a wonderful actor, but a lead in a dark comedy, he does not carry it at all. Will Smith, maybe could have pulled it off if he had returned, Idris is just too much like Jason Momoa, delivers the line, looks pretty, but doesn't have much range.So if you're looking for a poor man's Guardian Of The Galaxy meets Deadpool ,then this is your film. Otherwise, if you skip it, you won't be missing anything.",
    "101": "How does this get such high reviews?Stop, start forced humour violence and gore. That pretty much sums this film up.When you end up saving the planet from a giant Starfish you know this will be as bad as effluent on the beach.Idris Elba is great as are plenty of others but the plot is just ridiculous. I was hoping that this edition would do justice to the first but forget it.",
    "102": "This was by far one of the dumbest, worst acting movies I've seen in a long. It was the R version of the power ranges.",
    "103": "This movie is filled with good humor, along side with great serious moments that James Gunn never failed to make with his GOTG films. I love the characters in this movie and the gore was visually guresome to watch. I know by the trailer it looks like some characters were going to get killed off so that it would be easier to focus on lesser characters, but I wasn't expecting them to get killed off so early which was a little disappointing. This movie was all over the place, it's a crazy film and way better than the 2016 version.",
    "104": "Awful movie. Don't waste your time. I didn't care for any characters, no real plot, terrible acting.",
    "105": "40 mins in and the whole tongue in cheek storyline is wearing thin. This whole genre is tiring and this movie is the biggest example of its waste of time.",
    "106": "A comic book movie about a ragtag group of convicts, who are enlisted to cover up a monster of a conspiracy. Gunn clearly understands this genre, proving once again that he can juggle multiple characters, while giving each a moment to shine. The raunchy and tangential jokes don't always land, but that's all part of this band of anti-heroes' charm. Overall, really enjoyed it. Probably my favorite DCEU movie to date.",
    "107": "Poor writing and acting, extremely cringe at times. Only good character was a CGI Rat called Sebastian, kind of sums it up? Story line just was a mess at the beginning and that's not because 'I don't get what the movie is' it was just rushed and felt like a GCSE drama piece. I hope these actors never watched this movie because it would be like a cringe memory you can never forget and toss and turn at night thinking about until you reach your death bed. I actually preferred the first suicide squad compared to this one which is scary to say out loud. Only watch if you have a thing for giant star fish and bad acting!",
    "108": "Man oh man. I don't even know where to begin. All I know is once I saw the cast for this movie, it was either going to be sneakily very good, or absolute garbage, and i'm sad to report it's the latter.First off, movie starts off with no kind of character building and just straight word vomit of exposition, versus the stylish ways they introduced us last iteration. And then first couple lines in, you can tell what kind of new age nonsense this was going to be, nowhere near the vein of any top superhero films. Or even strictly DC films lol.Tone, right off the bat felt super weird and try-hard. Almost as if James intentionally made a very bad mock version of Guardians of the Galaxy. A \"blockbuster\" movie with Pete Davidson and John Cena couldn't be destined for greatness imo, and I think I was right. Cast also seemed like they had a hard time with the lifeless script, Idris especially.Another thing with these new-age blockbusters, none of them make us think anymore, feed us everything like we're dumb. Last movie that made me use my brain in an enjoyable way was \"Knives Out\" and that was a needle in the haystack.All in all, this movie comes off as if a new graduate film student had access to a Hollywood budget, and went with his first crazy with his \"idea\". Nobody told him this was a flaming pile of mess. And I personally enjoyed the first one better. Realistic dialogue, meaningful action, some enjoyable characters.Only got up to an hour with this version because I couldn't sit through the stiff jokes/acting anymore. This movie relies heavily on shock factor, slapstick humor, and looking good rather than focusing on the characters FIRST. Which a lot of blockbusters are doing now, because apparently we're dumb and eat up anything. Hopefully this is the start of not rewarding mediocre material, but judging from this rating....Oh and DC always goes overboard with the live-action villains for no reason.",
    "109": "The moment I saw James Gunn's name I knew it would be a good movie! He made the Guardians famous and saved the suicide squad. The characters were all great, funny and weird, exactly how the suicide squad should be. I hve no words, it was easily one of the best DC movies I've seen the last few years. More of that DC, give us more of that! I enjoyed every minute of it and I recommend everyone who didn't like the first movie to give this a chance.",
    "110": "Very poor writing, they tried too hard to make it funny which made it cringe. The acting was poor. I'd love them to hire someone who can put a good storyline together and actors that don't try too hard. Such a shame.",
    "111": "A lot of hype around this movie and, honestly, I don't see it. The movie was just okay in my opinion. There was action, some laughs and definitely blood but it does not live up to the hype in my opinion.",
    "112": "Right off the bat this movie does the thing I hate in movies where it introduces a bunch of characters and then kills them, along with a character I liked in the first Suicide Squad movie. Then they do the \"3 days earlier\" cliche, so what little emotional currency they built up is now gone. Idris Elba having a back and forth shouting match with a teenager is a scene I did not know I didn't need in my life until now. I think the filmmakers decided they need a new Diablo for the audience to care about so they brought in Polka Dot Man, way to do the same thing two movies in a row. This being my third Harley Quinn movie, I'm really tired of her long monologs on her love life. This movie has some good parts and some James Gunn styled funny beats but this is not a 7.9 film. Is it better than the first Suicide Squad? Yes, but not by much.",
    "113": "In \"The Suicide Squad,\" the action-packed sequel to \"Suicide Squad,\" the thrill starts right from the beginning. Set in a lush jungle on a mysterious island, the movie immediately captivates the audience with its promising backdrop. The second installment outshines its predecessor in various ways, particularly in the realm of characters.While Will Smith's performance in the first movie was rather commendable, Idris Elba takes the reins in part 2, displaying his immense talent and becoming the perfect leader for the squad's perilous missions. The addition of Peacemaker brings a refreshing dynamic to the team. Harley Quinn's character undergoes significant development, making her role even more delightful. Unlike the first movie, where some superheroes seemed out of place, each character in \"The Suicide Squad\" has a well-justified presence, contributing to a greater character arc.Engagement and entertainment remain consistent throughout the film, with very few dull moments. The writers skillfully follow a classic approach, bringing the story full circle by ending with a scene that harks back to its origins. Among the diverse cast of superheroes, Bloodsport shines as one of the best, while ratcatcher 2 also impresses with her captivating performance.While the script is engaging overall, there was one instance that seemed implausible even in a lighthearted context. A character's head is chopped off, the peculiar part was that his eyes continued to move. Although this added an element of dark humor, it might have stretched the bounds of believability even within the superhero genre.In conclusion, \"The Suicide Squad\" surpasses its predecessor by delivering a gripping and action-packed adventure. With improved character development and a smart balance of humor and action, it keeps the audience entertained. Director James Gunn masterfully crafts a superhero spectacle that fans and newcomers alike thoroughly enjoy.",
    "114": "Remember when James Gunn was 'temporarily' fired by Marvel Studios and we were all disappointed by the decision? Well, it turns out that was a blessing in disguise when Warner Bros. Booked him for a slot of this movie and months later, he was reemployed by the giant-sized company for GOTG 3 and he just killed two heroes with one stone. 2021's The Suicide Squad is indeed, THE Suicide Squad that we all deserve!The most outstanding thing about this latest squad is the way they blend and mix in everything into the recipe. It's like you're watching a bunch of genres; comedy, dark comedy, fantasy, action, thriller, drama, superhero, spoof and commentaries; political, social contexts, world revolving issues all together and yet, it tastes très bon! Often enough, movies that try to do everything together fail big time but not this one. This is a cinematic achievement.James Gunn, who also directed Guardians of the Galaxy, knew that the Marvel/DC films have rehashed their materials multiple times; basic origin, romance, giving up, final battle. Hence, Gunn develops a non-formulaic approach that seems suicidal at first but triumphantly creates something unique and unpredictable. From the get-go, Gunn's vision is unconventional but polished, enough to make the audience feels they have never seen anything like it before.Talking about unpredictability, it indeed is what it is. You never know what will come next, who will die or survive. There are a few times that Gunn uses the head fake technique to deceive viewers from its sequential but engaging storytelling. Like Deadpool, something unexpected happens at the moment when you least expect it.The juxtaposition of both the 2016's and 2021's is evidently visible. While 2016 has its moments, almost everyone could agree it was disappointingly bland af. The 2021 entry has a strong direction and far better pacing, let alone twists that are fully captivating. The only couple of things that 2016 did it better were the trailers and the soundtrack.The Rated-R is straight up hardcore to the face. It's superbly gory, darkly comical and unabashedly funny, all without pulling its punches. This is how DC films should be, not as dour as Zack Snyder's but not as light as Marvel's either.When it comes to flaws, albeit its powerful opening scene, I feel that they waste many of the potential characters here insofar some of them never even got the chance to show their abilities, skills, talents or superpowers.I am also not impressed by the intensity of the movie's brightness particularly on the background in some scorching white scenes. It defaces the texture of the film and should dazzle some viewers, left distorting of what could have been an iconic scene like the slo-mo segment.All in all, 2021's The Suicide Squad makes for a suicidal task with flamboyantly sheer colourful characters that collectively sign up for one thing amidst this pandemic chaos; blasting out loud the volume of fun and violence, subsequently climbing to the top as the best DCEU Film ever made.",
    "115": "I remember as if it was yesterday my utter disappointment in 2016 when I purchased my tickets to watch Suicide Squad back then. No hate towards David Ayer, the studios definitely meddled with his film to the max, I would LOVE to see his version but nonetheless, what we got was such a terrible film.... Fast forward 5 years & Warner Brothers turns the tables and makes what is probably one of the GREATEST comic book movies of all time. The film is very ballsy, violent & full of heart. The characters are eye candy & I'm VERY happy that James Gunn kept what worked in the original. Because it was a bad movie but there were some good in it. This film James really respects David Ayers film by keeping what worked while just sticking to what needed to be done. The R Rating was needed, I'm also glad the studio acknowledged that. I'm VERY Tired of seeing studios go for a PG-13 rating so they can get more views. Like cmon now, grow a pair please. Sony doing it with Venom & all other types of examples of studios fearing the R Rating... I think ever since Joker Warner Brothers has discovered that they can really get the same numbers if not more regardless, Then Birds Of Prey happened, which I enjoyed too. BUT my point is ALL of this led up to this movie RIGHT HERE. So again, kudos to Warner Brothers for the R Rating!!! Now first things first, The action is GREAT & the twists are even more magnificent. The Comedy is SPOT ON, and lands when it needs to, the use of dark comedy and balance of character development is done so well that it doesn't feel out of place or that one is taking over the other. BloodSport carry's this movie, his performance was SCREAMING Will Smith for me, (meaning the role just looks like it was meant for him because he had daughter issues too) but I gotta say, Idris Elba grew on me more than Will Smith did. His performance is GREAT and he has amazing chemistry with another character and it just feels special. Polka Dot man was absolutely hilarious yet gave me a bittersweet taste in my mouth, but in a good way. King Shark was an amazing joy to watch on screen. Peacemaker was awesome too. Now what I mean by awesome is off their importance, performance and role in the movie. Some of these characters are not like able... mind you... and some things will happen over the course of events and make you not like characters more and that's where this movie shines. It's VERY unpredictable. And when you feel like you think you know where the movie is going it pulls the rug from under you hard. Very enjoyable ride. When it was over I wanted to watch it again.*Pros*\nWell written characters / performances\nComedy/Action (is not repetitive)\nEffects/CGI\nStory / plot / script*Cons*\nThinly written Villain\nClimax for the ending felt just a bit thin wish it would have required more \"teamwork\" and not one character being the reason they won (you'll see what I mean)\nSome Characters I felt died a bit too soon and would have liked a little more depth before they went.WB needs to keep this up and we will continue to want more. If they understand the character they should know the direction needed to continue the character. Superman doesn't need to be dark and suicide squad should never be PG13. Not saying these are \"impossible to do\" but just saying if you REALLY understand the character you should know what works and what doesn't, and as far as I see it... this is the RIGHT direction for The Suicide Squad Peacemaker show is something to look forward to! And I will be more than happy to call this Film an \"The REAL Academy Winning Suicide Squad\" because it deserves the title more than the 2016 one... #releasetheayercut.",
    "116": "Before I talk about the film, let me talk a bit about DCEU. The difference between DC and Marvel (and why Marvel is more successful than DC) is the people behind them. The people/company behind Marvel (Disney) know and plan everything. They even planned this whole MCU thing ever since 2008's Iron Man. They know what they are doing, where they are heading with their characters, stories, and films, and how to do them and write them right. That's why their Universe is more successful. But, for DC the people/company behind it (Warner Bros.) are ruining this beautiful universe that's filled with great characters by bringing the wrong people to direct/write their movies which brings chaos to the films and world of the DCEU. Or they create issues with the right director like Zack Snyder (which we all saw how he was building that big/creative universe in Zack Snyder's Justice League (2021) and where it was going). However, this time DC choses James Gunn to write & direct this film which if you're not familiar with, he directed Marvel's Guardians of the Galaxy Vol. 1 (2014) and Vol. 2 (2017). And this is the second proof (after Snyder's) that when having the right person/people behind a film, they will kill it. And THIS IS HOW \"The SUICIDE SQUAD\" STORY SHOULD LOOK LIKE. And that's all thanks to James Gunn.So happy that the film got an R rating because the suicide squad story should be like that. It should be full of blood, comedy, craziness, violence, disgusting action scenes, and curse words. Thank god they didn't care about the film being PG 13+ or whatever so more people could see it. And I feel like James Gunn was behind that part. It's not a suicide squad film if there were no sexual, bloody, violent, and disgusting content.The cinematography was beyond amazing and the film presented some new ideas. Like, in one scene (dw no spoilers) two characters were fighting and we were seeing it through the reflection of a helmet. Or in a specific fight scene, instead of \"blood\" coming out of the bodies, it was \"flowers\" which made the 3 or 5 min action sequence very colorful and fun to watch. The camera movements were also great and felt that they sometimes were steady handheld which was so unique. Also loved how the film picks slow motion in certain times only to show the chaos that's happening around and they were very limited which is a good thing.For the third time, Margot Robbie proves that she is the best portrayal of Harley Quinn and I cannot imagine anyone other than her as Harley Quinn. She presents the beauty, craziness, and wildness of the character. Idris Alba really surprised me. His character was very well written and Idris played it so right. The real surprise was John Cena. Personally, I don't like Cena's acting. But, in this film his acting was alright and the thing that helped him is how good his character (Peacemaker) is written. Especially that Peacemaker has a huge impact on the story of the film and the future of DCEU. Daniela Melchior gave the film such a warm/soft vibe and her acting was well done especially in the emotional scenes. The whole cast was just amazing and each actor/actress played their role perfectly.Really loved the music in the film. And if you have seen Guardians of the Galaxy (2014) you'd know that it has the same style/vibe. The costumes were brilliant and loved how James kept the original costume of each character from the comics which made the film/character even more special & real. Also, loved how the film jumps back in time suddenly to explain where a specific character is or how things ended up that way and there was something different about it which I can't tell what it is.My rating is 8/10\nWATCHED: in an IMAX Theatre.",
    "117": "I have to admit I don't like the first Suicide Squad. And Birds of Prey is a bit boring. So when Harley Quinn come back for the third time I don't have high expectations. No offense to Margot Robbie, her performance is great but the story from both movie is just not that good.And enter James Gunn, this man totally change the game. This movie is way better than two other DC movies that I mentioned above. It is fun, full of action, and surprisingly gory. Something that I didn't expect before.The story still follow the same pattern. Convicted criminals with special powers were given the task to save the day. This time there are more characters introduced than before. I personally like the character King Shark, voiced by Sylvester Stallone. The chemistry between fatherly figure Bloodsport (Idris Elba) and Ratcatcher 2 (Daniela Melchior) is so good here.I like the comedy here, so chaotic. The CGI is believable, the action is cool, and as I said before, it's gory. So many blood splattered, body dismembered, throat cut, they're not for those with weak stomach for sure. I just wish there's more explanation in the end of the movie. But other than that, it's a good movie.",
    "118": "\"I cherish peace with all my heart. I don't care how many men, women, and children I need to kill to get it.\"The first thing that came to mind in the opening sequences of the film was wow there is a lot of gore, especially compared to the first film. I feel like the film makers took on criticism from the first movie and put improvements into this. To me, this was basically like an Avengers movie aimed at adults with violence, gore and swearing.The film is filled with a great cast who all do a terrific job, especially Margot Robbie, I couldn't see anyone else doing the role of Harley Quinn. She is to Harley what Heath Ledger was to the joker. The movie is filled with funny one liners and never takes itself too seriously. I felt the first Suicide Squad was bordering too much pretty humour and seriousness and wasn't sure what it was. This reboot blends humour and seriousness perfectly. Some of the scenes between John Cena and Idris Elba were hilarious, as well as the lines from King Shark.I wasn't expecting a whole lot from this to be honest based on the first film, but this delivers exactly what you would expect from a team of anti-heroes, it's funny, entertaining and aimed at a mature audience, and for me it's an 8/10.",
    "119": "The 10th movie in the DCEU and Sequel to 2016 Suicide Squad by WB (Not David Ayer)Some people will class this as a reboot when in actual fact it isnt, it is very much a sequel, still references the first movie, still carries on the arcs of the original characters while also bringing in new ones into task force x and going on a new mission (Just like in the comics)I found this movie fun to watch, R rated the way it should be, the squad still act like a bunch of crazed misfits while trying to save the world.That being said after seeing James Gunn untouched vision I really want to see David Ayer's true movie of HIS Suicide Squad before WB butchered it with 10 week reshoots, much like the infamous WB/Whedon Josstice League we finally got the REAL, TRUE, ACTUAL movie by Snyder.....Zack Snyder's Justice League, and I want the same for Suicide Squad 2016......#ReleaseTheAyerCut #RestoreTheSnyderverse.",
    "120": "I expected this to be bad, but the final film exceeded my fears. James Gunn struck gold with the first Guardians of the Galaxy, and the attempt to repeat that formula is apparent here - only it's amped up to the nth degree. The plot, if one can call it that, is one long exercise in subverting expectations. But Gunn is no M. Night Shymalan and no Monty Python either. This is pure randomness and lack of structure masquerading as subversiveness and edginess. I found myself reminded of the old Ren & Stimpy cartoon show at times, the bad later seasons, not the good early ones. Trying so hard to be edgy that it just becomes cringe worthy.This film reeks of studio desperation. It's Homer's makeup shotgun from the Simpsons in movie form. A bizarre, unfocused and pitiful smear of concepts, moods and sounds.Speaking of sound, the use of music in this film is awful. Different genres of songs are used randomly like in a late 90s Tarantino rip off. Most of the pop songs don't even work with what's happening on screen. Harley's escape is such a case. Frequently the score is interrupted full stop by sound fx or jokes. Again another attempt at \"subverting expectations\" and a simple trick at that. People expect music to go on, so when it's suddenly interrupted, they feel surprised. It's a dumb man's clever movie.It's not entirely without merit. Some of the photography is nice. Some of the acting performances are good (Polka Dot man, Idris Elba, the Shark and Rat Girl stand out) and some are awful (the villains, the nerds in front of the computer screens who do nothing but comment on things). Some of the character interactions are funny. Most are not.The first 20 minutes are amusing. The movie grinds to a painful halt in the middle and never regains its momentum. It's one exceedingly long, constantly interrupted, unfocused stew. Worst of all is the blatant disrespect this film has for its audience.I compare Marvel movies to fast food. Simple, safe, unhealthy junk food for the brain with very few nutrients. This is worse. This is vomit cooked up with artificial flavoring and sold as haute cuisine to people without taste buds.Bad as the original Suicide Squad was, this made me nostalgic for it.",
    "121": "As \"The Suicide Squad\" (2021 release; 140 min.) opens, Savant is released from prison and joins the rest of the Suicide Squad to go on a dangerous mission on a island called Corto Maltese. Soon enough, things go wrong, very wrong. But then we learn that another Suicide Squad team is getting onto the island. What the heck is going on here? We then go to \"3 days earlier\" as Bloodsport is cleaning the prison's floor. At this point we are 10 min. Into the film but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: this is the long-delayed follow-up to the original Suicide Squad film in 2016. Don't call it a sequel, though, as much (but not all) of the original cast isn't returning. It's more like a reboot, as if regretting how not very good (ok, worse than that) the 2016 film ultimately turned out. A reboot already? Yup, already. This one is written and directed by James \"Guardians of the Galaxy\" Gunn. One thing is clear: once the decision was made that the 2021 reboot was going to get an R rating, Gunn decided to make it as hard an R rating as possible. None of that matters of course, as long as the story line works well and the characters are fully developed. Alas, that is where this movie falls way short. There is no character development whatsoever, as if it is assumed that the viewer already knows these characters (some viewers may some of these characters, but surely not all viewers and not all characters). As for the actual story line, it's hard to say anything about it without spoiling so I won't. For me (and I realize this is a subjective view), it all made for scatterbrained viewing, and in the end this movie didn't do anything for me, sorry.\"The Suicide Squad\" opened wide in theaters this weekend but also was available for streaming on HBO Max, where I caught it. The initial box office reports are not very kind, and make this the lowest opening weekend gross ever in the DCEU. Of course, things are not helped by the rapidly surging and highly infectious Delta coronavirus variant (why, oh why, do TENS OF MILLIONS refuse to get vaccinated is beyond me). If you are a fan of the DCEU or the 2016 Suicide Squad or simply a Margot Robbie fan, I'd readily suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.",
    "122": "The problem with superhero movies. They can easily be po faced and pompous. The audience want fun from their superheroes.Marvel learned this hence why the colourful Thor 3 was such a contrast from Thor 2.James Gunn injected a lot of frivolous fun in the Guardian of the Galaxy movies.Even 20th Century Fox went off the wall with Deadpool. An X Man giving the middle finger to X Men movies.Only Warner Brothers and DC have ploughed on with movies lacking the fun factor.It's James Gunn to the rescue with The Suicide Squad, the follow on to the 2016 original.Harley Quinn (Margot Robbie) Bloodsport (Idris Elba) Peacemaker (John Cena) and some others including a shark that likes to eat humans become part of Task Force X assembled once again by Amanda Waller (Viola Davis.)Their mission is to infiltrate the island of Corto Maltese which recently had a coup. It also has a facility with something alien inside. To find out more they need to get to the Thinker (Peter Capaldi.)This is a zippy action movie that eschews the traditional three act structure. It plays fast and loose. It's faithful to its comic book origins.It is violent and darkly comic. It also has a lot of heart thanks to Elba and Daniela Melchior who plays Ratcatcher 2.Despite what looks like a scattergun approach Gunn also manages to add some political subtext to the film.",
    "123": "Rebooting a franchise five years after its initial release is never a good sign. I had a very bad feeling about \"The Suicide Squad\" when I watched the trailer, later confirmed once I got out of the theatre.The plot is bland and the characters are unbalanced. Too much focus is given to Bloodsport, Harley Quinn and Ratcatcher 2. The rest of the squad has really marginal roles. When you have talents such as David Dastmalchian, and you give them such small screen time, it is a real waste. At least the first movie did not have this issue. John Cena is okay as Peacemaker, but he could do a better job. Rick Flag, in the previous chapter, was essential to keep the team together. Here his part is significantly reduced. Honestly, the movie would be the same even without him. I have appreciated King Shark, that gave a hint of goofy comedy, and managed to release a bit of tension. Overall a downgrade, on the characterization side. A real pity, with more effort they could have done something unique and remake this movie properly.There are some creative visual effects and the CGI is wonderful. There is a lot of gore, violence and blood. I am happy that DC is showing some explicit images. This is exactly what I expect from a Suicide Squad movie. I am tired of this censored joke that Marvel is building up. James Gunn nailed photography and cinematography. On the technical side I don't have any remarks, for sure it is way better than its predecessor.The fact that this is a popcorn movie, does not justify releasing a film that has a flat storyline, dumping completely any form of character or plot depth. I am not expecting a meaningful movie, but I wish to see more logic, not just a bunch of action scenes. Probably this is what most of the fans want to watch, but does not cut it for me. The flick wants to be comedic, and at the beginning there are some scenes that are genuinely funny, but most of the jokes later on are very forced and not funny at all. If you are a fan of the DC universe, give it a try. It is still an enjoyable and entertaining watch, especially if you are with friends. However, this could have been way much better.",
    "124": "And that's basically it. There is not a huge deal with this movie, because is an idiotic movie with nothing to offer other than laughs and gore. As a fan of the \"Saw\" saga, you aren't amusing me with fantasy violence where bodies explode and we rarely see any real suffering. It's graphic, but it's not really that violent (except for Harley for like... 10 seconds).Then the jokes. I didn't laugh once. There is nothing to do here. I'm guessing the actors just didn't land the jokes for my taste, because I laughed alot with Pratt and Bautista and Cooper in the Guardians movies.And then the \"weirdness\". I just didn't care for it. Enjoy it you all, I guess? I'm not sure the director admitting it's going to make a dumb movie saves it from having to actually deliver a coherent story, a well paced story (instead of wandering in an Island) and good characters and/or villains. This movie has none of that... because it doesn't want to (it's pretty obvious)... which is pretty insane. But who cares because... Stallone is a Shark?",
    "125": "The film is very much a Stockholm Syndrome affair. I hated it the first time I watched it for all the reasons that have been listed before. Awkward pacing, forced humor, illogical actions by all the characters involved, inane dialogue and so forth.But I really wanted to like the film, so I watched it again.And again.And again.And after multiple watchings, catching the nuances and all the little details, I can say with confidence that my initial rating of a 1 was uncalled for.It's at best a 2.",
    "126": "James Gunn's much hyped sequel to 2016's disappointment 'Suicide Sqad' did not fare much better than its predecessor. 'The Suicide Squad' did its best to bring together mostly obscure anti-superheroes from the DC Comics universe, but aside from a few semi-bonafide stars like Margot Robbie's Harley Quinn, it overall was a letdown.Sure, John Cena and Idris Elba are two fairly bankable actors, and the return of no-nonsense Team X agent Amanda Waller (Viola Davis) was nice to see. But no number of throwaway cameos from the likes of Nathan Fillion and Jai Courtney to Pete Davidson could save this campy gorefest from itself.It's hard to tell what kind of film 'Suicide' is, but it's easy to understand it's basically a mockery of itself and full of irony. There are few actual comedic parts in here, even though the dialogue is written in a way that builds in one-liners intended to yield laughs. 'Suicide' is downright stupid, from the main villain they must take on to the sloppy reliance on CGI around virtually every corner.'The Suicide Squad' was supposed to restart this misfire of a franchise, but it likely will spell the beginning of the end for it.",
    "127": "I remember kind of hating this movie the first time I watched it. This time, I approached it with a more open mind, and while I didn't hate it the whole time, I still ended up hating it by the end. This is definitely a James Gunn movie. It's like Warner Bros handed him the project and said, \"Here you go, have fun,\" and he did. It's the R-rated comic book movie he's likely always dreamt of making. It's packed full of dark humor and weirdness. The problem is, you've got to be able to stomach it to be able to enjoy it. It's excessively gory and gross, and it gets old after awhile. I found it distasteful, and also uninteresting.The \"humorous\" dialogue is often crude and cringey. It was constantly bringing on the humor, but I wasn't laughing. It's all so silly.Much like David Ayer's Suicide Squad, it gets worse as the action picks up in the latter half of the movie. Starro is such a dumb villain. I felt like I was watching a twisted live-action SpongeBob horror comedy. It looks like something out of the mind of a 12 year-old boy who grew up watching too many violent movies. I just wanted it to hurry up and be over. James Gunn is going to need to rein in that wild sense of humor of his as he leads the DCU into the future.",
    "128": "The Suicide Squad (2021) is a movie we saw last week in theatres. The storyline follows a \"suicide mission\" on an island that needs to be executed and those who would execute the mission faces impossible odds. They need to infiltrate a base and destroy it. The base houses aliens set on world domination and has thousands of troops protecting it. Based on the odds and those selected for the mission, what could go wrong? This movie is directed by James Gunn (Guardians of the Galaxy) and stars Margot Robbie (Wolf of Wall Street), Idris Elba (The Losers), Michael Rooker (Henry: Portrait of a Serial Killer), John Cena (12 Rounds), Viola Davis (The Help) and Pete Davidson (The King of Staten Island). The storyline for this is very straightforward and the action scenes are appropriately over the top. The dialogue is funny and pretty clever and the film starts off very good. I really enjoyed the introduction of the characters as they are rolled out and the mission begins...and then the movie entirely falls apart. The focus on one character at a time as they executed their action scenes was terrible. It just become blatantly bad. I'm not sure if it was an artistic attempt or DC Universe sabotage by Gunn. The initial villain was very good and the movie should have probably stopped there; unfortunately, they decided one more super villain was needed, and it was an abomination. Overall there were aspects of this film that were entertaining and this film had some potential, but trying to be too stylish and creative sunk the ship of this having any hope of being good. The first one was much better than this. I would score this a 3/10.",
    "129": "And that's basically it. There is not a huge deal with this movie, because is an idiotic movie with nothing to offer other than laughs and gore. As a fan of the \"Saw\" saga, you aren't amusing me with fantasy violence where bodies explode and we rarely see any real suffering. It's graphic, but it's not really that violent (except for Harley for like... 10 seconds).Then the jokes. I didn't laugh once. There is nothing to do here. I'm guessing the actors just didn't land the jokes for my taste, because I laughed alot with Pratt and Bautista and Cooper in the Guardians movies.And then the \"weirdness\". I just didn't care for it. Enjoy it you all, I guess? I'm not sure the director admitting it's going to make a dumb movie saves it from having to actually deliver a coherent story, a well paced story (instead of wandering in an Island) and good characters and/or villains. This movie has none of that... because it doesn't want to (it's pretty obvious)... which is pretty insane. But who cares because... Stallone is a Shark?",
    "130": "The film is very much a Stockholm Syndrome affair. I hated it the first time I watched it for all the reasons that have been listed before. Awkward pacing, forced humor, illogical actions by all the characters involved, inane dialogue and so forth.But I really wanted to like the film, so I watched it again.And again.And again.And after multiple watchings, catching the nuances and all the little details, I can say with confidence that my initial rating of a 1 was uncalled for.It's at best a 2.",
    "131": "James Gunn's much hyped sequel to 2016's disappointment 'Suicide Sqad' did not fare much better than its predecessor. 'The Suicide Squad' did its best to bring together mostly obscure anti-superheroes from the DC Comics universe, but aside from a few semi-bonafide stars like Margot Robbie's Harley Quinn, it overall was a letdown.Sure, John Cena and Idris Elba are two fairly bankable actors, and the return of no-nonsense Team X agent Amanda Waller (Viola Davis) was nice to see. But no number of throwaway cameos from the likes of Nathan Fillion and Jai Courtney to Pete Davidson could save this campy gorefest from itself.It's hard to tell what kind of film 'Suicide' is, but it's easy to understand it's basically a mockery of itself and full of irony. There are few actual comedic parts in here, even though the dialogue is written in a way that builds in one-liners intended to yield laughs. 'Suicide' is downright stupid, from the main villain they must take on to the sloppy reliance on CGI around virtually every corner.'The Suicide Squad' was supposed to restart this misfire of a franchise, but it likely will spell the beginning of the end for it.",
    "132": "I remember kind of hating this movie the first time I watched it. This time, I approached it with a more open mind, and while I didn't hate it the whole time, I still ended up hating it by the end. This is definitely a James Gunn movie. It's like Warner Bros handed him the project and said, \"Here you go, have fun,\" and he did. It's the R-rated comic book movie he's likely always dreamt of making. It's packed full of dark humor and weirdness. The problem is, you've got to be able to stomach it to be able to enjoy it. It's excessively gory and gross, and it gets old after awhile. I found it distasteful, and also uninteresting.The \"humorous\" dialogue is often crude and cringey. It was constantly bringing on the humor, but I wasn't laughing. It's all so silly.Much like David Ayer's Suicide Squad, it gets worse as the action picks up in the latter half of the movie. Starro is such a dumb villain. I felt like I was watching a twisted live-action SpongeBob horror comedy. It looks like something out of the mind of a 12 year-old boy who grew up watching too many violent movies. I just wanted it to hurry up and be over. James Gunn is going to need to rein in that wild sense of humor of his as he leads the DCU into the future.",
    "133": "The Suicide Squad (2021) is a movie we saw last week in theatres. The storyline follows a \"suicide mission\" on an island that needs to be executed and those who would execute the mission faces impossible odds. They need to infiltrate a base and destroy it. The base houses aliens set on world domination and has thousands of troops protecting it. Based on the odds and those selected for the mission, what could go wrong? This movie is directed by James Gunn (Guardians of the Galaxy) and stars Margot Robbie (Wolf of Wall Street), Idris Elba (The Losers), Michael Rooker (Henry: Portrait of a Serial Killer), John Cena (12 Rounds), Viola Davis (The Help) and Pete Davidson (The King of Staten Island). The storyline for this is very straightforward and the action scenes are appropriately over the top. The dialogue is funny and pretty clever and the film starts off very good. I really enjoyed the introduction of the characters as they are rolled out and the mission begins...and then the movie entirely falls apart. The focus on one character at a time as they executed their action scenes was terrible. It just become blatantly bad. I'm not sure if it was an artistic attempt or DC Universe sabotage by Gunn. The initial villain was very good and the movie should have probably stopped there; unfortunately, they decided one more super villain was needed, and it was an abomination. Overall there were aspects of this film that were entertaining and this film had some potential, but trying to be too stylish and creative sunk the ship of this having any hope of being good. The first one was much better than this. I would score this a 3/10.",
    "134": "I am in two minds about this film.On one hand, I really did enjoyed it well enough.However, I'm in no rush to see it again and it was rather... dull... in places.Not something I thought I'd ever say about a James Gunn movie.The beginning is great fun, and I don't know where else they can take the Harley chatacter after this (other than maybe a prequel?), and there are plenty of funny moments with some great action beats.It just felt a little... I don't know.Maybe because Gunn was clearly let off the leash he didn't have to restrain himself and so moments that may have been handled with more care were allowed to simply explode?There is a lot of blood and gore, which is not necessarily a bad thing.As I said, I enjoyed it, and I will watch it again someday, I'm just in no big rush to revisit it.A generous seven out of ten.I've read the Suicide Squad and DC comics for a very long time, and all the low reviews with the 'restore the Snyderverse' hashtag can go away.",
    "135": "I must say after being thoroughly disappointed with David Ayer's Suicide Squad back in 2016 and knowing just how disruptive Warner Brothers can be with Directors and their initial vision, I had relatively low expectation and hopes for 'The Suicide Squad'. That being said, the trailers were fun and Grandson released a fantastic tie in track which has been my song of the summer so I was ready to be proven wrong and boy was I? James Gunn's The Suicide Squad is an absolute joy to behold. It is relentlessly violent (uncomfortably so at times), hilariously funny and the thing I expected least, emotional; I cared about each and every member of the team despite the tagline's suggestion to not get attached and was on the edge of my seat from the absolutely bats*** intro to the touching climax. It's impossible to pick a standout performance as everyone was wonderful but if I absolutely HAD to? It would be Idris Elba or Daniela Melchior. They brought so much warmth and heart to the film and it's difficult to pick out anything I didn't like about their performances. In fact? I loved this whole film. I'm sure if I sat and really nit picked I could find plenty I didn't like but the sheer enjoyment I felt watching it and the surprise at just how much i enjoyed it surpasses any critique I can give it. I will say though, this is NOT a film for the squeamish! From credits to credits this film is brutally violent and even those with a strong stomach are gonna get some bang for their buck. If you're a self respecting comic fan or just like a good action blockbuster, give this one a chance, I think it'll surprise you.",
    "136": "I truly struggle to understand any of the positive reviews of this film.A soulless cash-grab, much like the first is all you will get.This edgy style of cinematography used might impress the kids, but really it was just a poorly made mess, trying to be like Deadpool.CG was poor, action sequences were messy, costume and set design was bland, and the overall story really was quite boring.Most of the jokes were taken straight out of other successful comedy films and series. Despite being a quite bizarre film, it seemed to lack any unique qualities.Surprisingly, I found the performances to be very poor. Idris Elba was great as usual, but the rest of the cast felt extremely armature. Even Margot Robbie, who's performance in the first film was the only positive, was cringy and bland.I really struggle to pick which Suicide Squad film is worse, so let's just say they both absolutely suck in just about every way.",
    "137": "Once again a man's daughter is used as bait to get him to join - just like in the previous suicide squad movieonce again the music stops for cringey one-liner jokes in the trailerat least this time harley isn't exactly the main character, after 2 previous films she lead that suckedbut everyone's a worthy opponent until she shows up - then all the bad guys conveniently stop shooting or attacking whatsoever, waiting to get shot because sHe iS sO pOwErFuLbut - at least the other characters are likeable - shark guy and rat girl were cool, and so was bloodsport, even the generic muscle white guys who I'm sure noone will complain about that promote unrealistic body typesbut yeah, who needs to improve or write new ideas, right? Just make harley flawless and have her kill men - that totally worked the other two times, CorPoratE fEmiNiSm!!111so yeah, this isn't a good movie, but the violence is fun, characters are somewhat likeable, and it's not taking itself as seriously as the first suicide squad, so the cringe is slightly less.",
    "138": "The smartest move DC ever made was to quit concerning themselves with cinematic world building and focus on making (mostly) standalone films that were simply entertaining...and didn't require a master's degree in Snydernomics to appreciate.Their second smartest move was nabbing James Gunn for The Suicide Squad, and not just because the first film was terrible. Material like this needs Gunn's flair for irreverence, clever dialogue and, most importantly, instilling characters with engaging personalities. He may not have created Suicide Squad, but this adaptation has his stamp all over it.And for the first time since his directorial debut, Slither, Gunn is unbound by the restrictions of a PG-13 rating, something else the material really needed. Hence, the film is vivid, violent and vulgar, yet at the same time, seldom feels pandering or gratuitous. Punctuated by gobs of gags and hilarious dialogue, the movie earns its dismemberments and f-bombs along the way. In fact, the whole thing plays very much like Guardians of the Galaxy without a filter.And like Guardians, it's ultimately the characters that matter. Ironically, the one we're most familiar with - Harley Quinn (Margot Robbie) - is the least interesting, perhaps because she's already been established with two previous films and there isn't much more Gunn could do with her. But everyone else is wonderfully realized and played perfectly by the ensemble cast. As Bloodsport, the de-facto leader of this new team, Idris Elba strikes the right balance of stoicism and uncertainty, while John Cena (as Peacemaker) once-again demonstrates he's more adept at comedy than pure action. Polka-Dot Man (David Dastmaichian) and Ratcatcher 2 (Daniela Melchior) are also fun, each with amusing backstories. But King Shark steals every scene he's in, a perpetually hungry manfish who manages to be both monstrous and endearing (and a role Sylvester Stallone was born to play).With the exception of Task Force X director Amanda Waller (Viola Davis), the antagonists are perfunctory. Their plan, however, is gloriously insane; the dictator of Corto Maltese plans to wipe out America using a 30-year-old experiment gone wrong: Starro, a giant extraterrestrial starfish that spawns face-hugging offspring to re-animate & control the dead. This leads to a final act that's as hilarious as it is grotesque, aided by amusing visual effects.Unlike the first film - which was mostly just bells & whistles - The Suicide Squad is the complete package, delivering an abundance of action, humor, violence and well-realized characters. James Gunn's playful approach is just what was needed, making it the best - and maybe the smartest - DC film since Christopher Nolan hung up his spurs.",
    "139": "I think it's pretty obvious that James Gunn doesn't agree with me about ensemble movies, not that he thinks they're easy, but that we differ on how good ones are constructed. I feel that ensemble movies are hard because you have to create a variety of different characters all swirling around one thing, and that their journeys need to interrelate on some level beyond the mechanics of plot to help reinforce the central point of the film. Gunn sees ensemble pieces differently. He seems to see them as large canvases for him to fill in with whatever his imagination deems amusing at the time with little regard to structure. There's definitely entertainment to be had with Gunn's approach, but I ultimately find it a frustrating kind of entertainment that's fun in spurts but ultimately feels like its constantly stopping and going instead of being handled by an artist who understands exactly where the narrative train needs to end up.Gunn's haphazard approach to structure often works against him, but I feel like his opening to The Suicide Squad actually works fairly well. We are introduced to Task Force X, a team of half a dozen criminals with super abilities sent to the small Caribbean nation of Corto Maltese. Led by Rick Flag (Joel Kinnaman), they land on the beach in the middle of the night and immediately get wiped out by the local army leaving only Flag and Harley Quinn (Margot Robbie) alive. This is told through the eyes of Michael Rooker's Savant, brought into the mission and our very quick introductory eyes into the rules of the world, including the pressure that Amanda Waller (Viola Davis) brings to convincing these prisoners to go on her missions for her, and ultimately how she deals with people who refuse her orders (heads go boom). All of this mission, though, was a mere distraction for the actual force with the actual mission, though, and the way the film jumps from the distraction to the real team and then back in time three days to see how the real team was formed is an amusing misdirect that I feel like is a fun way to begin the film, especially when you consider the gore that Gunn loves to wallow in, being able to put it all on full display with this R-rated DC comic book movie.The real team is led by Idris Elba's Bloodsport, an assassin who can't miss, followed by John Cena's Peacemaker, David Dastmalchian's Polka-Dot Man, Daniela Melchior's Ratcatcher 2 (her father was the original), and Sylvester Stallone as the walking shark Nanaue. These five have the mission of finding Jotunheim, a secret installation, home to Project Starfish, and destroy it after the country of Corto Maltese has fallen to a military coup. This cast of colorful characters gets moments throughout the film to highlight their unique personalities, and there's interest to be had here. If I had to pick a favorite, it would probably be Polka-Dot Man, subjected to alien experiments by his mother that gave him an extra-terrestrial virus that manifests in the form of circular, primary-colored discs that he must expel in one way or another twice a day. The problem is that his back story comes at the most random time where all progress in the story unnaturally comes to a stop for him to tell his tale.And that's the sort of thing that happens to all of them except the characters that we already know, Flag and Quinn. In between, there are definitely amusing bits like the competition between Bloodsport and Peacemaker as they walk into an enemy camp, brutally murdering enemy combatants along the way to the central tent, trying to one-up the other with Bloodsport realizing, in comedic fashion, that Peacemaker had the better time of it than him. But, instead of moving on with the story, the effort to capture the scientist in charge of Project Starfish to get them inside, we have to catch up with Quinn who has been captured by the military and brought to the president because he had fallen in love with her. Again, this isn't necessarily bad stuff, but it's the story grinding to a halt completely to tell what essentially amounts to a nearly unrelated short film.I will say this, I think this is the first time that Harley Quinn feels right. I don't have a lot of history with her, having only watched The Animated Series a bit as a kid and never reading her in the comics, but moreso than in the original Suicide Squad and definitely more than in Birds of Prey, Quinn feels like an interesting character as she kills the president because she got a bad feeling about him, and she made a promise to herself to do the right thing the next time she got a bad feeling about a man she was involved with by murdering him. When she breaks out of captivity on her own, it's the absolute best use of her from an action sequence standpoint so far. Gunn knows to give her lots of guns and plenty of environmental tools to make her sequence where she kills several dozen soldiers feel believable, and the effect of taking it somewhat subjective by having flowers explode everywhere as the sequence crescendos is actually quite nice to see. My problem is that this sequence feels like it could have been pretty much cut completely and we wouldn't have missed anything particularly important to the actual story at hand.The actual story, if you were going to dig through the morass of different threads, seems to be about American efforts to push off its dirty work onto third-world countries, and it doesn't really manifest until something like 90 minutes into the 130-minute-long movie. America hired Corto Maltese to study a space starfish that expelled smaller version of itself that attached to the faces of people and starts controlling them, turning them into extensions of itself. The rest of the film is this huge battle to take it out, using everyone's special abilities to attack Starro in a weird version of the ending of The Avengers (I would be surprised if Gunn wasn't consciously mirroring the MCU team up movie), and it's nice to look at.That being said, though, it ends up feeling like a purely technical exercise because it's just the latest in a series of events. It doesn't feel like the culmination of a story. The whole 90 minutes that preceded it was a random collection of moments of people, connected only by the barest of mechanical plot strings. There's nothing thematic undergirding the earlier moments that brings them together with the larger plot in the form of the giant Starfish that attacks the city, so I end up looking at this finale as mere spectacle and nothing else. It's pretty in the Gunn twisted kind of way, but I end up feeling like it's really empty.I know this film is getting pretty universal praise, and I sort of get it. It's thinly entertaining, but it doesn't really gel overall. It's the best the DCEU has been since Shazam!, though.",
    "140": "A coup has occurred in the island nation of Corto Maltese. The new government is antagonistic towards the US, threatening to reveal a top secret US project on the island. Another Suicide Squad is assembled, this time to infiltrate the island and destroy the project.To my surprise, I enjoyed the original Suicide Squad (2016) (and by the reviews I believe I was the only person in the world to feel that way about it!). I generally dislike superhero / comic book movies and that's probably why I enjoyed it. It was hardly a superhero movie - it had very little of all that superpower mumbo jumbo and nonsense - and, while still having some great action scenes, was quite funny and never really took itself too seriously. It was essentially a comedy-action film rather than a superhero / comic book film.Birds of Prey (2020), the sequel focusing on Harley Quinn, carried on largely in the same vein though wasn't quite as entertaining.After these I was expecting The Suicide Squad to be something similar: funny and avoiding the superhero bs, or at least playing it down. It tries to be funny but, unfortunately, insists on being superhero-heavy, to its detriment. We have lame nonsense like a half man-half shark, some dude who throws polka dots around, one villain who belongs in Hellraiser, another that belongs in an aquarium.There are some funny moments though with some great one-liners and generally sharp dialogue. It can be quite fun at times though this is often immediately followed by something that's just plain stupid and makes you think of watching something else instead. It's a roller-coaster ride in that respect.",
    "141": "This year already sucked, but seeing this movie made it worse. I'll give you a brief and simple rundown of why all the negative reviews are true.-All of the dialogue is sloppily written and the comedy is at the level of middle schoolers. There is no chemistry between any characters and the script tries to be more intense and meaningful than what it really is.-The humor is dreadful. Everything is \"state the obvious.\"\nCharacter 1: Is that rat waving at me?Character 2: It appears it is.Character 1: Why?Character 2: Because it's friendly?Also there's nothing but dick jokes, middle fingers and bathroom jokes. There is no brain or thought put into the comedy. Ex: \"Mario kart-racing d-bags\" -Harley Quinn.-The movie is horribly paced. First it's fast (which I can get behind) bc it assumes you've seen the first movie, then it slows down tremendously, then speeds up again, and it's on repeat like this for the remainder of the movie.-Gore is cool but they overdo it.-It tries to do something different which I can give it credit for but it's not executed properly which defeats the whole purpose.-I only saw the movie as a true Harley Quinn fan but I hate how they don't know how to write for Harley Quinn in anything since the original cartoons.I expected much better from this movie but it's just extremely disappointing. No wonder no one really saw this movie.",
    "142": "I honestly don't get why they keep trying to force suicide squad to work in film form when it just doesn't translate well to screen. Gunn tries his same GOTG style with the DCU and while visually and stylistically it's an objectively fun film to watch, the comedic overtones never land well. I may even prefer Ayer's brand of humor and even that wasn't even serviceable for the most part. The cast has such a weird dynamic and once again Margot Robbie is scathingly annoying but a bit more tolerable . Joel Kinnaman and Idris Elba are the standouts without question but they feel way too above the rest aside from Cena at times which can be unexpectedly brilliant in parts. The action is pretty well sequenced and delivered but as I said earlier the CGI can get down right bombarding in its delivery. The brutality is highly welcome however and satisfies unlike any DC film does in that aspect. And probably the most predictable yet ridiculous thing about the film is the audacious soundtrack choices. Sure you can play a novelty song during a specific scene to throw off tonal perspective but at this point it's just cliché. Overall I'd have to say it's a zany and enjoyable film but an overall scattered re-attempt to adapt a great comic.",
    "143": "I thought the first Suicide Squad was horrible, pretentious and badly written, and acting wasn't very good either.When someone told me this one was better I wasn't expecting it to be *this good*, so I felt I had to write a review.The Suicide Squad is incredibly entertaining and the jokes are actually funny, heck I laughed more than in some actual comedies. It's well written and directed with a lot of heart so you do get invested in the characters and cheer when they succeed at something, which is what superhero movies are all about. I don't really think it deserves a 10, but because I see a lot of idiots giving it 1/2 stars (why do you even watch superhero movies to begin with?), I felt compensation was in order.Worth a watch without a doubt, go see it!",
    "144": "With writer/director James Gunn at the helm this time around to reboot the critically panned 2016 film, 'The Suicide Squad' manages to encapsulate and deliver far beyond what the first film failed to do.1. Idris Elba (BloodSport) and John Cena (Peacemaker) absolutely steal the show above all the other villains in the film. Said characters have the most screen time and are absolutely hilarious whenever they interact with each other. Fan favorite Harley Quinn (Margot Robbie) does have her moments to shine but ultimately takes a back seat in terms of the craziness one would expect from her. Robbie is still perfectly fine as the character but just not as dynamic as the other leads.2. The other supporting headliners of the film includes Polkadot Man (David Dastmalchian), Rat Catcher 2 (Daniela Melchior), Rick Flag (Joel Kinnaman) and King Shark (Sylvester Stallone). There is a reason I failed to mention the rest of the cast, but if you've seen the film......you know exactly why😉. Each aforementioned character is given their time to shine and are written well enough to where you actually care about their respective well-beings when the stakes get high.3. The comedy is executed much better this time around and there are genuine laughs to be had. However, some running jokes land flat and are outright unnecessary at points (i.e. Polkadot Man's \"Mom\" joke). Other times it feels like the film could have been trimmed a bit as there are some forced scenes just to give certain characters extra screen time (i.e. King Shark and the aquarium of strange creatures/Harley Quinn's brief romance).4. By now (if you saw all the trailers) we all know that Starro the Conqueror is the main antagonist who makes his appearance during the climax. I personally enjoyed the last sequence in parts but was expecting a more grandiose/hyped finale given the fun yet bloody tone set in the first two acts. However, Starro (despite having minimal screen time and no dialogue) is leagues better compared to what they did with the Enchantress in the first film.'The Suicide Squad' is a fun and exciting blockbuster that I personally was dying to see again after it was over. Chances are we won't get another sequel for a while but I certainly want to see more of this villain-focused world expanded in the DCEU. All credit to James Gunn as he was certainly the right man for the job in fixing what was previously broken.",
    "145": "This is certainly better than the first 2016 version of Suicide Squad, a movie I'd give -5 stars if I could. But while this was better than that, did that make this a good movie?I'm really not sure. I have no clue what to make of this movie. It was weird, it has scenes that were so strange and uncomfortable I didn't know what to do with myself. And I get that that's the point of the Suicide Squad. They're all a whacky, incompetent band of misfits. But I'm not sure that that translates well for me on screen. Even with James Gunn's excellent work and some solid performances by Margot, Idris, John, and Viola it still feels... Too kooky.It might be that it's just not for me. I'm not the audience it's meant to appeal to. Maybe no matter how much they ramp up the violence, the action, the swearing, or the special effects, SS will never be my cup of tea. But I will stand by that this blew the first one out of the water.",
    "146": "Well, it must be said, it IS an improvement on the first one (which is not that much of an achievement, all things considered) and I think I would agree that it might be the best DC movie the past 10 years (again, not that hard). Though tremendously hit-and-miss and generally hard to like (especially the first hour), The Suicide Squad is still genuinely funny and (almost) fun at points, and that is what has been most missing from that studio all this time.The biggest problem really is that it tries to mix a Guardians Of The Galaxy type humour with the callous gore and cynicism of \"The Boys\" and then expects just doing that will be enough to make us invest in the story and want to see what happens next. It doesn't, and the comedic violence very, very quickly just becomes predictable, repetitive, depressing and... deadening. There's no gravity to any of the characters or events: almost every moment which might mean something or cause us to care about someone is depth-charged by a dumb joke, which more often than not isn't even funny. And there is not a single likeable or relatable human being onscreen the whole 2 hours and 12 minutes. It doesn't matter who lives or dies.The Harley Quinn character is noticeably more annoying than before, though Idris Elba isn't too bad, and the shark guy and the cute rats are okay. I guess I liked the quirkiness of the Polkadot Man and his visions of his dead mother.But when I tell you my favourite part of the whole film, and the only bit that actually made me laugh, is Elba's daughter screaming \"IT DOES OTHER THINGS TOO!\" while arguing with him about an Apple watch, you might start to get a picture of how slim the pickings are.",
    "147": "It seems DC have a troubled relationship with cinema.. I read one comment about this movie that I believe sums it up perfectly: this seems to have been made by a movie student fresh out of college with a huge budget to spend.I have no clue why this movie has such high praise, this feels like a teenager flick, a failed attempt at comedy with some gore and violence, they brought some good actors to give it some credibility, a small political statement so that it doesn't look so bad and the end result is this...\nThe story is laughable and the plot is over used, the comedy is based on over the top violence, maybe it works for some people, personally it feels boring and unnecessary, they try so hard to make the kid jokes work I felt constant cringe with the actors delivering it..Zero connection with any of the characters, it seems like the movie was made with absolutely no care for the story, it's just a dumb storyline that heavily relies on the jokes and the violence you are basically watching a freak show, what's the point of making it a \"super hero\" story, this is pretty much a Scary Movie type of thing.It feels like they tried to make a mix of Guardians of the Galaxy with Deadpool and it just failed, simple as that - I am surprised with why the A list actors agreed to this, how James Gunn messed this up so bad after such a good previous work on Marvel and why the high scores? DC needs to get a grip, their movies are so inconsistent..",
    "148": "Pure & total fun. A great balance of tones that never overstep the scene. Each character is interesting & unique. The camerawork & set designs are great. The stylized action & hilarious script are incredible..\n..\nPure & total fun. A great balance of tones that never overstep the scene. Each character is interesting & unique. The camerawork & set designs are great. The stylized action & hilarious script are incredible..\n..\nPure & total fun. A great balance of tones that never overstep the scene. Each character is interesting & unique. The camerawork & set designs are great. The stylized action & hilarious script are incredible.",
    "149": "James Gunn proves again that he is the master of the superhero genre with a quirky, wacky and downright mental retelling of The Suicide Squad.Idris Elba, John Cena and the voice of Sly Stallone as King Shark join our rag-tag bunch of criminals converted into a black ops squad, this time tasked to infiltrate a rogue island nation to recover some extraterrestrial WMDs.James Gunn recaptures the magic of his iconic Guardians of the Galaxy franchise by infusing rib-tickling wit, gory action and quirky montage sequences into the Suicide Squad.He ekes our noteworthy performances from each one of the fiendishly overstuffed cast, with Sylvester Stallone's over-the-top performance as the man-eating King Shark, my personal favorite.Move over Wonder Woman, there is only one queen of the DC Universe and her name is Harley Quinn. Margot Robbie is sensational as our beloved femme fatale, delivering the movies best lines and action sequences.With a post credits scene pointing towards a sequel, one can just hope that the wonderfully deranged mind of James Gunn returns to direct.The Suicide Squad is sensational fun. Highly recommended!"
}