{
    "0": "Detective Batman at its peak! Great storyline. Just as dark a universe as we've come to expect from DC. The gloomy, gritty, dark tone of this film is exactly what I wanted. When you think the movie is over, there's more. Beautiful cinematography. Great score.",
    "1": "I have been absolutely fizzing to see 'The Batman' from the day it was announced, but even more so from when I first heard it described as being inspired by 'Se7en' - one of my favourite psychological thrillers of all time. Were we finally going to get the raw and gritty Batman film I'd always dreamed of seeing? We certainly were.Where to begin? The biggest thing that struck me with this film was just how much time we got to spend with Batman, as Batman. There is very little of Bruce Wayne in this movie and I'm absolutely fine with that. The movie is Batman's story and we are with him from start to finish. We even get some narration from him, which I'm not quite sure how I feel about just yet. It was very good narration but I'm not sure he's a character I want it from.The Riddler in this movie is phenomenal. After The Joker in 'The Dark Knight' this is absolutely my second favourite Batman film villain. He was clearly inspired by the Zodiac killer and what an inspired choice. Also the use of the riddles in the film is nothing short of genius. These are very clever riddles and puzzles and make Batman have to do some serious detective work - something I've always wanted more of from him in the previous films.This is my favourite incarnation of Catwoman to date. I haven't loved her character's place in the films in the past. I've found she slows everything down and brings out a dull side of Batman that I haven't enjoyed. In this film though she was used perfectly. She's the love interest and a villain/anti-hero all in one. That is massive because it saves another thing that can often bog down a Batman film - the pointless love interest.The Penguin was probably the one letdown for me. From what I'd seen in the trailer I suspected this may be the case. I'm wondering if they were using this movie as a set-up for him and then in the second film he will evolve and have a lot more to do. In this one though I just found him quite a dull screen-presence.Robert Pattinson as Batman blew me away. He looked great and his voice was perfect. He was extremely intense and very menacing. Even though I knew he was more than capable of playing the role, I think I still needed to see the end product just for confirmation that he had what it takes. He absolutely did and then some.The film has quite a unique feel. There are scenes and sequences in this film that would feel out of place in both Tim Burton's Batman universe and Christopher Nolan's universe. But then there are little aspects from each of their respective films which clearly inspired parts of 'The Batman'. It basically took the best things from each of them and then twisted them into it's own style - while obviously adding a lot of its own stuff also. It's very well done in that sense.The Batmobile in this movie is awesome. There's just no other way to put it. The sound it made and the vibrations it sent through my cinema chair were bone-chilling. The chase sequence in this movie with The Penguin is one of the best I've ever seen.The film is long at just under 3 hours but it really never feels like it. There's a short period in the middle of the movie where everything slows down for a little while. That really is the only flat part of the movie however. The rest happens at a break-neck pace.It's hard to find enough good things to say about this movie. I need to see it again and digest a couple of things for a little longer, but for now I have it firmly sitting in second place behind 'The Dark Knight' in my order of favourite Batman films. 10/10.",
    "2": "Everything about this movie is trying too hard - the over dramatic score, the long shots on characters faces, the overacting, the complex crime story - it all feels like it's trying to get an Oscar in every moment.It's overly long, drawn out, and the story feels like a generic crime saga that has the Batman universe shoehorned into it.This movie is not a masterpiece, but it spends a lot of effort making you think it is!",
    "3": "STAR RATING: ***** Brilliant **** Very Good *** Okay ** Poor * AwfulGotham City is rocked by a series of murders of key political figures, by a sadistic killer calling himself The Riddler (Paul Dano), who holds the city to ransom, revealing darkly guarded secrets and threatening more mayhem until he is stopped. 'The Batman' (Robert Pattinson), the alter ego of millionaire Bruce Wayne, starts an investigation of his own, crossing paths with a woman called Selina Kyle (Zoe Kravitz), who operates as 'Catwoman' and wants to find out what happened to her friend. It sets them both on a collision course with the darkest elements of Gotham's underworld, including notorious gangster 'The Penguin' (an unrecognisable Colin Farrell) and crime boss Carmine Falcone (John Turturro), who may be sitting on a devastating secret that could shatter both their lives.The Batman series must be one of the most enduringly successful franchises in the world of comic book films, appearing in various different incarnations since its original creation. Here, writer/director Matt Reeves delivers a mammoth three hour long interpretation of his own of the character that many seem to be hailing as the best ever. Less doesn't seem to be more anymore, at least not to the cinema artistes, but from this end, all I can see is a film drowning in its own indulgence.Reeves is obviously keen to maintain the bleak, heavy tone established by Christopher Nolan, and so we have a Gotham City with seemingly endless heavy rain, and gloomy skies, set against Pattinson's dark, brooding stare and gravelly voiceovers, set to the background of the emo rock soundtrack. It's just one of many things ripe for parody in a film that takes itself much too seriously and feels almost devoid of any humour and light. Even more overdone is Dano's dark 'Riddler', operating in some garish gimp suit that just looks ridiculous. Thrown in to this is the topical 'social justice' speeches that litter film and TV today, with Kravitz's Catwoman even praising the 'sinister' villain (who we're meant to hate!) at one point, for killing 'all these white privileged a$$holes.' It's just trying to cram a whole load of eggs in to one basket, over ambitious and overlong, and by the time of the main villain's grand 'master plan' at the end, you're too overwhelmed (or bored) to care.Everyone else can think what they like, but personally this is one of the most pretentious Batman's ever, which might have been a bit more bearable if it had just been less self indulgent, or at least had an old fashioned, Lawrence of Arabia style 'intermission' at some point. **",
    "4": "I'm not sure where to begin as I don't generally want to spoil the reveals, but the big twists in the film were very anticlimactic. For 'The Batman'; Matt Reeves seemed to borrow from some of the bigger books such as 'Batman: Year One', 'Hush', and 'Batman: The Long Halloween'. Reeves also leaned heavily onto films such as 'The French Connection', 'Zodiac', and the noir classic 'Chinatown'. The general feel of the movie sought to relate Batman in the detective role that he's famous for in the comics, but unfortunately ignores any attempt at Batman's level of crime & mystery.The acting was really good. There's a great cast of professionals in this film, although Robert Patterson isn't allowed a range of emotion. Bruce Wayne and Batman are completely indistinguishable as the tired emo-kid who walks through life with severe lethargy. Colin Farrell is unrecognizable as the Penguin, and dare I say gave the greatest performance of his life. A large portion of the film is writing out a semi-origin story for Oswald Cobblepot and his rise to become Gotham's crime boss. A lot of the villains are the origin stories here. Batman (the character) is basically introduced the way he is in 'Batman: Year Two' and I thought that was a mistake. Year one of Batman would have been wonderful on screen. The audience seeing Bruce Wayne learning to use fear in his early days would have been a relief to this movie's \"Everyone is just scared of him.\" plot device. Zoe Kravitz's performance as Selena Kyle becoming Cat Woman was under-developed, as she was so much fun to watch in 'The Batman' that I'd like to see this spin-off into a stand-alone Cat Woman release. Jeffery Wright was brilliant (of course) even remaining quiet in the Batman's background he pulled the attention onto himself, mostly because Patterson's portrayal was incredibly stiff. Paul Dano as The Riddler was exactly what I wanted to see in this movie. The character reached a new level of applause as a serial killer, but saddly that part of the plot was put on the back burner for the lackluster crime drama with Carmine Falcone. John Turturro was great as the crime boss Falcone, but the plot focused too long on his side story rather than offering more clues about the killings. It dragged on so long that it bored me completely. I went into 'The Batman' to see him match wits with a clever serial killer, not be re-educated about the connection between Thomas Wayne & Carmine Falcone again.The action sequences with the car chases and the fight choreography seemed old fashioned in a way. I knew before hand that Reeves lifted from some older better known films, but it's as if they dropped the budget on these scenes. Batman racing to catch the Penguin was an old muscle car Batmobile versus (what I'm guessing was) a 1980's Buick. I was laughing at this chase scene... it was presented with such seriousness that maybe if Penguin were in an expensive Italian sports car, I might have enjoyed it. But it was literally a supped-up car desperately trying to out pace my mom's car. The fighting was dull. Hand to hand combat is one of the first things Bruce Wayne learns before donning the cowl. But in this movie Batman is throwing punches a newly trained boxer would scoff at. So much of these scenes were empty and devoid of thrills and chills, that I wondered where the editor was.'The Batman' is simply too long. It's a ridiculous attempt to impress fans of it's own significance. It fails at cohesive story-telling and it basically pats itself on the back throughout the unnecessary musical score. Unlike the Dark Knight before it - I won't watch it again.",
    "5": "Wasn't a fan of Emo Batman. Sorry Robert Pattinson. Film was just a bit bleh and felt like it was trying too hard to emulate Christopher Nolan and David Fincher. In the end, the mystery was a bit meh and not worth the three hours of what was mostly a run-of-the-mill Superhero film lacking much excitement or thrill. The Riddler was a bit lame too. Forgotten most of the movie and characters already. Underwhelming.5.5/10.",
    "6": "THE BATMAN (2022) *** Robert Pattinson, Zoe Kravitz, Jeffrey Wright, Colin Farrell, Paul Dano, John Turturro, Andy Serkis, Peter Sarsgaard. Filmmaker Matt Reeves pulls out all the stops in this even darker adaptation of the Bob Kane comic book hero with Pattinson standing tall and brooding as Bruce Wayne employing vigilante style justice as The Caped Cursader while Gotham quakes under the siege of the homicidal Riddler (Dano affectively disturbing) and gaining an unlikely ally in Selina Kyle (ass-kicking Kravitz in pre-Catwoman mode). Arresting visuals thanks in large part to ace cinematography by Greig Fraser and James Chinlund's production design all aided by the foreboding score by Michael Giacchino full of bombast and dread. Farrell, under a ton of unrecognizable prosthetics, has a field day in getting in touch with his inner Robert De Niro as The Penguin. By all means see it in IMAX!",
    "7": "Couldn't even finish this drivel... Firstly : Pattinson is a good actor but doesn't fit Batman's role ...Film is way too long and boring , action is underwhelming ...Overall a big disappointment... Can't recommend it at all...",
    "8": "Matt Reeves is not a good director at all-- -he's made one decent film, Rise of the Planet of the Apes, and everything else he's done falls into one of two categories: junk and overrated junk. (Thank goodness The Batman is at least the latter instead of the former). If the director wasn't trying sooooo hard to make the film 'dark' maybe he could have created a new category of just overrated.Firstly, David Fincher himself is bad enough, but David Fincher imitations are even worse. This movie's rote serial-killer plot indulges in every single one of the irritating tropes that Nolan already played around with, most notably the 'but he wanted to be captured!' eye-roller. (Also irritating are Reeves' cheap attempts to desecrate Schubert's music while indulging the trope of the classical music-loving psychopath). Modern culture's obsession with and inadvertent glorification of serial killers is one of my greatest pet peeves---they are just pathetic and boring characters who are all the same. Exchange the Riddler for any of the killers in Fincher's movies and there is basically no difference. And it irritated me to no end how practically every character allowed themselves to fall prey to the Riddler's petty mind games- - if I was there I would promptly tell him to p*ss off and take his stupid video calls elsewhere, even if there was a bomb strapped to my neck.Secondly, the casting is sometimes bizarre. DC has often thrived on unorthodox casting-if they can make Ben Affleck work as Batman anything goes-but they trip up here since we have the high-water mark of the Nolan trilogy to compare it to. Andy Serkis as Alfred? That completely does not work; he just lacks the sophistication of Michael Caine. The new Commissioner Gordon is no Gary Oldman, that's for sure. The Riddler joins the swelling ranks of villains desperately trying to imitate Heath Ledger. (The Riddler from the '66 Batman show was vastly superior--heck, Jim Carrey was). The new Catwoman is alright given the rest of this casting, but is rendered irritating by a script that causes here to carry ON and ON about some friend of hers that ends up killed. Why she's so emotionally attached to this friend is a mystery not even Batman dares solve. The closest thing to a saving grace is the infamously unrecognizable Colin Farrell as the Penguin--- the car chase scene was great even as I kept wondering why none of the vehicles were hydroplaning with something like a full inch of water on the road.Thirdly, the pacing is off. I've seen people accuse Nolan of being portentous, but The Batman takes it to a whole new level with it's bloated runtime. It doesn't even have the quasi-grandeur of the Snyder Cut due to the banal serial killer story which mostly requires people to pop in and out of the Penguin's club ad nauseam. Reeves said that he was supposedly inspired by Alfred Hitchcock, but other than a 'Rear Window' throwback in the opening scene I don't see it. The film is mostly shot like a generic TV procedural filtered through a David Fincher lens, and Reeves completely lacks the morbid playfulness that made Hitchcock so sublime. (Compare any Riddler murder to the one in 'Dial M for Murder', which is one of the more mediocre Hitchcocks). Reeve's sole technique for suspense is to have the Riddler hovering around in the background while an unsuspecting victim putters about.Ugh. If any good this would have become DC's highest grossing film ever. As it is, people will lose interest after a little while and the box office receipts will drop.",
    "9": "Robert P is a terrible Batman. Absolutely no Bat-charisma at all. The Riddler character is a complete bore! I hated all of this film. I certainly do not understand the good reviews. It's not close to the Dark Knight caliber. Please do not make a sequel.",
    "10": "3 hours. I sat through 3 hours of this. OMG when you think Batman, you think Superhero movie, you think Action, you think excitement.If that's what you are looking for, don't waste your time with this movie.1) Bruce Wayne and Alfred are like family. Alfred Raised Bruce from childhood. When Bruce says to Alfred \"You are not my father\", that is just wrong on so many levels. Bruce treats Alfred like crap only caring just before he is almost killed.2) Whenever Batman just walked into a crime scene, or the bar, I felt like I was watching the Adam West Batman from the 60's. Batman is supposed to be Sullen and work/move in the shadows. Not walk into a crime scene filled with cops and just stand there. Nor does he Knock on the door of a bar to gain entry and \"ask\" to see the Penguin.3) EMO Bruce Wayne was just BORING. Bruce Wayne is a flashy playboy rich kid which he does to dissuade suspicion of him being Batman. This Emo take is just dull4) Sullying the memory of Thomas Wayne was just wrong. Thomas & Martha Wayne were the ideal parents while they were alive. They cared about their city. There is no way he would have ever turned to Falconi.5) All the fight scenes, with the exception of the last one in the arena, were all slow and almost uneventful.6) Movies like this seriously need to stop trying to \"Shoe in\" messages from today's world. Movies are supposed to take you out of every day life for a while and suspend belief. When Catwoman tells Batman they need to punish these damn old white privilege men, that just ended the \"fantasy\" of this movie and turned it into a political statement. As did the whole Corrupt old white mayor was killed, and in comes the black female Mayor to \"Save the city\". Oh the Black mayor does get sniped in the last battle, but less than 5 min later is perfectly fine. No injury, loss of blood, anything.The few good points of the movie. Wish there were contacts that were cameras. The final fight scene in the arena was good. Should have had more of this.",
    "11": "I've never been so bored watching a superhero movie. Is this the new standard? This movie has a good user rating, so I realize I'm the wrong audience for it. The dialog was awful and I'm not sure if it's the writing or the delivery. Probably both. None of the characters were interesting and most scenes felt awkward. But the worst part is the lack of fun. This movie is so dull.",
    "12": "For better or worse (mostly better), The Batman is when he's detective first, superhero second. A bleak yet thrilling noir but also with a glimpse of exhilarating hope. It doesn't hurt really if we're having a new Batman film, especially if it took a riveting route like this. Pattinson and Kravitz were explosive together.",
    "13": "3 hours hero movie...\nIt might be quite an adventure for those who expect action-packed movies like Avengers or The dark knight.The batman is not an action movie. It's a noir detective film..\nJust enjoy the dark, moisty mood this movie has.If you enjoyed movies like Zodiac, Se7en i'm sure you'll love it\nGo to the theatre immediately.",
    "14": "This film delivers a much darker and more sinister Batman, quite unlike the many versions that have gone before. The representation of Gotham as well, is steeped in corruption and decay. The story opens with the death of the city's mayor, and from there introduces the principal characters that are part of the Batman legacy that are known all too well by fans. In tone, I think this film was more like the \"Gotham\" cable series than any of the prior movies, even if that show had more to do with the young Bruce Wayne growing into the masked crime fighter. The villains both in \"Gotham\" and in this story personified the evil and malice that gripped Batman's hometown, with an added element of corruption in the background of Bruce Wayne's father that put him under the thumb of crime boss Carmine Falcone (John Turturro).All of the performances here were exceptional. Robert Pattinson's take on Batman was more effective than his portrayal of Bruce Wayne, who looked like he was part of the grunge scene. I didn't much care for the Batman outfit, it looked unusually heavy and clunky; one's first inkling that Batman was arriving was heralded by the thumping footsteps one might associate with \"Jurassic Park\". Pattinson's voice as Batman, as well as those of Lieutenant Gordon (Jeffrey Wright) and The Riddler (Paul Dano) sounded like they were coming through a synthesizer. It made for dramatic effect, although not quite realistic.This film version of The Riddler is not like anything you've seen before or would have expected. His off-screen portrayals hinted at a demented masked vigilante, which made the actual appearance of the character that much more compelling when it revealed an almost baby faced Dano in the role of a psychotic madman. Quite honestly, it wasn't until the credits rolled that I became aware that Colin Farrell had the role of Oz, hidden underneath all the prosthetics and make-up. Yes, he was referred to as The Penguin, but it wasn't overdone, and his full name (Oswald Cobblepot) was never mentioned.Rounding out the principals was Zoe Kravitz as the slinky Catwoman, Selina Kyle. She had some major kick butt action in the film, and rose to the occasion to save Batman's near the end of the story. Speaking of which, even with his seemingly armor plated outfit, Batman appeared unusually vulnerable to attacks by his foes in the picture. It marked him as more human than the average super-hero with unusual powers.I will say this, your attention needs to be focused due to the nuances that are revealed in the telling of Bruce Wayne's parents' story and how he might have been misled growing up. His father's relationship with Falcone and fellow mob boss Salvatore Moroni bear on Gotham's reputation. Maybe it was inadvertent, but there might have been a subliminal tribute to the \"Gotham\" series here with the character of Falcone associate Kenzie (Peter McDonald). The role of James Gordon in that series was portrayed by Ben McKenzie.",
    "15": "I'll say it started pretty good and I liked the cinematography. But I thought it dragged on, and the social commentary on destroying \"white privileged men\" was ironic as that's what Batman is- a privileged white rich guy who can mascarade as a vigilante because he's rich and has all the free time to do so; and we feel for him because boo boo he's an orphan. This was a very obvious \"woke\" fest. I like the diversity but it's when they blatantly shove rhetoric down your throat that it starts to become cringey. Pattinson was so sleepy, like Joe Biden in a Batman suit sleepy. Joker is my favorite movie of all time and I feel like they tried to go for that but it just had too many missteps. I did like Farrell as the Penguin and the Riddler was basically Dexter the Anti-hero...",
    "16": "The most realistic Batman film ever made! I've never seen batman struggle that much. The script was really tight and even though it's 3 hours long, I didn't see any superfluous details. Top-notch visuals, sound and acting. The soundtracks of the movie were really good, after watching the movie it just stuck in my head.",
    "17": "Could not believe that was Colin Farell under the makeup as Oz. It's not so much this is a bad movie, it isn't, but it's not really a great movie. The sets, the atmosphere, the mood--all are Gotham the TV series. The Batman here is gritty and intense but brings nothing new or innovative to the audience. Basically a C- attempt.",
    "18": "Right from the 1st leaked screenshots I had doubts about this movie, wasn't bothered by the fact Robbie Pattinson was playing the main man, moody, morose, silent, he had all the things necessary to portray the brooding Batman, unfortunately he had no screen presence, the Batman's mere look should strike fear, Pattinsons didn't, had the resounding thumps of his Jack boots not been amplified to sound like a herd of elephants it would've been easy for him to go unnoticed among the throngs of police officers & various characters.The only scene that attempted to inject any excitement was the \"budget Batmobile\" chase scene, overly long, quite pointless & shockingly silly and far far too loud, another problem with this movie, whereas the musical score was for the most part the best thing about this movie it's actual sound was one of the worst, every screech, scream and gunshot was turned up to maximum, deafening the audience.Of course the real villain of this movie is the story or more precisely its lack of one, yes we're introduced to \"the Penguin\" an overweight balding scar faced slob that screams more sleazy pervert than villain & a complete waste of use of the character then its \"the Riddler\" a bespectacled \"youtuber\" in what's best described as a gimp costume, a character with no special talents yet is somehow able to enter unseen an exclusive apartment and commit murder, a locked vehicle to over power it's driver and enter unseen a police gym and over power the cheif of police and kidnap him and all the while screeching like a banshee on video & facetime.The films runtime is far too long telling a story that is uninteresting and ultimately very boring, there are no heroic deeds performed no good guy to root for.The time line for this movie becomes apparent from the diary kept by Bruce Wayne and various TV news broadcasts, this is year two in the career of the Batman yet he isn't the vigilante that's feared by the criminal underground yet he's hated by the police force, with no context to work from of his past deeds as a vigilante its very confusing.Quite simply this isn't a movie about Batman , Pattinson could have played the character without the costume and the movie would have still been the same, a very boring lacklustre detective story.Zoe Kravitz plays Catwoman, a character completely different to the Halle Berry version but played equally as badly.Put simply this movie ranks worse Batman movie behind the awful Batman and Robin, as the caped crusader Pattinson isn't a patch on Keaton, Kilmer, Bale or even Afflek.I can only imagine Warner Bros/DC wanted to emulate the profits they raked in from \"The Joker\" so decided to give Batman the same treatment but where \"Joker\" stripped away everything and concentrated on the character \"The Batman\" strips away everything about the character and concentrates on everything else, the sets, cinematography and secondary characters are fine tuned and highly detailed whereas Batman is reduced to a pair of \"Jack boots\" clumping through the movie.By the end of Matt Reeves \"The Batman\" I felt I knew a little about what it was like to be in a hostage situation, the elation I felt at the ending of the movie gave newly found strength to my numbed legs allowing me to bound out from the cinema seat seeking the freedom of the evening air, it was a wonderful experience, something I sadly can't say about the movie.Nolans trilogy is still the best, he gave the character a begging a middle and an end and he did it with style all the while telling a complex and interesting story about complex and interesting characters, Matt Reeves fails abysmally with \"The Batman\" choosing to emulate scenes from past Batman movies rather than creating something new and unseen, from Keatons Bruce Wayne to Bales Dark Knight it's all there easily recognised.If this is Reeves idea of re-booting the character for a new generation then it was a pointless endeavour, the new generation hasn't the need or interest for it, they certainly don't have the patience to sit through 3 hours of it.The movie is about the beginning of Batman's career when he is young, full of the energy necessary to fight the criminals and crime of Gotham city, Pattinsons \"Batman\" meanders through the movie as if he were a zombie looking disinterested and deflated, this is not a superhero movie nor a movie about a hero, it should not be a movie at all.",
    "19": "I assume there are still people out there that cannot stand Robert Pattinson. This dislike was born when he accepted one of the main roles in the Twilight universe. If you are one of those, I do not think I will be able to sway you - to convince you otherwise. I could tell you, that he has proven himself as an actor in many films since then. And when I say that I am not trying to put the Twilight Saga down. I was not the target audience of that - still I saw some interesting things in there, but also things that I did not like at all.But this is about ... The Batman! A distinction in the title - maybe to be able to find it better when browsing or looking for it. Because and I'm sure you are aware of that: there are many other movies called Batman. Actually before Marvel took over the reigns, DC was the one producing good comic book movies. Superman and Batman being the most noteable ones. No one back then thought of combining the heroes though. Everyone stayed in their lane. Something this movie does too. And maybe it is better if DC does not emulate or copy the MCU formula ... I understand that it is more than tempting considering all the money that is involved of course.All that history aside, this as I already said, is a standalone movie. This is about The Batman! And while you may have your favorite (Keaton, West or Bale - though maybe even Affleck or the unlikely choice of Kilmer or Clooney), do not condemn the Patts just yet. He really transforms and gets into the role ... a role that anyone should consider an honor to play.I am overall a MCU fan boy as some may call me. But I have a deep love for the Bats. And while that makes me at least somewhat biased, this is not the reason I am surprised the movie has such a high rating. I am surprised because the movie is long (even if you don't really feel it - even when you may think at times \"alright we have spent quite a lot of time lingering haven't we?\") and because it is quite dark ... pun intended. The tone and the overall lighting of the movie.There is violence here - things that a decade or so ago, you may not have been able to get away with and still get a PG13 rating. Bashing of the head with a blunt object? Yes you don't get close ups and there is not as much blood to be seen as with other movies that also have head bashings - but just the thought and certain glimpses we get to see ... is more than enough.But all that and the fact this is a detective story ... really help elevate the movie. That and a strong cast of people. I thought Jared Leto had one of the greatest transformations for House of Gucci ... but Colin Farrell actually isn't recognizable in this. And would also fit in the House of Gucci, considering the italian accent/New York slang he uses.The darkness and the shadows play a big role. And you may find yourself looking to find something in them ... even something (or someone?) that doesn't exist/is there. The action scenes are really well played out - there is even one that reminisces that feeling you may have had playing a game or two with the Batman. Arkham City may arguably be the best game of the series - with a fighting system that really is extraordinary. Many have tried to copy it - but I never felt that seemless flow in anything else I've played since then.And then there is the sound system ... I watched it in Imax too, though it doesn't seem to have been filmed with an Imax camera. Still bigger screen so all good. But the sound ... wow! Just wow - incredible.So while I still feel that The Dark Knight is a bit better - this comes as close as they get. Coincidences and convenient timing aside. Because a lot of things have to go right (or wrong depending on your perspective) for the movie and the story to work ... still small and minor \"flaws\" like that aside - because that should not stop you from enjoying this very well made movie.Edit: Since this is not an origin story, but still the beginnings of Batman, he is not invincible and he may not have every gimmick/toy/car/vehicle you may expect him to have. There is one truly great car chase though ... I personally would not compare it to the real great ones you may have seen (Bullit, French Connection and so forth) and just see it as a thing that works on its own. Also the added bonus - after credits \"scene\" - is really not something that many will think worthwhile ... as in worth staying and watching the credits through to get this ... well let's call it easter egg, that is not really a scene, but a callback to a scene from earlier ... with a promise for the future one may say. Still you can google it and it probably will have the same effect as if you watched it \"unfold\".",
    "20": "I got to watch this movie early because of a special screening, I was extremely excited my expectations were very high and still they were surpassed!Robert as Batman is just awesome, majestic and scary and yet at the end, he also evokes that sense of hope Batman gives to the population.Paul Dano as The Riddler is so creepy! Both Robert and Paul gave an oscar worthy acting.The rest of the cast gives amazing performances too!Beautifully shot and the score is thrilling.It does feel a bit long but it is rewarding.",
    "21": "What were Reeves and Craig thinking? I mean, wasn't the Douglas Nolan Bat-trilogy with Christian Bale dark and pessimistic enough? Did they have to try and top that by painting Bruce Wayne's parents as not being so spotless? And what was with the nearly three-hour running time?Between those two factors, this movie felt more like the love child of \"Gone With The Wind\" and Joaquin Phoenix's Joker flick. Which is most definitely _not_ a good thing! The only reason I give this two stars, instead of one, is because of the unexpected (but surprisingly effective) blending of the Riddler with Hush.Well, that, and the casting of Jeffrey Wright...who does a commendable job as Jim Gordon.",
    "22": "This movie wants to be so much more than it ends up being. The tone and color palette are incredible for the majority of the movie until they inexplicably change to a pastel for the final sequence, which is jarring, underwhelming and feels like a sequence from Batman Forever being stuck into a Tim Burton Batman film.Throughout the movie you feel like you really want to love it, you appreciate the quality of the production, and yet it feels soulless.The movie is over-long with some sequences being held for so long that I'd occasionally nod off.Batman is presented as a grounded emo-type loner who patrols the streets looking for signs of trouble, and his eventual reveal as Batman is quite basic. Yes, there is a scene in which he punches someone brutally, but the rest of the fight sequence is pedestrian.Batman works a case in a noirish setting as a semi-detective who tends to just stand still, brood and gaze intently at things. And Inspector Gordon relies so much on him that one wonders whether the viewer is missing some prodigious detective skills of his.The start of the investigation into a murder is drawn-out and, again, lacks any real punch.The Riddler starts off as very mysterious and well-executed. The main issue is that he disappears for the majority of the movie only to leave clues for Batman to solve, à la the Zodiac killer, but no genuine riddles. Once he reappears at the end, he seems to lack motivation for his actions and fails to appear anything other than a deranged child. One can see they were going for a similar disturbed edginess to Heath Ledger's Joker but it doesn't deliver. And his final plot of flooding Gotham doesn't appear to be of super-villain proportions and I failed to see the genius behind that plan. Like... why?Colin Farrell as Penguin and John Turturo as Falcons are brilliant. Bruce Wayne is too emo to appear as though he has any functioning life outside his mission as either a stalker or as Batman. Alfred is underused and his relationship with Bruce seems aloof. There is one scene at the hospital where the emotion finally sets in and it pulls at your heartstrings.I loved the backstory of Bruce's father. It was a great addition.Selina Kyle is excellent.As mentioned at the start, the finale is a real letdown and underwhelming. It feels like they wanted to do something big for the finale but it just feels tropey. It doesn't feel like a natural place the story would lead to. Zack Snyder, Christopher Nolan and Tim Burton were great with the final payoffs. This movie doesn't deliver that. It's a mind-bogglingly silly \"master plan\" by the Riddler. And the Riddler loses all his initial mystique in the third act of the film when he finally reappears.And don't get me started about the silly Joker tacked on at the end. You know the director is aiming for something nightmarishly disturbed and maniacal but it doesn't work. The Joker sounds like Jim Carrey and it's silly that it's him who says \"riddle me this\" instead of the Riddler. And their scene ends with childish maniacal laughter.Paterson plays Batman well. His voice is excellent and his voiceovers at the start are brilliant. It's just too bad they didn't use more of his narration throughout the movie; it would've worked a treat.The score is excellent although tends to primarily use the one theme with slight variations.Is the movie good? Your brain tells you that you are meant to say \"yes\" because there is a lot of quality in the film itself, but the sum of the parts is where it doesn't live up to its potential. It's over-long, poorly paced, with underdeveloped characters and a main villain who shows great promise at the start but ultimately underwhelms and the finale is jarring for all the wrong reasons. It isn't epic in any manner whatsoever although you know that's what they are trying for: but all they deliver is something tonally very different from the rest of the film, and the villainous plan is a head-scratcher due to its mediocrity.You will watch it once at the theatre and you will tell yourself \"I think it's good but I don't know why. Maybe I should watch it at home when it's released on home video so I can give it another go.\" How many times will you watch it? Depends on your taste. Given how slow and long it is, my guess is that I'll only watch it one more time when it's released at home... but even then I'm unsure and not excited by that prospect.Did they make a mistake by making this movie? Not at all. I'm interested in such a different take and I'm happy it exists and that I got to watch it. It has some incredible moments. But that's it.Current number of views: 1 time at theatre (advanced screening).",
    "23": "We are now on \"The Batman.\" I suppose such a title is to distinguish it from plain ol' \"Batman.\" Like the football players who are from \"The\" Ohio State University or \"The\" University of Miami as though there are impostors of those same schools out there that they have to distinguish themselves from.Robert Pattinson plays Batman, and while his Batman is adequate, his Bruce Wayne was underwhelming. His Batman seemed to have fewer gadgets, but he did at least make his suit bulletproof. His Bruce Wayne was barely shown, and when he was it was as if he carried the pain and anger of Batman with him. All other Bruce Wayne's were able to turn on the charm when in public, this Bruce Wayne has the \"life sucks\" face.\"The Batman\" opted to be more of a murder mystery than an action flick. There was action (even a scene involving the Penguin in which the audience applauded), but nothing like Batmans past.A glasses-wearing masked man was committing a string of murders. He was killing high profile members of Gotham and leaving cyphers for Batman to figure out. The movie doesn't hide that the killer is the Riddler, while it does hide his true identity. The Riddler was circuitously directing Batman and others to a particular criminal he wanted outed. Batman and Lt. James Gordon (Jeffrey Wright) suspected that the Riddler's final target was either The Penguin (Colin Farrell) or Carmine Falcone (John Turturro). Whether or not it's either of them is saved for close to the end.Speaking of the end, this movie was nearly three hours long, and I began to feel it. There was a point that the movie could've wrapped up, and I thought it was, then it dragged on for another half-hour or so. I was happy to be in the theater watching a movie, but not that happy. A two hour movie would've been just as satisfying. After watching all of the previews it made the movie-going experience well over three hours.How does this Batman stack up against the others? OK. It's no \"Dark Knight,\" but it is also far from \"Batman Forever\" or \"Batman & Robin.\"Free with Cinemark Movie Club membership.",
    "24": "The Batman is a movie that you can expect these days: a lot of special effects and the rest is fast produced mediocrity. Not a total fail but compared to some of the other epic and even iconic movies of (seemingly) long gone times, The Batman tastes like convenient fast food compared to Haute Cuisine.",
    "25": "With a gargantuan running time and a sluggish plot. The Batman promises more than it actually delivers.The opening broody act does whet the appetite. This is a dark, moody and nihilistic take on the Dark Knight. An adult take on the comic book with elements of horror.Director Matt Reeves is inspired by David Fincher. This is a grungy rain soaked world.With the Riddler, Penguin, Falcone and Catwoman. It soon descends into throwing everything in the hope that something sticks.There are too many characters and not enough action. There is a chase sequence featuring the Penguin and that is about it.Robert Pattinson is wasted. His stunt double might have well be in the Batsuit. As Bruce Wayne he looks like an emo waster with a drug problem rather than a rich spoilt brat.There were issues with the main villains as well. The Riddler is just another take on Heath Ledger's Joker who just wants to see the world burn or in this case the streets of Gotham flooded.As for the Penguin. What was the point in hiring Colin Farrell if he was going to be covered in latex and a fat suit.The biggest insult and this is where I sympathise with Alan Moore's criticism of Warner Brothers. Once again a global media conglomerate is peddling the line that society is in trouble. Police and politicians are corrupt.The answer is for everything to go down in flames. There is a scene where the new mayoress goes out to help people but is attacked in a scene that holds a mirror to the 2021 Capitol Hill attack.Batman states he will learn and will do his best to improve society rather than look for vengeance. The film then sows the seeds for the sequel with a clown that has the same attitude as the Riddler.This is from a company which only believes in one thing. The bottom line.",
    "26": "Fell a sleep within the first 30 mins. No need to continue. Christian Bale is Batman. Please stop making movies about the hero. Nothing beats Christopher Nolan's version people.No actor fitted their character.",
    "27": "This film start with a bunch of people been spy, and a man watching the news broadcasting on the TV scene! As turnout, this film is about Bruce Wayne need to find out who is the mastermind killing series of innocent people! The mastermind actually is The Riddler! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the walking scene, overuse of the searching scene, overuse of the arguing scene, overuse of the calling names scene, overuse of the staring scene, overuse of the spying scene, overuse of the riding motorcycle scene, overuse of the narration scene, overuse of the news broadcasting on the TV scene, overuse of the drinking scene, overuse of the interrogate scene, and overuse of the talking on the phone scene! Make the film unwatchable! All the action scene have things broken, and explosion at certain point, but overall portray by sideways, have slow motion, and occur in too short of time! Make the film frustrated to watch! At the end, Bruce part way with Selina! That's it! Wasting time to watch!",
    "28": "I'm sorry and I can't understand any review above a 5, maybe. The Story was boring. The characters where boring . The alleged dark take .. was just that filmed dark. Very disappointing. Oh and thanks for throwing in a bunch of woke virtual signaling, that always helps a bad movie .",
    "29": "The Batman creates a grim & gloomy atmosphere, and it moves along so slowly that you could almost fall asleep to it. However, if you did, you'd probably have nightmares. This movie made me believe that Robert Pattison could be Batman, although I'm not entirely sold on him as Bruce Wayne. Paul Dano is disturbingly demented in his role as the Riddler, and Colin Farrell is absolutely unrecognizable as the Penguin. I liked this new take on Batman, but I didn't love it.",
    "30": "Perfect masterpiece!!! That's all that should be told!!! This is not action heavy but very plot story driven filled with fantastic performances!!! So expect a visually stunning story driven movie than a big action driven Batman movie unlike its predecessors!!!! Truly different and perfect!!!!",
    "31": "The Batman is a very dark and gritty take that will have you on the edge of your seat the whole time. Robert Pattinson as Bruce Wayne/ Batman is the best thing to happen in movie history. Zoe as Catwoman was superb, but the real star was Paul Dano as The Riddler. Paul as the Riddler was just so haunting definitely the best villain in a DC movie since Heath Ledger in 2008.The score was also fantastic. It was probably one of the best film scores I have heard in years. Best DC film since Joker for sure. I highly recommend this movie! If you want a movie that will have your mind thinking then this is the perfect movie. It's so long, but does not seam it and also it's so long that the more you watch it the more you will discover something new.I have seen the movie now 3 times and every time I see something new. Look for the Twilight referenceThe Bat and the Cat10/10.",
    "32": "Batman helps Lieutenant James Gordon investigate a series of murders of prominent citizens, each of which is accompanied by a cryptic puzzle. Tendrils snake into the underworld and into previously ususpected areas of darkness in Bruce Wayne's personal history.Matt Reeves' 3-hour epic reboot of the caped crusader hits cinema screens, and it is unlike any previous version. In truth, I was ready to dislike it - not because of any great loyalty to any previous iteration, just 'cuz - but it's not bad. It's not great, and it takes itself far too seriously, but it's good.We discover immediately that this Batman is a brutal brawler, but we then find out that he is an able detective, working with quasi-approval from the GCPD. Bruce Wayne is a bit of an emo goth, which didn't quite work for me, but Robert Pattinson is a covincing Batman, brooding and understated. Paul Dano also impressed.I have quibbles. One. My late father used to bemoan the tendency for modern movies to be dark: he would have HATED this. I have never seen such a dark film. Two. The wonderful Michael Giacchino has lifted the musical motif for Batman straight from Darth Vader's theme, which was both naughty and distracting. Three. It is possible to drop in a bit of light relief here and there, y'know. Just a bit. In three hours.Not bad, though.",
    "33": "Put a man in a recognizable costume, cut together 3 hours of extreeeemely slow shots of basically nothing happening, add around 5 minutes of poor CGI action. Wrap it all into a story that could be told in 10 minutes and doesn't really get a good conclusion or that wasn't predictable from the very first minute.Cash in on fans - who - for some reason, still exist, and are blindly throwing money at crap, yet lack any sense of critical thinking.And that's that. As a scammy business model, pretty darn good. Well, I guess it was less of a scam than The Joker, but even those cash cows of fandom are slowly getting more sane.",
    "34": "It was so good! The beginning, the narration, Bruce's voice, his accent, Gotham City, music and sounds... it felt like I'm reading the comic and the pages come alive in my head! It was great! And I live violence, action, crime... this movie has everything! Beautiful car scenes to strong fight scenes to memorable and emotional and dark scenes to those detective scenes... I can't find the right words. You have to watch it.I was told it's about 3 hours but didn't feel like it. I could easily go on for another hour or more.And one last thing, make sure to watch it on a big screen because it's very dark and detailed, a movie theatre would be the best place to feel the movie as a whole!",
    "35": "The production values are striking right from the first moments: dark, bleak and dystopian. And the crisp, direct dialogue added to the film noir effect, which was definitely a good sign.And then, and then: it just goes on and on, with the plot becoming ever more convoluted, the virtue signalling gets thicker and thicker, and the dialogue becomes more and more laughable. By the last half hour, I was mainly staring at the ceiling and tapping my fingers, waiting for it to lumber to an end, which did not come nearly soon enough.I suspect people will either love or hate this Wagnerian, portentous pile of nonsense. I loathed it.",
    "36": "I liked the new Batman approach but a bit elmo style\nThe movie was far too long\nIt was basically just watching a series of Hollywood cliche scenes one after the other, shot against very dark backgrounds.The plot could have been much more intelligent and def shorter\nThe new Batman is original\nAlfred didn't work\nCatwoman was too predictable\nThe gangsters were straight out of a 1940s B movie\nHalf way through I was still hoping that the movie would redeem itself, but vengeance never arrived\nThe ruddler was poorly drawn and not clever enough\nSo in conclusion - an original take on Batman character but not enough to keep me interested\nShould you see it?Yes - but bring sandwiches and Red bull along. It's going to be a very long dark night.",
    "37": "After seeing the trailer, I thought this film looked amazing but it turns out it is one of those movies that shows all the best parts in the trailer.It is hard to give this movie a 1 star rating because it is very well made but this is easily the most boring Batman film ever made. I enjoyed this movie even less than the Clooney version.The film has a good look for the most part and is like some of the comics but it is style over substance. The action scenes are very well done but they are very short and few between. If you saw the trailer, you have basically seen them and there will be no surprises.There are no characters in the movie you care about and Catwoman is annoying and physically unattractive yet they had to force a romance despite the actors having no chemistry.The Riddler is a serial killer that is murdering corrupt politicians. Do you really care that Batman stops him from killing these evil guys?One major thing this films lacks, especially considering it is a Batman movie, is a good villain. The Riddler is the main bad guy but he really isn't in the movie that much and never appears on screen with Batman. Even when he is caught, Batman watches outside a window as the police arrest him (this is somewhat shown in trailers). Batman later visits him in Arkham but they are once again separated by glass (also shown in the trailers).As for the acting, everyone just whispers in the movie, except for the Riddler who will randomly raise his voice in an attempt to act crazy.Thankfully, Robert Pattinson is no shown as Bruce Wayne much in the movie because he looks like Frankenstein's monster the times he is shown. You'd think it is a good thing to have so much Batman in a movie, but he mostly just stands around and whispers boring conversations.The worst thing about this movie is how boring it is. Batman is one of the most fun characters ever created but they sure managed to make him dull.",
    "38": "The worst/scariest thing about this movie is its good rating. How this is possible is beyond me. The movie is boring and stupid. Shooting all kinds of guns doesn't do any harm ? Now a double-barreled gun comes on the scene... How can you imagine and shoot something like that? Oh, if only that were the case. It's impossible to believe any of the characters. After the Joker, how is it possible to give it even one star, I don't understand.",
    "39": "Robert Pattinson is great, I loved this film but if you're reading reviews don't listen to metacritic they are awful. The Batman lives up to the hype for sure.",
    "40": "A must-see film for any batman fans, I guess that others may enjoy this too. Saw this in a theatre today, the age ranking I would give is 14. I've been waiting for a good batman film for 14 years now, and this certainly, most certainly delivers.",
    "41": "\"You'renot my dad!\"\"You don't know how it feels!\"Ugh. Long, dark (literally no lighting), slow....didn't like it. Also, this Batman isn't very smart. Maybe he should turn off the Nirvana and study more.",
    "42": "Dull & Drab at Best. Insipid Writing, Outdated Action Sequences and a Batman who looks absolutely Awful & Childish on screen with Abysmal Portrayal of such a Legendary Character !!!!Dismal Execution by Reeves & His Team !!!!",
    "43": "I enjoy superhero movies and was looking forward to this one but at three hours, it's about one hour too long,\nGotham City looked amazing and Robert Pattinson did fine as Batman but the film was largely so dark and dreary that I found myself drifting off at points.It wasn't a bad film but I found myself asking, after the amazing legacy of the Dark Knight films, \"what is the point of this one?'.",
    "44": "Between an insipid Robert Pattinson and a woeful story line, coupled with an awful script, there really was no trajectory but down for this embarrassing rendition.I was very eager to see this new take on the Batman franchise and all you could do was pray for the end to speedily come along .... and you waited and waited in vain for the tragedy to end, and it just wouldn't. People around me, and I should mention they were unknown to me, fell asleep during the movie. They should be grateful for their escape.Please consider yourself forewarned. It is unrelentingly boring.",
    "45": "Everything about this move is a glaring testament to how far Hollywood has fallen. All I saw was a weak little boy and a supporting cast to fit it. He just doesn't fit the roll. I've met 90 year old military vets that have more metal than this supposed super hero. Hell I'd prefer to watch Ryan Reynolds version of the Green Lantern any day over this.",
    "46": "Sulky emo Batman with Bieber hair hanging in his eyes didn't really work for me. Sulky and emo isn't the same as dark. The movie was slow paced. I watched this at home, and kept checking the remaining runtime about halfway through, wondering when it would end.The script was more like a daytime soap opera with long weepy self-indulgent conversations, than a comic hero action movie. And some plot elements didn't make any sense, which I won't go into because that would involve heavy spoilers.I honestly don't understand the high rating for this schlock. The one highlight was Colin Farrell giving an amazing Penguin portrayal.",
    "47": "I advise you to take antidepressants before you start watching this movie.It is so baaaaad,dark and booooring. And the \"vampire dude\" is the worst Batman ever.",
    "48": "How does this fly for a Batman movie? The Villians were quite poor and weak through the entire movie. Batman plays 100% into one of the Villians hands and helps destroy Gotham? Some detective he turns out to be. The ride out ending of the two characters... come on how can WB waste so much of the DC content. Super poor casting here. Batman looks like he is on drugs and is a wimp. His gadgets are super DIY and clunky. The sets and cinematography are the only good parts of the film.\\",
    "49": "⭐\nNeither a good superhero movie nor a good crime movieAs a lifelong DC and a Batman fan, i just want to say...\nI'm disappointed.I really wanted to like the movie but it was so flat.There were some great camera works and awesome shots but then again, It neither came out as a good superhero movie nor a good crime/thriller movie.",
    "50": "I mean, aside from the overplaying of the main theme music (which sounds eerily like the darth vader theme). The mellow music which is mazing if played once, and nirvana is amazing, but once overplayed, can put a man to sleep. Whats the point of Afred? The bat mobile couldn't be appreciated while we only see it in the dark. Its a forgettable batman movie. Years to come, people will not even remember this. Even Batman and Robin is still remembered till today, although for the wrong reasons, it was stupid but entertaining.",
    "51": "What makes Batman stand out as the best known superhero isn't his riches, isn't his heritage, isn't his darkness. It's not even Batman himself that makes him stand out as the best known superhero. His legacy of (super)villains however does.Ask anyone to name even 2 villains of their favorite superhero and the chance you won't know 1 of those villains is big.However with Batman as well as Spiderman the chances you won't know the 2 villains is close to non-existent.Yet Matt Reeves doesn't know who The Riddler or Hush is. Both have the same MO, yet one kills and one doesn't. And Matt Reeves thought it was a good idea to mix these up. To the normal public he might have made a great movie, but to me he just made the worst mistake anyone can make involving one out of two of the worlds best known superheroes.P.s. I don't even want to mention what he did wrong with Selina Kyle/Catwoman due to spoilers. But man did he just screw up every character in this movie.To Matt Reeves: Read some comics of the characters you'll use before making a movie about them. And please for the love of god, don't say yes to everything you're given the opportunity to.",
    "52": "Complete and utter self serving trash. From the ridiculous haircut to the fact Batman is a skinny emo kid and that's not even mentioning the awful looking action scenes and terrible CGI when it is used. There are huge portions of the movie with little to nothing happening. If The Watchmen, Saw and Prisoners had a love child this would be it but not in a good way. Not even close in substance to any of those movies but tries to imitate the style and tone of each right down to the voice over narration, Paul Dano, clues about clues about clues, riddles etc. It seems all you have to do to score high reviews is to make something dark and gritty. Honestly how Pattinson is meant to be physically capable of dominating anyone is laughable never mind Zoe Kravitz all 5 ft 3 and 100lbs of her knocking guys out with single kicks then getting battered and choked out by a pensioner? Awful truly awful movie.",
    "53": "While this movie has a more dark tone and grittier tone with crime in Gotham. It's very slow paced and the plot just isn't that interesting. For a 3 hr long movie, I was falling asleep by the climax.It's not that I dont like long movies but it just has no charm. Very bland movie, while I like the new directions of a more dark and realistic batman. Foremost it needs to be entertaining.",
    "54": "I thought that was very overrated. It felt way too long and didn't make sense. The stories were confusing and it didn't feel like the first of a series. It felt too much like a sequel. In fact, the pacing and look felt like it could have been a sequel to Tim Burton's Batman. Batman appears too early into the movie and we don't know the backstories of the villains well. In fact, the opening action scene at a subway station was cool, but there was no explanation to the group off the subway picking on this one character who wasn't explained either. The Penguin didn't seem to have anything to do with it and Catwoman wasn't explained much either. The action scenes were cool and Pattinson was a good Batman, but a flat Buce Wayne who looked more like Scarecrow. The Riddler was fun, but it didn't explain how he knew Bruce Wayne was Batman.",
    "55": "Dark and just what you expect from a batman movie, manyone has written, even i the grumpy old man think that this was overkill of a superhero movie, even with a new cast and without the clown, its miles away from the latter 2 parts made in the new millenium.But if your fan of the dream of gotham and the comic caracter then go wind it forward, it wont be a rewind for me.",
    "56": "This is a guy who is called Batman / Bruce Wayne but he isn't. Other characters have names from the comics but they aren't those characters. They took a crime drama, sprinkled in a little action and gave the characters Batman names. It's SO long. Every time I thought it was ending nope there's more. 3 hours in total, plus the 25 minutes of previews you sat through it you see it in the theater.",
    "57": "This is not the Batman we can relate to. It's absurdly unconvincing. It's painfully slow. I hope there isn't a sequel to this. The cinematography and editing is very good.",
    "58": "Ok DC you are knocking off the Crow now so what? Haha How stupid is it that the media shows the Riddler's stuff live! This movie is so dumb. How far super hero movies are falling down a drain. Cesspool of crap movies. Lower your IQ adults to watch Hollywood try so hard to make some old fun colorful super hero's dark and melancholy gray and black people on anti depressant's .",
    "59": "I advise you to take antidepressants before you start watching this movie.It is so baaaaad,dark and booooring. And the \"vampire dude\" is the worst Batman ever.",
    "60": "How does this fly for a Batman movie? The Villians were quite poor and weak through the entire movie. Batman plays 100% into one of the Villians hands and helps destroy Gotham? Some detective he turns out to be. The ride out ending of the two characters... come on how can WB waste so much of the DC content. Super poor casting here. Batman looks like he is on drugs and is a wimp. His gadgets are super DIY and clunky. The sets and cinematography are the only good parts of the film.\\",
    "61": "⭐\nNeither a good superhero movie nor a good crime movieAs a lifelong DC and a Batman fan, i just want to say...\nI'm disappointed.I really wanted to like the movie but it was so flat.There were some great camera works and awesome shots but then again, It neither came out as a good superhero movie nor a good crime/thriller movie.",
    "62": "I mean, aside from the overplaying of the main theme music (which sounds eerily like the darth vader theme). The mellow music which is mazing if played once, and nirvana is amazing, but once overplayed, can put a man to sleep. Whats the point of Afred? The bat mobile couldn't be appreciated while we only see it in the dark. Its a forgettable batman movie. Years to come, people will not even remember this. Even Batman and Robin is still remembered till today, although for the wrong reasons, it was stupid but entertaining.",
    "63": "What makes Batman stand out as the best known superhero isn't his riches, isn't his heritage, isn't his darkness. It's not even Batman himself that makes him stand out as the best known superhero. His legacy of (super)villains however does.Ask anyone to name even 2 villains of their favorite superhero and the chance you won't know 1 of those villains is big.However with Batman as well as Spiderman the chances you won't know the 2 villains is close to non-existent.Yet Matt Reeves doesn't know who The Riddler or Hush is. Both have the same MO, yet one kills and one doesn't. And Matt Reeves thought it was a good idea to mix these up. To the normal public he might have made a great movie, but to me he just made the worst mistake anyone can make involving one out of two of the worlds best known superheroes.P.s. I don't even want to mention what he did wrong with Selina Kyle/Catwoman due to spoilers. But man did he just screw up every character in this movie.To Matt Reeves: Read some comics of the characters you'll use before making a movie about them. And please for the love of god, don't say yes to everything you're given the opportunity to.",
    "64": "Complete and utter self serving trash. From the ridiculous haircut to the fact Batman is a skinny emo kid and that's not even mentioning the awful looking action scenes and terrible CGI when it is used. There are huge portions of the movie with little to nothing happening. If The Watchmen, Saw and Prisoners had a love child this would be it but not in a good way. Not even close in substance to any of those movies but tries to imitate the style and tone of each right down to the voice over narration, Paul Dano, clues about clues about clues, riddles etc. It seems all you have to do to score high reviews is to make something dark and gritty. Honestly how Pattinson is meant to be physically capable of dominating anyone is laughable never mind Zoe Kravitz all 5 ft 3 and 100lbs of her knocking guys out with single kicks then getting battered and choked out by a pensioner? Awful truly awful movie.",
    "65": "While this movie has a more dark tone and grittier tone with crime in Gotham. It's very slow paced and the plot just isn't that interesting. For a 3 hr long movie, I was falling asleep by the climax.It's not that I dont like long movies but it just has no charm. Very bland movie, while I like the new directions of a more dark and realistic batman. Foremost it needs to be entertaining.",
    "66": "I thought that was very overrated. It felt way too long and didn't make sense. The stories were confusing and it didn't feel like the first of a series. It felt too much like a sequel. In fact, the pacing and look felt like it could have been a sequel to Tim Burton's Batman. Batman appears too early into the movie and we don't know the backstories of the villains well. In fact, the opening action scene at a subway station was cool, but there was no explanation to the group off the subway picking on this one character who wasn't explained either. The Penguin didn't seem to have anything to do with it and Catwoman wasn't explained much either. The action scenes were cool and Pattinson was a good Batman, but a flat Buce Wayne who looked more like Scarecrow. The Riddler was fun, but it didn't explain how he knew Bruce Wayne was Batman.",
    "67": "Dark and just what you expect from a batman movie, manyone has written, even i the grumpy old man think that this was overkill of a superhero movie, even with a new cast and without the clown, its miles away from the latter 2 parts made in the new millenium.But if your fan of the dream of gotham and the comic caracter then go wind it forward, it wont be a rewind for me.",
    "68": "This is a guy who is called Batman / Bruce Wayne but he isn't. Other characters have names from the comics but they aren't those characters. They took a crime drama, sprinkled in a little action and gave the characters Batman names. It's SO long. Every time I thought it was ending nope there's more. 3 hours in total, plus the 25 minutes of previews you sat through it you see it in the theater.",
    "69": "This is not the Batman we can relate to. It's absurdly unconvincing. It's painfully slow. I hope there isn't a sequel to this. The cinematography and editing is very good.",
    "70": "Ok DC you are knocking off the Crow now so what? Haha How stupid is it that the media shows the Riddler's stuff live! This movie is so dumb. How far super hero movies are falling down a drain. Cesspool of crap movies. Lower your IQ adults to watch Hollywood try so hard to make some old fun colorful super hero's dark and melancholy gray and black people on anti depressant's .",
    "71": "You can't do much wrong with a Batman movie. This movie is, I don't know why, 3 hours long! That sounds like a treat, but it wasn't. There was not much of action going on. The car chase, yes that was great, but was about that.Robbert as Batman was a bit boring. He has trained a lot for this movie, why? He was quite a quiet batman. That was boring. I watched the movie in 4D x and fell asleep due to the boredom. I thought, when there is action the chair will wake me up and that happened.As quiet Robbert was as Batman, the noisy the Riddler was. I love Paul Dano as an actor, but when he scramed he screamed for no reason. Trying to make his character interesting I guess, but it felt forced tot me.This was not the best Batman movie and not worthy to be compared to Nolan's movies. There was no humour, no connection to the characters, no character development.",
    "72": "They make Batman out to be a petulant child, instead of a wise hero.Pootietang Batman but with a white actor.This is The Batman of the Left and is probably more relatable for the college students of today. This Batman could really do some great beatings of women criminals, and female athletes, too.Blackcat Woman likes the white bat boys more than Black Panthers, I guess 🤔\nBlackcat, BlackJim, and Riddler were cast best. The rest were a joke.The Darth Vader music didn't help the movie.The production team seemed to have followed the Twilight kid, so the whole movie plays like a bad soap opera, just like Twilight.Easily the worst live action Batman, ever.",
    "73": "I really don't understand all the love for this new Batman movie. It was very long and boring. It was filmed with no light. You can barely see anything. Ever character is speaking just above a whisper or mumble. The story was weak. The villains were not interesting. There were a couple of stupid scenes in the movie too. Emo Batman was not cool. I know Pattinson can act, but the script and direction let him down here. Riddler and Penguin were wasted here too. Bottomline, this movie is way over rated. Save your time and money.",
    "74": "Another Hollywood cash grab that leaves me cold. Pattinson seems to channeling some emo energy 20 years or so out of date. The whole thing is in need of good lighting and in the end things remain so physically dark that I found it all thoroughly depressing. The idea to stylise this as a film noir I don't really get either, I know the film noir genre well but there's more to it than dark lighting and a detective-style narrative. This one has no atmosphere, just the usual brooding hero and multiple predictable villains. An unrecognisable Farrell is okay, if underutilised, but Dano is plain annoying, and don't get me started on non-actor Kravitz who messes up all her scenes. Worst of all are the fight scenes, which consist of the usual over-choreographed weak sparring that spoils so much mainstream stuff these days.",
    "75": "For two years, Matt Revess and Robert Pattinson beat up all the doubters in the back streets of Gotham.You may or may not like it as a movie, but it is a fact that we watched \"A Great Batman and a Great Bruce Wayne\".",
    "76": "I'm just sad no one in Gotham ever learned how to turn on a lamp. I'm so tired of \"dark\" being confused for \"good\". It looks stupid and takes me out of any movie where I want to scream \"finding the bad guy would be easier if you turned on a light!\"",
    "77": "The message of this movie is that the real enemy is \"privileged\" people not the \"misunderstood\" criminals and Batman can never solve anything fighting crime because he is part of the problem being \"privileged\" himself. He needs to reinvent himself like the producers did by re-imagining Catwoman, the Mayor of Gotham and commissioner Gordon. Certain people are clearly the good guys while those of \"privilege\", including Batman are part of the problem and need to be lectured to. Oh how this franchise has fallen.",
    "78": "It is very long, it is boring, it is pointless. Not to mention depressing. And once again, the 10/10 brigade is out in force, trying to (and succeeding) bump the rating for a formidably crap movie.You can't seriously think this drivel is \"perfect\" to give it such a score.",
    "79": "I'm not entirely sure what I was expecting, other than maybe a Joker 2019 surprise gem. Although with Perpetually-Stoned-face Pattinson, my expectations sure weren't high. Against my misgivings, I decided to give it a shot.And I regretted it about 30 minutes into it. Depressing and not in a good way, slow-paced in the worst way, with yet another batch of terrible miscasts continuing the trend of casting the worst choices for titular roles. Amateur-at-best action scenes, a far cry from what you'd expect from a Batman film. Michael Keaton would be turning in his grave if he weren't still alive today.But hey! It wore me out so bad it ended up curing my insomnia!",
    "80": "3 hour slog of 1 hour of material. Can't recommend it sadly. Barely a plot. No character development and just sooooo slow. Lack of personalities with all the cast.",
    "81": "And u get an OK movie. Nothing special.It was very long and it felt VERY long.Not a bad movie but Rob just didn't do it for me as Batman. Maybe it's bias, idk.I just kept seeing Edward Cullen whispering and trying his best to do fight choreography for like 6 hours.The movie was super dark (even in the daytime scenes) and super LONG.I hope the sequel is brighter...and shorter.",
    "82": "My and my son watched this film and it was rubbish even the bat mobile was crap nothing futuristic about it the one from the Batman movie was light years ahead , acting was good story was boring and slow I think the 10 ratings was because people was comparing it to other Dc movies not on the actual film 🤣",
    "83": "I actually walked out of cinema before the end. Stupid, boring, no story, bad acting. Batman brought fists to gun fight, imagine how they insult our intelligence trying to make him the winner. I think people on Tiktok can make better job. Don't mind mistakes, I am walking to my car and writing.. Only good thing was popcorn and a drink I bought.",
    "84": "To me it was neither a good movie nor a good Batman movie. Just a ok movie , hyped too much . Robert Pattinson has good potential as the Batman but needs a better story & script ...",
    "85": "First of all, let's all agree that Pattinson is a good actor. However, this does not mean that every good actor can impersonate any fictional character. Some fictional characters require certain traits that need to be present in the actors that portray them. Batman is one of the darkest, toughest, meanest, manliest, scariest, most well-built, most brutal, most deeply voiced, smartest, best strategy making characters that have ever been created. In other words, Batman is the ultimate human male (without superpowers). Such features are simply not present in Pattinson, genetically speaking. On the contrary, his genetic features are somewhat feminine. Not that there's anything wrong with that, it simply is the opposite of the character's profile. No matter how tough he may try to sound, how much muscles he puts on and how much steroids he ends up injecting in his system, he simply does not fit the profile. To put things into perspective, let's ask a question. Can Pattinson portray the Punisher? The answer is a simple and plain \"NO!\" Why? Because he simply doesn't look tough enough! Batman is the punisher on cosmic steroids. He's way tougher, smarter, stronger, and darker. The reason people sometimes overlook this fact is because of Batman's moral code. So if Pattinson can't even portray the Punisher, how the heck do you cast him as the Goddamn Batman?!!Even though the movie was trying too hard to convince the viewers that this Batman was intimidating, well, \"spoiler alert\", he's not! Not even a little bit. In some scenes, you actually feel sorry for the character, which is such a shame. Of course, the main reason behind this is that the guy who's playing the character isn't. Not only did Batman lack brawn in the movie, he also lacked brains! Everybody's talking about how this movie perfectly portrays Batman as \"the world's greatest detective\". Sorry guys, but if this is what \"the world's greatest detective\" looks like to you, you should definitely read more Batman comics and maybe some Agatha Christie books too. I mean, seriously, the guy had no clue what a carpet tucker was! How the heck are people even comparing the detective work in this movie to Se7en? What was presented here wasn't even the ABCs of detective work. It was pathetic, and Batman was slightly less of an idiot than the cops around him. His suit overall was not good. He literally looked flat in it. I liked the fact that it's bullet proof, but that's about it. The cowl is the worst thing about it. It's cheap, too revealing, and makes Batman's head look like an Easter egg! I really liked the camera lenses though; that was a brilliant addition. The adrenaline shot was a good idea too. It makes total sense, and I can't remember it ever being used on the silver screen. The batmobile was another thumbs up. But wait, I have to talk about the stupid point of Batman using the front door! I mean, seriously, what the hell was Reeves even thinking? Batman is the world's greatest ninja. If he wanted to get into someplace he wasn't welcome, he'd sneak in, get whatever he needed and leave without anyone ever noticing!Believe it or not, Catwoman's casting in this flick was a much better choice than Batman's! Zoe almost fits the character's full profile. She's agile, flexible, mysterious, seductive, with sharp exotic features. Maybe a bit too exotic, but that isn't really an issue. The real issue with her is that she's too small and thin, which makes her look too fragile against her foes, making her fight scenes seem unrealistic to the viewers. But I guess they had to cast a tiny actress for the role, especially since the dude who's playing Batman is a whimp.Colin Farrell as the Penguin. Wow! Just wow! This guy took the character to a completely new level. I think it's safe to say that this is my favorite Penguin adaptation ever. Maybe even better than the comics! Farrell's acting is so good, it makes you forget that he's actually playing the character. Turturro's Falcone was spot on too. They both looked like they came straight outta The Godfather!I don't usually like it when they change anything about a comic book character, such as their ethnicity, simply because I like the live-action representation of the character to be as close to the comics as possible. But in Wright's case, I'm actually glad they did. He simply nailed the character.Now let's talk about the movie. The cinematography was really good and I really liked the film's noir theme. The score was amazing too, which added more depth to the movie's theme. Reeve's direction was good, but had its flaws. The script was very basic and lacked layers of depth. Paul Dano as The Riddler and Andy Serkis as Alfred were decent, but nothing special. The movie's runtime was way too long (it should've ended at least 30 minutes earlier). And then there's the ending.. that stupid motorcycle race between Batman and Catwoman looked like something out of a cheap Indian movie. Not even cartoons do that anymore!",
    "86": "Seeing the positive ratings and been a fan of all the batman series of Christopher Nolan, I was suspecting this may not match Nolans version. But this was, much beyond the lower levels of any batman movie. It was a painful 3 hour journey in the movie hall. Not sure who the fans are with positive ratings making it 8.3 in IMDb. Many might not agree .",
    "87": "In short, Reeves has the merit of showing that Batman can turn out to be a very different version from what was previously perfectly explored by Nolan. This is a more thoughtful, more investigative, and even darker Batman, not in a hurry to show all his cards.Even with an excessive long duration and some unnecessary expository dialogue, it passes the difficult test with flying colours.",
    "88": "I am a life-long fanboy; own every movie, have seen them multiple times. Won't be buying this DVD. It was fine, boring, long, some errors in cannon. It rained and was night the whole three hours. Not one joke. Lots of moody looks - like in \"Twilight.\" Saw it in the theater with about 10 other people. Hope they don't keep this skinny Batman. First one in my life that I thought, I could beat him up. Who rides motorcycles in the rain when you have a car? Also, if you get shot in body armor, it is like being kicked by a mule. It was long and plodding with depressing music and nonsensical plot lines. We were underwhelmed.",
    "89": "I just got out of The BatmanThis movie really won't be for everyone!! Easily the darkest Batman movie yet. It is gritty, depressing and not a fun movie at all.This isn't your usual comic book movie, it's a detective movie, with more in common with Se7en, than previous Batman movies. The first two thirds of the movie are amazing, at one point I turned to my son and said \"This is a masterpiece\" everything works and is brilliant, I was 100% enthralled, but boy does it drop the ball in the final act.Of the cast Pattinson is great, Collin Farrell is ok, Zoe Kravitz was fine too, but she has zero chemistry with Pattinson (Keaton and Pfeiffer they are not), Paul Dano though, was incredible, especially in the scene in Arkham, whilst Geoffrey Wright is as great as he always is.On the downside, It does have some pacing issues, and is really too long (though I'm not sure what I'd cut), and I really wasn't keen on the ending (I don't know if it is a comic book storyline they did), as I think the final act really lets the movie down!! It's here, in the final act, that you feel the movies run time!!I was surprised there were only 36 other people in my screening.",
    "90": "A serial killer strikes in Gotham City, killing important political figures, and leaving behind a series of cryptic clues, only Batman can stop him.It's certainly very different to all previous Batman films, it's definitely dark and atmospheric, but the pitch and narrative are very different. The Batman is told almost as a crime noir, made in a way that you could watch it in black and white to enjoy a different perspective.Interesting in that it's a real exploration of the character, his past and family, we get a sense as to why this Batman is so haunted.I wasn't blown away when I heard that Robert Pattinson was cast as Batman, Vengeance, but I was won over very quickly by him, clearly penned as a character with the weight of the world on his shoulders, this incarnation is dark, haunted, relentless, but strong and determined. Don't expect laughs or lighter moments, there aren't any.Andy Serkis awesome as always, I thought Colin Farrell and Paul Dano were great too.Great visuals throughout, Gotham looks terrific, and there are some terrific special effects, and a few duff ones too. I think Pattinson looked awesome in the costume, it was well designed.The music was fantastic I thought, one of the movie's best elements, interesting seeing so much carnage played out to Ave Maria, a real juxtaposition.I wish I could say it was without any flaws, as it is an epic, imaginative reimagining, one that deserved its success, however pacing is an issue, it feels long for the sake of being long at times, some scenes are painfully drawn out. Some of the dialogue was hard to make our at times too, was it me, or was some of it a little muffled?What I really didn't like though, the ending, that has to knock a couple of stars of the rating, it just didn't work.Interesting to see what comes next, this was an imaginative retelling.7/10.",
    "91": "The Riddler(Paul Dano, spot-on. How did it take this long for him to get a role like this?) targets public officials, revealing their corruption, and killing them in gruesome fashion(how did this get away with a PG-13 again? Oh, right, as long as you don't show the details, then you can get away with almost anything, by now. Even a barely toned down Jigsaw). In order to stop him, it will be necessary for the Bat and the Cat(with amazing chemistry), together, to stop the rat. Thanks, Matt.I really did not think that we needed yet another film dealing with Bruce Wayne's alter-ego. How about Nightwing? I know it's not likely, but part of me still holds out hope that Grayson will be turned into a feature(if you've never checked out the trailer on YouTube, you're missing out). But somehow, this managed to convince me. Fingers crossed for at least one sequel. Robert Pattinson is incredible here. Seriously, can we just stop freaking out every time the role is recast? The closest we've come to someone who shouldn't be doing it is George Clooney, and it's not like anybody came out of that flick looking good. He took that job after doing From Dusk till Dawn. There was good reason to think that he was going to be badass. Honestly, everyone here gives a strong performance.Something that will definitely appeal to some more than others, is the genre and tone. This is essentially Se7en meets Zodiac. It is not paced like a typical massive blockbuster. While the action is great, especially the martial arts, not to mention that car chase, there's less of it and it is smaller scale than for example the Nolan trilogy(which also has far more escalation). Essentially, this just isn't focused that much on that aspect of the titular icon. And I think we can all agree that we've had some great entries that deliver that. This is more interested in conveying to the audience that there's a reason he's called the world's greatest detective. We've barely seen it outside of the animated ones before, so I'm very happy with that choice by them.In addition to what I've already mentioned, this features some drugs, suggestive material and strong language. I recommend this to any fan of Batman. 9/10.",
    "92": "Matt Reeves The Batman is a hell of a movie, it is the darkest live action Batman movie ever made, and the longest one too, The Batman fills with a top notch action sequence that not only exciting, but it's cinematic too, the cinematography was just incredible, Michael Giacchino The Batman theme song has just become one of my favorite movie theme song ever, it's enduringly great, the action is perfect itself without the theme but they making it even more perfect with the theme in the background especially when Batman shows up, it really making me hyped more because of that, Colin Farrell transformation is as amazing as his performance as The Penguin, Paul Dano performance is giving me a Heath Ledger Joker vibes but not trying to be Heath Ledger Joker which is still great, Paul Dano The Riddler is still a terrifying and a very disturbing villain, Zoe Kravits performances as Catwoman was amazing though she is not as wild as Michelle Pfeiffer in Batman Returns but boy did her gesture and look is as wild as Michelle Pfeiffer, and the Catwoman fighting sequence is definitely a win for Zoe and i did still like her a lot in here, and in the end we got The Batman himself, Robert Pattinson, all i can say about him as The Batman is that i hope everybody is starting to know him as the guy who play The Batman which is a really good movie and not the guy who play in the horrible Twilight film anymore because he is indeed an awesome Batman, now he was become my second favorite Batman next to Christian Bale in number one still, the story of The Batman itself is great, and my only problem with the movie is that there is quite a lot of particular scene that for me are just very slow or too slow, it's not boring but i feel like they can make it a little bit faster, if it's only one or two or three scene i probably still can forgive it but unfortunately it happens more than that, but at in the end The Batman is still a hell of a great movie, it's still amazing and it's still incredible, i was impress by most of the thing that happens, i was excited, i was hyped, i was stunt by all the amazing thing that they've done, The Batman is fire!!!.",
    "93": "The headline can be taken two ways. If you remove any hype or expectations, saying it's a good movie is positive. But if you are hoping for an amazing new Batman iteration, good means it wasn't great, let alone amazing.This review will come off as negative but I did enjoy it. I love the tone. It's super dark and grounded in reality, even more than the Nolan trilogy. And it feels true to the character. Zoe Kravitz and Jeffrey Wright are great casting choices. It's a mostly well-made film and a good addition to the franchise. And the Bat suit looks awesome.At the same time, nothing about this movie wowed me. I did not connect with the characters, especially the villain. The relationships seem undeveloped and not organic. I was not nearly as emotionally invested in the story as I should have been. It mostly feels surface level.If you're a huge Batman fan, I think you will really enjoy it. But as a movie, I don't think it fires on all cylinders. The Nolan trilogy still reigns supreme. (1 viewing, fan early screening 3/2/2022)",
    "94": "Matt Reeves' long-awaited Batman reboot has in many ways become a magnificent, epic spectacle, with its dark, brooding version of Gotham, a pessimistic, haunted Batman as realized by Robert Pattinson, and an intricate, Zodiac inspired take on his main antagonist Riddler. But despite a relatively wide variation of themes and having the shell of a really good movie, The Batman slowly gets itself lost in sluggish power struggles, vapid social commentary, various allusions to original sin, and a promised showdown which turns out to be no more then a preface to the next episode of a prospective series. Pattinson's uninspired voice-over in the beginning and the end reveals that this Batman hasn't really learned anything or developed during the movie's far too indulgent running time, despite extensive soul-searching, ostensibly. He has just altered his justification for his actions. Not for the first time in Batman history, the villains are far more interesting than the hero. Paul Dano's wonderful performance makes Riddler a layered, fascinating specimen. And there are also delightful supporting work from Peter Sarsgaard as a tragic, corrupt district attorney, and an unrecognizable Colin Farrell as Penguin.",
    "95": "Even though I've seen all the Batman adaptations since the 80s, I can't call myself a superfan. Still keeps me entertained and some of the previous movies have been very entertaining. Robert Pattinson is for me the big draw, before I started watching this film. After his performance in The Lighthouse, I think he is a fabulous active actor. Versatile, deep and with an empathy in the roles that I think is often unique.So why do I think The Batman is only average?Robert Pattinson makes a good effort here too, with a dark and serious Batman. It's not his fault that I didn't find this highly entertaining.First, I think the script is too bland. I can't quite get the supporting roles. The film's villains remain somewhat tame and unengaging for me. This, in combination with the length of the film (it is long!), I fell off along the way.Feel free to continue using Pattinson in future sequels, but please; give him a better script than this. And no more anemic villains please!",
    "96": "I will say I liked the story, but the long dragged out and slowly paced near 3 hours was ridiculous. You could watch this at 1.5x speed and it would be more enjoyable. This needed at least 20 mins cut out and much faster storytelling. And the constant whisper dialogue in most of the film became annoying really fast.I do like Pattinson as an actor, but not as Batman in this one. He wasn't convincing and his monotonic whispering dialogue and Emo demeanor was very lackluster to the point of cringeworthy. And that's him both as Batman and even more so as Bruce Wayne.And what's with Colin Farrell being cast with all these prosthetics to play the Penguin? Was every other actor that naturally has that character's look unavailable? It's not like Farrell has a particular set of Penguin skills lol. Casting Farrell as Batman and Pattinson as Penguin, now that would've worked much better imo.I'm also a big fan of Westworld's Jeffrey Wright, but here again, he was very unconvincing as Gordon, especially when he also had that monotonic whispering Emo demeanor. I get that director and joint writer Reeves was going for that dark lonely dreary theme, but instead, the characters looked bored and inexperienced actors with sore throats.The only one that nailed their character perfectly was the lovely and beautiful Kravitz, who stole the entire show. I would've rather watched a 4+ hour movie with just her as Catwoman.All the Affleck, Keaton, Bale, Kilmer and even Clooney Batman characters were much more convincing, as well as having more and better \"keep you awake\" action in said films.Sadly, this one is a generous yet disappointing 6/10 from me.",
    "97": "The Batman (2022) is a movie my wife and I caught an advanced screening of last night. The storyline follows Gotham shortly after \"The Batman\" has emerged and established himself in the streets. A serial killer known as The Riddler starts a killing spree of everyone influential within Gotham's hierarchy until Bruce Wayne in inevitably the target. How are all of these people tied together and can Batman tie the pieces together before Wayne is the next victim?This movie is directed by Matt Reeves (Cloverfield) and stars Robert Pattinson (Twilight), Zoë Kravitz (Kimi), Colin Farrell (Total Recall), Paul Dano (There Will be Blood), John Turturro (Do the Right Thing), Peter Sarsgaard (Garden State), Andy Serkis (Lord of the Rings), Jeffrey Wright (Shaft) and Barry Keoghan (Eternals).The storyline, look and feel of this movie is an A+. The characters are perfectly cast and well executed. Farrell, Dano and Kravitz were a 10/10.This movie does a fantastic job of depicting the Batman universe with the appropriate grit and feel and the lighting and cinematography is excellent. This also did a good job of creating various potential spinoffs with some subtle references within the storyline and at the end. This has a very good Jeph Loeb comics feel to it and does a good job delivering the \"Detective\" elements of Batman. The violence was also brilliant and very well done. I will say this did not need to be 3-hours and there are an abundance of scenes that could have been better edited. This film likely should have been a hair under 2 and a half hours.Overall this is a magnificent addition to the super hero genre and an absolute must see for Batman fans. I would score this a 7.5- 8/10 and strongly recommend it.",
    "98": "I went in with ultra-low expectations because I think Robert Pattison is a god-awful actor and, this film took my expectations and made me promptly realise that, you can always go lower.I'm actually angry I wasted 3 hours of my life (and trust me, every minute of that time was felt).However, let's have some positives: cinematography is great and the music is fantastic. The opening scenes with The Batman made me think, I was going to have another Heath moment and be forced to eat my words because those opening scenes are indeed something special.But then the film gets going. Part \"Saw\" rip-off and so desperately wants to be \"Se7en\" in its execution, the story dragged. You don't care about any of the characters and I found myself pining for Clooney and his bat-nipples and Mr. Freeze.What I found really funny though is the producer of this utter mess got in touch with Nolan and warned him, \"We're going to make a better Batman than you.\" No. Just no.Like the last Lord of The Rings film, this has an ending that just keeps on coming. Something wraps up and you start to get ready to leave, the film continues. Something else is wrapped up and you think, \"That's it...\" and it keeps going.... Something else, and on and on and on...I can see why the guy in the seat nearby racked up a massive line of coke and snorted it midway through (and no, I'm not joking... Welcome to Southampton).With regards to the plank of wood.... Sorry... \"Pattison\". In the initial scenes I was genuinely excited. Never a fan of his costume before, seeing it here - suddenly I \"got it\". He proper beats down on someone in a vicious attack. They get back up... In fact, everyone he bat-punches gets back up and just attacks him from behind again. There's no real threat here. When Bale smacked someone down, they stayed dead. But then, when Bale stripped off (same as Affleck), they were built. Robert looked like me and I look like Mr. Burns from The Simpsons. A skeletal mess with no beef there whatsoever. In fact, when Robert bent over in one topless scene, his bones stuck out and I thought wings were going to pop out. But then, why wouldn't they when he infamously said he refused to bulk up for the role (I would have sacked him there and then).His time as Bruce is strictly limited - thank God - so you can't really judge him for that. As Bruce he just stands there and looks confused. As The Batman, by the end he became a parody. His Batman voice changed to the same sound as the joke Batman in the college humour videos (A is for Alfred = genius). When he was mad, it just look like he was pulling a cum-face. And don't even get me started on the Adrian Mole diary keeping that's going in with the voice-over narration.Honestly, with the exception of the opening ten minutes or so, I have never hated a film so much as I did this and given I went in with low expectations, even I am surprised at how fuming I am at myself for wasting my time on it.",
    "99": "What's the one thought you had when Warner Bros. Casted Robert Pattinson as the Batman? Mine was 'Nooooooo!!!'. I was bewildered on the decision, questioning if this the best they've got for Batman? I didn't hate him but I was concerned if he could take up a big role like this as he doesn't have the regular features embodied by the titular character.And today's the day I witness myself that I was wrong, Pattinson is a great Batman. Hell, he slayed as Batman! Yes, his features don't really resemble the classic Batman, but he made it his own! This is one Batman that is better than Ben Affleck and George Clooney and audience would compare him to the likes of Christian Bale and Michael Keaton. Also, there's something about Pattinson's jawline that complements his looks everytime he's wearing the mask. He oozes his seemingly mysterious vibe that appears alluring enough for audience.2022's The Batman runs for about 3 hours long and what's special about this one is it offers a journey that doesn't dive into its origin story, making it a different piece compared to others. It's not centred on 'my parents were killed in the back of an alley when I was a kid', but it takes on a different story, focusing more on Gotham city and its grim corruption happening within.It's engaging throughout though it's not meant for some viewers because... the narrative isn't made for audience preferring commercial films. I would say the context and story are as rich as The Dark Knight and Joker. If you have a big issue with these two, I mean this as no offense but stick to Marvel.Like one of those PS4 Batman games, the film offers a bleak and dreary look at Gotham, transporting the audience into a world of transparency and reality. It doesn't shy away from showing us the rawness of the city; the coal-coloured alleys and underground tunnels, the debris scattered on the floor and the hard-hitting fact that no one is safe therefore, audience has an easy time relating themselves with our world filled with arising problems and issues.If you're wondering Zoe Kravitz did a good job as Catwoman, I would say yes. However, she's my least favourite compared to others who have held the same role like Michelle Pfeiffer & Anne Hathaway. She could've been better.Kudos to the makeup department for putting on such a brilliant work for Mr Penguin. If I hadn't known that was Colin Farrell, I would not have recognized him even a bit. Farrell did an excellent job as Penguin but there were a few times that he reminded me of Jared Leto's in House of Gucci with the overused accent🤣. And his character was mostly missing in the second half which was a let-down for me.What a brave decision when they did a 180° turn on The Riddler. They realized that Gotham is a dark place, they changed Riddler into someone darker than what the comic has offered. The Riddler is profoundly menacing and he will remind you of Heath's Joker in TDK once in a while. Paul Dano did a great job but... I felt they could have picked another actor. Prolly that's just me but hey, Dano is 👏👍.One of the issues I have is the overused soundtrack. For all 3 hours long, rarely you will encounter a scene with no music background 🤣. It takes away a bit of the grounded experience and the suspense that comes from it. If only they restrained the music much more, I believe this film would be scarier. What's worse is the music that was playing sounded quite the same with the next, it comes to a point where I felt irritated by it.Also, I wasn't impressed by the climax scene. It feels like they are not giving their best shot. It's just not 'ummphhh' enough as what has been hinted in the first two hours. Just when you thought it's the beginning of an exciting final battle scene is apparently almost the end of the movie.The reason behind this might probably be because of the not-so-formidable villain. Let's take a recent example, The Riddler is somewhat similar to Rami Malek's Safin in No Time to Die in terms of his capabilities and abilities; they both ace in strategy and planning but weak in combating, resulting in an almost non-existent final battle.Verdict: As if like a bleak painting canvas sold at a prestigious auction, The Batman exhibits an ambitious look into Gotham's gritty landscape all along strongly coloured with a frighteningly dour tone, illuminating what could possibly be the best movie of the year so far.",
    "100": "\"It's a big city. I can't be everywhere.\" Batman (Rob Pattison)\nA more complete adaptation of the Batman comics presence there isn't, and no more gothic, spot-on condemnation of human frailty since the 50-year-old Godfather. Writer/director Matt Reeves' The Batman is arguably the definitive dark night of the American soul in its corruption and its salvation. As an achievement of robust American neo noir, it ranks somewhere behind Martin Scorsese's Taxi Driver and Godfather.Batman (Rob Pattinson) scowls as if he came from a Twilight frame of mind while he shows a soft side in his love for Selena Kyle/Cat Woman (Zoe Kravitz), the Bat and the Cat, working to save the city from the likes of Riddler (Paul Dano), Penguin (Colin Farrell), and crime lord Carmine Falcone (John Turturro). Besides offing a large number of corrupt city employees, they offer Bruce Wayne a chance to learn about his obsession with his parents' public and private lives and their untimely deaths. Although none of the bad boys eclipses the impact of Heath Ledger's multidimensional Joker, even in his humor, together they are a powerful cast of darkness.Besides bringing together an ensemble of estimable actors in every role, Reeves gathers expert cinematographer Greig Fraser and production designer James Chinlund to create a darkness full of telling images while competing with the great film noir compositions of all time. Dark, yes, obscure, no. The darkness that envelopes each scene says more about the bleak side of humanity than any written treatise could.Besides the corruption of city officials, The Batman casts a shadow over the virtue of vengeance, embodied in Wayne's longing to account for the death of his parents and bad-boys like Riddler to assuage the pain of his childhood by terrorizing the city. In his favor, Riddler is ridding the city of corrupt power while Batman is cleaning it of its petty criminals. His stalwart ally, Lt. James Gordon (Jeffrey Wright), realizes that the real crimes are housed in his police force and ultimately his supervisors.The Batman is a hip and incisive representation of modern angst that not even a hero can relieve, at least not right now:To the strains of Nirvana's baleful Something In The Way: \"They think I'm hiding in the shadows, but I AM the shadows.\" Batman.",
    "101": "To preface this review I will say when watching this in the cinemas, many people walked out. I was looking over my shoulder to see of anyone else was laughing at what cringe this movie delivers.The actors in this were one of the highlights excluding the villain (the riddler) and the Batman. Penguin was by far the coolest and best actor. Honestly a good fellas type character. All other supporting actors were also quite good. I however think Robert pattinson a horrible pick for Batman. The whole time he seems like a really awkward and sad goth kid, I was half expecting him to say \"gosh get outta my room\". Absolutely trash acting The riddler was even worse! He was the major cringe factor in this movie with awful and dorky video calls where he is super non intimidating and laughable. His video calls reminded me of the horror films my 15 year old class mates had made in high school, their budgets were $0.The relationship between the Batman and cat woman was my only other plus in this movie. The romance was quite sweet and had a lot of tension. They rode around In their awesome motorcycles just roaring through the town it was really cute.The bat mobile was pretty awesome but definitely very weird for a Batman film. The old classic camaro was a little spine chilling not gonna lie.Now to answer everyone's questions I do think Robert pattinson was a terrible choice for Batman for a few reasons. At first I had no qualms but watching the film made me believe he was a bad and cringey actor for the role, he just isn't a badass over masculine kinda guy, like at all. He seems awkward and it shows. His voice wasn't that great, his body was not very big nor muscular like many other batmans, heck even the joker is ripped in suicide squad. The guy is 6ft exactly but his frame is tiny and it shows next to bigger actors. The story was God awful without spoiling pretty much lots of people die, bombs go off and some personal people Batman knows get injured. Then Batman goes welp I can't be in 3 places at once I'm only human. And proceeds to get ko'd twice throughout the movie and punched lots during fights. He is by far the worst and weakest looking Batman with the worst actor to have played him. The cinematography was good and the horror feeling this brings is good but everything else was just so horrible. Did I mention this film is 3 hours long to have a crap middle and end? Well know I know!. Wow I couldn't wait for thr 3 hours to end and multiple people walked out before the film was half finished. Definitely wouldn't reccomend this garbage piece of cinema. 2/10 for me.",
    "102": "3 Hours run time is totally worth it.A well mature dark movie which Batman character deserves.Robert Pattinson as Batman and Bruce Wayne is the best casting choice after Christian Bale.It's so dark, gritty, visceral and god damn great.Colin Farrell as Penguin was Fantastic. Couldn't recognise him.Zoe Kravitz as Selina Kyle and Cat woman was great. She was fantastic.Paul Dano, Jeffrey Wright, Andy Serkis were great too.Casting was done greatly.Batmobile was so f*ing great. When the engine revs, you will get the goosebumps.Action scenes were absolutely f*ing great. Its loud, bombastic and visceral which will give goosebumps.Fight sequence were absolutely gritty.Cinematography done by Greig Fraser is another masterpiece from him.Michael Giacchino music composition really great. It has that dark gritty grandeur theme music.The dirty, criminality and madness in Gotham City, you will feel it. It's so dark and grey which Batman character needs.Production Design is just brilliant.Story wise this movie felt more to Detective Batman comic book and done outstandingly.Detective Batman which is the original DC stands for.I couldn't not find any error in the whole movie.This is a well made brilliant movie by Matt Reeves.Totally worth waiting for. Can't wait to see it again.Direction: 10/10\nCinematography: 10/10\nActing: 10/10\nScreenplay:10/10\nStory:10/10\nMusic: 10/10.This movie deserves 10/10.",
    "103": "You've seen a million Batman movies, but you still need to steel yourself for the darkest Dark Knight yet. Starring Robert Pattinson as DC's Caped Crusader, 2022's new movie The Batman is an intense, apocalyptic cinematic experience. Following the famous murder of Bruce Waynes parents, Wayne is two years into his crusade against Gotham City street crime. As Batman unpicks the cryptic clues, the investigation peels away a greater conspiracy. But the real riddle is how the ranting killer's twisted motive ties back to Batman himself. He Batman (in theaters March 4) is barely a superhero movie, Christopher Nolan's criminal politics and Zack Snyder's operatic brutality, plus the standalone Joker movie's psychological backstory, vaguely timeless design and layers of dark irony. Most of all, The Batman is a straight up horror film. This new flick is PG-13, but it's on a whole other level from the relatively bloodless Dark Knight movies -- and on a different planet from any Marvel film -- immersing you in a nerve-shredding three hours of escalating dread and simmering pain garnished with some astonishingly nasty, and dark touches, and makes think what one man can go through because of loosing his parents. You absolutely 100% can't show The Batman to a child, it will give them nightmares, and bad thoughts. Robert Pattinson's batman is lank-haired mess, and is a world away from Christian Bales outstanding professional look. This darkest Dark Knight may not be for everyone (and certainly not kids), but it's a gripping and nerve-shredding Bat-thriller. The one thing that Matt Reeves explores that Christopher Nolan doesn't is how dark and how can he make it to the story, and comic, and even a horror movie. The Batman should have been rated R not PG-13 because how intense, Dark and scary it is. The soundtrack was done by Michael Giacchino, its very graceful incorporation of specific themes for Batman and Selina, as well as pre-existing music ranging from classical pieces to Nirvana, provides tonal variation to ensure that The Batman never becomes a punishing downer. Go watch The Batman on March 4, 2022 at your Regal theater.",
    "104": "Greetings from Lithuania.\"The Batman\" (2022) for me personally was not as entertaining as Christopher Nolan's take in \"The Dark Knight\" trilogy. If i would compare this movie to Nolan's series, it would be more close to \"The Dark Knight\". That said i liked \"The Batman\" for its being very faithful adaptation of Batman universe itself. I saw two or three DC' animated Batman movies and this film was more in common with those then any other Batman movie ever made.\"The Batman\" (2022) is a very dark movie, and i mean that in every way. In a whole 3 hours running time there is basically scene or two set in day time. And 98% of the film is set during night, and looks like in Gotham it is always raining. It is a very gritty and down to earth setting, and that i liked about it. The atmosphere of this movie highly reminded me of \"Se7en\" (1995). Performances were good and Robert Pattinson was a superb as Batman. Yet i think it was Zoë Kravitz who stole the show.Overall, \"The Batman\" (2022) is a dark, gritty and very down to earth adaptation of Batman. For younger audiences who grew up on watching Marvel movies (no offence - i really enjoy them as well) this adaptation of Batman will be a test of patience - this movie is not for everyone and reminded me of \"Joker\" (2019) more then any other comic book movie. In its running time 3 hours this movie did drag here and there, but as a whole package it really worth seeing. Not my favorite Batman movie, but a solid one.",
    "105": "I've seen campy Batman movies from Joel Schumacher, I've seen more grounded/realistic Batman movies from Christopher Nolan, and I've even seen a goofy Batman movie from Chris McKay, but there's one thing I never in my life thought I'd see...a boring Batman movie. Matt Reeves pulled off that unlikely feat with this 3-hour-long drudgery of a film. Admittedly, I'm coming at this as a person who has never clicked with the character of the dark knight. I find Batman to be massively overrated, and I struggle to see why the entire world bows down to him as if he's the greatest superhero of all time. That being said, I can still find entertainment from his stories, and rarely have outright hatred for the films (aside from when Zack Snyder directs them.)The Batman feels like a film made after Matt Reeves spent a great deal of time reading fan discussions on the internet, so it ticks a number of the boxes that I've heard comic book nerds complain about over the years. They make a point of never having Batman kill anyone. I mean, one could argue a few received head wounds that could easily lead to their death, and he caused a car crash that could easily have been fatal, but at least he's not pulling out a gun on anyone or dropping people off the top of a building. Also, all those fanboys love to talk about Batman being the world's greatest detective, so in this movie the first time we see the Caped Crusader, he's literally walking into an active crime scene. It's a ridiculous juxtaposition that made me chuckle, but I'm sure there were some people out there who wanted to applaud that moment.The other aspect of The Batman that had me chuckling when I don't think they intended anything to actually be funny was when we meet Bruce Wayne outside of the mask. First of all, there's another bit of fan service in the fact that we actually see him with black makeup smeared around his eyes. But worse than that is just the exaggerated emo goth-kid look that makes it appear that Robert Pattinson is cosplaying as Gerard Way from My Chemical Romance. There were more than a few scenes where we are looking at Bruce Wayne through a bunch of long greasy black bangs and I was wondering who thought that was a good idea. I will give Pattinson credit for not overdoing the Batman voice too much, and almost always disguising his native British accent.As I said at the start, though, the big problem with The Batman is just the fact that it's boring. The film drags on and even the action sequences feel kind of bland and lacking in memorable moments. There's one car chase that stands out as the biggest moment where I was literally checking the time, because it added nothing to the plot of the film. The entire plot is a non-stop series of tropes that feel like I'm watching someone who wants to do a Tarantino-style homage to other crime-thrillers, but without the talent of Tarantino. The story is slow-moving, and insanely repetitive. I could not believe how many times they returned to the same places and did the same things. There was a complete lack of efficiency in the storytelling, as if no one was willing to cut anything, and I felt there were entire characters and storylines that could have easily gone without hurting the story one bit.The entire movie is built around a big puzzle, which I can get behind. It started developing as though there was a genuine murder mystery for us to uncover. But as things started to move along it became clear they didn't have a reveal that would warrant all the time they spent building it up. As a side note, I think I'll be happy if I never again have to see a scene where a person is questioned about who is the big bad behind everything, and they say they can't tell because something worse than death will happen to them. This only works as a stupid stalling technique to build suspense for the audience, and if you don't have a satisfactory surprise pay-off at the end it's totally ridiculous. Needless to say, The Batman did not have said pay-off. Its biggest surprise was that it wouldn't end because they constantly had one more scene. In every way I found The Batman to be a lackluster movie that somehow made me nostalgic for the days of Schumacher.",
    "106": "Wonderfly shot. Love the serial killer type approach. Matt Reeves never disappoints with choice of color, tone and over all cinematography.That being said, the story wasnt that interesting to be honest. Nothing was surprising or intriguing and because of that, the result was a poor nonthreatening antagonistAs for character casting, Zoe Kravitz is probably the worst Catwoman. Not one Catwoman characteristic was displayed. Might as well get anyone to play Catwoman. Jeffrey Wright was surprisingly a good Jim Gordan although i have no idea when Batman had a partner lol. John Turturro just looks too goofy to pull off as some crazy mob boss/supporting antagonist. Colin Farrell was amazing 👊The greatest detective/tactician failed to do any real detective work. Solved a few riddles and off we go. Bale still #1All in all great production, good acting (especially from Pattison and Farrell). Would I recommend watching it? Yea i guess. A second time... probably not.",
    "107": "I wanted to love this movie. I would have settled for hating it. Instead, I was bored for three hours.The movie is a sloppy buffet of darkness, rain, gloom, unnecessary narration, wooden acting, absurd dialogue, pointless characters, canyon-wide plot-holes, unresolved story arcs, flaccid motivation for the bad guys, hyper-fast cuts, eye-rolling detective work, conventionally choreographed fight scenes, a cinematic emo aesthetic, a pseudo-Gothic mis en scene, a complete lack of humor or light-hearted moments of any kind, no soul in the acting, unsophisticated writing, timid directing, and a fully-checked list of boxes from the superhero / vigilante cliche playbook.This is a partial list of my complaints. (If pressed, I could probably find a handful of good things to say, but they'd be far too inconsequential to bail this movie out of the depths of Meh.)Having grown up on Adam West's Batman, I've lived through the campiness, the avant-garde, the silly, the surreal, and the downright brilliant (I'm looking at you Dark Knight). There have been Batman movies I've loved and ones I've hated. There are some Batman movies my family and I quote and admire and others we make fun of while we re-watch them to revel in their captivating absurdity. This is the first Batman iteration where I was disappointed, bordering on offended at the completely pedestrian effort and the unimaginative, forgettable final product.If you're under thirteen years old, a sucker for three hours of tedious brooding, and if you don't have a bone-deep familiarity with and love of the genre, you *might* enjoy this. Otherwise, if you're a superhero fan and a true movie lover, please please please steer clear of this one!",
    "108": "I was able to see the movie yesterday. So let me start of saying that the movie is amazing.The tone and the visuals really hit different and it's a different Batman movie than all the previous iterations. Matt Reeves and Peter Craig really are a skilled writer set and the plot, the dialogues and even the humor are sharply written! Kudos to both of them. The score of the movie is amazing! Please do not listen to it before the movie. You need to hear and see the combination of visuals and the movie. It's full on amazing. Michael Giacchino has perfectly crafted a score for ages. In certain scenes I could feel my excitement and my adrenaline pump just because of the score. It's a very long movie, so it really does take its time in developing the story and the characters. I found myself liking the first 2/3s a bit more than the final stretch but overall it was amazingly told from start to finish.The visuals, fight scenes and the camera work is very well crafted too. There's no shaky cam scenes, no fight scene is shot too close. And one particular scene had my jaw dropping.I tried to avoid all the trailers and promo material to not spoiler the movie for me so I kind of went in not knowing and from the opening the movie turned out to be way darker than I expected it to be. But it's a good thing honestly and I am full on with it if it turns out to be a trilogy. And with that said people will try to compare it to TDK which in my opinion isn't fair because TDK was the second Part in a trilogy. This movie here should be compared to Batman Begins. And to answer the question. Yes I think it's better than Batman begins. And if Matt reeves can keep up the good writing and really develop the story even more we might have a better overall trilogy of Batman!And one more thing which I find very important. Since the movie is rated PG-13 i would still advise parents to have a second thought about taking younger children to the movies. It's a very dark movie and very intense. I personally think it's even a bit hard for some teenagers who might react sensitive to the themes and scenes of the movie.",
    "109": "Absolutely abysmal garbage. Everything sucks in this film. The best aspect of the film is the action which is meh, and it's the only aspect which is meh, everything else is plain trash. It's so full of cliches to the point that it's probably the most uninspired Batman film ever made, there is absolutely no originality in this film at all. The blandest versions of the characters I've ever seen, none of them are any interesting. Same plotlines all over again just way worse than usual. Songs are not fitting here at all. All the detective stuff is lame as hell and predictable that I made a few jokes about what it could mean or lead to and they turned out to be true when I wasn't even intending to predict anything. Romance is so surface level and basic, there's no chemistry in it at all. Important characters are so plot-armoured, it's beyond lame and stupid with a bomb exploding just a few centimetres from the face and not even a scratch or a character surviving a huge bomb exploding just 1 metre away from him and he only got scratched a bit. The physics are beyond ridiculous with the car chase having some absurd crap happening you'd normally expect to see in Big Rigs: Over The Road Racing. The film runs for 3 hours and almost nothing remotely interesting ever happens, I only liked 2 scenes that run for 10 seconds - when Batman got out of the car after the car chase and the hallway fight in the dark, and those two 10 second moments are the best this film has to offer. It's beyond boring and so generic. In fact, it was so crappy that I literally laughed out through the entire film, I laughed at how bad a ridiculous most of the stuff was, it's so terrible. But even with all my laughing, it was still so boring that I could barely sit it through. There are no values in this film whatsoever.",
    "110": "Yes, it may be the billionth Batman film in recent memory- but The Batman is easily among the best, if not the best, Batman films ever made. Everything works in this movie, and I mean everything. From the cinematography, to the visuals, set direction, score, acting, direction, writing- it never fails, and it never lets up. There are a few tiny predictable things here and there, but none really take an impact on the quality of the movie, nor the story its telling. It is 3 hours long, but the runtime passes fast, and honestly I never wanted it to end. Robert pattinson is just fantastic in this film, a Batman for the ages, and honestly my favorite film adaptation of the character yet. The rest of the supporting cast is also excellent, Jeffrey Wright bringing a new layer onto the character of Commissioner Gordon, as well as zoe Kravitz with her excellent portrayal of Selena Kyle (aka Catwoman). It's Paul Dano's Riddler that really takes the film by storm however, easily delivering the best villain performance in a superhero film in recent memory, whose zodiac style roots really intensify a new look to the iconic character. Colin Farrell is also excellent as the Penguin in the film, and I hope we get to see more use out of him in the future. Perhaps the most signature thing about this film is the look, a bleak and gritty look into Gotham's underworld, that really does- as director Matt Reeves said- push the limits of a PG-13 film. The look of the film is just outstanding and its hauntingly beautiful solemn poignancy is just wonderful to watch on screen- everything a true Batman fan would ever want. Not to mention the action and fight scenes throughout this film are just brilliant, easily breaking new ground, and capitalizing on its darker tone. In the end, I don't have enough words to say how much I loved The Batman. Again and again one word comes to be to describe it, extraordinary. It may seem familiar, but it's unlike anything you've seen before, and in the days of superhero movies- that's something really freaking rare.My Rating: 10/10.",
    "111": "As director Matt Reeves repeatedly emphasized in several interviews before its release, \"The Batman\" is a detective noir with a dark atmosphere from beginning to end. If you look at scenes reminiscent of David Fincher's Se7en, the appearance of corrupt Gotham City's public power, politicians, and mafias, you also can enjoy this film as a crime drama. Godam City's gloomy appearance, created by director Matt Reeves, is fantastic. Thanks to the ability of Greg Fraser, the cinematographer of \"Rogue One\" and \"Dune,\" the overall visual beauty of \"The Batman\" is next level compared to average superhero movies. The script written by Matt Reeves and Peter Craig is also commendable. As soon as the movie begins, it welcomes the audience with an event that lays out the main plot of the film. Despite the 176-minute running time, which is nearly three hours long, there is no useless scene. It boldly omits Batman's origin and presents a young Batman who has only been active for two years. It feels as if Reeves is responding to criticisms imposed on Zack Snyder's Batman, such as \"He did not make good use of Batman's detective aspect\" and \"Batman is a murderer in this\". Reeves emphasizes Batman's 'Detective' identity as much as possible and shows the philosophy of \"not using a gun\" through dialogue and action.It does not make mistakes that \"Batman v. Superman\" made, such as packing too much storyline in the movie, or being too focused on setting up the sequel.Director Matt Reeves have teased a potential sequel, but at the same time, he argued that the first film should be able to work & stand on its own. Director Reeves' work, The Batman, succeeded in creating an impressive work with the story of Batman's growth, relationships with new characters, and Ridler's murder game. Warner Brothers, who had to go through a lot of critical or commercial failure due to excessive interference in the production of films such as Justice League and Suicide Squad, turned to guarantee the freedom of creators as much as possible. As a result, a work that reveals Matt Reeves' ambitious vision was born.Over the past few years, DC has disappointed a lot of people, and it is also true that it has become difficult to see DC go up to the same position as Marvel and compete with them. However, recently, films such as \"Joker\" and \"The Suicide Squad,\" masterpieces that utilize DC's unique personality and creator's vision have appeared, and \"The Batman\" seems to have no problem standing next to it. I hope that Matt Reeves will be able to complete a trilogy that utilizes his vision safely without following the path of SnyderVerse. Now DC has found its own way, not just copying Marvel. And \"The Batman\" is another step toward that path.",
    "112": "I just saw the movie and I don't even know where to begin...It's not like any cbms like ever, the riddler was great especially the performance of Paul.The funeral and the riddle scenes\nwere AMAZING I really loved those parts. The mystery was done real great and the action sequences were perfect especially the car chase, prison escape and final battle.The film is dark i really loved the tone\nit doesn't rush itself. This movie might have the best Catwoman yet her character was good even if she didn't have a big screentime... Robert is a great Batman I love that we get to see more of his detective side.Beautiful score and cinematography the music was way too loud at times especially at that club scene.",
    "113": "2h56m runtime! Ugh, another movie that thinks it's an epic. News alert: The Batman ain't an epic, it's just too long. Another thing this movie isn't: entertainment fit for an adult mind. How many more batboy movies are there going to be? The comics were written for pre-teen boys, so why has this childish myth held on so long? Nothing new has been added to the story of batboy. And sorry folks, calling it \"The Batman\" adds nothing new.So much of the film is shot in the dark that I'd estimate that about forty percent of the color in the movie is black, meaning you can't see much. I see this so much in films these days and I just don't get it. If you aren't comfortable with images, maybe these directors would be happier working in radio. There are also scenes in which we are looking through windows and can't really see very well. I don't get it. It's like they used a camera from about 1910.The violence is completely ridiculous starting from the first scene in the subway. There is no explanation for the group of thugs ganging up on the guy leaving the train. Batboy shows up and beats them senseless, although I'm not completely sure because it was too dark to see much.You can't even see what his car looks like despite the fact that there is a five-minute car chase scene in which a fat guy in a normal car evades batboy for most of it. One of the worst car chase scenes in movie history even though it probably cost more to film than the entire budgets of most movies made last year.",
    "114": "This is essentially a film noir, Batman meets Sin City, mash up.Its experimental and in its own way, quite daring. For that and the fact it mostly works, I give it kudos. I'm equally impressed, by the suitably downbeat performances, from Robert Pattinson and Zoë Kravitz.The actors understand the kind of film they are in and adjust their performances, accordingly. That's not as easy as it sounds, given the glitzy, action packed handling, of previous \"Batman\" outings and the expectation, it creates.I'm afraid however, there is a \"but\" coming. This film basks a little too long, in its dark, fantasy world. Its a beautifully shot world, the cinematic's moodily excellent. That said, it could have been 30 minutes or so shorter and worked just as well.I think too, its clever in so much as they re-create old characters like the Penguin and Riddler, making them more human and relatable. That said, I would have used new characters, with a fresh perspective. This is after all, a departure from what Batman has been in the past, for the most part.Lastly, a there's little dash of throw away, anti \"white\" rhetoric, I could have done without.In summary, a mixed bag. Experimental in a positive way but lingers a little too long. Inexplicably, still sticks to the Batman character universe script, even when departing from it.6/10.",
    "115": "Greetings again from the darkness. Riddle me this: does \"The Bat, The Cat, and The Rat\" sound more like an opening line to a joke or the title of a Dr. Seuss book? In fact, those are three core elements of this new, COVID-delayed, and highly anticipated film from writer-director Matt Reeves and co-writer Peter Craig. I'll confess to being a huge fan of Christopher Nolan's 'Dark Knight' trilogy (that concluded 10 years ago), and being a bit skeptical to a new version featuring Robert Pattinson in the titular role (I'm choosing to totally ignore the in-between portrayals in the \"Justice League\" movies). Knowing full well how important it is for fans to watch these films with fresh eyes and a clear head, this review is purposefully vague on what will surely prove to be some of the more popular and contentious discussion points.Let's start with a general description and the setup. The film is dark and gloomy and gritty and grimy. Gotham is a cesspool of corruption and crime, and we get no glimpse into the other side, assuming there is one. Billionaire Bruce Wayne (Robert Pattinson) is still in his second year as the Batman, often referred to as \"Vengeance\". There is substantial backstory for Mr. Wayne, who lives in relative seclusion with his trusty manservant Alfred Pennyworth (Andy Serkis), while the Batman prowls at night in his efforts to clean up the city. Of course he is unable to keep pace with crime and corruption, even with the close alliance he has built with good cop, Police Lt. James Gordon (Jeffrey Wright). It takes Batman's Poirot-like detective skills to solve a riddle left as a clue in a particularly high-profile murder case. Soon it's obvious a serial killer is at work and he has purposefully drawn the Batman into his game.The caped crusader proceeds to cross paths with Selena Kyle/Catwoman (a terrific Zoe Kravitz), Oswald Cobblepot/Penguin (an unrecognizable Colin Farrell), District Attorney Gil Golson (Peter Sarsgaard), and crime lord Carmine Falcone (John Turturro). As city VIPs begin showing up dead, it's a masked Edward Nashton/Riddler (Paul Dano) who always seems a step ahead. All of the above receive their chance to shine on screen, and while none let us down, it's not until the mask is ripped from Riddler, and Dano really shines, that we are left wanting more. It should be noted that Farrell (with his facial prosthetics and fat suit) is kind of a second fiddle here, but it's surely intentional and meant to set the stage for more Penguin antics down the road.Pattinson will certainly receive the most scrutiny. I found him to be an excellent Batman, with black eye makeup smeared by sweat under his cowl, maintaining the grungy tone. His whispery voice differs from Christian Bale's gravely growl, but works for the character's withdrawn nature and preference for detective work over than fighting. Staying true to the premise that this is only his second year, there is a significant shortage of \"wonderful toys\", and the batmobile is less rocket ship and more souped-up coupe. The contrast to these is a batsuit that seems quite advanced (and looks cool). It's Pattinson's Bruce Wayne that didn't work for me. I respect the reclusive billionaire aspect, but he mostly looks like someone on their way to a Nirvana gig, leaving us wondering how the heck could anyone not connect the dots between a creepy rich guy and a nearly identical creepy guy in a bat suit. It's a minor complaint, but one that stuck with me.Oscar-winning composer Michael Giacchino (UP, 2009) takes a more classical approach than the dramatics of predecessors Hans Zimmer and Danny Elfman. Giacchino has been a frequent Pixar contributor, and scored some well-known blockbusters in franchises like 'Jurassic World', 'Star Trek', 'Planet of the Apes', 'Mission Impossible', 'Spider-man', and 'Star Wars'. His work fits nicely here. Adapting characters and stories originated by Bob Kane and Bill Finger, Matt Reeves and Peter Craig have found a way to put their own stamp on the work. Mr. Craig is Oscar winner Sally Field's son, and his previous scripts include THE TOWN (2010), parts 1 and 2 of THE HUNGER GAMES: MOCKINGJAY, and upcoming high-profile projects in TOP GUN: MAVERICK and GLADIATOR 2. Director Reeves has previously helmed the excellent horror film LET ME IN (2010), as well as DAWN OF THE PLANET OF THE APES (2014) and WAR FOR THE PLANET OF THE APES (2017).This marks the first in a planned Batman trilogy, and a couple of the last scenes seemingly set the stage for what's to come. Although this is an odd movie, here's hoping the franchise maintains this tone and avoids the typical Marvel/DC overblown CGI approach. After all, the Batman is but one man, not a God of superpowers. This film is an unusual blend of noir-horror-detective-action-psychological thriller wrapped in a gray box with a black bow, and though it will likely be divisive among fans (isn't everything?), this 3-hour epic leaves us anticipating the next 'bat time' and 'bat channel'.Opens wide in theaters on March 4, 2022.",
    "116": "A quality director is irreplaceable. Period. I missed Chris Nolan through every minute of this sheer torture that I endured in the Cinema hall. How do you break out from under the shadow of Dark Knight trilogy? How do you distinguish Yourself? YOU DON'T! This was a travesty! Did I by mistake enter a theatre screening a BAD THIRD CLASS copy of se7en? Batman picking blood samples like sherlock holmes and doing detective work in cahoots with Gotham PD? It was a shocker. Then lets talk about miscasting. Robert Pattinson is NOT Bruce Wayne. He never will be! A Man Child with unkempt hair is not Bruce Wayne! You dont distinguish Your film from previous editions by forbidding Your actors to look presentable! The angst of Bruce Wayne is NOT REFLECTED by his unkempt hair and appearance! It comes from WITHIN! Every ounce of Bruce Wayne reflects that dark side, underneath those designer suits and slick hair. Christian Bale did it to perfection, Ben Affleck did it very well. What we saw in this movie was an untidy man child. No efforts were made to even spend 5 minutes on what led this man child to this pitiable state. Nirvana songs in the background cant rescue a pathetic mash up of se7en and other detective films. The villains were clownish. The story was haywire. My favourite super hero, who is not a super hero, was ruined, destroyed by this sherlock holmes outing. I hope that DC will end this travesty here. Next time I would like to meet Bruce Wayne and Batman. Not a dirty man child, in need of a prison bath.",
    "117": "\"The Batman\" is a reboot of the titular DC superhero film franchise directed and co-written by Matt Reeves (\"Cloverfield\", \"Dawn of the Planet of the Apes\", \"War for the Planet of the Apes\"). Starring Robert Pattinson in the lead role as well as Zoe Kravitz, Paul Dano, and Colin Farrell, it is the best Batman film to grace our screens that doesn't feature any involvement from Christopher Nolan.Two years after adopting the vigilante alter ego of \"Batman\", the young reclusive billionaire Bruce Wayne (Robert Pattinson) is summoned by police lieutenant James Gordon (Jeffrey Wright) to help investigate the murder of Gotham City's mayor on Halloween night. Upon closer inspection, they soon learn that this killer referring to himself as \"The Riddler\" (Paul Dano) intends to kill more important political figures, leaving behind cryptic messages for Batman in the process. After deciphering some of the messages, Bruce discovers that the Riddler's motivation for these murders runs deeper than he had thought, to the point where it involves not only Gotham City's hidden crime syndicate, but also his own family's legacy.Do I really need to give a detailed introduction to someone like Batman? He's one of the most iconic superheroes of all time and everybody and their dog knows who he is. There have been many films made over the years that feature the Caped Crusader's escapades against criminals, from Tim Burton's Michael Keaton-led movies that took the character more seriously to Christopher Nolan's Christian Bale-led The Dark Knight Trilogy that are often ranked among the greatest superhero films ever made. Now with Matt Reeves' vision being brought to life in \"The Batman\", we have yet another fantastic depiction of this popular hero in an engaging film that embraces his detective roots.Many people seem to forget that in addition to fighting crime with his fists and high-tech gadgets, Batman is also an accomplished detective. His strategy of using stealth to sneak around for clues as well as his superior powers of deduction are rivalled only by the likes of Sherlock Holmes. Unfortunately, this quirk hasn't really been touched upon in past movies, instead focusing on the action-based aspects of the character, likely because most casual audiences would find these moments more fun to watch. That is, of course, until now.I loved how this film makes Batman's detective work the focal point of the story. He is more pragmatic in how he tries to unravel the mystery of the Riddler's crimes, only using brute force when absolutely necessary. With that in mind, the film has clearly taken influence from the detective noir movies of many decades ago, like \"Chinatown\" and \"The French Connection\". Like those two examples, this one doesn't focus much on action but rather the main character's intellect to solve such an enigmatic puzzle. Personally, I enjoyed seeing this otherwise glanced-over character trait of Batman but I can understand why some audiences might not think the same way. As previously mentioned, there isn't as much action here as in other Batman films so I imagine there may be complaints from those who want more scenes of hand-to-hand combat.Another similarity this film has to classic noir fiction is its wonderful cinematography. There are many memorable shots that show Batman silhouetted among the skyline of Gotham City, often complimented by a beautiful colour palette to help him stand out. Noir does literally mean \"Black\" in French after all so this certainly fits a character like Batman to a tee. There's one scene that takes place almost entirely in the dark and the only form of light illuminating the characters is the gunfire. What would normally be difficult to see, given the circumstances, is made much more comprehensible thanks to Matt Reeves' slick direction. Reeves makes it clear that Gotham is rife with corruption and crime, emphasising this by showing how nobody is without sin. Though Bruce is a morally upstanding citizen, he too has skeletons in his closet regarding his family history. Likewise, even certain members of the police department are shown to have some ties to the criminal underworld.With all of these story elements coming together, it should be no surprise that there is a lot of ground to be covered. Because of this, the film ends up clocking in at just under three hours in length (176 minutes to be precise). Again, because of Matt Reeves' solid directing, by some miracle, he manages to make it all work so harmoniously within the given timeframe. The severity of the Riddler's murders taking place all over Gotham City actually aids in giving the film sufficient world building. We see a nightclub run by the local mafia, politicians lying about repairing what urgently needs to be fixed, and the media manipulating facts as a means to bring in ratings. As a result, Gotham feels like an actual location inhabited by real people, not simply because it has used obvious New York City landmarks as its basis (e.g. The Gotham State Building instead of the Empire State Building), but because they all echo true to the real world which can be just as much of a hellish place as something conceived in fiction, perhaps even more so.In addition to this, the Batman movies are also known for their unforgettable soundtracks. Tim Burton's films were complimented by Danny Elfman's energetic musical score while Christopher Nolan's The Dark Knight Trilogy benefited strongly from Hans Zimmer's grandiose use of horns and drums. It seems we can now add Michael Giacchino's dark, brooding music to the list of memorable Batman scores that many will remember years from now. The main theme definitely suits the film's despondent tone, complete with downbeat piano notes, giving it a haunting feeling that all is lost. I also liked how the film used Nirvana's \"Something In The Way\" to convey what is going through Bruce Wayne's mind. Its lyrics are a metaphor for being isolated from the rest of society, which is of course highly appropriate when considering Bruce's reclusive nature.There's no other working actor right now who could have played this particular incarnation of the Dark Knight better than Robert Pattinson (or \"Battinson\" if you will). Hopefully he can finally shed the shackles of that stigma he had being associated with the Twilight series since he now has this role to be proud of instead. Pattinson depicts Bruce Wayne as a deeply insecure man who is still reeling from the trauma of losing both his parents, and this is reflected in some of his inexperience when donning the superhero uniform. Usually whenever we see the Batman/Bruce Wayne dynamic, we are only ever shown Bruce's morose personality juxtaposed with Batman's one-track minded determination. Here, the lines are blurred as at times we can see some of Bruce's personal feelings getting in the way of his decision making as Batman. This presents an interesting point of vulnerability in the character that we don't tend to see, which makes him easier for the audience to identify with.Zoe Kravitz is also great as Selena Kyle/Catwoman. I've always enjoyed watching Catwoman's interactions with Batman throughout various forms of media and the ones in this film rank up there among the very best. The two have such believable chemistry since she is neither truly evil nor good, essentially making her an ideal grey area character. Despite being of different social classes, Kyle's downtrodden worldview resonates strongly with Bruce's equally pessimistic vision for the future of Gotham City. Naturally this leads to some great \"will they or won't they\" scenes that help bring a spark of hope that things could turn out for the better if they both worked together, but other matters always seem to prevent them from moving forward.As the film's main antagonist, Paul Dano puts his own intriguing spin on The Riddler. Instead of a man dressed in green wearing a hat with a question mark, Dano's Riddler is draped in a large poncho-like outfit and a mask that obscures his entire face. He is an intimidating figure who always seems to be at least five steps ahead of Batman and the police department. The riddles he leaves behind at the crime scenes are akin to that of the real-life Zodiac Killer, with complex patterns and codes that are hard to decipher at first glance. It was a clever idea to make allusions to that infamous murderer, especially since the mystery of who the Zodiac Killer really was remains unsolved to this day.Also playing an important role in the film is Colin Farrell as Oswald Cobblepot/The Penguin. Like Batman himself, this version of The Penguin is still relatively inexperienced when compared to most other depictions in movies and TV shows. Farrell is completely unrecognisable in his makeup, so much so that I kept on forgetting it was him playing the character. I cannot discuss his significance in the story too much since that would give away important spoilers so all I will say is that he leaves just as much of an impression as the Riddler.Considering the high quality of its three predecessors, \"The Batman\" definitely had a lot to live up to in the wake they have left behind. What helped it achieve this with flying colours was the atypical direction it took things in. By primarily harkening back to its detective-focused origins, we have something that works both as a superhero film and a neo-noir film all rolled into one. On top of that, we also have a unique portrayal of the main character by Robert Pattinson to solidify the film's legacy as one of the best in the entire franchise. According to Matt Reeves, there are sequels confirmed to be on the way so if he is able to recapture lightning in a bottle, then exciting times lie ahead.I rate it a solid 9/10.",
    "118": "5 out of 5 stars.The Batman is an electrifying dark superhero film and dives into an psychological crime story. Director Matt Reeves takes this film into a whole new dark direction. So dark that every scene seems faded or taking place in a night raining setting. The script and narration in the beginning sets the tone of the film. With Bruce Wayne giving a narrative about how he brings fear that every criminal stays away from the shadows. The film is one awesome superhero film. Watching it the first time may not be enough with so much to digest on what is going on with the depth layer of the story. For a 3 hour run time, the film packs so much that it never once felt long.The script and direction is great. Dark atmospheric setting. Showing Gotham a city that is on a ticking time bomb with crime happening. Nirvana's song playing a couple of times setting that mood of the film. Which is dark and setting that depressing mood. But it works great. The action sequences are great. The fight scenes are well choregraphed. The villains Riddler played by Paul Dano is great. Riddler played more like a zodiac killer. The direction plays like a crime solving film with Batman being detective and on the trail of the riddler. Leading Batman investigating criminal syndicates like Falcone (John Turturro) and Penguin (Colin Farrell). And catwoman (Zoe Kravitz) assisting him with the investigation. The film gritty and grounded with its action sequences. The car chase was awesome with the cinematography being close to the action as possible.Robert Pattinson is great as a dark version of Bruce Wayne. And great as Batman. Paul Dano is good. John Turturro, Colin Farrell, Zoe Kravitz, Andy Serkis, and Jeffrey Wright were all great with there roles.The cinematography and music score were great. The film does have one brief scene that hints towards another film. The film has a deep depth story that packs a lot and ties a lot together. It is one awesome film that will leave a lot talking about.",
    "119": "The Good\nKravitz did a fine job as did all the other actors.The cinematography was well done, as expected from a big budget.They did shoot a lot of film to try to create an epic.Cool silhouette of the batmobileThe Bad\nGoes woke in the middle with Catwoman cursing the \"White privileged a$$holes\".Virtually no back story to make you give a damn about anyone.Actually wanted Riddler to win and his plan was obvious.Was actually boring in many parts.The Ugly\nThe story line. Convluted, messy, mostly useless.Deus ex machinas all over the place\nThe ending was plain out stupid. Somehow that will all be wiped clean in the sequel as if it never happened.Pattinson didn't even have to appear. Bruce Wayne almost never did.This is what you get when you forget you're filming Batman and not Twilight.No fun whatsoever. Droll, downer of a movie for three long hours.Another film which will have an artificially inflated IMDB rating. Worst opener of all the Batman franchises.",
    "120": "Pattinson is no batman, he will never be Batman. During the whole movie, you can feel that even Pattinson himself felt deep down inside he is no batman character. You could see and feel it.Zoe Kravitz' performance as catwoman is on the level of an elementary school play. She was the worst catwoman I have ever seen.There was ZERO chemistry between both actors and the forced romance felt fake and shallow.The pacing is way too slow to keep you engaged. The plot is so boring, you could easily watch another video on your phone to keep yourself entertained.They tried to stretch this dumptser fire out to a 3 hour artsy fartsy emo movie at which they epicly failed. Easily the worst Batman movie.",
    "121": "A lot of hype, but the end result disappointed me.It's not a bad movie. For me, it's mediocre.With that big a budget; the music is not good enough, the story is all over the place and the running time too long.Andy Serkis is a good actor, but a terrible cast for Alfred.The way Batman was presented in this movie, I came to think, why isn't he just a cop after all?The cinematography and sound design are 2 things that stood out for me.Was I entertained?I slept, I looked at my phone and my watch more than 10 times, impatiently waiting for it to end. No.Would I recommend it? If it were a 6-part miniseries on Netflix, definitely.For a cinema experience, no.",
    "122": "There's so much wrong with this movie. The first major problem is that it doesn't understand Batman. Batman Forever understood Batman better than this crap. Robert Pattinson plays Bruce Wayne as if he were an emo who spends his days locked in his dark room listening to Nirvana and My Chemical Romance. He doesn't even act like a human. He's like an edgelord teenager. I defended the casting choice leading up to the release of the film, but after seeing it I need to go back and delete every comment defending the casting of Pattinson.Second problem is Catwoman. Not the performance, but the character herself. She adds nothing to the film and the \"romance\" between her and Batman was so forced as there was never any chemistry between the two \"heroes.\" The scenes with her are absolutely the most uninteresting and I think it would have benefitted greatly if she was removed so the movie was shorter and more focused on Batman being the detective and going against Penguin and Riddler. The pacing is already super slow but every scene with Catwoman feels like they stretched one page of screenplay into five minutes of film.Riddler is okay. I like Paul Dano. He doesn't get a lot to do. Penguin actually ended up being more interesting and he was given even less to do.Jim Gordon in this movie is terrible. Easily the worst character. All he does in this movie is read clues out loud and go \"What does this mean???\" And then Batman figures everything out. It's so boring.This is probably a 3/10 movie, but the fact that it's getting such good reviews infuriates me. I hate knowing that this is the future of Batman and Ben Affleck won't be getting his solo movie now after being replaced by an emo loser version of Bruce Wayne. I'm not saying Batman v Superman was great or anything but my God it was better than this by miles. At least it was made by people who are clearly fans of the characters. Everyone in this movie other than Colin Farrell and Paul Dano seem like they're miserable to be in the movie.This movie is boring and pretentious but has somehow convinced people it's a masterpiece. It's not. It's like the Batman version of Blade Runner 2049 but without the skill behind the camera that Denis Villeneuve brings to his movies. He understands how to make slow movies feel epic and inspiring. Matt Reeves does not.",
    "123": "Is anyone surprised this was coming? For years, the comic book nerds have groused about a) why Bruce Wayne isn't so troubled by the death of his parents b) he doesn't do any detective workSo we get Emo Batman. Sunk deep into bleak variations on grunge pop Nirvana's \"Something In The Way\" it draws a doom and gloom march towards the unveiling of a serial killer in Gotham City. There are also nods to \"Seven\" & \"The Crow\" two films that have constant rain and a dark presence hovering over its dirty city.Some of the details of the Wayne's history is baffling. Perhaps I've not read the comics those are based on. Particularly his Father past nor his Mother's, which implies a Kennedy connection there, in terms of wealthy people burying their shame. Regardless of the attempt to clean up some of the darkness that haunts the Wayne family, none of their justification by way of Alfred (Andy Serkis) doesn't absolve guilt in any way. Which leaves you feeling off-put by our perception of what certain people meant to the city. In some ways, the movie actually asks you to forgive.For the most part, Robert Pattinson does very well when he dons the cowl. Once out, he seems to be a reject from The Cure. Much like Brandon Lee. His dead eyes match his dead soul. And director Matt Reeves is decisive when it comes to not showing the joys of wealth. A point which is made when we find out why the Riddler exists.Paul Dano does well as the Riddler. Though doesn't stray too far from Heath Ledger's Joker. Which is a shame. At a certain point, they could be interchangeable. A flaw I've always seen with both characters. And Colin Ferrell's Penguin bellows wildly like Robert DeNiro's Al Capone in \"The Untouchables (1987). A very easy connection. Even looks like him.I felt Zoe Kravitz as Catwoman was a massive misstep. She seems to be cut-and-paste here. Something is missing in her performance that separates all the other ones. A sexuality that oozes through the screen. Like every story prior to this has her story changed but she still is alluring. Kravitz does not have that quality. Many moments of sexual innuendos to be mined, but fall flat due to Hollywood's lack of courage to just make a fun movie that have Batman and Catwoman flirt. This doesn't want that. So what is their attraction? One wonders.All in all, children will not get this Batman police procedural. It's coming at an angle where it may be a long t.v.series, but doesn't have the sense of comic book quality the predecessors had to make it a cinematic adventure.I do like they went with something different. And perhaps this is what is lacking for me. For others, it may be a refreshing change of pace from the wildly comical Batmans. I just think this bleakness gives one very little interest in future installments by the same team.",
    "124": "1.5 hour filmed stretched painfully over what felt like 5.The bat mobile looks like something the A_team knocked up on a Sunday afternoon trapped in a scrap yard.I rekon I could have filled in this skinny batman.Whole movie shot in dim lighting.Soooooo boring.Over the top horror film music in scenes that lead to nothingStoryline straight as a die, no surprises and on and on and on it went.I can only assume this review section is full of bots.The car chase scene was absolutely diabolical.The budget for this movie was low, nothing happens that wasn't shot on a normal camera, no CGI no FX.When the lights went up in the cinema I could feel the pain and dispair in the air, an absolute snooze fest.",
    "125": "A way too long and pretentious addition to the series. In fact, I couldn't even finish watching it.It's not all bad though, Reeves nails the look and feel of Gotham City. It's dark, dreary and dangerous. Most of the cast are fine too. Paul Dano and Jeffery Wright do their thing as The Riddler and Godon. Zoe is sexy as Catwoman. Colin Farrell was an odd choice but not bad. The main issue is Pattinson. As The Batman he's actually not bad, it's his version of Bruce Wayne that is unbearable. He's mopey and inaudible most of the time and his attempts at seeming pensive fall flat.It's one of those movies that you sense is really pleased with itself and in doing so wastes too much of the viewers time with unnecessary pauses and shots so you can bask in it's idea of cleverness and art.Certainly not the worst addition to the series and I would give the next one another shot if it's as atmospheric as this. Hopefully Bruce will have stopped sulking by then.",
    "126": "I was really enthusiastic about Reeve's interviews, it finally seemed like his version would be more accurate to the comics, which I think it's been failing long enough with Batman movies.The dark detective noir story is there, in fact, and there's some great atmosphere with the first 15 minutes of the movie totally exciting me about how this was going.The settings and cinematography of the movie are really great, I absolutely loved that aspect of this movie, and the design of Batman suit doesn't look that bad in the dark even though it's definitely not my favourite live action version.Now, I really wanted to like Pattison's version of the character, I like a lot of his work, but this is an absolute miss. I thought so from the very first news of his casting, but I kept hopeful for a surprise that didn't come.As batman, he's definitely not imponent, his un-athletic frame and skinny legs wouldn't impose fear to a little girl, it really annoys me that he didn't put any effort on the physical side of his character (which is SO important for this role!), you can tell he didn't do any serious exercise when you see his torso and arms naked. I'm sure he got paid enough to have done better than that, it's almost disrespectful. And before you think \"oh, but this is Batman starting, he gets bigger later\": WRONG! He trains for years in Asia before he gets back and he's fully prepared physically, what he gains through being Batman in Gotham is experience, knowledge and new gadgets.In terms of performance, his Bruce Wayne is pretty much an emo, which is all the opposite to what the character does in the comic books to get as far away from suspicion as possible. Another miss. He never shows his sadness and tortured personality as Bruce Wayne.Not the looks, not the performance.The fights were somehow cool, mostly thanks to the cinematography, but after the first fight when Bats uses one of his \"weapons\", he totally forgets about his belt and doesn't do anything else than punching and kicking, and I don't find that satisfying enough, Batman's gadgets is one of the things that give him advantage over any other fighter or a bunch of fighters. It's a disappointment to see how the director thought about Batman's technology for his detective work but almost nothing on his fighting.In terms of villains, there were moments where Riddler was creepy enough to give chills, but it fell flat in the end. Penguin didn't strike in any particular way, even though Farrell is a great actor, the character felt washed down and wasted for me, lacking a lot of his classic characteristics.Catwoman looks good but also, didn't felt much like the comic book, could definitely have done more in such a long run of a film.I feel these realistic takes of Batman are killing the character in movies, I don't know why directors and writers fill their mouths saying they're fans and they want to be faithful to the comics and they make Batmans that can't do anything of what the character normally does.I whish someone would chill out a bit and make it a bit more fantastic within the character's characteristics.This one in particular is even more realistic than Nolan's, and for me, that's a very bad thing, I had enough of normal guys walking around in a useless armour throwing punches standing like robots.I can only hope this director is saving the gargets and abilities aspect for future movies, to show improvement and evolution on the character, but I think it could have been done in THIS movie, being over two and half hours there was more than enough time to show it!As a movie is not bad, but neither great. The pace is too slow, it really drags by times, with long, redundant conversations, repetitive scenes and the characters not too well adapted, specially Pattison's Batman.Another disappointment for me, because I keep waiting for a proper adaptation of the Batman from the comic books, as there's never been one.I whish Affleck would have done his take, with Deathstroke, his cool Batsuit, more action, more fun. His version was BY FAR the best, no way anyone can say his assault to rescue Martha wasn't the BEST Batman scene ever filmed so far.I'll keep waiting..",
    "127": "When movie started I thought it'll be interesting with new plot line and new villains', but director and writing department both lack vision. They wrote whole movie without batman actual goal or vision, and Robert Pattinson literally have only 20 lines. Whole movie he's just walking or riding bike, like seriously where's the story.There are no good action sequence as well,except last 5mins of the movie. Also, in one scene bomb exploded right in front of Batman and he didn't have single scratch, are you serious?Zoe(Catwoman) who made her actress and most importantly who selected her mask for catwoman, her mask looks like my grandfather monkey cap. Her acting is so bad, when she has dialogues, it seems like she's half asleep and couldn't deliver it.The whole movie was the question, what's the purpose of the movie and why so poor writing.",
    "128": "The Batman feels like the definitive take on the titular caped crusader. A sprawling, dark and epic story that finally puts Batman's detective skills front and centre whilst having ample commentary on today's society.Robert Pattinson gives a perfect lead performance as Bruce Wayne/Batman that's different to what's come before. A Bruce Wayne who only lives to be Batman and carries a visible pain and trauma in every scene. He also manages to do so much with so little, able to convey a lot with just a simple look or turn.Zoë Kravitz is an excellent Catwoman with her own pain and history and has all the necessary charisma and style. Paul Dano is an absolutely terrifying Riddler, having plenty of unsettling and loud outbursts of rage skillfully counterbalanced with quiet whispers.Also notable performances include an unrecognisable Colin Farrell, Jeffrey Wright, who is a superb Gordon and surprisingly active. Andy Serkis' Alfred, who manages to do a lot with a little and John Turturro who is icily cold and satisfyingly restrained as Carmine Falcone.Matt Reeves' direction is incredible, Gotham is at its most fully realized with a nice balance of realism and comic book extravagance. Action sequences are all extremely unique and are therefore able to standout with the car chase in particular being an unforgettable set piece.The pacing is also perfect, able to make it's three hour runtime fly by due to something always happening without feeling rushed. The music by Michael Giacchino is instantly iconic. Like the rest of the film it's able to find it's own voice and style that's different to what's come before.",
    "129": "As someone who has read pretty much all the Batman comics it is very apparent that Matt Reeves has not.He's basically just decided that Batman is going to be a bit emo and completely ignored the fact that you need a decent story line to make a great Batman film. You definitely get the sense that Matt wanted Bruce to be more like Kurt Cobain that the Bruce from the comics.You could easily cut out 90 minutes from this movie.Robert was miscast.Zoe was miscast.Colin was a very good penguin (pretty much the only highlight of the movie).The Riddler character seemed more like a whiney teenager that an actual villain.Alfred was basically a throwaway character.The film is predictable from start to finish, can't believe anyway is saying this movie has twists are turns. It's glaringly obvious what's going to happen.Hope they don't make this into a trilogy as it doesn't deserve to be one.",
    "130": "\"The Batman\" is a reboot of the titular DC superhero film franchise directed and co-written by Matt Reeves (\"Cloverfield\", \"Dawn of the Planet of the Apes\", \"War for the Planet of the Apes\"). Starring Robert Pattinson in the lead role as well as Zoe Kravitz, Paul Dano, and Colin Farrell, it is the best Batman film to grace our screens that doesn't feature any involvement from Christopher Nolan.Two years after adopting the vigilante alter ego of \"Batman\", the young reclusive billionaire Bruce Wayne (Robert Pattinson) is summoned by police lieutenant James Gordon (Jeffrey Wright) to help investigate the murder of Gotham City's mayor on Halloween night. Upon closer inspection, they soon learn that this killer referring to himself as \"The Riddler\" (Paul Dano) intends to kill more important political figures, leaving behind cryptic messages for Batman in the process. After deciphering some of the messages, Bruce discovers that the Riddler's motivation for these murders runs deeper than he had thought, to the point where it involves not only Gotham City's hidden crime syndicate, but also his own family's legacy.Do I really need to give a detailed introduction to someone like Batman? He's one of the most iconic superheroes of all time and everybody and their dog knows who he is. There have been many films made over the years that feature the Caped Crusader's escapades against criminals, from Tim Burton's Michael Keaton-led movies that took the character more seriously to Christopher Nolan's Christian Bale-led The Dark Knight Trilogy that are often ranked among the greatest superhero films ever made. Now with Matt Reeves' vision being brought to life in \"The Batman\", we have yet another fantastic depiction of this popular hero in an engaging film that embraces his detective roots.Many people seem to forget that in addition to fighting crime with his fists and high-tech gadgets, Batman is also an accomplished detective. His strategy of using stealth to sneak around for clues as well as his superior powers of deduction are rivalled only by the likes of Sherlock Holmes. Unfortunately, this quirk hasn't really been touched upon in past movies, instead focusing on the action-based aspects of the character, likely because most casual audiences would find these moments more fun to watch. That is, of course, until now.I loved how this film makes Batman's detective work the focal point of the story. He is more pragmatic in how he tries to unravel the mystery of the Riddler's crimes, only using brute force when absolutely necessary. With that in mind, the film has clearly taken influence from the detective noir movies of many decades ago, like \"Chinatown\" and \"The French Connection\". Like those two examples, this one doesn't focus much on action but rather the main character's intellect to solve such an enigmatic puzzle. Personally, I enjoyed seeing this otherwise glanced-over character trait of Batman but I can understand why some audiences might not think the same way. As previously mentioned, there isn't as much action here as in other Batman films so I imagine there may be complaints from those who want more scenes of hand-to-hand combat.Another similarity this film has to classic noir fiction is its wonderful cinematography. There are many memorable shots that show Batman silhouetted among the skyline of Gotham City, often complimented by a beautiful colour palette to help him stand out. Noir does literally mean \"Black\" in French after all so this certainly fits a character like Batman to a tee. There's one scene that takes place almost entirely in the dark and the only form of light illuminating the characters is the gunfire. What would normally be difficult to see, given the circumstances, is made much more comprehensible thanks to Matt Reeves' slick direction. Reeves makes it clear that Gotham is rife with corruption and crime, emphasising this by showing how nobody is without sin. Though Bruce is a morally upstanding citizen, he too has skeletons in his closet regarding his family history. Likewise, even certain members of the police department are shown to have some ties to the criminal underworld.With all of these story elements coming together, it should be no surprise that there is a lot of ground to be covered. Because of this, the film ends up clocking in at just under three hours in length (176 minutes to be precise). Again, because of Matt Reeves' solid directing, by some miracle, he manages to make it all work so harmoniously within the given timeframe. The severity of the Riddler's murders taking place all over Gotham City actually aids in giving the film sufficient world building. We see a nightclub run by the local mafia, politicians lying about repairing what urgently needs to be fixed, and the media manipulating facts as a means to bring in ratings. As a result, Gotham feels like an actual location inhabited by real people, not simply because it has used obvious New York City landmarks as its basis (e.g. The Gotham State Building instead of the Empire State Building), but because they all echo true to the real world which can be just as much of a hellish place as something conceived in fiction, perhaps even more so.In addition to this, the Batman movies are also known for their unforgettable soundtracks. Tim Burton's films were complimented by Danny Elfman's energetic musical score while Christopher Nolan's The Dark Knight Trilogy benefited strongly from Hans Zimmer's grandiose use of horns and drums. It seems we can now add Michael Giacchino's dark, brooding music to the list of memorable Batman scores that many will remember years from now. The main theme definitely suits the film's despondent tone, complete with downbeat piano notes, giving it a haunting feeling that all is lost. I also liked how the film used Nirvana's \"Something In The Way\" to convey what is going through Bruce Wayne's mind. Its lyrics are a metaphor for being isolated from the rest of society, which is of course highly appropriate when considering Bruce's reclusive nature.There's no other working actor right now who could have played this particular incarnation of the Dark Knight better than Robert Pattinson (or \"Battinson\" if you will). Hopefully he can finally shed the shackles of that stigma he had being associated with the Twilight series since he now has this role to be proud of instead. Pattinson depicts Bruce Wayne as a deeply insecure man who is still reeling from the trauma of losing both his parents, and this is reflected in some of his inexperience when donning the superhero uniform. Usually whenever we see the Batman/Bruce Wayne dynamic, we are only ever shown Bruce's morose personality juxtaposed with Batman's one-track minded determination. Here, the lines are blurred as at times we can see some of Bruce's personal feelings getting in the way of his decision making as Batman. This presents an interesting point of vulnerability in the character that we don't tend to see, which makes him easier for the audience to identify with.Zoe Kravitz is also great as Selena Kyle/Catwoman. I've always enjoyed watching Catwoman's interactions with Batman throughout various forms of media and the ones in this film rank up there among the very best. The two have such believable chemistry since she is neither truly evil nor good, essentially making her an ideal grey area character. Despite being of different social classes, Kyle's downtrodden worldview resonates strongly with Bruce's equally pessimistic vision for the future of Gotham City. Naturally this leads to some great \"will they or won't they\" scenes that help bring a spark of hope that things could turn out for the better if they both worked together, but other matters always seem to prevent them from moving forward.As the film's main antagonist, Paul Dano puts his own intriguing spin on The Riddler. Instead of a man dressed in green wearing a hat with a question mark, Dano's Riddler is draped in a large poncho-like outfit and a mask that obscures his entire face. He is an intimidating figure who always seems to be at least five steps ahead of Batman and the police department. The riddles he leaves behind at the crime scenes are akin to that of the real-life Zodiac Killer, with complex patterns and codes that are hard to decipher at first glance. It was a clever idea to make allusions to that infamous murderer, especially since the mystery of who the Zodiac Killer really was remains unsolved to this day.Also playing an important role in the film is Colin Farrell as Oswald Cobblepot/The Penguin. Like Batman himself, this version of The Penguin is still relatively inexperienced when compared to most other depictions in movies and TV shows. Farrell is completely unrecognisable in his makeup, so much so that I kept on forgetting it was him playing the character. I cannot discuss his significance in the story too much since that would give away important spoilers so all I will say is that he leaves just as much of an impression as the Riddler.Considering the high quality of its three predecessors, \"The Batman\" definitely had a lot to live up to in the wake they have left behind. What helped it achieve this with flying colours was the atypical direction it took things in. By primarily harkening back to its detective-focused origins, we have something that works both as a superhero film and a neo-noir film all rolled into one. On top of that, we also have a unique portrayal of the main character by Robert Pattinson to solidify the film's legacy as one of the best in the entire franchise. According to Matt Reeves, there are sequels confirmed to be on the way so if he is able to recapture lightning in a bottle, then exciting times lie ahead.I rate it a solid 9/10.",
    "131": "5 out of 5 stars.The Batman is an electrifying dark superhero film and dives into an psychological crime story. Director Matt Reeves takes this film into a whole new dark direction. So dark that every scene seems faded or taking place in a night raining setting. The script and narration in the beginning sets the tone of the film. With Bruce Wayne giving a narrative about how he brings fear that every criminal stays away from the shadows. The film is one awesome superhero film. Watching it the first time may not be enough with so much to digest on what is going on with the depth layer of the story. For a 3 hour run time, the film packs so much that it never once felt long.The script and direction is great. Dark atmospheric setting. Showing Gotham a city that is on a ticking time bomb with crime happening. Nirvana's song playing a couple of times setting that mood of the film. Which is dark and setting that depressing mood. But it works great. The action sequences are great. The fight scenes are well choregraphed. The villains Riddler played by Paul Dano is great. Riddler played more like a zodiac killer. The direction plays like a crime solving film with Batman being detective and on the trail of the riddler. Leading Batman investigating criminal syndicates like Falcone (John Turturro) and Penguin (Colin Farrell). And catwoman (Zoe Kravitz) assisting him with the investigation. The film gritty and grounded with its action sequences. The car chase was awesome with the cinematography being close to the action as possible.Robert Pattinson is great as a dark version of Bruce Wayne. And great as Batman. Paul Dano is good. John Turturro, Colin Farrell, Zoe Kravitz, Andy Serkis, and Jeffrey Wright were all great with there roles.The cinematography and music score were great. The film does have one brief scene that hints towards another film. The film has a deep depth story that packs a lot and ties a lot together. It is one awesome film that will leave a lot talking about.",
    "132": "The Good\nKravitz did a fine job as did all the other actors.The cinematography was well done, as expected from a big budget.They did shoot a lot of film to try to create an epic.Cool silhouette of the batmobileThe Bad\nGoes woke in the middle with Catwoman cursing the \"White privileged a$$holes\".Virtually no back story to make you give a damn about anyone.Actually wanted Riddler to win and his plan was obvious.Was actually boring in many parts.The Ugly\nThe story line. Convluted, messy, mostly useless.Deus ex machinas all over the place\nThe ending was plain out stupid. Somehow that will all be wiped clean in the sequel as if it never happened.Pattinson didn't even have to appear. Bruce Wayne almost never did.This is what you get when you forget you're filming Batman and not Twilight.No fun whatsoever. Droll, downer of a movie for three long hours.Another film which will have an artificially inflated IMDB rating. Worst opener of all the Batman franchises.",
    "133": "Pattinson is no batman, he will never be Batman. During the whole movie, you can feel that even Pattinson himself felt deep down inside he is no batman character. You could see and feel it.Zoe Kravitz' performance as catwoman is on the level of an elementary school play. She was the worst catwoman I have ever seen.There was ZERO chemistry between both actors and the forced romance felt fake and shallow.The pacing is way too slow to keep you engaged. The plot is so boring, you could easily watch another video on your phone to keep yourself entertained.They tried to stretch this dumptser fire out to a 3 hour artsy fartsy emo movie at which they epicly failed. Easily the worst Batman movie.",
    "134": "A lot of hype, but the end result disappointed me.It's not a bad movie. For me, it's mediocre.With that big a budget; the music is not good enough, the story is all over the place and the running time too long.Andy Serkis is a good actor, but a terrible cast for Alfred.The way Batman was presented in this movie, I came to think, why isn't he just a cop after all?The cinematography and sound design are 2 things that stood out for me.Was I entertained?I slept, I looked at my phone and my watch more than 10 times, impatiently waiting for it to end. No.Would I recommend it? If it were a 6-part miniseries on Netflix, definitely.For a cinema experience, no.",
    "135": "There's so much wrong with this movie. The first major problem is that it doesn't understand Batman. Batman Forever understood Batman better than this crap. Robert Pattinson plays Bruce Wayne as if he were an emo who spends his days locked in his dark room listening to Nirvana and My Chemical Romance. He doesn't even act like a human. He's like an edgelord teenager. I defended the casting choice leading up to the release of the film, but after seeing it I need to go back and delete every comment defending the casting of Pattinson.Second problem is Catwoman. Not the performance, but the character herself. She adds nothing to the film and the \"romance\" between her and Batman was so forced as there was never any chemistry between the two \"heroes.\" The scenes with her are absolutely the most uninteresting and I think it would have benefitted greatly if she was removed so the movie was shorter and more focused on Batman being the detective and going against Penguin and Riddler. The pacing is already super slow but every scene with Catwoman feels like they stretched one page of screenplay into five minutes of film.Riddler is okay. I like Paul Dano. He doesn't get a lot to do. Penguin actually ended up being more interesting and he was given even less to do.Jim Gordon in this movie is terrible. Easily the worst character. All he does in this movie is read clues out loud and go \"What does this mean???\" And then Batman figures everything out. It's so boring.This is probably a 3/10 movie, but the fact that it's getting such good reviews infuriates me. I hate knowing that this is the future of Batman and Ben Affleck won't be getting his solo movie now after being replaced by an emo loser version of Bruce Wayne. I'm not saying Batman v Superman was great or anything but my God it was better than this by miles. At least it was made by people who are clearly fans of the characters. Everyone in this movie other than Colin Farrell and Paul Dano seem like they're miserable to be in the movie.This movie is boring and pretentious but has somehow convinced people it's a masterpiece. It's not. It's like the Batman version of Blade Runner 2049 but without the skill behind the camera that Denis Villeneuve brings to his movies. He understands how to make slow movies feel epic and inspiring. Matt Reeves does not.",
    "136": "Is anyone surprised this was coming? For years, the comic book nerds have groused about a) why Bruce Wayne isn't so troubled by the death of his parents b) he doesn't do any detective workSo we get Emo Batman. Sunk deep into bleak variations on grunge pop Nirvana's \"Something In The Way\" it draws a doom and gloom march towards the unveiling of a serial killer in Gotham City. There are also nods to \"Seven\" & \"The Crow\" two films that have constant rain and a dark presence hovering over its dirty city.Some of the details of the Wayne's history is baffling. Perhaps I've not read the comics those are based on. Particularly his Father past nor his Mother's, which implies a Kennedy connection there, in terms of wealthy people burying their shame. Regardless of the attempt to clean up some of the darkness that haunts the Wayne family, none of their justification by way of Alfred (Andy Serkis) doesn't absolve guilt in any way. Which leaves you feeling off-put by our perception of what certain people meant to the city. In some ways, the movie actually asks you to forgive.For the most part, Robert Pattinson does very well when he dons the cowl. Once out, he seems to be a reject from The Cure. Much like Brandon Lee. His dead eyes match his dead soul. And director Matt Reeves is decisive when it comes to not showing the joys of wealth. A point which is made when we find out why the Riddler exists.Paul Dano does well as the Riddler. Though doesn't stray too far from Heath Ledger's Joker. Which is a shame. At a certain point, they could be interchangeable. A flaw I've always seen with both characters. And Colin Ferrell's Penguin bellows wildly like Robert DeNiro's Al Capone in \"The Untouchables (1987). A very easy connection. Even looks like him.I felt Zoe Kravitz as Catwoman was a massive misstep. She seems to be cut-and-paste here. Something is missing in her performance that separates all the other ones. A sexuality that oozes through the screen. Like every story prior to this has her story changed but she still is alluring. Kravitz does not have that quality. Many moments of sexual innuendos to be mined, but fall flat due to Hollywood's lack of courage to just make a fun movie that have Batman and Catwoman flirt. This doesn't want that. So what is their attraction? One wonders.All in all, children will not get this Batman police procedural. It's coming at an angle where it may be a long t.v.series, but doesn't have the sense of comic book quality the predecessors had to make it a cinematic adventure.I do like they went with something different. And perhaps this is what is lacking for me. For others, it may be a refreshing change of pace from the wildly comical Batmans. I just think this bleakness gives one very little interest in future installments by the same team.",
    "137": "1.5 hour filmed stretched painfully over what felt like 5.The bat mobile looks like something the A_team knocked up on a Sunday afternoon trapped in a scrap yard.I rekon I could have filled in this skinny batman.Whole movie shot in dim lighting.Soooooo boring.Over the top horror film music in scenes that lead to nothingStoryline straight as a die, no surprises and on and on and on it went.I can only assume this review section is full of bots.The car chase scene was absolutely diabolical.The budget for this movie was low, nothing happens that wasn't shot on a normal camera, no CGI no FX.When the lights went up in the cinema I could feel the pain and dispair in the air, an absolute snooze fest.",
    "138": "A way too long and pretentious addition to the series. In fact, I couldn't even finish watching it.It's not all bad though, Reeves nails the look and feel of Gotham City. It's dark, dreary and dangerous. Most of the cast are fine too. Paul Dano and Jeffery Wright do their thing as The Riddler and Godon. Zoe is sexy as Catwoman. Colin Farrell was an odd choice but not bad. The main issue is Pattinson. As The Batman he's actually not bad, it's his version of Bruce Wayne that is unbearable. He's mopey and inaudible most of the time and his attempts at seeming pensive fall flat.It's one of those movies that you sense is really pleased with itself and in doing so wastes too much of the viewers time with unnecessary pauses and shots so you can bask in it's idea of cleverness and art.Certainly not the worst addition to the series and I would give the next one another shot if it's as atmospheric as this. Hopefully Bruce will have stopped sulking by then.",
    "139": "I was really enthusiastic about Reeve's interviews, it finally seemed like his version would be more accurate to the comics, which I think it's been failing long enough with Batman movies.The dark detective noir story is there, in fact, and there's some great atmosphere with the first 15 minutes of the movie totally exciting me about how this was going.The settings and cinematography of the movie are really great, I absolutely loved that aspect of this movie, and the design of Batman suit doesn't look that bad in the dark even though it's definitely not my favourite live action version.Now, I really wanted to like Pattison's version of the character, I like a lot of his work, but this is an absolute miss. I thought so from the very first news of his casting, but I kept hopeful for a surprise that didn't come.As batman, he's definitely not imponent, his un-athletic frame and skinny legs wouldn't impose fear to a little girl, it really annoys me that he didn't put any effort on the physical side of his character (which is SO important for this role!), you can tell he didn't do any serious exercise when you see his torso and arms naked. I'm sure he got paid enough to have done better than that, it's almost disrespectful. And before you think \"oh, but this is Batman starting, he gets bigger later\": WRONG! He trains for years in Asia before he gets back and he's fully prepared physically, what he gains through being Batman in Gotham is experience, knowledge and new gadgets.In terms of performance, his Bruce Wayne is pretty much an emo, which is all the opposite to what the character does in the comic books to get as far away from suspicion as possible. Another miss. He never shows his sadness and tortured personality as Bruce Wayne.Not the looks, not the performance.The fights were somehow cool, mostly thanks to the cinematography, but after the first fight when Bats uses one of his \"weapons\", he totally forgets about his belt and doesn't do anything else than punching and kicking, and I don't find that satisfying enough, Batman's gadgets is one of the things that give him advantage over any other fighter or a bunch of fighters. It's a disappointment to see how the director thought about Batman's technology for his detective work but almost nothing on his fighting.In terms of villains, there were moments where Riddler was creepy enough to give chills, but it fell flat in the end. Penguin didn't strike in any particular way, even though Farrell is a great actor, the character felt washed down and wasted for me, lacking a lot of his classic characteristics.Catwoman looks good but also, didn't felt much like the comic book, could definitely have done more in such a long run of a film.I feel these realistic takes of Batman are killing the character in movies, I don't know why directors and writers fill their mouths saying they're fans and they want to be faithful to the comics and they make Batmans that can't do anything of what the character normally does.I whish someone would chill out a bit and make it a bit more fantastic within the character's characteristics.This one in particular is even more realistic than Nolan's, and for me, that's a very bad thing, I had enough of normal guys walking around in a useless armour throwing punches standing like robots.I can only hope this director is saving the gargets and abilities aspect for future movies, to show improvement and evolution on the character, but I think it could have been done in THIS movie, being over two and half hours there was more than enough time to show it!As a movie is not bad, but neither great. The pace is too slow, it really drags by times, with long, redundant conversations, repetitive scenes and the characters not too well adapted, specially Pattison's Batman.Another disappointment for me, because I keep waiting for a proper adaptation of the Batman from the comic books, as there's never been one.I whish Affleck would have done his take, with Deathstroke, his cool Batsuit, more action, more fun. His version was BY FAR the best, no way anyone can say his assault to rescue Martha wasn't the BEST Batman scene ever filmed so far.I'll keep waiting..",
    "140": "When movie started I thought it'll be interesting with new plot line and new villains', but director and writing department both lack vision. They wrote whole movie without batman actual goal or vision, and Robert Pattinson literally have only 20 lines. Whole movie he's just walking or riding bike, like seriously where's the story.There are no good action sequence as well,except last 5mins of the movie. Also, in one scene bomb exploded right in front of Batman and he didn't have single scratch, are you serious?Zoe(Catwoman) who made her actress and most importantly who selected her mask for catwoman, her mask looks like my grandfather monkey cap. Her acting is so bad, when she has dialogues, it seems like she's half asleep and couldn't deliver it.The whole movie was the question, what's the purpose of the movie and why so poor writing.",
    "141": "The Batman feels like the definitive take on the titular caped crusader. A sprawling, dark and epic story that finally puts Batman's detective skills front and centre whilst having ample commentary on today's society.Robert Pattinson gives a perfect lead performance as Bruce Wayne/Batman that's different to what's come before. A Bruce Wayne who only lives to be Batman and carries a visible pain and trauma in every scene. He also manages to do so much with so little, able to convey a lot with just a simple look or turn.Zoë Kravitz is an excellent Catwoman with her own pain and history and has all the necessary charisma and style. Paul Dano is an absolutely terrifying Riddler, having plenty of unsettling and loud outbursts of rage skillfully counterbalanced with quiet whispers.Also notable performances include an unrecognisable Colin Farrell, Jeffrey Wright, who is a superb Gordon and surprisingly active. Andy Serkis' Alfred, who manages to do a lot with a little and John Turturro who is icily cold and satisfyingly restrained as Carmine Falcone.Matt Reeves' direction is incredible, Gotham is at its most fully realized with a nice balance of realism and comic book extravagance. Action sequences are all extremely unique and are therefore able to standout with the car chase in particular being an unforgettable set piece.The pacing is also perfect, able to make it's three hour runtime fly by due to something always happening without feeling rushed. The music by Michael Giacchino is instantly iconic. Like the rest of the film it's able to find it's own voice and style that's different to what's come before.",
    "142": "As someone who has read pretty much all the Batman comics it is very apparent that Matt Reeves has not.He's basically just decided that Batman is going to be a bit emo and completely ignored the fact that you need a decent story line to make a great Batman film. You definitely get the sense that Matt wanted Bruce to be more like Kurt Cobain that the Bruce from the comics.You could easily cut out 90 minutes from this movie.Robert was miscast.Zoe was miscast.Colin was a very good penguin (pretty much the only highlight of the movie).The Riddler character seemed more like a whiney teenager that an actual villain.Alfred was basically a throwaway character.The film is predictable from start to finish, can't believe anyway is saying this movie has twists are turns. It's glaringly obvious what's going to happen.Hope they don't make this into a trilogy as it doesn't deserve to be one.",
    "143": "An overrated and overhyped movie and I can't help starting with trivia. Director Matt Reeves had said that he wrote the role of Batman specifically keeping Pattinson in mind and that he would have been disappointed if he didn't do the role. He also mentioned that Pattinson as Batman was required to \"walk stealthily like a ghost\". To those uninitiated into Batman movies and expecting scenes of the superhero to engage in high voltage action , there is disappointment ahead. The movie is a sort of investigative journalism where our caped superhero ( Batman alias Bruce Wayne) is trying to find out the the criminals behind the killing of a few top people ( including Mayor) of the administration of Gotham city. The killer leaves behind clues in the shape of cards for Batman. Additionally Batman has to unearth the facts behind the killing of his father. Batman's transportation is a high powered motorbike on which he does his commuting when he is not driving his Batmobile. Paradoxically for a superhero movie it is slow moving and boring minus the few scenes of action. The cinematography is mostly with \"night effect\", in soft focus, gloomy and depressing with ominous background music. The movie has 175 minutes run time which makes it a difficult, taxing and exhaustive watch. You want to hit the fast forward button. Teenagers who come to this movie expecting Spiderman type of fare may be hugely disappointed. I don't think the director's plan of a ghost walking hero who whispers hoarsely was any good. It is intriguing to say the least. The catwoman ( Zoe Kravitz) is a welcome diversion and she has done well.( At least she speaks clearly and confidently ). Robert Pattinson fits into the director's concept of Batman which is the reason for the type of acting he does. Colin Farrel as Oz has facial makeup of hideous prosthetics. I will leave you with a pun of dark humour the killer leaves behind in a card. \" What does a liar do after he is dead.? Well he lies still.\"",
    "144": "Taking notes from 2019's \"Joker,\" the newest iteration of Batman, which is aptly titled, \"The Batman,\" is a dark, brooding character study that feels less like a superhero film and more of a David Fincher psychological crime drama. Even going as far as to open with a scene of brutal murder, \"The Batman\" is unlike any other live action film that has previously depicted the caped crusader. And with that comes positives and negatives.Batman is by far my favorite superhero - and in this movie, he does not disappoint. Robert Pattinson play a moody, emo, young-adult Bruce Wayne who is obviously not well-adjusted to the world. Sure, he may be a billionaire, but he is no playboy or philanthropist. Instead, this film's Bruce Wayne is a reclusive introvert who spends most of his time prowling the streets at night for his next targets. Yes, Batman is not seeking out to necessarily save people but instead to violently brutalize thugs while telling them that his name is \"Vengeance\" - this leads to a fantastic introduction to Batman's character where he engages in hand to hand combat with a group of thugs, showing absolutely no mercy. It's clear that Bruce/Batman has a lot of pent up aggression; but unlike Affleck's Batman who utilized his raw strength to beat enemies to a pulp, Pattinson is still green. Having been The Dark Knight for only two years, Pattinson portrays a more vulnerable, less careful superhero, one who is getting hurt almost as much as he hurts others. However, instead of packing this film with high-octane fight sequences, \"The Batman\" aims to thrill through its depiction of a noir murder mystery.Paul Dano plays The Riddler, who is keen on picking off Gotham's high profile politicians and law enforcement officials. When the mayor of Gotham is found murdered, Batman must put his patented detective skills to work to figure out who is doing the killing, and why. Due to this change in tone that is so unlike any other Batman movie we've had before, \"The Batman\" has a very methodical, borderline slow-moving pace to it. Combine that with the three-hour long runtime, and you have a recipe for either disaster, or triumph. The long runtime is definitely what is going to turn people off from the film. A three hour superhero movie certainly isn't the norm, and both times I saw this film in theatres, I could definitely pick up on the antsyness of the audience. That said, even with such a long runtime, the movie's pacing is practically perfect. There is always something happening or about to happen, with an action beat occurring every 20 minutes or so. That said, because the movie has such a serious, brooding tone, the film never necessarily feels like it's picking up.It's clear that director Matt Reeves wanted this movie to forego all traditional superhero tropes, and instead cater to slow-burn, adult thrillers. While that can be effective, and is for a majority of the film, in my opinion the slow-burn almost added a level of stagnation to the movie due to the fact that the tone is relentless and constant throughout all three hours of the film. For \"The Batman's\" entirety, the film almost goes out of its way to deny its audience from any high-octane thrills or spectacular action set pieces. Even with the, admittedly, breathtaking car chase that has been featured in virtually every trailer for this movie, even that has a sort of slow-moving, \"artistic\" feel to it because of the fact that Matt Reeves decides to show most of the chase through the point of view of who Batman is chasing. Because of that, you don't get the gorgeous wide shots that you do in, for example, \"The Dark Knight's\" car chase set piece. Instead, in \"The Batman,\" the chase takes place mostly in the cockpit of the vehicles, not allowing you to see the chase in all its glory. Fight sequences are filmed similarly, in that there is almost always something that slightly obscures the action - a scene that immediately comes to mind is a hallway fight that is completely light-less except for occasional bursts of muzzle flair - you may have seen this in the trailer! Yes, it looks beautiful, but the beauty does take away from the intensity of the action.I also had a problem with this movie's villain. While Paul Dano is one of the best actors working today, it is glaringly obvious that his Riddler takes inspiration from another villain who enjoys wearing clown makeup. Additionally, \"The Batman\" lacked the emotional hook that Nolan's movies contained. A common criticism of this film is that there was a lack of emotional resonance, and I agree. I love Batman, obviously, which kept me engaged in the movie, but besides that I never necessarily felt connected to any of the characters. All these negatives aside, \"The Batman,\" does offer a compelling, endlessly watchable Batman adventure. There is a lot to like, and even love, here. Pattinson portrays one of my favorite iterations of both Bruce and Batman, and Matt Reeves packs this film with gorgeous, if relatively unexciting, action sequences. Paul Dano's Riddler has many memorable sequences - I just wish he was in the film more than he is.\"The Batman\" won't be everyone's cup of tea. It's long, it's slow, and it's seriousness and darkness doesn't make for the most thrilling movie. However, if you're at all, and in any way, a fan of Batman, you are going to at least like this movie. This is not my favorite Batman movie, but it is one that I am going to rewatch an endless amount of times because, well, it entertained me. And really, that's all I ask for in a movie these days.",
    "145": "Approaching this review holistically as my favorite Batman is Kevin Conroy (sorry live action movies) - my credentials - an average fan, have read most of the Detective and Batman comics, watched most the DC animated shows and movies as well as live action films and played all the Arkham games and also the Telltale series.To avoid spoilers, just commenting on the actual acting more than plot.I didn't like the Batman voice but midway through it grew on me. Acting wise Mr Pattinson is impressive (but my favorite roles of his are as Neil, Cedric Diggory and Rev. Teagardin) - as Batman, remember this is Bats in year 2 and Mr Pattinson nails it as well. A fine actor (not better than Mr Keaton but that is childhood nostalgia maybe however just as batty as Mr Bale..Mr Affleck was awesome as well but scripting for him was below par).Ms Kravitz was maybe born to play Selina (at least this gritty version). I honestly disliked Ms Kravitz in X-Men and Grindlewald but liked her in Big Little Lies. I was skeptical given her lack of martial arts but it is evident she gave her best during training and for me, her portrayal of Selina was perfect. Chemistry wise though, needed some work between Bats and Cats but nothing worth losing a star over.Mr Dano, wow; Saw like sadist perhaps inspired by Mr Spacey a bit, a Riddler far from the kooky \"riddle me this\" we have come to know and enjoy but he gave in a performance no less than his stellar efforts with Daniel Day Lewis. I have become a fan of Mr Dano's acting.Mr Serkis, just when I thought a re-imagining might go awry, there is Mr Serkis. He portrays Alfred so naturally, it's as if he is Alfred Pennyworth.Mr Wright is a fair enough Gordon and without any fault of his, once you've seen him as Felix Leiter (as he was the best Leiter for me) it's hard to not compare his take on Gordon with Leiter. Also once you've seen Mr Oldman in and as anything...well Mr Oldman is my best Gordon (like Mr Simmons is my best JJJameson).Mr Farrell was a believable budding Cobblepot and I hope he brings the same effort to the supposed spinoff (suffice to say I also had enjoyed his take on Bullseye..but InBruges is till my best for Mr Farrell).Mr Turturro is limited but still impactful as was Mr Skarsgard.Direction/Plot - I appreciate good work and Mr Reeves clearly put in an honest effort. I enjoyed his vision and never felt bored or distracted whilst watching his movie. He is not Mr Nolan or Mr Burton or Mr Timm/Mr Dini, but a league of his own and in this, he owned it. Thank you for not messing it up.Story wise the movie is entertaining and well made - there is a threat, hero and allies must work to show their relevance and save the day - done quite effectively (not life changing but films rarely are, however storytelling is meaningful). Obviously production values are impressive and the cinematography is amazing. Set designs are useful while costumes are well thought out and used relevantly.Overall - 10 out of 10 from me.Vinaka from Fiji.",
    "146": "As \"The Batman\" (2022 release; 176 min.) opens, it is \"Thursday, October 31\", and the Mayor of Gotham City is watching a city election debate on TV, only to then be killed by the Riddler. In a parallel story, Batman breaks up a gang in the streets of Gotham City. \"Who the hell are you?\" asks one of them. \"I am the vengeance\", responds Batman. At this point we are 10 min into the movie.Couple of comments: this latest Batman is the vision of director and co-writer. Matt Reeves (\"Let Me In\", \"War of the Planet of the Apes\"). Let's get straight to that vision: it is darker as any other Batman I've seen, both literally and figuratively. Indeed, Batman avoids the daylight as much as possible (it hurts his eyesight), and much of the movie features a dark and very damp Gotham City. Batman himself cones across cold and aloof. Are you getting the overall sense? I fully realize that I am in the minority here, but when all was said and done, I didn't enjoy or care for \"The Batman\" all that much. It's too calculating and distant. Not too mention, it's way, way, way too long. The movie could easily have been trimmed by half an hour without losing any of its core narrative.\"The Batman\" opened in theaters in early March but it was widely known that it would start showing on HBO and HBO Max a mere 45 days later, and that is where I saw it just the other days. If you like your superheroes movie dark, very dark, in every sense of the word, this movie is for you. I encourage you to check it out, and draw your own conclusion.",
    "147": "This was a huge disappointment for me.The opening sequence - and most of the first act - are excellent. Setting the scene in a dark and dangerous Gotham with a mysterious bat-like vigilante keeping the streets safe as much as one man can. The look of the film is fantastic.But when the story starts, it gets progressively worse. The tone never changes. Everything is shot in the same shadows. And the three-hour running time drags.Pattinson is OK as Batman. He is poor as Bruce Wayne. The \"emo Batman\" trope that started after the first trailer turns out to be true. Wayne is just as moody as Batman, but with his mask off, he comes across as sulky.Zoe Kravitz is good as Catwoman when she is alone, or when she is an antagonist to Batman. But when they have a scene together, there is zero chemistry.Colin Farrell's transformation as Penguin is impressive. But despite the promotional material, and despite him appearing in some of the most exciting scenes, he is a minor presence in the film.Jeffrey Wright just stands around looking glum.And this is the problem. As the film develops, the excitement decreases. What appears to be a complicated story involving murders and hidden messages, conscientiously investigated by Batman, turns out to be a distraction. Essentially, the final hour did not need any of the first two hours to happen. A key plot development is revealed, and then contradicted, through monologues. Moments that would have seemed atmospheric at the start, seem silly by the end.It becomes clear that this part of the film's mandate is to create the opportunity for a sequel. But that's no excuse for making The Batman so one-dimensional.",
    "148": "I love Batman and all the trailer was so well made. So, I definitely was hyped for the movie. Watched it on the opening day and the show was houseful, expectedly. But, oh man, this movie just did not do any justice to It's hype. So many loopholes were there. Most the dialogue are so poor. Did not feel any thrill in any fight scene(except only one, which I will not spoil by mentioning). No character were well developed and properly introduced. So, felt no connection with any character. Not even with Batman.What about that mask of the catwoman? Did they have so much budget issue that they couldn't design a proper mask for her? And, the way they made it, what was the purpose of wearing that mask? Also, No proper backstory of her by which we can at least feel connected with her. With the story that were shown, the movie can be at least 30 minutes short, easily.So much hyped and, much more disappointed.",
    "149": "Just got home from seeing The Batman.Honestly I don't know how I feel about this one. As I walked out, I had 4/10 in mind but that may change as I think about the movie a bit.Don't expect to see the Batman that you have come to know. In the new movie you are in essence just watching a guy wearing a mask trying to solve a politically and corruption motivated murder. The plot could just as well have been in a Jack Reacher or Ethan Hunt movie. The Batmobile is a suped up Corvette, there is no Bat Cave and he spends most of his time on a motorcycle. His gear is a leather mask, a cape and a torso shaped bullet proof vest. He rounds the costume off with some combat boots.Pattinson is truly uninspiring - rivalling the worst of Seagal's performances. While the cinematography is great, the movie is utterly one trick and monotonous. You are literally sitting for 3 hours listening to eery orchestral tunes and looking at Pattinson staring into the distance while doing his best impression of an emo teenager.There are some strong performances from Kravitz, Farrell and Dano but it is not enough to save the overly long movie.Bring back the Batman from The Dark Night please. We need a hero."
}