{
    "0": "A completely cliché kind of movie: Some teenagers that are of course always in bad mood change into good kids while a James Bond imitating Mark Wahlberg safes his kidnapped family cause, you know, he was a killer. And how does his family react: Omg he is a killer! But wait we are family, so we need to love him right?Sorry for that but I can't endure anymore movies like The Family Plan.Mark Wahlberg's time is over, I don't even know when the last good movie came out with him starring. Apple wanted another movie (not that they made two movies over the last months for cinema) so the writers thought: wow let's make a funny romantic family action road trip drama movie, man I don't even know how many genres we want to integrate into this movie but it's gonna be awesome! And I have to say the first act isn't that bad. I quiet liked it actually, even if it was a little bit brainless. But what followed was a story that couldn't have been more boring. I don't want to see the classic ending shot where the protagonists walk out of a building with the police already waiting. I want to see a story with twists and turns but besides some left and right turns on the street the movie had nothing like this. If you read reviews to get a recommendation, then I have to disappoint you, cause I DON'T RECOMMEND THIS MOVIE. Thank you.",
    "1": "The only reason I rated this as many as 4/10 is the always delightful presence of Michelle Monaghan, who I've loved since her wonderful turn in Shane Black's far superior action comedy \"Kiss Kiss Bang Bang,\" opposite the pre-Marvel Robert Downey Jr. (and featuring the funniest ever queer spy guy, Val Kilmer as Gay Perry). A couple of supporting performances by Ciarán Hinds and Maggie Q help to counteract Mark Wahlberg's awful lead and contribute to making this drivel barely watchable overall. I might try to share some of the unmemorable plot points, but I only like watching movies with memorable characters, and Ms. Monaghan and the character of her toddler are the only ones present here. Along with more plot holes than Swiss cheese. Did we need a full two, mind-numbing hours to include more pointless & bloodless stunt work? For the love of God, no, of course we didn't. If you think seeing Wahlberg's abs or Monaghan under a sheet in a luxury Vegas suite is worth the wasted hours you can never get back, go ahead and squander it away on this one, folks.",
    "2": "The Family Plan becomes very tiresome fast with it's long run time and generic plot/comedy/action. Nothing is special from this film presented by Apple. Mark Wahlberg tries his best here but can't save this film from sinking even though he stars and is a Executive Producer on. What is also dissapointing is the acting is very bad from everyone involved which is a surprise especially since this is a solid cast. Without spoiling to much of the plot point this reminded me of a cheap knockoff of True Lies in a way. You will know what I'm talking about when you watch this. The Family Plan gets failing grade from me with 4 stars out of 10.",
    "3": "The movie turned out to be an absolute letdown from the very start. Right from the beginning, the acting felt unnaturally theatrical, especially in the interactions between the characters. Even with Mark Wahlberg onboard, the performances felt hollow and contrived, making it impossible to connect with the story. The dialogue sounded forced, devoid of any genuine emotion or natural flow, resembling more of a scripted reading than a genuine conversation, especially with the kids. The plot, involving an ex-hitman chased by villains while on a family road trip, rapidly descended into ridiculousness and absurdity. The attempted seriousness in life-threatening situations failed miserably, with laughably unrealistic scenarios that never worked after adding the comedic tone. The entire premise felt like a mockery, leaving me thoroughly disappointed and uninterested in continuing. It's a shame considering the potential of the initial concept, but the execution was nothing short of a train wreck. This is the type of movie the people would leave in the background while playing UNO.",
    "4": "This was a cute movie, where Marky Mark (also producer here) is in a physical shape that is truly exceptional, and married to a beautiful wife with only a very civilized age gap. There's product placement, but not too much. There's staggering violence, but it's all squeaky clean so it can be a Xmas movie. All the supporting cast is ethnic just the right amount. The family is flush with tremendous cash, which helps plot advancement as well as beautiful cinematography / scenes.It was very enjoyable, assuming enough suspension of disbelief. The whole thing is obviously very predictable, but it's executed nicely. Everybody but the teenage daughter is world-class level at something, so while it's promoting family values, it is, for a change, not promoting mediocrity.I watched this while cycling indoors, was perfect to get me through my winter workout.",
    "5": "I give this an 8 not because it is a great movie but, within its \"True Lies\" genre, it delivers. I tend to get bored with non-stop action movies that spurt blood constantly and have no actual human characters. While it's improbable that the average middle aged couple look like the two leads and the whole thing is completely unbelievable, it at least paints an outline of characters and the cast is kind of lovable in their own tropes. Adolescent angst, mom boredom - yeah, it's a bit pain-by-numbers...but it flew past and I didn't check my watch or wonder when is this gonna end already??? - which is about 90% of the time with the crap the streamers make. (See \"Leave the World Behind - no, honestly don't -should've been on the Sherwin Williams channel 'cause it was like watching paint dry!!). You want art? Go to a museum. You want to enjoy a little mindless entertainment with high production values and a pretty great pop soundtrack (yes! An all-too-brief clip of \"Chaise Lounge\" and the cheesiest song ever \"Ice Ice Baby\") then this is your ticket.",
    "6": "This is such a good movie in th3 way you could see a lot of this happening. The kids lie to their parents just like a kid would. I love Mark's movies. Except for pain and gain with the rock most of his movies are winners. I like ALL the actors in this movie, and it's great all the way through. This is on my list of great movies to watch. I can watch this movie over and over, and see new things each time, because there is so much. Also, there are so many times in movies that you are saying why didn't they do....they should have.... But this one has thought of all that. The writing was great in this movie, I will look to see what else they have written, because I like the story line so much. DONT take my word for it, just sit back and enjoy the movie!",
    "7": "Here is a mess of a movie. It's frankly absurd. Probably the dumbest thing we've seen all year.The above is only partially true if you go into this Apple TV Produced film with the crazy idea that it's gonna blow your expectations out the door.This is what I call a FUN DUMB ACTION movie in reign of Last Action Hero, Or any Mark Walhberg action movie of past. It's ridiculous, sometimes annoying, and has poorly written bad guys. The plot is whatever you want it to be. There's no real story here. Just go with it. Pop your popcorn, add lots of butter and push play on your Apple remote. It's 2hrs long but don't panic. You'll survive.",
    "8": "The opening scenes of this film is very similar to True Lies. The wife of the long married couple aches for more excitement- little does she know....The multiple killings throughout the film - some fairly brutal - seem to have no lasting impact on the family involved in the killings. \"We are such a happy family after our vacation together where at least a dozen people were killed. Life is great!\" Not sure where the comedy is in that.Very strange messaging. We will have to watch True Lies again to remember why we liked that film so much better.Apple Tv 's script approvals are baffling. Truly baffling.",
    "9": "Family action comedy, that has a lot of family scenes in it (sister brother quarrels, baby diaper cleaning, husband and wife stuff) but that part is pretty dull to watch and takes up WAY too much time.But what is really annoying is that this movie fails to become really funny. All the \"jokes\" are so worn and old and formulaic. Seen it done much better in other comedies many times over.The action is allright, but nothing exhilirating or thrilling. How could it have been, because this movies is targetted at families and older couples / men and therefore any real edge or thrill is stripped out of it.It's boring. It aint funny. I have seen it all before, done much better by others.",
    "10": "Like a family version of Mr & Mrs Smith. We loved it funny and full of action. Crazy fight scenes. Great chemistry between Mark W and Michell M. And they both have endless energy. Also in great shape.Star of the show is that adorable baby. His sweet little laugh and perfect timing were spot on. Kids of course come around from being always annoyed at their parents and lying to them to being very impressed and learning the true value of family. The Trevor character is everything that's wrong with young people and it's perfect what where he ends up.Far-fetched of course and a little silly but so what. It was a lot of fun to watch.Very entertaining.",
    "11": "So there was some money left and no ideas. How easy is it just to remake a high scoring film but without the large budget. This is so copied from True Lies, even the main character has the same job and there is also the evil Asian woman. The ending with a show out against the baddies in an empty building, same. Between the first and last act there is the road trip ala National Lampoon's Vacation and it feels as boring as the real trip possibly would be. A few scenes are inserted to show how the kids and parents are growing to eachother. The film is trying to copy the light hearted touch of True Lies but fails. Is it a bad film? No surprisingly it is entertaining enough to sit along, mainly due to the main characters Mark Wahlberg and the amazing Michelle Monaghan. It's an actrice I don't see much, but she does a great job and it feels there is chemistry between both persons. And Mark Wahlberg never changes and I still love this guy for his commitment.",
    "12": "Ridiculous movie. Knowing the premise sets you up for disappointment especially if you have even heard of, let alone seen, Arnold Schwarzenegger's \"True Lies\" or Bob Odenkirk's \"Nobody\". Both far superior to this film. A minor difference being they strap in a toddler into this film and use far too many cut away shots of the kid reacting to the mayhem. The storyline is far too predictable, and there are no plot twists that you don't see coming from miles away. Wahlberg has no chemistry with anyone he is playing opposite. Your time would be better spent with \"Spenser Confidential\" than this potboiler. The two adult women are wasted in this movie, the teenage storyline could have been written by any high school freshman. This is a money grab by everyone involved and not worth any viewer's time.",
    "13": "An inoffensive, easy going, comedy thriller. Nothing makes this a standout example of this artificially sweetened genre, but nothing makes it a flop. It's a fairly bland, run-of-the-mill, straight to TV example. There seems to have been an attempt to build in some interesting subplots, but they are best ignored as they go nowhere. There are possibly notable interpersonal conflicts, but nothing that isn't part of the usual family tensions. The comedy is shallow, perhaps eliciting an occasional smirk. The action is well choreographed, but adds little. The overall result is a passable time-waster. And as you watch this, if you watch this, and only stick with it because you think that there is an about to be revealed twist involving Michelle Monaghan's character... there isn't. It's start-to-finish unadulterated blandness.",
    "14": "Q. What do you get when you add a handful of True Lies, a spoonful of the recent Tamil film Leo (which itself was adapted from A History of Violence), and a tinge of the Hindi TV series The Family Man into an A. I-powered blender with forgettable sprinklings of action & comedy?A. You get Marky Mark's The Family Plan, an Apple \"Original\" film. There's nothing much to recommend here, with Wahlberg completely sleepwalking through another DILF role. This is one of those films that you forget almost instantly after watching. Great companion piece to \"Ghosted\" (LOL!).P. S. Stop wasting Maggie Q and Michelle Monaghan like this.",
    "15": "I'm not sure this movie is even worth my time to spend my first review writing out a whole six-hundred characters for it, but here goes.This movie is bad. I get it, it's supposed to be fun and easy-going and a good little family movie that is just easy to watch, but its just not. It's filled to the brim with horrible continuity and factual errors that just break the ability to enjoy the movie, writing that is so undeniably corny while so obviously trying to not be that its just a pain to watch, and sit through. Please, for the love of all that is holy, avoid watching this movie. It is not worth your two hours.",
    "16": "This movie is some weak, lame, pathetic, unfunny garbage straight from Stepford. Who is its audience? Clearly, weak, lame, boring, unintelligent sheltered suburban dwellers that lead boring lives, drive boring cars, wear boring clothes, have boring hairstyles, and whom make Stepford residents seem adventurous.If you liked this movie then you need to start meditating and get into some heavy introspection immediately. Otherwise, Non-Player Characters from a typical video game have more life in them than you.The jokes are not funny, the acting is pathetic, and the entertainment value is zero. The interactions between the family members were beyond vomit-inducing. This beyond-cringe movie makes church services seem edgy - it was that lame.",
    "17": "What starts out looking like a tired and familiar plot gets turned on its head and ends up being something you really couldn't have predicted from the promos or the set up scenes in the actual movie. Engaging characters, a decent amount of actual laughs, fast and furious action sprinkled throughout and while it is a family movie - its almost sugar free with no saccharine added. Wahlberg is always engaging and it's great to see Michelle Monaghan back in action this time as the spy wife who can handle the truth and look great kicking some ass in her own \"soccer mom\" way. The kids appeared to be obnoxious but were relatively real in the suburban social media world they inhabited. Normally I would never rate this genre so highly but I really enjoyed this ride, know I will watch it again and in the end felt that it was surprisingly excellent.",
    "18": "Dan Morgan (Mark Wahlberg) is an used luxury sports car salesman and a suburban dad in Buffalo. He's been married to Jessica (Michelle Monaghan) for the last 18 years. They have three kids. He never has his picture taken. Out of nowhere, killers are coming after him.It's Apple TV+. One parent is a secret spy or assassin. The rest of the family don't know. It's been done and this family film is perfectly ok. Sure, none of this story is likely. Dan would have definitely moved his family into the woods many years ago or gotten plastic surgery to alter his face. It doesn't make sense that he doesn't tell his family right away. He could always spin his past and a shocking reveal can still happen. Monaghan is the definition of the cool chick. She was always going to be cool with the reveal eventually. All of that is a minor concern. I do really like Wahlberg for this role. The kids are good. This one adds the Baby Bjorn to the action fights. It's ok fun.",
    "19": "Dan (Mark Wahlberg) sells upscale quality used cars in Buffalo. He has a wife Jessica (Michelle Monaghan) former decathlon college star before she pulled a quad. His son Kyle (Van Crosby) is a world class video player. Nina (Zoe Margaret Colletti) is ready to follow her boyfriend Trevor (Colby Burton) to Iowa. And then there is the infant Max. Dan is opposed to posting anything on the Internet because he used to be a paid assassin who got out of the business under bad terms. Kyle's online fame gets him caught and now Dan takes the family to Vegas on a run for their life, except the family have no idea what is happening.This is a mediocre Hollywood trite script saved by the actors who put their all into this \"B\" movie. Fun Film in spite of the plot.Guide: 1 quick WTF. Implied sex. No nudity.",
    "20": "Not sure how Apple TV does it, but I really enjoyed this action packed movie that had me interested from the Title alone. Just like Apple TV's CODA, although I am\nalmost certain this movie will not get a best picture nomination like CODA did!Reminded me of Mr. And Mrs. Smith, but with the addition of three kids, including an adorable baby who was filmed perfectly reacting to the wild events unfolding right before his eyes.The best part of the movie was the importance of family, and how everyone was able to add significant value to the trials and tribulations that the lead encountered.A fun family movie - keep up the good work Apple TV+!",
    "21": "To start off, I loved the idea behind Family Plan of an ex-assassin living a \"normal\" life when his hidden identity gets discovered by the \"enemy\". And the trailer only seemed to support this with great action and humorous moments. I had great hopes.However, for me the movie was unfortunately a letdown and was almost a chore to watch at points for a variety of reasons.The actions scenes bored me and had no consistency. In some scenes Dan (Mark) spent minutes fighting 1 person, but then in the final fight easily took out an entire private army.Additionally, the enemy despite calling out \"all the stops\" consisted of the same 5 people until the final fight. Not to mention the fact that for such a huge road trip it they conveniently found the family van at the perfect points where only Dan was awake and ready. I could go on.The movie never seemed to really figure out what comedy was either with just a few forced puns.And to top it off the so-called family had almost no chemistry making every scene together feel forced.TLDR: Expect to be disappointed.",
    "22": "Basically a remake of the other 87 movies sharing the same theme that preceded this. However, it is a fun family watch, even though it is formulaic and predictable. We get a more suburban, 'Dad' Wahlberg, Moynihan (sp?) slides right into the role of Mom. It is pretty slow to develop but the action picks up. It suffers from the typical glaring continuity and consistency issues, usually inherent in these types of films, but they're easy to get past and settle into the rhythm. There is a bit of a twist at the end, but we knew that the encounter wasn't accidental to begin with. Grab some popcorn, get some blankets and settle-in for a relaxing family movie night.",
    "23": "The film is entertaining just for a 1 time watch on your own. It starts off like it will be real good. With Wahlberg doing his thing and humour that lands on point. Unfortunately after the half way make the scenarios that should be good choreography and action packed dont live up to what the film could've Been ( has been, and done better before) I started to feel more bored and irritated by the wife and kids who just gave my emotions blah. Nothing. The sequence with wife fight at end was annoying!! Like just rip a slit In Yr skirt already or roll it up. I felt like my own legs were confined watching her ungracefully stiffly flail around in stilettos. I pretty much knew it was done before that. By the bad guys alone. You kind of end up just watching it till the end just to keep seeing Mark wahlberg. As I said good first half .. but as a whole this had the potential to be so much better, if they'd improved action , more added humour and swapped the entire cast of bad guys and Marks family. Sorry.",
    "24": "Its own kind of generics, with some rather substantial diversions from the genre textbook... because it is simply a fun laughing trap trip of an familycraddeling action movie at . Im fighting the norovirus th8is weekend, and being able to laugh loud when being on the brink of barfing might release the barrieres of diare...but i couldnt stop myself enjoying this road trip to family safetythe wyhole cast really works fi8ne, mr mark is indeed cool kid cole en masse.Is it a family film to view for the whole family, to some extent its viable, but not for the minorest, cause there are violence of raw design, not goregory but might inflict trouble for the most brittle. The grumpy old man may recommend thius comedy at best, the story though aint getting the bestreviews.",
    "25": "Mark Wahlburg always delivers no matter something just entertaining or profound. Wasn't sure if I would watch all of it but glad that I did. Truly a feel good, fun, high octane (last part) romp. Good performances all around. Because of lots of shooting and (non graphic) killing of bad guys towards the last part of the film, not sure that little kids should see it though it's pretty family friendly for over half of the film. I watched it on Sunday evening, wanted to be entertained but also pause to deal with evening stuff and didn't lose the thread. Definitely entertaining enough to watch when you can't figure out what mood you're in and don't want something heavy.",
    "26": "Reading the negative audience reviews here, it's as if many of the people decided to watch The Family Plan without any idea about what they might get with a Mark Wahlberg, family-oriented action-comedy. This ain't Oppenheimer, folks. My wife and I had zero expectations when we tuned in and this movie more than surpassed the low bar we had set. It was cute, funny, and mildly action-oriented, with better than expected acting and a few moments that were actually pretty funny and heart-warming. If you're looking for a potential Oscar nominee, you're looking in the wrong place. But, if you want to pass a few hours and walk away with a smile on your face (like the adorable baby in this movie), you really won't go wrong with The Family Plan.",
    "27": "(Mostly) family friendly and predictable movie, but nice to have an option to put on and watch with the family and enjoy. You don't have to be a plot savant to figure out what is going on and how it will end, but there are enough comedic moments and well cut scenes to keep you engaged if you are just watching to enjoy some family time. As I read another reviewer state, it's a great watch it and forget it type of move. Entertainment for the sake of entertainment! Having said that, there is the reminder of the importance of family and the struggles of raising teenagers. They hit a few of these points spot on. Make more of these types of movies so I can enjoy them with the family please.",
    "28": "In silly but well made, engaging, feel-good actioner \"The Family Plan\" Marky Mark Whalberg lives a blissfully quiet (boring) life with wife Michelle Monaghan & kids Zoe Margaret Colletti, Van Crosby & baby - who know nada of his previous life as an assassin... until the goons of his ex-boss Ciarán Hinds find him, forcing him on a cross-country road trip (in which he battles them while hiding what's happening) to a glitzy Las Vegas showdown (which goes on a tad too long). It's pure entertainment with no deeper value, but all performances are pitch perfect, David Coggeshall's screenplay is solid, and director Simon Cellan Jones splendidly pulls it all together. It's unadulterated fun.",
    "29": "While this is not a movie where you'll be amazed by the plot it sure delivers on both action and comedy fronts and sometimes that's all we need from a movie: to spend a good time laugfhingh and see good action.A popcorn movie? Sure, but in a wold where,m save a few exceptions, most movies are very slow burns with crap characters only defined by their gender or secuality I'm just hjappy to see a movie that is just a movie.It has heart too, Michele Monagan never disapoints and even Mark Whalberg does a hreat job as the father figure.A fun ride throug and through, jighly recommended in these dark times as we all deserve to crack a laugh.",
    "30": "What you can expect from a movie with Mark Wahlberg is that there will be action, it will be funny and you will definitely have fun while watching it. And so it was this time. It's not a super ambitious movie, but it's good entertainment. At times a similar atmosphere to 'We're the Millers' (but note: certainly less funny).Simple, uncomplicated plot, predictable (of course!), but really good entertainment for a Friday/Saturday evening. For me, Mark Wahlberg is a guarantee of a good movie, and that was the case this time.Cool music is a nice addition. Really awesome Michelle Monaghan and Maggie Q!",
    "31": "Takes a lot for me to pay attention to a movie when I'm tired after work but this one kept me going. Occasional laugh out loud moments, fun scenes, couple of twists, nice action, fit leads and a rollercoaster ride. Recommend you watch it without knowing the plot, as I didn't and it was great.So I'm serious, don't read my extended review here just go watch it now!: It had a little for everyone, relatable teenage girl relatable teenage boy issues, loving couple in their parenting prime, some gaming elements, college life, family life, work life. Marky Mark is as fit as ever and it's an inspiration. Michelle Monaghan too, still very desirable. 8.5/10 for me.",
    "32": "Not sure what I was expecting but not this . It's a Road Movie, mixed with some \"coming of age\" stuff , a suspense spying story, some James Bond tricks and a pretty decent Chase Movie all at once. Highly entertaining , with good humor , not too-bad acting and some nice action.It's definitely NOT another Mr and MRs Smith ripoff, which I feared it could become. Yes, it's still a bit predictable from time to time, but the interaction with the family and the teenagers issues (minor spoiler since this is clear within 5 minutes from the beginning: the son turns out to be a famous gamer and YouTuber ) make it never really boring. Instead the pace of the story is pretty fast and keeps one interested from beginning to end.Great Friday night on the couch kinda entertainment. Enjoy!",
    "33": "The Family Plan, the new Mark Wahlberg / Michelle Monaghan \"my husband is a spy!\" movie, is less of a True Lies homage comedy and more of a serious \"you betrayed us Dad\" thriller at times. (But the tone shifts wildly) I honestly don't think the creators knew what this thing was. There's this whole subplot about the son being good at video games so of course he's made to be a spy's eye in the sky. It could have been a statement about the secrets families keep hidden from each other but why would they do that?Really not as into it as I thought I'd be. I'd definitely prefer the comedy I imagined in my head. Baddies Maggie Q and Ciaran Hinds can't even save this lacklustre flick. They aren't in it very much which just seems a waste. (But really I just wanted it to be funny.) And it really falls flat.",
    "34": "This is the story of an ordinary car salesman who it turns out used to be a government assassin. Predictably his past catches up with him and he goes on a road trip from Buffalo New York to Las Vegas with his family inculding a young baby. They have no idea about his past and he hides them being chased across country. It is comical how he hides people out to kill him from his family, on one occasion by the use of bluetooth and Enya.I only watched this for Mark Wahlberg. Its all a bit predictable. The comic bits are the best. The action is good but found a bit dull.Its no an amazing film or something that will stay with you. But it is a decent film that everyone will like. Its worth a watch at least once.",
    "35": "The Family Plan is a good movie about a wholesome family that turns into a mess of communication. Dan being a salesman and with a twist, an assassin's son was an amazing character and every other character had great arcs.The son getting to meet Valkrae (awesome cameo) and win the finals was farfetched but awesome. I loved the daughters story from boy obsessed to her own woman by putting a pinch hold on the cheating boyfriend.The main thing that dropped my score for the movie was the story line after the family found out about Dans backstory. It seemed like they weren't sure what they wanted the characters to do whether it's let Dan die or let Dan go back with his father. I liked the basis of the movie but I mostly loved the humor and action scenes especially the drone call out scene.My favorite part: the baby was never neglected whatsoever and I loved that because the family was very responsible with him unlike other movies where it's a common trope to lose the baby.",
    "36": "Very cute and violent, unusual mix plus the gnome and a sex scene, so not for under 12 in my book though many probably may not agree. More than average laugh out loud moments and as someone else wrote, suspend your belief system and just enjoy the ride, literally. A long car ride across the USA makes for a united family. The pace moves along really well and each character has a story of their own, 2 predictable, 2 not. Adorable toddler. Highly enjoyable especially compared to most of the usual evil theme or violent offerings out these days. Don't know what would have made it a higher rating, cannot pinpoint anything missing but it was a solid 7 to us.",
    "37": "I have enjoyed this movie a lot. Especially emotional as well as all comedy scenes and dialogues. Well done !!!This movie tells a lot what parents actually do for their children. It gives a very true picture of emotions and bond between family members. It shows a great struggle while saving each other at even tough times.Everyone who has any interest in romance, comedy, action and a true family bondings must see this movie. I am pretty sure that even if it is not based on any true story but it shows many true feelings and emotions that we can face in our actual lives.Good movie .......!!!!",
    "38": "This is such a great time overall. Nothing complicated. No overt social commentary, or politics. Just a fun, funny, well-done action comedy. The acting was great. The story was fun. It's been a while since I've just gotten to enjoy a movie like this. Yes, you know what's coming. Yes, it's formulaic. But, I mean, when the formula works...You really start to fall in love with the family here. And I found myself smiling through most of this.I don't know what else to say. This is the first time I've left a review on IMDb because I feel like more people should give movies like this a shot. (There was also only one other review at the time of writing this one that felt \"bot-y\" to me...) It's not my normal go-to kind of film, but I genuinely enjoyed this. And I think almost anybody would.",
    "39": "Don't pay attention to the critics and bahumbugs out there. All movies at this point in time are a rehash of similar themes. All the performances are great, the dialogue is witty and family dynamic/message is fun (granted, given in an unrealistic/fictitious action environment). The action is not gory or bloody (except two unexpected death scenes, but not too graphic). Our family loved it and we plan to watch again and again. Lastly, the sexual content is not explicit, played out within the marriage context and does not portray anything for which teens have not received sexual education. Loved it!!",
    "40": "For fans of Nikita, Maggie has yet another treat in store to keep the spirit of the show alive. I had a blast watching this. We haven't seen Maggie as a villain in an action movie since Die Hard 4, so this is a welcome treat. She stole the show as usual.After The Protegé in 2021 and Fear the Night earlier this year, here's hoping Maggie intends on keeping the momentum up. I see her becoming the next Michelle Yeoh in a few years and it'll be well deserved.The cast and the soundtrack were also standouts for me.Overall, this is another great addition to the MQCU and for Nikita fans worldwide.",
    "41": "Dont under the negativity. Great action, kind if funny but more about just good acting, storyline. Yes i see a lot of similar roles he plays as on italuan job and slso uncharted but thats him. Film works well with stunts galore while secretly hiding his past from his family. The skills of his children all piwce together with a great showdown at end. Have to kerp writing because of silly 600 words minimum which is too much tbh. Ok what next, do hsving been vegas myself i recognised a lot and brought back memories. Nice to see that actress out of nikita and desognatef surviver in it doing a good job.",
    "42": "This is one of those movies that you can put on regardless of your mood.Even though the concept has been done before, with the 'family individual having a dark past,' this one is worth a watch.The pacing is nice. Scenes don't drag on and small moments are conveyed well. The overall production is worth mentioning here, too. It's probably what you'd expect from the movie, but a bit better. The acting doesn't take you out of any scene, either.It deals with modern trends in a way that doesn't feel out of touch, and handles the family dynamic in a believable way.The action scenes are choreographed well, even if there is a large number of jump-cuts.",
    "43": "It was genuinely a bad movie. If it's funny you can get away with unrealistic and fake things, but otherwise you just leave me hanging. I kept waiting for that moment where I thought, OK I see where you are coming from and going. Mark is not an actor, but a character and still, he manages to disappoint, not one of his jokes landed, not a single one. About 75% of the movie feels like an elevator ride and when you step out it's just a lot of cringe that Michael Bay fans appreciate: just action and special effects.It's predictable and I think the only thing that made me laugh was the cringe at certain things. I first thought this might be a good movie to see while folding laundry or something. But, I had to pause a couple of times because I couldn't handle the amount of cliches per minute.It's in my top 5 of worst movies with a big budget.",
    "44": "There seem to be a number of extremely similar and interchangeable True Lies style shows on streaming at the moment. Including a series called True Lies. This Mark Wahlberg vehicle is portrayed as a comedy/action movie. But although there is plenty of action, I found few laughs.The plot is what you would exect. Ex agent with special skills is pursued across America after being accidently outed. Cue car chases during which he tries to keep his family ignorant of his past. Cue fight scenes in the background of wife and children looking at a college for their daughter.But it's all very two dimensional with villains and endless henchmen for Wahlberg to deal with. Production values save this from being a total losd whilst the cast play the roles seriously. So watch on a boring day.",
    "45": "You cut most of the heavy drama and add comedy.Marky Mark Wahlberg is an assassin hiding in plain sight in the suburbs when his past suddenly catches up with him while he's running errands. Maggie Q, as one of the antagonists was just excellent and *spoilers!!!* (Her fight with Michelle Monaghan has this one part that had me laughing pretty darn hard.) Even the kid actors were great, they had their say and I still enjoyed this film.The pacing is good, the director Simon Cellan Jones is solid, the action sequences are put together nicely. The music is kinda blah(imo) but not intrusive.All in all an enjoyable movie that you can sit down and relax to. That doesn't sound like much but with the way things can get sometimes, it's great to sit for a couple of hours and just turn off the old brain.",
    "46": "Well firstly it is good to see Michelle Monaghan aka Mrs. Hunt finally in some action after the Rabbit Foot episode :)Mark Wahlberg, well he is one of the those actors who will be in the movie, in any movie of any story of any character with the same face, more or less same punch lines, action / comedy but the point is, one can never have enough and he is surely entertaining.Movie is very much on the same lines of other movies and you can very well predict the end, story and presentation is somewhat different if not totally.A good weekend watch, a total popcorn and nothing serious but entertaining movie.",
    "47": "After watching \"The World Behind You\" on that rubbish Netflix (I immediately and finally canceled my subscription) I needed something high quality to recover and be happy again. Obviously when I look for quality films and TV series, I know well that I have to go to Apple TV+. I found this The family plan to be a really good film! Great for spending a carefree evening, having a few laughs and watching what a great action scene! In short, a comedy that cost 80 million dollars! Thanks Apple TV+! I forgot, the whole cast was exceptional, and the music chosen is beautiful! I saw the film on a 77 inch Oled with surround sound system!",
    "48": "There is something likable and endearing about Mark Wahlberg onscreen that no matter what the role is, I am intrigued enough to watch. Maybe it's from the diverse collection of his work over the years, from \"Good Vibrations\" to \"Boogie Nights\" to \"Ted.\" He delivers in \"The Family Plan,\" mixing his comedic chops with some combat scenes. Unfortunately, his character is really the only one worth caring much about, as somehow the creators decide to portray the rest of the family as one-dimensional caricatures. The wife is insufferable and the kids are just obnoxious. Okay, they do manage to showcase some funny reaction shots from the baby actor. But that's about it. Overall this is a boring movie.",
    "49": "Being a producer too Mark wahlberg was intentional from the beginning to keep you entertained or \"BEER ME\" up and was always being spontaneous DAN(his character name) & a responsible family man in this rib tickling plan movie...Liana norris as a kiddo gives sweetest moments to cherish whenever he appears on screen...while michelle monaghan thursday treat is a living heaven for every man who takes a responsibilty of family business...\nZoe collety theory of \"KAISU JIJITSU\" or \"Monogamy is just a construct of our western repressive civilization\" are the goose bumps moment to relish...Overall \"its never too late to become the man that every individual wanted to be\" when it comes to family things...\nNote : Watch the movie to get the best out of this review...",
    "50": "This movie is flat out boring, unimaginative, and completely predictable. This has all the makings of a hastily thrown together script, the production value of some crappy app advertisement, and a cast that probably put more effort into cashing the check than they did acting. There isn't a single redeemable thing about this movie. The jokes fell flat, the action was poorly choreographed and executed, the villain(s) were an absolute joke, and the dialogue was absolute rubbish. I really don't want to waste anymore time talking about how awful everything about this movie is, so I think I'm done now.",
    "51": "The storyline isn't anything new so don't expect to be blown away. Hollywood has once again weaved it's magic and convinced people they are making new movies when they are the same old story with a slight twist and new cast. It's entertaining enough for a family movie but not that memorable.Michelle Monaghan is the standout performance here and she really needs to be making more movies as she has a much wider range than Mark Wahlberg with his DiCaprio like three expressions acting style.There are quite a few plotholes and stupid scenes but they can be easily overlooked if you turn your brain off and focus on eating while watching the film.",
    "52": "A family action-adventure film that had potential but ultimately misses the mark. It's disappointing how it fails to make use of its cast, with subdued performances due to a weak script. The story itself is too straightforward and lacks excitement, making it hard to stay interested. The action scenes are bloodless, aiming to be family-friendly, but they end up being too tame and unexciting. This makes the film forgettable. It's a clear case of a great premise not executed well, leading to a movie that doesn't live up to its potential. Despite its promise and a great cast, the film feels like time wasted.",
    "53": "I used to love movies with Mark Wahlberg.I loved the movie, and the story. But I really miss good old sober Mark. I don't know if he's drunk, high, or if his brain is damaged from all that drinking and drug use. He just looks and sounds intoxicated in most, or maybe all the scenes. You can see that he tries to hide it, which makes it kind of easier to see. With the constant head flips when he talks, he speaks like a drunk person speaks to a police officer, his eyes flicker, etc. Why doesn't anyone help him? Stop putting him in movies until he's sober. It's an embarrassment to himself as a person, and the movies he plays in. Enough is enough.",
    "54": "This Was A Fun Ride Enjoyable Family Movie. Never Mind The Critical Reviews. There Are People Out There That Just Enjoy Bring Negativity And Spreading It Around Everywhere. This Movie Took Me Away From Bad Stuff In The World And Brought Me Into A Fun Filled Adventure Thats Light, Comedic And Enjoyable. Whether You Want To Enjoy By Yourself Or With Your Kids, It's A Great Film. Nothing To Be Taken Seriously And Great Clean Fun. I Love Watching Wahlberg's Movies And Love The Chemistry He Has With Michele Monaghan. I Also Have Always Enjoyed Maggie Q As Well. Now If I Wanted More Of Something, It Would Have Been Great To See Maggie Q In More Fight Scenes. However It Wouldn't Be Fair To Michelle. If You're Not Looking For Anything Too Serious , This Is A Great Choice.",
    "55": "Rarely does a movie surprise you when you know who is in it and what the plot is. This one had all the makings of terrible. Apple movies aren't usually Netflix bad so we gave it a shot plus it's really hard to hate any movie with Mark Wahlberg in it-he just makes it better. Of course this was full of impossible scenes and events and implausible outcomes but you don't care when watching it. It's like watching a super hero movie and having no concerns about the powers the actors have--it's a super hero movie! Same with this comedy. Nothing will make sense and you won't believe any of it could ever happen-it didn't matter to me. Wahlberg embodies the character and you instantly root for him and his family. It's an easy watch and who cares it's ridiculous.",
    "56": "If you are expecting superb acting, amazing fight scenes and elite level comedy you will be disappointed but if you want a nice lighthearted family movie that doesn't take itself to seriously you will not. What the movie tries to achieve it does... nothing negative to say about it. Yes some scenes that are supposed to be emotional become less so because the acting isn't amazing that doesn't mean it's terrible. Similarly some scenes that are meant to be cool are ruined by a corny line or mediocre choreography, So in summary you will cringe that is a guarantee but you will also most definitely smile and giggle a little bit. Perfect for family movie night.",
    "57": "\"**The Family Plan:** An exceptional comedy that skillfully weaves humor and heart. With a standout cast this film is a delightful celebration of family dynamics. The clever writing, sharp comedic timing, and captivating visuals make it a standout cinematic experience. A feel-good gem that leaves a lasting, positive impression, \"The Family Plan\" deserves applause for its ability to create laughter and warmth without revealing too much about the plot. A must-watch for those seeking an uplifting and entertaining escape into the joys of family life and comedy.Reminder: This movie is not for Karens and Darens !10 out of 10.",
    "58": "This movie is fun and entertaining. Love the characters and the Plot. I was entertained start to finish. Would recommend this movie to friends and family. Mark Walberg and Michelle Monaghan clicked and I especially liked the characters that played their children, whom they also clicked with. All around the movie moved smoothly and the plot line was fun but interesting. The plot twist with Cirran Hines plays well, he's an actor I've always liked. The teenage son is a gamer and the way the movie portrayed him was just right. But the baby just steals the scene every time. Don't know why anyone wouldn't enjoy this if comedy and action are on their movie list.",
    "59": "The Family Plan is a movie that tries to be both a comedy and an action thriller, but fails at both. Mark Wahlberg stars as Dan Morgan, a former assassin who has to protect his family from his old enemies while hiding his true identity. The movie is full of clichés, stereotypes, and unrealistic scenarios that are neither funny nor exciting. The characters are shallow and annoying, the plot is predictable and boring, and the action scenes are poorly choreographed and edited. The movie wastes the talents of Michelle Monaghan, Ciaran Hinds, and Said Taghmaoui, who play Dan's wife, boss, and friend, respectively. The only thing that might make you laugh in this movie is the baby, who makes cute noises and faces while Dan fights off bad guys. The Family Plan is a disappointing and forgettable movie that should have stayed in the family vault....I lost it when she shot at the elevator 😭😭😭",
    "60": "\"The Family Plan\" falls into the realm of mediocrity, weighed down by its reliance on endless shootouts and car chases. The film's central premise, featuring a retired assassin attempting a new life, is tired and lacks the innovation needed to stand out in the genre.The action sequences, highlighted in various reviews, dominate the narrative, leaving little room for character development or a compelling storyline. Mark Wahlberg's portrayal of the assassin seems uninspired, contributing to the forgettable nature of the film. Despite the potential for a fresh take on the retired hitman trope, \"The Family Plan\" succumbs to formulaic shoot-'em-up sequences that fail to elevate the overall viewing experience.In summary, the movie's overemphasis on action, coupled with a worn-out plot, makes \"The Family Plan\" a forgettable addition to the genre.",
    "61": "The basic concept of this movie is simple, which initially attracted me. I was expecting light entertainment, but this film is an embarrassment and completely outdated. A particularly troubling aspect is the portrayal of villains as people of color or foreigners, often with accents, while the heroes are represented by a white family. Such dated and insensitive portrayals should be a thing of the past. It's 2023, and the people at Apple Orginals should have progressed beyond these stereotypes.Beyond the problematic stereotypes, there's so much else wrong with this movie. The narrative pacing is utterly off the rails. The acting is atrocious, truly horrible. Many scenes drag on far too long, and the film could easily have been cut down to 90 minutes. I couldn't even make it halfway through, especially due to the portrayal of the villains, which was particularly appalling. You can do better, Apple.",
    "62": "Pile a cliche on a cliche on a cliche and you get this movie. It isn't even popcorn fare because of how flat and annoying these characters are.The best parts of the movie are the first 15 minutes. It's all downhill from there. Even action comedies need a basic amount of logic, but this one... sigh. The action too, is predictable and nothing to write home about. You see the jokes coming a mile away, and the dialogue is cringe worthy.Moreover, the writing overall is sloppy and really, really lazy. The overall premise is outlandish but in the hands of the right creatives, it could have been fun. Not this time though.",
    "63": "Caught off guard with my family expecting to see a pro family movie - but it cleanly promotes anti-family message. It has good intentions but waffles between \"our best days are behind us\" or \" were old but we still like to party and have rock hard abs.\" Its embarrassing for us mortals who do carry health problems, lower energy, and have a spare tire sacrificing for our children. We don't have the luxury of a Hollywood chef and hormone therapy. The makers of the movie were SO ignorant to how most middle aged women felt when the movie mom joins in the college fun with a flat tummy nearly kissing a college guy, drinking beer, upside down while 90% of the audience could not dream of doing that.. or even want to.. The movie should have validated what family life is .. which is a sacrifice and a changing of desires with age and change of focus from ourselves to our children... Not impress our kids with us ( that is selfish and the kids know it).",
    "64": "It's like this... a new Popcorn Movie to entertain for a while without thinking too much and nothing more.Discreet performances beginning with Mark Wahlberg as a former government assassin who for many years completely hides his true past from his wife (Michelle Monaghan) and his two children who never suspected anything...even when the things get very complicated.Motorcycles that crash into the family van, shots in the mirror, curves that should eject them from the car or at least rip their heads off their bodies... nothing wakes up the beautiful sleepers while the father of the family tries to outrun all those who are chasing them to kill them.Without having any demands, it can be a entertainment... even fun.",
    "65": "Typical American movie don't know why people giving 6 rating for this. Mark Wahlburg on his best for action and physique and acting of course!!Apart from that specially all the funny moment and all the car chase stunts were really great.Story wise it's like equaliser type movie, family guy who happens to have spy background and trying to live normal life, but now past drag him down and he must save his family from all the mess. Specially in doing so, true colours of the actor show up. Not to brag about it, but I really enjoyed this movie and everything it gives, Movie deserves at least 7 to 8 overall rating from what is worth.",
    "66": "How in the frick does a normal woman take out a special trained agent.wanna know how its a woman in a Apple show.and the children💀They make me wanna jump off a buncing castle and that o games makes you a pyscho when Apple made it it is stupid and overall has a kid music while the dad is shooting people and that a drone has the weapons to destroy walls is just stupid on a whole level and the dads dad thinks he is darth vader but briten and that the family abanodens the dad and goes right into the evil people is stupid and Overall its a stupid movie with kids in it that are stupid and cry babys.",
    "67": "A fun movie with the repeat typical plot of an ex-agent with a family now and his past comes to haunt him. It's a really fun, easy watch, if you want a feel good movie that's filled with action and comedy. Is it an original or innovative plot or idea. NO. Is it a great movie still? YES!I personally think it's rated abit low on here. Of course, Mark Wahlberg is not getting an Oscar anytime soon. He's just playing the same role he always plays in every movie he stars in which is basically playing himself but it fits the role of this movie so can't complain much and Michelle Monaghan is great as always.",
    "68": "In the realm of mindless action comedies, \"The Family Plan 2023\" treads a well-worn path, featuring Mark Wahlberg as the protagonist, former elite government assassin Dan. Faced with the resurgence of adversaries from his past, Dan opts for an unconventional escape strategy - packing his wife (Michelle Monaghan), teenage daughter, teenage son, and a surprisingly pivotal character, their 10-month-old baby, into a minivan for an impromptu cross-country road trip to Las Vegas.While the film doesn't break any new ground in terms of its narrative, what elevates it from the run-of-the-mill action comedy is the unexpected star power of the youngest member of the ensemble - the adorable 10-month-old baby. In the midst of explosions, car chases, and typical action sequences, the infant manages to steal the spotlight, providing moments of genuine humor and heart that resonate with audiences.Wahlberg and Monaghan deliver performances true to their seasoned capabilities, injecting charm and charisma into their respective roles as parents navigating the chaos. However, it's the interactions involving the 10-month-old that inject a refreshing element into the formulaic proceedings. The clever use of the baby's innocence and unpredictability adds a layer of authenticity to the family dynamic, serving as the unexpected source of both comedic relief and genuine warmth.Despite the film's adherence to a tried-and-true formula, the endearing presence of the youngest family member helps \"The Family Plan 2023\" rise above the monotony. The action-packed road trip may not offer groundbreaking storytelling, but the delightful twist of placing the spotlight on the 10-month-old character gives this predictable family adventure an endearing and memorable touch, making it a worthwhile watch for those seeking a lighthearted blend of action and family dynamics.",
    "69": "Mark Wahlberg plays Mark Wahlberg, as usual. Michelle Monaghan is absolutely wonderful. Strangely enough neither of these two shows up in IMDB:s \"Top Cast\" list.The little kid is entertaining.The rest of the cast I do not remember much about, so they did apparently not add too much to it all.The first half of the movie is fun but the second half is quite boring with stupid \"action\" that contains absolutely no blood whatsoever. It is strange how you can get a pole through your upper torso and not bleed at all. It is an ultra processed and clean version of \"Nobody\", albeit with some humour.OK if you want to be entertained for a couple of hours but not more. Ah yes, did I mention it has Michelle Monaghan in it? ;)",
    "70": "It is a movie everyone has seen 100 times. Just filled with cliche after cliche it is so dumb.When I was watching the movie I was trying to guess in my head which cliche they were going to use next and I was right most of the time.If it was a kid movie I would understand this a bit more but its not?? So why would anyone want to watch 2 hours of generic scenes we have all seen 1000 times?I dont think there was a single original idea in this film which is honestly just sad and pathetic.The family plan is a movie filled with generics scenes, corny jokes and cliche after cliche after cliche.",
    "71": "I liked this.It is ground-breaking in concept? No.Is the story something unexpected? No.Is Wahlberg's acting better? No.It is clché? Yes.However, it is entertaining. I wasn't watching the clock during it or pausing it repeatedly. It held my attention in spite of a rather expected storyline. Action sequences were decent. And Monahan always does a good job. So in spite of some viewers expecting the next great blockbuster apparently, this film still delivers on entertainment. And while her part is VERY minor.. love me some Maggie Q.Minuscule adult oriented content, no nudity, very light on foul language. Violence is the biggest aspect.All that being said.. VERY strange optics from an Apple film... all these black \"henchmen\" chasing down this white suburban family. Seriously, ALL the henchmen were black.. the race dynamics just seemed noticeable to me.",
    "72": "Lately we need more shows that are just fun. This movie is an excellent movie to watch with or without your family.I have watched it twice already and will watch again I'm sure because lately TV shows are just ridiculous or just bad because of something someone is trying to push without considering the viewership.And we'll both Mark Wahlberg and Michelle Monaghan are perfect for this action comedyLately we need more shows that are just fun. This movie is an excellent movie to watch with or without your family.I have watched it twice already and will watch again I'm sure because lately TV shows are just ridiculous or just bad because of something someone is trying to push without considering the viewership.And we'll both Mark Wahlberg and Michelle Monaghan are perfect for this action comedy\nLately we need more shows that are just fun. This movie is an excellent movie to watch with or without your family.I have watched it twice already and will watch again I'm sure because lately TV shows are just ridiculous or just bad because of something someone is trying to push without considering the viewership.And we'll both Mark Wahlberg and Michelle Monaghan are perfect for this action comedy\nLately we need more shows that are just fun. This movie is an excellent movie to watch with or without your family.I have watched it twice already and will watch again I'm sure because lately TV shows are just ridiculous or just bad because of something someone is trying to push without considering the viewership.And we'll both Mark Wahlberg and Michelle Monaghan are perfect for this action comedy.",
    "73": "Another family with parent's secret identity movie but it does try to be unique. Some scenes were full of old jokes, but some are actually funny like LOL funny...Love how the plot actually took its time with the story telling and not abruptly shifting from 1 scene to another..The cast were alright; they don't have that explosive chemistry, but its enough for the movie..Love the cinematography, and backdrops..I appreciate the atmosphere/mood of the movie since it doesn't really get too serious on stuff, just enough to be convincing and appropriate for audiences to just enjoy.. It is a family movie despite the violence and few language.Wholesome movie - don't watch it too seriously...just kick back, watch, and relax!P. S. How can they say Mark was lame with his bod in the movie?! - xorry just can't get over it...and btw, the baby/kid was just amazing, best cast there for me!",
    "74": "6.7/10 (recommend)After seeing the trailer I was excited for this film to release and I'll say the wait was worth it. There's nothing significantly special about the film, but it provides a family aspect while still giving entertaining action.The main draw for me was Mark Wahlberg. I'm always entertained by his stuff. He doesn't give a standout performance, but he hasn't lost his mojo yet. Michelle Monaghan, Zoe Colletti, and Van Crosby round out the family perfectly. I don't know them as actors very well, but their attributes are perfectly suited to their characters. My favourite character was baby Max. The infectious laughing and giggles reminded me of Jack Jack from \"The Incredibles\".The story is good and progresses well despite being a little long. It doesn't just focus on action and killing. It also brings the family issues to a front so bad guys are the only things being combatted. Trying to navigate different things while trying to keep everyone safe. The characters don't feel rigid. Everyone has an ability that adds to the survival.I enjoyed the looks and sounds of the film. The different environments and landscapes made it feel like you were part of the road trip. Sounds were a huge deal for this film to work. Lots of gunfire, punches, glass, and vehicles being fired, broken, or moving. The main take was punches and glass sounded natural either by landing properly with the visual, or not being bigger than what the object was. Glass bottle shattered like a glass bottle and a table the same thing. The music wasn't too shabby either. It all worked perfectly for the enjoyment of the film.Overall, this is an enjoyable family action flick though you don't have to watch it with your family. The downside is if swearing isn't your thing then maybe skip it. If you like Mark Wahlberg then he's worth the time. The movie does a good job to draw you into the family while also entertaining you with action and violence. Looks and sounds like a film of this calibre should look and sound like.That's all for now. Thank you for taking the time to read my review. Until next time.... Enjoy the show!",
    "75": "Mark Wahlberg has been in a lot of movies. A few of them very good (The Departed, The Fighter), but even in those he wasn't the best actor.So in a movie like this he's expected to carry it. But even though he's serviceable, his comedic talents aren't enough to pull it together.Add to that the fact that the movie swings from screwball comedy, to thriller, to domestic melodrama, it's a mess.It feels like it wants to be True Lies. But all the films that have tried to emulate that movie have missed. This does as well.And because there have been so many clones of True Lies we can easily predict how everything will work out.The wife doing a 180 wanting to leave and take the kids with her, is just one of many tonal shifts that don't work.When the crazy fight sequences (that are terribly choreographed) at the end take place there's no tension at all. We know the family will be okay, that they'll all contribute in unexpectedly badass ways, and that it will all be wrapped up in a bow.Even Michelle Monaghan can't trade her work from the Mission Impossible films into something worth watching.Bummer.",
    "76": "This is an action-comedy movie, and it's just a feel-good movie. It's not depressing; rather, it's an enjoyable, chill, and fun movie. Some might not like this type of movie, but there's also people like me who just want to watch action-packed scenes without too much gore, not that violent, and especially obscenity scenes. The bed scenes are just okay, which I like since, as I have said, it is just a family-feel-good movie, and it is appropriate for the movie's theme.The casting is perfect; I could sense the connection between the characters and each other, and the interaction of the family is very realistic.The editing is also good, and so far, I have not seen any plot holes. I also love their lines; they wrote the dialogue well. Action scenes are not that repetitive. In that scene where Monaghan broke the bamboo, I really thought she was going to jump, but it was not, and she performed an unexpectable execution.This movie is recommendable and much more exciting compared to the EX4 lol.",
    "77": "Part action, part comedy, here comes a Mark Wahlberg movie that is both typical for this actor, but also something you likely saw (or close to) in the past. That said, its 2023 and almost everything has been done already, so the real question is this. Is it well done this time? Is it fun? And the answer is yes.The movie take a bit of inspiration in True Lies but put its own spin on family road trip comedy with some \"We are the Millers\" vibe, while injecting some decent action sequences in there.Having a runtime of 2 hours make sure the movie put enough emphasis on the familly relations and developing its characters, wich can be a definite plus, but at the same time i felt the movie dragged a tiny bit in the first half. Maybe 10-15 minutes could had been cut. But it didn't detract from my enjoyment.Mark Wahlberg is definately in pretty solid shape still, wich make his character completely credible, but he ain't no martial artist so seeing him go toe to toe with Lateef Crowder (a Copeira expert) did showcase some of his shortcoming. That said, that scene was meant as a mix of comedy and action and not to be taken too seriously so for most peoples who are not martial arts afficionados, it should not be a problem. The rest of the action including gun scenes were well done.Michelle Monaghan is also pretty solid in her role as the mom of the familly. Charming and charismatic. The kids also got to have enough screen time and developement that they felt usefull and interesting in the story. Every character pretty much as its own arc.Overall its a movie that i taught was pretty enjoyable on a first watch. It is a mix between comedy and action but at the same time since it never fully commit to either side, you can't say its a super funny comedy or a big action movie. It is a bit of everything and it makes for a good story tough.Ultimately not every movie is meant to be watch multiple times and considering Apple TV+ has a pretty limited selection of mainstream original movies (Ghosted being one of the few great ones), it is a welcome addition that both casual viewers and cinephile should enjoy.",
    "78": "I can't take it serious this movie ! Okay I admit I'm making a review only on the first 20-30 minutes cause then I had enough .And seriously this is not acting ,it's so theatrical the way they speak to eacother the parents . It's rare I quit a movie after 30 minutes, especially if it's with mark Wahlberg,cause I think he is awesome ,but everything about this movie and acting seems so fake and shallow. When they talk to each other it's not like a conversation ,it feels more like they are reading the lines while they try to act pff .Mark Wahlberg is a retired hitman working as a car salesman and all of a sudden hes cover is blown and while driving together with the family ,he is chased by these bad bad people ,it's so ridiculous and stupid and yes very very unrealistic like so many other movies I know ,but this is just idiotic and the acting portrayed in this seemingly serious deadly situation is just a laughing joke ,but your not laughing one bit .Mark Wahlberg get your act together and get back to SHOOTER VOL 2 character instead!!",
    "79": "There is no denying this is another take on the Schwarzenegger - TRUE LIES movie.I think where this film succeeds is in showing how the secrets Dan/Sean kept for all those years impacted his family. From the routine ways in which he showed his wife how much he loved her to the lack of ability to connect with his children.It is only when he is forced to bring his secrets into the light with his family is he truly able to connect with them.While it may not feel fresh, this movie does a good job at paying homage to the original as well as offering something new.Wahlberg, Monaghan, Colletti, and Crosby do a fine job bringing the characters to life in fun and enjoyable ways.While this movie may not win any awards - it is certainly a fun watch.",
    "80": "7.5 starsWhile most movie reviews largely consist of what is in the movie, allow me to begin by listing things NOT in the movie.No henpecked husband.No dysfunctional marriage.No unappreciative spoiled unreasonable children.No blatant sexism from any of the male characters just so the movie can show us how mean men are.No political/moral lecturing of any kind.In a way this movie is a throwback. The first 75% of the script aside from the obvious anachronisms could have easily been something written in the 1950s. The characters are devoid of the many histrionics that seem to have become a staple of modern movie's characters.I can't remember the last time I watched a family comedy where at least one of the main cast wasn't insufferable but here we actually have a healthy loving family for once! And that's not to say this family doesn't have problems. In fact the first half of the movie is dedicated the the family's problems and dramas but they work through them as normal mature people who have conflicting perspectives on the world rather than screaming at each other incessantly. While all of this is going on we have the time to get to know and care for each member of the family, so when the danger picks up in the second half we actually care about what's going on.This movie doesn't break any new ground, but again, what makes this movie good isn't that they add a bunch of new things, it's that for once many of the defects that seem to affect practically all modern family entertainment are absent for once, and for that I say bravo!Lastly I can't end this without mentioning how good all the cast was, with special mention for Michelle Monaghan navigating an unbelievable situation with very believable performance.",
    "81": "This is one of those movies you should watch with someone you love!I like Mark Wahlberg and enjoy his movies.This movie turned out be surprisingly good - despite the less than stellar review.Yes, it an old story but it's done in kind of a new way.Love the World. Buffalo. Vega. A former government assassin living a new life in hiding.Love the Characters - especially the toddler. He's pretty entertaining.Love the Plot - The assassin fleeing to Vega with his unsuspecting family to lead them to a new life with his former assassin teammates in hot pursuit.This movie has A LOT OF ACTION - actual and gamer.It also has A LOT of great comedic moments.Yes, this is one of those \"Feel Good\" movies by the end.But I still found it immensely entertaining!",
    "82": "Goodness, I'm supposed to attempt six-hundred characters for a review... We'll give this pish a try.Genuinely kind of attracted to this, seemingly, 'fish-out-of-water' but wait! Concept. The first action scene has a really interesting premise. The problem starts (& unfortunately continues) from there.What are we watching?Whalhberg & Monaghan can both perform for an adult audience. This film is not for that. Guess I, stupidly, ignored the key word in the title: Family.It plots as though someone wrote a funny, dark, action flick, that was then sold & butchered by a studio to sell tickets: Film be damned!Did Walhberg lose his ability to choose script when he found god? Who knows, but it's another dud!Difficult to recognise how well choreographed the action is due to choppy editing (poor filming). Dialogue & comedy is obvious & unsurprising.Seriously, give it a miss: Even patient, I only made 48 mins: Terrible.",
    "83": "Thank you so much for this movie. Me and my whole family, including our little ones really loved it. Not vulgar sexual jokes and references, except a very few intimate scenes which we skipped. Other than that, most of the language and acting was clean. The movie concentrated in making sure the story line was excellent, which was! A big thumbs up because we all liked it and we loved seeing our kids having a laugh every now and then.It was very family oriented and the storyline was kept from a family point of view which many comedy movies completely miss understanding. So this movie got it spot on and really made us laugh. For 2023, we have not had a family movie which we felt like we would watch it again. But this one is for sure one that we do not mind watching it again.Maybe the next sequel can be kept even more kids friendly with the same level of family oriented fun and exciting action which all kids and parents can relate to.",
    "84": "I often find myself confusing him with Matt Damon, but in this case, we're talking about Mark Wahlberg, the actor from \"Transformers.\" He takes on the lead role in the recently premiered action film \"Family Plan\" on Apple TV, portraying a former killer and agent.Adding a touch of diversity to the cast is Li Meiqi, an Asian actress who plays a significant supporting antagonist. Undoubtedly, she stands out as one of Hollywood's most stunning Asian female stars. While she's been cast in decorative roles before, her four-year stint in the TV series \"Nikita,\" which started in 2010, has undoubtedly solidified her presence in the competitive realm of Hollywood.The narrative of \"Family Plan\" unfolds as a tale of a former special agent assassin who, after going off the grid and starting a family, finds himself pursued by a relentless organization. The only option left is to go on the run with his entire family. Despite its straightforward plot with minimal twists and humor, the film has managed to earn a commendable 7.2 rating on IMDb, based on 71 audience reviews.Taking a closer look, the movie appears to draw inspiration from \"True Lies,\" a factor that might resonate with fans of Schwarzenegger's earlier works. However, beyond this familiarity, the film boasts commendable action sequences, and its overall narrative pace is expertly handled, preventing it from succumbing to dullness.The increasing inclusion of new Asian faces in Hollywood productions is a noteworthy trend. These aren't the stereotypical portrayals but refreshing talents like Li Meiqi and Daniel Wu. With the burgeoning influence of the film and entertainment culture from emerging Asian nations, particularly South Korea, Hollywood must address and dismantle its antiquated stereotypes, especially those depicting Asians with big faces and squinty eyes.In a nutshell, \"Family Plan\" stands as a worthwhile addition to the action movie genre. However, it's worth noting that the film crew might have exercised a bit too much frugality in their use of ketchup, metaphorically speaking. This nuanced observation adds an element of critique without overshadowing the overall positive appraisal of the movie.",
    "85": "As \"The Family Plot\" (2023 release; 118 min) opens, we are introduced to Dan, a successful car salesman. That very day is the 18th wedding anniversary of Dan and Jessica, who are getting ready to go out and celebrate, leaving their 3 kids (2 teenagers and a latecomer-baby) on their own. At this point we are 10 minutes into the movie...Couple of comments: this is the latest from British director Simon Cellan Jones, best known for his TV work. Here he gets a shot at a big production Hollywood film, which focuses on a family road trip from Buffalo to Vegas (1st hour) and what unfolds in Vegas (2nd hour). The plot is as unlikely as it is unbelievable (average/boring dad/husband turns into a James Bond-like character) but that aside, the production is super-smooth, with some big action scenes. Mark Wahlberg (as Dan) can do this type of movie in his sleep. If it sounds like I am being negative about this movie, I am not. I found myself surprised that I stayed with the movie through the end. This movie is perfect holiday fare: mindless entertainment, nothing more, nothing less.\"The Family Plan\" recently premiered on Apple TV, where I caught it the other night. If you are in the mood for a family-oriented action comedy that provides mindless entertainment, I'd readily suggest you check it out, and draw your own conclusion.",
    "86": "Don't know why everyone's talking about True Lies. Didn't find here anything similar to that movie, and even thing it's better than True Lies.Film is funny, not so much that you'll want to watch it again soon, but it's worth the money. It's unrealistic? Of course that is :) The guy is a professional assassin.. Not like this movie differs in realism than half others which feature the same kind of character.Which I found most boring are fighting and shooting scenes. If you'd compare this to some real action movie you'd give that segment like 5/10. On the other hand in some other compartments like comedy, dialogue, acting, etc.. movie is entertaining, so it averages about 6-7/10.Cinematography is very good, acting good. No glitches in acting that would take your attention away and take you out of the movie.I have no idea why some bashes this movie so much. I'd give it a chance. As I recall there is one baby diaper, and two vomiting scenes, that could be disgusting for some.",
    "87": "I enjoyed this movie. It was fun, didn't take itself too seriously but didn't fall into excessive quips either. It did feel like it dragged at times. But never to a point I disliked it.It feels like this is cut from the same cloth as Mitchel's vs. The Machines. But instead of family comedy meets robot apocalypse, you got family comedy meets spy thriller. And it bale cues the two really well.The cinematography is top notch too! And the music can go real hard at times in the best way.The cast was also solid. It seemed like everyone was putting in their A game, and the dialogue between the family was genuinely charming. Give this movie a chance. It's honest fun!",
    "88": "A predictable, cliché movie that can be enjoyed by the entire family. Not a drop of blood is to be seen although plenty of shots are fired. Mark Wahlberg has always been a second rate action hero for me and he does not surprise that way or the other in this one. Michelle Monaghan as the supporting actor is doing a good job, but again nothing that will knock your socks off.The kids also have an interesting story-line on their own and the movie deals with spy movie-esq plot along side a tale of family values and coming-of-age lessons. Just keep in mind this is a family movie aimed for teenagers, therefore not very serious and nothing you haven't seen before.One thing that I found refreshing was the eSport angle. Without giving too much away, I enjoyed seeing that in a mainstream movie and thought it was handled with a good level of realism.How to rate this movie? It's nothing special, however it's enjoyable and can be watched by the entire family, if taken as such it is not a bad watch, however Mark and Michelle are not Brad & Angelina. I landed on 6/10 due to overall production value but I can see how different people can have different reaction to this.",
    "89": "Mark shouldn't do comedy, here he plays the same bewildered hit man that he did 20 years ago in The Big Hit. Mix in some poor action and incompetent baddies and this is what we have. Almost thought it would be another Mr. And Mrs Smith but it comes across as a road trip movie without nearly the jokes that there were in We're the Millers.Dang, I've got quite the history of films here, taking a piece of everything and attempting to find something interesting, but it's just simple hit man theater.I guess there is a new baby element which we are supposed to appreciate. Nearly everyone is miscast, from Mark to the rest of the family. So simple, so predictable.Go watch another movie, they're getting to be all so similar now, and anything is better than this.I'm thinking that Mark was the executive producer on this vanity project, so he couldn't really see just how bad his acting skills are. 2/10, one or two funny parts otherwise quickly forgettable.",
    "90": "Directed by Simon Cellan Jones. A runtime of one hour and fifty-eight minutes. Streaming on AppleTV+ with a PG-13 rating.\"Dan\" played by Mark Wahlberg is a former assassin living a completely different life. He left that life full of murder and espionage alone. Now \"Dan\" lives in Buffalo New York. He has a wife \"Jessica\" played by Michelle Monaghan, his soon-to-be college-bound daughter \"Nina\" played by Zoe Margaret Colletti, \"Kyle\" played by Van Crosby the gamer son, and his toddler son \"Max\" played by Iliana and Vienna Norris.As you see \"Dan\" has a big family. Can you imagine keeping this huge secret from your family and trying to stay off the web as much as possible throughout the years? So your old affiliates can't find you.But that's exactly what happened. Whether \"Gwen\" played by Maggie Q, \"Coogan\" played by Joyner Lucas, \"Toothpick\" played by Felicia Pearson, or his old boss \"McCaffrey\" played by Ciarán Hinds. All these blasts from the past want their pound of flesh.\"Dan\" decides to take his family on an impromptu family road trip across the country to Vegas. While he tries to run from the past and by time before he has to come clean to his family about his old life. Even with endless amounts of people trying to kill him \"Dan\" finds that this trip is exactly what the family needed in this wild family action comedy.\"The Family Plan\" was a fun family film. It was something different from Mark Wahlberg while still being semi-on-brand. I liked the storyline and the pace of the film. It's a film that you can still enjoy even if you're watching it by yourself.It kept me engaged and AppleTV+ doesn't usually miss. This was a streaming film but it had A-list actors. They put effort into the script and production. It was light-hearted but not lazy which I liked. I enjoyed it and gave it four mor fires 🔥🔥🔥🔥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#TheFamilyPlan.",
    "91": "For many years now I have turned off a film as soon as the actors begin to express emotions by vomiting. And more and more films have to be turned off, sometimes at the 10th minute, sometimes at the 15th. I understand that this is the evolution of American cinema and acting, but still from time to time I ask the question: is this really just a degradation of the American film language, perhaps in reality some psycho-physiological changes have already happened to Americans? As before in the films, all American children could not breathe without an inhaler and all their stronger emotions were expressed by suffocation.Darling, will you marry me.Oh, darling, (vomit)***\nCongratulations, you won a million. Tell me how you feel about this?(vomit, vomit, vomit)Yes, we are also very happy for you!***\nPlease accept my condolences for your loss.The funeral service will begin in a few minutes. Guest vomit urn to the right of the church entrance.",
    "92": "I knew nothing of this movie, but decided to watch it, because Mark Wahlberg usually delivers a good story and a great performance. I was not disappointed, but loved every moment of it.I wont give away the storyline, but Wahlberg plays two different characters and he does it really well, so it is clear, which one he is at any time.His wifes role is well defined and not surperficial, as many female roles tend to be and she has several moments of glory, where she gets to shine.The kids parts could have used more work from the writers, if they are to intrest younger viewers, but towards the end of the movie, they got better.Well worth watching and I might even watch it again with my GF.",
    "93": "I'm a close to 40 year old man and I can tell you I'm not the target audience for this flick watching it alone.The movie is korny and boring amounts of predictable but I managed to watch it through just waiting for some 'ha ha' for adults too.This sadly never came to fruition but the movie is watchable if you have to do it with your 10'yr old kid on a saturday family night.Charecters were build up descently well and the acting from the main cast was quite good. Even thought the side plots were tied together pretty nicely.The combat scenes were just not believable for any adult to watch but as a family time killer it's not a horrendeously bad flick either.Sadly for adults it's a snoozefest and the real ha ha's never come..",
    "94": "I liked the beginning but almost bailed during the middle section when things got a bit slow among other major gripes. I took a day off and picked it back up and made it to the final third which had a bit more to chew on. I was on board at that point and things got at bit more fun and interesting, relatively speaking.I think the idea with this film was to try to repeat the success of Instant Family, which was a great film. The cliché is you never know until you try and in this case The Family Plan tried and came up a little bit short but I still liked it.There were some decent performances in this film, although not from Mark. I'm not sure what happened, but he seemed zoned out during this. Maybe he was busy managing the film and not focusing on his acting? A subjective thought, perhaps.Ultimately the film wraps things up nicely with some feel-good scenes.One major flaw I will point out is that the film seems to be leaning towards the family-friendly direction, but has various aspects that will not work for most families. Quite a shame, because the message is reasonably good and with just a tiny bit of editing this would have been a fun family night film for even younger teens. As-is, it's more older teen and adult. Probably depends on whether you're raising the next generation that will build up society or try to tear it down...",
    "95": "I knew the premise for this movie, but did not see the trailer, which would have shown what this movie was going to be like; but instead, all I knew was that it starred Mark Wahlberg and that it was a PG-13 action comedy that involves a family man secretly being an assassin and his family does not know who he really is. I will not lie that the movie did entertain me and there were things that worked in the movie's favor, but the movie The Family Plan (2023), though entertaining, could have been better because of the potential of some the things it does; along with it also having some good performances from the main actors playing the family, with there also being a standard villain.Mark Wahlberg was not bad in the movie as a normal suburban dad secretly being an assassin; he is good at taking care of his family, even if the son and daughter do not agree with some of his choices like to keep them off technology, but he does try his best when doing hand to hand combat to not kill someone. He was not bad as an assassin, and you can tell he has skills, though I would have liked an in-depth backstory on how he became an assassin instead of dropping it near the end in the third act; the rest of the family was ok with the wife played by Michelle Monaghan being not bad, and the three kids were fine with the older brother and sister at times being annoying. They do a lot of bonding on the trip, and the dad helps his son and daughter in a way that can help them, like the son being a pro at playing video games and the daughter getting over a bad boyfriend she had with her finding a college.The villain is someone who knows the dad's past as an assassin, but he is still a standard villain who does not do much and could have been better; there is also a reveal of a character who I did not care for that much and forgot was in the movie. The action scenes could have been better than they were by taking out the multiple cuts they have, and making it easy to see what it is happening, other than that the action scenes are ok and fun enough; there are a lot of things that had potential which only made the movie good enough with only an occasional funny moment and moments that can seem similar to other movies that have a similar premise.I will not say The Family Plan (2023) is bad, but I will say it is entertaining enough and the performances are not bad, also I would say this movie had some potential to being better than it was. The villain could have been better, it could have been a bit funnier than it was, and the way the action scenes look is ok but could have been when comes to seeing what is happening; this is not a movie to rush and see on the Apple TV+ streaming service, so do not expect a great movie, just expect a movie that is good enough.",
    "96": "\"The Family Plan,\" directed by Simon Cellan Jones and starring Mark Wahlberg, is a cinematic endeavor that falls short of its ambitious goal to adapt the essence of \"True Lies,\" originally starring Arnold Schwarzenegger. The film, intended as a comedic action flick, unfortunately, misses the mark in delivering humor, leaning heavily into a more generic and uninspired narrative.The plot, reminiscent of an 80s glorification of the American lifestyle and capitalism, is riddled with predictability and lacks depth. The film's attempt to recreate the vibrancy and charm of its predecessor is overshadowed by a series of unrealistic action sequences and notable plot holes, detracting from its overall appeal.Wahlberg, while a competent actor, struggles to infuse the necessary charisma and comedic timing into his role. The script's brainless approach and failure to innovate or offer fresh perspectives on the genre leave the audience with a sense of déjà vu, failing to capture the originality and wit of \"True Lies.\"In essence, \"The Family Plan\" serves as a reminder of the challenges in reviving classic themes without adding substantial new elements or perspectives. Its lack of humor, combined with a predictable storyline, makes it a forgettable addition to the action-comedy genre. The film's over-reliance on unrealistic action and an 80s nostalgia that doesn't quite resonate with contemporary audiences further dilutes its impact, resulting in a movie experience that is, regrettably, more tedious than entertaining."
}