{
    "0": "\"Migration\" is an excellent animated film whose script tells a story with familiar and educational touches, setting an example of dignity towards immigrants, all from the perspective of the ducks. The animation is tremendous, resulting in beautiful visuals, as well as amazing character design. The voice work of the actors is perfect, giving charisma to their characters and highlighting their personalities. The editing work is highly successful and intensifies the drama and comedy when they are required on screen. A production that makes the most of its potential and successfully achieves a story of family unity and dignity.",
    "1": "This has to be one of the better kids animations of the year or even a few years. It isn't pretentious and doesn't bang on the drum of morality. Rather its pure fun and hijinks.It starts off with the dad trying to scare the kids out of ever wanting to leave the pond, but in a very fun and funny opening. All is good for over protective dad until some exotic ducks land for a stop on their migratory flight south and fill the kids and mum with ideas about migrating to Jamaca. Dad tries to stop but is convinced to overcome his fears and take a chance.And that is the only moral part of the story, take a chance in life and face your fears and prejudices.From there on it's one rollercoaster of aride with lots of fun bits.Also, unlike a lot of animations, you aren't playing the game of oh that is such and such voice. The only really recognisable voice is Danny Divitto, who is perfectly cast as grumpy uncle Dan. The kids are relative unknowns but are perfect in timing and emotion.The animation is colourful but doesn't overwhelm the film either like some animation do.It also isn't overly long which is great and kids will love it and parents get lots of laughs.Yes it's not ground breaking but that's not the point.A perfect family fare, perfect for Christmas/ holidays.",
    "2": "The animation is colorful, action starts relatively early and is well spaced-out. The jokes were appropriate. My kids are aged 10 and 14, they both enjoyed it. There were kids of all ages in the theatre and I could hear laughs all the time. Perfect for the holidays and also has a great soundtrack.The storyline is obvious in the title, but the journey was full of surprises enough to keep you on the edge. There were useful lessons to be learned and a morale to the story.The last film I had seen at the cinema was Super Mario and \"Migration\" has delivered the same clean family entertainment that we have been missing.Highly recommended.",
    "3": "Wow! Simply a wonderful new animated film from Illumination! Everything is wonderful here: a warm, pleasant story and an interesting plot; colorful graphics and animation; cool and cute characters; voicing the characters by such a cool, stellar cast; good music and soundtrack; good timing of the cartoon, it is not too short and not too long, but manages to tell us the whole story from beginning to end; and most importantly, this cartoon has a soul, it's clear that every effort was put into it and the result was a very high-quality product! Recently, this is one of the few cartoons that you will want to watch again! Thank you!",
    "4": "I couldn't resist the chance to watch \"Migration\" ahead of its Boxing Day release date. From start to finish, my love for \"Migration\" only grew stronger. The film is an absolute delight - it's not just super cute and funny, but it's also packed with heartwarming moments that tug at your emotions. The characters bring such warmth and charm that you can't help but be drawn into their world.Beyond the humor and cuteness, \"Migration\" delivers a great message to stop waiting for life to happen to you. The animation is nothing short of fantastic, bringing the story to life with vibrant visuals and captivating sequences. \"Migration\" is a perfect blend of laughter, heart, and visual brilliance that makes it a must-watch for animation enthusiasts of all ages.",
    "5": "This animation just has it all! It is so much better than latest Disney and Pixar (well maybe same level as Elemental). It has a unique style and in 90 min it makes you laugh, cry and even scared and nervous at times, and I'm not a kid. Such a heartwarming story about what it takes to just do something unusual and to leave things you used to behind and discover something new. This movie can also serve as example to us. We are keep waiting comfortably for the right moment to take a leap that life just goes by and we end up at the same place we started but there's just so much to do and see as long as we are just a little Optimistic. I went to the cinema with my kids didn't know what to expect and I went out filled with so many positive emotions! Worth it!",
    "6": "Super sweet film for young and old without annoying modern faekal humor and finally in a normal length again. Absolute recommendation! We had a lot of fun. The duck family goes on a long journey via New York to Jamaica and experiences a lot of adventures. They get to know pigeons and free a parrot. Even my ten-year-old boy was thrilled.Super sweet film for young and old without annoying modern faekal humor and finally in a normal length again. Absolute recommendation! We had a lot of fun. The duck family goes on a long journey via New York to Jamaica and experiences a lot of adventures. They get to know pigeons and free a parrot. Even my ten-year-old boy was thrilled.",
    "7": "When I First Heard About This Movie In April Of 2023. I Watched The Announcement Trailer And My Heart Knew, It Was Like A Homage To Rio 2. One Of My Favorite Films Of 2014, And I'm Not Wrong. Go Ahead You Can Watch Both Of Them And See The Similarities If You Want To, But Hey That's Just My Opinion. Anyways, If You Want Your Children To Have The Same Experience As I Did With Rio 2 Growing Up. This Is The Perfect Movie For You, Like I Said It Has All The Similarities To That Movie As Possible. The Brother Sibling That's Fearless, The Mom Who Is Motivated For Adventure, The Helicopter Parent Dad, And More. This Is The Perfect Gift For Any Child In The Glorious USA.",
    "8": "Following the recent success of the Super Mario Bros movie by Illumination, I eagerly anticipated their newest project, 'Migration.' I must note, this film took five years to make and faced postponements due to COVID. All the actors recorded their lines separately, never meeting, a testament to their remarkable chemistry on screen.The standout performances include Elizabeth Banks as Pam, the Mother, Keegan-Michael Key as Delroy (an enjoyable Jamaican bird with a surprisingly good Jamaican accent), and the surprising portrayal of Danny DeVito as Uncle Dan. Leading the cast is Kumail Nanjiani as Mac, the dad. Awkwafina's appearance here as a quirky side character named Chump is much more enjoyable than her recent portrayal in Disney's 'The Little Mermaid.'Even the children in this movie shine, and Carol Kane's surprise standout performance as a creepy crane is reminiscent of her role in 'Scrooged.' Setting the cast aside, the main antagonist, a ruthless chef, pursues the birds on their first migration to Jamaica. The character, voiceless yet comical, adds to the unfolding wacky shenanigans.This movie exudes the essence of a classic road trip but in the air. Illumination's animation prowess shines, rivaling even Pixar. Watching it in 3D didn't notably enhance the experience; its beauty in 2D is undeniable. Directed by Benjamin Renner, a French cartoonist, this film is a visual delight, enjoyable for kids, and a fun family road trip for all!While not a groundbreaking head-turner, 'Migration' is a charming addition to Illumination's catalog, offering something different and original. The movie's universal appeal across ages in the theater speaks volumes about Illumination's journey in delivering family-friendly entertainment that captivates everyone.",
    "9": "Gosh, this is awful. Cliched full, seen this plot repeated ad nauseam. Duck bill creatures are not innately cute. It had the requisite poop joke. Animation wasn't particularly innovative. There were only 6 people in theater, so I guess there's no buzz on this. Did not hear any laughter to the intended lighter moments. The endangering scenes were too long and caused the movie to drag. When asked how she liked the movie my nine-year old shrugged her shoulders.Aggravating was that they played a short Minions derivative that was actually worse. So the actual movie didn't start until almost 30 minutes after the scheduled time.",
    "10": "Overall, not a half bad illumination movie.The movie's environments were beautiful. Easily my favorite part of the movie. I loved the watercolor-esque trees. Also, the designs of some of the humans, especially the main antagonist, are pretty nice and creative. The jokes weren't nearly as \"cringey\", and landed for the most part. (hah, get it, cause the movies about ducks... migrating). The humor in this movie feels more family-focused, rather than purely for the kids.As for the negatives, the story is fairly linear, and not too interesting. The overall theme is very obvious, so it isn't too deep. All in all, a typical illumination movie.Overall, a decent Illumination movie. Just plain family fun. If you want to be fairly entertained, and laugh with your kiddos, this is a good movie.",
    "11": "GREAT VALUES, LOVELY STORY, NO EXPLICIT THEMES!! I honestly took a step back when I first saw this. I am ALWAYS extremely critical of movies lately, especially since recently Illumination, Disney, and even a recent Dreamworks movie have fallen flat, but wow!This is truly a family film that is appealing to ALL audiences. Kids have laughs at gags, adults have entertainment from parenting and general themes, and they even poke fun at grandparents, who still are made out to be cool and fun-loving by the end.From both a filmmaker and huge movie fan's perspective, it is extremely refreshing to see a kids movie have good values, no explicit themes, and still be very entertaining! The story and plot was well worked out and everything made sense. The music was fantastic (a solid original score, no spammed pop music like most kids movies). The animation was adorable and very enjoyable to watch. It was also super refreshing to see new/underground talents showcased! A lot of less known names but a fantastic job done (especially the voice actors)!I'm really impressed and wish to express from the bottom of my heart, thank you for making such a great family film, creating a safe space for families to enjoy a movie without oversexualized themed, over the top toilet humor, extreme violence, etc. 9/10!!!",
    "12": "I went with low expectations about this film because the trailers looked like the movie wasn't good, but after watching it i can say it's really worth the ticket.Visually there's nothing to complain about here the ducks and all kinds of birds that appear here look nice and are really expresive.Soundwise nothing outstanding, decent, you can hear every character clearly because all was mixed well. The ambient for all scenarios is done pretty well too (Swamps, cities, forrest)Storywise This is what i liked the most because it's not that dumb for an illumination movie, it has drama and funny moments throughout the entire run, but nothing too deep, just enough to be entertaining.I would say if you go alone or with your family you'll have a good time.",
    "13": "I haven't been a fan of Illumination Entertainment movies as the only movies I have enjoyed from them were \"Despicable Me\" and \"Sing 2\". But many of their works really are just for kids and most of their style and writing is bland and has gotten on my nerves. Migration is new and different from their other works but as a whole, it was average at best.Throughout, many of the animation colors, structures, and models are pretty good as Illumination does a really good work on their animation designs. Including the models, the movements and the features. There are some solid sound designs as well. The writing from Mike White, who is known for his writing works on School of Rock, Year of the Dog, Brad's Status and Nacho Libre, isn't really special and while there are some ideas that I thought were pretty cool, it felt too generic and didn't feel as charming as it thinks which made it pretty boring. People say that it's trying to be original but it almost feels like a more unspecial version of \"Rio\". The director Benjamin Renner has created \"Ernest & Celestine\" and \"The Big Bad Fox and Other Tales...\" which are really great animated stories but unlike his previous works, Renner's direction and charm feels lacking and lost.The voice performances are solid as Kumail Nanjiani and Elizabeth Banks provide some solid emotions and vocal performances. The child voice performances honestly kind of got on my nerves. Most of the characters were typical and not really interesting, the humor is a bit stale and the dialogue is a mix of having some clever and some really awful lines. It's definitely for the younger audiences as my siblings did enjoy it which I am glad about. I do appreciate Illumination Entertainment making something original then their annoying works of Despicable Me and Minions stuff but the generic style doesn't do it for me.Overall, it's good for the children and the average internet user who loves animation but I feel like I should just stop watching movies from Illumination Entertainment at this point."
}