{
    "0": "There is no other movie quite like Scott Pilgrim. It's like watching a comic book video game put to screen. The action is insane, over the top and super high energy with wonderfully creative framing and visual cues.Going back and watching it again, it's amazing how many people are in this before they were huge. Brie Larson, Chris Evans, Anna Kendrick just to name a few. The visuals still hold up, as does the pointed commentary on hipsters.Great music, great action, great performances. It's all around a fantastic experience. The only real downside to me is that it's based on something with a lot of content and in an effort to put a lot in here there are some moments that feel... Off. Areas where the graphic novel likely went into great detail yet the movie has to just sort of pop it in and run with it. These are mostly minor but it still prevents this from being absolutely perfect.",
    "1": "Scott Pilgrim (Michael Cera) is a slacker hipster in a garage band who's dating high school girl Knives Chau (Ellen Wong). He is self-absorbed and willing to abandon Knives as soon as he meets Ramona Flowers (Mary Elizabeth Winstead). Before Scott can date Ramona, he must defeat her seven exes.Scott is a douche. The biggest problem for me is his unlikeability. It runs counter to Cera's usual good guy persona. Everybody is blasé and sarcastic which get some good laughs.The best thing about this is the 80s video game visual motif. Edgar Wright brings a fresh hip-without-the-irony sensibility. It also uses Toronto not as New York or as anything other than Toronto. It's refreshing and unique in a world where almost everything is a sequel.",
    "2": "I really enjoyed Scott Pilgrim vs.The World, and consider it one of my favourites of the year if not the best. The film is shot in a unique way and looks wonderful and the music is cool with lots of energy. Edgar Wright does a superb job directing the film, the film is filled with humour and good humour at that, it goes at a cracking pace and is compelling throughout and the characters are appealing. The acting is great, Michael Cera gives one of his better performances(only his performance on the brilliant sit-com Arrested Development is better in my opinion) and he is well supported by some very talented co-stars.Overall, a great movie and one of my personal favourites of its year so far. 9/10 Bethany Cox",
    "3": "It's actually really good fun. Although I felt near the end that it had too many fight scenes in it for its own good.",
    "4": "I came to this films with no preconceptions of it as a movie and I have to say I am glad. I guess I was expecting another Michael Cera movie about some dopey kid in love. And thats what it is ... but done in a unusually great way. For anyone under 25 brought up on gaming (I am 30 and not) this will be just brilliant. The style of the movie with its \"end of level baddies\", game-play set-up and visuals are a welcome and refreshing twist on what could have been a hum-drum movie. The music rocked, the comedy was fast, slick and laugh out loud ... I'd definitely recommend this to my friends looking for something that little bit special.",
    "5": "Scott Pilgrim(Michael Cera) is a 22 year old slacker, who is in a band and lives with his gay roommate (Kieran Culkin),and life seems to be pretty predicable. Until he meets Ramona Flowers( Mary Elizabet Winstead from Sky High, Final Destination 3, and Live Free or Die Hard). Scott feels they could have something, but Ramona is unsure, but gives in and starts going out with Scott. But remember the saying your past comes back to haunt you, in Ramonas case comes in the form of seven evil exes with superhuman powers. In order to win Ramonas love Scott must defeat them, but the question is will he? Entertaining to say the least, Michael Cera is good, so is Mary Elizabeth Winstead. Co stars don't disappoint either, Chris Evans, Brandon Routh, Mae Whitman(Hope Floats), Alison Pill, Anna Kendrick(Up in the Air), and Kieran Culkin. The video game effects are also awesome. Scott Pilgrim vs the World is one entertaining ride.",
    "6": "Since opening opposite Sylvester Stallone's The Expendables and Julia Roberts' Eat Pray Love, Scott Pilgrim vs. the World hasn't had a chance to hit it big at the box office. I guess that's because the two pictures I just mentioned have something of a pre-sold audience while this one only has an appeal to those that have read the graphic novels this movie is based on. I'm here to say that despite not having read the source material, I very much enjoyed this movie! Oh sure, it took a while before I got into it but once I did, I never allowed myself to question why things happened the way they did, I just let myself-as one character said-\"be in the moment\". Director Edgar Wright put all his creative stops here both visually and dialogue-wise that there were times I wish I could've rewinded some passages just so I could hear and see certain scenes again. So on that note, Scott Pilgrim vs. the World comes highly recommended.",
    "7": "I have a feeling that many young people would go ape for \"Scott Pilgrim vs. the World\". It involves both young people, and its video game elements will be greatly appealing to youths. However, I think older people (like myself) will be somewhat let down by the movie.Before I get to criticizing the movie, let me say that I did feel the movie had SOME positive elements. The visual effects are top notch, successfully crossing live action with what you might see in a video game. There are also a lot of small touches here and there that are amusing, like defeated opponents transforming into coins.The visual look of the movie combined with those small touches ALMOST makes up for the flaws in the movie. The source of all the flaws is the same: the script. The script is really inadequate in a number of areas. The biggest flaw is that except for the character of Knives, NONE of the characters are sympathetic or appealing. They come across as thoughtless and kind of dumb, especially the title figure. Another script problem is that much of the movie consists of it repeating several times stuff that has already happened. The movie becomes monotonous after a while. Also, the ending is very frustrating, with Scott (in my opinion) choosing the wrong person to be with.I have not read the graphic novel series this movie is based on, but my guess is based on its length, a LOT of character development and story was cut out in order to make the movie last a little under two hours. So if you have a choice, I would advise you read the multi-part graphic novel instead of seeing this movie.",
    "8": "As proved by Hot Fuzz and Shaun of the Dead, Edgar Wright is a great filmmaker. His techniques may not have the polished precision that Christopher Nolan normally brings to his films, but Wright's energy and love for the material that he is directing and the way his enthusiasm floods the screen, in my opinion, makes him a great filmmaker. Never has this been more evident than in Scott Pilgrim Vs. The World, his best film to date. It won't be for everyone (my dad hated it), but I loved it. It's what (500) Days of Summer would have been if it was filtered through the eyes of Quentin Tarantino.22-year-old Scott Pilgrim (Michael Cera) is a slacker. He lives with his gay roommate Wallace (the hilarious Kieran Culkin), goes out with a 17-year-old with the awesome name of Knives Chau (the adorably quirky Ellen Wong) and spends a lot of time rocking with the fellow members of his band, the Sex Bob-ombs. One day, his life is turned upside down by the arrival of mysterious Ramon Flowers (Mary Elizabeth Winstead). Drawn to Ramona to the point where he dumps Knives, Scott discovers that if he is to win the hand of this fair maiden, he has to overcome one little obstacle. Well, seven, as Ramona has seven evil exes who will do anything to destroy Scott and his relationship with Ramona. Finding his lazy lifestyle under threat, Scott must prepare to battle for Ramona and bring out the \"L\" word; no, not that one.What I love most about Scott Pilgrim is the way in which it constantly surprises and delights the viewer. This isn't your typical, generic romantic comedy; this is a smart, very funny romantic comedy spliced with the genes of a bad-ass martial arts flick. The screenplay scores big time; the dialogue is sharp and hugely entertaining enough to keep even those who've just gone to this movie for the action spellbound, and there are too many memorable characters to count with your ten fingers. When the action arrives, it is phenomenal. Each of the villains have unique fighting styles, assets and weaknesses, making each fight scene interesting. Plus, even though the men outnumber the women in this movie, the women don't just stand on the sidelines; they kick ass with the best of them, too. The action is right up there with the Kill Bill movies and The Matrix, but did those movies have Michael Cera fighting off a bunch of goons with a flaming sword? I think not.Which brings me to the performances, which are terrific across the board. Whilst Cera has made a career out of portraying awkward, dopey characters, his goofy charm fits the role of Scott Pilgrim perfectly. He also brings a darker, often unsympathetic edge to his character; Scott is cowardly (observe his reactions in the scene where Knives, still in a relationship with Scott, and Ramona, having just started a relationship with Scott, first meet), whiny and manipulative (I love how he tricks some of the exes into their own defeat). Also on a different note to his usual performances, he becomes an unexpected champion warrior in the action scenes. As Ramona, Winstead is appealingly street-wise and sympathetic; she's a girl who is trying to flee from her past, but who must confront it if she wants any hope for a future. Culkin and Wong steal their scenes, whilst more strong support comes from the likes of Twilight's Anna Kendrick as Scott's sister Stacey, Alison Pill as Sex Bob-ombs drummer Kim and Aubrey Plaza as gossip Julie. Out of the evil exes, Chris Evans AKA The Human Torch/Captain America and Brandon Routh AKA Superman are especially fantastic as movie star Lucas Lee and vegan - powered (!) bass player Todd Ingram respectively. However, my favourite of the exes has to be the ace Jason Schwartzman as the big, bad and oh so cool No. 1, Gideon Graves. He is an awesome character, with one of the coolest lairs that I have seen, and yet he's such a sneering weasel that I couldn't help but laugh at him.Scott Pilgrim is never anything less than amazing to look at. The cinematography by Spider-Man's Bill Pope is magical, moving between gritty realism and gorgeous style (a scene where Scott and Ramona simply walk through the snow is captivating). The visual effects, as I said before, are just perfect. Whilst some people may find the film's style difficult to adjust to, I loved it from start to finish. As with everything else in the movie, the visual effects are original, hysterical and pitch-perfect. All of the details, such as a pee bar appearing as Scott goes to the toilet and depleting as he does his business, or when Chau's love for Scott floats through the air in pink lettering that he brushes aside, are just right within the context of this movie. The movie isn't bad on the ears either, with wonderful sound design and an electrifying soundtrack.I adore this movie. I couldn't have asked for more from it; it manages to be something entirely different, whilst also striking truthful emotional notes. Under all of the mesmerising visual effects and mad fight scenes, this is essentially a journey of self-discovery for its main character, a chance for him to develop as a person and right his life. It is this journey which gives Scott Pilgrim the ever-crucial humanity it needs to succeed. The final shot is unexpectedly beautiful, a truly poignant comment on how the uncertain future is better faced together. Everything about this movie is so spot-on that it isn't just one of the best movies of the year; it is a great movie, full stop, and will, without any doubt, come to be regarded as a classic. For me, Scott Pilgrim is a definite K.O.",
    "9": "It's been a while since I watched it and I forgot how much I love it. If like me you're into comic books and video games, you will absolutely have an amazing time. And even if you don't, you might find it silly but the great cast, original storytelling and top notch special effects should keep you extremely entertained!",
    "10": "This film made me realize that I have this incredible ability of falling in love with fictional characters in the first 30 seconds they're on screenLike, Jesus Christ, Ramona Flowers is the ultimate crush.And also, the soundtrack is absolute fire!",
    "11": "Scott Pilgrim (Michael Cera) is in his early twenties and has started dating a girl named Knives Chau (Ellen Wong) who is still in high school. The news circulates around all of his friends including his gay roommate Wallace (Kieran Culkin) and his nosey sister Stacey (Anna Kendrick). At first Scott enjoys the company of Knives. She watches his band play during their practice sessions. At a party though Scott meets who he believes is the girl of his dreams in Ramona (Mary Elizabeth Winstead). He opts to go out with Ramona instead and decides to breakup with Knives. Yet when his band is performing at a gig, Scott is confronted by one of Ramona's seven ex-boyfriends. This leads to a series of video game style fight sequences where Scott must take on each of Ramona's exes, many of which have superhuman powers of their own and defeat them so he can date her properly.Although Scott Pilgrim vs. the World has been adapted from a 2004 graphic novel series, it is to a fault like a computer game. It's been directed by Edgar Wright, who previously worked on Shaun of the Dead (2004) and Hot Fuzz (2007). He has chosen to shoot the film with an overwhelming number of visual tricks that look to have come straight from the graphic novel source and the arcades machines. When someone knocks on Scott's door the onomatopoeic words appear on the screen. When Scott kisses Ramona tiny hearts trickle out between them. During the fight scenes icons popup to reveal Scott's high scores, like an arcade game. But Wright seems too excited by these gimmicks and they are used too frequently. Rather than being charming little treats for the audience, they quickly become excessive. The film's rapid pacing is also problematic. As the director and one of the film's screenwriters Wright seems highly intent on moving through the film's opening quarter as quickly as possible, with rapid cutting hurling the audience from one scene to another. Given the speed of the first act and the array of video game aesthetics thrown in, the rest of the film desperately lacks urgency. It fires all its shots at once and then there is no momentum to build upon with any of the fight scenes, leaving the movie at a monotone rate. Scott Pilgrim already knows how to fight too so there is no character development or exposition here either. Each fight sequence feels no more significant than the last. It makes for extremely repetitive viewing, with at least three exes too many and just not enough substance.Michael Cera has potential as a comic actor but the script here does not allow him to develop anything new beyond his trademark dopey persona. Given how engaging he has been in films like Juno (2007), it is surprising how dislikeable he is here. The way that he treats Knives and gets away with it makes him less appealing as a protagonist. It does not help that Cera is forced to deliver dialogue that is entirely self- conscious in its attempts to be hip. No one has anything interesting or funny to say here. When his sister Stacey asks him if he really thought that he had a future with Ramona he replies thickly: \"Like with jetpacks?\" There is an overdose of style here and not an ounce of sincerity. A lot of the other performers are wasted too. Anna Kendrick, a talented actress from films like Twilight and Up in the Air (2009), is barely seen and no matter how cool and alternative Winstead's hair looks her character is still underwritten. It's disappointing that the exes fail to reveal anything about her past. Jason Schwartzman has only a small role as the film's central baddie and it would have been nice to see more of him in the film because he is a regularly enjoyable talent on-screen.Despite the efforts of director Edgar Wright to bombard the audience with an array of visual tricks, there is little by way of substance to be found in Scott Pilgrim vs. the World. Its computer game counterpart probably soars on its artistic flair but this film disregards too many of the basics of screen writing. It's pacing runs on a single, exhausting note and does not give enough urgency to the repetitive fight sequences. The lack of a substantial narrative here diminishes any possible depth the performances might have had too. It's so intent on being hipster cool that it forgets about keeping it real. Exit game.",
    "12": "Edgar Wright did it again. I've almost forgotten his name but look, now he pulls me back in.This is the kind of smart-modern humour that I enjoy so much watching. It takes its power from the cleverness of the dialogue, message and the plentitude of references to games and movies - as well as from its unique style - instead of extra ridiculous gestures or ''cringy'' looks. I'm sure it's not flawless in terms of narrative or character development but I was very pleased and had a fun time watching the movie and was able to get over its flaws.A 9,5 out of 10.",
    "13": "It was showing on Netflix streaming, and I had nothing else to do in this record hot Texas summer, so I watched it. I have to give credit, it is a very interesting concept and much of the dialog is snappy and interesting. But overall it is not the kind of movie I enjoy.Michael Cera is Scott Pilgrim, musician wanna-bee, and mostly a social misfit. Shy and with low confidence, he has a girlfriend, Ellen Wong as Knives Chau, that is 5 years younger, and underage. When he discusses this with his friends Scott is quick to point out that they haven't even kissed, and he is sometimes tempted to hold her hand. But the real action starts when Scott gets his eye on pretty Mary Elizabeth Winstead as Ramona Flowers, and Ramona seems to like Scott also. But Scott soon finds out that he has to fight and defeat Ramona's 7 evil former lovers if she is to be his.The first couple of fights are interesting but it soon became more of the same. I found myself just waiting for them to be over so I could see where the new romance might go.Not really my kind of movie. And I am not a big Michael Cera fan.",
    "14": "This is honestly the best movie I've watched this weekend, and I watched Tenet this friday. This film has it all: romance, comedy (duh, it's a romcom), music that not only fits well with the movie but is great on it's own, just enough pop-culture references, great writing, top notch CGI (a bit lacking on some points but hey, this one came out in 2010) and on top of that an amazing cast that brings it all together perfectly. Because it's a comedy there were a few jokes that didn't grab me, but art is subjective. This movie also has great vibes, I go pretty hard on that.",
    "15": "SCOTT PILGRIM VS. THE WORLD (2010) *** Michael Cera, Mary Elizabeth Winstead, Alison Pill, Mark Webber, Johnny Simmons, Ellen Wong, Kieran Culkin, Anna Kendrick, Aubrey Plaza, Satya Bhabha, Chris Evans, Brie Larson, Mae Whitman, Brandon Routh, Jason Schwartzman, Keita Saitou, Shota Saito, (Voice: Bill Hader; Cameos: Thomas Jane, Clifton Collins Jr.) Edgar Wright's groovy adaptation of the graphic novel by Bryan Lee O'Malley (co-scripted by Wright and Michael Bacall with lots of savvy and smarts to spare) about a self-involved slacker cum wanna-be rock-star (Cera at his most winning sad-sack best as the titular anti-hero) who goes ga-ga for It Girl, Ramona Flowers (babe-licious Winstead with Day-Glo wigs for each mood), but must face her 'seven evil exes' in fights-to-the-death ala video game duels. Fast-paced and at times too-full-of-itself with its quirky graphics and cartoonisms (sound effects and \"Batman\" TV show-like titles popping up every so often) yet has its own irresistible charms (i.e. fine chemistry between its unlikely paramours and some great inside villains – genius casting \"Superman\" Routh as a vegan powered 'ex' and Schwartzman epitomizes the term 'rat bastard'). Colorful, comic and extraordinary.",
    "16": "Michael Cera, Mary Elizabeth Winstead, Ellen Wong and Kieran Culkin star in this 2010 action-comedy based on the comics/graphic novels. Cera (Superbad) plays the title role of Scott, a nerdy, American teen who plays in a band with his pals and is trying to get over a recent break-up with a girl. He starts dating Asian girl, Knives (Wong), but eventually falls for other girl, Ramona (Winstead) and tries to break it off with knives. Scott learns that Ramona has 7 ex-lovers he must battle with if he wants to stay with her. Culkin (Home Alone) plays Scott's gay roommate, Wallace. Chris Evans (Captain America), Brandon Routh (Superman Returns), Brie Larson (21 Jump Street) and Anna Kendrick (Pitch Perfect) also appear. This is a pretty good film that pokes fun/pays tribute to comic books and videogames. The cast is decent and there's neat effects. Check this one out at least once.",
    "17": "(Flash Review)So yah, at its core it is the typical story about high school to college social situations, awkward relationships and friendships and video games but it was so unique, clever and creative that it was highly entertaining. Scott breaks up with his younger girlfriend to date someone he thinks is out of his league. He now must battle, in a mix of video game and comic book styled battle scenes, her seven x-boyfriends. Will he advance to the next level or be KO'd? Along with a slew of humorous and cringe worthy boy/girl dialog and interactions, this was produced with strong creativity. From editing, graphics, audio, scene transitions and unique story. There was hyper originality with transitions so smooth, clever and unexpected it probably worked perfectly for its youthful core target viewer. This made the most of the medium of film and will make you smile.",
    "18": "Saw this back when it was first released back in 2010 & loved it! Seen it twice in Cinemas back when I was 15 1/2 & since then have watched it religiously on DVD! But I've just returned from a 10th Anniversary screening & thought I should write a review on this epic film! After 10 Years Scott Pilgrim Vs. The World has stood the test of time & seeing it on the big screen for the first time in 10 Years never mind on DVD is proof of that!The plot centers on a socially awkward 22 -Year-Old Scott Pilgrim who while dating 17-Year-Old Knives Chow falls for Ramona Flowers, but has to defeat her 7 evil ex's if the 2 shall date! Along with his band Sex Bob Omb he finds himself on a life or death quest to be with Ramona! The girl of his dreams!That's the plot but the film has a pack-man 80's gaming theme laced into it along with witty, sarcastic/dry/droll humour which really makes the film work! The fact that it has a re-watch factor & never gets old is in itself ace! The mix of sci-fi &real life also works well!The action, music & ex's themselves are ace! Garbage Man has to be my all time favourite though! The scene with the instrumental version of the song playing when you first see Ramona Flowers gives me chills every time! Ace!Overall you'll love this film once you see it! 9/10!",
    "19": "The fact that Shaun of the Dead and Hot Fuzz director Edgar Wright has crafted a tremendously stylish flick isn't all that surprising. That he managed to match that style with just as much substance is quite extraordinary though. Scott Pilgrim may be live-action anime complete with hyper-chic, arcade-esquire visuals, but these awesome effects wouldn't carry your interest for two hours if it wasn't for the intelligent and meaningful tale underneath. That a story of how difficult, and rewarding, love can be is packaged in monumentally fun set-pieces and biting humour is exactly the reason why Pilgrim is one of the year's best films to date.After seeing the trailer I was unsure whether or not I would enjoy the computer game feel of the movie, however, any ambivalence towards the film was dashed immediately once it began. The action – and there is a lot of action – is infused with a unique streak of rambunctiousness that only heightens the experience, most splendidly realised in the clash between Pilgrim and rival bassist Todd Ingram. Furthermore, in Wright's capable hands the subtle tics and icons that are littered throughout the picture stay inventive and amusing, never veering into overbearing or unwelcome territory.In his first feature film without regular acting duo Simon Pegg and Nick Frost, Wright has assembled a pitch-perfect cast, starting with his leading man. Not exactly playing against type, but certainly unleashing his action chops more than ever before, Cera proves yet again he's the go-to guy if you're looking for 'geeky-cool'. Pilgrim's effortlessly likable thanks to Cera, he's outrageously funny without ever playing it up and he wears his heart on his sleeve in a manner that doesn't become whiny or annoying. Put quite simply, if he doesn't win over Ramona by the closing credits you'll be as heart-broken as him.He may be the eponymous hero, but this isn't a one-man show for Cera. The eclectic supporting cast are superb and at times even steal the show. As the hair colour-changing Ramona, Winstead is strangely intriguing and attractive, her enigmatic attitude all the more enticing. Of the numerous splenetic exes, Routh and Evans are the pick of the bunch, the former's vegan guitarist and the latter's egotistical movie star both offering up plenty of laughs. Elsewhere Culkin is hilarious as Scott's gay roommate who'll say what no-one else will, Wong makes for the ideal love-struck high-schooler swooning over Pilgrim and comedienne Plaza provides more of the straight-faced comedy that made her stand out in Funny People.Massively entertaining, Pilgrim delights with its mixed bag of mesmeric goodies.4.5 out of 5 (1 - Rubbish, 2 - Ordinary, 3 - Good, 4 - Excellent, 5 - Classic)",
    "20": "A new adjective has entered the language relatively recently. It is \"twee\". It's a new enough word that the definition of it isn't entirely settled. Well, at least it used to not be settled. That's because Scott Pilgrim vs. The World is the ultimate example of \"twee\". All usages of the word must now be made in relation to this movie. The \"tweeness\" of all things will now be measured on a scale of 0 to 10 where 0 = Lawrence Tierney and 10 = Scott Pilgrim vs. The World. If \"twee\" were Christianity, this movie would be Jesus Christ.Scott Pilgrim (Michael Cera) is a 22 year old feeb who's sponging a place to live off his gay friend Wallace (Kieran Culkin) and platonically dating a sheltered 17 year old girl named Knives Chao (Ellen Wong). He also has a sister (Anna Kendrick) who really doesn't need to be in this story. Oh, and Scott spastically plays the bass in a band alongside a lead singer (Mark Webber) desperate to make it big and a drummer (Alison Pill) that's like a caricature of the Janeane Garofalo role in Romy and Michele's High School Reunion.That's an lot of set-up for a simple yet fantastical plot. Scott meets the woman of his dreams (Mary Elizabeth Winstead) and, despite Scott being the Sarlacc Pit of pathetic nebishness, she likes him. In order to date her, Scott must defeat her 7 evil exes in a series of video game/comic book battles royale.This is the sort of movie that when a phone rings, the word \"RING\" appears on screen. It's the sort of movie that starts imitating an episode of Seinfeld for no reason. It's the sort of movie that constantly references a subplot for the first half of the film, but that subplot turns out to have absolutely nothing to do with the resolution of the story, like a Return of the Jedi where all references to Darth Vader being Luke's father were removed from the last half hour or a Godfather II where Fredo doesn't get killed.Now, Scott Pilgrim vs. The World is extremely well executed, visually creative and occasionally funny. But because there's no unifying theme to its elements of fantasy and because the main character just treads water until an epiphany is forced on him by the script, watching this film is like looking at a merry-go-round. It's fast and colorful but you just get tired of it after a while.One definition of \"twee\" is \"something meant to be ironically cute where all the irony has been removed\". That's Scott Pilgrim vs. The World. There's a self-conscious, unwarranted and unearned distance that's woven through it. The viewer isn't supposed to identify with Scott. You're supposed to self-awarely recognize that you're meant to identify with him. You're supposed to self-awarely recognize that you're meant to nostalgically respond to the film's invocation of 1990s video games. But nothing is ever done with that distance. It's only there to make the people who made the movie and the people watching the movie feel smarter and more sophisticated than they really are.And that's really twee.",
    "21": "Now this was fun. I was all in right from the beginning, when it looked like it would be a character driven drama. Then, it took a turn into hyper realism and you have to decide you want to go along with the stylistic choices or if you can't handle something this different. Personally, I was ready for the ride. There was maybe too much fighting and some people will find the main character unlikeable, but I watch this back happily, and it is one of my biggest favorites. Certainly my favorite comedy of all time, hands down. I didn't mention how awesome the music is, either--almost every song is on my playlist now.",
    "22": "\"Scott Pilgrim vs. the World\" is an American 110-minute movie from 2010 written and directed by Edgar Wright based on the graphic novels by Bryan Lee O'Malley. This is the story of Scott, a young man who falls in love with a girl, but has to defeat her seven evil exes for them to be together. Fittingly with these mission, you can see the film is divided into 7 levels almost and this is where the video game component comes into play. Not only do the characters frequently look a lot like video game characters, but there are also effects and movements in here that really make it obvious that this film is as much of an interface between gaming and filmmaking as it gets. And I must say I enjoyed a lot of it. The antagonists were fairly interesting and the ways in which Scott beats them were just as exciting to watch, but it also needs to be said that the film itself when it does not focus on the video game connection has some fairly weak moments. The major mistake here was casting Michael Cera. He proves without a doubt that he is not lead actor material. He may have been tolerable on Arrested Development, but he simply is not bearable in this film we have here and the fact that he is in basically every scene is not helping matters at all. Kieran Culkin is just as bad in my opinion, plus his character added virtually nothing. Wes Anderson regular Jason Schwartzman was better playing what you could call the big end boss.Mary Elizabeth Winstead's character however, the object of desire, is really great and perhaps the most memorable aspect about the entire film. Aubrey Plaza and Ellen Chau add some solid scenes too, even if the latter's character is definitely overdone a bit. Anna Kendrick is one of the finest actresses of her generation, but has simply too little to work with here playing the protagonist's nosy sister. Back to Cera, his presence, line delivery and also the way the character was written makes it incredibly difficult for me to cheer for him get together with Ramona to be honest. I personally also found it really strange how she indeed developed some kind of attraction for him despite being completely out of his league. Then again, looking at all her ex-boyfriends, she clearly had a tendency to go for losers, so this explains it perhaps. And some of them are almost as unlikable as Scott. So Scott Pilgrim is definitely not Cera's typical role as a likable loser as there is absolutely nothing likable about him. You could quote a dozen scenes for that. It's also one reason why I find the ending so highly unrealistic where it is he who picks her and not the other way around. But yeah, it is another universe and that's how things work there. This is not a Planet Earth movie. I know it is a desperate explanation, but lets just leave it like that.Back to the video game component, occasionally they overdid it in terms of Street Fighter jump and kick moves for example, but apart from that honestly these scenes and gimmicky aspects are the heart and soul of the film. Highly enjoyable for fans of video games as the movie is packed with references to the world of (online) gaming and many of the supporting characters elevate the material by quite a bit. Like these effects I just mentioned, there are also other weak moments, like the device reference towards the end, but it's all no negative deal breakers and it is certainly possible to see the good surrounding all the bad as I believe the good moments are more frequent. However, it is essential that you watch the entire movie exclusively as a fantasy film and do not expect any great romance or relationship comedy. From that perspective it is a failure. I will still be generous and give it a thumbs-up because I remember liking it more the first time I watched it years ago. With a better lead actor, this could have been one of 2010's best, the way it actually turned out it is just one of 2010's better films.",
    "23": "Edgar Wright does it again with another banger and I honestly don't know why I haven't watched this movie till now, but I'm glad I did because it's one of the craziest, sometimes funniest and most stylish movies I've ever seen. And the editing is just amazing. At the beginning it was kinda weird but as the movie progresses through and you get what you're dealing with, it becomes one of the most fun movies you'll ever seen. And the fight scenes are pretty great. The fight scenes kinda reminded me of Legion the tv show, that show is also very creative and cool like this and might even inspired from this movie. All in all a great movie don't miss it out.",
    "24": "Romance meets the 16-bit, arcade world with unbridled brilliance and humor. Wright's visuals and editing win.Screenplay...................................... 10 / 10 Acting............................................... 9 Cinematography............................... 10 Sound................................................... 10 Editing................................................ 10 Score.................................................... 10 Timeless Utility................................. 10 Total.................................................... 69 / 70 ~= 10 Verdict................................................. Masterpiece",
    "25": "Scott Pilgrim vs The World has got to be one of the most underrated movies of all time. How can you go wrong with Edgar Wright? I think this movie has so much more to offer than people perceived it to be. The movie's visuals are the main highlight because Wright uses them to his advantage, and making a very unconventional movie. Not every movie has to be conventional. What makes the movie better are the actors who play the exes, particularly Chris Evans, Brandon Routh, and Mae Whitman. Combining music with action and slapstick comedy, Scott Pilgrim vs The World is a finely crafted movie that makes me wish I would've directed.",
    "26": "This is the perfect movie with perfect cast. I don't even like Michael Cera much, although he was fortunate enough to be in one of the most clever TV shows ever. He's become typecast, but this is one movie which breaks the mold. (Or at least it ignores it and does its own thing.) Edgar Wright has also directed the great movies \"Shaun of the Dead\" and \"Hot Fuzz,\" and he doesn't disappoint with this. I haven't read the anime series this was based on, but I don't really want to, because this is so much better than it could ever be. To be completely honest, the only thing I don't like his how fast Scott's 'pee bar' empties. Nobody can pee that fast, geez.But yeah, everyone should watch this, especially video game fans.",
    "27": "A very interesting movie I really enjoyed watching, my best character in the movie was Wallace, while the worst character was the Chinese girl, it was very annoying, the fights were fun, I felt that the movie was directed at me, I recommend watching it",
    "28": "The movie has no real parallels. It is Napoleon Dynamite quirky, and slightly reminiscent of 60's acid films (which may be the best way to watch this movie.) Scott Pilgrim is in a band with Stephen Stills and a guy name Young Neil waiting in the wings. He is currently dating a 17 year old Chinese school girl who wears Catholic school uniforms. Her name is Knives. They play video games together. Scott has a dream about a girl, then meets her in real life. They start to date and now he finds out if they are to continue dating he must fight (literally) her 7 ex-boyfriends. These fights take on the characteristics of video game battles complete with Batman like \"Zonk\" words, special effects, and magical weapons. The humor is at times laugh out loud funny. The dialogue is extremely clever and witty. Scott also lives with (shares a bed with) a gay roommate (Wallace), although Scott is not gay. Wallace has the ability to immediately text message Scott's sister whenever something happens in Scott's life. He can even do it passed out drunk. If you liked this film you might also enjoy \"Kick-Ass\" which also boasts quirky humor and special fight effects.No nudity. No foul language. Adult situations. WARNING: This film is not for everyone. You will either love it or turn it off after 20 minutes. Instant cult classic.",
    "29": "Scott Pilgrim vs. the World was such a silly and quirky movie that it worked. This was one of those movies that would not make any sense to most people you explained it to. If you tried explaining it and why you like it then you'd look stranger and stranger the more you explained. I found myself either laughing-out-loud or smiling approvingly the entire movie. I enjoyed just about all of the movie from the relationship quandaries of Scott Pilgrim (Michael Cera) to the animated fight scenes. It was all so odd but yet so right. Michael Cera is so plain and deadpan that it makes his character (a heartbreaking serial romancer on the rebound that plays bass in a band) all the funnier. This is an excellent relax-and-enjoy movie.",
    "30": "Many of the reviewers remark this movie mainly appeals to the under 30 set, but it's one of my husband & my favorite movies. We have watched numerous times. We are not into video games or Japanese comics but we know what we like and this movie is just so creative and fun to watch. The actors are all spot on and the director was great and whoever edited this movie was a genius. What a movie is supposed to be pure entertainment.",
    "31": "I did not enjoy this movie very much, although I admit that there were moments in which I was entertained. I enjoy a lot of different types of films, but I don't really care for movies like this one. It's sort of offbeat and cartoony.That being said, it is still obvious to me that a lot of people WILL enjoy this movie. It definitely caters to a certain demographic. And for those who seek out these sorts of films, they will love it. However, as I did not enjoy it myself, I would be hard-pressed to say what is or isn't good about it, and I suppose it doesn't matter what I say anyway. It's just not my kind of film. Do not recommend.",
    "32": "Recap: Scott Pilgrim must defeat 7 evil-exes in order to win the girl of his dreams.Wow. Double-wow. This film packs so many punches into one movie that I'm still reeling from it. The style alone works ridiculously well. Refreshingly fun with killer script & characters (literally). Loved every minute of it.Video game lovers will rejoice, as will those who enjoy being really, really entertained. Great visuals, effects, music.Easily one of my favorite films this year.9/10",
    "33": "I describe this movie as a love story for geeks. While it was amusing, and different, there is really little to set this movie apart from the standard, run of the mill, Hollywood love story. I know many people will disagree with me on this one, but this movie is actually very ho-hum, and is certainly not of the same standard as his previous movies (such as Hot Fuzz). Still, this movie is different and does have a number of elements that impress me. Oh, this movie is also based on a series of graphic novels.To say that Scott Pilgrim is a loser is an understatement. He is the bass player in a fairly ordinary band (sex ba-omb) and at the beginning of the movie is dating a high school girl (Knives Chow), which is emphasised. Obviously this emphasis is because he very quickly meets the girl of his dreams (which is more true than not because he dreams of her the day before he meets her). He lives in a bunker on the other side of the road from where he grew up and shares his bed with a homosexual (though is not gay himself, much to his housemate's disappointment). However, when he meets Ramona Flowers he decides that he must start dating her, and does everything in his power to make that happen. However, she has seven evil exes which are determined to control her future, and that future does not include Scott Pilgrim, so Scott must defeat these exes to win her heart.Scott Pilgrim is a very allegorical movie. Scott does not come across as actually being a warrior type, yet when he confronts the evil exes he becomes a very capable warrior, video game style. I mention this because the film runs like a video game. Whenever he defeats an ex, he gets points and the ex bursts into a pile of coins. As the movie progresses, the points get higher and the coins become substantially more, in line with the exes getting progressively tougher. However, more importantly, it is a film about how Scott goes from being a boy to being a man, and it is through his desire to have a relationship with Ramona that he is forced to become a man. This is key right at the end when Scott gains the 'power of self-respect'. No longer does he measure himself based on other people but rather on his accepting himself for who he is. Self-respect is not necessarily gained through 'fighting your enemy for yourself' but rather the realisation that you are not doing what you are doing for somebody else, or to impress somebody else, but rather you are doing it for yourself.Obviously self-respect is a very nebulous concept and can be very individualistic in many cases. I do things for my brother, but does that mean I lack self-respect? Not necessarily. I do things for my brother because I love my brother and know that if I do not do them, then it is unlikely anybody else will do it. Do I grumble about it? I try not to because I know that my brother is totally dependent on other people. However, self-respect is something that is very hard to come by. I remember talking to a pastor about it once, and to be honest, I disagreed with his line of reasoning. He talked about it as accepting oneself for who one is, however it did not sit right for me because once again the concept was self focused and individualistic. If I was a creep and accepted the fact that I was a creep and continued to be a creep then that is not a good thing.However I viewed it more likely as God-respect. God loves us and accepts us despite what we have done in the past. There is no being a good person to get into God's books because none of us are able to do enough to impress God. God accepts us as we are, usually in our total weakness. However, by accepting God, he gives us the power to turn our lives around and become better people. I know because that has happened to me.",
    "34": "No doubt this would have been a Netflix series now if it hadn't been made already but at least it was choraled and helmed by the most appropriate nerdcool zeitgeisty visionary in Edgar Wright.\nIt's edgy, subtle, sublime video gamey, comicy stuff. A decent and clever adaptation even if some of the magic and spirit of the comics is lost, but I guess something else is gained; The cast for example and the creative editing and the library of sound effects and visual references from my past.\nThe film manages to say something about possessive ex partners, baggage, the human condition and growing up. Pilgrim is like no one I've ever seen on film; a narcissistic, weak, lucky, sneaky, cowardly, loveable sociopath and I've met and befriended a ton like him. Not all of them learn the self respect to treat other people better like Scott does.\nIt's a shame that the whole movie leads up to the deleted ending and they bottled it and went with something a little contrary to the themes. Still, damn good fun.",
    "35": "\"It's just such a joy\" said with Michael Cera's innocence Love him as an actor This movie I can't find a single gripe about. It's brilliantly refreshing and and the refreshments feed my soul",
    "36": "Such a fun film. Very offbeat and very memorable. Scott Pilgrim Vs The World manages to capture the feel of comedy, and offbeat feels to a dime. Edgar Wright proved that these films can be great, and knocked everything out of the park. The actors all did great and each gave a feel for there characters as quirky and weird but funny. And also the way its filmed, the video game feel was great. It gave the right feel. Overall this is a fun, quirky, funny film that is highly rewatchable.",
    "37": "Favourite movie of all time. Has been for the past nine years, will probably be so forever. A masterpiece.",
    "38": "I went to see \"Scott P.\" with my 14-year-old daughter and I don't say this lightly: I LOVED IT! And take note: I will turn 55 years old in less than two weeks. I totally understood the movie, because the problems and thought patterns of the characters are timeless, at least in the crowd I ran with way back when. My daughter and I could not stop laughing, and neither could the rest of the audience. I was vaguely reminded of \"Wayne's World,\" but this movie was much better, and far less vulgar. Kudos to the filmmakers for choosing incredibly good actors and fantastic writers. The editing is superb, and you're almost sorry when it ends! We're going back for a second viewing. Bonus: the last evil ex-boyfriend looks like my husband when he was in his twenties! I could NOT stop laughing.",
    "39": "For those who have been trying to figure out which media influenced the scenarists of 'Scott Pilgrim', how about MTV, old 80s video games, comic books and Quentin Tarrantino? There's one other that may only occur to the older population watching this film: Batman, the 60s TV show. Remember all the zany titles which would appear whenever something dramatic happened (titles such as \"Sock!\", \"Pow!\", \"Bong!\")? A similar technique is employed here with Scott Pilgrim but the titles are often inserted for a more farcical comic book effect (for example, when a phone rings, the title \"ring\" zips across the screen). One or two word titles are also utilized to describe each character (so if the narrator mentions someone is 'clueless', it's also mentioned again as a title description). 'Pilgrim' wins points for its original visual style, featuring nifty camera work and spectacular special effects which often makes one feel as if one is inside of a crazy video game.Unfortunately, Pilgrim's story is as bland as the title character. Michael Cera (playing another geeky role) is awful as a 22 year old garage band musician who first dates a perky high school student (\"Knives Chau\") but then dumps her for the more mysterious Ramona Flowers (winningly played by Mary Elizabeth Winstead). Cera's Pilgrim can do nothing more than act like a love sick puppy dog opposite the much more aggressive Flowers from beginning to end.In real life, the enigmatic Flowers would never go for the wimpy Pilgrim who always seems to be kow-towing to her during their many platonic interactions. Somehow, Flowers decides to give Pilgrim a second chance after he defeats her 7th ex-boyfriend Gideon (Pilgrim's ex-bands' new sponsor) in a long-winded fight scene (Flowers is not really 'attracted' to boyfriend #7; actually, he's planted a micro-chip in her brain causing her to fall for him!).That's basically the crux of the Pilgrim plot—our 'hero' must go toe to toe with all of Flowers' evil exes before he can win back the object of his infatuation. The seven confrontations (which include a woman, one of Ramona's bi-flings) are nothing more than a device to stage a series of silly fight scenes reminiscent of Tarrantino's stylized sword fights in \"Kill Bill\". None of it makes any sense, especially when perky and cute Knives attacks Ramona out of jealousy over her relationship with Pilgrim. Should I also mention that Pilgrim is stabbed to death, goes to limbo but discovers he has an \"extra life\" that enables him to return to earth so he can do battle with Gideon all over again.None of the supporting players exhibit any charm. Pilgrim's gay roommate, for example, puts Pilgrim down when he advises Knives not to get involved with him during their first meet up. And then there's Pilgrim's drummer and ex-girlfriend Kim Pine; why exactly does she have a dour expression on her face throughout the film? There's also little humor in the film—one attempt (if you can call it that) occurs with Ramona's third ex, Todd; he's stymied when he's stripped of his 'vegan psychic' powers by the 'vegan police' who have discovered that he's been putting half and half (non-vegan milk substitute) in his coffee.In the end, one can only conclude that 'Pilgrim' is a pointless endeavor. Should we regard 'Pilgrim' as an honorable character after he engages in these violent confrontations with a group of one-dimensional, comic book villains? Even worse is how emasculated Pilgrim comes off as he is led around on a leash by a much more hip Ramona. This is a film strictly for teenagers. Its failure to appeal to an older, more sophisticated crowd spelled doom at the box office in the American market.",
    "40": "To date with the girl who Scott Pilgrim likes, he has to beat seven ex-boyfriends of her!\nIt had the funny development. For example, the psychic battle was happened suddenly and the alphabets of the sound came from the guitar. It was similar to comics! Also, the cool effects like the animes were used a lot in the images!I thought the battle scene looked like the fighting games or rather the movie. I laughed the most in the Bollywood dance scene. But I prefer the live scenes than the battles.",
    "41": "Good fun. Plot is quite basic but direction and special effects are very original and entertaining. Snappy, funny dialogue - screamingly funny at times. Does run out of steam and idea though, and should have ended about 20 minutes earlier.Good performances all round. Michael Cera does his usual nerdy low-self- confidence routine, and does it well. Mary Elizabeth Winstead is spot-on and gorgeous as the love interest. Supporting cast are well chosen - Anna Kendrick, Kieran Culkin, Jason Schwartzman, Alison Pill, Mark Webber, Ellen Wong.",
    "42": "Scott Pilgrim is a 22-year old bass player in a band which has some mild potential. Currently going out with oriental schoolgirl Knives Chau, he encounters the mysterious Ramona Flowers and she agrees to go out with him, only for him to discover that this means he must fight and defeat her seven evil exes.I loved this weird and wonderful movie, directed by Shaun Of The Dead's Edgar Wright, and starring Michael Cera (playing Scott as his stock character, albeit less of a loser than usual) and Mary Elizabeth Winstead as Ramona (and a couple of honorary mentions for Ellen Wong as Knives and Kieran Culkin as flatmate Wallace - both very funny). It doesn't conveniently fit any category. It's not a comedy, although it's very funny. It's not a teen romance, although there's a strong element of that. It's not a superhero movie or a computer game movie, although both of those aspects are well represented (without any explanation, which was another thing I loved about it). And it's not a comics movie, although it is sourced from a comic (sorry, graphic novel) and, again this is clearly a major influence on how it is delivered.In short, it is that rarity - entirely its own thing, and an absolute delight.PS I'm 58, so you don't have to be that young to appreciate it, thank you very much all you young ageist whippersnappers!",
    "43": "This is one cracking movie. Hilarious, stylish, genius. Really really clever. And did I say fun? FUN FUN FUN!This is a classic! Don't miss this!!",
    "44": "As someone who had never read the comics, I'm really happy to say that Scott Pilgrim vs. The World is still a really good film. Right off the bat the obvious visual style of a mix of retro games with real life is super well done. The characters are funny and are great conflicting personalities with Scott. Scott's struggle and awkwardness is quirky and fun. The film is perfectly paced thanks to the total plot of the multiple ex's evenly spacing out big action scenes. The sound effects, music, and visualizations of said music is perfect and overall the plot is just really concise and interesting.",
    "45": "It over the top, fast paced and action packed. I quite liked this film, the editing and VFX especially. I did wonder why the main leads were interested in each other and found the world confusing but that means nothing as the good time I had watching this easily outweighs the bad for me.",
    "46": "Scott Pilgrim vs. The World is a movie that I've watched many times and I'm deffinetly gonna watch it many more. The movie has loads of charm and most obviously- a comic book-y vibe. Every aspect of the movie is just fun and the actors deliver their lines very well, but in all fairness, it's not the best movie, and even though I love it, I have to admit that it might not be for everyone.",
    "47": "The extent of the comic book influence in Ang Lee's Hulk were lines intersecting and dividing the frame into panels just like the source material would. Not exactly a novel or inspired idea, and it added exactly zero to an already mediocre film. Scott Pilgrim is another one of those rare occasions where merely adapting a comic's story is not enough; the essence of comic books and their unique elements must be integrated into the film itself. Are these decisions fully justified? Many of the effects, while pretty and neat, don't contribute a whole lot, but are there to satiate the fans of the source material and those familiar with comic book tropes; flashy visualisations of sound effects (the crash bangs, bells ringing, bass notes), presenting conversations by splitting the frame instead of your conventional shot reverse shot, text boxes with introductory information, and so on. There are a few instances of Wright's innovation with these elements - a powered up Todd demonstrating his strength by smashing Scott through the panel's barrier comes to mind. But most of it is just unnecessary nonsense. The film also lifts liberally from video-game mechanics. The plot itself is positioned like a game's plot; seven exes, or bosses, each with their own special abilities and backstories, needing to be defeated to gain the final prize. The action sequences are delightfully exaggerated as they would be if you were controlling Scott as the protagonist and hero; appropriately timed speed ramping, flashy power-up effects, the aspect ratio shrinking and enlarging to capture the intensity of a critical hit. But to what extent do flashy effects cover up the lacklustre narrative that indulges them? I guess it's cool to add a glowing sword and tell us Scott's stat increases at a crucial part of his growth; he gains the powers of love, and then later self-respect. What this does, however, is make his characterisation almost entirely reliant on these gimmicks and prevent the film from truly getting to the heart of its characters and motivations. Could you ever imagine Citizen Kane with a little bar at the bottom of the screen that indicated Kane's level of regret?What Wright does is cover almost every facet of his film with a visual gimmick or effect so that the actual characters are scarcely allowed to breathe. Much of the humour comes from the script rather than the characters; when Scott breathlessly indicates his willingness to do \"all of the drugs\" to impress Ramona, all it sounds like is an actor reciting a line. Cera taps into his usual persona; the quiet, unassuming teenager who speaks almost exclusively in deadpan, so it seems baffling that so many girls could ever be attracted to him. The same applies to Ramona Flowers, the self-described Manic Pixie Dream Girl: she claims \"I change my hair every week and a half, dude. Get used to it.\" as if this is a substitute for an actual personality. Winstead is pretty and has an air of vague vulnerability to her, but Ramona is nothing more than an airy plot device to serve Scott's coming-of-age story. The worst offender is the seventeen year old Chinese schoolgirl named 'Knives Chau', who speaks and acts like she has jumped straight out of a nerd's wet-dream. Wong does a brilliant job, nevertheless - Knives is ever smiling, bouncing and on Scott's arm, like a girlfriend created in a lab (or a video-game), and conveniently does not ever seem to notice or address any of his flaws. In the end, she is tossed aside for the happy hopeful ending, and the film cares more about their synchronised jump-kicks than Scott's quick apology. This is the crux of the film's problem; there is clearly an arc written for Scott's redemption, to realise the error of his ways, his selfishness and the self-doubt that comes with the constant comparison and clashing with Ramona's exes. But it is all hidden under intentional silliness and camp, and when we try to closely scrutinise his actions, they don't make any sense. Scott finally gains enough self-respect to stop measuring himself next to the exes, and meaninglessly chase a pretty enigma. But it turns out that his dickishness didn't have any consequences at all; Knives is still the bouncing stereotype that is more than happy to endorse the dream pair, and Ramona is there to welcome him with open arms. It goes for the cool ending, instead of one bound by common sense.",
    "48": "It's fun, it's amusing, it's entertaining and it's cult!!! Even a cult movie lover like me would need half an hour to break in. But once it's done, the whole movie could blow up your mind.BTW now I know why she keeps saying EXES. Oh gosh this movie is so different. Anyone who wanna make one n a half hour of your life less ordinary should give it a shot.",
    "49": "I love it where all of the f-bombs are censored!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "50": "When I started watching the movie, I got irritated a bit with the movie. It felt like the movie is trying so hard to feel different just for the sake of it (people nowadays would say it's a puke* \"hipster\" puke* movie). However, no matter how much I resisted, movie quickly won me over. The whole concept of the movie and the fights with the evil exes are great. Gags are very fun and approach to directing is very creative. Movie is also crammed full of pop cultural references you will enjoy recognizing. All in all, this movie is a movie for geeks, and if you are a geek, even a little bit, you will have a good time. If you don't know what I'm talking about, you can skip this one and you won't miss a thing. I give it 10/10 for creativity, entertainment and originality!",
    "51": "VERY MILD spoilerWhile the film's hyper-kinetic action scenes and overall storytelling will irritate the unconverted, those in the right mood will have a lot of fun, even if you are wishing for more character development.The cast is a riot and really tie the film up, particularly Brandon Routh (I'm sorry, SUPERMAN), who seems to be better at dead pan than the film's lead, Michael Cera.The fight scenes are just so damn outlandish that you can't help but laugh out loud, and along the way, gives you some really nice eye candy. That's the reason why you get Bill Pope for the Director of Photography. The Matrix, baby!The movie isn't quite as heartfelt as some of Cera's other Rom Com's, but when the film has time for it, there is some genuine sweetness and the ending ties up the adaptation nicely (please pay to see this, so we'll get a sequel!) Now I just have to start reading the comics.",
    "52": "Throw video game culture, a stack of comic books, some anime, maybe some kung fu and good dose of rock n' roll into a blender with some humorous romance and you're only beginning to see what this movie was like. It's hilarious, fun, unpredictable & crazy. I absolutely love the art in this (i.e. all the little doodles & words that pop out & fly off of people) I highly recommend this for anyone who enjoys any of the above mentioned cultures (I really enjoyed the subtle Smashing Pumpkins references throughout). The only thing that kept this from getting 10 stars was \"normalizing of homosexuality\" agenda wrapped throughout the plot like a tumor on a spine.",
    "53": "Michael Cera stars in the dazzlingly brilliant comedy, Scott Pilgrim vs. the world. Scott Pilgrim is zany,and so is it's dialogue. And both work very well. While watching Scott Pilgrim, you will laugh, you won't believe your eyes, and it will blow your mind.Scott Pilgrim vs. the world involves Scott(played brilliantly by Michael Cera), a nerdy 22 year old who begins to dream about a chick named Ramona Flowers(Mary Elizabeth Winstead). The two meet and hit it off. But nothing is what it seems. Scott has to fight off her seven evil x's(which include Chris Evans as an action star,Brandon Routh as a rocker with vegan powers, and Jason Schwartzman as a geeky freak who has powers of control.Scott Pilgrim has many moments of hilarity and awesome. Scott Pilgrim vs. the world is a movie that will make it so then you can't believe your eyes. Scott Pilgrim is an unforgettable dazzler from director Edgar Wright(Shaun of the dead, Hot fuzz).The characters are all very likably stupid. The dialogue is zingy and fresh. The special effects are pretty neato. THe film has the opposite effect of someone watching someone else play a video game. Because the whole movie is a video game.This is probably the most fun, well acted comedy in years. Some of Scott Pilgrim is bizarre, but most of it is brilliant and fresh and unique. This isn't a comedy like The Hangover. Really, this isn't a comedy like any other. Scott Pilgrim vs. the world is dazzling, fresh, funny, crazy, and awesome. It could easily be one of the best movies of the year. See it. See it while you can. You'll have a blast.3.5/4",
    "54": "'Scott Pilgrim vs. the World' was executed from a graphic novel to a film very nicely but didn't make it a better film. The movie was great but from comic to movie really didn't make it any better although it probably wasn't intended to make it better. This film exceeded all of my expectations and actually surprised me that a comic like this type could be made into a movie so nicely done. I immediately picked up the graphic novels and it explained a huge amount of references that never got displayed in this movie. I really really liked Michael Cera's performance in this and he continues to be exceptional. The film's tagline \"An epic of epic epicness\" really defines the film for what it is. It was funny, intense, and serious while it has it's own style of a film itself. 'Scott Pilgrim' had it's own type of humour, the intense fight scenes that were really fun to watch and see the creativity of the authors point of view. This is a fun movie and must see.",
    "55": "This movie is so fresh. It is hard to find something like this these days. The fast paced editing is top notch. Writing is quirky and unexpected. Such an awesome concept for a movie also. Such a good movie. One of my favourites",
    "56": "Edgar Wright is without a doubt one of the most creative directors working today. Having already done Shaun of the Dead and Hot Fuzz, he proves that he's still got the touch with Scott Pilgrim vs. the World, an adaptation of the graphic novel series by Bryan Lee O'Malley. In this film, Scott (Michael Cera) has found the girl of his dreams, Ramona Flowers (Mary Elizabeth Winstead). But unfortunately for him, in order for Scott to date Ramona, he must defeat seven of her evil ex-boyfriends who want him dead.This film is a visual feast. Filled with awesome gags and video game music cues, Scott Pilgrim vs. the World is one outstanding piece of work, and that's saying something. The cast was awesome. Special props to Kieran Culkin who stole the scenes as Wallace Wells. He was hilarious. I never thought a film like this would make me smile, but it did, and I loved it. Highly recommended!",
    "57": "I remember seeing the previews of this film. I was about at a 4/10 for interest. One day I was bored and saw it on Netflix. And since I had heard a lot of good things about it, I decided to take a watch.Wow. What a badass film. It's funny, it's interesting, it's creative as hell, and awesome music. By the end, I sort of nodded my head and said to myself \"Yeah, that was a masterpiece.\"Edgar Wright really is a genius. Every second of this film is packed full of entertainment. It doesn't let you rest for one second before another crazy scene happens with loads of style and fun.",
    "58": "Fantastic. It's my movie. I think it is aimed especially at an audience that was a child in the early seventies, living with the coin-ops and the first consoles. The acronym created as if it were the monophonic synthesized music of an old video game is already a bojoux. Then everything is wonderful: the dialogues are amazing, the characters all beautiful and nice but never banal, the structure of the plot is that of an arcade with bosses (boyfriends) at the end of the level, coins, extended play, the second player. And there is also a very current moral. Simply brilliant! Forgive me if I give a 10 because I know he doesn't deserve it. But he really enjoyed it a lot as it hadn't happened for a long time with a film and if cinema is entertainment, at least in my case it has perfectly hit the target. Thanks Scott. Thanks to everyone who helped create it. Chapeau!",
    "59": "Very cool and entertaining to watch. This is something different and i respect it. The comic book style is really well done and the movie was great overall.",
    "60": "Wow. What a Movie. This Director is so creative and smart. I loved Hot Fuzz and Shaun of The dead. But this is A Masterpiece. But I've got to say, this movie is not a normal movie. It has Billions of Effects and I love Every Time SCott Hits the Evil Ex's it says \"Pow\" Or \"Boom\". It's like playing a video game. I loved The Story and the acting was Brilliant. It's about Scott Falling in love with a girl named Remona and to date her farther, he needs to defeat her evil Ex's. (You'll Find out why she calls it Ex's Instead of Ex Boyfriends..) So yeah... This is my rating: Character: 9.5/10 Effects: 10/10 Story: 10/10 Overall: 10/10. Enjoy and Have Fun!!! :)",
    "61": "This is the best movie I've ever seen. Everything about it is just perfect.",
    "62": "The tone of this film is so so fun. The visuals in this film are so amazing i love how they reference the comic books. The acting fits the style of the movie so well and the cast is amazing. Not to mention the killer sound track with bangers i listen to even years after the film came out. The humor is totally my style so I am a little bias when i say that this is one of the funniest movies i've seen. It's a film i share with almost all my friends, or at least recommend it to all my friends. It's definitely not a movie for everyone and you need to have a certain taste for it but i think everyone should at least watch this movie once.",
    "63": "I have not read the comic books this is based on, not yet anyway! But this movie turns everything up to eleven, the jokes, the references(to almost everything), the action, the nerdiness, the coolness.. And it's a relatable story! Underneath it's over the top martial arts, vegan super powers(yeah!!) and evil exes exploding into coins after orgasming to death.. it's a simple story of a boy falling in love and fighting her love's evil exes! It's charming and ridiculously likeable.",
    "64": "It's the perfect film for adolescence: being both relatable in its content to that demographic as well as a fun joy ride of a film filled with pop culture references and exciting action. LOVE THE CASTS. THE SOUNDTRACK. THE EDITING AND CINEMATOGRAPHY. Thank you Edgar Wright!",
    "65": "I myself don't really like Michael Cera as an actor, but he surprised me here. He stopped being the 17 year old virgin and is actually becoming a character. Sure he still had his dry monotonous humor, but he really made it work here since he mixed it with legitimate acting. Personally i believe that this is the best editing i have ever seen in any movie, ever. All the tech and they way it was put together was so dumb, but it just worked. Edgar Wright found a place among the deitys of film with this movie alone. I won't get into the story since its so amazing that you need to find out for yourself. The basics is that Scott Pilgrim has to defeat 7 evil exes to date his dream girl. All the fight scenes are fantastic, they actually make me fear the super skinny Michael Cera and his shaggy haircut. Definitely my favorite film of the year.",
    "66": "It does everything it set out to do and well. I was lucky enough to see it as a sneak preview and loved it ever since.",
    "67": "I wasn't sure that I'd enjoy this film but when a couple of people I know raved about it I though I should check it out; I'll have the thank them as it was a lot of fun. It is essential to know that this film is not meant to be in any way realistic in one scene the hero gets punched through three brick walls and is barely hurt! That is part of the fun though; it is a live action film that has the same rules as a Loony Tunes Cartoon; it could so easily have been terrible but instead it was a lot of fun.One day Scott Pilgrim spots a beautiful girl with bright pink hair, called Ramona, and he is immediately smitten; he must date her even though he is already dating a seventeen-year-old schoolgirl called Knives. At the time their relation starts he doesn't realise that he will have to battle each of Ramona's seven evil exes if he wishes to keep her... and live. The fights aren't normal scraps; they are like something out of a video game, complete with sound and visual effects and when he wins he gets points and just as his vanquished foe disappears money appears in their place. As he works his way through the exes Scott learns a bit about himself and realises that he hasn't behaved all that well to his exes.Director Edgar Wright did a fine job bringing the story to the screen; managing to make the cartoon-like elements seem fun rather than just a gimmick. Michael Cera and Mary Elizabeth Winstead were great as Scott and Ramona; the fact that he isn't the typical action star made it easier to root for his character even though he was clearly flawed. It wasn't just comic-book fight scenes there were also some good laughs; frequently provided by Scott's sharp-tongued gay roommate. I was surprised how much I enjoyed this film and heartily recommend it to anybody looking for something a little different.",
    "68": "I just rewatched this for the first time in years and I laughed out numerous times.It's highly original with cues taken from pop culture but those cues are brilliantly reimagined with inventive images and incredibly fun pacing, dialog and cinematography.Each part is cast with the perfect actors and actresses who play their characters to the hilt. This is no holds barred fun, even for us old farts.I just bought the soundtrack after the most recent listen and it's still fresh. The music written for the movie is great with or without the movie but they come together to make the best combination in a genre they created and perfected.Oh yeah, it's even better after a hefty edible. Straight or high, it's a blast.",
    "69": "Okay, so, I actually saw the trailer back in 2010, and I was really curious. I didn't know the film was based on the comic book series of the same name, so I thought the humor and tone was jarring, as well as bizarre. But once I read the comics, I instantly changed my mind. I watched the movie again recently.I was shocked at how good the movie was. I didn't like some of the humor, but everything else was amazing.",
    "70": "This is truly a brilliant, refreshing movie. I must say that I didn't quite know what to expect but except that I thought this movie was for teenagers and I was terribly wrong. I am 40 years old and I TRULY enjoyed this movie and it had a clear story line that targeted more than just teenagers. In addition, I saw every age group, race, gender in the screening that I attended which was impressive and we all were jumping and laughing at every scene as if we were all teenagers. I truly left the movie saying that \" I cant wait to see more films put out by \"Oni Productions/Closed on Mondays \". Well done !!!!!",
    "71": "It's just great, you can rewatch it a hundred times and never have enough of it. It has at one point nothing to do with the comic but it's still fun to watch at all time and gives you a pleasant surprise. The aesthetic, the acting, the special effects, everything is so weird but it feels at it's place. This movie will never get old.",
    "72": "For fans of all things geeky around the world, this film is for YOU! Comedy, action, romance, video games, music; \"Scott Pilgrim vs. The World\" has everything you could ask for. It very quickly became my favourite film after watching it and I could watch it over and over again without ever getting bored of it; the same way that you could watch the same episode of Friends for the 'nth' time and find it as hilarious as the first.Though the character feels quite different to his graphic novel counterpart, Michael Cera does an excellent job as the awkward Scott, Kieran Culkin is perfect as Wallace and Mary Elizabeth Winstead plays a much more tragic version of Ramona Flowers but this change still works well.Scott Pilgrim is a must-see and it deserves more recognition. Go watch it, you'll love it.",
    "73": "I had such high hopes for this film. Being directed by Edgar and starring Michael Cera it had to be good! And it was! This film is about Scott Pilgrim a boy who must defeat 7 evil ex boyfriends in order to freely date the mysterious Ramona.The film has hilarious parts from beginning to end and Michael plays Scott incredibly well. Every side character is full of wit and charm.It also boasts an incredible soundtrack! It stays true to its comic book origins in the way its shot and plays out. Very funny and very original! I don't thing anybody should attempt to copy! You should definitely watch! 10/10!",
    "74": "The film was very funny. Combined with animation and computer graphics, the film became bright and unforgettable. Such a picture has not been seen for a long time.",
    "75": "Scott Pilgrim vs. the World is probably as close as we'll come to having an experimental film released in theaters nationwide. This is one of the most innovative, original movies to come out in years. It's unlike anything I'd seen before. And yes, it is good, very good. I could not stop laughing the whole time.Onto the plot. Scott is something of a loser. He's socially awkward. He shares a mattress in a bunker-like apartment in Toronto with a sarcastic gossip king. He's in a band called the Sex Bob-Ombs, but they're really not that great. He also has a clinging, hyperactive girlfriend, \"Knives\" who's only 17- kind of a big deal when he's 22. All this changes when he dreams of a purple haired girl on roller blades. The very next day he finds out that she's real; that her name is Ramona flowers and she's the cool new girl in town. His first attempt to hook up fails miserably. His second attempt, although even more lamed brained, actually works, and they're soon an item. But now comes the bad news; to win her love, Scott must defeat her seven evil ex's. He also has an evil ex of his own. Plus, there's the matter of breaking up with Knives, and the battle of the bands is coming up!That's the setup, what follows is a hilarious romantic comedy punctuated by a series of completely over-the-top video game style fight scenes. Stylistically, I'd have to call them a cross between Sin City, Street Fighter and Viewtiful Joe. Each of the ex's has their own unique fighting style and their own super powers, such as vegan-powered telekinesis or summoning an army of stunt doubles. Often you hear martial arts movies criticized because the action is obviously computer aided. Here, that's the whole point.The movie's humor comes not only from the sheer ridiculousness of the situations, but also from the characters' reactions to them. After one of the ex's has flown in through a brick wall and battled Scott in the middle of a concert, everyone is just kind of weirded out. They don't act like nothing has happened, which would make it hard for the audience to suspend their disbelief, nor do they run screaming for the police, which would only complicate matters.Comedic effect is also generated through the use of deadpan dialog. For instance, when Knives confesses that she's never kissed a boy before, Scott replies, with a straight face \"It's okay, neither have I.\" Or the band's self-introduction, \"We're the Sex Bob-Ombs and we're here to make you all sad and depressed and stuff.The movie also pokes gentle fun at hipster subculture with the way that Ramona has thirty plus flavors of tea, or how Scott's roommate is always texting. There are also quirky touches like one girl who can bleep herself out, much to Scott's amazement, and a scene when the intro from Seinfeld plays after the characters enter the apartment, and canned laughter follows every line.The editing and structure are highly non-traditional, with heavy use of dreams, daydreams, montages, animated flashbacks and asides, and chapter titles introducing segments. The visuals are impressive and very imaginative, such as the way that flashes of color accompany the playing of any musical instrument, allowing you to see the sound. Speaking of which, the sound is another high point, not only the energetic, rock fueled sound track, but also the sound effects taken from classic games like Mario and Zelda.Scott Pilgrim vs. the World succeeds in telling an offbeat story, providing interesting characters, and in producing lots of laughs. Other than a couple of too-obvious puns, I honestly can't think of anything wrong with this movie. I would highly recommend it to anyone in their teens or twenties. Four stars.",
    "76": "\"Scott Pilgrim\" is one of the most creative, fresh and original films I have seen in ages, and because of that I was in absolute awe of the film. However, despite being a terrific film, I also understand that this is NOT a film that will appeal to everyone--in fact, it's probably one of the more polarizing films I have ever seen--you'll probably either love it or hate it. While I am NOT in the target demographic group (aged 15-30 and predisposed to loving graphic novels AND video games), I did enjoy it--and am probably the rare 40-something person who loved the film. What was different about me is that I am a geek (a definite plus), enjoy video games and have a rabid comic book fan for a daughter--so I understood many of the pop culture references throughout the film. But, if you are NOT a geek, hate video games and see graphic novels more as comic books, then the movie might be a chore to watch. Plus you might just feel ooky hanging out with geeks. Don't worry, they are almost all very nice people! So what, other than originality, did I love about this film? Well, just about everything--and I seriously considered giving the film a 10--I liked it that much. Perhaps the best thing for me was casting of Michael Cera in the lead. Unlike the traditional super-hero, he is by far the geekiest and most likable main character I have seen. Seeing such a wimpy and unassuming guy become, out of no where, like a character from Mortal Combat was a wonderful juxtaposition--you just couldn't help but smile. And, despite his nerdy looks, he was winning as Scott Pilgram...and actually played the music his on-screen band played--now that's talent. Additionally, I loved the film's gentle sense of humor---I laughed harder at this film than any film I've seen in the theater in some time. I could try to describe these moments--you just need to see them for yourself. Odd references to games like DOA, Mortal Combat, Marvel Vs. Capcom and Zelda II were great--I caught on to those due to my own geeky background. And, my familiarity with anime/manga also made me laugh--as the hair, love for girls in school uniforms and style were often straight out of Japanese comics. And, I loved how the film made me love video games and was simply much, much more fun that the original \"Tron\" (which I always felt was too dry--perhaps the new version will correct this).Clever, wonderful and strange, this film is the geek's dream come true...and not a film to be missed. However, if you aren't a geek or are perhaps too old to get the pop references, I say take along an interpreter--many comic book nerds and couch potatoes would be glad to go with you and help explain things...provided you pay for the tickets.Among the nearly 9000 reviews I have now done on IMDb, this ranks in the hallowed ranks of a very small group of movies that transcended the pack due to its utter weirdness. It's surreal and weird--and I think this makes it very special. For other films that fall into this category, try \"The Happiness of the Katikuris\", \"Delicatessen\", \"Yes Nurse, No Nurse\", \"Tatie Danielle\" and \"Tampopo\"--all truly unique, surreal and fabulous films.",
    "77": "Scott Pilgrim versus the World is a Canadian romantic comedy and musical based on the comic books by Bryan Lee O'Malley. Scott Pilgrim is a 22y.o teen-age-looking insecure guy and guitarist who plays in a rock band called Sex Bom-omb and is going out with a minor high-school Chinese girl, Knives. He seems content until he has a dream about a girl. She happens to appear in his real world in the form of Ramona, the ever-changing-hair-colour American recently moved to Toronto. Scott is over the moon, but he has to face his own personal demons, break up with sweet Knives and fight for Ramona's love against her seven exes.Scott Pilgrim is one of the most refreshing teen-sophomore movies produced in the last years, and one the best movies of 2010. The movie is cute, funny, entertaining, has great characters, a terrific soundtrack and stunning visuals. The story is presented as in a video-game in which the main characters are the players, and their lives is the game. The issues regarding relationships are masqueraded by the video-game approach, but they have depth. Unlike many other movies focusing on the emotional challenges of very young people, sex is not the focus, although it does not avoid it either. The movie focus on how difficult is to make a relationship work when you fall in love whit people who already have an emotional baggage and you are insecure about yourself. Scott's fights against Ramona's exes are just a metaphoric way of putting it. Moreover, the emotions of the girl are not the focus here, but the emotions of a young man who is not obsessed with sex. How do you get a girl who has an emotional baggage when you are not an over-confident guy, your dream girl is uber-cool, and her exes were brilliant guys? The good thing is that any of this is boringly presented. On the contrary, the movie is lots of fun and does not take itself seriously.All the actors are great in their roles: Michael Cera as Scott, Mary Elizabeth Winstead as Ramona Flowers, Ellen Wong as Knives Chau; Mark Webber, Johnny Simmons and Alison Pill as the other band members Stephen, Young and Kim. Kieran Culkin is Scott's confident grounded gay Wallace Wells, Anna Kendrick as the know it all Scott's sister Stacey, and Jason Schwartzman as the revolting Gideon Graves. However, Cera really shines in this movie, in part because his physique really portraits the character from the start.The visuals of the movie are stunning, the camera's movement, the video-game and comic use of the screen adding to the freshness and originality of the film. The fights wit the exes are extremely funny and witty. I specially liked the fight with the Vegan ex-boyfriend, which is hilarious. Also visually stunning is the musical competition between Scott's rock band and the techno Asian twins band.The music is truly terrific. An extra bonus to a great script.Scott Pilgrim vs the Wold movie is not only well done but done with passion, a project cherished by the whole team and by director Edgar Wright.The movie has freshness, soul and a special something that stays with you longer after you've seen it! It is miles away from any other young people romantic comedy lately made.",
    "78": "Edgar Wright just keeps getting better as a director, and his latest offering after the good Shaun of the Dead and better Hot Fuzz is a kind of super-speed-surrealist take on young love and imagined video-game battles. It's a geek-storm of comedy, the kind of effort that we don't get too often in movies that are dictated down by committee and tested so much for laugh ratios. There are so many things that go on in a scene in this film that some of it will pass by your head. Or maybe not; maybe it's just the right tone for a combo platter of comic-book/anime/manga/8-bit-to-PS3-video-game movie that knows itself and knows its intended audience so well that it can be so POP in its sensibility. This is a super-comedy, suffused in melodramatic romance and fiery action, for people who still wonder what it's like to be surprised at the movies.I wish I could contain my enthusiasm for the movie enough, but it's hard to do. Wright pulls off such a high-wire act, the likes of which take me back several years ago to Kill Bill Vol. 1, or to comedy masters like Mel Brooks. The filmmaker just *gets* it, how to pull off material that is nothing too new but with an original eye and perspective for what's funny. And in this story- of Scott Pilgrim, a \"hipster\" with a band (of course) dating a 17 year-old Catholic high school Asian girl named Knives (of course) and who falls for another hipster girl, Ramona Flowers (beautiful Mary Winstead) who dyes her hair every several days and has seven (give or take one or two) evil ex- boyfriends (and a girlfriend) to fight to the death- the intensity and energy goes hand-in-OMFG-hand with the subject matter. But what's even more impressive, as it was also with Hot Fuzz, is how much affection Wright really has for not just his source material, but how people who dig the culture and nature of it so much. He clearly does enjoy what's hip in music, video games, clothes, hair, action movies and kung-fu fights, but also knows how to satirize it until it bleeds its own blood. And boy does he get some juicy satire here, always in the name of good fun and, indeed, some melodrama. As Scott (Michael Cera in a kind of amalgam of his on-screen persona to a perfect nth degree) goes through these evil ex's, each with their own \"quirks\" and super-powers, such as one being an egotistical movie-star jerk and mega- Vegan (Chris Evans and Brandon Routh respectively, also both brilliant), we see how his character does go through an arc, that it's not all just fun and games. If a video game like No More Heroes took the perfectly- confused love tale of (500) Days of Summer, it might look like this... kinda.What it comes down to is that for everything that is familiar, even down to the coins doing their EXPLOSION on the ground after a baddie dies, or how rock bands awesomely suck so much that they become awesome again, this is shot and scored and performed like nothing else you've seen this year, or most years. Wright keeps throwing things at the audience, and knows (or hopes) they'll keep up. At the same time it never bores with its (::I snap fingers::) rhythm, and, and if a joke doesn't fly to the sky it still gives some chuckles or belly laughs. Lines are instantly quotable, and one can't wait to tell friends and others about this character or this shot or punch, or how Jason Schwartzman reacts when he swallows his gum. It's a radioactive treasure trove of romantic comedy, blazing action, random beats, well-timed reactions and physical gestures, awkward longing, and lots of kick-ass rock songs. In other words, if you dig it, it will be the cult movie of your time. If not... move along, or FIGHT in the arena! A+",
    "79": "Scott Pilgrim (Michael Cera) is a twenty-something slacker living in Toronto, who basically leeches off his friends. Despite being in a \"relationship\" with Knives Chau (Ellen Wong), he keeps dreaming about another girl. He quickly finds out this dream girl, Ramona Flowers (Mary Elizabeth Winstead), is actually quite real, and decides to pursue her. But before they can truly become the couple Scott hopes for, he has to defeat her seven evil exes.I did not think it was possible, but Edgar Wright has fairly successfully brought Bryan Lee O'Malley's epic graphic novel series to the big screen in the most uniquely entertaining way possible. It is his first adapted work, but it feels every bit as fresh (I use that word very loosely) as Shaun of the Dead and Hot Fuzz did upon their initial releases. It deviates from the books a bit (much like Matthew Vaughn's excellent adaptation of Kick-Ass earlier this year), but the majority of the film stays true to the series and gives the fans everything they might expect from a Scott Pilgrim film. Right after the film opening with an 8-bit Universal logo and score, you know you are in for a treat.What propels Wright's epic and inspired vision is the editing style. All of the little idiosyncrasies, background/foreground items and ideas, everything that made O'Malley's books so revered in the graphic novel community are all in full force here. Some shots in the trailers suggest the comic book-style feel of the film, with the sounds of the actions appearing as words on-screen and the video game-related pop-ups appearing the same way they would in the game. But that is only the start. The entire film is filled with them, and with references to numerous pop culture entities (specifically video games), to the point that it looks and sounds like a ridiculously enhanced motion comic or game. Add to that the quick cuts and multiple panel style of the format, and you have the closest film representation of a comic since Robert Rodriguez attacked Frank Miller's Sin City.Even with all the nods and references to the original work, Wright's film still feels very much his own work. He makes Scott Pilgrim's epic quest to defeat Ramona's exes into an understated work you will likely not see replicated too soon. After seeing Christopher Nolan's Inception just under a week ago, I did not think that mainstream Hollywood would release something so blazingly original and something so astonishly unique so close together. Scott Pilgrim vs. The World is not nearly as strong a film as Nolan's masterpiece is, but Wright has clearly given it his all here. He has sidestepped away from following the lead of other comic book/graphic novel-style films, and has created something he can truly be proud of. The visuals on display are simply remarkable, and are worth the price of a ticket all on their own. The musical choices are even better. If you have seen the trailers, you are merely only getting a hint for what Wright has in store for you here.If I do have an issue, it is that the film is a little too exposition-heavy in the first half, and way too jumpy in the second. It never loses its tone or its style, but it becomes all too blatantly obvious where the books stop and the deviation begins. The pacing here is also a touch off, and on further research, thoroughly suggests there is material missing or altered from the final cut of the film. I understand that Wright and his co-writer Michael Bacall wanted to set-up the story and where it plans on going for the few who venture into the film without having read a single issue, but there is too much detail given in those early scenes, and not enough to pivotal moments later in the film.Another gripe, although it is one I hope will be less bothersome on repeat viewings, is that a good chunk of the characters feel incredibly underused. The books are stacked to the brim with an eclectic mix of supporting characters, who are present in the film, but they feel very stunted and get absolutely no development. Kim Pine (Alison Pill) is a very important character in the books, but she merely appears in the background here and delivers some of the best dialogue. Wallace Wells (the absolutely incredible scene-stealer Kieran Culkin) is the moral centre and source of an incredible amount of exposition, but he is barely in the film after the first half. Envy Adams (Brie Larson) almost feels like an extended cameo as opposed to an indispensible figure in Scott's character development. But then, Chris Evans, Brandon Routh and especially Jason Schwartzman all deliver stunning performances as three of Ramona's exes, despite the lack of time on-screen.Cera on the other hand, is perfect as Pilgrim. The character plays a little too close to his stereotypical neurotic and off-centre archetype, but it works out beautifully here. He makes the character real, and brings a depth to Scott Pilgrim that no other young actor could. He has the right look and the right sound down pat. It was a little weird to see him get so physical in some sequences, but this is a vintage fit for Cera. Although they are downplayed more than I liked, Winstead and Wong are great as Ramona and Knives. They both have a certain edge throughout the film, and even at its most ridiculous, deliver strong performances. It helps too that they have insanely good chemistry with Cera.I jumped at the idea of an advanced screening of Scott Pilgrim vs. The World, and I do not regret seeing the film in the slightest. It is a bit of a niche movie, but it is one that is lovingly made through and through.8/10.(An extended review also appeared on http://www.geekspeakmagazine.com).",
    "80": "I heard many good things about this movie before I went to see it. Even so, I didn't go in with too many expectations I wasn't disappointed. This was probably the most enjoyable movie I've seen so far this year. I walked out of the cinema with a smile on my face and there was even a spring in my step as I went over the preceding 112 minutes in my mind.Scott Pilgrim is a 22 year-old living in Toronto, Canada with his gay flatmate, Wallace Wells. Scott plays bass in a band called Sex Bob-Omb which consists of Scott (of course), Kim Pine on drums, Stephen Stills on lead vocals and guitar and Young Neil as hanger-on. The band has ambitions to be famous and so have a gig coming up at a Battle of the Bands show. At the start of the film he is dating a seventeen year old schoolgirl called Knives Chau. Things seem to be going along quite well until Scott has a vision of a girl called Ramona Flowers. He becomes besotted by her and they end up hanging out together and eventually dating. Unfortunately Scott soon learns that if he wants to date Ramona he must first defeat her seven evil exe's! Can Scott defeat these evil exe's and win Ramona? What will Knives think of his infidelity? All these questions and many more remain to be answered until you've seen the film of course.As I said at the beginning, this was probably the most enjoyable film I've watched so far this year. I found the quirky mix of live action with comic book elements quite refreshing and it gave the film an interesting look and feel that I liked a lot! Great performances all round, especially from Michael Cera as Scott Pilgrim, Mary Elizabeth Winstead as Ramona Flowers, Kieran Culkin as Wallace Wells, Mark Webber as Stephen Stills, Alison Pill as Kim Pine and Ellen Wong as Knives Chau.This will most certainly feature in my best of the year awards in December. It did start to lose me a bit towards the end, but I won't hold that against it. A really well made film which deserves the praise it has got (IMO). Well worth the entrance fee and very highly recommended.My score: 8.3/10",
    "81": "After success in Britain making Spaced, Shaun of the Dead and Hot Fuzz, Edgar Wright has been given the chance to direct a Hollywood film, Scott Pilgrim vs. the World. And Wright was does not disappoint with this action, comedy comic book adaptation.Set in the Canadian city Toronto we follow our hero Scott Pilgrim (Michael Cera), a slacker dating a 17-year-old high schooler Knives Chau (Ellen Wong) and the bass guitarist for the Sex Bob-omb. But Scott is recovering from a nasty break up and he falls literally for the girl of his dreams, Ramona Flowers (Mary Elizabeth Winstead). He tries to win her over, but there is a big problem, he has to defeat her seven evil exs, including Matthew Patel (Satya Bhabha), Lucas Lee (Chris Evans), Todd Ingram (Brandon Routh), Roxy Ritcher (Mae Whitman) and the worst of them all Gideon (Jason Schwartzman).Scott Pilgrim vs. the World is a visually rich film, with Wright literally makes a live action comic book. He brings in the style of the comic book into the film with little visual touches like words coming up onto the screen, using images from the comic for telling some backstory to using panels to great affect. The fights were done with incredible skill and Wright employs the style of Capcom beat-'em-ups, with the opening of a fight shot like a landscape and used visual lettering like in though games. The fights were wonderfully shot and edited, with the camera placed in the right areas and shows that Paul Greengrass style shaky-cam and quick cutting is not needed: audiences want to see what happens in a fight scene. Wright also employ other video game references, like the extra life was reminded me of the Sonic the Hedgehog games I enjoyed in my youth, 3D beat-'em-ups like Virtual Fighter and Soul Calibur and arcade games like Donkey Kong. There is also a video game style score to go with the indie-rock preformed by the bands.There is a great amount of comedy in the film. Scott Pilgrim vs. the World starts out a witty, dialogue that offers smiles and chuckles, but no real belly lasts: yet they include later on there are more jokes, involving clever observations, great characters, physical humour and how real young people. Wright and graphic novelist Bryan Lee O'Malley do understand both young people and how pop culture. Much of the humour is very sarcastic, particularly from the female characters.There is a excellent cast. Cera gave his best performance as a slacker with personal baggage and well cast. Winstead too was brilliant as Ramona Flowers, leaves plenty of mystery in her character and well, she has a great body: I particularly like her fight with Whitman as Roxy Ritcher. Wong was good as Knives and also fun to look, I enjoyed her naïve young girl act who is just excited to be dating someone older but not confidence about doing anything with Scott. She grows as a character. Alison Pill and Anna Kendrick both offer a lot of sarcastic humour and do it very well: Pill did have a good supporting role but I would have liked to have seen more of Kendrick. Kieran Culkin had a good as Wallace Wells, Scott's gay roommate who is a gossip and willing to annoy people, but a good friend when it court. Culkin is smart simply plays the character as a normal man who happens to be gay, not a gay man, his performance was more natural that way. Out of the exs Schwartzman is perfectly slimy as the leader of evil exs, Routh was very funny as a dimwitted psychic with no morals and hopefully he will get to play Superman again and Evans was very good as an over the top action star with a deliberately gruff voice and speaking in action clichés. Whitman was also good in performance.Scott Pilgrim vs. the World is a excellent alternative comic book film, one of the best. It can stand along side films like Sin City and 300 and it is an excellent action-comedy. But I still think Kick-Ass is the best comic-book adaptation of 2010.",
    "82": "I guess I am not the age demographic that this film is based at but I liked it. My daughter loves it, she even made me by her the DVD.Scott Pilgrim is a magical realism/fantasy teen comedy with pop art video game visuals. Deep in its heart its just a hip, flashy teen romantic comedy.Edgar Wright better known as the director of the Cornetto Trilogy adapts this comic book series like it was an edgy fast paced pseudo Japanese video game.Scott Pilgrim (Michael Cera) plays bass in his garage rock band Sex Bob-omb who meets his dream girl Ramona Flowers (Elizabeth Mary Winstead) who is new in town. However he is soon pursued by Ramona's seven evil exes who all challenge Scott Pilgrim to a duel and Scott needs to keep them in check with his zaps and zingers Streetfighter style.Cera has the right balance of geeky, slacker dude, Canadian hipster charm as Scott Pilgrim who is very likable even though he quickly ditched High School student Knives for Ramona.The Evil Exes are a colourful bunch with some star names amongst them. Chris Evans is a skateboarding movie star whose entrance is accompanied with the Universal Pictures theme tune. Jason Schwartzman is a megalomaniac record producer. Brandon Routh is a pretentious vegan rock star with the ability to fly just like Superman.There is a lot of scene stealing in this film like Kieran Culkin as Scott's sneaky gay roommate, Anna Kendrick as Scott's sister and particularly Ellen Wong as Knives the slightly too young ditched girlfriend who is still loyal to Scott.I actually found this to be a fast moving, quirky, rocking, enjoyable comedy drama.",
    "83": "The tagline for this film is \"An Epic of Epic Epicness\" and I couldn't agree more. After waiting in line for 3 hours after last night's Comic-Con and finally being sat in the gorgeous Balboa Theater, I didn't know what to expect. I loved the comics and the previews looked faithful. The moment the movie starts (literally; the Universal logo and theme are 8-bit) you are thrown into a comic book atmosphere with video game references aplenty.The plot revolves around Scott Pilgrim needing to defeat the 7 Evil Exes of Ramona Flowers in order to date her and it is a harrowing sequence of battles. Each fight is crazier than the last and some are used purely for comedy, not excitement. Almost every other line is a punchline and they all work. References to TV shows, video games and comics (just like a 20-something's life would include) are everywhere and if you accept the concept of the plot, it all feels natural.While the audience might've been biased (we held a 10-minute standing ovation for Edgar Wright when the movie finished) there's no denying that it's an excellent film. Edgar Wright has an uncanny sense of comic timing with edits and sound cues to make the picture tight and focused when it's looking for laughs.I can't imagine a mainstream theater erupting in applause and laughter like ours did but make no mistake; this a crowd pleaser and the MOST enjoyable film I've seen in years. Don't hesitate to watch this masterpiece in a theater near you.",
    "84": "Teenager problems (find yourself, get real, etc.) might not give anything to people considering themselves mayor adults, but consider this is a movie built on arcade video gaming motifs, I don't think it concerns mayor adults at all in the first place. I for one did not necessarily long for dark moral drama in this particular movie at all, I think the story was just about right for this movie, but you decide, if this is childish watch Haneke.Now for the rest: Surprisingly, Scott Pilgrim features the best martial arts scenes in years. Every fight is choreographed and executed in the most awesome ways and the fact that it's not Jet Lee pulling off these moves makes it even more fun to watch. And you get the fights absolutely frequently which is really, really satisfying. The editing is incredibly skillful as probably the most crucial element that makes this work. It gives the movie an incredible rhythm, reaching new levels of dynamism and the use of CGI and the visual design is plain fantastic. The amount of creativity put into this part is mind- blowing, resulting genuine and most original style. The cast is cool and I don't think anyone should look for academy material here. I liked these kids and they suit the movie.So, all together I found Scott Pilgrim being one of the most original, exciting and fun productions I've seen in my life. As a huge fan of things like fighting games, comics, or martial arts anime I felt satisfied to a point of screaming 'awesome' out loud after 30 minutes into the movie. Though people who never played Street Fighter or kept crossing fingers for Goku and friends yelling 'kamehameha' as evil bosses get pulverized by energy beams might not really get what Scott Pilgrim is about, it's very hard to deny the originality featured and the creative and professional qualities of the way it's executed.Fantastic! 8/10",
    "85": "It has been along time since I enjoyed a movie from start to finish. This was that movie. This film was jam packed with action, laughs and just lovable characters you want to see more and more of. Michael Cera was a pretty good choice for Scott. I mean usually Cera only has one type of way to act and somehow it really did fit for Pilgrim. It will take me forever to explain how much I liked the cast, so I will only pick a choice few. Mary Elizabeth Winstead was great as Ramona. She had the look you could picture from the comic itself. Then you have Ellen Wong as Knives. The way Ellen acted in this film really brought out have Knives really was in the comic. Out of the evil Ex's, I really enjoyed Jason Schwartzman. He just had an overall cool yet kept feeling and at a point you really wanted him to fight more against Pilgrim. The other Ex would have to be Brandon Routh. I really cannot stand him as Superman, but this role he got to act more like his personality. I mean every actor has a dream to act as a crazy character, because then they can be more comfortable. I think Brandon was very comfortable in the role. The movie had a beautiful look to it with great nerdy CG throughout. The movie did have two problems though. The fight scenes were not long enough. This is because the movie was almost two hours and it is hard to fit seven fight scenes in to seven Ex's. But even though they were short, the look, feel and graphics to them still really made them exciting. The other problem is that I know this film will never has a perfect rating overall because it really only fits to a certain type of people. Luckily there is a lot of people who will love this movie like I did, but in the world today, this film will probably not win an academy award; and that is sad.",
    "86": "Slacker Scott Pilgrim (Michael Cera) falls in love with Ramona Flowers (Mary Elizabeth Winsted). However, to get her, he must battle and defeat her 7 exes.I expected the worst when I saw how this was advertised (An Epic of Epic Epicness) but I had a free pass so I thought \"What the hell?\" I was surprised (actually kind of shocked) to find myself enjoying it. I'm not the target audience for this (I'm in my 40s and most of the kids in the theatre were in their 20s) but I still enjoyed myself. It's bursting with ideas, jokes, action...you name it. There are constant times that little words or phases pop up on the screen to tell us things...but they'll all funny and had me laughing. For example: at one point somebody says \"You don't think I know what that means?\" and the words \"He doesn't\" appear next to him. Also there are plenty of fight sequences but they're non-bloody and go so far over the top that you can't take them seriously. Also when people are killed they dissolve into coins! I know that's obviously pointing towards video games--in fact a LOT of this plays like a video game! When Cera kills somebody points appear on the screen and when he goes off to face the final and 7th ex \"Level 7\" pops up. Also Cera has a gay roommate (played to the hilt by Kieran Culkin) who is shown in a positive way and even has a fairly hot guy on guy kiss. He also sleeps in the same bed as Cera and WITH his boyfriend.The acting is good across the board. I never really liked Cera but he's perfectly cast here. Winsted is charming as Flowers. All her exes are well acted but my favorite had to be Brandon (Superman) Routh with blond hair as a mighty vegan. So I'm not quite sure what the point is here (if in fact there IS one) but I was never bored and found myself laughing quite a bit. I give it a 9.",
    "87": "It is always truly delightful to see a major motion picture take a real chance, blending a daringly new angle into a familiar template and culminating in a doubly enjoyable final product. Director Edgar Wright's Scott Pilgrim vs. the World is such a triumph, undertaking a cocktail of manic energy and charm, dazzling visuals, unassumingly quirky humour, while still boasting an unmistakable (albeit pixilated) heart. Nonetheless, the film's poor box office suggests that many audiences and/or distributors are finding the idea of the film alienating (too nerdy? Too stylized? Too young and hip? Too Canadian?). However, at the risk of being excessively blunt, such concerns are largely unwarranted and, for the most part, missing the point. For while Scott Pilgrim may seemingly the tailor made film for those old enough to remember classic Zelda yet young enough to still have played it, the film's true genius lies in its fundamental accessibility, hitting all the right notes to delight fans of Brian Lee O'Malley's graphic novels without alienating those unfamiliar with any variety of geekdom. While video game and comic book adaptations have become quite common multiplex fare of late, there is still something that feels so fundamentally unique and crisp about a film set in a more overt overlap between 'reality' and the physics and credulity bending of the aforementioned media. Even just by considering how much astronomical thought and care were invested into the minutiae of the production (the film opens with an 8-bit, classic video game style Universal logo, and throwaway references to any number of cultural texts abound – watch for 'Launchpad McQuack'), the film boasts such a determined earnestness that it is nigh impossible not to love. Wright, expanding upon the same wild yet harnessed hilarity he exercised in Shaun of the Dead and Hot Fuzz, strikes a perfect tone and pace, with quick cutting, hip dialogue and a potentially disjointed and episodic story flowing without a single stumble or hitch. Equally, the whimsical visual effects (ranging from electric bolts dancing across the screen when Pilgrim's band, Sex Bob-Omb, play, to visual sound effects punctuating brutal Evil-Ex battles, to throwaway touches such as a \"pee bar\") never threaten to overwhelm the story. Yes, story. For, while the film may be an admittably hard sell (the protagonist must battle his love interest's Seven Evil Exes in wildly choreographed video game style fights to be with her? !), Scott Pilgrim is as far as can be from mere hyperactive, flashy cinematic noise. Instead, Wright continually draws the focus back to the emotional heart of the story, paradoxically seeking intrinsic realism through fantasy and achieving both the most and least believable film in ages. Tapping into the obsessions, neuroses and hang-ups of a lovelorn, confused, whiney, aimless, occasionally downright dislikeable yet always lovable 22 year old and vibrantly letting them loose on screen, Wright's film proves far more resonant and truthful than first glance would suggest. The film's set pieces, the battles with Ramona Flowers' evil exes, apart from being exhilarating blends of blinding choreography and visual trickery, ultimately prove cunningly symbolic vehicles for the characters' largely unresolved emotional conflicts being hashed out with the sort of gleeful violence any frustrated young adult is bound to want to wreak on their nearby environment. Between the stomping, hard rock score (much of it performed by the cast), Scott Pilgrim could prove one of the most cathartic movies ever. Also, on a personal note, it is rather heartwarming to see an unabashedly Canadian big budget action movie, for once set in Toronto and not 'Toronto posing as New York'.Nonetheless, all considered, it is the ensemble cast who truly elevate the film to its triumphant heights. Michael Cera, finally provided more nuance than his usual neurotic misfits, is perfectly cast as Scott Pilgrim, his nearly unmatchable comic timing and ability to bleed charm and charisma even at his most whiney, clueless and unsympathetic making Scott a supremely relatable and enjoyable emotional foil. Mary Elizabeth Winstead does a remarkable job of humanizing her idolized Ramona Flowers, as every time Flowers appears too aloof and distant to truly take to, Winstead's eyes radiate a heartbreaking sense of empathy and self-regret, culminating in a beautifully understated yet effective performance. Similarly, Ellen Wong alternates between irresistibly adorable, hilariously obsessive and quietly tragic as Scott's scorned high school girlfriend Knives, the three forming an unorthodox yet perfectly pitched romantic triangle. As Pilgrim's 'supporting characters', Kieran Culkin just about steals the show as Scott's bemusedly detached gay roommate Wallace, Anna Kendrick chatters with comical scorn as his sister, and Mark Webber, Johnny Simmons and Alison Pill are side-splitting as Pilgrim's meager yet impressive band (Pill, in particular, being graced with one of the most hilarious deadpans in cinema history). On the opposing team, each Evil-Ex in turn chomp the scenery with delicious aplomb, with standouts being Chris Evans' unforgettable Hollywood meathead, Brandon Routh as a snappy vegan with mystical powers, and Jason Schwartzman epitomizing sleaze as a smarmy record producer, though Satya Bhabha wins extra points for delivering one of the most unexpected song and dance numbers in recent memory as Flowers' vindictive first boyfriend. Apart from being effectively the most satisfying translation of O'Malley's graphic novels any fan could hope for, Scott Pilgrim vs. the World proves the film to beat in terms of fusing a bravely niche approach into good, old fashioned, accessible entertainment without ever sacrificing on edge, hilarity or even complexity and never compromised by its genre trappings. Near essential viewing and better on ever watch, Wright delivers a true KO of a film, if ever there was one. -10/10",
    "88": "\"Scott Pilgrim vs. the World\" is Edgar Wright's third film, following the well-received British comedies \"Shaun of the Dead\" and \"Hot Fuzz\". This film is a comedy as well but, rather than a genre parody, it's an adaptation of a series of graphic novels.The story is fairly simple: When the title character meets the woman of his dreams (literally) he soon discovers that if he wants to win her heart he'll have to defeat her seven evil exes. The story plays out in video game style with battles interspersed among the more realistic elements of the plot.Wright's direction is consistently impressive as he throws all sorts of colourful, energetic visuals at the viewer. I don't know how much of that comes from the graphic novels but, regardless, he did a fine job of translating it to the screen. I can honestly say that I have never seen another film that looks quite like this.The music is good, too. For the fictional bands, original songs were contributed by Beck, Metric & Broken Social Scene. I also liked the apt usage of \"Under My Thumb\" by the Rolling Stones.As for the cast, it's expertly assembled with no one seeming out of place or giving a weak performance. Michael Cera brings his unique charm to the title role and Mary Elizabeth Winstead's Ramona Flowers is truly a woman worth fighting seven evil exes for. Kieran Culkin stands out in support and the evil exes are deliciously villainous.In the end, \"Scott Pilgrim vs. the World\" may not exactly be 'an epic of epic epicness' but it certainly is a very enjoyable way to spend a couple of hours. However, I doubt that most viewers above a certain age group (say, 30 or so) will really 'get' the film. I think that's a shame, though, since the story is deeper than the video game-inspired plot and visuals might lead you to expect.",
    "89": "Witty, silly and tons of fun. Michael Cera plays a bass player for a rock band who falls for an ultra-cool alterna-chick, Ramona Flowers (Mary Elizabeth Winstead), who just moved to town. Unfortunately, her seven evil exes have formed a league to destroy any new love interest, and Cera finds himself in frequent Street Fighter-style combat against them. The movie is very heavily influenced by video games, and it appeals mostly to those of us who grew up on Nintendo. Even if you're not one of those people, the film really doesn't completely rely on these references to survive. Edgar Wright, the writer/director of two of the funniest movies of the last decade, Shaun of the Dead and Hot Fuzz, is a great comedic director, and the film is full of great comedic timing and detail. The movie is also blessed with a fantastic cast, almost overstuffed with great performances, really. There are so many great characters in the film, some of them get short shrift. My favorite character was the girl whom Scott dumps before moving on to Ramona, Knives Chau (Ellen Wong), a Chinese, Catholic high schooler who obsesses over him for the rest of the movie. I also loved the sarcastic drummer from Scott's band, played by Alison Pill. Last year's Oscar nominee Anna Kendrick also co-stars in a far too small roll as Scott's younger sister.",
    "90": "Scott decided to come out to the world during the worst possible year. The general public, rightfully so, was so put off by such idiocy thrown at us this year, that many stayed away from the little films that, in the creativity field, dominated the large pieces of crap. Too bad.First they missed the great Kick-Ass, followed by Michael Cera's other wonderful release: Youth in Revolt. Come to think of it, one of the best comedic talents we have out there barely has a hit to his name (aside from, maybe Superbad) and that's regrettable. Just as nowadays we not only hardly have any music group that has multiple #1 albums, like in the 1990s and before, we have too few great and talented stars, like Cera.I could say SEE: Scott Pilgrim Vs. the World a hundred times, and just about no one will listen. And no, it's not because I'm not a respected critic – who really is? It's probably more to the skeptic viewer who's been burned for far too long.But, at any rate: SEE THIS MOVIE. It was funny, wildly original, fantastically shot, had an awesome soundtrack and deep acting. Nicely, it took what worked with Zombieland and Kick-Ass to the next level. Heck, throw in a little of the original 1960s Batman series to boot.Scott, 22 (Cera) is a nerd and is dating a high school student until he dreams up his dream girl, Ramona V. Flowers. As always, she's got baggage: seven ex's he has to defeat to keep the girl.Okay, that's the (very) basic premise. In between, he comic-book-ish fights them with powers that no one seems to question. The bad guys fly and sling video-game flame balls and Scott equally rises to the occasion with an air knock out. While all this is going on, there's a stalking ex-girlfriend, a battle of a different sort involving a band that Scott's attached to and a gay roommate played perfectly with excellent timing and comedic lines from no other than a Culkin (Kieran.)In fact, Wallace (Culkin) was one of the best characters of the story. It's refreshing to see not only two best friends/roommates be gay and straight and even non-sexually sleep in the same bed – but also of the two, the gay friend is the dominate one. In 99.775% of all films involving the \"gay-sidekick/friend/comic relief\" they're played small, weak – though sometimes all-knowing, but at the same time, it's the straight that has everything together. It's the opposite here. The only other film I can reference here was the relationship in My Best Friend's Wedding, but that, like Will & Grace, was, like always, a homosexual male and BFF female. Here we have a perfect male-male-non-sexual gay/straight friendship.But, I digress; this isn't necessarily a gay-themed movie. This is about action, romance, fantasy, a whole lotta fun and great special effects. In between, you'll meet and love Ramona who has more depth than her hair colors. You'll get inventive ways to fight each of the seven nemesis ex's. Butthat's also a complaint of the movie.Despite the comic book it's based upon, why couldn't it have been 3 or 4 ex's max? The movie dragged a bit, and though each challenge (or battle) was exciting to watch for superbly choreographed action sequences, it just kept going on a little too long after awhile.Eh, just sit through it. Have a great time. It's not for the mainstream – WAY unfortunately – but it's for those who just want pure fantasy, it's for those who grew up on both comics and video games and it's for those who truly believe the geek can get the girl. Doesn't Cera always? SEE THIS MOVIE.",
    "91": "Michael Cera films are close to home for me. Cera always plays a nerdish sort of loner character that I can relate to. Superbad and this are both films by him that I can put my shoes in his position. Scott Pilgrim is a graphic novel series that I never heard of until a few months ago after seeing a trailer for this film. Apparently, Scott Pilgrim is the character in his self titled graphic novel series in which five books were made with the first one being made about five years ago. Im unaware if this one focuses on just the second book (since both the second book and the movie share the same title) or if the movie is just an all around overview of the series. Whatever it is, its an excellent, 80s style, comic book movie combined with likable characters and a mindblowing soundtrack.The standout of this movie is the soundtrack. The music by Scott Pilgrim's fictional band, \"Sex-Bab-Omb\" stands out totally. The music is so intense it shakes the screen whenever played. The music literally causes drawn lightning bolts and jittering of the camera when played which is awesome and gives you the feeling you're in the environment. Its a unique, almost indescribable feeling. Its so fast moving and energetic by the time you realized what happened a new scene appears. Its a feeling that can be had, unless you watch the film yourself.Scott Pilgrim (Michael Cera) is a twenty two year old slacker whos life activities are playing video games and in a band. Hes dating a seventeen year old High Schooler named Knives Chau (Ellen Wong) in which he's gotten a lot of hate for by his sister and fellow band members. He frequently sees a girl in his dreams whom he saw at a record store not too long ago. He meets the girl who is Ramona Flowers (Mary Elizabeth Winstead). Ramona is a quiet, shy woman, who is known for her frequent disappearances and mysterious personality. Her and Scott go steady for a while then after a random fight at a concert, Scott is told by Ramona that he needs to defeat her \"seven evil exes\" to continue dating her.The film plays out like an arcade style game from the 1980s and various references to the video game \"Pac-Man\" confirm that as well. Every time one of the evil exes is defeated various coins explode out like a video game causing Scott to collect them which is strangely amusing. Director of this adventure, Edgar Wright has proved to be more than just capable of British Comedies doing Shaun of the Dead in 2004 and doing Hot Fuzz two years later. He is now shown to have a talent in graphic novel adaptations of other series he didn't start as well.From the 16 bit like Universal intro I knew this was going to be a great film. It has some strange moments and sometimes the text on screen becomes annoying and somewhat tedious, but its definitely a teenage movie. Its a movie that should be enjoyed by people between the age of thirteen and thirty and by male audiences. Anybody with a knowledge of classic 80s and 90s video games will like this and the movie does a good job introducing the characters and their personalities to newcomers to the series (as am I). I will hunt for the graphic novels as I am interested in other events held by Scott Pilgrim.One more thing that bothers me though is the film made a mere $10 million in its first week. It may seem fair, but with an estimated $80 million budget its abysmal. More people should see this because it's probably the most original movie in a while. It almost jumps off the screen without the use of the RealD technology which more movies should use. Movies shouldn't use 3D to jump off the screen. If they want to find a way to bring the audience suspense and feel like the third dimension without making them where glasswear, watch Scott Pilgrim and it'll show the way and the possibility of the action.Starring: Michael Cera, Ellen Wong, and Mary Elizabeth Winstead. Directed by: Edgar Wright.",
    "92": "Metaphorical dating in comic book style filmmaking from the guy that brought us Shaun of the Dead. An original display of excessiveness when it comes to dealing with a new relationship and the baggage each person brings to it.So many now famous actors in supporting roles lends this film a more nostalgic viewing than what was probably intended. Seeing a young Ms Marvel with Captain America without so much muscles, and the guy from most of Wes Anderson's films (Jason Somethinglong), all led by a pre-Juno Cera and amazing Winstead, most known for Sky High and Final Destination 3. An all star cast now, but mostly unknowns when it came out, this film showcases much of their deadpan humour.From great fight sequences to hilarious dialogue, all cut superbly into a page-turning masterpiece! The storyline is so simplistic it borders on a Jerry Lewis film, but it is so well crafted that the viewer is as invested as an Oliver Stone historical recreation movie! We want Pilgrim and Flowers to succeed and overcome their individual quirks (maybe even OCD's) to surpass the weight of each's grudging ex.Can't wait for a sequel!!!",
    "93": "Scott Pilgrim vs. the World is a movie based on comic book series that takes place in a video game world. This world is the imaginary wonderland of Toronto, Canada. Scott Pilgrim (Michael Cera) is a 22 year old bassist for his garage band, Sex Bob-Omb. He's a simple minded and laid back kid without a whole lot on his mind. That is until he meets Ramona Flowers (Mary Elizabeth Winstead). He immediately falls head over heels for her, as she is (figurativley and literally) the girl of his dreams. However, as soon as he starts dating her, he learns that this love comes with a price. In order to date her he must defeat her seven evil exes. And so the fun begins, treating the audience to an outrageous and hilarious ride.From the get-go we learn that Scott Pilgrim vs. the World is not a serious movie, yet its not a joke movie. The gags in this film are used so artistically and so creatively that every moment will have you smiling at the hysterical new reality created within this fantastic film. The director of this film is the British genius Edgar Wright (Shaun of the Dead, Hot Fuzz). The entire movie is ripe with Wright's trademarks and does not at all lack the blend stylistic and comedic brilliance seen in his other films, even with the absence of Simon Pegg and Nick Frost. Scott Pilgrim vs. the World has a very specific style to it, and even after almost two hours of it, it never gets old. The movie never loses focus on what it is and stays at the same level of quirk and charm the whole way through.Scott Pilgrim vs. the World is based off of a comic series written by Bryan Lee O'Malley. I wasn't familiar with the comics at all, and there were points in the film where I thought it may have been funnier if I had read the comic, but overall it does a fantastic job of not alienating people like me. Instead of being a panel by panel adaptation of the comic, it creates its own style that anyone with a broad sense of humor should be able to enjoy. It is so rare that a comedy is released these days that brings something new to the table. Scott Pilgrim finally breaks this trend and delivers on all levels and absolutely amazes. It's also not often that I never want a film to end while watching it. Scott Pilgrim broke this trend as well. I was so transfixed and entertained by this stunning piece of satirical art that I couldn't get enough. There wasn't a single moment where I thought the film lagged or lost touch with me, and that level of consistency is something you don't see enough of today.Scott Pilgrim is an excellent blend of everything you could want from film this day and age. Its fun and entertaining, while also being meaningful and captivating. It interweaves hilarious jokes, played up in all sorts of fashions ranging from sight gags to social commentary, into an actual story rich with character development and a plot that excites and entertains in its own way. The story is also a great blend of being action driven as well as character driven. There is quite a wide array of characters in this film. The cast is really an ensemble led with full force by Micael Cera. Each character has some odd and funny quirk to them, always leaving you wondering what they could do next. I know I'll be coming back to this film many more times, not only for the entertainment value, but also the great and relevant story it tells in the midst of hilarity and absurdity.Visually fantastic, and all the while attention grabbing and imaginatively grand, Scott Pilgrim vs. the World is a must see for this summer.",
    "94": "This is the most fun I've had at the movies for a while. I believe is it because it is inventive in several ways and the inventiveness is coherent through the thing and across the narrative pathways (cinematic effects, narrative rhythm, character reactions). It is not difficult to push the envelope in any one of these, in fact I see it done even accidentally because film conventions form such narrow roads.But it seems difficult as getout to control it well enough that it emanates from a coherent world, to make a long form project that lives in the inventiveness rather than just sees it from time to time. Much of this is credited to the filmmaker, and how he can focus his team. Since there is very little motion capture, the effects did not have to be planned in advance and I imagine there was a lot of tinkering.Some of the credit has to go to the source, which I understand is a comic. I have not seen it but I imagine the overall shape was set and refined there. But we have to give the key actor credit too. He has to understand the cosmology of the thing well enough to convincingly inhabit it. This is a difficult acting challenge. Remember Bill Murray? It was his gift I believe to anticipate the finished tone of the film and place himself square within it. \"Groundhog Day\" depended on us seeing that it made sense to him.I have to admit to a generational deficiency that made this even better for me. The girls were unattractive, excepting the redhead drummer who is shunted to buddy status. They were emotionally damaged, intellectual nitwits and not physically desirable. In the story of course, they are all a guy lives for, literally. I am imagining that it made sense to the young audience that these trivial beings mattered. But for me, it increased the weirdness and otherworldliness of the thing.Ted's Evaluation -- 3 of 3: Worth watching.",
    "95": "Edgar Wright has been very quiet since hitting the headlines 3 years ago for the outstanding British hit Hot Fuzz and in that time he has managed to conjure one of the most original and exciting comic book adaptations ever.Considering the recent successes of The Dark Knight, Iron man and Spider-mans amongst others that is rather bold but somehow the director and writer has taken a simple love story and made it thoroughly entertaining, humorous, diverse and tantalizing it is quite necessary to see Michael Cera stars as Scott Pilgrim who falls for Mary Winstead's Ramona Flowers, a frivolous newcomer whom he would like to date. Only he has to defeat her seven evil exes to do so.What ensues is some of the finest action comedy romantically enhanced comic battles ever to be shown on the big screen. That is to say there are many flashing battle stances with \"vs\" being screened centrally and split screen shots, as if watching a comic book literally come to life.We are soon in the groove when the Universal logo pops up and then we zoom straight in to the battle of the bands, the life of a love struck teenager and his affection's terrible past. There is a lot going on which boasts the excitement and intrigue to maximum velocity and before you know it the film has ended and you will immediately want more.The music is a worthy mention as all the way through there are many knockout hits (no pun intended) and one in particular that stands out.The Clash at Demonhead's rendition of Metric's Black sheep is a fantastic moment for plot and sound and encapsulates the moment significantly.Regarding the fights there are some great cuts of direction by Wright, brining the action to life. The flying words are terrific and often bizarre. There are moments when you wonder what is going on, particularly the vegan police and the dancing skeletons but regardless the context of the moment is always spot on.A few minor hiccups include the viewer's emotions when the film draws to a close and the situation fixating on the final evil ex boyfriend.These are immaterial considering what we have been treated to by surely the best director to come out of Britain since Guy Ritchie.",
    "96": "\"Scott, if your life had a face, I would punch it.\"Scott Pilgrim Vs. The World is easily the most purely and totally entertaining movie that I've seen in ages. It's the epitome of video game culture on film, a great comic book adaptation, and just flat-out fun.For a movie with so many flourishes, bells, and whistles, the story is quite simple and effective. It's even driven by love, awww. Scott Pilgrim is a 22 year-old video game fan, band member, and a nerdy version of a ladies man. He's also a little immature and selfish, as a lot of people in their early twenties can be. When he meets Ramona Flowers (Mary Elizabeth Winstead), he's instantly and totally smitten. So much so that he forgets his current girlfriend and pursues her with full fervor. And it's fortunate that he's so head over heels, because Ramona has seven evil ex's who are determined that she's either going to be with one of them, or no one at all.And those conflicts are settled by fighting. Wild, kinetic, inventive fights that can only be summed up as epic. Like the rest of the movie, they're infused with video game culture in a way that's irresistibly appealing to me. This entire movie just feels like it was made for me and people like me, and I love it for that. My only complaint is that a little under 2 hours in not nearly enough time to flesh out the myriad of cool characters. A lot of the side characters only get the minimum of attention, and that's unfortunate (but understandable). But hey, you're going to want to check out the comic after seeing this anyway, and then you'll get to see all the cool bits and characterization that had to be omitted to ensure a reasonable running time. Other than wishing it was longer, I had no issues. The movie was consistently hilarious, Cera was a great Scott, Winstead was a great Ramona, the whole cast rocked, the music rocked, the fights rocked, and there was all the style and fun you could ask for. Scott Pilgrim Vs. The World is the best movie I've seen this year, and Edgar Wright is a genius for pulling this off so well. You may not love it as much as I did if you're not a part of its targeted demographic, but it's such an entertaining movie that anyone with an open mind has a strong chance of at least liking it.",
    "97": "For starters, I'll say that I have read the first few graphic novels in the Scott Pilgrim series by Bryan Lee O'Malley and had seen a couple of trailers, so I thought that I had some idea what to expect as I went to a pre-release screening in Omaha. Still, my expectations were blown away. To bring such content to the big screen from a graphic novel is always a challenge, and with the content being so video-game centric, perhaps even more so. However, Edgar Wright clearly overcame the challenge with great casting, good pacing, and what I can only call appropriate special effects.From the appearance of the Universal logo and music at the beginning all the way to the end (well, the start of the credits, at least), I found the movie an incredibly fun experience, with many laughs at sight gags, one-liners, and the random geekery that the people who made the film obviously knew that their target audience would be looking for. Additionally, a good soundtrack surrounds much of the on-screen action.I know that there are people who just think that Michael Cera is the worst thing since unsliced bread, and these are people who should clearly avoid this film for the sole reason that it contains Michael Cera. I think he works well in this role. There are times where the actor can make or break a film, but I don't see Cera breaking this film.Scott Pilgrim probably won't be breaking any box office records, but I'd like to think that word of mouth can help this film get the attention it deserves from the audiences that would most appreciate it, which would be those who enjoy classic video game culture and the interesting characters in this film who live in a world which many a Nintendo Power subscriber could only dream of.Just don't go in thinking you're going to see Shaun of the Dead or Hot Fuzz, as you'll likely be disappointed. This is a very different film, but I would say that it's trying to have as much fun as either of Wright's other two most popular films.",
    "98": "Excellent soundtrack? Check. Great attention to detail? Check. Excellent visual effects? Check. Plethora of funny moments and witty dialogue? Check. Zelda reference? Check, and check. Scott Pilgrim easily ranks as the greatest video game film of all-time. In a cinematic world full of video game movies that fail to capture the detail, pacing, and magic of gaming, we have Scott Pilgrim showing how its done. Superbly directed by Edgar Wright and followed by a great cast of actors and actresses, this film is perfect for the gaming culture, and the deeper you are embedded in the cult world of video games, the more you will enjoy this flick. Word of warning, if you aren't that much into the sub-culture of video games and all its glory, you may not see this film as epic as it truly is.Scott Pilgrim vs. the World is about a slacker bassist of an underground band (Michael Cera) bouncing around depression and attempted recovery after a tough break-up. While messing around with a high school girl (Ellen Wong), Scott discovers the woman of his dreams, the beautiful, mysterious, and hip Ramona (Mary Elizabeth Winstead). But she comes with baggage: a slew of evil exes that Scott must defeat. Based off of the successful underground comics of Bryan Lee O'Malley, Scott Pilgrim vs. the World is unlike anything you've ever read; and with the thanks of Edgar Wright (Shaun of the Dead, Hot Fuzz), unlike anything you've ever seen. It is tough condensing multiple volumes of a detail-frantic comic book into a movie, but Wright and Michael Bacall did a great job translating the energy, speed, and silliness of the comics into film.Michael Cera gets a bad reputation for being a one-trick pony, someone who does the same type of performance. This is both incorrect, and not really his fault. His scrawny, thin, deadpan look can only get him certain types of roles in Hollywood (he reminds me of the slew of Italian actors that are seen in nearly every mobster/mafia flick of the 90s and 2000s---good actors, but typecast because of the way they look). But if you look at Youth in Revolt and Nick and Norah, you'll see a different side of Cera. In this case, we see a more desperate, less charming, not-as-likable but more ass-kicking Cera taking the spotlight. Then let's not forget the great scene-stealing performances of Ellen Wong, Chris Evans, Aubrey Plaza, and especially Kieran Culkin.Visually, this movie reflects a video game better than any video game movie ever crafted. The 1960s Batman-like sound effect visuals are all over the place, the fights are exaggeratingly fast and epic, the hilarious subtle details are all over the place, the screen splits into multiple frames constantly, and even the slower sequences flow like cut-scenes of a game. Edgar Wright is perfect for the directing because of his kinetic-style of editing and direction (ex: Hot Fuzz). Perfect for those with ADD, the flick moves from one scene to the next with such quick pacing, entire days can pass through your eyes without you noticing. The battles themselves are so fast, only those with trained eyes (in the art of fast-paced gaming that is) can follow the insanity without giving up.Now, with the movie being made specifically for those that dwell their lives into the culture, it might be an intimidation for those that don't appreciate the art of video games and the slackerish laid-back society it creates. If you don't know much about video games and all they have given us over the years, you'll see this as loud, crass, immature, and pointless. But, for those that have experienced 8-bit Mario and Zelda, enjoyed their Street Fighter II (and allllll their spin-offs), fumbled through Battletoads and Streets of Rage, and know the satisfaction of leveling-up to the ultimate level, you'll get a kick out of this, guaranteed. Just like Fight Club and its counter-culture anarchist ways, and Seinfeld and its New York City post-modern ideals, the more Scott Pilgrim represents you, the more you'll understand and love it.Of course, with the fast-paced style of the movie and the calmer character-developing moments of the comic book, there is bound to hit a contradictory snag. Scott Pilgrim works best when it's fast-paced and with multiple witty jokes waiting right around the corner. So, whenever the movie has a small slowdown to give the characters time to grow and reflect, it really, really feels slow. And while it doesn't destroy the movie, it does slow down the third act, even with an epic final battle and light-hearted ending. After two strong acts, the third act had a tough time catching up. Wright's best is usually saved for last, with Hot Fuzz's final shootout being an excellent example. Luckily though, it isn't too much of a distraction thanks to the wonderful cast and the strong visuals that remain fun to watch throughout the rather-long running-time (for a video game movie that is).Bottom Line: Scott Pilgrim vs. the World is a perfect movie for gamers, and a perfect movie for those that appreciate the culture, diversity, insanity, and randomness of video games. The cast was great, the editing was flawless, and the directing was grand. While the third act left me desiring more and failed to live up to the strong first two acts, it remains a movie I strongly recommend if you own any type of old-school gaming system. Just like the comic book, Scott Pilgrim is epic, hilarious, fun to watch, and an absolute delight. Yet as previously stated, if you are not trained in the world of gaming, then this flick will unnerve and perhaps even scare you. Visually stimulating, insane, and out of control, Scott Pilgrim represents gaming on the big-screen like nothing I've ever seen before.",
    "99": "Scott Pilgram, a comic series unlike any other, is brought to insane life onto the big screen. When I first heard about this, I dismissed it as some lame movie, but to my surprise it isn't. This is one of the best movies with the word \"versus\" in the history of cinema. It's so absolutely mind-blowing that I can't tell if the author of the comics was tripping on acid when he made this.Now on to the plot: Meet Scott Pilgram, a teenage boy who has his own rock band, been in a few relationships, lives in an apartment with a homosexual roommate, and happens to be the best fighter in town. When he meets a mysterious hair-color-changing girl named Ramona, Scott suddenly falls in love. However, to be with Ramona, he has to defeat her seven evil ex's, each with their own skills and powers, in awesome and hilarious video game style brawls to the death.All I can say is that this film is pure freaking genius. Action-packed and incredibly stupid (in a good way). I wish I had fights like these, then my life would be complete! All the evil ex's are delightfully despicable, each having their own funny little quirks. This is a wonderful movie and I recommend that you check this out.",
    "100": "It's sometimes career suicide when making a film based on already produced, cult-adored material because the material (TV show, comic book, video game) has a rabid fanbase. I'm not familiar with the six-volume, American manga series, \"Scott Pilgrim\" by Bryan Lee O'Malley, but its' cine-adaptation, \"Scott Pilgrim Vs. the World\" by Brit fanboy director Edgar Wright (\"Shaun of The Dead\", \"Hot Fuzz\" and the TV series \"Spaced\") is enough to make me a convert because it has the pulse of a heroin-addicted jackrabbit. Keep up, people! No doubt Michael Cera (\"Arrested Development\", Superbad\", \"Juno\") is geek-familiar in the title role, a twentysomething, struggling indie rocker in Toronto who either jams with his buds Stephen (Mark Webber), Kim (Allison Pill of \"Milk\") and Young Neil (Johnny Simmons of \"Jennifer's Body), hangs with his sharkish gay roommate Wallace (sly Kiernan Culkin of \"Lymelife\") or avoids the great buzz surrounding his ex-girl/rocker Envy Adams (Brie Larson of \"The United States of Tara\").Barely legal high schooler Knives Chau (lively Ellen Wong) captures Scott's heart, but the relationship's deader than a corpse. Enter bright-haired, American immigrant and Amazon delivery girl on rollerblades Ramona Flowers (cute, deadpan Mary Elizabeth Winstead of \"Live Free Or Die Hard\") in the pictures, and it's \"Knives Who?\" in Scott's head. Ramona returns his \"love jones\" but her seven ex-lovers (two are twins and one's a girl!) show up, mean and super-powered, forcing our hero into wild anime/video game duels, complicating his already shaky love life.If you understand the visual languages of anime, American and Japanese comic book, video games and indie rock, which are jam-packed in the script by Wright and Michael Bacall (co-wrote/starred in \"Manic\"), good for you because the average moviegoer would get a brain aneurysm. The co-writers know all the fringe pop culture storytelling tricks and hugs them: speed lines during battles; side commentary; captions introducing characters and locales, illustrating audio effects (a la the 1960s \"Batman\" TV series) and noting life points; limbo-like dreams; characters changing hairstyles and costumes; facial wild takes and enemies turning into coins after defeat. It's an assault on the eyes and ears, but film begs and deserves multiple viewings, especially on DVD.Nobody has a gray hair, sagging chin or an AARP membership card in the cast, but they have old souls, especially the two leads. Cera may be a typecast victim, but his role has a backbone, attracting Winstead's dour but colorful heart. The aforementioned supporting players are damn good gonzo; no cast of a TV teen drama could defeat them! Even the \"sane\" ones, popinjay-like, steel-eyed clerk Julie Powers (Aubrey Plaza of \"Parks and Recreation\") and Scott's hard-fact older sib Stacey (Anna Kendrick of \"Up In The Air\") fit in the madness. Bill Hader (also of \"Superbad\") is interesting the unseen voice.You also can't forget The League of Evil-Exes, a bunch of self-loving nut-jobs, Scott must handle one by one. Standouts include Chris Evans (who's been in a lot of comic book cine-adaptations since 2005) as a cocky action movie star; Brandon Routh (\"Superman Returns\" and a unfairly controversial-by-fan guest run on the geek spy series \"Chuck\") as a strict vegan guitarist/ Envy's current beau; Mae Whitman as a feisty lesbian with a metal whip and Jason Schwartzman (\"Rushmore\", \"Bored To Death\") as a slimy music industry power broker/the gang's leader.Like \"Sin City\", \"Watchmen (The Ulitmate Cut)\" and \"Kick-Ass\", \"Scott Pilgrim Vs. The World\" is another true-blue cine-adaptation of a comic book/graphic novel that gives the finger to conformistic, maturity attitudes while being mature in the process. Not a lot of people will \"get it\"(thanks ADD!!!), but give it time. Until \"Tron Legacy\", the film's probably the most video game-centric around. If they see this, hard-core gamers will refrain from drowning their sorrows in Yoo-Hoo, after being exposed to drek like \"Double Dragon\" and the \"Street Fighter\" films (not the Sonny Chiba films, mind you).",
    "101": "Scott Pilgrim vs. The World is co-written, produced and directed by Edgar Wright. He's known for many films but notably the Three Flavours Cornetto trilogy. I have heard so much about this film and the cult following is a big part of it but I've never seen it before, some part of me wish I watched this when I was a teenager but I still found the movie hilarious. The video game related action was entertaining and it actually had pretty good choreography, the visual effects made it look so nice.Michael Cera is Scott Pilgrim, a slacker musician who must win a competition to get a record deal and battle the seven evil exes of his newest girlfriend Ramona Flowers which is played by Mary Elizabeth Winstead. Michael Cera is perfect in this role, energetic and full of comedic talent. The whole cast was great.Bill Pope served as the cinematographer and his work is why this film works so well, on top of the writing and direction. The editing and pacing is excellent, the high tempo makes it so it's never boring, the editing deserves a lot of praise. The transmedia storytelling might be off putting for some but it works so well with this film, it wouldn't be a cult film without it, I'm sure. This might be one of the best comic book adaptions as the visuals are perfect, as it matches the style of video game and comic book imagery, that and the story plays out like a graphic novel in a way.",
    "102": "Though I could probably rave for hours tonight, I'll try to keep this short. After Kickass and Inception, I thought that for sure, 2010 would be plumb out of good movies. But oh boy. Like the other reviewer said, as the Universal Logo appeared in like an 80x50 resolution accompanied by a midi track, I knew this was going to be good. I somehow managed to make it through the seizure inducing beginning credits, then the movie took off. It was maybe a little slow for a few minutes, but now I realize it was only preparing me for the awesomeness to follow.Anyways, the acting was superb, and I completely have a new lovecrush on Mary Elizabeth Winstead. She could_not_have_been_hotter. In fact the whole movie is overrun with a cast that would steal the show in any normal movie, but here it's just a big collection of great young actors, which we rarely get to see. I think inevitably, and very unfortunately, this will be compared to Kickass, and that almost makes me sad, but also makes me happy that I'm getting to see both in the same year.So basically, if you've ever been into random games such as say, Zelda, Final Fantasy, well, you REALLY might not want to miss this one. It's not the perfect movie, but I think the director would shoot himself if it was. It's an entertaining movie, and while on one hand, the nerdier you are the more you'll get it, I think there's a lot to laugh at here for everyone. It gets my utmost endorsement.",
    "103": "Scott Pilgrim (Michael Cera) is the bass player for the aspiring rock band Sex Bob-omb. He's not a lady killer but one day Scott meets the girl of his dreams, Ramona Flowers (Mary Elizabeth Winstead). Instead of a typical dating ritual, Scott is plagued with challenges by Ramona's seven evil exes. Despite his lackluster physique, Scott can go toe to toe with most of them in hand to hand combat. When that fails he turns to the powers of his noggin or guitar.Scott Pilgrim vs. the World is the most video game-esquire movie I've ever seen. There are stats, one-ups, power-ups. Coins even appear when a foe is dispatched, suggesting that the audience/player continue the movie/game. These are all referential gags that build a fantasy atmosphere and make it difficult to question the feasibility of plot. Just about anything can happen, and when it did I was able to accept it.There seems to be no bounds to the inspiration that can be drawn from underground geek subculture. Most of the film has effects that bring to life the popular formats of manga, anime, and video game staples, but out of nowhere sounds and laugh tracks are lifted from Seinfeld of all places. It's not for the sake of being silly, everything adds to the style and tone of this fantasy/romantic comedy. Each battle is unique. Some elements carryover (the outlandish style of hit anime series Dragon Ball and video game inspired points system) but Scott is always able to apply a new approach for success, resulting in the frail Pilgrim outsmarting some of his tougher foes. Sometimes he's able to turn their egos against them, but my favorite outcome came when he tricked psychic vegan Todd (Brandon Routh) resulting in the appearance of the fabled vegan police. Michael Cera is famous for his typecasting as a soft-spoken slacker. Here he brings the usual to the table, trying to play the everyman while chaos erupts around him. But I suppose not every man is able to leap into the air to deliver a punch or survive being thrown into a castle. It's a far cry from the comedic action found in other works of director Edgar Wright (Hot Fuzz, Shaun of the Dead); trading blood for lens flare and superhuman durability, it's a friendly but intense PG-13.The outlandishness doesn't end there. Every secondary character has a clearly defined role and personality. There are many and each is memorable. Among my favorites is Wallace (Kieran Culkin) who periodically states the obvious. He'll interrupt a fight to inform Scott that he's fighting someone. Drummer Kim (Alison Pill) is low in lines but with each her cynical delivery garners a laugh. Lastly, newcomer Ellen Wong brings a comedic, expressive sensibility to Knives Chau, Sex Bob-omb's biggest fan.Its strength is a minor weakness. There isn't broad appeal to be found in the in-jokes and should you understand the point of reference you may find yourself laughing over another punch line—like a gamer, an audience member must be well coordinated.I would not be surprised in the least if Scott Pilgrim vs. the World endures in popular conversation for years to come. It's a generational film that will be looked back upon with all the nostalgia of Bill & Ted's Excellent Adventure. Scott Pilgrim vs. the World is too imaginative to be farce, and too funny to be forgotten.",
    "104": "Scott Pilgrim vs. The World has made me question just how well I fit in with my generation. According to other members of my generation, it is the movie to end all movies, and the best movie... I'm sorry... most EPIC movie ever. I'm partial to The Godfather myself. Scott Pilgrim is a film that I was looking forward to as Michael Cera has made me laugh numerous times in the past, and Edgar Wright is easily one of the more talented newer directors working today. Combined with the eye-popping visual effects, I couldn't see how these things could add up to anything less than a fun and entertaining film. Fun, to a point. Entertaining? Well...Scott Pilgrim's first problem is the plot. The plot is self-conscious and repetitive, as well as overly laid back and easygoing. Scott Pilgrim has to defeat his new girlfriend's seven evil ex's. That's the whole plot, and at no point do we get the sense that anything is at stake for these characters. I know that probably shouldn't matter in an effects-driven popcorn movie, but with nothing to root for, or no suspense of any kind, I found the film to get boring after the first thirty minutes. That is approximately when the first evil ex shows up. They fight. He defeats him easily. Too easily. The fight isn't all that exciting as a result. And with six of these to go, the movie became a tedious experience before it was even halfway over.Not to say the film doesn't have it's good points. Michael Cera, though not as witty as he can be, is still somewhat likable. And while the script lacks structure of any kind, it is jam- packed with hilariously quirky dialogue and brilliant sight gags. The filmmaking is generally good throughout, and as a director Edgar Wright hasn't lost his talent. Unfortunately, the poor storyline ultimately overshadowed these elements for me. Maybe it's because I don't play video games. Maybe I just need to read the comics. Or maybe I'm just becoming less fun of a person as I mature. I want to like this movie and take the same joy from it that my generation does, but I simply can't. I'll stick to films with stories and social relevance and enjoy being the outcast. Scott Pilgrim Vs. The World gets a generous 5/10 because I feel giving it anything lower would just make me look bitter.",
    "105": "I was lucky enough too see this film during a test preview to an audience that weren't told what we were about too see. I was honestly expecting some odd film that really needed a lot of help but i was pleasantly surprised with how great this movie was.The movie had everyone laughing, and i mean everyone, I've been too almost every Wright film and somehow the audience wasn't as amused as i was, but this time everyone loved it. I've never heard so much laughter in one cinema.The jokes were fast and although silly, they weren't stupid which made for quite an enjoyable film. Wright's trademark quick cuts, and simple comedy made this film, i personally think if it were directed by anyone else it wouldn't have had the same effect.The characters were well written and performed, every individual character fitted perfectly. The film had many scenes that were quite pointless but still quite funny for example the Seinfeld scene.Apparently its based on a comic book series? I've never heard of them before but i certainly will look out for them now. If you're a fan of Edgar Wrights films or just good silly humour you will love this film.Great comedy, definitely the best of 2010 8/10 Morgan",
    "106": "My nerd credentials are reasonably high—I have a comic book collection; I go to movie conventions; I possess one or two T-shirts bearing pop culture slogans and graphics; and I obsessively review cult films on IMDb—but I'm still nowhere near qualified enough to connect with Scott Pilgrim vs The World, a film that proudly enters the realm of the über-nerd, a plane of existence where Manga is king, Japanese vinyl toys are objects of desire, retro video games are cool, web programmers are gods, and designing and building your own PC is the mark of a true man.The hero of this film is a pale, scrawny wimp, the kind of guy whose awkward appearance would normally condemn him to a lifetime of self-doubt and feelings of inadequacy. In director Edgar Wright's nerd-centric universe, however, Scott Pilgrim is an aspirational figure: his entire existence is played out in video game/graphic-novel mode, with FX lettering and motion lines accompanying his every move; he's a bass player in a rock band; he possesses awesome fighting skills; and seriously cute/smoking hot girls find him irresistible (he even dates the gorgeous Mary Elisabeth Winstead—talk about punching above your weight!!!). In short, he is the ultimate geek icon.For those who closely identify with the guys in The Big Bang Theory, this film is going to be the stuff of dreams, the ultimate fantasy come true, thus earning itself a dedicated fan-base; in time, it might even make its money back from the lucrative 'dweeb dollar'. But to anyone who has even the vaguest semblance of a life within the real world, it's endless geek subculture references, heavily stylised and often surreal action, incessant use of game-speak, and elevation of obnoxious loser to hero status will seriously grate on the nerves.",
    "107": "The film centers on Scott Pilgrim (Played by Michael Cera), the bass guitarist for a band, and an overall slacker living with his gay roommate Wallace (Played by Kieren Culkin). His life is suddenly turned upside down when he falls in love with the mysterious Ramona Flowers (Played by Mary Elizabeth Winstead). Not only does he face the problem of currently dating a clingy teen four years his junior (Played by Ellen Wong), but in order to date Ramona, he must battle, and defeat her seven evil exes (Played by the likes of Jason Schwartzman, Chris Evans, and Brandon Routh), and along the way learns how to be a less selfish person.It's not hard to see why the film, based on the series of graphic novels by Bryan Lee O'Malley, might turn some away. The novels' built in fan base will love the film I imagine, but it might be pretty divisive to those who aren't familiar with the source material, this includes myself. As for the overall product, I loved it.The film is directed by Edgar Wright, who you may remember best for directing truly original, energetic, and hilarious comedies like Shaun of the Dead, and Hot Fuzz. Like those two, he does this film beautifully. The comedy is wonderful, his direction is great, and he makes this film a visual and audial spectacle. He smartly presents the film in the style of video games, making great use of graphics, and audio, as well as providing some inspired sight and sound gags. Unlike myself though, it could prove exhausting to some, even to the point of Terry Gilliam exhausting, but Wright knew full well what he wanted to make, what he wanted the tone to be, and he hit it right.As for the talent, I do think Michael Cera is getting majorly typecast in this sort of geek role, but he does a good job and provides some good laughs, and fans of his will be surprised by how much ass he kicks. Mary Winstead's character, and performance is great. She adds some clever nuances to her performance, and the mystery of her character makes her all the more interesting. The rest of the cast which includes Kieran Culkin, Ellen Wong, Anna Kendrick, Allison Pill, and the exes who I won't list individually, are fantastic as well, and get some great laughs.Now for the action. There are a few directors who do action better than Wright, but there's no one who does action quite like him. He's simply a master of scene build up, and pacing, and how he shoots the film, matched with the brilliant efforts of his film editors Johnathan Amos and Paul Machliss is simply inspired. Every cut, every transition, every change in frame rate is a pure masterstroke of ambition for a film that is fast paced, hilarious, visually stunning, exhilarating, and brimming with great talent in spite of the film's few imperfections.Scott Pilgrim Vs. the World is one of the year's finest films, and I give it ***1/2 out of ****",
    "108": "...like a lot of Hollywood movies these days, SCOTT PILGRIM feels very insubstantial. So much money has been put on-screen to make it look good, with special effects popping out at you all the while and all manner of technical wizardry, that real, grounded storytelling and 'meat' has been left by the wayside. I appreciate the constant homages to geek culture and video games, but at the end of this film I was left feeling curiously unsatisfied.The fight scenes, which pop up with an almost routine regularity, are spectacular. The choreography is often brilliant and the addition of the special effects is the icing on the cake. The film is colourful, fast-paced and quick witted with it. But what is there beyond the visual spectacle? The humour isn't all that. Michael Cera, who I've never seen before, is intensely irritating with that whiny, lispy little voice. It is possible to make geeky leading men likable (it happened with KICK-ASS) but Cera remains an irritant from beginning to end. Mary Elizabeth Winstead is much better as the object of his affection, but if you're expecting romance you'll be disappointed; such moments are non-existent.This is a flashy but ultimately unrewarding movie, something that jettisons proper plotting and character work in favour of a self-knowing, video game-style atmosphere throughout.",
    "109": "\"He punched the highlights out of her hair!\"Yeah, Yeah, I know, I'm late to the party (more than a decade late) but it is better late than never right? My grievances aside, I had so much fun in here. Scott Pilgrim vs the World is remarkably entertaining with its extravagant Video Game/Anime-Inspired visuals, a befitting score, and music numbers that rock (literally), and on top of all that, we get to witness (once again) Wright's inherent expertise in pulling off buttery-smooth transitions and framings.When it comes down to writing a Screenplay that will keep the audience mesmerized while being over the top and peculiar, all at the same time; there is nobody like Edgar Wright. He is truly exceptional, one of a kind! Not only does he effortlessly engage the spectators with his distinctive yet satisfying stylization but he also incorporates a ton of subliminal messages and symbolic innuendoes in the most sophisticated way possible!It's such a pleasure to watch his works!",
    "110": "Edgar Wright is one of my favourite directors working today. His films are oozing with creativity, style and innovation that I don't think anyone else can replicate. Only a visionary like him can make a movie like Scott Pilgrim work.Scott Pilgrim vs. the World is about Scott Pilgrim who falls in love with the beautiful hair dyed Ramona Flowers but has to first defeat her seven evil exes in order to win her love.This is a movie that could have EASILY gone wrong but thankfully Edgar Wright manages to pull it off. This is one of the most entertaining films to ever be made. Everything in terms of the film's presentation is extremely creative. All the battles between Scott Pilgrim and the evil exes never become boring or tedious due to the variety of fighting styles each one possesses. Not only does this film feel nostalgic but it's also refreshing to see something different and unique. This doesn't feel like a studio-led movie but one that had a lot of effort put into its story, dialogues and craft. The visuals provide for some really hilarious moments and the subtle nuances in the dialogue add to the creativity of the movie.Michael Cera essentially plays Michael Cera in this movie but it's effective as it perfects reflects the character of Scott Pilgrim. Mary Elizabeth Winstead is terrific as Ramona and has great chemistry with Cera. Chris Evans, Jason Schwartzman, Brandon Routh and the rest of the evil exes fit their roles perfectly and look like they're having the time of their lives. Kieran Culkin is really funny. The cast is generally fantastic.A staple in Edgar Wright movies is the fast paced editing which is no different here. The movie does not contain a single boring moment. Just by watching the film you could see how well thought out every element was. The constant X symbols and numbers telling you which evil ex Scott is facing are a few examples of the clever cinematography. The fights are really well choreographed and are directed with such grace and style. There really is no film quite like Scott Pilgrim vs. the World.If you are someone who loved playing video games and watching anime or martial arts, Scott Pilgrim vs. the World is for you as I believe it has the perfect blend of all of these.",
    "111": "(Synopsis) Scott Pilgrim (Michael Cera) is an unemployed 23-year-old bass guitarist in an up and coming garage rock band who is dating a cute 17-year-old high school girl, Knives Chau (Ellen Wong). He is having fun in life and rolling along at a nice even tempo until one day Ramona Flowers (Mary Elizabeth Winstead) rollerblades into his life. Ramona moved to Toronto from New York City to find peace and quiet and leave her past behind. No one knows what her past is, but Scott will find out very soon as he tries to make Ramona his new girlfriend. Before Scott can begin dating Ramona, he must prove himself by defeating the league of her seven exes who controls her love life. They will do anything to get rid of and destroy any new boyfriend Ramona may consider. If Scott wants to find true love with Ramona, he must defeat all seven, before the game is over.(My Comment) Scott Pilgrim is a comic book/video game and love story fantasy/comedy all in one movie. Scott is kind of a geek who falls in and out of love with many girls and Ramona has commitment issues. Putting them together only made for an incredibly funny experience with many laughs at one-liners and sight gags. The movie has a lot going on, with a love story, outrageous fight scenes, to awesome music, and visual effects with points and coins when Scott wins. The fight scenes are non-bloody and you don't have to take them too seriously. Each fight scene is more outlandish than the last one and some of them are used just for comedy. I was surprised to find myself enjoying the movie, because I am not the target audience for this. This is definitely worth watching, but I'd recommend it for the younger crowd (20's & 30's), it may even become a cult film. (Universal Pictures, Run Time 1:52, Rated PG-13) (8/10)",
    "112": "I went to see this despite having a very mixed but mostly negative selection of reviews. I'm very glad I went as this is one of the most enjoyable and funny films I've seen in a long time.Michael Cera plays the slacker who meets the girl of his dreams only to find out he has to battle her 7 evil ex's. Throw in some slacker friends, a gay housemate, a couple of previous girlfriends, plenty of computer game references and you have a very entertaining film. There are some really funny moments in this, it's really rare to find a film that makes me laugh out loud, but I did a lot throughout. It's also very clever story telling and adding to this are many more slightly less but still funny moments as well as an array of special effects which provide some great visual moments. Clever editing and quick cuts are used to move the story from place to place, effects are used to provide hints of the films comic book basis, but it never goes overboard or becomes repetitive.There is a great support cast, including a very funny Chris Evans, but Kieran Culkin as the housemate and Ellen Wong as Knives Chau also provides some laughs. Michael Cera is a real standout here. He is a very funny actor, though many of his post Arrested Development roles have been, well his Arrested Development role. Here though, whilst he never quite breaks the mold fully, he is less Michael Cera. His timing and delivery of lines is perfect throughout.My main qualm with the film is that it struggles with the story telling time frame. It starts quite slowly and the first few battles happen progressively, but suddenly the rest of the battles are grouped up together which then leads to an overly long finale.However, these issues shouldn't be enough to put anyone off seeing this. It's a funny, visually great romp and you don't need to be a computer/comic book/superhero nerd to enjoy it.More of my reviews at iheartfilms.weebly.com",
    "113": "\"An epic of epic epicness\" was the catch phrase of the movie, and really the best way to describe the movie. SCOTT PILGRIM VS. THE WORLD fully delivers on all the hype that it's built. From the 8-bit Universal logo to the video game form of Scott beating up the \"THE END\" after the credits, the movie is just sheer entertainment. At first, I wasn't sure. I saw Michael Cera's name and immediately shrugged it off. I've never been a fan of Cera and he wasn't the selling point for me in the least for this movie. What were the selling points for me were Edgar Wright (Director of SHAUN OF THE DEAD and HOT FUZZ) and the visual style of the whole movie. SCOTT PILGRIM is the first, true comic book/video game movie. I want to say that it's more of a live action comic book/video game than a movie. Everything from life bars, \"WHACKS!\" and \"SMACK!\" coming up in giant letters in the back ground, it is the most unique visual styles I've seen in years, probably ever. At its core, SCOTT PILGRIM is a love story. What I love about this love story is that neither of the main characters are perfect. Both are extremely flawed characters. Scott is kind of a douche as he falls in and out of love with multiple girls, while Ramona (Mary Elizabeth Winstead) has major commitment issues. And while I found myself disliking Scott from the get go and being fairly indifferent about Ramona when she comes on, they have very good arcs that made me rooting for them when the time came to really care. I also really like the supporting cast is nearly flawless. I'd say the highlight would be Kieran Culkin as Scott's \"Cool gay roommate\" Wallas. Every scene with him is gold. He's got this off beat charm and great comedic timing that just feels extremely genuine. While at times it can be a bit stereotypical, it's never offensive. Just slightly exaggerated for the sake of comedy. Along with him, Julie Powers (Aubrey Plaza) has one very memorable scene that I don't even want to hint at. It's used just enough to get substantial laughs without overstaying its welcome. I do feel that other supporting actors were underutilized like Anna Kendrick who plays Scott's sister. She's not in the movie much, but she's always a pleasure to see. The story alone is great, and without that, the rest of the movie wouldn't have been nearly as effective. Now I could have seen this as another mindless, hack 'em slash 'em, action fest event movie, but the effective story just makes the fun parts of the movie so much more to invest in. And when this movie gets fun, it holds nothing back. It may be a turn off for some to see the over-the-top action set pieces, but if you've seen the trailer, you know what to expect. Edgar Wright is a masterful director. If a lesser director had this project I doubt it would have been half as fun. Every set piece and fight sequence is extremely well shot with the camera far back enough where you can actually see what's going on. And there are shots long enough to see several moves be thrown back and forth between 2 or more characters. I can't recall any extremely close up and quickly cut fights in the movie. What's also cool is that you can actually see that some of the actors throw a portion of the moves themselves. Yes, there were doubles for the flips and stuff we all know Cera can't pull off, but it's not in the least bit distracting. We can buy it because of the universe that's set up for the film. SCOTT PILGRIM's world is as if they were actually in a comic and/or video game. It's got this surreal vibe and style to it that's fully entrancing and immersive. It helps tremendously with the ridiculous set pieces with high flying maneuvers and normally impossible moments. Really, the best way to describe it is \"f***ing awesome!\" It's a geek's paradise world. Small things from a \"pee bar\" and \"ding dong\" text appearing in thin air or being able to put a hat on that you didn't even have in your possession instantly on a moments notice to being able to leap 15 feet in the air and remain up there for several seconds as you pound the 65 hit combo or survive being thrown 70 feet into the side of a tower falling 5 stories. I can't really do the film justice for the experience it delivers. Both INCEPTION and SCOTT PILGRIM have given us true innovation. As for which is better is really up to taste. I think INCEPTION is probably a better movie, but I think SCOTT PILGRIM trumps it in pure entertainment value. It is an intelligent, geek fueled movie. I will say INCEPTION does have the greatest single set piece in recent years, but SCOTT PILGRIM has one of the coolest worlds created since TRON. \"F**k yeah!\" were the words that I said when the credits came up. SCOTT PILGRIM was one of the most fun experiences I've ever had in a theatre. While I'll wait until further viewings to place this in my favorite movies, I can definitely see this making it in my top movies of all time as far as how much I enjoyed it. It is my favorite film so far in this disappointing year. It's definitely something I'll watch at least 3 more times in theatres, and I suggest everyone see this in one, with a crowd.",
    "114": "It's funny, it's clever, it's undeniably sweet, and it all comes from the pages of Bryan O'Malley's hit graphic novel series of the same name. This romantic action comedy is not your average romantic comedy, it is a subversive action comedy that shuttles far from the usual rom-com conventions. Director Edgar Wright, following the success of 'Shaun of The Dead' and 'Hot Fuzz', orchestrates an electrifying love story with a style that echoes the works of comic books. Blending the action with subtle humor, clever pop culture references, and video game-style elements; this movie pulls viewers in for hyper-kinetic, stylized fun from beginning to end. And the main figure in the film's spotlight is charming comedic star Michael Cera, stepping in the shoes of the eponymous character. Set in Toronto, Canada, this film star Michael Cera as Scott Pilgrim, a 22- year old slacker who's life consists of playing guitar with his band known as Sex Bob-Omb and sharing an apartment with his gay roommate Wallace (played by Kieran Culkin). While dating an underage Asian girl named Knives (played by Ellen Wong), Scott fantasizes about a hot American girl named Ramona Flowers (played by Mary Elizabeth Winstead). Upon meeting her at a party, Scott forms a relationship with her while dumping his Asian girlfriend in the process. Their relationship quickly becomes disrupted however, when Ramona's seven evil ex-lovers are targeting him. With his relationship with Ramona at stake, Scott must defeat her seven ex-lovers in a series of comic book-style battles in order to win her heart.This movie is a sweet romantic comedy that takes its genre and polishes it with a shockingly creative twist that is likely to win the hearts of a much larger demographic. Unlike most romantic comedies which often nowadays slip in the cracks of formula and corniness, this entry pedals on a radical execution that transcends an average love story into a cartoon-style battle of good versus evil. As eccentric as this concept sounds, Edgar Wright makes diligent effort to make this one work. Opening with the Universal Pictures logo pinned an 8-bit fanfare, this film sets the character in a world incorporated with video game elements including a soundtrack from the 'Legend of Zelda' series which makes it way a dream sequence. The concept however, plays a major role in the hyper-kinetic fighting sequences when the titular character is force to face down against the former lovers of his new girlfriend. With animated heads-up display popping on screen and retro video game sound effects playing, these action sequences deliver pulse-pounding thrills that not only intend to keep viewers glued to their seats but serve as love letters for the video-game nerds. The sequences and the story itself move at a solidly fast pace, and there is rarely a moment that is wasted here. Although the caricature style of the action will definitely not be everyone's cup of tea, it sets out to be entertaining and not be taken seriously.Michael Cera makes a reasonable impression in the eponymous role. Suiting in his typical awkward teenager typecasting, Cera gives a charismatic portrayal of the titular character, sparkling the role with charm and humor. His quirkiness makes a match for his lover Ramona Flowers who is beautifully portrayed by Mary Elizabeth Winstead. While her bold performance stands well, the real driving force behind her romance with Michael Cera is not their cold chemistry but his desperate will to win her heart no matter what it takes to do so. The duo share a good amount of comedic bond with humor and dialogue that veers in the realm of subtly. Easily one of their most witty scenes takes place when Ramona metaphorically says \"we all have baggage\" and Scott responds \"Yeah, well my baggage doesn't try to kill me ever five minutes\", lines that shed small light in each of the characters's pasts with ex- lovers. Meanwhile, the story is driven the action between Scott and Ramona's ex-lovers which include a cast of Chris Evans, Jason Schwartzmann, Mae Whitman (Yes, a girl), Brandon Routh, Satya Bhahba, and a duo of Chinese actors -- most of which get a nice swipe at some clever humor. The rest of cast including Johnny Simmons, Kieran Culkin, Mark Webber, Anna Kendrick, and Alison Pill make good use of their screen time; nothing more, nothing less. Scott Pilgrim Vs. The World is a sweet, funny, video game-style comedy polished with plenty of stylized action and brainy humor, and makes for an entertaining testament to Bryan O'Malley's source material. Edgar Wright embraces an over-the-top cartoony style, and makes surprisingly good use with it. And for those who believe only video game fans or teen rom-com fanatics will find appeal out of this, think again!",
    "115": "OK, -this- is how a good comic book / video game movie should be done.\nIf you like any of the things on the following list, you should see this movie:\nretro video gamesindie bandscomic books / graphic novelswicked awesome actionhilarious funWhen I saw the trailer for this movie in March, I was taken aback that they would cast Michael Cera in a more action-type role instead of the wimpy guy he usually plays. Then I got the books and started reading. He was cast perfectly (as well as many others), not only for his big cow-eyes, but for the wimpy persona as well. Still, it was nice to see him branch out into something a little different for at least part of this film.I was glad to see that a lot of the more adult themes (which I thought put the books out of the \"Teen\" range) were cut for the film (more sex and homosexuals mainly). However, about half-way through the movie started to drift from the canon of the books. Not necessarily a bad thing, but I think the books had a little bit better ending.",
    "116": "I think it's sad that the movie did not do great business at the American Box office. I didn't know that up til a few minutes ago, when I saw it here on IMDb. I would have thought that more people got in and watched it. It is a very weird movie, that does not seem to care about conventions, be it story-telling wise (think the ending) or montage-wise (think ... well montage, where Scott gets ready).But maybe that was too much and too daring. I can see that quite a few people wouldn't like what they saw, it is not what most people might expect from a comic book movie. Though the comic does not seem to be very ordinary either (haven't read it yet).The cast is incredible and the jokes are really good. It might feel a bit distant and not emotionally grabbing, but that is on purpose. Which still might make you hate/love it though of course (depending on your taste). I did feel the movie a bit dragging after the middle, where it seemed like a video game, where you had to do/see another scene that was like the one before. It felt a bit like that to me, though that does not necessarily apply to any other viewer of course.Give it a chance on Disc, if you haven't already watched it.",
    "117": "\"I was more alone when we were together than I ever was on my own.\"Snarky rocker and video game fanatic Scott Pilgrim is just days into a relationship with 17-year-old Knives when he is smitten with a new girl, Ramona. Besides \"juggling two chicks\" Scott discovers that Ramona has seven evil exes who still jealously pursue and fight for her. In blind pursuit of Ramona, Scott dives into rabbit holes that blur fantasy with reality. \"I think I needed this,\" says Scott \"whatever it is.\" This new awareness, or perhaps deeper cluelessness, is all well and good, but to survive what is coming he needs to step up his game.One my favorite things about this film is the focus on relationships; discovering new love or new menace, mending wounds or moving on, and more. The knives of emotion cut in different and unexpected directions. This is especially the case for young and free city dwellers, the characters of this film, who are not so limited as previous generations were in the type of people they choose to woo. There are many intriguing and thoughtful relationship quips such as \"you should not have to rip yourself into pieces to keep others whole.\"This fun, independent and super snarky comic book tale takes place on the cold streets of Toronto, which is fascinating for me because I love this city. Fast-talking and sharp-tongued young adults dominate the screen with quirky characters played by Michael Cera (Scott), Mary Elizabeth Winstead (Ramona), and rising stars Anna Kendrick and Brie Larson. At first glance wimpy looking Cera does not look right for the part, but one would be wrong, for Cera's dead-pan delivery, inner spark and caustic wit pair well with the character. This innovative, creative and fun film appears widely on many \"feel good\" lists. I loved it more when I viewed it the first time, as it seemed to have more depth, but it is still spunky.",
    "118": "For some reason I was never drawn to this one. Every time I saw a trailer or snippets here and there I was not interested and thought it to be just not my style, similar to how I felt about 'Spy Kids' growing up. Finally, I decided to watch this over ten years later; my initial impression could not have been more inaccurate.Also, I happened to overlook that Edgar Wright is the director. 'Shaun of the Dead' and 'Baby Driver' are two of my favourite movies, and I'm very much looking forward to 'Last Night in Soho'. His vision is something to behold. In many ways it's so crazy and out there, but at the same time so unique and majestically crafted that it's very entertaining to watch. The hilariously clever dialogue is something to marvel as well. And I was hooked after the initial 'Zelda: A Link to the Past' sound effects.Michael Cera was great in 'Arrested Development', but this has to be his best outing, especially since he's the lead. An all star support cast too.Last note, since I'm Canadian (not at all from Toronto) I thoroughly got a kick out of the Canadian references. Specifically, when the coins fall on the ground in the one scene near the end you can see the loonies and twonies!",
    "119": "The premise is this: Scott is a 22-year-old bass player in a terrible Toronto band. He falls for a \"dangerously fashionable, roller blading delivery girl\" with punk hair called Ramona Flowers (Mary Elizabeth Winstead), an American transplant who \"starts cruising through his dreams and sailing by him at parties.\" He's smitten. His cheery band-groupie high school girlfriend (\"and she's Chinese\") Knives Chau (Ellen Wong) becomes irrelevant. The cool Ramona likes Scott too. But it turns out he must fight off Ramona's seven \"evil exes.\" This iron-clad, if inexplicable, rule is going to shape all the reels to come.The dialogue is witty and smart, especially at first. A lot of cartoonish, video game captions in the air (\"Pow,\" \"thunk,\" etc.) and other devices like scores and labels for new characters increase the feeling that this is a lively and quick-witted movie for and about the video game, texting, Facebook generation. Scott's intro line with Ramona is a silly factoid about the origins of the name Pac-Man, a bit of gaucherie he later denies. Cera has cool, quick delivery and good timing, which also help. So does the presence of Kieran Culkin (also a child star, from a child star family) as Scott's sarky, more mature gay roommate Wallace.Kieran Culkin is aging convincingly. But Cera, what of him? The androgynous, squeaky-voiced Canadian has been acting since he was eleven: he's a pro. Paradoxically, he projects his insecure young men roles with utter ease and confidence: there's got to be an element of the passive-aggressive in this whole nerd-superman concept. Though Cera's character is 22, and seems to have had a string of girlfriends, it's logical that Scott's dating a high school girl. Cera seemed fresh and charming in his first big roles. He can project a wistful, romantic quality that came through nicely in 'Nick and Norah's Infinite Playlist.' Now he seems to be playing roles tailored exclusively for him, like 'Youth in Revolt,based on a not-very-profound series of young adult novels (contrast the tougher, more honest writing of S.E. Hinton that produced a quartet of classic Eighties youth pictures). Youth in Revolt wound up rather limp as a movie -- and began to show Cera's lack of range, which is not disguised by the massive use of loud fast CGI for his duels with ex-boyfriends of his girlfriend here.Actually in 'Scott Pilgrim' Ramona is the character who seems most real. Winstead's speech sounds more sincere and less arch than anybody else's. Her character perhaps is so cool she need not put spin on her words.\"They make movies in Toronto?\" So goes one of many cute throwaway lines in a movie that before it's burned up its cred brings many smiles, and plenty of full-on laughs too.But then 'Scott Pilgrim vs. the World's' fortunes go south. Strangely, this little indie comedy turns into a noisy CGI-ridden feast of pointless violence that makes you want to hold your ears and look at your watch. Why does this happen? One reason is that Edgar Wright, the director, hitherto renowned for the already classic zombie comedy 'Shaun of the Dead' and the charming, energetic cop comedy 'Hot Fuzz,' is English. Both films are deeply rooted in Englishness. If Toronto has a native spirit, Wright isn't tuned in to it. 'Scott Pilgrim' tries to be about so many things and the fault is in the writing. Why should Scott have to battle all these exes to begin with?Scott's forced battles become repetitious. The theme of repetition itself is forced on us. Not only is one of the exes actually twins. Scott himself is doubled at one point, and a movie star ex (occasion for that Toronto joke) turns out to have half a dozen stunt doubles who fight for him while he goes out for coffee. The climactic scene where Scott confronts rock impresario ex Brendan, played by Jason Schwartzman, another actor not aging well, seems heavy-handed. It's run twice, once with Scott's fighting strength empowered by love, the second by his need for self-respect. It's frankly hard to see much difference between these two versions. You may just wanted it to end. But it has to end twice, and the closing credits are very drab.The fight sequences have flashy moments and it's droll to have an androgynous nerd battling Superman (Brandon Routh) and, as the movie star, a champion skateboarder (Lucas Lee). Music for Scott's band, Sex-Bob-Omb, was written by Beck. A lot is going on, and many of the invasive visual tricks work because they speed up the action (all very youth-ADD-text messaging friendly). Nothing here is for slow people. If anything the trouble is not that Wright is a slouch, for he is anything but. It's that he tries too hard. That was true to some extent in 'Hot Fuzz.' And most of the characters introduced at the beginning who contributed to the feeling of being in a real place are thrown away, ceasing to matter, except for brief visual recognition, toward the end.At moments the wintry exteriors of Scott Pilgrim's Toronto and his too-cool, geeky, slightly depressed young friends will bring to mind Terry Zwigoff's 2001 'Ghost World,' also made from a graphic novel, also populated by slackers. Probably 'Scott Pilgrim' could have got by with a measure of its Pow! and Thunk! labels and cyber-world air battles, and still created something of the atmosphere and feel of real young lives as 'Ghost World' quite hauntingly does. But that didn't happen, and all I got was a metaphorical lousy T shirt saying I've seen another Michael Cera movie.",
    "120": "Scott Pilgrim vs. the World is a sensory masterpiece. The film is pure fun, creative, and full of satisfying action. This is how graphic novel adaptations should be done!Disclaimer: I never read the graphic novel of the same name so my review may be biased.The first thing that caught my eye about this movie is how ORIGINAL it is. Scott Pilgrim is a fun, stylish movie that's steeped with comic book and video game culture. Sprinkle a bit of \"randomness-rawr\" comedy and you have a movie that epitomizes the late 2000s culture. But the cringeness holds some of the best parts. This movie is full of clever one-liners and natural jokes that keep this film rewatchable.Transitions from one scene to another are seamless and keep the momentum going. Fighting sequences are always fresh as different exes have their own distinct style. It's hard to know what to expect jumping from one scene to another.Did I mention the eye-catching effects? It feels as if you are in the middle of a video game/comic book. Musical performances were also quite enjoyable.And the cast is absolutely A+. I was surprised at some of the cameos that this film had. Also, leave it up to Michael Cera to play the part of awkward Scott Pilgrim to perfection.Yet this film did have some flaws. I found that Ramona's character was reduced to damsels in distress with little say in the film. I was also disappointed that Knives' character arc did not turn out the way I was expecting.Still, this is one of Edgar Wright's most memorable works.4/5.Well Done.",
    "121": "Being quite the fan of director Edgar Wright's previous efforts and being a self confessed gaming nut since 1981 and seeing the rise of the Nintendo generation from the beginning who supposedly this film is directed at. I was really excited and looking forward to spotting all the gaming references that Wright likes to sneak into his films and shows.It turns out this film is the most shocking example of what passes for entertainment these days. It was terrible, unfunny and extremely annoying.The film is absolutely tailor made for a generation that has an attention span of about 0.2 seconds. The characters all talk in a similar quickfire style with a camera cut happening almost every half second and the screen is littered with bright coloured, animated fx obviously there to stimulate whatever moronic mind would find this fun. The characters are horribly accurate examples of today culture with protagonist Scott Pilgrim himself being the archetypal anti hero. Weedy, weak, unsure of himself and sensitive along with the token gay friend and 'rocker' girlfriend.This is a nerds wet dream. It places a weakling in a world where game rules apply and said weakling proceeds to annihilate 7 rather more burly boyfriends of the pretty girl he is trying to woo. It's what every nerd, outcast and skinny emo boy in the world wishes would happen to them.I'm insulted that this film wants to the the hero for gamers of the world. I am a massive gamer and absolutely nothing about this film appealed to me at all.Now to be fair I must give kudos to the visual effects in the film. They are both stylish and impressive and the actual fight choreography itself is excellent. To those that think that this is enough to make a film good, even a comic book action film, must have something seriously wrong with them.Do yourself a favour, walk out after the 8-bit Universal logo. It's by far the best part of the film!",
    "122": "After seeing this movie I just had to read all 6 volumes of the comic this movie is based on. I must say I liked the comic a bit more since the movie didn't have some of the good parts in the comic. But that is understandable and this movie really is a very good adaptation. This movie is very unique and really got the essence of the comic and the vibe as well. I heard Edgar Wright made a lot of effort and time in making this film and Bryan Lee O'Malley even pitched in and helped with certain scenes and it was worth the effort and time. I personally think to get the most out of this movie, watch this movie first before reading the comic. Although, like I said the comic seemed to be a bit better but the movie does things in a way where some of the witty dialogue and direction that isn't in the comic gives a lot of flare to this movie. Maybe it's just the slightly different approach in certain angles and parts of the film, the humor in this is done better than the comic itself. This is probably one of the best video game style movie I have ever seen and it's not even based on a real video game although that game after the movie. Edgar Wright did a fantastic job with this movie and hit the mark almost entirely. Fans of the comic this movie is based on won't be disappointed, it might even surpass most people's expectations. Sometimes pop culture references doesn't work in movies sometimes but it worked just fine in this one, especially about the way certain group of people dress, mainly hipsters. The constant things happening in the background was interesting as well, even if it was random or didn't make much sense. My favorite Ex's out of the seven Scott has to fight is the two superheroes, Superman and Captain America...Yeah it's a lame joke but those two actors was very entertaining to watch and seemed to be enjoying themselves. What is really shocking is how this movie has like seven villains in one movie but it still works really well and doesn't fall short of almost anything. I think this 2 movies might have worked better in order to get more of the stuff in the comics in movie form. Like the first movie would be called \"Scott Pilgrim vs. the World\" and the second movie to end it all be called \"Scott Pilgrim vs. the Universe\". Anyways overall this is one of the best movies of 2010 and is highly worth checking out.8.6/10",
    "123": "This was one of the best, freshest moves in a long time. Despite the fact that we've seen the visual style in video games still it seemed really original and refreshing. The humor was subtle, there were no laugh at loud moments, but it kept the humorous pace from beginning to end. This is my first review, but what can I tell you the movie was slick, well packed, full of fight scenes, action wise and adventurous.The visual effects were amazing, nothing overdone or less effects where needed. Can't believe it didn't go so well on the box office, but I'm sure it'll bank on DVDs or BRDs. maybe the story could've been a little better, but i can't really say there was anything wrong with it. BTW Cera plays his usual ( which fits the story), Winstead is OK, it was a pity Anna Kendrick's character (Scots sister) has a little screen time.All in all, you have to watch this!",
    "124": "Edgar Wright is fanboy gold. Shaun of the Dead proved that he was a director to watch and Hot Fuzz showed that he had a bit more up his sleeve. So what happens when Wright branches out to comic fare without the help of his regulars? We get a film that is nonstop entertainment done in a way that only Wright can. Scott Pilgrim vs. the World is unique to its very core, the fact that it's also well done and enjoyable is icing on that one-of-a-kind cake.Scott Pilgrim (Michael Cera) is a 22-year-old Toronto slacker. When he isn't practicing with his band, he is hanging out with his 17-year-old girlfriend Knives Chau (Ellen Wong). Everything is business as usual until Scott sees the literal girl of his dreams, Ramona Flowers (Mary Elizabeth Winstead). Scott quickly discovers that being with Ramona isn't as easy as he thought. While dealing with an unclear relationship with Knives he must face off against Ramona's seven evil exes.The casting of this film is inspired. For all those that have grown tired of Michael Cera I urge you to go see this film. At the surface Scott Pilgrim is yet another awkward young man that you've seen Cera do before, but he finds a way to dig deeper into the character. Scott is a flawed individual and Cera is able to communicate these flaws without negating the charm that is at the character's core. It is a tough performance to describe, since it is simultaneously similar to his prior roles while also being quite a bit more complex. Technically Michael Cera is the lead, however very few scenes are all his own. Nearly every supporting actor is able to steal at least one scene. From Kieran Culkin as Wallace to Johnny Simmons as Young Neil, there was not one actor that I tired of. I found myself wishing the film could be longer simply so I could have more time to get to know all of the other characters. Anna Kendrick is sweet and smarmy as Scott's little sister, Aubrey Plaza is endearing as the overworked and unappreciated Julie Powers and Ellen Wong manages to sidestep the chasm of annoyance as Knives Chau. Then there are the seven evil exes who you should hate but just can't. In short, if the saying \"you're only as strong as your weakest link\" is true, then this cast is a diamond chain.The story is fantastic, if a bit simplistic. Bryan Lee O'Malley has created a world that is both ridiculous and relatable. The film is as much a character piece as it is an action film. The writing is able to examine the complications that come with relationships at a young age. Scott is a selfish individual that pays little notice to the effect his decisions have on those around him. Ramona has led a life of regret and is constantly running from a past that will not let her escape. The characters and story are complex enough that you will be surprise to see them following you out of the theater.The reason the film is able to work is Edgar Wright. I cannot imagine this film in any other director's hands. Some have described Wright's style as customized for the \"ADD generation\" but I believe this is borderline insulting. While he does utilize several fast cuts and the film has very few moments that do not cruise by, I believe this is necessary. A comic book does not contain several solemn moments of reflection and as such, a film based on a comic book should not either. I was shocked to realize that the film is close to two hours long since it seemed to clip by at such a fast pace. I may be a bit bias since this film seems to be customized to me. I grew up with my Sega Genesis at my side and a television nearby. Due to this, I found all of the video game and television inflections to be a delight. These references are in no way a distraction, simply a fantastic supplement. If the sound of the Sonic the Hedgehog theme brings a big smile to your face, then this film is just for you.Comic book films have become pretty commonplace. Scott Pilgrim vs. the World may not be a Marvel or DC film, but it manages to feel much more like a comic book than any film since Sin City. Wright shoots for the moon when it comes to staying true to his source and I am glad he did. The screen oozes comic charm and this allows for the intense fights and stylized musical numbers to feel completely authentic. I believe that a comic should only be transitioned to the screen if something more can be added to the experience in the process. I have only read portions of the Scott Pilgrim comic, but when it comes to the film, I would be elated to sit down and experience it all over again.With this film, Edgar Wright completes a hat trick of memorable fare. Bryan Lee O'Malley has created a story that we've seen before in a way that is completely unique. Wright is able to take O'Malley's fantastic story and transition it beautifully to the screen. Every member of the cast is fantastic; I only wish that each actor had more time on screen. With so many comic book films feeling obligated to be rooted less in the fantastic and more in the real, it is nice to a see a comic book film that embraces its roots. The strong comic book style, coupled with video game accents, results in a film that is never boring. Scott Pilgrim vs. the World will make you laugh and yearn for young love, all while pummeling you with its awesomeness.",
    "125": "I don't think a movie's quality should be correlated to box office success so I don't care one bit if Scott Pilgrim was a commercial failure. It's still a bold, inventive and very fun film to watch. I'm probably part of the target audience for Scott Pilgrim : male video gamer, geek and in his thirties. That being said, I don't think Scott Pilgrim will appeal only to us. Younger people and especially women will likely love it. Witness the characters who are in their late teens/early twenties yet are much too young to have known the old 8-bit games from the Nintendo Entertainment System era in their heyday (mid-1980s). It bugged me a little, but it's a very minor point. Most of the characters are also cool geeks and far from stereotypical nerds : they're part of indie rock bands or fans, not wearing glasses, more charmingly witty than socially awkward, and more often that not, amazing fighters.This film is a very unconventional action/romance/comedy with strong pop culture sensibilities (video games, comics and mangas mostly). I don't think I've ever experienced something quite like this in cinema, so weirdly it gets major points for originality despite being riddled with references. I was thoroughly entertained from start to finish. It was a blast to watch and listen to. Visually, it's extremely fresh and dynamic with most sound effects being written on-screen like on a comics page. It might seem annoying, but it worked very well. It has lots of quick cuts (some of the funnier bits coming from stuff appearing out of the blue after a cut) yet everything is easily followable. The fights in particular were very very cool, exciting and spectacular (for geeks : more graceful like Soul Calibur 3 than static like Mortal Kombat). A big part of the humor comes from the one-liners and friendly (or not) banter. It succeeds in doing something very difficult : using intentionally corny lines, bad puns and, by delivery and context, making them sound witty or funny instead of dumb and trite.I think it's my favorite role by Michael Cera, who inhabits that kind of nice, witty, slightly awkward, geek-chic role better than most. But I think the secondary characters are wonderful too and sometimes even steal the show. I loved most of them, especially the very likable and enthusiastic 17-year old Asian girlfriend (so likable you feel sorry and/or root for her) and the wise and promiscuous gay roommate. The main love interest and object of Pilgrim's quest is suitably enigmatic and fascinating. It shows she has baggage and is rather melancholy (almost never smiling). In a brilliant bit of casting, you also get the guys playing Superman (Brandon Routh) and the Human Torch/future Captain America (Chris Evans) as evil ex-boyfriends. I don't know if it's just me but I noticed that eyes in Pilgrim seemed bigger than normal, almost like manga eyes. Kudos to makeup (or special effects ?) for that. The flashbacks with actual drawings from the Scott Pilgrim comics I didn't like as much. They seemed a little out of place, a bit jarring. Scott Pilgrim was a success at entertaining and surprising me constantly. The action was better than expected, the humor was funny, the characters were a joy, the visuals were astounding and the writing was smart. The romantic aspects could have been a bit better, more touching, but were still quite enjoyable. All the geek references were icing on the cake.Rating : 8.5 out of 10 (remarkable)",
    "126": "Scott Pilgrim vs. the World (1:52, PG-13) — other: comedy; 2nd string; crossoverThis flick was a hoot!\"Not so long ago, in the mysterious land of Toronto, Canada, Scott Pilgrim was dating a high schooler\", we learn in the opening scroll. You get a clue where things are heading when you find that Scott (Michael Cera) is the bassist for the rock band Sex Bob Omb, and that 2 of his bandmates are named Stephen Stills (Mark Webber) and Young Neil (Johnny Simmons). But perhaps you've never heard of Crosby, Stills, Nash, and Young. Not to worry! More in-jokes are on the way, and screenwriters Michael Bacall and Edgar Wright are shooting at the entire side of the barn, so some of them are bound to hit a window you're familiar with.For example, you can still relish the performance of Alison Pill as drummer Kim Pine. Director Edgar Wright gives her almost nothing to do besides glower and provide a downbeat, but she does it with flair, verve, and perfect timing. This is typical of a cast studded with tiny, exquisite short appearances.Sex Bob Omb appears thruout the movie as a framing device, as it is participating in a battle of the bands, and each performance is occasion for some fireworks (both literal and figurative). But the main storyline isn't about this band, or about the other, more successful one, The Clash at Diamondhead, featuring lead singer Natalie \"Envy\" Adams (Brie Larson), one of Scott's ex-girlfriends.No, front and center is the girl of Scott's dreams — she rollerblades thru one — Ramona Flowers (Mary Elizabeth Winstead), recently arrived from New York with her brilliantly colored hair, gothy good looks, big-city standoffishness, and relationship baggage. She has 7 evil exes (\"ex-boyfriends\", Scott keeps calling them; \"exes\", she promptly corrects him) whom he must defeat in hand-to-hand combat if he hopes to win her hand. Ramona has taken a shine to Scott — a typical Ceraesque sweet, slender, minimally talented kid who means well but keeps bumbling and tripping over his own tongue — but, like an ensorcelled princess, she's not a free agent.Complicating things is that Scott has never been particularly adept at relationships. His younger sister Stacey (Anna Kendrick), acting as a kind of Greek chorus, introduces him \"This is my brother. He's chronically enfeebled.\", and he's currently taking a lot of ribbing for being 22 years old while that high schooler, Knives Chau (Ellen Wong), is only 17. She's clearly smitten with him and tends to cling adoringly; Scott's ready to move on, but Knives isn't, and she's got that nickname for a reason.And so it goes — POW BIFF BAM WHOMP — each development, detail, deranged improbability, and delightful turn of phrase (\"flaming katana of love\") coming at you like a herd of stampeding bon-bons. The screen is awash in imagery from comic books and video games, including a digital counter racking up Scott's point totals each time he punches out a foe to the accompaniment of campy freeze-frame BOP words (straight from the Adam West Batman TV series) and a shower of coinage at each victory.It's a never-ending stream of laff-out-loud moments, and anyone who's inclined to take it anywhere near seriously should probably see it only with the benefit of pharmaceutical attitude adjusters.Kudos to the entire fun-filled team, and especially to Bryan Lee O'Malley, who wrote the graphic novels this joyride was based on.",
    "127": "I recognize and admit that this is a good film, arguably even a great one. It has a very unique sense of humour, a visual style that's one of the few I've seen that manages to capture the essence of comic books and a character cast that's certainly memorable if not identifiable. That being said, I still loath this film. I do not like it. However, I have given it seven out of ten, because I can admit that the reason I don't like this film has nothing to do with its quality. Rather I hate its roster of characters, especially the main cast, and its morals.Scott Pilgrim vs. the World is a movie about a young man. The youngster in question isn't even that interesting. He's in a band, sure, but otherwise he's kind of a wimp. The kind of a nerd that other nerds will feel superior towards. Plus he's kind of an asshole, cheating behind the backs of his girlfriends just because he's too much of a coward or perhaps just too lazy to break up with them. He's not an admirable man, yet the whole movie revolves around him and his decisions. His \"heroics\". Now, some might claim that Scott is a perfect main character because of this, because he's the perfect everyman. Perhaps a bit of a pessimistic version of one, but still, he's very bland and normal, only the circumstances into which he is thrust upon are extraordinary. I however argue that a) he's an asshole and not at all likable, and b) movie's are supposed to inspire us, to show us something that we don't see in our everyday life.At this point someone will argue that not every film has to be all about moral triumph and the nobleness of human mind. And that person would be right. I'm not claiming that my viewpoints have any kind of superiority here, they're only my personal take on this film. But I think that my viewpoints have relevance as they're one way to look at this film, a rather rare way from what I've gathered, but a way nonetheless. And sometimes the more extreme opinions, the rarer ones, are the ones worth sharing.But as I've said, this is not a bad film. It has style, its actions scenes are some of the best there are, its dialogue is very fast-paced and brimmed with jokes and double meanings. And while I think that most characters in this film aren't pretty loathsome human beings, I cannot claim that they do not feel realistic. Their behaviour is sometimes very outlandish and caricature-like, but beneath all that they're still just like people that I've met and known in real life. The morals and worldviews of this film are pretty horrible, but perhaps the reason I hate the film so much is because the message hits so close to home. It's quite possible that I just don't want to face the truth.So yeah, in the end I feel that I have to recommend this film to you. I personally don't like it, but it's just me. Love it or hate it, you at least owe it to yourselves to see this film and form your own opinions.",
    "128": "Scott Pilgrim has to be one of the top 10 most entertaining movies ever made. It is fast paced, full of humor, and has the most insane action sequences in a comedy. Anyone who likes video games will love this little under-rated masterpiece.It is clear that this movie was inspired by comic hitting sounds like \"Kapow\" and \"Thwack\", but actually shown in the movie like the original Batman TV series when it showed those kinds of words; also the biggest inspiration was Nintendo 8-bit games. This was inspired by video games but not based on video games, so it's safe from a train wreck of a video game movie like Alone in the Dark.Michael Cera actually acts in this movie and makes his role seem like the same character he always plays, but a thousand times better. Cera plays Scott Pilgrim who falls in love with a beautiful girl named Ramona. However before he can be Ramona's proper boyfriend he has to defeat Ramona's seven evil exes. A linear sounding plot but grade A+ ++ entertainment as a result.Scott Pilgrim vs. the World is the most entertaining feel good movie since Back to the Future. No one should miss out on this now cult classic as it has romance (good and not boring romance), great and funny characters, great action, great dialogue, great comedy and most of all, an unforgettable experience. This is destined to have a following for years to come.",
    "129": "What to say, what to say? I had heard good things about this film for a while, an recently those good things reached a crescendo, with two of my most trusted movie advisers both recommending it. And, I am sad to say, as good as it was, it just did not meet the hype. Primarily because it was too long.You have the dorkiest man in Hollywood, Michael Cera, and another arch-dork, Jason Schwartzman. And you have a female lead who I consider one of the top five hottest women in the world, Mary Elizabeth Winstead. So that is a great cast, not including all the bonus guest stars. (Sadly, I should be clear, Winstead did not look attractive at all in this film, being shown up by Ellen Wong.) Another reviewer says the film is \"quite possibly the most original and fresh movie of the decade.\" That is a bit extreme, but not without merit. I would be hard-pressed to find another movie similar to it. There are some \"Kill Bill\" moments, but the first is clearly more inspired by Beck, Nintendo (with some obscure references, such as Clash at Demonhead) and the original graphic novel.The same reviewer says the film is \"not a perfect movie and hardly could be called a masterpiece.\" I think this is true on a film levels. While the film clearly has great visuals and a sense of humor I appreciate, it spends too little time on character development and runs on the long side by having 7 evil exes. 5 would have been enough, and kept the pace more smooth. The fight scenes started to get repetitive.The reviewer claims this is \"the ultimate love story: a guy fights an army for his loved one.\" And that is a valid point, except I disagree. Scott Pilgrim hardly ever gets to know Ramona Flowers (again, little character development) beyond the fact she had seven exes... she is not worth that much trouble. And then you have his other love, whose only flaw is that she is in high school. They seem a better match.I would love to respond to Roger Ebert's review, but he did not write one. (Apparently, he was writing his memoirs at the time.) Some have tried to find a deeper meaning in the film, some criticism of pop culture. I do not know about that. Anyway: great film, full of nostalgia, and a really good concept. But runs on the long side, and if the fight scenes had been shortened to expand the characters a bit, it would have been an even better movie... as it is, a guilty pleasure but probably not a long-lasting film.",
    "130": "Scott Pilgrim V. The WorldScott Pilgrim (Michael Cera) is a young-ish (maybe 23) bassist of an underwhelming garage band, Sex Bomb...err, Sex Bomb-omb...with a lifelong hobby – no OBSESSION – of video games. His life is secure. He is involved in a sexless relationship with a minor: video game enthusiast, Knives Chau (Ellen Wong). And his hard working roommate, Wallace Wells (Kieran Culkin) pays for everything, including their apartment. Pilgrim's life is basically unchallenged till, one evening, he dreams that some mysterious girl is out there. And, a bit later, it turns out that she is! Her name is Ramona Flowers, the American with no money worries, a big apartment, and no significant other hanging around.Scott sees this as a chance to upgrade his relationship status. Besides, Ramona and he seem to connect. But, the illusion of Ramona's trouble-free availability changes as quickly, and as often as her hair color. Soon, Scott learns that he must overcome Romona's exes...err, SEVEN EVIL EXES...as well as his naïve world view in order to hook up with the girl of his dreams.But, alas, life is a video game!...so, anything is possible. That naivety thing is tough, though.This is a touchstone film. It speaks to the generation of the characters it highlights as well as bespeaks of them. (For this article, I'll call them the GENERATION.) It joins other touchstones such as Love Story, Brian's Song, Ferris Bueller's Day Off, and Clueless...and, much further into the past, Les Quatre Cents Coup. As with the first three of those films, it got very little critical acclaim when it was released. And unlike all of those films, it was a financial dud when it was released, during the middle of the Great Recession. But it garnered much critical mention as time went on from original viewers, as they learned to speak for themselves...as well as many DVD buys.Scott Pilgrim V. the World was directed by Edgar Wright, the English director of Shawn of the Dead. It's based on the unfinished – at the time of the film's release – graphic novel by Canadian Bryan Lee O'Malley. How much this has to do with O'Malley's personal life, I am uncertain. (But that is a major topic many of the GENERATION debate.) It does seem to be a collaboration between O'Malley and Wright, however. The supporting characters have a lot of substance to them...a substance that isn't present in other Edgar Wright films. These characters have a Scorsese feel to them. Chris Evan's Lucas Lee, one of the Seven Evil Execs, generates enough interest to have his own film, much less the minor role he plays here. Mark Webber's Stephen Stills, is also a stand out as a supporting character, the leader of the band.Scott Pilgrim is a drama-edy/fantasy. While Love Story, Brian's Song and Quatre Cents had more social perspective, Scott Pilgrim shares with Clueless the success of replicating the language of the GENERATION. And the video game world that Scott Pilgrim created puts it up there with Ferris Bueller as showing a lifestyle that the GENERATION wants to lead. (The REAL question is if THE GENERATION is caught in the same delusion that Pilgrim is...not if they can IMAGINE their way out of it.)Of the bunch, I liked Quatre Cents and Clueless the most. But I haven't sat down to watch any of them in sometime. This is the first time that I've seen the Scott Pilgrim in awhile. As with all touchstone films, you need to be in the mood to see it. And, no matter how well it's made, these films always lose their immediacy after the first year.Strangely enough, two co-workers from the GENERATION had viewed V. The World the same day that I had, and it became the topic of conversation that workday. They had seen it a month prior, too. It's obvious that this film will be the topic for the rest of their lives - as all touchstone films should be.",
    "131": "i had a lot of fun watching this movie, so i'm giving 10/10 without any hesitation. it is a very \"today\" movie - very flashy and very pop - and if you wanna let go any back thoughts and simply enjoy it, very much live you'd enjoy some new music band even if someone says it plays along many clichés, but you like it despite that. to me, of course, \"Scott Pilgrim vs. the World\" was very innovative. the comics-like format, the funny lines, the likable characters...everything built up am experience that true cinema should provide. we live in times when it is very hard, if not impossible, to create something truly new. so you often find yourself building on what essentially is a stack of clichés. but as in chess a new superb game can be played following a known pattern, in any art, you can still be innovative and creative and productive. \"Scott Pilgrim...\" achieves this. it somehow reminded me of \"Whatever Happened to Harold Smith?\" (http://www.imdb.com/title/tt0194530/) which was also fun, and also with and original format. \"Kick-Ass\" (http://www.imdb.com/title/tt1250777/) is also close in presentation and an attempt for novelty. hope for more of these...of course too many would soon create a line of clichés, which we would have to escape by looking for another art, and maybe then you'd look back at these movies and label them pointless clichés, but here and now...the search for love continues :)",
    "132": "Went to see this last night at Brixton Ritzy and was blown away. So much effort has been put into this film technically - the camera work, post production, audio are astounding - not just technically impressive but creatively wonderful.The story is really fun and rockets along - when the pace isn't fast because of the action sequences which are many and both exciting and funny - then it doesn't ever seem to slow down because all the slower scenes are full of the tensions between the characters.You can tell watching this film that Edgar Wright has complete respect for the comic book and has succeeded in translating it to a great film. The performances of the actors are all wonderful and you can't help but think that Edgar must be really good at allowing actors to relax and feel free to give it there all.Really blew me away this film. So much fun. I hope Edgar gets Oscars for this - he must have worked so hard on it.Go and see it! Go go go whilst it's still on the big screen",
    "133": "I have been seeing the trailers, television spots, and internet advertisements for \"Scott Pilgrim vs. The World\" for several months now and I have to admit they have gotten me super excited for the film. I kind of worried, however, if this film would gain an audience. Sure the concept looked original and unique but Michael Cera, who I particularly like, doesn't seem to have the star power yet to headline a big budget film. This didn't matter to me because I knew I would see the flick right away regardless of how it did. So this past weekend, I grabbed the girlfriend and we ventured into the local theater to see just how epic \"Scott Pilgrim vs. The World\" would truly be.\"Scott Pilgrim vs. The World\" tells the story of Scott Pilgrim played perfectly by Michael Cera. Scott plays in a rock band and has a high school girlfriend named Knives (Ellen Wong) because he still hasn't gotten over a woman from his past who broke his heart. One day, Scott Pilgrim sees a beautiful woman at a library and lets just say its love at first sight. A few days later, Scott runs into this mystery woman again at a party and learns that her name is Ramona Flowers (the beautiful Mary Elizabeth Winstead) and she is from New York. Scott is now determined to win Ramona's heart, which is easier said than done. He soon finds out that the only way to truly win Ramona is to defeat her seven evil exes. A lot of epic awesomeness ensues...While I have seen some pretty great flicks this year, \"Toy Story 3\" and \"Inception\" probably being the best, \"Scott Pilgrim vs. The World\" hits theaters and pretty much finishes out my top three films of the 2010 list. That's right I am actually going to say that \"Scott Pilgrim\" was one of the best films of the year. Why you may ask? Well there are several reasons. The first reason is because it's a fun filled ride. This movie hands down is the most fun I had at a movie in years. The next reason is the way it's shot and the overall look and feel of the film. Like \"Avatar\" it truly was a unique movie experience. The third reason would have to be the fact that the film itself is wildly original and featured a unique story about a clichéd topic. The idea of a guy having to defeat his girlfriend's seven evil exes is original enough but the way Edgar Wright filmed it only makes it more unique and enjoyable.With that being said, I guess I should talk about Edgar Wright, who to me is a fine director. Sure he isn't that big in the United States with movies like \"Shaun of the Dead\" and \"Hot Fuzz\" being cult classics in the states but he really does know how to direct a good film. I always enjoy how he brings the script to life and in this case, I really like how he brought the comic of \"Scott Pilgrim\" to life. No I never read the comics themselves but heard from fan boys that he literally did a near perfect adaptation of the book to film. I really like the way he shot the film, the weird screen angles, the action sequences, and just about everything was truly unique. It's like the new \"Sin City\"/ \"Matrix\" from a visual perspective.Acting was solid all round. The chemistry between Mary Elizabeth Winstead and Michael Cera was perfect. They both played well with the sweet and touching love story. It felt like a match made in heaven. The supporting performances by Rory Culkin and all of Ramona's evil exes are all note worthy especially Jason Schwartzman, who I always love seeing on the big screen. I really am amazed he isn't a bigger actor at this point. The casting was pretty much dead on with all the characters really playing off one another.In the end, I really don't have anything negative to say about \"Scott Pilgrim vs. The World\" and that's odd for someone who is usually pretty harsh on films. \"Scott Pilgrim\" is a movie that dares to be different. It's a fun filled ride that never becomes too silly or too serious. It's a truly unique movie-going experience not only because of the way it's shot but because it mixes a whole bunch of genres together including comedy, drama, action, video games, and music. The script is fresh and original. It features some great one liners as well that will be quoted by several fan boys and fan girls in the months ahead. Great one liners that include, \"I am lesbians for you,\" \"Let's both be girls,\" and \"I'm just a little bi-furious!\" Don't know what I am talking about, well than you haven't seen the epic awesomeness that is \"Scott Pilgrim\" and I highly recommend you venture out to your local theater to see it. Its definitely one of the best films of the entire year! MovieManMenzel's final rating for \"Scott Pilgrim vs. The World\" is a solid 9 out of 10. It's a fun filled movie-going experience unlike any other you have seen.",
    "134": "Every once in a great while, there comes a movie that makes you so thankful that you saw it in the theaters. Midst \"Inception\" and \"Kick-Ass\", \"Scott Pilgrim\" easily falls into this category for 2010.I will admit. The movie has maybe one or two slight problems with it....in fact....they are so small, and somewhat meaningless, that they don't take anything away from the film at all. But even if you decided to dwell on these small imperfections, you must also admit that the movie is such a mental and visual feast. There are so many working parts to this picture, the cinematography, the editing, the soundtrack, and each of them is well oiled and moving at full speed.Me being a prime candidate of the \"Y\" generation, i cannot remember the last time a movie made me recall my childhood on countless occasions. Mainly due to the never ending references and musical scores to classic NES and SEGA games dubbed in the background. It was enough to give me goosebumps.Very seldom do i walk out of theater feeling more than satisfied. But that was just the start. The movie is like an addicting drug. After a few days, you really begin to flashback in your mind the funny cheesy dialog, the great music, and awesome cinematography. After a while, you can't seem to get it out of your brain......much like an old school NES game. Can't wait for the Blu-Ray",
    "135": "Director Edgar Wright ('Hot Fuzz', 'Shaun of the Dead') has given \"the world\" something truly special. He's given the cinematic-world a visually appealing, eye-candy, adventure of a movie! 'Scott Pilgrim vs. The World' is truly a unique film, and one of the best this year!Scott Pilgrim (Michael Cera) is a 22-year-old guy with relationship issues. His last serious relationship ended with his heart broken, and now he's dating a 17-year-old high school student, Knives Chau (Ellen Wong). However, we're never sure if he truly likes Knives, or if he's just desperate. But when he meets the girl of his dreams, literally, his world is forever changed. This girl is Ramona Flowers (Mary Elizabeth Winstead), and for some reason, Scott has a thing for her – he thinks she's the one. However, to truly be with Ramona, Scott has to defeat her \"Seven Evil Exes;\" he literally has to fight and battle with each one.The most exciting moments in the film are these seven battles. The film keeps these battles interesting by having a variety of characters, each with their own unique personalities. Before seeing the film, I knew that the battles would be video-game-esquire, but I thought that the battles would all be similar, and eventually get tedious. However, I was gladly wrong. Each and every one of the battles were unique in their own ways, depending on who the \"Evil Ex\" was. One is Bollywood inspired, one music-inspired, and more. Some battles are more memorable than others, but each is visually stunning, and unique.I loved the personalities of each of the \"Evil Exes.\" All of them were hilarious in their own way; one was a vegan-powered jerk, another was a Hollywood actor. They're all so unique; one was even a girl! Ramona's female ex, Roxy Richter (Mae Whitman), was totally badass and had a slightly special speech pattern. I loved how some of these battles required Scott Pilgrim to use strategy to defeat the exes, and not just simple brute force. Some of the battles required Scott to use what he knows about his opponent's background and personality, and it's gratifying to see how Scott pulls off some of these victories. These \"Evil Exes\" are, for the most part, portrayed by unknowns. The most popular, to me, were Chris Evans ('Fantastic Four') and Brandon Routhe ('Superman Returns'). However, the celebrity-status of the actors in the film didn't technically affect the way we viewed their characters. For example, Chris Evan's character of Lucas Lee was, to me, the least interesting of the \"Evil Exes.\" 'Scott Pilgrim vs. The World' had many, many characters, each different, and for the most part, are likable and enjoyable.Scott has a gay friend and roommate, Wallace, played wonderfully by Kieran Culkin. Culkin's portrayal of Wallace truly stole the film. Culkin's character was funny in almost every scene, and many of his lines were quotable-worthy. Knives was a crazy character that could have been portrayed in two different ways – annoyingly or awesomely. Ellen Wong does a great job at making Knives appear obsessive and crazy, while at the same time innocent and lovable; her character could have easily been seen as annoying, but Ellen Wong pulled her off the right way. Also, Knives is totally badass by the end of the film. Aubrey Plaza ('Parks and Recreation') portrays a memorable minor character, Julie Powers. Julie is one of Scott's friends and has the unique ability to censor her speech, which is hilarious.The film has so many different characters that are so different and unique, that it's hard to choose a favorite. However, there are some characters that could've been better. To me, Ramona Flowers seemed too distant and not-right for Scott Pilgrim. Her character just had a straight-faced, uncaring personality throughout the entire film. I didn't sense any chemistry between her and Scott Pilgrim, but hey, maybe that's what her character's supposed to be like. The twin \"Evil Exes\" barely had any screen time, and had a short battle; they literally didn't speak one line.'Scott Pilgrim vs. The World' has an extremely fast pacing, and it works great. Straight from the beginning of the film, you can tell that everything happens fast in the film. The dialogue is even fast at some parts. This fast-pace requires fast transitions, and I felt like the transitions were well-done. The visuals in the film were also amazing and well-done. I loved how well the film managed to pull off a video- game feel, and make it not cheesy. The film had \"pee bars,\" \"coins as rewards,\" \"health points,\" and so much more. All of these things fit naturally in the film, and they're awesome. The weapons were amazing, and the fights were all well-choreographed.'Scott Pilgrim vs. The World' has everything you could possibly want in a film! It has wonderful actors, memorably unique characters, an interesting plot, quotable dialogue, a unique style, spectacular visuals, and so much more! It's truly, truly unique (I know I've said that a lot, but it really is!) and is definitely a stand-out film from most that are currently out. No other film this summer, or this year, has been this stand-out since Inception. Both films are definitely on the top of my \"Best Films of 2010″ list, for sure!PS: Who doesn't like Michael Cera? He's such a lovable actor, and has that unique ability to be \"liked\" in any film he does! He's awesome.PSS: 'Scott Pilgrim vs. The World' is ridiculously awesome. Go see it! You don't have to be \"nerdy\" or \"geeky\" to like or understand the film's concept and unique style. I went with a lot of friends, and most of them surely weren't the gamer-types. The film's appealing to males as well as females, for sure!PSSS: Once again, go see 'Scott Pilgrim vs. The World!'",
    "136": "I was surprised how awesome this movie is. I read many great reviews about it but I thought it would just be for fanboys. Well, the great reviews sucked me into this film. The moment the Universal graphic was changed into video game style, I knew I would be in for a treat.The plot is very simple. It's about one guy who has to defeat his new girlfriends seven exes in order to successfully date her.The acting is not bad actually. I don't know much about Michael Cera only previously seeing him in Juno, but he was pretty good. His roommate portrayed by Kieran Culkin gave me many laughs. Mary Elizabeth Winstead looks cute here.This is the perfect movie for everyone to see. This is mostly a drama movie with hardcore action mixed in. I hope this movie gets nominated for an Oscar or two which I doubt. It should have done better at the box office too. Anyway, I really enjoyed this film. I rate this film 9/10.",
    "137": "The world that Scott Pilgrim dwells in seems like a paradise for all who cherish the activities and cultures of the teenage life. Here is a world centered on teenage relationships, video games, comic books, and rock n' roll. It allows a freedom that the youth could celebrate on a daily basis. The influence and sightings of adults in this movie are almost, if not entirely, absent.Not only are the young characters here privileged with such an exciting reality, but they are also presented with powers of many possibilities. I am thinking of a scene that could be used as an example. Oh, yeah. After an evil ex-boyfriend has been stripped of his supremacy by the vegan police, our hero head butts him, and the weakened villain explodes, leaving a pile of coins just waiting to be the fed to greedy slot machines. In a world where sudden death turns into instant riches, one would suspect that murders would be much more rampant, but not here. Given the limitless possibilities, the characters actually behave quite well.Read more here: http://localmoviereview.com/scott-pilgrim-world-2/",
    "138": "Touted as a cult-classic-in-the-making, I decided to check this out – despite being lukewarm on the director's popular earlier effort SHAUN OF THE DEAD (2004) – on the strength of the not dissimilar but far superior KICK-ASS (2010). This, in fact, concerns a geeky young man turning unexpectedly into a hero; still, it is not a typical comic-strip adaptation – what it is, I am not really sure, except to say that it epitomizes the film-as-video-game mentality! Mind you, it is all somewhat enjoyable (especially the incongruous camaraderie –including Scott's gay room-mate and members of his rock group being named Stephen Stills and Young Neil!) yet too silly to leave much of a lasting impression. The plot involves the titular character falling for a mystery girl (winsome Mary Elizabeth Winstead, whom I had watched in four previous films yet only now did she catch my attention!) but, in order to be with her, he has to first defeat her seven former flings and also drop his own current lover, an underage Japanese girl! The villains include special guest stars – the term is to be used lightly here – like Chris Evans (an ex-Fantastic 4 and soon-to-be Captain America!) as an arrogant movie idol, Brandon Routh (the most recent Superman) as a vain alien(!) and Jason Schwartzman as the evil boss of the lot, the very music mogul to whom the hero's outfit would be signed if they were to win a battle-of-the-bands-type contest; three other opponents were fellow participants (two of them twins), and yet another a lesbian!",
    "139": "\"Scott pilgrim vs The World\"...or more suitably \"Scott Pilgrim vs The 7 super-powered evil Ex's\" (doesn't quite have the same ring to it) is a hyper-active action comedy extravaganza perfect for today's A.D.D. generation of short attention spans! The fast-paced action-packed visual style of the film and it's humorous, witty and catchy one-liner dialogue will keep anyone with a Goldfish's attention span up-right in their seats, drool leaking from their mouths and eyes firmly planted on the screen for the full duration of the film! Geeks, nerds or just anyone with too much time on their hands and lack of social-life will delight in the many video game and pop-culture references spliced throughout the film. The films slick editing and cartoon/comic book visual style is superbly executed and despite the film being outlandishly random, it all seems to make perfect sense in the fictional world it is weaved in. Michael Cera plays a slight variant on his \"Arrested Development\" persona as the title character, Scott Pilgrim - a nerdy, awkward bass player and video game enthusiast who's had his fair share of bad luck with the ladies. Yet the real star of the film has to be Kieran Culkin as 'Wallace Wells', Scott's gay room-mate. He is hilarious and gets all the films best lines. I couldn't help think throughout the film just how much he resembles Mike Patton! If they ever do a film on 'FNM' - they should most definitely cast Kieran as Patton!!! The music is also pretty good and all the tracks performed by Scott's band; \"Sex Bob-Omb\" were suitably composed and arranged by the genre bending artist 'Beck'. Though it may not be everyone's cup of tea (herbal/green/sleep, etc) - the film never ceases to entertain and it's humour, stylised visuals and fight scenes pack more punch than most films out this year (excluding 'Expendables' which I have not yet seen). There are also some amusing cameos thrown in as a bonus in an amusing scene involving 'Vegans'!",
    "140": "While I realize that this movie is not for everyone, I cannot think of a more inventive, unique, heartfelt, and fun movie I have seen in theaters recently. To me, the movie is more than just a spectacle. Sure, the special effects are amazing, the fight scenes awesome, and the visual style extremely entertaining. To the contrary of what many critics are saying, I thought the movie worked great on an emotional level as well. Scott Pilgrim is completely relatable to anyone unsure of where their life is headed, and every teenage boy understands his plight. He's played to perfection by Michael Cera as an unconventional hero, one who is sometimes a jerk, but nevertheless wants to do the right thing. The contrast of this realistic character with the ridiculous world which he inhabits keeps the movie grounded, even when an Indian scenester is performing a Bollywood dance number for no discernible reason.Don't get me wrong: the movie is completely insane, but in a wonderful, devil-may-care sort of way, rather than feeling like a carefully calculated marketing ploy. The crazy fight scenes could have gotten tired by the end, and the movie could have been an exhausting experience. Instead, every fight scene is filmed with a sense of child-like wonder, making the movie feel uplifting and energizing rather than it pounding the audience into submission. The complete lack of rules and the possibility of anything happening keeps these scenes entertaining throughout the entire movie.I also find this movie beautiful in a way like no other. Of course, from a visual standpoint the special effects are top notch, and the scenes well shot. But it is also beautiful for other reasons. The ethereal moments such as when Scott dreams about Ramona roller blading to his door, the awesome soundtrack/score which perfectly accentuates the different moods in the movie, and the contrast of a simple, almost naive love story amongst the craziness all compound to make it an almost transcendent experience.To me, this movie works on all levels: emotional, visual, and even spiritual. But above all, its original. It saddens me that the American movie-going public has mostly ignored this movie, choosing instead to view mindless garbage such as The Expendables and Eat, Pray, Love. After viewing the movie 2 times, I still love it, and think a lot of other people would too if they just gave it a chance. So do yourself a favor and go see this movie. Even if you don't love it as much as me, you won't see another movie like this for a long time.",
    "141": "The movie opens with an 8-bit recreation of the Universal Pictures company logo, complete with a new rendition of the studio's fanfare done in nostalgic MIDI format. Ah the good old days of fat video game cartridges that never work until you blow into the microchip slot. For me, this was love at first sight as Edgar Wright (Director, Shaun of the Dead) prepares you for a crazy ride through the trying times of Scott Pilgrim (Michael Cera), a young romantic determined to literally fight his way into the heart of his one true love, Ramona Flowers (Mary Elizabeth Winstead). You will find yourself entranced by the dazzling visuals backed by a score made up of head-thumping punk rock and classic video game themes. This truly is an epic of epic epicness.Scott Pilgrim vs. The World is adapted from a popular series of graphic novels written by Bryan Lee O'Malley. Inspired by punk rock, Manga comics, video games, and Kung Fu classics, this movie is a modern telling of a classic love story, catered to the MTV Generation. That's not to say anyone born outside of this generation won't enjoy the ride. No joke falls flat. Instead they fly at you in vivid color. The movie reads like a comic book and plays like a video game. Like a comic book, the text is an integral part of the storytelling. A series of D's flies out of Scott Pilgrim's bass guitar in rhythmic fashion as he prepares for a killer solo. An occasional onomatopoeia flashes across the screen with a THWOMP or THUNK of someone's head, reminiscent of the Adam West Batman. Like a video game, every bad guy Pilgrim kills spontaneously bursts into coins, accumulating a score that serves no purpose. It's a wacky game of Whose Line is it Anyway where the points don't matter but you find yourself rooting for a winner.I was reminded of Tarantino's Kill Bill. The hero has a list of people to kill, but unlike the Bride, Pilgrim isn't out looking for trouble. The trouble finds him in the form of The League of the Seven Exes, a dark alliance formed by Ramona's latest ex, Gideon Gordon Graves (Jason Schwartzman), whose sole purpose is to challenge any romantic soul brave enough to seek the heart of the impulsive, attractive, and elusive Ramona Flowers. Every ex that Pilgrim encounters offers a different kind of fight, a new challenging way for Scott to win, and another chance for Wright to bring you an entertaining display of light and sound.Scott Pilgrim vs. The World introduces you to a wild ensemble of characters. Scott Pilgrim himself is a scrawny, unassuming young man who seems harmless at first until you discover the impressive track record of broken hearts he's left along the way. One of those broken hearts belongs to the girl drummer in his indy punk rock band, the Sex Bob-Ombs, another endearing Nintendo reference. Knives Chau (Ellen Wong) is his Chinese high school girlfriend, head-over-heels in love with her boyfriend and completely obsessed with his band. Pilgrim's anal sister (Anna Kendrick) and his gay roommate (Kieran Culkin) also offer big laughs.Like Tarantino in Kill Bill, Wright is given a playground with no rules. The fourth wall is almost nonexistent and nobody ever asks why, not the people watching the movie nor the people in the movie. You sit back, suspend all belief, and hope that Scott Pilgrim beats the game. Like Miyamoto's Super Mario Brothers, Edgar Wright's Scott Pilgrim vs. The World is a game you will want to play again and again and again.",
    "142": "After watched the film, I seem to know why I have no interest in video games at all, I would rather waste my time on anything else. The truth is that I had enjoyed director Edgar Wright's previous films HOT FUZZ (2007) and SHAUN OF THE DEAD (2004) (both starred with Simon Pegg and Nick Frost). Love it or hate it, it's a film eyeing for the geeky culture and the generation of video games, I stand firmly in the opposite of it as I find it tedious (seven ex-bfs? why we have to watch Michael Cera's ass being kissed multiple times and then he stroke back to knock over his stronger opponents by some gratuitous trickeries?). Is there anything recommendable I could squeeze? The special effects are dazzling, some dialogues are funny, but not tangible, the whole film is a big disappointment to me, no wonder it underperformed in the box office as well, as its direct target is indoor otaku, whom I am sure prefer staying at home playing video games rather than going to cinemas to watch someone else playing it. Maybe sales of the DVD market is the right strategy. As for the cast, Michael Cera has been a symbol of man show geeks since JUNO (2007), so there is no real breakthrough here, Mary Elizabeth Winstead is way too cool for a comic role (yes, it just occurred to me the film is an adaption of a comic series), others are fine, not worth mentioning except it was glad to see poor Brandon Routh back in the business.",
    "143": "Was Gregory's Girl as remade by Stephen Chow really what the world needed? Accomplished British director Edgar Wright's latest, the graphic novel adaptation of the same name in Scott Pilgrim vs. the World, is the frenetic; overly energetic and just generally annoying version of such a thing. Here is a needless, post-modern explosion of tricks and gimmicks; the film appearing to want to be some sort of a cautionary, screwball comedy depicting the lengths people go for those they love; the entire thing ending up an often unbearable slog which, in spite of the adult foundations, comes across as a ill-judged and immature trudge through a mire rife with very little content to get involved in and very little to actually like. Drawing on a parallel to what the likes of respective British directors Danny Boyle and Paul McGuigan tried for in the late-nineties, Wright blurs the lines between realism and surrealism for his American audiences; enabling characters to achieve a great deal of what humans cannot often in the presence of a lot of other people whom witness it, but do not react in any great way that suggests the activity is out of the ordinary. Michael Cera, stretching his acting limitations, here plays the softly-spoken; weedy looking, although more confident than you give him credit, young man somewhere in between that of high-school, university and the beginnings of full time employment. He is named Scott Pilgrim. As the title might suggest, it is him versus the world; only, it isn't. In fact, for the bulk of the time, Wright's film features the titular character taking on a handful of ex-lovers. When it isn't doing that act, it briefly focuses on both he and his girlfriend against one other ex-lover, before further still briefly veering off to focus on that of Scott's ex-partner taking on his current one.Living in the Canadian city of Toronto, Scott is frequently a guitarist in a band. He has recently come out of a relationship with a woman he felt a great deal for; the nature of its capitulation leading him into a tryst with that of Hmong girl Knives (Wong). The members of his band, particularly that of snotty drummer Kim (Pill), entrust it to be a façade relationship; such accusations begin to mutate into statements of truth when fiery, but underplayed in that alluring way, Ramona (Winstead) arrives with her dizzy arrays of coloured hairstyles and tendency to roller-skate around if outdoors, - Scott going on to woo her. In all intents and purposes, the character of Knives is the most interesting; prior to being dumped, her innocent demeanour and carefree attitude when she's with Scott encapsulates a universal exterior of happy-go-lucky living and enjoyment. A crucial scene sees her partake in an act which doubles up as the film's entire nucleus; specifically, when she changes her hair colour out of reaction for being ditched for Ramona and her wacky ideas in regards to hair, in what is a brief capturing of the tribulations and reactionary process one might go through for means of love; the opposite sex or attention and affection.Unfortunaley, Wright decides to explore the thesis by way of Cera's rather arrogant and somewhat unlikable character; an exercise executed via a process of inherent boredom during which four-or-so too many fight sequences act as the centrepieces around which a bunch of offbeat sound effects, that are inexplicably taken from arcade machines of old, pepper a demented aesthetic of noise; rabid cutting and quip spouting teenagers. Principally, the film covers Scott and his quest to defeat the seven ex-partner's of Ramona – so, the girl gets around, and in this age of disturbingly high teenage pregnancy figures and societies rife with sexual infections, such a notion does not deserve to be handled with the throwaway attitude it is here. The battling of the exes is an idea which does not go on to spawn any sort of plot per-se, and instead induces a series of fight sequences in the mould of that awful video game of years past \"Tekken\". The fights might unfold in any order, and sadly renders Ramona's essential presence that of a prize awaiting the lead at the end of his quest.Wright brings about these fights during occasions in which violence or hostilities of some description appear apparent: when Scott duels with Matthew Patel (Bhabha), it is at a battle of the bands meeting; when he fights film star Lucas Lee (Evans), it is immediately prior to having watched him shoot a violent scene in his latest movie, whereas the altercation with Todd (Routh, lampooning his Superman role) is a result of the fallout of an argument that they share. Depressingly, the fights largely consist of Scott up against specific groups or individuals of a marginalised sort; flitting from fighting an Indian (complete with out of place mock-Hindu dance); a bi-sexual; a vegan and two synthetic musicians of Japanese nationality, in what is itself a horrid pastiche of the wondrous sequence involving certain antagonistic harpists in Kung-fu Hustle, a film by the aforementioned Stephen Chow. Gregory's Girl it isn't; a film about grounded people with specific interests at important times in their lives coming together and desiring to interact with the opposite sex. The interactions for those people were nerve-wracking; the film subverted gender roles in ways that were refreshing: boys enjoyed culinary and girls wanted to play football. Wright's coming of age film is an abusive assault on the senses; a piece due to play like a horror film to those aged between 12 and 18 whom are yet to have much contact with the opposite sex, which means it has missed the point by a wholly unforgivable margin.",
    "144": "I am not a fan of Michael Cera. I've never liked him after seeing Juno or Superbad. I felt his comedic timing and delivery was off. However, Cera has redeemed himself in my eyes with this movie.Scott Pilgrim (Cera), is dating a 17-year old named Knives (Ellen Wong) when he has a dream about Ramona Flowers (Mary Elizabeth Winstead). After meeting her, he asks her out. Shortly afterward, Ramona's ex-boyfriend Matthew Patel (Satya Bhabha) shows up and claims that in order to continue dating Ramona, Scott has to defeat him and the other six \"evil exes\".Right from the opening Universal studio logo shot this movie is just wicked fun. It's hilarious right from the start, it's like watching someone play a video game, and not to mention, the action is pro-kid! Bring an two-year old to this because when people are killed or damaged, they don't bleed, they burst into coins. It's romantic at times and the story is quite simple to follow.I simply loved the way that the text appeared on screen at certain times. I enjoyed all the comedy and it's nothing brilliant or deep about it which makes it all the more intelligent. The fact that Edgar wasn't trying to be a big blockbuster hit makes this movie that much greater! I find this movie to be a sleeper hit. It might not make as much as Inception or The Expendables, but in my eyes, this is a summer blockbuster.I think another great addition to Scott Pilgrim Vs The World is that the f-word is bleeped out and they work that fact into the storyline and make it even funnier. Michael Cera's delivery is spot-on and I love the look of Mary Winstead as Ramona. I remember Winstead from Final Destination 3, but she's never looked as hot as she does here, especially with the pink hair.Even parents who go with their kids to this film will have a good time. It's a fun movie, and shouldn't be viewed as anything else. I don't care about the physic errors or anything because that's not what the story is about. It's a fantasy movie mixed with comic book aspects and it plays out like a video game. It's great fun for everyone!",
    "145": "Let's cut to the chase. This movie is woefully bad in almost every single aspect. The characters are vague, irritating, two-dimensional non-entities, and as such, I found it impossible to relate to any of them. In particular, Scott Pilgrim is a dull, whiny brat with no personality whatsoever. The rest of the ensemble are cardboard cut-outs aimed at an audience that must surely prize pre-teen rambling over actual conversation, and you'll be hard pushed to remember anything interesting that any one of them said after the movie.The plot is insulting - boy must beat girl's evil ex's to win her. That's it. Wow! The battle scenes are ridiculous, with enemies reduced to coins after being defeated, one of many, many repetitive nods in the direction of out-dated games consoles such as Nintendo's.Seriously this has all been done before and with more style. I cannot believe that this pile of equine manure is the product of the same man that wrote Hot Fuzz.I'll make it plain for you - Do you have ADHD? Are you impressed by flashing lights? Do you want dumb American teens mumbling incoherent nonsense as main characters? If the answer to any of those questions is yes, I give you Scott Pilgrim Vs The World.enjoy.",
    "146": "WHAT'S SCOTT PILGRIM VS. THE WORLD ABOUT? A geek must battle his girlfriend's exes for her heart. Literally battles them.IS IT ANY GOOD? (GRADE: B) Director Edgar Wright has directed and co-written two of my all-time favorite comedies, Shaun of the Dead and Hot Fuzz. The appeal of his work lies in both the originality of his direction (even the film editing is funny) and in the sharpness of his screenplays. His latest, Scott Pilgrim vs. the World, represents a step up for Wright as a director, but sadly, it's also a step down for him as a screenwriter. In terms of visuals and sound, Scott Pilgrim is one of the most creative films of the past decade, and I don't mean merely in a \"Wow, that CGI looks cool!\" kind of way. The film-making itself is endlessly inventive as Wright blends the styles of comic books, video games, and rock n'roll into a charming love letter to geek culture.Michael Cera (Arrested Development, Juno) successfully stretches a bit beyond playing the affable, clueless nice guy role he's made a career out of. Those elements are still there, but so is an edge of selfishness and, ultimately, growth. What's more, he impresses with speed, flexibility, and coordination in the film's many fight scenes. He also really plays the guitar in the musical scenes, impressively shredding it up.The plot, as it is, finds amateur guitarist Scott Pilgrim having to battle the \"seven evil exes\" of his new girlfriend, who is quite literally the girl of his dreams (played by Live Free or Die Hard's Mary Elizabeth Winstead). In the mix are a gay roommate, an Asian high-school girlfriend (one of the film's highlights), a movie star (Captain America's Chris Evans), a super-powered Vegan (Superman Returns' Brandon Routh), a trail of broken hearts, and a battle of the bands. It's fun stuff, but a film this intentionally silly needs two things to blossom: more laughs and a shorter running time. Scott Pilgrim clocks in at nearly two hours; it should be about 20 minutes shorter, and the pacing lags in spots.What's more, while the film is quite funny, it is neither as clever nor as packed with humor as Wright's previous movies. Too many jokes fall flat, perhaps because too many revolve around Scott's roommate and his sex life. I have no problem with sympathetic portrayals of LGBT characters, but the character isn't well-rounded. His sexuality gradually becomes his only defining characteristic. Also, Scott's relationship with the female lead goes from zero-chemistry awkwardness to physical intimacy without any transition in between. I know the film wasn't striving for realism, but even by movie standards, that was a stretch. Though there is entertainment and ingenuity to be found in Scott Pilgrim vs the World, there are also some flaws and, depending on your tastes, potentially offensive content.",
    "147": "One of the rarest things to ever happen to me, is finding a movie that has about everything I want, or even as a fan of a comic book for an adaptation to live up to my expectations. This film does that just like the graphic comic mini series it was derived from it is a film I feel was made for me.This film just has so much that one watch just isn't enough. The action is great it is well filmed just old fashioned style (which I prefer) where you can see the hits as well as who's hitting who. It is well choreographed, it really looks like a video game or even comic book/anime come to life. From the visual effects and sound when we see the attacks delivered down to the power moves. Just seeing this makes me wonder why the hell the live action \"Street Fighter\" movies couldn't of pulled this off. This also creates sort of a fantasy world, kinda like with the show's \"The Adventures of Pete and Pete\" and the underrated \"Community\" or even the video games \"Earthbound\" and the \"Persona\" series. It's a world that is one foot in reality but also just one foot away, everyone acts as though what is going on is all a part of everyday life. I love those kinds of fantasy worlds because their more accessible and feel as though anything to even a random everyday person is possible. The music is also great most to all of the songs are memorable, two of my favorites are the theme song and Threshold. But what really gives this movie power is in it's dialog and characters.The dialog and humor is just hilarious, this film is one of those rare movies where sometimes by re watching you can uncover something new, sometimes I find a joke that might of went over my head, that just makes the film all the more funnier. There is also a great amount of reference jokes much like in \"Futurerama\" and \"South Park\", from video games like \"Street Fighter\", \"Double Dragon\", movies like \"The Warriors\", you name it it's there.Characters even the minor ones are all great and I felt cast just right. Even though for the record I'm not a fan of the actor, Michael Cera I thought did very well as the character, I really felt like he was Scott Pilgrum. What I love about Scott is just how relatable he is, Scott is a bit like myself in real life; he's shy, insecure, ill confidant but not short of courage, loves video games, and trying to find himself. I also love the fact that Scott looks like any other everyday person, he's not some stereotypical pretty boy, this helped in the relatablity.Mary Elesebeth Winstead is perfect in the role of Ramona Flowers, I've always imagined that actress's voice when I read the series, so her playing Ramona is a dream come true. She is hotter than hell (in my book anyway)and capable actress to boot. Ramona is feisty, fiery, spontaneous, rebellious, bitchy (I mean that in a good way) despite these things she's capable of warmth and mature, and like Scott is also trying to find herself (heck her changing hair color reflects that).I love the chemistry between the two it's one of those rare examples of a romance when done the right way, because it feels true to what I've been though with my significant other. Like the moment both first met in an awkward conversation, that's happened to me because what do you say to a girl you've just met, it's not like there are guidelines. The conversations they have with one another and the time they spend together, it just feels right you know both are right for one another and you want them together.Like the minor character Knives Chaou played by Ellen Wong whom is also hotter than hell and a capable actress hoping she gets more in the future. Knives is 17 (though in reality the actress is 25) she's young, full of energy, sweet, has some fire in her which we see in the final fight, a bit immature though I don't mind. The way the film handled her I could of gone either way (though on a side note I like Ramona even more but that's just me) but we know who the right one is so it makes sense who Scott chooses in the end.The villains are all colorful, just like in a \"Street Fighter\" video game each have different abilities to do serious damage. However all of them are unlikeable, their just all dirt bags with a capital D, their the kind of people that have pushed me around in my middle school, man did I hate them; all the more reason we want Scott to win.The film has multiple themes, in a way the film is a bit like a Howard Hawks film as the situation progresses Scott becomes more of a man and Ramona becomes more of a woman. For Scott it's doing things for yourself as well being more than what you are if you want things to get better, Scott's life has always been on hold because he wasn't doing what he should be doing, but once he stepped up to plate that's when life got better. Ramona it's finding what she needed as opposed to what she thinks she wants. All of her evil exes had one thing in common they didn't give her what she really needed, Scott was able to give her what she needed which is kindness, warmth, and understanding. All the more reason why he's right for her.Well that's all I have to say, Scott Pilgrim is an epic, well sort of.Rating: 4 stars",
    "148": "Every so often you come across a film with so many layers of complexity on what appears to be a simple subject you either become engaged in the drama of it all or have a headache by the end. The therapy of reversing this in Scott Pilrim Vs The World is so cathartic, refreshing and entertaining who could be left with a headache? Certainly not the cast and crew of this wonderfully original take on love in all its many guises. And certainly not the audience, either.We take the complex subject of emotional baggage and exorcise it in the simplest way we can, visually, with cues, cartoons, music, fantasy, and energy in abundance. Love wins out in the end, no matter how hard we try to stop it happening. And we are only victims if we decide to be victims. And what can be wrong about a story that is designed to be so very uplifting? Nothing.Please see this and enjoy it for what it is: sheer inspiration in education, entertainment and enlightenment. Ten out of ten."
}