{
    "0": "How can a movie resonate with the viewer, if the story builds for two hours, and ends in 10 seconds? How can a writer think that this will have an impact on the viewer?Well, the film feels and looks like a comic book. It is an simple comic book storyline, It feels kinda like a saturday morning cartoon. This is a great look if you're going for an animated movie, but for a whole picture that is demanding towards older audiences.. this is a problem. An problem which Hollywood doesn't seem to care about. Because I've seen this in almost every high-budget adventure film this year.It is always the same structure. The Hero returns and needs to save someone or defend somewhere, one that is near to him explains that he needs to get to A because at B him awaits an creature, that is much stronger than him. So he needs to get an item, or in this specific case, get an person, that could help him. AND very important to note here, is that the villain always gets teased at this part as this demonic, highly frightening creature.In the end, he's mostly just an huge piece of plastic or an huge piece of Green-Screen. Or, the worst case, he dies in merely 60 seconds after his great appearance.While this kind of storytelling overshadows what audiences REALLY want, and what potentially great writers could achieve if there would be more demand for interesting, immersive concepts and ideas in Hollywood, at least, please, try your best in writing your characters Appealing.The first Aquaman is simple, it's basic, but in it's first minutes it's already emotionally resonating and has GREAT camera-angles that psychologically just attracts someone to stay for more. The movement of the camera was immediately grabbing. And in the end, you got an work of art which is intense, epic and emotional at once, just because the filmmaking does the best out of it.So, either have a great script, or have a great filmmaker, a great sound-editor, cinematographer, composer, color-grader, visual effects artist..Filmmaking is not without reason called an art-form.",
    "1": "I was a bit confused about Atlantis being somehow still hidden. I just thought everybody knew about with Aquaman fighting for the Justice League, which BTW is nearly non-existent in this feature except for a Ben Affleck cameo. Let's just pretend DC Comics decided to have its own \"reset.\"With the help of a scientist (Randall Park) and global warming David Kane (Yahya Abdul-Mateen II) discovers the existence of another Atlantis, or at least the broken black trident of the Lost Kingdom of Necros. Holding the two pieces together Kane is given knowledge to uncover the lost technology that Atlantis had abandoned because it was destroying their world by altering the climate. (See where this is going.) Aquaman (Jason Momoa) must resque his brother (Patrick Wilson) from the Harry Potter prison of Azkaban. They then must see a pirate who looks like Jabba the Hut. The nobody hits my brother line reminded me of Beverly Hill Ninja. I am not sure why they played \"Spirit in the Sky\" for underwater scenes as if I wasn't confused enough. Aquaman does have a son in his feature who can talk to fishes. I was disappointed it never came into play.Good action. Horrible script. Waste of money.",
    "2": "Movie released on 20th December and since I am a big fan of first Aquaman movie wanted to check the sequel out given it's also from James Wan how has always given entertaining movies. Have to say despite all the negativity, to surprise I really enjoyed this movie which was simple, fun and entertaining!!! If you are looking for big action family movie then this is the movie for you!!! Plus it's a beautiful looking movie!!!!Don't expect any great story or character arc!!! That was never the case of Aquaman!!! It's a movie that looks gorgeous and delivers some epic action!!! Plus great humor!!!!",
    "3": "I went in with low expectations, and they were met. Although there were some funny bits, when my friend leaned over part way through and said, \"oh no, if he escapes, does the movie keep going?\" I laughed out loud because those were exactly my thoughts.There was a lot of creative imagery and some decent acting, but overall it was slow and boring, with an uninspired story line and bad science.I went in with low expectations, and they were met. Although there were some funny bits, when my friend leaned over part way through and said, \"oh no, if he escapes, does the movie keep going?\" I laughed out loud because those were exactly my thoughts.There was a lot of creative imagery and some decent acting, but overall it was slow and boring, with an uninspired story line and bad science.",
    "4": "Yep, this is a lot worst than the MCU movie the marvels, thank god the snyderverse is over, shame for JAMES WAN because he is really a good director, but the script is terrible. Jason Momoa is over-acting here and in times you wish him out of the movie. We saw it in 3d and the experience is even worst all because the image is to dark and you really gonna sufer the convertion to this format. Hope James Gunn can rescue this universe that we love and make it more strong on the writing choices and the cast for the best of the franchise. Dont wait for the after credit scenes, there is only one and you guess, it SUCKS!!!",
    "5": "I made this account to give this review.Surprisingly good 👍🏻👍🏻.The storyline..good\nThe jokes..good\nThe casts... actually not that bad...\nReally like it when Arthur made references about Loki and Azkaban.Good laugh 😂😂\nI don't know if Warner Bros will include this movie into DCEU.BUT not include this movie,is the wrong choice..\nAt least it gave me hope for next DC movie .And who knows that brothers who once fight for the throne,will someday stand side by side fighting the same villains...\nLike every brothers we know in TV or movie 😂😂.It's not fresh but it's TOTALLY WORTH TO WATCH.I'M BACK TO LIKING DC..",
    "6": "Aquaman blew me away in 2018 and my expectations were extremely low. I was huge fan of James Wan but I wondered how it would translate to the comic to adaptation movie world . To this day I still think it's the strongest effort of the DCEU of course not counting The Batman. This continuation of the story highlights the visual ocean of vibrant colors and outstanding performances from Momoa, Wilson, and Abdul-Mateen. The story is nearly as strong as the first and expands into more territory with much more variety and world building. Wan's keen eye for detail is unmatched. To me overall there's no way Gunn can honestly throw this portion of the DCEU away . I believe it's the fan favorite character and he will have to grow the universe for it to live on.",
    "7": "The film opens on a high and there are some fun comic moments mainly thanks to Jason Momoa's charismatic performance. It's also refreshing to have some of the story set on land away from under the sea in both snowy, desert and jungle landscapes.The female roles are underused and Nicole Kidman really doesn't have that much to do.Interesting use of some well-known songs such as Spirit in the Sky.Ultimately though this is yet another superhero versus villain CGI-fuelled movie (even though the villain this time round does have an interesting character arc).Entertaining and passes the time but nothing really to write home about.",
    "8": "I gave it a 9/10 simply cause they nerf Black Manta for movie purposes which is understandable. That being said, he was amazing whenever theres a scene involving him. From the new suit, to new abilities and all.The rest i really enjoyed and was excited all the way through. Good music, awesome scenes, and the story itself was quite easy to follow. I personally like this one more than the 1st movie.I speak not just for myself when i say i was not happy to see Amber in it, but she did her part as Mera, and did it well. The team did their best to not give her tooo much screen time, and i am glad. Thats all i have to say about that.I will definitely watch this movie again this week and in the future!My favorite DCU movie for sure.",
    "9": "It's not that good. Not that bad either. The CGI was better and great the the first one but some part I don't like about is how it's kinda lack of story from the first Aquaman. Also the movie is just \"Meh\" for me because almost every DC movie have similar type of Decorations,Powers and story. But for my opinion Aquaman 2 actions are better than Aquaman 1st. But plot and story was kinda lack. And SCI-FI theme was pretty okay\nFor me so yea overall Aquaman 2 ill gave scores 6.5 out of 10. Atleast it's slightly more enjoy than the first Aquaman movie. Also Black Manta is a lot stronger than before.",
    "10": "I gave this movie seven out of ten stars, since there isn't anyway to give it seven and a half. DCEU did a decent job with this movie compared to some of their other offerings. It doesn't get bogged down with characters a lot of unnecessary dialogue, which it also helps with the overall pace of the film. The action sequences were done very well, they fit the film perfectly. By not being really extravagant and loud, they're more subdue and work greatly within overall feel of the movie. Jason Momoa and. Patrick. Wilson give deliver good performances, the other cast members, such as Nicole Kidman. Te.muera Morrison and others also do a good job within the movie, No Oscar winners here. So have fun and enjoy .",
    "11": "Aquaman and the Lost Kingdom is an exhilarating cinematic masterpiece that exceeded all my expectations. The film brilliantly combines stunning visuals with a captivating storyline, immersing audiences in the depths of Atlantis. Jason Momoa's charismatic performance as Aquaman is truly magnetic, and the supporting cast delivers stellar performances. The underwater sequences are breathtaking, showcasing cutting-edge CGI that brings Atlantis to life. The film strikes a perfect balance between action, humor, and emotion, making it a must-see for both DC fans and general audiences. James Wan's direction is nothing short of phenomenal, creating a sequel that surpasses its predecessor in every way. Aquaman and the Lost Kingdom is a triumph in the superhero genre, earning its well-deserved 10/10 stars.",
    "12": "I honestly think it was really good, its better to understand the first film and then watch the second (in my opinion). Bringing back Orm was a half good, despite his intentions of going back to jail after Aquaman took him out and then proceeded to try and live the rest of his life on earth. I still believe Black Manta isn't dead even if the audience saw it, its just weird to think so after he survived the first one. Still, after seeing it a day earlier than the U. S I hope people who see it soon will understand it and put some past things with it too. Was hoping for at least Batman or Flash in the film, but without was still good.",
    "13": "Big fan of the superhero action movies and James Wan doesn't disappoint with this sequel. I loved the way he output the action sequences in the first one and this one's just as, if not even more artsy! The attention to detail is amazing. (Some action sequences are nowadays hard to follow as they try to pack them too much - well these are packed but somehow still able to be followed). Hard to imagine how to create a belieavable under water environment but he somehow did this and it feels like you are underwater and it was great to see the extension of the story!! Please make a 3rd!!!Jason Momoa is awesome and loved his expansion of his character - brilliant delivery with the right amount of seriousness and funny when it called for it!Loved the storyline too, interesting concept that balances well against the first movie - maintains a good deal of mystery but nicely ties with the first! Loved it.",
    "14": "Aquaman and The Lost of Kingdom suffers THE SAME problem with the first installment; it DOES NOT have a distinct identity. We were shocked to see that the major problem they had in Aquaman 1 was again manifested in this sequel. If you watch a film, you know the kind of tone and feel that a movie is giving you. But this movie feels like a jumbled medley of imitations from different kinds of films, almost like a parody. There's a 10-minute scene where you felt like this is from an Indiana Jones world, and then the next thing you know, you're stuck in the realm of Journey 2: The Mysterious Island. We can name a lot of different movies that this film takes its tone and design and pastes it into the movie. War of the Worlds, The Matrix Revolutions, Ridley Scott's Aliens and... okay, we'll stop now. The result is an endless patchwork of downgraded recreations from various movies. It felt like Aquaman had a day at Disneyland going into different kind of movie-themed rides (minus the 'fun').Adding to that, the first act felt like it was venturing into a documentary style format mixed with Ridley Scott's Alien style of exposition. Alien was a masterpiece but like we said, this is a dumpster reiteration, it was slow, it had little to no suspense, it tried to build momentum but it didn't work. They could have cut 10 minutes but they didn't. It was unnecessarily drawn out as they spent time showing the entirety of their journey into the deep unknown like this is some kind of art house film.Now, a lot are asking, is Amber Heard in it? Well, yes. Did she have many scenes? Her presence was only about 15% of the whole film. Her character, Mera did play a pivotal role for the story but James Wan, the director knew when to show her on screen. The question, 'Is her presence important on screen?' seems like what James Wan would ask himself before making the decision to put her in. She only had few dialogues but her performance was still flat.We also have a problem with how much they made use of 'space'. Especially in the first act, we saw they're a lot of wide shots used but the issue here is the space that filled in those shots; the surroundings, locations or/and environments were only there because... they were made to be there. It barely did anything to the story. But when it comes to scenes that were crowded or had various props or extras, the cameras ddin't give audience the time to breathe and process the visuals. A lot of mid to fast cuts, there wasn't much of a sense of appreciation to enjoy the visuals they have built. In the end, we felt discontented.First Aquaman at least had villains that were enjoyable to watch. This time, the villain or again, villains were just forgettable. The motivations were weak. The main villain didn't really drive the story forward. It had a backstory and conflict that were created merely for the purpose of this movie's existence. We couldn't care less because it's nowhere interesting, let alone enjoyable.And talking about that final battle... oh man. It was unbearable to the point that it turned laughable. Was it because of the reshoots that they suffered here? The whole movie, led to the final battle, it was a journey between Aquaman and his brother, only for us to find out that the villain was feeble and it gave the benefit of the plot armor for Aquaman and his weapon. It's just bad storytelling on top of bad execution overall.And the movie draggggggsssssss so much, we even questioned, 'What happened to James Wan?' From the beginning up until the climax, we were just waiting for something cool or unique to happen, but it didn't. It drags until the final battle where it should be longer but then that's when they decided to just cut things off and ended it abruptly the moment the exciting thing was about to pop up. We're confused.Amidst these flaws, one thing that truly stood out is its message on brotherhood. A beautiful message combo with good pairing, Jason Momoa and Patrick Wilson have commendable chemistry, we can see it from the way they talk to each other. There's certainly some dedication they put into establishing their relationship. It's nothing that you can remember for years but it's enough to at least carry this movie despite the many bad outcomes this movie turned out to be.Ultimately, Aquaman 2 seems tailored for a younger audience who just want to enjoy monsters and sea creatures fighting against literally anything or anyone, rather than catering to teenagers or adults seeking a compelling narrative.Verdict: Similar to its predecessor, this sequel fails to find its identity, drowning in an ocean of borrowed tones and styles from previous movies. With a shallow story, forgettable villains and inconsistent pacing, this film struggles to stay afloat. While it's a tidal wave of disappointing results, the portrayal of brotherhood between the two leads stands out as a beacon, carrying the entire movie. Overall, this final chapter from the DCEU serves as a testament we're in dire need for a total reboot of these superheroes.",
    "15": "This movie feels like the equivalent of Eminem's Revival cause my god, this movie is a dumpster fire in the worst way with poor writing, sloppy characters, and bad performances. The first Aquaman movie is absolutely ridiculous but I enjoyed it because it didn't take itself too seriously and understand what the movie was. I thought it had a fun energy and went bonkers in the best way. However, all the fun, energy and bonkers entertainment is just thrown out of the window with this sequel because this sequel is a gigantic mess.The narrative continues from the previous movie with new settings and concepts introduced and while I did like they introduced new settings that are pretty cool. Unfortunately, the writing feels really convoluted because the concepts and ideas were messy as if the writers didn't know how to put the concepts well-together. With all the reshoots and drama happening behind the scenes, I can't be surprised that the structure had fallen apart. Many of the special effects, production, make-up, and the colorful presentation are pretty rough and there are some noticeable poor CGI used but not like The Flash situation. The soundtrack is annoying and the action and thrills were just okay. Many of the cast members are doing their best but unfortunately, the performances weren't great and the dialogue was pretty bad. I honestly feel bad for Yahya Abdul-Mateen II cause he's talented and the character of Black Manta is pretty cool, but Mateen doesn't really get his chances to shine with his character.Director James Wan is talented as I enjoyed many of his works and I can see Wan is trying his best to create the sequel like the first one, but his direction was really bad as it feels sloppy and inconsistent. The sequel tries to follow the same non-serious 80s cheesy style, humor and tone from the previous movie but it doesn't work because the sequel kind of misses the point of what made the first one entertaining and ends up being pretty cringeworthy.I knew this movie wasn't going to be great and I just wanted to have dumb popcorn entertainment. Some dumb fun and laugh for the cheesiness but wow, it surprised me on how bad it was.One of the worst movies I have seen this year. Also from DC.",
    "16": "The sequel doubles down on the vapid excess of the previous film (6.5/10) and is a Spy Kids sequel with a real budget. Don´t ask me where the PG-13 comes from. Disney´s Atlantis is edgier and more mature. Basically what happened with the Shazam sequel but the step down there was more noticeable due to the prequel being a more coherent film. Most of the CG work is the one thing that can be praised but Avatar 2 this is not. What can be? The PS3 cutscene action scenes are also a bit forgettable.If you wanna see a due bro YouTuber and his too cool for school brother hang out with cartoon characters and randomly jump from one Lego Set set piece to the next this is your film. But isn´t this what mid-budget streaming films are for and not wide-release blockbusters? Can´t say I hate the film despite being a fan of Aquaman. Wan is too talented to be fully derailed by studio demands and 2 (?) rounds of reshoots but I H A T E what Wan did to Black Manta. Especially here. He turned Aquaman´s Bane into Joel Schumacher´s Bane to keep it short and he is possessed by Warcraft´s Lich King for some reason. Whedon´s Steppenwolf had more dignity and screen presence! The film also lacks stakes despite being a save-the-planet story.Rest in baby piss DCEU and no way in hell will I acknowledge that The Lost Box Office makes sense as a sequel or is in any way related to ZSJL. The 3 Snyder films, WW1 and Shazam 1 are the only DCEU entries I will ever revisit and I couldn´t be more glad that none of the many reboots worked out for WB. Who knew that catering to Funko Pop Critics and Redditors was a bad idea... The DCU too will fail if this goes on. 5/10PS: Mera is barely in the film and Heard´s lines have been cut down to nothing. All exposition and her father has more lines! It´s almost comical how transparent it is but she is in acts 1 and 3, technically. So no camp who is still on about that divorce will be happy. That´s WB for you. Making CBMs for no one unless they are set in Gotham.",
    "17": "So many aspects of this movie are a complete mixed bag:1) Half of the comedy is really funny, the other half made me roll my eyes.2) Some of the one-liners are good, some made me cringe.3) A lot of the action is so cool, a lot is a screen full of gibberish.4) There are so many beautiful shots and visuals, and also horribly cartoonish CGI like in The Flash.5) I enjoyed the musical score, but it doesn't reach the level of Black Adam's. And I wasn't a fan of using classic rock tracks for a lighter tone, something we're more likely to see in a Marvel movie.6) Half the time I was invested, the other half I was unengaged and didn't care.I had an okay time wit this movie. It benefits from IMAX with the expanded aspect ratio for the entire movie. But in the biggest IMAX around, there were a total of 8 people in my theater. DC seems to have alienated its die-hard fans.(1 viewing, opening Thursday IMAX 12/21/2023)",
    "18": "Arthur Curry is not just the King of Atlantis but also a father. He is struggling to rule his kingdom and maintain peace with the surface dwellers as his council opposes his views. David Kane with the help of a marine biologist Dr. Shin, discovers an ancient kingdom which allows him to get hold of black trident with extraordinary powers. What's in this mysterious ancient kingdom and how Arthur must reach out to his brother in order to fight back the new bigger threat and overall save the surface dwellers as well as Atlanteans, forms rest of the story.James Wan and his brigade of writers have come up with an oversimplified story filled with enough action scenes and the brothers' banter that simply is not enough to lift this film out of boredom. The film is definitely not bad but it is pretty overstuffed and extremely generic, making the 2hrs runtime feel too long. It only works in parts but the hyped visuals don't leave a mark. Much of the PG humor for the festival season is passable at best and the actors do their best to salvage this film. The villain remains weak, both of them and even the supposed evil plan doesn't evoke any sort of intrigue. I am going with a lenient rating just because the makers are aware of their product and stuck to making the best of what they can.",
    "19": "7.5/10\nI love the first Aquaman when i first watch it in the theaters, and i recently watch it for the second time and unfortunately i have more criticism in my second watch and thought that it was just an ok superhero movie, Aquaman And The Lost Kingdom however, the sequel of the film was pretty good overall, still not without it flaws, but i felt more engaged in this one a bit more, mostly because we already know about Aquaman and now his new family, and what happen to his half-brother Orm, his new but also past villain Black Manta is back and i also felt more threat from him than Orm in the first movie, my only big major problem was the pacing of the movie, even though it shorter i feel like they should put more exciting and threatening scene and less of a slow scene that are important but they could make it shorter, i thought all the performances was fine, and the best thing of the film was simply the chemistry between Jason Momoa and Patrick Wilson as their character in this movie, it's a pretty fun love hate relationship, exciting at times, and emotional too which is something that i don't really get that powerful in the first movie, i enjoy the first 30 minutes of the film then it's getting pretty slow in the middle with some things happen here and there, and then the last 45 minutes i started to getting into it again, while the last battle was not as amazing as the first one, it's still pretty great, not forget to mention about the visual and special effects both the first and in this one was always stunning, so overall Aquaman And The Lost Kingdom was flawed but still pretty good, i do like it better than the first one in a way, and having a pretty good superhero movie these days was getting rarer and rarer so i'm glad to actually getting an enjoyment from it.",
    "20": "This sequel adapts the more buddy comedy formula. Now Jason and Patrick were fine as a pair but every single buddy one liner joke attempted ended as a big failure. I can give the benefit of the doubt and say \"writers' strike\" but I'm sure a lot of this was improv and I'm afraid it just didn't work. The idea was a good one just not well executed. I can't help but feel like there's no possibility of a sequel so not enough heart was put into this. The pacing was heavily affected by the obvious reshoots which for me was edited poorly. WB needed to man up and either just remove she who shall not be named or just fully include her. You can see she had a bigger role to play in all this and a lot of her content got cut. It really messed with the flow. The action we loved. The decision to have this possessed Black Manta who's able to go toe to toe with Aquaman made for a good story line and excellent fighting scenes. Story wise predictable and pretty boring. The one good thing for me was the redemption arc for Orm. We got to traverse a different side to his villainous past. I personally will miss this version of Arthur Curry. I'm not sure it can ever be matched. I was looking forward to exploring the numerous kingdoms we were introduced to but hey, over to you Mr Gunn. To be honest I wouldn't bother with any DCEU films at this point. The production teams can't be bothered so not sure why we should, well you should... I mean I'm gona watch them, so you don't have to... you're welcome.",
    "21": "Aquaman returns to our screens in this follow up to his solidly enjoyable 2018 solo movie, and for the most part this sequel follows its predecessor in delivering a decently fun and entertaining movie.In a world of convoluted multi-verses and overly tiresome connected characters, there's a pleasing simplicity to this story that is appealing and engaging. It follows Aquaman as he faces a familiar foe to protect his Kingdom. It's certainly nothing groundbreaking or overly original within the superhero genre, but it's a solid plot nonetheless.Recycling a villain in only the second movie for this character could be seen as a little lazy. I'm no Aquaman super fan so I've no idea what his rogues gallery is like, but there was surely potential to have a bit more fun with this. In any case, the return of a familiar character removes the need for any excessive exposition and ensures the story moves along at a good pace.Speaking of characters, the cast list is pretty thin and there isn't much in the way of new blood in this film. You'd think this would give the script a chance to really develop these existing characters more, but that doesn't really happen. Perhaps another missed opportunity here.The action throughout is fine if nothing special. The effects are a mixed bag but are sometimes quite impressive. In addition, aside from some awkward humour that doesn't really work, the tone and feel of the film is quite good.Ultimately if you enjoy the superhero genre this film will give you a good time. It doesn't really push the boat out or take too many risks, but at the same time it feels like a superhero film from years gone by in that it is contained and simple in a refreshing way.",
    "22": "The DC Comics universe that began with Man Of Steel ends with this sequel to Aquaman that offers a fantastic and amazing adventure with Jason Momoa. This actor never ceases to amaze with his charismatic and tough character who must deal with his task as king of Atlantis until Black Manta returns. Making a sequel to the film released in 2018 was necessary to continue Black Manta's revenge story. This antagonist manages to have the participation that he needed in this universe. Yahya Abdul-Mateen II is a nearly unknown actor, but his performance as Black Manta is the best of his early career. The return of Orm Marius, played by Patrick Wilson, was obvious because of how essential he has become since the first film. Nereus, played by Dolph Lundgren, has more interpretation and as for Mera, it is not strange that he no longer has as much relevance as in the first film after the affair with Amber Heard. Too bad that didn't allow Mera to have participated more as Aquaman's right-hand woman. The film offers excellent action scenes and the digital effects have a whole series of fascinating moments. In some ways, the film is strongly inspired by works by Jules Verne, H. G. Wells and H. P. Lovecraft. The machinery used by Black Manta's henchmen has a steampunk style that is reminiscent of The War Of The Worlds and 20,000 Leagues Under the Sea. Even the costumes of Black Manta and his henchmen also have an air of Verne's works. The island where they hide and their creatures are clearly inspired by The Mysterious Island. The sea creatures or monstrosities of The Lost Kingdom have an air that resembles Lovecraft's mythology, probably being influenced by Call Of Cthulu, Dagon or The Shadow Over Innsmouth. The black trident, its power and the visions it provokes also have a Lovecraftian feel that could perhaps be something out of The Dunwich Horror. All these details make this film a wonderful adventure and fantasy story, just like the works it was inspired by. It has a good soundtrack by Rupert Gregson-Williams, with the Black Manta moments being the best of the entire score. Aquaman And The Lost Kingdom is one of the best films in the DC universe and it is a shame that it is the final chapter of this universe, because it undoubtedly shows that there is more potential in this franchise that could have been exploited. My final rating for this movie is a 10/10.",
    "23": "Aquaman and the Lost Kingdom is a direct sequel to the 2018 film with a lot of actors returning to play their roles, except for Willem Dafoe as Vulko, he's missed in the film but Nicole Kidman's bigger role as Atlanna is much appreciated. James Wan is back directing and producing, also co-writing the story with the help of Jason Momoa along with Thomas Pa'a Sibbett and David Leslie Johnson-McGoldrick, the latter of them having written the screenplay for both films now. James Wan is also working with Rupert Gregson-Williams who did the score for the previous film, but also cinematographer Don Burgess. The cinematography was spectacular in the previous film, a reason along with Wan's vision and the top notch visual effects used. This is a film I've looked forward to for many years now, right after hearing the word of a sequel, so how did it hold up if you compare it to Aquaman (2018). Pretty good actually, yet, not as great. Aquaman was a superhero film I look back on fondly, staying true to its source material and just being entertaining. The underwater sequences looks great and the action is great underneath the water, I really liked the visual effects, but at times the characters looked too CGI. The people who work with the visual effects are overworking themselves, but they succeeded with this film I think, the extra time and money was needed.Aquaman balances his duties as king and as a member of the Justice League, all while planning a wedding. Black Manta is on the hunt for Atlantean tech to help rebuild his armor. Orm plots to escape his Atlantean prison.I think it was a great story and it was the right choice to make the film into a \"buddy cop\" movie with Arthur and Orm, having these brothers, these enemies, bond throughout the movie felt just right. Momoa and Wilson had some great chemistry together, selling the buddy cop brilliantly. The focus is almost entirely on them, leaving the other characters with not much to do, then again you could ask yourself if it needed to be a large ensemble. I believe this worked for the best. Having them work together to beat Black Manta, the rightful villain of the movie, it just shows that Arthur and Orm is more similar than they thought they were.A part of me were disappointed with the lack of scenes with Mera, a great character in the comics, but she got a couple of great action sequences. The film is about family and she has a part to play in the theme with being the wife to Arthur and the mother to Junior, not much else and almost no dialogue. Is it because of the controversy regarding her? Most likely, for good reason. The character \"Mera\" should have been recast. Back to the duo, Orm gets a redemption arc and was given the best writing of the characters. Patrick Wilson plays him brilliantly, both dramatically and the more action heavy sequences, he succeeds in both. Although I really liked the passion Jason Momoa has for the role, I just feel he's a bit dumbed down and trying to be too funny. Similar to Thor in the two new films. I like Jason Momoa though, he has made this character his own. The story about Black Manta wanting revenge and seeking out the Lost Kingdom which is worth not reading about, I went in not knowing as much (because of me not reading anything it's based on or just reading wiki) and it was the best I could have done, the mystery is quite fascinating and when they get deeper and deeper into the Lost Kingdom, the better the film gets. I would say the first half was kind of mixed for me, then during the second half, I absolutely loved the film and found myself entertained and fully immersed. It's when everything is coming full circle, Black Manta holds his own against the two Atlantians and is in the focus of most of the action sequences I could say is good. Choreography, effects and acting. They were great, meanwhile all the filler scenes was action for no reason other than having action. Black Manta along with Orm, had the best character arcs in the film, Yahya Abdul-Mateen II were once again terrific. What about the comedy in the film, there's much more of it in this film and whilst I feel the tone is like the later Thor films, I think it works for the most time but I didn't laugh as much as they wanted me to. The jokes were often badly written, which I can give a pass because of the dialogue between the characters was mostly good. The Brine King is once again a surprising highlight, this time being both bad ass and the comedic relief which worked every time.The film stars Jason Momoa as Arthur Curry / Aquaman alongside Patrick Wilson as Orm Marius, Amber Heard as Mera, Yahya Abdul-Mateen II as David Kane / Black Manta, Nicole Kidman as Atlanna, Dolph Lundgren as Nereus, Randall Park as Dr. Stephen Shin and Temuera Morrison as Tom Curry. I went into the acting a bit before, Patrick Wilson and Yahya Abdul-Mateen II is the highlights here, giving their A game with strong performances, selling everything. Jason Momoa is just a delight, but he could have given a better execution on the dramatic side, the question is if James Wan directed him that way. This is an Aquaman who feels comfortable in his shoes, being both from land and sea. That says a lot about his character and Jason Momoa does a great job capturing that. Randall Park gave an underrated performance which is worthy to praise.The sound editing and mixing was quite great, the same quality I believe as the previous film. The musical score was fantastic. Watching another Aquaman film at the cinema, the big screen and surround sound, it's just an unforgettable experience. There are things to criticize as Aquaman and the Lost Kingdom is far from a perfect movie, yet, does it need to be this perfect and flawless film? Not really, it has a grand scale and builds on the world and characters from the previous film, thus giving us an entertaining adventure with plenty of action sequences you'll like. James Wan is a great director and he shows it once again here, even making fun of something which bothered me in the previous film, the constant interruption explosions. Most of the times, he does let the characters just interact which is needed for the brothers' arcs. I hope James Wan gets to direct something else at DC, he's talented and has shown it in two completely different genres now. If you did enjoy the previous film, I'm sure you're going to like Aquaman and the Lost Kingdom, it doesn't have as great of a story but still worth to invest your time in. Jason Momoa will forever be my Aquaman.",
    "24": "I went in with not that many expectations, I knew the first one was great but I also knew this was like a leftover for the DCEU and the last one. And I felt that.The movie itself felt so rushed and undone, the CGI of underwater scenes were so low compared to the first one and the fighting scenes and choreography were so short and unfulfilled. They went in & out on the biggest missions so fast and easily like it didn't even bother them.One of the biggest parts about a superhero movie it it's villains and they are so important and lately they tempted to forget about that even in this one, they really did the \"main\" villain so dirty.Mainly the humor was actually good and I had a good couple of laughs with it but that didn't so the rest justice.",
    "25": "\"Save the BEST for last\" as the last movie to watch this 2023...With the films that DC gave us this year, all I can say is that all of them are on an average 5/10 or maybe even lower and it felt like they really can't pull off good movies again until this sequel of Aquaman proves that there are still good superhero films out there.The story follows the life of Arthur Curry after being helmed as the new king of Asgard, I mean Atlantis. His life as a father is also part of the plot with his family on his side and is a direct sequel to the first Aquaman film. The plot thickens when Black Manta and Jimmy Woo, I mean Dr Shin found the lost city of Necrus. With his plans to avenge his father and the powers of the black Trident, the Black Manta is set to destroy Aquaman and everything he holds dear.This time, Arthur is being aided by his brother Orm. I must say that their brotherly duo was the MVP of this film. Mera was sidelined but everything feels good. The film has the right amount of balancing the humor, action, drama and overall has a good story.If you enjoyed the first film, you'll enjoy this more. Watch it in IMAX for a better experience. The movie felt like Thor/Loki and at the same time Black Panther but this film is loads better than the last Thor film.So if you think superhero films are all bad these days, this film might just restore your faith. Sadly, this probably would be the last time we see Jason Momoa as Aquaman.Aquaman The Lost Kingdom is a 9/10 for me#AquamanAndTheLostKingdomAtSMCinema #AquamanAndTheLostKingdom #aquamanmovie.",
    "26": "As the final film in the DC Extended Universe (DCEU), Aquaman and the Lost Kingdom brings a decade-long history of this superhero film universe to a close. However, unlike many previous DCEU films which took themselves too seriously, Aquaman 2 has none of the melancholy of a changing of the guard. Instead, it doubles down on being louder, brighter and more fun - a sincere comedy buddy film directed by James Wan following Hollywood sequel formulas aiming to do what previous DCEU films failed at - being purely entertaining.Many years have passed in Aquaman and the Lost Kingdom. Arthur Curry is now husband and father to a new baby. But as King of Atlantis, he bears greater responsibilities. Meanwhile, his arch-nemesis David Kane, still hellbent on avenging his father's death at Arthur's hands, has unexpectedly discovered the legendary Lost Kingdom of Atlantis and gained access to ancient Atlantean super-technology like a mystical black trident. Now far more powerful, Kane pushes Arthur to his limits, forcing him to seek help from another former ruler - Orm, Arthur's banished half-brother, who may be willing to aid the Aquaman once more.As the final DCEU film, Aquaman 2 doesn't need to lay groundwork for future films or introduce other DC characters. This purity of focus keeps the story centered around Arthur and his family - wife Mera (Amber Heard returns), father Tom Curry, Atlantis' queen and Orm. Only a new baby is added to the clan, not making Arthur a struggling new dad but further cementing his lovable buffoonish image.Audiences love Jason Momoa's charmingly dopey Aquaman and this sequel delivers more of that. Arthur is even goofier, kinder and joke-loving here. Though a global crisis emerges, it's hard to see heaviness weighing Arthur down as he happily tackles dangers, experiencing brief sadness only when loved ones are hurt before continuing to unworriedly pummel baddies with no ulterior motives. \"With great power comes great responsibility\" doesn't apply to Aquaman - he acts on instinct without overthinking. This makes Aquaman 2 one of the most joyous superhero films in recent memory, choosing fun and silliness over depth.Wan amps up everything - effects, stunts and action are grander, wilder and more stimulating. What began as elaborate single-take shots in the first film evolves into even more complex choreography. Fights pit Aquaman against giant robots, high seas vehicle chases and zombie hordes. Black Manta becomes a far greater threat, sometimes besting Aquaman in battle.In a move akin to manga where yesterday's villain becomes today's friend, Orm transforms from the dour foe of the first film into an endearing partner, his strict nature loosening under Aquaman's irreverent influence. With Patrick Wilson a close friend, Wan has seemingly washed away Orm's prequel sourness.Ultimately, the best way to view Aquaman 2 is with no expectations. Forgetting DCEU disappointments and departures allows the film's intended entertainment to shine through unfettered. It's a buddy comedy that embraces silliness over grit, a radical tonal shift for the typically serious DCEU. For a purely fun and spectacular two-hour experience, Aquaman 2 delivers on its sole responsibility. Whether audiences embrace this approach remains to be seen in this new politically correct era where judgment stems as much from extended universe perception as singular works. But for those just wanting thrilling escapism, it succeeds as a hearty comic book romp.",
    "27": "This the best DC movie in the recent times. It has all the entertainment elements director james wan comes up with a heartfelt tale story between the brothers and Aquatic family. Firstly, Kudos to the visuals effects crew for showcasing the breathtaking stunning visuals of under water Worlds throughout the whole film. The runtime is perfect and it's a fast paced action,drama film. And now coming to the cinematography, in particular, each and every frame of the movie is mind blowing beautifully shot and brilliantly executed. Moreover, The Screenplay is racy while, the editing is slick and Background score was good mixed with Dolby Atoms.Each and every actor performed exceptionally well mainly our aqua man and his brother ocean master did a fabulous act. Amber head and nicole Kidman roles were smaller but given did justice to their role. Yahya Abdul Maureen did a solid job with his character David Kane.The only negative aspect is that James Wan chose\nto concentrate more on the action scenes in the movie than on developing the plot within the Atlantis setting.I personally recommend you all to watch it in IMAX 3D to feel the immersive experience of the Atlantis worlds and enjoy the movie."
}